{"offset":0,"number":50,"available":283,"news":[{"id":341971884,"title":"Trump promised to be a ‘peacemaker’ president. He launched nearly as many airstrikes in five months as Biden did in four years","text":"In his inaugural address, Donald Trump said his “proudest legacy” as president will be that of a “peacemaker.”\n\n“Our power will stop all wars and bring a new spirit of unity to a world that has been angry, violent and totally unpredictable,” the president said in his remarks on January 20.\n\nBut six months later, Trump has already launched nearly as many airstrikes on foreign nations as Joe Biden did within four years, with analysts asking whether the president’s plan to end so-called “forever wars” involves overwhelming firepower to stop them from happening in the first place.\n\nSince Trump returned to the White House, the United States has carried out at least 529 bombings in more than 240 locations in Africa, the Middle East and Central Asia, according to Armed Conflict Location & Event Data (ACLED), an international data collection nonprofit. His predecessor’s administration launched 555.\n\n“Trump’s preference for engagement begs the question: Does this contradict his promise to end America’s wars — or are the foreign strikes how he wishes to keep that promise?” ACLED president Clionadh Raleigh said in a statement. “The recent airstrikes on Iran’s nuclear sites have been framed as a major turning point in U.S. foreign policy. But if you take a step back, they don’t stand out — they fit.”\n\nDonald Trump’s administration has carried out more than 500 bombings since taking office in January (REUTERS)\n\n“All of President Trump’s decisive actions have been overwhelmingly popular and resulted in greater peace,” White House deputy press secretary Anna Kelly said in a statement to The Independent.\n\n“Operation Midnight Hammer successfully obliterated Iran’s nuclear capabilities, and [the Department of Defense’s] successful strikes against ISIS and other malign groups killed terrorists want to do harm to Americans,” she added.\n\n“Anyone who sympathizes with evil terrorists and wants them to live should look inward,” she said.\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen in an effort to stop their attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza.\n\nThe administration struck Yemen at least 474 times within three months, ACLED found. The Biden administration launched 294 attacks in Yemen within roughly 12 months.\n\nTrump’s airstrikes in Yemen have reportedly killed as many civilians within the eight-week bombing campaign as in the previous two decades of U.S. attacks targeting militants in the country, according to nonprofit watchdog Airwars. At least 224 civilians were killed during the campaign between March and May, compared to 258 deaths between 2002 and 2024, that report found.\n\nThe administration also launched 44 airstrikes in Somalia to target Islamic State operatives, according to ACLED.\n\nTrump first ordered the airstrikes in February, marking the first attacks in the African nation in his second term.\n\n“The U.S. military is moving faster, hitting harder, and doing so with fewer constraints,” according to Raleigh. “Syria, Iraq, Afghanistan, Yemen, Somalia, and now Iran are all familiar terrain, but this isn’t about geography — it’s about frequency.”\n\nTargeted airstrikes don’t appear to be a last-resort measure under the Trump administration but “the first move,” Raleigh added.\n\n“While Trump has repeatedly promised to end America’s ‘forever wars,’ he has rarely elaborated on how,” Raleigh said. “These early months suggest the plan may be to use overwhelming firepower to end fights before they begin, or before they drag on.”\n\nThroughout his campaign, the president accused Biden and, later, his Democratic rival Kamala Harris of leading the United States into World War III. “These are wars that will never end with him,” Trump said of Biden during a presidential debate in June 2024. “We’re closer to World War III than anybody can imagine.”\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen (pictured) in an effort to stop attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza (Houthi Media Center via Getty Images)\n\nReceiving the endorsement of now-intelligence director Tulsi Gabbard last year, Trump said the pair was “uniting forces to end the endless foreign wars.”\n\n“I am confident that his first task will be to do the work to walk us back from the brink of war,” Gabbard said at the time. “We cannot be prosperous unless we are at peace.”\n\nTrump — vocal about his desire for a Nobel Peace Prize, and nominated for the honor by at least four of his allies — also promised his administration would bring an end to Russia’s war in Ukraine and Israel’s war in Gaza.\n\nOn Monday, the president laid out prospective steps to pressure Russia to end its war, including sending more weapons to Ukraine and threatening economic sanctions in Moscow if there is no peace agreement within 50 days.\n\n“I felt we had a deal about four times,” Trump said. “But it just kept going on and on.”\n\nHis administration has also failed to broker a ceasefire in Gaza as Palestinians face threats of famine and Israeli airstrikes continue to bombard the strip. A tentative Trump-backed plan to force hundreds of thousands of Palestinian civilians into an area controlled by Israel’s military close to the Gaza-Egypt border has also threatened to derail ceasefire talks.\n\nThe Independent has requested comment Department of Defense.","url":"https://uk.news.yahoo.com/trump-promised-peacemaker-president-launched-000130595.html","image":"https://media.zenfs.com/en/the_independent_577/0125c567338d26791034ba92c7282780","video":"","publish_date":"2025-07-16 00:01:30","author":"Alex Woodward And Alicja Hagopian","authors":["Alex Woodward And Alicja Hagopian"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.231},{"id":341961896,"title":"Trump promised to be a ‘peacemaker’ president. He launched nearly as many airstrikes in five months as Biden did in four years","text":"In his inaugural address, Donald Trump said his “proudest legacy” as president will be that of a “peacemaker.”\n\n“Our power will stop all wars and bring a new spirit of unity to a world that has been angry, violent and totally unpredictable,” the president said in his remarks on January 20.\n\nBut six months later, Trump has already launched nearly as many airstrikes on foreign nations as Joe Biden did within four years, with analysts asking whether the president’s plan to end so-called “forever wars” involves overwhelming firepower to stop them from happening in the first place.\n\nSince Trump returned to the White House, the United States has carried out at least 529 bombings in more than 240 locations in Africa, the Middle East and Central Asia, according to Armed Conflict Location & Event Data (ACLED), an international data collection nonprofit. His predecessor’s administration launched 555.\n\n“Trump’s preference for engagement begs the question: Does this contradict his promise to end America’s wars — or are the foreign strikes how he wishes to keep that promise?” ACLED president Clionadh Raleigh said in a statement. “The recent airstrikes on Iran’s nuclear sites have been framed as a major turning point in U.S. foreign policy. But if you take a step back, they don’t stand out — they fit.”\n\n“All of President Trump’s decisive actions have been overwhelmingly popular and resulted in greater peace,” White House deputy press secretary Anna Kelly said in a statement to The Independent.\n\n“Operation Midnight Hammer successfully obliterated Iran’s nuclear capabilities, and [the Department of Defense’s] successful strikes against ISIS and other malign groups killed terrorists want to do harm to Americans,” she added.\n\n“Anyone who sympathizes with evil terrorists and wants them to live should look inward,” she said.\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen in an effort to stop their attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza.\n\nThe administration struck Yemen at least 474 times within three months, ACLED found. The Biden administration launched 294 attacks in Yemen within roughly 12 months.\n\nTrump’s airstrikes in Yemen have reportedly killed as many civilians within the eight-week bombing campaign as in the previous two decades of U.S. attacks targeting militants in the country, according to nonprofit watchdog Airwars. At least 224 civilians were killed during the campaign between March and May, compared to 258 deaths between 2002 and 2024, that report found.\n\nThe administration also launched 44 airstrikes in Somalia to target Islamic State operatives, according to ACLED. \n\nTrump first ordered the airstrikes in February, marking the first attacks in the African nation in his second term.\n\n“The U.S. military is moving faster, hitting harder, and doing so with fewer constraints,” according to Raleigh. “Syria, Iraq, Afghanistan, Yemen, Somalia, and now Iran are all familiar terrain, but this isn’t about geography — it’s about frequency.”\n\nTargeted airstrikes don’t appear to be a last-resort measure under the Trump administration but “the first move,” Raleigh added.\n\n“While Trump has repeatedly promised to end America’s ‘forever wars,’ he has rarely elaborated on how,” Raleigh said. “These early months suggest the plan may be to use overwhelming firepower to end fights before they begin, or before they drag on.”\n\nThroughout his campaign, the president accused Biden and, later, his Democratic rival Kamala Harris of leading the United States into World War III. “These are wars that will never end with him,” Trump said of Biden during a presidential debate in June 2024. “We’re closer to World War III than anybody can imagine.”\n\nReceiving the endorsement of now-intelligence director Tulsi Gabbard last year, Trump said the pair was “uniting forces to end the endless foreign wars.”\n\n“I am confident that his first task will be to do the work to walk us back from the brink of war,” Gabbard said at the time. “We cannot be prosperous unless we are at peace.”\n\nTrump — vocal about his desire for a Nobel Peace Prize, and nominated for the honor by at least four of his allies — also promised his administration would bring an end to Russia’s war in Ukraine and Israel’s war in Gaza.\n\nOn Monday, the president laid out prospective steps to pressure Russia to end its war, including sending more weapons to Ukraine and threatening economic sanctions in Moscow if there is no peace agreement within 50 days.\n\n“I felt we had a deal about four times,” Trump said. “But it just kept going on and on.”\n\nHis administration has also failed to broker a ceasefire in Gaza as Palestinians face threats of famine and Israeli airstrikes continue to bombard the strip. A tentative Trump-backed plan to force hundreds of thousands of Palestinian civilians into an area controlled by Israel’s military close to the Gaza-Egypt border has also threatened to derail ceasefire talks.\n\nThe Independent has requested comment Department of Defense.","summary":"The administration has carried out more than 500 bombings so far, according to analysis from data watchdog","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-airstrikes-bombs-iran-how-many-b2789626.html","image":"https://static.independent.co.uk/2025/07/15/19/03/U-S--President-Trump-holds-a-cabinet-meeting-at-the-White-House-in-Washington-t27j87rp.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/u5TFQoPQ-OhrQWqOm.mp4","publish_date":"2025-07-16 00:01:30","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.209},{"id":341972010,"title":"'Big Fat Bribe': Stephen Colbert Takes on His Employer Over '60 Minutes' Legal Settlement With Trump — Despite 'Axe Dangling' Over His Job","text":"Stephen Colbert has slammed his network's parent company for giving a \"big fat bribe\" to President Donald Trump despite a pending merger threatening his job, RadarOnline.com can reveal. \n\nOn Monday, July 14, the late-night host didn't hold back as he focused his opening monologue on Paramount's $16million settlement with Trump after he alleged 60 Minutes unfairly edited their 2024 interview with then-presidential nominee Kamala Harris.'I'm Offended'Colbert came out swinging as he declared: \"As someone who has always been a proud employee of this network, I'm offended, and I don't know if anything will ever repair my trust in this company.\"\n\nHe then lightened the mood by joking: \"But just taking a stab at it, I'd say $16million would help.\" \n\nBut the funnyman wasn't ready to drop the subject just yet, and continued to call out CBS' parent company.The comedian continued: \"Paramount knows they could have easily fault it because in their own words, the lawsuit was completely meritless.\n\n\"Unlike the payoffs from ABC and Twitter, Paramount's settlement did not include an apology. Instead, the corporation released a statement where they said, 'You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16million.'\"\n\nHe added: \"I believe this kind of complicated financial settlement with a sitting government official has a technical name in legal circles: it's Big Fat Bribe.\"Colbert explained the timing issue surrounding the settlement: \"This all comes as Paramount's owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance.\" \n\nHe also quoted a report, saying: \"Once Skydance gets CBS, the new owner's desire to please Trump could 'put pressure on late night host and frequent Trump critic Stephen Colbert.'\"\n\nColbert quipped, \"Okay. But how are they going to put pressure on Stephen Colbert if they can’t find him?\" as he pointed to his new mustache.As RadarOnline.com reported, the merger could put Colbert's talk show as well as Jon Stewart's The Daily Show at risk, considering their outspoken criticism of Trump and his administration. \n\nCritics raised concerns over what the precedent the settlement could set for networks during the Trump administration, while others speculated about Skydance CEO David Ellison striking a \"side deal\" with the president. \n\nTrump fueled speculation when he gushed about Ellison after the settlement, saying: \"We did a deal for about $16million plus $16million, or maybe more than that, in advertising... It's like 32 to maybe $35million.\"The \"advertising\" in question referenced reporting from Fox Business’ Charlie Gasparino on Ellison's alleged private agreement to run PSAs supporting Trump-backed causes.\n\nTrump additionally praised Ellison's billionaire father, Larry, who founded Oracle, saying he \"thinks he's going to run CBS really well\" before noting his son is \"a fantastic young man.\"","summary":"The late-night host took at swing at his parent company despite his job being at risk with the pending Skydance merger.","url":"https://radaronline.com/p/stephen-colbert-slams-paramount-settlement-donald-trump/","image":"https://media.radaronline.com/brand-img/jvb0WGO5X/0x0/stephen-colbert-brands-paramounts-settlement-with-trump-a-big-fat-bribe-1-1752619183044.png","video":null,"publish_date":"2025-07-16 00:00:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.257},{"id":341962216,"title":"Joe Rogan condemns people ‘cheering’ for Trump’s pre-election legal battles","text":"Trump became the first former president to receive a criminal conviction when he was convicted of 34 felony counts in May 2024, which Rogan said people were “cheering” on.\n\n“He’s a convicted felon! Hey, they can do that to you! Do you understand that? If they can do that to a former president, a former f***ing president who’s rich as s***, they can do that to him, they can do that to you too! You can’t cheer this on! This is insane!” Rogan said on the Ultimate Human Podcast with Gary Brecka.\n\nRogan also mentioned how the July 2024 assassination attempt changed his opinion about interviewing Trump. He added that it is “insane” how very little is still known about the attempt on Trump’s life or the shooter, Thomas Matthew Crooks.\n\nBeyond these factors, Rogan criticized how the media interviewed Trump, saying the candidate was never treated “like a human being.” He also condemned the media for taking Trump “out of context,” calling this “gross” and “anti-American.”\n\n“It was just un-American to me. It’s just like, you’re subverting democracy. You’re killing the whole thing, and you’re doing it with deep state money,” Rogan said.\n\nRogan’s interview with Trump, uploaded on Oct. 25, garnered 59.5 million views on YouTube. The two discussed the biggest mistakes made during Trump’s first administration, the candidate’s assassination attempt, and extraterrestrial life. \n\nRogan also sought to interview former Vice President Kamala Harris, Trump’s opponent in the 2024 election, but was unable to agree to her prerequisites. In February, Rogan said he intended to release his interviews with Trump and Harris on the same day, and wanted both interviews conducted in his studio.","summary":"Podcast host Joe Rogan said “a bunch of things” led to changing his stance against interviewing President Donald Trump, including the various legal battles Trump faced.  In 2022, Rogan said he&#8217;d never have Trump on The Joe Rogan Experience, noting that he was “not interested in helping him.” However, he welcomed Trump on the show less [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3472110/joe-rogan-condemns-people-cheering-for-trumps-pre-election-legal-battles/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/Joe-Rogan-Trump-interview-media.webp","video":null,"publish_date":"2025-07-15 23:10:04","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.282},{"id":341947570,"title":"Gen Z Content Creator Deja Foxx Could Become One Of The Youngest Members Of Congress","text":"A popular social media influencer is seen as a contender in Tuesday’s Democratic primary for the special election to replace an Arizona congressman who died in office in March—which could make her one of the youngest members of Congress and the first of a new generation of content creators running for office to succeed.\n\nDeja Foxx, a 25-year-old political content creator, is a contender for an Arizona congressional ... More seat.\nVariety via Getty Images\n\nDeja Foxx, a 25-year-old political content creator who has over 395,000 followers on TikTok, is running for Democratic nomination in Arizona’s 7th District after only turning the minimum age to serve in Congress in April.\n\nFifty-four-year-old former Pima County Supervisor Adelita Grijalva, the daughter of the late Rep. Raul Grijalva, was widely seen as the frontrunner in the race to replace her father, but recent internal polling from Foxx’s campaign first published by Politico suggests the race is much closer—Foxx was only eight points behind Grijalva in polling done in May.\n\nFoxx was one of the youngest campaign staffers on Kamala Harris’ first presidential campaign in 2020, and has continued to produce political content on liberal issues.\n\nFoxx was also chosen as one of Forbes’ 30 Under 30 in media for her work on social media campaigns for companies including Prada and Nike, as well as her political work.\n\nKey Background\n\nRep. Raúl Grijalva, D-Ariz., a 22-year veteran of Congress, died in March from complications from his cancer treatment, leaving a key seat open in a swing state Trump won with 52% of the vote in 2024. Arizona’s 7th district is heavily Democratic leaning, according to the Cook Political Report, meaning whoever wins Tuesday’s primary will be a heavy favorite in the Sept. 23 general election. Republicans only hold a slim majority in the House and are keen to pick up any available seats.\n\nFoxx is also one of the candidates endorsed by Leaders We Deserve, the political organization founded by former Democratic National Committee vice chair David Hogg with the intention of winning primary elections against sitting Democrats “unwilling or unable to meet the moment and are asleep at the wheel.” Hogg, another Gen Z political activist who rose to prominence after surviving the Parkland shooting in 2018, raised as much as $20 million for these primary campaigns, The New York Times reported in April. The organization also endorsed Zohran Mamdani, who came from behind to win the Democratic primary in the New York City mayoral election against former Gov. Andrew Cuomo last month. Mamdani was behind in the polls before defeating the former governor and Democratic Party mainstay by 12 points. Hogg left his DNC position after clashing with leadership over his primary efforts, and said he would not run for reelection after an internal committee voided his prior election to vice chair in June.\n\nHow Different Are Foxx And Grijalva?\n\nHogg’s PAC is dedicated to “electing young progressives,” but both Foxx and Grijalva are vying for progressive support in the primary campaign. Raul Grijalva was a member of the Congressional Progressive Caucus and reliable supporter for liberal causes in the House. Adelita Grijalva has sought to portray herself similarly, and the candidates’ policy positions are similar. Both Foxx and Grijalva have extensive policy platforms dedicated to opposing President Donald Trump’s domestic agenda, expanding affordable housing and fighting for environmental justice and tribal sovereignty. Foxx’s campaign also points to support for other popular left-wing causes, including Medicare for All. But Grijalva has also racked up endorsements from major progressive organizations and leaders, including Sen. Bernie Sanders, I-Vt., and Rep. Alexandria Ocasio-Cortez, D-N.Y., as well as both of Arizona’s sitting Democratic senators, Sen. Mark Kelly and Sen. Ruben Gallego. Foxx has centered her criticism on establishment Democrats circling the wagons for establishment candidates, noting that three senior Democratic members of Congress died within the first six months of Trump’s second term, handing Republicans a larger advantage.\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Deja Foxx, a 25-year-old political content creator, is a contender for an Arizona congressional seat.","url":"https://www.forbes.com/sites/zacharyfolk/2025/07/15/gen-z-content-creator-deja-foxx-could-become-one-the-youngest-members-of-congress/","image":"https://imageio.forbes.com/specials-images/imageserve/6876d1418b732bc288a880da/0x0.jpg?format=jpg&crop=3692,2077,x0,y347,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-15 22:08:37","author":"Forbes Staff,Zachary Folk","authors":["Forbes Staff","Zachary Folk"],"language":"en","source_country":"US","sentiment":0.238},{"id":341946602,"title":"Federal grand jury indicts ‘Minny Maniac’ accused of killing former Minnesota House Speaker Melissa Hortman","text":"A federal grand jury indicted a man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\n“This political assassination, the likes of which have never occurred here in the state of Minnesota, has shook our state at a foundational level,” acting U.S. Attorney Joseph Thompson said.\n\nHe said a decision on whether to seek the death penalty “will not come for several months” and will be up to U.S. Attorney General Pam Bondi. Minnesota abolished its state death penalty in 1911, but President Donald Trump’s administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nProsecutors initially charged Boelter with the same counts. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nBoelter’s federal defender, Manny Atwal, did not immediately return messages seeking comment on the indictment and the new allegations.\n\nPolitical extremism as a motive\n\nThompson also disclosed new details at a news conference. He said investigators had found a handwritten letter by Boelter addressed to FBI Director Kash Patel in which he confessed to the shootings and made bizarre claims.\n\n“In the letter, Vance Boelter claims that he had been trained by the U.S. military off the books and he had conducted missions on behalf of the U.S. military in Asia, the Middle East and Africa,” Thompson said.\n\nBoelter also said in the letter that Minnesota Gov. Tim Walz had approached him about killing the state’s two U.S. senators, fellow Democrats Amy Klobuchar and Tina Smith.\n\nAsked by a reporter if all that was a fantasy, Thompson replied: “Yes, I agree.”\n\n“There is little evidence showing why he turned to political violence and extremism,” Thompson said. “What he left were lists: politicians in Minnesota, lists of politicians in other states, lists of names of attorneys at national law firms.”\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail’s messaging system.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nOther details of the case\n\nProsecutors say Boelter, 57, who has lived in rural Sibley County south of Minneapolis, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn’t home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans’ home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nRemembering the victims\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The indictment handed up lists murder, stalking and firearms charges against Vance Boelter.","url":"https://nypost.com/2025/07/15/us-news/federal-grand-jury-indicts-vance-boelter-accused-of-killing-former-minnesota-house-speaker-melissa-hortman/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/2025-via-social-media-ramsey-108210075.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/vvbiPHaC-RyIcpnTz.mp4","publish_date":"2025-07-15 22:07:23","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.328},{"id":341940954,"title":"Comedian podcaster says he's breaking free from Trump 'cult' after massive betrayal","text":"Podcaster and comedian Andrew Schulz unleashed a viral rant against President Donald Trump for failing to release the 'list' of financier and convicted pedophile Jeffery Epstein's clients. \n\nSchulz and his co-host Akaash Singh kicked off their Flagrant podcast on Tuesday discussing the big scandal of the week: the administration's handling of the Epstein files.\n\nThey compared their own experiences dealing with critics calling them 'idiots' and 'bad Americans' online and Trump's MAGA haters coming for him about his 'failed' Epstein promises.\n\nEarlier in the week, Schulz and his crew wore tin-foil hats on their show as they criticized the president's failure to keep his promises to release the Epstein list, get out of foreign wars and cut spending. \n\nTrump recently bombed Iran's nuclear sites and also got his signature big, beautiful bill passed which is estimated to add $3.4 trillion to the national deficit. \n\n'I voted for none of this. He is doing the exact opposite of everything I voted for. I want him to stop wars, he's funding them. I want him to shrink spending, reduce the budget, he's increasing it,' Schulz said. \n\nThe comedian had hosted Trump on his podcast in October in the weeks leading to the election despite backlash at the time.\n\nBut now he's admitting he's disappointed by Trump's actions in his second term. \n\n'I wanted something different. I was hoping for some sort of change,' he said, but he then defied anyone who tried to recruit them in their political camp. \n\n'I just want to let you all right now, I'm in neither one of your f**king cults if you want me to be in your cults you can go f**k all, I'm not a Dem cult, I'm not a Republican cult, I'm a free American I'll make my own f**king decisions, and I'll say what ever the f**k I want about whatever president is in power,' Schulz said.\n\nDuring the campaign, Schulz and his podcast crew went viral for their hilarious interview with Trump as he detailed how he used 'the weave' to respond to questions and revealed how he came up with snappy nicknames for his opponents.\n\nThe pair of hosts mocked Democratic critics who accused them of helping the president win simply by sitting down with him for an interview during the campaign and 'humanizing' him. \n\n 'You just wanna take no accountability for the fact that you ran a dead guy and a woman that couldn't speak,' Schulz said, referring to former President Joe Biden and former vice president Kamala Harris respectively. \n\nBoth hosts reminded their audience they were not surprised that a politician appeared on their show and did not keep his promises.\n\nSchulz said he wanted Trump to do three things, stop the endless wars, stop government spending into oblivion, and to release the Epstein files.\n\n'If Trump did one of the things, yeah. We would've been happy,' he said. 'Unfortunately the only one he chose was the immigration one, the one we were not that enthusiastic about.'\n\nWhen they spoke with Trump during the campaign about their distaste for his promise to deport all illegal immigrants, Trump famously promised them he would start with criminals.\n\nSchulz said he did not regret his vote for Trump, but was disappointed with the results.\n\n'Yeah. So he's done nothing on those fronts in terms of the promises he made us. But I don't regret it at all,' he said. 'I don't even regret voting for him at all. Because what you see is all these Democrats that are starting to take up the issues that he was the one campaigning on.'\n\nThe hosts noted that the White House responded to Schulz by name in a statement to Fox News, and trumpeted their newfound influence.\n\n'Andrew Schulz knows life is far better in President Trump’s America than it would have been under a weak and incompetent President Harris. As a guest on the Flagrant podcast, millions of listeners heard the President lay out his vision for America, and many voted in support of it—that’s exactly what President Trump is successfully executing. Name the issue, and the President is solving it. From the border to Biden’s inflation to fostering world peace—the results speak for themselves,' White House spokesman Harrison Fields told Fox News Digital last week.\n\n'It was the dumbest thing that the White House has ever done. I just wanna point that out, never respond to us,' Schulz joked.\n\nThey joked that in the future, they would demand a statement from the White House every time they had something critical to say about Trump.\n\n'Listen, something we say now, we expect an immediate response from the White House. Yeah. A precedent has been set. If we talk about the White House, they fu**ing respond,' Schulz laughed.\n\nSchulz welcomed former Obama White House aides Tommy Vietor and Jon Favreau from the podcast Pod Save America on the show to talk about politics, indicating it was more important than ever to talk to the other side of the political aisle.\n\nThey also welcomed Democrat Rep. Ro Khanna on the show to talk about his proposed Congressional amendment that would release all of the redacted Epstein files. \n\nSchulz said he would continue to criticize political figures and say what he thought when it came to politics. \n\n'When people fail us and fail us on the promises that they make, we should criticize them. Like what is the alternative? We just vote and then agree with every single thing that person does?' he asked. 'You know, so it's like, and you should hold the elected officials accountable. And we live in this like weird time where any measure to hold them accountable comes with immediate criticism.","summary":"Podcaster and comedian Andrew Schultz responded to the online reaction on Tuesday after he unleashed a viral rant against President Donald Trump.","url":"https://www.dailymail.co.uk/news/article-14908873/comedian-podcaster-andrew-schulz-white-house-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/07/15/21/100341767-0-image-a-7_1752609962674.jpg","video":null,"publish_date":"2025-07-15 21:48:47","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.214},{"id":341944284,"title":"Minnesota lawmaker shooter could face death penalty after federal grand jury indictment","text":"A Minnesota man was indicted by a federal grand jury on charges that he fatally shot former Democratic House Speaker Melissa Hortman and her husband, Mark. \n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter after the deaths of Hortman, a prominent Minnesota state representative, and her husband. He also seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe federal murder counts could carry the death penalty.\n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter in a complaint with six counts, including murder, stalking and firearms offenses. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn't home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans' home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.” \n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail's messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney's office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.” \n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The indictment handed up lists murder, stalking and firearms charges against Vance Boelter","url":"https://www.independent.co.uk/news/world/americas/melissa-hortman-shooter-vance-boelter-b2789682.html","image":"https://static.independent.co.uk/2025/06/24/14/Minnesota_Lawmakers_Shot_51905.jpg?width=1200","video":null,"publish_date":"2025-07-15 21:23:22","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.302},{"id":341940692,"title":"Minnesota lawmaker shooter could face death penalty after federal grand jury indictment","text":"A Minnesota man was indicted by a federal grand jury on charges that he fatally shot former Democratic House Speaker Melissa Hortman and her husband, Mark.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter after the deaths of Hortman, a prominent Minnesota state representative, and her husband. He also seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe federal murder counts could carry the death penalty.\n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter in a complaint with six counts, including murder, stalking and firearms offenses. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nVance Boelter was indicted by a federal grand jury on murder charges - and could face the death penalty. (Hennepin County Sheriff's Office)\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn't home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans' home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nMark and Melissa Hortman were shot in their home around 3:30 a.m. (© 2025 Star Tribune)\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail's messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney's office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","url":"https://uk.news.yahoo.com/minnesota-lawmaker-shooter-could-face-212322922.html","image":"https://media.zenfs.com/en/the_independent_577/16642d6ff45c916f3f45854dd8f5397d","video":null,"publish_date":"2025-07-15 21:23:22","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.28},{"id":341936054,"title":"Rosie O’Donnell says she ‘expected’ Trump to threaten her citizenship after ‘20 years of abuse’","text":"Rosie O’Donnell said she wasn’t surprised that President Trump threatened to revoke her US citizenship, claiming that she’s endured “20 years of abuse” from her longtime foe.\n\nThe former talk show host took to social media Tuesday to slam the “absurd” attack after the president triggered a social media brawl with O’Donnell when he branded her a “threat to humanity” in a fiery post on his platform.\n\n“I’m safe here in Ireland. I’m out of the reach of the tangerine Mussolini,” the former talk show host said in a nearly 10-minute TikTok video addressing her longstanding feud with Trump.\n\n“I have to say that I was expecting him to do something as absurd as he did for a few reasons. Number one, I read Project 2025. Number two, I’ve had 20 years of abuse from him so I knew it wasn’t going to stop, and number three, I know myself well enough to know that I wasn’t going to shut up.”\n\nO’Donnell, 63, moved overseas to the Dublin suburb of Howth with her 12-year-old non-binary child in January in response to Trump’s victory against Kamala Harris in the 2024 presidential election.\n\nShe called the move a “necessity” to protect her family, saying her “heart couldn’t take the pain” of what Trump was planning – or what he has already done.\n\nBut the actress, who was born on Long Island, remains unfazed by the president’s warning shot. \n\n“Can’t take away someone’s citizenship, they have to renounce it themselves in the constitution, so, you know, I’m not that worried,” the “A League of Their Own” star remarked.\n\n“However, the Supreme Court has given him unbridled powers and I believe his dementia forces him to think that he is actually a king. We don’t have kings in America. That’s why we started America, not wanting to have kings, no monarchy. Liberty and justice for all, for all people in the United States.”\n\nUnder current law, Americans cannot lose their US citizenship status even if they obtain citizenship elsewhere. \n\nOn Saturday, the commander in chief raged on Truth Social that he’s giving “serious consideration” to taking away the former TV personality’s citizenship. \n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great County, I am giving serious consideration to taking away her Citizenship,” Trump wrote.\n\n“She is a Threat to Humanity, and should remain in the wonderful Country of Ireland, if they want her. GOD BLESS AMERICA!”\n\nThe actress quickly fired back with a flurry of Instagram posts ripping Trump as “dangerous old soulless man” who craves “loyalty” and picturing him with notorious pedophile Jeffrey Epstein. \n\nWhile it remains unclear what legal grounds Trump could invoke to strip O’Donnell of her citizenship, she claimed the prez was clearly “rattled,” as she was still living “rent free” in his “collapsing brain” nearly two decades after their infamous feud erupted in 2006.\n\nIn her latest post, the activist made it clear she has no intention of ever renouncing her citizenship. \n\n“I will never renounce my American citizenship,” she said. \n\n“I am waiting happily for my Irish citizenship so that I can be a dual citizen, but I will never renounce my American citizenship, ever.”","summary":"Rosie O'Donnell said she wasn't surprised that President Trump threatened to revoke her US citizenship, claiming that she's endured \"20 years of abuse\" from her longtime foe.","url":"https://nypost.com/2025/07/15/us-news/rosie-odonnell-says-she-expected-trump-to-threaten-her-citizenship-after-20-years-of-abuse/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/108206988.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/vvbiPHaC-RyIcpnTz.mp4","publish_date":"2025-07-15 21:14:27","author":"Anna Young","authors":["Anna Young"],"language":"en","category":"politics","source_country":"us","sentiment":0.038},{"id":341938900,"title":"Charlie Kirk says 'Woodstock in reverse' phenomenon is sweeping America as young people embrace conservatism","text":"A conservative wave washing over Gen Z is bringing about the \"greatest generational realignment\" in decades, Turning Point USA founder Charlie Kirk said Tuesday. \"What we are seeing right now is like Woodstock in reverse. It is the greatest cultural and political realignment we've seen in over 50 years,\" he told \"The Faulkner Focus.\" His comments came days after a crowd of thousands packed into Florida's Tampa Convention Center for TPUSA's annual Student Action Summit, an event featuring top right-wing speakers that is designed to motivate young students to defend conservative values. ZOHRAN MAMDANI'S 'FREE' PROMISES ARE TOO GOOD TO BE TRUE, YOUNG CONSERVATIVES WARN According to Kirk, the crowd of 7,000 people at this year's event was among the largest in the organization's history, signaling a notable uptick in conservative values among Gen Z students. \"Students from all across the country decided to spend their summer break to be trained, to be educated, be fired up, all about saving the United States of America, and it goes to show that this movement that President Trump has started is only getting bigger. It has more energy, more enthusiasm, and it's strengthening,\" he added. GEN Z'ERS IDENTIFYING AS LIBERAL DROPS 12 POINTS SINCE 2016, ACCORDING TO MORNING CONSULT JUNE REPORT Gen Z has been credited with aiding in President Donald Trump's victory over former Vice President Kamala Harris in the 2024 election, with many influencers, voters and political commentators from the age group voicing their support at the time. Kirk lauded members of the age group – particularly 18-27 – as \"patriotic,\" \"cheerful\" and full of a willingness to fight for the country. The multi-day conservative conference featured remarks by co-founder Charlie Kirk, Fox News' Greg Gutfeld, Defense Secretary Pete Hegseth, border czar Tom Homan and Donald Trump Jr., among other conservative leaders. CLICK HERE TO GET THE FOX NEWS APP Fox News' Dierdre Harvey and Matt Leach contributed to this report.","summary":"Charlie Kirk claims a conservative wave among Gen Z represents the &apos;greatest generational realignment&apos; in decades, with 7,000 students attending TPUSA&apos;s Student Action Summit in Florida.","url":"https://www.foxnews.com/media/charlie-kirk-says-woodstock-reverse-phenomenon-rapidly-transforming-americas-youth","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/charlie-kirk-tpusa.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 21:00:05","author":"Taylor Penley","authors":["Taylor Penley"],"language":"en","source_country":"us","sentiment":0.354},{"id":341958520,"title":"Brooklyn Park DFLers launch campaigns to fill seat left vacant after former Speaker Melissa Hortman’s killing ","text":"A Hennepin County prosecutor and former Brooklyn Park City Council member are among those planning to run for the late Rep. Melissa Hortman’s Minnesota House seat as DFLers. \n\nErickson Saye, who in the past worked for Gov. Tim Walz’s office, announced his campaign for Minnesota House District 34B Tuesday morning. And Xp Lee, who served on the Brooklyn Park council from 2022 to 2024 and now works as a health equity strategist at the Minnesota Department of Health, announced his campaign on Monday.\n\nThe seat has been vacant since Hortman’s killing a little over a month ago. Hortman’s career in the House spanned 20 years, and she represented District 34B from 2023 up until her death. Vance Boelter, the man suspected of killing Hortman and her husband, faces multiple state and federal charges that include murder and stalking. He is also accused of shooting state Sen. John Hoffman and his wife, both of whom survived the attacks.\n\nRelated: Colleagues remember Brooklyn Park lawmaker Melissa Hortman, assassinated at age 55\n\nWalz last week ordered a special election in the district, which covers parts of Hennepin and Anoka counties. Hopeful candidates have between Tuesday and 5 p.m. on July 22 to file for the seat. \n\nThe primary will take place on Aug. 12 with a general election on Sep. 16. In 2024, both Hortman and Democratic Vice President Kamala Harris earned more than 60% of the vote in the district.\n\nBesides being a prosecutor and working on civic engagement for the Walz administration, Saye’s experience in public service includes managing field operations for the DFL in the northwest suburbs. He said his Brooklyn Park community encouraged him to run for the state House. “It means everything. It’s something that I hold very dear and I appreciate so much being asked by my community,” Saye said in an interview with MinnPost. He said his experience supporting Walz and other state leaders will allow him to work across the aisle to represent Brooklyn Park. If elected, Saye plans to focus on proactive programming for youth and accessible, safe housing. \n\nLee’s experience besides time on the Brooklyn Park City Council includes working as Brooklyn Park Planning Commissioner in 2021. According to a Monday press release, Lee is running to promote community and coalition building. If elected he plans to prioritize accessible and affordable health care, higher educational achievement in K-12 schools, the “tech-onomy,” clean energy, and environmental justice. Lee has received endorsements from Brooklyn Park City Council member Amanda Xiong, state Reps. Samantha Vang and Fue Lee and former state Rep. Hodan Hassan.\n\nBoth candidates have expressed their desire to honor Hortman’s legacy in filling the seat. In a conversation with MinnPost, Saye said, “It’s with a heavy heart, deep emotions, and deep sadness.” He remembers Hortman as a role model in youth involvement. Lee was unavailable for comment by phone, but in Monday’s press release, he said, “Melissa Hortman wasn’t just a powerful voice at the Capitol – she was our Neighbor.”","summary":"Candidates have until July 22 to file for office in the special election for House District 34B.\n\n\nThe post Brooklyn Park DFLers launch campaigns to fill seat left vacant after former Speaker Melissa Hortman&#8217;s killing  appeared first on MinnPost.","url":"https://www.minnpost.com/state-government/2025/07/brooklyn-park-dflers-launch-campaigns-to-fill-seat-left-vacant-after-former-speaker-melissa-hortmans-killing/","image":"https://www.minnpost.com/wp-content/uploads/2025/07/DFLers.jpg","video":null,"publish_date":"2025-07-15 20:57:18","author":"Kabedi Mutamba","authors":["Kabedi Mutamba"],"language":"en","source_country":"us","sentiment":0.367},{"id":341936194,"title":"Trump's Approval Rating With Hispanics Surges, New Poll Shows","text":"President Donald Trump's approval rating with Hispanics is surging, a new poll from The Economist and YouGov shows Tuesday.Why It MattersHispanic voters have long served as a crucial and growing demographic in national elections, traditionally supporting Democratic candidates. According to Pew Research Center, 61 percent of Hispanic voters supported former President Joe Biden in 2020. The group has historically favored Democratic candidates, with 71 percent backing Barack Obama in 2012 and 66 percent supporting Hillary Clinton in 2016, according to Pew Research Center, citing exit polls.However, in the 2024 election, the Democratic margin narrowed significantly: 51 percent supported Democrat Kamala Harris, while 48 percent supported Donald Trump, marking a historic high for a Republican candidate in modern times, Pew Research Center reports.When Trump returned to the White House in January, he coasted in with high approval figures. But the president saw his numbers dip after months marked by economic strife and criticism over other policies like the president's handling of immigration and his recently passed tax bill.The up-and-down nature of approval polls can paint a picture of the landscape heading into the 2026 elections, where Democrats hope to regain control of the House and the Senate.What To KnowIn the poll, the president's approval rating with Hispanics is 35 percent. The survey was conducted from July 11 to July 14 among 1680 U.S. adult citizens. The poll's margin of error is 3.4 percent.Trump's overall approval rating in the survey is 41 percent versus a 55 percent disapproval rating.The week prior, the president's approval rating with Hispanics was 26 percent, a difference of 9 percent compared to Tuesday's number. That poll was taken from July 4 to July 7 among 1528 U.S. adult citizens. The margin of error was 4 percent.Trump's overall approval rating in the survey is 42 percent versus a 53 percent disapproval rating.The president's approval rating with Hispanics in June and July peaked at 38 percent in a poll taken from May 30 to June 2.Week over week, Trump's approval rating with men shrank 5 percent, and grew 3 percent with women and millennials.What People Are SayingColumbia University Political Science Professor Robert Y. Shapiro told Newsweek via email Tuesday: \"If this is larger increase than for other groups it is hard to evaluate. Approval ratings increase when there is more good news than bad news reported about presidents. I can only speculate that this increase was a cumulative effect of the good news about Iran bombing of nuclear facilities. This was the best news that Trump has received of late; next might be the last jobs report.\"What Happens NextAs the 2026 midterms near, both parties are likely to intensify their outreach to Hispanic voters—a demographic whose support may prove decisive in key battleground districts.Ongoing polling will clarify whether Trump's uptick in Hispanic approval sustains or reverses, especially if economic and immigration concerns persist among this group.","summary":"Hispanic voters have long served as a crucial and growing demographic in national elections, traditionally supporting Democratic candidates.","url":"https://www.newsweek.com/trump-approval-rating-hispanics-surge-poll-2099419","image":"https://d.newsweek.com/en/full/2683870/donald-trump.jpg","video":null,"publish_date":"2025-07-15 20:55:01","author":"Anna Commander","authors":["Anna Commander"],"language":"en","source_country":"US","sentiment":-0.194},{"id":341937014,"title":"Colorado’s Roger Hutson tried to keep Trump from a second term. But six months in, he’s ‘very impressed.’ (Opinion)","text":"DENVER — Roger Hutson was never a huge fan of Donald Trump.\n\nIn 2016, he supported Marco Rubio for president, helping raise hundreds of thousands of dollars for his Republican primary bid.\n\nIn 2024, Hutson worked with “No Labels,” a group of Democrats, Republicans and independents, to forge a bipartisan ticket with the express purpose of keeping either Trump or Joe Biden from winning the White House.\n\nIs this “really the best we can do in a country of 330 million people?” Hutson asked in a Denver Post opinion piece after the effort collapsed and another Trump-Biden matchup seemed inevitable. The failure, he suggested, was “a sad commentary on the status of leadership in America.”\n\nBut something unexpected happened over the last six months. Trump won Hutson over.\n\nHe’s not gone full-fledged MAGA. “No, no, no!” he insisted, scoffing at the notion of driving down the street, Trump flag waving. And he’s not about to jump on JD Vance’s political bandwagon, the likeliest vehicle for extending Trumpism in 2028 and beyond.\n\n“I’m acknowledging the accomplishments of the man in the office,” Hutson said, with emphasis on the White House’s current occupant, whom he supported over Kamala Harris. “I’m very impressed.”\n\nIt’s not, as one might suppose, because the Denver oil and gas executive is enamored of Trump’s exhortations to “Drill, baby, drill! (“No, baby, no!” is more like it, as Hutson believes oversupply would drive prices down.)\n\nRather, Hutson credits Trump with achieving a good deal of what he promised during the 2024 campaign.\n\nSecuring America’s borders. Forcing U.S. allies to cough up more for defense. Bringing Iran’s nuclear program to heel. Taking on the country’s unfair trade partners.\n\nHe still doesn’t much care for Trump’s abrasive personality, the name-calling and denigrating of people.\n\nBut Hutson’s conversion shows that in a country deeply dug into oppositional camps, where political views appear cement-hardened into place, there are still those open to persuasion and even willing to change their minds.\n\nAs confounding as that might seem.\n\nHutson, 65, was a Republican his whole life, until leaving the party sometime in the 2010s. Or, more precisely, he felt “the party left me.”\n\nA growing stridency around abortion and same-sex marriage was particularly off-putting to Hutson, who describes himself as a conservative on fiscal issues and a live-and-let-live type on social matters. “If you’re lucky enough in life to find somebody you love,” he said, “God bless.”\n\nHutson has long been active in civic and political affairs, serving on various boards and commissions under Democrats and Republicans alike. He recalled attending a meeting some years ago when GOP leaders gathered to discuss Colorado’s increasingly blue coloration.\n\n“If winning means nominating an African American lesbian with antennae coming out of her head,” then Republicans should do so, Hutson suggested.\n\nThat didn’t go over well.\n\nBut it fit Hutson’s approach to politics.\n\nHe grew up an Army brat, moving around the world until his father completed his military career and settled in Golden, Colo., to take a job at a family lumber business. For all the impermanence — packing up and relocating just about every two years — Hutson said his upbringing was in many ways ideal, shaping his outlook to this day.\n\nThe military, he said, reflects the best of America: unity, shared purpose, teamwork. “I think it teaches you a lot of tolerance,” he said. “I think it teaches you a lot of acceptance.”\n\nHis GOP pedigree came from his father, the Army colonel. But it wasn’t the scorched-earth version of today’s Republican Party, in which Democrats and their philosophy are regarded as the root of all evil.\n\nLong ago, as leader of the Jefferson County Republican Men’s Club, Hutson invited Colorado’s governor, Democrat Roy Romer, to speak.\n\n“I was catching such hell from people. ‘How dare you invite a Democrat to speak to this group?’ ” Hutson remembered being chastised. “And I said, ‘Well, he’s our governor, isn’t he? I think it’d be an honor.’ “\n\nAfter some initial puzzlement from the governor’s office — are you sure? — Romer came and spoke, holding just the kind of cross-party conversation that Hutson wishes occurred more often among politicians in worlds-apart Washington.\n\n“I’d love for Trump to have a weekly meeting with [Democratic House leader] Hakeem Jeffries,” Hutson said as he sat high above downtown Denver, his office decor — dark leather, rugged mountain landscape, a display of amber liquids — suggesting a Western cigar bar theme.\n\n“I would love for Trump to sit down weekly with [Chuck] Schumer” — the Democratic Senate leader — or bring Schumer and the GOP Senate leader, John Thune, together and say, ” ‘How do we work our way through this?’ “\n\nCould you imagine that, Hutson asked, before answering his own question.\n\nNope. Never gonna happen.\n\nNothing, and no individual, is perfect. But Hutson looks to the bottom line, and he’s willing to accept trade-offs.\n\nTrump is loud and uncouth. But he’s respected on the world stage, Hutson said, in a way the shuffling Biden was not.\n\nTrump may be toying with tariffs — up, down, all around. But at least he’s addressing the country’s one-sided trade relationships in a way, Hutson said, no president has before.\n\nHe may be off base calling for a drastic ramp-up of domestic oil production. But in general, Hutson said, Trump’s welcoming message to business is, “What can we do to be more helpful?”\n\nIt’s unfortunate that innocents are being swept up in mass immigration raids. But maybe that wouldn’t have happened, Hutson said, if local officials had been more cooperative and criminal elements weren’t allowed to insinuate themselves so deeply into their communities in the first place.\n\nBesides, he said, haven’t Democrats and Republicans both said a secure border and tougher enforcement is needed before comprehensively overhauling the nation’s fouled-up immigration system?\n\n“We need to bring in the workers we need,” Hutson said. “I mean, if somebody’s coming here to work and be a meaningful part of society, God bless, man.”\n\nNot perfect. But, all in all, a better and stronger presidential performance, Hutson suggested, than many with their blind hatred of Trump can see, or are willing to acknowledge.\n\n“I’ve got to look at the results,” Hutson said, “and despite his caustic attitude and behavior, I think he’s done a really, really good job.”\n\nWhen Barack Obama was elected president, Hutson recalled, one of his Democratic friends, a Black man, said to him, ” ‘Roger, you’ve got a Black president.’ And I said, ‘You know, Kevin, you’re right. And he’s my president, just like he’s your president.\n\n” ‘We don’t have to agree on everything but, by God, he’s the president of the United States and we respect that office.’ “\n\nHutson paused. His eyes narrowed, disapprovingly. “We’ve lost that,” he said.\n\nMark Z. Barabak is a political columnist for the Los Angeles Times, focusing on California and the West. ©2025 Los Angeles Times. Visit at latimes.com. Distributed by Tribune Content Agency, LLC.\n\nSign up for Sound Off to get a weekly roundup of our columns, editorials and more. \n\nTo send a letter to the editor about this article, submit online or check out our guidelines for how to submit by email or mail.","summary":"Roger Hutson was never a huge fan of Donald Trump. In 2016, he supported Marco Rubio for president, helping raise hundreds of thousands of dollars for his Republican primary bid. In 2024, Hutson worked with \"No Labels,\" a group of Democrats, Republicans and independents, to forge a bipartisan ticket with the express purpose of keeping either Trump or Joe Biden from winning.","url":"https://www.denverpost.com/2025/07/15/mark-z-barabak-he-tried-to-keep-trump-from-a-second-term-but-six-months-in-im-very-impressed-2/","image":"https://www.denverpost.com/wp-content/uploads/2025/07/202507130500MCT_____PHOTO____OPED-BARABAK-COLUMN-LA_8357fa.jpg?w=150&strip=all","video":null,"publish_date":"2025-07-15 20:47:18","author":"Mark Z. Barabak,Megan Schrader","authors":["Mark Z. Barabak","Megan Schrader"],"language":"en","source_country":"us","sentiment":0.073},{"id":341931962,"title":"Paramount Comics, Colbert, and Stewart Offer Sharp Critiques of the ’60 Minutes’ Agreement","text":"NEW YORK – This isn’t a joke. They’ve made that clear.\n\nCBS “Late Show” presenter Stephen Colbert criticized Paramount Global, the channel’s parent company, for resolving a lawsuit filed by former President Donald Trump regarding a “60 Minutes” segment. Colbert described the settlement as a “big fat bribe” during his return episode after a break.\n\nColbert’s comments came after “The Daily Show” host Jon Stewart had previously criticized the same agreement a week earlier. Stewart is employed by Comedy Central, another entity under the Paramount umbrella. This makes both Colbert and Stewart prominent internal critics of the $16 million settlement revealed on July 1.\n\nThe term “bribe” used by Colbert alluded to the ongoing sale of Paramount to Skydance Media, which requires approval from the Trump administration. Opponents of the settlement concluded that resolving Trump’s lawsuit, related to the network’s editing of an interview with Democratic presidential hopeful Kamala Harris last fall, was mainly to facilitate the sale process.\n\n“I am offended,” Colbert said in his monologue Monday night. “I don’t know if anything — anything — will repair my trust in this company. But, just taking a stab at it, I’d say $16 million would help.”\n\nHe said the technical name in legal circles for the deal was “big fat bribe.”\n\nJon Stewart terms it ‘shameful’\n\nStewart began discussing the “shameful settlement” on his show a week earlier when he was “interrupted” by a fake Arby’s ad on the screen. “That’s why it was so wrong,” he said upon his “return.”\n\nHe discussed the deal in greater detail with the show’s guest, retired “60 Minutes” correspondent Steve Kroft, making his views clear through a series of leading questions.\n\n“I would assume internally, this is devastating to the people who work in a place that pride themselves on contextual, good journalism?” Stewart asked.\n\n“Devastating is a good word,” Kroft replied.\n\nA handful of media reports in the past two weeks have speculated that Skydance boss David Ellison might try to curry favor with Trump by eliminating the comics’ jobs if the sale is approved. A representative for Ellison did not immediately return a message for comment on Tuesday.\n\nIt would be easier to get rid of Stewart, since he works one night a week at a network that no longer produces much original content. Colbert is the ratings leader in late-night broadcast television, however, and is a relentless Trump critic.\n\nThe antipathy is mutual. Trump called Colbert “a complete and total loser” in a Truth Social post last fall, suggesting CBS was wasting its money on him. “HE IS VERY BORING,” Trump wrote.\n\nColbert slips in a quip\n\nColbert alluded to reports about his job security in his monologue, pointing to the mustache he grew during his vacation. “OK, OK, but how are they going to put pressure on Stephen Colbert, if they can’t find him?” he joked.\n\nColbert and Stewart both earned Emmy nominations this week for outstanding talk series. Together with ABC’s Jimmy Kimmel, all three nominees are tough on Trump.\n\nCBS News journalists have largely been quiet publicly since the settlement’s announcement. Two top executives, CBS News CEO Wendy McMahon and “60 Minutes” executive producer Bill Owens, both quit or were forced out prior to the settlement for making their dissatisfaction about the idea known internally.\n\nReporting about the settlement on the day it was announced, “CBS Evening News” anchor John Dickerson said viewers would have to decide on their own what it meant to them.\n\n“Can you hold power to account after paying it millions?” Dickerson asked. “Can an audience trust you when it thinks you’ve traded away that trust? The audience will decide that. Our job is to show up to honor what we witness on behalf of the people.”\n\nDavid Bauder writes about the intersection of media and entertainment for the AP. Follow him at and https://bsky.app/profile/dbauder.bsky.social.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – This isn&#8217;t a joke. They&#8217;ve made that clear. CBS&#8230;\n\n\nThis Post: Paramount Comics, Colbert, and Stewart Offer Sharp Critiques of the &#8217;60 Minutes&#8217; Agreement first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/paramount-comics-colbert-and-stewart-offer-sharp-critiques-of-the-60-minutes-agreement/","image":"https://internewscast.com/wp-content/uploads/2025/07/The-Paramount-comics-Colbert-and-Stewart-are-sharp-critics-of.jpg","video":null,"publish_date":"2025-07-15 20:35:22","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.553},{"id":341930166,"title":"Federal grand jury indicts man accused of killing former Minnesota House Speaker Melissa Hortman","text":"A federal grand jury indicted a man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.The indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.The chief federal prosecutor for Minnesota has called the killings a political assassination.Prosecutors initially charged Boelter with the same counts. But under federal court rules they needed a grand jury indictment to take the case to trial.IN CASE YOU MISSED IT | Wounded Minnesota state senator released from hospital ICU following shootingProsecutors say Boelter, 57, who has lived in rural Sibley County south of Minneapolis, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.Prosecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn't home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans' home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.Brooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.Law enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.Sen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.Friends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”ADDITIONAL REPORTING | Wisconsin Sen. Tammy Baldwin and other lawmakers were on lists compiled by Minnesota shooting suspectIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail's messaging system.It ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney's office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.Boelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.Biden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”Hortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"A federal grand jury has indicted the man accused of fatally shooting a prominent Minnesota state representative and her husband and seriously wounding a state senator and his wife.","url":"https://www.scrippsnews.com/us-news/crime/federal-grand-jury-indicts-man-accused-of-killing-former-minnesota-house-speaker-melissa-hortman","image":"https://ewscripps.brightspotcdn.com/dims4/default/edb08e7/2147483647/strip/true/crop/1024x538+0+159/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F7d%2F0a%2F158cefe145379490a838abf3eca8%2Fap25179561923360.jpg","video":null,"publish_date":"2025-07-15 20:33:02","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":341928448,"title":"Federal grand jury indicts Vance Boelter, accused of killing former Minn. House Speaker Melissa Hortman","text":"MINNEAPOLIS (AP) — A federal grand jury indicted a man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\nActing U.S. Attorney Joseph Thompson called the killings a political assassination.\n\nHe said a decision on whether to seek the death penalty “will not come for several months” and will be up to U.S. Attorney General Pam Bondi. Minnesota abolished its state death penalty in 1911, but President Donald Trump’s administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nProsecutors initially charged Boelter with the same counts. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, who has lived in rural Sibley County south of Minneapolis, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn’t home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans’ home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail’s messaging system.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\n\nThe post Federal grand jury indicts Vance Boelter, accused of killing former Minn. House Speaker Melissa Hortman appeared first on Boston.com.","url":"https://www.boston.com/news/crime/2025/07/15/federal-grand-jury-indicts-vance-boelter-accused-of-killing-former-minn-house-speaker-melissa-hortman/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/07/Minnesota_Lawmakers_Shot_23360-68660487d02f9-768x432.jpg","video":null,"publish_date":"2025-07-15 20:29:43","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.26},{"id":341931938,"title":"What Trump knows about ‘Superman’ — that Hollywood can’t comprehend","text":"The new “Superman” movie isn’t an attack on President Donald Trump’s immigration policies, but it reveals how alienated from America many liberals, in Hollywood and politics alike, now feel.\n\nEvery kid used to know Superman fights for “truth, justice and the American way.”\n\nThat slogan has been around since the “Superman” radio show of the early 1940s, and featured in the 1978 film starring Christopher Reeve that inaugurated the modern comic-book movie blockbuster.\n\nJames Gunn, director of the Man of Steel’s latest flick, has his own take.\n\n“‘Superman’ is the story of America,” he told The Times of London. “An immigrant that came from other places and populated the country, but for me it is mostly a story that says basic human kindness is a value and is something we have lost.”\n\nConservatives feared this hinted Gunn’s film would pit the hero from Krypton against Trump’s immigration crackdown.\n\nIt turns out the bigger problem is the rest of what Gunn said: His Superman is a man from nowhere whose creed is simple sentimentality, not “the American way.”\n\nIn Gunn’s film, America is nothing special. Neither, for that matter, is Superman.\n\nThis bland and demoralizing vision isn’t just the director’s, however; it’s rather all too typical of liberals today.\n\nGunn declared on Twitter during Trump’s first term, “We’re in a national crisis with an incompetent president forging a full-blown attack on facts and journalism in the style of Hitler and Putin.”\n\nPerhaps it’s good he directs comic-book movies when his politics are at such a stereotypical comic-book level. He might as well have likened Trump to Superman’s archenemy Lex Luthor.\n\nIn the movie, he does, up to a point.\n\nLuthor colludes with Russia — sorry, “Boravia” — and runs a social-media troll farm dedicated to smearing Superman, who gets sent to a super-Gitmo when the US government authorizes Luthor to take the hero into custody.\n\nThat’s about the extent of the parallels between Luthor and Trump — or George W. Bush, however.\n\nDespite the villain’s constant references to Superman as an alien, immigration isn’t a theme of the movie.\n\nIndeed, assimilation is more of a theme than immigration is — but assimilation into what?\n\nThe young Superman is sent from the dying planet Krypton in a rocket that crashes in Kansas, where this powerful alien is brought up with good Midwestern values.\n\nThat’s where his devotion to “the American way” comes from.\n\nLast year Minnesota Gov. Tim Walz, as Kamala Harris’s running mate, demonstrated just how hard it is for today’s liberals to sound authentically zealous about Midwestern values.\n\nThe new motive portrays Superman’s adoptive parents, Jonathan and Martha Kent, as ludicrously folksy stereotypes that would give a Hallmark movie a bad name.\n\nAfter Superman discovers to his horror that his biological parents might not have had benign intentions toward Earth, Pa Kent advises him to “be yourself,” regardless of your family’s background or beliefs.\n\nThere’s nothing necessarily wrong with that — except this Superman has no self: He’s no more a Kansan or an American than he is an invader from outer space.\n\nThis Superman doesn’t utter a word about “the American way,” and when he confronts Luthor at the film’s climax, he insists his failings are what makes him human.\n\nThe movie is a mirror of liberal psychology.\n\nFirst, no one is extraordinary — Superman is just one of a crowd of superbeings in this film, and he’s not even the only “Superman”: three other iterations of the character appear onscreen, one of them a dog.\n\nSecond, sentimentality takes the place of patriotism — Superman hasn’t assimilated to America, but to an unplaceable idea of niceness and self-affirmation.\n\nThird, and ironically, it portrays liberalism’s own ideals as doomed.\n\nThe thing that distinguishes Superman from other superhumans in this crowded film is his refusal to kill; violence, if necessary, must not be lethal.\n\nMaybe this Superman wouldn’t defund the police, but he might take away their guns and certainly wouldn’t support the death penalty.\n\nYet Superman gets humiliated at every turn for adhering to this code: Other heroes have to put down a Godzilla-scale monster terrorizing the city, and the Boravian warlord Superman spares is left alive to start more wars.\n\nWorst of all, Superman watches powerless as Luthor shoots a man in the head.\n\nGunn’s defenders claim “Superman” isn’t a cynical film, but it is — its mixture of cynicism and denial is rather like what the Democratic Party has become.\n\nWhat viewers want in Superman is a hero who knows why he stands for America, one who doesn’t kill not because he’s weak, but because he’s so strong he never has to.\n\nTrump made a joke with a serious point by putting his own face on the movie poster: He understands Superman better than James Gunn does.\n\nDaniel McCarthy is the editor of Modern Age: A Conservative Review and editor-at-large of The American Conservative.","summary":"In James Gunn’s new film, America is nothing special. Neither, for that matter, is Superman. It's a bland and demoralizing vision all too typical of the left today.","url":"https://nypost.com/2025/07/15/opinion/what-trump-knows-about-superman-that-hollywood-doesnt/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-zuunsbb3o-1752610662838.jpg?quality=75&strip=all&1752596282&w=1200","video":null,"publish_date":"2025-07-15 20:26:45","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","source_country":"zm","sentiment":-0.035},{"id":341931922,"title":"‘Mayor Mamdani’ is NOT a done deal — these voters hold the key","text":"Forget Miami Beach — think Cleveland as your escape route from life in New York City under a Mayor Zohran Mamdani.\n\nThat’s the pitch from Vivek Ramaswamy, running to be the next governor of Ohio. He’s put up a billboard in Times Square wooing frightened New Yorkers to the Buckeye State.\n\nTake a deep breath, New Yorkers. We don’t need Ohio as our Mamdani emergency exit.\n\nThe best remedy is to turn out and vote in November.\n\nMany New Yorkers alarmed by Mamdani’s Marxist convictions, defund-the-police history and anti-Israel rhetoric seem convinced he’s impossible to beat.\n\nWith so many general election candidates — Republican Curtis Sliwa, Mayor Eric Adams, former Gov. Andrew Cuomo and others — splitting the anti-Mamdani vote, the thinking goes, the socialist’s victory is inevitable.\n\nThat’s wrong: Mamdani can be defeated by surging voter turnout, even if all the candidates stay in the race. \n\nA look at history proves it.\n\nIn 1989, 60% of New York City’s registered voters turned out for a hotly contested mayoral election, and four years later, turnout reached 57%. \n\nBut in 2021, it sank to a pathetic 21%.\n\nIt doesn’t have to be that way.\n\nMamdani understood that instead of fighting for the biggest share of a small number of voters, the way to win is to expand the electorate.\n\nFor the June primary, he focused on voter registration: In the two weeks before the deadline, some 37,000 new voters joined the rolls, 10 times the usual number in that time period.\n\nThen, Mamdani’s army of enthusiastic door-knockers helped drive the largest mayoral-primary turnout in New York’s history. \n\nBeating Mamdani at his own game with aggressive field operations and voter-registration efforts is possible, even in a crowded field.\n\nHere’s the math.\n\nIf November’s turnout increases to 50%, whichever candidate tops 582,330 votes — that’s 50% of registered voters divided among the four candidates — wins.\n\nThat number — 582,300 — is 120,000 more votes than Mamdani got in Round 1 of the primary.\n\nSo he’d have a shot, but his victory would not be inevitable.\n\nYoung voters were the lion’s share of Mamdani’s primary support, and they are notoriously unreliable: In 2021 almost half of primary voters ages 18 to 29, and a third of those between 30 and 39, failed to come back and cast ballots in the general election. \n\nWith young voters, it’s kiss and goodbye, while older primary voters reliably turn out to vote again in the general.\n\nDriving turnout to 60% — standard in the five boroughs in presidential election years — makes the minimum number of votes to win higher, and the prospect of beating Mamdani easier. \n\nPresidential-level turnout is a plausible goal, because Mamdani’s upset victory in the Democratic primary is generating national press coverage and an epidemic of local angst — just what’s needed to push people to the polls.\n\nIs surging turnout still possible with the election a mere four months away? Absolutely.\n\nMamdani came from nowhere to triumph in the June primary. An Emerson College poll in late February put Cuomo in the lead with 33% of the vote, Adams with 10% and Mamdani barely registering with 1%. \n\nFour months later, he took 43.5% of the votes in the first round.\n\nJust as Mamdani went after the youth vote, his opponents need to analyze where the city’s anyone-but-Mamdani voters are to be found.\n\nThey should aim to drive up turnout among the 11% of registered New York City voters who are Republicans, the 20% who are independent, and most important, the 12% of Democrats I call the “persuadable purples” — those unwilling to vote for a far-left candidate.\n\nIn the 2024 presidential election, 573,618 Gotham Democrats who voted for Joe Biden in 2020 declined to follow the party’s leftward lurch and support Kamala Harris in 2024.\n\nSome voted for Trump, but most sat out the election. \n\nCompare that number to the 462,966 Democrats who made Mamdani their first choice in the primary. \n\nThe persuadable purples are numerous enough to turn November’s election against the upstart, if they turn out and vote for anyone but him.\n\nAfter his stunning upset victory in the primary, Mamdani is racking up endorsements from politicians and labor unions, including SEIU and the New York State Nurses Association.\n\nBut the unions’ electoral pull is fading — and he’s now under newly intense scrutiny to explain how he’ll pay for free buses, free childcare and his other promises.\n\nWill his support grow, or did he peak on primary day? \n\nThat’s hard to say, with his heavy reliance on the fickle youth vote. \n\nOne thing is certain: Defeating Mamdani is possible even in a crowded field, but it requires getting New Yorkers, lots of them, out to vote.\n\nTell your friends and neighbors.\n\nBetsy McCaughey is a former lieutenant governor of New York and co-founder of the Committee to Save Our City. X: @Betsy_McCaughey.","summary":"Zohran Mamdani can be defeated in November, even if all the candidates stay in the race. A look at history proves it.","url":"https://nypost.com/2025/07/15/opinion/mayor-mamdani-is-not-a-done-deal-these-voters-hold-the-key/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/75-supporters-district-council-37-108197766.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-15 20:24:59","author":"Betsy McCaughey","authors":["Betsy McCaughey"],"language":"en","source_country":"zm","sentiment":-0.033},{"id":341925474,"title":"Federal grand jury indicts man accused of killing former Minnesota House Speaker Melissa Hortman","text":"MINNEAPOLIS -- A federal grand jury indicted a man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\nNOTE: The video is from a previous report. \n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter with the same counts. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, who has lived in rural Sibley County south of Minneapolis, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn't home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans' home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans' funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was \"looking forward to the facts about the 14th coming out.\"\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n\"You are fishing and I can't talk about my case...I'll say it didn't involve either the Trump stuff or pro life,\" Boelter wrote in a message to the newspaper via the jail's messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney's office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans' funeral June 28. Gov. Tim Walz, Harris's running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as \"the most consequential speaker in Minnesota history.\"\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The indictment handed up lists murder, stalking and firearms charges against Vance Boelter.","url":"https://abc7.com/post/vance-boelter-federal-grand-jury-indicts-man-accused-killing-former-minnesota-house-speaker-melissa-hortman/17135544/","image":"https://cdn.abcotvs.com/dip/images/17135526_AP25167779394022.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/062825-wls-n1-mn-funeral-5p-vid.mp4","publish_date":"2025-07-15 20:15:49","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"us","sentiment":-0.296},{"id":341922820,"title":"Federal grand jury indicts man accused of killing former Minnesota House Speaker Melissa Hortman","text":"By STEVE KARNOWSKI, Associated Press\n\nMINNEAPOLIS (AP) — A federal grand jury indicted a Minnesota man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter in a complaint with six counts, including murder, stalking and firearms offenses. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn’t home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans’ home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail’s messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney’s office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The indictment lists murder, stalking and firearms charges against Vance Boelter.","url":"https://www.sandiegouniontribune.com/2025/07/15/minnesota-lawmakers-shot-grand-jury/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/07/Minnesota_Lawmakers_Shot_23360_48010b.jpg?w=150&strip=all","video":null,"publish_date":"2025-07-15 19:49:57","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.322},{"id":341926022,"title":"Federal grand jury indicts man accused of killing former Minnesota House Speaker Melissa Hortman","text":"By STEVE KARNOWSKI, Associated Press\n\nMINNEAPOLIS (AP) — A federal grand jury indicted a Minnesota man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter in a complaint with six counts, including murder, stalking and firearms offenses. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn’t home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans’ home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.”\n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail’s messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney’s office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"The indictment lists murder, stalking and firearms charges against Vance Boelter.","url":"https://www.ocregister.com/2025/07/15/minnesota-lawmakers-shot-grand-jury/","image":"https://www.ocregister.com/wp-content/uploads/2025/07/Minnesota_Lawmakers_Shot_23360_48010b.jpg?w=150&strip=all","video":null,"publish_date":"2025-07-15 19:49:57","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.322},{"id":341922896,"title":"Federal grand jury indicts man accused of killing former Minnesota House Speaker Melissa Hortman","text":"A federal grand jury indicted a Minnesota man Tuesday on charges that he fatally shot a prominent Minnesota state representative and her husband and seriously wounded a state senator and his wife while he was allegedly disguised as a police officer.\n\nThe indictment handed up lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former Democratic House Speaker Melissa Hortman and her husband, Mark, could carry the federal death penalty.\n\nThe chief federal prosecutor for Minnesota has called the killings a political assassination.\n\nProsecutors initially charged Boelter in a complaint with six counts, including murder, stalking and firearms offenses. But under federal court rules they needed a grand jury indictment to take the case to trial.\n\nProsecutors say Boelter, 57, was driving a fake squad car, wearing a realistic rubber mask that covered his head and wearing tactical gear around 2 a.m. on June 14 when he went to the home of Sen. John Hoffman, a Democrat, and his wife, Yvette, in the Minneapolis suburb of Champlin. He allegedly shot the senator nine times, and Yvette Hoffman eight times, but they survived.\n\nProsecutors allege he then stopped at the homes of two other lawmakers. One, in Maple Grove, wasn't home while a police officer may have scared him off from the second, in New Hope. Boelter then allegedly went to the Hortmans' home in nearby Brooklyn Park and killed both of them. Their dog was so gravely injured that he had to be euthanized.\n\nBrooklyn Park police, who had been alerted to the shootings of the Hoffmans, arrived at the Hortman home around 3:30 a.m., moments before the gunman opened fire on the couple, the complaint said. Boelter allegedly fled and left behind his car, which contained notebooks listing dozens of Democratic officials as potential targets with their home addresses, as well as five guns and a large quantity of ammunition.\n\nLaw enforcement officers finally captured Boelter about 40 hours later, about a mile (1.6 kilometers) from his rural home in Green Isle, after what authorities called the largest search for a suspect in Minnesota history.\n\nSen. Hoffman is out of the hospital and is now at a rehabilitation facility, his family announced last week, adding he has a long road to recovery. Yvette Hoffman was released a few days after the attack. Former President Joe Biden visited the senator in the hospital when he was in town for the Hortmans’ funeral.\n\nFriends have described Boelter as an evangelical Christian with politically conservative views who had been struggling to find work. At a hearing July 3, Boelter said he was “looking forward to the facts about the 14th coming out.” \n\nIn an interview published by the New York Post on Saturday, Boelter insisted the shootings had nothing to do with his opposition to abortion or his support for President Donald Trump, but he declined to discuss why he allegedly killed the Hortmans and wounded the Hoffmans.\n\n“You are fishing and I can’t talk about my case…I’ll say it didn’t involve either the Trump stuff or pro life,” Boelter wrote in a message to the newspaper via the jail's messaging system.\n\nIt ultimately will be up to Attorney General Pam Bondi, in consultation with the local U.S. attorney's office, to decide whether to seek the federal death penalty. Minnesota abolished its state death penalty in 1911. But the Trump administration says it intends to be aggressive in seeking capital punishment for eligible federal crimes.\n\nBoelter also faces state murder and attempted murder charges in Hennepin County, but the federal case will go first.\n\nBiden and former Vice President Kamala Harris joined mourners at the Hortmans’ funeral June 28. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Melissa Hortman as “the most consequential speaker in Minnesota history.” \n\nHortman led the House from 2019 until January and was a driving force as Democrats passed an ambitious list of liberal priorities in 2023. She yielded the speakership to a Republican in a power-sharing deal after the November elections left the House tied, and she took the title speaker emerita.","summary":"A federal grand jury has indicted the man accused of fatally shooting a prominent Minnesota state representative and her husband and seriously wounding a state senator and his wife","url":"https://www.independent.co.uk/news/world/americas/minnesota-mark-joe-biden-democratic-donald-trump-b2789634.html","image":"https://static.independent.co.uk/2025/06/28/18/Minnesota_Lawmakers_Shot_23360.jpg?width=1200","video":null,"publish_date":"2025-07-15 19:44:09","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.288},{"id":341916222,"title":"AOC smacked with ultimate insult from fresh-faced young Democrat snapping at her heels","text":"The Gen-Z social media star hoping to run for Congress this year has taken a swipe at Alexandria Ocasio-Cortez for being out of touch with young voters.\n\nDeja Foxx, 25, has been dubbed 'the next AOC' - but she rejected the comparison on Tuesday, saying she represents 'a generation who has a different kind of urgency'. \n\nShe spoke with the Daily Beast ahead of the Democratic primary election in Arizona's 7th district, where five hopefuls are running to represent the party. \n\nIf selected by Democrat voters on Tuesday and by Arizona residents in the September election, Foxx would become the youngest person elected to Congress. \n\nThough her chances are low according to polls, AOC overcame huge odds to defeat Congressman Joe Crowley in 2019 when she was just four years older than Foxx. \n\nFoxx hopes to replicate this success, but she did not welcome comparisons with the New York 'Squad' member when quizzed about it ahead of the Democratic primary.\n\n'I remember when she was elected. I was just a teenager,' Foxx told the Daily Beast. 'Now I'm old enough to run for Congress. And we are in a very different place.'\n\n'I represent a generation who has a different kind of urgency and a different skill set, a different way of communicating,' the Filipino-American candidate added. \n\n'And right now, the Democrats, for the very first time in decades, have lost ground with young people. \n\n'If we do not get serious about the ways we are communicating with them, talking to them, we are going to be in a really bad spot in 2026 and 2028, and we can't afford that.\n\n'Families like mine who rely on the social services Donald Trump is trying to cut, things like Medicaid, SNAP benefits, cannot afford another loss.'\n\nFoxx's blistering assessment of her party could easily be interpreted as a damning takedown of AOC. Many of the star congresswoman's supporters claim she has deserted her original progressive mission and is now too much of a centrist. \n\nFoxx grew up in Tucson, Arizona, where she was raised by a single mother in Section 8 housing. \n\nThe family relied on food stamps, and Foxx moved out at the age of 15 to sleep on friends' couches while her mother struggled with mental illness and addiction. \n\nFoxx was a rising star in high school, where she campaigned to modernize the sex education curriculum and founded a community project to provide reproductive healthcare to young people in Tucson. \n\nShe overcame the odds to secure a scholarship at Columbia University in New York City in 2018, and she made the dean's list for her academic performance. \n\nWhile at Columbia, Foxx joined Kamala Harris' first run for the presidency in 2020 and went on to lead her campaign influencer strategy at the age of just 19.\n\nNow she's running in the Arizona special election after the incumbent Congressman Raúl Grijalva died of lung cancer in March after 12 terms in office. \n\nFoxx is running against the late Congressman's daughter, Adelita Grijalva, who has been endorsed by AOC and Bernie Sanders, along with three more candidates. \n\nPatrick Harris Sr, Daniel Hernandez Jr and Jose Maldivo Jr are also running in the primary. Voters hit the polls on Tuesday, and the result will be announced in the coming days. \n\nFoxx told Teen Vogue she had been hoping to run for Congress in 2026, but she seized the opportunity to make an earlier bid in what she called her 'crashout or Congress' scheme.\n\nShe said she decided to run because her 'lived experience differentiates me from people in the field' and because 'we need young people with a real sense of urgency at this moment'. \n\nAfter Harris lost the 2024 election in a landslide, Foxx also said she wanted to run for Congress because she 'felt a deep sense of responsibility.'\n\n'It wasn't enough for me to just work the behind the scenes of campaigns or in front of the cameras,' she said, adding: 'I needed to give them someone they could get excited about, or we would stand to lose our generation.'\n\nFoxx's policy proposals include investing in the construction of 12 million new social housing units and improving the current stock of social housing, per her website. \n\nThe page adds that she wants to provide childcare support for low-income families, raise the minimum wage to $17 per hour and eliminate the tipped minimum wage. \n\nFoxx has also pledged to sponsor the Social Security Expansion Act to increase Social Security benefits, and 'make the wealthiest Americans chip in their fair share'.","summary":"Deja Foxx, 25, has been dubbed 'the next AOC' - but she rejected the comparison on Tuesday, saying she represents 'a generation who has a different kind of urgency'.","url":"https://www.dailymail.co.uk/news/article-14908429/deja-foxx-insults-aoc-comparison.html","image":"https://i.dailymail.co.uk/1s/2025/07/15/19/100338257-0-image-m-63_1752605483102.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/27/7095915991304747404/1024x576_MP4_7095915991304747404.mp4","publish_date":"2025-07-15 19:43:16","author":"Editor,Laura Parnaby","authors":["Editor","Laura Parnaby"],"language":"en","source_country":"gb","sentiment":0.016},{"id":341930414,"title":"Steve Hilton: California Needs A Governor Who Is Actually Willing To Enforce The Law","text":"California gubernatorial candidate Steve Hilton joins Fox Across America With Jimmy Failla to shed light on why he believes voters in the Golden State are tired of the same failing policies and are ready to embrace a new kind of leader in Sacramento.\n\n“You know, it’s early days, but it’s feeling good to me. Just today, new poll came out. I’m leading. I’m leading all the Democrats in a situation where they put Kamala Harris in there. She clears the field for the Democrats pretty much, but I’m right there with her as the real challenger. And I think we’ve got a shot because for a long time, I think there’s been this sort of assumption that a Republican can never win, it’s too democratic. That’s not true. There’s plenty of Republican votes. Here’s a simple way of putting it. If everybody who voted for Trump in California last year votes for me next year, I’ll win. I’ll be the governor. So we’ve just got to fire people up and say, this time we can do it. Here’s positive alternative. It doesn’t have to be like this. You don’t have put up with this nonsense. Let’s go for it.”\n\nPLUS, check out the podcast to hear Tuesday’s full show!","summary":"California gubernatorial candidate Steve Hilton joins Fox Across America With Jimmy Failla to shed light on why he believes voters in the Golden State are tired of the same failing policies and are ready to embrace a new kind of leader in Sacramento. &#8220;You know, it&#8217;s early days, but it&#8217;s feeling good to me. Just today, new poll came out. I&#8217;m leading. I&#8217;m leading all the Democrats in a situation where they put Kamala Harris in there. She clears the field for the Democrats pretty much, but I&#8217;m right there with her as the real challenger. And I think we&#8217;ve got a shot because for a long time, I think there&#8217;s been this sort of assumption that a Republican can never win, it&#8217;s too democratic. That&#8217;s not true. There&#8217;s plenty of Republican votes. Here&#8217;s a simple way of putting it. If everybody who voted for Trump in California last year votes for me next year, I&#8217;ll win. I&#8217;ll be the governor. So we&#8217;ve just got to fire people up and","url":"https://radio.foxnews.com/2025/07/15/steve-hilton-california-needs-a-governor-who-is-actually-willing-to-enforce-the-law/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2025/07/FAA-STEVE-HILTON-CARD-1.jpeg","video":null,"publish_date":"2025-07-15 19:36:17","author":"Michael Addvensky,To Preview The","authors":["Michael Addvensky","To Preview The"],"language":"en","source_country":"us","sentiment":-0.099},{"id":341950542,"title":"Susan Collins again in hot seat over Trump budget cut request","text":"For the second time in as many weeks, Sen. Susan Collins is in the hot seat over a controversial spending bill, and this time, President Donald Trump is signaling electoral consequences for all Republicans who don’t fall in line.\n\nProcedural votes were scheduled for Tuesday evening on the Trump administration’s proposed $9.4 billion rescission package, which seeks to eliminate funding for programs already approved by Congress, including for global health and the Corporation for Public Broadcasting.\n\nIf it clears those hurdles, the Senate could vote later this week. For the cuts to take effect, the bill would need to be approved by Friday, when the rescission request expires.\n\nIt was unclear Tuesday afternoon whether Republicans have the votes to advance the bill, even with Trump’s public pressure.\n\nSenate Majority Leader John Thune of South Dakota acknowledged to reporters Monday that the bill may need to be amended to receive the majority vote needed to move forward. And Russell Vought, the president’s budget director, met with Senate Republicans Tuesday afternoon to shore up support.\n\nDuring that meeting, Vought said the White House would back off its proposal to cut $400 million from the President’s Emergency Plan for AIDS Relief, or PEPFAR, program, the global AIDS initiative created by former President George W. Bush.\n\nCollins, who is facing reelection next year, is the top Senate appropriator and has expressed concerns about the some of the proposed cuts of $8.3 billion in funding for global health programs, including PEPFAR, and an additional $1.1 billion in cuts to public broadcasting.\n\nShe emerged from a meeting Monday night with her concerns unaddressed, telling reporters in Washington, D.C., that “we are still lacking the level of detail needed to make the right decisions.”\n\n“It’s extremely unusual for any senator to not be able to get that kind of detailed information,” Collins told reporters.\n\nCollins has argued that funding global health programs to stop the spread of HIV/AIDS and other diseases, to combat hunger, and provide nourishment to mothers and their babies are key sources of soft power, providing the U.S. with nonmilitary influence.\n\nHer concerns about public broadcasting cuts are primarily focused on impacts to local programming and emergency communications, especially in rural areas. She has expressed support for defunding National Public Radio, which she accuses of having a leftward bias.\n\nSen. Angus King, an independent who caucuses with Democrats, railed against the rescission package in a 20-minute floor speech on Tuesday, saying the proposal eliminates all United States Agency for International Development (USAID) funding, rather than defunding questionable projects within the program. He said China has already tried to fill the vacuum left by the administration and is gaining influence in Africa and Latin America.\n\nKing also opposed cuts to public broadcasting, but his biggest concern was about Congress handing more power to the executive branch, especially its constitutional power of the purse. He said the current bill essentially “shreds the appropriations process” and makes the Senate Appropriations Committee, which is chaired by Collins, “a rubber stamp for whatever the administration wants.”\n\n“I don’t care whether it’s Donald Trump or the Archangel Gabriel — it’s dangerous to have the power in one set of hands — that’s how we lose our liberty,” King said. “I don’t know what it’s going to take. But I hope this debate, this discussion, will lead us to finally say this is a line too far — we’re going to draw a line here.”\n\nCollins, who was expected to speak on the floor later Tuesday, is a key vote in a closely divided Senate, where Republicans can afford to lose only three votes and still advance the legislation.\n\nEarlier this month, Collins voted against Trump’s mega budget bill, which made permanent his 2017 tax cuts that primarily benefited the wealthy and made significant cuts to Medicaid and clean energy programs, while boosting funding for immigration and border enforcement. The bill could lead to more than 11 million Americans losing health care, including an estimated 40,000 in Maine.\n\nCollins’ vote resulted in a 50-50 tie, after Sen. Lisa Murkowski, R-Alaska, was won over after receiving concessions to benefit her home state. Vice President JD Vance broke the tie, and Trump signed the bill on July 4.\n\nTrump gave Collins, who is the only Republican up for reelection in a state won by Democratic Vice President Kamala Harris in 2024, a pass on that vote, choosing not to publicly attack her like he did Sen. Thom Tillis of North Carolina, who announced he would not seek reelection.\n\nBut Trump is signaling that any Republican defectors this time could face electoral consequences, especially if they support public broadcasting funding.\n\n“It is very important that all Republicans adhere to my Recissions (sic) Bill and, in particular, DEFUND THE CORPORATION FOR PUBLIC BROADCASTING (PBS and NPR), which is worse than CNN & MSDNC put together,” Trump said in a July 10 social media post. “Any Republican that votes to allow this monstrosity to continue broadcasting will not have my support or Endorsement.”\n\nTrump proposed a rescission bill during his first term, but it went nowhere. Collins, along with Sen. Richard Burr, R-North Carolina, joined Democrats in 2018 to oppose discharging the bill, which included $15 billion in cuts to programs like children’s health and housing programs, from the appropriations committee.\n\nThis story will be updated.","summary":"The Senate is expected to begin voting Tuesday afternoon on President Trump's formal request to cut $9.4 billion in funding already approved by Congress for foreign assistance and public broadcasting.","url":"https://www.centralmaine.com/2025/07/15/susan-collins-again-in-hot-seat-over-trump-budget-cut-request/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/12/Trump_Hegseth_22235_71477a.jpg?w=1000","video":null,"publish_date":"2025-07-15 19:21:09","author":"Randy Billings","authors":["Randy Billings"],"language":"en","category":"politics","source_country":"us","sentiment":-0.054},{"id":341914996,"title":"Washington Post’s new opinion editor promises ‘ambitious’ changes, echoes Jeff Bezos’ talking points","text":"The Washington Post’s new opinion editor promised \"ambitious and thorough\" changes to the storied section while making it clear that he aligns with billionaire owner Jeff Bezos’ desire to \"rebuild trust with more Americans.\" Bezos announced some major changes to the outlet's opinion page in February when he declared, \"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others,\" and that top opinion editor David Shipley decided to step away. Post opinion section staffers were eager to learn about their new boss and the direction of the sections for months until Adam O’Neal was plucked from The Economist. O’Neal was announced as Shipley’s replacement in an unusual selfie-style video that was posted to X by the Post’s communications department in June. He began his tenure leading the opinion section of the Post on Monday, where staffers were greeted with an email titled simply, \"Looking forward,\" that echoed Bezos’ \"personal liberties and free markets\" message. WASHINGTON POST CEO URGES STAFFERS WHO DON'T ‘FEEL ALIGNED’ WITH PAPER'S NEW DIRECTION TO TAKE BUYOUT \"After thinking and planning for quite some time, I’m beyond thrilled to finally get to work. It won’t be easy, but we have a real opportunity to build the most popular, vibrant and influential opinion section in the country. My top priority will be to significantly increase the reach and effect of our work. Advocating for free markets and personal liberties will be critical as we rebuild trust with more Americans and scale our high-quality journalism,\" O’Neal wrote in the email obtained by Fox News Digital. \"This is not a partisan project, and we will welcome robust debate within the twin pillars. It's also important that we communicate with optimism about this country in particular and the future in general,\" he continued. \"The changes we have planned are not marginal. They will be ambitious and thorough.\" Bezos was scolded by liberal commentators after his February announcement of major changes to the opinion section, with many critics accusing him of bending the knee to President Donald Trump. O’Neal, who has also worked at The Dispatch and The Wall Street Journal, told staffers that his department would embrace the paper’s longstanding traditions as changes are made. \"Throughout, we will cultivate and maintain core values: encouraging original reporting; creating a collegial atmosphere; expecting high standards; and embracing experimentation and innovation. We won’t let sentimentality slow down much-needed reform. I have tremendous respect for The Post’s 148-year history, as well as its culture of adaptation and evolution. We will embrace that tradition wholeheartedly as we chart a new, transformative path for this iconic institution,\" O’Neal wrote. \"I know this represents a shift for many of you, and maybe even an unwelcome one for some, but simply being reconciled to these changes is not enough. We want those who stick with us to be genuinely enthusiastic about the new direction and focus,\" he continued. \"While I’ve spent the past few months learning about the inner-workings of our section, I’ll also spend the coming days having a close-up look at our systems and workflow. That means that, in addition to learning from you all individually, I'll be sitting in on meetings and discussions as an observer.\" LIBERAL PUNDITS DUB WASHINGTON POST'S LATEST OPINION SHAKE-UP A 'TERRIBLE TRAGEDY,' SLAM JEFF BEZOS O’Neal called it a \"unique and exciting time for The Post\" and wrapped up his email by noting that the opinion section’s \"future\" team is not currently in place. \"I’m eager to put together the team that will bring us into the future,\" O’Neal wrote. It’s been turbulent times at the Post, which famously came under fire after Bezos stopped the editorial page from endorsing then-Vice President Kamala Harris in 2024 over Trump, prompting several staffers to leave the paper. The Post endorsed former President Biden in 2020 and Hillary Clinton in 2016. When Bezos explained the decision, he cited a Gallup poll showing Americans losing trust in the media, even falling below Congress, telling readers, \"Our profession is now the least trusted of all. Something we are doing is clearly not working.\" LONGTIME WASHINGTON POST COLUMNIST QUITS PAPER, SLAMS GROWING EDITORIAL CONSTRAINTS UNDER BEZOS Last week, publisher and CEO Will Lewis offered a blunt ultimatum to staff who aren't onboard with the \"new direction\" the paper is taking under Bezos. \"I understand and respect, however, that our chosen path is not for everyone,\" Lewis wrote in a memo obtained by Fox News Digital. \"That’s exactly why we introduced the voluntary separation program. As we continue in this new direction, I want to ask those who do not feel aligned with the company’s plan to reflect on that. The VSP is designed to support you in making this decision, give you the ability to weigh your options thoughtfully and with less concern about financial consequences. And if you think that it’s time to move on to a new chapter, the VSP helps you take that next step with more security.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital’s Hanna Panreck and Joseph A. Wulfsohn contributed to this report.","summary":"Adam O&apos;Neal takes helm at Washington Post opinion section, echoing owner Jeff Bezos&apos; directive to rebuild trust with Americans through advocacy of free markets and personal liberties.","url":"https://www.foxnews.com/media/washington-posts-new-opinion-editor-promises-ambitious-changes-echoes-jeff-bezos-talking-points","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/b53c821a-jeff-bezos-1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 19:00:19","author":"Brian Flood","authors":["Brian Flood"],"language":"en","category":"politics","source_country":"us","sentiment":0.351},{"id":341926266,"title":"As Trump looks to net five GOP seats through Texas redistricting, Democrats grasp for response","text":"Sign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\n\nTexas Democrats in Congress sharply criticized President Donald Trump’s plan to redraw their state’s political map in the middle of the decade, labeling it a threat to democracy — and warning their GOP counterparts that an aggressive gerrymander could come back to haunt them.\n\nThe Republican-controlled Texas Legislature is poised to consider a new set of congressional maps during a special session that kicks off next week. With their party locked out of power in Austin, Democrats from the state’s congressional delegation said they expect the new districts to continue Texas' history of violating the federal Voting Rights Act by diluting the votes of racial minorities.\n\n“The scheme of the Republicans has consistently been to make sure that they mute our voices so that they can go ahead and have an oversized say in this,” Rep. Jasmine Crockett, D-Dallas, said at a news conference with House Democratic leadership and most Texas Democrats. “So I fully anticipate that's exactly where they're going with this map.”\n\nEarlier Tuesday, Trump told Texas congressional Republicans that his political team is pursuing a map that would yield five new Republican seats, according to three people briefed on the call, which was first reported by Punchbowl News.\n\nAt the White House, Trump later told reporters that Republicans could get three to five more seats out of a new Texas map — and that other states could follow.\n\n“Texas would be the biggest one,” he said. “Just a very simple redrawing, we pick up five seats.”\n\nTrump’s political operatives have been floating the prospect of drawing new congressional district lines that would shift GOP voters from safely red districts into neighboring blue ones, in a bid to flip the seats and help Republicans hold their narrow House majority. Gov. Greg Abbott ended weeks of uncertainty by putting redistricting on the agenda for the upcoming special session, which begins Monday.\n\nDemocrats have very few tools at their disposal to stop or even mitigate the redistricting. Both chambers of the Legislature are under Republican control and overseen by leaders who are unlikely to stand in Trump’s way.\n\nThis leaves Democrats fearful they could lose their jobs without a clearly defined offensive playbook. Their limited options to hit back include convincing blue states to redistrict in favor of Democrats to offset GOP gains in Texas, a move they hope would dissuade Republicans from going ahead with the plan.\n\nThey could also encourage state Democratic lawmakers to flee the state to deprive the Legislature of a quorum needed to approve the maps — the same maneuver Texas Democrats used in an unsuccessful attempt to thwart a 2021 GOP voting bill.\n\nAmid those long odds, some Democrats alluded to another option: hoping Republicans spread their voters too thin and give Democrats a chance to win under a favorable national climate.\n\n“Texas Republicans are likely going to continue to act like political punks and bend the knee to Donald Trump's extreme agenda,” House Minority Leader Hakeem Jeffries, D-New York, said at Tuesday’s news conference. “In doing so, they will jeopardize their own electoral careers.”\n\nThreat of a dummymander\n\nMidterm elections historically favor the party out of power. Combining this trend and narrower Republican margins, Democrats see potential to flip some seats and widen their share of the Texas congressional delegation. Republicans currently control 25 of the state’s 38 districts.\n\nThe Democratic Congressional Campaign Committee, the party’s campaign arm for House races, will use their deep coffers to target Texas Republicans who appear vulnerable under a new map, DCCC Chair Suzan DelBene said.\n\nJeffries echoed the sentiment, adding that Democrats would do “everything that we can do in Texas and beyond to respond.”\n\nThe Democratic leader speculated that Texas Republicans could end up creating a “dummymander” — a gerrymander that goes so far as to benefit the other party — because the current Texas map is already drawn to ensure current GOP members’ seats are safe.\n\nNo maps have been publicly released. Trump’s goal of netting five GOP seats would give Republicans control of nearly 80% of Texas’ congressional districts in a state where Democratic presidential nominee Kamala Harris captured 42% last year.\n\nTrump’s team believes Republican voters could be more efficiently distributed throughout the state, given that every House Republican in Texas won in 2024 by double-digit margins or did not have a Democratic opponent. The closest GOP win was Edinburg Rep. Monica De La Cruz's 14-point victory.\n\nTexas Republicans grew their vote share last year compared to recent cycles, creating what Trump’s team sees as opportunities for new pickups. Sen. John Cornyn voiced support for the idea on Tuesday, pointing to Hispanic voters — who shifted to the right considerably last election — as a population that could deliver Republicans more seats.\n\nAnd Republicans have successfully used mid-decade redistricting to make gains as recently as the 2024 cycle. In North Carolina, after the Republican-controlled Legislature redrew the map, Democrats lost three House seats.\n\nBut majorities fluctuate from election to election, and drawing maps based on old census data and electoral trends from one cycle can be risky.\n\nRep. Chip Roy, R-Austin, flagged the census as an area of “query.”\n\n“We have a whole lot of people [that have] come into the state since then,” he said. “We’re going to do this all based on 2020 census data?”\n\nDemocrats homed in on their performance in the last Trump midterm — 2018 — as evidence that they can fight a new map solely on the strength of their performance at the ballot box. The party flipped two Texas congressional seats and 12 seats in the state House that year, while Democrat Beto O’Rourke came within 3 points of defeating GOP Sen. Ted Cruz.\n\nA map attempting to pick up five seats, as Trump has suggested, would likely force some Republicans in safe seats to run in more competitive races.\n\n“We’re waiting to see how greedy they’re trying to be,” said Rep. Julie Johnson, D-Farmers Branch. “You know the old adage: a pig gets fat and a hog gets butchered. I think the Texas Republicans are pushing the limits on this one.”\n\nGoing on the offensive?\n\nApart from recruiting candidates for newly competitive districts, some Democrats are also pushing for their party to get off the bench and fight.\n\nHouse Democrats, Democratic leadership and representatives for blue state governors have been meeting to discuss a plan to redistrict their states to favor Democrats if the Texas plan goes through, The Texas Tribune previously reported.\n\nPeople in Gov. Gavin Newsom’s orbit signaled his willingness to go through with the plan during these discussions, and the California governor has been hinting at possible retaliation in recent days.\n\nTwo Democrats involved in the talks told the Tribune they are confident Democratic-controlled states will come to their aid, but none have done so.\n\nDemocratic state lawmakers could also flee the state during the special session — as they did to temporarily thwart GOP redistricting in 2003 — to prevent Republicans from reaching a quorum.\n\nRep. Marc Veasey told the Tribune that he would not just support a quorum break, “I would do everything I can to help aid them in being able to pull it off.” The Fort Worth Democrat said it’s time for his party to go on the offensive.\n\n“If they're going to fight dirty and they're going to redraw these lines, then I would be supportive of Democratic state legislators doing whatever is necessary,” he said, adding that he was not concerned about his political prospects if his district is redrawn.\n\nTexas Attorney General Ken Paxton cautioned against any such move on Tuesday, vowing to use law enforcement to compel “the attendance of anyone who abandons their office and their constituents for cheap political theater.”\n\n“That’s a state issue”\n\nDemocrats have also focused on a Department of Justice letter issued to Abbott and Paxton ordering the state to address the existence of coalition districts — where multiple racial minority groups combine to form a voting majority — in light of new court precedent. Abbott cited the letter as the impetus for including redistricting in his special session agenda.\n\nDemocrats and some legal experts see the letter as a fig leaf for the true political intent of the redistricting effort — but that has not stopped them from drawing attention to it. Rep. Lloyd Doggett, D-Austin, said the notion that Texas Republicans had drawn a map that disadvantaged white voters was ludicrous.\n\n“[That’s] not a big problem that we've ever had down there in my lifetime,” he said.\n\nRep. Sylvia Garcia, D-Houston, who represents one of the districts the DOJ said constituted an illegal racial gerrymander, even sent out a fundraising blast to supporters the day the special session was ordered with a copy of the letter, calling it an “attempt to silence the voices of communities of color who have powered progress in Texas for decades.”\n\nRepublicans, meanwhile, have been reluctant to discuss the redistricting effort, with many concerned about jeopardizing their seats and bringing heightened legal scrutiny. Texas maps have been routinely challenged in court, with at least one flagged for violating the Voting Rights Act in every decade since the law’s 1965 passage.\n\nThe current map — drawn in 2021 — has been in litigation for four years, with a federal trial in El Paso concluding in May and a verdict yet to be reached. Whatever map emerges from the special session figures to be no different, giving Republicans further motivation to stay mum.\n\nWhen asked about the redistricting effort, Rep. Keith Self of McKinney said, “That's a state issue.” Rep. Pete Sessions demurred, saying it “is up to the governor and up to the lieutenant governor and the speaker.”\n\nShape the future of Texas at the 15th annual Texas Tribune Festival, happening Nov. 13–15 in downtown Austin! We bring together Texas’ most inspiring thinkers, leaders and innovators to discuss the issues that matter to you. Get tickets now and join us this November.\n\nTribFest 2025 is presented by JPMorganChase.","summary":"President Donald Trump said he thinks Republicans could flip a handful of congressional districts in Texas next year through “​​just a very simple redrawing.\"","url":"https://www.texastribune.org/2025/07/15/texas-democrats-redistricting-response-trump-republican-five-seats/","image":"https://thumbnails.texastribune.org/rU3l787g_obRQkkeuRfg9iSMYiI=/450x300/https://static.texastribune.org/media/files/9669d276db80602682bb39c1d8101afa/Texas%20Redistricting%20Presser%20REUTERS.jpg","video":null,"publish_date":"2025-07-15 18:36:34","author":"Gabby Birenbaum,Owen Dahlkamp","authors":["Gabby Birenbaum","Owen Dahlkamp"],"language":"en","category":"politics","source_country":"us","sentiment":-0.299},{"id":341911040,"title":"Emmys 2025 diversity report shows decline in actors of color despite historic nominations","text":"Emmy Awards ceremony stage at the Television Academy's Wolf Theatre in North Hollywood, where 2025 nominations were announced showing mixed diversity results across acting categories \n\nActors of color representation drops to five-year lowThe 2025 Emmy nominations produced mixed results for diversity representation, with actors of color comprising 24 of 94 total nominees in main acting categories. This represents a decline from 2024's 30 nominees of color, which constituted 31 per cent of all acting nominations.The 2025 figures mark the lowest representation for actors of color in five years, falling short of the 2022 peak when 42 of 108 nominees (39 per cent) were people of color, representing the highest percentage in Emmy history. The current numbers also trail 2020's 37 nominees of color.Also read: Emmy Nominations 2025: ‘Severance,’ ‘The White Lotus’ and ‘Adolescence’ to bag big scores? Full list reveEmmy nominations by actors of color: historical contextData from the past decade reveals fluctuating representation levels:2025: 24 nominees2024: 30 nominees2023: 25 nominees2022: 42 nominees (historic high)2021: 25 nominees2020: 37 nominees2019: 22 nominees2018: 32 nominees2017: 24 nominees2016: 21 nomineesQuinta Brunson achieves historic Emmy recognition\"Abbott Elementary\" creator Quinta Brunson continues her groundbreaking Emmy trajectory, tying Stefani Robinson for most writing nominations by a Black woman with three total nominations. Brunson becomes the first to achieve all three writing nominations for a single series.Also read: Emmy 2025: Full nominee list is out - here's who made it and who didn'tWith her fourth acting nomination, Brunson ranks as the third most-nominated Black woman in lead comedy actress, trailing only Isabel Sanford and tied with Tracee Ellis Ross. After becoming the first solo Black woman to win for comedy writing in 2022 and the second Black woman to win lead comedy actress in 2023, Brunson maintains her historic presence.Lead comedy actress category achieves majority women of colorThe lead comedy actress category features a majority of women of color for the second consecutive year, including Brunson, Uzo Aduba from \"The Residence,\" and Ayo Edebiri. Edebiri, 29, holds the record as the youngest Black woman to receive three Emmy acting nominations.Live EventsEdebiri earned additional recognition for directing \"Napkins,\" becoming the first woman nominated for acting and directing in comedy categories in the same year. She represents only the second Black woman nominated for comedy directing after Millicent Shelton for \"30 Rock\" in 2009.Sterling K. Brown sets Emmy history recordSterling K. Brown's lead drama actor nomination for \"Paradise\" marks the seventh different series for which he's received recognition, tying Don Cheadle for most among Black male performers. Brown's previous nominations span \"This Is Us,\" \"The People v. O.J. Simpson: American Crime Story,\" \"Brooklyn Nine-Nine,\" \"The Marvelous Mrs. Maisel,\" \"Lincoln: Divided We Stand,\" and \"Invincible.\"Alfre Woodard maintains the overall leadership with 17 nominations across different series, a record likely to remain unmatched.Also read: Donald Trump melts down over Emmy nod for ‘60 Minutes’ interview with Kamala Harris, slams CBS amid his $2Latino performers face continued Emmy challengesPedro Pascal earned his second nomination for \"The Last of Us,\" making him only the second Latino ever nominated more than once in lead drama actor, following Jimmy Smits' four consecutive nominations for \"NYPD Blue\" (1996-99).Selena Gomez extended her record as the most-nominated Latina producer in history with her fourth consecutive nomination as executive producer of \"Only Murders in the Building.\" Her fellow executive producer Dan Fogelman becomes the first person since David E. Kelley in 1999 to receive nominations for both drama and comedy series.Supporting comedy actress category ties diversity recordLiza Colón-Zayas, last year's historic winner as the first Latina to win supporting comedy actress for \"The Bear,\" received another nomination. She joins Jessica Williams, Janelle James, and Sheryl Lee Ralph, tying the 2023 record for most women of color nominated in a single acting category.Afro-Latino Colman Domingo continues his awards dominance with his second career nomination for \"The Four Seasons,\" becoming the first person since Andre Braugher to be the sole nomination for a comedy series.Asian performers show growth despite notable snubsBowen Yang achieved a milestone as the most-nominated Asian male performer in Emmy history with his fourth nomination for \"Saturday Night Live.\" Only Sandra Oh has more nominations among Asian performers overall.Several prominent AAPI performers were notably absent from nominations, including Dichen Lachman from \"Severance,\" Chase Sui Wonders from \"The Studio,\" and Tayme Thapthimthong from \"The White Lotus.\" \"The Last of Us\" also missed nominating diverse ensemble members including Isabela Merced, Gabriel Luna, Danny Ramirez, Young Mazino, and Tati Gabrielle.LGBTQ representation achieves historic milestonesBella Ramsey became the first openly nonbinary performer to receive two Emmy nominations, earning recognition for \"The Last of Us.\" At 20, Ramsey ranks as the fourth-youngest lead drama actress nominee in Emmy history and the youngest to receive two nominations in the category.Also read: Who is Sydney Sweeney, the Emmy nominated actress whose bathwater soap sold out in seconds?Carl Clemons-Hopkins, who made history in 2021 as the first nonbinary acting nominee, did not receive recognition this year, maintaining a single nomination for \"Hacks.\"Historic opportunity in supporting drama actor categoryTramell Tillman earned his first nomination for supporting drama actor as Milchik in \"Severance,\" alongside co-star Zach Cherry. Either performer could become the first Black actor to win in supporting drama actor, the only acting category without a Black winner in the Emmys' 77-year history.Age barriers broken by Hollywood veteransKathy Bates, 77, became the oldest lead drama actress nominee ever for \"Matlock,\" while Harrison Ford received his first career nomination for \"Shrinking.\" At 82, Ford ranks as the second-oldest nominee in supporting comedy actor, behind Alan Arkin, who was 86 when nominated for \"The Kominsky Method.\"Women directors and writers gain groundOutstanding directing for limited series/TV movie included four women: Lesli Linka Glatter for \"Zero Day,\" Helen Shaver and Jennifer Getzinger for \"The Penguin,\" and Shannon Murphy for \"Dying for Sex.\" Jessica Lee Gagné and Amanda Marsalis represent drama directing, while Ayo Edebiri and Lucia Aniello hold comedy directing positions.For the first time in Emmy history, at least one woman participated in each comedy writing nomination. Drama writing lacks female representation among the six nominated series, with Debora Cahn notably absent despite projections for \"The Diplomat.\" Three of five nominated limited series feature women writers.Also read: Game of Trolls: Why Bella Ramsey, 'The Last of Us', GOT star is facing a wave of online hateEmmy Awards 2025 ceremony detailsThe 77th Emmy Awards will be hosted by Nate Bargatze and broadcast live Sunday, September 14, at 8 p.m. ET/5 p.m. PT on CBS, with streaming available on Paramount+. The nominations were announced by Harvey Guillén and Brenda Song at the Television Academy's Wolf Theatre in North Hollywood.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onemmyblackwhite lotus and adolescencewhite lotusuzolincoln\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onemmyblackwhite lotus and adolescencewhite lotusuzolincoln(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Emmy nominations 2025 reveal 24 actors of color among 94 total nominees, marking lowest representation in five years while achieving milestones in gender and LGBTQ representation categories","url":"https://economictimes.indiatimes.com/news/international/us/emmys-2025-diversity-report-shows-decline-in-actors-of-color-despite-historic-nominations/articleshow/122526120.cms","image":"https://img.etimg.com/thumb/msid-122526376,width-1200,height-630,imgsize-54416,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-15 18:09:36","author":"Global Desklast Updated","authors":["Global Desklast Updated"],"language":"en","source_country":"in","sentiment":0.568},{"id":341912008,"title":"The autopen investigation and Biden’s last line of defense","text":"The congressional investigation into the Biden White House’s autopen use could chip away at that defense. Biden was three layers removed from the autopen operator on some of the clemency actions, for example, according to his own team’s account.\n\nOver time, we have seen a steady erosion of other defenses of Biden: that junior staffers had difficulty keeping up with him, that he had never been better, that he was prepared to maul his predecessor-turned-successor in their only presidential debate, that videos purporting to show him slowing down were misleading “cheap fakes,” if not quite deliberately altered deepfakes.\n\nNow, the top Biden spokeswoman who defended his energy and mental acuity has written her own book that refers to a “broken White House” right in the subtitle. Journalists who once said it was “lying” to suggest that Biden was somehow diminished now write, “Biden was in no position to keep doing his job given his condition, which had been evident for years to most people paying even casual attention.” Participants in the fundraiser at which footage of Biden being led off stage was said to be a “cheap fake” now say he was out of it.\n\nVirtually no one who wasn’t on Biden’s campaign payroll or related to him by blood or marriage would defend his debate performance. Indeed, the former president himself doesn’t defend it.\n\nIt has since been reported that there were discussions of having Biden use a wheelchair after the election. He has also been portrayed as unable to successfully execute basic campaign videos. A top communications adviser to former Vice President Kamala Harris was said to have developed an elaborate strategy to bolster her legitimacy if Biden died unexpectedly and she needed to assume the presidency all of a sudden. That last bit of preparation is part of the vice president’s job, of course, but the details don’t suggest much confidence in Biden’s ability to serve until his second term would have ended at 86.\n\nBiden’s top advisers have been described as “the politburo,” helping the first octogenarian president navigate the office and insulating him from public scrutiny to the best of their ability within the confines of a 24/7 news cycle. “Five people were running the country, and Joe Biden was at best a senior member of the board,” Tapper and Thompson report they were told.\n\nWhat hasn’t been proven is that Biden didn’t make presidential decisions himself or that he was unavailable when an important decision needed to be made, though the former has been alleged. House Speaker Mike Johnson (R-LA) has said Biden did not appear to understand his own administration’s liquefied natural gas policy after the Louisianan was finally able to secure a one-on-one meeting with the then-president. Donald Trump repeatedly argued as far back as the 2020 campaign that Biden would not be the one calling the shots if elected. Trump has claimed vindication on this score since returning to the Oval Office.\n\nMaybe it will never be proven. Biden’s tight-knit operation may be impenetrable to outside investigators. Maybe it is simply not true. Maybe, as Democrats insisted when Biden ended his reelection bid but remained in office, he had deteriorated as a campaigner but could still handle the rigors of governing.\n\n“While Biden on a day-in, day-out basis could certainly make decisions and assert wisdom and act as President, there were several significant issues that complicated his Presidency: a limit to the hours in which he could reliably function and an increasing number of moments when he seemed to freeze up, lose his train of thought, forget the names of top aides, or momentarily not remember friends he’d known for decades,” Thompson and Tapper write. “Not to mention impairments to his ability to communicate — ones unrelated to his lifelong stutter.”\n\nBut even if we accept that Biden had good days and bad days, it raises the questions: How were decisions made, and how was the president handled during the bad days? How long were the bad days? What was the ratio of bad to good? Did this affect how the vast federal bureaucracy was supervised? Most importantly, was presidential power ever exercised by someone other than the president, even if they believed they were acting in accordance with his wishes?\n\nThose are the answers autopen investigators will seek, despite efforts to muddy the waters, knowing how poorly some past defenses of Biden have fared under closer inspection.","summary":"When a spate of books detailing former President Joe Biden’s age-related struggles in office and alleging his frailties were concealed from the public was released, his team retained one last line of defense. “There is nothing in this book that shows Joe Biden failed to do his job, as the authors have alleged, nor did [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3471511/autopen-investigation-biden-last-line-defense/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/biden_autopen_defense.webp.webp","video":null,"publish_date":"2025-07-15 18:01:07","author":"W. James Antle III","authors":["W. James Antle III"],"language":"en","category":"politics","source_country":"US","sentiment":-0.326},{"id":341899536,"title":"Constitutional scholar uses Biden autopen to flip Dems’ ‘democracy’ script against them: ‘Scandal’","text":"Constitutional legal scholar Randy Barnett admonished Democrats' rhetoric claiming democracy is at risk under the Trump administration when \"the biggest constitutional scandal in US history\" played out under the Biden administration with the use of the autopen. \"For all the talk of a ‘constitutional crisis' or threats to ‘our democracy’ having the executive branch systematically run by unknown subordinates of a mentally incompetent president is the biggest constitutional scandal in US history – it’s called into question the legality of official acts done in his name but without proper authority,\" Barnett posted to X Monday. \"Southern secession was a ‘constitutional crisis,’\" Barnett added in a follow-up message Tuesday. \"This is a constitutional scandal.\" Barnett, a Georgetown University law professor who serves as the director of the Georgetown Center for the Constitution, was referring to an interview former President Joe Biden conducted with the New York Times defending his use of an autopen. Biden said he orally approved a long list of clemency and pardon actions at the end of his tenure, but that his aides used the autopen to officiate the actions. BIDEN CHIEF OF STAFF REPORTEDLY GAVE APPROVAL FOR AUTOPEN PARDONS ON FINAL DAY IN OFFICE Amid the Biden autopen controversy, Democratic lawmakers and left-wing media pundits have continued slamming Trump as a threat to democracy – which was a common talking point during the election cycle – and claiming his actions as president, such as deporting illegal immigrants and revoking visa privileges for some foreign students, have thrown the U.S. into a constitutional crisis. Biden told the Times that he was aware of every pardon ahead of leaving office in 2024, which included clemency and commutation actions related to 2,500 nonviolent drug offenders in his final weeks in office alone. \"I made every decision,\" Biden told the Times in a phone interview earlier in July that was published Sunday. He added that staff used the autopen for the pardons and commutations \"because there were a lot of them.\" \"Mr. Biden did not individually approve each name for the categorical pardons that applied to large numbers of people, he and aides confirmed,\" the Times reported. \"Rather, after extensive discussion of different possible criteria, he signed off on the standards he wanted to be used to determine which convicts would qualify for a reduction in sentence.\" BIDEN DEFENDS CONTROVERSIAL AUTOPEN USE FOR MASS CLEMENCY DECISIONS IN NYT INTERVIEW: 'A WHOLE LOT OF PEOPLE' Biden also pardoned Anthony Fauci, former chief medical advisor to the president; former Chairman of the Joint Chiefs of Staff Mark Milley; and members of the House committee that investigated the Jan. 6, 2021, Capitol riots. Less than half an hour before Trump became president, Biden also pardoned members of his family, including his brothers James B. Biden and Francis W. Biden, sister Valerie Biden Owens and brother-in-law John T. Owens. Autopen signatures are produced by a machine, as opposed to an authentic, handwritten signature. The conservative Heritage Foundation's Oversight Project first investigated the Biden administration's use of an autopen earlier in 2025 and found that the same signature was on a bevvy of executive orders and other official documents, while Biden’s signature on the document announcing his departure from the 2024 race varied from the apparent machine-produced signature. The use of the autopen follows years of mounting concern that Biden's mental acuity and health were deteriorating, which hit a fever pitch during the 2024 campaign cycle following the president's disastrous debate performance against Trump. Biden ultimately dropped out of the race on July 21, 2024, and endorsed then-Vice President Kamala Harris to run in his place. Since reclaiming the Oval Office, Trump has balked at his predecessor's use of the autopen, claiming Biden's staff allegedly used the pen to sign off on presidential actions unbeknownst to Biden. \"I guarantee you he knew nothing about what he was signing, I guarantee you,\" Trump said Monday when asked about Biden's interview with the Times. TRUMP RESPONDS TO BIDEN DISMISSAL OF AUTOPEN PROBE, SAYS HE DIDN'T KNOW 'WHAT WAS GOING ON' Biden's interview follows Trump sending a memo to the Department of Justice in June directing Attorney General Pam Bondi to investigate whether Biden administration aides conspired to deceive the public about his mental state, and simultaneously used an autopen to sign key presidential actions. TRUMP ORDERS ATTORNEY GENERAL TO INVESTIGATE BIDEN'S AUTOPEN USE AMID COGNITIVE DECLINE CONCERNS \"In recent months, it has become increasingly apparent that former President Biden's aides abused the power of Presidential signatures through the use of an autopen to conceal Biden's cognitive decline and assert Article II authority,\" Trump wrote in his letter. \"This conspiracy marks one of the most dangerous and concerning scandals in American history. The American public was purposefully shielded from discovering who wielded the executive power, all while Biden's signature was deployed across thousands of documents to effect radical policy shifts.\" Biden said in his New York Times interview that Trump and other Republicans are \"liars\" for claiming he was incapacitated as president and that his aides used the pen for official presidential actions. CLICK TO GET THE FOX NEWS APP \"They’re liars. They know it. They know, for certain. I mean, this is – look, what they, they’ve had a pretty good thing going here. They’ve done so badly. They’ve lied so consistently about almost everything they’re doing. The best thing they can do is try to change the focus and focus on something else. And this is a – I think that’s what this is about,\" he said.","summary":"Constitutional scholar Randy Barnett calls Biden&apos;s autopen use &quot;the biggest constitutional scandal in US history&quot; as questions arise about the legality of presidential actions.","url":"https://www.foxnews.com/politics/constitutional-scholar-uses-biden-autopen-flip-dems-democracy-script-against-them-scandal","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/04/931/523/joe-biden-solo.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 17:59:49","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.29},{"id":341893140,"title":"Shapiro and McCormick preach unity at Pennsylvania energy summit","text":"Shapiro said he spent two years as the only governor in the country with a divided state legislature, so any bill that got to his desk had to have bipartisan support.\n\nThat was the overarching theme of “Investing Big in Pennsylvania: A Case Study,” a panel discussion featuring Shapiro, McCormick, Dr. Neeli Bendapudi, the president of Pennsylvania State University, and Amazon Web Services CEO Matt Garman.\n\nPennsylvania has become a key swing state during recent presidential elections. President Donald Trump won it en route to a shocking upset victory in 2016, narrowly lost it four years later, and won it back last fall to retake the White House.\n\nIts statewide leadership reflects that balance. McCormick ousted three-term Democratic Sen. Bob Casey last fall, while Pennsylvania’s other senator, John Fetterman, is a Democrat who has flirted with the MAGA movement since taking office in 2023.\n\nDuring the panel discussion, McCormick was happy to advance the unity theme as well.\n\n“I want to come to a place that has all those ingredients and has uniform political leadership,” he said. “The governor [Shapiro] and I are from different parties. We have plenty of differences, but on this we agree. Senator Fetterman was at dinner last night. On this, we agreed.”\n\nShapiro was a rumored vice presidential candidate last year, though former Vice President Kamala Harris ultimately looked elsewhere. Some believe he could be gearing up for a run at the White House in three years. \n\nMuch of Trump’s Cabinet was on hand for the summit, including Energy Secretary Chris Wright, Treasury Secretary Scott Bessent, and Commerce Secretary Howard Lutnick, along with Trump. However, Shapiro sidestepped criticism of the Trump administration during his appearance.\n\nInstead, he emphasized the importance of creating jobs for the 62% of Keystone State residents without a college degree and winning the technology innovation race.\n\n“This is a global race for both energy dominance and AI dominance,” Shapiro said. “We do not want China to beat us in this AI race.”\n\nThe word “bipartisan” was mentioned seven times during the discussion, and Garman even said he was on a “tripartisan” panel, adding the commercial sector to the two major political parties.\n\nShapiro emphasized that voters win when the two parties work together.\n\n“We brought together a bipartisan group of lawmakers to put more than a billion dollars of new funding into economic development,” he said. “So we’ve got some tools now to get these deals done.”","summary":"PITTSBURGH — Gov. Josh Shapiro (D-PA) sauntered into a Republican-heavy energy summit in western Pennsylvania on Tuesday and preached a unity message alongside Sen. Dave McCormick (R-PA). “When I sit down with my colleagues in the Democratic Party or the Republican Party, House or Senate, what I&#8217;m always trying to do is find the areas where we can actually agree, [&#8230;]","url":"https://www.washingtonexaminer.com/news/3471708/josh-shapiro-pennsylvania-summit-dave-mccormick-unity/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/SHAPIRO_PITTSBURGH_ENERGY_SUMMIT-18-1024x682.webp","video":null,"publish_date":"2025-07-15 17:49:05","author":"Haisten Willis","authors":["Haisten Willis"],"language":"en","source_country":"US","sentiment":0.106},{"id":341902666,"title":"Fox News Lands Licensing Deal With Popular 'Ruthless' Podcast As Part Of Expansion Into New Media","text":"FOX News Media announced Tuesday it has landed a licensing deal with the popular \"Ruthless\" podcast as part of the company's expansion of new media. \"The FOX News Media ecosystem we have built over the past seven years continues to thrive and set new records, and the ‘Ruthless’ deal is a natural extension of our powerhouse brand as audiences reshape how they consume quality content,\" FOX News Media CEO Suzanne Scott said in a statement Tuesday. \"We have cultivated an unrivaled bench of successful personalities who are well-positioned to excel in today’s evolving media landscape, where podcasting offers the kind of deep engagement our platforms are known for.\" Fox News Digital President and Editor-in-Chief Porter Berry will be expanding his role to oversee the new media venture. \"Porter is a talented executive whose leadership will enhance these new media ventures and creators, while further strengthening FOX News Digital,\" Scott said. \"I am honored to step into the New Media role and advance Suzanne’s bold vision across digital, social, and podcasting,\" Berry said. \"As the creator economy continues to evolve — a spirit that 'Ruthless' has championed from the start — we are expanding our reach to meet audiences wherever they engage with FOX News Media content, which remains in a league of its own.\" The \"Ruthless\" co-hosts said in a joint statement, \"We are thrilled to take ‘Ruthless’ to the next level through this strategic partnership. There is a growing appetite for authentic political and cultural conversations, and our podcast delivers with no-holds-barred, irreverent takes that deeply resonate with our dedicated audience.\" What began as a tiny audio podcast has become one of the most iconic conservative brands in the digital age. \"Ruthless\" was launched in October 2020 by Republican strategist Josh Holmes and the internet personality known as Comfortably Smug with the mission of bringing fun to conservative politics. Liberals were immediately incensed by its name as \"Ruthless\" made its debut just days after the death of Supreme Court Justice Ruth Bader Ginsburg. \"We felt like there was a real hole in the conservative media landscape for people who enjoy politics, but want to have fun while doing it. They want to know what’s really going on, but could do without the ideological lecture,\" Holmes told Fox News Digital at the time of the launch. Michael Duncan and John Ashbrook, who worked alongside Holmes in their day jobs at their consulting firm Calvary, would later join \"Ruthless\" as co-hosts, rounding out the personalities on the \"variety progrum.\" \"Ruthless\" has since become a must-stop for GOP lawmakers, congressional candidates, and presidential hopefuls. The hosts set up shop outside Fiserv Forum in Milwaukee, Wisconsin for the first GOP presidential debate in August 2023 and the RNC convention in July 2024, providing NFL-style event coverage. In October 2024, they were later joined by future Vice President J.D. Vance for a special fishing trip competition. In addition to tackling the news of the day and hot-button discussions among Republicans, which the hosts often refer to as giving the audience their \"vegetables,\" they also provide plenty of \"candy\" whether it's in the form of animal news and debates over what's the largest animal they think they can kill with their bare hands, their takedowns of the liberal media, or playing their signature games. Those include \"Dem or Journo,\" where the hosts have to guess which of four social media posts was written by a Democratic operative versus members of the media, and \"Veep or Veep,\" the Biden-era challenge of deciphering whether a quote came from then-Vice President Kamala Harris or the fictitious Selina Meyer played by Julia Louis-Dreyfus on HBO's \"Veep.\" Perhaps the most high-stakes game is their weekly \"King of the Hill,\" where two hosts compete over which \"Never Trump\" pundit of their choosing has the most wild hot takes posted on social media in the past week. They've also taken fun to X with their annual NCAA-style Liberal Hack Tournament (or #HackMadness). \"Ruthless\" listeners fill out brackets of 64 liberal media figures and vote in polls conducted by Smug on who they think is the biggest hack. The \"Ruthless\" co-hosts have sought to bridge the divide among conservatives between the more traditional, establishment Republicans and the MAGA base. Holmes, Duncan and Ashbrook are all veteran staffers of outgoing Sen. Mitch McConnell, R-Ky., while Smug cultivated his following on the online right. But perhaps at the center of the podcast's growing audience is the trust the co-hosts have earned from their listeners. Holmes, Smug, Duncan and Ashbrook aren't afraid to discuss hard truths for conservatives over the years, from tackling Trump's defeat in the 2020 election to the underwhelming 2022 midterm results for Republicans. They also provide insight from their experience on Capitol Hill to explain the complexities of legislation, most recently the passing of the One Big Beautiful Bill. Politico dubbed \"Ruthless\" stars the \"bad boys of conservative talk\" with many outlets declaring the podcast the right's answer to \"Pod Save America,\" the influential left-wing podcast hosted by former Obama aides and speechwriters often referred to as \"Obama Bros.\" A recent poll conducted by National Research, Inc. found that \"Ruthless\" is a top news source among men ages 18-45. The influence of \"Ruthless\" reached all the way to the White House as Ashbrook was among the first to sit in the \"new media\" seat established by the Trump administration for the White House press briefing, which wasn't to the elite media's liking. \"I've interacted with a lot of these same reporters as a press secretary back in the day. So, when I walked into the room, I saw a lot of eye rolls and a lot of smirks and that is exactly what I was hoping for,\" Ashbrook told Fox News' Will Cain in January. Smug signs off every podcast by telling listeners,\" \"Keep the faith, hold the line, and own the libs… Stay ruthless.\" New episodes of \"Ruthless\" are released every Tuesday and Thursday on all podcast platforms and YouTube.","summary":"","url":"https://www.outkick.com/culture/fox-news-lands-licensing-deal-popular-ruthless-podcast-part-expansion-new-media","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/07/screenshot-2025-07-15-at-12.42.43 pm.png","video":null,"publish_date":"2025-07-15 16:53:38","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"us","sentiment":0.475},{"id":341884712,"title":"Mike Lawler's Chances of Beating Kathy Hochul to Flip New York—Polls","text":"Republican Representative Mike Lawler of New York has reportedly moved closer to potentially entering the 2026 New York gubernatorial race, seeking a meeting with President Donald Trump to discuss his prospects.Why It MattersNew York has long been a Democratic stronghold in gubernatorial contests. However, discontent with Hochul's administration, as expressed in multiple polls, suggests a potentially competitive race in 2026.Lawler's entry could split the Republican vote or boost the party's chances, depending on intra-party unity. Other Republicans potentially running include U.S. Representative Elise Stefanik and Nassau County Executive Bruce Blakeman.Control of the governor's mansion in New York carries significant policy and political implications—impacting both the state's direction and the 2026 national midterms.What To KnowLawler confirmed plans to consult with President Donald Trump before deciding on a run.He emphasized that Republican success depends on party unity, telling NewsNation on Sunday, \"Any effort, time or money wasted in a primary is money, time and effort not spent defeating Kathy Hochul next year.\"Newsweek reached out to the offices of Lawler, Stefanik and Hochul via email for comment.What Polls ShowPolling data provides a rough picture of Lawler's chance of flipping New York from Democratic to Republican control. Several recent surveys show both vulnerabilities in Hochul's support and the hurdles Lawler would face in a statewide contest.A Siena College Research Institute poll of 800 New York State voters, conducted June 23 to 26 with a margin of error of plus-minus 4.3 percentage points, showed that Hochul leads in a hypothetical primary and general election.In the Republican primary, Lawler earns 18 percent support, behind Stefanik, who earns 35 percent, and ahead of Blakeman at 7 percent.In a potential general election matchup, Stefanik loses to Hochul by 24 points (47 percent to 23 percent), while Hochul leads Lawler by 20 points (44 percent to 24 percent).A Harper Polling survey conducted between May 7 and 9 among 600 likely voters, with a plus-minus 4 percent margin of error, tested Hochul in direct matchups against Lawler and Stefanik.Initially, Hochul led Lawler 48 percent to 41 percent. After voters saw more information about the candidates, the race tightened to a statistical tie: 44 percent for Hochul, 43.4 percent for Lawler. Regionally, Lawler outperformed Stefanik in key suburban and upstate battlegrounds, though Hochul held a large lead in New York City.Broad dissatisfaction with Hochul is evident: Only 30 percent of New Yorkers statewide approve of her job performance, according to a May 2025 co/efficient poll sampling 1,163 likely voters. Roughly 57 percent disapprove of the job she's doing and just 23 percent believe she deserves reelection.Across multiple polls, around 55 to 66 percent of respondents expressed a desire for a new governor. Lawler remains a second-choice candidate in most Republican primary surveys, but his positioning in regions outside New York City could be an asset in the general election.In the co/efficient May 2025 poll, Stefanik led the Republican primary with 56 percent, compared to Lawler's 9 percent and Blakeman's 8 percent. While Trump previously endorsed Lawler's House reelection, Stefanik appears to retain more support for a potential gubernatorial bid.While Trump came closer in 2024 to winning New York than any Republican presidential candidate since George H.W. Bush, the president still lost by 12 points even when turnout in Democrat-heavy New York City was down and Republican turnout statewide was elevated.Stefanik, who is arguably closer ideologically to Trump than 2022 GOP gubernatorial candidate Lee Zeldin, would likely have to differentiate herself enough from a figure like the president.What People Are SayingDavid Laska, spokesperson for the New York GOP, to Newsweek: \"Our New York Republican bench is deep: both Mike Lawler and Elise Stefanik know how to raise money, deliver a principled message, and win in New York. Either would be an outstanding candidate and make a great governor. Whomever our candidate is, Kathy Hochul isn't getting much sleep these days.\"Denny Salas, executive vice president of Gotham Government Relations, to Newsweek: \"A hypothetical Hochul-Lawler race could highlight differences in experience, style and regional appeal. Lawler has a moderate record and success winning a Democratic-leaning Hudson Valley district (Kamala Harris won NY-17 with 63 percent of the vote), and is positioned to make inroads with independents and disaffected Democrats—something most Republicans can't do in New York.\"Hochul still has some advantages: a formidable war chest of $17.5 million, incumbency, and the ability to point to policy wins—such as crime reduction and childcare expansion—giving her a strong record to run on. Lawler's challenge would be to overcome big Democratic margins statewide and convince voters he can protect core services, especially with his record of voting for substantial Medicaid cuts in the OBBB [One Big Beautiful Bill], which will inevitably affect low-income New Yorkers.\"What Happens NextThe New York gubernatorial election is scheduled for November 3, 2026. No Republican, including Lawler, has officially announced a candidacy as of today.As majorities of voters indicate a desire for leadership change and a significant share remain undecided or unfamiliar with the primary candidates, subsequent polling and campaign developments will determine if Lawler or another Republican can mount a credible challenge to Hochul's incumbency.","summary":"A New York GOP official told Newsweek that whether Rep. Mike Lawyer or Rep. Elise Stefanik are ultimately the nominee, Republicans have \"a deep bench.\"","url":"https://www.newsweek.com/mike-lawler-kathy-hochul-stefanik-governor-new-york-2099269","image":"https://d.newsweek.com/en/full/2683654/mike-lawler.jpg","video":null,"publish_date":"2025-07-15 16:50:58","author":"Nick Mordowanec","authors":["Nick Mordowanec"],"language":"en","source_country":"US","sentiment":0.045},{"id":341863882,"title":"Fox News lands licensing deal with popular 'Ruthless' podcast as part of expansion into new media","text":"FOX News Media announced Tuesday it has landed a licensing deal with the popular \"Ruthless\" podcast as part of the company's expansion into new media. \"The FOX News Media ecosystem we have built over the past seven years continues to thrive and set new records, and the ‘Ruthless’ deal is a natural extension of our powerhouse brand as audiences reshape how they consume quality content,\" FOX News Media CEO Suzanne Scott said in a statement Tuesday. \"We have cultivated an unrivaled bench of successful personalities who are well-positioned to excel in today’s evolving media landscape, where podcasting offers the kind of deep engagement our platforms are known for.\" ‘RUTHLESS’ SKYROCKETS TO #1 ON POLITICAL PODCAST CHART DAYS AFTER POLITICO RUNS HIT PIECE ON CONSERVATIVE SHOW Fox News Digital President and Editor-in-Chief Porter Berry will be expanding his role to oversee the new media venture. \"Porter is a talented executive whose leadership will enhance these new media ventures and creators, while further strengthening FOX News Digital,\" Scott said. \"I am honored to step into the New Media role and advance Suzanne’s bold vision across digital, social, and podcasting,\" Berry said. \"As the creator economy continues to evolve — a spirit that 'Ruthless' has championed from the start — we are expanding our reach to meet audiences wherever they engage with FOX News Media content, which remains in a league of its own.\" The \"Ruthless\" co-hosts said in a joint statement, \"We are thrilled to take ‘Ruthless’ to the next level through this strategic partnership. There is a growing appetite for authentic political and cultural conversations, and our podcast delivers with no-holds-barred, irreverent takes that deeply resonate with our dedicated audience.\" What began as a tiny audio podcast has become one of the most iconic conservative brands in the digital age. \"Ruthless\" was launched in October 2020 by Republican strategist Josh Holmes and the internet personality known as Comfortably Smug with the mission of bringing fun to conservative politics. Liberals were immediately incensed by its name as \"Ruthless\" made its debut just days after the death of Supreme Court Justice Ruth Bader Ginsburg. \"We felt like there was a real hole in the conservative media landscape for people who enjoy politics, but want to have fun while doing it. They want to know what’s really going on, but could do without the ideological lecture,\" Holmes told Fox News Digital at the time of the launch. RUTHLESS PODCAST TO REPUBLICANS: IF THE MEDIA ASKS YOU ABOUT LIZ CHENEY, 2020 ELECTION, TELL'EM TO ‘F--- OFF’ Michael Duncan and John Ashbrook, who worked alongside Holmes in their day jobs at their consulting firm Calvary, would later join \"Ruthless\" as co-hosts, rounding out the personalities on the \"variety progrum.\" \"Ruthless\" has since become a must-stop for GOP lawmakers, congressional candidates, and presidential hopefuls. The hosts set up shop outside Fiserv Forum in Milwaukee, Wisconsin for the first GOP presidential debate in August 2023 and the RNC convention in July 2024, providing NFL-style event coverage. In October 2024, they were later joined by future Vice President J.D. Vance for a special fishing trip competition. In addition to tackling the news of the day and hot-button discussions among Republicans, which the hosts often refer to as giving the audience their \"vegetables,\" they also provide plenty of \"candy\" whether it's in the form of animal news and debates over what's the largest animal they think they can kill with their bare hands, their takedowns of the liberal media, or playing their signature games. Those include \"Dem or Journo,\" where the hosts have to guess which of four social media posts was written by a Democratic operative versus members of the media, and \"Veep or Veep,\" the Biden-era challenge of deciphering whether a quote came from then-Vice President Kamala Harris or the fictitious Selina Meyer played by Julia Louis-Dreyfus on HBO's \"Veep.\" Perhaps the most high-stakes game is their weekly \"King of the Hill,\" where two hosts compete over which \"Never Trump\" pundit of their choosing has the most wild hot takes posted on social media in the past week. RUTHLESS PODCAST PLAYS ‘VEEP OR VEEP’ USING QUOTES FROM KAMALA HARRIS, FICTIONAL VP SELINA MEYER They've also taken fun to X with their annual NCAA-style Liberal Hack Tournament (or #HackMadness). \"Ruthless\" listeners fill out brackets of 64 liberal media figures and vote in polls conducted by Smug on who they think is the biggest hack. The \"Ruthless\" co-hosts have sought to bridge the divide among conservatives between the more traditional, establishment Republicans and the MAGA base. Holmes, Duncan and Ashbrook are all veteran staffers of outgoing Sen. Mitch McConnell, R-Ky., while Smug cultivated his following on the online right. But perhaps at the center of the podcast's growing audience is the trust the co-hosts have earned from their listeners. Holmes, Smug, Duncan and Ashbrook aren't afraid to discuss hard truths for conservatives over the years, from tackling Trump's defeat in the 2020 election to the underwhelming 2022 midterm results for Republicans. They also provide insight from their experience on Capitol Hill to explain the complexities of legislation, most recently the passing of the One Big Beautiful Bill. Politico dubbed \"Ruthless\" stars the \"bad boys of conservative talk\" with many outlets declaring the podcast the right's answer to \"Pod Save America,\" the influential left-wing podcast hosted by former Obama aides and speechwriters often referred to as \"Obama Bros.\" A recent poll conducted by National Research, Inc. found that \"Ruthless\" is a top news source among men ages 18-45. The influence of \"Ruthless\" reached all the way to the White House as Ashbrook was among the first to sit in the \"new media\" seat established by the Trump administration for the White House press briefing, which wasn't to the elite media's liking. \"I've interacted with a lot of these same reporters as a press secretary back in the day. So, when I walked into the room, I saw a lot of eye rolls and a lot of smirks and that is exactly what I was hoping for,\" Ashbrook told Fox News' Will Cain in January. RUTHLESS PODCAST HOSTS MOCK POD SAVE AMERICA FOR ‘BULLS--- COPY’ OF VIRAL ‘LIBERAL HACK TOURNAMENT’ CLICK HERE TO GET THE FOX NEWS APP Smug signs off every podcast by telling listeners,\" \"Keep the faith, hold the line, and own the libs… Stay ruthless.\" New episodes of \"Ruthless\" are released every Tuesday and Thursday on all podcast platforms and YouTube.","summary":"FOX News Media announced Tuesday a licensing deal with the popular &quot;Ruthless&quot; podcast, hosted by Josh Holmes, Comfortably Smug, Michael Duncan and John Ashbrook.","url":"https://www.foxnews.com/media/fox-news-lands-licensing-deal-popular-ruthless-podcast-part-expansion-new-media","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/ruthless-hosts.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 16:17:42","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"us","sentiment":0.555},{"id":341863874,"title":"Colbert slams Paramount for settling with Trump, accuses his parent company of offering a 'big fat bribe'","text":"Late-night host Stephen Colbert unleashed on Paramount, his employer, for settling with President Donald Trump in his election interference lawsuit against the company over a \"60 Minutes\" interview. Both that program and \"The Late Show With Stephen Colbert\" air on Paramount-owned CBS. \"I believe this kind of complicated financial sentiment with a sitting government official has a technical name in legal circles. It’s ‘big fat bribe,’ because it all comes as Paramount’s owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance!\" Colbert said. Paramount, CBS' parent company, agreed on July 1 to pay the president a sum that could reach north of $30 million to settle Trump’s election interference lawsuit against the network. Colbert joked that Paramount issued a statement that read, \"You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16 million. We need the cash.\" FAIR ELECTION FUND URGES FCC TO HOLD CBS ACCOUNTABLE FOR 'UNLAWFUL CONDUCT’ RELATED TO ’60 MINUTES’ INTERVIEW \"Some of the TV typers out there are blogging that once Skydance gets CBS, the new owners’ desire to please Trump will ‘put pressure on late-night host and frequent Trump critic Stephen Colbert,’\" he said, stroking his mustache. \"Okay, but how are they going to put pressure on Stephen Colbert… if they can’t find him?\" Trump was seeking $20 billion in his lawsuit against CBS over its handling of a \"60 Minutes\" interview last year with then-Vice President Kamala Harris, accusing the network of election interference leading up to the 2024 contest. CBS is not acknowledging any journalistic wrongdoing with the settlement. The lawsuit alleged CBS News deceitfully edited an exchange Harris had with \"60 Minutes\" correspondent Bill Whitaker, who asked her why Israeli Prime Minister Benjamin Netanyahu wasn't \"listening\" to the Biden administration. Harris was widely mocked for the \"word salad\" answer that aired in a preview clip of the interview on CBS' \"Face the Nation,\" but the edited response that aired during a \"60 Minutes\" primetime special depicted Harris giving a more concise and direct answer. TOP '60 MINUTES' PRODUCER RESIGNS FROM SHOW, CITES LACK OF INDEPENDENCE Fox News Digital reached out to Paramount and CBS for comment, but did not immediately hear back. Colbert also called out his Paramount bosses in May over reports that controlling shareholder Shari Redstone put pressure on \"60 Minutes\" to avoid critical coverage of the president amid the lawsuit. CBS staffers were outraged over the settlement, which also prompted extensive backlash from media watchdogs, journalism advocacy groups, liberal journalists and even Democratic lawmakers. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Sen. Bernie Sanders, I-Vt., issued a scathing statement that said the settlement sets an \"extremely dangerous precedent in terms of both the First Amendment and government extortion,\" while Sen. Ron Wyden, D-Ore., accused Paramount of taking a \"bribe\" and threatened future federal charges. CLICK HERE TO GET THE FOX NEWS APP Fox News' Brian Flood and Joseph Wulfsohn contributed to this report.","summary":"Stephen Colbert went off on his employer, Paramount, on Monday after the company decided to settle with President Trump in his lawsuit against the network.","url":"https://www.foxnews.com/media/colbert-slams-paramount-settling-trump-accuses-his-parent-company-offering-big-fat-bribe","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/colbert-rips-paramount.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 16:00:59","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"us","sentiment":-0.368},{"id":341872984,"title":"Federal Judge Rules ICE Engages In Racial Profiling, DHS Denies It (While ICE Director Admits It)","text":"Source: Carlin Stiehl / Getty Just last month, the Los Angeles Times published an article titled “Fears of racial profiling rise as Border Patrol conducts ‘roving patrols,’ detains U.S. citizens.” The article quoted the American Civil Liberties Union of Southern California, which said, “We are seeing ICE come into our communities to do indiscriminate mass arrests of immigrants or people who appear to them to be immigrants, largely based on racial profiling.” The Department of Homeland Security wasn’t thrilled about this article, saying in a statement, “Any claims that individuals have been ‘targeted’ by law enforcement because of their skin color are disgusting and categorically FALSE.” Well, it only took a few short weeks for a federal judge to order the Trump administration to stop allowing ICE agents in southern California from “indiscriminately” arresting people based on — you guessed it — racial profiling. According to USA Today, on July 2, a group of immigration advocates and five people arrested by ICE filed a lawsuit against the DHS over what it called a “common, systematic pattern” of arresting brown people in the Los Angeles area based on their perceived race. In fact, the plaintiffs alleged that the area had come “under siege” by masked immigration agents “flooding street corners, bus stops, parking lots, agricultural sites, day laborer corners, and other places,” and arresting people or forcibly detaining them for questioning after targeting them because of their skin color, because they spoke Spanish, because they spoke English with an accent and/or because of their occupation. The suit also claimed those arrested were denied access to lawyers and held in “dungeon-like” facilities where some were “pressured” into accepting deportation. The judge agreed. From USA Today: Judge Maame Frimpong of the Central District of California wrote in her order that the group would likely succeed in proving that “the federal government is indeed conducting roving patrols without reasonable suspicion and denying access to lawyers.” Stopping the indiscriminate arrests was a “fairly moderate request,” she wrote. Her order granted an emergency request, and the lawsuit is ongoing. Mohammad Tajsar, an American Civil Liberties Union attorney representing the group that brought the lawsuit, said, “It does not take a federal judge to recognize that marauding bands of masked, rifle-toting goons have been violating ordinary people’s rights throughout Southern California.” “We are hopeful that today’s ruling will be a step toward accountability for the federal government’s flagrant lawlessness.” Unsurprisingly, DHS Assistant Secretary Tricia McLaughlin feels differently, accusing Frimpong of “undermining the will of the American people,” because, once again, a Trump administration official doesn’t seem to understand that federal law enforcement is supposed to follow the law, not the “will” of Trump voters, who, by the way, are not interchangeable with “the American people.” (It’s as if MAGA math has left these people completely unaware that while just over 77 million Americans voted for President Donald Trump, just over 75 million voted for former VP Kamala Harris.) “America’s brave men and women are removing murderers, MS-13 gang members, pedophiles, rapists,” McLaughlin claimed, conveniently ignoring the data that shows nearly half of ICE detainees either have no criminal record at all or have only been convicted of minor offenses, including traffic violations. McLaughlin also reiterated almost verbatim the DHS’s previous denial that ICE agents are making arrests based on skin color, calling them “disgusting and categorically FALSE.” “DHS enforcement operations are highly targeted, and officers do their due diligence,” she said. Here’s what I wrote about that last month: Part of the reason millions of people engaged in “No Kings” protests across the nation over the weekend is the people’s opposition to ICE tactics, which include raiding schools, workplaces and immigration courts to arrest allegedly undocumented migrants and set them up for deportation, often, without due process. Earlier this month, White House Chief of Staff Stephen Miller reportedly set a new quota for ICE agents to arrest 3,000 undocumented migrants each day. “Stephen Miller wants everybody arrested. ‘Why aren’t you at Home Depot? Why aren’t you at 7-Eleven?’” an ICE official claimed, according to a report in The Washington Examiner. So, if ICE agents are to increase the agency’s deportation numbers by going to Home Depot, 7-Elevens and other places they might expect to find undocumented migrants, how else would they know who to target for questioning, unless they were looking for people who looked and sounded like they might not be American? Also, if it’s true that ICE doesn’t engage in exactly the kind of racial profiling the plaintiffs described in their lawsuit, somebody should probably tell ICE Director Tom Homan that. “Look, people need to understand, ICE officers and Border Patrol don’t need probable cause to walk up to somebody, briefly detain them, and question them. They just need totality of the circumstances, right? They just go through the observation, get our typical facts — based on the location, the occupation, their physical appearance, their actions,” Homan declared during a recent appearance on Fox News. Apparently, Homan and the DHS need to sit down for a chat about their mixed messaging. Because somebody’s lying. SEE ALSO: ICE Masks Are Just Modern Ku Klux Klan Hoods [Op-Ed] ICE Agents Claim Assaults Are Reasons For Masks, But That’s A Lie","summary":"A federal judge ordered the Trump administration to stop allowing ICE agents in southern California from engaging in racial profiling.","url":"https://newsone.com/6307900/federal-judge-rules-ice-racial-profiling/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/07/17525923596895.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-07-15 15:30:07","author":"Zack Linly","authors":["Zack Linly"],"language":"en","source_country":"US","sentiment":-0.123},{"id":341833630,"title":"Jon Stewart and Stephen Colbert Face Uncertain Futures","text":"Jon Stewart and Stephen Colbert are the liberal faces of their networks, Comedy Central and CBS, respectively. They've been fixtures on the television circuit for decades. But under the second Trump administration and ahead of Paramount's proposed merger with Skydance Media, their futures seem uncertain.Newsweek has reached out to representatives for Stewart and Colbert via email.The ContextStewart and Colbert are stalwarts of the television world. Stewart is the long-running host of The Daily Show on Comedy Central, which he hosted from 1999 to 2015. He hosted The Problem with Jon Stewart on Apple TV+ from 2021 to 2023 and returned part time to The Daily Show in 2024.Colbert has hosted the CBS talk show The Late Show with Stephen Colbert since September 2015. Prior to that, he hosted the Comedy Central news satire show The Colbert Report from 2005 to 2014.Stewart and Colbert are liberal and have long been critical of President Donald Trump. After Trump won the 2024 presidential election against former Vice President Kamala Harris, Colbert said on his show: \"After a bizarre and vicious campaign fueled by a desperate need not to go to jail, Donald Trump has won the 2024 election\" and added: \"The deep shock and sense of loss is enormous.\"Stewart said during his U.S. election coverage, in part: \"I promise you, this is not the end. And we have to regroup, and we have to continue to fight, and continue to work day in and day out to create the better society for our children for this world.\"An Uncertain FutureThe media has long been populated with liberal voices—Colbert and Stewart are far from the only high-profile television figures to have spoken out against or criticized Trump.So why is the future specifically uncertain for the liberal faces of CBS and Comedy Central? It comes down, in part down to the Paramount-Skydance merger, and Paramount's recent settling of a lawsuit with Trump.Paramount Global agreed to pay $16 million to settle the lawsuit, which stemmed from a claim made by Trump that 60 Minutes unfairly edited a video with Harris to make her look better and bolster her election chances. CBS denied the claims and said that the edits were routine.Paramount, which owns CBS, settled the suit and said that the money will go to Trump's future presidential library and to pay his legal fees. It did not apologize or express regret. The deal was announced prior to a meeting with shareholders, according to the Associated Press.It has been reported that the company sought to put the issue to bed. It seeks the approval from the Trump administration for the merger with Skydance.News of the merger came in July 2024, when it was announced that the two companies would merge in a deal valued at $8 billion and form a new entity known as \"Paramount Skydance Corporation.\"The transaction is ongoing and is expected to close on or before October.The deal requires approval from the Federal Communications Commission, which is led by Brendan Carr, a Republican and Trump supporter.Skydance was founded by David Ellison in 2006, and his father, Larry Ellison, co-founder of the Oracle Corporation, is also involved in the operation of the company. Larry Ellison is investing $6 billion into the merger and is putting up a majority stake in the deal, according to a 2024 report from The Hill. Both men are Trump supporters.Shifting Media LandscapeNewsweek spoke with Matt Navarra, a news personality and social media consultant, about the shifting media landscape and the potential implications on Stewart and Colbert.Navarra said in a voice message shared with Newsweek that both men are \"iconic voices in political comedy,\" but that as Skydance edges in, \"Their future does hinge on a new leadership's appetite for their brand of satire.\"Newsweek also spoke with Rodney Benson, a professor in the Department of Media, Culture, and Communication and an affiliated faculty member of the Department of Sociology at New York University. He said that \"In a future company controlled by Skydance, it's easy to imagine that Stewart's and Colbert's shows could be short-lived.\"\"Whether as a matter of principle or to defend the consistency of their brand and to maintain the loyalty of their audience, neither host is going to suddenly start kowtowing to the Trump administration if that's the condition of staying,\" Benson said.\"Stewart has already positioned himself as fearless,\" Navarra said, pointing to Stewart's discussion of the lawsuit on The Daily Show on July 7. In it, Stewart joked: \"So the implication is you don't get your $8 billion merger...unless you give me a tremendous amount of money.... I'm obviously not a lawyer, but I did watch Goodfellas—that sounds illegal.\"\"It doesn't feel like scrutiny on news networks—it feels like fealty,\" Stewart continued on the show, adding, \"That they are being held to a standard that will never be satisfactory to Donald Trump. No one can ever kiss his ass enough.\" He also described the settlement as \"Flat-out protection money.\"Navarra said that \"he's doubled down on the idea that media integrity matters more than corporate appeasement.\"Of Colbert, Navarra said, \"He's more entwined with CBS' legacy of the late-night structure.\"They have to have what it takes to succeed independently, but not if it relies on old structures.\"So, what could be an alternative to these old structures? \"The thing to watch for is them signing first-look deals with Netflix, HBO or Audible, places that value strong, editorial voices,\" Navarra said.\"Voices like Stewart and Colbert either have to find sanctuary off network, thinking like streaming, nonprofits or tone down their edge if they're gonna stay within big media.\"Navarra added: \"I think we can expect fewer barbs on air, more nuanced comedy and soft-pedaled critiques, until independent platforms thrive.\" He said that he thinks the next wave of left-leaning media may \"emerge outside legacy platforms funded by subscribers rather than sponsors.\"Navarra also pointed to \"podcasts, streaming or independent media,\" where \"permissionless speech will thrive.\"Benson, meanwhile, said that\"It's possible to imagine that either show might find a home at Comcast's cable spinoff Versant, either as part of MSNBC or another channel. But Versant may not be particularly eager to be next in line to face the full-scale political wrath of this administration.\"\"No one wants to risk a protracted legal struggle and the threat this could pose to their bottom line.\"There is a real audience and a market for what they [Stewart and Colbert] have to offer, both creatively and politically,\" Benson continued. However, \"Their audiences are aging and declining (or at best holding steady), and this older audience is less likely to find the shows if they relocate to podcasts or other online platforms.\"Benson also pointed to Stewart and Colbert finding a place on a major streaming service, noting that if they are unable to do that, the hosts may struggle to attain the same audience reach.How their futures develop may also raise questions about the future of media.\"The question for me is, what is the future of independent reporting and commentary? Beyond the urgent civic need for such media in a democracy, there will also continue to be an audience and a market,\" Benson said.\"The future of independent media—whether left, center or non-Trumpian right—will be subscription-based and mostly behind a paywall. As such, independent media critical of Trump certainly won't disappear, but it could have less of an impact.\"What Happens NextThe deal regarding the Skydance-Paramount merger has been extended to October. The transaction is under review by the Federal Communications Commission.","summary":"\"They have to have what it takes to succeed independently, but not if it relies on old structures,\" one expert told Newsweek.","url":"https://www.newsweek.com/jon-stewart-stephen-colbert-future-paramount-skydance-cbs-comedy-central-trump-2097919","image":"https://d.newsweek.com/en/full/2681304/jon-stewart-stephen-colbert-face-uncertainty.png","video":null,"publish_date":"2025-07-15 13:53:02","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","category":"politics","source_country":"US","sentiment":-0.392},{"id":341833604,"title":"Republicans Are Selling 'Deport Zohran' Mamdani T-Shirts","text":"The New York Young Republican Club has started selling T-shirts with the slogan \"Deport Zohran,\" printed onto them, in a reference to state Assemblyman and New York City Democratic mayoral primary winner Zohran Mamdani.Newsweek has reached out to Mamdani's campaign and the New York Young Republican Club outside normal working hours via email for comment.Why It MattersMamdani defeated former Governor Andrew Cuomo in the ranked-choice Democratic contest in July, sending shockwaves through the party, which has struggled to recover from former Vice President Kamala Harris' loss in November. The race is being closely watched and seen as something of a litmus test for Democrats, as Mamdani's ascent represents a pivotal moment for the city and party.What To KnowThe T-shirts, which were described as \"Limited Edition,\" on X, formerly Twitter, retail for $45. The product description reads, in part: \"T-shirt made in the USA, unlike Zohran.\"Mamdani is an American citizen who was born in Uganda. If elected, he would become the city's first Muslim and first Indian American mayor.Republicans have been critical of Mamdani, and President Donald Trump has described him as a \"Communist Lunatic\". Trump, when asked about Mamdani's remarks about Immigration and Customs Enforcement, in which he said he would get them out of the city, said: \"Well, then we'll have to arrest him. We don't need a communist in this country, but if we have one, I'm going to be watching over him very careful on behalf of the nation.\"In response, Mamdani said: \"The President of the United States just threatened to have me arrested, stripped of my citizenship, put in a detention camp and deported. Not because I have broken any law but because I will refuse to let ICE terrorize our city.\"Some Republicans have called on the Trump administration to revoke Mamdani's citizenship and deport him, though none have presented any evidence to suggest that Mamdani has committed an act that could justify his removal from the United States.The rhetoric around Mamdani has been described as racist, bigoted and Islamophobic.And while the criticism and rhetoric around the campaign is loud, it seemingly has not slowed the campaign's momentum. Data for Progress polling puts Mamdani ahead of Cuomo and Mayor Eric Adams, both of whom are running as independent candidates.What People Are SayingZohran Mamdani previously wrote on X: \"Donald Trump is attacking me because he is desperate to distract from his war on working people. We must and we will fight back.\"President Donald Trump wrote on Truth Social: \"It's finally happened, the Democrats have crossed the line. Zohran Mamdani, a 100% Communist Lunatic, has just won the Dem Primary, and is on his way to becoming Mayor.\"The New York Young Republican Club, in a post on X: \"Get your very own Deport Zohran t-shirt and be part of the movement. Let's keep NYC great one deportation at a time.\"Senator Bernie Sanders wrote on X: \"Mamdani won. The establishment is in panic. Billionaires are raising money against him; Trump is ranting; Islamophobes are on the loose. They know what we know: Candidates who stand boldly with the working class can win not only in NYC, but anywhere. Let's stand with Zohran.\"What Happens NextNew York City voters will cast their ballots for their next mayor on November 4.","summary":"The shirts, sold by the New York Young Republican Club, come amid continual attacks and criticism from Republicans about Mamdani.","url":"https://www.newsweek.com/republicans-zohran-mamadani-deportation-t-shirts-donald-trump-2099109","image":"https://d.newsweek.com/en/full/2683411/zohran-mamdani.jpg","video":null,"publish_date":"2025-07-15 13:47:40","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":341814194,"title":"Poll Suggests Republicans Do The Unthinkable to Keep House Majority Through Midterms","text":"A new poll suggests that Republicans key to keeping the House majority may lie in embracing an Obama-era policy, as voters worry about healthcare coverage, according to a new poll.\n\nOriginally passed under the Patient Protection and Affordable Care Act, individuals who purchase health insurance themselves are eligible for healthcare premium tax credits. However, that credit is set to expire this year.\n\nAccording to a new poll by Fabrizio Ward, if Republicans were to extend that tax credit, it could help them better compete with Democrats, who are currently leading by three points over the typical Republican, and by seven points with motivated voters.\n\nThough the tax credit was initially passed during the Obama administration and amended under the Biden administration with the American Rescue Plan Act of 2021, the tax credit has bipartisan support.\n\nWhen asked about creating tax credits to help make it more affordable for families to buy health insurance, 79% of all participants supported the idea. Voters of President Donald Trump supported the proposal by 68%, while swing voters and those who voted for former Vice President Kamala Harris supported it by 78% and 91% respectively.\n\nA Republican who supports extending the tax credit could sway voters in their favor, extending their lead over Democrats six points on a generic ballot, and four points for motivated voters, according to the poll. But if Republicans allow the credit to expire, they face falling behind Democrats by 15 points.\n\nThe poll also found that the majority of voters want Americans to have healthcare coverage. When the poll added that potentially 5 million Americans could lose coverage if the tax credit expires, 73% of all participants said Congress should extend the tax credit, with 56% of Trump voters and 69% of swing voters agreeing with the sentiment.\n\nTrump's \"big, beautiful bill,\" which passed Congress earlier this month, includes steep cuts to Medicaid. In the next decade, the Congressional Budget Office estimates up to 11.8 million Americans could lose coverage, CBS News reported.\n\nThe cuts were met with intense backlash from Democrats and even caution from some Republicans. As the 2026 midterm elections approach, healthcare coverage is expected to be a major talking point among candidates and constituents.\n\nOriginally published on Latin Times","summary":"A new poll suggests that the key to Republicans holding onto their razor-thin House majority may lie in embracing a democrat-passed policy.","url":"https://www.ibtimes.com/poll-suggests-republicans-do-unthinkable-keep-house-majority-through-midterms-3778523","image":"https://d.ibtimes.com/en/full/3800046/ibtimes-logo.png","video":null,"publish_date":"2025-07-15 13:15:21","author":"Fabrizio Ward","authors":["Fabrizio Ward"],"language":"en","category":"politics","source_country":"US","sentiment":-0.401},{"id":341886994,"title":"Colbert Claims Bosses Gave Trump a 'Big, Fat Bribe,' Hints He Could Be Fired","text":"CBS’s Stephen Colbert returned from two weeks of vacation on Monday, sporting a new mustache and attacking his Paramount bosses for giving President Trump a “big, fat bribe” for settling his 60 Minutes lawsuit. The Late Show host would also continue his faux heroics by suggesting Skydance might pressure or even fire him if their merger with Paramount is approved.\n\nColbert began his phony shtick where he played the role of the little employee standing up to his corporate overlords by declaring, “And tonight, ladies and gentlemen, my mustache comes to you with a heavy heart because while I was on vacation, my parent corporation, Paramount, paid Donald Trump a $16 million settlement over his 60 Minutes lawsuit.”\n\nHe further decried the settlement “for a nuisance lawsuit Trump filed claiming that 60 Minutes deceptively edited their interview with then-candidate Kamala Harris last fall. Paramount knows they could have easily fought it because in their own words, ‘the lawsuit was completely without merit.’” \n\nOf course, 60 Minutes did deceptively edit the interview, but nevertheless Colbert added, “Now, unlike the payoffs from ABC and Twitter, Paramount's settlement did not include an apology. Instead—that's good. Instead the corporation released a statement where they said, ‘You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16 million. We need the cash.’”\n\nColbert then claimed the reason for the settlement is that Paramount wants to get on Trump’s good side, “Now, I believe this kind of complicated financial sentiment with a sitting government official has a technical meme in legal circles. It's 'Big, fat bribe' because it all comes as Paramount's owners are trying to get the Trump administration to approve the sale of our network to a new owner: Skydance.”\n\nIt’s ironic that Colbert mentioned the ABC lawsuit. Despite the settlement, ABC’s news coverage remains unchanged, This Week anchor George Stephanopoulos remains employed, and Jimmy Kimmel is still telling a disproportionate amount of Trump jokes. Yet, Colbert still raised the possibility that Skydance would target him, “Some of the TV typers out there are blogging that once Skydance gets CBS, the new owners' desire to please Trump could 'put pressure on late-night host and frequent Trump critic Stephen Colbert.' Okay, okay, but how are they going to put pressure on Stephen Colbert if they can't find him? And even if they do, and even if they do, Mr. Stephen always has his scented oil business to fall back on.”\n\nA lot of that discourse seems to be of clickbait from people who are trying to play into liberal fears of Trump using authoritarian tactics to shut down his critics. Colbert’s future may be in doubt given the uncertain future of the late night comedy talk show format, but the actual possibility that Colbert, by far the most watched late night host not named Greg Gutfeld, gets fired or isn’t re-signed after 2026 due to politics is highly unlikely.\n\nHere is a transcript for the July 14 show:\n\nCBS The Late Show with Stephen Colbert\n\n11:39 PM ET\n\nSTEPHEN COLBERT: And tonight, ladies and gentlemen, my mustache comes to you with a heavy heart because while I was on vacation, my parent corporation, Paramount, paid Donald Trump a $16 million settlement over his 60 Minutes lawsuit. \n\nAs someone who has always been a proud employee of this network, I am offended, and I don't know if anything will ever repair my trust in his company. But just taking a stab at it, I'd say $16 million would help. \n\nThis settlement is for a nuisance lawsuit Trump filed claiming that 60 Minutes deceptively edited their interview with then-candidate Kamala Harris last fall. Paramount knows they could have easily fought it because in their own words, “the lawsuit was completely without merit.” \n\nAnd keep in mind, Paramount produced Transformers: Rise of the Beasts. They know \"Completely without merit.\" \n\nNow, unlike the payoffs from ABC and Twitter, Paramount's settlement did not include an apology. Instead—that's good. Instead the corporation released a statement where they said, \"You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16 million. We need the cash.\" \n\nNow, I believe, what can I say? What can I say, [Turkish accent] \"Mr. Stephen loves to dance.”\n\nNow, I believe this kind of complicated financial sentiment with a sitting government official has a technical meme in legal circles. It's \"Big, fat bribe\" because it all comes as Paramount's owners are trying to get the Trump administration to approve the sale of our network to a new owner: Skydance.\n\nNot the music I was expecting, okay. That was me dancing in the sky. Some of the TV typers out there are blogging that once Skydance gets CBS, the new owners' desire to please Trump could \"Put pressure on late-night host and frequent Trump critic Stephen Colbert.\" Okay, okay, but how are they going to put pressure on Stephen Colbert if they can't find him? And even if they do, and even if they do, Mr. Stephen always has his scented oil business to fall back on.","summary":"CBS’s Stephen Colbert returned from two weeks of vacation on Monday, sporting a new mustache and attacking his Paramount bosses for giving President Trump a “big, fat bribe” for settling his 60 Minutes lawsuit. The Late Show host would also continue his faux heroics by suggesting Skydance might pressure or even fire him if their merger with Paramount is approved.\n\nColbert began his phony shtick where he played the role of the little employee standing up to his corporate overlords by declaring, “And tonight, ladies and gentlemen, my mustache comes to you with a heavy heart because while I was on vacation, my parent corporation, Paramount, paid Donald Trump a $16 million settlement over his 60 Minutes lawsuit.”\n\n \n\n\n\n\n\n \n\nHe further decried the settlement “for a nuisance lawsuit Trump filed claiming that 60 Minutes deceptively edited their interview with then-candidate Kamala Harris last fall. Paramount knows they could have easily fought it because in their own words, ‘the lawsuit was completely without merit.","url":"https://www.newsbusters.org/blogs/nb/alex-christy/2025/07/15/colbert-claims-bosses-gave-trump-big-fat-bribe-hints-he-could-be","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-07/2025-07-15-CBS-The%20Late%20Show-Colbert.jpg?itok=9t6AV3Rw","video":null,"publish_date":"2025-07-15 12:41:00","author":"Alex Christy","authors":["Alex Christy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.177},{"id":341811248,"title":"Former Army officer to challenge for Colorado Springs congressional district","text":"Jessica Killin, a former U.S. Army captain and chief of staff to former second gentleman Doug Emhoff, will look to flip the 5th Congressional District in 2026, she announced Tuesday.\n\nKillin, a Democrat, will take on freshman Republican U.S. Rep. Jeff Crank for the El Paso County district. The seat has long been a Republican stronghold, with Crank winning it by 14 percentage points in 2024.\n\nIn her announcement, she called out Crank’s vote for the omnibus tax-and-spending-cut bill recently signed into law by President Donald Trump.\n\n“Washington needs leaders who are focused on actually getting things done — not partisan name-calling and bitter culture wars,” Killin said in a statement announcing her candidacy. “The Pikes Peak Region deserves results-oriented, competent leadership. Instead, Jeff Crank has let his constituents down, voting to kick thousands off health care while raising the national debt by trillions.”\n\nBefore working for Vice President Kamala Harris’ husband, Killin was employed by the bank USAA, at which she worked on Veterans Administration home loans and against predatory lenders, according to her campaign. Her military service included time as a military police officer and as a paratrooper.\n\nShe is the fifth Democrat to declare for the seat, including 2024 candidates Joe Reagan and River Gassen.\n\nStay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"Jessica Killin, a Democrat, will take on freshman Republican U.S. Rep. Jeff Crank for the El Paso County district. Killin is a U.S. Army veteran, lawyer and former chief of staff to former second gentleman Doug Emhoff.","url":"https://www.denverpost.com/2025/07/15/jessica-killin-democrat-colorado-5th-congressional-district-2026/","image":"https://www.denverpost.com/wp-content/uploads/2025/07/TDP-Z-Jessica-Killin-035.jpg?w=1024&h=683","video":null,"publish_date":"2025-07-15 12:00:18","author":"Nick Coltrain","authors":["Nick Coltrain"],"language":"en","category":"politics","source_country":"us","sentiment":0.369},{"id":341810582,"title":"Stephen Colbert Denounces $16 Million Settlement Paramount Made with Trump: 'Big Fat Bribe' for Skydance Merger","text":"Late-night host Stephen Colbert denounced his parent company’s $16 million settlement with President Donald Trump, calling it a “big, fat bribe” for the Skydance merger.\n\nEarlier this month, Paramount agreed to settle Trump’s lawsuit against CBS, agreeing to pay $16 million over an edited interview of former presidential candidate Kamala Harris. Paramount said the settlement will also include Trump’s legal fees and costs, adding the $16 million, minus the legal costs, will go toward Trump’s presidential library.\n\n“As part of the settlement, Paramount also agreed to release transcripts of ’60 Minutes’ interviews with eligible U.S. presidential candidates after such interviews have aired, subject to redactions as required for legal or national security concerns. The settlement does not include an apology,” noted the New York Times.\n\nShari Redstone, the chair and controlling shareholder of Paramount, reportedly wanted to explore a settlement with Trump, with some speculating that it may have stemmed from needing the Trump administration’s approval in a multi-billion dollar sale of the company to Skydance.\n\nSpeaking on CBS’ The Late Show on Monday night, Colbert went all in on speculating the settlement as a bribe.\n\n“While I was on vacation, my parent corporation Paramount paid Donald Trump a $16 million settlement over his 60 Minutes lawsuit, as someone who has always been a proud employee of this network,” he said. “I’m offended, and I don’t know if anything will ever repair my trust in this company. But just taking a stab at it, I’d say $16 million would help.”\n\nView this post on Instagram\n\nColbert went on to describe the president’s complaint as a “nuisance lawsuit,” adding that Paramount declared it to be “completely without merit” when issuing the settlement.\n\n“And keep in mind, Paramount produced Transformers: Rise of the Beasts. They know ‘completely without merit,’” he joked. “Now, unlike, unlike the payoffs from ABC and Twitter, Paramount’s settlement did not include an apology — that’s good.”\n\n“Instead, the corporation released a statement where they said, ‘You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16 million. We need the cash,'” he added.\n\nColbert concluded that the settlement amounted to little more than a “big, fat bribe.”\n\n“Now, I believe this kind of complicated financial settlement with a sitting government official has a technical name in legal circles: It’s big fat bribe, because this all comes as Paramount owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance.”\n\nPaul Roland Bois directed the award-winning Christian tech thriller, EXEMPLUM, which has a 100% Rotten Tomatoes critic rating and can be viewed for FREE on YouTube, Tubi, or Fawesome TV. “Better than Killers of the Flower Moon,” wrote Mark Judge. “You haven’t seen a story like this before,” wrote Christian Toto. A high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies. Follow him on X @prolandfilms or Instagram @prolandfilms.","summary":"Late-night host Stephen Colbert denounced his parent company's $16 million settlement with President Donald Trump, calling it a \"big, fat bribe.\"\n\n\nThe post Stephen Colbert Denounces $16 Million Settlement Paramount Made with Trump: &#8216;Big Fat Bribe&#8217; for Skydance Merger appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/07/15/stephen-colbert-denounces-16-million-settlement-paramount-made-with-trump-big-fat-bribe-for-skydance-merger/","image":"https://media.breitbart.com/media/2025/07/Stephen-Colbert-640x335.jpg","video":null,"publish_date":"2025-07-15 11:38:36","author":"Paul Bois","authors":["Paul Bois"],"language":"en","source_country":"US","sentiment":-0.236},{"id":341781220,"title":"Why Rahm Emanuel thinks his ‘Rahm-bo’ reputation could help him in 2028 elections","text":"“People that just do talking points and look and sound like regular politicians, that’s passe,” Emanuel told the Washington Examiner. “People don’t want that.”\n\nMuch like how Trump built a following based on his no-holds-barred style, Emanuel suggested his bluntness could translate to retail politics in early voting states. He cited his six-for-six election record and “an appetite for candor, authenticity, and straight talk.”\n\nIn a wide-ranging interview, Emanuel contended that his reputation for “being direct” resulted in him receiving the call while he was in the White House for former Presidents Bill Clinton and Barack Obama, “when you needed somebody to do the hard things.”\n\n“When somebody had to take on the Washington gun lobby to pass the assault weapon ban, Mr. Rough-and-Tumble was the direct line. When somebody had to take on the insurance companies to make sure 10 million kids got health insurance, right here, I got the phone call. When you had to pass reforming the banks and regulations around the banks, I got the call,” he said.\n\n“So, yeah, I don’t shy away from fights. If you think the Oval Office is a place for easy, for going along and getting along, I’m not your guy. But trust me, that’s a business of rough and tumble. I played it, I know it, and I know how to take on the very people that have been giving people the shaft around here.”\n\nEmanuel’s “Rahm-bo” reputation started early in his political career when, for example, he sent a dead fish to a pollster who did not report their findings on time. He also repeatedly plunged a steak knife into a table as he shouted “death” during a celebratory dinner after the 1992 election to underscore his displeasure with Democrats he considered to have “betrayed” Clinton.\n\nBut in a sit-down with the Washington Examiner, Emanuel remained adamant that his “direct” approach to politics — demonstrated as a White House senior adviser to Clinton, Obama’s first White House chief of staff, and, most recently, Biden’s ambassador to Japan, among others — could be an advantage on the campaign trail.\n\n“How do you know that people don’t like that?” he asked. “You’ll go on the campaign trail, and we’ll see whether just reading talking points with no heartfelt, real commitment to it versus somebody that’s going to tell you the truth. Now, you could argue, sometimes I’ll tell you my opinion, even when you don’t ask for it. That’s fair. But here’s the thing: nobody walks away from a meeting saying, ‘I don’t know what his position is.'”\n\nEmanuel is not wrong. At least related to Biden, a Fox News poll conducted last month found that even one in five Democrats supported investigating whether there was a cover-up of the former president’s physical and mental decline, while about one in four were for inquiries into his use of an autopen and his decisions.\n\nTwo and a half years before the first votes are cast in the 2028 primaries, Democratic contenders are already delivering keynote addresses and traveling to early voting states, including Emanuel, who is expected to be in Iowa for a fish fry in September.\n\nBut Emanuel is not the only Chicago Democrat contemplating a presidential campaign. The other is Gov. J.B. Pritzker (D-IL), despite the billionaire announcing last month that he would seek reelection as Illinois’ chief executive.\n\nEmanuel maintained that there was enough room in the hypothetical primary for two Chicago politicians, but he had the edge in real White House decision-making.\n\n“J.B. and I are friends. It’ll be awkward. But you know the question isn’t whether there’s enough room. The question is, do you have enough ideas? Do you have the record and the strength to have not just the ideas, but the ability to execute and see it real?” he asked.\n\n“A president has to be comfortable in the family room and understand the issues that are pressing on families, comfortable in the classroom and making sure that our education system meets its goals, comfortable in the boardroom and creating jobs, comfortable in the Situation Room for the crisis, and periodically be comfortable in that emergency room. If you haven’t done those, you’re not ready for it.”\n\nMamdani spillover in New Jersey\n\nThroughout his career, Emanuel has advocated for more centrist Democratic politics, endorsing centrist candidates as chairman of the Democratic Congressional Campaign Committee and championing a more incremental approach to healthcare reform rather than the Obamacare law passed by Congress. He has reiterated his stance since last year’s election.\n\nSimultaneously, Emanuel downplayed concerns that the likes of New York Democratic mayoral nominee Zohran Mamdani, a Democratic Socialist, is undercutting Democrats more broadly as Republicans criticize him for his policies, from fare-free city buses to city-owned grocery stores.\n\n“If you asked me what I was worried about, I’d be less worried about that than the spillover of his race into the New Jersey media market, of the northern part of New Jersey, impacting, I don’t think it’s happened yet, but could be impacting the New Jersey gubernatorial race,” he said. “I know what [President Donald Trump’s] people are doing, but I know what matters.” \n\nNew Jersey and Virginia’s off-year elections will complement New York’s mayoral contest this November.\n\nFor Emanuel, Mamdani experienced “a perfect storm” because his opponent was disgraced former New York Democratic Gov. Andrew Cuomo, and his campaign was “disciplined” concerning his “message of affordability.”\n\nCuomo announced on Monday an independent campaign to become New York City mayor.\n\n“He made the message of affordability feel, sound, and look like change,” Emanuel said. “So he fused both affordability and change at a time when people are pretty angry at the establishment, and the opponents played establishment pretty, they played their role that made his message sharper.”\n\nTo that end, Emanuel insisted that there is “agreement” among Democrats, regardless of whether they are centrists or of the left-wing, that the American dream is currently a “struggle” when it should be “a shot.”\n\n“The system is rigged against people’s success,” he said. “The critique is uniformity. The solutions is where there’s disagreement.”\n\nMidterm strategy\n\nWhen it comes to next year’s midterm elections and Democrats’ chances of claiming control of one chamber of Congress, Emanuel advised Democrats to emphasize Trump’s “big, beautiful bill” and not “shiny bauble” distractions, including the Trump administration’s mismanagement of the Jeffrey Epstein files.\n\nEighteen months before the midterm elections, Democrats have an average two-point edge over Republicans in generic congressional ballot polling, 45%-43%, according to RealClearPolitics.\n\n“In that bill is the road map for the midterms,” he said. “This bill is the case you want to take to the public, and you want to make it about the fact that the Republicans are rubber stamps to Donald Trump. The one thing you can see very clearly among independent voters: they do not like an untethered, unchecked, unmoored Donald Trump. The Congress is playing a supplicant role when they should be playing something else, and that’s our opportunity.”\n\nEmanuel similarly dismissed Republican attempts to remind the public about Biden with congressional investigations into his administration’s alleged cover-up of his acuity, along with his autopen use.\n\n“The counter on that is they want to look backwards. We want to look forward. They don’t want you to know about all the cuts in healthcare,” he said. “Republicans decided to make it harder to get cheaper energy, and I think that’s another argument to be made, and they don’t want you to see that. They want you to focus on the last election, and we want to focus on you and your family’s future.”\n\nAt the same time, Emanuel issued a warning to Democrats about fundraising, coinciding with second-quarter disclosure deadlines, after Trump operatives last month confirmed the president had raised $1.4 billion in commitments since last year’s election.\n\n“The party has done well historically on the fundraising,” he said. “I saw the other day that Trump’s PAC has like $1.6 billion in it. I do believe we’ll have the resources we need. It’s whether you have the resources you need based on what the other side also has.”\n\nAs Emanuel reemerges in Democratic politics, so has his former boss, Obama, after last year’s election.\n\nObama last weekend addressed a Democratic National Committee fundraiser attended by Rep. Mikie Sherrill (D-NJ), who is the New Jersey Democratic gubernatorial nominee, who Emanuel is concerned could be affected by Mamdani’s campaign across the Hudson River.\n\nDuring his remarks last Friday, Obama implored Democrats to “toughen up” and “stop looking for the Messiah.”\n\n“I haven’t been surprised by what Trump’s done,” Obama said. “What I have been surprised by is the degree to which I’ve seen people who, when I was president, progressives, liberals, stood for all kinds of stuff, who seem like they’re kind of cowed, and intimidated, and shrinking away from just asserting what they believe, or at least what they said they believe.”\n\nDuring his interview with the Washington Examiner, Emanuel sidestepped a question about whether Obama expressed any concerns to him about Biden before former Vice President Kamala Harris replaced the then-president as the 2024 Democratic nominee.\n\n“First of all, no. Second of all, if he did, I wouldn’t tell you,” Emanuel quipped.","summary":"EXCLUSIVE — Former Chicago Mayor&#160;Rahm Emanuel&#160;strongly implied he would run for the 2028 Democratic presidential nomination. He previewed a “rough and tumble” campaign based on candor in an interview with the&#160;Washington Examiner. Emanuel, the former Illinois congressman who served in three presidential administrations, suggested his “Rahm-bo” reputation could cut through with voters amid criticism of [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3469718/rahm-emanuel-rahm-bo-reputation-2028-presidential-election/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Nagasaki-us.webp","video":null,"publish_date":"2025-07-15 11:00:00","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","category":"politics","source_country":"US","sentiment":-0.28},{"id":341775996,"title":"Stephen Colbert takes aim at Trump/Paramount settlement as a big fat bribe","text":"A newly moustachioed Stephen Colbert returned from vacation on Monday night, catching up on the goings on at Paramount, The Late Show network CBS' parent company in July.Namely, the $16 million settlement Paramount Global agreed with President Donald Trump, who filed a suit against the company in October for a 60 Minutes interview with former Vice-President Kamala Harris — Trump alleged \"deceitful\" editing ahead of the November presidential election.\"As someone who has alway been a proud employee of this network, I am offended,\" said Colbert in his Late Show monologue. \"And I don't know if anything will ever repair my trust in this company. But just taking a stab at it, I'd say $16 million would help.\"Colbert criticised Trump's \"nuisance lawsuit\" and Paramount's agreement saying, \"Paramount knows they could have easily fought it because in their own words 'the lawsuit was completely without merit.' And keep in mind, Paramount produced Transformers: Rise of the Beasts, they know 'completely without merit.'\"Finishing up, Colbert brought out the big guns. \"I believe this kind of complicated financial settlement with a sitting government official has a technical name in legal circles. It's big fat bribe,\" he said. \"Because this all comes as Paramount's owners are trying to get Trump administration to approve the sale of our network to a new owner, Skydance. And some of the TV typers out there are blogging that once Skydance gets CBS, the new owner's desire to please Trump could 'put pressure on late night host and frequent Trump critic Stephen Colbert.' \"OK, but how are they going to put pressure on Stephen Colbert if they can't find him?\"Ahh, we get the moustache now.","summary":"\"The Late Show\" host Stephen Colbert took aim at the $16 million settlement Paramount Global agreed with President Donald Trump.","url":"https://mashable.com/video/stephen-colbert-paramount-trump-settlement","image":"https://helios-i.mashable.com/imagery/videos/02HqitBw3QO0h1XFnM6kCBQ/hero-image.fill.size_1200x675.v1752575108.png","video":null,"publish_date":"2025-07-15 10:30:56","author":"Shannon Connellan","authors":["Shannon Connellan"],"language":"en","source_country":"US","sentiment":-0.369},{"id":341756602,"title":"Kamala Harris Eyeing A Comeback? Ex-US Vice President Leads 2028 Democratic Primary Poll","text":"Former US Vice President Kamala Harris, who lost in a landslide to Donald Trump in 2024, is now the early frontrunner for the 2028 Democratic presidential nomination, according to a new poll from Echelon Insights. Kamala Harris commands 26% support among Democrats and Democratic-leaning voters- far ahead of other contenders.\nButtigieg, Newsom In Distant Second And Third\nTrailing Kamala Harris are former Transportation Secretary Pete Buttigieg with 11% and California Governor Gavin Newsom with 10%. Another 13% of Democratic voters remain undecided.\nEarlier when Kamala Harris was excluded from the polling list- amid reports she may consider a run for California governor- support redistributed slightly. Pete Buttigieg and Gavin Newsom both rose to 12%, Alexandria Ocasio-Cortez jumped to 9% and Senator Cory Booker reached 8%. Minnesota Governor Tim Walz rounded out the top five with 7%.\nJD Vance Dominates Early GOP Field\nAmong Republican voters, US Vice President JD Vance leads with a commanding 42%, a full 33-point advantage over Florida Governor Ron DeSantis who earned 9% support. Other GOP figures included Marco Rubio (7%), Nikki Haley (6%), Robert F. Kennedy Jr. (5%) and Vivek Ramaswamy (4%). Sixteen percent of Republican voters said they were unsure.\nAmong political outsiders, entrepreneur Mark Cuban polled at 3% while Stephen A. Smith and Jon Stewart received 1% each.","summary":"Kamala Harris leads the 2028 Democratic nomination poll with 26% followed by Pete Buttigieg and Gavin Newsom.","url":"https://www.news18.com/world/kamala-harris-eyeing-a-comeback-ex-us-vice-president-leads-2028-democratic-primary-poll-ws-l-9442041.html","image":"https://images.news18.com/ibnlive/uploads/2025/06/Kamala-Harris-2025-06-1321c78efd10f01efe5c00416bff1746.jpg","video":null,"publish_date":"2025-07-15 10:15:24","author":"Mallika Soni,News18","authors":["Mallika Soni","News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.355},{"id":341756496,"title":"Mark Cuban says Elon Musk's new political party is 'really smart' in a key way","text":"Mark Cuban isn't happy with the current political stalemate — and thinks Elon Musk could help the country get out of it.Cuban addressed his decision to try to help get Musk's America Party on the ballot on an episode of the podcast \"Pod Save America\" that aired on July 13, saying the current two-party system does not serve Americans. Musk has said that the America Party will focus on a few key House and Senate seats that could serve as the \"deciding vote\" on \"contentious laws.\"\"That's how Elon thinks. He looks for leverage. And there's absolute leverage in making sure that the two incumbent parties don't have enough power to pass anything,\" Cuban said on the podcast. \"And so that's smart. That is really smart.\"He said the move could enable politicians to \"evaluate\" bills more thoughtfully. Cuban backed former Vice President Kamala Harris during the 2024 election, but criticized Democrats' political messaging on the podcast.\"Does it mean just because it's Elon, it must be wrong or right? No. But until we find out details, why are we jumping to conclusions?\" Cuban said. He also said he doesn't believe Musk is forming the party just because he's a \"good guy.\"It's not the first time Cuban has tepidly supported Musk's effort at a third party, even though the two billionaires more typically spar online. When Musk first floated the idea for the party in a poll on X in June, Cuban responded with three check marks. He got blowback from some social media users for saying he'd help the America Party get on the ballot.Musk has said that the America Party will serve the \"80% in the middle\" and break the deadlock that largely defines the current two-party system. Cuban isn't the only person taking the world's richest man seriously — the chair of the Democratic National Committee said it shouldn't be \"taken lightly,\" and Tesla shares fell sharply after he launched the party.","summary":"Mark Cuban has said Elon Musk's America Party's focus on a few Congressional races could create \"leverage.\"","url":"https://www.businessinsider.com/mark-cuban-elon-musk-america-political-party-really-smart-2025-7","image":"https://i.insider.com/67e6086cb8b41a9673fbf0dd?width=1024&format=jpeg","video":null,"publish_date":"2025-07-15 10:05:02","author":"Alice Tecotzky","authors":["Alice Tecotzky"],"language":"en","category":"politics","source_country":"us","sentiment":-0.424},{"id":341764400,"title":"How “The First Homosexuals” Shaped an Identity","text":"“The First Homosexuals,” at Wrightwood 659, in Chicago, attempts to answer this question, tracking the emergence of modern ideas about gender and sexuality across more than three hundred art works. It focusses on the period between the eighteen-sixties, when the word “homosexuality” was coined, and the nineteen-thirties, when the Nazis shut down Hirschfeld’s institute and burned his research. The flames have again come so close that the show’s co-curators, Jonathan D. Katz—a founding figure in queer art history—and Johnny Willis, struggled to find a venue in the United States. (Next spring, the exhibition will travel to the Kunstmuseum Basel in Switzerland.) Still, they’ve assembled a monumental survey, which includes everything from Qing-dynasty erotica to Félix Vallotton’s portrait of Gertrude Stein. The show hinges on a word, but its insights are resolutely visual. Art is the world’s greatest archive of sexual difference, Katz argues in the catalogue, preserving subtle shifts that language evades.\nTake “La Blanchisseuse,” an 1879 drawing by the French artist Pascal Dagnan-Bouveret. Two men wearing top hats stroll, arm in arm, along the Seine in Paris, while a young woman with a bundle of laundry, whom they’ve just passed, invites our sympathy with an exasperated stare. It’s Europe’s first known depiction of an openly gay couple, a status communicated less by their touching than by the laundress’s spurned expression. Her vocation was a common cover for sex work; clearly, she has identified the two men as not only disinterested but ineligible to be her tricks. The look is resigned and beseeching, as though to say, “These gays, they’re trying to murder me.”\nTo be sure, same-sex relationships have existed since time immemorial. What’s newly visible is the notion that engaging in them might be an exclusive preference and defining quality—in other words, that one could be “born this way.” This theory coalesced in an 1868 exchange of letters, one of which is on view in the exhibition, between two queer Karls—Karl Heinrich Ulrichs, a German lawyer, and Karl Maria Kertbeny, an Austro-Hungarian journalist. It was Kertbeny who coined the words “homosexuality” and “heterosexuality,” which he saw as impulses of which anyone might be capable. Ulrichs, by contrast, believed that men who liked men had female souls, and women who liked women had male ones. More than a century later, their argument is still going: Is it better to fight for universal rights or to advocate for minority recognition? Over time, though, Kertbeny’s word became attached to Ulrich’s understanding of sexuality as innate. The homosexual had arrived.\nWhat, besides gay celebrity, made an art work homosexual? Many things, though you can almost see certain stereotypes being metabolized. The show’s first limp wrist belongs to a novelty teapot caricaturing Wilde as a man-woman. Another appears, with knowing affection, in Roberto Montenegro’s portrait of an antiques dealer who wears a polka-dotted bow tie and queenily purses his lips as he proffers a cameo. Finally, in Emilio Baz Viaud’s watercolor “Self-Portrait of the Adolescent Artist” (1935), the gesture has become confident and expressive, the flourish of a keen-eyed young draughtsman with a pencil cocked in his upturned hand.\nLater on, partners, families, and homosocial groupings enter the picture. A section on relationships showcases the surprisingly conjugal frankness of lesbian couples around the turn of the twentieth century. “Painter and Child in the Studio” (1893), by the Danish artist Emilie Mundt, depicts a middle-aged woman showing a little girl her brushes and palette, while an elderly man plays piano in the background. The woman turns out to be Mundt’s partner, Marie Luplau; the child, their adoptee; the old man, Luplau’s father; and the painting, one of the very first depictions of a multigenerational queer family in Western art. More explicit is a photo of the British novelist Radclyffe Hall with her lover Una Troubridge. Hall, who privately went by “John,” stands, smoking, in a smoking jacket, while Troubridge, in a dress, reclines on a leopard pelt, like a good wife.\nBy contrast, the images of gay men are more physically suggestive but romantically ambiguous, probably because, although men’s bodies were less policed than women’s, male homosexuality was more widely criminalized. Groups of bathers, wrestlers, and ironworkers radiate eroticism, but the couples resort to shibboleths, such as the middle finger extended, during a shoulder touch, in Jacques-Émile Blanche’s portrait of himself and his lover. The Spanish painter Gregorio Prieto veiled his libido in de Chirico-influenced Surrealism. In his remarkable “Sueño Marinero” (1932), or “Sailor’s Dream,” a young man in profile looks reverently downward, as though hypnotized, at the crotch of another, who prepares to drop a blanket over the proceedings. It is, quite obviously, the lead-up to a blowjob. And yet the stars and sails in the background, and the silvery, fish-like object that appears in place of a phallus, endow the scene with metaphysical intensity—as though, like Dorothy and Toto, they’re about to be sucked off to a faraway realm.\n“Homosexuality” was born at the zenith of Western empire, and, much like an empire, it both appropriated from and reshaped the cultures under its sway. Aubrey Beardsley cribbed the oversized phalluses of his erotic drawings from Japanese shunga prints. Orientalist painters found alibis for their homoeroticism in the high-handed scrutiny of “effeminate,” and thus backward, societies. “Slaves,” for instance, by the Spanish painter Gabriel Morcillo, a favorite artist of Francisco Franco’s, depicts a trio of young white men wearing turbans, chains, flowers, and little else. (They are, presumably, Christians, in thrall to a lascivious Moor.) A selection of propaganda images condemning male pederasty in the Islamic world—as horny as they are jingoistic—reminded me of the former Navy SEAL Robert J. O’Neill, who allegedly killed Osama bin Laden. O’Neill went viral on X, last year, for replying to a group selfie posted by young Kamala Harris volunteers with this: “You’re not men. You’re boys. If there was no social media, you would be my concubines.”\nSome non-Western cultures responded to the new sexual regime with self-repression. Japan’s Meiji-era government proscribed homosexuality so as to be taken seriously as an empire. Similar backlashes took place in China, South Asia, Africa, and Eastern Europe. (Some of these regions are absent from the exhibition, because contemporary homophobia impeded loans.) Yet the modernist embrace of “primitivism” could also provide cover for homosexual expression, especially in settler-colonial societies with mixed roots. “Our Ancient Gods” (1916), by the Mexican painter Saturnino Herrán, depicts a group of flamboyantly posed pre-Columbian deities in loincloths and feather headdresses. Around the same time, Black American artists were leveraging a racialized reputation for hypersexuality into the riotous queerness of the Harlem Renaissance, expressed, for instance, in Richmond Barthé’s sinuously swaying sculpture “Feral Benga, Senegalese dancer” (1935), or the singer Ma Rainey’s “Prove It On Me Blues” (1928), written after her arrest for organizing a lesbian orgy. Despite the title, she makes no claim of innocence: “It’s true, I wear a collar and a tie,” Rainey sings, boasting that she can womanize “just like any old man.”\nThe shift helped make transness and gender fluidity visible on their own terms. The show’s last section features works by photographers including Claude Cahun and Van Leo, who embodied a range of masculine, feminine, and neuter personae in their playful self-portraits. The Danish artist Gerda Wegener’s adoring paintings of her partner Lili Elbe were, in part, a collaborative fantasy about what Elbe might look like after her medical transition, which Elbe also discusses in “The Mystery of Gender” (1933), an interwar Austrian film. Yet, even as some crossed the binary, others dreamed of its abolition. Elisàr von Kupffer, a German-Estonian painter and aristocrat, considered gender divisions to be a perversion of god’s will. Christening himself Elisarion, he built a “temple” in Switzerland to propagate his doctrine, filling it with kitschy, “Midsommar”-esque idylls set in a so-called “clear world” of genderless Aryan youths. Von Kupffer was also a fascist, who wrote letters to Hitler. The Führer never replied.\nToday, for better and worse, we’re living in Elisarion’s world. Young people are less and less inclined to define themselves in dichotomous terms, with “queer,” “bisexual,” and “nonbinary” gaining on the old labels. Fascism, too, is on the rise, and some have chosen to blame one for the other. The writer Andrew Sullivan recently opined that queer and trans radicals have hijacked a once respectable movement for gay and lesbian equality. The usual retort to such cavilling is to say that a trans woman threw the first brick at Stonewall. Arguably, though, Sullivan’s allegation of coattail-riding has it even more backward: if so many of the first homosexuals defined themselves as having a “soul” of the opposite sex, wasn’t it because, at the time, that was the more legible bid for acceptance than the bare fact of same-sex desire? (La Chevalière d’Éon was celebrated for living on both sides of the gender binary in a France where “sodomy” was punishable by death.) “The First Homosexuals” reminds us that, while labels may come and go, the need for solidarity remains. On the way out, I passed Beauford Delaney’s portrait, executed in a rainbow of pastels, of a young James Baldwin, who once wrote, “We must fight for your life as though it were our own—which it is.” ♦","summary":"A timely exhibition dissects the emergence of modern ideas about gender and sexuality—and the backlash against them.","url":"https://www.newyorker.com/culture/the-art-world/how-the-first-homosexuals-shaped-an-identity","image":"https://media.newyorker.com/photos/686ec3c56f3849be00a02670/16:9/w_2560,h_1440,c_limit/Wrightwood%20659-Saturnino%20Herra%CC%81n.jpg","video":null,"publish_date":"2025-07-15 10:00:00","author":"The New Yorker","authors":["The New Yorker"],"language":"en","source_country":"us","sentiment":0.503},{"id":341739632,"title":"Donald Trump shrugs off missing out on Westminster speech and says MPs should 'have a good time'","text":"Donald Trump has shrugged off a speech at the UK Parliament during his state visit in September. The US President said there was no need to recall MPs from recess. He told the BBC to \"let them have a good time\" instead of returning to parliament. He said they should not be brought back: \"I don't want that to... that would be making the speech pretty negatively.\" Trump will begin his three-day visit on September 17. This is just a day after the House of Commons breaks up for party conferences. The House of Lords is still sitting but a joint address to both houses can only happen when both are in session. Asked what he wants to gain from his visit, Trump said: \"I think I want to have a good time and respect King Charles because he's a great gentleman.\" He also called the UK a \"great place\" and mentioned the hotels he owns in the country. The Speakers of the Commons and Lords make the final decision on addresses to parliament, but it is the government which really has the say. Trump will visit Scotland later this month as he is expected to open a second golf course at his Menie Estate in Aberdeenshire. It is set to be named after his late Scottish mother Mary. He will meet with First Minister John Swinney and Prime Minister Keir Starmer during the visit. Swinney has spoken to Trump on the phone since he was elected president for a second time. He also met Trump's son Eric at Bute House earlier this year. It came after Swinney urged people to back Trump's opponent Kamala Harris in last year's US Presidential election. To sign up to the Daily R ecord Politics newsletter, click here","summary":"The US President said there was no need to recall MPs from recess and to &quot;let them have a good time&quot;.","url":"https://www.dailyrecord.co.uk/news/politics/donald-trump-shrugs-missing-out-35557291","image":"https://i2-prod.dailyrecord.co.uk/article35118472.ece/ALTERNATES/s1200b/0_BESTPIX-Former-US-President-Donald-Trump-Visits-His-Turnberry-Golf-Resort.jpg","video":null,"publish_date":"2025-07-15 09:35:41","author":"Andrew Quinn","authors":["Andrew Quinn"],"language":"en","source_country":"gb","sentiment":-0.076},{"id":341736712,"title":"NEA teachers union member was told fighting Trump more crucial than reading and writing: Report","text":"A teachers' union member was reportedly told that fighting against President Donald Trump was more important than teaching reading and writing at this year's annual National Education Association meeting. According to the Free Press, a convention delegate from Texas summarized the National Education Association’s \"new business items\" as having more political motives. \"[O]ne convention delegate from Texas summarized them by telling me the response that a friend of hers got while trying to talk to other union members about the best ways to teach reading and writing,\" the Free Press reported. \"We don’t have time for that. We’ve got to fight Trump,\" her friend was told. SOCIAL MEDIA ERUPTS AFTER NATION'S LARGEST TEACHERS' UNION MISSPELLS 'FASCISM' IN ANTI-TRUMP AGENDA ITEM When the Free Press asked the NEA for comment, the union directed them toward a \"number of previous statements, including the convention speech by Becky Pringle, a former middle-school teacher who is now the NEA president,\" stating, \"We must use our power to take action that leads, action that liberates, action that lasts.\" The National Education Association did not immediately respond to Fox News Digital’s request for comment. The National Education Association held their annual Representative Assembly meeting from July 3rd to July 6th. TEACHERS UNION REVEALS TRUE COLORS BEHIND CLOSED DOORS AT ANNUAL CONVENTION The business items the teachers union approved include defending \"democracy against Trump’s embrace of fascism by using the term facism [sic] in NEA materials to correctly characterize Donald Trump’s program and actions\" and opposing Immigration and Customs Enforcement's \"kidnapping of student leaders\" and support for \"students’ right to organize against ICE raids and deportations.\" Another item was to support the nationwide \"No Kings\" protests in participation of \"the mass democratic movement against Trump’s authoritarianism and violations of human rights.\" In January, the National Education Association released guidelines to help schools prepare for immigration authorities after Trump rescinded the law that prohibited Immigration and Customs Enforcement from entering sensitive areas such as schools and hospitals. Pringle has always been vocal in her criticism of the Trump administration and previously disavowed Trump's immigration crackdown and endorsed former Democratic presidential nominee Kamala Harris in the 2024 election. The Free Press report also claimed that union members who asked about standing up for Jewish teachers received an unfriendly response at the meeting. CLICK HERE TO GET THE FOX NEWS APP The person from Texas who was at this year’s meeting told The Free Press the focus was \"politics, sex and gender.\" \"When delegates get up on stage, they tell you that they’re political,\" the delegate told The Free Press. \"These things did not just happen overnight. People just haven't been paying attention.\"","summary":"A teachers union convention attendee reportedly was told fighting President Trump was more important to members than teaching reading and writing.","url":"https://www.foxnews.com/media/nea-teachers-union-member-told-fighting-trump-more-crucial-than-reading-writing-report","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/NEA-president-all-the-things.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-15 09:30:44","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","source_country":"US","sentiment":0.104}]}