{"offset":0,"number":50,"available":9198,"news":[{"id":386991906,"title":"Ukraine open to dropping NATO bid for western security guarantees: Zelenskyy","text":"Kyiv [Ukraine], December 15 (ANI): Ukraine has signalled that it may be willing to give up its long-standing goal of joining NATO if it receives firm security guarantees from Western allies, President Volodymyr Zelenskyy said ahead of key meetings with US envoys and European partners in Berlin, Al Jazeera reported.Zelenskyy described the proposal as a significant concession by Kyiv, which has for years pushed for NATO membership as the strongest safeguard against future Russian aggression. Instead, he said Ukraine could accept legally binding security guarantees from the United States, European countries and other allies.“From the very beginning, Ukraine’s desire was to join NATO; these are real security guarantees. Some partners from the US and Europe did not support this direction,” Zelenskyy said in response to questions from reporters in a WhatsApp chat.He said alternative arrangements could still offer strong protection. “Thus, today, bilateral security guarantees between Ukraine and the US, Article 5-like guarantees for us from the US, and security guarantees from European colleagues, as well as other countries – Canada, Japan – are an opportunity to prevent another Russian invasion,” he said. Zelenskyy stressed that such assurances must be legally binding, adding, “And it is already a compromise from our part.”If pursued, the shift would mark a major change in Ukraine’s position, as Kyiv has consistently sought NATO membership despite Russia viewing the alliance’s expansion as a direct threat. While the move would align with one of Moscow’s stated objectives for the war, Zelenskyy made clear that Ukraine continues to reject any demand to surrender territory, as per Al Jazeera.The Ukrainian president said he was seeking a “dignified” peace and firm guarantees that Russia would not launch another attack. He also accused Moscow of deliberately prolonging the conflict through continued strikes on Ukrainian cities and critical infrastructure, calling the war potentially Europe’s deadliest since World War II.The comments came as diplomatic efforts intensified, with growing pressure from US President Donald Trump to reach a settlement. Trump’s envoy Steve Witkoff and his son-in-law Jared Kushner arrived in Berlin on Sunday for talks involving Ukrainian and European representatives.The decision to send Witkoff, who has previously been involved in negotiations with both Kyiv and Moscow, was seen as a sign that Washington believes progress may be possible, according to Al Jazeera.Zelenskyy said Ukraine, along with the US and European partners, is reviewing a 20-point plan that could eventually lead to a ceasefire. However, he reiterated that Kyiv is not holding direct talks with Russia. He noted that a truce along the current front lines could be considered fair, but pointed out that Moscow continues to demand Ukraine withdraw from parts of Donetsk and Luhansk that remain under Ukrainian control.Despite ongoing diplomatic discussions, Russian attacks have not stopped. Recent strikes have left thousands without electricity, and Ukrainian officials say Russia is deliberately targeting the power grid to deprive civilians of heat and water during the winter months. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/ukraine-open-to-dropping-nato-bid-for-western-security-guarantees-zelenskyy-9769981.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-12-14 21:15:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.125},{"id":386991336,"title":"Ukraine open to dropping NATO bid for western security guarantees: Zelenskyy","text":"Kyiv [Ukraine], December 15 (ANI): Ukraine has signalled that it may be willing to give up its long-standing goal of joining NATO if it receives firm security guarantees from Western allies, President Volodymyr Zelenskyy said ahead of key meetings with US envoys and European partners in Berlin, Al Jazeera reported.Zelenskyy described the proposal as a significant concession by Kyiv, which has for years pushed for NATO membership as the strongest safeguard against future Russian aggression. Instead, he said Ukraine could accept legally binding security guarantees from the United States, European countries and other allies.\"From the very beginning, Ukraine's desire was to join NATO; these are real security guarantees. Some partners from the US and Europe did not support this direction,\" Zelenskyy said in response to questions from reporters in a WhatsApp chat.He said alternative arrangements could still offer strong protection. \"Thus, today, bilateral security guarantees between Ukraine and the US, Article 5-like guarantees for us from the US, and security guarantees from European colleagues, as well as other countries - Canada, Japan - are an opportunity to prevent another Russian invasion,\" he said. Zelenskyy stressed that such assurances must be legally binding, adding, \"And it is already a compromise from our part.\"If pursued, the shift would mark a major change in Ukraine's position, as Kyiv has consistently sought NATO membership despite Russia viewing the alliance's expansion as a direct threat. While the move would align with one of Moscow's stated objectives for the war, Zelenskyy made clear that Ukraine continues to reject any demand to surrender territory, as per Al Jazeera.The Ukrainian president said he was seeking a \"dignified\" peace and firm guarantees that Russia would not launch another attack. He also accused Moscow of deliberately prolonging the conflict through continued strikes on Ukrainian cities and critical infrastructure, calling the war potentially Europe's deadliest since World War II.The comments came as diplomatic efforts intensified, with growing pressure from US President Donald Trump to reach a settlement. Trump's envoy Steve Witkoff and his son-in-law Jared Kushner arrived in Berlin on Sunday for talks involving Ukrainian and European representatives.The decision to send Witkoff, who has previously been involved in negotiations with both Kyiv and Moscow, was seen as a sign that Washington believes progress may be possible, according to Al Jazeera.Zelenskyy said Ukraine, along with the US and European partners, is reviewing a 20-point plan that could eventually lead to a ceasefire. However, he reiterated that Kyiv is not holding direct talks with Russia. He noted that a truce along the current front lines could be considered fair, but pointed out that Moscow continues to demand Ukraine withdraw from parts of Donetsk and Luhansk that remain under Ukrainian control.Despite ongoing diplomatic discussions, Russian attacks have not stopped. Recent strikes have left thousands without electricity, and Ukrainian officials say Russia is deliberately targeting the power grid to deprive civilians of heat and water during the winter months. (ANI)","url":"https://www.aninews.in/news/world/europe/ukraine-open-to-dropping-nato-bid-for-western-security-guarantees-zelenskyy20251215023751","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251214165134.jpg","video":null,"publish_date":"2025-12-14 21:07:51","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.125},{"id":386991180,"title":"\"Celebrate proudly,\" says Trump after deadly Hanukkah attack at Australia's Bondi Beach","text":"Washington, DC [US], December 15 (ANI): US President Donald Trump has stated that people celebrating Hanukkah should not be worried about their safety and should \"celebrate proudly,\" following a shooting that targeted the Jewish community at Australia's Bondi Beach and killed at least 11 people, CNN reported.Speaking after a phone conversation with the US President, a Fox News correspondent relayed Trump's message to Americans observing Hanukkah. \"Straight from the president, his message to people celebrating Hanukkah today, he said, 'they do not need to be worried. They should celebrate proudly, and they should be proud of who you are, celebrate proudly,'\" the correspondent stated.The remarks came amid heightened security concerns in Australia, where the National Terrorism Threat Level is currently set at \"probable,\" according to the Australian government. This level, which sits in the middle of five tiers, indicates that there is a more than 50 per cent chance of a terrorist attack being planned or taking place in the country within the next twelve months, the New South Wales Police Force notes on its website, CNN reported.Australia's National Security agency has said that the country's security environment \"has entered a vulnerable period and is being challenged by new threats with concerning trajectories.\" It has warned that attacks are likely to be low-cost, use readily available weapons and simple tactics, and most commonly occur in crowded places in major cities, often carried out by a lone actor or a small group.At least 11 people were killed and 29 others injured when gunfire erupted during a Hanukkah event at Sydney's popular Bondi Beach, police confirmed.Authorities stated that more than 1,000 people were attending the celebration when the shooting occurred and that the attack was \"designed to target Sydney's Jewish community,\" according to CNN.Of the two suspected attackers, one was shot dead at the scene, while the other remains in custody in critical condition. Police have not yet released details about the identities of the suspects and stated that investigations are ongoing, including whether there may have been a third perpetrator.Among those killed was one Israeli citizen, according to Israel's foreign ministry. Another Israeli national was wounded and is receiving treatment at a hospital in Sydney, the ministry added, CNN reported.The shooting was declared a terrorist incident several hours after it occurred. Police stated that the timing of the attack on the first day of Hanukkah, along with other circumstances including the weapons involved, led to that determination.Reacting to the attack, US Secretary of State Marco Rubio wrote on X that he \"strongly condemns\" the fatal shooting. \"Antisemitism has no place in this world. Our prayers are with the victims of this horrific attack, the Jewish community, and the people of Australia,\" Rubio wrote.The US Embassy in Australia also posted on X that it was \"heartbroken\" by the news and offered its \"sincerest condolences to the families of the victims of this senseless act that targeted the Jewish community on the first night of Hanukkah.\"The embassy advised US citizens in Australia to avoid the Bondi Beach area, follow local authorities' guidance and inform loved ones of their status, CNN reported.Australian Prime Minister Anthony Albanese stated that the country would never submit to \"division, violence or hatred,\" telling the Jewish community: \"Your fellow Australians stand with you tonight in condemning this act of terror.\"He added that the attack was aimed at creating fear but stressed that Australians would stand together in response.New South Wales Premier Chris Minns described the shooting as a deliberate attack on Sydney's Jewish community, noting that what should have been a \"night of peace and joy\" was \"shattered by this horrifying, evil attack.\"Police Commissioner Mal Lanyon stated that authorities were focused on ensuring the safety of the entire community and urged calm as a \"significant\" investigation continues.Israeli leaders reacted with shock and anger. President Isaac Herzog stated that Jews in Sydney were \"attacked by vile terrorists\" while celebrating Hanukkah and accused the Australian government of failing to curb rising antisemitism.Foreign Minister Gideon Sa'ar wrote that the attack was \"the result of the antisemitic rampage in the streets of Australia over the past two years,\" while Minister of the Diaspora Amichai Chikli described it as the most severe attack ever carried out against the Jewish community in the country, CNN reported.Leaders around the world also condemned the shooting and expressed solidarity with Australia. New Zealand Prime Minister Christopher Luxon wrote that his country was \"shocked by the distressing scenes at Bondi,\" while UK Prime Minister Keir Starmer described the attack as \"deeply distressing.\"French President Emmanuel Macron wrote that an \"antisemitic terrorist attack struck families gathered to celebrate Hanukkah,\" and European Commission President Ursula von der Leyen stated that Europe \"stands with Australia and Jewish communities everywhere.\"The Jewish Council of Australia stated that the community had been left \"horrified and shaken\" by the attack, calling it a \"horrific act of antisemitic violence during the Jewish festival of light and hope.\"\"In moments like this, we hold each other close,\" the council stated in a statement.Australia has rarely experienced mass shootings since strict gun laws were introduced in 1996 following the Port Arthur massacre. According to the Australian Institute of Criminology, 31 homicides by firearm were recorded in 2023-24, the most recent figures available. (ANI)","url":"https://www.aninews.in/news/world/us/celebrate-proudly-says-trump-after-deadly-hanukkah-attack-at-australias-bondi-beach20251215005831","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251214175044.jpg","video":null,"publish_date":"2025-12-14 19:28:31","author":null,"language":"en","source_country":"in","sentiment":-0.474},{"id":386991876,"title":"'Purely Antisemitic Attack': Trump Condemns Sydney Beach Shooting That Killed 12","text":"US President Donald Trump on Sunday condemned the deadly mass shooting at a Jewish festival in Sydney’s Bondi Beach as “a purely antisemitic attack.”\n“That was a terrible attack, 11 dead, 29 badly wounded. And that was an antisemitic attack, obviously,” Trump said during a Christmas celebration at the White House.\nThe attack, declared as an “act of terror”, prompted condemnation from national leaders, community groups, and international figures.\nNew York Mayor Eric Adams said in a post on X that extra security has been deployed for Hanukkah celebrations and synagogues in New York City.\n“We will continue to ensure the Jewish community can celebrate the holiday in safety — including at public Menorah lightings across the city. Let us pray for the injured and stand together against hatred,” Adams said.\nIn Germany, though security measures at synagogues and other Jewish institutions are usual in Berlin police said these would be ramped up for the Hanukkah period.\nAccording to Reuters, the event at Berlin’s Brandenburg Gate will also include a prayer for the victims of Sydney’s Bondi Beach shooting, which left at least 11 people dead in what Australian officials described as a targeted antisemitic attack.\nThe London’s Metropolitan Police also issued a statement saying: “While there is no information to suggest any link between the attack in Sydney and the threat level in London, this morning we are stepping up our police presence, carrying out additional community patrols and engaging with the Jewish community to understand what more we can do in the coming hours and days.”\nReuters quoted France’s Interior Minister Laurent Nunez asking local authorities to reinforce security around Jewish places of worship during the December 14 to 22 period.\nHe pushed for increased deployment of security forces, with particular vigilance around religious services and gatherings that draw large crowds, especially when they take place in public spaces.","summary":"US President condemned the antisemitic attack at Sydney's Bondi Beach festival that killed 12. Global leaders increased security for Hanukkah.","url":"https://www.news18.com/world/purely-antisemitic-attack-trump-condemns-sydney-beach-shooting-that-killed-12-ws-l-9769957.html","image":"https://images.news18.com/ibnlive/uploads/2025/12/Untitled-design-2025-12-13T090422.957-2025-12-e9046ded9ae5e5987f307740875453f7.jpg","video":null,"publish_date":"2025-12-14 18:27:41","author":"News18,Ranu Joardar","authors":["News18","Ranu Joardar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.051},{"id":386987740,"title":"Zelensky ditches hopes of Ukraine joining Nato ahead of crunch peace talks in Berlin","text":"President Volodymyr Zelensky has relinquished Ukraine’s bid to join Nato ahead of crunch peace talks with the US and European allies in Berlin.\n\nThe Ukrainian president ditched his hopes to join the military alliance in what he said was a “compromise” to end the war with Russia.\n\nIn a major shift, Zelensky said Ukraine will instead ask for Western security guarantees, which he said should be legally binding.\n\nThe move comes as Zelensky prepares to meet US envoys and European allies in Berlin for yet another round of negotiations in the hopes of a peace deal being struck.\n\nUS President Donald Trump’s special envoy Steve Witkoff and his son-in-law Jared Kushner were spotted entering a hotel in central Berlin on Sunday.\n\nThey are expected to meet Zelensky for talks alongside European allies, including Sir Keir Starmer and the French president, Emmanuel Macron.\n\nThe UK prime minister will attend the talks as Britain continues to discuss a crucial deal to use frozen Russian sovereign assets to help provide funds for Kyiv.\n\nSir Keir spoke with Ursula von der Leyen, the president of the European Commission, on Saturday to discuss the move and work on the US-led peace proposals.\n\nSpeaking about Monday’s talks, Zelensky said in an address to the nation late on Saturday: “I will be meeting with envoys of President Trump, and there will also be meetings with our European partners, with many leaders, concerning the foundation of peace – a political agreement to end the war.”\n\nZelensky’s agreement to ditch Ukraine’s Nato ambitions marks a major shift for the country, which has sought to join it as a safeguard against Russian attacks, and has such an aspiration included in its constitution.\n\nIt also meets one of Russia’s war aims, although Kyiv has so far held firm against ceding territory to Moscow.\n\n“From the very beginning, Ukraine's desire was to join Nato, these are real security guarantees. Some partners from the US and Europe did not support this direction,” he said in answer to questions from reporters in a WhatsApp chat.\n\n“Thus, today, bilateral security guarantees between Ukraine and the US, Article 5-like guarantees for us from the US, and security guarantees from European colleagues, as well as other countries, Canada, Japan, are an opportunity to prevent another Russian invasion,” Zelensky said.\n\nHe also said that a ceasefire between Ukraine and Russia along the current frontline would be a fair option.\n\nRussia has demanded Kyiv withdraw its troops from parts of the eastern Donetsk and Luhansk regions that Ukraine still holds. Answering questions from reporters in a WhatsApp chat, Zelensky reiterated that the option would be unfair, adding that the issue of territory remained unresolved and very sensitive.\n\nRussian president Vladimir Putin has repeatedly demanded that Ukraine officially renounce its Nato ambitions and withdraw troops from about 10 per cent of Donbas, which Kyiv still controls. Moscow has also said that Ukraine must be a neutral country and that no Nato troops can be stationed in Ukraine.\n\nBritain, France and Germany have been working to refine the US proposals, which, in a draft disclosed last month, called for Kyiv to cede more territory, abandon its ambition to join Nato and accept limits on its armed forces.\n\nEuropean allies have described this as a “critical moment” that could shape Ukraine’s future, and sought to shore up Kyiv’s finances by leveraging frozen Russian central bank assets to fund Kyiv’s military and civilian budget.\n\nBritain has said it is ready to move in tandem with the EU to unlock immobilised Russian sovereign assets, the vast majority of which are held in Belgium.\n\nBut Belgium has so far resisted the move, calling on other nations in the trading bloc to share the risk amid fears it would be left on the hook to pay back the loan if Russia succeeded in thwarting the plan.\n\nSir Keir hosted the Belgian premier Bart De Wever in Downing Street on Friday afternoon as European leaders seek to agree on a path forward to providing Kyiv with further support.\n\nAt the top of his meeting with Sir Keir, Mr De Wever said there are “very important decisions to be made” in the EU next week, and he insisted “we and the UK will move together” to ensure Kyiv’s sovereignty.\n\nIn a readout after the meeting, No 10 said they agreed to continue working to make progress on unlocking Russian assets.","url":"https://uk.news.yahoo.com/zelensky-ditches-hopes-ukraine-joining-152711572.html","image":"https://s.yimg.com/ny/api/res/1.2/y8CmXn9VIG02ndIFqOufNQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/f6dff66ac8e23bb57777354df2cbf563","video":"","publish_date":"2025-12-14 18:19:00","author":"Athena Stavrou","authors":["Athena Stavrou"],"language":"en","category":"politics","source_country":"gb","sentiment":0.116},{"id":386987000,"title":"Powell says he wants to 'turn this job over' with economy in 'really good shape' before departure","text":"Despite nearing the end of his term, Federal Reserve Chairman Jerome Powell sidestepped any discussion of his legacy, emphasizing instead the goals he wants to lock in before passing the reins. \"I really want to turn this job over to whoever replaces me with the economy in really good shape. That&apos;s what I want,\" Powell said during a Dec. 10 press conference following the central bank&apos;s interest rate decision. FROM MORTGAGES TO CAR LOANS: AFFORDABILITY RISES AND FALLS WITH THE FED \"I want inflation to be under control, coming back down to 2%. And I want the labor market to be strong. That&apos;s what I want,\" Powell told reporters at the Federal Reserve. Powell, who has led the central bank for nearly eight years, is set to complete his term in May 2026. He declined to say whether he would remain on the Federal Reserve Board of Governors after that. Pressed further on his future, Powell said, \"I&apos;m focused on my remaining time as chair. I haven&apos;t got anything new on that to tell you.\" POWELL DECLINES TO WEIGH IN ON POTENTIAL SUCCESSORS AS TRUMP EYES NEXT FED CHAIR When asked by FOX Business whether President Donald Trump&apos;s public search for a new Fed chair affects his ability to do the job, Powell responded flatly, \"No.\" The question of succession looms large, as Trump weighs whom to appoint to lead the world’s most powerful central bank next year. Trump said Friday that his two leading candidates are former Fed Governor Kevin Warsh and National Economic Council Director Kevin Hassett. GET FOX BUSINESS ON THE GO BY CLICKING HERE Trump also said last week that he has a \"very good idea\" of what he is looking for in the next Fed chair. \"I&apos;m looking for somebody that will be honest with interest rates,\" Trump told reporters at the White House. \"Our rates should be the lowest rates in the world.\"","summary":"Federal Reserve chair Jerome Powell wants to leave office with inflation at 2% and strong job market when his term ends in May 2026, avoiding legacy talk.","url":"https://www.foxbusiness.com/economy/powell-says-he-wants-turn-job-over-economy-really-good-shape-before-departure","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/07/jerome-powell.jpg","video":null,"publish_date":"2025-12-14 16:46:59","author":"Amanda Macias","authors":["Amanda Macias"],"language":"en","source_country":"us","sentiment":-0.084},{"id":386991516,"title":"I challenge BJP to contest fair election on ballot paper, they'll never win: Priyanka Gandhi at Delhi rally","text":"Congress leader Priyanka Gandhi Vadra on Sunday challenged the BJP to prove its strength by winning a fair election conducted through ballot papers, alleging that the poll process has been deliberately made “suspicious” to undermine people’s voting rights.Addressing the Congress’s ‘Vote Chor, Gaddi Chhod’ rally at Ramlila Maidan in New Delhi, she claimed the BJP could not win elections without the backing of the Election Commission (EC), accusing the ruling party of benefiting from alleged “vote theft”.Priyanka Gandhi said the country would not forget the names of Chief Election Commissioner Gyanesh Kumar and Election Commissioners Sukhbir Singh Sandhu and Vivek Joshi, asserting that they would one day have to answer how they “conspired” to take away citizens’ right to vote, regardless of any attempts to shield them.\"I challenge -- the BJP should contest a fair election on the ballot paper once. They will never be able to win and the BJP also knows this fact,\" Priyanka Gandhi said.She alleged that the chief election commissioner and the two election commissioners are \"attacking\" India's democracy.\"For the first time in history, the entire opposition is stating that they don't trust the EC and the polls are not being conducted properly. From announcement of polls, voters list, model code of conduct, campaign, polling, counting, EVMs and results, every step has been made suspicious by them (election commissioners),\" Priyanka Gandhi.She alleged that all constitutional institutions had been forced to bend before the government..Referring to Rahul Gandhi’s yatra in Bihar, Priyanka Gandhi said it was undertaken to protest alleged attempts by the BJP to cut voters’ names from electoral rolls to influence the outcome. She claimed a similar exercise was now underway in Uttar Pradesh, alleging that nearly three crore names had been removed.Questioning the role of the Election Commission, she asked how “useful” it had become for the BJP.Urging supporters not to be disheartened over the party’s loss in Bihar, she alleged that the country was increasingly witnessing elections being won by the BJP through “chori” (theft).\"Rahul Gandhi showed in press conferences evidence (of vote chori) from Haryana, Maharashtra and Karnataka. In Bihar, 65 lakh votes were cut, and even if you set aside this evidence, during the model code of conduct in Bihar, they sent Rs 10,000 in people's bank accounts with the EC looking the other way. If this is not vote theft, then what is?\" she said.The BJP has no answer to these questions and is aware that the people are angry with them, Priyanka Gandhi said.\"Look at them (the BJP), they look rattled. I look at them in Parliament, their self-confidence is down, they are unable to look us in the eye because people have lost faith in their government, Prime Minister Narendra Modi and Home Minister Amit Shah,\" she said.This government has \"failed\" on every front and the Rupee is now 90 against the US dollar, she said.\"When the rupee used to be 60 against the dollar, then who was crying on the streets? Narendra Modi ji was making comments regularly; what happened now?\"Exports are going down and imports are getting expensive. Their foreign policy has failed, he (Modi) walks holding hands with US President Donald Trump and presidents of other countries but when the time comes, none stand with our country,\" she said..Priyanka Gandhi alleged that the policy of the government is to hand over the country's resources \"to Adani and Ambani\".\"The youth of the country is grappling with price rise, unemployment, paper leaks, and there is no one to help them,\" she said.Whatever was constructed in 75 years, they are attempting to destroy it, she alleged.Priyanka Gandhi urged the people to focus on protecting their right to vote, claiming that it is being taken away.\"It is our duty to protect the Constitution and your voting rights.... we will keep fighting and never bow down,\" she said.Priyanka Gandhi also said that Indians must rise when the country's institutions are being \"trampled upon\".She said it is important to understand the value of the vote.\"When the freedom struggle was on, the slogan used to be 'Bharat Mata Ki Jai'. Jawaharlal Nehru ji told the people to tell him 'what is Bharat Mata' and then explained that it is its natural resources, mountains, rivers, farms, but it is also the 'Bharat ki janta' who are all part of Bharat Mata,\" the Congress leader said.This spirit made the Constitution and gave people the right to vote to elect a government.This thinking and spirit made institutions to strengthen democracy -- the judiciary, media, Parliament, political parties, opposition parties, ruling party members, EC, were all made to protect people's interests, she said.\"When we see these institutions trampled upon, all Indians should rise. They should realise that the attack on these institutions is an attack on them. Today, the judiciary is under pressure, the media is owned by Adani or Ambani. In the previous elections, chief ministers were put in jail, our bank accounts were shut, and baseless allegations were made. Those who could not bear it, joined them, and their washing machines washed away the charges against them,\" she said.Referring to the ongoing Winter Session of Parliament, Priyanka Gandhi said when Mallikarjun Kharge and Rahul Gandhi raised the issue of 'vote chori' and SIR, the ruling side got rattled and then sought a debate on Vande Mataram.\"We kept debating as to 'the national song belongs to whom' and how it came about; and the big issues of unemployment, price rise, paper leak, they could not muster the courage to debate them,\" she said.(With inputs from PTI).Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest","url":"https://www.newindianexpress.com/nation/2025/Dec/14/i-challenge-bjp-to-contest-fair-election-on-ballot-paper-theyll-never-win-priyanka-gandhi-at-delhi-rally","image":"https://media.newindianexpress.com/newindianexpress%2F2025-12-14%2F8nx1qprh%2FPriyanka-Gandhi.jpg?rect=0%2C0%2C1200%2C675&w=1200&h=675&auto=format%2Ccompress&fit=crop","video":null,"publish_date":"2025-12-14 14:57:57","author":"Tnie Online Desk","authors":["Tnie Online Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.492},{"id":386981542,"title":"Trump’s new Monroe Doctrine","text":"What is ours is ours, and what is yours is ours too\n\nA lot has happened in the past month I have been away, and I was struck by how, on at least three fronts, issues I have previously explored in this column have again made headlines.\n\nOn the home front, I wrote on November 2 arguing in detail why Finance Minister Makis Keravnos needed to be replaced. The recent government reshuffle not only left him in his post, but instead gave the boot to Energy Minister George Papanastasiou, with whom Keravnos had disagreed on the Great Sea Interconnector (GSI) issue. What a sad state of affairs, and how badly this reflects on President Christodoulides. Apart from the president’s obvious motivation to use the reshuffle to boost his electoral standing, the removal of Papanastasiou – possibly the only minister with relevant background in his portfolio – marks a victory for vested interests over efforts to push for a more holistic solution to our energy problems.\n\nWhile I have never been a fan of Christodoulides, I was willing to give him a chance, hoping he would prove me wrong. I fear that hope now seems unfounded.\n\nTurning to the European front, I wrote on two occasions – on March 15 and on October 13 – arguing for the need to proceed with using the Russian frozen funds for Ukraine’s war effort. In those articles I suggested that the best way to proceed, while safeguarding international law, was through the ECtHR route, drawing on how Cyprus secured compensation from Turkey for property losses. While the EU has finally decided to proceed with a scheme to utilise these funds (to be put for approval at the European Council on December 18), I have my doubts as to how the proposed plan avoids contravening established legal precedent.\n\nLet us hope that the collective wisdom of EU politicians does not disappoint, as the outcome of this decision will determine whether Ukraine can continue its resistance to Russia – or whether it will be forced to capitulate to the latest US-led peace plan.\n\nOn the world stage, the latest development that resonates with themes I have written about inevitably involves Donald Trump. (No, my absence did not cure my Trump derangement syndrome!) Last week saw the publication of the US National Security Strategy (NSS), where US policy is no longer speculative but set out in a formal strategy document. In it, Trump’s hostility toward Europe is unmistakable: Europe, it claims, faces “civilisational erasure” within the next two decades, calling for the US to “cultivate resistance” within the continent to “Europe’s current trajectory”. If the NSS was not clear enough, Trump followed up with an interview with Dasha Burns in Politico, where his disdain for Europe was plain to see.\n\nI have long argued that Europe has been left with very difficult choices since Trump came to power. On May 4 , I wrote that Europe may eventually have to choose between the US and China, while more recently on September 28 I expounded on the differences between the traditional West and the US. The Financial Times, in a recent article by Gideon Rachman, put it more eloquently: “The Trump administration view of ‘western civilisation’ is based on race, Christianity and nationalism. The European version is a liberal view founded on democracy, human rights and the rule of law, including international law.”\n\nThe issue now takes on renewed urgency, as the future of Europe – and indeed the entire liberal world – is at stake. Perhaps this was on French President Emmanuel Macron’s mind during his recent state visit to China. Even though no concrete agreements were reached, that is hardly surprising given the delicate nature of a European pivot away from the US toward China.\n\nEqually unsurprising was Russia’s gleeful reaction to the NSS document. Russia’s long-term strategy – like that of the Soviet Union before it – has always been to drive a wedge between Europe and the US and to destabilise Nato in the process. But Russia should be careful what it wishes for. For all the talk in the US of returning to the Monroe Doctrine (the doctrine established by US President James Monroe in 1823 – whose portrait hangs in Trump’s Oval Office – asserting that European powers should no longer interfere in the Western Hemisphere (The Americas), and the US would not interfere in Europe, Trump’s intentions go much further.\n\nIt may suit Trump for now to sell Ukraine out to Russia (perhaps in exchange for Greenland), but his long-term vision for Europe is to turn it into a US protectorate. Hence the active intervention in European politics to boost like-minded parties. This, for Trump, is the new Monroe Doctrine: what is ours is ours, and what is yours is ours too.\n\nThe NSS did not appear by accident, nor are Trump’s public comments on Europe a mere whim. They are part of a carefully orchestrated campaign to influence European electorates toward a Trumpian worldview. The key instrument is fear over immigration – an issue genuinely on many people’s minds. There is no doubt that mass immigration has created valid worries among many Europeans, and acknowledging this does not make one racist. Economic migration has long been tightly controlled – I remember how, in my time, working in the UK was almost impossible because economic migration was, and still is, heavily supervised. However, the rules on asylum seekers are lax, poorly enforced, and systematically abused by both economic migrants and their money-seeking enablers.\n\nSomething drastic clearly needs to be done. In that spirit, the joint article by the UK and Danish prime ministers in The Guardian on December 9 (“We must protect our borders to defend our democracies. Here’s how”) is a step in the right direction. There are ways to address these problems without succumbing to the siren calls of Donald Trump. I have warned before about the dangers of jumping on the Trump bandwagon simply because he appears aligned with you on one particular issue.\n\nA litany of people believed in him, only to be thrown under the bus when they expressed even the slightest disagreement. The latest example – believe it or not – is Trump’s once-number-one supporter, Marjorie Taylor Greene. The US congresswoman – who has since resigned – has undergone a major transformation, and her recent interviews are jaw-dropping in how dramatically her view on Trump has shifted.\n\nBe careful, then, who you choose to befriend. Europe, you have been warned.","summary":"A lot has happened in the past month I have been away, and I was struck by how, on at least three fronts, issues I have previously explored in this column have again made headlines. On the home front, I wrote on November 2 arguing in detail why Finance Minister Makis Keravnos needed to be [&#8230;]","url":"https://cyprus-mail.com/2025/12/14/trumps-new-monroe-doctrine","image":"https://cyprus-mail.com/wp-content/uploads/2025/12/comment-loukis-French-President-Emmanuel-Macron-with-Chinese-President-Xi-Jinping-on-a-recent-visit-to-China.jpg","video":null,"publish_date":"2025-12-14 14:49:00","author":"Gideon Rachman","authors":["Gideon Rachman"],"language":"en","category":"politics","source_country":"cy","sentiment":-0.192},{"id":386984198,"title":"Brown University shooting live as FBI release footage of suspected gunman","text":"14:46Zahra KhaliqAll classes and exams cancelled after shootingAll remaining exams, papers and projects for the rest of the semester have been cancelled at Brown University.Provost Francis J Doyle III said: \"At this time, it is essential that we focus our efforts on providing care and support to the members of our community as we grapple with the sorrow, fear and anxiety that is impacting all of us right now.\"\n\n13:00KEY EVENTShooting suspect arrested after 10-hour manhuntPolice have arrested a suspected shooter after two people were killed and multiple others were injured at the attack on Brown University.Officers had earlier released a short clip of a person of interest, dressed in all black, walking along a street outside of the main university building - although is not clear if the same person has been arrested.\n\n10:01Zahra KhaliqVictims were students, Brown University president says The victims of Saturday’s shooting were all students, President Christina Paxson said in an email to the community.Paxson called the incident an \"unimaginably tragic day,\" adding that officers were still working to clear students from campus buildings as the shooter remained on the loose.\n\n08:13Zahra KhaliqStudents describe moment they were alerted to gunmanStudents who were inside Brown University's Rockefeller library - a short distance from where the shots were fired - have described the terrifying moment they were made to drop their bags and leave.Marcos and Daniel received an alert about an active gunman in the area while they were studying at the library. The pair were told to shelter until police arrived to escort them out of the building. \"We stayed away from the windows and when the police came we were told to drop our bags, raise our hands and then a search was carried out on the floor before we were led out of the library\", the students told the BBC.Marcos and Daniel are among many students planning to stay home for the next few days until the gunman is caught.\n\n07:53Zahra KhaliqEverything we know so far about the shootingIt has now been around 11 hours since a gunman fired shots in a classroom at Brown University, while exams were taking place in the building. Here is everything we know about the incident so far:The shooting killed two people and injured nine.The gunman remains at large after fleeing the scene on foot.Students on campus are still being told to shelter in place.The identities of the two victims have not yet been released. The majority of those injured are in \"critical but stable\" condition.Police initially arrested one person before later releasing them.The attacker is described as a man dressed in all black.The shooting happened at 4pm local time (9pm GMT).\n\n06:45Rachel Vickers-PriceBrown cancels exams scheduled for tomorrow in wake of shooting tragedy Brown University Provost Frank Doyle said during a news conference that \"at this time, we will not be having final exams tomorrow”. As per the university's academic calendar, end-of-semester exams commenced yesterday and were supposed to run through to the end of next weekend.In the same press conference, Providence Mayor Brett Smiley said exams were underway in the building where the shooting occured. Two exams were being held in the Barus and Holley building, where engineering and physics classes and labs are held, on the eastern side of campus when the shooting occured.miley said during the same press conference that two final exams were taking place inside the- the Barus and Holley building - the engineering and physics building - where the shooting occurred.\n\n06:29Rachel Vickers-PriceHundreds of police, FBI agents, firefighters and more join forces for massive manhuntIndividuals already in residential buildings within the perimeter should continue to shelter in place there. Police will enter all administrative (non-residential) buildings within the perimeter marked by the red boxes on the map to escort all individuals to safe locations outside of the perimeterMore than 400 police and law enforcement officers have hit the streets of Providence overnight, with the Brown University gunman still at large.Providence mayor Brett Smiley said at a news conference Saturday night that officers have come from various local, state and federal agencies and are assisting in the investigation.Fire departments, FBI agents, the The Bureau of Alcohol, Tobacco and Firearms and many communities around Rhode Island have assisted in the investigation and “to ensure the safety of the Providence community,” the mayor said.Authorities have no reason to believe there are any overhanging threat to the community at this time, the mayor said, adding that any calls to 911 received in the last few hours were unrelated to the shooting.\n\n06:25Rachel Vickers-PriceFBI launches website for people to submit tips on Brown shooting suspectThe FBI has launched a tip site for the public to submit any photo or video evidence they may have of the Brown University shooting suspect, with the shooter on the run and a police manhunt now underway.Police in Providence have also set up a devoted phone line for people to submit tip offs about the shooting suspect, with eyewitnesses able to call 401-272-1111.“We have shared an image of the individual we believe to be the shooter, but we know that there wasn’t a clear shot of the face,” said Providence mayor Brett Smiley at a press conference on Saturday night.Here's another peek at the footage authorities are hoping to identify the shooting suspect with: \n\n06:12Rachel Vickers-PriceLockdown orders issued for neighbours, nearby residents of BrownPeople living within a certain radius of the Brown University campus have been included in shelter in place orders, with lockdown rules to be enforced by police. As per an alert posted on the Brown University website, residents, students, and neighbours will need to wait indoors until authorities arrive to escort them to a safe location.“Police will enter all administrative (non-residential) buildings within the perimeter marked by the red boxes on the map to escort all individuals to safe locations outside of the perimeter,” the alert read.“For all locations (inside and outside the perimeter), the shelter in place remains ongoing — unless escorted by a law enforcement officer, this means ensuring no movement across or near campus.”Parts of the Brown University campus have been cordoned off as a shelter-in-place lockdown order, which will remain overnight. (Image:Brown University)\n\n06:00Rachel Vickers-PriceHere's what we now know about the Brown University attacks With the newly released CCTV footage of the suspects shared by police, let's recap what we now know about the Brown University shootings.A male suspect is thought to be the gunman behind the shootings at Brown University, who can be seen in CCTV footage being circulated by police. We know very little about the suspect so far - including an identity, motive or where he could be now - but police have said they believe he is a male aged in his 30s, and may have been wearing a camouflage mask on his face during or after the attack.A huge security operation is now underway in the state of Rhode Island's capital city of Providence, with police hitting the streets in droves in an effort to catch a gunman on the lam.A ninth person has been added to the injury toll, however their ailments are understood to be far less severe than the eight people in critical care at Rhode Island Hospital.Brown University remains on lockdown and students have been told to stay in their dorm rooms. Some surrounding neighbourhoods have also been placed into similar lockdown protocols, with residents fearing the alleged gunman may still be in the area. Residents have been told to stay inside by Providence Mayor Brett Smiley.“Because we don’t have additional information to share at this time about the location of a shooter, we cannot more specifically define it than that. This is a scary time,” Smiley said at a news conference on Saturday night.\n\n05:57Rachel Vickers-PriceHere's what we now know about the Brown University attacks With the newly released CCTV footage of the suspects shared by police, let's recap what we now know about the Brown University shootings.A male suspect is thought to be the gunman behind the shootings at Brown University, who can be seen in CCTV footage being circulated by police. We know very little about the suspect so far - including an identity, motive or where he could be now - but police have said they believe he is a male aged in his 30s, and may have been wearing a camouflage mask on his face during or after the attack.A huge security operation is now underway in the state of Rhode Island's capital city of Providence, with police hitting the streets in droves in an effort to catch a gunman on the lam.A ninth person has been added to the injury toll, however their ailments are understood to be far less severe than the eight people in critical care at Rhode Island Hospital.Brown University remains on lockdown and students have been told to stay in their dorm rooms. Some surrounding neighbourhoods have also been placed into similar lockdown protocols, with residents fearing the alleged gunman may still be in the area. Residents have been told to stay inside by Providence Mayor Brett Smiley.“Because we don’t have additional information to share at this time about the location of a shooter, we cannot more specifically define it than that. This is a scary time,” Smiley said at a news conference on Saturday night.\n\n05:35Rachel Vickers-PriceFBI release video footage of alleged Brown University gunman The Federal Bureau of Investigation - or FBI - have shared footage of a man they allege is the Brown University shooter. Clad in dark clothes from head to toe, just as the city police in Providence said, a male-presenting suspect can be seen walking purposely, before taking a right at the corner of Hope Street and Waterman Street. He powerwalks away in the footage, with a mere few seconds all the public has to go off to catch this \"person of interest\".\n\n03:32Rachel Vickers-PriceBrown University student's heartbreaking text to mum as shooter attackedA mother has revealed the heart-wrenching text from her son who was studying in Brown University's campus library when a shooter opened fire on Saturday.The worried, unidentified mother who was heard crying during her interview with Fox News called the situation a \"nightmare\" as she described her brief text exchange with her son, The Mirror US reports.“Mom, there’s a live shooting on campus. I’m going to run. I love you,\" he told her. She then instructed him to turn off his phone and not \"make a sound.\" He then hid in a supply closet with about a dozen other students. She added that one suffered a panic attack while police searched the campus.\n\n03:24Rachel Vickers-PriceGunman may have been masked, police sayProvidence Deputy Police Chief Tim O’Hara said the shooter may have been wearing a camouflage mask. He added that the suspect is male and could be in his 30s. He also confirmed that the shooting happened inside of a classroom.Brown University President Christina Paxson says she has been told all the victims are students, but she was not yet sure about the latest victim announced.\n\n03:22Rachel Vickers-PriceInvestigators not sure how gunman entered classrooms as ninth victim confirmedPolice are trying to piece together how the shooter gained access to classrooms. In the most recent joint press conference with authorities, Mayor Smiley told the gathered press that outer doors of the engineering building were unlocked, but rooms inside that were being used for final exams required badge access.The Mayor added that a ninth person has been identified as a victim in the shooting, however that victim’s injuries were not life-threatening.\n\n01:59Rachel Vickers-PricePolice believe the Brown University shooter used a handgunAuthorities believe the shooter used a handgun, a law enforcement official who spoke to AP on the condition of anonymity because they were not authorised to discuss an ongoing investigation.The gunman remains at large and the university remains in lockdown. Brown issued a directive to students at about 8.30 pm local time, to tell them it was “imperative that all members of our community remain sheltered in place\".\n\n01:11Rachel Vickers-PriceGunshot victims rushed to Rhode Island HospitalOut of the total eight people hospitalised in the wake of the attack, six are in critical but stable condition, another is fighting for their life, and another is stable, spokesperson for Rhode Island Hospital Kelly Brennan said. “Rhode Island Hospital is working closely with and providing support to all impacted family members, and remains in continuous communication with Brown University,” Ms Brennan said in a statement. “Rhode Island Hospital is in lockdown at this time but is still accepting emergency department patients.”\n\n00:53Rachel Vickers-PriceUS President briefed on shooting situationUS president Donald Trump has said to reporters in Washington that he had been briefed on the Rhode Island shooting and “all we can do right now is pray for the victims.” “It’s a shame,” he said in brief remarks at the White House.Earlier in the day he had posted about the shootings on Truth Social, his social media site, saying that a suspect was in custody. That has since turned out to be false.\n\n00:24Rachel Vickers-PriceAuthorities did arrest someone, but apprehended the wrong personProvidence mayor Brett Smiley said authorities had detained a person who was initially thought to be involved in the on-campus gun attack. That person was later determined to have no involvement.University officials initially told students and staff that a suspect was in custody, before later saying that was not the case. The gunman remains at large.\n\n00:19Rachel Vickers-PriceStudents were taking exams when shooting broke outBrown University Provost Frank Doyle said exams were taking place in the engineering building on Saturday afternoon when the shooter opened fire.Providence mayor Brett Smiley asked for prayers for the families of the victims, noting the coming Christmas holidays. “It’s going to be a difficult rest of the day, difficult days and months ahead as this community heals,” the Rhode Island politician said, as per AP.The mayor declined to confirm if the victims were students at the university.\n\n00:12KEY EVENTPolice share new details on suspectNew information about the suspected shooter at Brown University has been disclosed by officials.\n\n23:54Paige IngramWhat the University has said so farThe University has issued a number of updates since the initial reports of the shooting at around 4.22pm local time.","url":"https://www.mirror.co.uk/news/us-news/brown-university-shooting-live-updates-36397865","image":"https://i2-prod.mirror.co.uk/incoming/article36398136.ece/ALTERNATES/s615/0_gettyimages-2251208491-612x612.jpg","video":null,"publish_date":"2025-12-14 14:46:39","author":"Paige Ingram,Rachel Vickers-Price,Zahra Khaliq","authors":["Paige Ingram","Rachel Vickers-Price","Zahra Khaliq"],"language":"en","source_country":"gb","sentiment":-0.605},{"id":386991948,"title":"Hamas says Israeli strike killed senior commander Raed Saad amid ceasefire","text":"Tel Aviv [Israel], December 14 (ANI): Hamas has confirmed that senior commander Raed Saad was killed in an Israeli strike in Gaza, marking the most high-profile assassination of a Hamas leader since the ceasefire that came into effect in October, Al Jazeera reported.The Israeli military said it carried out the attack on Saturday near Gaza City, claiming Saad was the target.At least 25 people were reported wounded in the strike. Hamas acknowledged his death on Sunday through a video statement by its Gaza chief, Khalil al-Hayya, who accused Israel of violating the ceasefire agreement.“In the wake of Israel’s continued violations, including the latest assassination of a Hamas commander just yesterday, we call on the mediators and especially the US administration and US President Donald Trump as the main guarantor of the agreement, to force the occupation [Israel] to respect the ceasefire deal and to implement it,” he said.According to authorities in Gaza, Israeli forces have continued daily military operations since the ceasefire began on October 10, carrying out nearly 800 attacks and killing at least 386 people, actions they say violate the terms of the agreement.Hamas and Gaza officials have also accused Israel of blocking the free flow of humanitarian aid into the enclave, another alleged breach of the truce. The situation has been further compounded by Storm Byron, which flooded around 27,000 tent shelters, leaving hundreds of thousands of displaced Palestinians struggling with worsening living conditions, as per Al Jazeera.The humanitarian crisis has drawn international attention. Last week, the United Nations General Assembly overwhelmingly passed a resolution calling on Israel to allow unrestricted humanitarian access to Gaza, halt attacks on UN facilities, and comply with international law as an occupying power.“Our priority is to continue with the steps to end the war and especially to complete phase one [of the ceasefire], which includes allowing aid and needed equipment to enter to rehabilitate hospitals and medical centres and the infrastructure,” al-Hayya said, adding that this must include opening the Rafah crossing with Egypt “in two directions” and advancing to phase two to secure “full withdrawal of the occupation”.The October truce calls for the disarmament of Hamas and deployment of an international stabilisation force proposed by US President Donald Trump. But al-Hayya, who himself survived an Israeli assassination attempt in Doha in September, said the role of any international peace force should be strictly limited, according to Al Jazeera.“The mission of the international peace force must be limited to maintaining or keeping the ceasefire and to separate the two sides on the boundaries of the Gaza Strip,” he said, adding that Hamas and other Palestinian factions remain committed to the agreement but reject any form of guardianship imposed on Gaza or its people.Meanwhile, the Israeli army claimed in a Telegram post that Raed Saad had been working to rebuild Hamas’s military capabilities, which Israel says have been significantly weakened after more than two years of war in Gaza. The military also described Saad as one of the key planners of the October 7, 2023, attacks on Israel. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/hamas-says-israeli-strike-killed-senior-commander-raed-saad-amid-ceasefire-9769738.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-12-14 14:30:06","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.405},{"id":386991356,"title":"Hamas says Israeli strike killed senior commander Raed Saad amid ceasefire","text":"Tel Aviv [Israel], December 14 (ANI): Hamas has confirmed that senior commander Raed Saad was killed in an Israeli strike in Gaza, marking the most high-profile assassination of a Hamas leader since the ceasefire that came into effect in October, Al Jazeera reported.The Israeli military said it carried out the attack on Saturday near Gaza City, claiming Saad was the target.At least 25 people were reported wounded in the strike. Hamas acknowledged his death on Sunday through a video statement by its Gaza chief, Khalil al-Hayya, who accused Israel of violating the ceasefire agreement.\"In the wake of Israel's continued violations, including the latest assassination of a Hamas commander just yesterday, we call on the mediators and especially the US administration and US President Donald Trump as the main guarantor of the agreement, to force the occupation [Israel] to respect the ceasefire deal and to implement it,\" he said.According to authorities in Gaza, Israeli forces have continued daily military operations since the ceasefire began on October 10, carrying out nearly 800 attacks and killing at least 386 people, actions they say violate the terms of the agreement.\n\nHamas and Gaza officials have also accused Israel of blocking the free flow of humanitarian aid into the enclave, another alleged breach of the truce. The situation has been further compounded by Storm Byron, which flooded around 27,000 tent shelters, leaving hundreds of thousands of displaced Palestinians struggling with worsening living conditions, as per Al Jazeera.The humanitarian crisis has drawn international attention. Last week, the United Nations General Assembly overwhelmingly passed a resolution calling on Israel to allow unrestricted humanitarian access to Gaza, halt attacks on UN facilities, and comply with international law as an occupying power.\"Our priority is to continue with the steps to end the war and especially to complete phase one [of the ceasefire], which includes allowing aid and needed equipment to enter to rehabilitate hospitals and medical centres and the infrastructure,\" al-Hayya said, adding that this must include opening the Rafah crossing with Egypt \"in two directions\" and advancing to phase two to secure \"full withdrawal of the occupation\".The October truce calls for the disarmament of Hamas and deployment of an international stabilisation force proposed by US President Donald Trump. But al-Hayya, who himself survived an Israeli assassination attempt in Doha in September, said the role of any international peace force should be strictly limited, according to Al Jazeera.\"The mission of the international peace force must be limited to maintaining or keeping the ceasefire and to separate the two sides on the boundaries of the Gaza Strip,\" he said, adding that Hamas and other Palestinian factions remain committed to the agreement but reject any form of guardianship imposed on Gaza or its people.Meanwhile, the Israeli army claimed in a Telegram post that Raed Saad had been working to rebuild Hamas's military capabilities, which Israel says have been significantly weakened after more than two years of war in Gaza. The military also described Saad as one of the key planners of the October 7, 2023, attacks on Israel. (ANI)","url":"https://www.aninews.in/news/world/middle-east/hamas-says-israeli-strike-killed-senior-commander-raed-saad-amid-ceasefire20251214195851","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251214142834.jpg","video":null,"publish_date":"2025-12-14 14:28:51","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.421},{"id":386991638,"title":"Zelenskyy, US envoys meet in Berlin to discuss Ukraine peace deal","text":"Berlin, Dec 14 (AP) Ukrainian President Volodymyr Zelenskyy and US envoys arrived in Berlin on Sunday for another round of talks intended to negotiate an end to the war in Ukraine, as Moscow and Kyiv stuck to their sharply opposite views of a prospective peace deal.\n Zelenskyy said that Ukrainian, US and European officials will hold a series of meetings. He said he will meet personally with US President Donald Trump’s special envoy Steve Witkoff and Trump’s son-in-law Jared Kushner in Berlin.\n Responding to journalists’ questions in audio clips on a WhatsApp group chat, Zelenskyy emphasised the need for Ukraine to receive firm guarantees from the United States and European allies that would be similar to those offered to NATO members, after the US and some European countries stonewalled Ukraine’s bid to join the military alliance.\n “These security guarantees are an opportunity to prevent another wave of Russian aggression,” he said. “And this is already a compromise on our part.” Zelenskyy emphasised that any security assurances would need to be legally binding and supported by the US Congress, adding that he expected an update from his team following a meeting between Ukrainian and US military officials in Stuttgart.\n He said that he will meet separately with German Chancellor Friedrich Merz and, possibly, other European leaders later in the evening. He said he hadn’t yet received any response from the US to Ukraine’s latest proposals on the peace plan.\n Washington has tried for months to navigate the demands of each side as Trump presses for a swift end to Russia’s war and grows increasingly exasperated by delays. The search for possible compromises has run into major obstacles, including control of Ukraine’s eastern Donetsk region, which is mostly occupied by Russian forces.\n Tough obstacles remain ————————– Russia’s President Vladimir Putin wants Ukraine to withdraw its forces from the part of the Donetsk region still under its control among the key conditions for peace — a demand Zelenskyy again rejected on Sunday.\n Zelenskyy said that the US had floated an idea for Ukraine to withdraw from the Donetsk and create a demilitarized free economic zone there, a proposal he rejected as unworkable.\n “I do not consider this fair, because who will manage this economic zone?” he said. “If we are talking about some buffer zone along the line of contact, if we are talking about some economic zone and we believe that only a police mission should be there and troops should withdraw, then the question is very simple. If Ukrainian troops withdraw 5–10 kilometres, for example, then why do Russian troops not withdraw deeper into the occupied territories by the same distance?” Zelenskyy described the issue as “very sensitive” and insisted on a freeze along the line of contact, saying that “today a fair possible option is we stand where we stand.” Putin’s foreign affairs adviser Yuri Ushakov told the business daily Kommersant that Russian police and national guard would stay in parts of the Donetsk region even if they become a demilitarised zone under a prospective peace plan.\n Ushakov warned that a search for compromise could take a long time, noting that the US proposals that took into account Russian demands had been “worsened” by alterations proposed by Ukraine and its European allies.\n Speaking to Russian state TV in remarks broadcast Sunday, Ushakov said that “the contribution of Ukrainians and Europeans to these documents is unlikely to be constructive,” warning that Moscow will “have very strong objections.” Ushakov added that the territorial issue was actively discussed in Moscow when Witkoff and Kushner met with Putin earlier this month. “The Americans know and understand our position,” he said.\n Merz, who has spearheaded European efforts to support Ukraine alongside French President Emmanuel Macron and UK Prime Minister Keir Starmer, said Saturday that “the decades of the Pax Americana’ are largely over for us in Europe and for us in Germany as well.” He warned that Putin’s aim is “a fundamental change to the borders in Europe, the restoration of the old Soviet Union within its borders.” “If Ukraine falls, he won’t stop,” Merz warned on Saturday during a party conference in Munich.\n Putin has denied plans to restore the Soviet Union or attack any European allies.\n Russia and Ukraine exchange aerial attacks ———————————————— Ukraine’s air force said that Russia overnight launched ballistic missiles and 138 attack drones at Ukraine. The air force said 110 had been intercepted or downed, but missile and drone hits were recorded at six locations.\n Zelenskyy said Sunday that hundreds of thousands of families were still without power in the south, east and north-east regions and work was continuing to restore electricity, heat and water to multiple regions following a large-scale attack the previous night.\n The Ukrainian president said that in the past week, Russia had launched over 1,500 strike drones, nearly 900 guided aerial bombs and 46 missiles of various types at Ukraine.\n “Ukraine needs peace on decent terms, and we are ready to work as constructively as possible. These days will be filled with diplomacy. It’s very important that it brings results,” Zelenskyy said.\n Russia’s Defence Ministry said that air defences downed 235 Ukrainian drones late Saturday and early Sunday.\n In the Belgorod region, a drone injured a man and set his house ablaze in the village of Yasnye Zori, regional Gov. Vyacheslav Gladkov said.\n Ukrainian drones struck an oil depot in Uryupinsk in the Volgograd region, triggering a fire, according to regional Gov. Andrei Bocharov.\n In the Krasnodar region, the Ukrainian drones attacked the town of Afipsky, where an oil refinery is located. Authorities said that explosions shattered windows in residential buildings, but didn’t report any damage to the refinery. (AP) GRS GRS","summary":"","url":"https://www.news18.com/agency-feeds/zelenskyy-us-envoys-meet-in-berlin-to-discuss-ukraine-peace-deal-9769718.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-12-14 14:00:06","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.11},{"id":386991868,"title":"Won't Join NATO In Exchange For Western Security Guarantees: Zelenskyy On Ending War With Russia","text":"Ahead of talks with US in Berlin, Ukrainian President Volodymyr Zelenskyy on Sunday announced that he has relinquished the ambition of joining the NATO military alliance if Western security is guaranteed.\n“From the very beginning, Ukraine’s desire was to join NATO, these are real security guarantees. Some partners from the US and Europe did not support this direction,” Zelenskyy said in reply to questions from reporters in a WhatsApp chat.\nReuters quoted him saying hat the US and European and other partners’ security guarantees instead of NATO membership were a compromise on Ukraine’s side.\n“Thus, today, bilateral security guarantees between Ukraine and the US, Article 5-like guarantees for us from the US, and security guarantees from European colleagues, as well as other countries — Canada, Japan — are an opportunity to prevent another Russian invasion,” he said.\n“And it is already a compromise from our part,” he said, adding that the security guarantees should be legally binding.\nThis announcement marks a major shift for Ukraine as it had continued its fight to join NATO as a safeguard against Russian attacks and even has such an aspiration included in its constitution.\nAccording to Reuters, this move meets one of Russia’s war aims, although Kyiv has so far held firm against ceding territory to Moscow.\nRussian President Vladimir Putin repeatedly demanded Ukraine to officially renounce its aim to be part of NATO and withdraw troops from the about 10% of Donbas which Kyiv still controls. They even pressed for Ukraine to be a neutral country and no presence of NATO troops in Ukraine.\nReuters quoted Russian sources saying earlier this year that Putin wants a “written” pledge by major Western powers not to enlarge the US-led NATO alliance eastwards – shorthand for formally ruling out membership to Ukraine, Georgia, Moldova and other former Soviet republics.\nZelenskyy says ‘ready for talks’\nThe Ukrainian President on Sunday said he was ready for “dialogue” at the latest round of talks with US President Donald Trump’s envoy Steve Witkoff and European leaders on ending the nearly four years of war.\n“The fairest possible option is to ‘stay where we are’. This is true because it is a ceasefire… I know that Russia does not view this positively, and I would like the Americans to support us on this issue,” he told reporters shortly before arriving in Berlin.\nAFP quoted him saying he hoped the United States would back the idea of freezing the front line in Ukraine along its current shape at their meeting in Berlin.\n\nI am already in Germany.\nToday’s agenda includes a meeting with the American negotiating team. We are focusing on how to reliably guarantee Ukraine’s security so that the experience of the Budapest Memorandum and Russia’s invasion are never repeated. We are counting on… pic.twitter.com/Ml5ZZ2Zodx\n— Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) December 14, 2025\n\nTrump had been pressuring Ukraine to reach an agreement after giving a peace plan last month. The plan was critised by even the European leaders who said it echoed Russia’s demands such as Ukraine ceding its crucial territory.\nAccording to AFP, the proposal has triggered a flurry of diplomacy between the United States and Ukraine’s European allies, with Kyiv officials recently saying they had sent Washington a revised version.\nOn Sunday, Zelenskyy said he has not yet received response on Ukraine’s amendments. “I am receiving all the signals and will be ready for the dialogue that will begin today.”\n“The summit in Berlin is important. We are meeting with both the Americans and the Europeans… And today these meetings are taking place in Berlin, today and tomorrow,” Zelenskyy said. “The most important thing is that the plan should be as fair as possible, first and foremost for Ukraine, because Russia started the war.”","summary":"Volodymyr Zelenskyy drops NATO bid for Ukraine, seeking US and European security guarantees instead, ahead of Berlin talks with US envoy Steve Witkoff and European leaders.","url":"https://www.news18.com/world/wont-join-nato-in-exchange-for-western-security-guarantees-zelenskyy-on-ending-war-with-russia-ws-l-9769662.html","image":"https://images.news18.com/ibnlive/uploads/2025/12/Untitled-design-2025-12-14T185224.708-2025-12-012e19caec6f373a6426c0760ef0a6a5.jpg","video":null,"publish_date":"2025-12-14 13:25:16","author":"News18,Ranu Joardar","authors":["News18","Ranu Joardar"],"language":"en","source_country":"in","sentiment":-0.183},{"id":386991796,"title":"US Immigrant Bites ICE Officer While Resisting Arrest; DHS Releases Photo Of Bloodied Hand: 'Gross'","text":"An alleged illegal immigrant in the United States, identified as Maximiliano Perez-Perez, allegedly bit the hand of an Immigration and Customs Enforcement (ICE) officer while resisting arrest in Louisiana, according to the Department of Homeland Security (DHS).\nOfficials released an image purportedly showing the ICE officer’s bloodied hand following what the DHS termed as a “gross attack”. The Homeland Security Department said Perez-Perez attempted to flee by pushing officers.\n“He used his teeth as a weapon and clamped down on an ICE officers’ hand, breaking the skin and drawing blood,” said the department, adding that the immigrant had entered the United States at an unknown date and time without being inspected by an immigration officer and was facing charges of assaulting law enforcement.\n“This criminal illegal alien is being charged with assault after he savagely bit a law enforcement officer in an attempt to evade arrest. DHS law enforcement is facing a 1,150% increase in assaults against them and an 8,000% increase in death threats,” said US Assistant Secretary Tricia McLaughlin.\n“This is the reality of what our ICE officers are facing every day as they go to work to simply do their job and enforce the law. Many of these assaults, including biting and vehicle rammings, are happening as a direct result of sanctuary politicians encouraging illegal aliens to evade arrest,” she added.\nThe DHS said law enforcement officers were facing a more than 1150% increase in assaults against them amid US President Donald Trump’s sweeping immigration crackdown and called for politicians, agitators and media to stop calling for violence and resistance against ICE agents.\nNews of this arrest came on the same day that ICE released an image of a suspect accused of threatening federal agents being taken into custody by an officer from Homeland Security Investigations, according to the New York Post.\n“Logan Murfin of Tulsa, OK, has been charged with ten counts after posting on social media that federal agents need to be gunned down, shot & executed,” ICE wrote on X. “Welcome to the find out stage, Logan.”\nViolent anti-ICE protests have swept the United States in response to Trump’s surge in deportations and criminal migrant arrests. The dramatic expansion of ICE operations has upset communities in several parts of the country and raised concerns over the tactics ICE agents have used to catch alleged illegal immigrants.","summary":"Maximiliano Perez-Perez allegedly bit the hand of an ICE officer while resisting arrest in Louisiana, according to the Department of Homeland Security.","url":"https://www.news18.com/world/us-immigrant-bites-ice-officer-while-resisting-arrest-dhs-releases-photo-of-bloodied-hand-gross-ws-kl-9769676.html","image":"https://images.news18.com/ibnlive/uploads/2025/12/ice-agent-2025-12-36c493a4d01d478fae75969c83666f65.jpg","video":null,"publish_date":"2025-12-14 13:25:13","author":"Aveek Banerjee,News18","authors":["Aveek Banerjee","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.446},{"id":386991822,"title":"US envoys arrive in Berlin for another round of Ukraine peace talks","text":"Berlin, Dec 14 (AP) Ukrainian President Volodymyr Zelenskyy and US envoys arrived in Berlin on Sunday for another round of talks intended to negotiate an end to the war in Ukraine as Moscow and Kyiv stuck to their sharply opposite views of a prospective peace deal.\n Zelenskyy said that Ukrainian, US and European officials will hold a series of meetings in Berlin. He said he will meet personally with US President Donald Trump’s special envoy Steve Witkoff and Trump’s son-in-law Jared Kushner in Berlin.\n Responding to journalists’ questions in audio clips on a WhatsApp group chat, Zelenskyy emphasised the need for Ukraine to receive firm guarantees from the United States and European allies that would be similar to those offered to NATO members after the US and some European countries stonewalled Ukraine’s bid to join the military alliance.\n “These security guarantees are an opportunity to prevent another wave of Russian aggression,” he said. “And this is already a compromise on our part.” Zelenskyy emphasised that any security assurances would need to be legally binding and supported by the US Congress, adding that he expected an update from his team following a meeting between Ukrainian and US military officials in Stuttgart.\n He said that he will meet separately with German Chancellor Friedrich Merz and, possibly, other European leaders later in the evening. He said he hadn’t yet received any response from the US to Ukraine’s latest proposals on the peace plan.\n Washington has tried for months to navigate the demands of each side as Trump presses for a swift end to Russia’s war and grows increasingly exasperated by delays. The search for possible compromises has run into major obstacles, including control of Ukraine’s eastern Donetsk region, which is mostly occupied by Russian forces.\n Tough obstacles remain ——————————- Russian President Vladimir Putin has demanded that Ukraine withdraw its forces from the part of the Donetsk region still under its control and abandon its bid to join NATO, among the key conditions for peace — demands Kyiv has rejected.\n Putin’s foreign affairs adviser, Yuri Ushakov, told the business daily Kommersant that Russian police and national guard would stay in parts of eastern Ukraine’s Donbas even if they become a demilitarised zone under a prospective peace plan, a demand likely to be rejected by Ukraine as US-led negotiations drag on.\n Ushakov warned that a search for compromise could take a long time, noting that the US proposals that took into account Russian demands had been “worsened” by alterations proposed by Ukraine and its European allies.\n Speaking to Russian state TV in remarks broadcast Sunday, Ushakov said that “the contribution of Ukrainians and Europeans to these documents is unlikely to be constructive,” warning that Moscow will “have very strong objections.” Ushakov added that the territorial issue was actively discussed in Moscow when Witkoff and Kushner met with Putin earlier this month. “The Americans know and understand our position,” he said.\n Merz, who has spearheaded European efforts to support Ukraine alongside French President Emmanuel Macron and UK Prime Minister Keir Starmer, said Saturday that “the decades of the Pax Americana are largely over for us in Europe and for us in Germany as well.” He warned that Putin’s aim is “a fundamental change to the borders in Europe, the restoration of the old Soviet Union within its borders.” “If Ukraine falls, he won’t stop,” Merz warned on Saturday during a party conference in Munich.\n Putin has denied plans to restore the Soviet Union or attack any European allies. (AP) SKS SKS","summary":"","url":"https://www.news18.com/agency-feeds/us-envoys-arrive-in-berlin-for-another-round-of-ukraine-peace-talks-9769667.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-12-14 13:15:03","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0},{"id":386978112,"title":"Multiple dead, several wounded after mass shooting at Brown University","text":"Sort by NewestSort by Oldest\n\nBack to Top\n\nincoming update…\n\nBreaking News\n\nAuthorities release video of Brown University mass shooting person of interest\n\nAuthorities released video footage Saturday night of a person of interest in a deadly mass shooting at Brown University in Rhode Island.\n\nNearly a dozen Brown University students were shot at the campus on Saturday.\n\nThe unidentified gunman, who appeared to be in his 30's, killed two Brown University students and wounded nine others.\n\nVideo footage released by the Providence Police Department shows the man leaving the building on foot, dressed in black.\n\nOfficials confirmed the shooting happened inside a classroom in the Barus and Holley engineering building.\n\nFox News' Landon Mion contributed to this report.\n\nPosted by Alexandra Koch Share\n\nPolice say person of interest in custody over fatal shooting at Brown University\n\nRhode Island police say they have a person of interest in custody in connection with the Brown University campus shooting that left two dead and nine injured, The Associated Press reported.\n\nInvestigators plan to release more details at a 7 a.m. news conference.\n\nPosted by Stephen Sorace Share\n\nPolice lift Brown University campus shelter in place order as hunt for gunman continues\n\nBrown University announced early Sunday that police have lifted a campus-wide shelter in place order, though advised that police activity is continuing in some parts that are considered an active crime scene as they hunt a gunman in a deadly shooting.\n\nThe school’s announcement came around 5:40 a.m., hours after a gunman killed two students and wounded nine others in a classroom at the Ivy League school in Providence, Rhode Island, during final exams.\n\nThe school advised that access remains limited to parts of campus where police are active.\n\nThose who leave areas within the police perimeter, including Minden Hall and nearby apartment buildings, would be unable to immediately return.\n\nBrown encouraged those on campus to always follow instructions from law enforcement.\n\nThe unidentified gunman appeared to be in his 30s, and was dressed in all black, according to the Providence Police Department.\n\nThe shooting happened inside a classroom in the Barus and Holley engineering building.\n\nThe suspected gunman was seen leaving the building on foot in video footage released by police.\n\nPosted by Stephen Sorace Share\n\nMassachusetts leaders react to 'heartbreaking' Brown University shooting: 'Tragic act of violence'\n\nMassachusetts leaders offered prayers after a shooting at Brown University\nin Rhode Island on Saturday left two students dead and nine others wounded, calling the incident \"horrific\" and \"tragic.\"\n\n\"My heart is with @BrownUniversity and the City of Providence, and I’m praying for everyone impacted by this tragic act of violence. @MassStatePolice are in close contact with Rhode Island officials and I’ve been in touch with @GovDanMcKee to offer our full support and assistance,\" Gov. Maura Healey wrote on X.\n\nU.S. Sen. Elizabeth Warren, D-Mass., said \"the deadly shooting at Brown University is horrific.\"\n\n\"Students should be able to learn in peace, not fear gun violence. My heart goes out to the victims, their loved ones, and the entire Providence community,\" she wrote.\n\nU.S. Sen. Ed Markey, D-Mass., said he is \"heartbroken by the news of a horrific mass shooting at Brown University and sending love and prayers for the victims, their families, and the entire Providence community.\"\n\n\"We must act now to end this painful epidemic of gun violence. Our children should be safe at school,\" he added.\n\nThe gunman remains at large, according to officials.\n\nPosted by Landon Mion Share\n\nBrown University shooting victims are all students, Sunday exams postponed\n\nBrown University President Christina Paxson confirmed all victims in the shooting on Saturday are students and that the campus remains on lockdown as police continue searching for the gunman.\n\nTwo students were killed in the shooting while nine others were wounded.\n\nPaxson said six students remain in critical but stable condition, one student is in critical condition, another is in stable condition and another was treated and released.\n\n\"Our full focus right now is on our community, their safety and providing support for the victims and their families,\" she said.\n\nProfessors who had final exams scheduled for Sunday notified their students that the tests have been postponed.\n\nNon-emergency staff scheduled to work an overnight shift were also told not to come in while the shelter-in-place order remains in place.\n\n\"Providence Police have advised that our campus must remain on lockdown,\" Paxson said. \"It is an active police scene, and the priority is to keep everyone safe. All members of the campus community will receive an alert notifying students, faculty and staff when the shelter in place order is lifted. Until then, we advise parents and families not to travel to the Brown campus. This is for their safety.\"\n\nPosted by Landon Mion Share\n\nEcon professor says shooting happened in review session for her course's final exam\n\nAn economics professor at Brown University said the deadly shooting at the school on Saturday broke out during a review session for her course's final exam.\n\nRachel Friedberg, who teaches Principles of Economics, was not present when the shooter entered the room while students reviewed material for her final exam, but said a teaching assistant who led the session told her what happened.\n\n\"The room has stadium seating with doors that enter at the top,\" Friedberg told Ocean State Media. \"He said that the shooter came in the doors, yelled something — he couldn't remember what he yelled — and started shooting.\"\n\n\"Students started to scramble to try to get away from the shooter, trying to get lower down in the stadium seating, and people got shot,\" the professor continued. \"I don’t know if they’re the only ones who got shot or not.\"\n\nTwo people were killed and at least nine others were wounded in the shooting that unfolded at the university on Saturday. The gunman remains at large, according to officials.\n\nPosted by Landon Mion Share\n\nProvidence mayor says there is no 'ongoing threat': 'You can safely go to church in the morning'\n\nProvidence Police\n\nProvidence Mayor Brett Smiley said there is no \"ongoing threat\" following the Brown University shooting that left two students dead and at least nine others injured on Saturday, adding that events do not need to be canceled in the aftermath of the tragic incident.\n\nThe gunman remains at large as of late Saturday night, according to officials.\n\n\"In the hours that have eclipsed since the initial shooting, we've received no additional credible information that there is any specific, ongoing threat from this individual,\" the mayor said at a news conference. \"And so we do not believe these events need to be canceled. We do believe you can safely go to church in the morning in order to provide an additional sense of safety and comfort and confidence.\"\n\n\"There will be an enhanced, invisible law enforcement presence throughout the community tomorrow,\" Smiley continued. \"I would like to reiterate our deep gratitude for how hard law enforcement is working right now. It will be up and out all night tonight and throughout the day tomorrow, and will remain hard at work until the individual responsible is brought to justice. But tomorrow, on Sunday, you will see police officers throughout the city. And we are receiving and relying on and grateful for the assistance from the state police and our neighboring communities, all of whom have offered to help. We know this is a scary time.\"\n\nPosted by Landon Mion Share\n\nProvidence mayor confirms ninth victim injured in Brown University shooting\n\nStudents are escorted by law enforcement officers to a building at Brown University after a shooting, Saturday, Dec. 13, 2025, in Providence, Rhode Island. (AP Photo/Charles Krupa)\n\nProvidence Mayor Brett Smiley on Saturday evening confirmed that a ninth person had been injured in the Brown University shooting, in addition to the two people who were killed.\n\n“One of the new details that I’m sorry to have to share is that there is one additional victim today, so now there are nine injured individuals,” Smiley said during a press conference.\n\nHe said the newly identified victim did not suffer a gunshot wound but “had received fragments from the shooting that had occurred near them.\"\n\nThe victim's injuries are non-life-threatening, Smiley said.\n\nOfficials also confirmed that all the victims — with the exception of the most recently identified individual — were students.\n\nAuthorities initially reported two fatalities and eight wounded.\n\nPosted by Sophia Compton Share\n\nRhode Island Hospital gives updates on Brown University shooting victims\n\nPeople stand at an entrance to Rhode Island Hospital in Providence, R.I., on Saturday, Dec. 13, 2025, where victims from a shooting at Brown University were transported. (AP Photo/Mark Stockwell)\n\nRhode Island\nHospital released more information about eight of the nine surviving Brown University mass shooting victims, noting the hospital remains on lockdown but is still accepting emergency room patients.\n\nRhode Island Hospital confirmed it received a total of eight patients from the shooting, including six patients in critical but stable condition, one patient in critical condition, and one patient in stable condition.\n\nTwo students were killed in the shooting.\n\n\"Rhode Island Hospital is working closely with and providing support to all impacted family members, and remains in continuous communication with Brown University,\" hospital officials wrote in a statement. \"Our thoughts and prayers are with everyone affected by this incident.\"\n\nAs of 7:20 pm. local time, the Miriam Hospital has not received any patients.\n\nPosted by Alexandra Koch Share\n\nRhode Island Catholic bishop asks community to 'unite in prayer' for Brown University victims\n\nThe Diocese of Providence\nasked the community to \"unite in prayer\" after 11 people were shot Saturday during an attack at Brown University in Rhode Island.\n\nRev. Bruce Lewandowski, bishop of Providence, wrote in a statement he is \"deeply saddened and troubled by the senseless shooting.\"\n\n\"Let us unite in prayer for those who lost their lives, for the injured, for the Brown University community and all affected by this tragedy,\" Lewandowski wrote. \"May God continue to guide our elected officials, law enforcement, and first responders as they work to keep everyone safe.\"\n\nThe Diocese of Providence said it is offering its resources, clergy and personnel, and charitable assistance wherever needed.\n\n\"May God bless us all and may Our Lady of Providence keep us in her care,\" Lewandowski wrote.\n\nPosted by Alexandra Koch Share\n\nSecret Service offers ‘any and all support’ in wake of shooting\n\nLaw enforcement officials carry rifles while walking on a street in a neighborhood near Brown University in Providence, Rhode Island, on Saturday, Dec. 13, 2025. (Credit: AP Photo/Steven Senne)\n\nU.S. Secret Service Director Sean Curran on Saturday said he has directed personnel in Providence to offer “any and all support\" in the wake of the shooting at Brown University.\n\n“We are saddened to learn of the senseless act of violence at Brown University,” the agency said in a post on X. “I’ve instructed our Secret Service personnel in Providence to provide any and all support needed.\"\n\n“Prayers for the victims and all those impacted.”\n\nPosted by Sophia Compton Share\n\nBrown University says its 'imperative' community remains sheltered in place as manhunt continues\n\nPolice seen inside the sciences library at Brown University, following campus shooting. (Credit: Andrea Margolis/Fox News Digital)\n\nBrown University officials sent an alert just before 8:30 p.m. local time, telling the community it is \"imperative\" members of the community remain sheltered in place as law enforcement searches for a gunman accused of killing two people and wounding eight others.\n\n\"The Brown campus continues to be in lockdown,\" university officials wrote in the alert. \"This means keeping all doors locked and ensuring no movement across campus.\"\n\nThe law enforcement response remains ongoing.\n\n\"Safety is the utmost and essential priority,\" officials wrote.\n\nPosted by Alexandra Koch Share\n\nRhode Island gov says capital city experienced 'unthinkable tragedy'\n\nBarus and Holley Engineering building at Brown University. (Credit: Andrea Margolis/Fox News Digital)\n\nRhode Island Gov. Dan McKee released a statement on X noting the state is \"making every resource available\" and the investigation into Saturday's mass shooting at Brown University continues.\n\n\"Our capital city experienced an unthinkable tragedy today,\" McKee wrote in the post. \"Our hearts are with the people of Providence and all those impacted.\"\n\nA shelter in place remains in effect for the greater Brown University area.\n\nPosted by Alexandra Koch Share\n\nOfficials at the scene say there are 'too many unknowns' prompting continued shelter in place order\n\nA law enforcement official walks past articles of clothing on a sidewalk near an entrance to Brown University, Saturday, Dec. 13, 2025, in Providence, R.I., during the investigation of a shooting. (AP Photo/Steven Senne)\n\nAn official wearing tactical gear at the scene of the Brown University mass shooting told Fox News Digital' there are “too many unknowns,\" referring to people in the area, leading to the prolonged shelter in place order.\n\nStudents are still sheltering in place as authorities work to clear university buildings.\n\nThe gunman, who was wearing all black at the time of the shooting, remains at large prompting a massive manhunt.\n\nFox News Digital's Andrea Margolis contributed to this post.\n\nPosted by Alexandra Koch Share\n\nLocal resident recounts moments after university shooting: 'Haven't heard of anything like this'\n\nElias Christian, a Providence resident who lives just blocks from Brown University’s Barus and Holley engineering and physics building, said he first sensed something was wrong Saturday evening when he heard emergency vehicles racing toward campus.\n\n“I haven’t lived here too long, just a couple years, but I haven’t heard of anything like this happening,” Christian told Fox News Digital. “… This is known as kind of the safe part of the city and has a safer reputation in general.”\n\nHe said the shooting feels especially jarring because of where it unfolded.\n\n“This is kind of the heart of Brown,” he said.\n\nChristian said he did not feel particularly scared himself, noting that police appeared to have the situation “under control.”\n\nHowever, he recognized that it must have been “much scarier” for those who were closer when the chaos began.\n\n“I'm sure it was so much scarier for people who were here before it was under control,” Christian said. “And all the students in this building and in the area.”\n\nFox News Digital's Andrea Margolis contributed to this report.\n\nPosted by Sophia Compton Share\n\nStudents evacuate Brown University building following deadly shooting\n\nBrown University students were seen being evacuated from university building by police as the manhunt continues for a male gunman accused of fatally shooting two people and wounding eight others on Saturday.\n\nStudents could be seen visibly shaken up while walking out of the Building for Environmental Research and Teaching, while police lights flashed around them.\n\nMany buildings remain locked down as the search continues.\n\nPosted by Alexandra Koch Share\n\nBrown University streets blocked off as authorities sweep mass shooting scene\n\nAuthorities are combing Brown University after a gunman killed two people and wounded eight others in a mass shooting Saturday.\n\nAt the scene, Fox News Digital's Andrea Margolis reported police are standing in the doors of buildings, with streets blocked off in yellow crime scene tape.\n\nThrough flashing lights and sirens, armed law enforcement could be seen walking in the direction of the Barus and Holley engineering building, where university officials and police said the shooting unfolded.\n\nThe campus remains quiet and many onlookers have moved away as police continue their search for the unidentified male gunman still at large in the community.\n\nArmored vehicles have also responded to the scene.\n\nPosted by Alexandra Koch Share\n\nLocal business owner describes ‘terrifying’ scene amid Brown University shooting\n\nCrime scene tape blocks off streets near Brown University as the investigation continues. (Credit: Andrea Margolis / Fox News Digital)\n\nLocal business owner Roshan, who runs the Metro Mart near Brown University in Providence, said he was arriving in the area just a few blocks away when he first noticed the heavy police presence on Saturday evening.\n\n“I saw the ambulance and police, and they blocked the way so I couldn’t park. I usually park in front of my store,” he told Fox News Digital. “It’s very scary … like 90% of the people here are students. It’s terrible.”\n\nHe said he closed his store and stood outside trying to get information from police and social media when he learned about the shooting.\n\nRoshan described the city as “one of the safest areas,” adding that he often walks the streets at night without concern.\n\n“And all of a sudden, a shooting like this … this is terrifying right now,” he said. \n\nFox News Digital's Andrea Margolis contributed to this post.\n\nPosted by Sophia Compton Share\n\nStudent barricaded in university basement says he is hearing 'pretty daunting numbers' of victims\n\nA junior Brown University student barricaded in a university building basement told Fox News Digital students barricaded in the top floor of a university building during the shooting, called 911, and waited nearly two hours before police arrived.\n\n“They brought us down into a basement office space with a few hundred people and have been sweeping the building getting groups of people as they call 911 and inform them of their location,\" the student said. “We’re hearing pretty daunting numbers and people are all checking in on their friends.\"\n\nFox News Digital's Adriana James-Rodil contributed to this post.\n\nPosted by Alexandra Koch Share\n\nPresident Trump calls Brown University shooting a 'terrible thing'\n\nPresident Donald Trump on Saturday addressed the mass shooting Saturday at Brown University, calling it a \"terrible thing.\"\n\nTrump said he has been briefed on the shooting, which claimed at least two lives and wounded eight others.\n\n\"What a terrible thing it is,\" the president told the media following the Army-Navy football game. \"All we can do right now is pray for the victims and for those that were very badly hurt, it looks like. ... We'll inform you later as to what's happening, but it's a shame. Let's just pray.\"\n\nPosted by Alexandra Koch Share\n\nAuthorities searching for gunman in fatal Brown University shooting\n\nCity officials hosted a press conference following a shooting Saturday at Brown University. Officials said there is no suspect in custody. (Credit: Andrea Margolis/Fox News Digital)\n\nAuthorities are searching a suspect accused of opening fire at Brown University's Barus and Holley engineering building, killing at least two people and wounding eight others.\n\nThe unidentified male gunman was last seen leaving the Barus and Holley engineering building after the shooting at about 4 p.m. local time.\n\nOfficials said the alleged shooter was dressed in black.\n\nMultiple local law enforcement agencies, along with the FBI and U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) are investigating.\n\nPosted by Alexandra Koch Share\n\nBreaking News\nAt least 2 dead, 8 in critical condition after Brown University mass shooting\n\nEmergency personnel gather on Waterman Street at Brown University in Providence, R.I., on Saturday, Dec. 13, 2025, during the investigation of a shooting. (AP Photo/Mark Stockwell)\n\nAt least two people are dead and eight others remain in critical, but stable condition following a shooting Saturday during final exams at Brown University in Rhode Island.\n\nProvidence Mayor Brett Smiley did not confirm if the victims were students or faculty.\n\nPosted by Alexandra Koch Share\n\nLive Coverage begins here","summary":"Multiple people are dead and several others are hurt after a mass shooting Saturday at Brown University in Rhode Island.","url":"https://www.foxnews.com/live-news/multiple-dead-several-wounded-after-mass-shooting-at-brown-university","image":"https://a57.foxnews.com/livenews.foxnews.com/images/2025/12/1100/619/3930a5982489f13321e4ae6e7f2eea98.png","video":null,"publish_date":"2025-12-14 11:46:07","author":"Alexandra Koch,Andrea Margolis,Landon Mion,Sophia Compton,Stephen Sorace","authors":["Alexandra Koch","Andrea Margolis","Landon Mion","Sophia Compton","Stephen Sorace"],"language":"en","source_country":"US","sentiment":-0.537},{"id":386984140,"title":"Laura Woods' anger at threat of being cancelled after Olympics boxing gender row","text":"Laura Woods has shared her fears of facing backlash when she voiced her opinion on the gender controversy that overshadowed the 2024 Olympic Games . The issue centred around Algerian boxer Imane Khelif's participation and subsequent gold medal win in the women's welterweight boxing division at the Paris Olympics. Khelif, along with China's Lin Yu-ting , had been disqualified from the World Championships by the International Boxing Association (IBA) a year earlier. The IBA, a discredited world governing body backed by Russia , claimed that blood test results proved Khelif was ineligible to compete against females. However, they failed to provide any documented evidence to support their claims. The International Olympic Committee (IOC) deemed the tests not credible and cleared both athletes to compete at the Games. Amidst the controversy, Woods, a presenter for TNT Sports, publicly praised a Telegraph article on social media. The piece argued that the IOC's decision to allow Khelif - who has previously been wrongly labelled as transgender - and Lin to compete put biological women at risk. Over a year after endorsing the article, Woods spoke to the newspaper , revealing her concerns that speaking out could have led to her being cancelled. Woods, 38, expressed her frustration, saying: \"I remember just almost screaming internally, because I felt there was such an injustice going on in front of our eyes. \"I was so angry that everyone who wanted to talk about it openly was gaslighted into thinking that what they were saying was wrong. \"It still annoys me now, because there was so much sympathy given to Khelif, and such a lack of it to the women around that athlete. \"It felt so disproportionate. I couldn't believe that even questioning it out loud was worthy of cancellation.\" Since defeating Yang Liu in last year's final, Algerian boxer Khelif has vowed to compete at the 2028 Games in Los Angeles. This is despite President Donald Trump's promise to ban biological men from competing in women's sports, and his false implication that Khelif was born male. The boxer responded to these claims earlier this year. In an interview with ITV Sport, Khelif stated: \"The US President issued a decision related to transgender policies in America. I am not transgender. This does not concern me, and it does not intimidate me. That is my response.\" She confessed that the scrutiny she faced last year had a significant impact on her mental and emotional wellbeing. \"I was deeply affected mentally and felt discouraged, but I remained aware of what was happening,\" she added. \"Even during the Paris Olympics, I had a team of specialist doctors who provided me with support and assistance. Without their support, I might have fallen into a spiral of depression.\" It was after Khelif's second round victory over Italy's Angela Carini that sparked mass backlash sent the Algerian's way. She defeated the Italian in only 46 seconds, with Carini reportedly saying, \"It's not fair,\" after receiving a punch from Khelif.","url":"https://www.mirror.co.uk/sport/boxing/laura-woods-olympics-imane-khelif-36398621","image":"https://i2-prod.mirror.co.uk/article36395289.ece/ALTERNATES/s1200b/0_Manchester-City-v-Bayer-04-Leverkusen-UEFA-Champions-League-202526-League-Phase-MD5.jpg","video":null,"publish_date":"2025-12-14 11:27:24","author":"Fasika Zelealem","authors":["Fasika Zelealem"],"language":"en","source_country":"gb","sentiment":-0.514},{"id":386978086,"title":"Inside Alex Clark’s push to heal a ‘sick culture’ and why the right can’t stop listening","text":"Alex Clark, a former radio host, now leads the health and wellness podcast \"Culture Apothecary,\" powered by Turning Point USA. Clark joined Turning Point USA in 2019 after pitching a show idea to share pop culture from a conservative perspective, \"POPlitics!\" Clark told Fox News Digital in an exclusive interview that she was on pop radio for \"nearly a decade\" and was \"openly conservative\" before joining TPUSA. \"It was becoming harder and harder to be openly conservative in mainstream media once [Donald] Trump became president the first time around,\" said Clark. By 2018, Clark said she was ready for something new but still wanted to reach young women. TRUMP WILL MAKE AMERICA HEALTHY AGAIN WITH AN UNLIKELY COALITION \"Turning Point USA was already familiar with me as someone who was outspokenly conservative in broadcasting,\" Clark recalled. \"They said, ‘Hey, we’d love to talk about how we could work together.’ I told them, ‘Great, I have a show idea for you,’ and that’s how ‘POPlitics!’ began.\" In 2021, Clark started the \"Spillover\" podcast, to go beyond pop culture, which is described as the \"big sister\" to the POPlitics! show, according to the TPUSA website. ACTRESS CHERYL HINES CLASHES WITH 'THE VIEW' OVER HER HUSBAND RFK JR’S RECORD SERVING AMERICANS In 2024, Clark rebranded and launched the \"Culture Apothecary\" podcast, focused on overall wellness. In a May interview with Vanity Fair, Clark said the focus on health and wellness is the \"future\" of the conservative movement and hopes to help cure a sick culture. She added that each episode she does focuses on how to help heal people physically, emotionally, or spiritually. This is the issue she believed would resonate, especially among women. Clark, who used to post about her love for chicken nuggets and Dr. Pepper, is now encouraging her audience to eat a clean diet avoiding \"seed oils\" and other artificial ingredients, get off birth control, and is skeptical of vaccines. In a Washington Post piece last year, it was mentioned that Clark found herself questioning many health mandates during the coronavirus pandemic. Clark read Beth Macy’s book \"Dopesick,\" which led her to question the FDA and Centers for Disease Control and Prevention. She then began researching hormonal birth control that she had taken since she was a teenager and noticed the list of side effects associated…\"a risk of blood clots, all these different diseases, I was shocked\" — that bred a distrust of the pharmaceutical industry,\" she told the Washington Post. Although hormonal birth control can increase the risk of blood clots among some, the occurrence is rare, according to the CDC. Clark is an advocate for the MAHA movement, and she testified in 2024 during a Senate hearing on chronic illness. During her speech, she mentioned fertility issues facing millennial women as well as concerns about raising kids who are healthy both mentally and physically. SECRET OF LOOKING YOUNGER, FEELING HEALTHY IS IN THIS MORNING DRINK, MAHA INFLUENCER SAYS During her speech where she questioned the number of vaccines advised for American children, she claimed, \"Parents are being held hostage. They didn't sign up to co-parent with the government, we want a divorce.\" Following this statement, she received a standing ovation, including from Robert F. Kennedy Jr., who now heads the Department of Health and Human Services. Additionally, Clark mentioned in her speech concerns with rates of childhood cancer and diseases. The Washington Post reported from TPUSA's Young Women's Leadership Summit from June shared a statement made by Clark at the event, \"Less Prozac, more protein!\" she said. \"Less burnout, more babies! Less feminism, more femininity!\" \"This is Whole Foods meets the West Wing,\" she said. \"It’s collagen, calluses, and conviction. It’s castor oil, Christ, and a well-stocked pantry.\" The right has \"the girls who lift weights, eat clean, have their hormones balanced, have their lives together,\" Clark said. The left, meanwhile, has \"TikTok activists with five shades of autism, panic attacks and a ring light.\" \"We’re not running from culture anymore,\" she continued during the event. \"We’re running it.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP","summary":"Former radio host Alex Clark transformed her career to become a conservative wellness advocate, hosting the &apos;Culture Apothecary&apos; podcast for Turning Point USA.","url":"https://www.foxnews.com/media/inside-alex-clarks-push-heal-sick-culture-why-right-cant-stop-listening","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/alex-clark-podcaster.jpg","video":null,"publish_date":"2025-12-14 11:00:26","author":"Elizabeth Heckman","authors":["Elizabeth Heckman"],"language":"en","source_country":"US","sentiment":-0.142},{"id":386983960,"title":"Donald Trump 'obsessed with me' says Sadiq Khan as US President brands him 'disgusting'","text":"Sir Sadiq Khan has said Donald Trump is \"obsessed with me\" after the US President launched a fresh attack against him. The Mayor of London said Mr Trump's repeated rants against him were \"sticks and stones\" and questioned why he didn't have more important things to do. It marks the latest salvo in a long-running feud, which began during Mr Trump's first presidency. In an interview with Politico this week, the US President attacked \"weak\" European leaders who he said were destroying their nations with immigration and allowing the continent to decay. He singled out Mr Khan - the Capital's first Muslim mayor - in his rant. He said: \"If you take a look at Paris, it’s a much different place. I loved Paris. Uh, it’s a much different place than it was. If you take a look at London, you have a mayor named Khan. He’s a horrible mayor. \"He’s an incompetent mayor, but he’s a horrible, vicious, disgusting mayor. I think he’s done a terrible job. London’s a different place. I love London. I love London. And I hate to see it happen. You know, my roots are in Europe, as you know.\" Sir Sadiq dismissed the comments today in an interview with LBC and said he didn't want to get into a childish tit-for-tat with the US President. He went on: \"I'm slightly curious and concerned why the leader of the free world who's got so many challenges in the Middle East, in Ukraine , issues around the climate emergency, issues around trade, is spending time talking about me, and giving the impression he's obsessed with me and, for him, it’s to explain why.\" Asked if Mr Trump was obsessed with him, he said: \"Well, look at the evidence. Every opportunity the President gets when there's a microphone placed in front of him, he appears to be obsessing about me. And I'm unclear why.\" The London Mayor said politicians and right-wing commentators were constantly talking down the city. He said: \"They seem to feel insecure that a city that is progressive, that is liberal, that is diverse, that is multicultural, is so incredibly successful. I think their nervousness and worry is it's the antithesis, it's the antidote, to all they stand for, which is unilateralism, which is nativism, which is protectionism.\" Asked if it was racism, he said: \"Well, I think the question that President Trump's comments beg is, why obsession with this particular Mayor? On any metrics, by the way, and you can look at Time Out, Trip Advisor, Residence Consultancy, we're number one in the league table. We are miles ahead of on any metrics, New York, Chicago, LA, Paris, Madrid, Barcelona. Why pick on London?\" Pressed on whether Trump was obsessed with him due to racism, he said: \"I've said in the past this, this is nothing new. Some of the things President Trump has said and done lead me to believe he's a President who is racist, who is misogynistic and who is Islamophobic. And I'd go further. I think he's somebody who is anti-Muslim as well.\"","url":"https://www.mirror.co.uk/news/politics/donald-trump-obsessed-me-says-36398674","image":"https://i2-prod.mirror.co.uk/article36398768.ece/ALTERNATES/s1200b/1_AHP_CHP_38691.jpg","video":null,"publish_date":"2025-12-14 11:00:11","author":"Lizzy Buchan","authors":["Lizzy Buchan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.046},{"id":386983468,"title":"A Trump-touted drug for autism is now in demand, but doctors see a dilemma","text":"Pediatrician Kristin Sohl has lost count of how many times parents of children with autism have asked her for a prescription for leucovorin — the drug thrust into the spotlight after President Donald Trump touted it at a White House event this fall.","url":"https://www.washingtonpost.com/health/2025/12/13/trump-leucovorin-autism-treatment/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H6WVZDNLJA6YCBVNUILBN3CBQU.jpg&w=1600&h=900","video":null,"publish_date":"2025-12-14 10:00:00","author":"Ariana Eunjung Cha","authors":["Ariana Eunjung Cha"],"language":"en","source_country":"us","sentiment":-0.223},{"id":386991188,"title":"\"Russia is dragging out the war,\" says Zelenskyy as Russian strikes leave hundreds of thousands without power","text":"Kyiv [Ukraine], December 14 (ANI): Ukrainian President Volodymyr Zelenskyy on Sunday said Russia continues to target Ukraine's energy infrastructure, leaving hundreds of thousands of families without electricity, heating and water, even as Kyiv prepares for crucial diplomatic engagements with the United States and European partners aimed at ending the war.In a series of posts on social media, Zelenskyy said Ukrainian emergency and utility services have been working continuously since Friday to restore basic services after fresh Russian strikes.\"The situation remains difficult - hundreds of thousands of families are still without electricity in Mykolaiv, Odesa, Kherson, Chernihiv, Donetsk, Sumy, and Dnipro regions,\" he said, thanking workers involved in repair efforts.Zelenskyy added that Russian attacks continued overnight, leaving civilians wounded.\"Russia is dragging out the war and seeks to inflict as much harm as possible on our people,\" he said.According to the Ukrainian president, Russia carried out an intense wave of attacks over the past week alone.\"In total, the Russians launched more than 1,500 attack drones, nearly 900 guided aerial bombs, and 46 missiles of various types against Ukraine this week. Just one week,\" Zelenskyy said.\n\nSince yesterday, all our services have been working to restore electricity, heating, and water supply to the regions following Russian strikes on energy infrastructure. The situation remains difficult – hundreds of thousands of families are still without electricity in Mykolaiv,… pic.twitter.com/vZotX4Zxal— Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) December 14, 2025\n\nDespite the ongoing strikes, Zelenskyy said Ukraine remains committed to pursuing peace through diplomacy.\"Ukraine needs peace on dignified terms, and we are ready to work as constructively as possible,\" he said, adding that the coming days would be focused on diplomatic efforts. \"It is critically important that it delivers results.\"In an earlier statement, Zelenskyy said Ukraine is preparing for a series of high-level meetings with the United States and European countries in the coming days, with Berlin set to host several key discussions.\"We are currently preparing for meetings with the U.S. side and our European friends in the coming days. Berlin will host many events,\" he said.Zelenskyy said Ukrainian Defence Minister Rustem Umerov would brief him and the negotiating team on contacts already held, while military and security officials would work on the details of security guarantees for Ukraine.\"General Hnatov and representatives of Ukraine's defense and security sector will be working on the details of security guarantees for Ukraine, for Ukrainians,\" he said.The Ukrainian leader also said talks are continuing with Western partners on Ukraine's recovery and development after the war.\n\nWe are currently preparing for meetings with the U.S. side and our European friends in the coming days. Berlin will host many events.There will be a briefing from Secretary Umerov and our negotiating team on their contacts that have already taken place. General Hnatov and… pic.twitter.com/pqn9p646YJ— Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) December 13, 2025\n\n\"At the same time, Ukrainian government officials continue discussions with the United States and Europe on the real recovery and real development of Ukraine after the war,\" he added.Zelenskyy said a key part of the diplomatic effort would include meetings with envoys of US President Donald Trump, along with discussions with European leaders on a political agreement to end the war.\"Most importantly, I will be meeting with envoys of President Trump, and there will also be meetings with our European partners, with many leaders, concerning the foundation of peace - a political agreement to end the war,\" he said in an X post. He stressed that Ukraine is seeking a dignified peace and firm guarantees against future aggression.\"We are working to ensure that peace for Ukraine is dignified, and to secure a guarantee - above all, that Russia will not return to Ukraine for a third invasion,\" Zelenskyy said.Earlier on Saturday, Ukraine imposed a major new round of sanctions targeting Russia's maritime vessels, with restrictions coming into force against nearly 700 vessels used to finance Moscow's war effort, President Volodymyr Zelenskyy said.In a post on X, Zelenskyy said the latest measures focus on a large segment of Russia's fleet that transports oil and other energy resources, generating revenue to sustain the war against Ukraine.He described the move as the most extensive sanctions package Ukraine has introduced so far against tankers and other vessels linked to Russia's aggression. (ANI)","url":"https://www.aninews.in/news/world/europe/russia-is-dragging-out-the-war-says-zelenskyy-as-russian-strikes-leave-hundreds-of-thousands-without-power20251214150430","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251214092336.jpg","video":null,"publish_date":"2025-12-14 09:34:30","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.004},{"id":386975604,"title":"Police search Rhode Island’s Brown University after gunman kills two, wounds nine on campus: ‘The unthinkable","text":"University president Christina Paxson said she was told that 10 people who were shot were students. Another person was injured by fragments from the shooting, but it was not clear if that victim was a student, she said.\n\nOfficers scattered across the campus and into an affluent neighbourhood filled with historic and stately brick homes, searching academic buildings, backyards and porches late into the night after the shooting erupted in the afternoon.\n\nThe suspect was a man in dark clothing who was last seen leaving the engineering building where the attack happened, said Timothy O’Hara, deputy chief of Providence police.\n\nSecurity footage showed the suspect walking away from the building, but his face was not visible. Some witnesses reported that the man, who could be in his 30s, may have been wearing a camouflage mask, Mr O’Hara said.\n\nInvestigators were not yet sure how the gunman got inside the first-floor classroom where he opened fire. Outer doors of the building were unlocked, but rooms being used for final exams required badge access, Providence’s mayor said.\n\nAuthorities believe the suspect used a handgun, according to a law enforcement official who was not authorised to discuss an ongoing investigation and spoke on condition of anonymity.\n\n“The unthinkable has happened,” said Democratic Rhode Island Governor Dan McKee, who vowed that all resources were being deployed to catch the suspect.\n\nMayor Brett Smiley said a shelter-in-place order remained in effect and encouraged people living near the campus to stay inside or not return home until it is lifted. Streets that normally bustle with activity on weekends were eerily quiet.\n\n“The Brown community’s heart is breaking, and Providence’s heart is breaking along with it,” Mr Smiley said.\n\nNine people with gunshot wounds were taken to Rhode Island Hospital, where one was in critical condition, said Kelly Brennan, a spokesperson for the hospital. Six required intensive care but were not getting worse, and two were stable, she said.\n\nUniversity officials initially told students and staff that a suspect was in custody, but later said that was not the case.\n\nThe mayor said a person preliminarily thought to be involved was detained but was later determined to have no involvement.\n\nNearly five hours after the shooting, officers in tactical gear led students out of some campus buildings and into a fitness centre.\n\nThe shooting occurred in the Barus and Holley building, a seven-storey complex that houses the School of Engineering and the physics department. According to the university’s website, the building includes more than 100 laboratories, dozens of classrooms and offices.\n\nEngineering design exams were underway there when the shooting occurred.\n\nStudents in a nearby lab hid under desks and turned off the lights after receiving an alert about the shooting, said Chiangheng Chien, a doctoral student in engineering who was about a block away from the scene.\n\nMari Camara, a junior from New York City, was coming out of the library and rushed inside a taqueria to seek shelter. She spent more than three hours there, texting friends while police searched the campus.\n\n“Everyone is the same as me, shocked and terrified that something like this happened,” she said.\n\nBrown, the seventh-oldest higher education institution in the US, is one of the nation’s most prestigious colleges, with roughly 7,300 undergraduates and more than 3,000 graduate students.\n\nPresident Donald Trump told reporters that he had been briefed and “all we can do right now is pray for the victims”.\n\nRhode Island has some of the strictest gun laws in the US.\n\nLast spring, the Democratic-controlled Legislature passed an assault weapon ban that will prohibit the sale and manufacturing of certain high-powered firearms, but not their possession, starting next July.","url":"https://www.independent.ie/world-news/north-america/police-search-rhode-islands-brown-university-after-gunman-kills-two-wounds-nine-on-campus-the-unthinkable-has-happened/a1406277647.html","image":"https://focus.independent.ie/thumbor/dJzgiRL0SIzqTOrUg83fI8j7oWw=/0x0:3238x2158/550x550/prod-mh-ireland/203523a0-d6c4-4023-9e46-c5138433f3a2/b60b9304-7811-4229-8c7c-03658838f23b/203523a0-d6c4-4023-9e46-c5138433f3a2.jpg","video":null,"publish_date":"2025-12-14 09:10:40","author":null,"language":"en","source_country":"ie","sentiment":-0.501},{"id":386987006,"title":"Arkansas to become first state to cut ties with PBS: 'Not feasible'","text":"Arkansas is set to become the first state to sever ties with PBS, after the commission that oversees public television in the state voted to end its contract with the broadcast company. The eight-member Arkansas Educational Television Commission announced on Thursday that it plans to disaffiliate from PBS starting July 1. The commission, which is made up entirely by governor-appointed members, pointed to annual membership dues of about $2.5 million that it described as \"simply not feasible.\" TRUMP FUNDING CUTS FORCE PBS TO ELIMINATE 100 JOBS The announcement also cited the unexpected loss of federal funding from the Corporation for Public Broadcasting, which was defunded by Congress earlier this year and has since begun winding down operations. The ending of CPB comes as President Donald Trump has targeted public media by accusing it of spewing left-wing-biased political and cultural views. CPB helps fund PBS and NPR, but most of its funding is distributed to more than 1,500 local public TV and radio stations across the U.S. With the move to disaffiliate, PBS Arkansas will rebrand as Arkansas TV. DOMINO&apos;S REBRANDS FOR FIRST TIME IN OVER A DECADE Programming is expected to remain largely the same before July 1, at which point the network plans to focus on locally produced content. \"Public television in Arkansas is not going away,\" PBS Arkansas Executive Director and CEO Carlton Wing, also a former Republican state representative, said in a statement. \"In fact, we invite you to join our vision for an increased focus on local programming, continuing to safeguard Arkansans in times of emergency and supporting our K-12 educators and students. … We are confident that we can secure ongoing and increased support from individual donors, foundation partners and corporate sponsors who see the value in investing in new local programming that serves our state,\" he continued. GET FOX BUSINESS ON THE GO BY CLICKING HERE A PBS spokesperson said in a statement to Arkansas outlet KNWA that the commission’s decision \"is a blow to Arkansans who will lose free, over the air access to quality PBS programming they know and love.\" Although Arkansas is the first state to end its affiliation with PBS, Alabama considered a similar move last month before choosing to continue its contract with the broadcaster following public backlash.","summary":"Arkansas becomes the first state to cut ties with PBS after a state commission voted to end its contract, citing $2.5 million annual dues and federal funding losses.","url":"https://www.foxbusiness.com/media/arkansas-become-first-state-cut-ties-pbs-not-feasible","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/12/pbs-sign-building-arkansas.png","video":null,"publish_date":"2025-12-14 08:58:22","author":"Landon Mion","authors":["Landon Mion"],"language":"en","source_country":"us","sentiment":0.025},{"id":386969428,"title":"Trump warns of 'serious retaliation' after 2 US soldiers, civilians killed in ISIS ambush in Syria: 'There will be....","text":"US President Donald Trump on Saturday (local time) pledged \"very serious retaliation\" after an ISIS gunman killed two US soldiers and one civilian interpreter in an ambush in Syria, calling the attack a strike against both the United States and Syria.\n\nSpeaking at the White House, the president described the victims as \"three great patriots\" and characterised the incident as an assault on both Washington and Damascus.\"This was an ISIS attack on us and Syria,\" he told reporters. \"We mourn the lost and we pray for them and their parents and their loved ones.\"Asked if the US would respond, Trump was unequivocal: \"Yes, we will retaliate.\"He repeated the warning on Truth Social, writing, \"There will be very serious retaliation. We mourn the loss of three Great American Patriots in Syria--two soldiers and one civilian interpreter. Likewise, we pray for the three injured soldiers who, it has just been confirmed, are doing well.\"\n\nUS Central Command (CENTCOM) confirmed that the attack occurred on 13 December during counter-terrorism operations near Palmyra. The lone gunman was engaged and killed by US and partner forces. Three other US soldiers were wounded but are recovering. The identities of the deceased will be withheld for 24 hours until next of kin are notified.Trump also said Syria's new president, Ahmed al-Sharaa, was \"extremely angry and disturbed\" by the attack, which occurred in \"a very dangerous part of Syria\" not fully under government control. The US has approximately 900 troops deployed in Syria as part of ongoing operations against Islamic State militants. \n\nThe shooting occurred weeks after Syria's interim president, Ahmed al-Sharaa, held talks with Trump at the White House. Al-Sharaa came to power after the downfall of Bashar al-Assad's government last year. Assad later fled to Russia, where he was granted asylum, and has vowed to continue opposing rebel forces. Al-Sharaa, a former al-Qaeda member who was previously detained by US forces in Iraq, had his global terrorist designation lifted by Trump ahead of their meeting.\n (Except for the headline, the story hasn't been edited by DNA staff but is directly published from ANI)","url":"https://www.dnaindia.com/world/report-trump-warns-of-serious-retaliation-after-2-us-soldiers-civilians-killed-in-isis-ambush-in-syria-there-will-be-3193246","image":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2025/12/14/2734806-phto-2025-12-12t063657.758.png","video":null,"publish_date":"2025-12-14 08:45:00","author":"Am Ist","authors":["Am Ist"],"language":"en","category":"politics","source_country":"in","sentiment":-0.314},{"id":386982252,"title":"Jake Tapper Rejects White House Reason For Trump's Bruises: 'There Is Something Going On'","text":"CNN host Jake Tapper isn’t buying the official White House explanation for President Donald Trump sporting bandages on the back of his hand, arguing on “The Lead” that there’s more to the president’s health picture than has been revealed.\n\nTapper discussed the matter with CNN chief political analyst David Axelrod and ex-Trump aide Alyssa Farah Griffin after White House press secretary Karoline Leavitt told reporters Thursday that Trump wears the bandages as a result of “constantly shaking hands.”\n\n“The White House gave the same explanation for bruising back in July,” Tapper said Thursday. “Obviously, he’s 79 years old. And there is something going on with his health that they’re not telling us, because otherwise, why did he have that MRI?”\n\nTrump visited the Walter Reed Medical Center in Bethesda, Maryland, in October for his second “yearly” check-up in six months, later boasting to reporters that the results were “outstanding” — before claiming that he actually has “no idea what they analysed.”\n\nAxelrod noted that this lack of transparency from the administration is “a common theme.”\n\n“A lot of extraordinary things have happened when the president of the United States has an MRI and can’t remember or name what part of the body the MRI was about,” he told Tapper. “There are questions, there are issues here.”\n\n“And the question is whether the American people deserve to know,” he continued. “They were raised relative to [former President Joe] Biden, [and] they should be raised now, because clearly something’s going on.”\n\nTapper reminded his guests that Trump is an open germaphobe who has publicly admitted that he doesn’t like shaking hands and asked them how much confidence they have in the official hand-shaking explanation about his bandages.\n\n“I think that there’s going to have to be a better answer,” Griffin told Tapper. “What happens with this, we’ve seen it before, is the rumours and the speculation must take on a life of their own if there’s not some sort of a clear medical answer.”\n\nThe conservative “View” co-host continued, “But I think we’ve seen enough from the first Trump term and as far as we are in now, that we’re not going to get a whole lot more information than what we’ve gotten so far.”\n\nThe White House previously said Trump’s bruises are the result of a “benign and common condition,” confirming in July that he was diagnosed with chronic venous insufficiency, which purportedly also explained the visible swelling of his lower legs.\n\nTapper and Axelrod both mentioned that the American people have never seen “bruising like this” on the hands of any other U.S. president, so there’s a warranted reason to pursue a convincing answer.\n\n“How about the truth?” Axelrod asked. “How about facts? That would be good.”","summary":"CNN host Jake Tapper isn’t buying the official White House explanation for President Donald Trump sporting bandages on the back of his hand, arguing on “The Lead” that there’s more to the president’s health picture than has been revealed.\n\nTapper discussed the matter with CNN chief political analyst David Axelrod and ex-Trump aide Alyssa Farah Griffin after White House press secretary Karoline Leavitt told reporters Thursday that Trump wears the bandages as a result of “constantly shaking hands.”\n\n“The White House gave the same explanation for bruising back in July,” Tapper said Thursday. “Obviously, he’s 79 years old. And there is something going on with his health that they’re not telling us, because otherwise, why did he have that MRI?”\n\nTrump visited the Walter Reed Medical Center in Bethesda, Maryland, in October for his second “yearly” check-up in six months, later boasting to reporters that the results were “outstanding” — before claiming that he actually has “no idea what they analysed.”\n\nAxelrod note","url":"https://www.huffingtonpost.co.uk/entry/jake-tapper-rejects-white-house-reason-for-trumps-bruises-there-is-something-going-on_uk_693e7667e4b0f14dd5dde89a","image":"https://img.huffingtonpost.com/asset/693dd33819000062187f414d.jpeg?cache=WR4Tf9ueFq&ops=500_281%2Cscalefit_1200_630","video":null,"publish_date":"2025-12-14 08:35:38","author":"Marco Margaritoff","authors":["Marco Margaritoff"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.43},{"id":386991090,"title":"Curfew imposed in Thailand's Trat Province as border clashes with Cambodia continue","text":"Bangkok [Thailand], December 14 (ANI): Thailand's military on Sunday imposed a curfew in parts of Trat Province, citing the ongoing security situation along the border areas, Xinhua reported. In an official order, the military said a curfew has been enforced with immediate effect in five districts of Trat Province--Khlong Yai, Bo Rai, Laem Ngop, Khao Saming and Mueang Trat. Residents in these areas have been instructed not to leave their homes between 7:00 PM and 05:00 AM the next day.Thai media reports said the decision followed an incident late Saturday night in which three M79 grenades were fired at the headquarters of the Marine Corps Task Force in Trat Province. The grenades are believed to have been launched from within Thai territory. No casualties were reported as the explosives landed in an uninhabited area.This is the second Thai province to impose a curfew since the latest round of clashes along the Thailand-Cambodia border began. Earlier, the Thai military had imposed similar restrictions in four border districts of Sa Kaeo Province on Wednesday.The curfew announcement comes amid continuing hostilities and heightened tensions between Thailand and Cambodia.\n\nThailand has denied reaching any ceasefire agreement with Cambodia and said its military operations along the disputed border will continue, Prime Minister Anutin Charnvirakul said on Saturday, according to the Bangkok Post.Speaking as clashes continued, Anutin said Thailand had not agreed to halt fighting and that there were no active ceasefire talks with Cambodia.His remarks came hours after Malaysian Prime Minister Anwar Ibrahim called on both sides to stop hostilities from 10 pm on Saturday. The appeal followed a statement by US President Donald Trump, who said Thai and Cambodian leaders had agreed to \"cease all shooting\".Neither Anutin nor Cambodian Prime Minister Hun Manet referred to any ceasefire agreement in official statements issued after their separate phone calls with Trump.More than 20 people have been killed across Thailand and Cambodia in six days of renewed fighting, with nearly 200 wounded, according to reports cited by Al Jazeera. An estimated 600,000 people have been displaced on both sides of the 800-kilometre Thailand-Cambodia border, where tensions are centred on the disputed ownership of centuries-old temples.Thailand's clarification followed accusations from Cambodia that Thai forces continued air attacks on Cambodian territory, hours after Trump claimed both sides had agreed to stop fighting.\"It is likely a misunderstanding,\" Anutin said. \"Currently, there is a lot of communication going on. It would be best to listen to the statements from the military. At this time, there are no ceasefire negotiations, and it is not yet the time for that.\" (ANI)","url":"https://www.aninews.in/news/world/asia/curfew-imposed-in-thailands-trat-province-as-border-clashes-with-cambodia-continue20251214135128","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251214075527.jpg","video":null,"publish_date":"2025-12-14 08:21:28","author":"Us President Donald","authors":["Us President Donald"],"language":"en","category":"politics","source_country":"in","sentiment":-0.464},{"id":386976226,"title":"Inside Russia's chilling 'nuclear annihilation' plot as expert warns Britain is 'weak'","text":"World War 3 anxieties have reached fever pitch this week after a Kremlin mouthpiece called a nuclear attack against the UK \"inevitable\". When reports emerged that 28-year-old British paratrooper George Hooley had died during a defensive test in Ukraine , the Russian state propagandist claimed it was \"casus belli\" for a strike against the UK, due to the presence of British armed forces in the war-torn country. Putin's crony Vladimir Solovyov claimed to viewers of his nightly show: \"Now a nuclear strike on Britain is inevitable.\" While the concept of mutually assured destruction has not gone anywhere - despite the posturing on Russian state TV - international relations experts are still concerned about the \"grave threat\" Russia poses to the UK and other European countries. US President Donald Trump has also been making his position on the world stage clear. From branding Europe a \"decaying\" continent filled with \"weak\" countries in a recent interview, to releasing a National Security Strategy that indicates the US will be taking a hands-off approach to its traditional Western allies, his decisions are ringing alarm bells for experts. Trump has also proposed \"peace framework\" for the Russia-Ukraine war that suggests Ukraine hands over huge swathes of the country to Putin - something to which President Zelensky is unlikely to agree to. This means that the days where the UK could reply on the US for a strong show of support are \"over, full stop\" according to one expert. Professor Anthony Glees, from the University of Buckingham, tells to the Mirror : \"What has changed is that Trump is forcing Ukraine to accept a peace that is Russia's peace before Christmas . It rewards Russian aggression with Ukrainian territory. What's not to like as far as Putin is concerned. Trump gets his 'peace' in the form of a ceasefire, which could become a lasting settlement if Putin has the whip hand.\" The expert adds that in his view, this could potentially be \"our gravest hour since the 1930s.\" Professor Glees expressed concern about the \"military weakness\" of the UK, and whether we currently have the ability to stave off potential threats. \"We are too weak to resist Russia and too weak to resist Trump, even though we know that a peace that allows Putin to win will have the most appalling consequences for Ukraine but also for the whole of Europe,\" he warns. The Labour Government have significantly increased defence spending, with it making up 2.5 percent of GDP from 2027, and spending £62.2 billion on the Armed Forces this year, including £15bn investment into upgrading the country's nuclear capabilities. Professor Glees adds that, in his opinion, we can no longer be sure that the US would enact Article Five of NATO - which sees an attack on one member country treated as an attack on all. Currently, the expert believes that the UK's best defence is for ministers to try and persuade Trump that \"he is wrong\". \"Since we are too weak right now, with more parking enforcement officers than troops in the UK, and Germany only slowly gearing up to mass conscription, we will have to try to persuade Trump he is wrong - as he is - and hope he changes his mind.\" Another expert, Dr Arnab Basu, CEO of Kromek, argues that the UK government is signalling they are moving in the right direction, but expresses concern about the speed at which the necessary investment might come into place to strengthen the British Armed Forces. \"The UK MOD is saying all the right things about its defensive strategy, as outlined earlier this year in the Strategic Defence Review, but the gears of government and the bureaucracy grind so slowly,\" he explains. \"It's difficult to see much real progress as CEO of a British company. \"They have promised more defence spending, but we are yet to see the benefits. The reality is that the UK, and by extension, the world , faces its greatest military threat of a generation. Failure to take definitive action to prepare for a worst-case scenario could be our greatest mistake.\" NuclearSecrecy.com has created frightening Nuke Map tool, which aims to give a fair estimate of the potential damage caused by nuclear weapons. The brainchild of Alex Wellerstein, a science and nuclear weapons professor at the Stevens Institute of Technology , site users can 'trial' various horrifying tools, including a formidable 800-kiloton nuke known to be currently sitting in Russia's arsenal. The consequences of dropping this weapon over Cambridge, as jested about by Solovyov, would be nothing short of catastrophic. The nuclear fireball would engulf a radius of 2.97km squared, including the suburbs of Grantchester, Milton and Teversham, and the University's main campus. As claimed by the Nuke Map: \"Maximum size of the nuclear fireball; relevance to damage on the ground depends on the height of detonation. If it touches the ground, the amount of radioactive fallout is significantly increased. Anything inside the fireball is effectively vaporised.\" The second zone, which would see \"moderate blast damage radius\", would cover an area of 134Km2. Within this site, buildings would begin to collapse, and fires would break out. As explained by this terrifying map: \"At 5 psi overpressure, most residential buildings collapse, injuries are universal, fatalities are widespread. \"The chances of a fire starting in commercial and residential damage are high, and buildings so damaged are at high risk of spreading fire. Often used as a benchmark for moderate damage in cities.” The third zone, with an area of 384km2, would also be severely impacted, with the nuke map stating: “Third degree burns extend throughout the layers of skin, and are often painless because they destroy the pain nerves. They can cause severe scarring or disablement, and can require amputation.\" Meanwhile, those living in the light blast damage radius zone, situated around the edge of Cambridge, may well still suffer injuries, for example, to those who approach a window after seeing a flash. Given that flashes travel at quicker speeds than the pressure wave, this could still cause injuries to the population who may come up to a window after seeing a flash explosion. According to the map's predictions, Oxford will experience similar results. The inner zone, including the university campus, would be instantly vaporised, with damage extending as far out as Woodstock and Bicester. The International Commission on Radiological Protection (ICRP) states: \"The best way to protect you and your family before, during, and after a nuclear blast is getting inside the centre of a building or basement. \"On August 6, 1945, Mr Eizo Nomura was in the basement of a building in Hiroshima, about 170 meters from ground zero. He survived the atomic bombing and died in 1982 at the age of 84. Most people within a few hundred metres of a nuclear detonation are not likely to survive, especially if unprepared. \"Be inside before the fallout arrives. After a detonation, you will have 10 minutes or more to find an adequate shelter before fallout arrives. If a multi-story building or a basement can be safely reached within a few minutes of the explosion, go there immediately. The safest buildings have brick or concrete walls. Underground parking garages and subways can also provide good shelter.\" Given this advice, many would naturally assume that London, with its extensive underground network, would be the safest place, with the tube tunnels having allowed some protection from blasts during the dark days of the Blitz. However, some experts fear that modern nuclear weapons could penetrate much further than the bombs of World War II, meaning even the 58-metre-deep Hampstead station would still be too close to the surface. Andrew Futter, a Professor of International Politics at the University of Leicester, previously told My London that the Underground \"probably wouldn't be deep enough if there was a direct hit\". Therefore, should a nation such as Russia target one of the UK's major cities - from London to Edinburgh - being outside of the blast zone would present the best chance of survival. When it comes to the reach of nuclear blasts, several factors must be considered, including a radiation radius of 153 km2, a fireball radius of approximately 197 km2, an air blast radius between 321 km2 and 1,420 km2, and a thermal radiation radius of 12,960 km2. Although these distances can vary depending on weather conditions, property researchers have previously compiled a list of places that could provide relative safety in this nightmare scenario. These 20 locations, listed by property portal EMoov back in 2017, are situated outside of the immediate range of blasts in major British cities: However, some of these areas are still close enough to blast sites to be affected by radiation swept over by winds. Therefore, the remote island Foula, on the Shetland Isles, could well be the safest place in the UK in this instance.","summary":"With Russian state TV claiming a nuclear attack on the UK is 'inevitable,' experts are expresssing concern about the 'weak' state of the British defences against the 'grave threat'","url":"https://www.mirror.co.uk/news/world-news/inside-russias-chilling-nuclear-annihilation-36392743","image":"https://i2-prod.mirror.co.uk/article35971362.ece/ALTERNATES/s1200b/0_explosion-nuclear-bomb-in-ocean.jpg","video":null,"publish_date":"2025-12-14 08:00:00","author":"Emma Mackenzie","authors":["Emma Mackenzie"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.049},{"id":386978262,"title":"Lukashenko frees Nobel winner Bialiatski and key Belarus opposition figures in deal with US","text":"VILNIUS, (Reuters) – Belarusian President Alexander Lukashenko freed 123 prisoners yesterday including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava in a deal brokered by an envoy for U.S. President Donald Trump.\n\nIn return, the U.S. agreed to lift sanctions on Belarusian potash. Potash is a key component in fertilisers, and the former Soviet state is a leading global producer.\n\nThe prisoner release was by far the biggest by Lukashenko since Trump’s administration opened talks this year with the veteran authoritarian leader, a close ally of Russian President Vladimir Putin.\n\nWestern governments had previously shunned him because of his crushing of dissent and backing for Russia’s war in Ukraine.\n\nTrump’s envoy John Coale told Reuters that around 1,000 remaining political prisoners in Belarus could be released, hopefully in one big group, in the coming months.\n\n“I think it’s more than possible that we can do that, I think it’s probable… We are on the right track, the momentum is there,” he said.\n\nIf no political prisoners remained, most of the sanctions could be removed. “I think it’s a fair trade,” Coale added.\n\nNine of the released prisoners left Belarus for Lithuania and 114 were taken to Ukraine, officials said.\n\nBialiatski, co-winner of the 2022 Nobel Peace Prize, is a human rights campaigner who fought for years on behalf of political prisoners before becoming one himself. He had been in jail since July 2021.\n\nVisibly aged since he was last seen in public, he smiled broadly as he embraced exiled opposition leader Sviatlana Tsikhanouskaya on arrival at the U.S. embassy in Lithuania.\n\nBialiatski told Reuters he had spent the previous night on a prison bunk in a room with nearly 40 people, and was still getting to grips with the idea of being free.\n\nHe said the goals of the human rights struggle for which he and his fellow-campaigners had won the Nobel prize had still not been realised.\n\n“Thousands of people have been and continue to be imprisoned … So our struggle continues,” he said in his first public comments in the three years since he won the award.\n\nThe Norwegian Nobel Committee expressed “profound relief and heartfelt joy” at his release.\n\nKalesnikava, a leader of mass protests against Lukashenko in 2020, was among the large group taken by bus to Ukraine.\n\n“Of course, it’s a feeling of incredible happiness first of all: to see with your eyes the people who are dear to you, to hug them, and understand that now we are all free people. It’s a great joy to see my first free sunset,” she said in video published by the Ukrainian Telegram channel Khochu Zhit.\n\nIt showed her embracing Viktar Babaryka, an opposition politician arrested in 2020 while preparing to run against Lukashenko in an election. Babaryka said his son Eduard was still in prison in Belarus.\n\nTatsiana Khomich, Kalesnikava’s sister, told Reuters she had been worried she might refuse to leave Belarus and had been prepared to try to persuade her.\n\n“I very much look forward to hugging Maria… the last five years was very hard for us, but now I talked to her (by phone) and I feel as if the five years did not happen,” she said.\n\nU.S. officials have told Reuters that engaging with Lukashenko is part of an effort to peel him away from Putin’s influence, at least to a degree – an effort that the Belarus opposition, until now, has viewed with extreme scepticism.\n\nThe U.S. and the European Union imposed wide-ranging sanctions on Belarus after Minsk launched a violent crackdown on protesters following a disputed election in 2020, jailing nearly all opponents of Lukashenko who did not flee abroad.\n\nSanctions were tightened after Lukashenko allowed Belarus to serve as a staging ground for Russia’s invasion of Ukraine in 2022.\n\nThe exiled Belarusian opposition expressed gratitude to Trump and said the fact that Lukashenko had agreed to release prisoners in return for the concessions on potash was proof of the effectiveness of sanctions.\n\nThe opposition has consistently said it sees Trump’s outreach to Lukashenko as a humanitarian effort, but that EU sanctions should stay in place.\n\n“U.S. sanctions are about people. EU sanctions are about systemic change — stopping the war, enabling democratic transition, and ensuring accountability. These approaches do not contradict each other; they complement each other,” exiled opposition leader Sviatlana Tsikhanouskaya said.\n\nLukashenko has previously denied there are political prisoners in Belarus and described the people in question as “bandits”. As recently as August, he asked why he should free people he sees as opponents of the state who might “again wage war against us”.\n\nTrump has referred to Lukashenko as “the highly respected president of Belarus”, a description that jars with the opposition who see him as a dictator. He has urged him to free up to 1,300 or 1,400 prisoners whom Trump has described as “hostages”.\n\n“The United States stands ready for additional engagement with Belarus that advances U.S. interests and will continue to pursue diplomatic efforts to free remaining political prisoners in Belarus,” the U.S. embassy in Lithuania said.\n\nBelarusian human rights group Viasna – which is designated by Minsk as an extremist organisation – put the number of political prisoners at 1,227 on the eve of Saturday’s releases.","summary":"VILNIUS,  (Reuters) &#8211; Belarusian President Alexander Lukashenko freed 123 prisoners yesterday including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava in a deal brokered by an envoy for U.S.\n\n\nThe article Lukashenko frees Nobel winner Bialiatski and key Belarus opposition figures in deal with US appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/12/14/news/world/lukashenko-frees-nobel-winner-bialiatski-and-key-belarus-opposition-figures-in-deal-with-us/","image":"https://www.stabroeknews.com/images/2025/12/Ales-Bialiatski.jpg","video":null,"publish_date":"2025-12-14 06:04:45","author":"Stabroek News","authors":["Stabroek News"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.017},{"id":386978264,"title":"Thailand vows to keep fighting Cambodia after Trump ceasefire claim","text":"BANGKOK, (Reuters) – Thailand’s leader vowed yesterday to keep fighting on the disputed border with Cambodia as fighter jets struck targets hours after U.S. President Donald Trump said he had brokered a new ceasefire.\n\nCaretaker Thai Prime Minister Anutin Charnvirakul said the Southeast Asian nation would “continue to perform military actions until we feel no more harm and threats to our land and people”.\n\nTrump, who brokered a ceasefire in the long-running border dispute in October, spoke to Anutin and Cambodian premier Hun Manet on Friday and said they had agreed to “cease all shooting”.\n\nNeither mentioned any agreement in statements after their calls with Trump, and Anutin said there was no ceasefire.\n\n“I want to make it clear. Our actions this morning already spoke,” Anutin posted on Facebook.\n\nA White House spokeswoman said in a statement: “The President expects all parties to fully honor the commitments they have made in signing these agreements, and he will hold anyone accountable as necessary to stop the killing and ensure durable peace.”\n\nHun Manet, in a statement on Saturday on Facebook, said he welcomed a proposal by Malaysian Prime Minister Anwar Ibrahim, who has been a mediator in peace talks, to cease hostilities from Saturday evening.\n\nAnwar, chair of the 10-nation ASEAN grouping, in a Facebook post urged both sides to “refrain from any further military actions including the use of force or forward movement of armed units” starting at 1500 GMT.\n\nHe said an ASEAN observer team led by the Malaysian chief of defence forces would be deployed to the border and the U.S. government would provide satellite monitoring capabilities.\n\nAnutin said “there has been no agreement on halting anything”, when asked by reporters about the Malaysian proposal.\n\nThailand’s foreign minister told a press conference the country would cooperate with the observer team, but any ceasefire would need to be preceded by talks.\n\n“We can’t just announce a ceasefire while the fighting is going on,” he said.\n\nCambodia and Thailand have been exchanging heavy-weapons fire at multiple points along the 817-km (508-mile) border since Monday, in some of the heaviest fighting since a five-day clash in July. Trump halted that fighting, the worst in recent memory, with calls to both leaders.\n\nTrump, who has repeatedly said he deserves the Nobel Peace Prize, has been keen to intervene again to rescue the truce.\n\nThailand suspended it last month after a Thai soldier was maimed by a landmine, one of many that Bangkok says were newly laid by Cambodia.\n\nCambodia, which nominated Trump for the peace prize in August, rejects the landmine allegations.\n\nThai Defence Ministry spokesman Rear Admiral Surasant Kongsiri said on Saturday that clashes had taken place across seven border provinces and Cambodia had fired heavy weapons, “making it necessary for Thailand to retaliate”.\n\nThe army said two civilians had been seriously injured after a rocket landed in Sisaket province.\n\nCambodia’s Information Ministry said Thai forces had struck bridges and buildings and fired artillery from a naval vessel.\n\nHundreds of thousands of people on both sides of the border have been displaced since the fresh fighting broke out.\n\nSpeaking from a camp on the Cambodian side lit by torchlight late on Friday, 62-year-old Mar Kly said she had fled “so many wars” in the past, including the Khmer Rouge regime.\n\n“At one time I cut part of my skirt to wrap my children’s feet to stop burning from walking in the heat barefoot,” she said, adding that the current conflict is between the two governments","summary":"BANGKOK,  (Reuters) &#8211; Thailand&#8217;s leader vowed yesterday to keep fighting on the disputed border with Cambodia as fighter jets struck targets hours after U.S.\n\n\nThe article Thailand vows to keep fighting Cambodia after Trump ceasefire claim appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/12/14/news/world/thailand-vows-to-keep-fighting-cambodia-after-trump-ceasefire-claim/","image":"https://www.stabroeknews.com/images/2025/12/Anutin-Charnvirakul.jpg","video":null,"publish_date":"2025-12-14 06:03:46","author":"Malaysian Prime Minister,Stabroek News","authors":["Malaysian Prime Minister","Stabroek News"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.066},{"id":386978290,"title":"Suspect at large in Brown University shooting that killed 2, injured 8","text":"(Reuters) – Police in Rhode Island were searching for a suspect in a shooting at Brown University in Providence in which two people died and eight were critically wounded at the Ivy League school, officials said.\n\nStreets around campus remained blocked off hours after the shooting and law enforcement officials heightened security around the city as police continued their manhunt.\n\nProvidence officials told reporters at a news conference that police are looking for a male dressed in black and were scouring local video cameras in the area for footage to get a better description of the suspect. Officials said the gunman escaped after shooting people in Brown’s Barus & Holley engineering building, where exams were taking place at the time.\n\n“We are a week and a half away from Christmas. And two people died today and another eight are in the hospital,” Mayor Brett Smiley said. “So please pray for those families.”\n\nOfficials could not yet disclose details about the victims, including whether they were students, Smiley said.\n\nBrown is on College Hill in Providence, Rhode Island’s state capital. The university has hundreds of buildings, including lecture halls, laboratories and dormitories.\n\nAs news of the shooting spread, the school told students to shelter in place.\n\nBrown University student Chiang-Heng Chien told local TV station WJAR he was working in a lab with three other students when he saw the text about the active shooter situation a block away. They waited under desks for about two hours, he said.\n\nThe search for the suspect was hampered in part because downtown Providence was crowded with holiday shoppers and thousands of people attending concerts, local media said. Federal law enforcement and police from surrounding cities and towns were assisting in the search, officials said. According to local news reports, venues across the city were bringing in extra security.\n\nPresident Donald Trump told reporters at the White House that he had been briefed on the situation, which he called “terrible.”\n\n“All we can do right now is pray for the victims and for those that were very badly hurt.”\n\nCompared to many countries, mass shootings in schools, workplaces, and places of worship are more common in the U.S., which has some of the most permissive gun laws in the developed world. The Gun Violence Archive, which defines mass shootings as any incident in which four or more victims have been shot, has counted 389 of them this year in the U.S., including at least six such shootings at schools.\n\nLast year the U.S. had more than 500 mass shootings, according to the archive.","summary":"(Reuters) &#8211; Police in Rhode Island were searching for a suspect in a shooting at Brown University in Providence in which two people died and eight were critically wounded at the Ivy League school, officials said.\n\n\nThe article Suspect at large in Brown University shooting that killed 2, injured 8 appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/12/14/news/world/suspect-at-large-in-brown-university-shooting-that-killed-2-injured-8/","image":"https://www.stabroeknews.com/images/2019/06/sn-article-default.png","video":null,"publish_date":"2025-12-14 06:02:54","author":"Stabroek News","authors":["Stabroek News"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.35},{"id":386978226,"title":"Inside Honduras’ election chaos: Infighting, delays, and broken systems","text":"TEGUCIGALPA, (Reuters) – Weeks before Honduras’ November 30 presidential election, a test run exposed deep flaws in the vote-counting system: only 36% of practice ballots were processed, according to electoral council member Marlon Ochoa. That warning proved prescient. Now, nearly two weeks after the election, the presidential vote remains paralyzed with hundreds of thousands of ballots still uncounted, rival candidates trading fraud accusations, and an electoral system crippled by delays and dysfunction.\n\nThe chaos has plunged the country of 11 million into political limbo. Tensions are mounting, and confidence in the process is eroding.\n\nThe preliminary count shows Nasry Asfura of the conservative National Party only 40,000 votes ahead of Salvador Nasralla of the center-right Liberal Party. Nearly 15% of tally sheets – comprising hundreds of thousands of votes – show “inconsistencies” and have not been counted.\n\nNasralla has seized on the reporting problems to allege fraud while President Xiomara Castro of the leftist LIBRE Party denounced the process as an “electoral coup.” U.S. President Donald Trump, who has publicly endorsed Asfura, has also claimed fraud, without presenting evidence. None of the major international observers, including the European Union and Organization of American States, have raised concerns of systematic fraud. Instead, a half-dozen experts told Reuters that infighting inside the electoral body caused critical delays in preparations and that both Honduras’ political parties and outside actors, including Trump, have undermined confidence in the results themselves.\n\n“This was a deliberate manufacturing of a low-quality electoral process,” said Hector Corrales, a political analyst in Tegucigalpa. “The only thing that could have saved this election was a big margin of victory.”\n\nHonduras’ electoral body, the CNE, is run by three officials, each representing one of the major political parties. The body is responsible for preparing, overseeing and validating the election.\n\nOne of its critical jobs was to contract a company to process the ballots. But in July, Ochoa of the LIBRE Party boycotted the CNE’s meetings for the month, delaying the start of the bidding process, election observers told Reuters.\n\nOchoa did not respond to a request for comment.\n\nFinally, on August 30, the electoral body chose Grupo ASD, a Bogota-based company that has participated in local and national elections in Colombia.\n\nExperts and election observers told Reuters that the company’s systems were woefully unprepared for Honduras’ electoral process – which has specific requirements aimed at preventing fraud – and said it didn’t have enough time to prepare because of the CNE’s delay.\n\n“Their equipment didn’t have enough capacity,” said Carlos Hernandez, director of the Association for a More Just Society, a nonprofit in Tegucigalpa. “Three months for a company to prepare for an election this complicated is not enough.”\n\nGrupo ASD’s machines struggled to scan the tally sheets at the polling stations and digitally transmit them to Tegucigalpa. The company has also paused vote counting – at least once for multiple days – to conduct maintenance since the election, prolonging the process.\n\nGrupo ASD didn’t respond to a request for comment.\n\n“There is so much doubt, and there have been so many problems, there should be a full recount,” said Laura Carlsen, a political analyst who was in Honduras as an election observer.\n\nAhead of November’s vote, the election had already become highly politicized, with the political parties accusing each other of either manipulating the vote or undermining trust in the outcome.\n\nThe biggest such scandal erupted in October, when the attorney general opened an investigation into council member Cossette Lopez-Osorio of the National Party for allegedly discussing plans with a military officer to influence the election.\n\nLIBRE presidential candidate Rixi Moncada told Reuters that the alleged conspiracy proved the election was “the most rigged in history.” Moncada is trailing a distant third in the vote count.\n\nLopez-Osorio did not respond to a request for comment. The National Party has said the investigation was an effort to intimidate her.\n\nAs internal tensions grew, some political figures sought help abroad.\n\nIn November, former prosecutor Sandra Ponce and former Honduran Chief Supreme Court Justice Vilma Morales traveled to Geneva and Washington. Both from opposition parties, Ponce said they were concerned LIBRE was trying to sabotage the election.\n\nPonce said she was pleased when, on November 25, U.S. Deputy Secretary of State Christopher Landau expressed concern about “interference, intimidation, and political pressure” affecting CNE members.\n\nHer enthusiasm, however, was quelled when, a day later, Trump publicly endorsed Asfura.\n\n“He crossed a red line,” Ponce told Reuters.\n\nOn December 6, the ruling LIBRE Party petitioned Honduras’ electoral body to nullify the vote because, in part, of interference from Washington.\n\nFor now, counting continues. On Saturday, the CNE is slated to begin a special manual vote count of the tally sheets that were flagged for having inconsistencies.\n\nThe CNE has until December 30 to validate the election results.","summary":"TEGUCIGALPA,  (Reuters) &#8211; Weeks before Honduras’ November 30 presidential election, a test run exposed deep flaws in the vote-counting system: only 36% of practice ballots were processed, according to electoral council member Marlon Ochoa.\n\n\nThe article Inside Honduras’ election chaos: Infighting, delays, and broken systems appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/12/14/news/regional/inside-honduras-election-chaos-infighting-delays-and-broken-systems/","image":"https://www.stabroeknews.com/images/2019/06/sn-article-default.png","video":null,"publish_date":"2025-12-14 06:02:44","author":"Stabroek News","authors":["Stabroek News"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.484},{"id":386972028,"title":"Flights at Christmas: The real reason you should dress smart when flying","text":"WorldOpinion\n\nDec 14, 2025 – 4.50pm or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? \n\nSean Duffy is not a man I would normally dwell on for long.The former reality TV star-turned-father of nine caused a stir when he became Donald Trump’s transport secretary this year, and promptly told his department to prioritise funding for regions with higher birth rates.Loading...Financial TimesPilita Clark is an associate editor and business columnist at the Financial Times. She writes a weekly column on modern corporate life, as well as features and other articles. or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? Follow the topics, people and companies that matter to you.Find out moreRead MoreOpinionTrump's White HouseChristmasAir travel\n\nFetching latest articlesThe untold story of the most lethal Sydney to Hobart race in 26 yearsTony Davis24 new watches to ring out the year (from $170 to $218k)‘YIMBY is a misnomer. They haven’t got backyards’Why BP Australia’s head tells execs to have their kids by 35Patrick DurkinAI talent war spreads to banking with $250k+ rolesWant to be better at public speaking? NIDA’s CEO shares her tipsAn arty Dior bag and a retro chronograph to freshen up your lookEugenie Kelly‘Your guests should talk with their bodies, not their mouths’The $80k Honda Civic that those in the know go nuts forBillionaire Rinehart loses bid for helipad at pink-themed HQJesinta BurtonImmutable late accounts reveal $72m loss despite big revenue growthAirwallex shrugs off controversy with huge funding round","url":"https://www.afr.com/opinion/the-real-reason-you-should-dress-smart-when-flying-20251214-p5nnk5","image":"https://static.ffx.io/images/$zoom_0.2518%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_171%2C$y_169/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/e39f088918c9ae878c60bf6e334aa1f301ca64a6","video":null,"publish_date":"2025-12-14 05:50:58","author":"Pilita Clark","authors":["Pilita Clark"],"language":"en","source_country":"au","sentiment":-0.038},{"id":386972026,"title":"Australian budget update: Jim Chalmers and Katy Gallagher find $20 billion in savings","text":"John Kehoe is economics editor at Parliament House, Canberra. He writes on economics, politics and business. John was Washington correspondent covering Donald Trump’s first election. He joined the Financial Review in 2008 from Treasury. Connect with John on Twitter. Email John at jkehoe@afr.com","url":"https://www.afr.com/politics/federal/treasurer-defends-5b-battery-blowout-amid-budget-spending-warning-20251214-p5nnhs","image":"https://static.ffx.io/images/$zoom_0.2348%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_20/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/7f809778d4abb6b8b32b0f047cda265a770c76fa","video":null,"publish_date":"2025-12-14 05:38:50","author":"Phillip Coorey, John Kehoe","authors":["Phillip Coorey, John Kehoe"],"language":"en","source_country":"au","sentiment":0.17},{"id":386975210,"title":"Manhunt intensifies for Brown University shooter, campus on lockdown","text":"Rhode Island (United States), Dec 14 (IANS) The suspected Brown University shooter, who is still at large, is a male dressed in black, police said, adding that an extensive search is underway.\n\nAs the shooter is still at large, the university said that the campus remained in lockdown, urging all members of the community to remain vigilant and shelter in place.\n\nAt least two people were killed and nine others wounded Saturday afternoon (local time) at Brown University in Providence, the US state of Rhode Island, campus officials said.\n\nThe two fatal victims and eight of the injured were students at Brown University, President Christina Paxson told a news conference on Saturday evening, reports Xinhua news agency.\n\nSix of the injured are in critical but stable condition, one is in critical condition, and another is stable, local media reported, citing the hospital.\n\nPolice said the incident occurred near an academic and research area on campus, where students were in the midst of their second day of final exams. Law enforcement officers were dispatched to the scene, and the investigation is ongoing.\n\nProvidence Mayor Brett Smiley said the deadly shooting took place at the Barus and Holley building, which houses classrooms and laboratory space for the university’s engineering and physics departments.\n\nUS President Donald Trump said Saturday afternoon that he had been briefed on the shooting and that the FBI is on the scene.\n\nRhode Island Governor Dan McKee said state police and the state emergency management agency are coordinating with local law enforcement in response to the incident.\n\nBrown University is a nonprofit research institution with some 7,300 undergraduate students and over 3,000 graduate students, according to its website.\n\nSaturday’s incident occurred on the eve of the 13th anniversary of the mass shooting at Sandy Hook Elementary School in the state of Connecticut, where a gunman killed 20 first-graders and six educators, marking one of the deadliest school shootings in the country’s history.\n\nGun violence has been a severe problem for US society for decades. In the year 2025, the country has seen 389 mass shootings, resulting in the deaths of more than 1,100 children and teenagers under the age of 17, both on and off campus, according to the Gun Violence Archive.\n\nThe archive defines a mass shooting as an incident in which four or more people, excluding the perpetrator, are shot or killed.","summary":"Rhode Island (United States), Dec 14 (IANS) The suspected Brown University shooter, who is still at large, is a male dressed in black, police said, [...]","url":"https://bhaskarlive.in/manhunt-intensifies-for-brown-university-shooter-campus-on-lockdown/","image":"https://i1.wp.com/bhaskarlive.in/wp-content/uploads/2025/12/images-1.jpg?ssl=1","video":null,"publish_date":"2025-12-14 05:35:04","author":"IANS","authors":["IANS"],"language":"en","source_country":"in","sentiment":-0.288},{"id":385750760,"title":"What is moral architecture and can it fix our digital world?","text":"The world is in a mess' is a common lament across the world. Not everyone agrees though, certainly not the ones who contribute to the mess or those who thrive on it, and certainly not the moneyed M&Ms of the world—Microsoft and Mercedes, Mark and Musk. But, then, they are not of this world anyway. They inhabit a distant galaxy. While most people feel the pincer pinch of inflation, infection and inequality, trillionaires' wealth rockets to MoM-z14, the farthest observed galaxy, 33.8 billion light-years from planet earth. Experts attribute many reasons for this global gloom. War, polarisation, corruption, aggressive geopolitics and AI. People feel online trends have aggravated this mess. But, 25 years ago, when the internet dawned into our lives, the world brimmed with optimism, expectations and possibilities. 'But that optimism has curdled into cynicism,' mourns Jimmy Wales, Wikipedia's co-founder. So, what went wrong? Wales answers, 'The defining difference between web 1.0 and the platforms that dominate today is not technological sophistication but moral architecture.' Moral architecture depends on good governance. Algorithms and AI determine the content consumed by billions of users. They are a force for good, but how they function remains opaque. Wales argues for implementing 'structural transparency', or clearly outlining 'where data originated, how it is processed and what uncertainty' surrounds it. He says, 'Think of it as nutritional labelling for information.' But powerful forces strive to strangle AI regulation. The troika of Silicon Valley lobbyists, $100 million moneybags and slick spin-doctors hatched a plan, backed by Donald Trump, to restrict US states from regulating AI companies. MAGA supporters and even some Republicans accuse Trump of appeasing Big Tech donors. Senator Josh Hawley, a Republican hawk, sniggers, 'Shows what money can do.' Money is doing terrible things everywhere, adding to global gloom. Tuna is big business with a $50 billion global market. But tuna-fishing fleets starve, overwork, beat their 'bonded' migrant crew, who haul fishing lines that stretch for kilometres on voyages that last for years. 'Abuse on these vessels is industrial, systemic,' says human rights investigator, Steve Trent. Luxury brands tolerate worker abuse by subcontractors. A South African government probe reveals the nexus between rogue police officials and gangsters who bribe the judiciary, swindle state hospitals of millions of dollars and terrorise honest officials by 'threatening to burn them in their cars'. Moral crisis in football has led to rampant illegal betting, match-fixing and on-field punching. 'Football does not take place in outer space. The scandals are a magnifying glass of all the problems in today's society, especially the erosion of the rule of law, lack of transparency, accountability and legal impunity,' bemoans Turkish sociologist Daghan Irak. The internet, today, is a microcosm, spawning good solutions and bad problems ranging from predatory apps to data centres' guzzling of precious water, teenage suicides after conversations with chatbots to societal dangers from scams, financial bubbles and job losses. Wales says the best way to survive this onslaught is to embed transparency, independence and empathy into the digital architecture itself. 'It was done before. It can be done again,' he promises. But when big money talks, public good walks—away. Collective will to restore sense and sensibility seems feeble. Solutions sound like closing the door after the horse has bolted. The stallions of the universe gallop beyond MoM-z14 while earthlings, saddled with messy problems, can never catch up. Astronomers say MoM is unreachable, receding from earth due to cosmic expansion. The phenomenon—and the distance—is cosmological. And metaphorical. Pratap is an author and journalist.","url":"https://www.theweek.in/columns/Anita-Pratap/2025/12/06/what-is-moral-architecture-and-can-it-fix-our-digital-world.html","image":"/content/dam/week/week/opinion/columns/Anita-Pratap/images/2025/12/6/51-When-big-money-talks-new.jpg.transform/schema-1x1/image.jpg","video":null,"publish_date":"2025-12-14 05:34:00","author":"Anita Pratap","authors":["Anita Pratap"],"language":"en","source_country":"in","sentiment":0.084},{"id":386975756,"title":"US releases names of deported Irish citizens as crackdown sees 80pc surge in numbers removed from country","text":"The United States is now releasing the names of some of the Irish citizens it has deported, as well as the criminal charges they face, as the crackdown on immigration continues under President Donald Trump.\n\nThe number of Irish citizens deported from the US has surged by nearly 80pc, new figures show.","url":"https://www.independent.ie/irish-news/us-releases-names-of-deported-irish-citizens-as-crackdown-sees-80pc-surge-in-numbers-removed-from-country/a805898425.html","image":"https://focus.independent.ie/thumbor/mgN5JBqS22tGDR_Ws5P9ViHWDO0=/0x0:3238x2158/550x550/prod-mh-ireland/de714c53-947f-4845-ace7-fd047f7904a4/8372f6ab-3cab-4a2a-accc-c770f0eb5bdc/de714c53-947f-4845-ace7-fd047f7904a4.jpg","video":null,"publish_date":"2025-12-14 05:30:00","author":"Lynne Kelleher","authors":["Lynne Kelleher"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.563},{"id":386975750,"title":"Brendan O’Connor: If World War III comes, how will we cope without WFH and wifi?","text":"You’d wonder about the head of Nato, Mark Rutte. We assume these people are sane and sensible; calmer and more careful than the rest of us; diplomatic. That’s why he is the secretary general of Nato and we aren’t, right?\n\nWe even give him the benefit of the doubt for his ongoing sucking up to Donald Trump, who he has called “Daddy” in texts he crazily assumed were private.","url":"https://www.independent.ie/opinion/brendan-oconnor-if-world-war-iii-comes-how-will-we-cope-without-wfh-and-wifi/a362571057.html","image":"https://focus.independent.ie/thumbor/I-XWOWfRt_4dLQRJjgHfh9gzjBs=/667x192:2910x1684/550x550/prod-mh-ireland/623f31e5-05ca-4a64-95b2-d26dc0a3a042/08b5d54f-e082-4213-8f53-ff51ad086e84/16a16fe2-fcdc-4351-9027-ee603be1b40b.jpg","video":null,"publish_date":"2025-12-14 05:30:00","author":"Brendan O'connor","authors":["Brendan O'connor"],"language":"en","source_country":"ie","sentiment":-0.163},{"id":386978082,"title":"Iowa National Guard soldiers identified as victims in deadly Syria ISIS attack","text":"The U.S. troops who were killed and injured in Saturday’s ambush attack in Syria were members of the Iowa National Guard, a senior U.S. official told Fox News. An ISIS gunman opened fire with an automatic weapon in the central Syrian town of Palmyra, killing two Iowa National Guard soldiers and an American civilian translator, the official said. Three additional U.S. soldiers were wounded in the attack. TRUMP VOWS 'VERY SERIOUS RETALIATION' AGAINST ISIS AFTER DEADLY SYRIA AMBUSH KILLS US SOLDIERS Preliminary information suggests the attacker was once affiliated with the Syrian government forces and had been a low-level member of the Syrian Security Forces, before later becoming connected to ISIS, the official said. \"He was not a part of the official delegation that was being escorted by the U.S. and Syrian troops,\" the official said. \"… This would not be considered a ‘green on blue’ incident because the Syrian gunman was not part of the U.S./Syrian partnered delegation.\" 2 US ARMY SOLDIERS, INTERPRETER KILLED IN SYRIA AMBUSH ATTACK, TRUMP WARNS OF 'VERY SERIOUS RETALIATION' Earlier Saturday, U.S. Central Command confirmed the deaths and injuries were a \"result of an ambush by a lone ISIS gunman in Syria.\" President Donald Trump warned that there will be \"very serious retaliation\" following the ambush. \"We mourn the loss of three Great American Patriots in Syria, two soldiers, and one Civilian Interpreter. Likewise, we pray for the three injured soldiers who, it has just been confirmed, are doing well,\" Trump wrote on Truth Social. 6 TIMES ISIS HAS INSPIRED TERROR ATTACKS ON US SOIL Trump added, \"This was an ISIS attack against the U.S. and Syria, in a very dangerous part of Syria, that is not fully controlled by them.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP Last month, two West Virginia National Guard members were ambushed and shot near the White House in Washington, D.C., in a targeted attack that left one soldier dead. Fox News' Greg Norman contributed to this report.","summary":"Iowa National Guard soldiers killed in ISIS ambush attack in Syria as Trump vows &quot;very serious retaliation&quot; against the terrorist group in response.","url":"https://www.foxnews.com/world/iowa-national-guard-soldiers-identified-victims-deadly-syria-isis-attack","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/05/Syria.png","video":null,"publish_date":"2025-12-14 05:13:56","author":"Jennifer Griffin,Sophia Compton","authors":["Jennifer Griffin","Sophia Compton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.435},{"id":386972412,"title":"2 killed, 9 hurt in Brown University shooting; video of suspected shooter released amid manhunt","text":"PROVIDENCE, R.I. (WLS) -- A massive manhunt is underway after a shooting left two people dead and nine others injured at a Brown University building on Saturday afternoon, officials in Providence, Rhode Island said.\n\nThe shooting, which happened at Barus & Holley, the school's engineering and physics building, was first reported at 4:05 p.m. local time, Providence Mayor Brett P. Smiley said during a Saturday afternoon press conference.\n\nAn official briefed on the investigation told ABC News that preliminary information indicates that the shooting occurred in a classroom where a study group was taking place.\n\nOne of those injured is in critical condition, while six others are in critical but stable condition. Two other people are in stable condition, including one with non-life-threatening injuries.\n\nOfficials say it is unclear how the suspect entered the building, but investigators have learned that the outer doors of the building were unlocked due to exams.\n\nHe exited the building on the Hope Street side of the complex.\n\nProvidence police released surveillance video on Saturday evening, showing who they call a person of interest leaving 184 Hope Street and walking toward the water. He is wearing dark clothing, and his face is not visible.\n\nSmiley said Saturday night that the person in that video is believed to be the shooter.\n\nSome of the witnesses have told police that the suspect may have been wearing a camouflage mask, but that information is unconfirmed, officials said. The suspect could be in his 30s, but his exact age is still unclear.\n\nThe university said they are working to determine who was in the building when the gunfire broke out.\n\nSmiley said no one is in custody, and a shelter-in-place order is in effect for the greater Brown University area. Rhode Island Hospital is on lockdown but is still accepting emergency department patients.\n\nSmiley said there is no timeline for when the order might end.\n\nOfficials said anyone can send photos to the FBI at fbi.gov/brownuniversityshooting.\n\nAfter the gunfire broke out, the school sent its first BrownUAlert message about the active shooter situation to the campus community around 4:20 p.m., telling students to shelter in place or avoid the area.\n\nThe alert directed students to \"Lock doors, silence phones and stay stay hidden until further notice. Remember: RUN, if you are in the affected location, evacuate safely if you can; HIDE, if evacuation is not possible, take cover; FIGHT, as a last resort, take action to protect yourself. Stay tuned for further safety information.\"\n\nSchool officials, in another alert, and President Donald Trump, in a social media post, initially said a suspect was in custody, but later clarified that no one is in custody.\n\nDuring a Saturday evening press conference, officials said there was an individual who was preliminarily thought to have been involved in the incident, but that person was later determined not to be involved.\n\nA statement from the university also clarified that a report of another shooting near Governor Street was unfounded.\n\nThe gunshot victims' identities were not immediately known. Officials did not immediately say whether they are students at the school.\n\nSmiley added that the number of victims may change as officials gather more information. Earlier Saturday, one official said first responders were searching for any possible additional victims.\n\nOfficials said shell casings have been recovered, but they have not found any weapons. They could not say what kind of firearm was used in the attack.\n\nBrown University police said there was no known threat before the shooting.\n\nA family reunification center has been set up, Smiley said.\n\nThe university's president, Christina H. Paxson, sent a message to all students and faculty informing them about the details of the shooting and offering support.\n\n\"We know our community wants answers, and we will provide them as soon as we can. For now, please know we are doing all we can to keep our community safe and have mobilized support for the students and their families,\" she wrote.\n\nSpeaking to reporters at the White House after the Army-Navy game, Trump said he has been \"fully briefed\" on the Brown University shooting, calling it a \"terrible thing\" and emphasizing the need to \"pray for the victims,\" whom he says \"were very badly hurt, it looks like.\"\n\n\"I've been fully briefed on the Brown University situation. What a terrible thing it is, and all we can do right now is pray for the victims and for those that were very badly hurt, it looks like,\" Trump told reporters after de-boarding Marine One. \"And we'll inform you later as to what's happening, but it's a shame. Just pray. Thank you.\"\n\nThe president did not have any further remarks and did not take questions before entering the White House.\n\nVice President JD Vance issued a statement to X, saying, \"Terrible news out of Rhode Island this evening. We're all monitoring the situation and the FBI stands ready to do anything to help. We're all thinking of and praying for the victims tonight.\"\n\nABC News contributed to this report.\n\nThis is a developing story. Check back for updates.","summary":"A shelter-in-place order remains in effect for the greater Brown University area, officials said on Saturday night.","url":"https://abc7chicago.com/post/brown-active-shooter-today-school-confirms-university-shooting-providence-rhode-island-barus-holley-engineering/18284044/","image":"https://cdn.abcotvs.com/dip/images/18284841_121325-wls-brown-shooting-suspect-raw-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/121325-wls-evelyn-brown-shooting-10p-vid.mp4","publish_date":"2025-12-14 05:05:33","author":"Abc7 Chicago Digital Team,WLS","authors":["Abc7 Chicago Digital Team","WLS"],"language":"en","source_country":"US","sentiment":-0.358},{"id":386973618,"title":"What to know about the Brown University shooting: Victims, how it unfolded, manhunt for shooter","text":"A gunman killed two people and injured nine others after opening fire at Brown University's engineering and physics building in Providence, Rhode Island, on Saturday, officials said. The unidentified gunman left after the shooting at the Barus & Holley building, on the eastern edge of the campus, Commander Timothy O’Hara, deputy chief of Providence police, said Saturday night. People in the area were advised to shelter in place amid an active manhunt. Follow live updates A spokesperson Brown University Health, which operates Rhode Island Hospital, where the injured were being treated, said seven people remained in critical condition and one had been stabilized. An 11th victim was identified hours after the shooting, and had non-life-threatening injuries from fragments, officials said. Manhunt for shooter described as 'a male dressed in black' The attack was reported just after 4 p.m. at Brown's Barus & Holley building, a seven-story structure home to much of the university' engineering and physics study and research, officials said. It happened inside a first-floor classroom at the Barus & Holley building, officials said. The outer doors of the building were open at the time because exams were taking place, Providence Mayor Brett Smiley said. \"It is unknown how he entered the building, but we do know that he exited the Hope Street side of that complex,\" O'Hara said. O’Hara described the gunman only as “a male dressed in black.” Providence police released security camera video that shows the person believed to be the shooter. The video, only a few seconds long, shows what appears to be a man in dark, loose pants, a dark jacket, and possibly also in a knit cap, walking down Hope Street and rounding a corner lined by a retaining wall. It does not clearly show the man’s face, nor does it show what happened beforehand. Shelter in place in effect An alert on Brown's Emergency Information website instructed people to lock doors, silence phones and stay safe. A shelter-in-place advisory was still in effect Saturday night for the campus — including any of the 11,000 enrolled students who remained at the Ivy League university — and the Providence neighborhoods surrounding the school, Smiley said. On Saturday afternoon, officials walked back an earlier alert stating someone was taken into custody, leaving people in the city of roughly 190,000 in fear and uncertainty. Students hid under desks Brown is in the middle of final exams, which began Friday, continued Saturday and were scheduled to be held through next weekend, according to the university's academic calendar. University President Christina H. Paxson said in a message to the school’s community that the shooting marked “a deeply tragic day for Brown, our families and our local community.” Chiang-Heng Chien, a Ph.D engineering student who was working at a campus lab, said people hid under their desks as shots rang out. \"We decided to turn the lights off and close all the doors and hide under our desks,\" Chiang-Heng Chien told NBC affiliate WJAR of Providence. After two hours, police moved in and told those in the lab to get out as fast as possible as they cleared the building in their search for the attacker, Chien said. Smiley said Saturday night that he lives \"about a block away\" from where the violence unfolded. He said he saw lights and sirens zooming past his house and O'Hara called him to give him an update. “Sadly, today is a day that the city of Providence and the state of Rhode Island prayed would never come,\" Smiley said. \"We’ve heard about horrific acts of gun violence and active shooter situations in other places, but not here.” President asks for prayers as federal agencies aid in response Speaking after he disembarked from Marine One at the White House Saturday night, President Donald Trump expressed sorrow. “What a terrible thing it is, and all we can do right now is pray for the victims and for those that were very badly hurt,” Trump said. State and local agencies were responding to the shooting, as were federal resources, including FBI personnel and agents from the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives. Both FBI Director Kash Patel and Attorney General Pam Bondi also asked for prayers. Rhode Island Gov. Dan McKee called the attack \"an unthinkable tragedy.\" \"Our hearts are with the people of Providence and all those impacted,\" he said on X.","url":"https://www.nbcnews.com/news/us-news/brown-university-shooting-victims-what-know-active-shooter-manhunt-rcna249054","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-12/251213-brown-university-mn-2145-d0f0c7.jpg","video":null,"publish_date":"2025-12-14 03:27:38","author":"Dennis Romero","authors":["Dennis Romero"],"language":"en","source_country":"us","sentiment":-0.362},{"id":386968754,"title":"Price Gouging: Coles and Woolworths warn Albanese government's plan will cost shoppers more","text":"John Kehoe is economics editor at Parliament House, Canberra. He writes on economics, politics and business. John was Washington correspondent covering Donald Trump’s first election. He joined the Financial Review in 2008 from Treasury. Connect with John on Twitter. Email John at jkehoe@afr.com","url":"https://www.afr.com/companies/retail/supermarket-giants-say-labor-s-new-rules-will-only-drive-up-prices-20251214-p5nnjj","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_109/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/dfd8d193b318b7a9b09cfe64b53c86d725eda20a","video":null,"publish_date":"2025-12-14 03:10:08","author":"Kylar Loussikian, John Kehoe","authors":["Kylar Loussikian, John Kehoe"],"language":"en","category":"politics","source_country":"au","sentiment":0.17},{"id":386967374,"title":"Police Federation expresses condolences following death of traffic cop","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConstable Eric Evans of the Public Safety and Traffic Enforcement Branch (PSTEB) \n\n Latest News, News \n\nDecember 13, 2025\n\n\n\n\n Police Federation expresses condolences following death of traffic cop \n\n\n\n\n\n\n\nST ELIZABETH, Jamaica — The Jamaica Police Federation has expressed condolences to the Jamaica Constabulary Force (JCF) and colleagues of Constable Eric Evans, who died on Saturday.\n\nThe constable was involved in a crash on the Goshen main road in St Elizabeth and died from his injuries.\n\nREAD: Police constable dies in vehicular collision \n\nThe Federation said a response team from the JCF Welfare Division is currently on-site alongside support personnel from the Public Safety and Traffic Enforcement Branch (PSTEB).\n\n“We extend our sincere condolences to the management and staff of PSTEB during this period of loss,” the release said.\n\n\n\n\n\n\n\n\nTags: Crash fatal Police \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police warn against obstructing traffic \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica — The Jamaica Constabulary Force (JCF) will be taking a zero-tolerance approach to persons who obstruct the free flow of traffic in ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Tony Roy reflects on ‘I’d Love You to Want Me’ \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n Whenever Tony Roy reflects on his career, he is likely to pinpoint 2025 as the year he got the big breakthrough. That came with I’d Love You to Want M... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n St Elizabeth residents receive land titles \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — More than 700 residents of St Elizabeth across 34 communities are now proud landowners under the Government’s Systematic Land ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration wo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/police-federation-expresses-condolences-following-death-traffic-cop/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/Observer-Size-page-dead-constable.jpg","video":null,"publish_date":"2025-12-14 02:57:56","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.039},{"id":386978104,"title":"Elite Ivy League campus latest to grapple with mass shooting as violence erupts at Brown University","text":"Brown University became the latest campus responding to a mass shooting when at least two people were killed and eight others were wounded Saturday during finals week at the elite Rhode Island Ivy League institution. A shelter-in-place order was issued and streets were blocked off in response to the shooting as police continue to search for a male suspect. \"This is a deeply tragic day for Brown, our families and our local community. There are truly no words that can express the deep sorrow we are feeling for the victims of the shooting that took place today at the Barus & Holley engineering and physics building,\" Brown University President Christina H. Paxson said in a message to the campus community. SHOOTING AT OKLAHOMA STATE UNIVERSITY RESIDENCE HALL LEAVES MULTIPLE VICTIMS \"This is a day that we hoped never would come to our community. It is deeply devastating for all of us. We are grateful to law enforcement for their immediate response and their ongoing work to ensure the safety of our community. Please continue to take all steps to be safe,\" the message added. Rhode Island Hospital is in lockdown but is still accepting emergency department patients. President Donald Trump said he has been briefed on the shooting. \"What a terrible thing it is,\" the president said. \"All we can do right now is pray for the victims and for those that were very badly hurt, it looks like. ... We'll inform you later as to what's happening, but it's a shame. Let's just pray.\" SOUTH CAROLINA STATE UNIVERSITY ON LOCKDOWN AFTER REPORTED DORM SHOOTING ON CAMPUS Brown University, an Ivy League school founded in 1764, is a leading nonprofit research university in Providence, Rhode Island. The institution has more than 11,000 students and 5,500 employees, including close to 900 regular faculty. Brown University’s endowment is $8 billion, making it among the wealthiest institutions in the country. The shooting Saturday was just the most recent shooting on a U.S. college campus. A junior Brown University student told Fox News Digital he was barricaded in a university building during the shooting, called 911 and waited nearly two hours before police arrived. \"They brought us down into a basement office space with a few hundred people and have been sweeping the building getting groups of people as they call 911 and inform them of their location,\" the student said. \"We’re hearing pretty daunting numbers, and people are all checking in on their friends.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP On Tuesday, a shooting at Kentucky State University killed one student and critically injured another. There were also other shootings on college campuses earlier this year, including the assassination of conservative activist Charlie Kirk during a September event at Utah Valley University and a shooting at Florida State University in April in which two people were killed and seven were wounded.","summary":"The Brown University community was devastated after a deadly shooting at an engineering building left two people dead and eight others wounded.","url":"https://www.foxnews.com/us/elite-ivy-league-campus-latest-grapple-mass-shooting-violence-erupts-brown-university","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/brown-university-shooting-020.jpg","video":"https://www.foxnews.com/video/6386458191112","publish_date":"2025-12-14 02:39:04","author":"Landon Mion","authors":["Landon Mion"],"language":"en","category":"politics","source_country":"US","sentiment":-0.378},{"id":386967378,"title":"Police warn against obstructing traffic","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn this file photo, then-Head of the Manchester Police Traffic Department Sergeant Florizel Williams directing a motorist at the intersection of Caledonia Road and New Green Road. (Photo: Kasey Williams) \n\n Latest News, News \n\nDecember 13, 2025\n\n\n\n\n Police warn against obstructing traffic \n\n\n\n\n\n\n\nKINGSTON, Jamaica — The Jamaica Constabulary Force (JCF) will be taking a zero-tolerance approach to persons who obstruct the free flow of traffic in town centres, during the busy Christmas period.\n\nAssistant Commissioner of Police assigned to the Strategic Operations Portfolio and the Public Safety and Traffic Enforcement Branch, Dr Gary McKenzie, said the police will be clamping down on motorists who block other persons from moving freely.\n\n“One of the things that we tend to do as Jamaicans is that we want to park right where we’re going, we want to stop and go right into our building. But that will not work, because that causes a lot of double parking. People park on roadways obstructing traffic; there is a lot of parking on sidewalks. When that is done, pedestrians have to retreat to the roadways and that causes potential dangers for them,” he stated, during a Jamaica Information Service Think Tank held on December 8.\n\n“We will not tolerate obstruction through parking or vehicles being abandoned. When you return, the [vehicles] might not be there because we have to ensure that there are no delays, because whenever we have delays, then we have frustration and there is the propensity for persons to try and get by through careless and dangerous means,” he added.\n\nMcKenzie stressed that vehicles will be impounded, and owners will not be able to retrieve their vehicles without facing prosecution.\n\n“Tickets will be issued. What we want is that persons… use the parking lots, and in the Yuletide season, we encourage carpooling. We are very happy that there are improvements in our public service bus system and that is one option, but carpooling is also another,” he said.\n\nMcKenzie noted that, while the high volume of traffic is inevitable during the period, once order is maintained, people will be able to go about their business in an orderly fashion.\n\n“There are times when you simply can’t find anywhere else to send traffic. But once there’s order, people will eventually make their way. So, our strategy is to maintain order and to ensure that people conform with the law as they seek to go about their business,” he said.\n\n\n\n\n\n\n\n\n\nTags: Christmas Police Traffic \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n 2025 the breakout year for singer Tony Roy \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n Whenever Tony Roy reflects on his career, he is likely to pinpoint 2025 as the year he got the big breakthrough. That came with I’d Love You to Want M... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n St Elizabeth residents receive land titles \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — More than 700 residents of St Elizabeth across 34 communities are now proud landowners under the Government’s Systematic Land ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration wo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP caretaker demands answers after student allegedly falls from overcrowded school bus \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n PORTLAND, Jamaica —People’s National Party (PNP) Caretaker for Portland Western, Doreen Campbell, is demanding answers following what she describes as... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/police-warn-obstructing-traffic/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2023/12/ca9fbc1e45ec104e5685b22e4a295337-1024x576.jpg","video":null,"publish_date":"2025-12-14 02:37:23","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":-0.015},{"id":386967422,"title":"Tony Roy reflects on ‘I’d Love You to Want Me’","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Entertainment, Latest News \n\nDecember 13, 2025\n\n\n\n\n Tony Roy reflects on ‘I’d Love You to Want Me’ \n\n\n\n\n\n\n\nWhenever Tony Roy reflects on his career, he is likely to pinpoint 2025 as the year he got the big breakthrough.\n\nThat came with I’d Love You to Want Me, which topped reggae charts in New York and South Florida.\n\nA reggae cover of American singer Lobo’s 1972 hit, Tony Roy’s version topped the South Florida Reggae Chart and Foundation Radio Network Chart in August and July. Both tables are compiled by respected broadcaster Clinton Lindsay.\n\nI’d Love You to Want Me, also made an appearance in the Jamaica Music Countdown Chart. That was significant for the Maryland-based singer.\n\n“To have a presence on the Jamaica chart for Tony Roy means a lot. I am very happy to know that even though I am based overseas, I do have an impact in Jamaica, my home,” he said.\n\nInterestingly, when he first heard I’d Love You to Want Me in 2021, it was not the original. While on vacation in Las Vegas, a reggae version by John Holt caught his attention and he was instantly hooked.\n\nLater, Tony Roy got acquainted with Lobo’s original which peaked at number two on the Billboard Magazine Hot 100 in 1972. Holt’s rendition, from his 1,000 Volts of Holt album, was a big hit in the United Kingdom one year later.\n\nTony Roy co-produced his version with Wayne Holness, who also played bass guitar and keyboards.\n\nFrom St Thomas parish in eastern Jamaica, he migrated to the United States during the 1990s. For 30 years, Tony Roy has been a popular figure on the Baltimore/Washington DC reggae scene.\n\nOn My Mind, done for his Whylas Records, is the follow-up to I’d Love You to Want Me.\n\n— Howard Campbell\n\n\n\n\n\n\n\n\nTags: Entertainment music Tony Roy \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police warn against obstructing traffic \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica — The Jamaica Constabulary Force (JCF) will be taking a zero-tolerance approach to persons who obstruct the free flow of traffic in ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n St Elizabeth residents receive land titles \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — More than 700 residents of St Elizabeth across 34 communities are now proud landowners under the Government’s Systematic Land ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration wo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP caretaker demands answers after student allegedly falls from overcrowded school bus \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n PORTLAND, Jamaica —People’s National Party (PNP) Caretaker for Portland Western, Doreen Campbell, is demanding answers following what she describes as... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/tony-roy-reflects-on-id-love-you-to-want-me/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/Observer-Size-page-roy.jpg","video":null,"publish_date":"2025-12-14 02:36:09","author":null,"language":"en","source_country":"jm","sentiment":0.413},{"id":386967408,"title":"St Elizabeth residents receive land titles","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrime Minister, Dr. the Most Hon. Andrew Holness (right) shares a moment with a land title recipient, Charmaine Dennis Treasure (left) and her daughter, during a land titling ceremony held at the Lacovia Community Centre in St. Elizabeth on Friday (December 12). \n\n Latest News, News \n\nDecember 13, 2025\n\n\n\n\n St Elizabeth residents receive land titles \n\n\n\n\n\n\n\nST ELIZABETH, Jamaica — More than 700 residents of St Elizabeth across 34 communities are now proud landowners under the Government’s Systematic Land Registration (SLR) Programme.\n\nDuring the land titling ceremony held at the Lacovia Community Centre in the parish on Friday 50 residents received their titles.\n\nIn his remarks, Prime Minister Dr Andrew Holness said land titles are instruments of economic empowerment and building blocks of a safer and more prosperous Jamaica.\n\nHe reported that as of December 1, the National Land Agency (NLA) had distributed 9,577 certificates of title under the programme. Of that number, nearly 6,000 were handed over in St Elizabeth.\n\n“For many, this title is the first piece of paper in generations that definitively states this land is yours. It formalises the sacrifices made by parents and grandparents and opens the door to new economic opportunities,” Holness stated.\n\nHe explained that under the programme, the government has taken on the legal cost of surveying the land.\n\n“We have taken on the fees for surveying, and we have set up a system of processing these titles to ensure that Jamaicans can regularise ownership and secure their land,” he noted.\n\nThrough the SLR programme, persons who have been in open, undisturbed, and undisputed possession of land for 12 years or more are afforded the opportunity to obtain titles for these lands.\n\nThe initiative is playing a key role in increasing socio-economic security and stability, by affording persons the opportunity to acquire property.\n\nMeanwhile, Minister without Portfolio in the Ministry of Economic Growth and Infrastructure Development with responsibility for Land Titling and Settlements, Robert Montague, described the event as historic. He underscored the reach of the programme across the parish.\n\n“Communities like Lacovia, Essex Valley, Flagaman, Southfield, Rose Hall, Tryall, Top Hill… just to name a few, are benefiting from this. For many of you, this is the first time in your family’s history that the land you live on, farm on, and have raised your children on will finally bear your name,” he said.\n\n\n\n\n\n\n\n\n\nTags: Hurricane Melissa land titles St Elizabeth \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration wo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP caretaker demands answers after student allegedly falls from overcrowded school bus \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n PORTLAND, Jamaica —People’s National Party (PNP) Caretaker for Portland Western, Doreen Campbell, is demanding answers following what she describes as... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Haitians dance with joy over UNESCO musical listing \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n From the bars of the capital Port-au-Prince to Haiti's most remote villages and its worldwide diaspora, people listen and dance to the sensual rhythms... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Colombian guerrillas place communities in lockdown citing Trump ‘intervention’ threats \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n BOGOTA, Colombia (AFP) — Colombia's National Liberation Army (ELN) guerrilla group ordered civilians in areas under its control on Friday to stay hom... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/st-elizabeth-residents-receive-land-titles/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/land-title-recipients-1024x690.jpg","video":null,"publish_date":"2025-12-14 02:27:01","author":null,"language":"en","source_country":"jm","sentiment":0.318},{"id":386967392,"title":"JPS advises of temporary road closures in St James","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA JPS worker conducts restorative work post-Hurricane MelissaPhoto: JPS \n\n Latest News, News \n\nDecember 13, 2025\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration works in St James, a number of partial and full road closures will take place on Sunday, December 14, from 7:00 am to 10:00 pm.\n\nThe affected areas are as follows:\n\n Cotton Tree to Mt Carey Health Centre – fully blocked\n\nMt Carey Health Centre to Montpelier – single-lane traffic\n\nMontpelier to Bickersteth – single-lane traffic\n\nBickersteth to Cambridge – limited access\n\nCambridge Square – limited access\n\nMotorists are encouraged to use other routes where possible.\n\n\n\n\n\n\n\n\n\nTags: Electricity restoration Hurricane Melissa JPS \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP caretaker demands answers after student allegedly falls from overcrowded school bus \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n PORTLAND, Jamaica —People’s National Party (PNP) Caretaker for Portland Western, Doreen Campbell, is demanding answers following what she describes as... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Haitians dance with joy over UNESCO musical listing \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n From the bars of the capital Port-au-Prince to Haiti's most remote villages and its worldwide diaspora, people listen and dance to the sensual rhythms... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Colombian guerrillas place communities in lockdown citing Trump ‘intervention’ threats \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n BOGOTA, Colombia (AFP) — Colombia's National Liberation Army (ELN) guerrilla group ordered civilians in areas under its control on Friday to stay hom... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Vauxhall not a ‘dark horse’ says Kyle Butler \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica — While many persons were surprised by Vauxhall High’s sojourn deep into the ISSA Manning Cup competition, head coach Kyle Butler do... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/jps-advises-temporary-road-closures-st-james/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/image_1-422.jpg","video":null,"publish_date":"2025-12-14 02:20:07","author":null,"language":"en","source_country":"jm","sentiment":0.318},{"id":386967426,"title":"Montego Bay mayor calls for community support as Clean-Up Day set for Sunday","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA scene of the destruction left behind by Hurricane Melissa l at Montego Bay Sports Complex in St James. (Photo: Karl McLarty) \n\n Latest News, News \n\nDecember 13, 2025\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out a massive clean-up exercise on Sunday.\n\nDubbed “Operation Restoration and Clean-Up Day, it will target from Bogue in the west and cover different areas in Montego Bay all the way to the airport.\n\n“I am appealing to everyone to come out in support of this activity,” the mayor told Observer Online on Saturday.\n\nThis is being done in response to the damage and devastation caused by Hurricane Melissa and copious amounts of debris it left in its wake.\n\nVernon said those who want to participate should contact the community relations department or their councillor who will be doing similar clean-up activities across the 17 divisions. Activities are set to get underway by 7:00am.\n\n“This is a city wide initiative supported by our stakeholders to reclaim our public spaces,” said Vernon who is also urging individuals to continue doing the work to make their own space clean.\n\n“I appeal to every resident, clean your own space, then join your neighbours. Your hands and your heart are the fastest way to recovery,” he said.\n\nThe mayor has acknowledged the support of members of the diaspora, in particular American Friends of Jamaica who contributed USD $25,000 to the Mayor’s Charity Fund to undertake clean-up efforts across the city.\n\n“This will certainly aid our restoration efforts as we steadily move back to normal,” he added.\n\n\n\n\n\n\n\n\nTags: cleanup Hurricane Melissa Montego Bay \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Police Federation expresses condolences following death of traffic cop \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Police Federation has expressed condolences to the Jamaica Constabulary Force (JCF) and colleagues of Constable Er... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Police warn against obstructing traffic \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica — The Jamaica Constabulary Force (JCF) will be taking a zero-tolerance approach to persons who obstruct the free flow of traffic in ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n Tony Roy reflects on ‘I’d Love You to Want Me’ \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n Whenever Tony Roy reflects on his career, he is likely to pinpoint 2025 as the year he got the big breakthrough. That came with I’d Love You to Want M... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n St Elizabeth residents receive land titles \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — More than 700 residents of St Elizabeth across 34 communities are now proud landowners under the Government’s Systematic Land ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n JPS advises of temporary road closures in St James \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica— The Jamaica Public Service (JPS) is advising the motoring public, that in order to support critical electricity grid restoration wo... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nDecember 13, 2025 \n\n\n ST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabet... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/montego-bay-mayor-calls-community-support-clean-day-set-sunday/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/c4f6373b1b81ee05233a5ae88b0032fb-1024x683.jpg","video":null,"publish_date":"2025-12-14 01:37:01","author":null,"language":"en","source_country":"jm","sentiment":0.332},{"id":386967414,"title":"Police constable dies in vehicular collision","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nBY KEDIESHA PERRY Observer writer \n December 13, 2025\n\n\n\n\n Police constable dies in vehicular collision \n\n\n\n\n\n\n\nST ELIZABETH, Jamaica — The Jamaica Constabulary Force (JCF) has confirmed the death of a policeman following a motor vehicle collision in St Elizabeth on Saturday.\n\nAccording to reports reaching the Observer Online, the incident occurred at approximately 10:15 am along the Goshen Main Road in Santa Cruz. The deceased, Constable E. Evans, who was attached to the Public Safety and Traffic Enforcement Branch (PSTEB), was travelling on a police-issued motorcycle when it collided with a Toyota Coaster bus.\n\nConstable Evans sustained multiple injuries and was transported to the Mandeville Regional Hospital, where he later succumbed to his injuries.\n\nThe driver of the bus has been identified, and investigations into the circumstances surrounding the collision are ongoing. The matter is being handled by personnel from the Black River Traffic Department.\n\nThe Police Federation and the JCF Welfare Department have been notified, and arrangements are being made to provide support to the family, colleagues, and loved ones of the fallen officer.\n\n\n\n\n\n\n\n\nTags: Crash death Police \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Montego Bay mayor calls for community support as Clean-Up Day set for Sunday \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon is calling for support from the wider St James community as they seek to carry out... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump vows to ‘retaliate’ after IS attack kills US troops in Syria \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n WASHINGTON, United States (AFP) — President Donald Trump said Saturday that the United States (US) would retaliate after two US troops and a civilian ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP caretaker demands answers after student allegedly falls from overcrowded school bus \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n PORTLAND, Jamaica —People’s National Party (PNP) Caretaker for Portland Western, Doreen Campbell, is demanding answers following what she describes as... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Haitians dance with joy over UNESCO musical listing \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n From the bars of the capital Port-au-Prince to Haiti's most remote villages and its worldwide diaspora, people listen and dance to the sensual rhythms... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Colombian guerrillas place communities in lockdown citing Trump ‘intervention’ threats \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n BOGOTA, Colombia (AFP) — Colombia's National Liberation Army (ELN) guerrilla group ordered civilians in areas under its control on Friday to stay hom... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Vauxhall not a ‘dark horse’ says Kyle Butler \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica — While many persons were surprised by Vauxhall High’s sojourn deep into the ISSA Manning Cup competition, head coach Kyle Butler do... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Transport sectors back to normal operations after hurricane \n\n\n\n\n\n\n\nDecember 13, 2025 \n\n\n KINGSTON, Jamaica —Transport Minister Daryl Vaz says the country’s critical transport sectors and support systems have resumed operations following th... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/13/police-constable-dies-vehicular-collision/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/police-shirt-photo.jpeg","video":null,"publish_date":"2025-12-14 00:41:14","author":null,"language":"en","source_country":"jm","sentiment":0.024},{"id":386978110,"title":"FBI ousts reinstated whistleblower over unauthorized media talks, ‘poor judgment’","text":"A former FBI agent and COVID-era whistleblower who was recently reinstated under President Donald Trump was fired Friday, according to a report. The FBI dismissed Steve Friend for \"unprofessional conduct and poor judgment,\" according to a copy of a termination letter posted on X by New York Post columnist Miranda Devine. An FBI source confirmed the firing but would not elaborate, saying it was a personnel matter. The FBI stated in the letter that Friend \"participated in unauthorized interactions with the media, publicly disseminated media sources, and commented publicly on FBI matters and ongoing FBI investigations.\" HOUSE REPUBLICANS ACCUSE BIDEN'S FBI OF RETALIATING AGAINST WHISTLEBLOWER WHO EXPOSED MISCONDUCT Friend was first suspended by the FBI in August 2022 and resigned in February 2023. He was reinstated in September. In the letter, the FBI stated that, in November, Friend \"disseminated media sources and photographs identifying an alleged subject and discussed the alleged subject on your podcast, despite the lack of credible, verifiable evidence necessary to publicly identify the subject.\" When reached for comment by Fox News Digital, Friend said his ouster was retaliation by FBI Director Kash Patel. EX-FBI AGENTS SAY BUREAU USED INTERNAL PROBES TO PUNISH WHISTLEBLOWERS Friend’s dismissal from the bureau came after his attorneys at Empower Oversight Whistleblowers & Research dropped him as a client Dec. 5. The nonprofit organization said in a letter to Friend that he had ignored its advice by commenting publicly on FBI matters, \"risking further adverse administrative action\" by the bureau. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"In light of your apparent unwillingness to follow the free professional advice we have given you, we are even more convinced that our previously expressed inability to represent you regarding any legal matters other than your reinstatement was warranted,\" the nonprofit wrote. \"We are no longer willing or able to expend further time and resources representing your interests or providing counsel moving forward.\"","summary":"FBI agent and COVID-era whistleblower Steve Friend was fired for &quot;unprofessional conduct&quot; just months after being reinstated by the Trump administration.","url":"https://www.foxnews.com/politics/fbi-ousts-reinstated-whistleblower-over-unauthorized-media-talks-poor-judgment","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/02/edited-fbi.png","video":null,"publish_date":"2025-12-14 00:36:39","author":"Michael Sinkewicz","authors":["Michael Sinkewicz"],"language":"en","category":"politics","source_country":"US","sentiment":-0.616}]}