{"offset":0,"number":50,"available":11590,"news":[{"id":347418814,"title":"Trump orders US nuclear subs repositioned over statements from ex-Russian leader Medvedev","text":"WASHINGTON (AP) — In a warning to Russia, President Donald Trump said Friday he’s ordering the repositioning of two U.S. nuclear submarines “based on the highly provocative statements” of the country’s former president, Dmitry Medvedev, who has raised the prospect of war online.\n\nTrump posted on his social media site that, based on the “highly provocative statements” from Medvedev, he had “ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that.”\n\nThe president added, “Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.”\n\nIt wasn’t clear what impact Trump’s order would have on U.S. nuclear subs, which are routinely on patrol in the world’s hotspots, but it comes at a delicate moment in the Trump administration’s relations with Moscow.\n\nTrump has said that special envoy Steve Witkoff is heading to Russia to push Moscow to agree to a ceasefire in its war with Ukraine and has threatened new economic sanctions if progress is not made. He cut his 50-day deadline for action to 10 days, with that window set to expire next week.\n\nThe post about the sub repositioning came after Trump, in the wee hours of Thursday morning, had posted that Medvedev was a “failed former President of Russia” and warned him to “watch his words.” Medvedev responded hours later by writing, “Russia is right on everything and will continue to go its own way.”\n\nAnd that back-and-forth started earlier this week when Medvedev wrote, “Trump’s playing the ultimatum game with Russia: 50 days or 10” and added, “He should remember 2 things: 1. Russia isn’t Israel or even Iran. 2. Each new ultimatum is a threat and a step towards war. Not between Russia and Ukraine, but with his own country.”\n\nAsked as he was leaving the White House on Friday evening for a weekend at his estate in New Jersey about where he was repositioning the subs, Trump didn’t offer any specifics.\n\n“We had to do that. We just have to be careful,” he said. “A threat was made, and we didn’t think it was appropriate, so I have to be very careful.”\n\nTrump also said, “I do that on the basis of safety for our people” and “we’re gonna protect our people.” He later added of Medvedev, “He was talking about nuclear.”\n\n“When you talk about nuclear, we have to be prepared,” Trump said. “And we’re totally prepared.”\n\nMedvedev was Russia’s president from 2008 to 2012, while Vladimir Putin was barred from seeking a third consecutive term, and then stepped aside to let him run again.\n\nNow deputy chairman of Russia’s National Security Council, which Putin chairs, Medvedev has been known for his provocative and inflammatory statements since the start of the war in 2022. That’s a U-turn from his presidency, when he was seen as liberal and progressive.\n\nMedvedev has frequently wielded nuclear threats and lobbed insults at Western leaders on social media. Some observers have argued that with his extravagant rhetoric, Medvedev is seeking to score political points with Putin and Russian military hawks.\n\nOne such example before the latest spat with Trump came on July 15, after Trump announced plans to supply Ukraine with more weapons via its NATO allies and threatened additional tariffs against Moscow. Medvedev posted then, “Trump issued a theatrical ultimatum to the Kremlin. The world shuddered, expecting the consequences. Belligerent Europe was disappointed. Russia didn’t care.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — In a warning to Russia, President Donald Trump said Friday he&#8217;s ordering the repositioning of two U.S. nuclear submarines “based on the highly provocative...","url":"https://wsvn.com/news/politics/trump-orders-us-nuclear-subs-repositioned-over-statements-from-ex-russian-leader-medvedev/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/03/030725-Trump.jpg?quality=60&strip=color","video":null,"publish_date":"2025-08-02 01:33:10","author":"Associated Press,Matthew Garcia","authors":["Associated Press","Matthew Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":0.04},{"id":347418692,"title":"Aussie cow market takes off as tariffs loom and US burger prices rise","text":"As the world waited this week to see what US President Donald Trump's next move on tariffs would be, the value of cows in Australian saleyards started to soar.\n\nHeavy cows, light cows, it didn't matter. If they had four legs, they were in hot demand.\n\nAt Roma on Tuesday, processors forked out $4.40 a kilogram for heavy cows, which livestock agent Geoffrey Maslen said was incredible.\n\n\"Records were smashed here at Roma. In my 21 years, I can't remember cows getting $4.40 a kilo,\" he said.\n\nThe national processor cow indicator jumped 46 cents a kilogram this week and is close to its record high reached in 2022.\n\nMeanwhile, the national dairy cow indicator is at an all-time high of $3.51 per kilogram. \n\nAt Echuca on Wednesday, some dairy cows made $3.90/kg, selling for nearly $3,000 each.\n\nWhat's driving the cow market?\n\nProcessors are forking out record money for Australian cows, while the US is handing over record money for lean imported beef.\n\nThe US cattle herd is at its lowest point since the 1950s due to drought, and its supply of beef for making hamburgers is tight.\n\nStoneX Australian livestock and commodities manager Ripley Atkinson said US demand for beef was strong, but Aussie processors were worried about the pipeline of cattle available.\n\n\"What's fundamentally driving the cow market at the moment is the southern processors and exporters looking to source slaughter stock to maintain kill chains [in abattoirs], maintain their workforce and operate their facilities,\" he told ABC Landline.\n\n\"The recent rain in southern Australia, on the edge of spring, has tightened the physical cattle supply and forced those processors to compete harder in northern markets — and that added competition is driving the market.\"\n\nIs Brazil about to bow out?\n\nThe US has relied heavily on beef imports from Australia and Brazil this year, but is now getting ready to enforce a 50 per cent tariff on Brazilian beef.\n\nThe tariff is due to take effect on August 7.\n\nEpisode3.net analyst Matt Dalgleish said the Brazil tariff would bring its beef trade with the US to a halt.\n\n\"I don't think we're going to see too much Brazilian beef go into the US for the rest of this year, and that will provide opportunities for Australia because our tariff is still at 10 per cent,\" he told the Country Hour.\n\n\"So it puts Australia in an even better position. \n\nABC Landline has been told some Australian processors may have paid extra for cows this week in expectation of tariffs stopping the Brazil beef trade to the US.\n\nGlobal Agritrends analyst Simon Quilty said the cow price hike was \"not really about burgers, it's about the lack of throughput for southern processors\".\n\nHe also said the federal government's controversial decision to allow US beef imports looked to have \"paid off\", with Australia avoiding a Trump tariff hike — for now. \n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.","summary":"As the world waits to hear news about US President Donald Trump's latest tariffs, the value of Australian cows has been soaring.","url":"https://www.abc.net.au/news/2025-08-02/australian-cow-market-up-as-tariffs-loom-burger-price-roars/105599526","image":"https://live-production.wcms.abc-cdn.net.au/a91fbb6f3fd2352bb95f9f49ccfc7578?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-08-02 01:20:30","author":"Matt Brann","authors":["Matt Brann"],"language":"en","source_country":"AU","sentiment":-0.182},{"id":347418090,"title":"DAILY MAIL COMMENT: Keir Starmer must fight for UK drug firms","text":"The life sciences industry is among the brightest jewels in the British economy, generating £100billion a year and employing more than 300,000 people.\n\nAt its heart is the development and manufacture of pharmaceuticals, notably by AstraZeneca, which spends vast sums on research and is worth £167billion.\n\nSo, if this hugely successful company were to relocate to the US, it would be a disaster both for the London Stock Exchange and the wider economy.\n\nWorryingly, this is not out of the question. AstraZeneca already sells 40 per cent of its drugs to America and, following President Donald Trump's tariff threat, is ramping up research and production there.\n\nWhile there are no immediate plans to desert the UK, chief executive Pascal Soriot is said to be 'flirting' with the idea. Mr Trump's latest demand that foreign drug companies cut prices to US customers or face penalties may be an added incentive.\n\nThe Left has always been highly critical of 'Big Pharma', accusing it of profiteering on the backs of NHS patients. Under Jeremy Corbyn, Labour planned to create a state-owned drug manufacturer with the power to override the patents which enable firms to make profits from their research.\n\nOnly last year, Sir Keir Starmer refused to help fund a new vaccine plant in Liverpool – while pouring public money into our ailing steel industry.\n\nThis Government must understand that failing to nurture AstraZeneca, GSK and others would be a catastrophic mistake. And Sir Keir should realise that while they say they want to remain in the UK, they may yet change their mind.\n\nCar lenders off hook\n\nBanks and credit providers will have heaved a huge sigh of relief yesterday after the Supreme Court ruled they will not have to pay compensation to millions of motorists who bought cars on finance without being told the dealers were receiving commission on the loan.\n\nThe Treasury was also delighted with the result. Had it gone the other way, damages could have been comparable to the PPI scandal, which destabilised the financial industry for more than a decade.\n\nThe court decided that dealers did not have a duty to act solely for buyers and that commissions were not a form of bribery in the legal sense, as had been alleged.\n\nHowever, it was not a total exoneration. Court President Lord Reed also ruled that excessive commission payments were unfair and ordered one buyer who had been charged 25 per cent of the value of the car to be repaid with interest. This opens the way to further claims.\n\nThe dealers and lenders have escaped their worst fears, but they do not come out well. They have certainly been guilty of sharp practices even if not illegal ones. The Competition and Markets Authority must now force them to clean up their act. \n\nOAPs feel the cold\n\nIn September, Rachel Reeves promised she would 'put more money in pensioners' pockets'. What she didn't say is that she would take even more out.\n\nResearch shows pensioner households are an average of £800 worse off after a year of Labour thanks to higher bills – mainly owing to the Chancellor's £40billion Budget tax raid. \n\nWith more taxes coming down the track to fill Labour's ever-widening financial black hole, the cost of living is set to soar further. For all Ms Reeves' promises, the elderly are in for a bitter winter.","summary":"DAILY MAIL COMMENT: AstraZeneca already sells 40 per cent of its drugs to America and, following President Donald Trump 's tariff threat, is ramping up research and production there.","url":"https://www.dailymail.co.uk/debate/article-14964337/DAILY-MAIL-COMMENT-Keir-Starmer-fight-UK-drug-firms.html","image":"https://i.dailymail.co.uk/1s/2025/08/02/01/100861551-0-image-a-17_1754093063269.jpg","video":null,"publish_date":"2025-08-02 01:18:29","author":"Daily,Editor","authors":["Daily","Editor"],"language":"en","source_country":"gb","sentiment":-0.45},{"id":347417696,"title":"'Not creepy at all': Critics disgusted at Trump complimenting Karoline Leavitt's 'lips'","text":"On Friday, President Donald Trump sat down for an interview with far-right, pro-Trump network Newsmax, and his answer to a question about White House press secretary Karoline Leavitt prompted fierce criticism on social media.\n\nToward the end of the interview, Newsmax host Rob Finnerty asked Trump about Leavitt's performance during her daily press briefings, and Trump complimented her skills as his administration's chief spokesperson — as well as her looks.\n\n\"She's become a star. It's that face, it's that brain, it's those lips, the way they move, they move like — she's a machine gun,\" Trump said, noticeably lingering on the word \"lips.\" \n\nREAD MORE: 'Obsessed with propaganda': How Trump's 'temper tantrum' firing of BLS chief may backfire\n\n\"Is she in the room?\" Trump asked Finnerty, who responded affirmatively. \"She's a star, and she's great. She's a great person, actually. But she's, I don't think anybody's ever had a better press secretary than Karoline. She's been amazing.\"\n\nTrump's glowing comments about Leavitt prompted outrage and disgust on social media, with many commentators observing how unusual it was for a president to speak in such a way about his 27 year-old press secretary. Liberal group MeidasTouch observed: \"This definitely sounds like something Jeffrey Epstein's best friend would say.\" X influencer \"Wu Tang Is for the Children\" sarcastically commented that Trump's remarks were \"not creepy at all.\" Another X user made the point that \"if any boss said something like this about an employee, they would be fired.\"\n\n\"This is the language of a dementia patient, also 34x felon & adjudicated sex abuser,\" tweeted former federal prosecutor Richard Signorelli.\n\n\"Wonder why the Epstein story won't go away for him,\" quipped Democratic strategist Adam Parkhomenko.\n\nREAD MORE: 'The cover-up is huge': Epstein survivor says Maxwell pardon would be 'ultimate betrayal'\n\nWatch the video of Trump's remarks below, or by clicking this link.","summary":"On Friday, President Donald Trump sat down for an interview with far-right, pro-Trump network Newsmax, and his answer to a question about White House press secretary Karoline Leavitt prompted fierce criticism on social media.\n\nToward the end of the interview, Newsmax host Rob Finnerty asked Trump about Leavitt's performance during her daily press briefings, and Trump complimented her skills as his administration's chief spokesperson — as well as her looks.\n\n\"She's become a star. It's that face, it's that brain, it's those lips, the way they move, they move like — she's a machine gun,\" Trump said, noticeably lingering on the word \"lips.\" \n\nREAD MORE: 'Obsessed with propaganda': How Trump's 'temper tantrum' firing of BLS chief may backfire\n\n\"Is she in the room?\" Trump asked Finnerty, who responded affirmatively. \"She's a star, and she's great. She's a great person, actually. But she's, I don't think anybody's ever had a better press secretary than Karoline. She's been amazing.\"\n\nTrump's glowing comments about L","url":"https://www.alternet.org/trump-karoline-leavitt-lips/","image":"https://www.alternet.org/media-library/image.png?id=61421477&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-08-02 01:10:43","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":0.181},{"id":347418690,"title":"Major public broadcasting group to close after Trump-led funding cuts","text":"The Corporation for Public Broadcasting has announced it will shut down operations in a massive blow to the public media network in the United States.\n\nThe Republican-controlled House of Representatives last month voted to pull $US1.1 billion ($1.71 billion) in funding over two years.\n\nThe demise of the corporation, known as CPB, is a direct result of President Donald Trump's targeting of public media, which he has repeatedly said is spreading political and cultural views opposite to those the US should be promoting.\n\nMr Trump has long claimed public broadcasting displays an extreme liberal bias and has generated an anti-public broadcasting groundswell among supporters in recent months.\n\nThe closure is expected to have a profound impact on journalism and the cultural landscape in the US.\n\nCPB helps fund both PBS and NPR, but most of its funding is distributed to more than 1,500 local public radio and television stations in small communities around the country.\n\nStations rely on public donations, sponsorships and local government funding to make up the remainder of their budgets.\n\nBut without federal funding, many rural stations could be at risk, which would impact educational programming, local news coverage and emergency broadcasts.\n\nCPB has deep ties with much of the nation's familiar programming, including NPR's All Things Considered, Sesame Street, and historically, Mister Rogers' Neighborhood and Ken Burns's documentaries.\n\nCPB said its end, 58 years after being signed into law by President Lyndon B Johnson, would come in an \"orderly wind-down\".\n\nIn a statement, it said the decision was made in response to the funding cuts by Congress.\n\n\"Despite the extraordinary efforts of millions of Americans who called, wrote, and petitioned Congress to preserve federal funding for CPB, we now face the difficult reality of closing our operations,\" said Patricia Harrison, the corporation's president and CEO.\n\nA last-grasp attempt at funding fails\n\nDemocrats on the Senate Appropriations Committee made a last-ditch effort this week to save the CPB's funding.\n\nAs part of committee deliberations on Thursday, senator Tammy Baldwin authored, but then withdrew, an amendment to restore CPB funding for the coming budget year.\n\nShe said she still believed there was a path forward \"to fix this before there are devastating consequences for public radio and television stations across the country\".\n\n\"It's hard to believe we've ended up in the situation we're in,\" she said.\n\n\"And I'm going to continue to work with my colleagues to fix it.\"\n\nBut senator Shelley Moore Capito sounded a less optimistic tone.\n\n\"I understand your concerns, but we all know we litigated this two weeks ago,\" she said.\n\nClosure will come in phases\n\nCPB said it informed employees on Friday, local time, that most staff positions will end on September 30.\n\nIt said a small transition team will stay in place until January to finish any remaining work, including \"ensuring continuity for music rights and royalties that remain essential to the public media system\".\n\n\"Public media has been one of the most trusted institutions in American life, providing educational opportunity, emergency alerts, civil discourse, and cultural connection to every corner of the country,\" Ms Harrison said.\n\n\"We are deeply grateful to our partners across the system for their resilience, leadership, and unwavering dedication to serving the American people.\"\n\nNPR stations use millions of dollars in federal money to pay music licensing fees.\n\nNow, many will have to renegotiate these deals.\n\nNPR president and CEO Katherine Maher estimated recently that 96 per cent of all classical music broadcast in the US is on public radio stations.","summary":"The Corporation for Public Broadcasting announces it will cease operations in a massive blow to the public media network in the United States.","url":"https://www.abc.net.au/news/2025-08-02/us-corporation-for-public-broadcasting-to-close/105604428","image":"https://live-production.wcms.abc-cdn.net.au/d80a151a73d5be3c6b6871ca575fc1a8?impolicy=wcms_crop_resize&cropH=2653&cropW=4716&xPos=0&yPos=246&width=862&height=485","video":null,"publish_date":"2025-08-02 01:09:04","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.15},{"id":347417190,"title":"Two US nuclear submarines ‘closer to Russia,’ Trump says","text":"NEW YORK, August 2. /TASS/. Two US nuclear submarines are closer to Russia, US President Donald Trump said in an interview with Newsmax television.\n\n\"They are closer to Russia, I assume,\" the US leader said.\n\n\"We always want to be ready. And so I have sent to the region two nuclear submarines,\" he added.","summary":"\"We always want to be ready\", US president added","url":"https://tass.com/world/1997341","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-02 00:58:26","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":0.167},{"id":347419022,"title":"'Russia stunned into silence' by Donald Trump's nuclear subs move","text":"Russia has been left seemingly speechless after US President Donald Trump's decision to deploy two nuclear submarines in response to Moscow's rhetoric. The move, which saw the subs dispatched to \"in appropriate regions\" came after \"foolish and inflammatory statements\" by Russia 's ex-President Dmitry Medvedev. Mr Trump refrained from disclosing the exact location of the submarines or clarifying if they were nuclear-powered or armed. BBC's Russia Editor Steve Rosenberg reported a lack of immediate response from Russian officials, noting on BBC News: \"Interestingly, there has been no reaction so far from the Kremlin, from the Foreign Ministry, from the Defence Ministry - anyone here, really. \"I think everyone is trying to work out what on earth is going on and what, if anything, has changed in relations to where these nuclear subs are being positioned.\" Rosenberg observed that the announcement had unsettled Moscow's stock market, following over three years of \"bombastic and provocative\" commentary from Medvedev, reports the Express . He further noted: \"There has been reactions from the Moscow stock market, which has fallen sharply. Judging by the reactions in the local media here, Russians are surprised to say the least by President Trump's post. \"I suspect that nobody is more surprised than Dmitry Medvedev himself, because for more than three years he has been tweeting and posting some very bombastic and provocative social media posts - most of which have gone unnoticed, I have to say. \"But now suddenly he has been noticed and he has gone under the skin of the President of the United States in a big way.\" Mr Trump revealed the submarine deployment on his Truth Social platform. He posted: \"Based on the highly provocative statements of the Former President of Russia, Dmitry Medvedev, who is now the Deputy Chairman of the Security Council of the Russian Federation, I have ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that. \"Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances. Thank you for your attention to this matter!\". This followed Medvedev's warning to the US president about Russia's Soviet-era nuclear strike capabilities that could be deployed as a final option.","summary":"Donald Trump announced the deployment of two nuclear submarines following &quot;foolish and inflammatory statements&quot; by former Russian President Dmitry Medvedev","url":"https://www.dailyrecord.co.uk/news/uk-world-news/russia-stunned-silence-donald-trumps-35662378","image":"https://i2-prod.dailyrecord.co.uk/article35634184.ece/ALTERNATES/s1200b/0_US-President-Donald-Trump-Visits-Scotland-For-Rounds-Of-Golf-And-Trade-Talks.jpg","video":null,"publish_date":"2025-08-02 00:57:54","author":"Phoebe Tonks,Rebecca Robinson","authors":["Phoebe Tonks","Rebecca Robinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.145},{"id":347413524,"title":"Trump tariffs: Asian reaction to new US 'reciprocal' rates","text":"TOKYO -- Hours ahead of his Aug. 1 deadline for new \"reciprocal\" tariffs, U.S. President Donald Trump has announced the rates he is going to impose on imports of goods from dozens of countries.\n\nThe new rates include 25% on India, 20% on Taiwan and 19% on Thailand, Malaysia and Cambodia. Countries that run a trade deficit in goods with the U.S., such as Singapore, will face the baseline rate of 10%. Some of Asia's smallest economies have been hit hardest: Laos and Myanmar both face 40%.\n\nFor more in-depth reaction and analysis, here are some of Nikkei Asia's recent articles on the U.S. tariffs:\n\n- Taiwan says US tariff deal not final, calls 20% hit 'temporary'\n\n- India's Modi faces opposition slam after Trump slaps 25% tariff\n\n- South Korean stocks plunge nearly 4% following US trade deal\n\nFollow the latest developments in this live blog (Japan standard time):\n\nSaturday, August 2\n\n12:15 a.m. Malaysia's tariff deal with the U.S. is a \"win-win,\" the Southeast Asian country's trade minister said.\n\nThe deal demonstrates the strong bilateral relationship between the two countries, Malaysian Trade Minister Zafrul Aziz told a news conference. The U.S. tariff rate of 19% is \"fair,\" he said, given the circumstances faced by neighboring countries in the region. Read more.\n\nFriday, August 1\n\n5:15 p.m. Thailand's acting Prime Minister Phumtham Wechayachai said at a cabinet meeting that the 19% tariffs on Thai products \"are the same rate as many countries in the region, which is good news,\" according to a government spokesperson.\n\n\"A key step for the Thai government is to issue a joint Thai-U.S. statement,\" Phumtham said, which the representatives from both sides have drafted.\n\nEarlier, Finance Minister Pichai Chunhavajira indicated that, unlike some other countries, Thailand did not agree to eliminate tariffs on all American products. \"For the types of products we are prepared for, we will give them 0%. What we are not ready for yet, we won't allow it at all, or we will allow it partially, asking for three to five years to prepare,\" Pichai told local media.\n\n3:45 p.m. Soh Thian Lai, president of the Federation of Malaysian Manufacturing, pointed out that the burden of tariffs is often shared across the supply chain.\n\n\"A reduction in tariffs benefits not only Malaysian exporters but also U.S. importers. It improves the overall cost equation and can stimulate demand for Malaysian goods, especially in sectors where price plays a crucial role in purchasing decisions,\" Soh said.\n\nWhile it is still too early to assess the full impact, he anticipated that several export-oriented industries like electrical and electronics machinery and equipment, rubber-based products and processed industrial goods, may benefit from improved competitiveness and increased demand.\n\nAnd while some front-loading of orders may have occurred earlier, Soh predicted that the tariff cut is likely to encourage more exporters to consider \"taking on new orders.\"\n\n2:15 p.m. Alexandra Hermann, lead economist at U.K.-based consultancy Oxford Economics, said the 25% tariff rate on Indian exports -- higher than Asian peers such as Vietnam, Japan and South Korea -- will put the country at a disadvantage in the medium term, damaging \"export prospects and investment appeal.\"\n\nHermann warned that Trump's threat to penalize Russia's trading partners could also weigh on India, forcing it to replace discounted Russian oil.\n\n\"Though probably temporary, an additional 100% duty over the remainder of Q3 would shock confidence and could push global oil prices to $80-$90, raising India's import bill,\" she said. \"Public finances would likely take some of the hit to cushion the inflationary impact in the near term, with state-owned oil refiner margins potentially absorbing most of the cost.\"\n\nHermann added that there is still room for negotiations, as indicated by Trump, with final tariffs of 15% \"a plausible upside scenario.\"\n\n2 p.m. Kriangkrai Thiennukul, president of the Federation of Thai Industries, stated that Thailand's success in negotiating the rate down from 36% to 19% reflects close cooperation between the public and private sectors.\n\n\"This tariff rate is at an acceptable level. No one gains or loses too much. Overall, Thai products can still compete, but businesses with margins below 10% will need to cut costs, improve efficiency and negotiate with trading partners.\"\n\n1:50 p.m. By midday, the Kuala Lumpur Stock Exchange was up nearly 20 points, or 1.3%, at 1,531.88, after slipping from its sharp rise to 1,533.10 at the opening.\n\nHong Leong Investment Bank (HLIB) said in a statement that the EMS, or electronic manufacturing services, and glove industries are regarded as immediate beneficiaries of the tariff announcement. However, it noted that both sectors are \"still grappling\" with industry-specific headwinds, which could temper further rises. HLIB said its target for the benchmark KLCI for the rest of 2025 will be 1,640.\n\n1:15 p.m. Top executives at Singaporean lender Oversea-Chinese Banking Corp. on Friday highlighted uncertainty and volatility from Trump's continuing trade war.\n\nWhile OCBC's home market Singapore, which has a trade deficit with the U.S., is set to have its tariff rate kept at the baseline of 10%, the bank counts China, a main target of Trump's protectionist campaign, as a key external market.\n\n\"The impact we see in the environment is really customers re-evaluating their investment decisions,\" OCBC's Deputy CEO Tan Teck Long said during an earnings briefing on Friday. \"When the tariff charge on China products was very high at triple digits, we found that the merchandise from a major manufacturing country such as China found its way to other markets ... [and] some of the local businesses suffer from this intense competition.\"\n\n1 p.m. Tricia Yeoh, associate professor at the University of Nottingham Malaysia, raised concerns that the U.S. could place further pressure on Malaysia to concede on non-trade matters, including its relationship with China and countries in the Middle East.\n\n\"If so, we are entering an interesting and unprecedented new global order, one in which non-traditional matters of security and foreign policy are grounds for negotiating traditional trade and economic deals,\" she said.\n\nAll in all, she said she remains \"cautiously optimistic,\" while countries in Southeast Asia and beyond need to be prepared to negotiate in unconventional ways.\n\n12:45 p.m. For those of you focusing on Southeast Asia, here's a chart comparing how the U.S. tariff rates have changed from the initial announcement in April.\n\n12:35 p.m. Deborah Kay Elms, head of trade policy at the Hinrich Foundation, a trade advocacy group, said the public would benefit from \"greater clarity\" from the White House, specifically on the transshipment provision, which indicates that \"anyone found guilty\" of doing this to evade duties will face a 40% levy. \"It does not (at the moment) indicate Chinese content,\" she told Nikkei Asia.\n\nElms argued the \"bigger challenge\" is that the tariffs in their current state are simply high. \"There will be changes ahead. The document reserves the right for the president to modify rules. His agencies have a lot of latitude in implementation.\"\n\n12:20 p.m. Malaysia's Trade Minister Zafrul Aziz welcomed the outcome, saying that it reflects \"strong and enduring economic ties\" between the two countries.\n\n\"It is also a testament to Malaysia's credibility as a reliable trade and investment partner. We thank our counterparts in the U.S. especially the U.S. Trade Representative's Office and the Department of Commerce for their constructive cooperation and support throughout the negotiation process,\" Zafrul said in a statement.\n\nThe statement also noted that Malaysia had \"stood firm\" on various \"red line\" items such as its affirmative action Bumiputera policy, procurement and opportunities for local companies.\n\n12:10 p.m. Brian McFeeters, CEO and president of the US-ASEAN Business Council, said that since the \"reciprocal\" tariff rates for exports to the U.S. from several Southeast Asian countries are the \"same or close,\" there should not be \"massive shifts\" in movable production.\n\n\"The ASEAN countries have engaged in constructive negotiations with the U.S. administration and there may be scope for further tariff adjustments or other changes in the coming months,\" McFeeters told Nikkei Asia.\n\n11:55 a.m. Piyasak Manason, head of economic research at InnovestX Securities in Bangkok, said the 19% U.S. tariff represents a \"relatively positive outcome\" for Thailand.\n\n\"This tariff level allows Thai businesses to maintain competitiveness while managing the adjustment costs,\" he wrote, as Thailand's tariff rates were similar to those of regional competitors.\n\nAt the same time, he warned that several key Thai export industries, such as electronics, machinery and processed foods, will face substantial pressure.\n\n\"This tariff level allows Thai businesses to maintain competitiveness while managing the adjustment costs,\" he said. At the same time, the key is \"how quickly Thai businesses can adapt through market diversification, productivity improvements and value-chain repositioning.\"\n\n11:50 a.m. Cambodia's Deputy Prime Minister Sun Chanthol, who led negotiations with the White House, said that while the government welcomed the lowered tariff rate -- Cambodia was facing 49% in April -- it would continue to work with the U.S. to bring it down further.\n\nHe said that all imports from the U.S. would face 0% duties. Chanthol added that the prospects of tariffs had spurred the government to increase its investment in the domestic market and infrastructure, saying the government would create 300,000 jobs a year.\n\n\"For Cambodian workers in other countries, please come back home. We will have lot of jobs,\" he vowed.\n\nChanthol also announced Cambodia was buying 10 Boeing planes for its national carriers, with the option of buying 10 more.\n\nKen Loo, spokesperson for the Textile, Apparel, Footwear & Travel Goods Association in Cambodia, said the tariffs were likely to hit exports even though Cambodia is in the same range as some of its garment-exporting competitors like Vietnam, Indonesia and Bangladesh.\n\n\"For sure this will affect exports in the short term, because I think this is going to result in lower profitability or higher consumer prices across the board,\" Loo said.\n\n11:45 a.m. Stephen Olson, senior visiting fellow at the ISEAS -- Yuosf Ishak Institute and a former U.S. trade negotiator, told Nikkei Asia that Trump has \"fundamentally rewritten the rules of global trade.\"\n\n\"Instead of the U.S. at the head of a system created to reduce trade barriers and conduct trade relationships according to predictable, mutually agreed rules, countries wishing to trade with the U.S. will now face dramatically higher tariffs that could be further increased at the whim of a president who has shown a disdain for trade rules and trade agreements -- even those which he himself has signed,\" he said.\n\nOlson said that while many countries continue to adhere to the principles of free trade, the U.S. is effectively opting out and it \"remains to be seen how or if that system can continue to function.\"\n\nHe warned that the latest announcement is unlikely to be the end of the story. \"Trump regards this as an ongoing reality show. More 'deals' or further tariff increases are almost certain to follow.\" Southeast Asian countries hoping to pursue export-led development \"will be especially hard hit,\" he said.\n\nAs for China, Olson said it \"has an opportunity to pick up the pieces and seize the mantle -- perhaps rhetorically more than in practice -- as the leader of rules based trade.\" At the same time, Trump's imposition of a 40% transshipment duty will be perceived as directed against Chinese interests and \"will inevitably spill over\" in the superpowers' ongoing trade negotiations.\n\n11:35 a.m. Nazir Razak, chair of the ASEAN-Business Advisory Council (ASEAN-BAC) said the reduction in tariffs on Malaysian goods from 25% to 19% is a \"positive step forward\" and hopefully there would be opportunity for further engagement and reductions.\n\n\"ASEAN-BAC encourages continued efforts toward a more predictable, open and mutually beneficial trade environment for Malaysia and other ASEAN nations,\" he said.\n\nOn the semiconductor front, Wong Siew Hai, president of Malaysia Semiconductor Industry Association commended that the government has put in a tremendous amount of effort to get it down as low as possible, in a \"more level playing ground\" relative to all the other countries in ASEAN.\n\n\"From our perspective, the way I see it is that currently business will be as normal. Meanwhile, everybody has to find a way to compete as aggressively as possible, by working on productivity, getting on into technology and so on, until everything settles. Nothing is said about the sectoral tariff that is currently exempted,\" Wong said.\n\n11:30 a.m. Australia's Minister for Trade Don Farrell said the country's engagement with the U.S. had paid off after the U.S. ally's tariff rate remained at 10%, and added that the government would move to take advantage of having a more competitive rate than some peers.\n\n\"This is a vindication for the Albanese government, and particularly the prime minister, in the cool and calm way that we have conducted diplomacy with the United States,\" Farrell told reporters in Adelaide on Friday.\n\nHe said Australian products like beef -- its top export to the U.S. -- as well as lamb, wine and wheat would be more competitive in the U.S.\n\n\"As a government, we will assist all of our exporters in ensuring that we take advantage of this situation and increase the volume of exports, not just to the United States, but to all of those other countries that we have diversified with,\" he said, adding the government would continue pushing its U.S. counterparts to eliminate tariffs and had invited U.S. Secretary of Commerce Howard Lutnick to Australia for discussions.\n\n11:05 a.m. Here are the U.S. \"reciprocal\" rates on key Asian countries:\n\nFor further charts on the latest tariffs, check out our tracker.\n\n11:05 a.m. The latest U.S. tariff adjustments reflect a more nuanced approach to \"friendshoring,\" targeting countries closely tied to Chinese value chains while easing pressure on those like Malaysia that retain strategic flexibility, said Khoo Ying Hooi of the University of Malaya.\n\n\"It signals that the U.S. is not shutting out ASEAN but curating trade ties based on geopolitical behavior,\" she told Nikkei Asia, adding it boosts investor confidence in Southeast Asia as a viable alternative for supply chain diversification.\n\nFormer diplomat Ilango Karuppannan agreed, calling it a dual message of discipline and openness. While higher tariffs may raise cost concerns, he said the move also reaffirms Southeast Asia's strategic role in U.S. supply chain realignment.\n\nCountries like Malaysia, Thailand, and Indonesia may benefit as \"second-best\" but geopolitically favorable options.\n\nMohd Faiz Abdullah of the Institute of Strategic and International Studies noted that Malaysia's role in the Thai-Cambodia truce and Prime Minister Anwar Ibrahim's diplomatic engagement influenced the outcome. \"This deal was reached without compromising our sovereignty -- our Bumiputera policy, procurement rules, and domestic space remain intact,\" he said, referring to affirmative action policies to help native Malays.\n\n11 a.m. Taiwan's President Lai Ching-te posted on Facebook that his negotiators in Washington were informed by the U.S. that the 20% rate is \"provisional.\"\n\n\"The main reason is that, due to procedural arrangements, the U.S. and Taiwan have not yet completed the final wrap-up meeting,\" Lai wrote. \"If an agreement is reached later, the rate is expected to be reduced.\" He added that the two sides will continue negotiations on supply chain cooperation and other matters.\n\n10:55 a.m. Thai Deputy Prime Minister and Finance Minister Pichai Chunhavajira, who led the government's negotiation team, said in a social media post: \"It helps maintain Thailand's competitiveness on the global stage, boosts investor confidence, and opens the door to economic growth, increased income, and new opportunities for the country.\n\n\"The outcome of this negotiation signals that Thailand must accelerate its adaptation and move forward in building a stable and resilient economy, ready to face global challenges ahead.\"\n\n10:50 a.m. Wendy Cutler, senior vice president of the Asia Society Policy Institute and a former deputy U.S. Trade Representative, flagged some of the key things in, and missing from, Trump's executive order (EO):\n\n\"What seems to be absent from the EO is whether existing or new rules of origin will be issued and/or negotiated. This is of key importance in light of the 40 percent transshipment tariff now applicable beyond Vietnam.\n\n\"U.S. companies will also face challenges as they navigate this new tariff landscape. Of particular concern is the continued uncertainties they will face with new sectoral tariffs coming and possibilities of additional tariffs if the Administration believes countries are not operating in good faith in their implementation efforts.\n\n\"No doubt about it -- the EO and related agreements concluded over the past few months tears up the trade rule book that has governed international trade since WW2. Whether our partners can preserve it without the United states is an open question.\"\n\n10:45 a.m. U.S. President Donald Trump announced the new tariff rates in an executive order early evening Washington time, early morning in East Asia.","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/Trump-tariffs-Asian-reaction-to-new-US-reciprocal-rates","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F5%2F6%2F8%2F49928650-1-eng-GB%2FTrump.jpg?width=1200&fit=cover&gravity=faces&dpr=2&qualit","video":null,"publish_date":"2025-08-02 00:49:52","author":null,"language":"en","source_country":"jp","sentiment":-0.037},{"id":347413520,"title":"Pakistan cheers 'better' US tariff deal even with likely fiscal risks","text":"ISLAMABAD -- Pakistan has secured a relatively favorable trade deal with the U.S., settling on a tariff rate of 19%, down from the initially threatened 29% in April, with sources revealing that President Donald Trump's personal interest in Pakistan's oil, mineral and cryptocurrency potential paved the way.\n\n\"The agreement enhances Pakistan's access to the U.S. market and vice versa,\" Pakistan's Ministry of Finance said in a press statement on Thursday. \"Additionally, the deal is expected to spur increased U.S. investment in Pakistan's infrastructure and development projects.\"","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/Pakistan-cheers-better-US-tariff-deal-even-with-likely-fiscal-risks","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F6%2F7%2F0%2F3%2F49933076-3-eng-GB%2FCropped-1754048610AP20021603064923.jpg?width=1200&fit=cov","video":null,"publish_date":"2025-08-02 00:49:52","author":"Adnan Aamir","authors":["Adnan Aamir"],"language":"en","source_country":"jp","sentiment":-0.027},{"id":347413514,"title":"5 takeaways from new US tariffs: Trump and UK win, South Korea loses","text":"WASHINGTON/NEW YORK -- President Donald Trump's self-imposed trade deadline expired on Friday, putting in place a new trade landscape -- one in which countries pay for the right to access the American market.\n\nSince Trump announced \"reciprocal\" tariffs on countries around the world on April 2, nations have been negotiating with Trump administration officials on terms to reduce the tariff burden.","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/5-takeaways-from-new-US-tariffs-Trump-and-UK-win-South-Korea-loses","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F1%2F7%2F4%2F6%2F49926471-3-eng-GB%2FCropped-17539957742025-07-11T222552Z_387268266_RC2IKFA50Y","video":null,"publish_date":"2025-08-02 00:49:52","author":"Ken Moriyasu","authors":["Ken Moriyasu"],"language":"en","source_country":"jp","sentiment":0.44},{"id":347412606,"title":"US President Fires Labor Statistics Head over Data Published Last Month","text":"Washington, August 1 (QNA) - US President Donald Trump ordered the dismissal of Erika McEntarfer, Commissioner of the Bureau of Labor Statistics, today, following her release of weaker-than-expected job growth data last month.\n\n\"We need accurate Jobs Numbers,\" Trump wrote in a post on Truth Social, adding, \"I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified.\"\n\nFormer President Joe Biden had nominated McIntarver for the position in 2023, and the Senate confirmed him the following year. (QNA)","summary":"Washington, August 1 (QNA) - US President Donald Trump ordered the dismissal of Erika McEntarfer, Commissioner of the Bureau of Labor Statistics, today, following her release of weaker-than-expected job growth data last month.","url":"https://qna.org.qa/en/news/news-details?id=us-president-fires-labor-statistics-head-over-data-published-last-month&date=2/08/2025","image":"https://cdn.qna.org.qa/media/flcerfl0/qna_trumb_a.jpg?width=1200&height=900&v=1dc0336ab5f2950","video":null,"publish_date":"2025-08-02 00:47:14","author":null,"language":"en","category":"politics","source_country":"qa","sentiment":0.207},{"id":347418092,"title":"AMANDA PLATELL: My sneaking suspicion that there IS another 'party' in the end of Cat Deeley and Patrick Kielty's marriage","text":"Donald Trump says Sadiq Khan is a 'nasty person' who has done a 'terrible job' as London mayor. As new Met figures show nearly 40 per cent of those charged with sexual offences in London are foreign nationals, despite them making up less than a quarter of the city's population, the President's certainly right about the latter.","summary":"When Cat Deeley and Patrick Kielty announced that they were separating, their careful presentation was as anodyne as Cat introducing some celebrity flogging a new cookbook on ITV 's This Morning.","url":"https://www.dailymail.co.uk/femail/article-14963923/AMANDA-PLATELL-Cat-Deeley-Patrick-Kielty-marriage.html","image":"https://i.dailymail.co.uk/1s/2025/08/01/21/100857041-0-image-m-110_1754078609256.jpg","video":null,"publish_date":"2025-08-02 00:43:46","author":"Amanda Platell,Editor","authors":["Amanda Platell","Editor"],"language":"en","source_country":"gb","sentiment":-0.401},{"id":347416482,"title":"Democratic states sue Trump admin over ending sex change surgeries for minors","text":"More than a dozen officials from Democratic-led states are suing to block the Trump administration from blocking access to sex change procedures and treatments for people under 19. The complaint, filed in the U.S. District Court for the District of Massachusetts, argues that the administration effectively wants to impose a nationwide ban on sex change procedures by threatening providers with \"baseless criminal charges\" and investigations. \"The federal government is running a cruel and targeted harassment campaign against providers who offer lawful, lifesaving care to children,\" New York Attorney General Letitia James, who is leading the coalition of states in the suit, said in a statement. MAJOR CONNECTICUT HOSPITALS BEGIN 'WINDING DOWN' YOUTH GENDER PROGRAMS CITING 'EVOLVING LANDSCAPE' \"This administration is ruthlessly targeting young people who already face immense barriers just to be seen and heard, and are putting countless lives at risk in the process,\" she added. \"In New York and nationwide, we will never stop fighting for the dignity, safety, and basic rights of the transgender community.\" The lawsuit names President Donald Trump, Attorney General Pam Bondi and the Justice Department as defendants. It challenges Trump's Jan. 28 executive order barring government support for sex change operations and treatments and two memos by Bondi and Assistant Attorney General Brett Shumate. Bondi's memo directs the Justice Department to investigate and prosecute those who offer sex change treatments to minors. Shumate’s memo directs prosecutors to prioritize investigations against doctors, hospitals and pharmaceutical companies that perform such procedures. The Justice Department has launched probes into three children's hospitals for allegedly providing such treatments. CHILDREN'S NATIONAL HOSPITAL IN DC TO END GENDER TRANSITION MEDICAL INTERVENTIONS \"On Day One, President Trump took decisive action to stop the despicable mutilation and chemical castration of children – which everyday Americans resoundingly support,\" White House spokesperson Taylor Rogers told Fox News Digital. \"The President has the lawful authority to protect America’s vulnerable children through executive action, and the Administration looks forward to ultimate victory on this issue.\" In July, Kaiser Permanente announced that it would pause sex change surgeries for patients under 19 beginning Aug. 29 in response to the Trump administration's efforts on the matter. The same month, Children’s Hospital Los Angeles shuttered its Center for Transyouth Health and Development, one of the nation’s largest clinics for transgender young people. The Children's National Hospital in Washington, D.C., also announced that it will no longer provide gender transition-related medical interventions. \"These changes have been touted by Defendants as precisely what was intended by their unlawful and disingenuous targeting: the end of healthcare for transgender individuals under 19,\" the complaint reads. Many states have laws restricting or banning sex change surgeries for children. The states named in the lawsuit -- California, Connecticut, Delaware, Hawaii, Illinois, Maryland, Massachusetts, Michigan, Nevada, New Jersey, New Mexico, New York, Pennsylvania, Rhode Island, Washington D.C., and Wisconsin. – allow such treatments. Other nations have pushed back on sex change procedures for children. In March, the United Kingdom banned puberty blockers – a class of drugs that suppresses sex hormones in adolescents by continually stimulating the pituitary gland -- for children seeking treatment for gender dysphoria.","summary":"Over a dozen states sue Trump administration over policies threatening providers of sex change procedures for people under 19 with criminal investigations.","url":"https://www.foxnews.com/us/democratic-states-sue-trump-admin-ending-sex-change-surgeries-minors","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/02/AP23027716459006-e1675794091614.jpg","video":"https://www.foxnews.com/video/6376038451112","publish_date":"2025-08-02 00:38:27","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"US","sentiment":-0.048},{"id":347412138,"title":"Wall Street tumbles as Trump tariffs and weak jobs data rattle markets","text":"U.S. stocks slumped on Friday, and the S&P suffered its biggest daily percentage decline in more than two months as new U.S. tariffs on dozens of trading partners and a surprisingly weak jobs report spurred selling pressure.\n\nAlso weighing on equities was an 8.3% tumble in Amazon.com shares after the company posted quarterly results but failed to meet lofty expectations for its Amazon Web Services cloud computing unit.\n\nJust hours before the tariff deadline on Friday, President Donald Trump signed an executive order imposing duties on U.S. imports from countries, including Canada, Brazil, India and Taiwan, in his latest round of levies as countries attempted to seek ways to reach better deals.\n\nFurther denting confidence in the economic picture, data showed U.S. job growth slowed more than expected in July while the prior month's report was revised sharply lower, indicating the labor market may be starting to crack.\n\nFed rate cut bets surge after hiring slowdown\n\nThe report significantly pushed up expectations the Federal Reserve will cut interest rates at its September meeting.\n\n\"There’s no way to pretty-up this report. Previous months were revised significantly lower where the labor market has been on stall-speed,\" said Brian Jacobsen, Chief Economist at Annex Wealth Management in Menomonee Falls, Wisconsin.\n\n\"Last year the Fed messed up by not cutting in July so they did a catch-up cut at their next meeting. They’ll likely have to do the same thing this year.\" Market expectations the Fed will cut rates by at least 25 basis points at its September meeting stood at 86.5%, according to CME's FedWatch Tool, up from 37.7% in the prior session.\n\nIndexes post steep losses; volatility spikes\n\nThe Dow Jones Industrial Average fell 542.40 points, or 1.23%, to 43,588.58, the S&P 500 lost 101.38 points, or 1.60%, to 6,238.01 and the Nasdaq Composite lost 472.32 points, or 2.24%, to 20,650.13.\n\nThe S&P 500 recorded its biggest single-day percentage decline since May 21 while the Nasdaq suffered its biggest daily percentage drop since April 21.\n\nFor the week, the S&P 500 fell 2.36%, the Nasdaq declined 2.17%, and the Dow fell 2.92%.\n\nThe CBOE Volatility Index, also known as Wall Street's fear gauge, closed up 3.66 points at 20.38, its highest close since June 20.\n\nAmazon was the biggest drag on the Dow, S&P 500 and Nasdaq and pushed the consumer discretionary index, down nearly 3.6% as the worst performing of the 11 major S&P 500 sectors.\n\nAlso reporting earnings was Apple, which lost 2.5% after it posted a current-quarter revenue forecast well above Wall Street estimates, but CEO Tim Cook warned U.S. tariffs would add $1.1 billion in costs over the period.\n\nTrump targets Labour Data Chief; Kugler exits Fed\n\nStocks briefly extended declines after Trump said he ordered the commissioner of the U.S. Bureau of Labor Statistics, Erika L. McEntarfer, to be fired in the wake of the jobs data.\n\n\"(Trump) didn't seem to be disappointed with the last five jobs reports,\" said Art Hogan, Chief Market Strategist, B. Riley Wealth, Boston, saying that the firing stood out as irregular.\n\n\"I think this is clearly something that happens in dictatorships, not in democracies.”\n\nThe Federal Reserve said Governor Adriana Kugler is resigning early from her term and will exit the central bank on Aug. 8, enabling President Donald Trump to select a new governor as he has ramped up pressure against Chair Jerome Powell recently to cut interest rates.\n\nDeclining issues outnumbered advancers by a 2.17-to-1 ratio on the NYSE, and by a 2.69-to-1 ratio on the Nasdaq.\n\nThe S&P 500 posted eight new 52-week highs and 29 new lows, while the Nasdaq Composite recorded 29 new highs and 202 new lows.\n\nVolume on U.S. exchanges was 19.51 billion shares, compared with the 18.44 billion average for the full session over the last 20 trading days.\n\nPublished on August 2, 2025","summary":"Indexes down: Dow 1.23%, S&P 500 1.6%, Nasdaq 2.24%","url":"https://www.thehindubusinessline.com/markets/wall-street-tumbles-as-trump-tariffs-and-weak-jobs-data-rattle-markets/article69885904.ece","image":"https://bl-i.thgim.com/public/incoming/cs7zwj/article69885905.ece/alternates/LANDSCAPE_1200/2025-08-01T104747Z_1655761889_RC2EKFALKQL1_RTRMADP_3_FIGMA-STOCKS.JPG","video":null,"publish_date":"2025-08-02 00:35:36","author":null,"language":"en","source_country":"in","sentiment":-0.783},{"id":347411464,"title":"Watch: Why Mexico got a tariff reprieve... and Canada didn't","text":"The US announced fresh tariffs on more than 90 countries after reaching the deadline imposed by President Donald Trump for nations to reach trade deals. \n\nTariffs on Canada, for example, are set to increase from 25% to 35%, although most Canadian goods are exempt. Meanwhile, higher tariffs for Mexico are paused for another 90 days. \n\nThe BBC's Michelle Fleury explains why Mexico has reached a deal - at least temporarily - while Canada has received a blow.","url":"https://www.bbc.com/news/videos/c3wnewjw2yqo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/df00/live/997eabd0-6f14-11f0-89ea-4d6f9851f623.jpg","video":null,"publish_date":"2025-08-02 00:30:59","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","source_country":"gb","sentiment":-0.004},{"id":347411462,"title":"Why Donald Trump's tariffs take aim at Asia and your iPhones","text":"When he began his trade war, President Donald Trump said his goal was to bring American jobs and manufacturing back to the US, reduce trade deficits and create a more level playing field for American companies competing globally. \n\nBut after months of negotiations and many countries' refusal to meet America's demands, his strategy has taken a more punitive turn.\n\nUS companies have been here before. \n\nUnder Trump's first administration, when he imposed tariffs on Chinese exports, they scrambled to limit their exposure to Beijing, with many shifting production to Vietnam, Thailand and India to avoid higher levies. \n\nBut his battery of new tariffs does not spare any of these economies. Stocks saw a sell-off, with benchmark indexes in Taiwan and South Korea in the red on Friday. \n\nBoth countries are central to Asia's sprawling electronics production. \n\nThe details are still hazy, but US firms from Apple to Nvidia will likely be paying more for their supply chains - they source critical components from several Asian countries and assemble devices in the region.\n\nNow they are on the hook - for iPhones, chips, batteries, and scores of other tiny components that power modern lives. \n\nIt's not good news for Asian economies that have grown and become richer because of exports and foreign investment - from Japanese cars to South Korean electronics to Taiwanese chips. \n\nSoaring demand for all these goods fuelled trade surpluses with Washington over the years - and has driven President Trump's charge that Asian manufacturing has been taking American jobs away. \n\nIn May, Trump told Apple CEO Tim Cook: \"We put up with all the plants you built in China for years... we are not interested in you building in India, India can take care of themselves.\"","url":"https://www.bbc.com/news/articles/c5ykd997kjjo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/9b47/live/67427cd0-6eb2-11f0-bc7d-5bb60edf943a.jpg","video":null,"publish_date":"2025-08-02 00:30:59","author":"Suranjana Tewari","authors":["Suranjana Tewari"],"language":"en","category":"politics","source_country":"gb","sentiment":0.004},{"id":347411460,"title":"After a blown deadline, what next for US-Canada trade?","text":"A self-imposed deadline for a new US-Canada trade deal came and went on Friday. So what happens next for these two deeply entwined neighbours?\n\nCanada and the US have been locked in a tariff war for six months and, despite talk of \"intense\" negotiations in recent weeks, a trade agreement remains elusive. \n\nBoth President Donald Trump and Prime Minister Mark Carney have poured cold water on the idea they will reach a quick, and tariff-free, deal. And Trump's open criticism of Canada's move to recognise a Palestinian state dashed hopes for a last minute agreement earlier this week.\n\nThe pessimism marks a shift in tone from as recently as June's G7 meeting, when the two leaders set themselves the summer deadline. \n\nCanadian negotiators have come to the conclusion that \"it's not the end of the world\" if a quick deal isn't reached and \"that quality over speed and a rushed agreement matters a lot\", said Fen Hampson, a professor of international affairs at Carleton University in Ottawa.\n\nCarney - who has been tight-lipped about the negotiation details - has said as much himself, repeating that just \"any deal\" won't do. \n\nStill, there are pressures on both sides to give businesses a reprieve. \n\nConservative leader Pierre Poilievre said on Friday he shares \"Canadians' disappointment\" that a deal was not reached by the deadline. He urged Carney's Liberals to do more to \"take back control of our economic future\". \n\nCanada is now facing a 35% tariff rate, though there is a carve out for goods compliant under a current free trade deal. American global tariffs on steel, aluminium, autos and auto parts are hurting, as the US is a top market for those sectors. \n\nThe Trump administration has justified those tariffs by claiming a lack of co-operation on stemming the flow of illicit drugs like fentanyl. Canada denies that, noting about 1% of US fentanyl imports originate in Canada. It has also brought in new border protections and a \"fentanyl czar\" in recent months in an effort to address Trump's concerns. \n\nThreatened tariffs on copper and the expected end of a global tariff exemption used by shoppers of goods under $800 could also pinch.\n\nCanada has responded with C$60bn ($43.3bn; £32.3bn) in counter tariffs on various American goods - the only country along with China to directly retaliate against Trump.\n\n\"It comes as no surprise that businesses are craving certainty after months and months of tumultuous announcements,\" said Catherine Fortin-Lefaivre, vice-president of international policy and global partnership at the Canadian Chamber of Commerce. \n\n\"But at the same time, they're not craving certainty at the expense of a really bad deal.\"","url":"https://www.bbc.com/news/articles/ckgjrm74lvno","image":"https://ichef.bbci.co.uk/news/1024/branded_news/f4e1/live/89eaf7a0-6c7b-11f0-af20-030418be2ca5.jpg","video":null,"publish_date":"2025-08-02 00:30:59","author":"Jessica Murphy","authors":["Jessica Murphy"],"language":"en","source_country":"gb","sentiment":-0.324},{"id":347415452,"title":"D.C. Officer Connected to Proud Boys Leader Sees Sentencing Delayed","text":"The former Washington, D.C., police officer who alerted the national chairman of the Proud Boys about his imminent arrest prior to organizing the group’s involvement in the Jan. 6 attack on the U.S. Capitol has achieved a significant triumph from the judge presiding over his case, who has subsequently instructed federal officials that he should not be labeled with a “domestic terrorism” tag.\n\nAs Law&Crime has previously reported, Shane Lamond, who previously led the Metropolitan Police Department’s Intelligence Branch, was found guilty in December of obstructing justice and lying to investigators in connection with the investigation into Proud Boys leader Enrique Tarrio’s imminent arrest for the December 2020 destruction of a Black Lives Matter banner at a historic Washington, D.C., church.\n\nU.S. District Judge Amy Berman Jackson sentenced Lamond in June to 18 months in prison.\n\nOn Friday — the day Jackson had directed Lamond to commence his sentence — Lamond’s legal team submitted a motion requesting Jackson to clarify her decision. The submission was prompted, as per the lawyers, by the realization that Lamond had been assigned to serve his sentence at Federal Correctional Institute (FCI) Atlanta, rather than a “low security camp” which, according to Lamond and the Bureau of Prisons (BOP), is the suitable location for him to serve his time, given his status as a “non-violent first offender.”\n\nThe motion outlined that the rationale for assignment to FCI Atlanta was due to Lamond’s conviction being associated with the Jan. 6 attack on the U.S. Capitol, and that the BOP had a policy of categorizing Jan. 6 crimes as “domestic terrorism” — an enhancement that would disqualify him from being sent to a lower security facility.\n\nConsequently, Lamond’s lawyers stated, the former police officer was facing the possibility of being sent to a prison that typically accommodates individuals “convicted of more serious crimes” than Lamond — and where, “[a]s a law enforcement officer, he is at a heightened risk of being victimized in prison.”\n\nThe defense lawyers asked the judge to help send Lamond to a lower-security facility by sending a clear message to the BOP.\n\n“[Lamond] requests that the Court issue a specific recommendation to BOP that makes clear that Mr. Lamond is not affiliated or associated with January 6 itself, and that he should not receive any enhancement for domestic terrorism or any other BOP enhancement applicable to January 6th defendants,” the motion said.\n\nLamond’s attorneys offered suggested language that Jackson could use:\n\nIdeally, this language would be included in the judgment itself under the heading “Imprisonment” and recommend that Mr. Lamond be designated to “the camp at FCI Cumberland or another camp as close to family as possible, but that he not receive any enhancement for domestic terrorism nor any other BOP enhancement applicable to January 6th defendants, because Mr. LAMOND IS NOT AFFILIATED OR ASSOCIATED WITH JANUARY 6th.”\n\nThe defendant also asked for a two-month extension on the deadline for him to report to the BOP to begin serving his sentence.\n\nThe motion noted that federal prosecutors did not oppose the reporting delay and didn’t “take a position on the request recommendation.”\n\nOn Friday, Jackson, a Barack Obama appointee, granted both of Lamond’s requests.\n\n“To the extent this is necessary, the Court hereby clarifies, at the defendant’s request, that defendant was NOT convicted of a January 6 offense, and that his conviction is not based on any events that occurred that day or any actions by him that could qualify as ‘domestic terrorism,'” Jackson wrote in her order Friday. She added that this “should be clear” from a review of the indictment, both parties’ sentencing memos, and the transcript of Jackson’s own verdict.\n\n“Given the need to address the designation issue with the BOP, the defendant’s motion to extend the latest report date up to October 1, 2025 will also be granted,” Jackson’s order added.\n\nLamond, who federal prosecutors said was “acting as a double agent” to help the Proud Boys, was convicted in a seven-day bench trial in which Jackson found that the retired police officer was leaking confidential information to Tarrio. In September 2023, Tarrio was sentenced to more than two decades behind bars for his role in the Jan. 6 attack on the U.S. Capitol.\n\nIn January 2025, that sentence evaporated after President Donald Trump issued a sweeping grant of clemency for those who participated in the violent chaos at the Capitol that day.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: Washington Metropolitan Police Department Lt. Shane Lamond exits federal court after&#8230;\n\n\nThis Post: D.C. Officer Connected to Proud Boys Leader Sees Sentencing Delayed first appeared on Internewscast Journal","url":"https://internewscast.com/crime/d-c-officer-connected-to-proud-boys-leader-sees-sentencing-delayed/","image":"https://internewscast.com/wp-content/uploads/2025/08/DC-cop-linked-to-Proud-Boys-leader-gets-sentence-reprieve.jpg","video":null,"publish_date":"2025-08-02 00:30:33","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.382},{"id":347411662,"title":"Trump slaps 25% tariff on all Indian goods; exports worth $85 billion at risk","text":"The US has imposed an across-the-board 25% tariff on all Indian-origin goods, effective August 7, along with penal duties on scores of other countries. The duties range from 10% to 41%. India’s competitors, including Pakistan, Vietnam, Bangladesh and Turkey, were levied lower tariffs of 15-20%. The steep duty could hurt nearly half of India’s exports of more than $85 billion to the US. This measure, part of a new executive order issued by US President Donald Trump on July 31, places India among the most harshly treated countries in the new tariff regime, of fering no product-level exemptions even for sectors deemed critical, such as pharmaceuticals, energy and electronics. Crucially, the order mentions that tariffs may be reduced once countries do a deal with the US. India and the US are currently in negotiations over a trade accord. Indian government officials played down the measure’s impact and added that New Delhiwill not be pressured into giving any duty exemptions on agricultural, dairy and genetically modified (GM) products in trade pacts. “The impact (of the tariff) will not be very big. More than half of India's exports to the US are expected to remain unimpacted. Due to the Section 232 exemption of the US, exports worth about $40 billion would be impacted with these tariffs,” said an official.Live EventsTrump has been intensifying his rhetoric against India in the past few days. New Delhi, though, has said it will take all necessary steps to safeguard its national interest, besides pointing out that the country’s economy—the fastest-growing major one —was a bright spot amid global uncertainty.No Adverse Effects: OfficialsMost Indian goods, such as pharma and electronic goods, are already in the exemption category of the US and would not attract any duty, he added.Officials said the tariffs will not have any adverse effect on the economy and India will not come under pressure. “The GDP loss likely to be less than 0.2% in the worst case scenario. Exports may fall slightly, but most of the goods exported to the US will not be subject to tariffs,” said the official.“India is giving top priority to its interests, There will be no compromise on agriculture, dairy, GM crops… (considering) religious sentiments. There will be no compromise on non-veg milk and beef,” said another official. “No adverse effect will be allowed on the interests of Indian farmers.” Commerce and industry minister Piyush Goyal will meet exporters from textiles, engineering, pharmaceuticals, steel, IT and chemicals, from August 2-3 in Mumbai to discuss the implications of the 25% tariff. Similar stakeholder consultations would be held in New Delhi the next week.Exporters have been seeking immediate rollout of Interest Equalisation Scheme for pre- and postshipment export credit, and market support for goods meant for the US. The government should absorb some of the cost disabilities due to the tariffs, said the Federation of Indian Export Organisations (FIEO).“We expect $45-47 billion of exports to get impacted by this move,” said Ajay Sahai, director general of FIEO. The US was India’s largest export destination in FY25, with shipments valued at $87 billion, accounting for about a fifth of the $437 billion total.Bilateral TalksIndia and the US have been negotiating a bilateral trade agreement (BTA) since March and aim to conclude the first tranche of talks by October. The US has been pressuring India to allow farm, dairy and GM imports as part of the pact. So far, five rounds of talks have been completed. The sixth round of talks will be held from August 25.The official cited earlier insisted that animal feed is used in the dairy sector in the US, and that New Delhi has never given any duty concessions in any of its earlier trade pacts on its imports. “There are religious sentiments… so it is not acceptable,” the person said. “There will be no compromise on these segments in any of India's trade pacts.”Another official said that certain segments, such as gems and jewellery, will not be impacted much as these are region-specific. “If American consumers buy jewellery which is made in Rajasthan, then that demand would not get impacted much,” the official added.Exporters said that the new order puts India at a disadvantage relative to some of its rivals that face lower tariffs. Trump has also threatened an unspecified penalty levy to be imposed on India for doing business with Russia. “The implications of the recent development are being examined. The ministry of commerce and industry is engaged with all stakeholders, including exporters and industry for taking feedback of their assessment of the situation,” commerce and industry minister Piyush Goyal said in his statement in Parliament on Thursday.Executive OrderAs per the order, countries have been subject to tariffs ranging from 10% to over 41% with differential rates based on geopolitical risk, economic alignment, and trade volume. “Many trading partners have been constructive, bold, and visionary in their commitment to this fundamental change initiated by the President,” US Trade Representative Jamieson Greer said on the executive order. “This new trading system will lower the US trade deficit and lead to better outcomes for American workers, their families, and their communities. In the coming weeks, this new system will begin to take shape, as the Trump administration works with trading partners on a common path to shared prosperity.”The EU has been granted a special concession. If the existing US most favoured nation tariff on an EU product is below 15%, total tariff will rise to 15%. However, if the MFN tariff is already 15% or higher, no additional duty will be charged. Those that have been hit by the highest Trump tariffs are Iraq and Serbia (35%), Switzerland (39%), Laos and Myanmar (40%), and Syria (41%).(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumpcommerceindiaIndian goods\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumpcommerceindiaIndian goods(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"The United States has levied high tariffs on India, potentially affecting a significant portion of Indian exports. This move places India among the most heavily penalized nations under the new tariff regime. Ongoing trade negotiations between India and the US aim to address these concerns. The Indian government downplays the impact, emphasizing its commitment to protecting national interests.","url":"https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-slaps-25-tariff-on-all-indian-goods-exports-worth-85-billion-at-risk/articleshow/123050948.cms","image":"https://img.etimg.com/thumb/msid-123050955,width-1200,height-630,imgsize-61860,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-02 00:30:00","author":"Us President Donald","authors":["Us President Donald"],"language":"en","source_country":"in","sentiment":-0.241},{"id":347414442,"title":"Hulk Hogan 'devastated' by boos during final WWE appearance (Entertainment)","text":"Hulk Hogan was \"devastated\" when he was booed by the crowd during his final WWE appearance before his death.\n\nThe wrestler - real name Terry Bollea - passed away on July 24 at the age of 71 just six months after he took to the stage at the Intuit Dome in Inglewood, California in January to make a guest appearance in Netflix's WWE series Raw - and now his his longtime friend and manager Jimmy Hart has revealed Hogan was surprised by the negative reaction from the crowd and it \"bothered him\".\n\nDuring an appearance on the Stories With Brisco and Bradshaw podcast, Jimmy explained: \"We go out and we had a mixed reaction. You can have 500 people cheering you and one person booing you, but I’ll be darned if that one person doesn’t outshine [the people cheering].\n\n\"It’s a mixed reaction, but it’s a little bit more boos than anything. That devastated him.\"\n\nJimmy suggested the crowd's reaction was linked to Hogan's support for US President Donald Trump after previously appearing at the Republican National Convention last year to back the reality star's to return to the White House.\n\nHe added: \"We got in the back and he said: ‘What do you think happened?’ I said: 'Hulk, it’s simple, blue state, red state. Boom' ...\n\n\"But that bothered him because of that ... Then the next week we’re in Texas, and it’s all cheers, you know, but that always bothered him. It sure did.\"\n\nHogan's appearance at the event was part of the celebrations marking WWE's move to Netflix and he was seen ignoring the jeers and telling the crowd: \"In the past, I’ve had a whole bunch of partners down the line.\n\n\"I had incredible partners, like the Macho Man Randy Savage. I’ve had giant-sized partners like Andre the Giant.\n\n\"But the greatest partner the WWE has ever had, is the fact that tonight, we’re making history, and the WWE has tag teamed up with Netflix, the greatest tag team partner of all time.\"\n\nHogan died in July after suffering an acute myocardial infarction - more commonly known as a heart attack - and documents obtained by the New York Post newspaper's Page Six column also revealed he had secretly battled cancer in the past.\n\nThe publication reported Hogan had a history of chronic lymphocytic leukaemia (CLL), a type of cancer affecting white blood cells, though this was never made public.","summary":"Hulk Hogan was &amp;quot;devastated&amp;quot; when he was booed by the crowd during his final WWE appearance before his death.  The wrestler - real name Terry Bollea - passed away on July 24 at the age of 71 just six months after he took to the stage at the Intuit Dome in Inglewood, California in January to...","url":"https://www.castanet.net/news/Entertainment/564624/Hulk-Hogan-devastated-by-boos-during-final-WWE-appearance","image":"https://www.castanet.net/content/2025/8/bang_111365_p.jpg","video":null,"publish_date":"2025-08-02 00:26:00","author":"BANG Showbiz","authors":["BANG Showbiz"],"language":"en","category":"entertainment","source_country":"ca","sentiment":-0.224},{"id":347414438,"title":"Sean 'Diddy' Combs' lawyer has 'no idea' about Donald Trump pardon speculation (Entertainment)","text":"Sean 'Diddy' Combs' lawyer Marc Agnifilo has \"no idea\" about speculation that US President Donald Trump could pardon the rapper.\n\nIt was reported by Deadline earlier this week that the White House chief is \"seriously considering\" issuing a full presidential pardon to the disgraced star — who was convicted on two counts of transportation to engage in prostitution last month and could face up to 20 years in prison.\n\nAgnifilo told Variety: \"I am not involved in that in the least. I have literally no idea. There are times I think there's nothing to it, and there are times I think it's just rumour mill stuff. But, I do not purport to know the President's mind. I really don't know.\"\n\nThe lawyer insists that a pardon isn't part of his legal strategy in the case.\n\nHe said: \"My end of the business is very focused on the case alone - and the merit of the case and what happened in the courtroom. I don't do anything else.\"\n\nAgnifilo filed a motion earlier this week calling for Diddy's conviction on the two counts to be overturned as he doesn't feel that that 55-year-old rapper - who was acquitted of sex trafficking and racketeering charges in his trial - has violated the Mann Act.\n\nHe said: \"Sean Combs has basically been convicted for using the services of a sex worker, and that's just not really prosecuted anymore. The Mann Act is not supposed to be applied to the user of prostitution services... It's supposed to be used for people who make money from the business of prostitution.\"\n\nThe lawyer continued: \"We've now had the time to review hundreds of Mann Act cases over several decades, and so our letter we submitted this week is based on all of that work, which hadn't been done during the trial because there's just no reason to do it.\n\n\"The trial is about guilt or innocence, not about how the Mann Act applies historically.\"\n\nDiddy has been imprisoned at the Metropolitan Detention Center in Brooklyn since his arrest last September and Agnifilo says that the star is missing his seven children as he awaits his sentencing on October 3.\n\nThe legal representative said: \"He misses his kids. He's learned a lot. His time in jail - nearly 11 months now - has given him the ability to reflect and consider his life and look at all the blessings he's been given: his seven children, the fact that he's still close with the mothers of his children, the life he's been given.\n\n\"His view is: 'Have I lived up to the blessings I've been given?' And I think his conclusion is: 'Not in every aspect have I lived up to those blessings.'\n\n\"What he wants to do when he gets out is to start small. He wants to spend time with his children and get reacquainted with his old life.\"\n\nAgnifilo claims that the I'll Be Missing You hitmaker \"hasn't been outside\" since his imprisonment.\n\nThe lawyer said: \"He hasn't been outside since September. He hasn't had sun on his skin. It's like a sort of sensory deprivation. The light's always the same, it's artificial light, there's no breeze, there's no wind, there's very little change in temperature. So, he wants to get out and be with his family.\"","summary":"Sean 'Diddy' Combs' lawyer Marc Agnifilo has &amp;quot;no idea&amp;quot; about speculation that US President Donald Trump could pardon the rapper.  It was reported by Deadline earlier this week that the White House chief is &amp;quot;seriously considering&amp;quot; issuing a full presidential pardon to the disgrace...","url":"https://www.castanet.net/news/Entertainment/564623/Sean-Diddy-Combs-lawyer-has-no-idea-about-Donald-Trump-pardon-speculation","image":"https://www.castanet.net/content/2025/8/bang_111375_p.jpg","video":null,"publish_date":"2025-08-02 00:26:00","author":"BANG Showbiz","authors":["BANG Showbiz"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.494},{"id":347415992,"title":"Trump orders nuclear submarines moved after Russian 'provocative statements'","text":"U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in \"the appropriate regions\" in response to remarks from former Russian President Dmitry Medvedev about the risk of war between the nuclear-armed adversaries.\n\nSecurity analysts called Trump's move a rhetorical escalation with Moscow, but not necessarily a military one, given that the United States already has nuclear-powered submarines that are deployed and capable of striking Russia.\n\nMedvedev on Thursday said Trump should remember that Moscow possessed Soviet-era nuclear strike capabilities of last resort, after Trump had told Medvedev to \"watch his words.\"\n\n\"Based on the highly provocative statements of the Former President of Russia, Dmitry Medvedev ... I have ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that,\" Trump said in Friday's social media post.\n\nHe added: \"Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.\"\n\nAsked later by reporters why he ordered the submarine movement, Trump said: \"A threat was made by a former president of Russia, and we're going to protect our people.\"\n\nThe U.S. Navy and the Pentagon declined to comment about Trump's remarks or on whether submarines had been moved. It is extremely rare for the U.S. military to discuss the deployment and location of U.S. submarines given their sensitive mission in nuclear deterrence.\n\nTrump's comments came at a time of mounting tension between Washington and Moscow as Trump grows frustrated with what he sees as President Vladimir Putin's failure to negotiate an end to his more than three-year-old invasion of Ukraine.\n\nHe did not specify what he meant by \"nuclear submarines.\" U.S. military submarines are nuclear-powered and can be armed with nuclear-tipped missiles, although not all are.\n\nBut any talk by a U.S. president about potential nuclear military capabilities raises concerns, the security experts said, noting that the United States has historically refrained from matching Russia's nuclear-saber rattling given the risks surrounding the world's most devastating weaponry.\n\n\"This is irresponsible and inadvisable,\" said Daryl Kimball, executive director of the Arms Control Association advocacy group. \"No leader or deputy leader should be threatening nuclear war, let alone in a juvenile manner on social media.\"\n\nHans Kristensen of the Federation of American Scientists noted that U.S. nuclear submarines – part of the so-called nuclear triad with bombers and land-based missiles – were always positioned to launch nuclear-armed missiles at targets in Russia.\n\n\"The subs are always there all the time and don't need to be moved into position,\" he said. \"He grants Medvedev a response to these crazy statements.\"\n\nThe United States has a total of 14 Ohio Class nuclear-powered submarines, each capable of carrying up to 24 Trident II D5 ballistic missiles that can deliver multiple thermonuclear warheads up to 4,600 miles.\n\nBetween 8 and 10 Ohio Class submarines are deployed at any one time, according to the Nuclear Threat Initiative arms control group.\n\n'COMMITMENT TRAP'\n\nMedvedev, deputy chairman of Russia's Security Council, has emerged as one of the Kremlin's most outspoken anti-Western hawks since Russia sent tens of thousands of troops into Ukraine in 2022. Kremlin critics deride him as an irresponsible loose cannon, though some Western diplomats say his statements illustrate the thinking in senior Kremlin policy-making circles.\n\nU.S. officials had told Reuters prior to Trump's latest remarks that Medvedev's comments were not being taken as a serious threat, and it is unclear what drove Trump's latest announcement beyond the public clash between the two on social media.\n\nTrump and Medvedev have traded taunts in recent days after Trump on Tuesday said Russia had \"10 days from today\" to agree to a ceasefire in Ukraine or be hit with tariffs.\n\nKristensen said that Trump was creating a \"commitment trap\" by fueling expectations that he could resort to nuclear weapons if tensions escalated further with Russia.\n\nStill, Evelyn Farkas, executive director of the McCain Institute and a former senior Pentagon official, played down the idea that this could lead to nuclear conflict.\n\n\"It's really signaling. It's not the beginning of some nuclear confrontation and nobody reads it as such. And I would imagine the Russians don't either,\" she said.\n\nShe added that Trump's actions, however, were unlikely to get Russia to change course in Ukraine.\n\nMoscow, which has set out its own terms for peace in Ukraine, has given no indication that it will comply with Trump's 10-day deadline of August 8.\n\nPutin said on Friday that Moscow hoped for more peace talks but that the momentum of the war was in its favor. He made no reference to the deadline.\n\nTrump, who in the past touted good relations with Putin, has expressed mounting frustration with the Russian leader, accusing him of \"bullshit\" and describing Russia's latest attacks on Ukraine as disgusting.\n\n© Thomson Reuters 2025.","summary":"U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in &quot;the appropriate regions&quot; in response to remarks from former Russian President…","url":"https://japantoday.com/category/world/trump-orders-nuclear-submarines-moved-after-russian-%27provocative-statements%271","image":"https://media.japantoday.com/img/store/77/7e/7b51b78d72a7f4bfd54635f9bba8c008d31e/tag-reuters/_w1700.jpeg","video":null,"publish_date":"2025-08-02 00:22:42","author":"Japan Today Editor,Phil Stewart","authors":["Japan Today Editor","Phil Stewart"],"language":"en","category":"politics","source_country":"jp","sentiment":0.117},{"id":347417192,"title":"Brazil is preparing response to US tariffs — Lula da Silva","text":"RIO DE JANEIRO, August 2. /TASS/. The Brazilian government was ready for a dialogue with the United States but is working now to respond appropriately to 50% tariffs set by the White House for certain goods since August 1, President Luiz Inacio Lula da Silva said.\n\n\"We have always been open for a dialogue,\" the head of state wrote on his page in the X. \"We are working now to respond to the US tariff measures,\" Lula da Silva said. Only citizens and institutions of Brazil have the right to determine the country’s path, including the relations with the United States, he added.\n\nUS President Donald Trump announced 50% tariffs on imports of Brazilian goods since August 1, having explained this measure by the need to overcome the trade deficit. Lula da Silva vowed to introduce tit-for-tat tariffs if Washington does not reconsider its decision. The leader of Brazil expressed hope later that the Brazilian delegation will be able to achieve the revision of tariffs through negotiations.","summary":"\"We have always been open for a dialogue,\" the head of state wrote on his page in the X","url":"https://tass.com/world/1997333","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-02 00:22:08","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.164},{"id":347414444,"title":"Trump orders US nuclear subs repositioned over statements from ex-Russian leader Medvedev (World)","text":"In a warning to Russia, President Donald Trump said Friday he's ordering the repositioning of two U.S. nuclear submarines “based on the highly provocative statements” of the country's former president, Dmitry Medvedev, who has raised the prospect of war online.\n\nTrump posted on his social media site that, based on the “highly provocative statements” from Medvedev, he had “ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that.”\n\nThe president added, “Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.”\n\nIt wasn’t clear what impact Trump’s order would have on U.S. nuclear subs, which are routinely on patrol in the world’s hotspots, but it comes at a delicate moment in the Trump administration's relations with Moscow.\n\nTrump has said that special envoy Steve Witkoff is heading to Russia to push Moscow to agree to a ceasefire in its war with Ukraine and has threatened new economic sanctions if progress is not made. He cut his 50-day deadline for action to 10 days, with that window set to expire next week.\n\nThe post about the sub repositioning came after Trump, in the wee hours of Thursday morning, had posted that Medvedev was a “failed former President of Russia” and warned him to “watch his words.” Medvedev responded hours later by writing, “Russia is right on everything and will continue to go its own way.”\n\nAnd that back-and-forth started earlier this week when Medvedev wrote, “Trump’s playing the ultimatum game with Russia: 50 days or 10” and added, “He should remember 2 things: 1. Russia isn’t Israel or even Iran. 2. Each new ultimatum is a threat and a step towards war. Not between Russia and Ukraine, but with his own country.”\n\nAsked as he was leaving the White House on Friday evening for a weekend at his estate in New Jersey about where he was repositioning the subs, Trump didn’t offer any specifics.\n\n“We had to do that. We just have to be careful,” he said. “A threat was made, and we didn’t think it was appropriate, so I have to be very careful.”\n\nTrump also said, “I do that on the basis of safety for our people” and “we’re gonna protect our people.” He later added of Medvedev, “He was talking about nuclear.”\n\n“When you talk about nuclear, we have to be prepared,” Trump said. “And we’re totally prepared.”\n\nMedvedev was Russia's president from 2008 to 2012, while Vladimir Putin was barred from seeking a third consecutive term, and then stepped aside to let him run again.\n\nNow deputy chairman of Russia’s National Security Council, which Putin chairs, Medvedev has been known for his provocative and inflammatory statements since the start of the war in 2022. That's a U-turn from his presidency, when he was seen as liberal and progressive.\n\nMedvedev has frequently wielded nuclear threats and lobbed insults at Western leaders on social media. Some observers have argued that with his extravagant rhetoric, Medvedev is seeking to score political points with Putin and Russian military hawks.\n\nOne such example before the latest spat with Trump came on July 15, after Trump announced plans to supply Ukraine with more weapons via its NATO allies and threatened additional tariffs against Moscow. Medvedev posted then, “Trump issued a theatrical ultimatum to the Kremlin. The world shuddered, expecting the consequences. Belligerent Europe was disappointed. Russia didn’t care.”","summary":"In a warning to Russia, President Donald Trump said Friday he's ordering the repositioning of two U.S. nuclear submarines 'based on the highly provocative statements' of the country's former president, Dmitry Medvedev, who has raised the prospect of war online. Trump posted on his social media site ...","url":"https://www.castanet.net/news/World/564619/Trump-orders-US-nuclear-subs-repositioned-over-statements-from-ex-Russian-leader-Medvedev","image":"https://www.castanet.net/content/cp/2025/8/d8856e020e1acee370bee4c0545a82a1e975188cfbef1023a136a26e270a1442.jpg","video":null,"publish_date":"2025-08-02 00:22:00","author":"The Canadian Press,Will Weissert","authors":["The Canadian Press","Will Weissert"],"language":"en","category":"politics","source_country":"ca","sentiment":0.039},{"id":347410100,"title":"India Aghast at Donald Trump’s ‘Dead’ Economy Jibe, 25% Tariffs","text":"This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Use and Privacy Policy.","summary":"Shock, dismay and angst swept across India as businesses, policymakers and citizens digested US President Donald Trump’s sharp remarks and a surprise 25% tariff rate earlier this week.","url":"https://financialpost.com/pmn/business-pmn/india-aghast-at-donald-trumps-dead-economy-jibe-25-tariffs","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/776284216.jpg","video":null,"publish_date":"2025-08-02 00:18:15","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","category":"politics","source_country":"ca","sentiment":0.639},{"id":347412132,"title":"Federal Reserve Governor Kugler resigns, giving Trump key vacancy to fill","text":"The Federal Reserve announced Friday that governor Adriana Kugler will step down next week, opening up a spot on the central bank's powerful board that President Donald Trump will be able to fill.\n\n Kugler, who did not participate in the Fed's policy meeting earlier this week, would have completed her term in January. Instead, she will retire August 8. She did not provide a reason for stepping down in her resignation letter.\n\n Trump has continued his attacks on the Fed since chair Jerome Powell said Wednesday that the central bank would keep its short-term interest rate unchanged. Powell also said the Fed could take months to evaluate the impact of tariffs on the economy before deciding to cut rates, as Trump has demanded.\n\n Powell is “a stubborn MORON, must substantially lower interest rates, NOW,\" Trump posted early Friday morning, before the monthly jobs report was released. That report showed hiring slowed in July and was much lower in May and June than had been initially reported.\n\n Kugler was appointed to the Fed's seven-member board of governors by former President Joe Biden in September 2023. She was the first Hispanic Fed governor, and prior to joining the Fed, was a professor at Georgetown University and was the U.S. representative to the World Bank. She will return to the Georgetown faculty in the fall.\n\nKugler reflects on tenure, will return to Academia\n\n “I am proud to have tackled this role with integrity, a strong commitment to serving the public, and with a data-driven approach strongly based on my expertise in labour markets and inflation,” she said in her resignation letter.\n\n In her last speech as a Fed governor two weeks ago, Kugler expressed support for Powell's view that the central bank should keep rates unchanged while officials monitor the economy to see how Trump's tariffs affect inflation and the economy.\n\n Trump, meanwhile, has said he will appoint Fed officials who favour cutting rates.\n\nPowell’s post-2026 role remains unclear\n\n One complication is that Powell's term as chair ends in May 2026. But his position on the Fed's governing board lasts through January 2028. As a result, he could stay on the board even after stepping down as chair, and simply remain as one of seven governors.\n\n There is some precedent for such a step: Marriner Eccles, who served as Fed chair in the 1930s, remained on the board after completing his term as chair.\n\n If Powell took such a step, that would mean whomever the Trump administration chose to replace Kugler could then be elevated to chair after Powell finishes as chair in May 2026. In other words, to get their choice of Fed Chair in 2026, the Trump White House may choose to appoint that person to replace Kugler as governor, and then elevate them to Fed chair in May 2026.\n\n Powell has declined to answer at the last two press conferences whether he will leave the board when he is done as chair. \n\nPublished on August 2, 2025","summary":"Adriana Kugler, the first Hispanic woman on the Fed’s board, was appointed by President Biden in 2023.","url":"https://www.thehindubusinessline.com/money-and-banking/federal-reserve-governor-kugler-resigns-giving-trump-key-vacancy-to-fill/article69885899.ece","image":"https://bl-i.thgim.com/public/incoming/vvzkf7/article69885900.ece/alternates/LANDSCAPE_1200/2025-07-18T100355Z_1174414465_RC2GWEAZJZ7G_RTRMADP_3_USA-FED-RATES.JPG","video":null,"publish_date":"2025-08-02 00:14:10","author":"President Biden","authors":["President Biden"],"language":"en","category":"politics","source_country":"in","sentiment":-0.451},{"id":347409970,"title":"Ex-Trump prosecutor faces Office of Special Counsel investigation and given stern warning","text":"The United States Office of Special Counsel appears set to give former federal prosecutor Jack Smith a taste of his own medicine, opening an investigation into his conduct. \n\nSmith resigned from his position in January after completing two criminal investigations into Donald Trump which he later said would've seen the president convicted of Conspiracy to Defraud the United States had he not won the election.\n\nNow, Smith faces an investigation into whether he was engaging in political activities during the investigation which would be a violation of the Hatch Act. \n\n'I appreciate the Office of Special Counsel taking this seriously and launching an investigation into Jack Smith's conduct,' wrote OSC Senior Counsel Charles Baldis in a letter obtained by The New York Post. He added a stern warning in the letter saying: 'No one is above the law.'\n\nThe Daily Mail has reached out to the White House for comment. \n\nArkansas Senator Tom Cotton - the chairman of the Senate Intelligence Committee - spurred the investigation by writing a letter to acting OSC Chairman Jamison Greer. \n\n'Jack Smith's legal actions were nothing more than a tool for the Biden and Harris campaigns. This isn't just unethical, it is very likely illegal campaign activity from a public office,' he wrote.\n\nCotton praised the decision to look into what Smith was doing in a statement. \n\n'Jack Smith's actions were clearly driven to hurt President Trump's election, and Smith should be held fully accountable,' he said.\n\nFollowing his resignation, Smith stood by his decision to bring charges against Trump and insisted he would have been convicted of Conspiracy to Defraud the United States had he not won the election for president in a bombshell January 6 report.\n\nIn a scathing statement issued along with the report, Smith admonished Trump for what he described as excessive lies and deceit to upend the American enterprise. \n\n'The throughline of all of Mr. Trump's criminal efforts was deceit - knowingly false claims of election fraud - and the evidence shows that Mr. Trump used these lies as a weapon to defeat a federal government function foundational to the United States' democratic process,' the report states. \n\nTrump quickly slammed the report in a Truth Social post. \n\n'Deranged Jack Smith was unable to successfully prosecute the Political Opponent of his 'boss,' Crooked Joe Biden, so he ends up writing yet another 'Report' based on information that the Unselect Committee of Political Hacks and Thugs ILLEGALLY DESTROYED AND DELETED, because it showed how totally innocent I was, and how completely guilty Nancy Pelosi, and others, were,' the post read.\n\nThe president-elect then followed it up with two more missives to his social media platform.\n\n'To show you how desperate Deranged Jack Smith is, he released his Fake findings at 1:00 A.M. in the morning. Did he say that the Unselect Committee illegally destroyed and deleted all of the evidence.'\n\nHe followed it up with his trademark: 'MAKE AMERICA GREAT AGAIN!'\n\nWith the prosecution foreclosed thanks to Trump's election victory, the 137-page document was expected to be the final Justice Department chronicle of the probes.\n\nSmith, who resigned after completing two criminal investigations, wrote to Attorney General Merrick Garland that he believed had Trump stood trial on the charges, he would have been convicted. \n\n'The department's view that the Constitution prohibits the continued indictment and prosecution of a president is categorical and does not turn on the gravity of the crimes charged, the strength of the government's proof or the merits of the prosecution, which the office stands fully behind,' Smith wrote.\n\n'Indeed, but for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,' he added. \n\nTrump called Smith 'a lamebrain prosecutor who was unable to get his case tried before the Election, which I won in a landslide. THE VOTERS HAVE SPOKEN!!!' \n\nSmith wrote the report, which was transmitted to Congress early Tuesday after a judge refused to block its release. It describes prosecutors' charging decisions in the case that resulted in Trump being indicted for taking a trove of national security documents to Mar-a-Lago. \n\nThey also include the decision to charge Trump with heading a conspiracy to overturn the 2020 election. \n\nThe document includes, for the first time, a detailed assessment from Smith about his investigation, as well as a defense by Smith against criticism by Trump and his allies that the investigation was politicized.\n\nThough Smith sought to salvage the indictment, the team dismissed it entirely in November because of longstanding Justice Department policy that says sitting presidents cannot face federal prosecution. \n\n'While we were not able to bring the cases we charged to trial, I believe the fact that our team stood up for the rule of law matters,' Smith continued. \n\n'I believe the example our team set for others to fight for justice without regard for the personal costs matters.'\n\nAnother 'significant challenge' was Trump's 'ability and willingness to use his influence and following on social media to target witnesses, courts, prosecutors,' which led prosecutors to seek a gag order to protect potential witnesses from harassment, Smith wrote.\n\n'Mr. Trump's resort to intimidation and harassment during the investigation was not new, as demonstrated by his actions during the charged conspiracies,' Smith wrote. \n\n'A fundamental component of Mr. Trump's conduct underlying the charges in the Election Case was his pattern of using social media - at the time, Twitter - to publicly attack and seek to influence state and federal officials, judges, and election workers who refused to support false claims that the election had been stolen or who otherwise resisted complicity in Mr. Trump's scheme,' he added. \n\nSmith also for the first time explained the thought process behind his team’s prosecution decisions, writing that his office decided not to charge Trump with incitement in part because of free speech concerns, or with insurrection because he was the sitting president at the time and there was doubt about proceeding to trial with the offense - of which there was no record of having been prosecuted before.\n\nThe special counsel brought a superseding indictment in the January 6th case that narrowed the case after the Supreme Court issued issued its summer decision giving presidents presidential immunity from prosecution for official acts while in office.\n\nTrump was charged with willful retention of classified documents at Mar-a-Lago, in a case Cannon dismissed this summer that was on appeal when Trump won the November election. \n\nTrump's team previously argued that the report, under DOJ regulations, merely spews 'conspiracy theories,' and say it is unfair to release it, saying it violates his presumption of innocence. Trump, meanwhile, has continued to attack Smith publicly.\n\nThe DOJ said the volume on the classified documents case would be provided to key members of Congress for both parties for private review in redacted form. \n\n'This limited disclosure will further the public interest in keeping congressional leadership apprised of a significant matter within the Department while safeguarding defendant´s interests,' DOJ wrote.\n\nOnce Trump took office on January 20, his own Justice Department got to make determinations on whether the report on the classified documents case ever gets released. Trump has repeatedly called the prosecutions against him 'witch hunts.'\n\nHe appointed loyalist former Florida AG Pam Bondi to lead the agency.","summary":"The Office of Special Counsel will look into the former federal prosecutor, saying that 'no one is above the law.'","url":"https://www.dailymail.co.uk/news/article-14964313/Trump-prosecutor-faces-Office-Special-Counsel-investigation.html","image":"https://i.dailymail.co.uk/1s/2025/08/02/01/100861499-0-image-m-13_1754092986062.jpg","video":null,"publish_date":"2025-08-02 00:13:13","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.175},{"id":347412186,"title":"Ex-Trump Commissioner Warns of 'Dangerous Precedent' After New Firing","text":"President Donald Trump's firing of Dr. Erika McEntarfer, U.S. Bureau of Labor Statistics (BLS) commissioner, was \"totally groundless\" and \"sets a dangerous precedent,\" warns William Beach, former bureau chief.Newsweek reached out to economic analysts via email for comment Friday.Why It MattersThe dismissal of McEntarfer by Trump has raised significant concerns among economists and former officials regarding the independence of the BLS and the integrity of federal economic data.The firing followed the release of bleak job figures for July, as Trump claimed the numbers were \"rigged,\" without providing evidence. The number of new jobs dipped well below even modest expectations, with only 73,000 positions added, compared to the Dow Jones estimate of 100,000.The firing coincided with a significant drop in U.S. stock markets. The Dow Jones Industrial Average lost 542 points (1.2 percent), the S&P 500 fell 1.6 percent and the Nasdaq composite dropped 2.2 percent. This downward movement was attributed to both weak job figures and a new round of U.S. tariffs announced by Trump.What To KnowTrump announced McEntarfer's firing on Truth Social Friday, also accusing her of manipulating data to benefit former Vice President Kamala Harris around the 2024 presidential election \"to try and boost Kamala's chances of Victory.\"Beach took to X, formerly Twitter, to voice his frustrations with Trump's decision, saying in part, \"The totally groundless firing of Dr. Erika McEntarfer, my successor as Commissioner of Labor Statistics at BLS, sets a dangerous precedent and undermines the statistical mission of the Bureau.\"He also attached a full statement, which in part added: \"Today, President Trump called into question the integrity of the Employment Situation report that the BLS released this morning. He accused BLS Commissioner Erika McEntarfer of deliberately reporting false numbers to reflect poorly on this administration. This baseless, damaging claim undermines the valuable work and dedication of BLS staff who produce the reports each month. This escalates the President's unprecedented attacks on the independence and integrity of the federal statistical system.\"Beach added that he and other Friends of BLS Co-Chairs are calling for Congress to investigate Dr. McEntarfer's removal and to \"respond immediately.\"Trump nominated Beach for commissioner in 2017.McEntarfer's tenure as BLS commissioner began following her 2024 Senate confirmation by an 86-8 vote after being nominated by former President Joe Biden. She previously held senior roles in the Treasury Department, White House Council of Economic Advisers and U.S. Census Bureau, her bio notes.What People Are SayingJustin Wolfers, professor of economics at the University of Michigan, posted to X on Friday: \"This is a remarkable — and brave — statement from the guy who was Trump's handpicked BLS Commissioner in Trump's first term.\"Representative Marcy Kaptur, an Ohio Democrat, posted to X on Friday: \"Firing the nonpartisan commissioner of Bureau of Labor Statistics just hours after a deeply worrying report showing serious job loss in manufacturing is what you'd expect in a Banana Republic. Dr. McEntarfer is nonpartisan, and was confirmed with 86 bipartisan votes. This is no way to run a nation.\"What Happens NextIt is immediately unclear who will replace McEntarfer. Trump said in his post on Truth Social that \"She will be replaced with someone much more competent and qualified.\"","summary":"The removal followed the release of bleak job figures as Trump accused the numbers of being \"rigged.\"","url":"https://www.newsweek.com/ex-trump-commissioner-warns-dangerous-precedent-after-new-firing-2107884","image":"https://d.newsweek.com/en/full/2695303/donald-trump.jpg?w=1600&h=900&q=88&f=dae03f49e91a4c1a16d167dba6903acf","video":null,"publish_date":"2025-08-02 00:09:24","author":"Anna Commander","authors":["Anna Commander"],"language":"en","source_country":"US","sentiment":-0.207},{"id":347415994,"title":"Kyiv mourns after deadliest attack in a year kills 31 people in Ukraine, including 5 children","text":"The Ukrainian capital Kyiv observed an official day of mourning Friday, a day after a Russian drone and missile attack on the city killed 31 people, including five children, and injured more than 150, officials said.\n\nThe youngest victim in Thursday’s strikes was 2 years old, and 16 of the injured were children, Ukrainian President Volodymyr Zelenskyy said.\n\nIt was the highest number of children killed and injured in a single attack on Kyiv since aerial attacks on the city began in October 2022, according to official casualty figures reported by The Associated Press. It was also the deadliest attack on the city since July last year, when 33 were killed.\n\nThe death toll rose overnight as emergency crews continued to dig through rubble. The Russian barrage demolished a large part of a nine-story residential building in the city, while more than 100 other buildings were damaged, including homes, schools, kindergartens, medical facilities and universities, officials said.\n\nRussia has escalated its attacks on Ukrainian cities in recent months, ignoring calls from Western leaders including U.S. President Donald Trump to stop striking civilian areas after more than three years of war. The Russian tactic aims to spread terror and wear down public appetite for the war.\n\nRussian forces are also pressing on with their grinding war of attrition along the 1,000-kilometer (620-mile) front line, where incremental gains over the past year have come at the cost of thousands of soldiers on both sides.\n\nZelenskyy said that in July, Russia launched over 5,100 glide bombs, more than 3,800 Shahed drones, and nearly 260 missiles of various types, 128 of them ballistic, against Ukraine.\n\nHe repeated his appeal for countries to impose heavier economic sanctions on Russia to deter the Kremlin, as U.S.-led peace efforts have failed to gain traction.\n\n“No matter how much the Kremlin denies (sanctions’) effectiveness, they are working and must be stronger,” Zelenskyy said.\n\nHis comments Friday appeared to be a response to Trump’s remarks the previous day, when the Republican president said the U.S. plans to impose sanctions on Russia but added, “I don’t know that sanctions bother him,” in reference to Russian President Vladimir Putin.\n\nIn April, Trump urged the Russian leader to “STOP!” after an aerial attack on Kyiv killed 12 in what was the deadliest assault on the city since July 2024. “Lets get the Peace Deal DONE!” Trump said in a post on his Truth Social platform at the time, but Russia hasn't eased up on its barrages. Earlier this week, Trump gave Putin until Aug. 8 to stop the fighting.\n\nThose demands haven't persuaded the Kremlin to change strategy. Putin said Friday the conditions that Moscow set out last year for a long-term ceasefire agreement still stand. Putin has previously made it clear that he will only accept a settlement on his terms and will keep fighting until they’re met.\n\n“Any disappointments arise from excessive expectations,” Putin said of negotiations. He did not mention Trump by name.\n\nPutin said that he regards recent direct talks in Istanbul between delegations from Russia and Ukraine as valuable, even though they made no progress beyond exchanges of prisoners of war, and made no reference to next week's deadline imposed by Trump.\n\nIn what Ukrainians may see as an ominous note, Putin said that Russia has started production of its newest hypersonic missiles. The Oreshnik’s multiple warheads that plunge to a target at speeds up to Mach 10 and cannot be stopped by air defenses, he said.\n\nUkraine called for an urgent U.N. Security Council meeting to be convened Friday, Foreign Minister Andrii Sybiha said, in an effort to push Putin into accepting “a full, immediate and unconditional ceasefire.”\n\nMeanwhile, Ukrainian forces are under heavy pressure in the strategic hilltop city of Chasiv Yar, in the eastern Donetsk region where Russia is making a concerted push to break through defenses after some 18 months of fighting.\n\nZelenskyy said that Russian claims of capturing Chasiv Yar on Thursday were “disinformation.”\n\n“Ukrainian units are holding our positions,” Zelenskyy said in his daily video address on Thursday evening. “It is not easy, but it is the defense of Ukrainians’ very right to life.”\n\nEven so, the Institute for the Study of War said that Ukraine’s hold on the key city is weakening.\n\n“Russian forces will likely complete the seizure of Chasiv Yar in the coming days, which will open several possible avenues for Russian forces to attack Ukraine’s fortress belt — a series of fortified cities that form the backbone of Ukraine’s defensive positions” in the Donetsk region, the Washington-based think tank said.\n\nUkraine has tried to pressure the Russian army by striking rear areas with long-range drones that target rail networks, oil depots and arsenals.\n\nRussia’s Defense Ministry said Friday that air defenses shot down 60 Ukrainian drones overnight. More than half were destroyed over Russia’s Belgorod region on the country’s border with Ukraine, it said. Belgorod Gov. Vyacheslav Gladkov said that one person was injured.\n\nThe Ukrainian air force, meanwhile, said Friday it downed 44 out of 72 Russian drones fired overnight. There were no immediate reports of casualties or damage.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"The Ukrainian capital Kyiv observed an official day of mourning Friday, a day after a Russian drone and missile attack on the city killed 31 people, including five…","url":"https://japantoday.com/category/world/kyiv-mourns-after-deadliest-attack-in-a-year-kills-31-people-in-ukraine-including-5-children","image":"https://media.japantoday.com/img/store/c3/54/b1eba830fa535a04301166ecb8fb5839abe6/download/_w1700.jpeg","video":null,"publish_date":"2025-08-02 00:07:20","author":"Illia Novikov,Japan Today Editor","authors":["Illia Novikov","Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.019},{"id":347412152,"title":"Photos show how White House gardens have bloomed in years past -- and today","text":"Aug. 1 (UPI) -- On Friday, White House visitors in Washington, D.C., could better see the newly repaved Rose Garden.\n\nPresident Donald Trump has said the area needs a hard surface because press events and other occasions in the garden often can't accommodate all the visitors. He also has said that he wanted the Rose Garden to rival the gardens he has visited in Europe.\n\nIt's not the only structural changes implemented by Trump at the White House.\n\nIn June, Trump had two flagpoles installed at the White House and paid for the project himself.\n\nAnd this past month, the White House also announced that a ballroom would be built adjacent to the White House. Trump and other \"patriot donors\" have agreed to cover the cost to build it, the president said. That project is scheduled to begin next month.\n\nSee the UPI photos above for a look at how the White House gardens have changed over the years and through different presidencies.","summary":"White House visitors can now see the newly repaved Rose Garden. A series of UPI photos shows how the gardens have bloomed in the past and how they look today.","url":"https://www.upi.com/Top_News/US/2025/08/01/white-house-rose-garden-paved-over-upi-photos-2025/5811754088938/","image":"https://cdnph.upi.com/sv/ph/og/upi/5811754088938/2025/1/2edc3d4b9b9ccfd9d8d9d8c8030b0a6d/v1.5/Photos-show-how-White-House-gardens-have-bloomed-in-years-past-and-today.jpg","video":null,"publish_date":"2025-08-02 00:06:54","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.317},{"id":347417698,"title":"'Banana republic territory': Krugman says Trump's latest move follows dictator 'playbook'","text":"One of the foremost economists in the U.S. is now sounding the alarm over President Donald Trump's decision to fire the head of the United States' premier economic data institution over an unflattering jobs report.\n\nIn a Friday interview with MSNBC host Ari Melber, Paul Krugman — the former New York Times columnist who also won the Nobel Prize for Economic Sciences in 2008 — plainly warned that Trump's controversial move to fire Bureau of Labor Statistics (BLS) commissioner Erika McEntarfer puts the United States on the same path as authoritarian countries like Argentina and Venezuela.\n\nKrugman said that the sluggish July jobs report — which showed anemic growth of just 73,000 non-farm payroll jobs — wasn't a signal of a bad economy by itself, arguing that it's normal for jobs numbers to fluctuate month to month based on both internal and external circumstances. However, Krugman said that firing McEntarfer over the report was highly abnormal and will likely cause significant shock in financial markets.\n\nREAD MORE: 'Obsessed with propaganda': How Trump's 'temper tantrum' firing of BLS chief may backfire\n\n\"This agency, the Bureau of Labor Statistics, is not a household phrase. But it is absolutely critical. Basically, everything that we know about what's happening to the economy in the last couple of months comes from the BLS,\" Krugman said. \"... It's critical for all of us to understand what's happening, but also how the government itself makes decisions. It's how the Federal Reserve makes decisions. If you start to corrupt those numbers, if you start to report those numbers as being what makes the president look good instead of what's actually happening, then bad things start happening.\"\n\n\"If you ask me, how does someplace like Venezuela get to hyperinflation? How does someplace like Argentina get hyperinflation? ... they start ordering the statistical agencies to report nothing but puppies and rainbows,\" he continued. \"And so they go plunging ahead ... If they ever do admit that maybe we have a problem here, you're up at 80% inflation, right? This is the playbook. We've seen it many, many times. And now, I have to say faster even than I expected. It's come to America, right?\"\n\nAs Krugman mentioned, Argentina attempted to obscure inflation data following an economic crisis at the onset of the 21st century that led to inflation hitting 41%. As the University of California-Los Angeles' Anderson School of Management reported, the Argentinian government ended up firing the statistician in charge of calculating the Consumer Price Index and then made up numbers on the spot. Krugman opined that Trump's latest move is eerily similar.\n\n\"I don't think they're going to be producing fake numbers by next month, but they might be, and it's certainly where Trump wants them to go,\" Krugman told Melber. \"So we're going to be back in Argentina in the days when they were faking the statistics ... I mean, we are in banana republic territory now.\"\n\nREAD MORE: 'The cover-up is huge': Epstein survivor says Maxwell pardon would be 'ultimate betrayal'\n\nWatch the video of Krugman's segment below, or by clicking this link.\n\n - YouTube www.youtube.com","summary":"One of the foremost economists in the U.S. is now sounding the alarm over President Donald Trump's decision to fire the head of the United States' premier economic data institution over an unflattering jobs report.\n\nIn a Friday interview with MSNBC host Ari Melber, Paul Krugman — the former New York Times columnist who also won the Nobel Prize for Economic Sciences in 2008 — plainly warned that Trump's controversial move to fire Bureau of Labor Statistics (BLS) commissioner Erika McEntarfer puts the United States on the same path as authoritarian countries like Argentina and Venezuela.\n\nKrugman said that the sluggish July jobs report — which showed anemic growth of just 73,000 non-farm payroll jobs — wasn't a signal of a bad economy by itself, arguing that it's normal for jobs numbers to fluctuate month to month based on both internal and external circumstances. However, Krugman said that firing McEntarfer over the report was highly abnormal and will likely cause significant shock in financial markets.\n\nREAD ","url":"https://www.alternet.org/krugman-trump-dictator-playbook/","image":"https://www.alternet.org/media-library/image.jpg?id=61421428&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-08-02 00:05:15","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.11},{"id":347409958,"title":"Trump demands UK pharmaceutical giants to lower drug costs sparking fears NHS could pay the price if they refuse","text":"Donald Trump has demanded UK pharmaceutical giants lower prices for America and suggested charging others to make up the difference.\n\nHe said if they didn’t, the US would deploy ‘every tool in our arsenal’ to protect families from ‘continued abusive drug prices’, sparking fears the NHS will end up paying more.\n\nMr Trump suggested he would use tariffs to push through higher prices if countries resisted.\n\nIn May Mr Trump signed an executive order demanding drugmakers cut US medicine prices to match those abroad.\n\nYesterday in a letter to 17 pharma companies he said he expected them to deliver on measures by September 29.\n\nHe asked them to apply ‘most favoured nation’ pricing to Medicaid, the US health programme for people on low incomes.\n\nMr Trump also asked drugmakers to offer new medicines at the same price in the US as in other developed countries.\n\nHe said: ‘Our citizens pay massively higher prices than other nations pay for the same exact pill... subsidizing socialism aboard [abroad].’\n\nBritish pharma companies AstraZeneca and GSK were among the recipients. Others included Eli Lilly, Johnson & Johnson, Pfizer and Sanofi.\n\nThe UK Government said it would ‘continue to work closely with the US to get the best deal for our pharma industry and deliver mutual benefits for both our countries’.","summary":"He said if they didn't, the US would deploy 'every tool in our arsenal' to protect families from 'continued abusive drug prices'.","url":"https://www.dailymail.co.uk/news/article-14964329/Trump-demands-UK-pharmaceutical-giants-lower-costs-NHS.html","image":"https://i.dailymail.co.uk/1s/2025/08/02/00/98296785-0-President_Donald_Trump_signed_an_executive_order_that_would_dram-a-8_1754092588603.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/12/4808360372823999721/1024x576_MP4_4808360372823999721.mp4","publish_date":"2025-08-02 00:04:05","author":"Editor,Harriet Line","authors":["Editor","Harriet Line"],"language":"en","source_country":"gb","sentiment":-0.187},{"id":347412142,"title":"US job growth slumps amid Trump’s tariff turbulence","text":"US hiring is slowing sharply as President Donald Trump's erratic and radical trade policies paralyse businesses and raise doubts about the outlook for the world's largest economy.\n\n US employers added just 73,000 jobs last month, the Labor Department reported Friday, well short of the 115,000 expected.\n\n Worse, revisions shaved a stunning 258,000 jobs off May and June payrolls. And the unemployment rate ticked higher to 4.2% as Americans dropped out of the labour force and the ranks of the unemployed rose by 221,000.\n\nEconomists blame Trump’s tariffs\n\n “A notable deterioration in US labour market conditions appears to be underway,'' said Scott Anderson, chief US economist at BMO Capital Markets. ”We have been forecasting this since the tariff and trade war erupted this spring, and more restrictive immigration restrictions were put in place. Overall, this report highlights the risk of a harder landing for the labour market.'' Economists have been warning that the rift with every US trading partner will begin to appear this summer, and the Friday jobs report appeared to sound the bell.\n\n “We're finally in the eye of the hurricane,” said Daniel Zhao, chief economist at Glassdoor. “After months of warning signs, the July jobs report confirms that the slowdown isn't just approaching—it's here.” US markets recoiled at the jobs report, and the Dow tumbled more than 600 points on Friday.\n\nTrump targets labour bureau chief\n\n But President Donald Trump responded to the weak report by calling for the firing of Erika McEntarfer, the director of the Labor Department's Bureau of Labor Statistics, which compiles the jobs numbers. “I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,” Trump said on Truth Social. “She will be replaced with someone much more competent and qualified.” Trump questioned the big revisions, but they are a standard part of the monthly jobs report. The Labor Department revises its numbers as more data comes in. Particularly since COVID-19, businesses have taken longer to respond to the government's survey on hiring. As more data has come in later than in the past, the potential for large revisions has increased.\n\n Revelations in the new data raise questions about the health of the job market and the economy as Trump pushes forward an unorthodox overhaul of American trade policy.\n\n Trump has discarded decades of US efforts to lower trade barriers globally, instead imposing hefty import taxes — tariffs — on products from almost every country on earth. Trump believes the levies will bring manufacturing back to America and raise money to pay for the massive tax cuts he signed into law on July 4.\n\n Mainstream economists warned that the cost of the tariffs will be passed along to Americans, both businesses and households.\n\n That has begun.\n\nTariffs hike prices, hit jobs\n\n Walmart, Procter & Gamble, Ford, Best Buy, Adidas, Nike, Mattel, Shein, Temu, Stanley Black & Decker, have all hiked prices due to US tariffs. Economists at Goldman Sachs estimate that overseas exporters have absorbed just one-fifth of the rising costs from tariffs, while Americans and US businesses have picked up the lion's share of the tab.\n\n Trump has sowed uncertainty in the erratic way he's rolled the tariffs out — announcing, then suspending them, then coming up with new ones. Overnight, Trump signed an executive order that set new tariffs on a wide swath of US trading partners that go into effect on August 7, and that comes after a flurry of unexpected tariff-related actions this week.\n\n “There was a clear, significant, immediate tariff effect on the labour market and employment growth essentially stalled, as we were dealing with so much uncertainty about the outlook for the economy and for tariffs,” said Blerina Uruci, chief U.S. economist for the brokerage T. Rowe Price.\n\n Still, Uruci said the data suggests we could be past the worst, as hiring actually did pick up a bit in July from May and June's depressed levels.\n\n “I'm not overly pessimistic on the US economy based on this morning's data,” she said, though she does think that hiring will remain muted in the coming months as the number of available workers remains limited due to reduced immigration and an ageing population.\n\n “Because of immigration policy, labour supply growth has nearly ground to a halt,” said Guy Berger, senior fellow at the Burning Glass Institute, which studies employment trends. “So we're going to have very weak employment growth. And we look like southern Europe or Japan.” Still, with fewer workers available, the economy doesn't need to generate many jobs to soak up the unemployed. That could keep the unemployment rate from climbing much, Berger added.\n\n Trump has sold the tariff hikes as a way to boost American manufacturing, but factories cut 11,000 jobs last month after shedding 15,000 in June and 11,000 in May. The federal government, where employment has been targeted by the Trump administration, lost 12,000 jobs. Jobs in administration and support fell by nearly 20,000.\n\n Healthcare companies added 55,400 jobs last month – accounting for 76 per cent of the jobs added in July and offering another sign that recent job gains have been narrowly concentrated.\n\n The department originally reported that state and local governments had added 64,000 education jobs in June. The revisions on Friday slashed those jobs to less than 10,000.\n\n Those revisions also revealed that the US economy has generated an average of just 85,000 jobs a month this year, barely half last year's average of 168,000 and well below an average of 400,000 from 2021-2023 as the economy rebounded from COVID-19 lockups.\n\nFed may cut rates as economy cools\n\n The weak jobs data makes it more likely that Trump will get one thing that he most fervently desires: A cut in short-term interest rates by the Federal Reserve, which often -- though not always -- can lead to lower rates for mortgages, car loans, and credit cards.\n\n Fed Chair Jerome Powell and other Fed officials have repeatedly pointed to a healthy job market as a reason that they could take time to evaluate how Trump's tariffs were affecting inflation and the broader economy. Now that the assessment has been undercut, it will put more pressure on the Fed to reduce borrowing costs.\n\n Wall Street investors sharply raised their expectations for a rate cut at the Fed's next meeting in September after the report was released.\n\n On Wednesday, the Fed left its key rate unchanged for the fifth consecutive meeting and Powell signalled little urgency to reduce rates anytime soon. He said the “labour market is solid” with “historically low unemployment.” But he also acknowledged there is a “downside risk” to employment stemming from the slow pace of hiring that was evident even before Friday's weaker numbers.\n\n The current situation is a sharp reversal from the hiring boom of just three years ago, when desperate employers were handing out signing bonuses and introducing perks such as Fridays off, fertility benefits and even pet insurance to recruit and keep workers.\n\n The rate of people quitting their jobs — a sign they're confident they can land something better — has fallen from the record heights of 2021 and 2022 and is now weaker than before the pandemic.\n\n Drees Homes, a homebuilder based outside Cincinnati in Fort Mitchell, Kentucky, has hired about 50 people over the past year, bringing its workforce to around 950. Pamela Rader, Drees' vice president for human resources, it's “gotten a little bit easier'' to find workers.\n\n A couple of years ago, Rader said jobseekers were focused on getting more pay. Now, she said, they emphasise stable employment, a better work-life balance, and prospects for advancement. \n\nPublished on August 2, 2025","summary":"","url":"https://www.thehindubusinessline.com/news/world/us-job-growth-slumps-amid-trumps-tariff-turbulence/article69885893.ece","image":"https://bl-i.thgim.com/public/incoming/d8dwgb/article69885894.ece/alternates/LANDSCAPE_1200/2025-07-24T204637Z_1111815295_RC28TFAM6OXA_RTRMADP_3_USA-DAILYLIFE.JPG","video":null,"publish_date":"2025-08-02 00:04:01","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.325},{"id":347412752,"title":"Gridlock crumbles as Senate advances spending bills in race against shutdown","text":"The Senate advanced a package of spending bills late Friday night, breaking a partisan gridlock that threatened to derail the government funding process. Moving the three bills, including funding bills for military construction and Veterans’ Affairs, agriculture and the Food and Drug Administration (FDA) and the legislative branch, appeared on ice for much of the week as lawmaker after lawmaker on either side of the aisle looked to block the bills. But a path forward was found, and the bills were put on the floor, and after several votes on amendments, the final package passed. However, the bill to fund the legislative branch was added to the package separately in response to a roadblock by Sen. John Kennedy, R-La., who ultimately relented to allow the bill to hit the floor. He announced his plan to vote against that piece of the package because the bill increased spending, like the others, but specifically for Congress. SCHUMER, DEMOCRATS TRY TO SAVE FACE, BLAME GOP FOR POSSIBLE GOVERNMENT SHUTDOWN \"I just think we need to set an example, and when we're increasing our spending 6% and others less,\" Kennedy said on the Senate floor. \"We're sending a message that we're special, and I don't think we are.\" Now it heads to the House, where Republicans are already incensed that the Senate's bills go over their approved spending levels. The advancement of the bills is a victory for members of the Senate Appropriations Committee and for Republican leadership, who are working to ward off a possible government shutdown as tensions over the \"big, beautiful bill\" and President Donald Trump’s $9 billion clawback package linger. It's also the first time since 2018 that the upper chamber passed spending bills before September. SENATE WEATHERS DEM OPPOSITION, ADVANCES FIRST GOVERNMENT FUNDING BILL \"These bills all mean a great deal to each of us,\" Senate Appropriations Committee Chair Susan Collins, R-Maine, said on the Senate floor. Senate Minority Leader Chuck Schumer, D-N.Y., previously threatened that if Republicans went through with the rescissions package, it would have grave effects on the forthcoming sprint to fund the government. But, with the deadline to fund the government by Sept. 30 — or to pass a short-term funding extension — fast-approaching, neither party wants to carry the blame for blowing up the appropriations process, at least for now. CONGRESSIONAL REPUBLICANS FACE BRUISING BATTLE TO AVOID GOVERNMENT SHUTDOWN While passing the spending package out of the upper chamber proved a bright spot, lawmakers are still looking for a path forward in confirming a slew of Trump’s nominees. CLICK HERE TO GET THE FOX NEWS APP The president re-upped his call for Senate Republican leadership to cancel recess to pass each nominee on the Senate’s calendar, which has now ballooned to over 150 picks, as Democrats continue their blockade of the process. Lawmakers are set to vote on a trio of nominees Friday night and are expected to run through nearly a dozen more over the weekend, unless a deal is made.","summary":"Senate advances spending package despite Republican concerns over increased funding levels as lawmakers race to prevent government shutdown by Sept. 30.","url":"https://www.foxnews.com/politics/gridlock-crumbles-senate-advances-spending-bills-race-against-shutdown","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/thune-speaking-reporters.jpg","video":"https://www.foxnews.com/video/6376075500112","publish_date":"2025-08-02 00:01:51","author":"Alex Miller","authors":["Alex Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.275},{"id":347416254,"title":"Trump arah dua kapal selam nuklear diletakkan dekat Russia","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, mengarahkan dua kapal selam nuklear negara itu ditempatkan di 'kawasan strategik' dekat Russia.\n\nIa susulan kenyataan yang disifatkan sebagai 'amat provokatif' oleh bekas Presiden Russia, Dmitry Medvedev.\n\nDalam kenyataan yang dimuat naik di laman Truth Social, Trump berkata, arahan itu dikeluarkan sebagai langkah berjaga-jaga sekiranya kenyataan itu bukan sekadar retorik semata-mata.\n\n\"Perkataan membawa kesan. Ia boleh membawa kepada akibat yang tidak dijangka. \n\n\"Saya berharap ini bukan salah satu daripadanya,\" katanya, tanpa mendedahkan lokasi kapal selam tersebut atas faktor keselamatan dan protokol ketenteraan AS.\n\nMedvedev sebelum ini mengeluarkan ancaman terhadap AS susulan desakan Trump supaya Moscow segera menghentikan operasi ketenteraan di Ukraine atau berdepan sekatan ekonomi yang lebih berat.\n\nTrump turut mengkritik keras Medvedev dan menyifatkannya sebagai 'bekas Presiden Russia yang gagal dan masih menyangka dirinya Presiden'.\n\nMedvedev dalam kenyataan balas di laman X sebelum ini menuduh Trump sedang 'bermain api' dengan Russia dan menyifatkan tindakan itu sebagai satu provokasi ke arah perang.\n\nBeliau juga menyifatkan kata dua Trump sebagai 'sandiwara' dan mendakwa Russia tidak mempedulikannya.\n\nTrump baru-baru ini menetapkan tarikh akhir baharu kepada Presiden Russia, Vladimir Putin, untuk menamatkan konflik di Ukraine selewat-lewatnya pada 8 Ogos, selepas beberapa amaran terdahulu tidak diendahkan Kremlin.\n\nTrump berkata, utusan khasnya, Steve Witkoff, sedang akan ke Russia untuk mendesak Moscow bersetuju dengan gencatan senjata dalam peperangannya dengan Ukraine.\n\nAS juga mengancam akan mengenakan sekatan ekonomi baharu sekiranya tiada kemajuan dicapai.\n\nDalam pada itu, Medvedev pada Khamis memberi amaran mengenai ancaman 'dead hand', - yang mengikut pemahaman sesetengah penganalisis sebagai merujuk kepada sistem pelancaran balas senjata nuklear automatik milik Russia.\n\nRussia dan AS adalah dua negara yang memiliki senjata nuklear terbanyak di dunia, namun Trump tidak memperincikan sama ada kapal selam yang diarahkan itu jenis berkuasa nuklear atau bersenjata nuklear.\n\nMasih belum jelas apa kesan penempatan itu terhadap armada kapal selam AS, yang lazimnya menjalankan rondaan di kawasan titik panas dunia, yang berlaku pada saat hubungan pentadbiran Trump dengan Moscow amat genting.\n\nMedvedev kini memegang jawatan sebagai Timbalan Pengerusi Majlis Keselamatan Persekutuan Russia dan dikenali sebagai antara tokoh utama yang menyokong kuat tindakan Moscow dalam perang di Ukraine. - AGENSI","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, mengarahkan dua kapal selam nuklear negara itu ditempatkan di ‘kawasan strategik’ dekat Russia.","url":"https://www.bharian.com.my/dunia/eropah/2025/08/1427712/trump-arah-dua-kapal-selam-nuklear-diletakkan-dekat-russia","image":"https://assets.bharian.com.my/images/articles/bh2med-o_BHfield_image_listing_featured.var_1754092877.jpg","video":null,"publish_date":"2025-08-02 00:01:24","author":null,"language":"en","category":"politics","source_country":"my","sentiment":-0.465},{"id":347409964,"title":"Teenage boy who was maimed in Gaza becomes the first to be treated for war injuries in the UK","text":"A boy of 15 maimed in Gaza became the first to receive treatment for war injuries in London as Donald Trump’s envoy touched down in the devastated territory yesterday.\n\nMajd Alshaghnobi suffered severe facial injuries and a shattered leg while searching for food with two friends last year.\n\nHe was brought to the UK by Project Pure Hope, a charity set up by senior healthcare workers who have also treated children from Ukraine and Israel.\n\nMeanwhile, Donald Trump’s Middle East envoy Steve Witkoff, along with the US ambassador to Israel Mike Huckabee, made a rare trip into Gaza to visit an aid station and devise a plan to get aid into the strip.\n\nMr Witkoff tweeted: ‘We spent over five hours inside Gaza. The purpose of the visit was to give the President a clear understanding of the humanitarian situation and help craft a plan to deliver food and medical aid to the people of Gaza.’\n\nOn Thursday, Mr Trump said he did not believe Israel’s denials of famine in Gaza, saying there was ‘real starvation’ happening.\n\n‘We want to get people fed,’ he said. ‘It is something that should have happened a long time ago.’\n\nThe UN says that more than 1,300 people queuing for aid at centres run by the Gaza Humanitarian Foundation, which is backed by Israel, have been killed since late May. Rights group have condemned the centres as a ‘death trap’.\n\nYesterday, wounded Madj was applauded by well-wishers when he arrived at Heathrow airport in London.\n\nHe said Israeli soldiers had opened fire on him and his friends, killing one and seriously injuring the other two, as they waited for aid.\n\nHis medical team, all working for free, will include craniofacial, plastic and orthodontic surgeons. Hospital bills will be covered by private donations.\n\nLead surgeon Professor Noor ul Owase Jeelani, of London’s Great Ormond Street Hospital, said Majd’s arrival comes after months of wrangling over a temporary visa.\n\n‘If we are able to give him a face and a jaw, it won’t be completely normal, but hopefully he will be able to feed himself and speak, and his facial expressions will be better,’ he said.\n\n‘Hopefully that will make a big impact on how he lives and on his future.\n\n‘Our hope is that we will be able to help many more children like him in the coming months. It’s our collective moral responsibility. I don’t quite understand why it’s taken us over 20 months to get to this stage.’\n\nMajd’s arrival comes a week after Prime Minister Sir Keir Starmer said he was planning to evacuate badly injured children from Gaza.\n\nDozens of MPs have called on him to establish a Ukraine-style visa to allow Gazans to enter Britain for medical treatment.\n\nOmar Din, an NHS healthcare executive and co-founder of Project Pure Hope, said: ‘Every day of delay risks the lives and futures of children who deserve a chance to live, to recover and to rebuild a life.’\n\nTwo Gazan girls aged five and 12 with long-term medical problems were brought to London for treatment in April.","summary":"Majd Alshaghnobi suffered severe facial injuries and a shattered leg while searching for food with two friends last year.","url":"https://www.dailymail.co.uk/news/article-14964261/Teenage-boy-maimed-Gaza-treated-war-injuries-UK.html","image":"https://i.dailymail.co.uk/1s/2025/08/02/00/100860929-0-image-a-13_1754090509984.jpg","video":null,"publish_date":"2025-08-02 00:01:16","author":"Chris Pollard,Editor","authors":["Chris Pollard","Editor"],"language":"en","source_country":"gb","sentiment":-0.375},{"id":347413790,"title":"U.S.-Russia nuclear war: Is World War 3 happening? What we know so far","text":"ANIUS President Donald Trump with Russian President Vladimir Putin.\n\nDonald Trump-led United States of America and Vladimir Putin-headed Russia are two of the most high profile nuclear armed countries. Any possibility of clashes will be nothing short of catastrophic and a possible World War III. In a warning to Russia, President Donald Trump said Friday he's ordering the repositioning of two U.S. nuclear submarines “based on the highly provocative statements” of the country's former president, Dmitry Medvedev, who has raised the prospect of war online. A member of the Russian Parliament Duma has said that there are enough Russian nuclear submarines in the high seas to tackle two American subs dispatched by US President Donald Trump to counter Russia.Nuclear ThreatsThe number of Russian nuclear submarines in the world's oceans is significantly higher than the American ones, and the subs that US President Donald Trump ordered to be redirected to the appropriate regions have long been under their control. So no response from the Russian Federation to the American leader's statement about the submarines is required, a senior Russian lawmaker, Viktor Vodolatsky, was quoted as saying by TASS.Earlier on Friday, Trump wrote on his Truth Social post that he had ordered the redeployment of US submarines \"to appropriate regions\" allegedly over \"extremely provocative statements\" by former Russian President Dmitry Medvedev, who is also the deputy chairman of the Russian Security Council.The United States has a total of 14 Ohio Class nuclear-powered submarines, each capable of carrying up to 24 Trident II D5 ballistic missiles that can deliver multiple thermonuclear warheads up to 4,600 miles. Between 8 and 10 Ohio Class submarines are deployed at any one time, according to the Nuclear Threat Initiative arms control group.Live EventsRussia currently operates 54 nuclear-powered submarines, including both strategic and attack types, out of an overall submarine force of about 79 vessels. 14 nuclear-powered ballistic missile submarines (SSBNs)—Russia’s sea‑based nuclear deterrent—comprise eight modern Borei‑class (Project 955/955A) and six older Delta III/IV boats. 13 nuclear-powered guided‑missile submarines (SSGNs), including six Oscar II‑class and seven Yasen‑class (Project 885/885M), serve as precision strike platforms with cruise- and hypersonic‑capable munitions. 16 nuclear-powered attack submarines (SSNs)—primarily upgraded Akula‑class and a few Sierra‑class boats used for anti‑submarine warfare and sea denial missions.World War 3?\"Let the two US subs sail, they have been in the crosshairs for a long time now,\" the Russian lawmaker said. \"A fundamental agreement that must be concluded between Russia and America so that the whole world calms down and stops talking about the beginning of World War III,\" he added.Trump posted on his social media site that, based on the “highly provocative statements” from Medvedev, he had “ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that.” The president added, “Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.”Meanwhile, editor-in-chief of Russia in Global Affairs magazine, Fyodor Lukyanov, said that Trump's nuclear submarine statement should not be taken seriously for now.\"Trump, as we know, runs his own channel and reacts, so to speak, emotionally, humanly and spontaneously. I think that the armed forces, the naval forces of the United States read this with great surprise. If this exchange of opinions continues, and Trump continues to be drawn into it, then, one way or another, he will probably have to take some action. In my opinion, so far this is only at the level of words,\" Lukyanov told local private news channel RBC TV.Earlier, responding to a media question over US State Department Secretary Marco Rubio's recent interview with Fox News, Russian Foreign Minister Sergei Lavrov said that Russia agrees with the US administration that a direct military confrontation between Moscow and Washington must not happen.\"While Europeans are hysterically pushing for Ukraine’s integration into NATO and preparing for potential conflict with Russia, US Secretary of State Marco Rubio recently reaffirmed a responsible stance, explicitly stating that a direct military confrontation between the United States and Russia must be avoided. We wholeheartedly concur with this position. Such shared understanding has been facilitated through constructive Russian-American dialogue,\" Lavrov said.It wasn’t clear what impact Trump’s order would have on U.S. nuclear subs, which are routinely on patrol in the world’s hotspots, but it comes at a delicate moment in the Trump administration's relations with Moscow.Trump has said that special envoy Steve Witkoff is heading to Russia to push Moscow to agree to a ceasefire in its war with Ukraine and has threatened new economic sanctions if progress is not made. He cut his 50-day deadline for action to 10 days, with that window set to expire next week.Any talk by a U.S. president about potential nuclear military capabilities raises concerns, the security experts said, noting that the United States has historically refrained from matching Russia's nuclear-saber rattling given the risks surrounding the world's most devastating weaponry.\"This is irresponsible and inadvisable,\" said Daryl Kimball, executive director of the Arms Control Association advocacy group. \"No leader or deputy leader should be threatening nuclear war, let alone in a juvenile manner on social media.\"Hans Kristensen of the Federation of American Scientists noted that U.S. nuclear submarines – part of the so-called nuclear triad with bombers and land-based missiles – were always positioned to launch nuclear-armed missiles at targets in Russia.\"The subs are always there all the time and don't need to be moved into position,\" he said. \"He grants Medvedev a response to these crazy statements.\"FAQsQ1. Who is President of USA?A1. President of USA is Donald Trump.Q2. Who is President of Russia?A2. President of Russia is Vladimir Putin.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onRussia vs US World War 3Russia vs USAWorld War 3World War IIIRussia vs US latest news\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onRussia vs US World War 3Russia vs USAWorld War 3World War IIIRussia vs US latest news(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Russia and the USA have exchanged nuclear threats which have raised apprehensions over whether there will be World War III or not.","url":"https://economictimes.indiatimes.com/news/international/us/u-s-russia-nuclear-war-is-world-war-3-happening-what-we-know-so-far/articleshow/123053170.cms","image":"https://img.etimg.com/thumb/msid-123053248,width-1200,height-630,imgsize-21946,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-02 00:01:06","author":"Us President Donald","authors":["Us President Donald"],"language":"en","source_country":"in","sentiment":0.275},{"id":347416544,"title":"Two Popular Late-Night Hosts Fear They Are Next To Be Canceled After 'Helping NBC Lose $100Million-Plus Per Year' — Days After Stephen Colbert's Show Was Axed","text":"Two popular late-night TV talk show hosts fear their jobs are on the line after posting millions in losses, RadarOnline.com can reveal. \n\nJimmy Fallon and Seth Meyers, along with the weekly sketch show, Saturday Night Live, cost NBC more than $100million in financial setbacks annually. Since CBS stated that it was a \"purely financial decision\" to cancel Stephen Colbert's The Late Show, now Fallon and Meyers are worried they'll be next to go.Politics Versus MoneyEven though Colbert's show was reportedly costing CBS $40million in losses annually, the host has continued to hint that constant attacks on President Donald Trump sealed his doom. NBC is taking advantage of Colbert's politically charged depiction, according to Hollywood insider Rob Shuter.\n\n\"They're letting the narrative take hold that Colbert was canceled purely for political reasons, and that works in their favor. It distracts from the financial bloodbath happening across the late-night industry,\" Shuter told the Daily Mail. \"NBC isn't denying the $100 million [loss] because if everyone's talking about politics, they're not talking about whether these shows are even sustainable anymore.\"\n\nThe Tonight Show Starring Jimmy Fallon and Late Night with Seth Meyers both trail far behind The Late Show and Jimmy Kimmel Live! in audience numbers when they air. Still, the NBC shows make up for it by being more successful in the streaming and YouTube realms for advertisers.Colbert The 'Martyr'Colbert has continued to battle with Trump, claiming he was a \"martyr\" for going after the president and insinuating he was the first late-night host to pay the price. \n\nThe day after Colbert announced his show had gotten the axe, Trump took to Truth Social to celebrate, writing,“I absolutely love that Colbert got fired. His talent was even less than his ratings.\"\n\nThe Commander-in-Chief then sneered: \"I hear Jimmy Kimmel is next. Has even less talent than Colbert!”\n\nThe South Carolina native declared in response on his first show back after the July 17 cancellation announcement, \"Kimmel, I am the martyr. There’s only room for one on this cross. And the view is fantastic from up here.\"Worried About The FutureMeyers, 51, reflected on how the future of late-night talk shows seemed bleak before Colbert's cancellation went down.\n\nDuring a recent podcast appearance taped ahead of the CBS announcement about The Late Show's fate, the SNL alum said he did \"fear\" that his show could “end tomorrow.”\n\n\"There is this weird thing that I feel like I shifted from fearing that I wouldn’t be good enough. And now my fear is weirdly more outside of my control, which is … just at some point, the ecosystem might not support [late-night],\" Meyers dished about the current state of the entertainment industry.Above The FrayWhile Colbert and Kimmel. 57, continue to base their monologues on heavy Trump bashing, Fallon, 50, has tried his best to remain apolitical. His show relies heavily on interactive games with guests while the comedian keeps his humor broad and lighthearted. \n\nHowever, Fallon was stunned when Colbert announced that The Late Show was coming to an end for good in May 2026.\n\n“I’m just as shocked as everyone. Stephen is one of the sharpest, funniest hosts to ever do it. I really thought I’d ride this out with him for years to come,\" he wrote on social media.\n\nBoth Fallon and Meyers were there to show support for Colbert on his first night back after the cancellation announcement, appearing together in the audience for a celebrity-filled \"kiss cam\" segment that parodied Coldplay outing a married CEO and his mistress coworker.","summary":"Two popular late-night hosts are in fear their jobs are on the chopping block following $100million in losses after Stephen Colbert's cancelation.","url":"https://radaronline.com/p/late-night-hosts-fear-cancelations-after-colbert-show-axed/","image":"https://media.radaronline.com/brand-img/DxppgJM9f/0x0/late-night-talk-show-hosts-fear-cancelation-after-colbert-axed-1754087298938.jpg","video":null,"publish_date":"2025-08-02 00:00:00","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":-0.139},{"id":347414476,"title":"Cheesed off: Swiss meltdown over Trump’s ‘incomprehensible’ tariff whack","text":"London: Swiss companies are reeling from a shock move by US President Donald Trump to slap a 39 per cent tariff on their exports, stunning brand-name suppliers of luxury watches, jewellery, cheese and chocolate.\n\nSwiss chocolate makers have declared the move “incomprehensible” and are warning it will hit them hard, as the changes flow through to higher prices for American customers.\n\nThe biggest names in luxury watches, already suffering a slowdown in America after Trump’s previous trade decisions, now confront extraordinary price hikes that could lead them to expand sales in other markets.\n\nTrump spared Australia from higher penalties in his sweeping trade decision on Thursday, leaving tariffs at 10 per cent for most Australian exports, but he singled out Switzerland with the biggest blow to any European country.","summary":"Switzerland’s brand-name suppliers of luxury watches, jewellery, cheese and chocolate are reeling after a 39 per cent tariff was slapped on their exports to the US.","url":"https://www.brisbanetimes.com.au/world/europe/cheesed-off-swiss-meltdown-over-trump-s-incomprehensible-tariff-whack-20250802-p5mjq3.html","image":"https://static.ffx.io/images/$zoom_0.4991%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/q_86%2Cf_auto/813564ec131d56434958331f84c07877abaf5f5e","video":null,"publish_date":"2025-08-01 23:57:00","author":"David Crowe","authors":["David Crowe"],"language":"en","source_country":"au","sentiment":0.099},{"id":347410436,"title":"Cheesed off: Swiss meltdown over Trump’s ‘incomprehensible’ tariff whack","text":"London: Swiss companies are reeling from a shock move by US President Donald Trump to slap a 39 per cent tariff on their exports, stunning brand-name suppliers of luxury watches, jewellery, cheese and chocolate.\n\nSwiss chocolate makers have declared the move “incomprehensible” and are warning it will hit them hard, as the changes flow through to higher prices for American customers.\n\nThe biggest names in luxury watches, already suffering a slowdown in America after Trump’s previous trade decisions, now confront extraordinary price hikes that could lead them to expand sales in other markets.\n\nTrump spared Australia from higher penalties in his sweeping trade decision on Thursday, leaving tariffs at 10 per cent for most Australian exports, but he singled out Switzerland with the biggest blow to any European country.","summary":"Switzerland’s brand-name suppliers of luxury watches, jewellery, cheese and chocolate are reeling after a 39 per cent tariff was slapped on their exports to the US.","url":"https://www.theage.com.au/world/europe/cheesed-off-swiss-meltdown-over-trump-s-incomprehensible-tariff-whack-20250802-p5mjq3.html","image":"https://static.ffx.io/images/$zoom_0.4991%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/q_86%2Cf_auto/813564ec131d56434958331f84c07877abaf5f5e","video":null,"publish_date":"2025-08-01 23:57:00","author":"David Crowe","authors":["David Crowe"],"language":"en","source_country":"au","sentiment":0.099},{"id":347408884,"title":"World economies reel from Trump's tariffs punch","text":"Washington - Global markets reeled Friday after President Donald Trump's tariffs barrage against nearly all U.S. trading partners as governments looked down the barrel of a seven-day deadline before higher duties take effect.Trump announced late Thursday that dozens of economies, including the European Union, will face new tariff rates of between 10 and 41%.However, implementation will be on Aug. 7 rather than Friday as previously announced, the White House said. This gives governments a window to rush to strike deals with Washington setting more favorable conditions.","summary":"Stock markets in Hong Kong, London and New York slumped as they digested the turmoil, while weak U.S. employment data added to worries.","url":"https://www.japantimes.co.jp/business/2025/08/02/economy/global-economy-trump-tariffs/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/08/02/484988.jpg?v=3.1","video":null,"publish_date":"2025-08-01 23:56:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","source_country":"jp","sentiment":-0.146},{"id":347407580,"title":"Donald Trump's Effort to Overturn Birthright Citizenship Struggles in Court","text":"A three-judge panel in the Boston-based appeals court expressed deep skepticism about arguments from President Donald Trump's Department of Justice as the administration seeks to overturn birthright citizenship, according to Reuters.Why It MattersTrump's executive order, signed on Inauguration Day in January, seeks to restrict birthright citizenship and could potentially affect the rights of millions of U.S.-born children. The order directs U.S. agencies to refuse citizenship to children unless at least one parent is a U.S. citizen or lawful permanent resident.The crux of the issue sits in the interpretation of the 14th Amendment, which will determine whether the constitutional guarantee of citizenship for children born on American soil to non-citizen or undocumented parents remains intact.The case has already gone before the San Francisco-based 9th Circuit Court of Appeals, which last month ruled that the order is unconstitutional, upholding a lower-court decision that blocked nationwide enforcement.What To KnowThe Boston-based 1st U.S. Circuit Court of Appeals on Friday grilled Justice Department lawyer Eric McArthur over the core arguments of the administration's position on birthright citizenship, who reiterated Trump's argument that the 14th Amendment was only meant to extend citizenship to the children of former slaves—not the children of immigrants in the country either temporarily or unlawfully.The judges, all appointed by Democratic presidents, pointed to the Supreme Court's ruling in United States v. Wong Kim Ark, which guaranteed citizenship to any child born in the country to non-citizen parents.Chief U.S. Circuit Judge David Barron mused that the judges \"aren't free to disregard\" the Supreme Court's previous ruling.Shankar Duraiswamy, a lawyer for New Jersey, argued before the court that the Supreme Court has \"repeatedly recognized children born to individuals who are here unlawfully or who are here on a temporary basis are nonetheless birthright citizens.\"While the Supreme Court in June ruled in favor of limiting nationwide injunctions, it allowed certain exceptions within the limits of a certified segment of people for class-action lawsuits to retain that power.U.S. District Judge Leo Sorokin of Massachusetts in July ruled that a previously granted nationwide injunction against Trump's order could stay in place, even in light of the new Supreme Court restrictions, because \"no workable, narrower alternative\" would give the plaintiffs relief.A New Hampshire court in the same month also acted within the new ruling to certify a nationwide class of plaintiffs, which included all children born on U.S. soil. The Trump administration has sought to appeal this ruling alongside Sorokin's.What People Are SayingJudge Patrick Bumatay, who dissented in the 9th Circuit's ruling, wrote: \"We should approach any request for universal relief with good faith skepticism, mindful that the invocation of 'complete relief' isn't a backdoor to universal injunctions.\"Former Palm Beach County State Attorney Dave Aronberg via X, formerly Twitter, to Newsweek in July: \"Easy decision. If President Trump wants to eliminate birthright citizenship, he needs to change the Constitution. But he can't repeal the language of the 14th Amendment via executive order.\"Representative Claudia Tenney, a New York Republican, posted to X on Wednesday: \"Birthright citizenship was never meant to be a reward for breaking our immigration laws. The Constitutional Citizenship Clarification Act makes it clear: No citizenship for children born to illegal aliens, foreign spies, or terrorists.\"What Happens NextLegal experts and state attorneys general anticipate that the Supreme Court's possible review will provide a landmark ruling on the meaning of the 14th Amendment—a decision that may reshape the rights of children born on U.S. soil and the future of American immigration policy.This article includes reporting by the Associated Press.","summary":"President Donald Trump's executive order has faced repeated roadblocks, but the administration continues appealing up to the Supreme Court.","url":"https://www.newsweek.com/donald-trump-effort-overturn-birthright-citizenship-struggles-court-2107880","image":"https://d.newsweek.com/en/full/2695299/united-states-passport-birthright-citizenship.jpg?w=1600&h=900&q=88&f=1eecc73e5e004838a82bb9725f97a22b","video":null,"publish_date":"2025-08-01 23:47:11","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.084},{"id":347416274,"title":"Bekas Presiden Colombia dihukum tahanan rumah 12 tahun kerana rasuah","text":"BOGOTA: Bekas Presiden Colombia, Alvaro Uribe, dijatuhi hukuman 12 tahun tahanan rumah selepas disabitkan bersalah atas kesalahan mempengaruhi saksi dan rasuah.\n\nDia adalah bekas Presiden pertama negara itu yang dihukum dalam perbicaraan jenayah.\n\nMahkamah turut mengenakan denda berjumlah AS$578,000 (RM2.7 juta) serta larangan memegang sebarang jawatan awam selama lapan tahun.\n\nUribe, 73, yang sebelum ini menafikan sebarang salah laku, telah diarahkan oleh hakim untuk melaporkan diri kepada pihak berkuasa di bandar kelahirannya, Rionegro, sebelum menjalani hukuman tahanan di kediamannya seperti diarahkan Hakim Sandra Liliana Heredia.\n\nBarisan peguamnya bagaimanapun menyatakan hasrat untuk mengemukakan rayuan terhadap keputusan itu.\n\nKeputusan yang diumumkan selepas enam bulan perbicaraan itu merupakan kemuncak kepada lebih satu dekad siasatan dan pertikaian undang-undang terhadap tokoh konservatif berpengaruh itu, yang pernah menerajui Colombia dari 2002 hingga 2010.\n\nSepanjang pentadbirannya, Uribe dikenali dengan pendekatan keras terhadap kumpulan pemberontak seperti Angkatan Revolusi Colombia (FARC), namun turut berdepan kecaman hebat berhubung dakwaan pencabulan hak asasi manusia.\n\nKetika itu, tentera Colombia dikatakan terlibat dalam skandal 'positif palsu' iaitu pembunuhan ke atas orang awam yang kemudiannya dihebahkan sebagai 'pejuang musuh' bagi meningkatkan statistik kejayaan ketenteraan.\n\nSekurang-kurangnya 2,000 kematian disyaki berkaitan dengan amalan itu, dan siasatan mendedahkan jumlahnya boleh mencecah lebih 6,400 orang.\n\nUribe juga pernah dikaitkan dengan hubungan sulit bersama kumpulan separa tentera sayap kanan, namun beliau menafikan semua tuduhan itu.\n\nKes mahkamah ini bermula lebih sedekad lalu apabila Uribe bertindak memfailkan saman fitnah terhadap Senator Ivan Cepeda yang ketika itu sedang menyiasat kaitannya dengan kumpulan separa tentera Bloque Metro.\n\nNamun, pada 2018, Mahkamah Agung Colombia menolak saman Uribe, dan sebaliknya membuka kertas siasatan terhadap beliau.\n\nPendakwa raya mendakwa Uribe cuba memanipulasi keterangan saksi dengan menghantar peguamnya, Diego Cadena, untuk memujuk bekas anggota separa tentera menarik balik kenyataan mereka, termasuk didakwa menawarkan wang kepada saksi.\n\nCadena kini turut berdepan pertuduhan jenayah.\n\nBeberapa kenyataan saksi itu juga digunakan dalam perbicaraan pembunuhan yang membabitkan adik Uribe, Santiago Uribe.\n\nDalam prosiding mahkamah selama 10 jam pada 28 Julai lalu, Hakim Heredia menyatakan terdapat bukti kukuh Uribe secara aktif cuba mempengaruhi keterangan saksi.\n\nKeputusan itu bagaimanapun mencetuskan reaksi politik di Amerika Syarikat (AS).\n\nSetiausaha Negara AS, Marco Rubio, sekutu rapat Presiden AS, Donald Trump, menyelar keputusan mahkamah Colombia dan menuduh sistem kehakiman negara itu digunakan sebagai 'senjata' oleh hakim radikal.\n\n\"Kesalahan sebenar Uribe hanyalah mempertahankan tanah airnya,\" kata Rubio dalam kenyataan di media sosial.\n\nUribe masih menegaskan beliau tidak bersalah dan kes ini dijangka terus menjadi tumpuan dalam menjelang Pilihan Raya Presiden Colombia yang dijadual berlangsung pada Mei 2026. - AGENSI","summary":"BOGOTA: Bekas Presiden Colombia, Alvaro Uribe, dijatuhi hukuman 12 tahun tahanan rumah selepas disabitkan bersalah atas kesalahan mempengaruhi saksi dan rasuah.","url":"https://www.bharian.com.my/dunia/amerika/2025/08/1427702/bekas-presiden-colombia-dihukum-tahanan-rumah-12-tahun-kerana-rasuah","image":"https://assets.bharian.com.my/images/articles/nh2uri-o_BHfield_image_listing_featured.var_1754094884.jpg","video":null,"publish_date":"2025-08-01 23:46:17","author":null,"language":"en","category":"politics","source_country":"my","sentiment":1},{"id":347408772,"title":"The Five - Friday, August 1","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode August 01, 2025 38:20 \n FULL EPISODE\n\n EXP 8 DAYS\n The Five - Friday, August 1 \n Donald Trump, Kamala Harris, White House\n Tags MOST RECENT EPISODES | VIDEOSTHE FIVE | FULL EPISODES","summary":"Donald Trump, Kamala Harris, White House","url":"https://www.foxnews.com/video/6376473910112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/bcd7b30e-8d74-4846-9274-fd5da5d4da1c/1c3457f8-651c-4318-b522-311554b2175d/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-08-01 23:46:10","author":null,"language":"en","source_country":"us","sentiment":-0.292},{"id":347408888,"title":"Trump says he moved U.S. nuclear subs after barbs with Russia","text":"President Donald Trump said the U.S. is moving two nuclear submarines to respond to what he called 'highly provocative statements” from former Russian President Dmitry Medvedev.'I have ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that,” Trump said in a social media post Friday. 'Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.”Trump, speaking to reporters later Friday, suggested he was acting out of caution, saying that 'we had to do that, we just have to be careful and a threat was made and we didn’t think it was appropriate.”","summary":"President Donald Trump said the U.S. is moving two nuclear submarines to respond to what he called \"highly provocative statements” from former Russian President Dmitry Medvedev.","url":"https://www.japantimes.co.jp/news/2025/08/02/world/politics/trump-us-nuclear-submarines-russia/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/08/02/484985.jpg?v=3.1","video":null,"publish_date":"2025-08-01 23:46:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.105},{"id":347412134,"title":"Enough nukes to track Trump’s subs, says Russian lawmaker","text":"There are enough Russian nuclear submarines in the high seas to tackle two American subs dispatched by US President Donald Trump to counter Russia, a member of the Russian Parliament Duma has said.\n\n\"The number of Russian nuclear submarines in the world's oceans is significantly higher than the American ones, and the subs that US President Donald Trump ordered to be redirected to the appropriate regions have long been under their control. So no response from the Russian Federation to the American leader's statement about the submarines is required,\" a senior Russian lawmaker, Viktor Vodolatsky, was quoted as saying by TASS.\n\nEarlier on Friday, Trump wrote on his Truth Social post that he had ordered the redeployment of US submarines \"to appropriate regions\" allegedly over \"extremely provocative statements\" by former Russian President Dmitry Medvedev, who is also the deputy chairman of the Russian Security Council.\n\nTrump’s post dismissed as Political showmanship\n\n\"Let the two US subs sail, they have been in the crosshairs for a long time now,\" the Russian lawmaker said.\n\n \"A fundamental agreement that must be concluded between Russia and America so that the whole world calms down and stops talking about the beginning of World War III,\" he added.\n\nExpert: Trump’s comments ‘emotional, not policy’\n\n Meanwhile, editor-in-chief of Russia in Global Affairs magazine, Fyodor Lukyanov, said that Trump's nuclear submarine statement should not be taken seriously for now.\n\n\"Trump, as we know, runs his own channel and reacts, so to speak, emotionally, humanly and spontaneously. I think that the armed forces, the naval forces of the United States read this with great surprise. If this exchange of opinions continues, and Trump continues to be drawn into it, then, one way or another, he will probably have to take some action. In my opinion, so far this is only at the level of words,\" Lukyanov told local private news channel RBC TV.\n\nFollowing the American leader's statements, the Moscow Exchange index plummeted 2,709.26 points (0.99%) by 08:01 pm Moscow time (10:31 pm IST) on Friday.\n\nLavrov backs US call to avoid military conflict\n\nEarlier, responding to a media question over US State Department Secretary Marco Rubio's recent interview with Fox News, Russian Foreign Minister Sergei Lavrov said that Russia agrees with the US administration that a direct military confrontation between Moscow and Washington must not happen.\n\n\"While Europeans are hysterically pushing for Ukraine’s integration into NATO and preparing for potential conflict with Russia, US Secretary of State Marco Rubio recently reaffirmed a responsible stance, explicitly stating that a direct military confrontation between the United States and Russia must be avoided. We wholeheartedly concur with this position. Such shared understanding has been facilitated through constructive Russian-American dialogue,\" Lavrov said. \n\nPublished on August 2, 2025","summary":"Viktor Vodolatsky of the Duma claimed Russian nuclear submarines are already tracking American ones and no additional response is needed.","url":"https://www.thehindubusinessline.com/news/world/enough-nukes-to-track-trumps-subs-says-russian-lawmaker/article69885597.ece","image":"https://bl-i.thgim.com/public/incoming/csnsc0/article69885807.ece/alternates/LANDSCAPE_1200/2025-02-11T191540Z_1659522020_RC2ISCAQ6JI5_RTRMADP_3_USA-TRUMP-RUSSIA.JPG","video":null,"publish_date":"2025-08-01 23:45:28","author":"Us President Donald","authors":["Us President Donald"],"language":"en","category":"politics","source_country":"in","sentiment":0.071},{"id":347416540,"title":"EXCLUSIVE: Epstein Sex Slave Virginia Giuffre's Revealed Horrors Of Pedo's Nude Massage Trials In Palm Beach Arranged By Jailed Madame Ghislaine Maxwell In Chilling Unpublished Memoir","text":"Virginia Giuffre’s shocking firsthand account of being groomed and exploited by Jeffrey Epstein and Ghislaine Maxwell is laid bare in an unpublished memoir titled Billionaire’s Playboy Club, RadarOnline.com can reveal.\n\nThe entire book was filed as evidence during Giuffre’s 2015 lawsuit against Maxwell and was unsealed in 2019, becoming part of the official court record. In vivid detail, Giuffre describes the moment her life was irrevocably altered at the sex offender's infamous Palm Beach estate.Billionaire’s Playboy Club Describes Meeting Both Maxwell and EpsteinWhile working at the Mar-a-Lago Spa, Giuffre was approached by Maxwell, who offered to connect the young woman with a wealthy man seeking a massage therapist. \n\nGiuffre recalled Maxwell’s warm demeanor, saying she \"came off as more of a nurturer rather than a procurer.\" Neither Giuffre nor her father saw reason for hesitation, viewing the offer as a promising opportunity to advance her massage therapy career.Giuffre remembered arriving at Epstein’s estate hopeful for a legitimate opportunity. Introduced to Epstein by Maxwell as a potential masseuse, she was led to believe this role would allow her to travel and earn a good income. \n\nMaxwell instructed Giuffre to follow her lead, promising a lesson in massage therapy.The Massage Lesson was Normal at FirstAt first, the session seemed genuine. Giuffre learned to massage Epstein’s body under Maxwell’s guidance, mimicking her motions and taking tips on technique. \n\nBut the atmosphere quickly shifted, with Epstein telling Giuffre, \"I like naughty girls.\"Things Quickly Became UnnervingThe abuse escalated rapidly. \n\nAccording to Giuffre, Epstein exposed himself and became sexually explicit. Maxwell, a madame, began undressing Giuffre, initiating acts of sexual abuse while Epstein watched and participated. \n\nGiuffre, overwhelmed and shocked, felt powerless as she was coerced into acts far beyond anything she expected. She was never asked for consent; instead, Maxwell directed the degrading encounter.Epstein Mocked Her Mar-A-Lago SalaryAfter the harrowing ordeal, Giuffre was in a state of shock. \n\nBefore leaving, Maxwell praised her \"great potential\" as a massage therapist and hinted at future meetings. \n\nAccording to the unpublished book. Epstein then opened a bag to reveal stacks of new hundred-dollar bills before giving his newest victim two crisp bills.\n\nHe is then said to have mocked her, laughing at the fact that it was almost her entire week’s wage at Mar-A-Lago.Giuffre’s tragic story ended with her death by suicide in 2025. Her memoir and testimony continue to expose the dark truths behind Jeffrey Epstein’s abusive network.\n\nMeanwhile, ongoing revelations about Epstein’s connections to powerful figures, including Donald Trump and his Mar-a-Lago club, show how young women were exploited under the guise of opportunity.","summary":"In a disturbing never-before-seen memoir, Jeffrey Epstein survivor Virginia Giuffre details how Ghislaine Maxwell arranged nude massage 'tryouts' at his mansion.","url":"https://radaronline.com/p/epstein-virginia-giuffre-unpublished-memoir-ghislaine-maxwell-massage-details/","image":"https://media.radaronline.com/brand-img/gIzM4cRZb/0x0/max-1754091098563.jpg","video":null,"publish_date":"2025-08-01 23:45:00","author":"Nate Grant","authors":["Nate Grant"],"language":"en","source_country":"us","sentiment":-0.358},{"id":347412140,"title":"Trump orders nuclear submarine deployment after Medvedev’s threats escalate","text":"In a warning to Russia, President Donald Trump said Friday he's ordering the repositioning of two US nuclear submarines “based on the highly provocative statements” of the country's former president, Dmitry Medvedev, who has raised the prospect of war online.\n\n Trump posted on his social media site that, based on the “highly provocative statements” from Medvedev, he had “ordered two Nuclear Submarines to be positioned in the appropriate regions, just in case these foolish and inflammatory statements are more than just that.” The president added, “Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.” It wasn't clear what impact Trump's order would have on US nuclear subs, which are routinely on patrol in the world's hotspots, but it comes at a delicate moment in the Trump administration's relations with Moscow.\n\n Trump has said that special envoy Steve Witkoff is heading to Russia to push Moscow to agree to a ceasefire in its war with Ukraine and has threatened new economic sanctions if progress is not made. He cut his 50-day deadline for action to 10 days, with that window set to expire next week.\n\nCeasefire deadline slashed to 10 days\n\n The post about the sub repositioning came after Trump, in the wee hours of Thursday morning, had posted that Medvedev was a “failed former President of Russia” and warned him to “watch his words.” Medvedev responded hours later by writing, “Russia is right on everything and will continue to go its own way.” And that back-and-forth started earlier this week when Medvedev wrote, “Trump's playing the ultimatum game with Russia: 50 days or 10” and added, “He should remember 2 things: 1. Russia isn't Israel or even Iran. 2. Each new ultimatum is a threat and a step towards war. Not between Russia and Ukraine, but with his own country.” Asked as he was leaving the White House on Friday evening for a weekend at his estate in New Jersey about where he was repositioning the subs, Trump didn't offer any specifics.\n\nMedvedev–Trump spat intensifies online\n\n “We had to do that. We just have to be careful,” he said. “A threat was made, and we didn't think it was appropriate, so I have to be very careful.” Trump also said, “I do that on the basis of safety for our people” and “we're gonna protect our people.” He later added of Medvedev, “He was talking about nuclear.” “When you talk about nuclear, we have to be prepared,” Trump said. “And we're totally prepared.” Medvedev was Russia's president from 2008 to 2012, while Vladimir Putin was barred from seeking a third consecutive term, and then stepped aside to let him run again.\n\n Now deputy chairman of Russia's National Security Council, which Putin chairs, Medvedev has been known for his provocative and inflammatory statements since the start of the war in 2022. That's a U-turn from his presidency when he was seen as liberal and progressive.\n\n Medvedev has frequently wielded nuclear threats and lobbed insults at Western leaders on social media. Some observers have argued that with his extravagant rhetoric, Medvedev is seeking to score political points with Putin and Russian military hawks.\n\n One such example before the latest spat with Trump came on July 15, after Trump announced plans to supply Ukraine with more weapons via its NATO allies and threatened additional tariffs against Moscow. Medvedev posted then, “Trump issued a theatrical ultimatum to the Kremlin. The world shuddered, expecting the consequences. Belligerent Europe was disappointed. Russia didn't care.” \n\nMore Like This\n\nPublished on August 2, 2025","summary":"Medvedev had warned that Trump’s escalating ultimatums over Ukraine could lead to war, prompting Trump to issue a firm response citing national security. ","url":"https://www.thehindubusinessline.com/news/world/trump-orders-nuclear-submarine-deployment-after-medvedevs-threats-escalate/article69885037.ece","image":"https://bl-i.thgim.com/public/incoming/ib5alv/article69885426.ece/alternates/LANDSCAPE_1200/2025-08-01T200757Z_1617017571_RC2WXFARLT6J_RTRMADP_3_USA-TRUMP-RUSSIA-SUBMARINES.JPG","video":null,"publish_date":"2025-08-01 23:35:49","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.064},{"id":347417144,"title":"Jobs Take Massive Downward Revisions: Uncertainty And Risk Ride High","text":"Russell Vought, director of the Office of Management and Budget, center, with President Donald Trump, left and Federal Reserve Chairman Jerome Powell, visit the Federal Reserve, Thursday, July 24, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson)\nCopyright 2025 The Associated Press. All rights reserved.\n\nEconomists were wrong. They expected 100,000 new jobs in July. Instead, there were 73,000. Unemployment was up to 4.2% from 4.1%. Disappointing as those are, neither was the truly crushing news. This was, according to the Bureau of Labor Statistics release:\n\n“Revisions for May and June were larger than normal. The change in total nonfarm payroll employment for May was revised down by 125,000, from +144,000 to +19,000, and the change for June was revised down by 133,000, from +147,000 to +14,000. With these revisions, employment in May and June combined is 258,000 lower than previously reported.”\n\nJobs Saw A Massive Downward Revision\n\nBLS has explained jobs revisions for previous months as resulting from additional business and government agency reports as well as recalculation of seasonal factors. But it still comes to the same conclusion in this case: more than a quarter million fewer new jobs than had been reported.\n\nLate last month I wrote about how getting a job was getting harder. ManpowerGroup President and Chief Strategy Officer Becky Frankiewicz wrote at the time about June jobs, “The top-line numbers look positive, but our real-time data reveals underlying shifts. June marked the weakest hiring month of the year, with new postings down 7% month-over-month and 2% year-over-year. Open postings fell 8% from May.”\n\nNew monthly job openings in the aggregate have been lagging far behind jobs added, as the graph below, using data available from the Federal Reserve Bank of St. Louis, shows.\n\nMonthly changes of new job announcements and actual new jobs.\nFederal Reserve Bank of St. Louis\n\nMORE FOR YOU\n\nCompanies can’t keep adding new real hires every month when they’ve reduced the number of job openings they have.\n\nPresident Trump claimed on Truth Social that BLS Commissioner Erika McEntarfer had “RIGGED the numbers in order to make the Republicans, and ME, look bad” and then reportedly fired her according to The Hill.\n\nIt seems odd that this would only happen now and sounds like another attempt to sweep problems under the rug.\n\nMore Economic Bad News\n\nMore likely that the July number and downgrade of May and June had more to do with companies concerned about the administration’s tariff strategies. Uncertainty has had impact on the economy over the last few months. Many economists said the increase in the Consumer Price Index, another measure of inflation, was a result of tariffs finally affecting the economy, as The Hill reported.\n\nInflation from the Bureau of Economic Analysis shows personal expenditures (PCE, another inflation measure) up 0.3% month over month, versus the 0.2% expected by economists according to Dow Jones. Year over year, it was 2.6%. Look at core PCE without energy or food and it was up 2.8% since June 2024.\n\n“Looking ahead, spending should come under pressure in H2 2025 as the labor market loses energy, interest rates stay high, and tariffs push inflation up,” wrote Nationwide Financial Markets Economist Oren Klachkin. “We foresee slower income growth as the main reason behind sub-1% GDP growth in H2 2025.”\n\nThe 3% annualized growth in GDP for the second quarter, announced in July, was more happenstance. When the Trump administration initially announced broad tariffs, many companies decided to sharply boost their imports in advance to avoid the additional charges, which are paid by the importers, not the exporters. Imports are subtracted from gross domestic product, just as things like foreign students in the U.S. paying tuition adds to GDP because what they pay is technically an export.\n\nWhy did none of this appear before? “Looking at the headline consumer price index isn’t where the tariffs are visible, it's in goods prices and the increase in household appliances, apparel and toys highlight that tariffs are being passed onto the consumer, it just takes time,” Oxford Economics wrote two weeks ago.\n\nTariff concerns are again boiling over. One example came in Apple’s July 31, 2025, earnings call.\n\n“Finally, the situation around tariffs is evolving, so let me provide some color there,” said CEO Tim Cook. “For the June quarter, we incurred approximately $800 million of tariff-related costs. For the September quarter, assuming the current global tariff rates, policies and applications do not change for the balance of the quarter, and no new tariffs are added, we estimate the impact to add about $1.1 billion to our costs.”\n\nA well-known German tool company called Festool announced that all prices starting August 1 would go up because of tariffs.\n\nThis may be an unsatisfying look at the economy and state of the country, but that is where we are. In the short and long runs, no one knows what will happen.\n\nEditorial StandardsReprints & Permissions","summary":"Jobs saw a -258K revision. Trump changes tariffs again. Q2 GDP was up for all the wrong reasons. Wages ran hot. Manufacturing is hurting. Nobody knows what will happen.","url":"https://www.forbes.com/sites/eriksherman/2025/08/01/jobs-take-massive-downward-revisions-uncertainty-and-risk-ride-high/","image":"https://imageio.forbes.com/specials-images/imageserve/688d4e818c670149f1de345e/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-08-01 23:34:47","author":"Erik Sherman,Senior Contributor","authors":["Erik Sherman","Senior Contributor"],"language":"en","source_country":"US","sentiment":-0.62},{"id":347406144,"title":"Letters: Bay Area residents should prepare a smoke safety plan","text":"Bay Area residents need\na smoke safety plan\n\nAfter a historic year of wildfires in Southern California, we are entering dry season in Northern California, where wildfire risk rises dramatically.\n\nAs a pulmonary physician, I want to remind the general public of the dangers of breathing in wildfire smoke. Inhaling particles in wildfire smoke leads to inflammation throughout the entire body. It can cause flares of asthma and emphysema, heart attacks, strokes and unstable heart rhythms. Some people are especially high risk, like older adults, children and pregnant women.\n\nIt’s important to be prepared for periods of poor quality by knowing how to create a “clean room” in your house. You can get air quality alerts from the Bay Area Air Quality Management District so you know when air quality will be poor.\n\nFor additional tips to protect you and your family from the harmful effects of wildfire smoke, please visit lung.org/wildfires.\n\nLaura Myers\n\nStrong policies beat\nredistricting gambit\n\nGavin Newsom’s proposal to redraw California congressional districts if Texas does so is a desperate, reactive idea. There is a more effective, long-lasting and powerful strategy to make Democrats relevant again.\n\nMake the government actually “democratic,” not just in name only. Legislate what people want: Tax the ungodly rich, cut the military budget, provide universal health care and child care, protect basic human rights; there is so much more that can and should be done.\n\nSince Bill Clinton, Democrats have abandoned the working and middle classes and championed corporations and the rich. It’s way past time to get the “for the people” ethic back on track. People are rightly furious with Democrats because they always cave, while Republicans gut and destroy.\n\nThat’s the strategy that Zohran Mamdani has so effectively employed to excite people and put him at the brink of New York’s mayorship. It’s not rocket science. It’s common sense.\n\nKeith Nakatani\n\nTreat Blvd. bike lane\nis still a bad idea\n\nOnce again, a small number of cyclists are demanding bike lanes on Treat Boulevard, a heavily trafficked, multi-lane thoroughfare that’s only getting worse with all the new construction. We shot it down once before; it’s time to do it again.\n\nThe Canal Trail parallels Treat and offers a great (and safer) option for cyclists. There is no excuse to carve out a lane when a great option exists. And would bicyclists even use it? Almost no bikers use the expensively built bike lane on Bancroft Road.\n\nEnough already. Tell the city and county to stop this costly project.\n\nDenise Kalm\nWalnut Creek\n\nForeign aid is good\nfor the U.S. and globe\n\nAcross the country, tremendous confusion and anger have been felt in recent weeks. During times like these, it’s especially important to consider the things we do have. America has clean water, food and health care, resources that are often taken for granted.\n\nMost Americans assume we spend around 25% of our federal budget on foreign aid. In actuality? It’s about 1%. Providing aid to the world’s poorest countries creates greater global security, a stronger global economy, and diplomatic connections.\n\nAdvocates don’t belong to one party, movement, religion or person. Ronald Reagan was a proponent of foreign aid, creating the framework of large-scale foreign aid as it stands today. Barack Obama’s launch of the Global Health Initiative revolutionized health systems in 80 countries. Amid the ever-increasing partisan polarization, this is crucial. Despite other issues persisting, our country promises to serve and protect others just as we have done in the past.\n\nLillie Woodard\n\nOnly two-state solution\ncan bring lasting peace\n\nI am aghast at what is happening in Gaza. By not condemning Israel’s actions, the U.S. is complicit in the destruction of Gaza and the killing and starvation of the Palestinian people. (Donald Trump even suggested the Palestinians leave Gaza, and he would create the Riviera of the Middle East along the Gaza Strip. That is imperialism.)\n\nWhere is the world’s outrage? Fortunately, more countries are speaking out. France suggested, as part of the peace process, the need for a two-state solution. Many other countries agree, and other Western countries are expected to announce agreement. Israel strongly condemned France, and the U.S. has expressed opposition to the proposal by France.\n\nThe U.S. must stop sending weapons to Israel, condemn Israel’s actions in Gaza, insist on the experienced United Nations food aid distribution, and support a two-state policy. This is the only way permanent peace can be achieved.\n\nArlene Reed","summary":"Also: Strong policies &#124; Bad idea &#124; Foreign aid &#124; 2-state solution. East Bay Times reader letters to the editor for Aug. 3, 2025.","url":"https://www.mercurynews.com/2025/08/01/letters-bay-area-residents-smoke-safety-plan/","image":"https://www.mercurynews.com/wp-content/uploads/2021/08/SJM-L-SMOKEWED-0819-12.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-01 23:30:26","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.055}]}