{"offset":0,"number":50,"available":15496,"news":[{"id":291568696,"title":"DAILY MAIL COMMENT: Britain cannot defend Europe on the cheap","text":"Sir Keir Starmer's apparent readiness to put British 'boots on the ground' in Ukraine will have sent a shiver down many spines.\n\nWith the abject failures of Iraq and Afghanistan still fresh in the memory, the public will take some persuading that military intervention in another foreign war would be judicious.\n\nAt the very least they will want to know in detail how extensive any campaign would be and what its precise objectives were.\n\nThrowing thousands of troops into a deadly conflict zone without a clear strategy for getting them out again would be an appalling error.\n\nDowning Street speaks of the British Army possibly playing a peacekeeping role if a ceasefire deal can be worked out between Ukraine and Russia.\n\nBut we know from bitter experience – in Ireland, Lebanon, Basra and elsewhere – that peacekeepers can quickly become targets. The risks to our young servicemen and women shouldn't be underestimated.\n\nTo be fair to the Prime Minister, he is trying to convince a sceptical President Donald Trump that Europe is serious about funding its own defence.\n\nWith some justification, the US believes since the Cold War most European countries have shredded their military budgets, leaving Uncle Sam to pick up the tab.\n\nSir Keir hopes to be a bridge between Mr Trump and the EU, persuading the former to continue supporting the Ukrainian war effort and the latter to pay more towards it.\n\nHowever, he must lead by example. The British Army has been so diminished by cuts it would struggle to put even a modest combat force into the field indefinitely.\n\nLabour pledged to increase UK defence spending from its current 2.3 per cent of GDP to 2.5 per cent but has shown no urgency in doing so. Sir Keir should show his resolve by making that happen now.\n\nBut 2.5 per cent is the minimum requirement. Most military experts believe defence spending should be raised to at least 3 per cent of GDP. Mr Trump, with typical bravado, says all Nato countries should spend 5 per cent.\n\nFinding the money for any rise will be problematic. Rachel Reeves's disastrous Budget, with its £40billion of extra taxation and increased spending commitments of up to £72billion across the Parliament have boxed Sir Keir into a tight corner.\n\nGrowth is flatlining because of his Chancellor's ineptitude and further tax rises would almost certainly send us hurtling into recession. Unless he indulges in yet more ruinous borrowing, the PM's only option is to cut the size of the state. The unions will squeal but dangerous times require politicians of courage.\n\nAhead of the European crisis summit yesterday, Sir Keir described this as a 'once-in-a-generation' moment for the collective security of the continent. It is also a major test of his leadership.\n\nCultural fightback \n\nEchoing US Vice-President JD Vance's withering criticism of Europe's failure to defend free speech and personal liberty, Kemi Badenoch warned yesterday that 'the poison of Left-wing progressivism' threatens the future of Western civilisation.\n\nBy attacking the woke orthodoxy which trashes this country's history and culture, she is in tune with the majority of British people, who wonder how patriotism became such a dirty word.\n\nThe Conservative Party faces an uphill task to regain the trust of the electorate, but seeking to make national pride fashionable again is a good starting point.","summary":"DAILY MAIL COMMENT: Sir Keir Starmer's apparent readiness to put British 'boots on the ground' in Ukraine will have sent a shiver down many spines.","url":"https://www.dailymail.co.uk/debate/article-14407121/DAILY-MAIL-COMMENT-Britain-defend-Europe-cheap.html","image":"https://i.dailymail.co.uk/1s/2025/02/17/22/95310371-0-image-m-14_1739830077401.jpg","video":null,"publish_date":"2025-02-18 01:04:08","author":"Daily,Editor","authors":["Daily","Editor"],"language":"en","source_country":"gb","sentiment":-0.207},{"id":291568344,"title":"CNBC Daily Open: Europe wants a say in Ukraine peace plan","text":"Emergency meeting by EuropeEuropean leaders gathered Monday in Paris for an emergency summit, hastily assembled by French President Emmanuel Macron after it appeared that Europe would be left out of the negotiating table in U.S.-led Russia-Ukraine peace talks. Washington and Moscow are set to meet this week in Saudi Arabia. Ukrainian President Volodymyr Zelenskyy, however, said Monday that \"Ukraine will not take part. Ukraine did not know anything about it.\"\n\nEuropean defense stocks jumpOn Monday, the Stoxx Europe Aerospace & Defense index hit a record and shares of Europe defense companies, such as Renk Group and Saab, jumped. They were juiced by European Union President Ursula von der Leyen saying at the Munich Security Conference that member states will be allowed to increase their spending on defense and security without breaching the bloc's rules on budget deficit spending.\n\nAnother high for the Stoxx 600U.S. markets were closed Monday for the Presidents' Day break. The pan-European Stoxx 600 index rose 0.54%, regaining lost ground from Friday to close at another record high of 555.42 points. U.K. and euro area bond yields were broadly higher as traders weighed the potential for higher national defense spending following the Munich Security Conference.\n\nTrump-related terms in earnings callsU.S. companies are fielding growing questions on how U.S. President Donald Trump's policies on international trade, immigration and diversity will affect business. A CNBC analysis shows words related to those issues are increasingly popping up on the earnings calls of S&P 500-listed companies. Here's how companies are responding to queries around Trump-related words, such as \"tariff,\" \"DOGE\" and \"Gulf of America.\"\n\n[PRO] Stocks to short: Wolfe ResearchMajor U.S. benchmarks ended last week in the green to close near their all-time highs. What's more, this charge forward isn't led by tech this time, signaling a broadening rally, as CNBC's Bob Pisani notes. Amid this advance, there are some stocks that may be overextended to the upside, making them prime targets for investors to short, according to Wolfe Research.","summary":"European leaders hastily gathered in Paris to discuss Ukraine peace plans. Defense stocks jumped after EU members were allowed to ramp up spending on security.","url":"https://www.cnbc.com/2025/02/18/europe-wants-a-say-in-ukraine-peace-plan.html","image":"https://image.cnbcfm.com/api/v1/image/108103315-1739839286317-gettyimages-2198546996-AFP_36XP9HP.jpeg?v=1739839332","video":null,"publish_date":"2025-02-18 01:00:35","author":"Yeo Boon Ping","authors":["Yeo Boon Ping"],"language":"en","category":"politics","source_country":"us","sentiment":-0.17},{"id":291568328,"title":"Alleged Leader of 'Zizians' Group Arrested, Linked to Multiple US Killings","text":"The alleged leader of the cult-like group the \"Zizians\" that is connected to the killing of US Border Patrol Agent David Maland, has been arrested, according to Maryland State Police.Why It MattersThe \"death cult,\" is said to revolve around Ziz, who is a transgender woman. Ziz, whose legal name is Jack LaSota, garnered a following online after posting about her ethical and social theories on her blog, Sinceriously.The Zizians have been tied to Maland's killing as well as five other homicides in Vermont, Pennsylvania and California. Maland, 44, was killed in northern Vermont from a shot in the neck just after President Donald Trump was sworn in hundreds of miles away in Washington, D.C. Maland, who worked security duty at the Pentagon during the September 11 attacks, was conducting a traffic stop near the Canadian border.What To KnowJack Lasota, 34, was arrested on Sunday along with Michelle Zajko, 33. They are facing multiple charges including trespassing, obstructing and hindering as well as possession of a handgun in a vehicle, as reported by The Associated Press.Starting in 2021, LaSota reportedly advocated the killing of various people and the punishment of \"non-good\" people, like non-vegans, according to Aella, who previously posted to X about knowing several people involved or adjacent to the Zizians.Jessica Taylor, friend of the person who killed Maland, previously told Newsweek it seems that LaSota recruits transgender members who might be financially vulnerable and ripe for radicalization. Most members are acting on their own accord, however, Taylor said she believes.The Associated Press reported that the Zizians consists of young, highly intelligent computer scientists, most of whom are their 20s and 30s. The group met online and shared anarchist beliefs, which became increasingly more violent. LaSota's posts were against perceived enemies including so-called rationalist groups online.LaSota had faked their own death in 2022, and an obituary was published in September that year claiming that they died in a boating accident.But on January 13, 2023, LaSota was arrested in Pennsylvania for \"obstructing administration of law\" and \"disorderly conduct.\" LaSota made bail in June and stopped showing up to court.Zajko is a bioinformatics researcher. The guns used to kill Maland were determined to belong to Zajko. She was identified as a person of interest in other murders as well, including the murder of Curtis Lind, a landlord in Vallejo, California, who was stabbed to death three days before the Vermont shooting.Lind and Maland's deaths come two years after Zajko's parents, Richard and Rita Zajko, were found dead in their Delaware County, Pennsylvania, home in January 2023.What's NextA bail hearing is scheduled for both Lasota and Zajko on Tuesday at the Allegany District Court at 11 a.m.","summary":"Jack Lasota and Michelle Zajko were both arrested on Sunday.","url":"https://www.newsweek.com/jack-lasota-leader-zizians-group-arrested-killings-2032427","image":"https://d.newsweek.com/en/full/2590216/ziz.png","video":null,"publish_date":"2025-02-18 00:51:18","author":"Monica Sager","authors":["Monica Sager"],"language":"en","source_country":"US","sentiment":-0.096},{"id":291568810,"title":"Hundreds fired at aviation safety agency, union says","text":"The Trump administration has begun firing hundreds of Federal Aviation Administration (FAA) employees, according to the Professional Aviation Safety Specialists (PASS) union, weeks after a fatal mid-air plane collision in Washington DC.\n\nSeveral hundreds of the agency's probationary workers - who have generally been in their positions for less than a year - received the news via email late on Friday night, a statement from PASS's head, Alex Spero said.\n\nIt is part of a cost-cutting drive, driven by Elon Musk's Department of Government Efficiency (Doge), which aims to drastically cut the federal workforce.\n\nSpero called the firings \"shameful\" and said they \"will increase the workload and place new responsibilities on a workforce that is already stretched thin\".\n\nThe BBC has contacted the FAA and Department of Transport for comment.\n\nAccording to Spero's statement, workers impacted include systems specialists, safety inspectors, maintenance mechanics and administrative staff, among others.\n\nCriticising the move, Spero said the FAA is \"already challenged by understaffing\", and that the decision to cut staff was \"unconscionable in the aftermath of three deadly aircraft accidents in the past month\", including the deadly crash in Washington DC's Ronald Reagan airport, in which 67 people were killed.\n\nJason King, who is among those laid off, said he was worried about how the move would impact aviation safety.\n\nHe told WUSA9, an affiliate of the BBC's US partner CBS, that firing people directly involved with air safety is \"concerning for public safety in our national airspace.\"\n\nMr King, whose work at the FAA involved directly addressing safety concerns, said the cuts \"threaten public trust and increases the likelihood of future accidents.\"\n\n\"Aviation safety should never be treated as a budget item that can just be completely cut,\" he added.\n\nOn Monday, a team from Elon Musk's SpaceX was set to visit the FAA to suggest improvements to the US's air traffic control system, following the Washington DC plane collision in January.\n\nThough the National Transport Safety Board has not yet determined the cause of the collision, staffing levels in air traffic control at the airport, were reportedly below normal levels on the evening of the crash.\n\nTransport Secretary Sean Duffy said the SpaceX team's visit to the FAA would give them a \"first-hand look at the current system\", and would allow them to figure out how they make \"a new, world-class air traffic control system that will be the envy of the world.\"\n\nHe added that he plans to visit the FAA Academy - which provides training for the organisation's workforce - later this week, to learn more about staff member's education \"and how we can ensure that only the very best guide our aircraft\".\n\nPresident Donald Trump caused controversy last month when he suggested diversity programmes supported by his predecessors had lowered hiring standards that could have affected the Washington DC plane crash.\n\nThe Trump administration has ordered government agencies to fire nearly all of their probationary employees, who have not yet earned job protection. It is a move that could potentially affect hundreds of thousands of people.\n\nAmong those losing their jobs in Friday's cuts were half of the Centers of Disease Control's so-called \"disease detectives\", multiple health officials told CBS.\n\nThe researchers - officially officers serving in a two-year programme in the organisation's Epidemic Intelligence Service - are often deployed on the front lines of major disease outbreaks.\n\nMany members of the scheme have gone on to rise in the agency's ranks.\n\nPresident Trump has also asked the Supreme Court to allow him to fire the head of an independent ethics agency that protects whistleblower federal employees.\n\nHampton Dellinger, the head of the US Office of Special Counsel, sued the Trump administration after being fired last month.\n\nIt is thought to be the first case related to Trump's series of executive actions to reach the country's highest court.\n\nSince taking office, the president has cut more than a dozen inspectors general at various federal agencies.","summary":"The Trump administration has begun firing hundreds of Federal Aviation Administration (FAA) employees, according to the Professional Aviation Safety Specialists (PASS) union, weeks after a fatal mid-air plane collision in Washington DC.","url":"https://www.myjoyonline.com/hundreds-fired-at-aviation-safety-agency-union-says/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/02/image-637.png","video":null,"publish_date":"2025-02-18 00:50:50","author":"Abubakar Ibrahim,Bbc 50am","authors":["Abubakar Ibrahim","Bbc 50am"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.099},{"id":291566356,"title":"‘Unjustified’: Fears RBA will deliver 11th hour blow to homeowners and keep rates on hold","text":"Judo Bank chief economic advisor Warren Hogan told Yahoo Finance it was still too early for the RBA to cut interest rates and the board risked driving up inflation before it was under control.\n\n“It might sound attractive to a lot of Australians with mortgages to get a rate cut or two and save $50 a month in the short-term over the next six months, maybe even 12 months,” Hogan said.\n\n“But if that puts at risk rates going up by a percentage point or two, and then having to come up with actually not just that $50 back, but then another $100 or $150, do they really want that $50 right now and then putting at risk that it’s going to go up later?\n\n“If you cut just as the economy is picking up and before inflation comes down, you risk not only stopping inflation coming down, but inflation going back up again, and then having to raise rates and not just a few times, a lot.\n\n11th hour blow feared for Aussie homeowners\n\nThe broad expectation among experts and commentators is that struggling homeowners will be delivered a long-awaited reprieve this afternoon via an interest rate cut.\n\nBut there’s still a number of economists and market-watchers who think the Reserve Bank could deliver an 11th hour blow and dash the hopes of millions by keeping the cash rate on hold.\n\nIt’s widely tipped the RBA’s long and painful war on inflation has reached victory point, with CPI now firmly within its long-term two to three per cent range.\n\nGraham Cooke, head of consumer research at financial comparison website finder.com.au, said three-in-four economists on its 37 member expert panel are tipping a rate cut.\n\n“Headline inflation is within the target range, and has been for a while,” Mr Cooke said. “With trimmed mean inflation falling also, this has heaped pressure on the RBA to cut.\n\n“While most experts are confident the cash rate will finally be slashed, it’s not a done deal.”\n\nMORE:Sneaky bank trick that will stop RBA cut\n\nTen of the experts on finder.com.au’s cash rate panel expect the RBA to hold steady today, he revealed.\n\nOne of them is Noel Whittaker, an adjunct professor at the Queensland University of Technology, who said the RBA board could feel inclined to wait one more month than risk moving too soon.\n\n“The problem is inflation in the building industry remains massive, labour shortages are severe, and the job market is still strong – keeping inflationary pressure on the economy,” Dr Whittaker said.\n\n“Right now, I don’t see how a rate cut can be justified, even though I have enormous sympathy for mortgage holders doing it tough. It’s a sad system when they bear the brunt of the fight against inflation.”\n\nMORE: Home loan trap taking years to escape\n\nProfessor Richard Holden from UNSW’s Business School said discussions about inflation are excluding one important detail.\n\n“Adjusting for subsidies, core inflation is still sitting at 3.3 per cent,” Professor Holden said, and that’s outside the target range.\n\nHis colleague Evgenia Dechter, an expert in macroeconomics and an adjunct professor at UNSW, also shares concerns about core inflation remaining “elevated”.\n\n“With the RBA’s focus on price stability and its credibility at stake, I think they are likely to hold the cash rate until the next board meeting,” Dr Dechter said.\n\nStella Huangfu, an economist and associate professor at the University of Sydney, thinks the RBA should hold today.\n\n“Inflation has only just returned to the target range, so it’s probably too early to cut rates,” Dr Huangfu said. “Plus, the job market is still strong, which shows the economy is holding up well.”\n\nOxford Economics Australia’s head of macroeconomic forecasting, Sean Langcake, said the RBA board’s deliberations will be “a close run”, with a few unanswered questions likely to weigh heavy.\n\n“There are still questions about where underlying inflation will be once the impact of subsidies wash out,” Mr Langcake said. \n\n“Services inflation is still looking very strong – a by-product of the labour market still operating beyond its capacity. The RBA may opt to wait and see how the labour market plays out over the next few months before cutting rates.”\n\nLeading business figure Peter Boehm, managing director of Pathfinder Consulting, doesn’t share the view that rates must come down because inflation is easing.\n\n“Inflation has been impacted by government subsidiaries and it is unclear whether the reduction is sustainable,” Mr Boehm said. “If it’s not, reducing rates will be inflationary.”\n\nHe added: “The strength of the labour market has seen low unemployment rates. You don’t reduce rates in these circumstances because they will have an inflationary impact.”\n\nOn top of that, the Australian dollar is weak against both the US dollar and the currencies of major trading partners, pushing up imports prices and putting upward pressure on inflation.\n\n“Reducing interest rates may further exasperate this position,” he said.\n\nAnd the intense uncertainty in global trade and financial markets, thanks to US President Donald Trump’s hefty tariff threats, is cause for concern.\n\n“This could have negative impacts on the Australian economy, and in such circumstances, it would be better to wait and see what these impacts might translate into. \n\n“Reducing rates now would therefore not be a prudent move.”\n\nIt’s now approaching four year since the RBA began hiking interest rates, taking the cash rate from a historic low of 0.1 per cent to 4.35 per cent currently via a whopping 13 increases.\n\nA rate cut today would be the first downward movement in five years.\n\nAussies paying off the average mortgage balance of $641,416 would save about $100 each month should rates fall by 25 basis points.\n\nThose who’ve purchased a home more recently will keep even more in their pockets.\n\nWith the average home price in Sydney sitting at $1.13 million, and based on a loan-to-value ratio of 80 per cent, the monthly savings would equate to $145.\n\nWith an election looming, the government is hoping rates do come down, but Treasurer Jim Chalmers said there will be a focus on cost-of-living relief regardless.\n\n“The cost of living has been the number one focus of this government, and that will continue to be the case, no matter what the Reserve Bank decides independently,” Dr Chalmers said.","summary":"Those preparing to celebrate the RBA’s widely expected cut to interest rates could be in for a shock, a number of experts have warned.","url":"https://www.news.com.au/finance/economy/interest-rates/unjustified-fears-rba-will-deliver-11th-hour-blow-to-homeowners-and-keep-rates-on-hold/news-story/cb8a6995002bf16de01c024842ab7c9e?from=rss-basic","image":"https://content.api.news/v3/images/bin/7e2c5a4195c090488742739a2f90b336","video":null,"publish_date":"2025-02-18 00:42:08","author":"Shannon Molloy","authors":["Shannon Molloy"],"language":"en","source_country":"au","sentiment":-0.34},{"id":291566060,"title":"Newspaper headlines: ‘Test of strength’ for Starmer over Ukraine war","text":"Most of the papers focus on the latest in the Ukraine war, as peace talks between the US and Russia – but not Ukraine – begin in Saudi Arabia on Tuesday. The Guardian focuses on quotes from Prime Minister Keir Starmer, who says he would consider deploying UK troops to Ukraine in the event of a lasting peace deal. But he says “there must be a US backstop, because a US guarantee is the only way to effectively deter Russia from attacking Ukraine again”. The Times also focuses on Sir Keir urging the US to offer security guarantees to Ukraine. It says he will travel to Washington next week for talks with US President Donald Trump, making him the first European leader to do so. Senior UK government sources tell the paper Sir Keir will have “serious conversations” with Trump about the possibility of the US offering security guarantees. America’s Ukraine envoy has signalled willingness to consider offering such guarantees, the paper adds. The Mirror calls it a “test of strength” for Sir Keir, as it pictures him and Trump facing each other. It says Sir Keir’s comments mark a “warning” to the US that it must help keep the peace in Ukraine. The Mirror adds that the prime minister also emphasised that Ukraine must be included in peace talks between the US and Russia. It’s a “Starm offensive”, says the Metro, which says the prime minister has embarked on a mission to stand up for Ukraine as it is “kept on the sidelines” of the peace talks. The PM also says the world is at a “once in a generation moment” to contain the threat of Putin. The Financial Times focuses on the remarks from Ukrainian President Volodymyr Zelensky, who says his country will not recognise the outcome of these peace talks if Ukraine isn’t involved. Russia is framing Tuesday’s meeting in Riyadh as “the start of its return from the cold” after its invasion of Ukraine, the paper says. The US says the talks are aiming to work out whether “the Russians are serious and if they’re on the same page” about ending the war, the paper adds. The i newspaper focuses on Sir Keir’s suggestion he would consider sending troops to Ukraine as part of a European peacekeeping force. Former defence chiefs tell the i newspaper that a UK deployment to Ukraine would be “bigger than in Afghanistan”, leading the paper to suggest the UK might need to see more cuts to afford the extra defence spending. But the Daily Telegraph says the UK is at odds with some European leaders over sending troops to Ukraine – with Germany particularly reluctant. It quotes Olaf Scholz, Germany’s chancellor, as saying the idea is “completely premature” and “highly inappropriate”, and that he is “a little irritated”. It says Scholz left the talks in Paris early as splits emerged. Meanwhile the main picture for the paper is of Deputy PM Angela Rayner, who has arrived in Ethiopia to meet business representatives. Under the headline “Rayner on parade”, the paper says she has been accused of “grandstanding and ignoring her brief”. Instead of Ukraine, the Daily Mail focuses on a speech from Conservative leader Kemi Badenoch, who yesterday warned that Western values were under threat from “poisonous” woke ideology. The paper says she launched a defence of free speech, free markets and the rule of law, in a fiery speech at a right-wing conference. According to the Mail, she made a direct reference to Sir Keir taking the knee to support the Black Lives Matter movement in 2020, saying people must “get off our knees and start fighting for the West”. The Daily Star reports that Generation Z – those born between 1997 and 2012 – are “ditching vegan diets”. The paper hails it as the “age of the sausage”, and suggests the cost-of-living crisis could be part of the reason. The cost-of-living crisis also features on the front of the Daily Express, which reports that up to nine million pensioners – or three out of four – lived in uncomfortably cold homes in January. It comes from figures from the charity Age UK, which is today delivering a petition to Downing Street demanding action, after the government cut back on who was eligible for winter fuel payment. Meanwhile the front page’s main picture is of the Princess of Wales, who shared sketches she and her children drew of themselves.","summary":"Most of the papers focus on the latest in the Ukraine war, as peace talks between the US and Russia &#8211; but not Ukraine &#8211; begin in Saudi Arabia on Tuesday. The Guardian focuses on quotes from Prime Minister Keir Starmer, who says he would consider deploying UK troops to Ukraine in the event of &#8230;\n\n\nThe post Newspaper headlines: &#8216;Test of strength&#8217; for Starmer over Ukraine war appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/newspaper-headlines-test-of-strength-for-starmer-over-ukraine-war/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/67df/live/0494d990-ed82-11ef-a319-fb4e7360c4ec.jpg","video":null,"publish_date":"2025-02-18 00:36:34","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.045},{"id":291567402,"title":"Letters: Fremont’s homeless camp ban is cruel and misguided","text":"Homeless camp ban\nis cruel, misguided\n\nRe: “Homeless camp ban is among state’s toughest” (Page B1, Feb. 13).\n\nThe Fremont City Council’s recent policies and actions are nothing short of cruel. Essentially the city is criminalizing homelessness and poverty.\n\nWhat is criminal is allowing people to sleep on sidewalks, in vacant lots and in parks in the wealthiest nation in the world. Solving the homeless problem requires complex solutions that include homes and jobs, and some people need rehabilitation and counseling. But mostly, people need compassion and support.\n\nOversimplified solutions only make things worse while ignoring solving homelessness and poverty problems.\n\nJoe Navarro\n\nCollaboration a must\non insurance issues\n\nAs wildfires and other natural disasters become more frequent and severe, the financial burden on homeowners continues to escalate with exorbitant insurance premiums.\n\nSeveral factors contribute to this predicament:\n\nRegulatory challenges: The government in Sacramento has struggled to implement effective policies that balance consumer protection with the financial realities faced by insurance companies.\n\nLegislative priorities: Legislators are distracted by vote bank issues, leaving the insurance market reforms inadequately addressed.\n\nInsurance industry dynamics: Driven by profit motives, they’ve increasingly withdrawn from high-risk areas or raised premiums to unsustainable levels.\n\nThis confluence of regulatory inefficacy, legislative oversight and industry practices has left California homeowners in a precarious position. The FAIR Plan, intended as a last resort for those unable to secure traditional insurance, is now overwhelmed and insufficient to meet the growing demand.\n\nIt’s imperative for stakeholders to collaborate on comprehensive solutions that ensure both the availability and affordability of homeowners insurance.\n\nSanjay Kalra\n\nTrump’s autocracy\nmust be stopped\n\nDonald Trump is creating a one-man show; autocracy. But, then he told us he was going to be a dictator.\n\nHe is eliminating too many government agencies and firing career workers, people who may have longevity in their positions. There is no way the Trump administration could have looked at each employee to determine who should be let go in just three weeks. Trump needs to be held accountable.\n\nEvidently, guardrails have been eliminated, and he is doing his usual of pushing all boundaries. He needs to be stopped, now.\n\nMedia should boycott\ndictatorial Trump\n\nRe: “AP barred from Oval Office over Gulf name” (Page A2, Feb. 12).\n\nIt’s time for the media to bite the bullet and refuse to cover Donald Trump. When he shows up in the Oval Office and there are no cameras, mics or floodlights, he’ll realize that the press coverage he has always courted was the “wind beneath his wings.” No reporters in the press room every day with pens poised over pads will give Karoline Leavitt pause, as well.\n\nIt will be hard for a few days, undoubtedly, but it won’t be long before Trump feels the lack of attention making it hard to breathe. I’m pretty sure that a large portion of the populace will find it refreshing not to have to see his picture everywhere or listen to his inane rants. The embargo should also cover Elon Musk for all the same reasons.\n\nN. L. Morris\nWalnut Creek\n\nTrump, Defense keeping\ncampaign promises\n\nI was so pleased to read how the Trump administration is following through on promises made during the campaign. Our new, clear-sighted Secretary of Defense has been rooting out the misguided “woke” policies of the previous administration. His latest target was one of our largest military institutions in the nation, Fort Liberty in North Carolina.\n\nIt had been known as Fort Bragg for many years until Congress took exception to the naming of military institutions after Confederate slave-owning officers. Congress passed a law making it illegal to name a fort after a slave-owning Confederate officer. So President Donald Trump’s new head of the Defense Department somehow managed to find a soldier who served in World War II named Private Roland Bragg and so Fort Liberty’s name was changed to honor him. What a fortuitous coincidence.\n\nJoseph Sklar\nCastro Valley","summary":"Also: Collaboration a must &#124; Trump's autocracy &#124; Media boycott &#124; Campaign promises. East Bay Times reader letters to the editor for Feb. 18, 2025.","url":"https://www.mercurynews.com/2025/02/17/letters-fremonts-homeless-camp-ban-cruel-misguided/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/SJM-L-BANFREMONT-02XX-1.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-18 00:30:23","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.032},{"id":291561866,"title":"Notre Dame Criticized for Calling Hiring for Catholicism and Diversity ‘Equally Important’","text":"SOUTH BEND, Ind. — The University of Notre Dame is facing a fresh round of criticism after the institute’s chief academic officer told faculty that hiring women and minorities is “equally important” to its mission as is hiring Catholics.\n\nJohn McGreevy, Notre Dame’s provost, shared the hiring priorities at the start of the spring semester in a Jan. 17 faculty-wide email, which has since been obtained by the Register. \n\nAfter noting the importance of hiring Catholics and “other faculty deeply committed to our mission,” McGreevy wrote that “a second overlapping and equally important goal is to increase the number of women and underrepresented minorities on our faculty so that we become the diverse and inclusive intellectual community our mission urges us to be.”\n\nMcGreevy’s equation of the importance of Catholic and diversity hiring has received criticism both on and off the South Bend, Indiana, campus. Detractors have described it as the latest indication that the prestigious university is overly influenced by secular ideologies and is willing to dilute its Catholic identity for the sake of its peer institutions’ esteem. \n\nOthers, however, have defended the provost’s directive, describing it as consistent with Notre Dame administrators’ desire to better reflect the demographic makeup of the universal Church and to redress injustices committed along racial and sexual lines. \n\nThe debate about priorities isn’t merely academic, however, as the provost’s stated vision is slated to guide Notre Dame’s academic hiring practices in the near future.\n\nIn his email, McGreevy wrote that his office will issue a new hiring guide “to support academic units in their pursuit of these goals,” which will go into effect on July 1.\n\n“[The guide] will include strategies and best practices to build broad applicant pools, evaluate candidates equitably, and ensure that faculty candidates who visit Notre Dame can imagine themselves as thriving future members of our academic community,” he said.\n\nThe Register could not independently verify that the guide was sent out to heads of Notre Dame’s academic units by the end of January, as McGreevy said it would in the Jan. 17 faculty-wide communication. \n\nMcGreevy’s email came out just days before the Trump administration announced measures to curtail so-called DEI practices on college campuses. It is unclear how the president’s Jan. 21 executive order, which includes cutting off federal funding to universities that promote such frameworks, will impact Notre Dame’s hiring practices.\n\nNotre Dame administrators did not respond before deadline to a request for comment.\n\nNotre Dame and DEI\n\nNews of the provost’s email was first publicized in a Feb. 17 First Things article by Scott Yenor, who described McGreevy’s directive as a “stunning announcement” that has nonetheless been “years in the making.” \n\n“Few universities are as trusted or admired by Christian believers as Notre Dame,” wrote Yenor, a Boise State University political scientist and Washington fellow of at The Claremont Institute’s Center for the American Way of Life. “But Notre Dame has also built a DEI apparatus that threatens its Catholic mission.” \n\n“DEI” refers to “Diversity, Equity and Inclusion,” a set of practices that have been implemented in workplaces, government agencies and university campuses in recent years to correct perceived systemic disadvantages faced by minority groups.\n\nDEI has been controversial within U.S. Catholic circles, as it has been in the country at large. Some prominent Catholics, like Bishop Robert Barron of the Diocese of Winona-Rochester, Minnesota, have criticized the approach for presenting values like “diversity” as absolutes, supplanting true absolutes like “love” in the process. Others, like the president of Regis High School in New York City, have called for pursuing a Catholic alternative to DEI rooted in “belonging, dignity and justice.”\n\nYenor, who has also just published a 30-page examination of DEI practices at Notre Dame, described the university’s related policies as no different than its elite academic peers, but “wrapped up in Catholic social justice language.”\n\nAccording to Yenor, a Lutheran, the university’s DEI-related activities have included the creation of an Office of Institutional Transformation in 2022 and the establishment within it of the Center for Diversity, Equity, and Inclusion in 2023. He estimates that DEI-related salaries cost the university $6.5 million, while the university put on 167 related events during 2024. \n\nThe university has previously defended its promotion of diversity, equity and inclusion as consistent with its Catholic mission. \n\nHoly Cross Father John Jenkins, then the university’s president, described the DEI center’s opening as “a next step for Notre Dame to be fully the kind of community we aspire to be … the best version of ourselves.”\n\nThe university’s new strategic framework, which aims to make Notre Dame the preeminent global Catholic research university by 2033, also spoke positively of the connection between DEI and Catholicism.\n\n“Becoming more diverse and strengthening the University’s Catholic mission is a single project, not two parallel tasks,” states the framework, which has been criticized by Notre Dame historian and Holy Cross Father Wilson (Bill) Miscamble for lacking a distinctively Catholic vision.\n\nThe Catholic university’s expansion of DEI initiatives in the past two years came at time when nearly 50 other American institutions of higher learning closed their DEI-related offices. Some on campus have wondered if the DEI push at Notre Dame might be over, with President Donald Trump in office.\n\nAccording to one student leader, Notre Dame’s administration has long promoted “woke” ideologies, and McGreevy’s hiring priorities was simply an instance of “saying the quiet part out loud.” \n\n“By prioritizing race and gender at a level ‘equally important’ to Catholicism, this policy of DEI hiring sacrifices the university’s character for the sake of the meaningless buzzwords ‘diversity’ and ‘inclusion,’” said Michael Canady, the editor-in-chief of The Irish Rover, an independent Catholic student newspaper. “It’s even more scandalous that the administration cloaks its woke initiatives with a veneer of Catholic social doctrine when, in reality, DEI directly contradicts Church teaching.”\n\nCatholic Faculty \n\nHowever, other members of the Notre Dame community saw McGreevy’s email and the university’s larger emphasis on diversity as consistent with its Catholic identity and stated goals.\n\nLaura Hollis, a Notre Dame business professor and member of the university’s faculty senate, told the Register that she understood McGreevy’s message to be part of the university’s response to demographic changes in the Church around the world and its desire to be more universally representative. \n\nCiting the rise of Catholicism outside of Europe and North America, Hollis said that “better reflect[ing] the changing face of global Catholicism … would of necessity” mean recruiting faculty and students from racial groups that are currently minority status in the United States.\n\n“The prospect of increased numbers of Catholic faculty and students from Africa, South America, the Caribbean and Asia is an exciting development and one that will enrich and strengthen the commitment to the Catholic faith here in the United States and abroad, including education and evangelization,” said Hollis, who is a faculty adviser to The Irish Rover.\n\nThe Register reached out to several other faculty members, but none replied before deadline.\n\nBut not everyone sees the new emphasis as conducive to making the university’s faculty more Catholic.\n\nBill Dempsey, the founder of the Sycamore Trust, an alumni group dedicated to promoting Notre Dame’s Catholic identity, said the guidance sounds “especially worrisome,” given that it comes at a time when the university has stopped publicly disclosing the proportion of its Catholic faculty.\n\nCiting Pope St. John Paul II’s document on Catholic universities, Ex Corde Ecclesiae, the Sycamore Trust has long argued that having a majority of Catholic faculty is the single most important criteria for a university’s Catholic identity.\n\nFather Jenkins pledged to boost Catholic faculty numbers when he took office in 2005, which had fallen to 53%. But although the university reported a 1% increase over Father Jenkins’ tenure, which ended last year, Dempsey says the administration has since stopped making the Catholic makeup of university faculty publicly available.\n\n“Since the hiding of these data began when the percentage of Catholics was close to 50% and dropping, Catholics may well be in the minority now,” said Dempsey. “It is scarcely a time to stress hiring others.”\n\nDisclaimer: Jonathan Liedl is a member of board of directors of The Irish Rover and an alum of the University of Notre Dame.","summary":"news","url":"https://www.ncregister.com/news/notre-dame-dei-hiring-concerns","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/20250217180212_11a1b1edefd69c0bc7f9844cf9337febd4780b7f9b5fe1d9f650cfefdc48a122.jpg","video":null,"publish_date":"2025-02-18 00:12:56","author":"Jonathan Liedl","authors":["Jonathan Liedl"],"language":"en","source_country":"US","sentiment":-0.065},{"id":291561574,"title":"‘Payback’: Panic in Kyiv as Trump demands higher share of Ukraine’s GDP ","text":"There is panic in Kyiv, the capital of Ukraine, as the United States President, Donald Trump, is demanding a “payback” from the war-torn country that goes beyond the US taking control of its critical minerals but a higher share of Ukraine’s GDP.\n\nTribune Online earlier reports that the Ukraine President, Volodymyr Zelensky, had agreed to hand over the country’s minerals in partnership with the Trump-led US government ahead of peace talks with Russian President, Vladimir Putin. \n\nHowever, a draft of the pre-decisional contract, marked “Privileged & Confidential’ and dated Feb 7, 2025, and obtained by The Telegraph, revealed that Trump is demanding a $500bn (£400bn) “payback.”\n\nAccording to The Telegraph, the terms of the contract that landed at Volodymyr Zelensky’s office a week ago cover everything from ports and infrastructure to oil and gas, and the larger resource base of the country amounting to the US economic colonisation of Ukraine, in legal perpetuity.\n\nThe draft states that the US and Ukraine should form a joint investment fund to ensure that “hostile parties to the conflict do not benefit from the reconstruction of Ukraine”.\n\n“This agreement shall be governed by New York law, without regard to conflict of laws principles,” it states.\n\nThe Telegraph reports that 50 percent of recurring revenues received by Ukraine from the extraction of resources and 50 percent of the financial value of “all new licences issued to third parties” for the future monetisation of resources would be taken by the US government. \n\nA source close to the negotiations explained that there would be “a lien on such revenues” in favour of the US. \n\nAccording to the source, the clause means ‘pay us first, and then feed your children’, adding that the US will have a right of first refusal for the purchase of exportable minerals” for all future licences.\n\nContinuing, The Telegraph explained that terms, which seem to have been written by a private lawyer outside the US Departments of State or Commerce, will see Washington having sovereign immunity and acquire near total control over most of Ukraine’s commodity and resource economy. The fund “shall have the exclusive right to establish the method, selection criteria, terms, and conditions” of all future licences and projects. \n\nMeanwhile, Zelensky in his earlier proposal for the US to take over critical minerals, had calculated that it would lead to US companies setting operations on the ground, creating a political tripwire that would deter Vladimir Putin from attacking again.\n\nHowever, Zelensky had played up the dangers of letting strategic reserves of titanium, tungsten, uranium, graphite and rare earths fall into Russian hands but did not envisage he could be confronted with terms worse than the financial penalties imposed on Germany and Japan after their defeat in 1945, according to The Telegraph. \n\nMeanwhile, Donald Trump told Fox News that Ukraine had “essentially agreed” to hand over $500bn. \n\n“They have tremendously valuable land in terms of rare earths, in terms of oil and gas, in terms of other things,” the US President said.\n\nOn the other hand, Trump warned that should Ukraine reject the terms, it would be handed to Putin on a plate.\n\n“They may make a deal. They may not make a deal. They may be Russian someday, or they may not be Russian someday. But I want this money back,” he said.\n\nAccording to him, $300bn has been spent by the US on the war so far, describing the idea of handing over any more as “stupid”. \n\nAccording to reports, $70 billion of the total $175 billion in five packages agreed by Congress was spent in the US on weapons production. While some of it is in the form of humanitarian grants, much of it is lend-lease money that must be repaid.\n\nTribune Online reports that Zelenskyy has vowed that Ukraine will not accept any deal that won’t be in its best interest, warning that the country must be part of any peace deal with Putin. \n\nALSO READ TOP STORIES FROM NIGERIAN TRIBUNE","summary":"Tribune Online\n\n‘Payback’: Panic in Kyiv as Trump demands higher share of Ukraine’s GDP \n\n\nThere is panic in Kyiv, the capital of Ukraine, as the United States President, Donald Trump, is demanding a “payback” from the war-torn country that goes beyond the US taking control of its critical minerals but a higher share of Ukraine’s GDP. Tribune Online earlier reports that the Ukraine President, Volodymyr Zelensky, had agreed to [&#8230;]\n\n\n‘Payback’: Panic in Kyiv as Trump demands higher share of Ukraine’s GDP \n\nTribune Online","url":"https://tribuneonlineng.com/payback-panic-in-kyiv-as-trump-demands-higher-share-of-ukraines-gdp/","image":"https://tribuneonlineng.com/wp-content/uploads/2025/02/Trump-Zelenskyy-scaled-e1739837259812.jpg","video":null,"publish_date":"2025-02-18 00:12:50","author":"Tribune Online","authors":["Tribune Online"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.315},{"id":291563636,"title":"Elon Musk's SpaceX heads to the FAA's Air Traffic Control Center to help make America's skies safer","text":"Elon Musk's SpaceX heads to the FAA's Air Traffic Control Center to help make America's skies safer\n\nREAD MORE: DOGE starts FAA purge by firing hundreds of workers after deadly plane crashes \n\nLISTEN: Elon’s baby mama drama, Tom Hank’s SNL backlash and more DOGE cuts – on Welcome to MAGALand, the Daily Mail’s politics podcast with White House Insiders\n\nBy STEPHEN M. LEPORE FOR DAILYMAIL.COM\n\nPublished: 00:04 GMT, 18 February 2025 | Updated: 00:10 GMT, 18 February 2025\n\nMembers of Elon Musk's SpaceX team were scheduled to meet Monday with officials from the Federal Aviation Administration to 'suggest improvements.' \n\nThe meeting came the same day as yet another startling plane crash happened as a Delta passenger plane carrying 76 people crashed at Toronto's Pearson Airport on Monday.\n\nDonald Trump's White House began firing hundreds of workers at the FAA this past weekend, cutting staff weeks after personnel shortages were cited as a factor in the fatal mid-air collision at Ronald Reagan Washington National Airport. \n\nSean Duffy says that the team as SpaceX was set to visit Virginia's FAA Air Traffic Control System Command Center Monday saying he needed the help of 'the brightest minds in America.'\n\nHe wrote that the visit will allow the team to 'get a firsthand look at the current system, learn what air traffic controllers like and dislike about their current tools, and envision how we can make a new, better, modern and safer system.' \n\nDuffy, noting that 'the media (and Hillary Clinton)' believed that Musk and his employees would get 'special access,' clarified that it was typical for private companies to get tours. \n\nSpaceX does have $22 billion worth of government contracts, though most are with NASA or the Department of Defense. \n\nHe added: 'My door at @USDOT is open to any and all patriotic developers or companies who want to help our country in this incredible, game-changing mission. I hope to hear from any company committed to ushering in America’s golden age of travel!'\n\nMembers of Elon Musk's SpaceX team were scheduled to meet Monday with officials from the Federal Aviation Administration to 'suggest improvements'\n\nThe meeting came the same day as yet another startling plane crash happened as a Delta passenger plane carrying 76 people crashed at Toronto's Pearson Airport on Monday\n\nDuffy also said he's planned to go to the FAA Academy in Oklahoma to see the kind of training new air traffic controllers are receiving. \n\nDailyMail.com has reached out to the DOT and FAA for comment on whether Musk's team visit went ahead given the accident that occurred Monday. \n\nIt comes at a precarious time for the FAA, as it like many other federal agencies are having the fat cut by Musk's Department of Government Efficiency (DOGE). \n\nDavid Spero, president of the Professional Aviation Safety Specialists, said the first emails were sent to probationary workers late on Friday night. \n\nHe said hundreds had received notice that their employment was terminated. \n\nSince taking office in January, Trump and his sidekick Musk have rapidly shrunk the federal workforce to save money.\n\nAt times, however, their moves have backfired and raised public safety concerns. For example, the administration has had to move rapidly to rehire Energy Department staff after officials realized they were responsible for maintaining the nation's stockpiles of nuclear weapons.\n\nOn Thursday, the administration broadened its approach to target probationary employees, who have fewer protections. \n\nPresident Donald Trump has launched a huge round of cost-cutting staff reductions, but at times has had to reverse course amid safety warnings\n\nAn air traffic controller told the Associated Press that workers affected at the FAA included radar, landing and navigational aid maintenance. \n\nSpero said messages began arriving after 7 pm on Friday.\n\n'We are troubled and disappointed by the administration’s decision to fire FAA probationary employees PASS represents without cause nor based on performance or conduct,' he said. \n\n'Several hundred employees have been impacted with messages being sent from an ‘exec order’ Microsoft email address, not an official .gov email address.' \n\nOne FAA worker alleged he had been targeted because of comments he made about Musk's companies.\n\n'Before I was fired, the official DOGE Facebook page started harassing me on my personal Facebook account after I criticized Tesla and Twitter,' Charles Spitzer-Stadtlander wrote on LinkedIn, describing how he was fired after midnight on Saturday.\n\n'Less than a week later, I was fired, despite my position allegedly being exempted due to national security.'\n\nThe dismissals come at a critical time for the FAA, which already faced a shortage of controllers. \n\nFor years, officials have warned that overworked and understaffed air traffic control systems were an accident waiting to happen. \n\nLast month, 67 people died in a crash between a US Army Black Hawk helicopter and an American Airlines passenger jet.\n\nThe causes are still under investigation. But early reports revealed staffing levels were 'not normal,' and that a single controller was handling helicopter traffic as well as airline traffic at the airport.\n\nDays later a medical jet crashed in Philadelphia killing all six people on board. \n\nSpero highlighted the human cost of firing so many people at a stroke. \n\n'These are not nameless, faceless bureaucrats. They are our family, friends and neighbors. They contribute to our communities,' he said.\n\n'Many military veterans are among them. \n\n'It is shameful to toss aside dedicated public servants who have chosen to work on behalf of their fellow Americans.'\n\nMicrosoftSpaceXPoliticsAmerican Airlines\n\nShare or comment on this article:\nElon Musk's SpaceX heads to the FAA's Air Traffic Control Center to help make America's skies safer\n\nAdd comment","summary":"Members of Elon Musk's SpaceX team were scheduled to meet Monday with officials from the Federal Aviation Administration to 'suggest improvements.'","url":"https://www.dailymail.co.uk/news/article-14407183/elon-musk-spacex-faa-air-trafic-control-center-skies-safer.html","image":"https://i.dailymail.co.uk/1s/2025/02/18/00/95311281-0-image-m-16_1739837000270.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/30/2231432684649006247/1024x576_MP4_2231432684649006247.mp4","publish_date":"2025-02-18 00:10:23","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.29},{"id":291563406,"title":"Navigating the Path to Citizenship: Immigration lawyers in Jacksonville detail the steps to obtaining a green card and citizenship","text":"JACKSONVILLE, Fla. — For the past month, the topic of immigration has made headlines. \n\nOne of President Donald Trump’s first moves back in office was signing executive orders aimed at cracking down on illegal immigration. In Florida, state lawmakers were called to a special session to discuss illegal immigration, and Governor Ron DeSantis gave Florida Highway patrol the authority to enforce immigration laws.\n\nBut what about people who are currently waiting to obtain a visa or green card?\n\nLovelyn Villar is a teacher from the Philippines who has lived in Jacksonville for four years on a J-1 visa. She represents one of many people navigating the system. \n\n“I can say I love my job, I love teaching, I love the kids, and we’re just having fun every day,” Villar said.\n\nThe path to becoming a U.S. citizen through legal channels can take anywhere from several months to more than 20 years, according to Jacksonville immigration attorneys Joanne Fakhre and Rebecca Black. Both of their firms have been getting more calls now than ever before.\n\n“There’s a lot of people out there who have delayed on getting something done if they’ve had a process that they could do. A lot of people asking questions ‘when can I do this? How can I do this? Am I eligible to do this?’” Black explained.\n\nThere are different ways to legally enter the country. Visas, which are granted through the U.S. Dep. of State are broken into two categories: immigrant, for instances like travel, temporary work, or attending school, and non-immigrant, for spouses or children of U.S. citizens, or sponsored employment.\n\nPeople can also obtain a green card, but only if you meet specific criteria. Fakhre said this is where the process gets complicated. \n\n“I think people assume applying for a green card in the United States or permanent residence is like applying for a driver’s license,” Fakhre said. “You go down, you stand in line, you fill out an application and apply. These applications are very tedious, they’re long, there’s often numerical limitations on the type of visa…standing in line, sometimes the line is years and years down the road.” \n\nIt can take years to get a green card and even longer to be granted citizenship. U.S. Citizenship and Immigration Services has been working to reduce a backlog of cases made worse during the COVID-19 pandemic. Every year, immigration law allows the U.S. to grant up to 675,000 visas with caps on specific visas. In 2023, the U.S. granted more than 1.1 million green cards according to the latest report from the Dept. of Homeland Security. That number has steadily grown since 2020.\n\nRight now, the average processing time for 80% of cases for the application for permanent residence, which is needed for a green card, is roughly 20 months in Jacksonville. The processing time for 80% of cases for the petition for alien relative form, also needed for a green card, is anywhere from 16 to 65 months depending on which office you are submitting through. That is up from the average of 22 months back in 2020.\n\nBlack said part of the processing time depends on the number of people who are going through the paperwork and adjudicating cases. \n\n“Processing times by immigration, that’s an internal mechanism problem of theirs and that depends on how willing anybody is to fix it,” Black said.\n\nFirst Coast News reached out to USCIS about the processing times, and they referred us to the CIS website.\n\nFakhre and Black believe reform is critical and new immigration laws are needed in order to keep up with the way the world operates now.\n\n“Maybe we shouldn’t use an antiquated set of rules that don’t apply fully now,” Fakhre said. “Because back in ’96 people coming in, what was needed, what we were seeing was a lot different than now.”\n\nAlthough immigration continues to be a controversial issue in the U.S., Villar is happy here. She plans to reapply for another visa after her current program is over and she is considering applying for a green card in the future.\n\n“Maybe after doing a two year home rule, we would love to come and do the process again. When we come back we might do the H1B because the H1B visa has a path for green card,” Villar said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe path to obtaining a green card or becoming a U.S. citizen&#8230;\n\n\nThis Post: Navigating the Path to Citizenship: Immigration lawyers in Jacksonville detail the steps to obtaining a green card and citizenship first appeared on Internewscast Journal","url":"https://internewscast.com/news/navigating-the-path-to-citizenship-immigration-lawyers-in-jacksonville-detail-the-steps-to-obtaining-a-green-card-and-citizenship/","image":"https://media.tegna-media.com/assets/WTLV/images/fbd85d07-cee7-4d9d-8547-d61186f4dd82/20250217T220952/fbd85d07-cee7-4d9d-8547-d61186f4dd82_750x422.jpg","video":null,"publish_date":"2025-02-18 00:09:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.055},{"id":291561578,"title":"John Fetterman Calls Out Elon Musk After Recent Support for Trump Ally","text":"Pennsylvania Democratic Senator John Fetterman and Elon Musk seem to have lost their budding friendship of just a few months ago, as the two quibbled over X (formerly Twitter).Fetterman accused Musk's Department of Government Efficiency (DOGE) of \"rummaging through your personal s***.\"Why It MattersThe Department of Government Efficiency (DOGE) is a nongovernmental task force led by Musk, President Donald Trump's billionaire ally. It is reportedly working to cut wasteful federal spending and has been granted access to \"sensitive Treasury data,\" including Social Security and Medicare customer payment systems.Musk has been working as a \"special government employee,\" the White House says, and he does not receive a paycheck for his work. Given his reported influence, Democratic lawmakers have accused Musk of mounting a \"hostile takeover\" of the government, a claim that Musk and the Trump administration deny.What To KnowFetterman posted Monday afternoon that he wants to \"save billions of your money and make our government more efficient.\" The post was accompanied by a screenshot of a Politico article with the headline \"Possible DOGE access to private taxpayer data sparks outcry.\"\"Rummaging through your personal shit is *not* that,\" Fetterman said. \"A party of chaos loses—always.\"Since Trump's 2024 presidential campaign, Musk has become an increasingly prominent figure in U.S. politics, attending rallies, speaking out on social media, and heading DOGE. Since Trump has taken office, Musk announced that USAID would shut down. He also said widespread fraud occurs in \"federal entitlements\" like Social Security.Treasury Secretary Scott Bessent approved Musk's access to the Treasury Department last week. It allows him and his team entry into the system responsible for trillions of dollars in government payments, including Social Security checks and tax refunds.There have been a host of lawsuits filed against the Trump administration as a result of DOGE's efforts.Musk spoke to reporters in the Oval Office this week alongside Trump and said that \"too much information is made classified,\" suggesting that reducing the system would make bureaucracy more efficient.Musk responded on Monday to the Senator, who he called \"bruh,\" that if he \"wanted to rummage through random personal s***, I could have done that at PAYPAL. Hello???\"\"Having tens of millions of people marked in Social Security as 'ALIVE' when they are definitely dead is a HUGE problem. Obviously,\" Musk wrote. \"Some of these people would have been alive before America existed as a country. Think about that for a second ...\"Fetterman responded with a post directed to \"Elon,\" noting that the \"DOGE mission resonated with PA\" and that the Senator had come to the situation with \"common sense and an open mind.\"\"For many, it's causing chaos and confusion—which IMO, doesn't help DOGE,\" Fetterman wrote. \"PA voters want their personal info secured and taxes spent wisely. Safe to assume both are priorities?\"Musk, who seems to currently have the last retort, responded that he loves \"the people. We just want to fix the waste and fraud that is bankrupting the country.\"Following Trump's win, in December, Fetterman and Musk shared pleasantries when the two were on Capitol Hill.The Pennsylvania Senator was asked if he can see himself working with people like Musk. Fetterman said at the time that he admires Musk, and that the Tesla CEO is not \"an enemy.\"\"Yes, he's on a different team, but that doesn't make me an enemy. I don't think I'm automatically going to become a critic,\" Fetterman said of Musk. \"He has made our economy and our nation better, and our politics are different, and I may not agree with some of the things he might say, but that doesn't make him an enemy.\"Musk posted later to X his admiration for Fetterman, saying that the Senator \"puts country over party.\"Fetterman has been among the few Democrats voicing support for Trump's Cabinet nominations. He has supported picks such as New York Representative Elise Stefanik for United Nations ambassador for her \"strong and unapologetic pro-Israel position,\" as well as the \"strong choice\" of Florida Senator Marco Rubio as secretary of state. He also was the first Democrat to meet with now Secretary of Defense Pete Hegseth.The senator has been a vocal critic of the Democratic Party's election strategy.What People Are SayingElon Musk on X: \"I am endlessly amused by the infinite indignities I suffer on the very platform that I own\"California Senator Adam Schiff on X: \"Elon Musk is trying to access your personal bank and tax data.\"The world's richest man should not and cannot be able to snoop around your personal finances.\"Period. End of story.\"Rich Thau, president of Engagious, who moderated the focus group in Arizona: \"These swing voters are delighted by Musk's Trump-endorsed government housecleaning. The prospects of a looming constitutional crisis is completely inconceivable to them.\"Comedian Joe Rogan on his podcast: \"He has $400 billion. I'm telling you, he's not going to steal your money. I'm telling you that's not what he's doing. He's a super genius that's been f***** with, and when you've been f***** with by these nitwits that hide behind one of these three letter agencies, then he helps Donald Trump get into office and goes, I want to find out what kind of corruption is really around. Well you f***** up\"Protester Laura Olson told Newsweek at the 50501 Movement protest in Boston: \"Nobody elected Musk. He's destroying our government.\"What Happens NextMusk's involvement is expected to continue generating backlash from Democrats, who have pushed back now with legislation.Eight out of 11 people in a focus group by Engagious/Sago recently said they approve of Musk's DOGE efforts.","summary":"Following Trump's win, Fetterman and Musk shared pleasantries when the two were on Capitol Hill back in December.","url":"https://www.newsweek.com/john-fetterman-calls-out-elon-musk-doge-2032417","image":"https://d.newsweek.com/en/full/2590208/fetterman-musk.png","video":null,"publish_date":"2025-02-18 00:07:09","author":"Monica Sager","authors":["Monica Sager"],"language":"en","category":"politics","source_country":"US","sentiment":-0.619},{"id":291567404,"title":"‘Not My President’s Day’ protesters gather across Bay Area","text":"Anger at the Trump administration bubbled over across the Bay Area as hundreds gathered for “Not My President’s Day” to protest alleged anti-democratic actions by the Trump administration and Elon Musk’s Department of Government Efficiency.\n\nThe Monday protests — with large groups in San Jose, Oakland and San Francisco — were part of a series of demonstrations meant to antagonize President Donald Trump, presidential adviser and Tesla CEO Elon Musk and other members of the administration who have challenged democratic norms, curtailed protections for the LGBT community and ended equity and diversity initiatives across the United States.\n\n“Even in defeat we stand together,” said Berkeley’s first poet laureate, Rafael Jesus Gonzalez, at the Oakland Pergola beside Lake Merritt to a crowd that surrounded him. “We cannot let fascism rule in America. We must come together.”\n\nDemocrats and progressives across the United States had been largely stagnant since President Trump returned to office on Jan. 20 and sweeping changes to public agencies, protections for trans people and immigration enforcement. The few protests there have been were sparsely attended and often lacked the energy of those from Trump’s first term.\n\nThat changed this past weekend in the Bay Area where residents gathered outside of Tesla showrooms to denounce Musk and hurt the world’s richest man where it counts: his wallet. Protest signs from the march called to “send Musk to Mars” while other signs tied him to Nazism after he gave a Nazi salute at President Trump’s inauguration.\n\nIn San Jose, hundreds of demonstrators converged at the Circle of Palms downtown, where they hoisted signs saying “Remove the Muskovites,” “Elon is a Terrible President” and “Wake Up America.” Speakers included Assemblymember Ash Kalra and former Santa Clara County Supervisor Rod Diridon Sr.\n\nAfter the crowd had grown to an estimated 1,500 demonstrators they marched around the block into Plaza de Cesar Chavez Park, chanting “Hey, hey, ho, ho, Elon Musk has got to go.”\n\nJessie Heminway, a protester in Oakland with a family member in the federal government, said Musk’s cuts to agencies are unauthorized and unconstitutional.\n\n“It’s a nuthouse there. They’re firing qualified people. It’s retribution,” Heminway said. “Letting Elon run free in the government without even confirming him is entirely inappropriate.”\n\nShe said she had questioned the purpose of protest as a political action after the women’s march and Black Lives Matter rallies that occurred during Trump’s first term had little effect on public policy. She found an answer during the march along Lake Merritt, however, saying, “People need to meet each other and have community.”\n\nMembers of the protests varied from long-time organizers from the 1960s to newly activated participants like 14-year-old Iris Baker.\n\nBaker, who is nonbinary, joined the protests because the federal government had suspended applications for people seeking to add “X” as a gender label on passports. “In the eyes of the law, it says people like me aren’t valid.”\n\nBaker was hoping for increased coverage of the protests. “This protest is more of a general cause, to raise awareness, it’s more about class consciousness. I don’t see a lot of protests in the news, and there should be.”","summary":"From San Jose to Oakland to San Francisco, hundreds rally to oppose Trump, Musk actions","url":"https://www.mercurynews.com/2025/02/17/not-my-presidents-day-protesters-gather-across-bay-area/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/SJM-L-PREZPROTESTS-0218-4.jpg?w=1024&h=768","video":null,"publish_date":"2025-02-18 00:06:28","author":"Chase Hunter,Karl Mondon","authors":["Chase Hunter","Karl Mondon"],"language":"en","category":"politics","source_country":"us","sentiment":-0.087},{"id":291566066,"title":"From tariffs to DOGE, what companies are saying about the impact of MAGA policies","text":"During Mettler-Toledo‘s earnings call earlier this month, executives found themselves fielding a barrage of questions about one key topic: tariffs.\n\nThe Ohio-based maker of industrial scales and laboratory equipment had already opened the call by breaking down the expected impact from President Donald Trump’s still-evolving trade policy. But when the event transitioned to the question-and-answer portion, the inquiries from analysts seeking further detail about potential tariffs were constant.\n\n“Uncertainty remains across many of our core markets and the global economy,” Finance Chief Shawn Vadala said on the Feb. 7 call. “Geopolitical tensions remain elevated, and include the potential for new tariffs that we have not factored into our guidance.”\n\nMettler-Toledo’s experience wasn’t unique. America’s largest companies are getting inundated with queries about how or if Trump’s salvo of promises on issues ranging from international trade to immigration and diversity will alter businesses.\n\nA CNBC analysis shows multiple core themes tied to Trump’s policies are popping up on the earnings calls of S&P 500-listed companies at an increasing clip. Take “tariff.” Just weeks into the new year, the frequency of the word and its variations on earnings calls hit its highest level since 2020 — the last full year of Trump’s first term.\n\nOn top of that, new acronyms and phrases, like the “Gulf of America” or “DOGE,” have found their way into these meetings as the business community assesses what Trump’s return to power means for them.\n\nCuriously, Trump himself wasn’t racking up mentions on these calls. Many uses of the word “trump” in transcripts reviewed by CNBC referred to the verb, rather than the president.","summary":"CEO of Meta and Facebook Mark Zuckerberg, Lauren Sanchez, Amazon founder Jeff Bezos, Google CEO Sundar Pichai and Tesla and SpaceX CEO Elon Musk attend the inauguration ceremony before Donald Trump is sworn in as the 47th US President in the US Capitol Rotunda in Washington, DC, on Jan. 20, 2025. Saul Loeb &#124; Via &#8230;\n\n\nThe post From tariffs to DOGE, what companies are saying about the impact of MAGA policies appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/from-tariffs-to-doge-what-companies-are-saying-about-the-impact-of-maga-policies/","image":"https://image.cnbcfm.com/api/v1/image/108093781-17380960492025-01-20t231416z_978718718_rc2sdcacf4sq_rtrmadp_0_usa-trump-inauguration.jpeg?v=1738096239&w=1920&h=1080","video":null,"publish_date":"2025-02-18 00:06:05","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.374},{"id":291562600,"title":"Trump’s tariffs present fresh headache for India’s slowing economy","text":"Hours before Indian Prime Minister Narendra Modi’s visit to the White House, President Donald Trump announced that the United States would levy reciprocal tariffs on its trading partners.\n\nIt could hardly have come at a tougher time for India, which is already pressed by a slowing economy and sluggish demand.\n\nAt a joint news conference, Trump said India would buy F-35 fighter jets and oil and gas from the US. The two countries would also begin negotiations on the US trade deficit with India.\n\nIndia runs a large trade surplus with the US and such negotiations and military and oil purchases could adversely impact its economy at a time when it is going through a slowdown.\n\nWith the Indian economy expected to grow at 6.4 percent in the year ending March, its slowest in four years, the Modi government announced income tax relief for the middle class in the annual budget earlier this month.\n\nDays later, the country’s central bank cut its benchmark interest rate for the first time in nearly five years by 0.25 percent to 6.25 percent with Governor Sanjay Malhotra saying a less restrictive monetary policy was more appropriate in light of the current “growth-inflation dynamics”.\n\nEconomists warn the tax relief may not be enough for the vast majority of Indians, whose income still falls below taxable limits and who may still be reeling from the impact of the COVID pandemic, which devastated their earnings.\n\n“There is a vast base [of people] where recovery has not come back after the pandemic,” says Kaushik Basu, professor of economics at Cornell University. “We see this in data that the agricultural labour base has increased. And agriculture may well be just a parking spot.”\n\nBasu was referring to people who left urban jobs during India’s tight and prolonged COVID lockdown and returned to their villages. Without enough well-paying jobs to return to in cities, they have stayed in their villages doing seasonal agricultural labour.\n\nDhiraj Nim, an economist at ANZ Bank expects the tax relief to have a 0.2 percent impact on the gross domestic product (GDP) growth.\n\n“People will consume a little more, but they will also save more. Some personal loan repayment will happen,” he said. “I don’t think the boost in consumption will offset the one trillion rupees [$11.5bn] given in relief by too much.”\n\nMoreover, any economic boost will be a short-term measure while the problems it seeks to address “are more fundamental”, warns Alexandra Hermann, lead economist at Oxford Economics. “There is nothing [in the budget] that addresses employment or skilling,” that will lead to broader and more sustained growth, she says. Just about 2 percent of Indians currently pay income tax and unemployment and underemployment have stayed high, she says.\n\nSome of India’s slowdown could be attributed to a cyclical tapering in demand after the post-pandemic recovery when the economy grew sharply. Industry heads and government officials believed India was on a high growth trajectory. The country is already the world’s fifth-largest economy and is projected to become the third-largest by 2030.\n\nBut now the “issues beneath the growth” have been revealed, Cornell’s Basu says. “While there has been inequality for at least two decades, what we are seeing now has not been seen since 1947,” the year that India won its independence from the British.\n\nDelicate economic juggle\n\nThe government has sought to spur growth through strong spending on infrastructure such as roads and bridges. But stimulus provided during the pandemic meant the government needs to tighten its belt to meet its fiscal deficit target of 4.5 percent by next year. This reduced spending could also take away from some of the boost provided by the income tax relief, Nim of ANZ says.\n\nModi’s US visit comes amids this delicate economic moment in India. President Trump spoke of India’s high tariffs on American cars and other products meant to protect Indian industry and create domestic jobs.\n\nIndia, like Mexico and Canada, will also enter negotiations to bridge its trade surplus, but this could involve concessions that could hurt Indian industry as well as purchases it can hardly afford. (New Delhi peremptorily reduced tariffs on Harley Davidson motorbikes in the budget.)\n\n“It is notable that the Indian government has gone out of its way to avoid tariffs,” says Michael Kugelman, director of the South Asia Institute at the Wilson Center, a Washington, DC-based think tank. “A big reason for this is the fragile economic growth.”\n\nThe Indian government also accepted its first 100 deportees from the US without official protest, although they were sent in a military aircraft and in handcuffs. At their news conference, Modi said these were victims of human trafficking, which had to stop. He did not bring up with Trump their treatment by the US as some other countries have for their own deportees.\n\nHigh tariffs on steel imports that the US has already announced are bound to affect Indian exports. However, the Indian economy is largely fuelled by domestic consumption compared to other Asian economies, says Oxford Economics’ Hermann.\n\nThat is the deeper problem that is now starting to emerge.\n\nKartik Muralidharan, Tata Chancellor’s professor of economics at the University of California at San Diego, says the government’s expanded food transfer programme has supported India’s bottom half and may have led to their participation in the economy.\n\nHowever, he and others underscore the need for greater economic reform to encourage higher and more equitable growth.\n\n“Generally, reforms come at a time of external challenges,” Muralidharan says, referring to how India’s economic reforms in 1991 came in the wake of the Gulf War and a balance of payment crisis. “We need another ‘91,” he says.\n\nCornell’s Basu suggests the rising inequality would best be addressed through “a little higher tax for the super-rich and use it to support small businesses.”\n\nBasu also says small businesses have been affected by compliance costs for the Goods and Services Tax and could be simplified and lowered.\n\nThe government has said it expects a growth rate of about 6.7 percent for the year ahead, indicating strong growth in the current global landscape. But ANZ’s Nim says the “bigger concern should be growing per capita income and better distribution of that income so it reaches people who need it.”","summary":"India, one of the fastest growing economies in the world, is facing a slowdown in a sign of deeper problems.","url":"https://www.aljazeera.com/features/2025/2/18/trumps-tariffs-present-fresh-headache-for-indias-slowing-economy?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/02/2018-03-28T072221Z_745161182_RC1A6384C440_RTRMADP_3_INDIA-ECONOMY-INFLATION-1738251506-1739837365.jpg?resize=1200%2C630&quality=80","video":null,"publish_date":"2025-02-18 00:05:10","author":"Apps Support,Saumya Roy","authors":["Apps Support","Saumya Roy"],"language":"en","source_country":"QA","sentiment":-0.008},{"id":291564576,"title":"PM says US ‘backstop’ needed for Ukraine peace after emergency talks in Paris","text":"Sir Keir Starmer has urged Donald Trump to provide a “backstop” to any Ukraine peace settlement, insisting it is the only way to deter Russia from attacking the country again.\n\nThe Prime Minister’s appeal to the US president came after European leaders gathered in Paris for emergency talks on the future security of the continent following Washington’s push for a deal with Russia.\n\nSir Keir has said he would be prepared to send peacekeeping troops to Ukraine, but some present at the meeting – including German Chancellor Olaf Scholz – wanted to resist discussing any European force being used to monitor a ceasefire.\n\nSpeaking after the summit, the Prime Minister warned that allies – including Britain – will have to “take responsibility” for its security in light of a radically changed US foreign policy.\n\nCountries must commit to bolstering both spending and capability as Ukraine’s fate has become an “existential question” for Europe, he said, after Washington warned it would reduce its defence commitments on the continent.\n\nBut Sir Keir insisted a US security guarantee would be the only way to effectively prevent Moscow from attacking the country again in future.\n\n“Europe must play its role, and I’m prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement,” he said.\n\n“But there must be a US backstop because a US security guarantee is the only way to effectively deter Russia from attacking Ukraine again.”\n\nThe Prime Minister will seek to bridge the gap between Europe and Washington as he flies to America for talks with Mr Trump next week, when he will make the case for US security guarantees.\n\n“At stake is not just the future of Ukraine. It is an existential question for Europe as a whole, and therefore vital for Britain’s national interest,” Sir Keir said on Monday.\n\n“This is a once-in-a-generation moment for the collective security of our own continent. Only a lasting peace in Ukraine that safeguards its sovereignty will deter Putin from further aggression in the future.”\n\nThe Prime Minister said that recent statements by the Trump administration “should not come as a surprise” given the president’s long-held view that Europe should “step up” and meet the demands of its own security.\n\n“The issue of burden-sharing is not new, but it is now pressing, and Europeans will have to step up, both in terms of spending and the capabilities that we provide,” he said.\n\nThree hours of emergency talks at the Elysee Palace appeared to have left leaders of Britain, Germany Italy, Poland, Spain, the Netherlands, Denmark, Nato and the EU split on the prospect of European peacekeeping troops.\n\nIn an apparent rejection of Sir Keir’s suggestion, Mr Scholz said talk of boots on the ground was “premature,” adding: “This is highly inappropriate, to put it bluntly, and honestly: we don’t even know what the outcome will be.”\n\nThe UK Prime Minister, along with European allies, has insisted Ukraine’s voice must be at the heart of any peace deal with Russia amid fears of Washington and Moscow going over the heads of leaders on the continent.\n\nIt comes as US secretary of state Marco Rubio led a delegation to Saudi Arabia for discussions with Russian officials that will look to seek an end to the fighting.\n\nUkraine has not been invited to the talks and will not accept the outcome if it is not involved, Ukrainian President Volodymyr Zelensky said earlier on Monday, amid fears that Kyiv will remain excluded from discussions.\n\nSenior US officials on their first visit to Europe last week left the impression that Washington was ready to embrace the Kremlin while cold-shouldering many of its old European allies.\n\nRussian foreign minister Sergei Lavrov also appeared to dismiss the prospect of European countries having a say, telling reporters as he arrived in Saudi Arabia: “I don’t know what they have to do at the negotiations table.”\n\n“Obviously, the immediate question is the future of Ukraine, and we must continue to put Ukraine in the strongest possible position whatever happens next, and to make sure that if there is peace, and we all want peace, that it is lasting.”\n\nThe Prime Minister has pledged to increase defence spending but is unlikely to go beyond his commitment to set out a plan to increase it to a 2.5% share of the economy despite calls from Mr Trump to reach 5% and Nato secretary general Mark Rutte’s suggestion that allies should spend more than 3%.\n\nThe UK currently spends around 2.3% of gross national product on defence.","summary":"The Prime Minister’s appeal to the US president came after European leaders gathered in Paris for emergency talks on Ukraine.","url":"https://www.standard.co.uk/news/politics/ukraine-keir-starmer-prime-minister-donald-trump-paris-b1211736.html","image":"https://static.standard.co.uk/2025/02/18/00/3ff48f27c683fdaaf82f1cd92a59e85aY29udGVudHNlYXJjaGFwaSwxNzM5OTIyMjI1-2.78880596.jpg?width=1200","video":null,"publish_date":"2025-02-18 00:04:38","author":"Nina Lloyd","authors":["Nina Lloyd"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.244},{"id":291562744,"title":"Protesters participate in 'Not My Presidents Day' events nationwide","text":"Feb. 17 (UPI) -- Several hundred people in New York demonstrated in a \"Not My Presidents Day\" event, decrying what they say are President Donald Trumps attacks on Democrats, including the dismantling of federal agencies.\n\nThe protest in New York was part of a nationwide movement by the group Rise and Resist that describes itself as \"50-50-1,\" standing for 50 states, 50 protests and one movement.\n\nThey met in Union Square around 1 p.m., headed south on Fifth Avenue and ended up at Washington Square Park in their peaceful protest.\n\n\"I'm old enough to remember the civil rights marches in the 1960s, where up until 1965, Black voters in Mississippi and Alabama could not vote without being killed,\" protester Frank Hickey told WABC-TV. \"Yes, these things do make a difference. I also remember the Vietnam demonstrations. I believe these demonstrations are the American spirit.\"\n\nProtester Kristin Mullin described her disagreements with Trump.\n\n\"The administration issued an executive order that said it was going to be a 90-day pause on all USAID projects, but it's really just been a cut on projects,\" Mullin said. \"Projects don't know when they're starting, and as a result there is HIV medicine in warehouses that is not getting distributed, there's food from U.S. farmers that is not getting distributed as vital humanitarian aid around the world, so it's very concerning to me.\"\n\nProtests also took place in Houston and the San Francisco Bay area.","summary":"Several hundred people in New York demonstrated in a \"Not My Presidents Day\" event, decrying what they say are President Donald Trumps attacks on Democrats, including the dismantling of federal agencies.","url":"https://www.upi.com/Top_News/US/2025/02/17/NY-Not-My-Presidents-Day-protest/3181739835560/","image":"https://cdnph.upi.com/ph/st/th/3181739835560/2025/upi/8f0fed69a19fe3e306bdd42a897c0deb/v1.2/Protesters-participate-in-Not-My-Presidents-Day-events-nationwide.jpg","video":null,"publish_date":"2025-02-18 00:03:02","author":"Allen Cone","authors":["Allen Cone"],"language":"en","source_country":"us","sentiment":-0.138},{"id":291567316,"title":"Did Trump Fire All FAA Workers? Find Out Amid Federal Layoffs – Hollywood Life","text":"The Federal Aviation Administration (FAA) has experienced a significant loss of employees due to policies implemented by President Donald Trump‘s administration. This has raised concerns, particularly as the U.S. has seen an alarming increase in plane crashes since the start of the year. Additionally, FAA officials have warned over the years that the agency is understaffed and that its employees are working in an overstressed system. In 2023, as reported by AP, Jennifer Homendy, chair of the National Transportation Safety Board, told a Senate panel that air traffic and staffing shortages have worsened since the pandemic.\n\nFollowing the deadly collision in Washington on January 29 between a Black Hawk helicopter and an American Airlines jet, President Trump appointed Chris Rocheleau as the Acting FAA Administrator. He described Rocheleau, a 22-year FAA veteran, as “highly respected.” Without evidence, the President blamed FAA diversity requirements and his two Democratic predecessors for the crash that killed 67 people, alleging lax air traffic control standards.\n\nFind out more about the agency and layoffs below.\n\nHow Many Federal Workers Are There in America?\n\nThe number of federal workers in the U.S. varies, but according to The Hill, there are over 2.1 million federal employees across various agencies, including the Department of Defense, Health and Human Services, and the Department of Homeland Security.\n\nWhat Is the FAA?\n\nThe Federal Aviation Administration (FAA) is a government agency responsible for regulating and overseeing civil aviation in the U.S., including air traffic control, aircraft certification, and aviation safety.\n\nDid Trump Fire FAA Employees?\n\nAccording to the Professional Aviation Safety Specialists (PASS) union, “several hundred” workers received termination notices on Friday, with the number estimated to be close to 300.\n\nThe firings at the FAA did not include air traffic controllers but appeared to affect engineers and technicians. Many of the workers terminated were probationary employees, having been employed for less than a year and lacking job protection.\n\n“This decision did not consider the staffing needs of the FAA, which is already challenged by understaffing,” David Spero, the national president of the Professional Aviation Safety Specialists, AFL-CIO, said in a statement. “Staffing decisions should be based on an individual agency’s mission-critical needs. To do otherwise is dangerous when it comes to public safety. And it is especially unconscionable in the aftermath of three deadly aircraft accidents in the past month.”","summary":"Image Credit: AFP via Getty Images The Federal Aviation Administration (FAA) has experienced a significant loss of employees due to policies implemented by President Donald Trump‘s administration. This has raised concerns, particularly as the U.S. has seen an alarming increase in plane crashes since the start of the year. Additionally, FAA officials have warned over the [&#8230;]\n\n\nThe post Did Trump Fire All FAA Workers? Find Out Amid Federal Layoffs – Hollywood Life appeared first on Ghana Latest News.","url":"https://ghananewss.com/did-trump-fire-all-faa-workers-find-out-amid-federal-layoffs-hollywood-life/","image":"https://hollywoodlife.com/wp-content/uploads/2025/02/GettyImages-2194444069-e1739831170964.jpg?resize=384%2C216","video":null,"publish_date":"2025-02-18 00:01:32","author":"Ghana News,President Donald Trump","authors":["Ghana News","President Donald Trump"],"language":"en","source_country":"gh","sentiment":-0.503},{"id":291562608,"title":"Letters: USAID is a good place to start spending reduction","text":"USAID cuts a good\nstart to reduce spending\n\nRe: “Closing USAID was first a Clinton-era idea” (Page A7, Feb. 13).\n\nToday, I read the letters to the editor about the “terrible demise of USAID.”\n\nI hope those letter writers and others read the Mark Thiessen opinion in the Mercury News. Thiessen clearly states the history of the USAID agency and the lack of oversight. Clearly, it is completely legal to move USAID into the State Department where there will be oversight and direction of USAID.\n\nSome of USAID’s expenditures do help poor nations with food aid and medical vaccines, and they should continue.\n\nI hope most Americans can understand that our federal government has overspent, and we now spend nearly $900 billion of taxpayer money, every year, just paying the annual interest on our $36 trillion debt, and that is expected to rise.\n\nTherefore, it is obvious that many government programs must be cut in order to stop overspending.\n\nBrian McCormick\n\nSweeping changes at\nUSAID not a new idea\n\nRe: “Trump’s dismantling of USAID immoral” and “Congress cannot allow end of USAID” (Page A6, Feb. 13) and “Closing USAID was first a Clinton-era idea” (Page A7, Feb. 13).\n\nInteresting is the juxtaposition of two letters to the editor and a commentary on the very next page about dismantling and restructuring USAID by Marc A. Thiessen. It shows that we common folk typically do not have the experience or firsthand knowledge of many issues relating to our federal and state governments.\n\nA perfect example — Thiessen’s commentary — uncovers the history and issues involved in trying to dismantle and restructure USAID going back to the days of former President Biden (as senator) and former President Clinton.\n\nNow I am all in for providing necessary aid to starving and oppressed people in foreign countries. What I do not support is government waste and fraud which we all know, or have some sense of, occurs on a daily basis in Washington, D.C., and Sacramento. The Trump administration appears to be trying to institute a government policy that has been kicked around for decades.\n\nSavings at federal\nagencies will go to rich\n\nNo one mentions that Donald Trump and Elon Musk’s examination of our government’s agencies can be done without closing them down first.\n\nSecond, if you think the savings will be used to reduce our debt, think again; they are just trying to justify huge tax giveaways to the richest people in the world.\n\nIf this is OK with you, hold on for an America that you won’t recognize or be proud of.\n\nLamar’s message was\nbigger than music\n\nRe: “Kendrick Lamar does ‘Not Like Us’ — yet with one major change — at Super Bowl” (Feb. 9).\n\nHip-hop music is one of the most essential aspects of Black culture in the United States, and the powerful messages that these songs can communicate are not to be ignored.\n\nHip-hop songs are a way to speak from the soul to the listener, and Kendrick Lamar used the genre as a medium to speak out about the oppression that Black people continue to face, and as a call not to forget the origins of our country — we would not be the country we are today if not for the contribution of African Americans during the construction of our union.\n\nAs Lamar states aptly: This is bigger than the music.\n\nErika Bodoh\n\nTo save money, DOGE\nshould start at Pentagon\n\nThe Department of Defense Inspector General Robert Storch was recently fired by the Trump administration, along with more than a dozen other federal agency IGs. A year ago, IG Storch reported that the military overshot its spare parts needs by nearly $1 billion. Couple that with the distressing fact that the Pentagon recently failed its seventh audit in a row. \n\nUndaunted, Senate Republicans are proposing to increase the military budget by $150 billion.\n\nOIG oversees and reviews the efficiency, effectiveness, financial health and safety of the agencies they serve to ensure their effective operation by preventing and detecting fraud, waste and abuse, a role that Elon Musk’s DOGE claims it is tasked with. If Musk and DOGE were truly interested in government efficiency, they would first start at the Pentagon.\n\nWarren Seifert\n\nConflicts of interest at\ndrive Musk lawlessness\n\nThe lawlessness continues with an unelected billionaire in charge of our government infrastructure in the interest of protecting his government-funded projects from oversight. Over the last five years, Elon Musk has received $13 billion in federal government contracts; last year alone, he received $3.7 billion. Many of the Defense and NASA contracts he has received are classified so are not public. Donald Trump appears to be too lazy to govern, only showing up for photo ops.\n\nLet’s not go back to a small government that serves the needs of the wealthy few, endangers us by rolling back safety regulations and leaves the majority of Americans working, paying taxes to benefit not all Americans but the few who already have so much and don’t pay taxes to contribute to our prosperity.","summary":"Also: Sweeping changes &#124; Going to rich &#124; Lamar's message &#124; Pentagon spending &#124; Conflicts of interest. Mercury News reader letters to the editor for Feb. 18, 2025.","url":"https://www.mercurynews.com/2025/02/17/letters-usaid-good-place-spending-reduction/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/Foreign_Aid_Migration_42232_823f6e.jpg?w=1024&h=672","video":null,"publish_date":"2025-02-18 00:00:48","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.085},{"id":291564544,"title":"North Korea’s Kim reclaims ancestors’ legacy with rare mausoleum visit","text":"North Korean leader Kim Jong-un made a rare visit to his ancestors’ mausoleum on Sunday, marking the first time in four years he has paid tribute to the tomb on his father’s birthday.\nAnalysts suggest the gesture may have been an attempt to reinforce his regime’s legitimacy amid growing international calls for it to denuclearise.\nOn Sunday, Kim, accompanied by top military officials and his influential sister, Kim Yo-jong, visited the Kumsusan Palace of the Sun to honour their late father Kim Jong-il, and grandfather Kim Il-sung.\nThe visit coincided with the Day of the Shining Star, a national holiday in North Korea on February 16, Kim Jong-il’s birthday.\nAccording to the Korean Central News Agency (KCNA), the younger Kim expressed a “solemn will” to dedicate himself to the “sacred struggle” for the nation’s eternal prosperity, the safety of its people and the promotion of their well-being.\nHe vowed to remain faithful to the revolutionary ideals of both his father and grandfather, whose embalmed bodies are housed at the mausoleum. It marked the first time since 2021 that he had visited the mausoleum on his father’s birthday.\n\nThe visit signals a possible shift in Kim’s approach, reversing a recent trend in which he downplayed the personality cult surrounding his ancestors in favour of establishing his own authority, analysts say.\n“By invoking his ancestors’ legacy at this time, Kim may be aiming to strengthen domestic loyalty and bolster his leadership amid ongoing international scrutiny over North Korea’s nuclear ambitions,” Hong Min, a researcher at the Korea Institute for National Unification, told This Week in Asia.\nKim Il-sung’s birthday on April 15, known as the Day of the Sun, and Kim Jong-il’s birthday, the Day of the Shining Star, are the most important national holidays in North Korea’s Stalinist dynasty.\nIn recent years, North Korea’s propaganda machinery has often avoided using the term “Day of the Shining Star” in favour of simply referring to February 16 as Kim Jong-il’s birthday.\nThis was seen as part of an effort by Kim Jong-un to build a personality cult focused more on himself than his predecessors.\nHowever, this year, the KCNA and other state media returned to using the reverent term, shifting the spotlight back to his ancestors’ legacy.\n\n“Kim Jong-un might have felt the need to resort to his ancestors’ glory again after recent signals from Washington indicated that the policy [of former US president Joe Biden’s administration] of complete denuclearisation would continue,” Hong said.\nUS President Donald Trump, who has hinted at resuming summit diplomacy with Kim, reaffirmed last week the principle of “complete denuclearisation of North Korea” for the first time since his inauguration.\nAt a meeting with Japanese Prime Minister Shigeru Ishiba, the two leaders reaffirmed the principle of North Korea’s complete denuclearisation and formally included it in their diplomatic readout.\n“Kim Jong-il is remembered as the pioneer of North Korea’s nuclear weapons development. Now, Kim Jong-un is signalling that he will continue his father’s legacy by building up nuclear arsenals, despite international pressure,” Hong said.\nYang Moo-jin, head of the University of North Korean Studies, suggested that Kim was dialling back on efforts to cultivate his own personality cult because many North Koreans had been confused by the sudden diminishment of the reverence previously reserved for his ancestors.\n“Kim Jong-un feels uncomfortable about the personality cult focused on him and wants to share the burden of fending off international pressure for denuclearisation with the souls of his deceased ancestors,” Yang said.\n\nOn Saturday, Kim attended the groundbreaking ceremony for 10,000 new housing units in the Hwasong district of Pyongyang, according to Rodong Sinmun, the party’s daily newspaper.\nAt the 8th Party Congress in 2021, North Korea announced a plan to build 10,000 housing units annually in Pyongyang over the next five years.\n“This plan is designed to improve the quality of people’s livelihoods,” said Jung Yoo-suk, a researcher at the Korea Institute for National Unification.\n“However, the construction drive, taking place amid a lack of urban infrastructure such as electricity, water supply and sewage systems, inevitably has inherent limitations.”","summary":"Observers note a potential shift in Kim’s approach – reviving the personality cult of his ancestors to strengthen his own authority.","url":"https://www.scmp.com/week-asia/politics/article/3299035/north-koreas-kim-reclaims-ancestors-legacy-rare-mausoleum-visit","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/18/53620251-9814-49b8-9f00-beca21a7dba4_aa6f2602.jpg","video":null,"publish_date":"2025-02-18 00:00:14","author":"Park Chan-kyong","authors":["Park Chan-kyong"],"language":"en","category":"politics","source_country":"cn","sentiment":0.154},{"id":291562990,"title":"Shady NYC mayor loses key deputies after alleged dirty deal with Trump","text":"Four top deputies for embattled New York City Mayor Eric Adams have resigned, according to a statement the mayor issued on Monday.\n\n“I am disappointed to see them go, but given the current challenges, I understand their decision and wish them nothing but success in the future,” Adams said in a statement shared with CNN. \n\nAccording to the outlet, the officials leaving the mayor’s office are Meera Joshi, deputy mayor for operations; Chauncey Parker, deputy mayor for public safety; Maria Torres-Springer, who served as first deputy mayor; and Anne Williams-Isom, the deputy mayor for health and human services. \n\n“Due to the extraordinary events of the last few weeks and to stay faithful to the oaths we swore to New Yorkers and our families, we have come to the difficult decision to step down from our roles,” read a joint statement from Joshi, Torres-Springer, and Williams-Isom, which was obtained by The New York Times. \n\nThey added, “While our time in this administration will come to a close, our support for the incredible public servants across the administration with whom we have stood shoulder to shoulder and our championing of this great city and all it stands for will never cease.”\n\nThe resignations come as President Donald Trump’s Justice Department has moved to dismiss corruption charges against Adams, apparently in exchange for his cooperation on Trump’s hard-line anti-immigration agenda. \n\nAdams denied the allegations of a quid pro quo, as has Trump’s “border czar” Tom Homan. But Adams is already working in tandem with Trump’s team: Following a closed-door meeting with Homan on Thursday, Adams agreed to allow Immigration and Customs Enforcement to work at the Rikers Island jail complex.\n\nAccording to the Times, the deputy mayors who left Adams’ office felt increasingly uneasy about working for a man who was putting his personal interests over those of the city he leads. Politico reported on Friday that most of the departing staff members met with Adams and told him he was an insufficient leader. Adams apparently begged the deputies to stick around, at least through March, but they refused.\n\nThese aren’t the only officials who have opted to quit rather than be entangled with Adams’ mess. Late last week, six senior Justice Department officials, including the top federal prosecutor in Manhattan, resigned in protest over orders to drop the corruption charges against Adams. \n\nOne of the resigning federal attorneys, Danielle Sassoon, whom Trump had appointed as a U.S. attorney on an interim basis, wrote in a scathing letter to newly minted Attorney General Pam Bondi that the administration’s move to dismiss Adams’s case amounted to a quid pro quo to help Trump on immigration-related matters.\n\nAdams, a Democrat (at least for now), has faced increased pressure to resign, though he said over the weekend that he has no plans to. Meanwhile, New York Gov. Kathy Hochul, a Democrat, is facing calls to remove Adams from office.\n\nThe mayor was under federal indictment and charged with bribery and campaign finance violations, but earlier this month, the Justice Department moved to dismiss the case. The president’s leniency toward Adams came after the mayor started playing friendly with the right. Adams has not only ripped into Democrats’ immigration policies but also accused the Democratic Party of leaving him. \n\n“People often say, ‘Well, you know, you don’t sound like a Democrat, and you know, you seemed to have left the party,’” Adams said in an interview with former Fox News personality Tucker Carlson. “No, the party left me, and it left working-class people.”","summary":"Four top deputies for embattled New York City Mayor Eric Adams have resigned, according to a statement the mayor issued on Monday.\n\n\n\n“I am disappointed to see them go, but given the current challenges, I understand their decision and wish them nothing but success in the future,” Adams said in a statement shared with CNN. \n\n\n\nAccording to the outlet, the officials leaving the mayor’s office are Meera Joshi, deputy mayor for operations; Chauncey Parker, deputy mayor for public safety; Maria Torres-Springer, who served as first deputy mayor; and Anne Williams-Isom, the deputy mayor for health and human services. \n\n\n\n“Due to the extraordinary events of the last few weeks and to stay faithful to the oaths we swore to New Yorkers and our families, we have come to the difficult decision to step down from our roles,” read a joint statement from Joshi, Torres-Springer, and Williams-Isom, which was obtained by The New York Times. \n\n\n\nThey added, “While our time in this administration will come to a close, our support ","url":"https://www.dailykos.com/story/2025/2/17/2304395/-Shady-NYC-mayor-loses-key-deputies-after-alleged-dirty-deal-with-Trump?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1399591/story_image/AP25042693499573.jpg?1739830568","video":null,"publish_date":"2025-02-18 00:00:11","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":-0.093},{"id":291567038,"title":"A look into negotiations over the Russia-Ukraine war","text":"to top close Video This video is playing in picture-in-picture.\n\nSpecial Report February 17, 2025 03:56 \n\n A look into negotiations over the Russia-Ukraine war \n Fox News chief political analyst Brit Hume unpacks President Donald Trump's efforts to respond to the Russia-Ukraine conflict on 'Special Report.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard Tags POLITICSSPECIAL REPORT","summary":"Fox News chief political analyst Brit Hume unpacks President Donald Trump&apos;s efforts to respond to the Russia-Ukraine conflict on &apos;Special Report.&apos;","url":"https://www.foxnews.com/video/6368976618112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e09aa467-b90d-4f17-b520-929fb9849a4f/3ecf7e28-2716-4d44-b5fe-a61c5c6a40b3/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-18 00:00:02","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.127},{"id":291567400,"title":"Canada set for rematch with US in 4 Nations final after beating Finland","text":"By JIMMY GOLEN\n\nBOSTON (AP) — Nathan MacKinnon scored twice. Connor McDavid had a goal and an assist. Sidney Crosby flipped in an empty-netter from center ice after Finland cut a four-goal deficit to one in the final minutes.\n\nCanada’s best players came through in the 4 Nations Face-Off on Monday to earn a rematch of their fight-filled preliminary bout with the United States. The rivals will meet in the tournament final.\n\n“That’s what you need: big plays from big-time players,” Crosby said after the 5-3 victory over Finland. “These guys are used to playing in these big games under the spotlight and delivering. They did again tonight.”\n\nCanada and the United States will play on Thursday night in a sequel to a round-robin game in Montreal last week that started with three fights and ended with the Americans celebrating a 3-1 victory. Canadian forward — and Boston Bruins captain — Brad Marchand will take the ice as an opponent at the TD Garden in a series where fans had to be asked not to boo the opponents’ national anthem.\n\n“We’re obviously really excited about (having) another crack at these guys. It’s going to be an intense game, for sure,” Marchand said in the visitor’s locker room, down the hall from the one where he has changed for the past 16 seasons.\n\n“There’s no bigger rivalry in hockey than Canada-U.S., and I think it’s the matchup that everybody wanted,” Marchand said. “So it’s going to be an extremely intense game, one we’re all going to be looking forward to.”\n\nJordan Binnington stopped 23 shots for Canada on the same ice where he clinched the 2019 Stanley Cup for the St. Louis Blues. Brayden Point also scored and Sam Reinhart had three assists as the Canadians opened a 4-0 lead in the first 25 minutes.\n\nThe tournament is the NHL’s return to international competition after sitting out the 2018 and 2022 Olympics. It delivered last week’s intense U.S.-Canada game against a backdrop of frosty real-world relations between the countries, spurred by President Donald Trump’s talk of tariffs — or even turning Canada into the 51st U.S. state.\n\nThe Americans were set to play Sweden on Monday night in a game that lost any meaning once Canada clinched the second spot in the final. The U.S. won both of its previous round-robin games, earning the top spot in the pool.\n\nAfter fiery play in Montreal last week, Monday’s game was preceded by tepid booing during the Canadian national anthem and all of the intensity of a midwinter NHL game between two teams with interim coaches.\n\nAnd then, the Finns found life.\n\nEsa Lindell scored with seven minutes left to make it 4-1, and then Mikael Granlund scored twice in the final 100 seconds with the Finnish goalie off for an extra attacker. Crosby ended the suspense when he flipped a loose puck from center ice into the empty net.\n\n“Got a couple of goals there late and came really close, but not today,” Finnish forward Aleksander Barkov said. “Obviously, it’s not an easy task to come back from a 4-0 deficit against maybe the best team in the world. So I think we did well there at the end. But the rest of the 50 minutes we could have and should have probably played a little better.”\n\nMcDavid opened the scoring just four minutes in and then MacKinnon made it 2-0 less than a minute later. Before five minutes had elapsed, the Finns had used their timeout in an attempt to settle things down.\n\nPoint gave the Canadians a 3-0 lead late in the first, and then MacKinnon made it 4-0 five minutes into the second.\n\nThat was all for Finnish goaltender Kevin Lankinen, who stopped five of nine shots in all.\n\nJuuse Saros made 14 saves the rest of the way.\n\nBinnington stopped Finland’s first 19 shots before Lindell scored to end the bid for what would have been the first shutout of the tournament. With Saros pulled for an extra attacker, Granlund scored a pair of goals to make it 4-3.","summary":"Canada’s best players came through in the 4 Nations Face-Off on Monday to earn a rematch of their fight-filled preliminary bout with the United States. The rivals will meet in the tournament final.","url":"https://www.mercurynews.com/2025/02/17/canada-beats-finland-5-3-to-set-up-rematch-with-united-states-in-4-nations-face-off-final/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/4_Nations_Canada_Finland_Hockey_58418.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-17 23:56:45","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"sports","source_country":"us","sentiment":0.098},{"id":291559554,"title":"On Presidents Day in Irvine, demonstrators rally against President Trump and Elon Musk","text":"Dozens of people gathered outside the Irvine Civic Center on Monday afternoon to protest President Donald Trump and his administration, particularly Elon Musk‘s unelected but powerful advisory role within it.\n\nThe rally in Irvine was one of many similar demonstrations across the country dubbed “No Kings on Presidents Day” by the 50501 Movement, a group that describes itself as a grassroots response “to the anti-democratic and illegal actions of the Trump administration and its plutocratic allies.”\n\nMany outside the Civic Center said they showed up to advocate for democracy against what they see as an oligarchical threat in billionaire Musk, who — through the newly created Department of Government Efficiency — has been given the green light from the president to consolidate control over large swaths of the federal government.\n\nOstensibly, Musk’s charge is to eliminate what the Trump adminsitration deems to be wasteful and fraudulent federal spending. In practice, Musk has also seemingly been granted the authority to regulate agencies that hold sway over his companies.\n\n“In essence, it feels like if we don’t take action, then our democracy is gonna be taken away under our nose,” said Susan Hahn of Dana Point. “I feel an urgent need to do something about it.”\n\nHahn and other protesters gathered at the four corners of the intersection of Alton Parkway and Harvard Avenue Monday afternoon. Without disrupting traffic, they waved American flags through the crosswalks and beckoned cars to honk in defense of democracy.\n\n“I am here to defend the Constitution,” said Matthew Thorne, who drove from Temple City to attend the Irvine rally. “I fear our democracy is being trampled on. An unelected official has seized control of America’s purse strings.”\n\nAs the protest unfolded, Musk’s DOGE team was seeking access to an Internal Revenue Service system with taxpayers’ sensitive records, including tax returns, Social Security numbers, addresses, banking details and employment information.\n\nA White House spokesperson said direct access to the system will enable Musk’s team to root out deeply entrenched fraud and abuse, according to the New York Times.\n\nBack in Irvine, some demonstrators took offense to specific Trump administration policies, specifically the dismantling of USAID and the end of government diversity programs.\n\n“I used to be a huge Musk fan,” said Cullen Lonergan of Costa Mesa. “I’ve never been a political person.”\n\nThen came the turning point for him: Trump’s proclamation in January that there are only two biological sexes, male and female.\n\nAt the time, Lonergan worked for an addiction treatment center in Costa Mesa. The Trump policy led him to quit, he said.\n\n“Many of our clients are transgender,” he said. “After Trump’s proclamation, my supervisor and I disagreed about how we could help them.”\n\n“When you don’t respect our nation’s diversity, then you don’t seem to care what America’s about,” he said. “That’s why I’m here today.”","summary":"The rally in Irvine was one of many similar demonstrations across the country dubbed \"No Kings on Presidents Day.\"","url":"https://www.ocregister.com/2025/02/17/on-presidents-day-in-irvine-demonstrators-rally-against-president-trump-and-elon-musk/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/OCR-L-NOKINGS-0218-01-MS-1.jpg?w=1024&h=669","video":null,"publish_date":"2025-02-17 23:56:41","author":"Jonathan Horwitz","authors":["Jonathan Horwitz"],"language":"en","category":"politics","source_country":"us","sentiment":0.169},{"id":291564546,"title":"Netanyahu Orders Immediate Enforcement Of UNRWA Law","text":"Israel's Prime Minister Benjamin Netanyahu on Tuesday instructed the immediate enforcement of the UNRWA law, which was passed by the Knesset with broad support.The United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) is a relief and human development agency.Sharing a post on X, Israel PMO said, \"Prime Minister Benjamin Netanyahu has directed that the UNRWA law, which was passed by the Knesset with broad support, be enforced immediately.\"\"There are no restrictions on the implementation of the Prime Minister's directive,\" the post added.Notably, earlier in October 2024, the Israeli parliament, known as the Knesset, passed two laws that called for ending UNRWA's operations in its territory and prohibiting Israeli authorities from having any contact with the agency.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Israel had ordered UNRWA to vacate all premises in occupied East Jerusalem and cease operations in them by January 30 this year.Earlier this month, US President Donald Trump signed executive orders to cut funding for the UNRWA.According to the United Nations, UNRWA was established shortly after the creation of the United Nations itself by General Assembly resolution 302 (IV) in the wake of the 1948 Arab-Israeli war to provide \"direct relief and works programmes\" for registered Palestinian refugees, defined as \"persons whose normal place of residence was Palestine during the period 1 June 1946 to 15 May 1948 and who lost both home and means of livelihood as a result of the 1948 war.\"For decades, the agency has provided essential humanitarian services to Palestine refugees in areas controlled by Israel, notably in Occupied Palestinian Territory, including the West Bank and the Gaza Strip. These include health facilities, schools and vocational training centres.Following the approval of the bill in the Israeli Parliament, Secretary-General Antonio Guterres, stressed the central role that UNRWA plays in the delivery of aid and said that the effective ban would have \"devastating consequences.\" The acting head of the UN aid coordination office, Joyce Msuya, had called the decision \"dangerous and outrageous\" whilst Commissioner-General of UNRWA Philippe Lazzarini had said that the bills will \"increase the suffering of the Palestinians and are nothing less than collective punishment.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Israel's Prime Minister Benjamin Netanyahu on Tuesday instructed the immediate enforcement of the UNRWA law, which was passed by the Knesset with broad support.","url":"https://www.ndtv.com/world-news/israel-pm-benjamin-netanyahu-orders-immediate-enforcement-of-unrwa-law-7734651","image":"https://c.ndtvimg.com/2024-11/ekg2ef7_benjamin-netanyahu-reuters_625x300_24_November_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-02-17 23:49:29","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.182},{"id":291567996,"title":"‘I Honestly Think Europe Is Weak Today’ – Zelensky Says Trump ‘Wants to Please’ Putin","text":"President Volodymyr Zelensky said in an interview broadcast Monday that the United States was trying to “please” Moscow in talks on Ukraine and warned of Europe’s military “weakness.”\n\nReacting to conciliatory comments towards Russia by US officials, Zelensky said, “The US is now saying things that are very favorable to Putin... because they want to please him.”\n\n“They want to meet quickly and have a quick win. But what they want, ‘just a ceasefire,’ is not a win,” Zelensky said, according to a translation provided by broadcaster ARD of an interview recorded Saturday in Munich.\n\nUS President Donald Trump shocked allies last week by announcing he had a direct conversation with Russian autocrat Vladimir Putin on a process to quickly end the war in Ukraine.\n\nUS Defense Secretary Pete Hegseth also appeared to rule out Ukraine joining NATO or retaking the territory lost since 2014.\n\nOn the contours of any future deal, Zelensky said “we will not sign just anything in order to be applauded” and stressed that “the fate of our state for generations to come” was at stake.\n\nHe rejected the idea of ceding Ukrainian territory that Russia has seized, saying: “We will reclaim it all.”\n\nAs European leaders held crisis talks in Paris on the way forward, ARD broadcast the interview which Zelensky recorded during the three-day Munich Security Conference that ended on Sunday.\n\nThe Ukrainian president warned that Europe was in a weak position if it could not rely on the US security umbrella.\n\nWhile “readiness has increased” in recent years, “in terms of troop strength, the number of combat troops, the fleet, the air force, the drones... I honestly think that Europe is weak today,” he said.","summary":"“They want to meet quickly and have a quick win,” the president remarks as US and Russian delegates meet without Ukraine, and leave NATO membership off the table.","url":"https://www.kyivpost.com/post/47309","image":"https://static.kyivpost.com/storage/2024/09/19/ad0014a885ca5410d4d2b9626ab362e8.jpg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-02-17 23:47:43","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"ua","sentiment":-0.196},{"id":291566968,"title":"USAID's Hidden Agenda In India: Sanjeev Sanyal Reveals All To Arnab Goswami | Exclusive","text":"New Delhi: Sanjeev Sanyal, Economic Advisor to Prime Minister Narendra Modi, has exposed the interference of USAID in India's internal affairs and shed light on the growing concerns over foreign influence in national data systems. Speaking exclusively to Republic Media Network’s Editor-in-Chief Arnab Goswami, Sanyal revealed that USAID has been funding various organisations in India to influence the country's policies and decisions. He discussed the involvement of USAID in India's health surveys and its possible role in elections, raising alarm over data security and foreign intervention.Sanyal explained that USAID's influence is not limited to funding organisations, but also extends to infiltrating India's systems. He cited the example of the National Family Health Survey (NFHS), which was being run by USAID until recently. He revealed that for decades, the NFHS, a comprehensive survey crucial for India’s medical and social policies, was controlled by USAID.\"This data is the source of a lot of policies made in medical and social policy,\" Sanyal said, underlining how USAID once dictated survey designs and analyses. He stated that he was shocked to discover the situation during his work on COVID-related health data. He explained that after raising awareness, the Indian government removed USAID's influence from the latest round of the survey.While Sanyal praised the government's efforts, he made it clear that much more needs to be done to protect India's sovereignty and ensure national security.‘We Have to Peel Out the Layers’Sanyal stressed that it's not easy to expose USAID's interference, as they operate through multiple layers of organisations and agencies. He said, \"The more you dig, the more you will find,\" and added that USAID’s actions had been hidden behind multiple layers of funding agencies, making it difficult to identify the extent of their influence.Concerns Over Electoral Data and Foreign FundingThe PM’s economic advisor also addressed the issue of foreign influence on India’s electoral data. When Arnab Goswami raised concerns, Sanyal acknowledged that foreign interference is a concern. He further noted how the USAID's involvement in projects like the voter turnout grants, amounting to 182 crores, which is around USD 21 million, could be seen as an attempt to control narratives around India's democracy.\"These organisations may do good work, but their intent is something else,\" Sanyal stated, emphasising the dangers of foreign funding in sensitive national data and policy areas.USAID’s Role In Shaping Global NarrativesSanyal pointed out that USAID is part of a larger network of international agencies that fund the creation of indices such as the Democracy Index, Freedom Index, and Happiness Index. According to Sanyal, these indices are often used to shape global opinions about India’s democracy, media freedom, and governance, which in turn affect sovereign ratings and international media narratives. He described this as a “layer upon layer” of narrative building that controls how countries like India are perceived globally.Efforts to Push Back Against Foreign InfluenceSanjeev Sanyal outlined the challenges India faces when pushing back against foreign influence in such systems. He acknowledged that the government has made efforts to address issues like banning TikTok and pushing back against USAID’s control over national surveys, asserting that real change requires a lot of time and effort.\"These changes take time, and they are part of a long process,\" Sanyal said, stressing that although progress is being made, the battle is far from over. He pointed to the government's success in pushing the World Bank to review its World Governance Indicators, which Sanyal discovered were run by independent researchers rather than the World Bank itself.‘Need to Expose the Indians Who Took Money from USAID’He also revealed that the World Bank is involved in promoting USAID's agenda in India. He explained that the World Bank's World Governance Indicators are used to legitimise certain indices and think tanks, which are then used to influence India's policies.Sanyal praised US President Donald Trump's stance on USAID, saying it's a game-changer. He said, “Trump's administration has taken a strong stance against USAID's interference in other countries' internal affairs.”Sanyal pressed for the need to expose the Indians who took money from USAID to influence the country's policies. He said, \"We need to know who these people are and hold them accountable for their actions.\"Long Road AheadHe acknowledged that dealing with these foreign influences requires patience and continued effort. \"It's not easy,\" he remarked, adding that the battle against foreign influence in India’s data systems and policy-making would continue. However, with the support of the Indian government, he believes that more can be done to address these issues.\"Thanks to the backing of the top political administration, we are making progress, but there's still a long road ahead,\" Sanyal concluded.","summary":"USAID&#39;s Hidden Agenda In India: Sanjeev Sanyal Reveals All To Arnab Goswami | Exclusive","url":"https://www.republicworld.com/india/usaid-s-hidden-agenda-in-india-sanjeev-sanyal-reveals-all-to-arnab-goswami-exclusive","image":"https://img.republicworld.com/all_images/usaid-s-hidden-agenda-in-india-sanjeev-sanyal-reveals-all-to-arnab-goswami-exclusive-1739835984190-16_9.webp","video":null,"publish_date":"2025-02-17 23:46:30","author":"Digital Desk","authors":["Digital Desk"],"language":"en","source_country":"in","sentiment":0.097},{"id":291558668,"title":"European leaders warn against Ukraine ceasefire without peace deal, official says","text":"A group of European leaders agreed at a meeting in Paris on Monday they were ready to give Ukraine security guarantees, but it would be dangerous to conclude a ceasefire without a peace agreement at the same time, a European Union official said.\n“We are ready to provide security guarantees, with modalities to be examined with each party, depending on the level of American support,” said the official, summarising the results of the Paris meeting.\nThe meeting was called by French President Emmanuel Macron after US President Donald Trump arranged bilateral peace talks with Russia, excluding European allies and Ukraine from negotiations that are expected to begin in Saudi Arabia on Tuesday.\nMacron, British Prime Minister Keir Starmer, German Chancellor Olaf Scholz, Italian Prime Minister Giorgia Meloni, Polish Prime Minister Donald Tusk and Spanish Prime Minister Pedro Sanchez were among the leaders at the meeting.\nAlso taking part were Dutch Prime Minister Dick Schoof, Danish Prime Minister Mette Frederiksen, Nato boss Mark Rutte, European Commission President Ursula von der Leyen and European Council President Antonio Costa.\n“We agree with President Trump on a ‘peace through strength’ approach,” the EU official said, speaking on condition of anonymity.\n“We believe it is dangerous to conclude a ceasefire without a peace agreement at the same time,” the official added.","summary":"Group said it was ready to provide security guarantees depending on level of US support, an official summarising Monday’s Paris meeting said.","url":"https://www.scmp.com/news/world/europe/article/3299063/european-leaders-warn-against-ukraine-ceasefire-without-peace-deal-official-says","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/18/a799418e-93b2-488c-a307-4e49d39d2450_315d2d14.jpg","video":null,"publish_date":"2025-02-17 23:42:55","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":0.401},{"id":291562646,"title":"‘No kings’ protest hits Hub","text":"Protesters against President Donald Trump and his policies braved frigid temperatures to demonstrate Monday at rallies corresponding with the Presidents Day holiday.\n\nDubbed “No Kings on Presidents Day” by the 50501 Movement, the latest protests came less than two weeks after a similar nationwide event on Feb. 5 drew participants in dozens of cities. Both protests denounced Trump and billionaire adviser Elon Musk, the leader of Trump’s new Department of Government Efficiency, an outside-government organization designed to slash federal spending.\n\nNearly 1,000 people marched in the snow from the Statehouse in Boston to City Hall, chanting “Elon Musk has got to go” and “No kings on Presidents Day!” The temperature was below freezing with wind chills in the teens.\n\nBoston protesters, some dressed in Revolutionary War-style clothing from the 1700s, carried signs saying such things as “This is a Coup” and “Cowards Bow to Trump, Patriots Stand Up.” One sign had a depiction of Uncle Sam saying “I Want You to Resist.”\n\n“I thought it was important to be here on Presidents Day to demonstrate for what America stands for,” said Emily Manning, 55, a Boston engineer who came to the rally with her two teenage sons. “American values are not the values of the plutocracy or the limited few rich people.”\n\nOrganizers of Monday’s protests, which were focused on state capitals and major cities including Washington, D.C.; Orlando, Florida; and Seattle, said they were targeting “anti-democratic and illegal actions of the Trump administration and its plutocratic allies.”\n\nOne sign at the rally that attracted hundreds in the nation’s capital said, “Deport Musk Dethrone Trump.”\n\nMany demonstrations were slated for cities where temperatures were well below freezing as a polar vortex worked its way across the country.\n\nThe rallies followed a series of Trump executive orders and came just days after layoffs across federal agencies as part of an effort to reduce the government workforce.","summary":"Protesters against President Donald Trump and his policies braved frigid temperatures to demonstrate Monday at rallies corresponding with the Presidents Day holiday.","url":"https://www.bostonherald.com/2025/02/17/no-kings-protest-hits-hub/","image":"https://www.bostonherald.com/wp-content/uploads/2025/02/AP25048665896877.jpg?w=1024&h=768","video":null,"publish_date":"2025-02-17 23:41:45","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.134},{"id":291558438,"title":"Canadian national anthem receives mixed reception at hockey game amid Donald Trump controversy","text":"Canadian national anthem receives mixed reception at hockey game amid Donald Trump controversy\n\nREAD MORE: NASCAR fans go wild as Trump whips around Daytona 500\n\nLISTEN: Elon’s baby mama drama, Tom Hank’s SNL backlash and more DOGE cuts – on Welcome to MAGALand, the Daily Mail’s politics podcast with White House Insiders\n\nBy JAKE NISSE and ASSOCIATED PRESS\n\nPublished: 23:24 GMT, 17 February 2025 | Updated: 23:39 GMT, 17 February 2025\n\nThe Canadian national anthem was jeered by some fans on Monday at the 4 Nations Face-Off in Boston - just days after 'The Star-Spangled Banner' was loudly booed when Canada and the United States' hockey teams faced off on Saturday.\n\nAmid provocative rhetoric from President Donald Trump - including suggesting the country should be the USA's 51st state and placing new tariffs on the northern neighbors - tensions have risen between the allies.\n\n'O Canada', on Monday, was not met with the level of vitriol that the American national anthem received over the weekend in Montreal, but a smattering of boos could still be heard in the crowd amid mostly cheers before Canada faced Finland.\n\nBefore the anthems were played, the public address announcer asked 'that you kindly respect the nation, its inhabitants and the players that represent each country.' \n\nDuring player introductions, the Canadian team received a louder but still mixed greeting, with the exception of forward Brad Marchand, whose full-time job is with the Boston Bruins. The Finns were met with mostly silence.\n\nThe crowd featured many fans in red Canadian sweaters.\n\nPlenty of Canadian fans were in the stands on Monday as their team took on Finland in Boston\n\nPresident Donald Trump has recently stoked tensions between the USA and Canada, as he's floated the idea of adding Canada as America's 51st state.\n\nThe American national anthem was loudly booed when the USA faced Canada in Montreal\n\nA mixture of cheering and boo’ing for the Canadian national anthem in Boston ahead of Canada vs Finland at the #4Nations pic.twitter.com/yVXWLrjiA9\n— Claire Hanna (@clahanna) February 17, 2025\n\nAfter Trump said he was serious about Canada becoming the 51st state in a Super Bowl interview, fans across Canada have booed the US anthem at NHL and NBA games.\n\nCanada and Mexico also ordered retaliatory tariffs on American goods in response to sweeping tariffs imposed by President Trump.\n\n 'We can play the game all they want,' Trump later said.\n\nNFL star issues four-word response to Canadians booing American anthem\n\nThat tension came into the spotlight on Saturday before the United States played Canada, as 'The Star-Spangled Banner' was loudly booed before the Americans won 3-1 in a highly-anticipated '4 Nations Faceoff' clash.\n\nThe NHL has taken a pause for the '4 Nations Faceoff' - a mini tournament held between the USA, Canada, Sweden, and Finland as a tune-up before NHL players are finally allowed to compete again at the Winter Olympics .\n\nThe Canadian fans drowned out any negativity on Monday with cheers as they went on to beat Finland 5-3.\n\nWith the victory in regulation, Canada advanced to Thursday night's finals against the United States.\n\nThe finals will also be held in Boston at the TD Garden.\n\nDonald Trump\n\nShare or comment on this article:\nCanadian national anthem receives mixed reception at hockey game amid Donald Trump controversy\n\nAdd comment","summary":"The Canadian national anthem was jeered by some fans on Monday at the 4 Nations Face-Off in Boston - just days after 'The Star-Spangled Banner' was loudly booed.","url":"https://www.dailymail.co.uk/sport/nhl/article-14407291/canadian-national-anthem-boos-hockey.html","image":"https://i.dailymail.co.uk/1s/2025/02/17/23/95311379-0-Plenty_of_Canadian_fans_were_in_the_stands_on_Monday_as_their_te-a-29_1739834319472.jpg","video":null,"publish_date":"2025-02-17 23:39:34","author":"Associated,Editor,Jake Nisse","authors":["Associated","Editor","Jake Nisse"],"language":"en","category":"politics","source_country":"gb","sentiment":0.26},{"id":291559436,"title":"Sir Keir Starmer joins Europe in confronting reality of Trump and Putin’s emerging new world order","text":"Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy.\n\nWhen he emerged, after three hours of discussion, he looked sombre.\n\nSir Keir, like the other political heavyweights who came to the Elysee Palace, knows that Europe has been battered and marginalised over the past week or so by the actions and rhetoric that have come out of Washington.\n\nSo this meeting was, to an extent, about political leaders reasserting themselves.\n\nBut when we spoke, it was clear that it was also about laying down a line.\n\nNot so much about what a peace deal for Ukraine might look like, but how it would be policed.\n\nThe prime minister said he was prepared to deploy British troops on the ground but was emphatic that the US would have to provide what he called a “backstop”.\n\nHe didn’t elaborate on exactly what this would mean, but it’s clear that he’s talking about America committing its military muscle to secure Ukraine’s future.\n\n“A lasting peace”, as the prime minister insists, rather than a ceasefire that, European leaders believe, will simply allow Vladimir Putin to regroup his forces and launch another offensive.\n\nSir Keir is trying to flex some diplomatic muscles – striking a more strident tone than, say, Olaf Scholz, the surely-soon-to-be former chancellor of Germany, while also promising to go to Washington next week for talks with Donald Trump, and then reporting back to European leaders.\n\nIt is, one suspects, a rare chance for Sir Keir to take a leadership role in post-Brexit Europe, and it’s one he wants to take.\n\nRead more:Delta plane upside down on Toronto runwayDetained Brits were warned to not travel to ‘unsafe’ areaWoman, 35, sentenced over Jellycat thefts\n\nBut the bigger fear for Europeans may be that America and Russia don’t want to talk to each other about just Ukraine – but also trade deals, geopolitical agreements, and potential land carve-ups.\n\nIf Donald Trump really does see America’s future in the stark terms of a transactional deal-maker, he may have more in common with Putin than he does with most European leaders.\n\nAnd that would look like a new world order.","summary":"Sir Keir Starmer was the first leader to arrive at this meeting in Paris, strolling down the road from the British Embassy. When he emerged, after three hours of discussion, he looked sombre. Sir Keir, like the other political heavyweights who came to the Elysee Palace, knows that Europe has been battered and marginalised over &#8230;\n\n\nThe post Sir Keir Starmer joins Europe in confronting reality of Trump and Putin&#8217;s emerging new world order appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/sir-keir-starmer-joins-europe-in-confronting-reality-of-trump-and-putins-emerging-new-world-order/","image":"https://e3.365dm.com/25/02/1600x900/skynews-keir-starmer-emmanuel-macron_6831937.jpg?20250217200030","video":null,"publish_date":"2025-02-17 23:38:56","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.044},{"id":291557170,"title":"Trump gives hot dogs and thumbs up to supporters at Presidents’ Day golf outing","text":"President Donald Trump’s team rewarded MAGA fans waiting to see him outside his West Palm Beach golf club with hot dogs on the Presidents’ Day holiday. \n\nTrump spent more than five hours at the property on Monday, as he spent the long holiday weekend at his Mar-a-Lago resort after traveling to the Daytona 500 on Sunday.\n\nAmong those waiting to catch a glimpse of the president on Monday was former Proud Boys leader Enrique Tarrio, who was pardoned alongside other January 6 participants, and is now planning to run for public office. \n\nTarrio and other Proud Boys members posted pictures and video of themselves – with the hot dogs – across the street from Trump International Golf Club West Palm Beach. \n\n‘You guys ever seen a terrorist threesome?’ Tarrio said in a video clip, showing himself and two other Proud Boys. ‘One, two and the prettiest one – three,’ he said, having the camera linger on his own face. \n\nIn another video, Tarrio prodded the other Proud Boys with a bun-less hot dog. \n\nTrump got out of the Beast and gestured toward the crowd from the tree-lined driveway of the West Palm Beach club – prompting cheers and screams from his MAGA faithful. \n\nHe also waved to his supporters from the presidential limousine as it whizzed by them without further stopping. \n\nIn the past, Trump has sometimes stopped and handed out MAGA merchandise to waiting fans. \n\nAfter Trump was nearly killed at his Butler, Pennsylvania rally in July, a potential assasin was found lurking on the West Palm Beach property. \n\nTrump pardoned Tarrio and others imprisoned for January 6 related crimes during his first day in office – a controverisal move as he didn’t differentiate between violent and non-violent offenders. \n\nTarrio, who heralds from nearby Miami, was sentenced in September 2023 to serve 22 years in prison after he was convicted of seditious conspiracy for helping plan the January 6 attack. \n\nTwo weeks after leaving prison, Tarrio was a guest at Trump’s Mar-a-Lago.\n\nTarrio told Newsmax’s Greg Kelly earlier this month that he believed he had a future in politics. \n\n‘I think I’m gonna take a serious look at running for office at some point in 2026 or 2028, and I believe that there is a path for that because it is my passion,’ he said. \n\nTarrio had advertised that he and other members of the Proud Boys would be outside Trump’s golf club ahead of the event. \n\n‘Tomorrow the Boys will show up to show love to the man who freed us!’ he wrote in a post Sunday. \n\nSecret Service screened the participants ahead of Trump’s drive-by, another attendee said. \n\nAlso on Monday, Trump spoke briefly by phone with French President Emmanuel Macron as European leaders fret over a deal being etched for Ukraine between the U.S. and Russia. \n\nOn Tuesday, Secretary of State Marco Rubio will lead a delegation and meet with his Russian counterpart, Sergey Lavrov, in Riyadh, Saudi Arabia, as the U.S. looks to make a peace deal to end the war in Ukraine – which was a key Trump campaign promise. \n\nThe planned bilateral talks have unsettled European leaders. \n\n‘Today President Donald J. Trump and French President Emmanuel Macron had a friendly call,’ a White House official said in a statement after Trump returned to Mar-a-Lago for the night.\n\n‘The leaders talked about the Ukraine War, the upcoming meeting of European nations tomorrow, and the talks in Saudi Arabia between U.S. and Russian officials,’ the official said. ‘The call lasted approximately 30 minutes.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump&#8217;s team rewarded MAGA fans waiting to see him outside&#8230;\n\n\nThis Post: Trump gives hot dogs and thumbs up to supporters at Presidents&#8217; Day golf outing first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-gives-hot-dogs-and-thumbs-up-to-supporters-at-presidents-day-golf-outing/","image":"https://i.dailymail.co.uk/1s/2025/02/17/21/95309933-14407017-image-a-2_1739829363993.jpg","video":null,"publish_date":"2025-02-17 23:37:46","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.011},{"id":291560508,"title":"BHP’s Profit Slump Prompts Hefty Cut to Interim Dividend","text":"The top metals consumer is also yet to feel the sting of tariffs leveled by the US. Just two weeks ago, President Donald Trump signed executive orders imposing tariffs of 10% across the board on all imports from China. \n\n“China recently reiterated a pro-growth policy stance with more accommodative monetary and proactive fiscal measures,” BHP said in its economic outlook. “In the face of external trade uncertainty, policymakers have vowed to boost domestic demand via several measures that should support steel and metals-related manufacturing demand.” \n\nIndia continues to be a “bright spot” for commodity demand, it said.\n\nBHP sees copper as one of its most important growth areas, along with potash used to manufacture fertilizer, as China’s demand for steelmaking material iron ore plateaus. \n\nDuring the reporting period, BHP announced it would spend at least $10 billion to maintain and grow copper production across its Chilean portfolio over the next decade and a half. It will spend at least $4 billion at its Escondida copper mine alone.\n\nMines such as Escondida, where BHP has an operational 57.5% interest alongside Rio Tinto Group, are aging and deposits of such size and scale are rare. In January, BHP completed its acquisition of Filo Corp. with partner Lundin Mining Corp., which owns the Filo Del Sol mine in Chile. BHP’s 50% stake in Filo cost around $2.1 billion. \n\n(Updates with details throughout.)","summary":"BHP Group Ltd. said first-half profit slumped 23% as China’s faltering economy dampened demand for iron ore, prompting the miner to cut its interim dividend to an eight-year low.","url":"https://financialpost.com/pmn/business-pmn/bhps-profit-slump-prompts-hefty-cut-to-interim-dividend","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/776009889.jpg","video":null,"publish_date":"2025-02-17 23:36:06","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"ca","sentiment":0.228},{"id":291557412,"title":"UFC boss Dana White reveals astonishing fate of childhood home after he bought-up entire street","text":"Ultimate Fighting Championship President and CEO Dana White has revealed what he did with his grandparents' home, where he fondly remembers spending summers as a child.\n\nWhite, originally from Connecticut, recounted to the Bangor Daily News how he grew up visiting his grandparents and cousins in Levant, Maine.\n\n'My time up there meant so much to me and I loved the place so much that I bought up the whole street that my grandmother and grandfather live on,' he said. \n\n'I went house to house, knocked on everyone's door and asked if they would sell me their house.'\n\nThe 55-year-old Trump-ally, who has an estimated net worth of $500 million, then donated the houses to the local fire department to burn down as part of their training exercises.\n\nOne of the homes on Phillips Road was burned down about five years ago, Wyatt Morrison, a lieutenant for the Levant Fire Department, confirmed to the outlet.\n\nIt had previously burned down another of White's houses about 10 to 15 years ago, before Morrison joined the force, he said.\n\nStill, White owns nine houses on the street, totaling 60 acres, which he combined into one property. \n\nHe also owns 30 acres on nearby Kenduskeag Road and three acres on Black Stream Drive, as well as a property in the city of Bangor that is now the home of Umami Noodle Bar.\n\n'I wanted my kids to experience the place and the people, and that's why I invested so much in Maine,' White said, as he vowed to continue buying up property in the Pine Tree State.\n\n'I continue to buy more and more property up there and I will until the day I die.'\n\nTo make the most out of his homeownership, White now spends every Fourth of July with his family in Levant, and often brings his friends to the area for summer vacation.\n\n'I will go there every summer until I physically can't go there anymore,' he said, explaining: 'When I want to get away from everything, I go to Maine. Everything I love is in Maine.'\n\nNow, White is a noticeable presence in the community, attracting local attention whenever he returns to town.\n\nHe has also tried to give back to the community, donating $100,000 to his alma mater, Hermon High School, in 2011 to upgrade its athletic complex, and bringing a UFC Fight Night event to the Cross Insurance Center in 2014, despite claiming it was not financially beneficial for his company.\n\nIn 2016, White even filmed an episode of his internet reality show Dana White: Lookin' for a Fight in Bangor, which featured five local firefighters.\n\nBut outside the community, White has made a name for himself as the head of UFC, and in more recent years as a staunch supporter of President Donald Trump. \n\nHe was featured at a major Trump rally in New York City at the end of October, and had the then-president elect appear at the UFC 309 clash.\n\nWhite was even in attendance as Trump took the oath of office last month, and praised the Republican for his electoral victory.\n\n'Not only did he win the electoral college by 86 points, but President Trump was the first Republican candidate in 20 years to win the popular vote,' he said ahead of the inauguration.\n\n'He also made tremendous gains among traditional Democrat voters by increasing his support with Latin, Asian-American, black and young voters. \n\n'So what does that tell us?' White asked, rhetorically. 'Democracy is alive and well in this country. And the people have spoke loud and clear: America wants President Trump back in the White House.'\n\nWhite also portrayed Trump as a hero for overcoming the media, legal system, and even an assassin's bullet during his campaign.\n\n'Think about this, winning this election after everything that's happened over the last few years is an amazing achievement and an incredible comeback story,' White said. \n\n'Think of all the things President Trump had to go through to get back here, all the powerful forces that tried to take him down: the mainstream media, partisan prosecutors, assassins.\n\n'It's absolutely insane what this man has been through. And only President Trump could have fought through all those obstacles, all the attacks and still come out the winner.\n\n'But you know what?' White continued. 'That's just what he is. This guy is a winner.'\n\nYet White told the Bangor Daily News he has 'zero interest' in taking on a political position in Trump's new White House.\n\nInstead, he seems more focused on his new role as a board member for Meta, which he said he accepted due to his passion for social media and artificial intelligence and his belief that 'it's the future.'\n\n'I've used those tools to help build my businesses,' White explained.\n\n'Now, not only do I get to learn more from the inside, I actually have a hand in the future of it.","summary":"Ultimate Fighting Championship President and CEO Dana White has revealed what he did with his grandparents' home, where he fondly remembers spending summers as a child.","url":"https://www.dailymail.co.uk/news/article-14407171/UFC-boss-Dana-White-Maine-home.html","image":"https://i.dailymail.co.uk/1s/2025/02/17/23/95311737-0-image-m-15_1739834760201.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/20/3763335016129674593/1024x576_MP4_3763335016129674593.mp4","publish_date":"2025-02-17 23:32:13","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.009},{"id":291555326,"title":"Did Trump Fire All FAA Workers? Find Out Amid Federal Layoffs","text":"The Federal Aviation Administration (FAA) has experienced a significant loss of employees due to policies implemented by President Donald Trump‘s administration. This has raised concerns, particularly as the U.S. has seen an alarming increase in plane crashes since the start of the year. Additionally, FAA officials have warned over the years that the agency is understaffed and that its employees are working in an overstressed system. In 2023, as reported by AP, Jennifer Homendy, chair of the National Transportation Safety Board, told a Senate panel that air traffic and staffing shortages have worsened since the pandemic.\n\nFollowing the deadly collision in Washington on January 29 between a Black Hawk helicopter and an American Airlines jet, President Trump appointed Chris Rocheleau as the Acting FAA Administrator. He described Rocheleau, a 22-year FAA veteran, as “highly respected.” Without evidence, the President blamed FAA diversity requirements and his two Democratic predecessors for the crash that killed 67 people, alleging lax air traffic control standards.\n\nFind out more about the agency and layoffs below.\n\nHow Many Federal Workers Are There in America?\n\nThe number of federal workers in the U.S. varies, but according to The Hill, there are over 2.1 million federal employees across various agencies, including the Department of Defense, Health and Human Services, and the Department of Homeland Security.\n\nWhat Is the FAA?\n\nThe Federal Aviation Administration (FAA) is a government agency responsible for regulating and overseeing civil aviation in the U.S., including air traffic control, aircraft certification, and aviation safety.\n\nDid Trump Fire FAA Employees?\n\nAccording to the Professional Aviation Safety Specialists (PASS) union, “several hundred” workers received termination notices on Friday, with the number estimated to be close to 300.\n\nThe firings at the FAA did not include air traffic controllers but appeared to affect engineers and technicians. Many of the workers terminated were probationary employees, having been employed for less than a year and lacking job protection.\n\n“This decision did not consider the staffing needs of the FAA, which is already challenged by understaffing,” David Spero, the national president of the Professional Aviation Safety Specialists, AFL-CIO, said in a statement. “Staffing decisions should be based on an individual agency’s mission-critical needs. To do otherwise is dangerous when it comes to public safety. And it is especially unconscionable in the aftermath of three deadly aircraft accidents in the past month.”","summary":"The Federal Aviation Administration is the latest agency to lose hundreds of employees, even as deadly crashes continue to rise in the U.S. Find out more here.","url":"https://hollywoodlife.com/2025/02/17/did-trump-fire-faa-workers-federal-layoffs/","image":"https://hollywoodlife.com/wp-content/uploads/2025/02/GettyImages-2194444069-e1739831170964.jpg?fit=2860%2C1615","video":null,"publish_date":"2025-02-17 23:27:27","author":"Vivian","authors":["Vivian"],"language":"en","category":"politics","source_country":"US","sentiment":-0.503},{"id":291556942,"title":"What the bleep?","text":"\"Profanity is the parlance of the fool.\" — President Teddy Roosevelt \"Be on time. Never criticize a teammate. Never use profanity.\" — UCLA 10-time NCAA Basketball Champion Head Coach John Wooden \"I’ve been accused of vulgarity. I say that’s bulls---.\" – Filmmaker Mel Brooks Do members of Congress curse? GOP REP WHO RETURNED TO CONGRESS AFTER EIGHT-YEAR BREAK CREDITS TRUMP WITH UNIFYING PARTY Of course. Democrats aren’t fussing about President Trump and Elon Musk. They’re cussing about President Trump and Elon Musk. It’s customary for members of Congress to express their views on the president of the United States. They may request a concrete step on domestic policy. A healthcare issue. Suggest an approach on dealing with China or the Middle East. Maybe an initiative to improve the economy, bolster jobs or increase productivity. But congressional Democrats have very specific ideas about President Trump — and what should happen to him. And in some cases, Musk. COMER, LEE ROLL OUT BICAMERAL BILL TO FAST-TACK TRUMP'S GOVERNMENT REORGANIZATION PLANS THROUGH CONGRESS \"F--- Donald Trump and Elon Musk,\" said Rep. Mark Pocan, D-Wisc., at a Capitol Hill rally for the union which represents many federal employees. Rep. Donald Norcross, D-N.J., spoke about working as a construction worker and electrician for the International Brotherhood of Electoral Workers in Atlantic City. \"We had a guy called Donald Trump. We fought with him for ten years,\" said Norcross. \"I’m from Jersey. So we speak a little differently. I say f--- Trump!\" Rep. Maxine Dexter, D-Ore., is a freshman and a pulmonologist. \"I don’t swear in public very well,\" conceded Dexter. But the congresswoman proved she could cuss like a sailor. \"We have to f--- Trump!\" fulminated Dexter. It’s unclear what rubric Dexter relied on to judge if she swore \"very well\" or failed in her lexical mission. But just six weeks into her first term in Congress, Dexter had cussed out the president of the United States. It’s a feat her predecessor, former Rep. Earl Blumenauer, D-Ore., never matched in his nearly three decades in Congress. Cheese and crackers! Rep. Linda Sanchez, D-Calif., took a slightly different approach. She didn’t issue a verbal disposition to the president. She issued a slightly sanitized call to action. \"It’s time to push back on the bullies. Are you guys ready to fight? Let’s effing go!\" yelled Sachez at the protest with federal employees. Rep. Brendan Boyle, D-Penn., did not direct his obscenities at the president. Instead, Boyle was more general in his characterization about what has gone down during the first month of the Trump administration. \"I’m from the home of the Super Bowl champion Eagles,\" bragged Boyle. \"The great Super Bowl run was actually a welcome distraction for me and all of us in Philly from the sort of bulls--- that’s been going on.\" Fly Eagles, fly. But for the record, Boyle did not give the president the bird. Rep. Maxwell Frost, D-Fla., parroted Boyle’s profanity. \"Bulls---. Bulls---. That is why we're here to fight them,\" said Frost, focusing on Musk. \"We can't allow this unelected billionaire to come in and to eviscerate the things we fought so hard to get right. This isn't about protecting the system.\" Son of a biscuit eater! I don’t know where you went to school, but where I grew up in rural Ohio, a teacher might threaten to wash out a student’s mouth with soap if they used salty language. Hey. It was the 1970s. It’s unclear if there’s a remedy to pasteurize the vulgar language now directed toward the president from congressional Democrats. But apparently to the Democrats, desperate times call for #*&@?+&! measures. In fact, if Democrats kept a \"swear jar,\" it’s possible their regular contributions could offset some of the proposed cuts by DOGE. Major League Baseball players returned to the diamond for an abbreviated season in the summer of 2020 — cut short by the pandemic. With no fans cheering and the games unfolding inside cavernous, empty stadiums, field microphones truly picked up the \"sounds of the game.\" The experience put an entirely new spin on \"color commentary.\" Turns out there were more than just foul balls in the national pastime. So for Democrats, perhaps cursing is the new vernacular. It may be helpful to let off steam. The language may rile up the base. It may even pep up a crowd of government workers who fear for their jobs under DOGE. Does it make a difference in the policy? Probably not. Does it persuade the president? No. Does it capture the attention of those aligned with President Trump — whom Democrats need to bring into their fray? Doubtful. YOU'RE HIRED! HERE'S WHO PASSED CONGRESS' TRUMP CABINET TEST AND HOW STORMY THEIR HEARINGS WERE Democrats may think some of that’s balderdash. \"We have to start liberating politicians to speak to the truth,\" said former Democratic presidential candidate and Rep. Dean Phillips, D-Minn., on Fox. Phillips just left Congress last month. Democrats are certainly speaking. It’s just unclear if their cussing boosts the message. Or, is the swearing the message. It might underscore just how frustrated Democrats are with what President Trump is doing — to say nothing of the fact that he’s in office for a second term. The language replicates what Democrats did in 2017 during Mr. Trump’s first term. \"We should go the f--- home,\" said Sen. Kirsten Gillibrand, D-N.Y., eight years ago if Democrats weren’t tangibly helping people. Granted, President Trump’s expletives shifted the political linguistic paradigm when he first campaigned in 2015 and 2016. A 2019 New York Times article referred to Mr. Trump as the \"profanity President.\" Part of the president’s political appeal was that he spoke \"everyday\" language. That resonated with large swaths of voters who wanted answers to their problems and were fatigued by sterilized bromides. Clean language was usually the default of public officials until recent years. Now everyone seems to have a case of political potty mouth. But politicians have long relied on expletives. Former President Biden was captured on mics in a stage whisper when he leaned in to tell President Obama that passing Obamacare was \"a big f---ing deal\" in 2010. Then-Vice President Dick Cheney told former Sen. Patrick Leahy, D-Vt., to \"go f--- yourself\" when he visited the Capitol in 2004. In 2000, President George W. Bush spotted the late New York Times political reporter Adam Clymer in the crowd while campaigning in Naperville, Illnois. The future president observed to Cheney that Clymer was a \"major league a--hole.\" So for now, Democrats are trying to calibrate their response to President Trump. \"We can’t always be at a 10,\" said Rep. Jared Moskowitz, D-Fla. \"We’re going to have to find degrees of outrage here.\" That’s the elusive recipe for Democrats. President Trump, Musk and congressional Republicans give Democrats a lot to work with. But they have yet to make a significant impact in their opposition. CLICK HERE TO GET THE FOX NEWS APP As Phillips suggests, Democrats must figure this out. Otherwise, they’re f---ed.","summary":"Congressional Democrats have very specific ideas about President Trump and Elon Musk, and they aren&apos;t fussing, but cussing about them.","url":"https://www.foxnews.com/politics/what-bleep","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/01/931/523/GettyImages-1245975558.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-17 23:23:31","author":"Chad Pergram","authors":["Chad Pergram"],"language":"en","category":"sports","source_country":"us","sentiment":-0.099},{"id":291557294,"title":"Federal mass firings will increase wildfire risk, endanger Colorado’s public lands, state leaders warn","text":"Mass firings across federal agencies responsible for wildfire prevention and public lands management will endanger Coloradans and put at risk the state’s mountains, rivers and grasslands, state leaders said.\n\nPresident Donald Trump‘s administration on Friday, via a form email, fired thousands of probationary employees across the Department of the Interior and the U.S. Forest Service. They hit federal agencies that manage the more than 24 million acres of federal public lands in Colorado that fuel the state’s economy, make outdoor recreation possible and provide habitat for countless species.\n\nThe extent of the cuts in Colorado remained unclear on Monday. At least 90 Forest Service employees based in Colorado were fired, according to Gov. Jared Polis’ office. Firefighters were spared from the cuts, but other employees who worked in wildfire prevention and forest management were fired.\n\n“It’s reckless endangerment to Coloradans and could increase homeowners insurance costs further for the Trump administration to take a hammer to those who help protect us against wildfires through watershed protection and forest management, tipping the scale toward more fire danger with potentially devastating consequences,” Polis said in a statement. “It’s fine if they don’t like how the federal government works today, but risking our health and safety with no replacement is reckless.”\n\nFederal public lands cover approximately 37,500 square miles in Colorado — about of third of the state — and are primarily managed by the U.S. Bureau of Land Management and the National Park Service within the Department of the Interior and the Forest Service, which is an agency within the U.S. Department of Agriculture.\n\nThe firings followed a decision to freeze seasonal hires across the federal government, including at the National Park Service, which relies on seasonal employees to manage crowds during peak visitation seasons.\n\nSpokespeople for the Agriculture and Interior departments did not respond to questions from The Denver Post asking how many Colorado-based employees were fired.\n\n“Secretary Rollins fully supports President Trump’s directive to optimize government operations, eliminate inefficiencies, and strengthen USDA’s ability to better serve American farmers, ranchers, loggers and the agriculture community,” an unnamed Department of Agriculture spokesperson said Friday in an emailed statement in response to questions. “We have a solemn responsibility to be good stewards of Americans’ hard-earned taxpayer dollars and to ensure that every dollar is being spent as effectively as possible to serve the people, not the bureaucracy.”\n\nThe mass firings prompted Democratic members of Colorado’s congressional delegation to demand the reinstatement of employees.\n\nThe Forest Service already faces critical understaffing and underfunding, U.S. Sens. Michael Bennet and John Hickenlooper and U.S. Reps. Joe Neguse, Brittany Pettersen and Jason Crow wrote in a joint letter Friday.\n\nThe Forest Service in Colorado manages nine national forests and two national grasslands. The agency’s jurisdiction includes beloved and iconic places like the Indian Peaks Wilderness west of Boulder, the Maroon Bells outside Aspen as well as the land that many of the state’s ski resorts operate on. \n\nThe agency’s staff nationwide declined 30% in the last three decades even as visitation to forests dramatically increased and wildfires became more frequent and destructive. Nearly all of Colorado’s largest wildfires burned on forest service land.\n\n“These public servants not only maintain the health of our headwaters and wildlife habitat but help keep our communities safe by decreasing the risk of wildfire destroying homes and critical infrastructure,” the Democratic lawmakers wrote. “They put out campfires, clear trails, clean bathrooms, and manage trailheads. They also help businesses with the permitting process to use Forest Service lands, including grazers, guides, outfitters, ski resorts, and oil, gas and mining operations.”\n\nThe indiscriminate cuts risk permanent damage to Colorado’s federal public lands and threaten the rural communities that rely economically on outdoor recreation and tourism, Ridgway Mayor John Clark said in a news release.\n\n“President Trump’s approach to public lands is a threat to our way of life in rural Colorado,” Clark said.\n\nThe firings are part of a broader effort led by the Trump-empowered billionaire businessman Elon Musk to downsize the federal government.\n\nLayoffs are unlikely to yield significant deficit savings, however. When the Congressional Budget Office looked at the issue, it found the government spent $271 billion annually compensating civilian federal workers, with about 60% of that total going to workers employed by the departments of Defense, Homeland Security and Veterans Affairs.\n\nThe government could, in theory, cut all those workers and still run a deficit of over $1 trillion. It would continue to grow as tax revenues are needed to keep up with the growing costs of Social Security and Medicare.\n\n“These terminations are foolish, heartless, and do nothing to make the government more efficient,” said Aaron Weiss, deputy director of the Center for Western Priorities, a Colorado-based conservation advocacy group. “They will, however, endanger parks, communities, water, and wildlife across the country.\n\n“Firing the next generation of America’s park rangers, scientists, and land managers is a recipe for literal disaster. I don’t know whether we’ll see overflowing latrines, polluted streams, or deadly wildfires first, but (Interior Secretary) Doug Burgum is already leaving a path of destruction across America’s parks and public lands.”\n\nStaff writer Nick Coltrain and the Associated Press contributed to this story.\n\nGet more Colorado news by signing up for our daily Your Morning Dozen email newsletter.","summary":"Mass firings across federal agencies responsible for wildfire prevention and public lands management will endanger Coloradans and put at risk the state's beloved mountains, rivers and grasslands, state leaders said.","url":"https://www.denverpost.com/2025/02/17/colorado-public-lands-federal-employees-mass-firings-donald-trump/","image":"https://www.denverpost.com/wp-content/uploads/2024/07/TDP-L-BrainarLake071024-cha-2058.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-17 23:18:39","author":"Elise Schmelzer","authors":["Elise Schmelzer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.225},{"id":291553662,"title":"Extremely Pan LIX Gambling Render: Rating £fifty inside the Totally free Bets That have Betano","text":"Just after joining 32Red to have a fit deposit extra people are given step three stability which includes bonus, 100 percent free spins, and money. With respect to the invited incentives registered in for certain game can get require large rates of money than the others. Signing up from the 32Red automatically places you on the Ruby-red Rewards system, where you’ll secure support things every time you wager real money. There are four sections in the respect program, performing at the Bronze and dealing as much as Club Rouge, per and therefore provides its perks and you can bonuses. 32Red advertisements are usually udpated and usually provide some good value to users, as well as going for totally free spins, cash back and you will periodically a zero-deposit bonus. 32Red’s sign up extra and you can daily campaigns and accumulate really up against almost every other web based casinos, that’s not surprising that considering the proportions and you may level of users.\n\nSelect and you can Search You can Worth Wagers: cycling betting odds\n\n32Red casino will give you use of a number of more game, but besides that, both instant-enjoy and you will downloadable gambling enterprise be a little more otherwise smaller the same. To set your on the right track, here you will find the ways to more questioned questions relating to 32Red offers. Some free bets can also be industry certain, meaning that just a select few bet versions was readily available to pick from for the betting sneak. Step one when planning on taking if you wish to utilize out of a free of charge choice is to log on to your account, see the brand new campaigns web page, and find out in the event the you can find one readily available free bet offers to help you decide in for.\n\nLog on to Your account\n\nThis informative guide can tell you the easy steps for taking so you can subscribe Betano and get up to £fifty inside totally free wagers to put up the brand new Extremely Pan to your Week-end, March 9 from the Superdome.\nInvited offers are often associated with particular conditions and terms you to definitely need to be satisfied.\nProviding you’ve produced a great qualifying choice (funds increases don’t count, for example) and also you’ve claimed, next everything you need to perform is actually check out the newest cashier part of your account and choose ‘Withdraw’.\n\nFirst, you will find a respect program for returning professionals entitled My personal Purple Rewards. These types of rewards will be stipulated when an existing affiliate logs inside to their membership, and they are required to cycling betting odds opt-in to allege the fresh award. Each week on the Tuesdays, existing players which log on discover Red-colored Ruby Rewards, that is redeemed to possess poker chips. Very first bets should be placed during the likelihood of evens(dos.00) otherwise greater to help you be eligible for the brand new free choice that may appear in your the fresh account if the qualifying wager is actually compensated.\n\nAway from greeting offers to each day and weekly promotions, benefits have been in variety in the 32Red. When you’re fresh to the realm of sports betting inside the united kingdom you will possibly not be clued through to the betting places, possibility, and make use of out of campaigns. By using a great 32Red free sporting events wager(s) it is possible to; make a feeling to have setting gainful bets by the provided odds and you can most other secrets.\n\nWho is qualified to receive the new 32Red acceptance added bonus?\n\nThe most important thing even though to consider that there are specific terms and you can criteria to check out discover the pros you to a good free bet can bring your. Eligible occurrences and you can activities would be stated inside the for each specific totally free bet strategy and could just be designed for certain occurrences and you may sports. Such, 32Red could possibly get work on a promotion in which people is put totally free sporting events bets to the Cheltenham so you can victory the new FA Cup up against Alvechurch. This will imply that the brand new bet would not qualify since the an excellent 100 percent free wager should your choice wasn’t put on Cheltenham. 32Red’s standard advertising fine print make bonuses and make use of thereof fair to players plus the local casino.\n\nIs actually Donald Trump going to Super Bowl LIX? Role in the Fox visibility found to possess United states of america chairman\n\nTo find the best on line betting feel find out more about the utilization of bonuses while offering on the 32Red comment. Having 32Red’s ongoing advertising and marketing change, there’s zero once you understand when one may actually rating a real totally free bet but with exposure-totally free wagers, 32Red football comes a bit romantic. United kingdom participants will look forward to generous advertisements and you may bonuses from when it join 32Red.\n\nIf you have perhaps not acquired the newest to your-web site notification you do not be eligible for the brand new strategy or any other football offers. If the several greeting provide choice is offered, you’re required to prefer your preferred acceptance provide. Simply the fresh people meet the criteria to possess a welcome render and no one person have more than one 32Red account. In addition, you will need to getting more than 18 years old and you will complete 32Red’s expected account confirmation processes. Free spins are often attributed to the fresh affiliate’s 100 percent free spins equilibrium and therefore versions section of specific betting criteria with regards to the games that’s being used. Because the 32Red is constantly innovating using their bonuses by the such as the most recent trend, the new participants should consider 32Red’s ‘’promotions webpage’’ to have available today acceptance also offers.\n\nEven when totally free bets can be offered since the an entire-to your advertising and marketing provide, generally free wagers can be obtained because of the navigating to Free Wager/Profit Raise in the kept-hands front selection of one’s activities Lobby. Winning contests that have a bigger contribution away from incentive money can assist to meet wagering standards reduced. Welcome bonuses offer you more than simply extra to play borrowing; such offers in addition to remain while the a possibility to can be aware of the readily available online game and also to attempt the brand new local casino’s bonus benefits. Less than there are many more positive points to believe when opting for a great 32Red sign up extra.\n\nThat have 32Red constantly innovating its advertisements and welcome offers the terms and you will standards can get alter regarding your online game one incentive currency is also be used to your. Fundamentally, the benefit currency obtained due to a welcome bonus may be used to your majority of online casino games ’’not including alive video game’’. FindBets.co.united kingdom lists marketing and advertising also provides and bonuses on most other websites. FindBets.co.united kingdom does not render any kind out of assistance otherwise fulfillment for people also offers listed on this web site.","summary":"Just after joining 32Red to have a fit deposit extra people are given step three stability which includes bonus, 100 percent free spins, and money. With respect to the invited incentives registered in for certain game can get require large rates of money than the others. Signing up from the 32Red automatically places you on&#8230; Continue reading Extremely Pan LIX Gambling Render: Rating £fifty inside the Totally free Bets That have Betano\n\n\nThe post Extremely Pan LIX Gambling Render: Rating £fifty inside the Totally free Bets That have Betano first appeared on Pulse News.","url":"https://pulse-news.in/extremely-pan-lix-gambling-render-rating-fifty-inside-the-totally-free-bets-that-have-betano","image":"https://www.betnow.eu/blog/wp-content/uploads/2017/10/college-spobet1-725x302.jpg","video":null,"publish_date":"2025-02-17 23:13:43","author":"shiv chauhan","authors":["shiv chauhan"],"language":"en","source_country":"in","sentiment":0.249},{"id":291559476,"title":"Wrong way to win back voters, ludicrous denials of gov’t fraud and other commentary","text":"Liberal: Wrong Way To Win Back Voters\n\nDemocrats’ “unconditional defense of government bureaucracies does not appear to be a promising route” to recapturing the voters they’re losing, warns Ruy Teixeira at The Liberal Patriot.\n\nTake their defense of USAID. “Most Americans know very little about USAID.”\n\nAnd foreign aid, which it administers, is “one of the least popular parts of the federal budget.”\n\nPlus, Dems “are blanket defending” this “obscure institution in an anti-institution era”: Voters “overwhelmingly” believe the US economic and political system needs “major changes,” at the very least.\n\nNor are Dems offering “any hint of what they would preserve and what they would get rid of.”\n\nDems need to “show some common sense in what they spend their political capital on.” As Rahm Emmanuel puts it, “Don’t swing at every pitch.”\n\nMedia watch: Ludicrous Denials of Gov’t Fraud\n\n“The media spin-masters are gaslighting the public” by proclaiming that “government fraud is a mirage — a pretext for Elon Musk’s Department of Government Efficiency to bulldoze vital programs,” writes The Wall Street Journal’s Allysia Finley.\n\nLast week, for example, The New York Times reported that Musk “offered no evidence for his sweeping claims” of fraud.\n\nAnd “after the White House pushed back against” the piece, notes Finley, “Washington’s press corps circled the wagons.”\n\nIndeed, Washington Post reporter Aaron Blake raced to debunk Musk’s fraud claims, except that in his piece, “Blake dismissed a 2024 Government Accountability Office report that projected $233 billion to $521 billion in federal fraud each year.”\n\n“By dismissing and playing down what Americans can see with their own eyes, the press is giving Americans more reason to distrust it.”\n\nUkraine desk: Hegseth’s ‘Shock Therapy’\n\nDefense Secretary Pete Hegseth has uttered “the uncomfortable truth that it is unrealistic to expect a return to Ukraine’s 2014 borders,” notes Eliot A. Cohen at The Atlantic.\n\nHe also “ruled out NATO membership for Ukraine as part of a negotiated settlement — also unfair, but also inevitable.”\n\n“The bottom line is that the administration will broker, and possibly coerce, a deal that is bad for Ukraine.”\n\nWhy? In no small part because American leaders have long “insisted to Europe as a whole that Americans will not indefinitely bear the burden of Europe’s security.”\n\nAnd “their European counterparts have smiled politely and ignored them.” “Blunt truths” like those noted by Hegseth may be “shock therapy.”\n\nAnd that, “however inexpertly administered, can be part of the cure.”\n\nLaw prof: ‘This Is What Democracy Looks Like’\n\n“Not since Dorothy tossed her bucket of water on the Wicked Witch has shrinkage triggered such drama,” snarks Jonathan Turley at USA Today of the howling by congressional Democrats over Trump’s moves to downsize the federal government.\n\nYet “a strong majority of Americans say Trump is keeping his promises, including in his efforts to reduce government spending and waste.”\n\nTrump’s “generous buyout offer” is the best way to shrink the government” — and he “has the authority to offer the buyouts.” \n\nUnfortunately for the so-called “defenders of democracy,” “this is what democracy looks like,” and it’s “what Americans asked for in reelecting Donald Trump.”\n\nLibertarian: Foreign Funds for US Farmers?\n\nAt Reason, Jack Nicastro blasts Democratic Sen. Richard Blumenthal’s argument that pausing USAID spending would hurt farmers, since it purchases grain from them and provides food for the world.\n\n“Subsidizing foreign demand for American agricultural products misdirects resources from charity to self-dealing.”\n\nThe agency wasn’t established to aid farmers but to promote social and economic development in foreign countries, “in accordance with the Foreign Assistance Act of 1961.”\n\nAnyway, the Department of Agriculture already does that, “to the tune of tens of billions of dollars a year.”\n\nIf USAID is going alleviate global hunger, “it should distribute nutritious food in the most efficient way possible — not in the way that provides the most rents for American farmers.”\n\n— Compiled by The Post Editorial Board","summary":"Democrats’ “unconditional defense of government bureaucracies does not appear to be a promising route” to recapturing the voters they’re losing, warns Ruy Teixeira at The Liberal Patriot.","url":"https://nypost.com/2025/02/17/opinion/wrong-way-to-win-back-voters-ludicrous-denials-of-govt-fraud-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-khvtp90ik-1739832610303.jpg?quality=75&strip=all&1739814689&w=1200","video":null,"publish_date":"2025-02-17 23:11:30","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.302},{"id":291554898,"title":"‘Europe Must Have a Secure Future’ – In Paris, British PM Warns of Need for ‘US Backstop’","text":"British Prime Minister Keir Starmer on Monday warned that a “US security guarantee” would be the “only way” to prevent Russia from attacking Ukraine again in the event of peace, AFP reported.\n\n“I’m prepared to consider committing British forces on the ground alongside others if there is a lasting peace agreement, but there must be a US backstop, because a US security guarantee is the only way to effectively deter Russia from attacking Ukraine again,” Starmer said after a European meeting in Paris.\n\nMonday’s last-minute summit in Paris, with multiple European leaders in attendance, was called after the US announced over the weekend that Europe would be left out of key peace talks in Saudi Arabia on Tuesday, which would be limited to Russian and American delegations.\n\nStarmer confirmed that he would head to Washington next week to meet US President Donald Trump and “discuss what we see as the key elements of a lasting peace.”\n\nIn contrast to Germany’s reticence to send peacekeeping troops to Ukraine in the event of a ceasefire, Starmer was one of the first to float that option, and did so ahead of these impromptu talks hosted by French President Emmanuel Macron, who in the past had given carte blanche to such an idea.\n\n“Britain will take a leading responsibility, as we always have, because Ukraine must have a secure future,” added Starmer, who said there would be further European talks after his meeting with Trump.\n\n“Europe must have a secure future. Britain must have a secure future, and democratic values must prevail,” Starmer said.","summary":"Left out of talks in Saudi Arabia, European leaders sound off in Paris: UK says US peace force essential; Denmark worried about Russia’s “imperial” dreams; Germany “irritated” by “premature” debate.","url":"https://www.kyivpost.com/post/47308","image":"https://static.kyivpost.com/storage/2025/02/18/2e36c56ee0aa21955cf39caeffc298ec.jpeg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-02-17 23:10:41","author":"Kyiv Post","authors":["Kyiv Post"],"language":"en","category":"politics","source_country":"ua","sentiment":-0.201},{"id":291552334,"title":"US Judge To Rule On Lawsuit Protecting Elon Musk&#8217;s DOGE In 24 Hours; What Is Next?","text":"A U.S. judge in Washington, D.C., announced on Monday that she hopes to issue a ruling within 24 hours on a lawsuit aimed at preventing Elon Musk’s team, known as DOGE (Department of Government Efficiency), from accessing federal information systems. The team was appointed by President Donald Trump to restructure government operations and cut spending.\nDespite federal courts being closed for Presidents’ Day, U.S. District Judge Tanya Chutkan held an emergency hearing to review the lawsuit filed by 13 Democratic state attorneys general. These states argue that Musk’s DOGE team is overstepping its authority by accessing sensitive government data and terminating employees at key federal agencies.\nConcerns Over Federal Programs and Mass Layoffs\nThe attorneys general warn that DOGE’s actions put essential government programs at risk, including education and social welfare initiatives. They claim that Musk’s team is using internal data to justify shutting down federal projects and executing mass layoffs.\n\"The things I’m hearing are troubling indeed, but I have to have a record and findings of fact before I issue something,\" Judge Chutkan stated during the hearing. However, she expressed skepticism about whether the lawsuit meets the legal threshold for immediate intervention.\n\"It’s kind of like a prophylactic TRO, and that’s not allowed,\" she said, referring to the emergency request for a temporary restraining order (TRO). The judge also noted that if the states ultimately win the case, she could order the reinstatement of affected programs.\nAgencies Affected by DOGE’s Actions\nThe lawsuit aims to prevent Musk’s team from accessing systems and terminating employees at several major federal agencies, including:\n The Department of Labor\n The Department of Education\n The Department of Health and Human Services\n The Department of Energy\n The Department of Transportation\n The Department of Commerce\n The Office of Personnel Management\nSince Trump appointed Musk to lead DOGE last month, the team has rapidly made cuts across government agencies, leading to widespread job losses and program eliminations.\nDebate Over Musk’s Legal Authority\nThe attorneys general argue that Musk is exercising powers that should only be granted to a government officer formally nominated by the president and confirmed by the Senate, as outlined in the U.S. Constitution’s Appointments Clause. They also point out that DOGE has not been legally authorized by Congress.\nDuring the hearing, a government attorney admitted that he had not confirmed reports of mass layoffs occurring within federal agencies. \"The firing of thousands of federal employees is not a small or common thing. You haven’t been able to confirm that?\" Judge Chutkan asked. The Department of Justice attorney said he would provide an update by the end of Monday.\nDifferent Court Rulings on DOGE’s Authority\nLawsuits challenging DOGE’s authority have been filed in multiple federal courts, resulting in mixed rulings:\n On Friday, U.S. District Judge Jeannette Vargas in New York extended a temporary order preventing DOGE from accessing Treasury Department systems responsible for managing trillions of dollars in payments.\n Also on Friday, U.S. District Judge John Bates in Washington declined to block DOGE from accessing records at the Department of Labor, the Department of Health and Human Services, and the Consumer Financial Protection Bureau.\n Several other cases remain pending, with judges yet to issue final rulings.\nAs legal battles continue, the future of Musk’s government restructuring efforts remains uncertain. Judge Chutkan’s ruling, expected within 24 hours, could have major implications for federal employees and government operations nationwide.\nALSO READ: Five Arrested In The Brutal Murder Of Transgender Man Sam Nordquist After Weeks Of Torture","summary":"A U.S. judge in Washington, D.C., announced on Monday that she hopes to issue a ruling within 24 hours on a lawsuit aimed at preventing Elon Musk’s team, known as DOGE (Department of Government Efficiency), from accessing federal information systems.","url":"https://www.newsx.com/world/us-judge-to-rule-on-lawsuit-protecting-elon-musks-doge-in-24-hours-what-is-next/","image":"https://www.newsx.com/wp-content/uploads/2025/01/elon-musk-3.webp","video":null,"publish_date":"2025-02-17 23:10:41","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","source_country":"in","sentiment":-0.252},{"id":291552328,"title":"Mass Layoff Of FAA Employees Under Trump Administration; Safety Concerns Highlighted","text":"The Trump administration has dismissed hundreds of employees from the Federal Aviation Administration (FAA) over the weekend, raising concerns about further understaffing at the agency. The decision comes just weeks after a tragic crash in Washington, D.C., that highlighted existing staffing shortages in aviation safety.\nThe union representing the affected employees has criticized the move, calling it a “hastily made decision” that will burden an already overwhelmed workforce. The statement from the union referenced not just the D.C. crash but also two other recent aviation accidents as evidence that this is a critical time for maintaining, not reducing, personnel.\nUnion Raises Alarm Over Public Safety Risks\n“This decision did not consider the staffing needs of the FAA, which is already challenged by understaffing,” said David Spero, national president of the Professional Aviation Safety Specialists, AFL-CIO. “Staffing decisions should be based on an individual agency’s mission-critical needs. To do otherwise is dangerous when it comes to public safety. And it is especially unconscionable in the aftermath of three deadly aircraft accidents in the past month.”\nA spokesperson for the union stated that nearly 300 employees had received termination notices over the weekend. The affected workers held various crucial roles, including maintenance mechanics, aeronautical information specialists, environmental protection specialists, aviation safety assistants, and management and program assistants.\nElon Musk Appointed to Government Efficiency Panel\nThe firings coincide with President Donald Trump’s appointment of Elon Musk to lead the newly established Department of Government Efficiency. This advisory commission is tasked with overseeing large-scale layoffs across U.S. government agencies.\nNotably, the FAA—which now faces mass terminations—also regulates Musk’s company, SpaceX. The agency has had ongoing conflicts with SpaceX over safety concerns. Last year, the FAA proposed civil penalties against SpaceX for alleged violations, prompting Musk to threaten legal action against the agency. The FAA’s oversight of Musk’s company remains significant, particularly in light of a mid-January SpaceX rocket explosion that disrupted multiple flights, caused detours, and scattered debris into the Caribbean. Following the incident, the FAA mandated a formal “mishap investigation.”\nFAA Has Faced Ongoing Staffing Challenges\nFor years, FAA officials have warned of persistent understaffing and increasing strain on the agency’s workforce. The recent layoffs have intensified concerns about aviation safety.\nThe National Transportation Safety Board (NTSB) is still investigating the cause of a deadly collision near Washington, D.C., on January 29. The crash involved an American Airlines commercial flight and an Army helicopter, killing all 67 people aboard. It was the deadliest air accident in the U.S. in nearly 25 years.\nCall for Transparency on Layoffs\nFormer Transportation Secretary Pete Buttigieg voiced concerns over the decision and called for greater transparency.\n\"The flying public needs answers. How many FAA personnel were just fired? What positions? And why?\" Buttigieg posted on social media on Monday.\nAs of now, the Department of Transportation has not provided an official response to NBC News’ request for comment. The layoffs, along with ongoing safety concerns, have sparked renewed debate over the future of aviation oversight and regulation in the United States.\nALSO READ: Five Arrested In The Brutal Murder Of Transgender Man Sam Nordquist After Weeks Of Torture","summary":"The Trump administration has dismissed hundreds of employees from the Federal Aviation Administration (FAA) over the weekend, raising concerns about further understaffing at the agency.","url":"https://www.newsx.com/world/mass-layoff-of-faa-employees-under-trump-administration-safety-concerns-highlighted/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Federal-Agencies-pronouns-email-signature-DEI-President-Donald-Trump-Trump-executive-order.webp","video":null,"publish_date":"2025-02-17 23:10:41","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","source_country":"in","sentiment":-0.182},{"id":291556054,"title":"Four top officials in Mayor Eric Adams’ office resigning after Trump administration drops criminal charges against him","text":"Four top New York City officials are resigning from Mayor Eric Adams’ administration after Adams apparently worked out a deal with President Donald Trump’s Justice Department to have the criminal fraud charges against him dropped. \n\n“Due to the extraordinary events of the last few weeks and to stay faithful to the oaths we swore to New Yorkers and our families, we have come to the difficult decision to step down from our roles,” the four deputy mayors wrote in a statement obtained by The New York Times which was provided by First Deputy Maria Torres-Springer, who holds the second-highest role in city government.\n\nThe deputy mayors were concerned that they’re not only working for an indicted mayor, but for a politician whose personal interests threaten to overshadow the interests of New Yorkers, a source told the newspaper.\n\nThe officials – who also included Meera Joshi, the deputy mayor of operations, Anne Williams-Isom, the deputy mayor of health and human services, and Chauncey Parker, the deputy mayor for public safety – are expected to resign in the coming days, according to the Times. \n\nThe resignations mean that half of New York City’s eight deputy mayors are leaving. It’s unclear who will replace them.\n\nThe Democratic mayor began to cozy up to Trump after he was indicted last September on five counts related to bribery, and was recently seen socializing with the president at Mar-a-Lago.\n\nThe mayor suddenly praised Trump’s immigration agenda and echoed the president’s claims that criminal cases brought by the Justice Department under the Biden administration were politically motivated. He skipped out on Dr. Martin Luther King Jr. Day events in New York City to attend the president’s inauguration in Washington, D.C. \n\nThings came to a head last week after a top Department of Justice official asked the Manhattan federal court to drop the charges against Adams.\n\nDanielle Sassoon, the Republican Trump-appointed acting head of the Southern District of New York (SDNY), refused to comply and resigned. \n\nIn an explosive letter to the U.S. Attorney General, Sassoon alleged that Adams’ attorney attempted to engage in “what amounted to a quid pro quo” at a meeting she witnessed with Justice Department officials to have the charges dropped in exchange for the mayor’s support for the president’s immigration crackdown. \n\nAdams denied the allegations on Fox News while seated next to Trump’s border “czar” Tom Homan.\n\nThe dropped charges kicked off a string of resignations in the SDNY, as well as in the Public Integrity Section of the DOJ as multiple federal prosecutors refused to support dismissing the indictment, believing it was not in good faith. \n\nIn his resignation letter, the federal prosecutor leading the case against Adams said only a “fool” or “coward” would sign off on the motion. \n\nMonday’s decision by the four deputies is the latest blow to Adams’ administration, which has faced extreme turbulence over the last year as multiple officials faced investigations, and Adams was indicted.\n\n“I am disappointed to see them go, but given the current challenges, I understand their decision and wish them nothing but success in the future,” Adams said in a statement about his deputy mayors Monday.\n\n “But let me be crystal clear: New York City will keep moving forward, just as it does every day,” he said. “All deputy mayors will remain in their roles for the time being to ensure a seamless transition. The people of New York City remain, without question, our top priority.”\n\nThe Independent has asked Adams’s office for comment.","summary":"Adams is facing calls from local and state lawmakers to resign","url":"https://www.independent.co.uk/news/world/americas/us-politics/eric-adams-mayor-deputies-resigning-b2699800.html","image":"https://static.independent.co.uk/2025/02/17/21/48/eric.jpg?trim=0,0,0,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/0Q0J2gqt-OhrQWqOm.mp4","publish_date":"2025-02-17 23:09:53","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.222},{"id":291552610,"title":"South Africa’s HIV patients could miss care due to Trump’s aid freeze","text":"At a rural village in South Africa’s KwaZulu-Natal province, unemployed 19-year-old Nozuko Majola is trying to figure out if she has enough money for the one-hour ride to collect her much-needed HIV medication, usually delivered to her home that can’t be easily reached due to rough, untarred roads.\n\nMajola is one of millions of patients in South Africa affected by US President Donald Trump’s global foreign aid freeze, raising worries about HIV patients defaulting on treatment, infection rates going up, and eventually a rise in deaths.\n\nIn 2024, the think tank Human Sciences Research Council released figures showing that Majola’s province recorded the second-highest HIV prevalence in the country, at 16 per cent, with at least 1,300 young people estimated to contract the disease every week.\n\nKwaZulu-Natal also had the highest number of people living with HIV in South Africa in 2022, about 1.9 million.\n\nThe country counts more than 7.5 million people infected with the virus that causes AIDS – more than any other nation.\n\nThere are 5.5 million South Africans receiving antiretroviral treatment, whose funding is now in question after Trump suspended the President’s Emergency Plan for AIDS Relief, or PEPFAR.\n\nThe initiative contributes more than $400 million (€384.5 million) a year to South Africa’s HIV programmes and nongovernmental organisations, about 17 per cent of the total funding, according to the Health Ministry.\n\nGlobally, PEPFAR is credited with saving at least 26 million lives since its inception in 2003, according to the UN AIDS agency.\n\nImpact of Trump freeze\n\nLast week, a US federal judge ordered the Trump administration to temporarily lift the funding freeze, while the US Embassy in South Africa said PEPFAR projects would resume under a limited waiver.\n\nHowever, aid groups dealing with HIV have already shuttered, with closure notices hanging at the entrances and PEPFAR-branded vehicles standing idle. Patients are being diverted to struggling health facilities.\n\nMost of the PEPFAR funding is channelled through non-governmental organisations, which run programmes that complement health care services provided by the government.\n\nFor Majola and other HIV patients in the Umzimkhulu region, where unemployment is rife and most people rely on subsistence farming and government welfare grants, the aid freeze has disrupted their lives.\n\n“Things will be tough around here, and a lot of people will default on their treatment because we really struggle with transport,” she said. “The mobile clinics hardly come here”.\n\nThe freeze has hurt various groups that can no longer provide treatment, causing an influx of patients to already overstretched public facilities. Along with the medication, these programmes also allowed health personnel to test HIV patients in far-flung villages, which has been a lifeline for many, especially those afraid to visit public facilities due to the social stigma attached to HIV.\n\nIn addition, nearly 15,000 health workers whose salaries are funded through PEPFAR are left wondering if they have lost their livelihoods.\n\n‘A matter of life and death’\n\nAbout an hour away in the district of Umgungundlovu, which the think tank says has the highest number of HIV cases in South Africa, HIV counsellors gathered in a small office discussing how best to assist patients like Majola.\n\nA manager at a nearby health clinic wondered how to handle the administrative work that is piling up after PEPFAR-funded workers withdrew.\n\n“People who were doing administration and data capturing, whose salaries were funded by PEPFAR, have left,” said the manager, who spoke on condition of anonymity because they were not authorised to speak to the press.\n\n“We are a small facility and we cannot handle such a workload,” the manager said.\n\nNozuko Ngcaweni has been on HIV treatment for about 30 years. One of her children was also infected and died at age 17. She said the aid suspension already impacted her community and many missed their treatment.\n\n“Not long ago, we said by 2030, we want to see an HIV-free generation. But if things remain as is, we will not achieve that. We will have to deal with deaths,” she said.\n\nMzamo Zondi, a provincial manager of the Treatment Action Campaign, which advocates for access to HIV treatment for the poor, has been monitoring the impact of the aid freeze in Umgungudlovu.\n\n“Our response [to HIV] is likely to falter as we struggle to stop newly infected cases,” he said. “This is a matter of life and death”.","summary":"About 5.5 million South Africans receive antiretroviral treatment that could be disrupted after the US suspended funding for an anti-HIV programme. ADVERTISEMENT At a rural village in South Africa&#8217;s KwaZulu-Natal province, unemployed 19-year-old Nozuko Majola is trying to figure out if she has enough money for the one-hour ride to collect her much-needed HIV medication, &#8230;\n\n\nThe post South Africa’s HIV patients could miss care due to Trump’s aid freeze appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/europe/south-africas-hiv-patients-could-miss-care-due-to-trumps-aid-freeze/","image":"https://static.euronews.com/articles/stories/09/06/08/60/1200x675_cmsv2_f71a496c-4b8c-51d1-9e41-a4d143aa5888-9060860.jpg","video":null,"publish_date":"2025-02-17 23:04:52","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.047},{"id":291554004,"title":"Elevance Health Bolsters Employer Insurance Business","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nElevance Health says its acquisition of Verily’s Granular Insurance Company is designed to bolster ... [+] its offerings to self-funded employer clients. Financial terms of the deal aren’t being disclosed, an Elevance spokeswoman said.\nElevance Health\n\nElevance Health says its acquisition of Verily’s Granular Insurance Company is designed to bolster its offerings to self-funded employer clients.\n\nElevance, which operates Anthem brand Blue Cross and Blue Shield health plans in 14 states, has scores of employer clients. Financial terms of the deal aren’t being disclosed, an Elevance spokeswoman said.\n\nGranular was launched in 2020 as provider of “stop-loss, reimsurance and fronting solutions for self-funded employers and captives.” Under such policies like stop-loss, the insurer becomes liable for losses that exceed certain limits set up between the insurer and an employer’s self-funded policy.\n\n“Through this acquisition, Elevance Health is complementing its existing capabilities and expertise by integrating Granular's technology and data-driven insights, allowing us to offer enhanced healthcare cost management solutions for self-funded employers,” Elevance said in a statement.\n\nThe deal comes at a time health insurers including Elevance and its government-subsidized health plans are seeing higher costs and an exodus of health plan members, particularly in Medicaid coverage for poor Americans.\n\nMORE FOR YOU\n\nHere’s Where Trump’s Government Layoffs Are—As Firings At FAA Begin\n\nHow Apple’s iPhone SE Can Change Smartphones Forever\n\nApple iPhone SE 4 Release Date: Your Final, Complete Guide To What And When\n\nElevance Health ended the year with fewer health plan members largely from a drop in Medicaid customers.\n\nThe end of the U.S. Public Health Emergency in May of 2023 after three years of the COVID-19 pandemic has impacted health insurers that have a significant business administering Medicaid coverage for states, which conducted so-called “Medicaid redeterminations.” Medicaid redetermination, also described as Medicaid renewal or Medicaid recertification, is essentially when people are asked to show they are qualified for such coverage.\n\nIt’s also possible more Americans could lose Medicaid in coming years as Donald Trump and Republicans in Congress look to cut government spending on Medicaid coverage for poor Americans to fund tax cuts.\n\nElevance’s employer offerings are growing at a time sales of its government-subsidized coverage products have slowed or fallen.\n\nElevance’s medical membership decreased 2%, or 1.1 million, to 45.7 million as of December 31, 2024, “driven by attrition in our Medicaid business, partially offset by growth in Employer Group fee-based and Affordable Care Act health plan membership,” the company disclosed last month in its 2024 annual and fourth quarter earnings report.\n\nFollow me on Twitter or LinkedIn. Check out my website or some of my other work here. \n\nBruce Japsen\n\nEditorial Standards\n\nForbes Accolades","summary":"Elevance Health says its acquisition of Verily’s Granular Insurance is designed to bolster its offerings to self-funded employer clients.","url":"https://www.forbes.com/sites/brucejapsen/2025/02/17/elevance-health-bolsters-employer-insurance-business/","image":"https://imageio.forbes.com/specials-images/imageserve/634fd98138f2f6f4c4c9a291/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-17 23:04:50","author":"Bruce Japsen,Senior Contributor","authors":["Bruce Japsen","Senior Contributor"],"language":"en","source_country":"US","sentiment":-0.377},{"id":291554170,"title":"Germany will not send troops to Ukraine without ‘US involvement’ – AFP","text":"Berlin will not send peacekeepers to Ukraine unless the US commits its own forces as well, AFP reported on Monday, citing a source in the German government.\n\nThe reported remarks come after US Defense Secretary Pete Hegseth ruled out deploying American service members as part of potential security guarantees to Kiev.\n\n“We will not participate in scenarios in which European and American security diverges, for example if European soldiers are deployed without full US involvement,” a German official told AFP.\n\nPoland has earlier als dismissed the possibility of sending its soldiers to Ukraine. “Poland will support Ukraine as it has done so far: organizationally, in accordance with our financial capabilities, in terms of humanitarian and military aid,” Polish Prime Minister Donald Tusk said on Monday. “We do not plan to send Polish soldiers to the territory of Ukraine.”\n\nUK Prime Minister Keir Starmer, who described the Ukraine conflict as “existential,” announced on Sunday that he was ready to contribute troops as part of post-ceasefire “security guarantees” to Kiev.\n\nMoscow has repeatedly stressed that a peace settlement is possible only if the West addresses the “root causes” of the conflict, such as Ukraine’s plan to join NATO and the alliance’s continuing expansion eastward. Vassily Nebenzia, Russia’s envoy to the UN, said earlier this month that only the UN Security Council can authorize the deployment of peacekeepers, and warned that Russia would treat “any foreign military units” that would not have UN backing as “legitimate targets.”\n\nUS President Donald Trump has promised to quickly end the conflict and has made steps to restore diplomatic contacts with Moscow that were de facto frozen in 2022. US and Russian officials will discuss Ukraine in Riyadh on Wednesday.\n\nUkrainian leader Vladimir Zelensky said that Kiev will not participate in the Riyadh talks and will “not recognize” any negotiations held without its consent. Multiple EU officials have expressed their frustration with Trump, after made a phone call with Russian President Vladimir Putin on February 12 without their approval.","summary":"Berlin reportedly opposes sending EU peacekeepers to Ukraine without US involvement, AFP has reported on Monday \nRead Full Article at RT.com","url":"https://www.rt.com/news/612883-berlin-to-dismiss-uk-peacekeepers-plan/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67b3c03785f540282562a94a.jpg","video":null,"publish_date":"2025-02-17 23:04:29","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.405},{"id":291553332,"title":"Judge to rule swiftly on effort to block Musk's DOGE","text":"A federal judge has questioned the authority of Elon Musk and his Department of Government Efficiency (DOGE) but was sceptical of a request to block the department from accessing sensitive data and firing employees at half a dozen federal agencies.\n\nUS District Judge Tanya Chutkan held a hearing on a request from 14 states for a temporary restraining order seeking to curtail the tech billionaire's power in President Donald Trump's quest to downsize the federal government.\n\nChutkan said she would rule within 24 hours.\n\nTrump appointed Musk to lead DOGE in a push to slash the federal workforce and reduce or end disfavoured programs.\n\nThe administration dismissed probationary employees and Trump in an executive order told agency leaders to plan for \"large-scale reductions\".\n\nDemocratic prosecutors from 14 states filed a lawsuit challenging what they called Musk's \"unchecked power\".\n\nThe states are seeking to block DOGE from firing employees and accessing data at the federal Office of Personnel Management along with six federal agencies that oversee health and human services, education, energy, transportation, labour and commerce.\n\nDuring the hearing via video link, Chutkan said she did not think the states had shown necessary evidence of imminent harm to merit court intervention at this stage.\n\nThe prosecutors argued that Musk's actions at the helm of DOGE could be taken only by a nominated and Senate-confirmed official under the constitution.\n\nThey also said citizens had concerns about the secure handling of sensitive information.\n\nJustice Department lawyer Harry Graver countered that DOGE was acting in an advisory role, did not need Senate confirmation to access data, and the states had not shown Musk's hunt for waste and fraud had harmed them.\n\nThe judge appeared to question that assertion.\n\n\"I think you stretch too far. I disagree with you there,\" Chutkan replied but added that was what the merits of the case were about.\n\nWhile she seemed sceptical about whether a temporary restraining order was merited, she seemed sympathetic to some of the states' claims\n\n\"One of the challenges in plaintiffs' motion is that this is essentially a private citizen directing an organisation that's not a federal agency to have access to the entire workings of the federal government, fire, hire, slash, contract, terminate programs, all without apparently any congressional oversight,\" the judge said in describing the states' claim.\n\nShe noted that DOGE did not seem to be moving in any kind of orderly or predictable fashion, making it difficult for states to know what is coming next.\n\nChutkan asked for the Justice Department to submit information about past and upcoming employment terminations.","summary":"A US judge hopes to rule within 24 hours in a lawsuit that aims to protect information systems at government agencies from Elon Musk's DOGE team.","url":"https://thewest.com.au/news/crime/judge-to-rule-swiftly-on-effort-to-block-musks-doge-c-17760110","image":"https://images.thewest.com.au/publication/C-17760110/bc48c319a347d511b9fc50f93d2ee0ce29539408-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-02-17 23:03:18","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.001},{"id":291562992,"title":"MAGA babies prove again they don't know how to take a joke","text":"The Republican online community are freaking out about actor Tom Hanks' appearance as a MAGA character during the “Saturday Night Live” 50th anniversary show that aired Sunday night.\n\nDuring a sketch called “Black Jeopardy,” Hanks played a MAGA-hat wearing character named Doug. After being the only person to correctly identify Dana Carvey’s popular Church Lady character, Doug expounds that “if more people went to church, we wouldn’t be in this mess we’re in now.” Kenan Thompson, who played the host in the sketch, heartily agrees and attempts to shake Hanks’ character’s hand, making Hanks wince. \n\n“Tom Hanks always wants to pretend he’s the likable everyman but he’s as hate mongering of regular Americans as any host on msnbc,” anti-affirmative action nepo baby Meghan McCain wrote on X. “Good luck becoming less and less culturally relevant by the second[,] bro.”\n\nRacist right-wing troll Benny Johnson was up in his feelings, writing “Donald Trump just won a landslide election and has never been more popular with Americans. They have learned nothing.” Then again, Trump didn’t win anything in his life by a “landslide.”\n\nClay Travis who founded the Fox-owned OutKick sports network, and enjoys more than a million followers on Elon Musk’s X, wrote “For its 50 year anniversary special, SNL had Tom Hanks play a racist Trump supporter afraid to shake a black man’s hand. Fun fact: Trump’s 2024 election win was the LEAST racially divisive American election since 1964.”\n\nWhat a strange ahistorical boast.\n\nUnsurprisingly, none of these folks have batted an eye when it comes to the slew of racist people Trump and friends keep hiring (and rehiring in some cases) to run our government. If there’s one thing people who voted for a bunch of racists hate, it’s being called racist. \n\nEnjoy the segment of “Black Jeopardy,” starring the legendary Eddie Murphy, Tracy Morgan, and Leslie Jones—with an appearance by Hanks.","summary":"The Republican online community are freaking out about actor Tom Hanks' appearance as a MAGA character during the “Saturday Night Live” 50th anniversary show that aired Sunday night.\n\n\n\nDuring a sketch called “Black Jeopardy,” Hanks played a MAGA-hat wearing character named Doug. After being the only person to correctly identify Dana Carvey’s popular Church Lady character, Doug expounds that “if more people went to church, we wouldn’t be in this mess we’re in now.” Kenan Thompson, who played the host in the sketch, heartily agrees and attempts to shake Hanks’ character’s hand, making Hanks wince. \n\n\n\n“Tom Hanks always wants to pretend he’s the likable everyman but he’s as hate mongering of regular Americans as any host on msnbc,” anti-affirmative action nepo baby Meghan McCain wrote on X. “Good luck becoming less and less culturally relevant by the second[,] bro.”\n\n\n\n\n\n\n\nRacist right-wing troll Benny Johnson was up in his feelings, writing “Donald Trump just won a landslide election and has never been more po","url":"https://www.dailykos.com/story/2025/2/17/2304366/-MAGA-babies-prove-again-they-don-t-know-how-to-take-a-joke?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1399587/story_image/SNL_2.17.jpg?1739829246","video":null,"publish_date":"2025-02-17 23:00:03","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":0.094},{"id":291562494,"title":"Daisy Lowe is ever the doting mother as she takes baby daughter Ivy, 22 months, out with her father Gavin Rossdale and fiancé Jordan Saul to Farmers' Market in Los Angeles","text":"Black Friday\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nTuesday, Feb 18th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nIncredible moment Toronto plane crash survivor films himself being rescued from upside down Delta aircraft: Live updates\n\nTrump 'could withdraw US troops from Baltics and leave Europe vulnerable to Russia, European officials fear' - as report claims peace plan 'would see Ukraine forced into extraordinary financial reparations'\n\nDelta plane crashes at Toronto Pearson Airport\n\nRICHARD LITTLEJOHN: European leaders spat out their dummies when the US Vice President delivered that brutally honest speech. I just hope Keir Starmer was listening...\n\nHow to profit from WAR: the stocks to consider buying as the world re-arms, from great British companies to little-known European firms that could make you a FORTUNE in uncertain times\n\nThe traditional British dishes at risk of EXTINCTION - so would YOU eat these iconic meals to save them?\n\nMother-of-three has all four limbs amputated after she was 'massacred' and 'left to die' following a voluntary abortion - now doctors face court\n\nThe dark side of Dubai: meet the Brits who badly regret starting new lives in the harsh Arab country - and why so many of them are desperate to come back...\n\nThe new BIONIC BREASTS set to restore sensation for millions of women after cancer surgery - and the surprising reason the implants could help their sex lives, too!\n\nPictured: Mother-of-two, 43, who was shot dead outside pub on Valentine's Day 'by partner who then leapt to his death off bridge' - as chilling video shows moment killer struck\n\nKemi Badenoch blasts 'poisonous' woke ideology and the Left's 'useful idiots' as she implores conservatives to save the West - and says 'some cultures are better than others'\n\nThe 'loony' Lucy Letby supporters who think the nurse is innocent are wasting their time - here's why I'm convinced she's guilty: CHRISTOPHER SNOWDON\n\nMigrant who laughed as he stabbed 14-year-old boy to death in Austrian knife rampage 'had applied for asylum so he could avoid being drafted into Syrian military'\n\nScientists discover carb-free food that could ward off colon cancer - as cases soar in young people\n\nThe skinny influencer I saw spitting cake into a flowerpot and the A-listers who barely even LOOK at food: how stars avoid getting fat at glitzy parties, by MOLLY CLAYTON\n\nIconic '80s heartthrob who is still a beloved TV star is pictured in rare yearbook photos... can you guess who?\n\nMoment foul-mouthed boater rampages through summer regatta being held on the River Thames raging 'You don't own the f****** water!'\n\nKate Middleton reveals Prince George's incredible portrait of her leaving fans in awe at his artistic talents\n\nWho won Love Island All Stars 2025? Gabby Allen and Casey O'Gorman are crowned WINNERS following his third stint on the show as they beat runners up Luca Bish and Grace Jackson to £50K prize\n\nKeir Starmer calls for the US to act as a 'backstop' to deter Russia from attacking Ukraine - as he repeats vow to get UK troops on the ground\n\nPete Wicks' pals insist he didn't cheat on Maura Higgins despite her claims as they reveal the 'truth' behind THOSE messages to other women on his phone\n\nIncredible comeback of Harvey Weinstein's British wife: Georgina Chapman regains her crown as queen of the red carpet by boyfriend Adrien Brody's side\n\nWhich nations ARE pulling their weight in NATO... and who is relying on 'Uncle Sucker' to protect them? Graphic illustrates who is spending on military amid fears Trump could pull out of alliance\n\nBianca Censori's lookalike sister Angelina puts on a very busty display in a racy cutout bodysuit as she poses for sizzling snaps following Kanye West's split from Aussie wife\n\nDaisy Lowe is ever the doting mother as she takes baby daughter Ivy, 22 months, out with her father Gavin Rossdale and fiancé Jordan Saul to Farmers' Market in Los Angeles\n\nHave YOU got a story? Email tips@dailymail.com \nBy MILLY VEITCH FOR MAILONLINE \n Published:22:56 GMT, 17 February 2025 |Updated:22:57 GMT, 17 February 2025 \n\nDaisy Lowe and her father Gavin Rossdale enjoyed a family outing to the Farmers' Market on Sunday with her fiancé Jordan Saul and their baby daughter Ivy in Los Angeles.\nThe model, 34, looked typically stylish in a plunging black jumpsuit and oversized sunglasses as she pushed her 22-month-old daughter in her stroller.\nWhile her musician dad Gavin, 59, coordinated with her in an all-black ensemble, sporting an oversized jacket and matching trousers, while also hiding his face behind a pair of shades.\nProperty developer partner Jordan brought up the rear, putting on a casual display in a white T-shirt, baggy black shorts and leopard print trainers.\nGavin - the former lead singer of the rock band Bush- shares daughter Daisy with ex-girlfriend Pearl Lowe.\nThe pair had a brief relationship in 1989, but the musician wasn't confirmed to be Daisy's father until a paternity test in 2004.\n\nDaisy Lowe and her father Gavin Rossdale enjoyed a family outing to the Farmers' Market on Sunday with her fiancé Jordan Saul and their baby daughter Ivy in Los Angeles\n\nThe model, 34, looked typically stylish in a plunging black jumpsuit and oversized sunglasses as she pushed her 22-month-old daughter in her stroller\nInitially the father and daughter were estranged, but it was revealed in 2010 that they had rebuilt their relationship.\nIn 2012, Pearl explained: 'It was a bit hairy for six months when I told her I suspected her father was the musician Gavin Rossdale. \n'Gavin told me if Daisy, then 14, had a DNA test, he'd never speak to me again and he's kept his word. I lost him as a friend, but Daisy has a relationship with him, which is great.' \nGavin also shares sons Kingston, 19, Zuma, 17, and Apollo, 11, with his ex-wife Gwen Stefani, who he split with in 2015 after nearly 12 years of marriage.\nMeanwhile, Daisy and Jordan welcomed baby Ivy into the world in April 2023, announcing the happy news via Instagram. \nShe wrote at the time: 'Our Easter egg finally hatched! Ivy Love Saul you have made all my dreams come true - our dream girl.\n'I have never known happiness or love like this. I can’t stop crying tears of joy. Happy Easter Loves.'\nShe announced her pregnancy on Instagram in October 2022, as she posted a sweet snap of her bump - admitting she was 'oscillating wildly between excitement and nervousness'. \n\nGavin shares daughter Daisy with ex-girlfriend Pearl Lowe. The pair had a brief relationship in 1989, but the musician wasn't confirmed to be Daisy's father until a paternity test in 2004 \n\nInitially the father and daughter were estranged, but it was revealed in 2010 that they had rebuilt their relationship (Gavin pictured with his kids Daisy, Kingston, Zuma and Apollo)\n\nMeanwhile, Daisy and Jordan welcomed baby Ivy into the world in April 2023, announcing the happy news via Instagram\n\nIt came just weeks after she and Jordan confirmed their engagement, with the property developer popping the question after two years of dating. \nDaisy has been candid about postpartum life since welcoming baby Ivy and said she is 'very proud of what my body has achieved'.\nPosing in a bikini three months after giving birth, she wrote on her Instagram page: '3 months of motherhood & this is where I am at. I am still breastfeeding. I am still me…\n'I have to remember that 3 months isn’t that long for my body to recover. I am feeling so overwhelmed with love and magic as well as exhaustion…\n'I am sat here as Ivy has her nap. Everyone says that you should sleep while the baby sleeps… I’ve never been very good at listening to what everyone says.\n'I am trying to remember to be gentle on myself, that my body made our sassy little angel.\n'This picture was taken in a moment when I was feeling very proud of what my body has achieved… and I popped on my bikini for the first time.\n'Biggest love and respect to all the humans out there trying to love their own incredible bodies. We are all made of stardust.' \n\nIt came just weeks after she and Jordan confirmed their engagement , with the property developer popping the question after two years of dating\n\nDaisy has been candid about postpartum life since welcoming baby Ivy and said she is 'very proud of what my body has achieved'\nDaisy LoweLos AngelesGwen StefaniInstagram\n\nShare or comment on this article: \nDaisy Lowe is ever the doting mother as she takes baby daughter Ivy, 22 months, out with her father Gavin Rossdale and fiancé Jordan Saul to Farmers' Market in Los Angeles\n\nAdd comment\n\nEnter search term:\n\nLove Island: All Stars Gabby Allen and Casey O'Gorman are crowned WINNERS after he appeared on the show three times - beating Luca and Grace\n\nBikini-clad Kelly Brook shows off her eye-popping curves as she continues romantic holiday with husband Jeremy Parisi in the Caribbean\n\nLove Island All Stars final RECAP: Gabby Allen and Casey O'Gorman crowned winners in drama-filled finale as couple scoop £50,000\n\nIconic '80s heartthrob who is still a beloved TV star is pictured in rare yearbook photos... can you guess who?\n\nLove Island All Stars final gets off to fiery start as Grace Jackson hits back at Olivia Hawkins after THAT accusation she was desperate to win \n\n'The results are unbelievable': Women are so obsessed with this beauty gummy they've chewed 30MILLION of them!\n\nLove Island viewers notice VERY awkward moment for one couple during opening minutes of the final\n\nThe skinny influencer I saw spitting cake into a flowerpot and the A-listers who barely even LOOK at food: how stars avoid getting fat at glitzy parties, by MOLLY CLAYTON\n\nRyan Reynolds 'distanced' himself from Blake Lively and 'minimised' her experience with SNL50 joke about Justin Baldoni\n\nLooking to boost your gut health? It's all about knowing where to start! What to keep front of mind when supporting your microbiome\n\nKerry Katona said she loved me but dumped me the day of The Vivienne's funeral: Chef Jameson Stocks reveals romance with star \n\nSimon Cowell reveals Cheryl was supposed to be an original BGT judge until she 'freaked out and quit' at the last minute throwing the show into chaos\n\nBen Affleck's middle child Fin, 16, rocks new hairstyle while visiting aquarium with famous father and pal\n\nWynne Evans' BBC travel series with Joanna Page pulled off air in schedule shake-up after he was axed from Strictly Coming dancing tour\n\nRange revolution: How four drivers got from Eastbourne to Aberdeen on one tank of fuel thanks to the JAECOO 7 SHS's clever new tech\n\nJustin Baldoni 'could use Ryan Reynolds and Blake Lively's SNL skit' in his defense... as he remains in Hawaii\n\nGayle King fuels Blake Lively and Justin Baldoni drama as she asks It Ends With Us star awkward question\n\nEDEN CONFIDENTIAL: Leomie Anderson felt 'belittled' by Bear Grylls on hunt show\n\nBethenny Frankel lauds Ryan Reynolds and Blake Lively's 'genius' SNL 50 skit amid Justin Baldoni drama\n\nUp-to-date on the latest, must-have tech? Get yourself gadget-ed up with this month's top 10 devices\n\nMiranda Kerr opens up about losing her first boyfriend at the age of 15 when he died in a sudden car accident - and how she needed 'lots of therapy'\n\nKylie Minogue fans rage over 'cheap' and 'overhyped' Perth concert as singer kicks off her long-awaited Australian Tension tour\n\nDaisy Lowe is ever the doting mother as she takes baby daughter Ivy, 22 months, out with her father Gavin Rossdale and fiancé Jordan Saul to Farmers' Market\n\nKevin Costner's reaction to Ryan Reynolds' Justin Baldoni joke on SNL50: Anniversary goes viral\n\neasyJet founder Sir Stelios Haji-Ioannou is offering £300,000 to promising young entrepreneurs - could you be one of them? Here's how last year's winners got on\n\nBianca Censori's lookalike sister Angelina puts on a very busty display in a racy cutout bodysuit following Kanye West's split from Aussie wife\n\nITV unveil Britain's Got Talent's new judging lineup in first look photos as show prepares for its most dangerous series ever\n\nBRIT Awards 2025: Two HUGE artists confirmed to take to the stage alongside performers Sabrina Carpenter and Jade Thirlwall\n\nLeggy Tina O'Brien, 41, stuns in red mini dress as she poses with her lookalike daughter Scarlett, 16, for a glamorous snap\n\nLove is in the air: 10 top brands to help you celebrate Valentine's Day in style this year, from roses to jewellery\n\nHelen Flanagan puts on a VERY daring display in sexy red lingerie as she poses for racy Instagram snaps\n\nDid YOU guess the hidden meanings teased in The White Lotus opening credits? How Season 3's opening scene Easter eggs give clues for plot twists\n\nAmy Schumer makes shocking confession about her sex life with husband Chris Fischer\n\nWhy Blake Lively and Ryan Reynolds attended SNL50 despite fans expressing their shock amid Baldoni feud\n\nThis £31 beauty buy loved by Victoria Beckham and Zendaya is so good one is sold every MINUTE - now you'll donate £5 to charity with every purchase\n\nNetflix fans hail new 'gripping' crime series as 'best of 2025'\n\nCardi B sparks new romance rumors with famous NFL player after another ugly split from Offset\n\nCandice Bergen's husband Marshall Rose dead at 88: Murphy Brown and Sex and the City star's spouse passes away\n\nSpencer Matthews performs jaw-dropping backflip while hitting the slopes during lavish ski getaway with pals in the French Alps\n\nTeddi Mellencamp's sister Justice shares heartwrenching update following sibling's brain tumor surgery\n\nPete Wicks' pals insist he didn't cheat on Maura Higgins despite her claims as they reveal the 'truth' behind THOSE messages\n\nGary Coleman's ex-wife Shannon Price speaks out about the Diff'rent Strokes star's mysterious death in 2010 aged 42\n\nThe truth about the video of Kim Kardashian and Pete Davidson appearing to ignore each other at SNL50\n\nSarah Jessica Parker shares inside look from star-studded audience at SNL's 'thrilling' 50th anniversary show\n\nCalling all fashion lovers! You're about to see this £15 tote bag everywhere - and it's all for a good cause\n\nBlake Lively and Ryan Reynolds' 'awkward and stiff' red carpet moment decipheredd as ploy to diffuse Justin Baldoni scandal fails miserably\n\nFresh heartache for Shane MacGowan's widow Victoria Mary Clark as her dad passes away - just 15-months after death of The Pogues star\n\nEastEnders star Davood Ghadami breaks his silence on claims he left his wife for his married pantomime co-star\n\nJay-Z and Beyoncé are all smiles as they're seen for first time since his teen rape case with Diddy is dismissed\n\nPatrick Schwarzenegger breaks his silence over THAT White Lotus nude scene with very crude remark\n\nJohn Mulaney jokes only 2 SNL hosts have ever 'committed murder' in shock 50th anniversary segment\n\nBAFTAs 2025 viral moments: From Zoe Saldana's expletive-laden speech to Selena Gomez's blunder and Kylie Jenner's VERY bemused reaction to host David Tennant\n\nRochelle Humes flashes her abs in a black crop top as she joins supported husband Marvin and their three children at her My Little Coco party\n\nIncredible comeback of Harvey Weinstein's British wife: Georgina Chapman regains her crown as queen of the red carpet by boyfriend Adrien Brody's side \n\nPaloma Faith reveals she is 'softening' to the idea of marriage as she opens up about her new man following her split from ex Leyman Lahcine\n\nLalisa Manobel is the darling of Gen Z -but is a virtual unknown to the over 30s. Now all that's about to change as she makes her acting debut in The White Lotus\n\nBeloved BBC presenter quits after ten years on show as she receives devastating Alzheimer's diagnosis - bidding emotional farewell to fans\n\nPete Wicks takes his mind off Maura Higgins split as he makes impassioned speech about dogs in Parliament\n\nActress from The White Lotus got caught up in Blake Lively drama while she was still filming hit show\n\nThe White Lotus fans left 'screaming' after return of unexpected character in season three\n\nHow Ryan Reynolds' SNL50 joke sparked tensions backstage as Blake Lively's feud with Justin Baldoni continues\n\nLily Allen reveals £8K-a-week trauma centre stay inspired her to get tattoo about 'accepting pain' - after husband David Harbour moved on with new girlfriend\n\nMax George shares first glimpse of surgery and painful scar after revealing he'd been forced to undergo secret second heart operation \n\nX Factor singer is murdered after terrifying kidnap ordeal\n\nGino D'Aampo's wife Jessica is '100 per cent standing by' him after allegations of sexually inappropriate behaviour \n\nInside the tumultuous love life of Corrie's Kym Marsh, 48, including three failed marriages as she 'splits from toyboy Samuel Thomas, 29'\n\nBeloved singer Paquita la del Barrio dies age 77\n\nThe legendary artist died Monday at her home, according to a statement on her Instagram account.\n\nCAROLINE GRAHAM: My creepy encounter with Arnold Schwarzenegger - and why I was warned to NEVER be left alone\n\nPost Malone announces huge 2025 UK and European tour - here's how you can get tickets!\n\nWarwick Davis clip leaves fans in hysterics as it resurfaces after he was awarded the Fellowship honour at the 2025 BAFTAs\n\nArnold Schwarzenegger gushes over son's 'creepy' incestuous full frontal White Lotus scene as he draws attention to his own on-camera nudity \n\nLove Island bookies reveal which fan-favourite couple are most likely to win All Stars series after their turbulent time in the villa\n\nInside Ana De Armas' VERY turbulent love life after sparking dating rumors with Tom Cruise\n\n'I'd kill him' seethes Will Mellor as he learns about horrific rape of 16-year-old girl at the hands of a policeman in harrowing Cops Gone Bad interview\n\nTheo James admits he 'still has to hustle' for roles as he recalls 'fighting' for a part in The White Lotus in a candid discussion about his career\n\nPanicked Morning Live host asks 'did we get away with it?' after failing to tell co-stars they're on camera in tech fail\n\nKym Marsh, 48, 'SPLITS from toyboy Samuel Thomas, 29, after six-month whirlwind romance despite branding him her soulmate'\n\nMAFS UK star Luke Worley baffles fans as he 'proposes' to mystery woman in Dubai before revealing 'she said 'NO'\n\nShakira thanks fans for outpouring of support after revealing hospitalization: 'You give me so much strength!'\n\nThe BAFTA moments you DIDN'T get to see! What Kylie and Timothee were really like when the cameras weren't rolling and why their security were telling off other guests\n\nLeonardo DiCaprio, 50, attempts to keep a low-profile in a mask and baseball cap as he and Vittoria Ceretti, 26, leave Netflix's BAFTAs after party\n\nThis Morning viewers rage 'get this lunatic off my TV!' as guest promotes skinny jabs for CHILDREN in 'harmful' debate\n\nDemi Moore takes break from busy award season to take her beloved Chihuahua Pilaf on a doggy play date with daughter\n\nWhite Lotus fans 'grossed out' by Patrick Schwarzenegger's full frontal scene amid 'creepy' incest storyline\n\nBAFTAs worst dressed: Alex Scott hits the after party in garish double denim while Laura Whitmore chooses ill-fitting red trousers\n\nRosie Huntington-Whiteley shows off her toned figure in sage green underwear as she models her new M&S lingerie collection\n\nLove Island All Stars: Luca Bish's mum weighs in on THAT accusation from Olivia Hawkins to Grace Jackson about 'wanting to win the show'\n\nColeen Nolan hits back after being brutally trolled for smiling at late sister Linda's funeral - insisting 'we have to stop judging grief' in emotional interview\n\nPaul McCartney falls victim to hilarious 'snub' at the end of SNL's star-studded 50th anniversary special after playing Beatles medley during show\n\nLove Island SPOILER: The final five couples enjoy a wild pool party before making their loved up declarations - ahead of one pair being crowned the WINNER\n\nRyan Reynolds and Blake Lively are accused of 'gaslighting' Justin Baldoni with SNL50 joke\n\nNetflix star Kim Sae-Ron's cause of death revealed after actress was found in her home aged 24\n\nDeath In Paradise fans rage 'I'm done!' as they blast BBC for 'making the show unwatchable and turning it into trash' with devastating twist\n\nAriana Grande and Kylie Jenner leave BAFTA fans in stitches as they look completely baffled during David Tennant's 500 Miles opening performance\n\nThe real reason Maura Higgins dumped Pete Wicks and why she made that brutal 'cheating' swipe\n\nBAFTAs viewers slam Zoe Saldana's explicit-laden acceptance speech as they joke her monologue had them 'reaching for the hard liquor' \n\nTaking after their mama! Kate reveals George, Charlotte and Louis's stunning portraits (plus one of her own) as part of her early years crusade\n\nBill Murray, 74, arrives to Chris Rock's birthday hand-in-hand with much younger mystery woman after he shocked fans with Kelis, 45, romance\n\nBeyoncé fans round on ticket resell sites as they start listing some for her Tottenham Hotspur Stadium dates for £1,334 EACH\n\n Queen Mathilde looks trendy in leather skirt as she returns to Belgium following trip to Costa Rica where she narrowly avoided disaster\n\nSNL fans left in hysterics as Mike Myers returns as Linda Richman after almost three decades for show's star-studded 50th anniversary\n\nAna de Armas, 36, steps out with boyfriend Manuel Anido Cuesta, 27, for a romantic stroll in Madrid after she enjoyed a night out with Tom Cruise\n\nMarion Cotillard looks effortlessly elegant in a strapless white gown as she attends The Ice Tower premiere at the Berlin International Film Festival\n\nAnya Taylor-Joy channels Kate Moss in iconic Mugler look from 1995 runway as she graces the red carpet at SNL's star-studded 50th anniversary\n\nKim Kardashian shows off her eye-popping curves in a plunging silver dress as she joins Lady Gaga and Anya Taylor-Joy for SNL's star-studded 50th anniversary afterparty\n\nInside Millie Bobby Brown's rollercoaster life, from child star to scandal-ridden teen to trad wife\n\nNeighbours' Harold Bishop star Ian Smith, 86, admits he thought he'd be 'stronger' as he recalls collapsing after being diagnosed with terminal lung cancer\n\nKylie Jenner and boyfriend Timothée Chalamet sport matching rings as she flashes major sideboob in a sexy backless gown at the BAFTAs\n\nAlicia Douvall looks loved up as she cosies up to mystery man in romantic Valentine's Day post\n\nJesse Eisenberg reveals Kieran Culkin nearly pulled out of role in A Real Pain two weeks before filming began due to family concerns\n\nIsla Fisher thanks Sacha Baron Cohen for 'liking' her saucy shoot as exes interact on social media for first time in months amid 'messy' divorce \n\nLily James looks giddy as she hops in the back of a taxi with Glen Powell - who chivalrously gives her his suit jacket - following BAFTA party\n\nWho is Patrick Schwarzenegger 's fiancée Abby Champion? Meet The White Lotus star's model girlfriend\n\nRising stars with VERY risqué debuts! Three BAFTA nominees for up-and-coming category made their names romping and taking drugs on screen \n\nSurprise BAFTA winner Mikey Madison admits she was a 'weirdo' and shunned by her siblings before Tarantino's movies 'changed her life'\n\nNetflix actress Kim Sae-Ron's haunting last Instagram post about tragic K-pop star is discovered by devastated fans after her death aged 24\n\nJacob Elordi doesn't look like this anymore! Actor stuns fans as he reveals shock new look at the 75th Berlinale International Film Festival\n\nGladiators viewers blast BBC for 'dumb and really unfair' rule that turns contestants into 'open targets' - but who's in the wrong?\n\nAdorable moment Prince Harry embraces daughter of Team Ukraine Invictus Games athlete - before he pledges 'the world stands with you'\n\nBlake Lively watches as Ryan Reynolds jokes about Justin Baldoni scandal as duo returns to spotlight for SNL50 celebration in NYC\n\nWorst dressed stars at 2025 BAFTAs: AJ Odudu makes a rare fashion faux pas alongside quirky Gwendoline Christie and Isabella Rossellini\n\nConor Maynard reveals he's been rushed to hospital as he's pictured being wheeled away by paramedics after accident\n\nThe parents of Apprentice star who quit after making offensive remark insist their son is not racist - and claim he was 'misunderstood'\n\nAntiques Roadshow guest floored as he learns his collection of film memorabilia saved from a skip are worth more than a HOUSE in life-changing valuation\n\nHarry and Meghan risk Donald Trump's wrath as six-figure Archewell donations to pro-Democrat gurus, groups and even Joe Biden's daughter are revealed\n\nJay-Z reveals he faced death threats after 'malicious and fictitious' lawsuit falsely accusing him of raping a 13-year-old\n\nHolly Willoughby shows off her moves in an 80s style, gem-encrusted dress for special Dancing On Ice episode\n\nEmotional Warwick Davis fights back tears as he pays tribute to his late wife Samantha and admits he has found love again while accepting Fellowship Award at the BAFTAs\n\nWho is 'Sponge'? Warwick Davis breaks down in tears on BAFTAS stage over death of his wife - as he thanks mystery person for helping him 'love again'\n\nMel B cuts a casual figure in a bold blue tracksuit as she departs BBC Breakfast after opening up about her dyslexia\n\nNoel Fielding smiles as he is spotted for the first time since he mysteriously quit filming his Apple TV show due to an unknown 'health reason'\n\nHugh Grant, 64, beams alongside his glamorous wife Anna Elisabet Eberstein, 42, as they attend star-studded British Vogue x GQ BAFTA afterparty\n\nBAFTAs 2025 winners: Adrien Brody and Mikey Madison scoop top gongs, The Brutalist and Best Film Conclave lead with FOUR awards\n\nThe White Lotus fans 'devastated' just minutes into season three after spotting 'heinous' change to show - raging 'why would they do that?!'\n\nLeo Woodall and Meghann Fahy depart the Vogue x GQ BAFTA afterparty alongside glamorous Jade Thirlwall, Vanessa Kirby and Maisie Williams\n\nDemi Moore ditches her sparkly gown for a mini dress as she joins Anna Kendrick, Vanessa Kirby and Rosie Huntington-Whiteley at Netflix's BAFTAs party\n\nMeghan's mega Invictus wardrobe! Duchess of Sussex wore more than £270k of designer clothing and bling in just three days (and opted for muted tones again after THAT dig at the royal family!)\n\nLady Gaga cosies up to fiancé Michael Polansky as the loved up couple arrive at the SNL50: The Anniversary Special afterparty\n\nAwkward moment stars don't know whether to clap Emilia Pérez star after she skipped BAFTAs over racist tweet controversy - as Netflix trans movie faces being cancelled \n\nDancing On Ice viewers all have the same complaint about Charlie Brooks' routine - but did you spot the problem?\n\nJade Thirlwall puts on a leggy display in a sizzling red dress as she attends the star-studded British Vogue x GQ BAFTA Fashion & Film Party\n\nMikey Madison stuns in a yellow sequin mini dress as she celebrates shock BAFTAs Best Actress win at Universal Focus afterparty\n\nAmanda Holden shows off her incredible physique as she rings in her 54th birthday with sizzling bikini-clad photoshoot\n\nJeff Goldblum, 72, cosies up to glamorous wife Emilie Livingston, 41, as they hold hands at the Universal Focus BAFTAs afterparty\n\nBAFTA viewers left 'disgusted' as beloved stars Timothy West, Bernard Hill and Brian Murphy are 'snubbed' from In Memoriam tribute\n\nRosie Huntington-Whiteley joins leggy Alexa Chung and pregnant Poppy Delevingne at British Vogue x GQ BAFTA afterparty\n\nRosie Huntington-Whiteley puts on a VERY leggy display in a sexy leather and fur bodysuit as she heads to Netflix's BAFTAs after party\n\nSelena Gomez suffers awkward blunder on stage while presenting BAFTA award\n\nJess Glynne flashes her abs in a cut-out checked jacket as she joins stylish girlfriend Alex Scott at Vogue x GQ BAFTA after party\n\nWarwick Davis leaves BAFTA viewers sobbing as they admit they weren't 'emotionally prepared' as he tearfully dedicates Fellowship to his late wife Samantha\n\nBAFTAs host David Tennant wins praise for a second year running as he delights with THREE outfit changes, an epic opening song, and savage Trump jibe\n\nJustin Bieber sports low-slung jeans as he arrives at LA recording studio in his $421K Lamborghini\n\nHow Meghan's 'Californian' hugs rubbed the Palace up the wrong way: Duchess 'fuelled gossip she was flirting with Prince William' \n\nFurious fans call out SNL for trying to do 'damage control' for Blake Lively and Ryan Reynolds amid $400M legal battle with Justin Baldoni\n\nMarisa Abela cosies up with fiancé Jamie Bogyo while Adrien Brody poses with Georgina Chapman as they attend star-studded BAFTAs party\n\nCamila Cabello and new boyfriend Henry Chalhoub turn heads at BAFTA afterparty in London\n\nHarry moved to tears as he is praised for changing lives of so many people in Invictus Games closing ceremony - before Meghan posts 'so proud of you'\n\nSNL50 looks back on awkward Diddy and R. Kelly appearances as the show highlights its most offensive sketches\n\nGuess who! World famous pop star goes incognito as she lands in Melbourne ahead of sold-out Australian tour\n\nJack Nicholson, 87, makes rare appearance at SNL 50th Anniversary special to introduce Adam Sandler\n\nThey starred together in Anger Management\n\nAubrey Plaza makes her first public appearance following husband Jeff Baena's death as she takes part in SNL50 celebration in New York\n\nOscar-winning actress Julianne Moore 'stunned' after Trump admin bans her children's book about freckles\n\nSPOILER ALERT: The White Lotus is back! Death, full frontal nudity and the shock return of a familiar villain lead to an explosive season three launch\n\nTom Hanks blasted for 'racist and disgusting' portrayal of MAGA supporter on star-studded SNL 50 \n\nGangnam Style fans surprised to learn true meaning of PSY's South Korean song over a decade after its wacky hook step went viral\n\nMichael Hutchence's daughter Tiger Lily, 28, appears to confirm pregnancy as she shows off her bare baby bump in art photos\n\nMeryl Streep, 75, makes her SNL debut as Kate McKinnon's raunchy mother in abduction sketch for 50th anniversary of the skit show\n\nJenna Ortega puts on a busty display in plunging silk gown at SNL50: Anniversary Special red carpet in NYC\n\nI don't feel sorry for the nakedly ambitious Bianca Censori. Her marriage to Kanye turned her from a nobody into a global superstar: AMANDA PLATELL\n\nKylie Jenner and Timothée Chalamet can't keep their hands off each other at the BAFTAs after she skipped the red carpet\n\nZoe Saldana is pulled off camera during expletive-laden speech as she breaks down in tears while accepting Best Supporting Actress award \n\nWinners Zoe Saldana and Warwick Davis share sweet celebratory moment together while Wicked's Cynthia Erivo and Ariana Grande pose for playful selfie\n\nAriana Grande puts on a showstopping display in a blush pink and black gown as she joins stunning Selena Gomez, Demi Moore and Camila Cabello at 2025 BAFTAs\n\nHeartbreaking new details of Caroline Flack's desperate final hours... and a shock revelation about her boyfriend reveals KATIE HIND \n\nZoe Saldana shares a passionate kiss with husband Marco Perego as the couple pack on the PDA while leading stars at Netflix BAFTA afterparty\n\nSNL50's most viral moments from Kim Kardashian's hilarious bum drum sketch to Ryan Reynolds' awkward Blake Lively gag\n\nLove Island descends into chaos after axed star Liv Hawkins accuses Grace Jackson of a 'showmance' as she claims she has seen bombshell texts\n\nMikey Madison reveals the advice she regrets taking from Robert De Niro ahead of her shock Best Actress win at the 2025 BAFTAs\n\nLady Gaga lovingly gazes at fiancé Michael Polansky during SNL50: The Anniversary Special\n\nGuy Pearce reunites with his ex-girlfriend Game Of Thrones star Carice van Houten at the BAFTA 2025 Awards after announcing their split\n\nSabrina Carpenter and Paul Simon kick off SNL's 50th Anniversary Special in New York with Homeward Bound performance\n\nKevin Costner, 70, cuts a dapper figure in black suit at SNL 50th Anniversary after his viral Super Bowl takeover\n\nKylie Jenner fans joke 'she's not in Calabasas anymore' as she interacts with BAFTAs host David Tennant during star-studded ceremony\n\nMiley Cyrus makes rare red carpet appearance with boyfriend before moving Sinead O'Connor tribute on SNL50\n\nJason Momoa and girlfriend Adria Arjona look loved-up at SNL50: Anniversary Special in NYC\n\nScarlett Johansson and ex-husband Ryan Reynolds risk awkward run-in at SNL 50: The Anniversary Special\n\nSNL 50: Kim Kardashian, Scarlett Johansson and Sabrina Carpenter lead the best dressed stars on the red carpet\n\nEmilia Perez BAFTA shock as snubbed Mexican film only wins two gongs despite garnering impressive 11 nods as fears for movie deepen\n\nLove Island: All Stars finalists REVEALED as one couple are brutally axed by fellow Islanders - just one day before series' final\n\nKim Kardashian shows ex Pete Davidson what he's missing in nude look at party after he scrubbed tattoo tribute to her and kids\n\nMORE DON'T MISS\n\nWhite Lotus star Michelle Monaghan wows in a sexy plunging feather-trim red gown at the BAFTAs\n\nRevealed: Eight claims Prince Harry and Meghan Markle made in their explosive Oprah interview- and how they stack up four years on\n\nThe White Lotus opening credits: Every Easter Egg hidden in season three from gang warfare to forbidden romps and murder at sea - but how many did you spot?\n\nCelebrity Traitors 'is thrown into chaos as TWO stars pull out weeks before filming commences on the series'\n\nChantel Jeffries shows off her incredible figure in a colorful bikini for beach day in Miami\n\nKylie Jenner is spotted chatting to Demi Moore at the BAFTAs by eagle-eyed fans just weeks after THAT 'snub'\n\nEmilia Pérez director pays heartfelt tribute to disgraced star Karla Sofía Gascón while co-star Zoe Saldaña also name checks the absent actress\n\nBAFTAs host David Tennant makes Selena Gomez jump out of her skin during performance of I'm Gonna Be as fans hail the 'iconic' opening\n\nBen Affleck goes for dog walk after spending first Valentine's Day as a single man following JLo divorce\n\nMichelle Pfeiffer cozies up to husband of 31 years David E. Kelley during Valentine's Day weekend\n\nShakira hospitalized after suffering abdominal issues as she announces cancellation of Peru concert\n\nShe's a snack! Emma Stone wears kooky popcorn dress at SNL50: The Anniversary Special with husband\n\nDancing On Ice viewers furious after fifth contestant is eliminated as they claim the star was 'robbed'\n\nMadonna looks fantastic with no filters as she heads to Chris Rock's 60th birthday party\n\nBAFTA's Fashion Verdict from LAURA CRAIK: Stylish stars turned up the heat but still gave us goosebumps\n\nShrinking creator reveals why Harrison Ford, 82, insisted on being shirtless for certain scene\n\nJesse Eisenberg explains reason for Kieran Culkin's absence from BAFTAs as he accepts FIFTH acting award on his A Real Pain co-star's behalf\n\nVanessa Kirby is the epitome of elegance in a black bardot gown with thigh-high split as she arrives at the BAFTAs ahead of presenting an award\n\nCher, Madonna, and Anya Taylor-Joy bring the star power to Chris Rock's 60th birthday bash in NYC\n\nZoe Ball and Fatboy Slim have been 'gardening, doing puzzles and working in a local cafe' after she quit her six-figure BBC Radio 2 gig\n\nLeo Woodall looks more loved-up than ever with glamorous girlfriend Meghann Fahy as they attend the star-studded 2025 BAFTAs\n\nJake Paul claims Mike Tyson was diagnosed with Parkinson's before their Netflix fight in shock reveal\n\nWhere is the 'Hot Felon' now? How Jeremy Meeks overcame heroin-addled childhood, gun crime and addiction to become a philanthropist\n\nFrom Love Island to red carpet royalty! Molly-Mae Hague makes surprise appearance at the 2025 BAFTAs as she shows off her sense of style \n\nKourtney Kardashian shares rare snap with stepdaughter Alabama Barker as she shows off Valentine's Day roses\n\nLisa Vanderpump's daughter Pandora welcomes baby number two as she shares precious new photo\n\nCamila Cabello left shivering as she flaunts her jaw-dropping figure in a VERY daring sheer gown while hitting the chilly red carpet at 2025 BAFTAs\n\nHugh Grant, 64, cuts a dapper figure as he joins leggy wife Anna Eberstein, 42, for rare red carpet appearance at the 2025 BAFTAs\n\nColin From Accounts stars Harriet Dyer and Patrick Brammall welcome their second child - and reveal the newborn's very sweet name\n\nSelena Gomez puts on a glamorous display in a busty silver and black velvet gown as she stuns on the BAFTAs 2025 red carpet\n\nThe Substance director Coralie Fargeat turns heads as she hits the star-studded red carpet in a black puffer coat at the 2025 BAFTAs\n\nHow Natalie Cassidy 'is set to make millions' following her EastEnders exit as expert bills her the next Stacey Solomon and tips her for the jungle'\n\nVanessa Williams makes her return to the spotlight as she attends the BAFTAs following tragic death of her 'remarkable' mother\n\nVera Wang, 75, shows off her ageless looks as she slips into a racy strapless cut-out gown and edgy leather jacket at the BAFTAs\n\nAnna Kendrick looks out of this world in a black glitzy gown as she graces the 2025 BAFTAs red carpet\n\nAriana Grande is the epitome of glamour in a plunging black velvet gown with dramatic pink skirt as she arrives at the BAFTAs 2025\n\nAlice Evans reveals she's being evicted from her LA home after being 'unable to pay her rent' amid her bitter court battle with ex Ioan Gruffudd\n\nMelissa Joan Hart reveals the jaw-dropping Valentine's Day surprise from her husband\n\nPamela Anderson, 57, looks effortlessly chic in a long white gown as she rocks her signature make-up-free look for BAFTAs 2025\n\nLeading Actress favourite Demi Moore, 62, looks sensational in a dazzling backless sequin gown as she arrives at the 2025 BAFTAs\n\nKaia Gerber sports smart glasses as she departs theater performance amid Lewis Pullman romance\n\nMikey Madison is the epitome of chic in an ivory strapless dress at the BAFTAs after her nomination for Best Leading Actress\n\nWicked star Cynthia Erivo turns heads in a structured white lace gown as she poses up a storm on the 2025 BAFTAs red carpet\n\nNepo baby who stars in Bridget Jones stuns in a daring mesh jeweled gown at the BAFTAs - can you guess who her very famous mother is?\n\nMarisa Abela looks sensational in a glitzy black gown as she makes her arrival to the BAFTAs 2025 red carpet - amid her Rising Star nomination\n\nWho is set to triumph at the BAFTAs? Conclave and The Brutalist among favourites with Ralph Fiennes and Demi Moore set to scoop gongs\n\nJeff Goldblum's wife Emilie Livingston teams her very glamorous dress with bizarre shoe choice at the star-studded 2025 BAFTAs\n\nKneecap star proudly dons Irish outfit as the hip hop group put on a VERY animated display after their controversial movie is tipped to scoop awards at star-studded BAFTAs\n\nTom Hanks 'stormed out' of SNL 50th anniversary concert with wife Rita Wilson for bizarre reason\n\nGwendoline Christie showcases her VERY bold new look as she walks the BAFTA 2025 red carpet with long braided extensions\n\nBridgerton stars Hannah Dodd and Florence Hunt look words away from their regal characters as they slip into stylish cut-out gowns\n\nBAFTA fans are sent into a frenzy with the red carpet arrival of 'icons' Wallace And Gromit as latest movie competes in a brand new category\n\n'I found that very difficult but she was no longer aware': Dame Maggie Smith's son Toby Stephens reveals he wasn't with his mum when she died\n\nDrake to headline all three days at one of UK's favourite music festivals amid Kendrick Lamar feud - will you be joining in with the Drake-mania?\n\nHis parents are an iconic British couple - but can you guess the Nepo baby in this sweet childhood throwback snap?\n\nLove Island SPOILER: Olivia Hawkins gives her brutal verdict on Ronnie Vint and Harriett Blackmore's relationship as she returns to villa in shock twist\n\nAmazing unseen images of 'Bride of Wildenstein's' incredible life in Africa: Fascinating photos offer new insight into the billionaire's bride dubbed 'Catwoman'\n\nHas Ellen already fallen out of love with her £15m Cotswolds dream home? Residents say US talk show queen is already eyeing up new rural retreat \n\nNetflix star Kim Sae-ron dies aged 24: Actress who starred in hit K-drama Bloodhounds found dead in her home as fans pay tribute\n\nThe ultimate nepo family who have taken over Hollywood! How the ever-expanding Wayans have dominated screens for the past three decades\n\n80s sitcom star who acted with Michael J. Fox and played a Laker Girl is unrecognizable... can you guess who?\n\nGK Barry shares shocking story about BIZARRE couple's massage with her girlfriend Ella Rutherford\n\nWho is David Harbour's new girlfriend? Aspiring model Ellie Fallon boasts glam Insta which gives away BIG clue as to when the pair met\n\nLove Island's Tasha Ghouri hints at the heartbreaking reason behind her shock split from Andrew Le Page\n\nMeghan Markle is 'feeling the pressure' and has been 'working very hard for five months' as she establishes herself as an influencer\n\nLove Island: All Stars villa 'left in chaos as star suffers head injury after passing out - as show medics are called in'\n\nPictured: Incredible Wiltshire home actor Stephen Mangan bought with his sisters to help cope with the early deaths of both their parents\n\nHow to watch the BAFTAs 2025 and what time it starts: Live stream the film awards from anywhere as David Tennant returns to hosting duties\n\nBillie Piper is reprising her iconic Doctor Who role opposite Christopher Eccleston in honour of the revival's 20th Anniversary\n\nTOWIE's James Argent takes huge step in his relationship with Spanish girlfriend Nicoline Artursson\n\nMyleene Klass turns heads in a racy black lace look as she arrives at work at Smooth Radio - after her quirky new headgear looks were explained\n\nKate and Rio Ferdinand enjoy family work out with their sons Cree, four, and Tate, 16, in their lavish home gym\n\nMending your 'broken heart'? Maura Higgins sings along to Whitney Houston hit on Valentine's night out after taking a swipe at 'cheating' ex Pete Wicks\n\nKyle Walker splashes out on £10,000 -a-week city centre Milan apartment for himself as he adjusts to his new club - but his wife Annie Kilner has stayed at home\n\nThe making of Aimee Lou Wood: How the working class star overcame a traumatic childhoo and 'many mental illnesses' to landa\n\nThe Masked Singer fans are left baffled and claim they have 'never heard' of series winner after Pufferfish was unmasked in grand finale\n\nOzzy Osbourne, 76, reveals he will not perform a full set at Black Sabbath's farewell gig as he confesses he can only manage 'little bits and pieces'\n\nThe nepo baby set for superstardom: From starring alongside his famous mother to his romance with another child star, inside Sam Nivola's rise to fame\n\nI was on The 1% Club and there's a secret behind where we're placed on set - ITV bosses know exactly what they're doing\n\nRylan Clark is forced to pull out of his Radio 2 show after health concern as Strictly Come Dancing star steps in at the last minute\n\n How Taylor Swift's ex Joe Alwyn is chasing fame in wake of his split from pop megastar - after 'breaking up over privacy fears'\n\nOlivia Bowen shares sweet clip of the moment she told her husband Alex she was pregnant with their second child\n\nGood Morning Britain star welcomes his first child with wife as he shares newborn's sweet name\n\nBridget Jones fans devastated after watching Mad About The Boy as sobbing cinemagoers say they spent the 'whole time crying'\n\nHow Kate 'put her foot down' and stopped George, Charlotte and Louis taking part in a gory centuries-old tradition for young royals, new book claims\n\nMeghan Markle gives rare glimpse of daughter Lilibet in recent video - as fans notice similarity with 'her mama'\n\nTV fans obsessed with 'phenomenal' crime drama that 'needs another series' - but you only have days left to watch it\n\nKatie Price, 46, and JJ Slater, 33, hit Liverpoolbut risk a parking ticket as they dump Pink Pricey Range Rover outside a sexual health clinic\n\nKaya Scodelario reveals 'terrifying' teenage sex scenes on set of Skins were 'improvised' as she opens up about being a child actor pre #MeToo\n\nJustin Bieber and Hailey spend Valentine's Day together in Beverly Hills amid rumored marriage woes\n\nEamonn Holmes makes sweet marriage remark live on air months after split from ex Ruth Langsford\n\nBoris Becker, 56, and wife Lilian de Carvalho Monteiro, 33, put on a loved-up display as they party at the 75th Berlinale International Film Festival\n\nNick Cannon, father of 12, responds to news that Elon Musk has welcomed his 13th child\n\nRevealed: Lily Allen's husband David Harbour, 49, has a new model girlfriend 22 years his junior \n\nWhite Lotus is back, and you simply won't believe the real-life drama when the cameras WEREN'T rolling on TV's hottest show\n\nRita Ora shows off her toned figure in skimpy gym gear as she shares photo dump documenting her extended stay in Australia\n\nLove Island: All Stars' Ronnie Vint leaves girlfriend Harriett Blackmore reeling by revealing his REAL hair in hilarious unseen clip\n\nHow Amelia Dimoldenberg built her multi-million pound empire from a chicken shop: Inside comedian's surprising rise to fame ahead of Oscar's red carpet gig\n\nI'm the voice of Come Dine With Me - fans will be stunned to learn the truth about my catty swipes at the contestants\n\nPaul Mescal and singer girlfriend Gracie Abrams 'make up' after public spat last month as Gladiator II star reprises role\n\nKylie Minogue cuts a stylish figure as she departs Perth Airport after kicking off Australian tour\n\nGemma Atkinson reveals WILD sex secrets including one-night stands and two engagements before settling down with fiancé Gorka Marquez\n\nCeleb chefs rated: Best and worst reviews for Gordon Ramsay, Gino D'Acampo and Jamie Oliver revealed\n\nThe sombre reason why Meghan Markle shutting the car door was a security headache for her staff\n\nMax George reveals he underwent a secret SECOND heart operation after first pacemaker surgery left him in agony\n\nThe real story behind Meghan's 'baby shower': It was used by Meghan and her friends as a 'launch-pad' for their careers \n\nKim Kardashian teases her SNL 50 appearance where she's 'set to reunite' with ex Pete Davidson\n\nMaura Higgins takes a brutal swipe at 'cheating' ex Pete Wicks during Valentine's Day night out as she addresses split for first time\n\nBritney Spears and ex-felon Paul Soliz confirm they're back on as they spend Valentine's Day with his kids\n\nMake-up free Isla Fisher enjoys breakfast with children after reports her amicable divorce from Sacha Baron Cohen is set to turn nasty\n\nChrissy Teigen and John Legend sing to their late dog Penny's ashes in a touching Valentine's Day video\n\nJacqueline Jossa 'brings in lawyers over unpaid five figure sum from In The Style as fashion retailer faces administration'\n\nJessica Chastain dazzles in a strapless dress and boa sleeves at Berlinale International Film Festival\n\nLiam Gallagher 'plans to spend Oasis reunion payout on a SECOND Cotswolds manor house' ahead of £100million tour\n\nStrictly's Tasha Ghouri says she's 'still processing' split from ex Andrew Le Page in emotional update as he moves out of their shared home\n\nFrom Hogwarts to High Society! First glimpse of actress Katie Leung in new Bridgerton role\n\nSydney Sweeney exudes Hollywood glamour in strapless gown at Armani Beauty Party during Berlinale Film Festival\n\nPrince Harry does knee slide and kisses bald man's head as he joins in boisterous celebrations of one of the last events of the Invictus Games\n\nKanye West breaks his silence over alleged $250k resurfaced sex tape amid Bianca Censori divorce\n\nQueen Mary of Denmark quietly slips into Australia for a family holiday in her native Tasmania\n\n2025 Writers Guild Awards: Anora's Sean Baker continues winning streak as he nabs top honor\n\nWho won the Masked Singer? Pufferfish is crowned WINNER and identity is revealed as Samantha Barks\n\nHeidi Klum, 51, reveals she has 'chin and boob' hair as she gets candid about aging: 'It's as long as my pinky finger'\n\nLinkin Park star Chester Bennington's child, 22, comes out as transgender - five years after the rock star killed himself\n\nPhillip Schofield's helping hand for pal Gino D'Acampo following allegations of sexually inappropriate behaviour\n\nDrake performs songs from new album in tiny Sydney bar during Australian leg of Anita Max Win tour\n\nEmma Watson makes surprise appearance at NBA All-Star Celebrity Game in rare public outing\n\nBrooks Nader goes TOPLESS on the beach as she enjoys Valentine's Day getaway in Mexico without boyfriend Gleb Savchenko\n\nPhil Foden's childhood sweetheart Rebecca Cooke 'sparks engagement rumours after sporting huge diamond ring' following romantic getaway\n\n Prince Harry is greeted by raucous crowd at the Invictus Games and holds impromptu royal get-together with Denmark's Princess Marie and Prince Joachim\n\nKiernan Shipka takes the plunge in floral maxi dress as she leads the stars at WGA Awards in Beverly Hills\n\nSelling Sunset's Chrishell Stause puts on a leggy display in pink mini dress as she and spouse G Flip grab Valentine's Day dinner\n\nVanessa Kirby exudes elegance in a draped gown as she joins classy Lily James and Ellie Bamber at the Charles Finch & Chanel Pre-BAFTA party\n\nTaylor Swift's pal Este Haim and Jonathan Levin are engaged! Singer debuts massive diamond ring: 'I'm taken'\n\nMegan Thee Stallion sets pulses racing in stringy blue bikini as she celebrates 30th birthday\n\nLizzo is accused of 'copying' Lily-Rose Depp as she breaks down in tears in teaser for 'new era' of music\n\nWendy Williams flashes a smile as she rides mobility scooter during rare public outing in Miami amid battle to end guardianship\n\nThe Invictus Games are Harry's tribute to the bravery of injured military heroes. But this year they were also the perfect PR opportunity for Meghan \n\nValentine's Day date? Tom Cruise, 62, and Ana de Armas, 36, are all smiles as they are mobbed by fans during night out in London \n\nDavid Blaine, 51, reveals he is working on final ever stunt and plans to retire at the same age that his hero Harry Houdini died\n\nAmanda Holden angers BBC bosses after breaching commercial guidelines with advert for her own interior design range\n\nAnna Kendrick stuns in a red mini dress as she joins Camila Cabelo and Mikey Madison at the EE BAFTA Film Awards Nominees' Party\n\nDannii Minogue opens up about sister Kylie's devastating cancer diagnosis: 'We were going to lose her'\n\nHow Beyonce REALLY feels about husband Jay-Z's shock rape case dismissal\n\nRenee Zellweger appears to hide her ring finger AGAIN amid Ant Anstead engagement rumors in LA\n\nJake Quickenden opens up about the challenges of pursuing his career while raising a young family: 'It can be tough'\n\nJeremy Clarkson goes on furious 'cancel culture' rant as he defends under-fire stars Gino D'Acampo, Wynne Evans and Gregg Wallace\n\nBritain's Got Talent's Bruno Tonioli shares that for the sake of entertainment 'sometimes you have to be a little spicy'\n\nAdrien Brody puts on a loved-up display with girlfriend Georgina Chapman at EE BAFTA Film Awards nominees party\n\nKevyn Major Howard dead at 69: Full Metal Jacket actor passes away after being hospitalized for weeks\n\nThe Masked Singer final: Wolf is unveiled as a legendary 80s singer after missing out on a place in the top two as Pufferfish and Dressed Crab make it through\n\nPrincess Eugenie shares pictures of her children in heartfelt (and slightly apologetic) Valentine's Day tribute to her husband James Brooksbank\n\nPregnant Jesy Nelson shows off her blossoming baby bump in jumper dress as she enjoys Valentine's Day date with boyfriend Zion Foster\n\nThe 1% Club contestant takes home biggest ever prize on gameshow after risking everything to take on the final question\n\nPamela Anderson turns heads in a dramatic tulle hat as she attends The Last Show Girl Q&A in London\n\nIs this the end for Kanye West? Slurs, a crumbling marriage with wife Bianca Censori and collaborators fleeing\n\nKerry Katona shows off her two-stone weight loss in a red bikini as she enjoys her first solo Valentine's Day in Thailand since split from Ryan Mahoney\n\nNathalie Emmanuel wows in a slinky black dress as she joins glam Toni Collette and leather-clad Robert Pattinson at the Mickey 17 premiere during Berlin Film Festival\n\nFans go wild after Meryl Streep flips middle finger at Will Ferrell during SNL 50th concert\n\nHailey Bieber and husband Justin cuddle up in post-Valentine's Day photos amid rumors of marital issues\n\nHelen Flanagan oozes glamour in a baby pink midi dress and statement heels as she attends the Elle Sera Galentine's lunch in Liverpool\n\nGladiators legend recalls horrifying moment she could have been left 'dead or paralysed' after a live stunt went wrong\n\nKanye West and Bianca Censori 'have NO prenup' as estranged couple are headed for 'divorce'\n\nGeorgia Harrison stuns in sheer black lace dress as she wishes new boyfriend Jack a happy Valentine's Day\n\nAuf Wiedersehen, Pet and Doctor Who star Maya Woolfe dies aged 72 as tributes pour in\n\nEastEnders stars Danielle Harold and Max Bowden unfollow each other after stint on Celebrity Antiques Road Trip\n\nHollywood A-lister on Saturday Kitchen says she's 'going to cry' just minutes into appearance on show as fans share their shock\n\nRihanna shares raunchy throwback video with ASAP Rocky for Valentine's Day amid trial\n\nKhloe Kardashian shares Valentine's snaps with True and Tatum as she reveals son's nickname for Kris Jenner\n\nAll you need is planning permission! Now Stella McCartney's £5m Highland hideaway hits a bum note with locals... again\n\nClueless? No, KT Tunstall's West End debut was child's play thanks to all those music lessons as a kid!\n\nDiddy accused of hiring trafficked underage girl for Miami sex party in a new lawsuit\n\nLeo Woodall, 28, isn't 'bothered' by toyboy label after age-gap Bridget Jones role as gives rare update on his relationship with Meghann Fahy, 34\n\nModel, 30, who has a VERY famous sister looks chic as she attends the Apple TV+ BAFTA brunch - but can YOU guess who her A-list sibling is?\n\nAndrew Le Page admits he's 'cried more than ever' as he marks the 'end of an era' after shock split from Tasha Ghouri and moves out of the home they shared\n\nStar of iconic 90s TV show who also played Marilyn Monroe is unrecognizable on rare outing in LA\n\nThe surprising career changes of iconic Noughties band revealed: From Net Zero manager and songwriters to the stars to reality TV contestants\n\nLaura Whitmore shares her final messages with Caroline Flack on the fifth anniversary of her death and confirms she won't appear in the new doco about the late TV star\n\nTOWIE's Ella Rae Wise confirms she is back together with Dan Edgar as she shares romantic Valentine's Day snaps\n\nDave Chappelle reveals SNL censored his viral monologue over two topics\n\nPamela Anderson, 57, stuns in a stylish green jumper and satin midi skirt as she arrives at BBC Studios to promote The Last Showgirl amid career resurgence\n\nBrian Cox, 78, looks dapper in a checked suit as his glam wife Nicole, 56, rocks tight pencil skirt at star-studded Baftas brunch in London\n\nKeely Hodgkinson looks incredible in a black cropped jacket as she hosts her Keely Klassic debut at Utilita Arena Birmingham\n\nToday's headlines\n\nDelta plane crashes at Toronto Pearson Airport\n\nTrump 'could withdraw US troops from Baltics and leave Europe vulnerable to Russia, European officials fear'...\n\nIncredible moment Toronto plane crash survivor films himself being rescued from upside down Delta aircraft:...\n\nRICHARD LITTLEJOHN: European leaders spat out their dummies when the US Vice President delivered that...\n\nHow to profit from WAR: the stocks to consider buying as the world re-arms, from great British companies to...\n\nThe traditional British dishes at risk of EXTINCTION - so would YOU eat these iconic meals to save them?\n\nMother-of-three has all four limbs amputated after she was 'massacred' and 'left to die' following a...\n\nThe dark side of Dubai: meet the Brits who badly regret starting new lives in the harsh Arab country - and...\n\nThe new BIONIC BREASTS set to restore sensation for millions of women after cancer surgery - and the...\n\nPictured: Mother-of-two, 43, who was shot dead outside pub on Valentine's Day 'by partner who then leapt to...\n\nKemi Badenoch blasts 'poisonous' woke ideology and the Left's 'useful idiots' as she implores conservatives...\n\nThe 'loony' Lucy Letby supporters who think the nurse is innocent are wasting their time - here's why I'm...\n\nMigrant who laughed as he stabbed 14-year-old boy to death in Austrian knife rampage 'had applied for asylum...\n\nScientists discover carb-free food that could ward off colon cancer - as cases soar in young people\n\nThe skinny influencer I saw spitting cake into a flowerpot and the A-listers who barely even LOOK at food:...\n\nIconic '80s heartthrob who is still a beloved TV star is pictured in rare yearbook photos... can you guess...\n\nMoment foul-mouthed boater rampages through summer regatta being held on the River Thames raging 'You don't...\n\nKate Middleton reveals Prince George's incredible portrait of her leaving fans in awe at his artistic...\n\nWho won Love Island All Stars 2025? Gabby Allen and Casey O'Gorman are crowned WINNERS following his third...\n\nKeir Starmer calls for the US to act as a 'backstop' to deter Russia from attacking Ukraine - as he repeats...\n\nPete Wicks' pals insist he didn't cheat on Maura Higgins despite her claims as they reveal the 'truth'...\n\nIncredible comeback of Harvey Weinstein's British wife: Georgina Chapman regains her crown as queen of the...\n\nWhich nations ARE pulling their weight in NATO... and who is relying on 'Uncle Sucker' to protect them?...\n\nBianca Censori's lookalike sister Angelina puts on a very busty display in a racy cutout bodysuit as she...\n\nRoad rage driver, 20, who rammed 'showboating' e-bike rider, 22, and sent him flying into a concrete post to...\n\nI'm a trans Barbie and my boyfriend isn't gay - we're going to have a family together\n\nKerry Katona said she loved me but dumped me the day of The Vivienne's funeral: Chef Jameson Stocks reveals...\n\nWoman claiming to be Madeleine McCann releases 'bombshell new DNA test results' - 18 years after the British...\n\nArchbishop's bold message to Elon Musk about having 13 kids by four women after Ashley St. Clair's bombshell...\n\nTragic last words of man who suffered 'worst death imaginable' after he went to explore notorious cave\n\nIvanka Trump admits making parents proud should NOT matter after stepping away from dad Donald's...\n\nJay-Z and Beyonce seen for first time since his teen rape case with Diddy was dropped\n\nChinese scientists identify food ingredient they say could reverse some autism symptoms\n\nKiller disease that leads to paralysis and brain swelling confirmed in Britain - it's caused by parasites...\n\nWhy Elon Musk's 'baby mama' Ashley St. Clair chose to go public about their secret love child\n\nEx-astronaut: 'City-killing' asteroid that could hit Earth in 2032 would cause unimaginable destruction\n\nKevin Costner's reaction to Ryan Reynolds' Justin Baldoni joke on SNL50: Anniversary goes viral\n\nBody language expert breaks down Blake Lively and Ryan Reynolds' 'awkward and stiff' SNL appearance as she...\n\nER doctors reveal most common sex injuries... and the position that causes the most accidents\n\nWhere DOES our billions of pounds in aid spending go? See where UK cash is being spent - including on shrimp...\n\nBeloved BBC presenter quits after ten years on show as she receives devastating Alzheimer's diagnosis -...\n\nInside the tumultuous love life of Corrie's Kym Marsh, 48, including three failed marriages as she 'splits...\n\nRevealed: The most expensive substance on Earth which costs $62,000,000,000,000 for one gram\n\nSex expert shares warning to Brits into 'Vorarephilia' - the bizarre fetish on the rise in the UK\n\nTop longevity doctor reveals sign in your fingernail that could tell you how long you'll live\n\n'I'd kill him' seethes Will Mellor as he learns about horrific rape of 16-year-old girl at the hands of a...\n\nPatrick Schwarzenegger breaks silence over nude scene in The White Lotus with very crude remark\n\nLalisa Manobel is the darling of Gen Z, in the world's biggest girl band and has 105M Insta followers... but...\n\nActress from The White Lotus got caught up in Blake Lively drama while she was still filming hit show\n\nKEMI BADENOCH: We need to fight for our values now or Western civilisation will be lost\n\nMORE HEADLINES\n\nWoman claiming to be Madeleine McCann releases 'bombshell new DNA test results' - 18 years after the British toddler disappeared in Portugal\n\nPictured: Mother-of-two, 43, who was shot dead outside pub on Valentine's Day 'by partner who then leapt to his death off bridge' - as chilling video shows moment killer struck\n\nEngland and Wales's most dangerous streets: Map of 37,000 neighbourhoods lays bare hotspots for violent and sexual offences... so how crime-ridden is YOUR district?\n\nDelta plane crashes at Toronto Pearson Airport\n\nMother-of-three has all four limbs amputated after she was 'massacred' and 'left to die' following a voluntary abortion - now doctors face court\n\nTragic last words of man who suffered 'worst death imaginable' after he went to explore notorious cave\n\nHeartbroken family of British father, 37, who was 'left to die alone in Las Vegas' are SUING the hotel he died in and the ambulance company\n\nMoment mother-of-two is gunned down outside pub on Valentine's Day by man 'known to her' with three gun shots heard on CCTV\n\nRevealed: Eight claims Prince Harry and Meghan Markle made in their explosive Oprah interview - and how they stack up four years on\n\nTrump 'could withdraw US troops from Baltics and leave Europe vulnerable to Russia, European officials fear' - as report claims peace plan 'would see Ukraine forced into extraordinary financial reparations'\n\nThe dark side of Dubai: meet the Brits who badly regret starting new lives in the harsh Arab country - and why so many of them are desperate to come back...\n\nWhere DOES our billions of pounds in aid spending go? See where UK cash is being spent - including on shrimp farms in Bangladesh - as PM insists money can help stop wars, climate change and illegal migration\n\nTrump's deal with the devil? As Starmer vows to send British peacekeepers to Ukraine, what a truce could look like - from Zelensky's future to mineral reserves\n\nDon't let Ukraine become another disaster like Afghanistan: Starmer's warning to Trump as he vows to send in UK troops... and US begins talks with Russia in Saudi Arabia\n\nWhich nations ARE pulling their weight in NATO... and who is relying on 'Uncle Sucker' to protect them? Graphic illustrates who is spending on military amid fears Trump could pull out of alliance\n\nNoel Fielding smiles as he is spotted for the first time since he mysteriously quit filming his Apple TV show due to an unknown 'health reason'\n\nMoment foul-mouthed boater rampages through summer regatta being held on the River Thames raging 'You don't own the f****** water!'\n\nEveryday gadget could be making you go deaf and it's nothing to do with the volume, experts warn\n\nDon't let Ukraine become another disaster like Afghanistan: Starmer's warning to Trump as he vows to send in UK troops... and US begins talks with Russia in Saudi Arabia\n\nX Factor singer is murdered after terrifying kidnap ordeal\n\nNetflix star Kim Sae-Ron's cause of death revealed after actress was found in her home aged 24\n\nUkraine RECAP: Keir Starmer makes plea to Donald Trump after European leaders meet in Paris for emergency summit\n\nNine in ten British workers made to come back into the office as WFH era dies off... although 'feet-up Fridays' are STILL going strong\n\nTom Hanks blasted for 'racist and disgusting' portrayal of MAGA supporter on star-studded SNL 50\n\nHall of shame of the Blue Badge abusers: Parking cheats who used dead friend's pass, displayed stolen badges or insisted they found them lying in street are brought to justice\n\nThe terrifying Tesco Clubcard plot: Shocking way 'brilliant' criminal demanding £250,000 used new loyalty scheme 30 years ago to blackmail supermarket - before police talked to him via newspaper adverts\n\nCouple spend £300,000 turning 'very smelly' public lavatory into their dream sea front home\n\nThe 'loony' Lucy Letby supporters who think the nurse is innocent are wasting their time - here's why I'm convinced she's guilty: CHRISTOPHER SNOWDON\n\nIncredible moment Toronto plane crash survivor films himself being rescued from upside down Delta aircraft: Live updates\n\nRoad rage driver, 20, who rammed 'showboating' e-bike rider, 22, and sent him flying into a concrete post to 'teach him a lesson' is found guilty of murder\n\nMulti-millionaire business tycoon blasted by environmentalists after his unauthorised cliff top summer house damages clifftop\n\nI might be 67 but women still want to sleep with me... because I'm an expert in serial killers, reveals criminologist David Wilson\n\nWhy Elon Musk's 'baby mama' Ashley St. Clair chose to go public about their secret love child\n\nCouncil tax is increasingly resembling 'the dreaded poll tax' with the poorest households feeling the pinch the most, report warns\n\nMOST READ IN DETAIL\n\nNEW ARTICLESHomeTop\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based sit","summary":"The model, 34, looked typically stylish in a plunging black jumpsuit and oversized sunglasses as she pushed her 22-month-old daughter in her stroller.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14406731/Daisy-Lowe-doting-mother-takes-baby-daughter-Ivy-22-months-father-Gavin-Rossdale-fianc-Jordan-Saul-Farmers-Market-Los-Angeles.html","image":"https://i.dailymail.co.uk/1s/2025/02/17/21/95306185-0-image-m-8_1739827692705.jpg","video":"https://videos.dailymail.co.uk/video/mol/2021/10/30/8128742599398768225/1024x576_MP4_8128742599398768225.mp4","publish_date":"2025-02-17 22:57:19","author":"Editor,Milly Veitch","authors":["Editor","Milly Veitch"],"language":"en","source_country":"GB","sentiment":-0.02},{"id":291558480,"title":"Gov. Ron DeSantis’ former chief of staff James Uthmeier sworn in as Florida’s attorney general","text":"Gov. Ron DeSantis on Monday named his former chief of staff, James Uthmeier as Florida’s attorney general, handing the state’s top law enforcement role to a trusted aide who has helped orchestrate and defend some of his most divisive initiatives.\n\nUthmeier was sworn in Monday during a ceremony in Tallahassee. The 37-year-old becomes one of the youngest state attorneys general and the latest person to benefit from the political shuffle sparked by President Donald Trump ’s drafting of Sunshine State Republicans for his new administration. Uthmeier is poised to spearhead Florida’s legal battles to bolster Trump’s sweeping conservative agenda, at a time when the state’s leaders are eager to pass new laws and challenge legal precedent to demonstrate their allegiance to the president.\n\nUthmeier succeeds former Attorney General Ashley Moody, whom the governor tapped to fill the U.S. Senate seat of Marco Rubio, Trump’s pick to be U.S. secretary of state.\n\nDeSantis said Uthmeier was a “bulldog in our administration” who will not shy away from a difficult fight. The Republican governor praised Uthmeier’s work in his administration, including fighting federal mandates during the COVID-19 pandemic and combating diversity, equity and inclusion programs in higher education.\n\n“All throughout our administration, James was always digging in and fighting for what was right even when it wasn’t easy,” DeSantis said during the ceremony.\n\nUthmeier in his remarks promised to “endeavor every day to do what is right and to levy justice where it is due.”\n\n“We will champion an America-first agenda, and we will fight back against the cartels, the gangs, and the traffickers that have wreaked havoc on our country for far too long,” Uthmeier said. “We will not stand idly by as the left tries to infiltrate our institutions and use the court system to indoctrinate our kids. We will fight the activists that try to weaken our duly enacted laws that try to challenge our constitutional order and that try to harm the unborn.”\n\nSpeaking to the Yale Federalist Society earlier this month, DeSantis suggested Uthmeier could pursue state charges against Dr. Anthony Fauci. Before leaving office, President Joe Biden pardoned Fauci — the former director of the National Institute of Allergy and Infectious Diseases — to guard against potential “revenge” by the new Trump administration for his actions during the COVID-19 pandemic.\n\nHe started at the governor’s office as deputy general counsel in 2019 and was promoted to general counsel the following year.\n\nIn 2021, Uthmeier became chief of staff, but took a leave of absence in 2023 to manage DeSantis’ unsuccessful bid for the Republican presidential nomination. DeSantis bowed out after losing to Trump in the Iowa caucuses by 30 percentage points and Uthmeier returned to his chief of staff role.\n\nUthmeier grew up in the beach resort town of Destin, Florida, and attended the University of Florida, where he earned a bachelor’s degree in business administration and political science, and a master’s degree in international business.\n\nAfter graduating from Georgetown Law School in 2014, he spent years in Washington, where he interned as a law clerk in Rubio’s office. He worked as an associate at Jones Day, a major law firm, before joining the Trump administration in 2017, where he served as a senior adviser to then-Commerce Secretary Wilbur Ross.\n\nFor the past six years, Uthmeier has helped orchestrate and defend some of the governor’s most controversial and legally questionable initiatives, including a state-funded effort to fly about 50 migrants from Texas to Martha’s Vineyard, Massachusetts. Uthmeier also chaired two political committees — Keep Florida Clean and the Florida Freedom Fund — that raised more than $1 million to oppose measures on the 2024 ballot that would have expanded abortion rights and legalized recreational marijuana.\n\nA majority of Florida voters backed the proposals, but the initiatives failed to clear the 60% threshold needed to pass after DeSantis’ office used state money and his considerable influence to oppose them.\n\nThe state’s Attorney General’s Office has a record of defending the conservative agendas of DeSantis and Trump. Moody spent months arguing to keep the abortion rights and recreational marijuana proposals off the 2024 ballot in Florida and was one of the Republican attorneys generals who joined a lawsuit asking the Supreme Court to overturn Biden’s election victory in the 2020.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"Gov. Ron DeSantis on Monday named his former chief of staff, James Uthmeier as Florida’s attorney general, handing the state’s top law enforcement role to...","url":"https://wsvn.com/news/local/florida/gov-ron-desantis-former-chief-of-staff-james-uthmeier-sworn-in-as-floridas-attorney-general/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/02/021725-FL-AG-James-Uthmeier.png","video":null,"publish_date":"2025-02-17 22:53:56","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.017}]}