{"offset":0,"number":50,"available":17862,"news":[{"id":298178776,"title":"Robin Roberts and Michael Strahan receive backlash amid GMA layoffs","text":"A shakeup affected many people at Good Morning America and GMA3, and George Stephanopoulos, Robin Roberts, and Michael Strahan have some individuals furious at them for what occurred.\n\nThe latest rumors arrived after a report hit last week that ABC News would lay off dozens of staffers from GMA and GMA3.\n\nThe same report revealed that ABC’s two programs would merge into one production unit.\n\nABC News is reportedly looking to improve overall numbers as traditional television is declining, and online media has become the norm for individuals to view content.\n\nThere was no mention that Robin, Michael, or George were affected by the recent layoffs or changes beyond losing personnel who assisted with making the show happen.\n\nHowever, an insider claims that many people are upset with the trio of GMA anchors because of their salaries.\n\nAn insider revealed there’s ‘a lot of resentment’ towards GMA stars\n\nAccording to The U.S. Sun, an inside source claims that individuals are angry with Robin, Michael, and George for their hefty salaries at ABC News’ GMA.\n\n“There is a lot of resentment that all these employees are losing their jobs making $100,000 or $150,000 a year, but Robin is making $20 million, Michael is making $17 million, and George, who gets sued for $15 million, still gets his $18 million salary,” the insider said, adding, “People think it’s just not fair.”\n\nABC settled a lawsuit in 2024 with then President-elect Donald Trump over remarks George made on the air claiming Trump was found liable for raping writer E. Jean Carroll.\n\nHowever, Trump was found liable for sexually abusing and defaming Carroll. According to NPR, ABC settled their lawsuit for $15 million.\n\n“The people at the bottom are getting hit the worst, it might seem illogical but people think maybe the big talent should take the pay cut instead,” The U.S. Sun’s inside source shared.\n\nRobin and Michael’s former co-stars were also blamed for ruining GMA3\n\nIn another bout of rumors, former ABC News co-stars Amy Robach and T.J. Holmes received backlash for ruining GMA3. The duo co-hosted the program for several years, following versions of the show with Michael and Sara Haines as co-hosts.\n\nAccording to another insider, ABC has been unable to find a co-hosting duo for GMA3 that matches Amy and T.J.’s charisma.\n\n“Amy and T.J. got let go for being selfish two years ago, and now the rest of us are being fired in the fallout,” the insider said, adding, “They’ve ruined it for everyone else, and now the whole staff is gone.”\n\nBeginning in March 2020, Amy hosted Pandemic: What You Need to Know on ABC, with Dr. Jennifer Ashton also part of the afternoon program. T.J. became Amy’s co-anchor in September 2020. \n\nWhile Amy and T.J. were popular with viewers, drama hit the couple and the network when a media outlet revealed their private relationship. At the time, some deemed it was an extra-marital affair.\n\nABC News temporarily placed Amy and T.J. on leave in early December 2022. By January 2023, it was announced that they were officially departing ABC News.\n\nThe couple currently hosts their Amy and T.J. podcast on iHeartRadio, discussing various topics, including their former employer and colleagues. DeMarco Morgan and Eva Pilgrim host the latest edition of GMA3.","summary":"A shakeup affected many people at Good Morning America and GMA3, and George Stephanopoulos, Robin Roberts, and Michael Strahan have some individuals furious at them for what occurred. The latest rumors arrived after a report hit last week that ABC News would lay off dozens of staffers from GMA and GMA3. The same report revealed","url":"https://www.monstersandcritics.com/tv/robin-roberts-and-michael-strahan-receive-backlash-amid-gma-layoffs/","image":"https://www.monstersandcritics.com/wp-content/uploads/2025/03/robin-roberts-michael-strahan-have-some-furious-layoffs-gma.jpg","video":null,"publish_date":"2025-03-09 00:59:49","author":"Matt Couden","authors":["Matt Couden"],"language":"en","source_country":"us","sentiment":-0.227},{"id":298178758,"title":"'I don't feel so special any more': Trump's sulky strop over King Charles' public love-in with Zelensky at Sandringham - days after Monarch invited US president for second state visit","text":"EXCLUSIVE'I don't feel so special any more': Trump's sulky strop over King Charles' public love-in with Zelensky at Sandringham - days after Monarch invited US president for second state visit\n\nPODCAST: Trump’s tariff whiplash, Trudeau’s tears, and Hunter Biden’s ‘sugar brother’ – on the latest episode of Welcome to MAGAland\n\nLISTEN: Trump, Zelensky, the rise of Europe’s Far Right and what’s next for NATO – listen to Alas Vine & Hitchens wherever you get your podcasts..\n\nBy GLEN OWEN\n\nPublished: 00:31 GMT, 9 March 2025 | Updated: 00:50 GMT, 9 March 2025\n\nDonald Trump has 'gone cool' on Britain since King Charles welcomed Volodymyr Zelensky to Sandringham, diplomatic sources in Washington have claimed.\n\nAllies of the US President have made clear to UK officials in America that pictures of the King with the Ukranian leader made him feel 'less special' about the monarch's invitation for a state visit to Britain.\n\nIn response, the Trump allies were told that it would have been inappropriate for the Government to 'direct' the King not to meet Mr Zelensky.\n\nThe King met Mr Zelensky last Sunday, just days after Sir Keir Starmer had presented Mr Trump with an invitation from Charles to fly to London for an official visit.\n\nThe overt show of solidarity came in the immediate aftermath of the row in the Oval Office between Mr Zelensky and Mr Trump, in which the US President ganged up with Vice-President JD Vance to berate him for his supposed lack of respect and gratitude for American help.\n\nThen, on Monday, Charles also welcomed Canada's prime minister Justin Trudeau to Sandringham – at a time when Mr Trudeau is reeling from Mr Trump's announcement of 25 per cent tariffs on imports from his country.\n\nLast night, No 10 said that it 'did not recognise' the claims that Mr Trump was sulking over the meetings, but a well-placed source said: 'Things definitely went a bit cool in Washington after Sandringham. We told them that the King makes his own decisions about who he meets'.\n\nMr Zelensky flew to Charles' Norfolk home in a military helicopter after attending a defence summit with European leaders hosted by the Prime Minister. \n\nThe overt show of solidarity came in the immediate aftermath of the row in the Oval Office between Mr Zelensky and Mr Trump, in which the US President ganged up with Vice-President JD Vance to berate him for his supposed lack of respect and gratitude for American help\n\nThe King met Mr Zelensky last Sunday, just days after Sir Keir Starmer had presented Mr Trump with an invitation from Charles to fly to London for an official visit\n\nThe pair had met previously during Mr Zelensky's visit to the UK in February 2023, when the King told him 'we've all been worried about you and thinking about your country for so long'\n\nPresident Trump previously met the now-monarch when he was Prince of Wales (pictured in 2019) \n\nTrump says he trusts 'generous' Putin and slams 'difficult' Zelensky\n\nWhitehall sources were at pains to stress that the royal meeting was not a reaction to the Oval Office bust-up, insisting that it had been in the works for a while.\n\nThe pair had met previously during Mr Zelensky's visit to the UK in February 2023, when the King told him 'we've all been worried about you and thinking about your country for so long'.\n\nNo 10 sources denied that Sandringham had caused tensions, saying that the Prime Minister had spoken to Mr Trump on Monday – the US President likes to call him directly on his mobile – and there had been 'positive engagement' between the two leaders.\n\nPresident Trump had hailed Charles as a 'wonderful man' when Sir Keir handed him the official invitation in the White House. \n\nSir Keir's handling of the Ukraine crisis was yesterday praised by former Tory defence secretary Ben Wallace, who said: 'I've seen good leadership from both Keir Starmer and [French] president Macron on this and they should both be congratulated.'\n\nSir Ben said that Mr Trump's decision to suspend US intelligence sharing with Kyiv was 'suffocating' Ukrainian hope of holding out against Russian aggression, and the Prime Minister should be 'working out what the Americans have switched off, and finding European sources, or even further afield, to replace it'.\n\nHe added: 'Hope is the most important thing in this type of conflict and, at the moment, Donald Trump is suffocating the hope that Putin can be either fought to a standstill or indeed brought to the table. \n\n'Hope is always the key for both morale and a military campaign. When this started three years ago, I remember gathering the military officials in my then department, and saying on day one, we have to give the Ukrainians hope. If a Russian truck has a puncture, we need to let people know. If the Russians have a small defeat, we need to let the Ukrainian people know.'\n\nDonald Trump has 'gone cool' on Britain since King Charles welcomed Volodymyr Zelensky to Sandringham, diplomatic sources in Washington have claimed (pictured with Sir Keir Starmer)\n\nThe Ukrainian leader and US President came to blows in front of the world's media \n\nPresident Donald Trump and Ukrainian President Volodymyr Zelensky met at the White House to sign a mineral rights agreement\n\nA Government spokesman said: 'We do not recognise these reports. We have been unequivocal about the importance of the US as an ally of the UK.\n\n'No two countries are as closely aligned as ours on economic, defence, security and intelligence interests, and we share deep historic and cultural ties.\n\n'We will continue to work hand-in-hand and look forward to welcoming President Trump.'\n\nYesterday Russia pounded Ukraine with another drone blitz. The attacks left 25 dead and, said Kyiv, demonstrated that the Kremlin's war goals are unchanged despite pressure from the US to resolve the conflict.\n\nIn the worst aerial assault 11 people died and 40 were wounded in Dobropillia in eastern Donetsk.\n\nPolish prime minister Donald Tusk said this is 'what happens when someone appeases barbarians', adding that it results in 'more bombs, more aggression'.\n\nDonald TrumpVolodymyr ZelenskyKeir Starmer\n\nShare or comment on this article:\n'I don't feel so special any more': Trump's sulky strop over King Charles' public love-in with Zelensky at Sandringham - days after Monarch invited US president for second state visit\n\nAdd comment","summary":"Pictures of the King with Ukranian leader Volodymyr Zelensky made President Trump feel 'less special' about the monarch's invitation for a state visit to Britain, handed to him by Sir Keir Starmer last week.","url":"https://www.dailymail.co.uk/news/article-14477429/Trump-King-Charles-Zelensky-Sandringham.html","image":"https://i.dailymail.co.uk/1s/2025/03/09/00/95992427-0-image-m-30_1741479038518.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/06/90856379822128/1024x576_MP4_90856379822128.mp4","publish_date":"2025-03-09 00:50:33","author":"Editor,Glen Owen","authors":["Editor","Glen Owen"],"language":"en","source_country":"gb","sentiment":-0.094},{"id":298176644,"title":"NASS: The nauseating Akpabio/Akpoti mess","text":"IT is extremely worrisome that some harebrained characters at the National Assembly have become accustomed to scandals and profligate lifestyles. Nothing seems to bother the degenerate lawmakers except when their selfish interests are breached. That is why they appear to have more time for frivolities than the reason for which they were elected.\n\nCurrently, the major thing on their table is not governance but the sexual harassment allegations against the Senate President, Godswill Akpabio, by the lawmaker representing Kogi Central Senatorial District, Natasha Akpoti-Uduaghan.\n\nThe face-off escalated Thursday when the Senate punished the Senate President’s accuser with a six-month suspension. During the suspension, she will not have her salary and security aides. She must not step into her office or be seen within the precincts of the NASS. This is high-handed and one-sided. The Senate is a parliament, not a court of law. Akpabio cannot be a judge in his case; that is unjust. That means Akpoti-Uduaghan’s constituents will not be represented for six months.\n\nIt is concerning that every time a lawmaker makes an allegation in the NASS, the standard practice is to punish the lawmaker concerned heavily.\n\nThe current rift blew open when Akpabio changed Akpoti-Uduaghan’s sitting position during plenary on February 20, 2025. This did not go down well with Akpoti-Uduaghan, who protested the change and accused Akpabio of abusing his office and obstructing her legislative duties.\n\nAkpoti-Uduaghan and Akpabio’s wife, Unoma, have gone to court to sort themselves out. Mrs Akpabio, who described her husband as a disciplined man who respects women, seeks, among other things, N250bn in compensation and a perpetual injunction to stop Akpoti-Uduaghan from making further damaging claims.\n\nOn her part. Akpoti-Uduaghan had earlier slammed a N100bn lawsuit against Akpabio and his senior legislative aide, Mfon Patrick, who had published a post on his Facebook page accusing the woman of thinking that being a senator was all about wearing make-up and transparent outfits to the chamber.\n\nCoincidentally, the former acting Managing Director of the Niger Delta Development Commission, Joy Nunieh, had similarly accused Akpabio of sexual harassment in 2020. The Senate President, who was the then Minister of Niger Delta Affairs, denied the allegation. He has also rejected the present accusation.\n\nAs the Senate continues to dance naked over the Akpabio/Akpoti-Uduaghan feud, the question remains, what are the values of Nigerian lawmakers? How have they contributed to improving the quality of life of Nigerians?\n\nThe current 10th NASS may have passed some bills since its inauguration in June 2023, but the major sensitive ones remain pending. They include the Tax Reform Bills, Constitution Reform Bills, and the Electoral Act Bill. Also pending is the National Ranches Commission Bill which aims to establish ranches for herders within their states of origin, and mandates that all cattle movements be carried out by vehicular means only.\n\nRather than focus squarely on their legislative duties, the Akpabio-led leadership of the NASS has turned the hallowed red chamber into a house of comedy and ostentation.\n\nFresh media reports indicate that the Senate President and Tajudeen Abass, the Speaker of the House of Representatives, travel in an 11-vehicle convoy each.\n\nThese vehicles reportedly include two bulletproof 2021 Mercedes-Benz S-Class models valued at N306m per unit, five Toyota Land Cruisers valued at N375m, two Toyota Hilux, one Hilux, one ambulance and three police power bikes. The Speaker reportedly has the same number of vehicles in his convoy.\n\nIn a country described as the global poverty capital, this is utterly senseless.\n\nThe Deputy Senate President, Barau Jibrin, and the Deputy Speaker, Benjamin Kalu, also allegedly move around in a convoy of nine-vehicle fleets. The vehicle fleets of Akpabio and Abass and those of their deputies reportedly cost over N7bn.\n\nThis is outside the N57.6bn cost of procuring SUVs for lawmakers in 2023. This profligacy is insensitive, and a violation of the constitution.\n\nThese shenanigans did not start with the 10th NASS. In 2013, The Economist of London described the lawmakers as the highest-paid in the world. By GDP, Nigeria ranked sixth in Africa and 41st in the world in 2023. So, it is financially illogical to remunerate lawmakers so handsomely. \n\nIn 2018, former Senator Shehu Sani revealed that each senator earned a monthly running cost of N13.5m in addition to the N750,000 the RMAFC prescribed per month. The senator representing Kano South Senatorial District, Kawu Sumaila, said last year that though his monthly salary was less than N1m, a Nigerian senator receives N21m as running costs monthly.\n\nMeanwhile, millions of Nigerians do not know where their next meal will come from. At least 67 citizens were trampled to death while scrambling for food palliatives in some parts of the country late last year.\n\nExperts estimate that about 40 per cent of Nigerian children under five suffer from stunted growth, 8.0 per cent are wasted annually and 27 per cent are underweight. In 2020, the Chairman of the Board of Trustees of the Nutrition Society of Nigeria and Emir of Kano, Muhammadu Sanusi II, said Nigeria recorded the highest number of stunted children in Africa and that malnutrition accounted for 53 per cent of deaths among children.\n\nThe minimum wage was increased from N30,000 to N70,000 in 2024. Many state governments have yet to pay it. The N77,000 promised to the National Youth Service Corps members is yet to be paid months after it was approved in July. To compound the situation, kidnappers have made life unbearable for many Nigerians.\n\nThe senators do not seem to bother about these critical issues, including education and health, because they are not their priorities. What bothers them the most is what goes into their pockets.\n\nOftentimes, they allegedly demand bribes either to carry out their oversight functions or to approve some ministerial nominations.\n\nSometimes, they mutilate or pad the federal budget to accommodate their selfish interests. Last year, Abdul Ningi, representing Bauchi Central Senatorial District, alleged that the 2024 budget was padded to the tune of N3.7tn.\n\nThe Senate leadership denied the allegation and suspended Ningi despite the observation by a civic no-profit organisation, BudgIT, that there was no detailed allocation for the N3.7tn in the 2024 budget.\n\nThis is not how the legislature in advanced democracies operates. In the United Kingdom, the Prime Minister cannot misbehave because the lawmakers are there to check his excesses.\n\nIn 2013, the UK’s Independent Parliamentary Standards Authority planned to raise MPs’ pay. The lawmakers themselves vowed to fight the plan.\n\nIn the United States, Congress impeached Donald Trump twice during his first tenure as President. It happened to be the largest bipartisan impeachment vote in US history.\n\nNigeria’s liberation day will come when citizens rise and insist on reform of the political system, including reducing the bloated legislature.\n\nThere is no justification for keeping many of the lawmakers. Most contribute little to quality debates and other issues in the chambers.\n\nThere is only one House of Assembly at the state level. This can be replicated at the federal level.\n\nSome concerned Nigerians have suggested that lawmaking should be made a part-time business.\n\nThe salaries and allowances of lawmakers should be reduced. This will help to reduce the cost of governance.\n\nOne reason for the debauchery at the highest level of governance in Nigeria is that the characters in the parliament have too much access to cash. It is against anything that is sensible and must stop.","summary":"IT is extremely worrisome that some harebrained characters at the National Assembly have become accustomed to scandals and profligate lifestyles. Nothing seems to bother the degenerate lawmakers except when their selfish interests are breached. That is why they appear to have more time for frivolities than the reason for which they were elected. Currently, the \n\n\n \n Read More","url":"https://punchng.com/nass-the-nauseating-akpabio-akpoti-mess/","image":"https://cdn.punchng.com/wp-content/uploads/2025/03/01212019/Senator-Natasha-Akpoti-Uduaghan-and-Akpabio.jpg","video":null,"publish_date":"2025-03-09 00:38:46","author":"Punch Editorial Board","authors":["Punch Editorial Board"],"language":"en","source_country":"ng","sentiment":-0.259},{"id":298178228,"title":"Trump Pulled $400 Million From Columbia. Other Schools Could Be Next.","text":"The Trump administration's abrupt withdrawal of $400 million in federal funding from Columbia University, in New York City, cast a pall over at least nine other campuses worried they could be next.\n\nThe schools, a mix that includes both public universities and Ivy League institutions, have been placed on an official administration list of schools that the Department of Justice said may have failed to protect Jewish students and faculty.\n\nFaculty leaders at many of the schools have pushed back strongly against claims that their campuses are hotbeds of antisemitism, noting that although some Jewish students complained that they felt unsafe, the vast majority of protesters were peaceful and many of the protest participants were Jewish.\n\nThe Trump administration has made targeting higher education a priority. This past week, President Donald Trump threatened in a social media post to punish any school that permits \"illegal\" protests. On Jan. 30, he signed an executive order on combating antisemitism, focusing on what he called anti-Jewish racism at \"leftists\" universities. Then, on Feb. 3, he announced the creation of a multiagency task force to carry out the mandate.\n\nThe task force appeared to move into action quickly after a pro-Palestinian sit-in and protest at Barnard College, a partner school to Columbia, led to arrests Feb. 26. Two days later, the administration released its list of 10 schools under scrutiny, including Columbia, the site of large pro-Palestinian encampments last year.\n\nIt said it would be paying the schools a visit, part of a review process to consider \"whether remedial action is warranted.\" Then on Friday, it announced it would be canceling millions of dollars in grants and contracts with Columbia.\n\nHarvard University, whose former president, Claudine Gay, resigned last year after a bruising appearance before a House committee, is also on the list.\n\nSo are George Washington University; Johns Hopkins University; New York University; Northwestern University; UCLA; the University of California, Berkeley; the University of Minnesota; and the University of Southern California.\n\nThe Trump administration's moves to hobble university funding and target schools over claims that they tolerated antisemitism had already caused internal recalibration at schools across the country. Some have stepped up lobbying efforts, including hiring lobbyists with connections to Trump.\n\nMany campuses had already cracked down on students over protest activity. More are dialing back or renaming efforts related to diversity, an effort to avoid the ire of Trump officials who have vowed to end such programs\n\nAnd a number have paused hiring and reduced the number of doctoral students admitted in response to the financial uncertainty.\n\nSome school officials have said they face an \"existential threat.\" Still, many presidents have been silent or muted in their public statements about Trump's moves against the sector, appearing to retreat in fear of the new administration.\n\nIn a statement Saturday, Harvard said it was \"committed to ensuring our Jewish community is embraced, respected, and can thrive at Harvard, and to our efforts to confront antisemitism and all forms of hate.\"\n\nSeveral days after Trump's inauguration, the president, Dr. Alan Garber, posted a message to the university cowritten with other administration leaders.\n\n\"In these challenging times,\" they wrote, \"our efforts will be guided by our values and commitments: supporting academic excellence and the pursuit of knowledge; championing open inquiry, constructive dialogue, and academic freedom.\"\n\nThe selection criteria for being on the list for visits is nebulous, but a number of the schools had been included in a report in October by the House Committee on Education and the Work Force, which claimed they had allowed antisemitic behavior by students and faculty.\n\nThe report criticized Harvard leaders, citing their initial failure to condemn the Hamas attack on Israel in October 2023.\n\nNorthwestern and its president, Michael Schill, also had been under attack by the House committee, then led by Rep. Virginia Foxx, R-N.C. The committee report criticized the university for placing \"radical anti-Israel faculty\" in charge of negotiations with protesters.\n\nUC Berkeley was identified in the House report for not disciplining students who took part in an encampment or disrupted a talk by an Israeli speaker.\n\nUC Berkeley issued a statement Saturday saying, \"We are confident we have the right processes in place now to respond to any antisemitic incidents.\" The statement cited an advisory committee the chancellor formed on Jewish student life and campus antisemitism.\n\nWhile several of the schools have been focal points for campus protests, others are more of a surprise.\n\nRichard Painter, a professor of law at Minnesota, was among those who filed a complaint about antisemitism at the university. He had chafed at incidents on campus, including anti-Israeli statements posted by faculty on official department websites.\n\n(BEGIN OPTIONAL TRIM.)\n\nEven so, Painter, a former White House ethics lawyer during the George W. Bush administration, wondered if the school was targeted partly because it sits in the congressional district of Rep. Ilhan Omar, D-Minn., a vocal critic of both Israel and Trump's, and in the home state of Gov. Tim Walz, who ran on the ticket with former Vice President Kamala Harris.\n\n\"Part of it is political,\" he said in an interview Saturday.\n\n(END OPTIONAL TRIM.)\n\nOfficials at Minnesota could not be reached for comment, but efforts are already underway to address the complaints. The Board of Regents is expected to vote Friday on a resolution prohibiting individual departments from making political statements on issues of the day.\n\nThere was evidence suggesting that the administration's action against Columbia was accelerated by last month's sit-in at Barnard, which led to additional protests recently. The protests were sparked by Barnard's decision to expel two students who interrupted a class on Israel.\n\nOn Monday, six days after the initial Barnard disturbance, the government sent a notice to Columbia that it would review $51 million in federal contracts, citing harassment of Jewish students.\n\nThe next day, Trump released a statement on Truth Social saying, in part, \"All Federal Funding will STOP for any College, School, or University that allows illegal protests.\"\n\n(STORY CAN END HERE. OPTIONAL MATERIAL FOLLOWS.)\n\nIn a news release Friday announcing the cancellation of $400 million in grants and contracts, the task force also accused Columbia of failing to respond to the earlier notice while antisemitic harassment continued on or near campus.\n\nOn Friday, Columbia said it was reviewing the administration's announcement and that it pledged to work with the government.\n\nAlso on Friday, Linda McMahon, the newly installed secretary of education, met with Columbia's interim president, Dr. Katrina Armstrong. McMahon issued a statement saying that schools \"must comply with all federal anti-discrimination laws\" to receive federal funding.\n\nThe task force's list was released in late February amid a flurry of executive orders from the White House.\n\nMembers of the task force include Leo Terrell, a senior Justice Department lawyer. Efforts to reach Terrell were not successful Saturday. It was also unclear if any of the campus visits had been scheduled.\n\nThis article originally appeared in The New York Times.","summary":"The Trump administration's abrupt withdrawal of $400 million in federal funding from Columbia University, in New York City, cast a pall over at least nine other campuses worried they could be next.","url":"https://www.berkshireeagle.com/nyt/trump-pulled-400-million-from-columbia-other-schools-could-be-next/article_a519bb4c-a2bb-574c-9717-6bbb686b00d8.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-09 00:25:02","author":"North Adams Pride,Stephanie Saul","authors":["North Adams Pride","Stephanie Saul"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":298175742,"title":"Donald Trump's wild social media outburst after rumors about brutal Musk-Rubio fight spilled out","text":"BREAKING NEWSDonald Trump's wild social media outburst after rumors about brutal Musk-Rubio fight spilled out\n\nPODCAST: Trump’s tariff whiplash, Trudeau’s tears, and Hunter Biden’s ‘sugar brother’ – on the latest episode of Welcome to MAGAland\n\nBy SARAH EWALL-WICE and NIC WHITE FOR DAILYMAIL.COM\n\nPublished: 23:44 GMT, 8 March 2025 | Updated: 00:24 GMT, 9 March 2025\n\nDonald Trump insists his 'First Buddy' Elon Musk and Secretary of State Marco Rubio get on fine, despite their huge blowup in the Oval Office.\n\nThe world's richest man berated Rubio as they sat across a conference table, accusing him of not firing enough State Department workers.\n\nMusk then 'scornfully' added perhaps the only person Rubio got rid of was a DOGE staff member, five witnesses told the New York Times.\n\nBut Rubio did not sit back in the meeting and just take it, instead accusing Musk of not being truthful. \n\nThe top Cabinet member asked whether the 1,500 State Department officials who took early retirement buyouts counted as layoffs. \n\nHe 'sarcastically' questioned if Musk wanted him to rehire them so he could fire them again, the NYT reported.\n\nTrump didn't deny the NYT version of events in a social media outburst on Saturday evening, other than to insist the pair weren't at odds.\n\n'ELON AND MARCO HAVE A GREAT RELATIONSHIP. ANY STATEMENT OTHER THAN THAT IS FAKE NEWS!!!' he wrote.\n\nDonald Trump insists his 'First Buddy' Elon Musk and Secretary of State Marco Rubio get on fine despite a huge blowup in the Oval Office\n\nElon Musk and Secretary of State Marco Rubio got into a heated argument during Thursday's Cabinet meeting at the White House\n\nNYT's insider said the argument dragged on for an 'uncomfortable time' as Musk told Rubio he was 'good on TV' suggesting he wasn't good for much else. \n\nThrough it all, Trump sat in his chair, arms crossed, watching the fight play out.\n\nFinally, the 78-year-old intervened. He defended Rubio for doing a 'great job' and pointed out he was very busy traveling, was appearing on TV and had an agency to run.\n\nThe NYT described the meeting as a 'potential turning point' after Trump's whirlwind first few weeks of his second term.\n\nIt also signaled for the first time that the president was willing to rein in Musk as his DOGE team's work has caused chaos and confusion across the federal government. \n\nWhile the fiery clash on Thursday has only just come to light, the meeting itself was widely reported as Trump gathered his Cabinet and made it clear they are in charge of the hirings and firings, not Musk.\n\nHe told his top officials they need to use a 'scalpel' for the workforce cuts.\n\n'I don’t want to see a big cut where a lot of good people are cut,' Trump said after the Cabinet meeting. \n\n'Elon and the group are going to be watching them, and if they can cut, it's better. And if they don't cut, then Elon will do the cutting.' \n\nPresident Trump holding his first Cabinet meeting at the White House on February 26. Elon Musk was also in attendance for that gathering\n\nEven before Musk clashed with Rubio, he also got into it with Transportation Secretary Sean Duffy over the state of the FAA's equipment for tracking planes, the NYT reported. \n\nDuffy accused DOGE of trying to lay off air traffic controllers. He pointed out that there have been multiple plane crashes and questioned Musk's team wanting him to fire air traffic controllers. \n\nMusk claimed Duffy's assertion was a lie to which the transportation secretary insisted it was not and that he had heard from them directly.\n\nMusk responded by demanding names, the NYT reported. \n\nThe hastily convened White House gathering came one day after Musk met with both House and Senate Republicans on Capitol Hill.\n\nSome GOP lawmakers have begun to express concerns over how the spending cuts were being carried out.\n\nDOGE has been the target of multiple lawsuits as it rushes forward with its mission to root out waste, fraud and abuse.\n\nBut federal workers have been forced to defend their work and in many cases shown the door.\n\nMusk's Department of Government Efficiency (DOGE) was created by Trump to find waste, fraud and abuse\n\nThe DOGE team lead by Elon Musk has \n\nAs DOGE has pushed to cut the federal workforce, some department heads including Defense Secretary Pete Hegseth, FBI Director Kash Patel and Director of National Intelligence Tulsi Gabbard - defied the DOGE head by telling their workers to ignore the directive.\n\nIt appears Musk may have lost the power struggle as Trump made clear during the impromptu meeting that the department heads were in charge of which federal workers are fired.\n\nIn a change from his appearance at the first Cabinet meeting, the billionaire wore a suit and tie on Thursday rather than a T-shirt. \n\nTrump at the meeting also tired to offer praise for both Musk and his Cabinet secretaries, the New York Times reported. \n\nSpaceXTeslaDonald TrumpElon MuskPolitics\n\nShare or comment on this article:\nDonald Trump's wild social media outburst after rumors about brutal Musk-Rubio fight spilled out\n\nAdd comment","summary":"Donald Trump broke his silence on his 'First Buddy' Elon Musk and Secretary of State Marco Rubio getting into a huge argument in the Oval Office.","url":"https://www.dailymail.co.uk/news/article-14477605/donald-trump-elon-musk-marco-rubio-oval-office-arguments-federal-workers.html","image":"https://i.dailymail.co.uk/1s/2025/03/07/22/95968547-0-image-m-16_1741385153377.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/08/7682505005643642299/1024x576_MP4_7682505005643642299.mp4","publish_date":"2025-03-09 00:24:43","author":"Editor,Nic White,Sarah Ewall-Wice","authors":["Editor","Nic White","Sarah Ewall-Wice"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.232},{"id":298178474,"title":"Vance Slams Pro-Ukraine Protesters for Chasing Him and His 3-Year-Old Daughter","text":"Vice President JD Vance criticized pro-Ukrainian protesters who had followed him and his three-year-old daughter around, noting that his daughter “grew increasingly anxious.”\n\nIn a post on X, Vance explained that he “decided to speak with the protesters in the hopes” that they would leave his daughter alone, adding that they agreed.\n\n“Today while walking my 3 year old daughter a group of ‘Slava Ukraini’ protesters followed us around and shouted as my daughter grew increasingly anxious and scared,” Vance wrote. “I decided to speak with the protesters in the hopes that I could trade a few minutes of conversation for them leaving my toddler alone.”\n\nVance added that while it was a “mostly respectful conversation,” if protesters are “chasing a 3-year-old as part of a political protest” they are a “s**t person.”\n\nThis is not the first time the Vance family has been faced with pro-Ukraine protesters in the aftermath of a meeting in the Oval Office with Ukrainian President Volodymyr Zelensky, President Donald Trump, and Secretary of State Marco Rubio.\n\nAt the beginning of March, people in Vermont protested the Vance family’s visit to Sugarbush Resort, and were seen holding signs that read “Vance is a traitor. Go ski in Russia,” and “JD Vance is Nazi scum.”\n\nThe pro-Ukraine protests come after Vance, Trump, and Rubio had a meeting the Oval Office with Zelensky. During the meeting, Zelensky dismissed Vance’s idea of diplomacy, and Vance went on to inform Zelensky that it was “disrespectful” of him to “come into the Oval Office to try to litigate this in front of the American media.”\n\n“Right now you guys are going around and forcing conscripts to the front line because you have manpower problems,” Vance added. “You should be thanking the president for trying to bring an end to this conflict.”\n\nZelensky attempted to dispute the claim that Ukraine was having conscription problems with its military and explained that during war “everybody has problems.” When Zelensky added that the United States would “feel it in the future,” Trump informed Zelensky that he was “in no position to dictate what” the U.S. was “going to feel.”\n\nTrump also jumped in when Zelensky implied that Ukraine had “been alone” in the war against Russia, pointing out that the United States had given Ukraine military and monetary aid.\n\n“You haven’t been alone,” Trump stated. “We gave you, through [our] stupid president, $350 billion. We gave you military equipment …. If you didn’t have our military equipment, this war would’ve been over in two weeks.”\n\nBreitbart New’s Katherine Hamilton reported that in the aftermath of the Oval Office incident, Zelensky was asked to leave and did not sign an expected minerals deal. Trump also ended up issuing a statement that he had determined that Zelensky was “not ready for Peace if America is involved.”\n\nDuring Trump’s presidential address before a joint session of Congress, Trump revealed that Zelensky had sent him a letter indicating that he was ready for peace, and was also ready to sign a minerals deal.","summary":"Vice President JD Vance criticized pro-Ukrainian protesters who had followed him and his three-year-old daughter around, noting that his daughter \"grew increasingly anxious.\"\n\n\nThe post Vance Slams Pro-Ukraine Protesters for Chasing Him and His 3-Year-Old Daughter appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/03/08/vance-slams-pro-ukraine-protesters-for-chasing-him-and-his-3-year-old-daughter/","image":"https://media.breitbart.com/media/2025/03/JD-Vance-Wife-Daughter-Trump-640x335.jpeg","video":null,"publish_date":"2025-03-09 00:21:39","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"US","sentiment":-0.563},{"id":298178236,"title":"On International Women's Day, Thousands Gather to Oppose Trump","text":"From Boston to Los Angeles, thousands of people rallied on Saturday to protest the presidency of Donald Trump, including his handling of the war in Ukraine, his stance on reproductive rights and the firing of federal workers.\n\nAbout 300 protests, organized to commemorate International Women's Day, were scheduled around the country. Some, like the one at Washington Square Park in Manhattan, attracted at least a few thousand demonstrators. Others in smaller cities -- including Richmond, Virginia; Sarasota, Florida; and Port Angeles, Washington -- drew more scattered interest. One in Madison, Wisconsin, drew more than 120 people.\n\nIn New York City, protesters expressed outrage at Trump's treatment of Ukraine's president, restrictions on transgender rights and what they see as the tearing apart of the nation's democracy.\n\nNancy Lewis, 80, attended civil rights demonstrations in Selma, Alabama, as a teenager. Lauren Yoo, 26, had rarely protested before. Both were eager to join the crowd.\n\n\"A lot of women are feeling like they are going back in time, so I feel like it's good to come out here and voice our concerns, and stand with all women,\" Yoo said.\n\nInternational Women's Day is not as widely celebrated in the United States as it is in other countries. But organizers said that Americans eager to protest considered the occasion an appropriate time to rally. Women's groups had taken the lead in coordinating the major protest that greeted Trump's first inauguration eight years ago, called the Women's March. Millions of Americans joined that 2017 protest, the largest single-day public demonstration in U.S. history.\n\nTrump's second inauguration faced a much more muted response, reflecting a shift in tactics and perhaps a more uncertain opposition.\n\nThe recent blitz of funding freezes, firings, executive orders and more has left many Americans looking for opportunities to demonstrate, said Rachel O'Leary Carmona, executive director of Women's March, which organized Saturday's rallies. The group was formed by some of the organizers of the 2017 march.\n\nParticipants in different communities focused on different concerns, such as the firings at the National Park Service or restrictions on abortion.\n\n\"What people are concerned about is everything, because there's no aspect of these attacks that doesn't touch everybody,\" she said.\n\nIn Madison, some attendees carried signs supporting Susan Crawford, a liberal candidate for the Wisconsin Supreme Court who supports abortion rights. One attendee, Lynn McMahon, a 32-year-old engineer, said the state Supreme Court race is connected to a broader attack on women.\n\n\"Just sitting around on your couch and 'slacktivism' isn't going to help, but coming out, talking to people, talking to your friends is what makes a difference,\" she said.\n\nSome of Saturday's march attendees had turned out for other recent protest events, like the demonstrations at national parks last weekend and the Stand Up for Science rallies on Friday.\n\nFor Ricki Sajbel, a 67-year-old former stay-at-home mother and a member of a group called the Raging Grannies of Madison, Saturday's rally capped a busy stretch of activism.\n\n\"It is my fourth protest in a week,\" she said.\n\nThis article originally appeared in The New York Times.","summary":"From Boston to Los Angeles, thousands of people rallied on Saturday to protest the presidency of Donald Trump, including his handling of the war in Ukraine, his stance on reproductive rights and the firing of federal workers.","url":"https://www.berkshireeagle.com/nyt/on-international-womens-day-thousands-gather-to-oppose-trump/article_d9cb8c3b-5d89-5bda-9860-b8aeb2292fed.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-09 00:20:33","author":"Isabelle Taft and Eric Berger,North Adams Pride","authors":["Isabelle Taft and Eric Berger","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0.193},{"id":298175754,"title":"New FBI director makes shock move that ignites fury across the agency","text":"New FBI director makes shock move that ignites fury across the agency\n\nREAD MORE: Kash Patel vows to search for missing Jeffery Epstein documents \n\nBy SAMANTHA RUTT FOR DAILYMAIL.COM\n\nPublished: 00:20 GMT, 9 March 2025 | Updated: 00:20 GMT, 9 March 2025\n\nThe FBI's newest director has sparked an unprecedented firestorm within the bureau he was hand-picked to lead.\n\nKashyap 'Kash' Patel, 45, known for his close relationship with MAGA politics, has demanded sweeping loyalty tests and extensive vetting procedures for the agency's staff, indicating the FBI's latest leader may not fully trust the agency he was named to lead.\n\nThe FBI director, whose critics have branded him a conspiracy theorist, also inquired about hiring his own private security detail not long after his Senate confirmation in February, The Wall Street Journal reported.\n\nAs director, Patel is automatically assigned a team of FBI agents tasked with ensuring his safety, however, his latest request suggests that he is not willing to place his life in the hands of his very own agents.\n\nThe former prosecutor also inquired about how to get a secure phone line directly to the Oval Office from both his FBI office in Washington D.C. and his home, according to the Journal.\n\nPatel reportedly claimed he did not wish to go through the FBI landline in his office, but instead a direct line to his ally, President Donald Trump.\n\nUnder the usual chain of command, the FBI director would contact the president through the Attorney General, like all FBI directors have since J. Edgar Hoover in 1929.\n\nThe indirect line of contact was allegedly installed to help maintain distance and demonstrate independence from the White House.\n\nKashyap 'Kash' Patel, 45, has demanded sweeping loyalty tests and extensive vetting procedures for the agency's staff, indicating the FBI's latest leader may not trust the agency he was named to lead\n\nPatel, however, is a loyal ally of the President, serving as a national security advisor in Trump's first administration\n\nPatel, however, is a loyal ally of the president, serving as a national security advisor in his first administration.\n\n'Director Patel is aggressively working to deliver on removing criminals from our streets, restoring law and order, and ensuring agents have the resources they need to perform their duties effectively,' FBI spokesperson Ben Williamson said.\n\n'We have absolutely zero interest in engaging with false leaks or distractions that undermine that mission,' he added.\n\nThe New York-native was among Trump's most controversial administration picks.\n\nPatel, who was born in New York to Indian Gujarati immigrant parents, shockingly made it through the Senate vote even after every single Democratic senator, as well as two Republicans, voted against his confirmation.\n\nTheir reservation wasn't just that Patel had a complete lack of experience at the FBI, but overwhelming concerns from critics suggested that the newly-appointed federal agent is a conspiracy theorist.\n\nIn 2022, the FBI Director authored a children's picture book which pushed the claim that former President Joe Biden rigged the 2020 election against Trump.\n\nPatel was also often known to label his political opposition and even the FBI as part of 'the deep state' - which refers to a body of people, typically influential members of government agencies or the military, believed to be involved in the secret manipulation or control of government policy - during his time serving as a commentator at The Epoch Times.\n\nPatel, who was born in New York to Indian Gujarati immigrant parents, shockingly made it through the Senate vote even after every single Democratic senator, as well as two Republicans, voted against his confirmation\n\nThe FBI director, whose critics have branded him a conspiracy theorist, inquired about hiring his own private security detail not long after his Senate confirmation back in February, The Wall Street Journal reported. Pictured: The FBI headquarters building in Washington, D.C.\n\nThe Justice Department has also been trying to fire FBI agents who investigated Trump but has faced legal pushback, the Daily Beast reported. Pictured: Administrator of the US Environmental Protection Agency Lee Zeldin, FBI Director Kash Patel and US Secretary of Defense Pete Hegseth\n\nHe has also expressed a sympathetic attitude toward the QAnon movement, which claims that the Democratic Party is a 'pedophilic cabal.'\n\nJust last month, Patel was accused of spearheading the purge of senior FBI officials, even before his confirmation.\n\nThe Justice Department has also been trying to fire FBI agents who investigated Trump but has faced legal pushback, the Daily Beast reported.\n\nLast week, Patel and Attorney General Pam Bondi, another well-known Trump ally, enraged Trump's supporters with a release of 'Epstein files' that offered no new information on the disgraced sex-offender.\n\nShare or comment on this article:\nNew FBI director makes shock move that ignites fury across the agency\n\nAdd comment","summary":"The FBI 's newest director, Kash Patel, has sparked an unprecedented firestorm within the bureau he was hand-picked to lead.","url":"https://www.dailymail.co.uk/news/article-14477517/New-FBI-director-ignites-fury-agency-Kash-Patel.html","image":"https://i.dailymail.co.uk/1s/2025/03/08/23/95991017-0-image-m-20_1741477438607.jpg","video":null,"publish_date":"2025-03-09 00:20:18","author":"Editor,Samantha Rutt","authors":["Editor","Samantha Rutt"],"language":"en","source_country":"gb","sentiment":-0.15},{"id":298176410,"title":"At least 14 killed, 37 wounded in Russian missile strike on Ukraine","text":"KYIV: At least 14 people were killed and 37 wounded, including five children, in Russian missile and drone attacks on Ukraine’s eastern city of Dobropillia and a settlement in Kharkiv region overnight, the Ukrainian Interior Ministry said on Saturday.\n\nRussian forces attacked Dobropillia with ballistic missiles, multiple rockets, and drones, causing damage to eight multi-storey buildings and 30 vehicles, according to the ministry. The assault resulted in the deaths of 11 people, including five children, and left 30 others wounded.\n\nThe ministry also reported that three civilians were killed and seven wounded in a separate drone attack on the Kharkiv region in the northeast.\n\n“Such strikes show that Russia’s objectives have not changed. Therefore, it is crucial to continue to do our best to protect lives, strengthen our air defences, and increase sanctions against Russia. Everything that helps Putin finance the war must collapse,” President Volodymyr Zelenskiy said on Facebook.\n\nOn Friday, Russian forces damaged Ukrainian energy and gas infrastructure in their first major missile attack since the US paused intelligence sharing with Ukraine, piling pressure on Kyiv as President Donald Trump seeks a swift end to the war.\n\nThe pause in US military aid and intelligence may undermine Ukraine’s air defences as it runs low on advanced missiles and struggles to track attacks as effectively, military analysts say.\n\nDobropillia, home to about 28,000 people before the war, is in the Donetsk region of eastern Ukraine, 22 kilometres (13.67 miles) from the front line north of the key hub of Pokrovsk, which the Russian troops have been attacking for weeks.\n\nAmid US efforts to sit Kyiv and Moscow at the negotiating table, the sides continue to engage in active hostilities in an attempt to gain an advantage.\n\nA tank at Surgutneftegaz’s Kirishi oil refinery, one of Russia’s largest, was damaged by falling debris during a major Ukrainian overnight drone attack, local official said.","summary":"KYIV: At least 14 people were killed and 37 wounded, including five children, in Russian missile and drone attacks on Ukraine’s eastern city of Dobropillia and a settlement in Kharkiv region overnight, the Ukrainian Interior Ministry said on Saturday.\n\n\nRussian forces attacked Dobropillia with ballistic missiles, multiple rockets, and drones, causing damage to eight multi-storey buildings and 30 vehicles, according to the ministry. The assault resulted in the deaths of 11 people, including five children, and left 30 others wounded.\n\n\nThe ministry also reported that three civilians were killed and seven wounded in a separate drone attack on the Kharkiv region in the northeast.\n\n\n“Such strikes show that Russia’s objectives have not changed. Therefore, it is crucial to continue to do our best to protect lives, strengthen our air defences, and increase sanctions against Russia. Everything that helps Putin finance the war must collapse,” President Volodymyr Zelenskiy said on Facebook.\n\n\nOn Friday, Russian forces d","url":"https://www.brecorder.com/news/40351996/at-least-14-killed-37-wounded-in-russian-missile-strike-on-ukraine","image":"https://i.brecorder.com/large/2025/03/0905085350f1fe7.jpg?r=050858","video":null,"publish_date":"2025-03-09 00:17:37","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.023},{"id":298176444,"title":"UK, France, Italy, Germany hail Arab plan to rebuild for Gaza","text":"BERLIN: Britain, France, Germany and Italy on Saturday backed a proposal by Muslim-majority nations to rebuild Gaza as a “realistic path”.\n\nThe counter-proposal to US President Donald Trump’s plan to take over Gaza and displace its residents “promises — if implemented — swift and sustainable improvement of the catastrophic living conditions for the Palestinians living in Gaza,” the foreign ministers of the four countries said in a joint statement.\n\nThe 57-member Organisation of Islamic Cooperation (OIC) at an emergency meeting in Saudi Arabia, on Saturday formally adopted a plan put forward by the Arab League.\n\nThe Egyptian-crafted plan, an alternative to Trump’s widely condemned takeover, proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority.\n\nUnlike the Trump plan, it aims to do so without displacing the territory’s 2.4 million inhabitants, who have suffered 17 months of war.\n\nThe OIC, which represents the Muslim world, in a statement urged “the international community and international and regional funding institutions to swiftly provide the necessary support for the plan”.\n\nThe Egyptian proposal — which does not outline a role for Hamas, which controls Gaza — has already been rejected by both the US and Israel.\n\nBut the European foreign ministers said it “shows a realistic path to the reconstruction of Gaza”.\n\n“We are clear that Hamas must neither govern Gaza nor be a threat to Israel any more,” they said in their statement.\n\n“We commend the serious efforts of all involved stakeholders and appreciate the important signal the Arab states have sent by jointly developing this recovery and reconstruction plan,” the statement added.\n\n“We are committed to working with the Arab initiative, the Palestinians and Israel to address those issues together.”","summary":"BERLIN: Britain, France, Germany and Italy on Saturday backed a proposal by Muslim-majority nations to rebuild Gaza as a “realistic path”.\n\n\nThe counter-proposal to US President Donald Trump’s plan to take over Gaza and displace its residents “promises — if implemented — swift and sustainable improvement of the catastrophic living conditions for the Palestinians living in Gaza,” the foreign ministers of the four countries said in a joint statement.\n\n\nThe 57-member Organisation of Islamic Cooperation (OIC) at an emergency meeting in Saudi Arabia, on Saturday formally adopted a plan put forward by the Arab League.\n\n\nThe Egyptian-crafted plan, an alternative to Trump’s widely condemned takeover, proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority.\n\n\nUnlike the Trump plan, it aims to do so without displacing the territory’s 2.4 million inhabitants, who have suffered 17 months of war.\n\n\nThe OIC, which represents the Muslim world, in a statement urged “the international c","url":"https://www.brecorder.com/news/40352002/uk-france-italy-germany-hail-arab-plan-to-rebuild-for-gaza","image":"https://i.brecorder.com/large/2025/03/090459181d5c0d5.jpg?r=045923","video":null,"publish_date":"2025-03-09 00:17:37","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":-0.157},{"id":298176412,"title":"Arab alternative to Trump’s Gaza plan adopted by OIC","text":"JEDDAH: The Organisation of Islamic Cooperation (OIC) formally adopted early Saturday an Arab League counter-proposal to US President Donald Trump’s plan to take over Gaza and displace its residents, calling on the international community to support the regional initiative.\n\nThe decision by the 57-member grouping came at an emergency meeting in Jeddah, Saudi Arabia, three days after the Arab League ratified the plan at a summit in Cairo.\n\nThe Egyptian-crafted alternative to Trump’s widely condemned takeover proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority. The OIC “adopts the plan… on the early recovery and reconstruction of Gaza”, a communique said.\n\nThe body, which represents the Muslim world, urged “the international community and international and regional funding institutions to swiftly provide the necessary support for the plan”.\n\nTrump triggered global outrage when he suggested the US “take over” Gaza and turn it into the “Riviera of the Middle East”, while forcing its Palestinian inhabitants to relocate to Egypt or Jordan.\n\nEgyptian Foreign Minister Badr Abdelatty welcomed the OIC endorsement and said he now hoped to gain support from the wider international community, including the US.\n\n“The next step is for the plan to become an international plan through adoption by the European Union and international parties such as Japan, Russia, China and others,” Abdelatty said.\n\n“This is what we will seek and we have contact with all parties, including the American party.”\n\nHowever, the Egyptian proposal — which does not outline a role for Hamas, which controls Gaza — has already been rejected by both the US and Israel.\n\nThe plan “does not meet the expectations” of Washington, State Department spokeswoman Tammy Bruce told reporters on Thursday.\n\nTrump’s Middle East envoy Steve Witkoff, however, gave a more positive reaction, calling it a “good-faith first step from the Egyptians”.\n\nTrump’s plan has united Arab countries in opposition, and Rabha Seif Allam, of the Al-Ahram Center for Political and Strategic Studies in Cairo, said Egypt was seeking “broad support” for its proposal.\n\n“This is an attempt to build a broad coalition that refuses the displacement” of Palestinians from Gaza, she said.","summary":"JEDDAH: The Organisation of Islamic Cooperation (OIC) formally adopted early Saturday an Arab League counter-proposal to US President Donald Trump’s plan to take over Gaza and displace its residents, calling on the international community to support the regional initiative.\n\n\nThe decision by the 57-member grouping came at an emergency meeting in Jeddah, Saudi Arabia, three days after the Arab League ratified the plan at a summit in Cairo.\n\n\nThe Egyptian-crafted alternative to Trump’s widely condemned takeover proposes to rebuild the Gaza Strip under the future administration of the Palestinian Authority. The OIC “adopts the plan… on the early recovery and reconstruction of Gaza”, a communique said.\n\n\nThe body, which represents the Muslim world, urged “the international community and international and regional funding institutions to swiftly provide the necessary support for the plan”.\n\n\nTrump triggered global outrage when he suggested the US “take over” Gaza and turn it into the “Riviera of the Middle East”, ","url":"https://www.brecorder.com/news/40352003/arab-alternative-to-trumps-gaza-plan-adopted-by-oic","image":"https://i.brecorder.com/large/2025/03/09044417463f5c5.jpg?r=044424","video":null,"publish_date":"2025-03-09 00:17:37","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.196},{"id":298178232,"title":"Trump Casts a Long Shadow Over a Governor's Race","text":"There are plenty of thorny policy issues facing the next governor of New Jersey. Housing and health care costs are high. Mass transit is on the ropes. Schools are among the most segregated in the country, and sea levels along the state's 130-mile coastline are rising.\n\nBut on the campaign trail, nearly all the candidates in both parties have been forced to focus heavily on another topic altogether: President Donald Trump.\n\nHe has dominated the rhetoric at Republican and Democratic debates. His photograph has been featured prominently in ads for candidates competing for their party's nomination in June. At forums that draw each side's most energized base of supporters, he is either the standard-bearer or the bête noir. Some candidates have even laced their comments with curse words in an apparent effort to emulate Trump's blunt speaking style.\n\n\"You're going to hear a couple of guys argue about who's more Trump-like,\" Edward Durr Jr., a Republican candidate, said at the start of one debate.\n\nIt was the inverse of a warning made days earlier by Ras J. Baraka, the mayor of Newark who is running for the Democratic nomination: \"We're moving too far to the right. We're scared to be Democrats.\"\n\nNew Jersey and Virginia are the only states that hold governor's races the year after a presidential election. And every four years the results are scrutinized for clues about voter sentiment before midterm contests that can determine party control of Congress.\n\nBecause of a change in ballot design that has led to a seismic shift in the way campaigns are run in New Jersey, this year's primaries are particularly volatile. No longer do candidates endorsed by local party leaders get a preferential spot on the ballot -- a change that has given their rivals better odds of success. As a result, neither party has coalesced around a dominant front-runner, and the primaries' unusually competitive nature is likely to offer early insights about messaging, voter enthusiasm and attitudes toward Trump's second presidency.\n\n\"Either it's going to be the first sign that Trump is in trouble and that voters are ready to rebalance, to recalibrate,\" said Micah Rasmussen, director of Rider University's Rebovich Institute for New Jersey Politics. \"Or it's going to be a sign that Democrats are still on their heels, that Trump still has the Democrats on the run.\"\n\nGov. Philip D. Murphy is barred by term limits from running for reelection. And the race to replace him has drawn an enormous field of candidates, including two sitting members of Congress, two big-city mayors and a Republican who nearly beat Murphy three years ago.\n\nRegistered Democrats outnumber Republicans by more than 830,000 voters statewide. But independent voters make up the second-largest voting bloc and carry enough clout to swing elections in New Jersey, a largely suburban, well-educated and affluent state.\n\nIn the governor's race, clear lanes have emerged on the left and on the right on a range of divisive issues stoked by Trump, including abortion access, transgender rights and the president's pardons of the Jan. 6, 2021, rioters.\n\nBut on no issue does Trump's influence on the race appear more clear-cut than on immigration, even in a state where roughly 1 in 4 residents was born outside the United States.\n\n(BEGIN OPTIONAL TRIM.)\n\nAfter a campaign focused on border security, Trump notched a far stronger showing in November than he did in 2020, losing New Jersey by just 6 points, down from 16 points four years ago. In more than half of the state's counties, he won -- including in Passaic County, an urban region of northern New Jersey filled with vibrant immigrant communities and a large population of Palestinians, many of whom were dissatisfied by Democrats' political response to Israel's bombing of the Gaza Strip after the Oct. 7, 2023, attack by the terrorist group Hamas.\n\nRep. Jeff Van Drew, a former Democrat from South Jersey who joined the Republican Party four years ago and has become an ally of Trump, said the president's victory in November presented an opportunity to continue to expand the party's base in New Jersey.\n\n(END OPTIONAL TRIM.)\n\nRecent polls have shown that immigration remains a dominant concern among New Jersey voters. And Democrats have approached the topic far more warily than Murphy did eight years ago when he was first running for office.\n\nJersey City's mayor, Steve Fulop, and Sean Spiller, the president of the state's largest teachers' union, have said that they would strengthen New Jersey's ability to defend immigrants if elected governor. But only one of the Democratic candidates for governor, Baraka, loudly criticized the Trump administration after it moved recently to reopen an immigrant detention center in Newark, a step likely to put the state at the epicenter of the president's effort to enact mass deportations.\n\nOther Democratic candidates have staked out positions that speak to voters' unease about unchecked immigration and crime.\n\nIn January, Rep. Josh Gottheimer set himself apart as the only Democrat in New Jersey's congressional delegation to support the Laken Riley Act, which directs the authorities to detain and deport immigrants without legal status who are accused -- but not convicted -- of certain crimes. And Stephen M. Sweeney, a former state Senate president, has said he would roll back a rule limiting the voluntary assistance that the authorities may provide federal agents, which has been a cornerstone of New Jersey's immigration policy for six years.\n\nRep. Mikie Sherrill, a former Army helicopter pilot, addressed immigration policy only generally during a recent candidate forum at Rutgers University.\n\nBut she grew emotional as she spoke about what she sees as the overarching threat New Jersey faces from the Trump administration.\n\n\"Every dream I had for my children and my grandchildren, everything I believe about this country, is under attack right now from Donald Trump,\" she said. \"And I cannot imagine how I would work with him when he is working to destroy everything that I love.\"\n\nThe audience erupted in applause as Sherrill appeared to wipe away a tear.\n\n(BEGIN OPTIONAL TRIM.)\n\nJohn L. Campbell, a former sociology professor at Dartmouth College whose research has focused on Trump's norm-shredding first term, said Democrats across the country are struggling to find a resonant message, particularly on issues like immigration.\n\n\"I just don't think they've figured it out yet,\" he said.\n\n\"They need to figure out a way to at least genuflect a little bit to some of the issues that have been successful for 'Team Trump,'\" he said.\n\n(END OPTIONAL TRIM.)\n\nAmong Republican candidates for governor, the campaign has been a race to embrace the president and his agenda. A group supportive of Jack Ciattarelli, who fell 3 points short of beating Murphy in 2021, set up a website challenging an opponent's fealty to Trump.\n\nIn turn, that opponent, Bill Spadea, a far-right radio host on leave from his job, released an ad that featured a snippet from an interview in which Trump groused about Ciattarelli, suggesting that if he had asked for Trump's endorsement, he might have won his race in 2021.\n\n\"This guy never came to ask for my support,\" Trump said in May. \"When MAGA sees that, they don't like it.\"\n\nEven Sen. Jon Bramnick, a moderate Republican candidate who has been an outspoken Trump critic, has said that he would accept the president's support, even as he noted that it was unlikely to be offered.\n\n(BEGIN OPTIONAL TRIM.)\n\nThe races are unfolding against a backdrop of dizzying change in Washington, making political strategy especially challenging.\n\n\"It's almost 100 years from now until the general election in November,\" said state Sen. Holly Schepisi, a Republican. \"Popularity today doesn't necessarily translate to popularity a few months from now.\"\n\n(END OPTIONAL TRIM.)\n\nIn New Jersey, one of the most palpable signs of the shifting sands in Washington has seen an uptick in the tempo of deportation actions by Immigration and Customs Enforcement agents, who have shown a new willingness to enter workplaces to make arrests.\n\nNedia Morsy, director of Make the Road New Jersey, an organizing group focused on immigrant rights, sees the actions by ICE as an opportunity for left-leaning candidates to begin to define an alternative narrative, particularly in a race that will be watched nationwide.\n\n\"Folks should rethink their strategy if their intention is to shy away from immigration,\" Morsy said, \"because it is important to every single community in New Jersey.\"\n\n\"New Jersey,\" she added, \"can serve as a referendum across the country.\"\n\nThis article originally appeared in The New York Times.","summary":"There are plenty of thorny policy issues facing the next governor of New Jersey. Housing and health care costs are high. Mass transit is on the ropes. Schools are among the most segregated in the country, and sea levels along…","url":"https://www.berkshireeagle.com/nyt/trump-casts-a-long-shadow-over-a-governors-race/article_a711a992-120b-5a45-9208-f482692df4cd.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-09 00:15:33","author":"Ras J. Baraka,Tracey Tully","authors":["Ras J. Baraka","Tracey Tully"],"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":298174832,"title":"World News | Bangladesh: 36 Members of Banned Outfit Hizb-ut Tahrir Arrested","text":"Dhaka [Bangladesh], March 9 (ANI): As many as 36 members of the outlawed Hizb-ut Tahrir group have been arrested in Bangladesh since Friday, Chief Adviser's office said on Saturday in a statement.\n\"They include Saiful Islam, a key organiser of the group, which was banned in 2009 for an anti-state campaign\", the statement said.\nAlso Read | Syria Unrest: 2 Days of Clashes Between Security Forces and Loyalists of Bashar Assad, Revenge Killings Leave More Than 600 People Dead.\n\"Police have launched a nationwide search for the members of the group who took part in the banned rally outside the Baitul Mukarram Mosque in Dhaka\", it added.\n\"We are analysing the video footage of the rally. We have identified many members of HT, and they will be arrested for joining a political program of a banned organisation,\" Inspector General of Police Baharul Alam said.\nAlso Read | PM Narendra Modi, US President Donald Trump Agree To Push Forward Negotiations on Multi-Sector Bilateral Trade Agreement, Say Sources.\nPolice have filed several cases under anti-terrorism laws against the members of the group, the statement said. Earlier on Friday, Hizb ut-Tahrir, a radical Islamist organisation banned in Bangladesh since October 2009, carried out its first open rally in Dhaka.\nJoined by thousands of its members, the group began the rally from the north gate of Baitul Mukarram National Mosque after Friday prayers. The rally was titled \"March for Khilafah.\"\nDhaka Tribune reported that a clash erupted between police and members of the banned organization near the Baitul Mukarram National Mosque in Dhaka. Law enforcement intervened to stop the procession, leading to a violent altercation.\nHizb ut-Tahrir advocates for the establishment of a global Islamic Caliphate, or Khilafah, which it claims would unite all Muslim-majority countries under a single Islamic government.\nEarlier in February, Nazmul Ahsan Kalimullah, Professor, Department of Public Administration, University of Dhaka, admitted that Islamist groups in Bangladesh have got more freedom after Sheikh Hasina left the country.\nKalimullah, while speaking to ANI, said that several banned Islamist outfits are active in Bangladesh and are even holding press conferences.\n\"Islamists, they have succeeded in carving out larger space in the public domain. And Bangladesh Jamaat-e-Islami has strengthened its position. Hefazat-e-Islam movement has become stronger. Personalities such as Peer of Charmoni has gained prominence. Even Hizb ut-Tahrir, they are an outlaw organization, but they're visible. They are coming up with leaflets, posters and also in different places they are waving their flags, they're marching in the streets even convened press conferences. So officially this outfit is not a legal entity till now and their media coordinator is behind the bar. So, officially the ban is still there but in reality they are functioning,\" he said.\nHizb ut-Tahrir remains a banned organization in Bangladesh, with all its activities and demonstrations deemed illegal. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   At least 36 members of the outlawed Hizb-ut Tahrir group have been arrested in Bangladesh since Friday, Chief Adviser's office said on Saturday in a statement.","url":"https://www.latestly.com/agency-news/world-news-bangladesh-36-members-of-banned-outfit-hizb-ut-tahrir-arrested-6696684.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250308200419.jpg","video":null,"publish_date":"2025-03-09 00:14:20","author":null,"language":"en","source_country":"in","sentiment":-0.167},{"id":298174830,"title":"World News | Houston Teen Indicted for Terrorism","text":"Houston, Mar 9 (PTI) A 17-year-old has become the first person in Harris County to be indicted for terrorism under a new state law, officials say. Laith Adil Shehzad appeared in the court on Friday, wearing an orange jumpsuit and showing no apparent nervousness, even smiling at the cameras. Also Read | Syria Unrest: 2 Days of Clashes Between Security Forces and Loyalists of Bashar Assad, Revenge Killings Leave More Than 600 People Dead. Prosecutors say the FBI was alerted by Meta in August 2024 about messages between Shehzad and an alleged ISIS militant jailed in the Philippines. Court documents state Shehzad sent photos of himself holding a Glock with extended magazines via Facebook messenger on August 17. The next day, as the FBI agents arrived at his home, he allegedly dumped the gun and ammunition in a detention pond before speaking with investigators. Also Read | PM Narendra Modi, US President Donald Trump Agree To Push Forward Negotiations on Multi-Sector Bilateral Trade Agreement, Say Sources. The prosecutors also claim that Shehzad sought guidance on martyrdom and was previously under juvenile supervision for possessing homemade explosives. The investigators believe that he was radicalized as early as 2021, at the age of 13. Defense Attorney John Stevenson described Shehzad as young and scared, arguing that many Texas teenagers post with firearms. \"This case involves a lot of words and no one was actually harmed,\" he said. Prosecutors allege that Shehzad planned an attack but was unable to carry it out because his Uber account was suspended. A grand jury indicted Shehzad under a law targeting those who conspire to commit crimes “to intimidate or coerce the public”. “I'm incredibly grateful to law enforcement for preventing what could have been a tragic act,” said Harris County DA Sean Teare. Shehzad remains jailed without bond and faces up to 15 years in prison if convicted. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A 17-year-old has become the first person in Harris County to be indicted for terrorism under a new state law, officials say.","url":"https://www.latestly.com/agency-news/world-news-houston-teen-indicted-for-terrorism-6696682.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-09 00:14:08","author":null,"language":"en","source_country":"in","sentiment":-0.293},{"id":298178526,"title":"Step up efforts to unlock £250bn in frozen assets from ‘Putin’s bank’ to help Ukraine, Keir Starmer urged","text":"SIR Keir Starmer has been told to step up efforts to unlock frozen Russian assets to help Ukraine — rather than just keeping them safe in “Putin’s bank”.\n\nThe PM wants European leaders to channel Moscow’s £250billion held across the -continent to boost the embattled nation’s war chest.\n\nThe UK has pledged a £2.26billion loan to Ukraine’s war effort, underwritten by frozen Russian wealth.\n\nBut resistance to a wider raid has come from Eurozone countries concerned about international law and fearing it could spook further investment from other countries.\n\nG7 nations have frozen about £250billion in Central Bank of Russia assets since the 2022 invasion.\n\nIncome generated is being used but the underlying assets are untouched. \n\nAnd about £160billion is sitting in Belgium’s central security depository Euroclear.\n\nFormer Tory leader Sir Iain Duncan Smith said: “We are not Putin’s bank and Putin needs to pay for his appalling invasion. We need to move fast to seize these assets.” \n\nLabour MP Joe Powell told the Sun on Sunday: “It’s well overdue for European leaders to be bold and take steps to seize the Russian sovereign assets to fund Ukraine.\n\n“Russia has caused massive damage to Ukraine, but they will never pay up on their own accord.\n\n“I’m proud Chancellor Rachel Reeves has led the way on using the interest from the Russian cash. \n\n“I hope Keir Starmer can now convince the Germans and French to take the next step.”\n\nSir Iain added: “Given the fact the US is making life very difficult for Ukraine, it’s important we use the assets to the advantage of Ukraine.\n\n“And we must absolutely not allow them to go back into negotiations with Russia.\n\n“This is something Europe can do and doesn’t need permission from America.”\n\nShadow Foreign Secretary Priti Patel said: “More needs to be done to mobilise Russian assets lawfully. \n\n“The PM and the EU need to keep striving to find solutions.”\n\nIt came as Foreign Secretary David Lammy suggested Britain could join a European defence fund.\n\nHe told the Financial Times: “We are open to those initiatives because this is about European security.”\n\nSir Keir’s approval rating has been boosted from -35 to -25 after he navigated tricky diplomatic waters amid the dust-up between US President Donald Trump and Ukraine’s leader Volodymyr Zelensky, an Opinium poll found.\n\nAnd in another coup for the PM, Australia is now considering contributing to his “coalition of the willing” to help Ukraine.\n\nThe Trump administration has suspended delivery of all US military aid to Mr Zelensky. \n\nBut former Defence Secretary Sir Ben Wallace said it would not be the “end of the world” if the US left Nato.\n\nHe said Europe must provide its own security and defend Ukraine.\n\nPresident Zelensky yesterday said he was fully committed to having a constructive dialogue with the US in Saudi Arabia next week to try to bring the war to an end.","summary":"","url":"https://www.thesun.co.uk/news/33757436/starmer-unlock-putin-frozen-assets-boost-ukraine/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/03/british-prime-minister-sir-keir-977446054.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-03-09 00:13:51","author":"Sophia Sleigh","authors":["Sophia Sleigh"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.004},{"id":298174778,"title":"J.D. Vance Alleges Being Pursued by Ukraine Supporters Along with His 3-Year-Old Daughter","text":"J.D. Vance says he and his daughter had a scary run-in with protesters Saturday afternoon … ’cause he claims a few overzealous supporters of Ukraine chased them down.\n\nThe vice president described the alleged interaction on X … writing that while walking with his three-year-old daughter a group of “Slava Ukraini” protesters yelled at and followed them — which made his daughter anxious and scared\n\nVance says he tried to defuse the situation by speaking with the protesters in hopes of stopping them for harassing her — a move which he says worked, by and large.\n\nVance called the conversation “mostly respectful” … before adding that anyone chasing after a kid as part of a political protest is a “s*** person.”\n\nWorth noting … there’s no video of the incident VP Vance is describing. We’ve reached out for further clarification on what went down from the Secret Service — so far, no word back.\n\nVance and his wife Usha share three children — Ewan, Vivek and Mirabel — and the latter two have made multiple appearances at big political events. Ewan has mostly avoided the spotlight.\n\nAs you know … tension regarding the relationship between the United States and Ukraine have exploded in recent days — especially after the fraught meeting between Vance, U.S. President Donald Trump and Ukraine’s President Volodymyr Zelensky.\n\nRemember, Vice President Vance told President Zelensky he needed to be more grateful to President Trump because he was trying to save Ukraine … the beginning of a spiral that led to a shouting match, and eventually saw Zelensky booted from the White House.\n\nPro-Ukraine protesters gathered in Vermont to demonstrate while Vance went on a skiing trip in the state after the meeting … and, one irate person even asked him what it feels like to be “Putin’s puppet.”\n\nIt seems that tension isn’t dying down … at least, according to Vance, that is.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJ.D. Vance Ukraine Supporters Chased Me, Daughter &#8230; She Grew &#8216;Increasingly Anxious&#8230;\n\n\nThis Post: J.D. Vance Alleges Being Pursued by Ukraine Supporters Along with His 3-Year-Old Daughter first appeared on Internewscast Journal","url":"https://internewscast.com/entertainment/j-d-vance-alleges-being-pursued-by-ukraine-supporters-along-with-his-3-year-old-daughter/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-JD-Vance-Claims-Ukraine-Supporters-Chased-Him.jpg","video":null,"publish_date":"2025-03-09 00:13:34","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.372},{"id":298175758,"title":"British spies 'concerned that sharing anti-Russian intelligence with the US could blow agents' cover'","text":"British spies 'concerned that sharing anti-Russian intelligence with the US could blow agents' cover'\n\nPODCAST: Trump’s tariff whiplash, Trudeau’s tears, and Hunter Biden’s ‘sugar brother’ – on the latest episode of Welcome to MAGAland\n\nBy GLEN OWEN and DAN HODGES\n\nPublished: 00:06 GMT, 9 March 2025 | Updated: 00:11 GMT, 9 March 2025\n\nBritish spies are concerned that sharing anti-Russian intelligence with the American government could lead to their agents’ cover being blown, security sources have told The Mail on Sunday.\n\nThe sources said British spy chiefs have been ‘significantly rationing’ what information they passed to their counterparts in the CIA since Donald Trump won the presidential election last year.\n\nOne source even claimed that some Western agents operating in Russia and Ukraine had been extracted – discreetly and overland – as a protective measure, given Mr Trump’s emollient attitude towards the Kremlin.\n\nPresident Trump said this weekend that he was finding it ‘more difficult, frankly, to deal with Ukraine’ than Russia, telling reporters that the US was ‘doing very well’ with Moscow.\n\nThe Americans want Volodymyr Zelensky to sign a deal that would give them a major stake in Ukrainian mineral resources and agree a truce with Moscow.\n\nHowever the Ukrainian president will not do so without firm security guarantees. Mr Trump’s senior officials will travel to Saudi Arabia next week to discuss the plan with Mr Zelensky’s team.\n\nLast night, Downing Street strongly denied there had been any change in intelligence-sharing protocols, but separate senior sources claimed that precautionary decisions were being made by the agencies on an operational basis and without ministerial oversight or sanction. \n\nSecurity minister Dan Jarvis is also understood to have held meetings with Sir Richard Moore, head of MI6, and Sir Ken McCallum, head of MI5, regarding the security of British intelligence.\n\nThe headquarters of GCHQ in Gloucestershire. Spy chiefs have been rationing intelligence shared with US counterparts since Donald Trump was elected as President\n\nAgents' concerns increased dramatically following Mr Trump's incendiary meeting with Volodymyr Zelensky\n\nThe agents’ concerns have increased dramatically since Mr Trump’s spectacular fall-out with Mr Zelensky in the Oval Office last month in which he accused the Ukrainian leader of being ‘disrespectful’ to the US. He then paused both military aid and information-sharing with Kyiv, effectively crippling its ability to defend itself against Russian attacks.\n\nAnd it comes amid a ramping up of Moscow-backed espionage in the UK: on Friday, three Bulgarians were found guilty of being part of a Russian spy unit carrying out surveillance on a US military base and other individuals.\n\nWhile signals intelligence, the electronic interception of communications, is a heavily integrated Anglo-American operation and hard to disentangle, old-fashioned human intelligence, using agents on the ground, can be kept more distinct. \n\nAgencies have been wary of Mr Trump since the case of Oleg Smolenkov, an alleged high-level US spy who was reported to have been extracted from Moscow in 2017 after Mr Trump had met senior Russian officials including foreign minister Sergei Lavrov.\n\nSources also said that the Five Eyes intelligence alliance between Australia, Canada, New Zealand, the United Kingdom and the United States could become an effective ‘Four Eyes’, as the old Commonwealth countries discuss forming a breakaway unit.\n\nLast night, a senior security source said: ‘Intelligence gathering is one of the few areas in which the Americans still have a high regard for Britain. We have always been careful about what we share with them in terms of protecting agents – with files marked “for UK eyes only” – but that obviously becomes more pronounced at moments like these.\n\n‘The issue is mainly with raw intelligence, which can be very exposing of sources if it falls into the wrong hands. More care will be taken to package the information so as to disguise the origins.’\n\nIt comes amid a ramping up of Moscow-backed espionage in the UK as three Bulgarians were found guilty of being part of a Russian spy unit\n\nAnother source said: ‘It would be too aggressive an act to withdraw co-operation, and we don’t want to provoke a reaction from Trump. Just last week we used a Reaper drone to attack Islamic State in Syria, which we couldn’t do without the support of the US.\n\n‘But there has definitely been a shift away from us overtly proffering information. The UK is also monitoring what the US provides to us to try to ascertain if the US is changing the volume of what intel it provides’.\n\nDiplomatic sources also said that the US security services were ‘in a state of panic’ over Mr Trump, and were destroying files which could expose assets in Russia. They are said to be concerned that raw intelligence was now so widely circulated within the system that it would be difficult to completely protect sources.\n\nThe concern is exacerbated by the way Mr Trump is replacing long-standing officers with his loyal appointees.\n\nUkraineDonald TrumpRussiaMoscow\n\nShare or comment on this article:\nBritish spies 'concerned that sharing anti-Russian intelligence with the US could blow agents' cover'\n\nAdd comment","summary":"Sources say spy chiefs have been 'significantly rationing' what information they passed to their counterparts in the CIA since Donald Trump won the presidential election last year.","url":"https://www.dailymail.co.uk/news/article-14477703/British-spies-anti-Russian-intelligence-US-blow-agents-cover.html","image":"https://i.dailymail.co.uk/1s/2025/03/09/00/95992191-0-image-m-141_1741478751234.jpg","video":null,"publish_date":"2025-03-09 00:11:47","author":"Dan Hodges,Editor,Glen Owen","authors":["Dan Hodges","Editor","Glen Owen"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.033},{"id":298176654,"title":"Oluwo lauds Trump on LGTB ban","text":"The Oluwo of Iwo, Oba Abdulrosheed Akanbi, has commended the President of the United States of America, Donald Trump, for ending policies protecting lesbian, gay, bisexual, transgender, and queer or questioning rights.\n\nIn an executive order issued immediately after his inauguration as the 48th President of the US, Trump recognized two sexes male and female, maintaining that sexes cannot be changed and projected.\n\nHe placed a ban on transgender people from serving in the US military, just as he declared that government funds would not be used to promote gender identity any longer.\n\nCommending Trump, Oluwo, in a statement by his Press Secretary, Alli Ibraheem, said the orders would restore the sanctity of humanity and bring sanity to the world’s moral practice.\n\nOba Akanbi faulted the old practices of gay and lesbianism challenging the natural and fundamental reality, saying individual natural sexual attachment should be a pride.\n\nHe said Trump’s executive order would renew people’s trust in the moral consciousness of the US.\n\nThe statement reads, “The moral consciousness of the world is raised by the suspension of policies protecting LGTB rights by recognising two sexes only – male and female. Ending such policies deserves the commendation of every reasonable individual in respect of sound moral standard.\n\n“I especially commend President Trump for putting an end to immorality by restoring the sanctity and dignity of human persons.”","summary":"The Oluwo of Iwo, Oba Abdulrosheed Akanbi, has commended the President of the United States of America, Donald Trump, for ending policies protecting lesbian, gay, bisexual, transgender, and queer or questioning rights. In an executive order issued immediately after his inauguration as the 48th President of the US, Trump recognized two sexes male and female, \n\n\n \n Read More","url":"https://punchng.com/oluwo-lauds-trump-on-lgtb-ban/","image":"https://cdn.punchng.com/wp-content/uploads/2020/02/15045021/Oluwo-of-Iwo.jpg","video":null,"publish_date":"2025-03-09 00:10:55","author":"Ismaeel Uthman","authors":["Ismaeel Uthman"],"language":"en","category":"politics","source_country":"ng","sentiment":0.136},{"id":298174772,"title":"Iran’s supreme leader refuses negotiations with the US regarding missile range and regional control.","text":"TEHRAN – Iran’s Supreme Leader Ayatollah Ali Khamenei said he rejects a U.S. push for talks between the two countries because they would be aimed at imposing restrictions on Iranian missile range and its influence in the region.\n\nSpeaking to a group of officials on Saturday, Khamenei did not identify the United States by name but said a “bullying government” was being persistent in its push for talks.\n\n“Their talks are not aimed at solving problems, it is for … let’s talk to impose what we want on the other party that is sitting on the opposite side of the table.”\n\nKhamenei’s remarks came a day after President Donald Trump acknowledged sending a letter to Khamenei seeking a new deal with Tehran to restrain its rapidly advancing nuclear program and replace the nuclear deal he withdrew America from during his first term in office.\n\nKhamenei said U.S. demands would be both military and related to the regional influence of Iran.\n\n“They will be about defense capabilities, about international capabilities of the country. (They will urge Iran) not to do (certain) things, not to meet some certain people, not to go to a certain place, not to produce some items, your missile range should not be more than a certain distance. Is it possible for anybody to accept these?”\n\nKhamenei, who has final say on all state matters, said such talks would not address solving problems between Iran and the West. Though Khamenei did not name any person or country, he said the push for talks creates pressure on Iran in public opinion. “It is not negotiation. It is commanding and imposition,” he said.\n\nTrump in comments to reporters in the Oval Office on Friday did not mention the letter directly. But he made a veiled reference to possible military action, saying: “We have a situation with Iran that, something’s going to happen very soon. Very, very soon.”\n\nHis overture comes as both Israel and the United States have warned they will never let Iran acquire a nuclear weapon, leading to fears of a military confrontation as Tehran enriches uranium at near weapons-grade levels — something only done by atomic-armed nations.\n\nTehran has long maintained its program is for peaceful purposes, even as its officials increasingly threaten to pursue the bomb as tensions are high with the U.S. over its sanctions and with Israel as a shaky ceasefire holds in its war against Hamas in the Gaza Strip.\n\nIran’s accelerated production of near weapons-grade uranium puts more pressure on Trump. He’s repeatedly said he’s open to negotiations with the Islamic Republic while also increasingly targeting Iran’s oil sales with sanctions as part of his reimposed “maximum pressure” policy.\n\nLate in August, Khamenei in a speech opened the door to possible talks with the U.S., saying there is “no harm” in engaging with the “enemy.” However, more recently the supreme leader tempered that, saying that negotiations with America “are not intelligent, wise or honorable,” after Trump floated nuclear talks with Tehran.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTEHRAN – Iran’s Supreme Leader Ayatollah Ali Khamenei said he rejects a&#8230;\n\n\nThis Post: Iran&#8217;s supreme leader refuses negotiations with the US regarding missile range and regional control. first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/irans-supreme-leader-refuses-negotiations-with-the-us-regarding-missile-range-and-regional-control/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/2AJCGXANMJDKHMZMFAHMJZFLMU.jpg","video":null,"publish_date":"2025-03-09 00:10:50","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.064},{"id":298174828,"title":"World News | Bangladeshi Firms Join Hands with US Telecom Giant Starlink","text":"Dhaka [Bangladesh], March 9 (ANI): Several Bangladeshi firms have partnered with Elon Musk's Starlink to support the setup of ground earth stations in Bangladesh, officials said on Saturday.\nThe firms have signed contracts with Starlink for collaboration, as a US telecommunications service provider team is currently visiting Bangladesh.\nAlso Read | Syria Unrest: 2 Days of Clashes Between Security Forces and Loyalists of Bashar Assad, Revenge Killings Leave More Than 600 People Dead.\nThe collaboration includes space allocation, construction support, and ongoing infrastructure maintenance.\nThe visit of the Starlink team helped Bangladeshi firms know a few locations of the former's interest.\nAlso Read | PM Narendra Modi, US President Donald Trump Agree To Push Forward Negotiations on Multi-Sector Bilateral Trade Agreement, Say Sources.\nIn some places, firms are providing support using their own properties, while at some locations, Starlink is considering the Hitech Park property.\nDiscussions on locations and implementation details are ongoing, the Special Assistant to the Chief Advisor, Faiz Ahmad Taiyeb said. Taiyeb hoped that Starlink would ensure reliable and high-speed internet in Bangladesh's cities and remote areas, northern regions, or coasts, free from the hassle of load shedding or natural disasters.\n\"It will ensure uninterrupted and high-quality service. Since the coverage of telecom-grade fibre networks in Bangladesh is limited and remote areas still have problems with load shedding, Starlink will accelerate the daily activities and digital economic initiatives of our entrepreneurs, freelancers, NGOs, and SME businesspeople,\" he said.\n\"We will continue to try to implement a sensible model with Starlink in the next 90 days,\" he added.\nBangladesh's Chief Adviser Professor Muhammad Yunus, in a letter to Musk on February 19, invited top US businessman and Chief Executive Officer of SpaceX, to visit Bangladesh and launch the Starlink satellite service in the country. The Chief Adviser told Musk that his visit to Bangladesh would allow him to meet young Bangladeshi men and women who will be among the main beneficiaries of this leading technology.\nThe Chief Adviser asked his High Representative, Khalilur Rahman, to coordinate closely with his SpaceX team to ensure completion of the necessary work to make Starlink ready for launch in Bangladesh within the next 90 working days.\nOn February 13, the Chief Adviser held an extensive telephonic discussion with Musk, the founder of SpaceX, Tesla, and X, to explore future collaboration and to make further progress in introducing Starlink satellite internet service in Bangladesh. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Several Bangladeshi firms have partnered with Starlink to support the setup of ground earth stations in Bangladesh, officials said on Saturday.","url":"https://www.latestly.com/agency-news/world-news-bangladeshi-firms-join-hands-with-us-telecom-giant-starlink-6696680.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250308183725.jpg","video":null,"publish_date":"2025-03-09 00:10:21","author":null,"language":"en","source_country":"in","sentiment":-0.035},{"id":298175760,"title":"Reddit is cracking down on users who upvote violent content","text":"Worried that upvoting a sensitive post on Reddit could get you in trouble? Now, it just might.Reddit's user base is growing rapidly as it is being hailed as one of the last truly \"social\" places online. Still, with growth comes volatility, and Reddit is now cracking down on users who interact with content that violates the site's rules.In a post on Wednesday, the site's administrators said that Reddit users who upvote \"several pieces of content banned for violating our policies\" within a short period will receive a warning. Reddit said it made the change because the site relies on \"engaged users\" to downvote bad content and report potentially violative content.\"Upvoting bad or violating content interferes with this system,\" the post says.The company says this policy is currently limited to a warning but is considering \"adding additional actions down the road.\"\"Voting comes with responsibility,\" the post says. \"This will have no impact on the vast majority of users as most already downvote or report abusive content.\"One Reddit user said in a post on Friday that Reddit's description of \"violent content\" in the new policy seemed too broad.\"What if I strongly dislike a fictional character from a television show or video game and want to express that in a hyperbolic way?\" the post reads. \"Now we have to dance around what we say and be paranoid that we'll be banned?Reddit does have broad rules for violent content. Still, the site's policy says that users can post violent content if it is \"educational, newsworthy, artistic, satire, documentary, etc.\"Last month, Reddit temporarily shut down the popular community r/whitepeopletwitter after several users made threatening comments against Elon Musk and the Department of Government Efficiency.Tensions between Reddit users and Musk grew in January after the moderators of over 100 subreddits moved to ban links to X following Musk's speech at President Donald Trump's inauguration, where he made a gesture that some interpreted as a fascist salute.Reddit told BI at the time of the temporary ban that it wants its communities used for \"civil discussion\" and \"one of the few places online where people can exchange ideas and perspectives.\"\"We want to ensure that they continue to be a place for healthy debate no matter the topic,\" the company said in a statement. \"Debate and dissent are welcome on Reddit — threats and doxxing are not.\"However, Reddit's content moderation system has not been without flaws. Reddit moderators said this week that the system flags the name \"Luigi\" for violent content, even when it is used in non-violent contexts. On Thursday, moderators for the popular subreddit r/popculture said they were forced to shut down the forum due to the censorship from Reddit's moderation system in a post.Reddit did not immediately return a request for comment from Business Insider about the content moderation system. A spokesperson for the company told The Verge that Reddit does not have a \"sitewide filter for the word 'Luigi' or expectation that users stop talking about Luigi Mangione,\" according to the outlet.Luigi Mangione, 26, is the Ivy-league grad suspect charged with shooting and killing United Healthcare CEO Brian Thompson in December 2024.Reddit told The Verge that r/popculture recently fell to just one moderator, allowing the subreddit to filter out potentially sensitive words automatically. The community's moderator told BI that they did not make a list of possibly sensitive words and said they think Reddit's content moderation is inconsistent.\"I've reported so many comments of people calling me or other people the f-slur, and Reddit tells me it doesn't violate their policies, but saying 'Luigi' does,\" the moderator said.Reddit cofounder Alexis Ohanian, who left the company in 2020, said last week that he thinks the future of social media will be moderated by AI, where users have \"sliders\" to \"choose their level of tolerance\" about certain topics.","summary":"Reddit is intensifying its crackdown on users upvoting rule-violating content, aiming to maintain a space for civil discussion amid rapid user growth.","url":"https://www.businessinsider.com/reddit-cracks-down-on-users-upvoting-violent-content-2025-3","image":"https://i.insider.com/67ccc4d9585f1dff88b19802?width=1200&format=jpeg","video":null,"publish_date":"2025-03-09 00:09:51","author":"Kenneth Niemeyer","authors":["Kenneth Niemeyer"],"language":"en","source_country":"US","sentiment":-0.143},{"id":298174786,"title":"King Charles will urge Commonwealth solidarity in his yearly speech during challenging times, amidst the monarch’s worries about Canada’s trade conflict with Trump.","text":"The King will call for unity during his annual Commonwealth Day address amid the monarch’s ‘concerns’ over Canada’s trade war with Donald Trump.\n\nCharles’ address will be published in full for Commonwealth Day on Monday, when the annual service celebrating the Commonwealth is attended by senior members of the royal family and a congregation of invited guests.\n\nIt comes as the the King is said to be concerned over Canada’s tariff war with the US, with the issue being ‘particularly on his mind’.\n\nOn Monday, he met the outgoing Canadian prime minister, Justin Trudeau, who has repeatedly clashed with the US president, at his private estate in Norfolk estate.\n\nTrump has been mocking Trudeau for months, threatening to annex Canada, of which Charles is head of state, as the 51st state and referring to the prime minister as ‘Governor Trudeau.’ \n\nAfter meeting with Charles, Trudeau posted on X confirming that the pair had discussed the issue saying: ‘We spoke about matters of importance to Canadians — including, above all, Canada’s sovereign and independent future.’ \n\nA source close to the King told the Times: ‘It is business as usual, but with everything on a heightened level of significance. Canada is particularly on his mind. Of course, he knows he has to be mindful of being the UK head of state and the head of state in Canada, as well as being the head of the Commonwealth. It does require delicate diplomacy, given that not everyone’s interests are aligned.’ \n\nThe US imposed 25 percent tariffs on all goods imported from Mexico and Canada rocketing the country into a trade war on Tuesday. \n\nBut just days later, Trump reversed his economic slap down saying that goods that are compliant with the North American free trade agreement with not be tariffed until April 2 and are apparently considering a similar carve out for Canada. \n\nDuring the Commonwealth Day service, The King will tell the gathering at Westminster Abbey: ‘In these uncertain times, where it is all too easy to believe that our differences are problems instead of a source of strength and an opportunity for learning, the Commonwealth’s remarkable collection of nations and peoples come together in the spirit of support and, crucially, friendship.’\n\nCharles will also say: ‘The Commonwealth’s ability to bring together people from all over the world has stood the test of time and remains as ever-important today.’\n\nTrudeau is set to officially transition to a new leader once his Liberal Party holds leadership elections on Sunday. That new leader will soon face a national election shortly after.\n\nHe is trying to have some semblance of a victory lap after being forced to resign when it appeared he could not win the next election.\n\nAt a press conference in Ottawa discussing childhood health care, he clearly saw the end of the line and became emotional.\n\n‘On a personal level, I made sure that every single day in this office, I put Canadians first and I have peoples’ backs and that’s why I’m here to tell you all that we got you, even in the last days of this government, we will not let Canadians down today and well into the future,’ he said as he’d clearly started to cry.\n\nHe added that he is to looking forward to ‘a transition to my duly elected successor in the coming days or week.’\n\nMeanwhile, Trump continues to mock Trudeau and had his doubts that the prime minister was stepping down for good. \n\n‘Believe it or not, despite the terrible job he’s done for Canada, I think that Justin Trudeau is using the Tariff problem, which he has largely caused, in order to run again for Prime Minister. So much fun to watch!’\n\nThe next Canadian election will be held no later than October 20, 2025. \n\nThis year’s Commonwealth Day theme is Together We Thrive, which celebrates the ‘enduring spirit of the Commonwealth family’. \n\nThe King, who is head of the Commonwealth, gives an annual address each year to the family of 56 nations, but last year pre-recorded a video message, after postponing his public-facing duties for about three months after being diagnosed with cancer.\n\nThe Princess of Wales also missed the service last year, a key event in the royal calendar, after also being diagnosed with cancer, but will be among the congregation alongside the King, Queen and Prince of Wales.\n\nKate is still making a gradual return to public duties after saying she is in remission.\n\nWilliam, Kate, Charles and Camilla will be joined by the Princess Royal and the Duke and Duchess of Gloucester for the service, said Buckingham Palace.\n\nDuring the service, singer-songwriter Joan Armatrading will perform an arrangement of her well-known hit Love And Affection for the 2,000-strong congregation. \n\nOn the same day, the King will launch the inaugural King’s Baton Relay at Buckingham Palace, officially starting the countdown to the Glasgow 2026 Commonwealth Games.\n\nIt marks the 18th official Commonwealth Games relay, and Charles’s first as King.\n\nHe will place a message inside the baton, which will be sealed and kept closed until the opening ceremony next summer, when his words will be read out to signal the start of the competition.\n\nCharles will hand the baton to the first baton-bearer, six-time Olympic champion cyclist Sir Chris Hoy.\n\nSir Chris, who has terminal prostate cancer, will walk through the Palace’s Quadrangle to the Centre Arch, along a pathway lined by pipers from the Shree Muktajeevan Swamibapa Pipe Band London.\n\nCharles and Camilla will also be guests of the Commonwealth secretary-general, Baroness Scotland, at the annual Commonwealth Day reception on Monday and hear a commemorative song by Lord Lloyd-Webber to mark the inaugural Commonwealth Peace Prize.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe King will call for unity during his annual Commonwealth Day address amid&#8230;\n\n\nThis Post: King Charles will urge Commonwealth solidarity in his yearly speech during challenging times, amidst the monarch&#8217;s worries about Canada&#8217;s trade conflict with Trump. first appeared on Internewscast Journal","url":"https://internewscast.com/news/king-charles-will-urge-commonwealth-solidarity-in-his-yearly-speech-during-challenging-times-amidst-the-monarchs-worries-about-canadas-trade-conflict-with-trump/","image":"https://i.dailymail.co.uk/1s/2025/03/08/23/83040587-0-King_Charles_address_will_be_published_in_full_for_Commonwealth_-m-6_1741476092806.jpg","video":null,"publish_date":"2025-03-09 00:08:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.398},{"id":298172942,"title":"Albo’s huge call on Ukraine mission","text":"In defiance of US President Donald Trump’s public dressing down of Ukrainian President Volodymyr Zelensky for being “disrespectful” to the US, the British Prime Minister is leading talks to support Ukrainians and prepare a peacekeeping force.\n\nBut it’s set up a clash with Peter Dutton who has warned the Liberal Party won’t support Australia sending troops to the peacekeeping force in Europe.\n\nThe clash between Mr Trump and Mr Zelensky was followed this week by President Trump pausing all US military aid and intelligence-sharing with Kyiv before Russia conducted a large-scale missile and drone attack on Ukraine’s energy infrastructure.\n\n“I think he’s hitting them [Ukraine] harder than he’s been hitting them,” Mr Trump said. “And I think probably anyone in that position would be doing that right now.”\n\nWhat is the Coalition of the Willing?\n\nBritain and France have been leading efforts to form the so-called “coalition of the willing”.\n\nBritish Prime Minister Keir Starmer “spoke to the Prime Minister of Australia Anthony Albanese this morning,” the UK leader’s office said on Saturday.\n\n“He welcomed Prime Minister Albanese’s commitment to consider contributing to a Coalition of the Willing for Ukraine and looked forward to the Chiefs of Defence meeting in Paris on Tuesday.”\n\nAsked about the discussions in Canberra on Sunday, the Prime Minister said he had a “very constructive discussion with the British Prime Minister, Keir Starmer, last night.”\n\n“We did discuss the issue of Ukraine and the coalition of the willing, as he has put it, going forward,’’ Mr Albanese said.\n\n“There will be a meeting of chiefs of Defence in Paris on Tuesday. Australia will send a senior representative to that meeting to discuss, going forward, both of our nations are very clear about our support for Ukraine and it of course is too early — you can’t have peacekeeping forces without having peace.”\n\nMr Albanese said it was “too early” to say exactly what from that contribution would be.\n\n“But I certainly have said, very clearly, publicly, repeatedly, that we would give consideration to participating in any peacekeeping mission in the Ukraine,” he said. \n\n“And on Tuesday, Australia will participate in this meeting of chiefs of Defence Forces or their representatives.”\n\n“There is no mission at this point in time. You can’t have a peacekeeping mission without having peace. We discussed a range of issues, some of which in the nature of things with diplomacy and one that I always respect will remain as discussions between us.”\n\nThe Prime Minister flagged the prospect of Australia sending peace-keeping troops to Ukraine this week, declaring he was “open” to considering any requests for help.\n\n“Well, our position on Ukraine is very clear. We stand with the people of Ukraine and we stand with President Zelenskyy,’’ he said.\n\n“And the brave struggle of the people of Ukraine to defend their natural sovereignty, but also what they’ve fighting for is the international rule of law.\n\n“Now Australia stands ready to assist. We have contributed $1.5 billion with $1.3 billion for military assistance directly.\n\n“There’s discussion at the moment about potential peacekeeping. And from my government’s perspective, we’re open to consideration of any proposals going forward, as Australia has historically played an important role in areas including in Africa, in Cyprus, in a range of peacekeeping areas.\n\n“We want to see peace in Ukraine. But we want to make sure the illegal, immoral actions of Russia are not rewarded, and that Vladimir Putin and his designs that are imperialistic are not rewarded or encouraged.”\n\nIn the most forward-leaning statements today on the possibility of a peacekeeping role, Mr Albanese stressed no final decisions had been made.\n\n“We haven’t been asked for anything, there’s proposals discussed,’’ he said.\n\n“If a request is made, we would give consideration to it. With regard to the US, the US is an important ally of Australia. It’s an alliance between our nations. With regard to Australia’s foreign policy, Australia determines our foreign policy. It’s in Australia’s national interest to stand with Ukraine and that’s what our government is doing.”\n\nBlue beret UN peacekeeping force \n\nGovernment sources say if Australia does contribute to a peacekeeping force they would go in the “blue beret” of the UN peacekeeping force.\n\nBritain’s Prime Minister Keir Starmer has proposed the deployment of around 30,000 European peacekeeping troops in Ukraine.\n\nOvernight, Mr Starmer told the British Parliament that a “coalition of the willing” could provide boots on the ground in Ukraine in the event of a ceasefire.\n\n“The UK is prepared to back this with boots on the ground and planes in the air, together with others. Europe must do the heavy lifting,’’ he said.\n\nThe Coalition of the Willing phrase was a central theme of Sir Keir Starmer’s speech after European leaders gathered in London for crucial talks about Ukraine’s future.\n\nLed by the UK and France, the initiative could see troops from a number of European and NATO countries deployed to Ukraine as peacekeepers in order to deter Vladimir Putin from rearming and attacking again in the future.\n\nDuttton won’t support boots on the ground\n\nIn reaction to Mr Albanese’s comments, Mr Dutton said he did not support putting Australian troops on the ground despite being “honest and upfront in our support and very proud of our support of Ukraine from day one.”\n\nThat’s a serious barrier to sending Australian troops as part of a peacekeeping force on the eve of an election, considering the government could be entering caretaker mode within days.\n\n“We should continue to provide support to Ukraine. We have been involved in training and providing support to Ukraine soldiers and I think that should continue,’’ Mr Dutton said.\n\n“In terms of if we should have boots on the ground, in Ukraine, I don’t see that. I think the Europeans have that task but what Donald Trump pointed out is the Europeans need to do more in the defence of Europe and that is a statement of the obvious.\n\n“The Americans have a focus on other theatres and areas of engagement and that is appropriate and I think the fact that NATO countries are spending more or are committing to spending more in their defence budget is a good thing and I commend Keir Starmer for his leadership.”","summary":"Anthony Albanese and the British PM have held talks about the prospect of Australia joining the “Coalition of the Willing” in Ukraine.","url":"https://www.news.com.au/national/politics/anthony-albanese-holds-talks-with-british-pm-about-australias-role-in-ukraine/news-story/9e4d12897e331e4dd2002ef62c66026a?from=rss-basic","image":"https://content.api.news/v3/images/bin/c42d37dfeb96c8038e238c043d34ba80","video":null,"publish_date":"2025-03-09 00:06:24","author":"Samantha Maiden","authors":["Samantha Maiden"],"language":"en","category":"politics","source_country":"au","sentiment":0.026},{"id":298175756,"title":"Nigel Farage's poll rating tumbles after Reform leader blamed Zelensky for 'showing no respect' during Oval Office bust up with Donald Trump","text":"Nigel Farage's poll rating tumbles after Reform leader blamed Zelensky for 'showing no respect' during Oval Office bust up with Donald Trump\n\nPODCAST: Trump’s tariff whiplash, Trudeau’s tears, and Hunter Biden’s ‘sugar brother’ – on the latest episode of Welcome to MAGAland\n\nBy GLEN OWEN POLITICAL EDITOR\n\nPublished: 23:55 GMT, 8 March 2025 | Updated: 00:06 GMT, 9 March 2025\n\nNigel Farage's support for Donald Trump over the Ukraine crisis has slammed the brakes on the 'detoxification' of the Reform leader which has been under way since the election.\n\nBefore the row between Mr Trump and Ukraine's president Volodymyr Zelensky, polling data ranked Mr Farage as the most popular party leader.\n\nAfter those surveyed were asked if they liked or disliked each leader, Mr Farage achieved an average score of -30 in the YouGov poll, compared with -40 for Labour's Sir Keir Starmer and -36 for the Tories' Kemi Badenoch.\n\nBut following Mr Farage's remarks about the White House row between Mr Trump and Mr Zelensky, in which he blamed the Ukrainian for playing the meeting 'very badly' and 'bowling in and showing no respect' for the US President, the Reform chief is now the least popular leader, with -39.\n\nSir Keir is up to -28 after his support for Mr Zelensky, while Ms Badenoch is on -30.\n\nUntil his criticism, Mr Farage had been moving quickly from the margins to the mainstream, increasingly seen as the leader of a respectable organisation rather than a 'protest vote party'.\n\nPollsters say the perception that Mr Farage is too close to Mr Trump and too sympathetic to president Putin is Reform's 'weak flank' which can be attacked by Labour and the Tories.\n\nHis feud with Reform MP Rupert Lowe is likely to halt his advance in the polls even further.\n\nMr Farage, a vocal cheerleader for the US President, accused Zelensky of 'overplaying his hand' and sparking the astonishing televised spat with Mr Trump and Vice-President JD Vance\n\nMr Trump sparked global outrage during the Oval Office meeting by accusing Mr Zelensky of 'gambling with World War Three' and saying that he had not expressed enough thanks for US aid in defending his country against Putin 's invasion\n\nNigel Farage blames ZELENSKY for Trump row at the White House by showing 'no respect' for president\n\nWhen Mr Farage was asked in 2014 which world leader he most admired, he said: 'As an operator, but not as a human being, I would say Putin. The way he played the whole Syria thing. Brilliant. Not that I approve of him politically.'\n\nMr Trump sparked global outrage during the Oval Office meeting by accusing Mr Zelensky of 'gambling with World War Three' and saying that he had not expressed enough thanks for US aid in defending his country against Putin's invasion.\n\nMr Farage, a vocal cheerleader for the US President, accused Zelensky of 'overplaying his hand' and sparking the astonishing televised spat with Mr Trump and Vice-President JD Vance during an interview with LBC last week. \n\nHe said Ukraine was a 'corrupt country' and had to accept it was not getting territory such as the Crimea back. \n\nHe added: 'If I turned up at the White House I would make sure I was wearing a suit and my shoes were clean.'\n\nAfter it was pointed out that the Ukrainian president was following in the footsteps of leaders such as Sir Winston Churchill in visiting in battle fatigues, he added: 'If Zelensky wants to bowl in and show no respect to a man who we all know is incredible old fashioned about this stuff... if you are going in with a positive mindset maybe Zelensky should have thought about that.' \n\n'Zelensky was very unwise to tell the Americans what would happen to them if they didn't back him,' he added.\n\n'It was unwise, yes sure Vance and Trump bit back, but I think in diplomatic terms Zelensky played it very badly.\n\n'I wouldn't expect a guest to be rude to me in my own house, absolutely not.\n\n'I would expect a guest to treat me with respect.'\n\nLabourDonald TrumpWhite HouseUkraine\n\nShare or comment on this article:\nNigel Farage's poll rating tumbles after Reform leader blamed Zelensky for 'showing no respect' during Oval Office bust up with Donald Trump\n\nAdd comment","summary":"Following Mr Farage's remarks about the White House row between Mr Trump and Mr Zelensky, the Reform chief is now the least popular leader, with a -39 approval rating.","url":"https://www.dailymail.co.uk/news/article-14477667/Nigel-Farage-rating-Reform-Zelensky-Oval-Office-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/03/08/23/95992145-0-image-m-133_1741477820630.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/03/7396403261564892074/1024x576_MP4_7396403261564892074.mp4","publish_date":"2025-03-09 00:06:00","author":"Editor,Glen Owen","authors":["Editor","Glen Owen"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.11},{"id":298175974,"title":"Smash-and-grab burglaries on the rise at Dublin eateries amid 'perfect storm' for crime","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSports meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nFile photo.Alamy Stock Photo\n\nThe Morning Lead\n\nSmash-and-grab burglaries on the rise at Dublin eateries amid 'perfect storm' for crime\n\nAcross Dublin, a total of 3,729 burglaries or related offences were recorded in the span of just 12 months up to September 2024.\n\n12.06am, 9 Mar 2025\n\nShare options\n\nAN INCREASE IN break-ins and burglaries from food businesses in Dublin city and beyond has majorly impacted small businesses, seemingly caused by “a perfect storm” of factors plaguing the retail and hospitality sector.\n\nAt least five break-ins were reported across popular food locations across Dublin during a single week in February – impacting Mediterranean restaurant Kicky’s on George’s Street, pop-up pizza truck Goats Gruff at the Strawberry Beds and coffee shop It’s A Trap on Aungier Street.\n\nAccording to the latest CSO data, there were 878 more burglaries nationwide in 2024 compared to the previous year.\n\nIn the Dublin area, a total of 3,729 burglaries or related offences were recorded in the span of just 12 months up to September 2024, up 7% on figures last year. \n\n1,453 robberies occurred in Dublin over the same period.\n\nWith Dublin-based restaurants and food businesses, burglaries and robberies mostly follow a similar pattern – the culprits break the glass at the entrance with a tool or blunt object, enter the premises with their faces hidden behind a helmet or a balaclava, and go straight to the cash register, which they break to take what is inside.\n\nWhile gardaí have apprehended a number of these thieves in recent months, the perception among small business owners seems to be a “lack of action” in terms of safety and security.\n\n‘Life-changing’\n\nTom Brennan, owner of Stillorgan-based coffee shop Motley Brue, said it’s “a wonder that anyone opens a coffee shop these days”.\n\nMotley Brue were broken into last month – a group of three masked figures smashed the front door to the shop using a crowbar before the coffee shop opened.\n\nThe culprits took several hundred euros in cash from the business, before fleeing in a car.\n\nThe front door at Motley Brue was smashed during the burglary.Andrew Walsh / The Journal\n\nAndrew Walsh / The Journal / The Journal\n\n“You put so much time and effort into businesses like this, that even a few hundred euro can be life-changing for a small business in the worst way possible,” Tom said.\n\nWhile the business has since reopened, Tom noted that the problem “seems to be worsening” in Dublin, which he says could be due to a declining garda presence.\n\n“A lot of areas in Dublin City centre have gone downhill in terms of safety from theft – people definitely think that they can get away with it more,” he said.\n\n“You see a lot of stuff in the news about declining garda numbers, and I suppose people know that when they’re considering committing crimes now”.\n\nAccording to a survey from retail group Shelflife, 67% of business owners have expressed dissatisfaction with garda response times, leaving businesses vulnerable for extended periods.\n\nAlmost nine in ten business owners also reported no visible garda presence in their area.\n\nTom added that while while the garda response was “quite quick” for the Motley Brue break-in (they arrived within minutes of the incident), overall visible presence of gardaí across Dublin is low.\n\n“Dublin city centre is definitely worse than here for garda presence – and that would leave you very concerned as a business owner.\n\n“Who are you going to turn to? We’re ok here, but God help you in you’re in the city. These break-ins are definitely on the rise.”\n\nAdvertisement\n\nThe door of Motley Brue has been boarded up since the incident.Andrew Walsh / The Journal.\n\nAndrew Walsh / The Journal. / The Journal.\n\nFrayank Nunez, the owner of coffee shop It’s A Trap on Aungier street, echoed these concerns following a break-in to his business.\n\n“Even in the short span of time since I started working here, I’ve seen that the south inner city is not as safe as it used to be,” Nunez said.\n\n“There needs to be more active gardaí in the area. The futility of running a business here hits hard when this keeps happening.”\n\n‘There has to be consequences’\n\nVincent Jennings, the CEO of the Convenience Stores and Newsagents Association (CSNA), which has 1,500 members across the country, told The Journal that the organisation has concerns over the safety of businesses across Ireland.\n\nJennings said that there is “an urgent need” for stronger legislative protections and enhanced garda response times, as criminal activity continues to cripple the retail and hospitality sectors.\n\n“[Business owners] are facing unprecedented levels of crime that threaten their livelihoods,” Jennings said.\n\nHe added that there “is no one reason” for the recent surge in crimes, but believes that heightened anti-social activity, declining garda visibility and “weak” conviction levels may have contributed to the current situation.\n\nSo what can be done about it?\n\n“We are calling on the government to act. It’s time to introduce stronger protections,” Jennings said.\n\nThe CSNA launched a campaign for business safety in late 2024, advocating for stronger legal protections for business owners, the introduction of night courts and direct access to local garda stations for businesses.\n\n“It is a reality that must be dealt with, for the safety of the workers, as well as for the obvious economic damage such crimes generate for companies,” Jennings said.\n\n“Direct access to local garda stations would mean faster responses for businesses rather than relying on 999 calls, which can understandably take longer due to call backlogs.”\n\nJennings added that the CSNA has campaigned for enforced standards for garda response times “to support retailers in a timely manner”.\n\n‘A perfect storm’\n\nEx-garda inspector Tony Gallagher says that the problem is not stronger criminal convictions, but rather that the problem lies with “the courts themselves”.\n\nThe former Dublin-based garda said that Dublin faces “a perfect storm”, as courts are restricted in applying sentences to those found guilty of thefts and burglaries due to prison overcrowding.\n\nGallagher adds that the problem is worse in relation to convicted burglars and thieves under the age of 18 – as the country’s only youth detention centre, Oberstown, is at full capacity.\n\nA Department of Children spokeswoman confirmed to The Journal last month that there are just 46 spaces for children at Oberstown, and this is limited by an order of the Minister to prevent overcrowding.\n\n“Bail laws are being too liberal because prosecutors would be privy to Irish prison numbers, and they know that there is not any space for them – for every person that you commit, somebody has to come out,” Gallagher said.\n\nThe cry for tougher sentences is only a gallery statement for politicians and others to say that they are “tough on crime”.\n\nHe added that burglaries are a “particularly hard crime to solve”.\n\n“Unless you catch them in the action or they leave a forensic yield behind them, the chances of getting are slim,” Gallagher explained.\n\n“The gardaí may have to consider increasing the garda presence in areas vulnerable to such robberies.”\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nAndrew Walsh\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Smash-and-grab burglaries on the rise at Dublin eateries amid 'perfect storm' for crime”.\n\nRecipient's Email\n\nFeedback on “Smash-and-grab burglaries on the rise at Dublin eateries amid 'perfect storm' for crime”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nburglaries on the menu\nDublin break-ins\nrestaurant robberies\nthe morning lead\n\nNews in 60 seconds\n\nbecoming a parent\nParenting: When I became a mother, I didn't know it would turn me into a total softie\n\nQuiz: How much do you know about France?\n\nInvestigation\nSinn Féin TD Thomas Gould says he is ‘entirely innocent’ after being questioned by gardaí over €150k fraud\n\nHere's What Happened Today: Saturday\n\ntriple lock\nDoes the UN Security Council have final say when it comes to sending Irish troops abroad? \n\nGaza protesters vandalise Donald Trump's Scottish golf resort\n\nceasefire deal\nFamilies of Israeli hostages and freed captives urge Netanyahu to implement Gaza deal\n\nThe Morning Lead\nIreland's biggest private landlord looks to add monthly €200 'common area' fee to apartment block\n\nEoghan Dalton\n\nGarda hospitalised after being stabbed with broken bottle in Dublin city centre this afternoon\n\nInvestigation\nHarris says Oireachtas member arrested in garda fraud investigation 'not a member of Fine Gael'\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Across Dublin, a total of 3,729 burglaries or related offences were recorded in the span of just 12 months up to September 2024.","url":"https://www.thejournal.ie/burglaries-restaurant-coffee-shop-dublin-on-the-rise-6631850-Mar2025/","image":"https://img2.thejournal.ie/article/6631850/river/?height=400&version=6632009","video":null,"publish_date":"2025-03-09 00:05:41","author":null,"language":"en","source_country":"ie","sentiment":-0.017},{"id":298176492,"title":"Some protesters took aim at US President Donald Trump","text":"Some protesters took aim at US President Donald Trump | National News | guampdn.com\n\nSkip to main content\n\nYou have permission to edit this image.\n\nSome protesters took aim at US President Donald Trump\n\nMartin BUREAU\n\nPartners/afp\n\nAs featured on\n\nFrench throng streets for International Women's Day rallies\n\nTens of thousands across France packed rallies for International Women's Day on Saturday, taking aim at persistent gender pay gaps, violence against women and male-dominated politics.\n\nFire near Wusstig Road in Dededo\n\nLatest E-Edition\n\nPacific Daily News\n\nPacific Daily News\n\nTrending Now\n\n$27.8M in 2024 income tax refunds paid this week\n\nComplaint: Man armed with knives breaks into home, kicks child\n\nAsh Wednesday 2025: Here's the Mass schedule\n\nGPD: Woman in hit-and-run dies from injuries, identified as Thillia Nathan\n\nFeds inspecting Guam, Saipan businesses as worksite immigration raids go national; FSM, Philippine consular offices weigh in\n\nLocal Events\n\nClassifieds","summary":"Some protesters took aim at US President Donald Trump","url":"https://www.guampdn.com/news/national/some-protesters-took-aim-at-us-president-donald-trump/image_1a2831b6-cfa2-5b02-b470-ec0ed0b540fc.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/1/a2/1a2831b6-cfa2-5b02-b470-ec0ed0b540fc/67cc97607f776.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2025-03-09 00:03:47","author":"Martin Bureau","authors":["Martin Bureau"],"language":"en","category":"politics","source_country":"GU","sentiment":-0.221},{"id":298176498,"title":"US unemployment is low but experts warn highly-skilled federal workers returning to the labor market may have trouble finding new jobs","text":"US unemployment is low but experts warn highly-skilled federal workers returning to the labor market may have trouble finding new jobs | National News | guampdn.com\n\nSkip to main content\n\nYou have permission to edit this image.\n\nUS unemployment is low but experts warn highly-skilled federal workers returning to the labor market may have trouble finding new jobs\n\nAlex WROBLEWSKI\n\nPartners/afp\n\nAs featured on\n\n'Grieving': US federal workers thrown into uncertain job market\n\nUnprecedented cuts to the US government overseen by President Donald Trump's billionaire advisor Elon Musk are sending thousands of federal workers and contractors back to the labor market -- but experts warn that hiring is low at this time.\n\nFire near Wusstig Road in Dededo\n\nLatest E-Edition\n\nPacific Daily News\n\nPacific Daily News\n\nTrending Now\n\n$27.8M in 2024 income tax refunds paid this week\n\nComplaint: Man armed with knives breaks into home, kicks child\n\nAsh Wednesday 2025: Here's the Mass schedule\n\nGPD: Woman in hit-and-run dies from injuries, identified as Thillia Nathan\n\nFeds inspecting Guam, Saipan businesses as worksite immigration raids go national; FSM, Philippine consular offices weigh in\n\nLocal Events\n\nClassifieds","summary":"US unemployment is low but experts warn highly-skilled federal workers returning to the labor market may have trouble finding new jobs","url":"https://www.guampdn.com/news/national/us-unemployment-is-low-but-experts-warn-highly-skilled-federal-workers-returning-to-the-labor/image_9100358d-1d5b-5533-8dfc-b45044cf5c28.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/9/10/9100358d-1d5b-5533-8dfc-b45044cf5c28/67cca5528da64.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2025-03-09 00:03:25","author":"Alex WROBLEWSKI","authors":["Alex WROBLEWSKI"],"language":"en","category":"politics","source_country":"GU","sentiment":-0.303},{"id":298174784,"title":"King Charles will urge Commonwealth to come together during challenging period in his yearly speech – amid worries over Canada’s trade conflict with Trump","text":"The King will call for unity during his annual Commonwealth Day address amid the monarch’s ‘concerns’ over Canada’s trade war with Donald Trump.\n\nCharles’ address will be published in full for Commonwealth Day on Monday, when the annual service celebrating the Commonwealth is attended by senior members of the royal family and a congregation of invited guests.\n\nIt comes as the the King is said to be concerned over Canada’s tariff war with the US, with the issue being ‘particularly on his mind’.\n\nOn Monday, he met the outgoing Canadian prime minister, Justin Trudeau, who has repeatedly clashed with the US president, at his private estate in Norfolk estate.\n\nTrump has been mocking Trudeau for months, threatening to annex Canada, of which Charles is head of state, as the 51st state and referring to the prime minister as ‘Governor Trudeau.’ \n\nAfter meeting with Charles, Trudeau posted on X confirming that the pair had discussed the issue saying: ‘We spoke about matters of importance to Canadians — including, above all, Canada’s sovereign and independent future.’ \n\nA source close to the King told the Times: ‘It is business as usual, but with everything on a heightened level of significance. Canada is particularly on his mind. Of course, he knows he has to be mindful of being the UK head of state and the head of state in Canada, as well as being the head of the Commonwealth. It does require delicate diplomacy, given that not everyone’s interests are aligned.’ \n\nThe US imposed 25 percent tariffs on all goods imported from Mexico and Canada rocketing the country into a trade war on Tuesday. \n\nBut just days later, Trump reversed his economic slap down saying that goods that are compliant with the North American free trade agreement with not be tariffed until April 2 and are apparently considering a similar carve out for Canada. \n\nDuring the Commonwealth Day service, The King will tell the gathering at Westminster Abbey: ‘In these uncertain times, where it is all too easy to believe that our differences are problems instead of a source of strength and an opportunity for learning, the Commonwealth’s remarkable collection of nations and peoples come together in the spirit of support and, crucially, friendship.’\n\nCharles will also say: ‘The Commonwealth’s ability to bring together people from all over the world has stood the test of time and remains as ever-important today.’\n\nTrudeau is set to officially transition to a new leader once his Liberal Party holds leadership elections on Sunday. That new leader will soon face a national election shortly after.\n\nHe is trying to have some semblance of a victory lap after being forced to resign when it appeared he could not win the next election.\n\nAt a press conference in Ottawa discussing childhood health care, he clearly saw the end of the line and became emotional.\n\n‘On a personal level, I made sure that every single day in this office, I put Canadians first and I have peoples’ backs and that’s why I’m here to tell you all that we got you, even in the last days of this government, we will not let Canadians down today and well into the future,’ he said as he’d clearly started to cry.\n\nHe added that he is to looking forward to ‘a transition to my duly elected successor in the coming days or week.’\n\nMeanwhile, Trump continues to mock Trudeau and had his doubts that the prime minister was stepping down for good. \n\n‘Believe it or not, despite the terrible job he’s done for Canada, I think that Justin Trudeau is using the Tariff problem, which he has largely caused, in order to run again for Prime Minister. So much fun to watch!’\n\nThe next Canadian election will be held no later than October 20, 2025. \n\nThis year’s Commonwealth Day theme is Together We Thrive, which celebrates the ‘enduring spirit of the Commonwealth family’. \n\nThe King, who is head of the Commonwealth, gives an annual address each year to the family of 56 nations, but last year pre-recorded a video message, after postponing his public-facing duties for about three months after being diagnosed with cancer.\n\nThe Princess of Wales also missed the service last year, a key event in the royal calendar, after also being diagnosed with cancer, but will be among the congregation alongside the King, Queen and Prince of Wales.\n\nKate is still making a gradual return to public duties after saying she is in remission.\n\nWilliam, Kate, Charles and Camilla will be joined by the Princess Royal and the Duke and Duchess of Gloucester for the service, said Buckingham Palace.\n\nDuring the service, singer-songwriter Joan Armatrading will perform an arrangement of her well-known hit Love And Affection for the 2,000-strong congregation. \n\nOn the same day, the King will launch the inaugural King’s Baton Relay at Buckingham Palace, officially starting the countdown to the Glasgow 2026 Commonwealth Games.\n\nIt marks the 18th official Commonwealth Games relay, and Charles’s first as King.\n\nHe will place a message inside the baton, which will be sealed and kept closed until the opening ceremony next summer, when his words will be read out to signal the start of the competition.\n\nCharles will hand the baton to the first baton-bearer, six-time Olympic champion cyclist Sir Chris Hoy.\n\nSir Chris, who has terminal prostate cancer, will walk through the Palace’s Quadrangle to the Centre Arch, along a pathway lined by pipers from the Shree Muktajeevan Swamibapa Pipe Band London.\n\nCharles and Camilla will also be guests of the Commonwealth secretary-general, Baroness Scotland, at the annual Commonwealth Day reception on Monday and hear a commemorative song by Lord Lloyd-Webber to mark the inaugural Commonwealth Peace Prize.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe King will call for unity during his annual Commonwealth Day address amid&#8230;\n\n\nThis Post: King Charles will urge Commonwealth to come together during challenging period in his yearly speech &#8211; amid worries over Canada&#8217;s trade conflict with Trump first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/king-charles-will-urge-commonwealth-to-come-together-during-challenging-period-in-his-yearly-speech-amid-worries-over-canadas-trade-conflict-with-trump/","image":"https://i.dailymail.co.uk/1s/2025/03/08/23/83040587-0-King_Charles_address_will_be_published_in_full_for_Commonwealth_-m-6_1741476092806.jpg","video":null,"publish_date":"2025-03-09 00:02:56","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.398},{"id":298177494,"title":"Cyndi Lauper revealed she 'cried' after iconic song was turned into feminist slogan","text":"Girls Just Want To Have Fun hitmaker Cyndi Lauper, who is still gigging into her 70s, confessed she “cried” after seeing the title of her hit song had been modified and turned into a feminist slogan. \n\nThe singing star, 71, well-known for her activism as well as her songs, was asked what it has meant to her, to witnessbanners at women’s marches saying 'Girls just want to have fundamental rights'. “When I saw that, I cried a little, because I used to get in a lot of trouble for talking about women’s rights,” she told Lauren Laverne on BBC Radio 4’s Desert Island Discs. \n\n“When I saw that, I called up my friends that I started the True Colours Fund with, and I said, ‘Let’s start the Girls Just Want To Have Fundamental Rights Fund, come on’, which helps women’s health, safe and legal abortion, prenatal care, postnatal care, cancer screenings and everything having to do with women’s health and promotion of women. So we do that and we raise money and fund organisations all over the world.”\n\nBack in 2008, the New Yorker co-founded True Colours United (formerly True Colours Fund), an organisation focusing on youth homelessness and the LGBT+ community, in 2008. She announced her donor-advised fund, formed to financially support women’s issues, in 2022, following protests in support of abortion rights after the Supreme Court repealed Roe v Wade.\n\n The protests took place five years on from the global Women’s March that was organised after the first inauguration of US President Donald Trump. She added: “Well, they (things) change and they don’t. The fact that Taylor Swift had to justify herself, I was like, ‘Are you kidding?’ I’m freaking so proud of that young woman. What a good example.\n\n“I’m happy watching all these young women, and I know that there’ll always be struggles, but you just always got to take a step back, and there’s always going to be gatekeepers, and just figure out how to get around them. Find like-minded people doing similar things that you aspire to do, and know that there are still artist collectives that you could join, and achieve what it is you want.”\n\nOn the idea of her legacy, she added: “I was told one time by a very prominent, very important male figure of the industry, that said that we were making disposable music. And I took issue with that because I did not make disposable music, and I don’t do that.” She added: “Just do the best you can, and don’t make disposable music, or make music that makes people happy. Find some songs that help people, and you can leave that behind and do some great work.”\n\nLauper, who performed at Glastonbury Festival last year, is known for hits including Time After Time, Money Changes Everything and True Colours. While performing Girls Just Want To Have Fun on the Pyramid Stage, she referred to feminist marches and said she went out and saw the signs about girls wanting “fundamental rights”.\n\nThe star has won two Grammy Awards, one for best new artist in 1985, and the other for best musical theatre album for Broadway and West End musical Kinky Boots, for which she wrote the music in the 2010s.\n\n* Follow Mirror Celebs on Snapchat, Instagram, Twitter, Facebook, YouTube and Threads.","summary":"Pop icon Cyndi Lauper, 71, admits she 'cried a little' when the title of her hit song Girls Just Want To Have Fun was changed and turned into a slogan for the feminist movement","url":"https://www.mirror.co.uk/3am/celebrity-news/cyndi-lauper-revealed-cried-after-34822779","image":"https://i2-prod.mirror.co.uk/incoming/article34624494.ece/ALTERNATES/s1200/3_2019-Billboard-Women-In-Music-Arrivals.jpg","video":null,"publish_date":"2025-03-09 00:01:00","author":"Hannah Roberts,Shelley Spadoni","authors":["Hannah Roberts","Shelley Spadoni"],"language":"en","source_country":"gb","sentiment":0.155},{"id":298174460,"title":"Cyndi Lauper ‘cried’ after song title was made into feminist slogan for protests","text":"Girls Just Want To Have Fun singer Cyndi Lauper said she “cried” after seeing the title of her hit song had been modified and turned into a feminist slogan.\n\nThe New York-born music star, 71, who is known for her activism as well as her songs, was asked what it has meant to see banners at women’s marches saying “Girls just want to have fundamental rights”.\n\n“When I saw that, I cried a little, because I used to get in a lot of trouble for talking about women’s rights,” she told Lauren Laverne on BBC Radio 4’s Desert Island Discs.\n\n“When I saw that, I called up my friends that I started the True Colours Fund with, and I said, ‘Let’s start the Girls Just Want To Have Fundamental Rights Fund, come on’, which helps women’s health, safe and legal abortion, prenatal care, postnatal care, cancer screenings and everything having to do with women’s health and promotion of women.\n\n“So we do that and we raise money and fund organisations all over the world.”\n\nLauper co-founded True Colours United (formerly True Colours Fund), an organisation focusing on youth homelessness and the LGBT+ community, in 2008.\n\nShe announced her donor-advised fund, formed to financially support women’s issues, in 2022, following protests in support of abortion rights after the Supreme Court repealed Roe v Wade.\n\nThe protests took place five years on from the global Women’s March that was organised after the first inauguration of US President Donald Trump.\n\nShe added: “Well, they (things) change and they don’t.\n\n“The fact that Taylor Swift had to justify herself, I was like, ‘Are you kidding?’ I’m freaking so proud of that young woman. What a good example.\n\n“I’m happy watching all these young women, and I know that there’ll always be struggles, but you just always got to take a step back, and there’s always going to be gatekeepers, and just figure out how to get around them.\n\n“Find like-minded people doing similar things that you aspire to do, and know that there are still artist collectives that you could join, and achieve what it is you want.”\n\nOn the idea of legacy, she added: “I was told one time by a very prominent, very important male figure of the industry, that said that we were making disposable music.\n\n“And I took issue with that because I did not make disposable music, and I don’t do that.”\n\nShe added: “Just do the best you can, and don’t make disposable music, or make music that makes people happy. Find some songs that help people, and you can leave that behind and do some great work.”\n\nLauper, who performed at Glastonbury Festival last year, is known for hits including Time After Time, Money Changes Everything and True Colours.\n\nWhile performing Girls Just Want To Have Fun, during her Pyramid Stage set, she referred to feminist marches and said she went out and saw the signs about girls wanting “fundamental rights”.\n\nShe has won two Grammy Awards, one for best new artist in 1985, and the other for best musical theatre album for Broadway and West End musical Kinky Boots, for which she wrote the music in the 2010s.","summary":"Placards reading ‘Girls just want to have fundamental rights’ are often seen at women’s marches.","url":"https://www.standard.co.uk/culture/music/cyndi-lauper-girls-new-york-supreme-court-desert-island-b1215532.html","image":"https://static.standard.co.uk/2025/03/09/00/08120955-ee2504d7-f501-4cb4-9103-520fb66c3b4e.jpg?width=1200","video":null,"publish_date":"2025-03-09 00:01:00","author":"Hannah Roberts","authors":["Hannah Roberts"],"language":"en","category":"politics","source_country":"gb","sentiment":0.148},{"id":298176206,"title":"Barry O’Halloran: It’s time to abandon neutrality and send fighter jet pilots, not pillows, to Ukraine","text":"Donald Trump was castigated by Europe’s press, politicians and public during his first term as US president for making remarks like this: “We cannot continue to pay for the military protection of Europe while Nato states are not paying their fair share.”\n\nHowever, that statement wasn’t made by Trump, it was delivered over 60 years ago by President John F Kennedy.","summary":"Donald Trump was castigated by Europe’s press, politicians and public during his first term as US president for making remarks like this: “We cannot continue to pay for the military protection of Europe while Nato states are not paying their fair share.”","url":"https://www.independent.ie/opinion/comment/barry-ohalloran-its-time-to-abandon-neutrality-and-send-fighter-jet-pilots-not-pillows-to-ukraine/a80466172.html","image":"https://focus.independent.ie/thumbor/q_DllRZqndyxjJf3YjFI6IPWlpI=/0x0:960x640/550x550/prod-mh-ireland/57c517c4-5663-4cd4-912a-5151e5f512e9/7a73e82c-f6fb-421c-8406-cbbeb58e1ad6/57c517c4-5663-4cd4-912a-5151e5f512e9.jpg","video":null,"publish_date":"2025-03-09 00:00:00","author":"Barry O'halloran","authors":["Barry O'halloran"],"language":"en","source_country":"ie","sentiment":-0.469},{"id":298171642,"title":"CDC will research widely debunked link between vaccines and autism","text":"The Centers for Disease Control and Prevention is initiating expanded research into understanding autism and potential links between vaccines and autism, a source familiar with the CDC’s planning said. The CDC is one of the agencies that operates under the umbrella of the Department of Health and Human Services, the federal agency that President Donald Trump picked Robert F. Kennedy Jr. to lead. The Senate confirmed him to the post in a 52-48 vote last month. The possibility of a link between vaccines and autism has been repeatedly debunked by hundreds of scientific studies. But Kennedy made a profile for himself as an anti-vaccine crusader, criticizing the Covid-19 vaccine and claiming childhood immunizations are linked to autism. He also founded Children’s Health Defense, an anti-vaccine group. Andrew Nixon, a spokesperson for HHS, said in a statement that the CDC is “delivering” on the “high quality research and transparency” Americans expect. The CDC's research plans were first reported by Reuters. Studies can often take several years, at least. It is unclear what the methodology for such research would be, how it would be funded or when results could be released or published. Roughly $419 million is spent on autism research in the U.S. each year. “As President Trump said in his joint address to Congress, the rate of autism in American children has skyrocketed. CDC will leave no stone unturned in its mission to figure out what exactly is happening,” Nixon said. Speaking to Congress Tuesday, Trump said: “As an example, not long ago, and you can’t even believe these numbers, 1 in 10,000 children had autism. One in 10,000, and now it’s 1 in 36. There’s something wrong. One in 36, think of that, so we’re going to find out what it is,” adding that there is “nobody better” than Kennedy to “figure out what’s going on.” The World Health Organization estimates that over the past 50 years, global immunization efforts have saved at least 154 million lives — the vast majority being infants. The myth that childhood immunizations cause autism was first proposed 27 years ago by a British doctor who was later banned from practicing medicine in the United Kingdom. Kennedy's anti-vaccine claims were a part of his independent presidential candidacy in 2024. He eventually dropped out of the race and endorsed Trump, who adopted some of Kennedy’s points into a “Make America Healthy Again” movement. Incoming CDC director Dave Weldon and Kennedy go back at least two decades in their joint scrutiny of vaccines as a cause of autism. In a since-retracted 2005 Rolling Stone piece falsely linking vaccines to neurological disorders, Kennedy cited Weldon, a then-congressman, writing: “CDC officials are not interested in an honest search for the truth, Weldon told me, because ‘an association between vaccines and autism would force them to admit that their policies irreparably damaged thousands of children. Who would want to make that conclusion about themselves?’” The news comes during the worst measles outbreak in the U.S. in the past five years. The outbreak in Texas and New Mexico has surpassed 200 cases, and at least 23 people — most of whom are unvaccinated children — have been hospitalized. One 6-year-old died in Texas last week, and health officials suspect an additional measles-related death in an adult in New Mexico. The majority of cases center around a county in Texas with one of the highest vaccination exemption rates in the state. In an opinion piece published Sunday on Fox News, Kennedy called the decision to vaccinate “a personal one.” The HHS secretary did not direct the public to get the measles-mumps-rubella vaccine, instead urging parents to consult with their own healthcare providers.","summary":"The CDC is initiating expanded research into understanding autism and widely debunked links between vaccines and autism","url":"https://www.nbcnews.com/politics/trump-administration/cdc-research-debunked-link-vaccines-autism-rcna195499","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-02/250207-CDC-ch-1108-e0f99b.jpg","video":null,"publish_date":"2025-03-08 23:46:16","author":"Raquel Coronell Uribe,Vaughn Hillyard","authors":["Raquel Coronell Uribe","Vaughn Hillyard"],"language":"en","source_country":"us","sentiment":-0.259},{"id":298171968,"title":"Our snitch spills on the secret A-Z list of New York's elite Nepo Baby set, sparing no one (even royalty), and reveals what Jack Schlossberg's family think of him!","text":"You've seen them in Hollywood: the offspring of the rich and famous happily benefitting from a career leg-up thanks to their parents' wealth and connections. \n\nBut how much do you know about New York's so-called Nepo Babies?\n\nThe truth is, the city is bursting with them. Yet compared to their Tinseltown cousins, New York Nepos are much more discreet, happy to wait for their oat milk lattes at Ludlow Coffee Supply, or dine with friends at Italian restaurant Carbone, alongside the rest of us. \n\nIn a city whose motto could well be 'mind your own business', the Big Apple Nepo floats through the crowd unseen.\n\nDon't be fooled, however – if there's an A-list invite to be had, they've got one. Indeed, they're right at the top of the list. \n\nOver-privileged and over here, many of the Nepos have European heritage but prefer it in NYC because, as Prince Dimitri of Yugoslavia once said, 'nobody cares' who they are. \n\nExcept, of course, other key socialites who know everything there is to know about their lineage (often Royal), wealth (often vast and old) and parents (always famous and/or aristocratic).\n\nThey all know each other, too. They go to the same university (NYU) and hang out at the same clubs and yes, tend to date each other. \n\nIf they're not European-born, they're descended from major American dynasties, like the Kennedys and the Gettys, whose ancestors are memorialized on street signs, concert halls and libraries.\n\nSome do have jobs, though they're more likely to be something nebulous in 'sponsorship' or 'influencing' than a normal 9 to 5. \n\nThe influencer lifestyle, indeed, might be designed for the Nepo Baby – you can do brand deals aboard a yacht, after all, or create sponsored content in-between that long lunch and A-list dinner.\n\nYet even in society's highest echelons, some are more powerful – and sought after – than others. Here, with the help of an insider snitch, we reveal the unofficial ranking of NYC's Nepo Baby movers and shakers...\n\nThe European Nobility Nepos\n\n1. Princess Maria-Olympia of Greece and Denmark \n\nDaughter of: Prince Pavlos and Princess Marie-Chantal of Greece and Denmark; goddaughter of King Charles III.\n\nFamily's estimated wealth: $2.53 billion.\n\nDating history: Named the 'world's most eligible single' by British society magazine Tatler shortly after splitting with aristocrat Peregine Pearson, whom she dated for three years. (Pearson, incidentally, is now in a relationship with Game of Thrones actress Sophie Turner.)\n\nMaria-Olympia is arguably the most powerful of the Nepo Babies living it up in the Big Apple. The 28-year-old model 'is always at the top' of invite lists on the NYC social scene, my insider reveals, despite being 'pretty private' in her day-to-day life.\n\nOlympia was born in NYC but spent most of her childhood in London. At 17, she interned at Christian Dior's Paris haute couture atelier and went on to model for the likes of Dolce and Gabbana, Michael Kors, Aquazzura and Louis Vuitton.\n\nWhile a student at New York University, where she got her degree in fashion business and marketing, she shunned the college dorm in favor of renting an apartment in the trendy neighborhood of SoHo to the tune of approximately $9,000 per month.\n\n2. Princess Talita Natasha von Fürstenberg\n\nDaughter of: Prince Alexander von Fürstenberg and Alexandra Natasha von Fürstenberg (née Miller); granddaughter of American fashion designer Diane von Fürstenberg and maternal cousin of Princess Maria-Olympia of Greece and Denmark.\n\nFamily's estimated wealth: Her grandmother's fortune is an estimated $300 million, while her maternal grandfather Robert Miller has a staggering net worth of $1.9 billion.\n\nDating history: Talita has been dating Italian banking scion Rocco Brignone de Brabant for more than six years, as her Instagram account filled with snaps of her lavish travels to Italy and Mexico with Rocco, bears witness. \n\nThe best friend and confidante of Princess Maria-Olympia, who is also her first cousin on her mother's side, Talita was born in NYC and raised in Los Angeles. \n\nThe 25-year-old is descended from European royalty through her grandfather, German aristocrat Prince Egon, who was married to Diane von Furstenberg for 14 years.\n\nWith a lavish social media presence and 232,000 followers on Instagram, she is often pictured gazing at the sunset on a private yacht, or tanning on the Italian island of Sardinia, Rocco by her side. \n\nIt helps that his family owns a private resort in Costalegre, Mexico, called Costa Careyes.\n\nBefore embarking on her world travels, Talita studied fashion business and marketing at NYU with Olympia and graduated in 2021. \n\nDuring university, Talita rented a three-bedroom 2,541 square foot apartment in Manhattan's West Village neighborhood, which hit the market in 2022 for $10 million.\n\nThese days, the rising style star is following in her grandmother's footsteps after launching two capsule collections under the DVF brand in 2019 and acting as a brand ambassador.\n\n3. Prince Achileas-Andreas of Greece and Denmark \n\nSon of: Prince Pavlos and Princess Marie-Chantal of Greece and Denmark; younger brother of Princess Maria-Olympia.\n\nFamily's estimated wealth: $2.53 billion.\n\nDating history: Single after splitting with Isabella Massenet, the daughter of Net-a-Porter founder Dame Natalie Massenet - and fellow Nepo Baby - whom he dated for three years.\n\nThe 24-year-old younger brother of Princess Olympia, Prince Achileas-Andreas – known to his friends as Achi – is regarded as one of New York's most eligible bachelors.\n\nBorn in NYC, he too attended NYU's Gallatin School of Individualized Study, where the prince specialized in Shakespeare and graduated in 2023.\n\nSince then, he's pursued his passion for acting under the stage name Achileas Miller, taking on his mother's maiden name. He has so far appeared in the American soap opera The Bold and the Beautiful and had a minor role in the 2023 Jennifer Lawrence rom-com No Hard Feelings.\n\nThe Kennedy Nepos \n\n4. Jack Schlossberg\n\nSon of: Caroline Kennedy Schlossberg and artist Edwin Schlossberg; only grandson of President John F. Kennedy.\n\nFamily's estimated wealth: His personal net worth is an estimated $20 million, but the Kennedy family fortune is thought to be worth substantially more than $1 billion.\n\nDating history: Colorful. Formerly linked to Sky Ting yoga studio founder Krissy Jones; and model Dayna Frazer (Dylan Sprouse's ex).\n\nOver the past month, Jack, 32, the only grandson of JFK, has suffered something of a spectacular fall from grace.\n\nThis is largely thanks to a series of eccentric social media posts – from a fiery TikTok rant against journalist Megyn Kelly to bizarre posts about Vice President JD Vance's wife Usha Vance.\n\nSources tell the Daily Mail that the Kennedy family is refusing to 'take blame or responsibility' for Jack's behavior, while Kathleen 'Kick' Kennedy – the daughter of RFK Jr – previously told the New York Post she hopes her cousin Jack 'gets the help he needs.'\n\nHis latest stunt? Piercing both his ears.\n\nOf course given New York's love of an A-list scandal, his shenanigans might even make him more in demand on the Nepo Baby circuit.\n\nAfter all he has impeccable credentials. Raised on Manhattan's Upper East Side, the former Senate intern attended Collegiate School in Manhattan, an all-boys private school where yearly tuition costs at least $65,900.\n\nHe graduated from two of the top Ivy League schools in the country, receiving his undergraduate degree from Yale University in 2015 before enrolling at Harvard University where he graduated from the joint Juris Doctor - Master of Business Administration Program at Harvard Law School and Harvard Business School in 2022.\n\nHis ties to the city will always run deep: NYC's busiest airport is named after his late grandfather and a massive reservoir located in Central Park honors his grandmother, Jacqueline Kennedy Onassis.\n\n5. Kyra Kennedy\n\nDaughter of: Health Secretary Robert F. Kennedy Jr. and the late Mary Richardson Kennedy, who died in 2012.\n\nFamily's estimated wealth: Her father's net worth is an estimated $15 million, including his shared assets with actress wife Cheryl Hines.\n\nDating history: In a relationship with Milan-based senior finance analyst Giovanni Fanfani.\n\nAs Jack burns bridges with his extended relatives, an unofficial rising star has emerged in the high-powered family: Health Secretary RFK Jr.'s youngest daughter, Kyra Kennedy.\n\nThe 29-year-old model has been a mainstay on the NYC socialite scene for quite some time.\n\nWhen she was 18, she made her formal debut at the 2013 Le Bal des Debutantes in Paris, France, where she rubbed shoulders with Lady Amelia Windsor and comedian Larry David's daughter Romy.\n\nIn 2016, Kyra's elite social circle was dubbed 'The Snap Pack' by the New York Times and featured the likes of Gaia Matisse, the great-granddaughter of artist Henri Matisse, Donald Trump's daughter Tiffany Trump and fashion designer Andrew Warren.\n\nSince graduating from Manhattan's Fashion Institute of Technology in 2017, Kyra has fully immersed herself in the fashion world, becoming a brand ambassador for luxury Italian jewellery brand Bulgari in 2024.\n\nRising 'It' Girls \n\n6. Ivy Getty\n\nDaughter of: Late John Gilbert Getty, who died in 2020, and jewelry designer Alyssa Boothby; the great-granddaughter of Getty Oil tycoon Jean Paul Getty.\n\nFamily's estimated wealth: The Getty family fortune is estimated at $4.5 billion.\n\nDating history: Ivy married photographer Tobias 'Toby' Engel in 2020; filed for divorce last year.\n\nThe billionaire heiress and socialite pal of Princess Olympia and Kyra Kennedy is another nepo baby from a prominent American family, and a rising NYC 'It Girl'. \n\nHer life has not been all smiles and rainbows, however. \n\nLess than four years after their star-studded San Francisco wedding - where Ivy walked down the aisle in a John Galliano bridal gown in a ceremony officiated by then Speaker of the House Nancy Pelosi - she and husband Tobias Engel parted ways in April 2024.\n\nThese days, she lives in a Lower Manhattan penthouse in the heart of NoHo and can be found living it up with her A-list clique of Princess Olympia, Nicky and Paris Hilton, and actress Anya Taylor-Joy.\n\n7. Ming Lee Simmons \n\nDaughter of: Entrepreneur Russell Simmons, who co-founded the record label Def Jam Recordings, and fashion designer Kimora Lee Simmons.\n\nFamily's estimated wealth: $200 million.\n\nDating history: Previously linked to rapper Swae Lee.\n\nMing Lee Simmons, 25, is following in her mother's famous footsteps. The model graduated from NYU in 2023, where she studied fashion business, and then got involved in the revival of Baby Phat – her mom's streetwear brand, which made a comeback in 2019.\n\nNow a model, Ming Lee has also posed for Sports Illustrated's Swimsuit issue, Galore magazine and for Kim Kardashian's SKIMS shapewear brand, garnering her 1.2 million followers on Instagram.\n\nIt also comes in handy that her godmother is none other than America's Next Top Model host Tyra Banks.\n\n8. Isabella Massenet\n\nDaughter of: Net-a-Porter founder Dame Natalie Massenet and French hedge fund manager Arnaud Massenet.\n\nFamily's estimated wealth: $170 million.\n\nDating history: Split from Prince Achileas in 2024 after three years. \n\nBorn and raised in London, the 25 year old moved to NYC to pursue a career as a DJ and now often posts photos of herself behind the mixing booth at invite-only fashion events for brands including Frame, Chanel and Reformation. \n\nShe most recently curated the runway music for designer Prabal Gurung's Fall 2025 show during New York Fashion Week in February.\n\nMuch like her ex-boyfriend and his royal relatives, Isabella graduated from NYU in 2023. While in college, she purchased a one-bedroom apartment in the quaint-yet-upscale neighborhood of Gramercy Park for $1.65 million - embracing student life in true Nepo Baby style.\n\nThe Influencer Nepos \n\n9. Hannah Bronfman\n\nDaughter of: Edgar Bronfman Jr, whose father was Edgar Bronfman, billionaire founder of Canadian beverage company Seagram; her mother is actress Sherri Brewer.\n\nFamily's estimated wealth: Seagram sold in 2000 for $34 billion.\n\nDating history: Married DJ Brendan Fallis in 2017.\n\nThis tier of NYC Nepo Babies is reserved for those highly-connected New Yorkers whose reputations are largely discussed on Reddit 'snark' pages, rather than in Forbes or Vogue.\n\n'A community for discussion and snark about NYC Influencers,' reads the description for the r/NYCinfluencersnark Reddit page, where being a Nepo Baby without publicly recognizing your privilege is the greatest of all sins.\n\n'I don't think most people mind Nepo Babies as long as they acknowledge it and embrace it,' read one recent comment.\n\nHannah Bronfman, 37, is a frequent snark target on the Reddit page. \n\nWhile she has attempted to build her own reputation as an 'angel investor', she hasn't always read the room on social media. \n\nIn 2023, she posted a four-minute rant on TikTok after she was unable to board a first class flight because she did not have her ID on her – something her commenters later described as 'out of touch'.\n\nHannah, along with her husband Brendan Fallis, also went viral on social media when they gave a tour of their sprawling three-level downtown Manhattan apartment, for which they pay a mortgage of $4,300 a month.\n\nThe couple share five-year-old son Preston Miles and two-year-old daughter Claude Peaches.\n\n10. Sammy Nussdorf \n\nSon of: Quality King Distributors CEO Glenn Nussdorf, which distributes health and beauty care products and prescription drugs.\n\nFamily's estimated wealth: $1.6 billion.\n\nFriends with: Princess Olympia and Prince Achileas.\n\nA good friend of Princess Olympia - whom he graduated from NYU with in 2019 - and Prince Achileas, Sammy Nussdorf, 27, has been a regular figure in NYC's Nepo Baby circles for quite some time.\n\nThroughout the mid 2010s, he was often photographed with designer Andrew Warren's 'Snap Pack' crew in the ritzy Hamptons, where his parents own a $27.5 million mansion on Meadow Lane in Southhampton Village.\n\nThough he's largely remained under the radar since then, briefly relocating to LA and working in venture capital, he popped up on TikTok and Reddit snark feeds earlier this year when he announced the forthcoming arrival of his gourmet grocery store in Tribeca, called Meadow Lane.\n\nThe idea was instantly hailed online as NYC's equivalent to the infamous LA celebrity grocer Erewhon, though people soon turned sour when they realized Sammy's background.\n\nHe later fought back against 'Nepo Baby' accusations on TikTok, where he posts under the username @brokebackcontessa.\n\n'Sweetheart, I had an entire career in venture capital and made my own money and funded my new business with my own funds,' he wrote in a since-deleted comment. 'Don't assume anything.'\n\n11. Kit Keenan\n\nDaughter of: Fashion designer Cynthia Rowley.\n\nFamily's estimated wealth: $100 million.\n\nDating history: Appeared on season 25 of ABC's The Bachelor; in a relationship with British investment manager Sam Regan.\n\nThanks to her fashion designer mother's connections, Kit Keenan, 25, did once have the potential to climb the A-list Nepo ranks like Diane von Fürstenberg's granddaughter Talita. \n\nBut her stint on season 25 of ABC's The Bachelor and her social circle – widely composed of fellow influencers – is thought to have held her back.\n\nHer own mother even admitted to the Daily Mail that her daughters - Kit and Gigi Powers, 20 - won't take over her eponymous label when she retires because they 'don't want to work as hard as she does'.\n\nInstead, Kit is more accustomed to posting videos of herself cooking and reviewing where to find the best Caesar salads in the city.","summary":"'Nepo babies' are taking over the Big Apple... but not all privileged offspring are created equal.","url":"https://www.dailymail.co.uk/femail/article-14413749/nepo-baby-nyc-ranking-jack-schlossberg.html","image":"https://i.dailymail.co.uk/1s/2025/03/08/23/95372911-0-image-m-47_1741477118210.jpg","video":null,"publish_date":"2025-03-08 23:46:00","author":"Editor,Meredith Clark","authors":["Editor","Meredith Clark"],"language":"en","source_country":"gb","sentiment":0.636},{"id":298173730,"title":"UFC boss and Trump ally Dana White filmed hugging accused sex traffickers Andrew and Tristan Tate","text":"Ultimate Fighting Championship president and Donald Trump ally Dana White was seen at an event in Las Vegas on Friday warmly greeting Andrew and Tristan Tate, controversial right-wing influencers accused of human trafficking and other abuses across the U.S., the U.K., and Romania. \n\n“Welcome to the States, boys,” White, who recently joined the board of tech giant Meta, tells the brothers as he hugs them, in a clip recorded from a Power Slap fighting series event in Las Vegas.\n\nThe brothers, known for their misogynistic views broadcast to millions of followers, are awaiting trial in Romania, wanted in the U.K., and under investigation in the state of Florida.\n\nThe encounter prompted criticisms of White, including from those on the right, which has often aligned with White.\n\n“I'm done with @ufc,” conservative pundit John Cardillo wrote on X. “If @danawhite can't draw a line and disassociate from trash who bragged on video about grooming and raping teen girls, it tells me all I need to know.”\n\nOthers argued it wasn’t a surprise that White, who admitted in 2023 to hitting his wife, would associate with the Tates.\n\n“Dana White slapped his wife on video so this is a real fork found in kitchen moment,” writer Kylie Cheung argued on X. \n\nOthers pointed to how unorthodox it was for White, as a board member at a major public company, to be associating with alleged sex criminals.\n\n“alternate headline: facebook board member hangs out with alleged human traffickers,” reporter Mike Isaac wrote on X.\n\nThe Independent has contacted Meta and the UFCfor comment.\n\nLate last month, the Tate brothers — who are dual U.S.-U.K. citizens — arrived in Florida from Romania, where they are accused of launching an organized criminal group and trafficking women across the country as well as Britain and the United States. They came under a cloud of allegations across the world, including accusations of rape, trafficking, and tax-dodging in the U.K., as well as allegedly recruiting a U.S. woman into sex work under false pretenses.\n\nThe brothers, who deny all wrongdoing in the cases against them, were able to leave Romania as they await a future trial in that country, after officials there lifted travel restrictions against them, reportedly following pressure from the Trump administration. \n\nRomanian officials maintained they made the decision independently, but U.S. special envoy Richard Grenell reportedly requested the brothers be able to travel freely.\n\nTrump has insisted he “knows nothing” about the pair, who champion him to their millions of male followers.\n\nFlorida Governor Ron DeSantis proclaimed the brothers weren’t welcome there, and the state’s attorney general later launched a criminal investigation into the brothers.\n\nGrenell, the Trump administration’s presidential envoy for special missions, reposted an X post from Andrew Tate that accused the Florida governor of “attacking” him because he “was worried” that Tate would support Republican congressman Byron Donalds in the state’s race for governor.\n\nMeanwhile, U.K. Prime Minister Keir Starmer is facing pressure to push for the Tates’ extradition. Romanian officials say any potential extradition would come after their case concludes.","summary":"self-described misogynist","url":"https://www.independent.co.uk/news/world/americas/dana-white-andrew-tristan-tate-b2711572.html","image":"https://static.independent.co.uk/2025/03/05/16/4b4e086cf2ad446fb5b38c40f08ff8e7Y29udGVudHNlYXJjaGFwaSwxNzQxMjc4MDk3-2.71432766.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/7r8qBn8w-OhrQWqOm.mp4","publish_date":"2025-03-08 23:41:49","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":0.136},{"id":298176156,"title":"Famous Canadian author Louise Penny axes U.S. book tour over Trump threats","text":"World-famous Canadian murder mystery writer Louise Penny has cancelled a U.S. tour for her latest book, citing President Donald Trump’s repeated threats of a trade war against Canada and annexation.\n\nPenny announced the move on social media, saying it was “a painful decision” because of the many friends and professional acquaintances she’d made in the U.S. after touring there for 20 years.\n\n“Please understand this decision is not meant to punish Americans. This is about standing shoulder-to-shoulder with my fellow Canadians,” Penny stated in a long, thoughtful message to her fans.\n\nPenny is the author of the beloved Chief Inspector Gamache police murder mystery novel series, which is set in her own home province of Quebec.\n\nHer latest book, called The Black Wolf, is the 20th tome in the Inspector Gamache series, which has sold more than 18 million copies worldwide in English and multiple other languages.\n\nThe books have topped Canadian, U.S., and international bestseller lists as the stories follows the adventures of the head of the homicide department at la Sûreté du Québec, the provincial police.\n\nHere is what she wrote.\n\nLouise Penny: I can hardly believe I’m saying this, but given the ongoing threat of an unprovoked trade war against Canada by the US president, I do not feel I can enter the United States.\n\nAt least not until that economic sword, that could throw hundreds of thousands of Canadians (as well as Americans) into poverty, is removed completely.\n\nThere are, of course, other things the American president is doing that make visiting the USA unpalatable. Oh, dear. It is so painful to say that.\n\nI have visited friends, made friends, personally and professionally, with so many Americans. I have such respect, affection, for them. For you. But…enough. What is happening is not just a potential economic catastrophe for Canada and so many other nations, it is a moral wound.\n\nWith that in mind, I am so sorry to say that until things change, I cannot do in-person events in the United States. Which means, for the first time in 20 years, not touring the USA.\n\nThe cancellation of the tour means Penny will not appear at the Kennedy Center for the Performing Arts in Washington D.C. as planned this fall to launch her new book in front of a 2,000-person audience, a decision first reported by The Washington Post.\n\nPenny said the soiree was going to be a highlight of her career, but she pulled out of that appearance after Trump fired the entire board of trustees and declared himself chairman last month.\n\nTicket sales at the Kennedy Center have plunged since then.\n\nPenny’s decision to cancel her U.S. tour has earned widespread support on social media from dozens of Americans and Canadians, who praised her integrity and courage.\n\nInstead, and with the support of her publishers, Penny said she would launch the book in Canada, and she invited all her American fans to attend that event.\n\n“I have decided that instead of launching THE BLACK WOLF in Washington, DC at the Kennedy Center, I will be doing the event in my nation’s capital Ottawa, at the National Arts Centre. It will be on Tuesday, October 28,” she wrote.\n\nIn the days after the NAC launch in Ottawa, Penny wrote, she will hold other Canadian book launch and promotion events before she ends her tour at the Haskell Free Library and Opera House.\n\n“This remarkable place was built in 1904 and sits right smack dab on the border between Québec and Vermont. The Haskell was built by both countries as a symbol of our strong bonds of friendship,” Penny stated.\n\n“It is the physical reflection of what we believe. That what happens politically is one thing, and transitory. What happens in our hearts is indestructible.”\n\nPenny said she is hoping Americans will come to her Canadian book events.\n\n“You will be welcomed with open arms. As friends. As fellow villagers of Three Pines. Where goodness, and decency, exist,” she wrote.","summary":"Penny's decision to cancel her U.S. tour has earned widespread support on her social media site from dozens of Americans and Canadians, who praised her integrity and courage.","url":"https://globalnews.ca/news/11073115/louise-penny-us-boycott/","image":"https://globalnews.ca/wp-content/uploads/2017/11/louise-penny.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-03-08 23:35:10","author":"Andrew McIntosh","authors":["Andrew McIntosh"],"language":"en","source_country":"ca","sentiment":0.021},{"id":298172542,"title":"Federal funding cuts lead FEMA to cancel National Fire Academy courses","text":"The country's preeminent federal fire training academy canceled classes, effective immediately, on Saturday amid the ongoing flurry of funding freezes and staffing cuts by President Donald Trump's administration.The Federal Emergency Management Agency announced that National Fire Academy courses were canceled amid a \"process of evaluating agency programs and spending to ensure alignment with Administration priorities,\" according to a notice sent to instructors, students and fire departments. Instructors were told to cancel all future travel until further notice.Firefighters, EMS providers and other first responders from across the country travel to the NFA's Maryland campus for the federally funded institution's free training programs.\"The NFA is a powerhouse for the fire service,\" said Marc Bashoor, a former Maryland fire chief and West Virginia emergency services director with 44 years of fire safety experience. \"It's not a 'nice to have.' It is the one avenue we have to bring people from all over the country to learn from and with each other. If we want to continue to have one of the premier fire services in the world, we need to have the National Fire Academy.\"The academy, which also houses the National Fallen Firefighter's Memorial, opened in 1973 to combat a growing number of fatal fires nationwide. At the time, the National Commission on Fire Prevention and Control envisioned it to be the \"West Point of the Fire Service,\" according to a report from the organization.Bashoor said the NFA was set to welcome a new set of fire safety officers for training next week.\"People had made their plane and travel reservations. And all of a sudden, they get an email that 'Sorry, it's been canceled,'\" he said. \"It's really upsetting.\"For firefighters, including those on the frontlines of deadly fires that ravaged California this year, having an essential training institution \"shut down under the presumption that there's waste, fraud and abuse\" has been demoralizing, Bashoor said. He said losing NFA training could make the coordinated response that prevented additional deaths and destruction in California more difficult.FEMA and the National Fire Academy did not immediately respond to requests for comment.While surveying disaster zones in California in January, Trump said he was considering \"getting rid of\" FEMA altogether, previewing sweeping changes to the nation's central organization of responding to disasters.Firings at the U.S. Forest Service on the heels of the deadly California blazes also sparked outcry among discharged workers and officials who said it would mean fewer people and less resources will be available to help prevent and fight wildfires.","summary":"The cancellation of courses at National Fire Academy comes as the federally funded institution was set to welcome a new set of fire safety officers for training next week.","url":"https://www.cbsnews.com/news/fema-national-fire-academy-cources-cancellation/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/08/d710ae00-83e7-41fe-90fd-7950169bf8e2/thumbnail/1200x630/2e6eb2ca84deb730c21b24694d425740/gettyimages-2203009034.jpg?v=63a2b43e2ef8917aa6bd547ca29dd4fa","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3491317_hls/master.m3u8","publish_date":"2025-03-08 23:26:35","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","source_country":"US","sentiment":-0.306},{"id":298171182,"title":"Supreme Court Signals It Will Not Yield to Donald Trump—Attorney","text":"On Wednesday, attorney Glenn Kirschner stated that the U.S. Supreme Court made it clear that it “won’t yield” to President Donald Trump following a ruling that supported a federal judge’s authority to require Trump’s administration to remit nearly $2 billion to contractors of the U.S. Agency for International Development (USAID).\n\nNewsweek reached out to the White House via email for comments on Saturday morning.\n\nWhy It Matters\n\nThis ruling marks another instance since Trump assumed office in January where the Supreme Court, which holds a 6-3 conservative majority, has sided against the president and other conservatives on various matters.\n\nConcerns have been raised by Trump critics about the Court potentially supporting his actions; however, the Supreme Court has demonstrated, to some degree, its willingness to oppose Trump in legal disputes.\n\nWhat To Know\n\nThe narrowly divided Court voted 5-4 on Wednesday, dismissing the Department of Justice’s (DOJ) emergency request to block U.S. District Judge Amir Ali’s ruling that mandated a strict timeline for the administration to release frozen funds.\n\nFunding was initially paused when Trump signed an executive order on his first day in office, halting financial support for all foreign aid programs and USAID projects that did not “fully align” with the goals of the Trump administration. This action was further supported by U.S. Secretary of State Marco Rubio’s appeal to terminate payments for foreign aid initiatives.\n\nThese actions were challenged in court, and Judge Ali issued a temporary restraining order (TRO) against the government’s freeze on foreign aid payments.\n\nOn February 25, the administration was summoned back to court after failing to comply with the TRO, as it continued to block funds for aid organizations globally. The administration could not furnish an explanation for this action.\n\nConsequently, Judge Ali ruled that the administration owed $2 billion to aid organizations for services previously rendered, following 12 days of the government’s noncompliance with court orders.\n\nThe government appealed to Chief Justice Roberts, who initially placed a pause on the payments. However, he, along with four other justices—Amy Coney Barrett, Sonia Sotomayor, Elena Kagan, and Ketanji Brown Jackson—determined that the administration was obligated to pay the specified amount to foreign aid entities.\n\nIn a YouTube video on Wednesday, Kirschner, a former U.S. attorney and known critic of Trump, commented on the judgement.\n\n“While this is just one ruling by the Supreme Court, it suggests that at least five justices are unwilling to acquiesce to Donald Trump’s authoritarian ambitions. Today, the Supreme Court acted as a legitimate co-equal branch of government and provided a necessary check on the overreach of the executive branch,” Kirschner stated.\n\nThe dissenting justices, Clarence Thomas, Samuel Alito, Neil Gorsuch, and Brett Kavanaugh, described this decision as an “extreme response.” The foreign aid organizations asserted that the government created the crisis it now faces.\n\nThey argued that the Supreme Court lacked jurisdiction to review district court “minute orders” and pointed out that the administration’s appeal pertained only to the $2 billion, not the initial TRO, indicating that they still had to comply with the unfreezing of their funds as mandated by the TRO. They stated:\n\n“The district court made it clear that the February 25 order did not expand the government’s obligations under the TRO or its prior enforcement mandates. Consequently, a ruling vacating the February 25 minute order would not change the government’s responsibility to comply with the TRO.”\n\nRepresentatives for the Global Health Council and the AIDS Vaccine Advocacy Coalition noted that this case reached the Supreme Court due to the government’s failure to adhere to lower court ruling.\n\nThey emphasized that without these payments, their crucial lifesaving work for millions and the very existence of their foreign aid counterparts are at risk.\n\nThis ruling represents the second instance this year where the Court has curtailed the administration’s attempts to significantly broaden the executive power’s reach.\n\nLast month, the Court denied Trump’s request to immediately dismiss the head of the Office of Special Counsel, stating that it would not interfere with a temporary order from a lower court that had kept the individual in position.\n\nWhat People Are Saying\n\nJustice Samuel Alito, along with Justices Neil Gorsuch and Brett Kavanaugh, in dissent: “Does a single district-court judge who likely lacks jurisdiction possess the unchecked authority to compel the Government of the United States to disburse (and possibly lose forever) $2 billion in taxpayer funds? The answer to that question should be a resounding ‘No,’ yet a majority of this Court seems to think otherwise. I am astonished.”\n\nFormer Senate legislative assistant Jeremy Bates in an amicus brief for the aid organizations: “President Trump implores the Court to uphold what he violated. His breaches have cost the United States unity, reputation, wealth, and lives. Rarely has equity encountered a party with such unclean hands. The Court should deny the stay.”\n\nWhat Happens Next?\n\nThe Trump administration is required to pay $2 billion to foreign aid organizations. Failure to do so may result in contempt charges against the administration.\n\nThe majority pointed out that a court-mandated deadline to allocate the funds by February 26 has already elapsed and instructed Judge Ali to “clarify what obligations the government must meet to comply with the temporary restraining order.”\n\nJudge Ali’s temporary restraining order on the government is valid until March 10.","summary":"On Wednesday, attorney Glenn Kirschner stated that the U.S. Supreme Court made it clear that it &#8220;won&#8217;t yield&#8221; to President Donald Trump following a ruling that supported a federal judge&#8217;s authority to require Trump&#8217;s administration to remit nearly $2 billion to contractors of the U.S. Agency for International Development (USAID). Newsweek reached out to the [&#8230;]","url":"https://www.theunionjournal.com/supreme-court-signals-it-will-not-yield-to-donald-trump-attorney/","image":"https://www.theunionjournal.com/wp-content/uploads/2024/11/breakingnews1.jpg","video":null,"publish_date":"2025-03-08 23:23:44","author":"Joe Killer","authors":["Joe Killer"],"language":"en","category":"politics","source_country":"","sentiment":-0.377},{"id":298178470,"title":"'Biden Refrigerators': Stacey Abrams-linked Group Got $2 Billion in 'Gold Bars' Scheme to Greenwash Home Appliances","text":"Ex-Georgia House Rep. Stacey Abrams said this week that she received $2 billion from Former President Joe Biden’s Environmental Protection Agency (EPA) to greenwash home appliances in what some have likened to an alleged Democratic “vote buying” scheme.\n\nEPA Administrator Lee Zeldin recently revealed that the Biden-era EPA passed through $20 billion in “gold bars,” or grants, to leftist groups. The Abrams-linked Power Forward Communities received $2 billion as part of these grants, a sum amounting to “20 million times the organization’s reported revenue,” according to the EPA.\n\n“Stacey Abrams’ Power Forward Communities received $2 BILLION to be a pass through entity for Biden EPA’s $20 billion ‘gold bar’ scheme,” Zeldin wrote in an X post in mid-February. “They reported just $100 in total revenue after their founding in late 2023.”\n\nAbrams — a Democrat who infamously lost two Georgia gubernatorial runs — took to MSNBC in early March to claim that there was nothing nefarious about Power Forward Communities receiving billions of dollars in taxpayer funds.\n\n“In 2023 and 2024, I led a program called Revitalizing Desoto,” she told the network, explaining that she worked to help those in South Georgia replace their inefficient appliances with more energy-efficient models.\n\nAbrams said that based on the success of this endeavor, a coalition of organizations came together to “let us invest the money of America to lower the cost of Americans.”\n\nSteve Milloy, who served on President Donald Trump’s first-term EPA transition team, described the Abrams-linked “grift” as a “vote buying” ploy akin to the Obama-era “Obama phones.”\n\n“The EPA-Stacey Abrams grift revealed: @staceyabrams just told MSBNC’s @chrislhayes that the Biden EPA gave her $2 billion to buy people new home appliances to reduce electric bills. So Democrats upgraded vote buying from Obama phones to Biden refrigerators,” Milloy wrote on X.\n\nSean Moran is a policy reporter for Breitbart News. Follow him on X @SeanMoran3.","summary":"Ex-Georgia House Rep. Stacey Abrams said this week that she received $2 billion from Former President Joe Biden's Environmental Protection Agency to greenwash home appliances in what some have likened to an alleged Democratic \"vote buying\" scheme.\n\n\nThe post &#8216;Biden Refrigerators&#8217;: Stacey Abrams-linked Group Got $2 Billion in &#8216;Gold Bars&#8217; Scheme to Greenwash Home Appliances appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/03/08/biden-refrigerators-stacey-abrams-linked-group-got-2-billion-in-gold-bars-scheme-to-greenwash-home-appliances/","image":"https://media.breitbart.com/media/2025/03/AP20307673360677-2-640x335.jpg","video":null,"publish_date":"2025-03-08 23:12:13","author":"Sean Moran","authors":["Sean Moran"],"language":"en","source_country":"US","sentiment":-0.798},{"id":298169040,"title":"Big Ben clock tower incident expected to continue overnight as man stays put","text":"An incident involving a man who scaled the clock tower of Big Ben on Saturday morning is expected to continue into Sunday as negotiators have been unable to convince him to come down.\n\nThe man, who is barefoot and holding a Palestine flag, has been spoken to by negotiators several times but at 10.30pm had not yet agreed to come down from Elizabeth Tower.\n\nThe scene remained busy with emergency crews, with dozens of uniformed police officers guarding the cordon which extended from Bridge Street to Westminster Bridge.\n\nTwo aerial ladder platforms, an incident response unit ambulance, regular ambulances and two fire engines were still at the scene late on Saturday.\n\nIn a video posted on Instagram on Saturday evening, the man told negotiators from the ledge he was sat on that he would come down “on his own terms”.\n\nIn the footage, negotiators on an aerial ladder platform appear to raise concerns about an injury to his foot, saying there is “quite a lot of blood” and that his clothes are not warm enough as temperatures drop after sunset.\n\nBut the man insists he is safe and says: “I will come down on my own terms, I have said this. But right now I am saying I am safe.\n\n“If you come towards me you are putting me in danger and I will climb higher.”\n\nIn the afternoon, shouts of “Free Palestine” and “You are a hero” could be heard from a small group of supporters behind the police cordon at Victoria Embankment.\n\nIn videos posted on social media earlier on Saturday, the man appeared to climb over a fence surrounding the Houses of Parliament without any security guards approaching him.\n\nConservative MP Ben Obese-Jecty said on X there needs to be an explanation about how the man got into the parliamentary estate.\n\nHe said: “Every day in Parliament I see dozens of armed police officers patrolling Portcullis House and the parliamentary estate. Where were they today?\n\n“On Monday there needs to be a full explanation to MPs and staff as to how this protester was able to evade security so easily.”\n\nParliamentary tours, which happen on Saturdays when Parliament is sitting and on weekdays during the summer recess, were cancelled.\n\nA parliamentary spokesperson said: “We are aware of an incident on the parliamentary estate, which is being handled by the Metropolitan Police, assisted by the London Fire Brigade and the London Ambulance Service.\n\n“Parliament takes security extremely seriously, however we do not comment on the specifics of our security measures or mitigations.”\n\nLondon bus routes 3, 11, 148, C10 and 159 remain on diversion as the road closures continued.\n\nIn 2019, an Extinction Rebellion activist wearing a blond wig was arrested after climbing the scaffolding surrounding the clock tower.\n\nTree surgeon Ben Atkinson climbed the scaffolding surrounding Big Ben dressed as Boris Johnson – complete with a blond wig, shirt, jacket and tie – and was up Elizabeth Tower for around three and a half hours on October 18 2019, before police managed to get him to come down.\n\nElsewhere, on Friday night, Donald Trump’s Turnberry golf resort in Scotland was vandalised by Pro-Palestine activists in response to the US president’s statements on Gaza.\n\nThe golf course in South Ayrshire, owned by the US president, was targeted, with activists painting Gaza Is Not For Sale in three-metre high letters on the lawn, and damaging the greens.\n\nPalestine Action described it as a “direct response to the US administration’s stated intent to ethnically cleanse Gaza”.","summary":"The man, who is barefoot and holds a Palestine flag, has been spoken to by negotiators several times but at 10.30pm had not yet agreed to come down.","url":"https://www.standard.co.uk/news/politics/big-ben-palestine-parliament-portcullis-house-metropolitan-police-b1215527.html","image":"https://static.standard.co.uk/2025/03/08/23/4a3d5d6e28b9eb148549bf38436cd804Y29udGVudHNlYXJjaGFwaSwxNzQxNTU5ODQ0-2.79321711.jpg?width=1200","video":null,"publish_date":"2025-03-08 23:10:57","author":"Ellie Crabbe","authors":["Ellie Crabbe"],"language":"en","source_country":"GB","sentiment":-0.138},{"id":298168946,"title":"“FEMA Cancels Classes at National Fire Training Academy Due to Federal Funding Cuts”","text":"CHICAGO – The country’s preeminent federal fire training academy canceled classes, effective immediately, on Saturday amid the ongoing flurry of funding freezes and staffing cuts by President Donald Trump’s administration.\n\nThe Federal Emergency Management Agency announced that National Fire Academy courses were canceled amid a “process of evaluating agency programs and spending to ensure alignment with Administration priorities,” according to a notice sent to instructors, students and fire departments. Instructors were told to cancel all future travel until further notice.\n\nFirefighters, EMS providers and other first responders from across the country travel to the NFA’s Maryland campus for the federally funded institution’s free training programs.\n\n“The NFA is a powerhouse for the fire service,” said Marc Bashoor, a former Maryland fire chief and West Virginia emergency services director with 44 years of fire safety experience. “It’s not a ‘nice to have.’ It is the one avenue we have to bring people from all over the country to learn from and with each other. If we want to continue to have one of the premier fire services in the world, we need to have the National Fire Academy.”\n\nThe academy, which also houses the National Fallen Firefighter’s Memorial, opened in 1973 to combat a growing number of fatal fires nationwide. At the time, the National Commission on Fire Prevention and Control envisioned it to be the “West Point of the Fire Service,” according to a report form the organization.\n\nBashoor said the NFA was set to welcome a new set of fire safety officers for training next week.\n\n“People had made their plane and travel reservations. And all of a sudden, they get an email that ‘Sorry, it’s been canceled,'” he said. “It’s really upsetting.”\n\nFor firefighters, including those on the frontlines of deadly fires that ravaged California this year, having an essential training institution “shut down under the presumption that there’s waste, fraud and abuse” has been demoralizing, Bashoor said. He said losing NFA training could make the coordinated response that prevented additional deaths and destruction in California more difficult.\n\nFEMA and the National Fire Academy did not immediately respond to requests for comment.\n\nWhile surveying disaster zones in California in January, Trump said he was considering “getting rid of” FEMA altogether, previewing sweeping changes to the nation’s central organization of responding to disasters.\n\nFirings at the U.S. Forest Service on the heels of the deadly California blazes also sparked outcry among discharged workers and officials who said it would mean fewer people and less resources will be available to help prevent and fight wildfires.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCHICAGO – The country&#8217;s preeminent federal fire training academy canceled classes, effective&#8230;\n\n\nThis Post: &#8220;FEMA Cancels Classes at National Fire Training Academy Due to Federal Funding Cuts&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/fema-cancels-classes-at-national-fire-training-academy-due-to-federal-funding-cuts/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-FEMA-cancels-classes-at-national-fire-training.jpg","video":null,"publish_date":"2025-03-08 23:09:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.32},{"id":298172606,"title":"Editorials of The Times","text":"Musk Doesn't Understand Why Government Matters\n\nElon Musk's life is a great American success story. Time and again, he has anticipated where the world was headed, helping to create not just new products but new industries. His achievements, from his pioneering role in online payments to the construction of SpaceX's satellite network to the mass production of electric Teslas, have made him the world's wealthiest man.\n\nBut Musk's fortune rests on more than his individual talent. He built his business empire in a nation with a stable political system and an unwavering commitment to the rule of law, and he built it on a foundation of federal subsidies, loans and contracts. Musk's companies have received at least $38 billion in government support, according to an analysis by The Washington Post. NASA has invested more than $15 billion in SpaceX; Tesla has collected $11 billion in subsidies to bolster the electric car industry.\n\nNow, as an influential adviser to President Donald Trump, Musk is lawlessly tearing down parts of the very government that enabled his rise. As the head of an agency he conjured and named the Department of Government Efficiency, or DOGE, Musk has suspended billions of dollars in spending and discarded thousands of scientists, regulators and other government workers. Brandishing a chain saw during a recent appearance at the Conservative Political Action Conference, he shouted: \"This is the chain saw for bureaucracy. Chain saw!\"\n\nMusk claims that the government is a business in need of disruption and that his goal is to eliminate waste and improve efficiency. And he's right: The federal government is often wasteful and inefficient. Taxpayers, business owners and recipients of federal benefits all know the frustration of navigating the federal bureaucracy. There are huge opportunities, in particular, for the government to make better use of technology.\n\nBut DOGE is not building a better government. Instead, its haphazard demolition campaign is undermining the basic work of government and the safety and welfare of the American people. Musk directed the firing of nuclear safety workers, necessitating a frantic effort to rehire them just days later. He ended federal funding for Ebola monitoring, and despite his subsequent acknowledgment that it might be a good idea to keep an eye on Ebola, it still has not been fully restored. The government at Musk's behest has disrupted cancer research, delayed work on transportation projects and sought to close the agency established after the 2008 financial crisis to protect consumers from being robbed by banks.\n\nEven worse is that Musk, with Trump's support, has demonstrated a disregard for the limits that the Constitution places on the president's power. Musk and Trump insist that voters want change. DOGE's slogan is \"The people voted for major reform.\"\n\nBut in their campaign to shrink the federal government, Musk and Trump have defied laws passed by Congress, and they have challenged the authority of the federal courts to adjudicate the legality of their actions. Trump recently referred to himself as a king and then insisted he had been joking, but there is no ambiguity in his assertion of the power to defy other branches of government. It is a rejection of the checks and balances that have safeguarded our nation for more than 200 years. Musk and Trump are not trying to change laws; they are upending the rule of law.\n\nEven where Musk's actions have remained within the bounds of the law, he has shown little understanding of the differences between business and government. Musk built his rocket company, SpaceX, by repeatedly launching rockets that failed until he learned how to launch rockets that worked. Even now, the company often conducts experiments that fail, and Musk has argued, compellingly, that \"if things are not failing, you are not innovating enough.\" But managing the nation's air traffic control system or its Social Security payment system requires a different calculus.\n\nBusinesses can take risks in pursuit of profit because it's OK if they fail. Americans can't afford for the basic functions of government to fail. If Twitter stops working, people can't tweet. When government services break down, people can die. While governments are often guilty of inefficiency, it is in the public interest to tolerate some inefficiency when the alternative is a breakdown of basic infrastructure.\n\n\"I think we're just moving a little too fast,\" Rep. Rich McCormick, R-Ga., told The Atlanta Journal-Constitution in late February after constituents booed him at a town hall meeting. He suggested that the Trump administration should pause to think before acting. \"We're moving really, really rapidly, and we don't know the impact.\"\n\n(BEGIN OPTIONAL TRIM.)\n\nTrump, responding to similar concerns from members of his administration, reportedly said at a Cabinet meeting Thursday that Cabinet secretaries would be in charge of future cuts in their departments and that Musk would be restricted to an advisory role. But it remains to be seen whether that will happen.\n\nOur system of government is obdurate by design. It is stable even by comparison with other democracies, many of which are governed by parliamentary systems in which the results of a single election can sharply shift public policy. In the United States, where power is divided among three coequal branches of government, it is relatively rare for one political party to gain such sweeping power for any period.\n\nThe stability of the nation's laws, and of the government's role, has caused frustration throughout American history. It is also a kind of secret sauce, facilitating the private-sector investment and risk-taking that are the wellspring of the nation's prosperity.\n\nThat stability is now under assault. The United States has experienced a marked increase in political volatility and even political violence, most notably in the aftermath of the 2020 presidential election and in the assassination attempts against Trump. The World Bank's index of political stability ranked the United States in the 66th percentile of all nations in 2013. By 2023, it had dropped into the bottom half of the rankings.\n\n(END OPTIONAL TRIM.)\n\nResearch has shown that even small declines in political stability can deliver enduring blows to economic growth, mostly by discouraging investment. In a chaotic environment, like post-Brexit Britain or Trump's America, entrepreneurs are less likely to pursue big ideas, and investors will hesitate to make long-term commitments.\n\nDOGE, of course, is merely one way that Trump has increased instability, along with his flurry of executive orders purporting to rewrite environmental policy, the meaning of the 14th Amendment and more; his on-again, off-again tariffs; and his inversion of American foreign policy, wooing Vladimir Putin while disdaining longtime allies.\n\nMusk has made clear that he holds caution in contempt. But the president, whose power Musk is wielding, should listen to those in his party who are raising concerns about Musk's methods and priorities. There are already signs that the chaos is hurting the economy. Inflation expectations have risen; stock prices have tumbled.\n\nAmericans like to take risks; to do so, they need a government that is steady and reliable.\n\nThis article originally appeared in The New York Times.","summary":"Musk Doesn't Understand Why Government Matters","url":"https://www.berkshireeagle.com/nyt/editorials-of-the-times/article_53b52a82-2a50-5ceb-afec-705fee113669.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-08 23:08:44","author":"The Editorial Board,The Washington Post","authors":["The Editorial Board","The Washington Post"],"language":"en","source_country":"us","sentiment":-0.148},{"id":298176298,"title":"Kennedy Center director encourages Republican attendance, says 'everyone is welcome'","text":"The John F. Kennedy Center for the Performing Arts' interim director Ric Grenell joined \"Hannity\" on Thursday to preview efforts he and his team are making to transform the institution into a place where \"everyone is welcome.\" President Donald Trump, after firing and re-filling members of the center's board of trustees and announcing he'd been elected chairman, named Grenell as its leader on Feb. 10. Grenell previously served as acting director of national intelligence and is a longtime foreign policy adviser to the president. \"Look, the reality is, the Kennedy Center is open for business for everyone,\" Grenell told Fox News host Sean Hannity. \"We just want an arts center that celebrates the arts — we want common sense art.\" WHOOPI DECLARES SHE ‘HAS NO PLANS TO GO’ TO KENNEDY CENTER AFTER TRUMP BECOMES CHAIRMAN OF VENUE Grenell also addressed rumblings that shows at the center were being canceled due to the Trump administration. \"The new team at the Kennedy Center has not canceled anyone,\" he explained. \"I know there are some rumors out there that, somehow, we were canceling shows. We have not canceled anyone. They've pulled out themselves, or they were told that, due to ticket sales, it wasn't financially good enough.\" 'HAMILTON' STAR PUT ON NOTICE BY TRUMP'S KENNEDY CENTER PRESIDENT AFTER ANTI-GOP 'PUBLICITY STUNT' One popular show that canceled plans to perform at the Kennedy Center was the Broadway production \"Hamilton.\" The show’s producer, Jeffrey Seller, released an official statement on social media Wednesday explaining the choice. \"This latest action by Trump means it’s not the Kennedy Center as we knew it,\" said the show’s creator, Lin-Manuel Miranda, in a joint interview Wednesday with Seller, according to The New York Times. \"The Kennedy Center was not created in this spirit, and we’re not going to be a part of it while it is the Trump Kennedy Center. We’re just not going to be part of it.\" \"I think that's intolerant,\" Grenell said. \"And that's one of the things that Donald Trump has really brought back into Washington, into America, into the Kennedy Center — is to say everyone is welcome.\" Grenell floated the possibility of organizing a show during the holiday season celebrating the birth of Jesus Christ. He emphasized that under his guidance, the Kennedy Center will strive to host programs that will be \"very popular.\" KENNEDY CENTER SHAKE-UP WILL USHER IN 'GOLDEN AGE OF THE ARTS' UNDER TRUMP, RIC GRENELL PREVIEWS CLICK HERE TO GET THE FOX NEWS APP \"We can't continue to have an arts center that is making financial decisions that keep getting us into the hole,\" he said. \"We need popular shows — we need shows that the public is going to come to.\"","summary":"Kennedy Center interim director Ric Grenell joins &quot;Hannity&quot; to discuss the institution&apos;s pledge to be open to all audiences and responds to &quot;Hamilton&quot; canceling plans to perform there.","url":"https://www.foxnews.com/media/kennedy-center-director-encourages-republican-attendance-says-everyone-welcome","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/kennedycenter.png?ve=1&tl=1","video":null,"publish_date":"2025-03-08 23:08:38","author":"Benji Ferraro","authors":["Benji Ferraro"],"language":"en","category":"politics","source_country":"us","sentiment":0.137},{"id":298172998,"title":"New EPA guidance says spending items greater than $50,000 must get approval from DOGE","text":"The Environmental Protection Agency has issued new guidance directing that spending items greater than $50,000 now require approval from Elon Musk’s Department of Government Efficiency.\n\nThe guidance, issued this week, escalates the role that the new efficiency group, known as DOGE, plays in EPA operations.\n\n“Any assistance agreement, contract or interagency agreement transaction (valued at) $50,000 or greater must receive approval from an EPA DOGE team member,” the EPA guidance says, according to documents obtained by The Associated Press.\n\nTo facilitate the DOGE team review, EPA staff members have been directed to submit a one-page explanation of each funding action each day between 3 and 6 p.m. Eastern time, the guidance says. Other relevant forms also must be completed.\n\nPresident Donald Trump has tasked DOGE with digging up what he and Musk call waste, fraud and abuse. The Republican president suggested Thursday that Cabinet members and agency leaders would take the lead on spending and staffing cuts, but he said Musk could push harder down the line.\n\n“If they can cut, it’s better,” Trump said of agency leaders. “And if they don’t cut, then Elon will do the cutting.”\n\nThe EPA did not respond to a request Friday for comment.\n\nRhode Island Sen. Sheldon Whitehouse, the top Democrat on the Senate Environment and Public Works Committee, called the new directive “troubling,” adding that it means agency actions, including routine contracts and grant awards, “now face unnecessary bureaucratic delays.”\n\nRoutine expenditures such as grants for air and water quality monitoring, laboratory equipment purchases, hazardous waste disposal at federal sites and money for municipal recycling programs are among spending that likely will be affected, he said.\n\nWhitehouse, an outspoken critic of Musk and Trump, said the involvement of Musk’s “unvetted, inexperienced team raises serious concerns about improper external influence on specialized agency decision-making.”\n\nIn a letter Friday to EPA Administrator Lee Zeldin, Whitehouse said spending actions greater than $50,000 are often complex and require specialized knowledge of environmental science, policy and regulations. “Allowing unskilled, self-proclaimed ‘experts,’ not vetted for conflicts of interest, to have veto power over funding determinations is inappropriate and risks compromising the agency’s mission to protect public health and the environment,” Whitehouse wrote.\n\nAn EPA directive says the new guidance is intended to comply with executive orders issued by Trump that seek to restrict federal spending.\n\nWhitehouse called those orders illegal, adding, “It is already established by court order that it is Congress that authorizes and appropriates funds for specific purposes, not the Office of Management and Budget or the president via executive order or DOGE.”\n\nThe dispute over the spending guidelines comes as Zeldin has pledged sharp spending cuts as high as 65% at the agency.\n\n“We don’t need to be spending all that money that went through the EPA last year,” Zeldin said last week. “We don’t want it. We don’t need it. The American public needs it and we need to balance the budget.”\n\nPresident Joe Biden requested about $10.9 billion for the EPA in the current budget year, an increase of 8.5% over the previous one, but Zeldin said the agency needs far less money to do its work. He also criticized EPA grants authorized under the 2022 climate law, including $20 billion for a so-called green bank to pay for climate and clean-energy programs.\n\nZeldin has vowed to revoke contracts for the still-emerging bank program that is set to fund tens of thousands of projects to fight climate change and promote environmental justice.\n\nWhite House spokeswoman Taylor Rogers said last week that Trump, DOGE and Zeldin are all “committed to cutting waste, fraud, and abuse.”\n\nA 65% reduction in spending would be devastating to the EPA and its mission, said Marie Owens Powell, president of the American Federation of Government Employees Council 238. Core actions such as monitoring air and water quality, responding to natural disasters and lead abatement, among other agency functions, are at risk, she said.","summary":"To facilitate the DOGE team review, EPA staff members have been directed to submit a one-page explanation of each funding action each day between 3 and 6 p.m. Eastern time, the guidance says. Other relevant forms also must be completed.","url":"https://www.bostonherald.com/2025/03/08/new-epa-guidance-says-spending-items-greater-than-50000-must-get-approval-from-doge/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/epa-administrator.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-08 23:07:20","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.196},{"id":298171168,"title":"Bolton Describes Trump’s Threat of Sanctions on Russia as ‘Utterly Empty’","text":"Top Stories\n\nEntertainment\n\nSaturday, March 8, 2025\n\nWelcome! Log into your account\n\nyour username\n\nyour password\n\nForgot your password? Get help\n\nPrivacy Policy\n\nPassword recovery\n\nRecover your password\n\nA password will be e-mailed to you.\n\nThe Union Journal\n\nTop Stories\n\nEntertainment\n\nHomeTop StoriesBolton Describes Trump’s Threat of Sanctions on Russia as ‘Utterly Empty’\n\nTop Stories\n\nBolton Describes Trump’s Threat of Sanctions on Russia as ‘Utterly Empty’\n\nBy Joe Killer\n -March 8, 2025\n\nJohn Bolton, the former national security adviser at the White House, dismissed President Trump’s latest warning regarding potential sanctions on Russia due to its ongoing attacks in Ukraine, emphasizing that peace negotiations are still in progress…\n\nPrevious articleFormer Federal Employees Who Supported Donald Trump Share Their Regrets After Being Laid Off, And Their Stories Are Abundant\n\nNext articleSupreme Court Signals It Will Not Yield to Donald Trump—Attorney\n\nRecent Posts\n\nAhmaud Arbery: Detective Testifies Gregory McMichael Never Saw Jogger Commit Crime\n\nHow COVID-19 reshaped the health care industry\n\nTommy Bryant Refuses To Resign From The Alabama Council\n\nTrump just told 12 lies about January 6 on Fox News\n\nJonathan Majors Has Been Arrested In New York On Assault Charge\n\nMost Popular\n\nSupreme Court Signals It Will Not Yield to Donald Trump—Attorney\n\nOn Wednesday, attorney Glenn Kirschner stated that the U.S. Supreme Court made it clear that it \"won't yield\" to President Donald Trump...\n\nFormer Federal Employees Who Supported Donald Trump Share Their Regrets After Being Laid Off,...\n\n\"I used to support Trump, but once he assumed office, I started to realize that many of his policies appeared to affect individuals like...\n\nTrump Administration’s Policies May Encourage Illicit Drug Trade, Countering Pledge to Combat Fentanyl\n\nThe policies of Donald Trump may make the United States more susceptible to the hazardous trafficking of synthetic drugs from other countries,...\n\nDonald Trump and Elon Musk Weigh In on Daylight Saving Time Debate\n\nIrmo Man Arrested and Charged for Threatening President Trump\n\nCOLUMBIA, S.C. (WIS) - An individual from Irmo was taken into custody on Thursday for making threats against President Donald...\n\nABOUT USThe Union Journal provide you with the latest local and national news, sports, entertainment, finance, technology, and more\nContact us: contact@theunionjournal.com\n\nPrivacy Policy\n\n© Copyright 2019 - theunionjournal.com","summary":"John Bolton, the former national security adviser at the White House, dismissed President Trump’s latest warning regarding potential sanctions on Russia due to its ongoing attacks in Ukraine, emphasizing that peace negotiations are still in progress&#8230;","url":"https://www.theunionjournal.com/bolton-describes-trumps-threat-of-sanctions-on-russia-as-utterly-empty/","image":"https://www.theunionjournal.com/wp-content/uploads/2024/11/breakingnews1.jpg","video":null,"publish_date":"2025-03-08 23:07:06","author":"Joe Killer","authors":["Joe Killer"],"language":"en","category":"politics","source_country":"","sentiment":-0.187},{"id":298173000,"title":"Bragg to Liberty and back again: Ceremony to rechristen Army post once named for a Confederate","text":"The short-lived existence of Fort Liberty came to an end Friday when the nation’s largest Army installation officially returned to its former name: Fort Bragg.\n\nChristened a century ago in honor of Confederate Gen. Braxton Bragg, the post in North Carolina was renamed in 2023 amid a drive to remove symbols of the Confederacy from public spaces.\n\nBut last month Defense Secretary Pete Hegseth signed an order reinstating the Bragg name, only this time it will honor Army Pfc. Roland L. Bragg, a World War II paratrooper and Silver Star recipient from Maine. A few hundred people — made up of active servicemen and members of the public — gathered under black and yellow tents in front of the base’s command center headquarters to watch the renaming ceremony.\n\n“Today we honor a hero worthy of the name Bragg,” Lt. Gen. Greg Anderson said during the ceremony. “It is synonymous with excellence.”\n\nAmong the attendees were several members of Bragg’s family, including his daughter, Diane Watts, and his granddaughter, Rebecca Amirpour, who spoke on the family’s behalf during the ceremony. Amirpour described her grandfather as a “strong, hardworking and proud” man who didn’t discuss his military service in World War II very openly.\n\nBragg, who served with the 17th Airborne Division, received the Silver Star and a Purple Heart for exceptional courage during the Battle of the Bulge. He was captured by Germans and commandeered an ambulance back to safety with a few wounded paratroopers, one of which survived, Anderson said.\n\n“Rank doesn’t mean a thing when you’re in a tight spot,” said Amirpour, who was reading an excerpt from a letter her grandfather had written while recovering from an injury in an Army hospital.\n\nBefore his deployment, Bragg — of Nobleboro, Maine — trained at the North Carolina post, Watts said.\n\nWhen the redesignation was announced Feb. 10, some critics saw it as a cynical sop to President Donald Trump, who criticized the removal of Confederate names as “woke” and made restoring them part of his reelection campaign.\n\nFort Bragg’s name being restored was like a “phoenix rising from the ashes,” said retired Maj. Al Woodall, who served at Fort Bragg at several points during his service. Woodall, who is Black, said he wasn’t bothered by the installation’s initial name origin. Instead, he felt connected to the name because it had been that way for more than 100 years.\n\nCarl Helton, who served at Fort Bragg from 1962 to 1964, said he was “ecstatic” about the name change. The 80-year-old, who traveled about an hour to attend the ceremony, refused to call the installation Fort Liberty after it was initially renamed, he said.\n\n“It should have never been changed to start with. It was all political anyway,” Helton said.\n\nHegseth signed the order during a flight to Europe and said in a video, “That’s right. Bragg is back.”\n\nIt took an act of Congress — overriding Trump’s 2020 veto — to remove Confederate names from military installations, including nine Army facilities. Although several lawmakers complained about the switch back to Bragg and its potential costs, it is unclear whether any lawmaker intends to challenge it.\n\nThe name changing continues.\n\nHegseth announced this week that Georgia’s Fort Moore would revert back to Fort Benning. Originally named for Confederate Brig. Gen. Henry L. Benning, it will now honor Cpl. Fred G. Benning, a recipient of the Distinguished Service Cross who served in France during World War I.\n\nThe Liberty-to-Bragg reversion was made without first consulting with Roland Bragg’s family, but his daughter was delighted by it.\n\nThe Army said in 2023 that changing the name to Fort Liberty would cost $8 million. North Carolina’s Department of Transportation said last month that it anticipated replacing dozens of roads signs at a cost of over $200,000.\n\nChanging the name to Fort Liberty was a waste of money to begin with, said Mike D’Arcy, who served at Fort Bragg through the 1990s. He said a solution to having to pay more to revert Fort Bragg’s name should be cutting politician salaries instead.\n\nTo Woodall, the money spent on returning to Bragg is a well-spent investment.\n\n“Just like coming back home again,” he said.","summary":"Last month, Defense Secretary Pete Hegseth signed an order reinstating the Bragg name, only this time it will honor Army Pfc. Roland L. Bragg, a World War II paratrooper and Silver Star recipient from Maine.","url":"https://www.bostonherald.com/2025/03/08/bragg-to-liberty-and-back-again-ceremony-to-rechristen-army-post-once-named-for-a-confederate/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/fort-bragg.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-08 23:04:05","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.098},{"id":298174126,"title":"Is This Altcoin the Next Addition to Trump’s Strategic Crypto Reserve?","text":"A few days ago, the United States President, Donald J. Trump, gave an open announcement on his Social media platform (Truth Social), giving an executive order on digital assets like BTC, ETH, XRP, SOL, and ADA to be added to the US crypto reserve.\n\nThis initiative underscores the growing importance of cryptocurrencies in the global financial landscape, and ever since there have been speculations about whether there would be inclusions of other altcoins in this crypto reserve.\n\nOne such altcoin that has garnered attention is PropiChain (PCHAIN), hence this article will give a debrief of what this crypto reserve means and how PropiChain stands out as a top contender for a spot in the crypto reserve.\n\nTrump’s Strategic Crypto Reserve and its Impact on the Crypto Market\n\nAlthough the strategic crypto reserve announcement has been long awaited since President Trump’s inauguration. And due to silence from his administration team, the majority of altcoins, $TRUMP included, took a huge dump in the market as many were sceptical about their long-term growth. \n\nHowever, during his announcement on Truth Social, President Trump further clarified that the order then was only to evaluate the potential creation and maintenance of a national digital asset stockpile. \n\nAnd with so many positives, he further approved of the inclusion of the aforementioned crypto assets. Likewise, considering the criteria for inclusion in the crypto strategic reserve, analysts strongly believe that PropiChain possesses several attributes that align with the government’s objectives.\n\nThis move is expected to positively impact the crypto market, attract substantial institutional investments and pave the way for broader acceptance of cryptocurrencies at large.\n\nHow PropiChain Stands Out to Analysts as they Contemplate its Inclusion\n\nPropiChain is a decentralized finance platform that aims to solve major problems and challenges affecting the real estate sector by offering offers predictive market analysis, automated property valuations, and personalized property suggestions, all powered by advanced AI algorithms. \n\nIts approach to tackling liquidity issues, lengthy transactions, barriers to entry, complex legal, limited transparency, 3rd party intermediaries and complex legal is through its smart contract architectures, which automate various phases of real estate transactions.\n\nUsers trying to auto-lease or auto-rent their properties can do so seamlessly with the integration of PropiChain payment contract, which initiates and tracks payment requests through a Simplified Payment Verification (SPV) algorithm.\n\nLikewise, its Escrow contract ensures that the financial aspects of the transaction are handled with the utmost security and transparency, serving as a model that locks and releases payment securely to users without the fear of any fraudulent activities.\n\nBeyond AI, PropiChain leverages Metaverse technology to enhance user experience. Through immersive 3D virtual property tours, potential buyers and renters can explore properties from anywhere in the world.\n\nIts AR/VR capabilities also offer an enhanced buying process and customized options to international investors, making it easier to make selections without any geographical barrier.\n\nPropiChain’s integration of AI and Metaverse technologies, BlockAudit review, and CoinMarketCap listing showcases its commitment to innovation, a key factor for consideration in the crypto reserve, all of which serves as a testament to its credibility and the solid foundation of its roadmap. \n\nAs the crypto landscape evolves, the establishment of the U.S. Crypto Strategic Reserve signifies a monumental shift toward the institutional acceptance of digital assets. And projects like PropiChain, with their innovative integration of AI and Metaverse technologies, stand at the forefront of this revolution.\n\nFor Investors looking for altcoins to invest in, PropiChain is currently selling at an extremely low price of $0.01 in its round two token presale stage. This gives interested early adopters an ample amount of time to accumulate PCHAIN tokens before its price surges by 108.93% in round three.\n\nWith $2000 into this presale, analysts are bullish on PropiChain’s trajectory to mirror the explosive growth patterns observed in past crypto success stories of up to 5000x, yielding over $200,000 upon launch, thereby positioning it as a noteworthy contender in the evolving digital asset landscape.\n\nWebsite: PropiChain\n\nJoin Community: Propichain | Instagram | Linktree","summary":"A few days ago, the United States President, Donald J. Trump, gave an open announcement on his Social media platform &#8230; Continue reading\n\n\nThe post Is This Altcoin the Next Addition to Trump’s Strategic Crypto Reserve? appeared first on Finbold.","url":"https://finbold.com/is-this-altcoin-the-next-addition-to-trumps-strategic-crypto-reserve/","image":null,"video":null,"publish_date":"2025-03-08 23:00:00","author":"ggz marketing","authors":["ggz marketing"],"language":"en","category":"politics","source_country":"us","sentiment":0.206},{"id":298170120,"title":"Big Ben clock tower incident expected to continue overnight as man stays put","text":"An incident involving a man who scaled the clock tower of Big Ben on Saturday morning is expected to continue into Sunday as negotiators have been unable to convince him to come down.\n\nThe man, who is barefoot and holding a Palestine flag, has been spoken to by negotiators several times but at 10.30pm had not yet agreed to come down from Elizabeth Tower.\n\nThe scene remained busy with emergency crews, with dozens of uniformed police officers guarding the cordon which extended from Bridge Street to Westminster Bridge.\n\nTwo aerial ladder platforms, an incident response unit ambulance, regular ambulances and two fire engines were still at the scene late on Saturday.\n\nIn a video posted on Instagram on Saturday evening, the man told negotiators from the ledge he was sat on that he would come down “on his own terms”.\n\nIn the footage, negotiators on an aerial ladder platform appear to raise concerns about an injury to his foot, saying there is “quite a lot of blood” and that his clothes are not warm enough as temperatures drop after sunset.\n\nBut the man insists he is safe and says: “I will come down on my own terms, I have said this. But right now I am saying I am safe.\n\n“If you come towards me you are putting me in danger and I will climb higher.”\n\nIn the afternoon, shouts of “Free Palestine” and “You are a hero” could be heard from a small group of supporters behind the police cordon at Victoria Embankment.\n\nIn videos posted on social media earlier on Saturday, the man appeared to climb over a fence surrounding the Houses of Parliament without any security guards approaching him.\n\nConservative MP Ben Obese-Jecty said on X there needs to be an explanation about how the man got into the parliamentary estate.\n\nHe said: “Every day in Parliament I see dozens of armed police officers patrolling Portcullis House and the parliamentary estate. Where were they today?\n\n“On Monday there needs to be a full explanation to MPs and staff as to how this protester was able to evade security so easily.”\n\nParliamentary tours, which happen on Saturdays when Parliament is sitting and on weekdays during the summer recess, were cancelled.\n\nA parliamentary spokesperson said: “We are aware of an incident on the parliamentary estate, which is being handled by the Metropolitan Police, assisted by the London Fire Brigade and the London Ambulance Service.\n\n“Parliament takes security extremely seriously, however we do not comment on the specifics of our security measures or mitigations.”\n\nLondon bus routes 3, 11, 148, C10 and 159 remain on diversion as the road closures continued.\n\nIn 2019, an Extinction Rebellion activist wearing a blond wig was arrested after climbing the scaffolding surrounding the clock tower.\n\nTree surgeon Ben Atkinson climbed the scaffolding surrounding Big Ben dressed as Boris Johnson – complete with a blond wig, shirt, jacket and tie – and was up Elizabeth Tower for around three and a half hours on October 18 2019, before police managed to get him to come down.\n\nOn Friday night, Donald Trump’s Turnberry golf resort in Scotland was vandalised by activists in response to the US president’s statements on Gaza.\n\nThe golf course in South Ayrshire, owned by the US president, was targeted, with activists painting Gaza Is Not For Sale in three-metre high letters on the lawn, and damaging the greens.\n\nPalestine Action described it as a “direct response to the US administration’s stated intent to ethnically cleanse Gaza”.","summary":"An incident involving a man who scaled the clock tower of Big Ben on Saturday morning is expected to continue into Sunday as negotiators have been unable to convince him to come down. The man, who is barefoot and holding a Palestine flag, has been spoken to by negotiators several times but at 10.30pm had [&#8230;]\n\n\nThe post Big Ben clock tower incident expected to continue overnight as man stays put appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/08/big-ben-clock-tower-incident-expected-to-continue-overnight-as-man-stays-put/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.79321711-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-08 22:59:13","author":"Newsdesk","authors":["Newsdesk"],"language":"en","source_country":"gb","sentiment":-0.125},{"id":298168958,"title":"RFK Jr allows DOGE, Elon Musk’s company, access to a large child support database disclosing income information","text":"Elon Musk’s DOGE has been granted access to a sensitive child support database by the Department of Health and Human Services. \n\nThe landmark move was approved by the HHS, now headed by Robert F. Kennedy Jr., despite protests from career employees within the department, according to the Washington Post. \n\nThe huge government database contains swaths of personal income data from Americans across the country, and it was initially created with the intention of enforcing child support payments. \n\nAn HHS official told the Post that DOGE agents requested ‘read only’ access to the database, and were required to take ‘necessary trainings’ before they were allowed into it. \n\nThe official said the Administration for Children and Families, which oversaw the database, ‘supports DOGE’s efforts to improve efficiency and data quality to reduce waste, fraud, and abuse in federal programs.’ \n\n‘ACF will continue to assist DOGE in efforts to strengthen the programs it runs,’ the anonymous official said. \n\nInsiders reportedly saw DOGE’s access of the child support database as part of its efforts to crackdown on wasteful federal payments to Americans, with their attempts to access IRS data previously halted by federal law. \n\nThe child support database may offer similar information on tax records and federal benefits that could highlight duplicate or fraudulent payments that may have been previously missed by the separation of huge federal agencies. \n\nAccording to HHS insiders who spoke with the Post, a career civil servant protested allowing DOGE agents into the child support database, but that person has since left the department. \n\nCivil servants in multiple agencies have objected to DOGE’s efforts to obtain sensitive government data since Donald Trump re-took the White House, amid fears the new department could overstep important safety guardrails. \n\nDOGE was reportedly especially interested in accessing a component of the child support database known as the National Directory of New Hires, which shows hiring data nationwide. \n\nThe controversial new government agency has sparked backlash for its ‘chainsaw approach’ to cutting government spending, with critics claiming legitimate, needed government programs have been slashed alongside waste. \n\nAfter being rebuffed by the IRS as some opponents argue DOGE may recklessly access sensitive data, the department claims accessing such databases is necessary to root out issues deep within the federal government. \n\nAs DOGE’s access to the child support database was reported on Friday, Democrats urged the department to fully explain the move and reveal how many Americans ‘have had their confidential information received or accessed.’ \n\n‘It is essentially an end-run around the confidential taxpayer information protected by the IRS,’ Congressman Richard Neal told the Post. \n\nNeal, the top Democrat on the House Ways and Means Committee, wrote a letter to RFK Jr. and Treasury Secretary Scott Bessent urging the White House to lead with transparency. \n\n‘No one, including DOGE, should be rummaging around in the confidential information of private citizens at any agency where the protected information resides,’ Neal added. \n\nThe widespread cuts pushed by Musk’s DOGE have sparked protests in recent weeks, as opponents lament the mass firings across the federal government and slashing of support. \n\nIt appeared this week that Trump heard criticisms of Musk’s slash-and-burn approach as he told his cabinet leaders that they alone are in charge of hiring and firing employees within their departments, not Musk. \n\n‘DOGE has been an incredible success, and now that we have my Cabinet in place, I have instructed the Secretaries and Leadership to work with DOGE on Cost Cutting measures and Staffing,’ Trump wrote in a post to Truth Social.\n\nThe president abruptly assembled his Cabinet on Thursday amid rising scrutiny over how much power Musk wields over the U.S. government.\n\nIt appears Trump told his top leaders that they need to be more selective if they continue to conduct clear-outs of their workforce. \n\nHe said that instead of taking a ‘hatchet’ approach, secretaries should instead use a ‘scalpel’ for ‘surgical’ precision over who they dismiss.\n\nThe news from HHS comes just days after the agency controversially announced that the CDC will study the potential link between vaccines and autism. \n\nTwo sources told Reuters the agency is planning a large study into the long disproven connection.\n\nHowever, it is unclear whether newly appointed health secretary RFK Jr., who has long been skeptical of vaccines, is involved in the planned study or how it would be carried out. \n\nThe bombshell move comes amid one of the largest measles outbreaks in US history, with more than 150 cases across the country and two deaths in Texas and New Mexico.\n\nExperts believe the outbreak has been fueled by declining vaccination rates in parts of the US.\n\nKennedy, whose role includes authority over the CDC, has long sowed doubt over the safety of the measles, mumps and rubella (MMR) vaccine, along with Covid shots made by Pfizer and Moderna.\n\nHowever, he did make a U-turn move earlier this week when he urged people to get the shot to prevent measles.","summary":"Internewscast Journal\n\nInternewscast\n\n\nElon Musk&#8217;s DOGE has been granted access to a sensitive child support&#8230;\n\n\nThis Post: RFK Jr allows DOGE, Elon Musk&#8217;s company, access to a large child support database disclosing income information first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/rfk-jr-allows-doge-elon-musks-company-access-to-a-large-child-support-database-disclosing-income-information/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-RFK-Jrs-HHS-grants-Elon-Musks-DOGE.jpg","video":null,"publish_date":"2025-03-08 22:58:47","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.501},{"id":298172614,"title":"National News at a Glance","text":"NOAA Said to Be Planning to Shrink Staff by 20%\n\nThe National Oceanic and Atmospheric Administration, the nation's premier agency for weather and climate science, has been told by the Trump administration to prepare to lose another 1,000 workers, raising concerns that NOAA's lifesaving forecasts might be hindered as hurricane season approaches. The new dismissals would come in addition to the roughly 1,300 NOAA staff members who have already resigned or been laid off in recent weeks. Together, the reductions would represent nearly 20% of NOAA's approximately 13,000-member workforce. Some activities, including the launching of weather balloons, have already been suspended because of staffing shortages.\n\nClimate Nonprofit Sues EPA Over Billions in Frozen Funds\n\nA multibillion-dollar dispute between the Environmental Protection Agency and several nonprofit organizations escalated Saturday when one group sued the EPA and Citibank, seeking access to grant money that has been frozen under President Donald Trump. Climate United contends that the EPA and Citibank have illegally withheld an award of nearly $7 billion announced last April. Citibank has housed the funds as part of a program to finance projects that address climate change. Eight nonprofits collectively received $20 billion from the Greenhouse Gas Reduction Fund during the Biden administration. Now some of the nonprofits say that their bank accounts are frozen and that they are struggling to pay staff members.\n\nHouse Republicans Unveil Spending Bill to Avert Shutdown at Week's End\n\nHouse Republicans on Saturday unveiled a measure to fund the government through Sept. 30, boosting spending on the military and daring Democrats to oppose it and risk being blamed for a government shutdown that would begin after midnight Friday. The legislation would slightly decrease spending overall from last year's funding levels, but would increase spending for the military by $6 billion. It was unclear whether the legislation could pass the Republican-controlled Congress. Speaker Mike Johnson will need to navigate the bill through his extremely narrow House majority as early as Tuesday and has just a vote or two to spare if Democrats are unanimously opposed.\n\n14-Year-Old Boy Arrested in Connection With Fatal Newark Police Shooting\n\nA 14-year-old boy has been arrested in connection with a shooting Friday night that killed one Newark, New Jersey, police officer and injured another, Essex County officials said Saturday. The boy, who was also injured, was charged with murder, attempted murder and possessing illegal weapons following the shooting, Theodore N. Stephens II, the Essex County prosecutor, said Saturday. The boy's name has not been released. The officer who was killed was identified Saturday as Joseph Azcona, 26, a detective who had served with the Newark Police Department for five years.\n\nFormer Ride-Share Driver Sentenced for Preying on Women\n\nA Denver judge on Friday sentenced a former ride-share driver to 290 years to life after prosecutors said he abducted a dozen women over four years by falsely posing as the driver they requested. The man, John Pastor-Mendoza, was convicted in late October on 30 charges related to the kidnapping, attempted sexual assault and sexual assault of the women between 2018 and 2022. Pastor-Mendoza, 43, who lived in Denver, falsely claimed to be the driver for women who used a ride-sharing app, picking them up outside downtown bars and clubs.\n\nFor Black Women, Adrienne Adams Is More Than Just Another Mayoral Candidate\n\nAs Adrienne Adams officially kicked off her mayoral campaign Saturday, she urged potential voters at a rally in Jamaica, Queens, to view her as an alternative to New York City's two most recognizable candidates, Mayor Eric Adams and former Gov. Andrew Cuomo. But many of her supporters see her candidacy as something else: an opportunity for Democrats to elect a qualified Black woman as mayor. If elected, she would be the first woman of color to lead the country's largest city. Adrienne Adams, the City Council speaker and a Queens native, faces a tough path amid a crowded field and her own fundraising lag.\n\nThis article originally appeared in The New York Times.","summary":"NOAA Said to Be Planning to Shrink Staff by 20%","url":"https://www.berkshireeagle.com/nyt/national-news-at-a-glance/article_b1c4e471-6eee-5269-9a7e-874133628ef2.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-08 22:56:31","author":"North Adams Pride","authors":["North Adams Pride"],"language":"en","source_country":"us","sentiment":-0.456},{"id":298170054,"title":"An Elite Russian Drone Group Is Hunting Ukrainian Vehicles In Kursk. It’ll Take More Than A Few MiG-29 Raids To Stop The Russians.","text":"Ukrainian MiG-29s.\nUkrainian air force photo\n\nDeploying one of its most effective drone units and hundreds of North Korean troops along with the usual marines and paratroopers, a powerful Russian force squeezed the Ukrainian-held salient in western Russia’s Kursk Oblast last week.\n\nThe Russian advance, which began just as the administration of U.S. President Donald Trump was cutting off Ukraine from U.S.-gathered intelligence and shipments of American-made munitions, reversed Ukrainian gains from last month and threatened to cut off the main road leading into the Ukrainian military’s main base in Kursk: the town of Sudzha.\n\nThe Ukrainian general staff in Kyiv told Ukrainian Pravda the situation in Kursk, which has been under partial Ukrainian control since August, “remains challenging but under control,” to quote the news site.\n\nBut it’s unclear what measures the Ukrainians have taken to defeat a new and potent combination of capabilities the Russian Northern Grouping of Forces has assembled to restore momentum to its counteroffensive in Kursk.\n\nFor starters, the Russian 177th Marine Regiment, 810th Naval Infantry Brigade and 11th Air Assault Brigade once again are backed by significant numbers of North Korean troops.\n\nThe North Korean 11th Army Corps temporarily withdrew from the front line in Kursk in December or January after losing a third of its 12,000 troops in costly assaults on the Kursk salient late last year. It seems the corps is back with fresh troops.\n\nA Ukrainian MiG-29 bombs a warehouse sheltering Russian vehicles.\nVia WarTranslated\n\nDrone surge\n\nMore importantly, the Kremlin has pushed one of its best drone groups, the Rubicon Center of Advanced Unmanned Systems, into the Kursk fight—blunting Ukraine’s main advantage: its superior drones. “Rubicon employs advanced drone tactics,” independent analyst Andrew Perpetua explained.\n\nThey often target short sections of roads—100 to 300 meters long—and saturate these areas with drones. Attacks are frequently carried out in groups, sometimes striking the front, back, and sides of a vehicle almost simultaneously. This approach has also been used to hit multiple vehicles in a convoy at once, compounding the damage. They also set traps by landing drones on roads and detonating them under passing vehicles, functioning like anti-tank mines—likely using upward-facing shaped charges.\n\nWith well-made drones and radio control systems that can apparently rapidly switch frequencies, Rubicon has managed to fight through Ukrainian jamming, which normally has the effect of grounding most Russian drones.\n\nAs a result, “Ukrainian logistics in Kursk have suffered severe damage from drone attacks,” Perpetua explained. Rubicon has knocked out hundreds of Ukrainian vehicles—mostly supply trucks, but also precious M-2 Bradley fighting vehicles and MaxxPro armored trucks.\n\n“Numbers are definitely not [on] our side,” wrote Kriegsforscher, a Ukrainian marine corps drone operator who has fought in Kursk.\n\nThe Ukrainian air force sortied at least one Mikoyan MiG-29 fighter to bomb a warehouse sheltering Russian armored vehicles supporting the Kursk counteroffensive. Ukrainian troops reportedly defeated an incursion by Russian troops sneaking through an old pipeline into Sudzha.\n\nWhat the Ukrainian force in Kursk really needs are new radio jammers. “Without significant advancements in jamming technology to counter Rubicon's capabilities, maintaining a hold in Kursk may become unsustainable,” Perpetua warned.\n\nFollow me on Twitter. Check out my website or some of my other work. Send me a secure tip.\nEditorial StandardsForbes Accolades","summary":"Russian advances threaten the only supply line to Ukrainian forces in Kursk.","url":"https://www.forbes.com/sites/davidaxe/2025/03/08/an-elite-russian-drone-group-is-hunting-ukrainian-vehicles-in-kursk-itll-take-more-than-a-few-mig-29-raids-to-blunt-the-russian-edge/","image":"https://imageio.forbes.com/specials-images/imageserve/67ccc898262401954da4bee8/0x0.jpg?format=jpg&crop=1416,796,x0,y816,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-08 22:53:02","author":"David Axe,Forbes Staff","authors":["David Axe","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.221}]}