{"offset":0,"number":50,"available":6228,"news":[{"id":258982692,"title":"Trump sent COVID-19 tests to Putin, Bob Woodward says in his new book","text":"Washington - Then-president Donald Trump secretly sent COVID-19 test kits to Russian President Vladimir Putin, despite a U.S. shortage during the pandemic, and spoke multiple times with the leader after leaving office, Bob Woodward says in an explosive new book.The famed reporter's opus also chronicles some of U.S. President Joe Biden's own acknowledged missteps and his struggle to prevent conflict from escalating in the Middle East, including exasperation with Prime Minister Benjamin Netanyahu over futile efforts to get Israel and Hamas to reach a cease-fire.In excerpts of 'War' published Tuesday by The Washington Post, where Woodward is an associate editor, he says Trump retains a personal relationship with Putin even as he campaigns for another term and the Russian president conducts a war against U.S. ally Ukraine.","summary":"Donald Trump also retains a personal relationship with Vladimir Putin, Woodward writes.","url":"https://www.japantimes.co.jp/news/2024/10/09/world/politics/trump-covid-tests-putin-woodward/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/10/09/426697.JPG?v=3.1","video":null,"publish_date":"2024-10-09 01:02:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","source_country":"JP","sentiment":0.124},{"id":258982844,"title":"Who Created Bitcoin? A New Documentary Claims to Have Solved the 'Greatest Question of the Internet Age'","text":"What is Bitcoin? It's a question many have been asking since the crytocurrency became a part of the lexicon some 15 years ago. But for those already in the know, a more pressing question has been this one: Who is the person responsible for springing it on global economics?\n\n The new HBO documentary Money Electric: The Bitcoin Mystery, directed by Cullen Hoback (Q: Into the Storm) claims to have figured out the identity of the elusive figure who up to now has been known by the pseudonym \"Satoshi Nakamoto.\"\n\n The documentary, which premiered on Oct. 8, explains, for beginners, what the cryptocurrency is and goes through its long, controversial history. \"Who cares about Bitcoin?\" Jamie Dimon, CEO of JPMorgan Chase, rhetorically asks in an old clip at the beginning of the doc as the 2010 value of one bitcoin flashes on the screen.\n\n Spoiler alert: It's 23 cents.\n\n A group of people, including Donald Trump, are heard and seen characterizing Bitcoin as a \"scam\" as we see its value increasing onscreen over the years that follow. A decade and a half after its launch, the documentary claims, \"Bitcoin has become the 10th most valuable asset in the world.\"\n\n But still, the trillion-dollar question persists: Who created it?\n\n Satoshi Nakamoto, who might be worth more than $1 trillion, is said to be the genius behind the decentralized, libertarian dream currency — but no-one by that name actually exists. And, as the documentary goes on to explain, Nakamoto disappeared years ago, leading to \"the greatest mystery of the internet age\" — the Gen Z version of \"Who killed Jimmy Hoffa?\" and \"What happened to D.B. Cooper\"?\n\n Nakamoto created Bitcoin in 2008, and then they seemed to vanish around the end of 2010 or the beginning of 2011, before the cryptocurrency really took off.\n\n Cullen travels around the world and speaks to various experts and insiders, including Blockstream CEO Adam Back, early Bitcoin developer Peter Todd and \"Bitcoin Jesus\" Roger Ver, to get to the bottom of why Satoshi vanished and, more importantly, who they are. Are they still alive? Did they ever even exist?\n\n Australian businessman Craig Wright claimed to be Nakamoto at one point, which effectively ruled him out and eventually landed him in the crosshairs of the U.K. High Court.\n\n The documentary throws out several other names — Blockstream cofounder Gregory Maxwell, computer scientist Nick Szabo, researcher and investor Wei Dei and the late Bitcoin pioneer Hal Finney — before landing on one man: Peter Todd.\n\n Todd, a young Canadian who was still a college student in the early days of Bitcoin, says he didn't get involved in Bitcoin until 2014. But Cullen uncovers evidence that Todd had posted on the Bitcoin forum as far back as 2010, finishing one of Nakamoto's thoughts before disappearing from the platform two days before Nakamoto vanished from the forum.\n\n Todd starts chuckling when Cullen presents him with his suspicion. \"I will admit, you're pretty creative,\" he says. \"You come up with some crazy theories. It's ludicrous, but it's the kind of theory that someone who spends his time as a documentary journalist would come up with.\"\n\n He goes on to call Cullen's theory \"just another example of journalists really missing the point in a way that's very funny.\"\n\n \"What is the point?\" Cullen asks.\n\n \"The point is to make Bitcoin the global currency,\" Todd replies, still chuckling, \"and people like you being distracted by nonsense.\"\n\n That may be amusing to Todd, but it's not exactly a denial.\n\n Money Electric: The Bitcoin Mystery is now streaming on Max.","summary":"The true identity of the cryptocurrency&#39;s founder, &#34;Satoshi Nakamoto,&#34; has possibly been revealed in the HBO documentary &#39;Money Electric: The Bitcoin Mystery&#39;","url":"https://people.com/bitcoin-creator-satoshi-nakamoto-identity-possibly-revealed-in-new-documentary-8724775","image":"https://people.com/thmb/BCWl1Se_oLf5MT5Gtgy1himKm90=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x140:750x142)/A-statue-of-Satoshi-Nakamoto-a-presumed-pseudonym-used-by-the-inventor-of-Bitcoin-100824-ad0345ec8e4e49acafa5884ec95db945","video":null,"publish_date":"2024-10-09 01:00:00","author":"Jeremy Helligar","authors":["Jeremy Helligar"],"language":"en","source_country":"US","sentiment":0.068},{"id":258982406,"title":"Kamala Harris Takes Lead Over Donald Trump, New Poll Shows","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\n2024 Democratic presidential candidate Kamala Harris speaks at a campaign event in Atlanta, Georgia, ... [+] on July 30, 2024.\nAFP via Getty Images\n\nIn a key moment for the 2024 presidential race, a national poll from The New York Times and Siena College has found Vice President Kamala Harris holding a slight edge over former President Donald Trump, positioning her as the candidate of change. The poll, which surveyed 3,385 likely voters and was conducted from Sept. 29 to Oct. 6, shows Harris leading Trump 49 percent to 46 percent—a narrow margin within the poll’s margin of error. The results suggest a shift in voter sentiment, with Harris now seen as the candidate with a new vision.\n\nIn previous polls, Trump had maintained a lead on this narrative, but after losing the 2020 election and facing multiple legal challenges, his image as a disruptor appears to be losing some appeal with voters.\n\nThis marks the first time Harris has led Trump in a Times/Siena poll since July, when President Joe Biden officially dropped out of the race and Democrats united around Harris as his successor. With less than a month until the general election, the poll indicates the race for the White House could be one of the tightest in recent history.\n\nFor Trump, who has built his political identity as an outsider determined to disrupt the establishment and has used the slogan “Make America Great Again” as his political mantra, the recent poll shows a potential weakness because many voters now view Harris—not Trump—as the candidate representing a break from the status quo.\n\nHarris’s growing recognition as a changemaker is a critical development in a race where many voters are dissatisfied with the direction of the country. Poll after poll has shown that voters overwhelmingly believe the nation is headed in the wrong direction. In this climate, candidates who position themselves as fresh alternatives may have the upper hand, and Harris has tapped into this desire for new leadership by distancing herself from unpopular elements of Biden’s presidency.\n\nMORE FOR YOU\n\nA Missile Could Not Erase Russian Drone’s Embarrassing Stealth Secret\n\nHurricane Milton: Winds Pick Up As ‘Extremely Dangerous’ Storm Heads For Florida—Here’s What To Know\n\nGmail Hackers Have Control Of 2FA, Email And Number? Here’s What To Do\n\nOne notable factor in Harris’s growing appeal is her increasing support among key voter demographics. According to the poll, she has strengthened her backing among older voters—a group previously skeptical of her candidacy. She has made small but notable gains among Republicans, with 9 percent of Republicans indicating they would support her, up from 5 percent the previous month. Though still a minority, this shift could be significant in a highly polarized election season.\n\nHarris has also narrowed the gap on questions of temperament and trust, areas where Trump had previously held an advantage, and her lead can be partially attributed to her public appearances, including her performance in the presidential debate, where she emphasized the importance of the working class in America’s economy.\n\nDespite Harris’s lead, Trump continues to hold an advantage on several key issues, most notably the economy. Many voters still trust Trump more on economic matters, and his ability to maintain the loyalty of his supporters, particularly in swing states, will be important in the final stretch.\n\nWith election day approaching, both campaigns are investing in efforts to mobilize voters, especially in key states like Pennsylvania, Michigan, and Wisconsin, but voters will ultimately have to choose between two vastly different visions for the future. The question is whether Harris’s message of change and unity can resonate more deeply with voters than Trump’s call for a return to his populist agenda. Both campaigns are preparing for an intense final push, aiming to win over undecided voters who could ultimately decide the outcome of this closely watched election.\n\nSughnen Yongo\n\nEditorial Standards\n\nForbes Accolades","summary":"A new poll suggests a shift in voter sentiment, with Harris now seen as the candidate with a new vision for the American people.","url":"https://www.forbes.com/sites/sughnenyongo/2024/10/08/kamala-harris-takes-lead-over-donald-trump-new-poll-shows/","image":"https://imageio.forbes.com/specials-images/imageserve/6705d3be4bf6f38126e86eb8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-09 00:57:08","author":"Contributor,Sughnen Yongo","authors":["Contributor","Sughnen Yongo"],"language":"en","category":"politics","source_country":"US","sentiment":0.113},{"id":258981956,"title":"Politics of Petroleum","text":"Magnus Onyibe\n\nThe alarm in Nigeria’s oil and gas industry was first sounded by Mr. Tony Elumelu, the chairman of Heirs Holding.\n\nIn 2021, Elumelu invested over $1.1 billion to acquire a 45% stake in the OML 17 oil drilling asset, a venture in which Shell, Total, and Eni relinquished their shares, leaving the Nigerian National Petroleum Corporation Ltd (NNPCL) with the remaining 55% on behalf of Nigerians.\n\nTo his dismay, in 2022, Elumelu discovered that only a small portion of the crude oil produced from his wells and fed into the Escravos pipeline actually reached its intended destination. The majority of the crude was being stolen by oil thieves who had mastered the technique of illegally tapping into the Escravos pipeline.\n\nIt is widely known that the criminal siphoning of our crude oil into vessels, which are then transported to unknown locations by thieves, is robbing Nigeria of desperately needed foreign exchange from oil sales. This theft has severe consequences for the country’s economy.\n\nIn a recent interview with the Financial Times of London, Tony Elumelu expressed his frustration that oil theft continues to account for about 18% of production. He emphasized the seriousness of the issue, saying, “This is oil theft, not something small like stealing a bottle of Coke. The government should know who is behind this and should inform us. In the U.S., when Donald Trump was shot at, the authorities quickly identified the assailant. Our security agencies should be able to tell us who is stealing our oil. How can vessels enter our territorial waters without our knowledge?”\n\nIn what seems like response to Elumelu’s challenge to Nigeria’s security agencies, a special task force was established by the Chief of Defense Staff, General Chris Musa, to combat the oil theft syndicate. The task force has achieved some success, allowing the Nigerian National Petroleum Corporation Ltd (NNPCL) to project an increase in oil production from the current estimate of 1.3 million barrels to 2 million barrels next year.\n\nAlhaji Aliko Dangote, another prominent investor in Nigeria’s oil industry, also voiced concerns about issues in the downstream sector. Dangote, who recently launched a $19.5 billion refinery with a capacity of 650,000 barrels per day, has faced difficulties due to a lack of crude oil supply. Mr. Davakumar Edwin, Vice President of Dangote Refinery, accused International Oil Companies (IOCs) of starving the refinery of crude oil feedstock, which has delayed the supply of petrol to the Nigerian market. Edwin stated, “Aside from Nigerian National Petroleum Company Limited (NNPC Ltd), to date, we have only purchased crude directly from one other local producer (Sapetro). All other producers refer us to their international trading arms.”\n\nHe further explained, “For instance, in April, we paid $96.23 per barrel for a cargo of Bonga crude grade, excluding transport. The price included $90.15 for dated Brent, $5.08 for NNPC’s premium (NSP), and a $1 trader premium. Meanwhile, we bought WTI at a price of $90.15 for dated Brent plus a $0.93 trader premium, including transport. When NNPC later lowered its premium based on market feedback, some traders began asking us for a premium of up to $4 million over and above the NSP for a cargo of Bonny Light. Data from platforms like Platts and Argus shows that the prices offered to us are significantly higher than market rates. We had to escalate this issue to the NUPRC.”\n\nAlhaji Aliko Dangote, President and Founder of Dangote Group, echoed Edwin’s concerns but clarified that the NNPC is doing its best. He noted, “Some of the IOCs are struggling to provide us with crude. Everyone is accustomed to exporting, and nobody wants to stop exporting.”\n\nAlso, as if in response, President Bola Tinubu has formed a committee led by Finance Minister Wale Edun. This committee has been tasked with developing a framework that will allow crude oil to be sold in naira to local refineries, starting with the Dangote Refinery. Following discussions with stakeholders, the committee has reportedly set a target for next month to begin producing petrol locally, which would help alleviate the pressure on the national treasury caused by the need to provide foreign exchange for petrol imports.\n\nThe expected output from the Dangote Refinery could also relieve Nigerians from the dual burden of not only paying high prices for petrol but also wasting valuable time queuing for fuel—an issue that many hope President Tinubu’s intervention will resolve permanently.\n\nIt is noteworthy that while Tony Elumelu is shocked by the brazen crude oil theft in the downstream sector, which is causing significant revenue loss to both his company and the country, Aliko Dangote is facing challenges from International Oil Companies (IOCs) that are withholding crude oil feedstock from his refinery. This ultra-modern facility is crucial for ending Nigeria’s reliance on petrol imports, which have long been a major component of the country’s import expenses, especially as the government has been subsidizing petrol prices for years.\n\nThese two significant challenges, which have caused sleepless nights for these two indigenous multi-billionaire investors in the oil and gas industry, are critical. If resolved, they have the potential to transform Nigeria’s socioeconomic development from a negative to a positive trajectory.\n\nFortunately, the outspoken criticism of industry irregularities by these two relatively new entrants into the oil sector is prompting much-needed reforms. The industry is currently undergoing what could be called a facelift through the strengthening of the Petroleum Industry Act (PIA), which was passed into law in 2021 but has yet to be fully enforced.\n\nThese issues underscore why understanding the toxic international petroleum politics in Nigeria, discussed in detail in this piece, should concern all Nigerians. Moreover, it is crucial to recognize that the oil and gas sector is the backbone of Nigeria’s economy, and we must protect it fiercely. The high cost of living crisis triggered by President Bola Tinubu’s removal of the petrol subsidy on May 29 last year highlights the central role that crude oil and its derivatives play in our economy and daily lives.\n\nA question likely on the minds of some readers is whether the current upheavals in the oil and gas industry are new issues. The reality is that these challenges have existed since crude oil was first discovered in 1957 and its exploration began in Oloibiri, now part of Bayelsa State. However, the reason these issues—such as crude oil theft and the allocation of oil for local refining—are now receiving more attention is because private investors, who place a high value on accountability, are now involved in the industry.\n\nIn the past, when the oil and gas business was solely a matter between the government and International Oil Companies (IOCs), efficiency was not a priority for those on the government’s side. But now, with private investors like Tony Elumelu and Aliko Dangote—who have invested $1.1 billion in oil exploration and $19.5 billion in refining, respectively—these entrepreneurs are determined to protect their investments and ensure a return on their bold ventures.\n\nFaced with the harsh realities and absurdities of the industry, both Elumelu and Dangote became increasingly frustrated when their investment plans were threatened by unexpected saboteurs. Their concern for their investments contrasts sharply with the often indifferent attitude of public servants, who traditionally did not prioritize Nigeria’s 55% equity in joint ventures with IOCs, which Elumelu has now acquired the 45% hitherto held by the transnational oil corporation.This same lack of concern for protecting Nigeria’s interests in crude oil production sharing agreements is why there has been no proper metering system to accurately measure the volume of crude oil pumped into pipelines or shipped abroad until private investors like Dangote entered the scene with his refinery, capable of refining at least half of Nigeria’s present crude oil output.\n\nSo, rather than viewing the disruptions caused by the agitations by Elumelu and Dangote as problematic, I see them as opportunities. Their involvement signals a positive shift in the industry as they justifiably questioned what could have happenned to their substantial financial commitments in oil exploration and refining, if the sector was not properly sorted by government. In my view ,Elumelu and Dangote can be seen as catalysts for change in an industry long plagued by complexities and absurdities. Indeed their efforts are beginning to help clean up or sanitize the industry, reinforcing the idea that private sector involvement introduces greater efficiency compared to government-driven operations burdened by bureaucracy.\n\nMost Nigerians would likely be shocked to learn that the lack of ownership mentality among officials responsible for national assets—an attitude reflecting a deep-seated lack of patriotism—is partly to blame for the fact that four federal government-owned refineries have been non-functional for nearly two decades. Equally alarming is the finding by a National Assembly committee that, despite the federal government investing up to $25 billion in public funds over the past decade for the turnaround maintenance of these four refineries, not a single liter of petroleum product has been produced. This situation is appalling, scandalous, and regrettable.\n\nThe same lack of accountability and ownership is also why crude oil theft continues to flourish, despite the NNPCL’s claim in its 2023 financial report to have spent around N1.8 trillion on securing its extensive oil and gas assets. Yet, millions of barrels of crude oil are still being stolen in massive ocean-going vessels without detection, contributing to Nigeria’s recent inability to meet its OPEC production quota.\n\nIt may surprise some readers to learn that the dysfunction of these four government-owned refineries is also due in part to sabotage, carried out by international organizations in collusion with Nigerian public servants embedded in the crude oil exploration and export value chain, particularly within the NNPC Ltd., which is responsible for importing petrol into Nigeria.\n\nFormer President Olusegun Obasanjo’s revelation adds another layer of complexity. He shared that during his presidency, he urged International Oil Companies (IOCs) to establish refineries in Nigeria, but they refused, citing rampant corruption in the sector. Obasanjo recounted that Shell, for example, declined his offer to take equity participation and manage Nigeria’s refineries, arguing that the refineries had not been properly maintained. Shell’s reasoning was clear: “There’s too much corruption with the way our refinery is run and maintained. And they didn’t want to get involved in such a mess.”\n\nWhile Obasanjo viewed the IOCs’ rejection as an indictment of Nigerian corruption—a narrative often pushed by the Western world to make Africans blame themselves for the continent’s underdevelopment—I would argue that this refusal was actually a strategic move by the IOCs. As agents of imperialist interests, their primary goal has always been to extract crude oil and other raw materials from Africa, particularly Nigeria, for the industrialization of their home countries, rather than genuinely supporting African industrialization—a promise they frequently make but seldom fulfill, often deceiving those who are unaware of their true intentions.\n\nMost Nigerians would likely be shocked to learn that the lack of ownership mentality among officials responsible for national assets—an attitude reflecting a deep-seated lack of patriotism—is partly to blame for the fact that four federal government-owned refineries have been non-functional for nearly two decades. Equally alarming is the finding by a National Assembly committee that, despite the federal government investing up to $25 billion in public funds over the past decade for the turnaround maintenance of these four refineries, not a single liter of petroleum product has been produced. This situation is appalling, scandalous, and regrettable.\n\nThe same lack of accountability and ownership is also why crude oil theft continues to flourish, despite the NNPCL’s claim in its 2023 financial report to have spent around N1.8 trillion on securing its extensive oil and gas assets. Yet, millions of barrels of crude oil are still being stolen in massive ocean-going vessels without detection, contributing to Nigeria’s recent inability to meet its OPEC production quota.\n\nIt may surprise some readers to learn that the dysfunction of these four government-owned refineries is also due in part to sabotage, carried out by international organizations in collusion with Nigerian public servants embedded in the crude oil exploration and export value chain, particularly within the NNPC Ltd., which is responsible for importing petrol into Nigeria.\n\nFormer President Olusegun Obasanjo’s revelation adds another layer of complexity. He shared that during his presidency, he urged International Oil Companies (IOCs) to establish refineries in Nigeria, but they refused, citing rampant corruption in the sector. Obasanjo recounted that Shell, for example, declined his offer to take equity participation and manage Nigeria’s refineries, arguing that the refineries had not been properly maintained. Shell’s reasoning was clear: “There’s too much corruption with the way our refinery is run and maintained. And they didn’t want to get involved in such a mess.”\n\nWhile Obasanjo viewed the IOCs’ rejection as an indictment of Nigerian corruption—a narrative often pushed by the Western world to make Africans blame themselves for the continent’s underdevelopment—I would argue that this refusal was actually a strategic move by the IOCs. As agents of imperialist interests, their primary goal has always been to extract crude oil and other raw materials from Africa, particularly Nigeria, for the industrialization of their home countries, rather than genuinely supporting African industrialization—a promise they frequently make but seldom fulfill, often deceiving those who are unaware of their true intentions.\n\nBefore delving deeper, it’s important to recall that oil and gas were discovered in commercial quantities in Oloibiri, modern-day Bayelsa State, in 1957. For years, Nigeria exported crude oil exclusively until the first refinery was established in Port Harcourt in 1965. Back then, all refineries were government-owned, and it was within the government’s prerogative to allocate 445,000 barrels per day (bpd) for local refining at the NNPC-operated facilities.\n\nAt the time, everything was managed within the government framework, which only required setting aside the 445,000 bpd needed by the four refineries located in the Niger Delta and Kaduna. Two of these refineries are in Port Harcourt with a combined refining capacity of 210,000 bpd, one in Warri with a 125,000 bpd capacity, and the fourth in Kaduna with a 110,000 bpd capacity.\n\nInitially, the allocated crude oil came from the volume produced by International Oil Companies (IOCs), whose parent companies are based in Europe and Asia. However, today, there are multiple indigenous crude oil producers with significant capacity, as well as a growing number of local private refineries with substantial capacity, making the 445,000 barrels set aside for local refining insufficient.\n\nIsn’t it remarkable that, aside from the persistent issue of crude oil theft, another challenge has been the shortage of crude oil for local refining? Yet, if all goes well, these two long-standing and seemingly insurmountable challenges in the oil and gas industry may soon be relegated to history.\n\nIn truth, the primary mission of the IOCs has always been to extract natural resources from Africa to fuel the industrial revolution in Europe, which began with the invention of the loom machine by Jeane-Marie Jacquard in 1804 and the steam engine by James Watt in 1765. Extracting crude oil for refining abroad is part of the agenda set during the Berlin Conference of 1884-85, where Africa was partitioned into territories for European powers under the guidance of Otto Von Bismarck, the German Prime Minister.\n\nAs these newly created territories were exploited for raw materials in the past, the current practice of exporting crude oil and other resources to Europe is an old habit that IOCs are reluctant to abandon. This resistance is evident in their opposition to President Bola Tinubu’s directive to sell oil to local refineries in naira. The IOCs seem intent on sabotaging efforts to achieve energy independence, citing commitments to overseas buyers as an excuse.\n\nGiven that the Petroleum Industry Act (PIA) took nearly two decades (13 years) to materialize and the Dangote Refinery took about seven years to build, why did the IOCs not anticipate that exporting all of Nigeria’s crude oil would no longer be viable? It’s telling that the multinational corporations were aware of the PIA’s implications, as evidenced by their divestment from onshore assets in favor of offshore operations. Yet, they continued to forward-sell Nigeria’s crude oil to foreign buyers, fully aware that the country had committed, through the PIA, to becoming more energy independent.\n\nThe primary reason for this situation is that it’s more profitable for the International Oil Companies (IOCs) to export crude oil to their home countries, where it is refined into products like PMS, DPK, AGO, and NAFTA. These products are then sold back to Africa at significantly higher prices. This practice has been the Standard Operating Procedure (SOP) of the colonial powers for a long time. As a result, they find it difficult to change their approach and sell crude oil to Nigerian refineries instead.\n\nThis continued extraction and export of raw materials from Africa aligns with the imperialist agenda of European countries. However, this long-standing practice (regarding crude oil refining) has been disrupted by the establishment and commissioning of the Dangote Refinery in Lagos last year, much to the dismay of these colonial exploiters.\n\nTo better understand the challenges Nigeria is facing, consider the following scenario: IOCs extract crude oil from Nigeria and export it to their home countries at relatively low prices (ranging from $37 per barrel in the 1980s to the current $80-$100 per barrel). There, the crude is refined and then sold back to Nigeria at several times the original cost per barrel. This process not only creates jobs and boosts the economies of the IOCs’ home countries, but it also leaves Nigeria with high unemployment among its youth and environmental degradation due to oil and gas exploration. This dynamic is why Nigeria often experiences a trade deficit, benefiting the home countries of the IOCs.\n\nTo further illustrate this point, let’s do a bit of math to compare the price of exported crude oil with the cost of imported petroleum products in Nigeria. A barrel of crude oil, which is equivalent to 42 U.S. gallons or 159 liters, is priced between $80 and $100. In contrast, the current landing cost of a liter of refined petrol imported into Nigeria is at least N1,117 per liter. Although comparing these figures can be challenging due to the different units of measurement—crude oil in barrels and refined products in liters—it highlights the significant markup and the opaque nature of the pricing, making the disparity between crude oil prices and refined product costs difficult to fully grasp.\n\nFor those willing to dig deeper, let’s compare the selling price of a barrel of crude oil—currently just $80, the price at which we export it overseas—with the N1,117 per liter landing cost at which we import the 159 liters contained in that same barrel. A quick comparison reveals that, as a net exporter of crude oil, Nigeria is at a significant disadvantage.\n\nThis comparison helps explain why our economy is struggling and why it can no longer sustain the burdensome petrol subsidy. It’s clear that the scenario outlined above is a major factor behind Nigeria’s financial deficit, which exceeds N120 trillion.\n\nGiven this reality, it’s crucial for us to support and encourage Aliko Dangote not to sell his refinery to the NNPCL, despite his threat to do so. This came after Alhaji Farouk Ahmed, CEO of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDRA), a subsidiary of NNPCL, wrongly accused Dangote Refinery of attempting to replace the national oil giant as a monopoly.\n\nMoreover, we should encourage other business leaders, such as Chief Mike Adenuga of Conoil, Mr. Femi Otedola of Geregu, (who has been involved in and out of the oil industry), Sahara Energy’s Kola Adeshina, Aiteo’s Benedict Peters, Nestoil’s Ernest Azudialu, and other well resourced Nigerians, to invest more significantly in the sector. This would ensure that Nigerians are fully involved in the entire value chain—from exploration to refining, shipping, and even gas processing, where Julius Rone is making strides with his UTM Offshore.\n\nRemarkably, Alhaji Samad Rabiu, owner of BUA cement, is also reportedly constructing a refinery of considerable scale. This could lead to a situation where Nigeria has the capacity to process crude oil into petrol in excess, much like how the country has become a net exporter of cement, with Dangote Cement and BUA Cement, dominating the African market and keeping foreign competitors like Lafarge and Flour Mills Cement on their toes.\n\nAlready , it is a tribute to the entrepreneurship of Nigerians that about five (5) Nigerian banks have spread their footprints into the African landscape with thriving subsidiaries in full bloom.\n\nAt this point, I believe that continuing to present additional facts and figures to justify the need for Nigeria, nay Africa’s independence from being an appendage to other economies and regions would be unnecessary. Rather readers should reflect on the situation and realize that, despite the challenges, our country is on the brink of a significant transformation in the oil and gas sector. So, it should be clear that halting the export of our crude oil and increasing local refining capacity is crucial for job creation, boosting foreign exchange earnings, and enhancing our GDP.\n\nCurrently, there are five fully operational modular refineries: Aradel in Port Harcourt, WalterSmith in Imo\n\nState , Edo Refinery and Duport Midstream in Edo State, and OPAC in Delta State, with a combined processing capacity of less than 20,000 barrels per day. These smaller refineries are expected to benefit from President Bola Tinubu’s new directive to sell the 445,000 barrels per day of crude oil reserved for local refining in naira. It is the crude oil reserrve referenced above that was providing the supply for the four NNPCL refineries, which have been non-functional for over a decade despite consuming over $25 billion in turnaround maintenance, without producing even a single liter of petrol.\n\nHopefully , the present administration would see the wisdom in my advocacy for the sale of the ailing government refineries to private sector players who would operate them more efficiently as canvassed in my numerous media interventions over the past decade.\n\nAfter providing a historical background to connect the past with the current state of the oil and gas industry in Nigeria, including the international factors exacerbating the local refining capacity crisis, it’s time to address the way forward.\n\nAs already underscored, International Oil Companies (IOCs) seem to struggle with changing their longstanding business model of extracting raw materials from Africa and processing them into finished products in Europe or Asia. This situation reinforces the theme of my upcoming book, “Africa Exporting Wealth, Importing Poverty,” with the subtitle: “Are Africans Thinking or Sinking?” The book details how the West has systematically underdeveloped Africa by exploiting its natural and human resources, from the era of the slave trade to colonialism, neo-colonialism, and the ongoing practice of imperialism encapsulated in unfair trade practices with Africa as the underdog and victim.\n\nThe current conflict between Aliko Dangote, NNPCL officials, and IOCs has exposed how Africa continues to be stripped of its resources. This confrontation represents one of the final struggles of African entrepreneurs with the awareness and determination to resist the ongoing exploitation by Western powers.\n\nThe environmental devastation caused by irresponsible resource exploitation in Africa, such as the irreversible damage in the Democratic Republic of Congo (DRC) due to mining, is well-documented. Belgium, the colonial ruler, left the DRC in a blighted state, a situation that persists today. It’s within this broader intellectual framework that I analyze the dispute between NNPCL executives, IOCs, and Dangote Refineries over Nigeria’s control of its petroleum resources.\n\nThrough this lens, I hope Nigerians will gain a deeper understanding of the conflict surrounding local petrol refining, which has been oversimplified by some analysts as a lack of planning by Dangote Refinery. In reality, it also stems from a rivalry between two Kano State natives—Aliko Dangote and Samad Rabiu—that has spilled over into the oil industry and society. Though a simplified view, it remains a valid observation.\n\nRather than engaging in buttonh heads, the two illustrious kano indigenes Aliko Dangote and Samad Rabiu need to start collaborating and stop sabotaging each other.","summary":"Magnus Onyibe The alarm in Nigeria’s oil and gas industry was first sounded by Mr. Tony Elumelu, the chairman of Heirs Holding. In 2021, Elumelu invested over $1.1 billion to","url":"https://www.thisdaylive.com/index.php/2024/10/09/politics-of-petroleum/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Magnus-Onyibe.png","video":null,"publish_date":"2024-10-09 00:45:20","author":"Adeyinka Salami,Also Winning Chicago","authors":["Adeyinka Salami","Also Winning Chicago"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.443},{"id":258982042,"title":"Ethel Kennedy Hospitalized Following Stroke, Daughter Shares: “She Is Surrounded by Family”","text":"Ethel Kennedy has been hospitalized following a stroke, her daughter Kerry Kennedy shared on Tuesday. \n\n Kerry wrote on social media that her mother, who turned 96 in April, “has had a great summer and transition into fall. Every day she enjoyed time with her children, nieces, nephews, grandchildren, and great-grandchildren. She was able to get out on the water, visit the pier, and enjoy many lunches and dinners with family. It has been a gift to all of us and to her as well.” \n\n Ethel suffered a stroke in her sleep last Thursday morning, Kerry wrote. “She was brought to an area hospital, where she is now receiving treatment. She is comfortable, she is getting the best care possible, and she is surrounded by family. She is, as you may know, a strong woman who has led a remarkably fulfilling life. We are here looking after her.” \n\n Kerry concluded her message by writing, “Please keep her in your thoughts and prayers. I ask that you respect our family’s privacy at this time.” \n\n Ethel is the oldest living member of the Kennedy family. She is the widow of Robert F. Kennedy, the sister-in-law of President John F. Kennedy, and the mother of Robert F. Kennedy Jr., who recently ended his own presidential campaign and endorsed Donald Trump. Her daughter, Kerry, is the president of the Robert F. Kennedy Center of Justice and Human Rights, which Ethel founded in 1968 following her husband’s assassination. Ethel was awarded the Presidential Medal of Freedom by President Obama in 2014.","summary":"Ethel Kennedy, the oldest living member of the Kennedy family, turned 96 in April.","url":"https://www.hollywoodreporter.com/news/politics-news/ethel-kennedy-hospitalized-stroke-1236027784/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/10/EthelKennedy.jpg","video":null,"publish_date":"2024-10-09 00:42:52","author":"Zoe G Phillips,Zoe G. Phillips","authors":["Zoe G Phillips","Zoe G. Phillips"],"language":"en","source_country":"US","sentiment":0.459},{"id":258981728,"title":"On ‘The View’ Harris says she would not break with Biden over much","text":"By Zeke Miller and Chris Megerian | Associated Press\n\nNEW YORK — Kamala Harris wanted to help voters get to know her better with a cascade of media appearances Tuesday, but the most lasting impression might have been her unwillingness to break with Joe Biden.\n\nAsked on ABC’s “The View” how she would be different from the president she’s served under for four years, Harris said “we’re obviously two different people” and “I will bring those sensibilities to how I lead.”\n\nHowever, she was not able to identify a decision where she would have gone another way. “There is not a thing that comes to mind,” Harris said.\n\nThe exchange encapsulated Harris’ struggle to portray herself as a candidate who can deliver the change voters crave while also remaining loyal to the current administration. Some Harris aides privately winced as gleeful Republicans swiftly circulated clips of her response and Donald Trump swiped at her in a social media post, calling it “her dumbest answer so far.”\n\nIt wasn’t until later in the show that Harris named something that she would do differently than Biden — she would put a Republican in her Cabinet.\n\nThe Democratic nominee said she would welcome contributions from the other party “because I don’t feel burdened by letting pride get in the way of a good idea.”\n\nThe interview was a reminder that friendly media venues — the women of “The View” were nearly rapturous in their embrace of Harris — can be as treacherous for politicians to navigate as hardball journalistic interrogations. And it came at a delicate moment for Harris, whose motorcade whisked her from studio to studio in New York on Tuesday.\n\nLater, during a taping of CBS’ “The Late Show with Stephen Colbert,” the late-night host asked Harris a similar question about “what would the major changes be” from Biden. She again offered few, responding, “I’m obviously not Joe Biden, so that would be one change” — before noting that she’s also not Trump.\n\nEven though her abbreviated and unexpected campaign for the presidency is more than half over, Harris is still racing to introduce herself to voters who haven’t made up their minds about her or whether to cast ballots in this year’s election. Between “The View” and “The Late Show,” she spoke to radio host Howard Stern. The trio of appearances came after Harris granted interviews to CBS’ “60 Minutes,” which aired Monday night, and Alex Cooper’s podcast “Call Her Daddy,” which was released Sunday.\n\nIt’s a kaleidoscopic media blitz intended to reach key demographics, from men who are longtime fans of Stern to young women who follow Cooper’s frank conversations about sex and relationships.\nHarris’ decision to open up is a sharp shift after largely avoiding interviews since replacing Biden at the top of the ticket, and it’s an acknowledgment that she needs to do more to defeat Trump.\n\nGetting personal has never been easy for Harris, a lawyer by training whose first job in public life was making opening and closing arguments as a courtroom prosecutor.\n\n“It feels immodest to me to talk about myself,” Harris said to Stern. “A friend of mine actually said, ‘Look, this is not a time to worry about modesty, because obviously you gotta let people know who you are.'”\n\nBy the time she was finished with the interview, Harris had, by her standards, bared her soul. Some examples:\n\nShe ate a family sized bag of Doritos after Trump beat Hillary Clinton. She works out on an elliptical every day. Her first job was cleaning test tubes at her mother’s laboratory, and she got fired. Her favorite Formula One driver is Lewis Hamilton. She went to see U2 at the Sphere in Las Vegas, and she recommends going with a “clear head,” meaning not high on drugs, because “there’s a lot of visual stimulation.”\n\nHarris also said “I literally lose sleep” over the election because “the stakes are so high.”\n\nDuring the taping with Colbert, Harris opened a beer, with the host noting that she had “asked for Miller High Life.” Harris said the last time she had drunk beer was at a baseball game with her husband. She only took one sip with Colbert.\n\nAnna Greenberg, a Democratic pollster, said Harris has to energize people who have tuned out politics because they believe “all the politicians are the same, they all say the same thing, they don’t know anything about my life, I can’t relate to them at all.”\n\n“They want to like and trust you,” she said.\n\nJennifer Harris, the former White House senior director of international economics, said Harris has a steeper hill to climb because of the way she became the Democratic nominee.\n\n“We did not have a good long primary to meet Kamala Harris in the way most voters are accustomed to,” she said. Harris has to find a way to demonstrate the instincts and principles that “will be guiding any number of hundreds of specific policy questions that will come up in the course of the presidency.”\n\nHarris used her Tuesday appearance on “The View” to discuss her proposal to have Medicare cover in-home care for the elderly, helping to relieve the burden faced by an increasing number of families.\n\nShe spoke about taking care of her own mother when she was dying of cancer, including cooking for her and picking out soft clothing that wouldn’t irritate her. And she criticized Trump as selfish and uninterested in helping Americans. If you watch his grievance-filled rallies, she said, “he does not talk about what your parents need, what your children need.”\n\nInstead, Harris said, “he talks about his needs.”\n\nIt was a moment that Harris’ campaign would much rather get noticed than her answer about Biden. They believe that a small yet pivotal numbers of undecided voters want to know more about Harris before making up their minds, and that the more those voters see Harris, the more they like her.\n\nRepublican communications strategist Kevin Madden said defining Harris in voters’ eyes is the central challenge of the campaign.\n\n“This race is actually pretty simple in the sense that the next few weeks are about who’s going to fill in the blanks on who Harris is,” he said.\n\nHarris’ name recognition grew when she became vice president, but 1 out of 10 people still said they didn’t know enough about her to have an opinion, according to AP-NORC polling. Recent shifts in her favorability numbers suggest that views on Harris may still be somewhat malleable.\n\nOther polls have similar results. One-quarter of likely voters said they still feel like they need to learn more about Harris, according to a New York Times/Siena College poll conducted after her debate against Trump, while about three-quarters say they pretty much already know what they need to know about her.\n\nNear the end of Harris’ interview on the “Call Her Daddy” podcast, Cooper confronted the vice president with one of the central questions of this campaign.\n\nSo many people, Cooper said, are “frustrated and just exhausted with politics in general,” so “why should we trust you?”\n\nHarris answered by saying “you can look at my career to know what I care about.”\n\n“I care about making sure that people are entitled to and receive the freedoms that they are due,” she said. “I care about lifting people up and making sure that you are protected from harm.”\n\nMegerian reported from Washington. AP writer Linley Sanders in Washington contributed to this report.","summary":"Harris used her Tuesday appearance on \"The View\" to discuss her proposal to have Medicare cover in-home care for the elderly, helping to relieve the burden faced by an increasing number of families.","url":"https://www.mercurynews.com/2024/10/08/on-the-view-harris-says-she-would-not-break-with-biden-over-much/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/sjm-Harris_207092279.jpg?w=1024","video":null,"publish_date":"2024-10-09 00:41:08","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.027},{"id":258981314,"title":"Biden, Like Trump, Blames Obama for Losing Crimea to Putin, Book Reveals","text":"President Joe Biden previously said that he holds the Obama administration accountable for Russia's invasion of Ukraine in 2014, which culminated in Moscow seizing control of the Crimean Peninsula.According to Watergate journalist Bob Woodward's forthcoming book, War, Biden expressed discontent during a private conversation late last year over how his former running mate handled Russian troops invading Ukraine's eastern Donbas region in February 2014. At the time, Biden was serving as vice president under former President Barack Obama.\"They f***** up in 2014,\" Woodward quoted Biden saying to a close friend in December 2023, according to the Associated Press, who obtained a copy of Woodward's book before its publishing date on October 15. \"Barack never took [Russian President Vladimir Putin] seriously.\"Biden is also quoted as telling the friend that the White House \"never should have let Putin just walk in there\" and that Washington \"did nothing\" when Russia invaded.Former President Donald Trump has also pointed blame at the Obama administration's handling of Putin's invasion, which boiled over into Russia's full-scale invasion of Ukraine in February 2022. During a press briefing in 2018, Trump told reporters that he had \"a very good meeting\" with Putin earlier in the year, during which the pair \"discussed about...the fact that President Obama allowed a very large part of Ukraine to be taken\" in 2014.\"That was President Obama's regime,\" Trump added during the briefing.Newsweek reached out to the White House press office via email on Tuesday night for comment.Biden and Trump have repeatedly disagreed over how the U.S. should handle the ongoing Russia-Ukraine War. The current White House administration has stood firm in supporting Ukraine through aid packages and defense boosts. Democratic presidential nominee Vice President Kamala Harris has also vowed a similar commitment to securing Ukraine's sovereignty if elected to the Oval Office in November.Trump, however, has been much more elusive as to how he plans to address the war in Ukraine if he wins a second term in the White House. He, along with some Congressional Republicans, has been critical of Ukrainian President Volodymyr Zelensky and the consistent flow of aid to Ukraine, including saying during a rally in North Carolina last month, \"We continue to give billions of dollars to a man who refused to make a deal, Zelensky.\"The Crimean Peninsula has served as a key military hub for Russia since 2022. Ukraine's defense forces have repeatedly targeted infrastructure on the peninsula in their efforts to defend against Putin's latest invasion.","summary":"Bob Woodward's forthcoming book details a private conversation where Biden criticized Obama's handling of Russia's 2014 invasion.","url":"https://www.newsweek.com/biden-like-trump-blames-obama-losing-crimea-putin-book-reveals-1966129","image":"https://d.newsweek.com/en/full/2490729/biden-like-trump-blames-obama-losingcrime.jpg","video":null,"publish_date":"2024-10-09 00:30:20","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.159},{"id":258981052,"title":"Super PAC Americans for Prosperity rolls out extensive ad campaign targeting key Senate races","text":"Americans for Prosperity Action, a super PAC affiliated with the Koch network of political advocacy groups, is launching a slate of new ads backing Republicans across multiple Senate battleground races, spending $8.75 million on a campaign focused largely on issues like the economy, inflation, and immigration.\n\nWith mail ballots already being mailed out in dozens of states, AFP Action is spending $1.5 million to boost former GOP Rep. Mike Rogers in Michigan, $1.25 million on behalf of Tim Sheehy in Montana, and $2 million each for Bernie Moreno in Ohio, Dave McCormick in Pennsylvania, and Eric Hovde in Wisconsin. \n\n“The next 28 days are going to be 100% committed to talking to as many people as we can via the doors and the phones to convince them that our candidates are the right choice,” said AFP Action senior adviser Tim Golding.\n\nWith party control of both chambers of Congress up for grabs in November, the group has spent about $60 million on election advertising already in 2024, according to FEC filings.\n\nAmericans for Prosperity Action backed Nikki Haley for president in 2023 but has focused its efforts since then on promoting conservative down-ballot candidates through digital advertising, door-knocking, phone-banking and election mailers. The group is not investing in efforts to promote Donald Trump this fall.\n\nEmphasizing the cost of living while underscoring Moreno’s business experience, an Ohio ad asks, “Do we want a politician or do we want someone who knows how the economy works? Bernie Moreno gets it.” \n\nThe Michigan ads, which are launching on the same day as the first Senate debate there, tie Democratic Rep. Elissa Slotkin to the Biden administration while highlighting Rogers’ Army and law enforcement experience. \n\nWith less than a month until Election Day, AFP has knocked on more than 165,000 doors and made more than 225,000 phone calls statewide on behalf of Rogers in Michigan, the group said. The group has contacted more than 9 million voters about congressional races nationwide this election cycle.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAmericans for Prosperity Action, a super PAC affiliated with the Koch network&#8230;\n\n\nThis Post: Super PAC Americans for Prosperity rolls out extensive ad campaign targeting key Senate races first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/super-pac-americans-for-prosperity-rolls-out-extensive-ad-campaign-targeting-key-senate-races/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-10/241008-capitol-ch-1419-e7c239.jpg","video":null,"publish_date":"2024-10-09 00:22:18","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.213},{"id":258981448,"title":"Afghan national living in the U.S. charged with plotting an Election Day terrorist attack","text":"An Afghan national living in Oklahoma was charged this week with conspiring to carry out a terrorist attack on Election Day on behalf of the Islamic State terrorist group, according to court documents unsealed Tuesday. Nasir Ahmad Tawhedi, 27, was arrested Monday in connection with conspiracy and attempting to provide material support to ISIS and getting firearms and ammunition to execute a violent attack in the U.S. on behalf of the terrorist group. Tawhedi made his initial appearance Tuesday in the federal courthouse in Oklahoma City before U.S. Magistrate Judge Suzanne Mitchell. The pair were arrested after they met two confidential human sources and an undercover FBI agent, who posed as business partners, at a rural location in the Western District of Oklahoma, to buy the rifles, 10 magazines and ammunition for the planned attack. According to court documents, Tawhedi indicated in seized communications that he planned his attack for Election Day, Nov. 5. Authorities said that in an interview after his arrest, he confirmed that the attack was intended to target large gatherings and that he was expected to die a martyr along with a juvenile co-conspirator, described as an Afghan citizen with legal permanent resident status. Attorney General Merrick Garland said in a statement Tuesday that the Justice Department would continue “to combat the ongoing threat that ISIS and its supporters pose to America’s national security, and we will identify, investigate, and prosecute the individuals who seek to terrorize the American people.” According to court documents, Tawhedi made efforts to liquidate his family’s assets, resettle family members in Afghanistan, and obtain AK-47 assault rifles and ammunition. A review of Google records showed that Tawhedi viewed and saved ISIS propaganda, according to court documents. Records also showed that in July he searched “How to access washington dc cameras,” and “Which U.S. States Have Passed Permitless Carry Gun Laws?” they said. In late August, Tawhedi and his co-conspirator tried to liquidate family assets, including property in Moore, Oklahoma, which is under contract and pending sale, the family’s two cars, electronics and other assets, court documents allege. Tawhedi’s arrest comes amid rising concerns about the potential for political violence surrounding next month's election. President Joe Biden told reporters last week that he was confident that the election “will be free and fair,” but was less certain about “whether it will be peaceful.” Both Biden and Vice President Kamala Harris have condemned political violence in the wake of two assassination attempts against former President Donald Trump, who has hinted at the potential for violence if he loses in November. The U.S. continues to battle the threat posed by ISIS both domestically and abroad. In June, eight men from Tajikistan who had been on the FBI’s Joint Terrorism Task Force radar with potential links to ISIS were arrested in New York, Philadelphia and Los Angeles. Defense officials said in August that the U.S. had conducted a military operation in Iraq that killed at least 15 Islamic State militant group fighters, including members in leadership. A month earlier, U.S. Central Command said in a statement that through the first half of the year, ISIS took responsibility for 153 attacks in Iraq and Syria and that the terrorist group was on track \"to more than double the total number of attacks they claimed\" in 2023.","summary":"Nasir Ahmad Tawhedi, a resident of Oklahoma City, was charged with conspiring to carry out a terrorist attack on behalf of ISIS on Election Day, according to federal prosecutors.","url":"https://www.nbcnews.com/politics/2024-election/afghan-national-living-us-charged-allegedly-plotting-election-day-terr-rcna174606","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241008-oklahoma-city-ok-us-courthouse-google-maps-ac-626p-0bbd4c.jpg","video":null,"publish_date":"2024-10-09 00:21:31","author":"Ken Dilanian,Zoë Richards","authors":["Ken Dilanian","Zoë Richards"],"language":"en","category":"politics","source_country":"us","sentiment":-0.319},{"id":258980750,"title":"Melania Trump supports J.K. Rowling’s views on transgender women in sports in her initial remarks","text":"Melania Trump sided with author J.K. Rowling and husband Donald Trump on transgender women in sports, arguing female athletes should be ‘protected and respected.’\n\nThe former first lady writes about the issue in her memoir Melania, which was published on Tuesday. \n\nRowling caused a massive controversy when she revealed her views on transgender, which were seen as harmful to the trans community. Republicans, too, have turned the issue into a major political battlefield.\n\nMelania revealed her disagreement with her husband on abortion rights, which she supports, but. on transgender issues, the couple is in alignment. \n\n‘Today, some groups attempt to impose their ideologies on everyone, deepening the divisions in our society. One example is the ongoing debate over trans inclusion in sports, specifically when male-born athletes who identify as female compete against women,’ she writes.\n\n‘Male bodies generally have physical advantages – muscle strength, height, bone density, and lung capacity – that can affect fairness in competition, even at the high school level.\n\n‘Some argue that the number of trans-athletes is low, but even one can upset the balance in a female league or tournament due to these physical advantages.\n\n‘High school athletes often dedicate years to training with the hope of being recruited by universities. Seeing that dream collapse is an unnecessary and avoidable consequence. \n\n‘This issue also has broader implications, including the loss of future earning potential as professional athletes and a potential setback for equal pay in sports,’ she adds.\n\nThe former first lady, notes, however, her longtime support for LGBTQ rights.\n\n‘As many of you may know, I fully support the LGBTQIA+ community. But we must also ensure that our female athletes are protected and respected,’ she writes. \n\nDonald Trump has mocked transgender people during his campaign and Republicans have used the issue to rally their conservative base. \n\nMelania addresses the issue in her memoir, which touches on her time as first lady without getting into some of the more controversial moments, such as Stormy Daniels allegation she had an affair with Donald Trump. \n\nThe 256-page book is filled with stories from Melania’s childhood in Slovenia and photos from her private life, including her childhood in Europe and raising her son Barron in New York. \n\nThe former first lady has been the subject of many biographies and books but this is the first time she is telling her story.\n\nShe is selling two editions: a $150 collector’s edition featuring 256 pages in full color throughout, with each copy signed by the author. The memoir edition will be 304 pages and available for $40 with signed copies available for $75. \n\nHer book has some shocking revelations, such as she supports a woman’s right to choose when it comes to abortion – contrast to her husband’s position on the issue.\n\nThe former first lady wrote that she’s ‘carried this belief’ for her ‘entire adult life’.\n\n‘It is imperative to guarantee that women have autonomy in deciding their preference of having children, based on their own convictions, free from any intervention or pressure from the government,’ Melania writes. \n\n‘Why should anyone other than the woman herself have the power to determine what she does with her own body? A woman’s fundamental right of individual liberty, to her own life, grants her the authority to terminate her pregnancy if she wishes,’ she continues.\n\n‘Restricting a woman’s right to choose whether to terminate an unwanted pregnancy is the same as denying her control over her own body,’ she says. ‘I have carried this belief with me throughout my entire adult life.’\n\nThe eyebrow-raising admission came just one month before her husband battles it out in the presidential election with Democratic nominee Kamala Harris, with abortion rights set to be one of the most decisive issues among voters.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMelania Trump sided with author J.K. Rowling and husband Donald Trump on&#8230;\n\n\nThis Post: Melania Trump supports J.K. Rowling&#8217;s views on transgender women in sports in her initial remarks first appeared on Internewscast Journal","url":"https://internewscast.com/politics/melania-trump-supports-j-k-rowlings-views-on-transgender-women-in-sports-in-her-initial-remarks/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Melania-Trump-sides-with-JK-Rowling-in.jpg","video":null,"publish_date":"2024-10-09 00:14:02","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.117},{"id":258980652,"title":"Errol Barnett Joins CBS' Morning Line-Up","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nEmmy-winning journalist Errol Barnett is joining the CBS morning lineup. Barnett is taking the helm ... [+] as the solo anchor of “CBS Morning News” airing 7am Monday-Friday on CBS News 24/7, streaming for free everywhere.\nErrol Barnett\n\nErrol Barnett, formerly of CBS News’ noon hour on Wednesdays and Thursdays, is the newest face in America’s morning news media ranks.\n\nThe move out of Studio 57 to the morning hour will put Barnett in a class of anchors that include his colleagues Nate Burleson and Vladimir Duthiers, along with Craig Melvin, Al Roker, Bryant Gumbel, and Michael Strahan.\n\nAs CBS News 24/7’s senior vice president David Reiter announced in an internal note, Barnett will join the morning production and editorial team at CBS Morning News at 7:00 a.m.\n\n\"We are in great hands with Errol,” Reiter’s announcement said. “He connects with our viewers and is a superb Emmy-winning journalist. We saw that in real-time when he anchored our live coverage of the Iranian missile attacks on Israel.\"\n\nChanges to morning television are rare. Despite our industry's longstanding issues, morning news broadcasts are relatively stable network property, with few new permanent anchors and changes taking place.\n\nThat makes Barnett's move to 7:00 am a rather big deal for CBS' morning show jigsaw puzzle, which includes CBS Morning and the recently launched third-hour CBS Mornings Plus. On Oct. 7, Barnett became the solo weekday anchor during America's most watched hours of the day. He took over for Anne-Marie Green, who had the role for a number of years before transitioning to CBS's awarding-winning 48 Hours.\n\n“I've known Errol for over a decade, during his time reporting around the world for CNN and Channel One News,\" Reiter said about the change. \"I know he's excited to build on the momentum already underway in the morning and thankful for the awesome people who have built a faithful audience.\"\n\nMORE FOR YOU\n\nA Missile Could Not Erase Russian Drone’s Embarrassing Stealth Secret\n\nHurricane Milton: Winds Pick Up As ‘Extremely Dangerous’ Storm Heads For Florida—Here’s What To Know\n\nGmail Hackers Have Control Of 2FA, Email And Number? Here’s What To Do\n\nWASHINGTON, DC - APRIL 30: (L-R) Errol Barnett and Gayle King attend Paramount’s White House ... [+] Correspondents’ Dinner after party at the Residence of the French Ambassador on April 30, 2022 in Washington, DC. (Photo by Shedrick Pelt/Getty Images)\nGetty Images\n\nBarnett was born in Milton Keynes, England, to a mother from Liverpool and a father of Jamaican descent, he got his start in journalism in Los Angeles at the age of 18 as Channel One News' youngest anchor and reporter. Years later, Barnett has become well known in the industry for his crisp British accent, fresh perspective, extraordinary breaking news coverage, and eventually his Emmy award-winning reporting.\n\nDuring former President Donald Trump’s criminal trial, Barnett led CBS News’ 24/7 coverage. He anchored and reported from outside the lower Manhattan courthouse as a jury delivered a 34-count guilty verdict against Trump.\n\nBarnett also served as a White House correspondent during the Obama presidency, traveling with America’s first Black president on his final overseas trip. Before joining CBS in 2016, Barnett co-hosted \"CNN Newsroom\" with Rosemary Church. While at CNN, he also served as a foreign correspondent in Europe, the Middle East and Africa. He received multiple awards for hosting the documentary-style show, \"Inside Africa.\"\n\nWhile the current CBS Morning News show is only 30 minutes long, many sources believe it will expand in the month ahead, especially given the 2024 election.\n\nFollow me on Twitter. \n\nRichard Fowler\n\nEditorial Standards\n\nForbes Accolades","summary":"Errol Barnett, formerly of CBS News’ noon hour on Wednesdays and Thursdays, is the newest face in America’s morning news media ranks.","url":"https://www.forbes.com/sites/richardfowler/2024/10/08/errol-barnett-joins-cbs-morning-line-up/","image":"https://imageio.forbes.com/specials-images/imageserve/6705c85407bcad8975ed77a5/0x0.jpg?format=jpg&crop=2933,2080,x0,y162,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-09 00:13:17","author":"Contributor,Richard Fowler","authors":["Contributor","Richard Fowler"],"language":"en","source_country":"US","sentiment":0.576},{"id":258980664,"title":"Boston City Council slams USPS for ditching emergency hearing on late mail over body’s perceived ‘political agenda’","text":"The City Council slammed the U.S. Postal Service for blowing off an emergency hearing aimed at addressing service failures it says are causing residents to miss out on bills and prescriptions, and raising mail-in voting concerns.\n\nCouncilor Sharon Durkan, who called for the hearing last month, said Tuesday that the USPS chose not to engage in the day’s discussion because it saw the Council as having a “political agenda” in elevating the issue, and not being “so much about customers.”\n\nDurkan was citing private emails that she said the USPS “accidentally forwarded.”\n\n“That cannot be farther from the truth,” Durkan said. “We are gathered here to address an urgent concern to constituents, the deteriorating quality of USPS service.”\n\nOther councilors piled onto USPS for the snub, which came after they heavily promoted the hearing — which drew live virtual testimony from U.S. Rep. Ayanna Pressley — and the topic generated widespread press coverage.\n\n“It’s outrageous that someone from the post office has accused us of having a political agenda,” Councilor Benjamin Weber said. “Our agenda is to make sure Boston residents get their mail, that they get their checks, that they get their medication and they get their ballots, making sure that happens.\n\n“That’s not political,” Weber added. “It’s just ensuring that residents of Boston have a basic public service.”\n\nWeber went on to accuse the USPS of being politicized, while pointing to U.S. Postmaster General Louis DeJoy, who he said was appointed by former President Donald Trump and “kept there by obstruction by the Senate for Biden to appoint anyone else to the Board of Directors.”\n\nDeJoy, the councilor said, has “sought to run the post office like it’s a business that needs to turn a profit, which is absurd, because the post office, like the T or the water department, provides a necessary public service.”\n\nCouncilor Gabriela Coletta also got in a dig at the “deplorable leadership” at the USPS, saying that she thought it was “rich to hear from his cronies that we are politicizing the issue, when we are just trying to represent our constituents” who aren’t receiving their prescriptions or whose ballots are getting lost in the mail.\n\nDurkan pushed back on what she saw as misleading claims from the USPS, which issued a statement last month saying mail delivery in the city was within “performance standards” during the latest financial quarter, which extended from July 1 to Sept. 30.\n\n“The reality on the ground tells a remarkably different story,” Durkan said.\n\nResidents throughout Boston, she said, have “experienced unacceptable delays and inefficiencies in their mail service, which she said has left them without “critical communications, including legal documents and financial statements,” and led to delays in “vital medications.”\n\nDurkan added in her opening remarks that the “unreliable Postal Service threatens to undermine our democratic process,” in terms of mail-in voting becoming more prominent in recent years.\n\nShe later noted, however, that Secretary of the Commonwealth William Galvin made remarks this past weekend that his office was “working very closely” with USPS to make sure it won’t impact the state and federal elections.\n\nUSPS union representatives participating in the hearing cited staffing issues as a major factor contributing to service problems. The union reps largely agreed with councilors on late mail and packages being an issue that warrants much concern, and even joined in on the bashing of Postal Service leadership.\n\nThey testified, however, that the unions don’t see mail-in voting as being as much of a concern ahead of next month’s elections, while pointing to what Scott Hoffman, national business agent for the American Postal Workers Union, described as an extensive vetting process that negates “gamesmanship or failure.”\n\n“That’s the one thing that we can say, don’t worry about, but everything else, you’ve got to worry about,” Hoffman said. “That’s, I guess, the message for today.”","summary":"The Boston City Council slammed the U.S. Postal Service for blowing off an emergency hearing that was aimed at addressing service failures it says are causing residents to miss out on bills and prescriptions, and raising mail-in voting concerns. ","url":"https://www.bostonherald.com/2024/10/08/boston-city-council-slams-usps-for-ditching-emergency-hearing-on-late-mail-over-bodys-perceived-political-agenda/","image":"https://www.bostonherald.com/wp-content/uploads/2024/03/COUNCILsc009.jpg?w=1024","video":null,"publish_date":"2024-10-09 00:12:38","author":"Gayla Cawley","authors":["Gayla Cawley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.58},{"id":258980774,"title":"Harry's Bar In Paris Drinks To US Straw-poll Centenary","text":"A straw poll at Harry's Bar in Paris, famous for calling US elections with uncanny accuracy, celebrates its centenary this year as Americans again flock to the drinking hole ahead of the November vote.So long as they are US passport holders, patrons get to cast a symbolic vote at a ballot box set up at the bar in the Opera district of the French capital.Founded in 1911, Harry's Bar claims to be Europe's oldest cocktail bar and to have invented the Bloody Mary.Once a regular haunt of literary greats Ernest Hemingway and F. Scott Fitzgerald, actor Humphrey Bogart and jazzman Cole Porter, it still attracts famous people, such as bestselling author Douglas Kennedy who on Monday cast the election year's first ballot here.\"It's an interesting tradition,\" said Timothy Zeller, an American tourist. \"They haven't always been right, but they've been right more than they've been wrong.\"The outcome of the Harry's Bar vote has, in fact, diverged from the actual US election result only three times since the tradition started in 1924: In 1976, when Jimmy Carter became president, in 2004 when George W. Bush was re-elected and in 2016, when Donald Trump won the White House.\"My mind is made up,\" said American literary critic Steven Sampson, a Paris resident casting his ballot at Harry's for the first time.He told AFP he was \"curious\" to see whether the straw poll will get it right again when Kamala Harris faces off against Trump on November 5.To pass the time until the result, patrons can sample two cocktail creations inspired by the candidates, the \"Trumpet\" -- on the menu since Trump's 2016 campaign -- and the \"Kamala Harry's Bar\".Back in the 1920s American expatriates could not vote in presidential elections because there was no absentee voting, said bar manager Franz-Arthur MacElhone.His great-grandfather Harry MacElhone decided to give Americans in Paris the chance to vote symbolically \"and have a party\" to overcome their frustration at not being allowed to participate in the real thing.American expatriates tend to favour Democratic candidates, but visiting tourists can easily make the pendulum swing the other way.In the weeks leading up to the November 5 contest, Harry's Bar posts the current score every Wednesday.On election night the final result will be announced just after voting ends in the US, and well before the new president is declared back home.","summary":"A straw poll at Harry's Bar in Paris, famous for calling US elections with uncanny accuracy, celebrates its centenary this year as Americans again flock to the drinking hole ahead of the November vote.","url":"https://www.ibtimes.com/harrys-bar-paris-drinks-us-straw-poll-centenary-3746010","image":"https://d.ibtimes.com/en/full/4552830/most-time-harrys-bar-patrons-get-it-right.jpg","video":null,"publish_date":"2024-10-09 00:12:18","author":"Emma Guillaume And Emma Vallee-Guillard","authors":["Emma Guillaume And Emma Vallee-Guillard"],"language":"en","source_country":"US","sentiment":0.088},{"id":258980534,"title":"Fox News Makes Strategic Move Before Election Day","text":"Fox News is launching a Spanish-language show just in time for election day. The show will be called “Fox Noticias” and will be anchored by Rachel Campos-Duffy, currently co-host of the “Fox & Friends” Weekend morning show. \n\nAiring on Fox Deportes, Fox’s Spanish-language sports network, the show is scheduled to start on October 15, and will take the 4 pm ET slot. The show will also be available as a podcast, and viewers will be able to stream it on the Fox Sports app, FoxDeportes.com, Fox Nation, their new Spanish-language website, and YouTube, with clips being pushed out to Instagram, Facebook, X, TikTok, and Snapchat.\n\nFox News Media will launch a daily news show called “Fox Noticias” that will air on Fox Corp.’s Spanish-language sports cable network Fox Deportes, executives told Axios. Ahead of the debut next week, Fox News will also unveil a Spanish-language version of its website.\n\nAccording to Campos-Duffy, the show will focus on “the kitchen table issues that matter most to our community,” including politics, news, culture, and entertainment. One of her first interviews will be with Panama’s president, José Raúl Mulino.\n\nThis isn’t Fox News’ first foray into Hispanic-focused programming, having previously operated Fox News Latino for six years before closing it down in 2016. The move comes as Fox News has seen its Hispanic viewership rise dramatically in recent years. According to Fox News senior vice president John Sylvester:\n\n“Fox News Channel has seen dramatic growth in Hispanic viewers over the last year increasing in double and triple digits in viewers and the younger A25–54 demographic. Coupled with recent data that shows the Hispanic population is the fastest growing electorate, it was a natural decision to create ‘Fox Noticias.'”\n\nThe rise in the number of Hispanics seeking out conservative news sources like Fox News dovetails with the number of Hispanic voters seeking a home in the Republican Party. For instance:\n\nNBC POLL: President Trump has made a 19-point gain among Latino voters since 2020.“Four years ago, we were saying Donald Trump had made inroads with Hispanic voters — this suggests that has continued apace.” pic.twitter.com/LJRmJrRz7M— Trump War Room (@TrumpWarRoom) September 29, 2024\n\nAs RedState’s Sister Toldjah noted in September, “That Democrats are having to compete more for these voters than they have in decades confirms two important things: That an increasing number of folks in their normally reliable voting blocs are , and that Republican persistence is paying off.”\n\nIt’s obvious that Fox News has also noted that trend and knows that conservative viewers are their bread and butter (and, of course, the liberal hate watchers). Therefore, it’s incredibly smart for them to launch this new product in the weeks before the election. It’s also smart to air the show on the sports network, as it will catch Hispanic viewers who might not tune into traditional news shows.\n\nIt goes without saying that Rachel Campos-Duffy is a great pick to host the show, as she has been a great voice for conservatives for many years now, even going back to her days as the sole Republican on the MTV show “Real World.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nFox News is launching a Spanish-language show just in time for election&#8230;\n\n\nThis Post: Fox News Makes Strategic Move Before Election Day first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/fox-news-makes-strategic-move-before-election-day/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Fox-News-Makes-Insanely-Smart-Move-Just.png","video":null,"publish_date":"2024-10-09 00:12:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.026},{"id":258981504,"title":"Melania Trump says ‘threat to democracy’ rhetoric against her husband is ‘toxic’","text":"In an interview with Fox News’s The Five, Trump talked about her memoir, which was released on Tuesday. At one point in the interview, she hit back at allegations that her husband, former President Donald Trump, was a threat to democracy, saying that such rhetoric was the real threat.\n\nMelania Trump: When they call him a threat to democracy, less ask ourselves, who is really a threat to democracy… Continuing with that kind of language, it is toxic, a toxic atmosphere. pic.twitter.com/JSJC8AZRve— Acyn (@Acyn) October 8, 2024\n\n“Of course, I do,” she responded when asked if she was concerned over the safety of her husband. “Yes, I do.” \n\n“When they call him, ‘He’s a threat to democracy,’ let’s ask ourselves, who is really [the] threat to democracy? They are ongoing with the lawfare against the former president, as well as, you know, trying to get him off the voting ballots and trying to silence him,” she added. “So yes, of course, I was always afraid what can happen, and that they [continue] with that kind of language is just … it’s a toxic, toxic atmosphere.”\n\nWhile largely preferring to stay out of the limelight, Melania Trump has been more public about her support for her husband ahead of the November election.\n\nThe former first lady has made similar comments about threats against her husband in other interviews around her book, such as during an interview with Fox News’s Hannity last week.\n\n“I saw how they treated him, how the media was against him,” she said after host Sean Hannity recalled how she predicted how her husband would be treated. “I think they are afraid of his strength, and he was leading this country with peace through strength. So as soon he announced that he’s running for the presidency, everything really changed. And I saw it and I said, you know, this will not be very pleasant.”\n\n“So I always said to him, ‘What is next?’ So it’s, in one way, you’re not surprised, and every event that had happened, I’m thinking, ‘What is next? What are they trying to do?’ And you always fear the worst, and then it happened,” she said, referring to the assassination attempts against her husband.\n\nMelania Trump’s book, titled Melania, also drew headlines for revealing her abortion-rights access stance, something that wasn’t known previously.","summary":"Former first lady Melania Trump said that her husband&#8217;s critics represent a &#8220;threat to democracy&#8221; with their sharing of &#8220;toxic&#8221; language about him. In an interview with Fox News&#8217;s The Five, Trump talked about her memoir, which was released on Tuesday. At one point in the interview, she hit back at allegations that her husband, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3182010/melania-trump-threat-democracy-rhetoric-against-husband-toxic/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Donald-and-Melania-Trump.webp","video":null,"publish_date":"2024-10-09 00:06:09","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.094},{"id":258980262,"title":"Mark Cuban was sleeping on the floor of a 'nasty' Dallas apartment less than a decade before he became a millionaire","text":"These days, billionaire Mark Cuban resides in a 24,000-square-foot mansion located in one of the nicest neighborhoods in Dallas.But that wasn't always the case.The former \"Shark Tank\" host recalled living in a \"shithole\" Dallas apartment with five other guys in the 1980s during a conversation on The San Francisco Standard's \"Life in Seven Songs\" podcast this week.\"I slept on the floor. If someone was out of town, I got a bed,\" Cuban said in the Tuesday episode, recounting his time in the \"nasty\" apartment. \"I didn't have my own closet, didn't have my own drawers, nothing.\"Cuban was fresh out of college at Indiana University when a friend convinced him to move to Dallas in 1982, promising great weather and scores of beautiful women, he said.\"The women are beautiful? Here I come. I'm 24 years old,\" Cuban said, recalling that time in his life.Cuban's post-college stint in Dallas was initially meant to be a quick stopover, but after a couple of months, he got a job selling software in the city.His time at that job, however, was short-lived. Cuban said he had the chance to make a $15,000 sale, which would have yielded him a $1,500 commission check. But his boss fired him instead, Cuban told The Standard.The setback was ultimately a positive, Cuban said. He started a company called MicroSolutions in 1983. Less than 10 years later, the company had grown to more than $30 million in revenue.In 1990, Cuban sold the company for $6 million, officially becoming a millionaire.After selling, Cuban said he \"made a lot of money\" and bought a lifetime pass on American Airlines to travel and party.\"I was young, single, and crazy, and there were no limits,\" Cuban told the outlet. \"I just wanted to have a beer with as many people as I possibly could, experience as many things as I possibly could.\"Cuban famously went on to appear on \"Shark Tank\" as an investor. The entrepreneur announced last year that he would leave the show after filming for this season wraps next year.The Dallas resident also bought the Mavericks for $285 million in 2000, but he sold his majority stake in the franchise earlier this year for a valuation in the range of $3.5 billion. Cuban maintains a 27% stake in the team.More recently, Cuban has been stumping for Vice President Kamala Harris, offering to serve in her potential administration and criticizing former President Donald Trump, though he says he doesn't hate the Republican nominee.","summary":"Mark Cuban moved to Dallas after college because his friend told him the city was full of beautiful women, he told The San Francisco Standard.","url":"https://www.businessinsider.com/mark-cuban-slept-dallas-apartment-floor-years-before-making-millions-2024-10","image":"https://i.insider.com/66e7956ccfb7f307e571ad54?width=1024&format=jpeg","video":null,"publish_date":"2024-10-09 00:03:15","author":"Erin Snodgrass","authors":["Erin Snodgrass"],"language":"en","source_country":"US","sentiment":-0.14},{"id":258980442,"title":"Trump gifted Putin a COVID test machine early in pandemic, book claims","text":"In the early days of the COVID-19 pandemic in 2020, then-President Donald Trump sent Russian President Vladimir Putin a COVID-19 test machine, according to the new book \"War\" by Bob Woodward. \"This is a moment when COVID is running wild, not just in the United States, in the world,\" Woodward told \"CBS Sunday Morning\" in a recent interview. \"He gives Abbott point-of-care testing kits to Putin. I mean, these are precious assets to anyone in the world, in the country, and he gives it to him for his personal use.\"Putin insisted Trump keep quiet about the gift, according to Woodward.Vide President Kamala Harris addressed the claims Tuesday during an interview with Howard Stern, saying, \"Everybody was scrambling to get these kits, these COVID test kits, and this guy, who's president of the United States, is sending them to Russia, this murderous dictator, for his personal use?\"Even after leaving office, Trump has stayed in touch with the Russian president, according to Woodward. An unidentified aide told Woodward the former president had as many as seven private calls with Putin — although Woodward noted he was unable to speak to Trump or Putin to verify the calls happened, and he was wasn't able to confirm the calls through the Trump campaign or intelligence sources.But according to the aide, one of the calls came early this year, when Trump was urging Republicans to block additional aid to Ukraine to help the country's fight against Russia.The newly revealed contacts raise additional questions about Trump's relationship with Putin. In a recent presidential debate, Trump twice refused to say who he wanted to prevail in the war between Russia and Ukraine. Harris told \"60 Minutes\" she believes Trump would have allowed Putin to conquer Ukraine.\"If [Trump] were president, Putin would be sitting in Kyiv right now,\" Harris said. \"He talks about, 'Oh, he can end it on day one.' You know what that is? It's about surrender.\"Trump's 2024 campaign communications director Steven Cheung blasted Woodward's claims, saying in a statement, \"None of these made up stories by Bob Woodward are true and are the work of a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome.\"Cheung said Trump gave Woodward \"absolutely no access\" for the book and said it \"belongs in the bargain bin of the fiction section.\" Woodward's book also includes tales of President Biden's private frustrations with Israeli Prime Minister Benjamin Netanyahu. According to Woodward, as the fighting in Gaza escalated earlier this year, Biden referred to Netanyahu as a \"son of a b****\" and called him \"a bad f***ing guy.\"","summary":"In his new book \"War,\" Bob Woodward claims Donald Trump has had at least seven phone calls with Vladimir Putin since leaving office.","url":"https://www.cbsnews.com/news/trump-putin-covid-test-machine-bob-woodward-book-war/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/08/47e5eaf1-1f7b-457d-af44-de7e4ad326cd/thumbnail/1200x630/08e56daf6034af134baa6e584237e9d0/gettyimages-2176596602.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3251541_hls/master.m3u8","publish_date":"2024-10-09 00:02:55","author":"Scott Macfarlane","authors":["Scott Macfarlane"],"language":"en","category":"politics","source_country":"US","sentiment":0.017},{"id":258981226,"title":"New Poll Shows Kamala Harris Taking Slim Lead Nationally Over Trump","text":"Kamala Harris has taken a slim lead over Donald Trump in the US presidential race, a new poll showed Tuesday, as the Democrat slammed her rival for \"weakness\" during a media blitz four weeks before the election.Vice President Harris and Republican former president Trump -- who was doing a three-hit airwaves blitz of his own Tuesday -- are deadlocked as they scramble to get out the vote and reach the sliver of Americans who remain undecided.The national poll conducted by Siena College and The New York Times found Harris ahead by 49 percent to 46 percent, with registered voters crediting her more than Trump with representing change and caring about people like themselves, but giving the edge to Trump on who is the stronger leader.The rivals were tied at 47 percent in a mid-September Times/Siena poll shortly after the two clashed in their presidential debate.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The overall result is largely in line with an aggregate of national polling collated by RealClearPolitics.com, which has Harris ahead by two percentage points.In the seven battleground states seen as likely to determine the election outcome, the race is even tighter.- Losing sleep -With Trump critics warning the election is nothing less than a referendum on American democracy, Harris conceded the knife-edge race is keeping her up at night.\"I literally lose sleep -- and have been -- over what is at stake in this election,\" she told radio icon Howard Stern in a 70-minute live interview Tuesday.\"This is an election that is about strength versus weakness, and weakness as projected by someone who puts himself in front of the American people and does not have the strength to stand in defense of their needs, their dreams, their desires.\"Harris, the new poll showed, has begun making inroads with the rival party, with nine percent of Republicans saying they planned to support her, up from five percent last month.She touched on the issue during a Tuesday appearance on popular ABC television show \"The View,\" where she talked about campaigning recently with Republican former congresswoman Liz Cheney.There are more than 200 former officials from past Republican presidents George W. Bush and George H.W. Bush, as well as officials tied to Republican heavyweights John McCain and Mitt Romney, who have endorsed her, Harris said.\"We really are building a coalition around some very fundamental issues, including that we love our country and that we have to put country before party,\" she said.The Democrat, who turns 60 next week, also accused Trump of \"full-time perpetuating lies and misinformation,\" and said voters have grown \"exhausted\" with the strategy.Trump meanwhile maintained his aggressive posture, attacking Harris as a \"very low intelligence person\" and claiming she has been \"missing in action\" over the federal response to Hurricane Helene -- even though Harris traveled to the disaster zone last week.And the 78-year-old Republican insisted on conservative influencer Ben Shapiro's podcast that he has the stamina to finish strong on the campaign trail.\"I've worked about 28 days in a row, I have about 29 days left\" before the election, he said, \"and I'm not taking any days off.\"In addition to the poll, Harris got another potential boost Tuesday after a pro-Palestinian group threatening to draw votes from her in swing state Michigan came out strongly against Trump.The Uncommitted movement stopped short of explicitly endorsing Harris, but warned in a video that \"it can get worse\" under Trump.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Kamala Harris has taken a slim lead over Donald Trump in the US presidential race, a new poll showed Tuesday, as the Democrat slammed her rival for \"weakness\" during a media blitz four weeks before...","url":"https://www.ndtv.com/world-news/new-poll-shows-kamala-harris-taking-slim-lead-nationally-over-trump-6748138","image":"https://c.ndtvimg.com/2024-09/gm36ndcc_donald-trump-kamala-harris-presidential-debate-reuters_625x300_11_September_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-10-09 00:01:19","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"in","sentiment":-0.001},{"id":258980438,"title":"New book claims Trump spoke with Putin 7 times since leaving office","text":"New book claims Trump spoke with Putin 7 times since leaving office\n A new book from veteran journalist Bob Woodward claims former President Donald Trump has had at least seven calls with Russian President Vladimir Putin since leaving office. Woodward's book, \"War,\" also reveals Trump sent Putin a COVID-19 testing kit early on in the pandemic. Scott MacFarlane has more.","summary":"A new book from veteran journalist Bob Woodward claims former President Donald Trump has had at least seven calls with Russian President Vladimir Putin since leaving office. Woodward's book, \"War,\" also reveals Trump sent Putin a COVID-19 testing kit early on in the pandemic. Scott MacFarlane has more.","url":"https://www.cbsnews.com/video/new-book-claims-trump-spoke-with-putin-7-times-since-leaving-office/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/08/f8b33777-95dd-4d08-9e08-8bc2f24a8885/thumbnail/1200x630/e66c000b2e7205ae7e4199ddd8676060/1008-en-macfarlane.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-09 00:00:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.274},{"id":258980166,"title":"Omaha neighborhood sees quiet battle between red and blue dots","text":"In the heart of an Omaha neighborhood is a sea of blue dots painted on lawn signs. Local resident Jason Brown and his wife, Ruth, first thought of the idea this summer and began spray painting them one at a time. At first, they debated putting words over the dot, but quickly decided to keep it simple.\"Two hundred went to 400 went to 1,000 went to 1,800,\" Ruth said.Nebraska awards electoral votes by congressional district, and Omaha is at the heart of the state's second district. If Vice President Kamala Harris wins there, she will carry one electoral vote from deeply red Nebraska â literally a blue dot.Neighbors swiftly took notice of the signs and asked for their own, which the Browns happily supplied.\"We had no campaign, no publicity or anything. It was just happening word of mouth,\" Jason said.Across the street, Tim Conn saw an opportunity to accelerate production. His wife Karen is a vital cog in the blue dot machinery.\"The ultimate goal is elect Kamala Harris and Tim Walz,\" Conn said.One blue dot has become a blue washing of the entire area, with more than 10,000 signs and new events added daily.These signs occupy a grand visual tradition in American politics. Some date back to the mid-nineteenth century and litter any available patch of grass during election season. Each sign can represent up to 6, sometimes 10 votes, according to some estimates.Recently, former President Donald Trump pressured the Nebraska legislature to change how it allocated electoral votes and make the state a winner-take-all state. Republican Senator Mike McDonnell was against the proposal.When asked if his stance could mean that Harris wins by just one electoral vote, McDonnell said, \"That's democracy.\"He continued, \"I'm okay with practicing democracy.\"Around the same time, Republican Ellen Ehlers came up with her own response to the blue dot â a red dot with a yellow flourish of Trumpian hair.\"All of a sudden [the blue dots] just were multiplying overnight and we're surrounded as you can see. We thought we'd be brave and put a red dot,\" Ehlers said.Despite differing politics, Ehlers said there haven't been any issues in the neighborhoodRuth Huebner Brown agrees. \"People are ready, I think, to move towards a more positive tone in our nation. And I think this has been a very positive tone,\" Ruth said.Demonstrating a kind of \"Nebraska nice,\" it's a sentiment that can be found right in the heart of dots â both blue and red.","summary":"Nebraska awards electoral votes by congressional district, and Omaha is at the heart of the state's second district.","url":"https://www.cbsnews.com/news/omaha-election-red-blue-dots/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/08/0d79684e-b8bd-458c-9de3-3f2d4ff2c007/thumbnail/1200x630/5d2e0fc1a0b37ae37463651154663c40/gettyimages-2176338026.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3251482_hls/master.m3u8","publish_date":"2024-10-08 23:58:06","author":"Alicia Hastey,Major Garrett","authors":["Alicia Hastey","Major Garrett"],"language":"en","source_country":"US","sentiment":0.248},{"id":258980030,"title":"Giuliani wants to put an end to discussions about money owed to him by Trump","text":"Rudy Giuliani has requested a federal judge in New York to prevent accused Georgia election workers from mentioning any potential debt owed to him by Donald Trump’s 2020 presidential campaign, at least for another month.\n\nIn a recent filing on Tuesday, Giuliani’s legal team asked U.S. District Judge Lewis Liman to prohibit Ruby Freeman and her daughter, Wandrea ArShaye “Shaye” Moss, from discussing matters related to “Defendant’s alleged claim against the Trump Campaign.”\n\nPreviously, Giuliani himself brought up the $2 million claim against the Trump campaign in earlier bankruptcy proceedings, which have since been paused. On the other hand, Freeman and Moss raised the same claim in the current case as part of their efforts to enforce a judgment in their defamation lawsuit back in late August.\n\nNow, Giuliani wants a preemptive-but-temporary kibosh on any further legal maneuvers related to those alleged arrears.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer mayor of New York Rudy Giuliani leaves the federal courthouse in&#8230;\n\n\nThis Post: Giuliani wants to put an end to discussions about money owed to him by Trump first appeared on Internewscast Journal","url":"https://internewscast.com/crime/giuliani-wants-to-put-an-end-to-discussions-about-money-owed-to-him-by-trump/","image":"https://internewscast.com/wp-content/uploads/2024/10/Giuliani-wants-to-stop-talk-of-money-he-is-owed.jpg","video":null,"publish_date":"2024-10-08 23:56:50","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.299},{"id":258979882,"title":"FEMA gets ready for Hurricane Milton amid rumors about Helene rebuilding efforts","text":"WASHINGTON – The rumors surrounding Hurricane Helene are many. There are false claims that people taking federal relief money could see their land seized. Or that $750 is the most they will ever get to rebuild. Or that the agency’s director — on the ground since the storm hit — was beaten up and hospitalized.\n\nAs the U.S. agency tasked with responding to disasters, the Federal Emergency Management Agency has been fighting misinformation since Helene slammed into Florida nearly two weeks ago and brought a wide swath of destruction as it headed north. The false claims are being fueled by former President Donald Trump and others just ahead of the presidential election, and are coming as the agency is gearing up to respond to a second major disaster: Hurricane Milton is set to strike Florida on Wednesday.\n\nFEMA Administrator Deanne Criswell told reporters Tuesday that she has never seen the disinformation problem as bad as it’s been with Helene, which hit hard in North Carolina, a state key to winning the election.\n\n“It’s absolutely the worst that I have ever seen,” an uninjured Criswell said.\n\nShe said the online rumors are demoralizing for staff or volunteers who have left family behind to deploy to a disaster zone. And she said there’s a real risk that local residents will hear these rumors and be too afraid to apply for the help they’re entitled to.\n\nDrew Reisinger, a Democratic registrar of deeds in Buncombe County, North Carolina, said part of the problem is that the affected regions have been largely without means of communication, so outside voices have an easier time setting the narrative.\n\n“It’s almost easier to let misinformation happen when all of our phone lines and internet lines have been down for so many days that we can’t refute it,” he said.\n\nFor days after Helene hit, his office did wellness checks when relatives or friends reached out to say that they hadn’t been able to get in touch with people in the area. The vast majority of people were OK. But at one point, his office said it had done 15,000 wellness checks and that was mistakenly interpreted as meaning 15,000 people were missing.\n\nHe pushed back on suggestions that relief supplies weren’t getting to people.\n\n“Even in my office and the registered deeds office, we are taking so much stuff out into every holler, and we’re finding that there’s already so much food and water at every local Baptist church … at the Elks Club and at the homeless shelter,” he said.\n\nU.S. Rep. Chuck Edwards, a North Carolina Republican, put out a statement Tuesday debunking “outrageous rumors” that FEMA is halting trucks from bringing in supplies, abandoning rescue efforts to bulldoze the mountain town of Chimney Rock, is running out of money and more. FEMA also has set up a website debunking conspiracy theories.\n\nBut others questioned where FEMA and other help has been. Pete Loftin and Crystal Pierce Clontz were talking Monday outside a donation center set up in Sunny View, North Carolina. They compared notes about how many bars they had been able to get on their cellphones — not many. Loftin had spent two days trying to cut his way out of his damaged driveway but wasn’t sure how he could even apply for FEMA help.\n\n“We all come together and are fending for ourselves,” he said.\n\nFEMA said Tuesday that federal assistance for survivors of Helene, which has killed 236 people across six states, has hit $286 million. It’s also sent about half a million tarps, 210 generators, more than 16 million meals and other supplies to the affected regions.\n\nThis is not the first time that rumors have run rampant following a disaster, although experts say social media has supercharged the phenomenon. Criswell said they ran into similar problems in 2023 after a massive wildfire in Maui.\n\nDuring Helene, false claims have swirled that residents will only get $750 from FEMA and nothing more. That amount specifically refers to one-time payments that people can receive for immediate needs like buying medicine or baby food. People also can apply for a host of other types of assistance, like money for rent while they’re displaced or money to store their belongings while they repair their homes.\n\nThe agency also has been falsely accused of confiscating donations intended for Helene and pivoting those supplies to Ukraine. Those are separate pots of money distributed by Congress.\n\nThe Institute for Strategic Dialogue has tracked the disinformation and misinformation circulating in Helene’s wake. The London-based think tank that tracks online hate, disinformation and extremism said it found 33 posts on the platform X containing claims already debunked by FEMA or others that had generated 160 million views as of Monday.\n\nAfter a disaster, there’s usually a period where residents work together to dig out and get supplies to strangers and friends alike, said Jeannette Sutton, an assistant professor at the University of Albany who studies how best to communicate with people during a disaster.\n\nBut at some point, there is often a transition where that altruism is replaced by a feeling of competition for resources. She’s concerned about what disinformation could do to push communities into competition even faster.\n\n“You can imagine that if people started to come in from the outside kind of stirring things up, that that could help to kind of push people into that more corrosive environment,” she said.\n\nIt’s all coming as FEMA is preparing for Hurricane Milton, which is set to hit Florida’s Tampa region Wednesday. Agency officials have said repeatedly that they can respond to multiple disasters at once — a message that Criswell hammered home Tuesday.\n\n“FEMA has done this before. We manage complex incidents. We’ve managed multiple complex incidents,” she said.\n\nCraig Fugate, who was FEMA administrator during the Obama administration and before that was Florida’s director of emergency management, reinforced that message.\n\nHe said the agency historically has been designed to be able to respond to two major disasters at any one time as well as a number of medium to small disasters. They have layers of staffing that can be deployed, ranging from reservists who get called up to work a disaster to staff at headquarters who agree when they’re hired to deploy as needed.\n\nThe agency can pull staff working on long-term disaster recovery to focus on what’s needed immediately — such as Milton response — and can pull from other parts of the Homeland Security Department if needed, Fugate said.\n\nCriswell said the agency has enough money right now to respond to both Helene and Milton. But she did raise concerns that the agency could run into problems around December or January if it doesn’t get more funding. In that case, they might have to pull back from long-term recovery projects to conserve money for the next big disaster, unless they get more funding from Congress.\n\nAnother agency key to disaster recovery is ringing the alarm that funds are running low. The Small Business Administration gives loans to uninsured or underinsured homeowners and to businesses to help them rebuild. President Joe Biden said in a letter to Congress that aid could run out “in a matter of weeks” if more federal funding is not approved.\n\nAssociated Press reporter Gabriela Aoun Angueira contributed from Sunny View, N.C.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – The rumors surrounding Hurricane Helene are many. There are false&#8230;\n\n\nThis Post: FEMA gets ready for Hurricane Milton amid rumors about Helene rebuilding efforts first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/fema-gets-ready-for-hurricane-milton-amid-rumors-about-helene-rebuilding-efforts/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-As-FEMA-prepares-for-Hurricane-Milton-it.jpg","video":null,"publish_date":"2024-10-08 23:51:05","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.467},{"id":258979508,"title":"CNN gives Donald Trump deadline to agree to second debate with Kamala Harris","text":"CNN has set a deadline of noon on Thursday for former US president Donald Trump to pull a U-turn and agree to a second debate with US Vice-President Kamala Harris.\nThe network said it would need nearly two weeks to prepare for the proposed clash, which is tentatively scheduled for October 23.\n“The window for a final 2024 presidential debate between former president Donald Trump and Vice-President Kamala Harris is closing,” CNN wrote on Tuesday in a story about its own deadline.\nTrump has given no indication that he is reconsidering his decision to forego another clash with Harris who was widely deemed the winner of their first debate on September 10, hosted by ABC News.\nHe has said the proposed second debate date is “too late” even though it is similar to the later debates in previous presidential election cycles.\n\nFor more than half a century, the major party candidates for president have sat down with 60 Minutes. This year, Vice President Kamala Harris and former President Donald Trump accepted our invitation. Unfortunately, last week Trump canceled. https://t.co/7t5jr5nyFJ pic.twitter.com/VDJDDNYFab\n— 60 Minutes (@60Minutes) October 8, 2024\n\nTrump also dodged a traditional sit-down interview with CBS News’ 60 Minutes, which aired a similar interview with Harris on Monday.\nThe Harris campaign responded to the CNN deadline by reaffirming her willingness to participate.\n“[Harris] remains ready to appear at CNN debate on October 23 if Trump will agree,” said Brian Fallon, a campaign spokesman.\nViewer polls deemed Harris the winner of the first debate, although the race remains too close to call, according to surveys of likely voters.\nTrump said he actually won the debate.","summary":"The ex-US president has said it is ‘too late’ for another face-off, and also dodged a 60 Minutes interview with CBS News.","url":"https://www.scmp.com/news/world/united-states-canada/article/3281623/cnn-gives-donald-trump-deadline-agree-second-debate-kamala-harris","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/09/06fce4c1-9aba-432e-bf71-5149e37c9e63_280b2f20.jpg","video":null,"publish_date":"2024-10-08 23:46:48","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.211},{"id":258979810,"title":"Harris embarks on media interview blitz as polls show her tied with Trump","text":"Vice President Kamala Harris has stepped up her media appearances, giving interviews to outlets big and small in an effort to appeal to voters in the final weeks of the United States presidential race.\n\nThe Democratic nominee continued with her media blitz on Tuesday, granting interviews to The Late Show With Stephen Colbert, the talk show The View and veteran broadcaster Howard Stern – who was once a friend of former President Donald Trump.\n\nEarly in her campaign for the presidency, Harris faced criticism for failing to make a major media appearance.\n\nShe announced her presidential bid on July 21, and it was more than a month later, on August 29, that she gave her first TV interview since launching her campaign.\n\nThat gap created scrutiny over her media strategy. Veteran media critic Margaret Sullivan, for instance, wrote in The Guardian newspaper that Harris had an obligation to tell the US public “in an unscripted, open way” what she stands for.\n\n“Harris should show that she understands that, in a democracy, the press – at least in theory – represents the public, and that the sometimes adversarial relationship between the press and government is foundational,” Sullivan said.\n\nSurveys have also indicated a desire among the electorate to know more about the Democratic nominee.\n\nA September poll from Siena College and The New York Times indicated that as many as 28 percent of likely voters felt they wanted to know more about Harris.\n\nHarris’s campaign has responded to the criticism with a whirlwind of media appearances over the past week. She is currently locked in a tight race with Trump, the Republican nominee, heading into the November 5 election.\n\nA tour of US media\n\nHarris’s sprint across networks and platforms on Tuesday included what was billed as her first live solo interview, with The View.\n\nSpeaking to the all-woman talk-show panel, Harris aligned herself closely with the outgoing Democratic President Joe Biden. Harris replaced Biden as the party’s nominee after concerns about his age and ability prompted him to step aside.\n\nHarris told The View she was unable to name a decision she would have made differently than Biden.\n\n“We’re obviously two different people,” Harris said, adding that “I will bring those sensibilities to how I lead”.\n\nWhen she was pressed on where she might have diverged from Biden had she been in charge, Harris said: “There is not a thing that comes to mind.”\n\nHarris’s appearance with Stern, a radio host, also came with another first: Media critics believe it is her longest uninterrupted interview since becoming the Democratic nominee.\n\nWhen she spoke to Stern, Harris took shots at Trump, who had a public falling-out with the radio host.\n\nAt one point, she and Stern discussed how Trump has refused to say he would accept the results of the 2024 election even if he lost.\n\nMimicking the former president, Stern said: “‘If I win, it’s a fair election. If I lose, Kamala Harris and her buddies fixed it.’” He summed up that viewpoint by saying, “That’s delusional.”\n\n“In America, we call that a sore loser,” Harris responded.\n\nTrump was a regular guest on the shock jock’s radio show in the 1990s and 2000s, using it to boost his New York tabloid fame.\n\nHe once told Stern that avoiding sexually transmitted diseases was his “personal Vietnam”.\n\nHarris appeals to Republicans\n\nTuesday’s cavalcade of interviews came after a high-profile interview on Monday with 60 Minutes, known as the oldest television newsmagazine in the US.\n\nOn 60 Minutes, Harris suggested that a number of Republicans agreed with her views, especially about economic issues.\n\n“You know, when you talk quietly with a lot of folks in Congress, they know exactly what I’m talking about because their constituents know exactly what I’m talking about; their constituents are those firefighters and teachers and nurses,” she said.\n\nHer appearance on 60 Minutes was meant to be half of an election-season special: The news programme had invited Trump to interview as well, and he accepted.\n\nBut Trump pulled out of the interview shortly before it was scheduled to be recorded, according to a statement from the newsmagazine.\n\n“It’s been a tradition for more than half a century that the major party candidates for president sit down with 60 Minutes in October,” host Scott Pelley said in a statement.\n\nPelley explained that the Trump team offered “shifting explanations” for the cancellation, including objecting to the on-air fact-checking of his statements.\n\n“Trump has said his opponent doesn’t do interviews because she can’t handle them. He had previously declined another debate with Harris,” Pelley said on Monday.\n\n“So tonight may have been the largest audience for the candidates between now and Election Day.”\n\nMore important to hit the battleground states\n\nPolls suggest the race between Harris and Trump is extremely close.\n\nThe poll-tracking website FiveThirtyEight currently has Harris pulling in 48.6 percent support nationally and Trump with 45.9, a difference that falls within the margin of error. Polls for the nearly half-dozen swing states – like Wisconsin and Georgia – are similarly close.\n\nPolitical analysts speculated that the Harris campaign was initially focused on hitting those battleground states with rallies and tours, rather than giving media interviews.\n\nAfter all, she and her running mate Tim Walz enjoyed a surge of public enthusiasm in the weeks after announcing their ticket.\n\nBut as the novelty has died down, both Harris and Walz have turned to media appearances to keep up their momentum.\n\nThis week, for instance, Harris recorded a session of the Call Her Daddy podcast with Alex Cooper, which has a huge social media following: Two million people follow the podcast on Instagram alone.\n\nSaid to be the most popular podcast in America for women, Call Her Daddy gave Harris a platform to speak about how voters are “frustrated and just exhausted with politics in general”.\n\n“Why should we trust you?” Cooper asked.\n\n“You can look at my career to know what I care about,” Harris responded.\n\nShe added: “I care about making sure that people are entitled to and receive the freedoms that they are due. I care about lifting people up and making sure that you are protected from harm.”\n\nA tracking poll by the website FiveThirtyEight this week has Harris at 48.6 and Trump at 45.9, a difference with the margin on error. Polls for the half-dozen swing states are similarly close.","summary":"As many as a quarter of US voters say they want to learn more about the vice president ahead of November&#039;s election.","url":"https://www.aljazeera.com/news/2024/10/8/harris-embarks-on-media-interview-blitz-as-polls-show-her-tied-with-trump?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/09/AP24261715916780-1726652980.jpg?resize=1920%2C1440","video":null,"publish_date":"2024-10-08 23:45:09","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","source_country":"qa","sentiment":-0.011},{"id":258979358,"title":"Broncos loss was Woody Johnson’s Robert Saleh breaking point","text":"The Robert Saleh era with the Jets came to a quick, stunning end Tuesday morning. \n\nOwner Woody Johnson fired Saleh, who was five games into his fourth year as head coach, just before 10 a.m. two days after the Jets lost 23-17 to the Vikings in London, their second straight disappointing loss. \n\nThe Jets named defensive coordinator Jeff Ulbrich as the interim head coach. \n\nThe move was surprising because of its timing. \n\nThe Jets are 2-3 and did have encouraging wins against the Titans and Patriots this season. \n\nBut Saleh, who had one year remaining on his contract, could not overcome a 20-36 overall record and the feeling from Johnson that he was not fixing what was wrong with the Jets, who entered this season with Super Bowl aspirations. \n\n“When I take a look at this team, I’ve been doing this for 25 years now, and this is probably the best team I’ve had in 25 years,” Johnson said in a Tuesday afternoon conference call with reporters. “And I just felt that the best way to go forward was a new direction. I thought that would get the most out of this team and give us the best chance that we all want to have, which is going to the playoffs.” \n\nThis is the first time Johnson has made a midseason coaching change as owner. \n\nThe 77-year-old Johnson was fuming after the Jets’ 10-9 loss to the Broncos last week, according to sources. \n\nHe wanted Saleh to make radical changes. \n\nFollow the latest on the New York Jets firing head coach Robert Saleh:\n\nRobert Saleh shockingly fired by Jets five games into season\n\nJets name Robert Saleh’s replacement after firing\n\nWoody Johnson: Why I fired Robert Saleh as Jets coach\n\nFans, pundits believe Aaron Rodgers was behind Robert Saleh’s Jets firing\n\nSaleh instead preached patience, but Johnson was out of that. \n\nThen, the Jets flopped in London, where Johnson served as the U.S. Ambassador to the United Kingdom under former President Donald Trump from 2017-21. \n\nJohnson had a long flight home to think about the future of the team and decided Tuesday morning to fire Saleh. \n\nSaleh showed up for work ready to game plan for the Bills, the Jets’ opponent on Monday night. \n\nShortly before 10 a.m., Johnson and his brother Christopher walked into Saleh’s office and delivered the news. Saleh wanted to say goodbye to the team, but was not given the chance. \n\nHe was asked to leave the building. \n\nJohnson said this decision was not made based on the last two losses, but rather Saleh’s body of work. \n\n“It’s not just the last two games that has precipitated this decision. It’s a longer time frame,” Johnson said. “I’ve had a couple years to think about this. And yeah, I just think we can do better. The team can do better. As the team realizes what an opportunity this is for them, I think they’re going to go to a level that we haven’t seen in a while.” \n\nJohnson brought Saleh back after a second consecutive 7-10 season last year with the understanding that he would be out if the team faltered this year. \n\nSaleh expected to get a full season to make a playoff push with Aaron Rodgers, though, and only got five games. \n\nSources said Johnson had grown tired of seeing the same problems with the team that had plagued it the last few years — slow starts, a high number of penalties and sloppy offensive play. \n\nThe Jets expected things to change with Rodgers at quarterback, but they still are losing with the same formula of a defense holding down an opponent and then offensive mistakes costing them games. \n\nThe Jets did not fire offensive coordinator Nathaniel Hackett, but sources said Saleh was preparing to take play-calling duties from him and give them to Todd Downing, the team’s passing game coordinator and quarterbacks coach, before he was fired. \n\nUlbrich said he will do a “deep dive” into the offensive struggles and indicated he will consider having a new play caller. \n\nHe did say he does not anticipate making any staff changes. \n\n“I think one of the reasons I decided to make a coaching change is exactly that: We need to find ways to win,” Johnson said. “And so we’re not going to find those ways by doing the same thing over and over and over. I think that Jeff is going to add something. He’s going to add a spark of positivity. Those changes that we have to make on offense, we’ll make. We’re going to try to get better. This is a new opportunity for all of us.” \n\nJohnson said he did speak to Rodgers on Monday night, but they did not discuss Saleh’s future. \n\nThere was no indication from any sources that Rodgers was involved in the decision. \n\nPlayers privately expressed shock at the decision to fire Saleh. He was popular in the locker room and the players were still playing hard for him. \n\nJohnson said he did consult general manager Joe Douglas but Johnson emphasized this was his decision alone. This is the first in-season coaching change for the Jets since 1976, when Lou Holtz quit with one game left. \n\n“I’ve had enough experience doing these things,” Johnson said. “It’s the first time I’ve done it this early. I thought and think that this will help this talented team achieve the goals that the team wants and I want and the fans want.”","summary":"The Jets are 2-3 and did have encouraging wins against the Titans and Patriots this season.","url":"https://nypost.com/2024/10/08/sports/broncos-loss-was-woody-johnsons-robert-saleh-breaking-point/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-vqau2lk42-1728429530742.jpg?quality=75&strip=all&1728415187&w=1200","video":null,"publish_date":"2024-10-08 23:43:34","author":"Brian Costello","authors":["Brian Costello"],"language":"en","source_country":"us","sentiment":-0.036},{"id":258981446,"title":"Americans for Prosperity super PAC launches battleground Senate ad blitz","text":"Americans for Prosperity Action, a super PAC affiliated with the Koch network of political advocacy groups, is launching a slate of new ads backing Republicans across multiple Senate battleground races, spending $8.75 million on a campaign focused largely on issues like the economy, inflation, and immigration. With mail ballots already being mailed out in dozens of states, AFP Action is spending $1.5 million to boost former GOP Rep. Mike Rogers in Michigan, $1.25 million on behalf of Tim Sheehy in Montana, and $2 million each for Bernie Moreno in Ohio, Dave McCormick in Pennsylvania, and Eric Hovde in Wisconsin. “The next 28 days are going to be 100% committed to talking to as many people as we can via the doors and the phones to convince them that our candidates are the right choice,” said AFP Action senior adviser Tim Golding. With party control of both chambers of Congress up for grabs in November, the group has spent about $60 million on election advertising already in 2024, according to FEC filings. Americans for Prosperity Action backed Nikki Haley for president in 2023 but has focused its efforts since then on promoting conservative down-ballot candidates through digital advertising, door-knocking, phone-banking and election mailers. The group is not investing in efforts to promote Donald Trump this fall. Emphasizing the cost of living while underscoring Moreno’s business experience, an Ohio ad asks, “Do we want a politician or do we want someone who knows how the economy works? Bernie Moreno gets it.” The Michigan ads, which are launching on the same day as the first Senate debate there, tie Democratic Rep. Elissa Slotkin to the Biden administration while highlighting Rogers’ Army and law enforcement experience. With less than a month until Election Day, AFP has knocked on more than 165,000 doors and made more than 225,000 phone calls statewide on behalf of Rogers in Michigan, the group said. The group has contacted more than 9 million voters about congressional races nationwide this election cycle.","summary":"Americans for Prosperity Action, a super PAC affiliated with the Koch network of political advocacy groups, is launching a slate of new ads backing Republicans across multiple Senate battleground races, spending $8.75 million on a campaign focused largely on issues like the economy, inflation, and immigration.","url":"https://www.nbcnews.com/politics/2024-election/americans-prosperity-super-pac-launches-battleground-senate-ad-blitz-rcna174545","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241008-capitol-ch-1419-e7c239.jpg","video":null,"publish_date":"2024-10-08 23:37:42","author":"Jillian Frankel","authors":["Jillian Frankel"],"language":"en","category":"politics","source_country":"us","sentiment":-0.213},{"id":258979018,"title":"Biden Announces Plan To Replace Lead Pipes That Could Cost More Than $90B","text":"President Joe Biden on Wednesday set a 10-year deadline for American cities to replace their lead pipes — a massive project that an industry group said could cost more than $90 billion, mostly paid for by water customers.\"Folks, what is a government for if it cannot protect the public health?\" Biden asked a crowd of union members in Milwaukee.The largest city in the swing state of Wisconsin has the fifth-highest number of lead pipes in the U.S., according to the Associated Press, which cited data from the Environmental Protection Agency.Biden's announcement of a new EPA rule governing lead in drinking water came a decade after the water crisis in Flint, Michigan, highlighted the continuing dangers of lead in tap water.It also came during the closing weeks of the tight presidential campaign and highlighted the issue of safe drinking water, which Vice President Kamala Harris has prioritized in her race against former President Donald Trump.Exposure to lead can cause a range of disorders and it's especially dangerous to children under the age of six, who can suffer behavior and learning problems, lowered IQs, hyperactivity and slowed growth.Despite enactment of the Safe Water Drinking Act in 1974, Biden said the U.S. still had more than 9 million lead pipes in use, a fact he called shameful, AP said.\"We're finally addressing an issue that should've been addressed a long time ago in this country,'' he said. \"We are showing up as a partner to get it done.\"Biden's Bipartisan Infrastructure Law of 2021 provided $15 billion for cities to replace their lead pipes and the EPA is making another $2.6 billion available for drinking water infrastructure to encourage compliance with the new rule, AP said.The agency is also offering $35 million in competitive grants for programs to reduce lead in drinking water, AP said.In a statement, the head of the American Water Works Association, which represents water utilities, said that it shared the EPA's desire to eliminate lead pipes and that the federal money would be \"helpful in closing the funding gap.\"\"However, AWWA estimates the cost of replacing lead service lines nationwide could top $90 billion,\" CEO David LaFrance said. \"Ultimately, most of these costs will fall to consumers through higher water bills.\"","summary":"The American Water Works Association, an industry group, said consumers would pay for most of the project through higher water bills.","url":"https://www.ibtimes.com/biden-announces-plan-replace-lead-pipes-that-could-cost-more-90b-3746003","image":"https://d.ibtimes.com/en/full/4552824/joe-biden.jpg","video":null,"publish_date":"2024-10-08 23:36:53","author":"Bruce Golding","authors":["Bruce Golding"],"language":"en","category":"politics","source_country":"US","sentiment":-0.314},{"id":258979704,"title":"NC GOP rep blasts 'Helene response myths' in letter: 'Nobody can control the weather'","text":"US Rep. Chuck Edwards (R-North Carolina) on Tuesday issued a scathing rebuke of the misinformation and disinformation spreading across social media regarding the Federal Emergency Management Agency's (FEMA) response to Hurricane Helene. \n\nCBS News correspondent Scott McFarlane posted to X a screenshot of a letter the North Carolina congressman published to his website, debunking a list of myths repeated by Donald Trump and parroted by others online amid the hurricane's devastating impact on the Tar Heel State. \n\n\"Over the past 10 days, I have been proud of how our mountain communities have come together to help one another,\" the letter reads. \"We have seen a level of support that is unmatched by most any other disaster nationwide; but amidst all of the support, we have also seen an uptick in untrustworthy sources trying to spark chaos by sharing hoaxes, conspiracy theories, and hearsay about hurricane response efforts across our mountains.\"\n\nREAD MORE: Damning reports detail Trump’s willingness to 'exploit major disasters' for political gain\n\nThe Republican lawmaker continued, \"While it is true, the Federal Emergency Management Agency’s response to Hurricane Helene has had its shortfalls, I’m here to dispel the outrageous rumors that have been circulated online.\"\n\nCBS News notes, \"Some of the most bizarre conspiracy theories that have spread online claimed politicians manipulated the weather to target Republicans areas in the battleground state and that the federal government was trying to seize land in the town of Chimney Rock to mine lithium.\"\n\nIn his letter, Edwards debunked eight myths, including: \n\n1. Hurricane Helene was NOT geoengineered by the government to seize and access lithium deposits in Chimney Rock.\"\n\nEdwards also emphasized, \"Nobody can control the weather,\" before debunking seven more myths, including: \n\n2. Local officials are NOT abandoning search and rescue efforts to bulldoze over Chimney Rock.\n\n3. FEMA is NOT stopping trucks or vehicles with donations, confiscating or seizing supplies, or otherwise turning away donations.\n\n4. FEMA has NOT diverted disaster response funding to the border or foreign aid.\n\n5. FEMA is NOT going to run out of money.\n\n6. FEMA cannot seize your property or land.\n\n7. The FAA [Federal Aviation Administration] is NOT restricting access to airspace for Helene rescue and recovery operations.\n\n8. FEMA is NOT only providing $750 to disaster survivors to support their recovery.\n\nEdwards went on to explain, \"The initial $750 provided to disaster survivors is an immediate type of assistance called Serious Needs Assistance that may be made to individuals in need as soon as they apply for FEMA assistance.\" \n\nREAD MORE: Top NC newspapers blast Trump’s federal hurricane response lies\n\nThe North Carolina leader added, \"The $750 is an upfront, flexible payment to help cover essential items like food, water, baby formula and medication while FEMA assesses the applicant’s eligibility for additional funds. This award is just the first step of a longer process to provide financial assistance to disaster survivors in need of federal support.","summary":"US Rep. Chuck Edwards (R-North Carolina) on Tuesday issued a scathing rebuke of the misinformation and disinformation spreading across social media regarding the Federal Emergency Management Agency's (FEMA) response to Hurricane Helene. \n\nCBS News correspondent Scott McFarlane posted to X a screenshot of a letter the North Carolina congressman published to his website, debunking a list of myths repeated by Donald Trump and parroted by others online amid the hurricane's devastating impact on the Tar Heel State.  \n\n\"Over the past 10 days, I have been proud of how our mountain communities have come together to help one another,\" the letter reads. \"We have seen a level of support that is unmatched by most any other disaster nationwide; but amidst all of the support, we have also seen an uptick in untrustworthy sources trying to spark chaos by sharing hoaxes, conspiracy theories, and hearsay about hurricane response efforts across our mountains.\"\n\nREAD MORE: Damning reports detail Trump’s willingness to 'exploit m","url":"https://www.alternet.org/chuck-edwards-debunks-helene-myths/","image":"https://www.alternet.org/media-library/image.png?id=53789116&width=1200&height=600&coordinates=0%2C0%2C0%2C110","video":null,"publish_date":"2024-10-08 23:36:40","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","category":"politics","source_country":"US","sentiment":0.049},{"id":258978714,"title":"Letters: Fremont mayor | Trans athletes | Cognitive decline | Young workers | Safe society","text":"Salwan is clear choice\nfor Fremont mayor\n\nRe: “For Fremont: Salwan, Keng, Zhang and Liu” (Page A8, Oct. 6).\n\nYour endorsement pointed out Fremont Councilmember Raj Salwan’s excellent credentials when it comes to understanding city finances, the challenges of reducing homelessness, and the realities of providing affordable and market-rate housing.\n\nThere are other key aspects of the mayoral role that should not be overlooked.\n\nAs someone actively involved with a number of local nonprofit and service-based organizations, I know it’s also critical that our mayor be actively engaged with nonprofits, attend local community events to hear first-hand from constituents, and continually promote and encourage the organizations providing so many backbone services to Fremont residents.\n\nWe often see Salwan in attendance at events throughout Fremont. We need elected officials who don’t just talk; they show up and engage with their constituents.\n\nLisa Stambaugh\n\nTrans athletes are not\nhurting women’s sports\n\nRe: “How players, parents are grappling with transgender athlete controversy” (Page A1, Oct. 6).\n\nThe telling part in Sunday’s article on the SJSU volleyball team is that the drama started only because Brooke Slusser exploited what her teammate told her.\n\nMake no mistake, trans women and girls have every right to participate in sports. Women’s sports have been hurt because of inadequate funding, and female athletes are harmed by abusive coaches and staff, not by trans athletes (see the Nassar case and the Yates Report on women’s professional soccer).\n\nWe must reject manufactured concerns that demonize specific groups of people. Fund women’s sports, believe female athletes who report abusive coaches and staff members, and protect trans athletes.\n\nBaby Djojonegoro\n\nTrump is showing signs\nof cognitive decline\n\nRe: “Remove ailing Biden from the presidency” (Page A8, Oct. 6).\n\nAshu Solo’s letter regarding Joe Biden’s cognitive abilities raises several critical points. Firstly, dementia cannot be diagnosed without a neurocognitive assessment.\n\nSecondly, Donald Trump exhibits significant cognitive issues. His tendency to abruptly switch topics suggests difficulty maintaining focus, often leading to incoherent statements. This lack of coherence suggests challenges in grasping complex issues and making informed decisions.\n\nDr. Allen Frances, Chair Emeritus of Psychiatry at Duke University, noted Trump’s deterioration since taking office. He highlighted instances where Trump’s remarks, such as those regarding Haitian immigrants and infant mortality, raise questions about his grasp on reality.\n\nPsychiatrist Richard A. Friedman, writing in The Atlantic, also observed signs of cognitive decline in Trump, citing his disjointed tangents as indicative of underlying cognitive problems.\n\nClearly, Trump displays numerous cognitive red flags, prompting concerns about his fitness for office. His decline since assuming the presidency in 2016 raises apprehensions about his future capabilities over another term.\n\nLarry Bieber\nCastro Valley\n\nStruggles are good\nfor young workers\n\nRe: “Minimum wage hikes harming young workers” (Page A6, Sept. 25).\n\nI was surprised that some very possible net positives that can be salvaged from the situation were omitted from the commentary.\n\nThe disadvantage of finding work as a teen can create resilience and determination, which is something that should be encouraged for new young people entering the workforce. This need causes youth to take their jobs more seriously and become prepared with community service, extracurriculars and anything that can help build their résumé.\n\nBy doing so, teens will have a head start on learning to overcome life’s obstacles and be better prepared for greater things. Put in hard work to start work.\n\nCaleb Tamara\n\nMake society safe\nfor Jewish citizens\n\nRe: “After terrifying year lets work together to fight antisemitism” (Page A8, Oct. 6).\n\nMarc Levine’s call for peace and safety resonates personally.\n\nFor too long, across the country and especially in the Bay Area and at UC Berkeley where I teach, Jewish people have experienced painful silence and indifference as they have been stigmatized, harassed and abused. UC Berkeley — as Levine illustrates — showed tremendous indifference to anti-Jewish attacks, hate crimes, discrimination and the stigmatization and exclusion of Jewish students, staff and faculty.\n\nGreater resources need to be invested to address anti-Jewish racism and harassment effectively and to restore trust and repair harm. Levine is right that anti-Jewish hate has been normalized in the Bay Area and nationally. It must be replaced with allyship, solidarity and respect for the civil rights and human rights of Jewish and Israeli people alongside all members of our diverse communities, in particular our Muslim, Arab and Palestinian fellow citizens, neighbors and friends.\n\nNoam Schimmel","summary":"East Bay Times Letters to the Editor for Oct. 9, 2024","url":"https://www.mercurynews.com/2024/10/08/letters-1897/","image":"https://www.mercurynews.com/wp-content/uploads/2023/08/SJM-L-FREOFFICE-0824-2.jpg?w=1024","video":null,"publish_date":"2024-10-08 23:30:40","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":0.156},{"id":258978870,"title":"Melania Sheds a Little Light on Trump’s Bedtime Habits","text":"Melania Trump has been married to her husband for 19 years, during which time she had a front-row seat to the former president’s bedtime routine. \n\nShe spilled on one detail of that regimen in a Tuesday appearance on Fox News Tuesday, suggesting that Donald Trump sleeps in something other than pajamas. \n\nShe joined The Five to promote her new memoir, aptly titled Melania, which hit shelves earlier in the day.\n\nAsked by Fox News host Greg Gutfeld if she would have married Trump had she known he was going to be president, Melania held up a finger. “Huh. That’s an interesting question,” she said, prompting laughter from the hosts. \n\nAfter she shared that her husband does, in fact, occasionally sleep, Gutfeld then asked if he wore pajamas to bed.\n\n“No,” Melania replied, smiling. \n\nGutfeld prodded her: “What does he wear when he sleeps?” She replied with a zip-the-lips gesture, eliciting more laughter from the group. \n\nFellow Fox News host Jesse Watters then jumped in, deftly changing the subject to the early days of Trump and his wife’s relationships.\n\n“One of the things she does get into the book, Greg, since I have read it and you haven’t: the first date, and how he courted you,” Watters said. “That courtship is very special.”\n\nIn her 256-page “platitude-ridden tale” (according to Vanity Fair), the former first lady furnishes the reader with an account of how she first met Trump at a New York Fashion Week party in 1998. \n\n“From the moment our conversation began, I was captivated by his charm and easygoing nature,” she writes, recalling that he flirted with her even with another blonde bombshell on his arm.\n\nMelania, who was 28 at the time, writes that she refused to give Trump her number but decided to take his business card. \n\nShe waited to call—which Trump immediately admonished her for by saying: “Why didn’t you call sooner? I was thinking about you.”","summary":"Joe Raedle/Getty ImagesMelania Trump has been married to her husband for 19 years, during which time she had a front-row seat to the former president’s bedtime routine. \n\nShe spilled on one detail of that regimen in a Tuesday appearance on Fox News Tuesday, suggesting that Donald Trump sleeps in something other than pajamas. \n\nShe joined The Five to promote her new memoir, aptly titled Melania, which hit shelves earlier in the day.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/melania-trump-sheds-a-little-light-on-her-husbands-bedtime-habits","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1442,w_2563,x_328,y_144/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1728428496/GettyImages-1441804570_zkzxpn","video":null,"publish_date":"2024-10-08 23:26:03","author":"Brett Bachman","authors":["Brett Bachman"],"language":"en","category":"politics","source_country":"US","sentiment":0.097},{"id":258981416,"title":"Trump announces Latter-day Saints coalition in push for battleground voters","text":"Former President Donald Trump on Tuesday announced a “Latter-Day Saints for Trump” coalition less than a month before Election Day, as the campaign looks to shore up support among a key voting bloc in which defections could be particularly damaging in key western battlegrounds. Among the leaders heading the coalition are four prominent Utah Republicans: Sen. Mike Lee, Rep. Celeste Maloy, Rep. Burgess Owens and state Attorney General Sean Reyes. “President Trump has consistently stood by our side in defending both, ensuring that Latter-day Saints and people of all faiths can worship freely and live according to our beliefs,” Lee said. “His dedication to life and protecting the unborn has fortified our families’ foundations, and his leadership is exactly what America needs to preserve the God-given rights that make us strong and free.” While the church’s home is based in Utah, which has not voted for a Democratic presidential candidate since 1964, there is a significant Latter-day Saints population in Arizona — more than 442,879, according to the church. President Joe Biden won Arizona by 11,000 votes in 2020. Exit polls show Biden won 18% of the LDS vote in Arizona, a significant defection from a reliably conservative denomination rooted in traditional family values. Latter-day Saints voters’ steadfast support for GOP candidates has long helped keep Utah and Idaho — the states with the largest share of LDS voters — impenetrably red on election nights. Arizona Republicans signing onto the Trump-LDS coalition include Rep. Andy Biggs and Pinal County Sheriff Mark Lamb, who ran an unsuccessful Senate campaign this year. Lamb said he believed Trump would protect his religious freedom and his right to “raise and protect” his family. The former president plans to hold a roundtable with Latter-day Saints leaders on Sunday in Arizona, according to a campaign aide. But some LDS voters have soured on Trump based on his often divisive political style — as well as his attacks on immigrants and refugees — which run contrary to the denomination’s ministry and culture. Vice President Kamala Harris’ campaign has sought to exploit this tension within the community and create a permission structure to back her instead, focusing on character and a more moderate personal — if politically progressive — style. The Harris campaign hosts a “Latter Day Saints for Harris-Walz coalition on its website and launched an advisory committee in Arizona last month. The Democratic campaign also organized a LDS coalition in Nevada this week. Others who signed onto the new Trump-LDS coalition include retired Air Force four-star general and retired general authority of the Mormon church Robert Oaks, conservative media commentator Glenn Beck and entertainment personalities “The Diesel Brothers.” In another sign of his growing influence within the Trump campaign, a campaign aide told NBC News that Donald Trump Jr. was a key figure in launching the LDS coalition for Trump, noting he has strong relationships with members of the Mormon community.","summary":"Donald Trump on Tuesday announced a “Latter-Day Saints for Trump” coalition less than a month before Election Day, as the campaign looks to shore up support among a key voting bloc in which defections could be particularly damaging in key western battlegrounds.","url":"https://www.nbcnews.com/politics/2024-election/trump-announces-latter-day-saints-coalition-push-battleground-voters-rcna174427","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-09/240925-donald-trump-ew-615p-60d447.jpg","video":null,"publish_date":"2024-10-08 23:24:28","author":"Garrett Haake,Olympia Sonnier","authors":["Garrett Haake","Olympia Sonnier"],"language":"en","category":"politics","source_country":"us","sentiment":0.696},{"id":258982598,"title":"Poll: Trump Leading Kamala Harris by Two Points in Arizona","text":"Former President Donald Trump is leading Vice President Kamala Harris in Arizona with a narrow lead of two points, according to a recent poll.\n\nA poll, conducted by Fabrizio Ward and Impact Research for AARP between September 24 – October 1, found that in a two-way race between Trump and Harris, Trump received 50 percent of support from Arizona voters, while Harris received 48 percent.\n\nIn a race with other candidates, Trump received 49 percent of support, while Harris received 47 percent of support. The poll also found that Green Party presidential candidate Jill Stein received one percent of support, while three percent of voters expressed that they were undecided.\n\nThe poll also found that among voters in Arizona between the ages of 50-64 years old, Trump held a 14-point lead over Harris\n\nHarris held a four-point lead over Trump among voters in the state between the ages of 18-49 years old, according to the poll.\n\nVoters 50 years old and older expressed that immigration and border security, the economy and jobs, inflation and rising prices, threats to democracy, and abortion and reproductive rights were important issues going into the presidential election, according to the poll.\n\nAltogether, 40 percent of 50 and older voters expressed that immigration and border security were important, with 25 percent saying it was their first choice in determining their vote, while 15 percent said it was their second choice.\n\nTwenty-six percent of voters 50 and older expressed that the economy and jobs were important, with 13 percent each listing it as their first and second choice in determining their vote.\n\nTwenty-five percent of voters 50 and older expressed that inflation and the increase in prices were important, with 11 percent listing it as their first choice in deciding their vote, and 14 percent listing it as their second choice.\n\nThe poll also found that 23 percent of voters 50 years and older felt that threats to democracy were important, while 22 percent expressed that abortion and reproductive issues were important.\n\nIn the poll, it was also revealed that key issues for voters 50 years and older were Social Security, Medicare, and policies that would help seniors be able to live independently.\n\nThe results from the poll come after a Suffolk/USA Today poll from September found that Trump held a six-point lead over Harris in Arizona, earning 48 percent while Harris earned 42 percent.","summary":"Former President Donald Trump is leading Vice President Kamala Harris in Arizona with a narrow lead of two points, according to a recent poll.\n\n\nThe post Poll: Trump Leading Kamala Harris by Two Points in Arizona appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/08/poll-trump-leading-kamala-harris-by-two-points-in-arizona/","image":"https://media.breitbart.com/media/2024/10/GettyImages-2177154686-640x335.jpg","video":null,"publish_date":"2024-10-08 23:23:29","author":"Elizabeth Weibel,Two Points","authors":["Elizabeth Weibel","Two Points"],"language":"en","source_country":"us","sentiment":0.016},{"id":258978016,"title":"Trump declares coalition with Latter-day Saints to attract voters in key states","text":"Former President Donald Trump on Tuesday announced a “Latter-Day Saints for Trump” coalition less than a month before Election Day, as the campaign looks to shore up support among a key voting bloc in which defections could be particularly damaging in key western battlegrounds. \n\nAmong the leaders heading the coalition are four prominent Utah Republicans: Sen. Mike Lee, Rep. Celeste Maloy, Rep. Burgess Owens and state Attorney General Sean Reyes.\n\n“President Trump has consistently stood by our side in defending both, ensuring that Latter-day Saints and people of all faiths can worship freely and live according to our beliefs,” Lee said. “His dedication to life and protecting the unborn has fortified our families’ foundations, and his leadership is exactly what America needs to preserve the God-given rights that make us strong and free.”\n\nWhile the church’s home is based in Utah, which has not voted for a Democratic presidential candidate since 1964, there is a significant Latter-day Saints population in Arizona — more than 442,879, according to the church. President Joe Biden won Arizona by 11,000 votes in 2020.\n\nExit polls show Biden won 18% of the LDS vote in Arizona, a significant defection from a reliably conservative denomination rooted in traditional family values. Latter-day Saints voters’ steadfast support for GOP candidates has long helped keep Utah and Idaho — the states with the largest share of LDS voters — impenetrably red on election nights. \n\nArizona Republicans signing onto the Trump-LDS coalition include Rep. Andy Biggs and Pinal County Sheriff Mark Lamb, who ran an unsuccessful Senate campaign this year.\n\nLamb said he believed Trump would protect his religious freedom and his right to “raise and protect” his family.\n\nThe former president plans to hold a roundtable with Latter-day Saints leaders on Sunday in Arizona, according to a campaign aide. \n\nBut some LDS voters have soured on Trump based on his often divisive political style — as well as his attacks on immigrants and refugees — which run contrary to the denomination’s ministry and culture.\n\nVice President Kamala Harris’ campaign has sought to exploit this tension within the community and create a permission structure to back her instead, focusing on character and a more moderate personal — if politically progressive — style.\n\nThe Harris campaign hosts a “Latter Day Saints for Harris-Walz coalition on its website and launched an advisory committee in Arizona last month.\n\nOthers who signed onto the new Trump-LDS coalition include retired Air Force four-star general and retired general authority of the Mormon church Robert Oaks, conservative media commentator Glenn Beck and entertainment personalities “The Diesel Brothers.”\n\nIn another sign of his growing influence within the Trump campaign, a campaign aide told NBC News that Donald Trump Jr. was a key figure in launching the LDS coalition for Trump, noting he has strong relationships with members of the Mormon community.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Donald Trump on Tuesday announced a “Latter-Day Saints for Trump”&#8230;\n\n\nThis Post: Trump declares coalition with Latter-day Saints to attract voters in key states first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-declares-coalition-with-latter-day-saints-to-attract-voters-in-key-states/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-09/240925-donald-trump-ew-615p-60d447.jpg","video":null,"publish_date":"2024-10-08 23:21:11","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.714},{"id":258979638,"title":"Taylor Swift & Brittany Mahomes Reunited At Chiefs Game -- To Boo Together!","text":"Awww! No Bad Blood here!\n\nTaylor Swift and Brittany Mahomes became fast friends last year. When Tay started dating Travis Kelce, the wife of QB Patrick Mahomes welcomed her warmly into the WAG community. The two couples spent a lot of time together.\n\nFolks were worried, however, that their politics had gotten in the way. Tay famously endorsed Kamala Harris, while Brittany seemed to support Donald Trump. And of course, we’re not talking about sports rivalry here — Trump has proven himself to be a genuine danger to women, the LGBT community, and minorities, especially immigrants. It’s a scary implication to support him. So when they seemed to be keeping their distance a few weeks ago, fans thought the worst.\n\nBut it seems clear all’s well in Arrowhead! Both attended the Kansas City Chiefs game on Monday night, and in an adorable video, Brittany can be seen welcoming Tay once again with a big, exuberant hug!\n\nHow did they fix things? There was talk Brittany might have been rethinking her support after the way Trump attacked her friend Taylor personally. But we’ve also heard they just don’t actually talk politics when they get together. Either way, it seems like they’re a united front again!\n\nLike all best friends, that means in good times and bad! Like when Pat’s touchdown pass got intercepted and returned for HUGE gain… by a defensive lineman! Just watch as they look on in disbelief together! (Together being the important part!)\n\nSomething tells us Tay changed her view of that play after the fact. Not only because the Chiefs still won, but it was who intercepted that ball.\n\nThat New Orleans Saints defensive tackle is Khalen Saunders. Besides being an extremely fast and agile 320-lb lineman, he’s also the brother of one of Taylor’s backup dancers, Kameron Saunders!\n\nTay LOVES her backup dancers, so he’s practically family! LOLz! We’re sure she was able to give him props for his fantastic play after the fact. Dontcha think??\n\n[Image via Mike Kirschbaum/Wynn Las Vegas/MEGA/WENN/ESPN/YouTube.]","summary":"Awww! No Bad Blood here! Taylor Swift and Brittany Mahomes became fast friends last year. When Tay started dating Travis Kelce, the wife of QB Patrick Mahomes welcomed her warmly into the WAG community. The two couples spent a lot of time together. Folks were worried, however, that their politics had gotten in the way. Tay famously endorsed [...]\n\n\nRead More...\n\n\nThe post Taylor Swift &#038; Brittany Mahomes Reunited At Chiefs Game -- To Boo Together! appeared first on Perez Hilton.","url":"https://perezhilton.com/taylor-swift-brittany-mahomes-reunion-chiefs-game-boo-saints-together/","image":"https://perezhilton.com/wp-content/uploads/2024/10/Taylor-Swift-Brittany-Mahomes-Reunion-Chiefs-Game-Boo-Saints-Together.jpg","video":null,"publish_date":"2024-10-08 23:20:13","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.138},{"id":258978918,"title":"Review: ‘The Apprentice’ Blames Trumpism on a Dead Lawyer","text":"A contemporary film reviewer’s most brutal challenge: taking on an origin-story biopic about him — He Who Shall Not Be Named — four weeks before Election Day 2024 and attempting to retain some semblance of objectivity (what?) or critical responsibility (oof) or at least rhetorical savoir-faire in the process. Let’s not kid ourselves: It’s an invitation to throw hands. Trying, this month, to look at Ali Abbasi’s The Apprentice as a movie instead of a sign of something very wrong with the universe is a fool’s effort — not at all unlike the last nine years of punditry trying to grok whatever fuels the current GOP candidate’s persistent popularity. Some movies must be shunned not for what they are but for the reality they endeavor to reflect.\n\nIn the end of course it’s just a movie, and so, right now, something of a footnote — the news cycle will, sorry, trump it. In November, either the forces of workaday reason and base-level bullshit detection will have triumphed, or the orcs will have taken the castle, again. Either way, Abbasi’s little film is a soon-to-be-forgotten pixel in the larger scenario. Maybe in a few years, when the stakes are lower and the bruises have faded, you might take a look and say, Huh, not bad. But not now.\n\nBut OK, let’s do the job, as if it matters. It’s the ’70s, and fresh-faced Daddy’s boy Donald (Sebastian Shaw) is an up-and-coming NYC real estate mogul blessed with the nasty good fortune of crossing paths with Roy Cohn (Jeremy Strong), who was a famously amoral, comic-book-villain mega-lawyer who graduated from being Senator Joseph McCarthy’s Red Scare junkyard dog to becoming a mover and shaker in city politics, even as he lived a wildly profligate gay-orgy lifestyle. From Cohn, Donald learns criminal stuff like blackmail and secret surveillance, and hears all kinds of rules: Never accept defeat, “Truth is malleable,” and so on. In other words, the same evil crap we’ve been hearing since 2015, three decades after Cohn died. \n\nCohn’s legacy lives on, and may ruin things yet. But in the film, we get to see Little Donald Fauntleroy make his first deals, back in the day, getting a taste of municipal skullduggery and learning how to be a mini-Cohn, which he does successfully enough to eventually turn around and be a douche to Cohn in the ’80s, when the poor little ogre was dying of AIDS.\n\nIf this sounds like something you’d only sit through this month if your eyelids were clamped open, à la A Clockwork Orange, then you’re in good company. But since I did, I should say that the film’s strenuous effort at being “fair and balanced” is nonsense: Our protagonist is practically a Dickens foundling, a wide-eyed, egoless blank slate, vulnerable to Cohn’s witchy ways. It’s hard to imagine being an adult over the past nine years and coming away wanting to portray the guy, in his late 20s, early 30s, as some kind of guileless, arrested-development teenager ready to be instructed in the black arts of being a professional scumbag — as though it was all Cohn’s fault. If you’d been reading Wayne Barrett’s reporting on the man in the Voice at the time, you’d be smelling four-day-old fish, but even a minute’s worth of exposure anytime during 2024 would call the movie’s cards for you. \n\nWhat were they thinking? The screenplay, by journalist and Roger Ailes biographer Gabriel Sherman, also pounds home the idea that Cohn was the way he was because of an ardent, take-no-prisoners patriotism — “You have to be willing to do anything to safeguard America!” he says, showing Our Hero his basement library of extortion-ready recordings. What this has to do with strong-arming the city council to build hotels is left unexplained, and anyway, it all sounds way too much like a neo-fascist stump speech today. It doesn’t help things that Strong’s snake-like Cohn is a powerfully convincing monstrosity and you can imagine a nitwitted viewer taking his warped reasoning as read. Only a foreign filmmaker — Abbasi is Persian-Dutch — could have swallowed that whopper and thought either man was a misguided, flag-waving ideologue and not the world-class miscreants they were and are.\n\nOh yeah, there’s the whole “subplot” about Ivana (Maria Bakalova). It should also be said that Abbasi, whose rather terrific earlier movies include Border (2018) and Holy Spider (2022), brings a nice period grit to what is, ultimately, a banal and formulaic biopic trifle, complete with unremarkable historical cameos (Warhol, Steinbrenner, Roger Stone, etc.). Whatever this thing is to be taken for, it’s not Abbasi’s fault — though you can’t help but suspect it’ll be a circumstantial sinkhole from which his career will have to climb. \n\nWe could’ve warned him. Reportedly, the ex-prez in question tried to get the film scotched after its festival premieres — not surprising, given the arterial spray of dumb invective we routinely endure from him. But go ahead and try to pin down exactly what pissed him off (if it wasn’t the late-coming stomach-staple and scalp-reduction surgeries, in loving close-up). All told, the film’s a rather soft headshot of the worst American alive. The small distributor, Briarcliff, has clarified their position by subtitling Abbasi’s movie, on the poster, “An American Horror Story.” Settle down. That’s not the film, but it could be what we get for real. ❖\n\nMichael Atkinson has been writing for the Village Voice since 1994. His latest book is the new edition of his BFI tract on David Lynch’s Blue Velvet.","summary":"A contemporary film reviewer’s most brutal challenge: taking on an origin-story biopic about him — He Who Shall Not Be Named — four weeks before Election Day 2024 and attempting to retain some semblance of objectivity (what?) or critical responsibility (oof) or at least rhetorical savoir-faire in the process. Let’s not kid ourselves: It’s an [&#8230;]\n\n\nThe post Review: ‘The Apprentice’ Blames Trumpism on a Dead Lawyer appeared first on LA Weekly.","url":"https://www.laweekly.com/review-the-apprentice-blames-trumpism-on-a-dead-lawyer/","image":"https://www.laweekly.com/wp-content/uploads/2024/10/100724_apprentice_Briarcliff.jpg","video":null,"publish_date":"2024-10-08 23:19:06","author":"Michael Atkinson","authors":["Michael Atkinson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.222},{"id":258979610,"title":"As FEMA prepares for Hurricane Milton, it battles rumors surrounding Helene recovery - The Associated Press","text":"WASHINGTON (AP) — The rumors surrounding Hurricane Helene are many. There are false claims that people taking federal relief money could see their land seized. Or that $750 is the most they will ever get to rebuild. Or that the agency’s director — on the ground since the storm hit — was beaten up and hospitalized.\n\nAs the U.S. agency tasked with responding to disasters, the Federal Emergency Management Agency has been fighting misinformation since Helene slammed into Florida nearly two weeks ago and brought a wide swath of destruction as it headed north. The false claims are being fueled by former President Donald Trump and others just ahead of the presidential election, and are coming as the agency is gearing up to respond to a second major disaster: Hurricane Milton is set to strike Florida on Wednesday.\n\nFEMA Administrator Deanne Criswell told reporters Tuesday that she has never seen the disinformation problem as bad as it’s been with Helene, which hit hard in North Carolina, a state key to winning the election.\n\n“It’s absolutely the worst that I have ever seen,” an uninjured Criswell said.\n\nShe said the online rumors are demoralizing for staff or volunteers who have left family behind to deploy to a disaster zone. And she said there’s a real risk that local residents will hear these rumors and be too afraid to apply for the help they’re entitled to.\n\nDrew Reisinger, a Democratic registrar of deeds in Buncombe County, North Carolina, said part of the problem is that the affected regions have been largely without means of communication, so outside voices have an easier time setting the narrative.\n\n“It’s almost easier to let misinformation happen when all of our phone lines and internet lines have been down for so many days that we can’t refute it,” he said.\n\nFor days after Helene hit, his office did wellness checks when relatives or friends reached out to say that they hadn’t been able to get in touch with people in the area. The vast majority of people were OK. But at one point, his office said it had done 15,000 wellness checks and that was mistakenly interpreted as meaning 15,000 people were missing.\n\nHe pushed back on suggestions that relief supplies weren’t getting to people. \n\n“Even in my office and the registered deeds office, we are taking so much stuff out into every holler, and we’re finding that there’s already so much food and water at every local Baptist church ... at the Elks Club and at the homeless shelter,” he said. \n\nU.S. Rep. Chuck Edwards, a North Carolina Republican, put out a statement Tuesday debunking “outrageous rumors” that FEMA is halting trucks from bringing in supplies, abandoning rescue efforts to bulldoze the mountain town of Chimney Rock, is running out of money and more. FEMA also has set up a website debunking conspiracy theories.\n\nBut others questioned where FEMA and other help has been. Pete Loftin and Crystal Pierce Clontz were talking Monday outside a donation center set up in Sunny View, North Carolina. They compared notes about how many bars they had been able to get on their cellphones — not many. Loftin had spent two days trying to cut his way out of his damaged driveway but wasn’t sure how he could even apply for FEMA help. \n\n“We all come together and are fending for ourselves,” he said. \n\nFEMA said Tuesday that federal assistance for survivors of Helene, which has killed 236 people across six states, has hit $286 million. It’s also sent about half a million tarps, 210 generators, more than 16 million meals and other supplies to the affected regions.\n\nThis is not the first time that rumors have run rampant following a disaster, although experts say social media has supercharged the phenomenon. Criswell said they ran into similar problems in 2023 after a massive wildfire in Maui.\n\nDuring Helene, false claims have swirled that residents will only get $750 from FEMA and nothing more. That amount specifically refers to one-time payments that people can receive for immediate needs like buying medicine or baby food. People also can apply for a host of other types of assistance, like money for rent while they’re displaced or money to store their belongings while they repair their homes.\n\nThe agency also has been falsely accused of confiscating donations intended for Helene and pivoting those supplies to Ukraine. Those are separate pots of money distributed by Congress.\n\nThe Institute for Strategic Dialogue has tracked the disinformation and misinformation circulating in Helene’s wake. The London-based think tank that tracks online hate, disinformation and extremism said it found 33 posts on the platform X containing claims already debunked by FEMA or others that had generated 160 million views as of Monday.\n\nAfter a disaster, there’s usually a period where residents work together to dig out and get supplies to strangers and friends alike, said Jeannette Sutton, an assistant professor at the University of Albany who studies how best to communicate with people during a disaster.\n\nBut at some point, there is often a transition where that altruism is replaced by a feeling of competition for resources. She’s concerned about what disinformation could do to push communities into competition even faster.\n\n“You can imagine that if people started to come in from the outside kind of stirring things up, that that could help to kind of push people into that more corrosive environment,” she said.\n\nIt’s all coming as FEMA is preparing for Hurricane Milton, which is set to hit Florida’s Tampa region Wednesday. Agency officials have said repeatedly that they can respond to multiple disasters at once — a message that Criswell hammered home Tuesday.\n\n“FEMA has done this before. We manage complex incidents. We’ve managed multiple complex incidents,” she said. \n\nCraig Fugate, who was FEMA administrator during the Obama administration and before that was Florida’s director of emergency management, reinforced that message.\n\nHe said the agency historically has been designed to be able to respond to two major disasters at any one time as well as a number of medium to small disasters. They have layers of staffing that can be deployed, ranging from reservists who get called up to work a disaster to staff at headquarters who agree when they’re hired to deploy as needed.\n\nThe agency can pull staff working on long-term disaster recovery to focus on what’s needed immediately — such as Milton response — and can pull from other parts of the Homeland Security Department if needed, Fugate said.\n\nCriswell said the agency has enough money right now to respond to both Helene and Milton. But she did raise concerns that the agency could run into problems around December or January if it doesn’t get more funding. In that case, they might have to pull back from long-term recovery projects to conserve money for the next big disaster, unless they get more funding from Congress.\n\nAnother agency key to disaster recovery is ringing the alarm that funds are running low. The Small Business Administration gives loans to uninsured or underinsured homeowners and to businesses to help them rebuild. President Joe Biden said in a letter to Congress that aid could run out “in a matter of weeks” if more federal funding is not approved. \n\nAssociated Press reporter Gabriela Aoun Angueira contributed from Sunny View, N.C.","summary":"As FEMA prepares for Hurricane Milton, it battles rumors surrounding Helene recovery  The Associated Press","url":"https://apnews.com/article/fema-misinformation-helene-milton-hurricane-aid-recovery-468b036784b1db05937e9a34d0146041","image":"https://dims.apnews.com/dims4/default/1295a25/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F0b%2Faaa2d0f1265e5a45af977d7a0b2f%2Fbb952fd3e6994ea4a0c31335ce974205","video":null,"publish_date":"2024-10-08 23:18:00","author":"Rebecca Santana","authors":["Rebecca Santana"],"language":"en","source_country":"us","sentiment":-0.464},{"id":258978448,"title":"Women volunteers in Virginia work to turn out the vote","text":"Women volunteers in Virginia work to turn out the vote\n Vice President Kamala Harris and former President Donald Trump are fighting for the female vote. Both candidates are getting help from teams of volunteers in Virginia. CBS News correspondent Natalie Brand spoke with the organizers.","summary":"Vice President Kamala Harris and former President Donald Trump are fighting for the female vote. Both candidates are getting help from teams of volunteers in Virginia. CBS News correspondent Natalie Brand spoke with the organizers.","url":"https://www.cbsnews.com/video/women-volunteers-virginia-work-turn-out-vote/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/08/7f61d661-806b-423f-809a-6a60654009f3/thumbnail/1200x630/b0676af9925436a7ed32120558ffc934/cbsn-fusion-women-volunteers-virginia-work-turn-out-vote-thumbnail.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-08 23:11:11","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.243},{"id":258977438,"title":"Trump secretly sent Putin COVID-19 tests during pandemic shortage, a new book reports","text":"Vice President Harris is criticizing Donald Trump following new reporting by the journalist Bob Woodward that the former president secretly shared COVID-19 test machines with Russia’s Vladimir Putin at a moment in 2020 when tests were out of reach for most Americans.\n\nThe revelation, first reported by CNN and The Washington Post on Tuesday, is detailed in a forthcoming book called War book by the famed Watergate journalist, about Trump’s record on the international stage, as well as President Biden’s.\n\nAccording to the book, Trump sent the secret shipment of testing equipment to the Russian leader at the height of the pandemic in 2020, even as the U.S. and other nations were facing crippling shortages of testing kits.\n\n“I don’t want you to tell anybody because people will get mad at you, not me. They don't care about me,” Putin told Trump, according to the book. Trump responded, \"I don't care. Fine,\" according to Woodward. \n\nNPR has not independently verified the account, which was based on interviews with unnamed sources.\n\nAsked about the report during an interview Tuesday with Howard Stern, Harris said Woodward’s reporting was an example of why Trump cannot be trusted as commander-in-chief, because she said he is easily manipulated by authoritarians he hopes to befriend.\n\n“He admires strong men, and he gets played by them because he thinks that they're his friends, and they are manipulating him full time and manipulating him by flattery and with favor,\" Harris said. “Remember, people were dying by the hundreds, everybody was scrambling to get these kits ... and this guy, who was President of the United States, is sending them to Russia to a murderous dictator for his personal use.”\n\nThe Trump campaign has dismissed the book as “made up stories” written by a “deranged man,” according to a statement by its communications director, Steven Cheung. \n\n“President Trump gave him absolutely no access for this trash book that either belongs in the bargain bin of the fiction section of a discount bookstore or used as toilet tissue,” the statement read.\n\nWoodward’s reporting adds to the swirl of questions that have surrounded Trump about his relationship with Putin dating back to his 2016 campaign for the White House, when he publicly called on Russia to find Hillary Clinton’s missing emails. Trump has defended his stance toward Putin, maintaining that had he still been in office Russia would not have invaded Ukraine in 2022.\n\nIt is a relationship that appears to have continued even after Trump left the White House, according to Woodward, who reports that the former president may have spoken with Putin as many as seven times since Biden took office.\n\nIn one episode reported by Woodward, Trump ordered an aide away from his office at Mar-a-Lago in order to take a private call with Putin early in 2024.\n\nThe book also details pivotal moments in the Biden presidency, including the administration's response to the war in Ukraine and Biden's fractious relationship with Israeli Prime Minister Benjamin Netanyahu. Woodward recounts the president's frustrations with Netanyahu amid the ongoing war in Gaza as he concluded that Netanyahu's instincts for political survival outweighed his interest in defeating Hamas. \n\n\"That son of a b****, Bibi Netanyahu, he’s a bad guy. He’s a bad f****** guy!” Biden reportedly told advisers, according to Woodward. \n\nAsked about the anecdote, the White House declined comment, but deputy press secretary Emilie Simons said the U.S-Israel relationship is \"as strong as ever\" and said Biden and Netanyahu have a long and candid relationship.\n\n\"They can have very honest and straightforward conversations with each other,\" Simons said.","summary":"Vice President Harris is criticizing Trump over the reported shipment, which is detailed in a new book by the journalist Bob Woodward. The president's campaign has denied the reporting.","url":"https://www.npr.org/2024/10/08/nx-s1-5146501/trump-putin-covid-tests","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3807x2397+0+0/resize/3807x2397!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8f%2Fd1%2F84a5410446eba69ecee3753bccd0%2Fgettyimages-1000091266.jpg","video":null,"publish_date":"2024-10-08 23:04:59","author":"Jason Breslow","authors":["Jason Breslow"],"language":"en","source_country":"us","sentiment":-0.134},{"id":258982148,"title":"CBO estimates $1.8 trillion US deficit for fiscal 2024, largest after COVID - Reuters","text":"WASHINGTON, Oct 8 (Reuters) - The Congressional Budget Office estimated on Tuesday a U.S. federal deficit of $1.834 trillion for fiscal 2024, the highest in the post-COVID era, as debt interest costs jumped sharply and outlays rose for Social Security, Medicare and health insurance tax credits.\n\nThe estimate, which precedes the U.S. Treasury Department's year-end budget report later this month, shows a deficit up 11% from the $1.7 trillion fiscal 2023 gap but slightly lower than the $1.9 trillion deficit estimated in June by CBO.\n\nAdvertisement · Scroll to continue\n\nWHY IT'S IMPORTANT\n\nU.S. Vice President Kamala Harris is arguing that she would be more fiscally responsible as president than Republican rival Donald Trump, pledging to fully offset new spending with tax increases elsewhere. A fiscal think-tank, the Committee for a Responsible Federal Budget, estimated on Monday that Trump's plans would pile up $7.5 trillion in new debt, more than twice the $3.5 trillion from Harris' proposals.\n\nAdvertisement · Scroll to continue\n\nBut after significant U.S. deficit declines in 2021 and 2022 as the economy recovered and COVID-19 rescue spending faded, deficits have grown significantly during the past two years, and CBO estimates that \"baseline\" deficits, which assume no changes to current laws, will grow $22 trillion over the next 10 years.\n\nBY THE NUMBERS:\n\nCBO estimated that total revenues rose 11% to $4.918 trillion, powered by higher individual income taxes and corporate income taxes as economic growth remained strong. The non-partisan budget referee agency estimated that outlays for the fiscal year ended Sept. 30 totaled $6.752 trillion, up 11% from fiscal 2023.\n\nThe biggest growth in outlays comes from interest on the public debt, which rose 34% to $950 billion, while spending on Medicare, Social Security and the military also increased.\n\nThe year-on-year deficit comparisons were affected by the fiscal 2023 reversal of $330 billion in costs associated with President Joe Biden's student loan forgiveness plan that was struck down by the Supreme Court. Without the reversal, last year's deficit would have exceeded $2 trillion.\n\nSome Republicans seized on the estimates to claim that Biden and Harris were fiscally irresponsible.\n\n\"President Biden and Vice President Harris have ignored resounding messages from Iowans and Americans nationwide, as well as alarms from global credit ratings companies. By consistently choosing a spendthrift agenda over fiscal sanity, this administration has hamstrung our economy for generations to come,\" Republican Senator Chuck Grassley said in a statement.\n\nReporting by David Lawder; Editing by Richard Chang\n\nXFacebookLinkedinEmailLinkPurchase Licensing Rights","summary":"CBO estimates $1.8 trillion US deficit for fiscal 2024, largest after COVID  Reuters","url":"https://www.reuters.com/world/us/cbo-estimates-18-trillion-us-deficit-fiscal-2024-largest-after-covid-2024-10-08/","image":"https://www.reuters.com/resizer/v2/W6H7LFVVWFLBRJOXRZJH5P4CJQ.jpg?auth=62c10c820f051bcbd0522d787844a596e9db862f8042e050e19c321d24ac6049&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2024-10-08 23:04:51","author":"David Lawder","authors":["David Lawder"],"language":"en","source_country":"gb","sentiment":-0.253},{"id":258981190,"title":"Barron Trump was DENIED a bank account because of the 'cancel mob,' Melania claims in new book","text":"Barron Trump was DENIED a bank account because of the 'cancel mob,' Melania claims in new book\n\nREAD MORE: Melania Trump explains how she became comfortable posing nude\n\nBy Nikki Schwab, Chief Campaign Correspondent For Dailymail.Com In Washington, D.C.\n\nPublished: 00:04 BST, 9 October 2024 | Updated: 00:04 BST, 9 October 2024\n\nBarron Trump was denied a bank account because of the 'cancel mob,' former first lady Melania Trump reveals in her new book.\n\nIn her memoir Melania, the former first lady discusses the 'venom of cancel culture' she experienced after leaving the White House, just weeks after the January 6 Capitol attack.\n\nFormer President Donald Trump was in the political doghouse over his role in the brutal riot, but Melania writes that she and Barron were impacted too. \n\n'I was shocked and dismayed to learn that my long-time bank decided to terminate my account and deny my son the opportunity to open a new one,' she said. 'This decision appeared to be rooted in political discrmination, raising serious concerns about civil rights violations.'\n\nShe called it 'troubling' that a financial services institution could discriminate 'based on political affiliation.' \n\nFormer first lady Melania Trump (left) writes about dealing with the 'cancel mob' after leaving the White House in 2021, claiming that even son Barron (right) wasn't able to open a bank account. The two are photographed at the White House in August 2020 \n\nMelania said she even had issues trying to do charity work. \n\nThe former first lady started Fostering the Future upon leaving the White House, deciding that she wanted to help kids in foster care. \n\nShe wrote in the book, which was released Tuesday, that a 'leading tech-education company' had agreed to partner with the non-profit, until Melania's involvment was publicized. \n\n'Despite my efforts to focus solely on children's education and my willingness to avoid any public association with the program, the school remained firm and terminated the agreement,' she said. \n\n'It has been troubling to witness people who claim to care about the well-being of communities engage in actions that harm those communities,' she continued. \n\nShe said she believed the trend was 'escalating unchecked.'\n\n'The \"cancel mob\" now includes corporations, traditional media, influential social media figures, and cultural institutions,' she wrote. 'This disheartening trend reflects the current socio-political landscape in the United States.' \n\nMelania Trump (center left) is photographed with her father Victor Knavs (left), son Barron (center right) and former President Donald Trump at her mother's funeral in January earlier this year \n\nBarron Trump graduated from high school in Florida in May and is now a freshman at New York University, which Melania Trump said Tuesday was going well \n\n'These ideologues, often lacking basic decency, can cause collateral damage to innocent people. It is evident that these self-proclaimed \"activists\" show little regard for the consequences of their behavior, even when it adversely impacts the people they purport to care about,' she went on. \n\nMelania then recalled another foster care event she was supposed to attend that got scrapped once 'the organizer and their famiily, including several elderly employees, faced harassment from the New York Times and social media activists.' \n\n'Ultimately, the event never happened due to this pressure, leaving foster care children as the primary victims,' the former first lady said. \n\nThe bank account incident didn't do too much to ruffle Barron Trump, who graduated high school in May and is now a freshman at New York University. \n\nAsked how the 18-year-old was doing during an interview Tuesday night on Fox News Channel's The Five, Melania said his college career was off to a good start. \n\n'He's doing great. He loves his classes and his professors. He's doing well. He's striving and he's enjoying being in New York City again,' she said. \n\nPoliticsMelania TrumpBarron Trump\n\nShare or comment on this article:\nBarron Trump was DENIED a bank account because of the 'cancel mob,' Melania claims in new book\n\nAdd comment","summary":"Barron Trump was denied a bank account because of the 'cancel mob,' former first lady Melania Trump reveals in her new book.","url":"https://www.dailymail.co.uk/news/article-13938483/barron-trump-denied-bank-account-melania-trump-memoir.html","image":"https://i.dailymail.co.uk/1s/2024/10/08/23/90621293-0-image-m-29_1728428352089.jpg","video":null,"publish_date":"2024-10-08 23:04:45","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.185},{"id":258977118,"title":"Biden raged over DOJ going after Hunter, blames Obama for Russian invasion of Ukraine: Bob Woodward book","text":"Furious Joe Biden regrets choosing Attorney General Merrick Garland to lead the Justice Department after the agency prosecuted his son Hunter, a new book by Bob Woodward claims.\n\nThe allegation is just one of a number of bombshell insights into the Biden White House in “War,” out October 15. The book reveals a president desperately trying to stave off war in the Middle East, fearful of Russia unleashing nuclear warfare, and worn down by his wayward son. \n\nBiden also lashes out about everyone from Garland to Vladimir Putin, Benjamin Netnyahu and even Barack Obama — who Biden blames for not stopping Putin’s 2014 invasion of Crimea, raging that “Barack never took Putin seriously.”\n\nThe president has publicly said he will not pardon his son’s conviction on three federal gun charges or commute his sentence — but remains privately furious at the AG, writes Woodward, who describes how Biden told an associate he “should never have picked Garland.”\n\nAccording to the book, Biden moaned, “This is never going to f—king go away” about his son’s longstanding legal problems, including three felony and six misdemeanor tax charges, which he pleaded guilty to in September.\n\nWoodward also describes a scene between the president and his spoiled son at the White House in spring 2022.\n\nWhile the president was having dinner with a friend, Hunter came in and claimed it was he who had the most to lose from the midterm elections.\n\n“Hunter rambled on about his personal crisis. President Biden leaned back in his chair, closed his eyes and sighed,” Woodward writes.\n\nThe book, which was obtained by CNN ahead of its release, is based on interviews with those who saw Biden explode.\n\nHere’s who’s found themselves in the firing line: \n\nBenjamin Netanyahu\n\nPresident Biden blasted Israeli Prime Minister Benjamin “Bibi” Netanyahu as a “bad f–king guy,” as Israel’s war on Gaza intensified, Woodward alleges.\n\nThe journalist reveals how Biden raged to an associate earlier this year, “That son of a bitch, Bibi Netanyahu, he’s a bad guy. He’s a bad f–king guy!”\n\nWoodward describes the prickly relationship between Biden and Netanyahu as the Middle East descended into chaos following the October 7 terror attack by Hamas on Israel.\n\nWhile Biden supported Israel publicly, he fought with Netanyahu behind the scenes over how the country was conducting the war in Gaza\n\n“What’s your strategy, man?” Biden asked Netanyahu during an April phone call, Woodward claims. “Bibi, you’ve got no strategy.”\n\nThat same month, Israel launched a strike in Syria that killed a top general in the Iranian Revolutionary Guard Corps, prompting Iran to launch more than 100 ballistic missiles in response.\n\nThe US, along with Saudi Arabia, Jordan and other US allies, came to Israel’s defense. While nearly all of the Iranian missiles were intercepted, Netanyahu wanted to retaliate.\n\nBiden told Netanyahu to “take the win,” but the Israeli prime minister pushed back. “You don’t need to make another move. Do nothing,” Biden said.\n\nIn the end, Israel launched a small strike against Iran, which Biden considered a win. But his frustration boiled over as the war continued to escalate.\n\n“Bibi, what the f–-k?” Biden yelled in July this year after an Israeli airstrike killed a top Hezbollah military commander and three civilians in Beirut, according to Woodward.\n\n“You know the perception of Israel around the world increasingly is that you’re a rogue state, a rogue actor,” the president said to Netanyahu.\n\nNetanyahu responded that the target was “one of the leading terrorists.”\n\n“We saw an opportunity and took it,” he said. “The harder you hit, the more successful you’re going to be in the negotiation.”\n\nVladimir Putin\n\n“That f–king Putin,” Biden raged to advisers soon after Russia’s invasion of Ukraine, according to Woodward. “Putin is evil. We are dealing with the epitome of evil.”\n\nWoodward reports that in the lead-up to the invasion, the US in October 2021 obtained intelligence which showed “conclusively” Putin’s plans to storm in with 175,000 troops.\n\n“It was as if [intelligence sources] had secretly entered the enemy commander’s tent and were hunched over the maps,” Woodward writes.\n\nWhile Biden and his advisers agreed the plan was “dead serious,” it was still hard to believe.\n\n“This would be so crazy …” Biden responded. “Jesus Christ Now I’ve got to deal with Russia swallowing Ukraine?”\n\nUkrainian President Volodymyr Zelensky dismissed the warnings, even after Vice President Kamala Harris told him in February 2022 that an invasion was imminent. After the meeting, Woodward writes, Harris said she was worried it might be the last time they ever saw Zelensky.\n\nBut by September 2022, “exquisite” US intelligence reports claimed that Putin was so desperate about battlefield losses in the war on Ukraine that there was a 50% chance he might use tactical nuclear weapons.\n\nThe book recounts a tense phone call between Defense Secretary Lloyd Austin and his Russian counterpart, Minister Sergei Shoigu, in October 2022.\n\nAccording to Woodward, Austin warned that nuclear war “would isolate Russia on the world stage to a degree you Russians cannot fully appreciate.”\n\n“I don’t take kindly to being threatened,” Shoigu responded.\n\n“Mr. Minister,” Austin reportedly said. “I am the leader of the most powerful military in the history of the world. I don’t make threats.”\n\nTwo days later, the Russians requested another call. This time, Shoigu claimed the Ukrainians were planning to use a “dirty bomb” — a false story the US believed the Kremlin was pushing as a pretext to deploy a nuclear weapon.\n\nStill, “it was probably the most hair-raising moment of the whole war,” Colin Kahl, a senior Pentagon official, later said of the episode.\n\nBarack Obama\n\nAhead of Russia’s February 2022 invasion of Ukraine, Biden blamed Obama for not stopping Putin’s 2014 annexation of Crimea.\n\n“They f–ked up in 2014,” Biden told a friend, according to Woodward. “That’s why we are here. We f–ked it up. Barack never took Putin seriously.”\n\nBiden added, “We did nothing. We gave Putin a license to continue!” Biden was angry: “Well, I’m revoking his f–-ing license!”\n\nDonald Trump\n\n“War” also reveals how then-President Donald Trump sent Putin a shipment of Covid-19 testing equipment for his personal use during the height of the pandemic.\n\n“Please don’t tell anybody you sent these to me,” Putin said to Trump, according to Woodward.\n\nWhen Trump replied he didn’t care, Putin told him: “I don’t want you to tell anybody because people will get mad at you, not me. They don’t care about me.”\n\nWoodward writes that Trump has stayed in touch with Putin after leaving office and details a moment at Trump’s Florida estate, Mar-a-Lago, where Trump allegedly told a senior aide to leave the room so “he could have what he said was a private phone call with Russian President Vladimir Putin.”\n\n“According to Trump’s aide, there have been multiple phone calls between Trump and Putin, maybe as many as seven in the period since Trump left the White House in 2021,” Woodward writes, although Trump aide Jason Miller denies this in the book.\n\nSaudi crown prince Prince Mohammed bin Salman\n\nAfter October 7, Secretary of State Anthony Blinken made a whirlwind trip through the Middle East, trying to negotiate humanitarian assistance for Gaza — only for Saudi Crown Prince Mohammed bin Salman to keep him up all night waiting for a meeting.\n\nWoodward quotes Blinken saying, “MBS was nothing more than a spoiled child.”\n\nThe book also recounts a meeting that Lindsay Graham had with the crown prince in March.\n\n“Hey, let’s call Trump,” Graham said to MBS while visiting with the Saudi leader in March.\n\nWoodward writes that bin Salman had an aide bring over a bag with about 50 burner phones, pulling out one labeled “TRUMP 45.” Among the others in the bag, Woodward writes, was a burner labeled “JAKE SULLIVAN” — Biden’s National Security Advisor.\n\nThe 2024 election\n\nWoodward writes how Trump’s decision to run for president again came after conversations with his golfing buddy, Sen. Lindsey Graham.\n\n“Going to Mar-a-Lago is a little bit like going to North Korea,” Graham said. “Everybody stands up and claps every time Trump comes in.”\n\nMeanwhile, the book claims, it was Blinken who broached the subject of Biden dropping out of the race during a private lunch on July 4.\n\n“I don’t want to see your legacy jeopardized. Anyone who is written about gets one sentence. That’s the legacy,” Blinken reportedly said. “If this decision leads you to staying in and winning reelection, great. If it leads to you staying in and losing reelection, that’s the sentence.”\n\nBlinken asked Biden: “Can you see yourself doing it for another four years? You’ve got to answer that question.”\n\n“War” also offers a glimpse into Harris’ private dealings with Biden as his VP. Woodward writes about her being concerned over Biden’s isolation.\n\n“I’m calling to ask you — to really beg you, actually — could you please talk to the president more than you talk to him?” Harris reportedly said on a call to one of Biden’s closest friends.\n\nThe friend told Harris, the books says that the president mainly called them to “swear freely about ‘what a f–king a–hole Joe Manchin is.’”","summary":"Furious Joe Biden regrets choosing Attorney General Merrick Garland to lead his Justice Department after the agency prosecuted his son Hunter, a new book claims.","url":"https://nypost.com/2024/10/08/us-news/joe-biden-rages-at-obama-putin-and-netnyahu-in-woodward-book/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2021-2022-medal-valor-recipients-11234734.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-08 23:01:45","author":"Sara Nathan","authors":["Sara Nathan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.264},{"id":258977074,"title":"Brazil Lifts Ban On Elon Musk's X, Ending Standoff Over Disinformation","text":"Brazil's Supreme Court said Tuesday it was lifting a ban on Elon Musk's social network X, which was blocked in its biggest Latin American market for over a month amid a row over disinformation.\n\n\"I authorize the immediate return of the activities\" of the social platform, Judge Alexandre de Moraes said in his ruling, after X settled millions of dollars in fines for failing to comply with a series of court orders.\n\nHe gave Brazil's communications regulator 24 hours to make the platform previously known as Twitter accessible again to its millions of Brazilian users.\n\nMusk had yet to react to the decision.\n\nMoraes has for months been embroiled in a standoff with the world's richest man, a self-declared \"free speech absolutist,\" over a flood of online disinformation related to Brazil's 2022 election campaign.\n\nOn August 31, the tensions came to a head when Moraes dramatically blocked X for failing to deactivate the accounts of dozens of supporters of former far-right president Jair Bolsonaro and to name a new legal representative in Brazil. \n\nThe row, which pitted freedom of expression against corporate responsibility, was closely watched worldwide.\n\nA furious Musk lashed out at Moraes by calling him an \"evil dictator\" and dubbing him \"Voldemort\" after the villain from the \"Harry Potter\" series.\n\nMoraes, for his part, accused the platform of undermining democracy by allowing disinformation to flourish -- a position backed by Brazilian President Luiz Inacio Lula da Silva, who declared that the state would not \"be intimidated by individuals, companies or digital platforms that believe themselves to be above the law.\"\n\nX eventually complied with all of Moraes's demands in order to have the suspension lifted.\n\nLast week, the judge confirmed that the company had also settled around $5.2 million in fines.\n\n- Biggest Latin American market -\n\nWith more than one mobile phone per inhabitant, Brazilians are among the most connected people in the world.\n\nX had 22 million users in the country before it was blocked.\n\nMany Brazilians, including Lula, migrated to other platforms such as Threads or Bluesky, the social media network created by Twitter co-founder Jack Dorsey.\n\nBut neither has come close to attracting the kind of audience enjoyed by X.\n\nX's fight with Moraes began during the October 2022 election, in which Bolsonaro failed to win a second term.\n\nIt escalated following attacks by Bolsonaro supporters on federal buildings in Brasilia after Lula's inauguration in January 2023.\n\nThe destruction by supporters of Bolsonaro, dubbed the \"Trump of the Tropics,\" drew comparisons with the January 2021 attacks by supporters of then US president Donald Trump on the US Capitol.\n\nHalfway through its suspension X briefly made a return in Brazil in mid-September, after a technical workaround which it claimed was \"inadvertent.\"\n\nBut it went back offline again after Moraes threatened it with more fines for non-compliance.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Brazil&apos;s Supreme Court said Tuesday it was lifting a ban on Elon Musk&apos;s social network X, which was blocked in its biggest Latin American market for over a month amid a row over disinformation.","url":"https://nation.lk/online/brazil-lifts-ban-on-elon-musk-s-x-ending-standoff-over-disinformation-279549.html","image":"https://c.ndtvimg.com/2024-08/nvneif7g_elon-musk_625x300_12_August_24.jpeg","video":null,"publish_date":"2024-10-08 23:00:12","author":null,"language":"en","source_country":"lk","sentiment":-0.311},{"id":258977938,"title":"Melania Trump Says Donald Is Warm, Fun and Makes Her Laugh","text":"Prime Day Deals on Kitchen Merch from Paris Hilton, Chrissy Teigen And More\n\nSkip to main content\n\nEmail Or Call (888) 847-9869\n\ndownload the app\n\nGoogle Play\n\nPrivacy Policy\n\nTerms of Use\n\nYour Privacy Choices\n\n© 2024 EHM productions, inc. all rights reserved.\n\nFrances Bean Cobain and Riley Hawk Take Newborn Son to Pumpkin Patch\n\nBaby on Board! 👶🍼 ... Prime Day Deals for New Parents!\n\nAnderson .Paak Sits on Toilet, Tries on Jewelry at Prince Purple Rain House Airbnb\n\nKiller Savings! Prime Day Deals on Gadgets & Electronics\n\nLisa Marie Presley Kept Dead Son Benjamin's Body at Home for 2 Months\n\nMelania Trump Says Donald Is Warm, Fun and Makes Her Laugh\n\nMelania Trump\nDonald's Warm, Fun\n... He Makes Me Laugh!!!\n\n10/8/2024 4:00 PM PT\n\nPlay video content\n\nTHE REAL DONALD\n\nMelania Trump's got nothing but nice things to say about her husband ... she says he has a great personality and is funny.\n\nThe former First Lady went on Fox News and was asked if she could share anything about Donald Trump that people don't know ... and her answer was interesting.\n\nLaunch Gallery\n\nMelania And Donald Together\n\nLaunch Gallery\n\nMelania says DT is a super great guy ... describing him as warm and fun ... two adjectives lots of folks don't necessarily associate with our former Commander in Chief.\n\nA quick scan of Trump's social media presence doesn't really give off the warm or fun vibe either ... but, Melania's saying that's what he's really like behind closed doors.\n\nLaunch Gallery\n\nMelania Trump Through The Years\n\nLaunch Gallery\n\nDonald's third wife says he's just a passionate guy who wants to make America safe ... and Melania feels he treats everyone equally, man or woman, and doesn't discriminate when he needs to get tough with somebody.\n\nIn other words, she's describing Trump in the exact opposite way of a lot of his haters.\n\nmelaniatrump.com\n\nMelania's promoting her memoir, titled \"Melania\" ... which she says is packed with other \"cute\" and \"nice\" stories about Donald.\n\nWho knew DT was a such a sweetheart. 🤷🏽‍♂️\n\nShare on Facebook\n\nrelated articles\n\nMelania Trump Says Donald Hit on Her While on a Date With Another Woman\n\nMelania Trump Defends Abortion Rights, Clashing With Donald's Shifting Stance\n\nMelania Trump Demands Answers Over Donald's Assassination Attempt\n\nMelania Trump Kisses Donald After RNC Speech, Or Does She?\n\nDonald Trump\n\nMelania Trump\n\nRelationships\n\nAbout TMZ.com\n\nPrivacy Policy\n\nTerms of Use\n\nYour Privacy Choices\n\ncontact tmz\n\nSend a Hot Tip\n\nAdvertising Inquiries\n\nMedia Inquiries\n\nYes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of Use\n\nSubscribe to TMZ newsletter\n\nDownload the TMZ App on the Apple App Store\n\nDownload the TMZ App on the Google Play Store\n\n© 2024 EHM productions, inc. all rights reserved.","summary":"Melania Trump's got nothing but nice things to say about her husband ... she says he has a great personality and is funny. The former First Lady went on Fox News and was asked if she could share anything about Donald Trump that people don't know&hellip;","url":"https://www.tmz.com/2024/10/08/melania-trump-says-donald-warm-fun/","image":"https://imagez.tmz.com/image/d2/4by3/2024/10/08/d2b3e967013e4d8db84045927ceb855c_xl.jpg","video":null,"publish_date":"2024-10-08 23:00:01","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","category":"politics","source_country":"US","sentiment":0.271},{"id":258979208,"title":"Trump kept secret contact with Putin post-presidency, book says","text":"WASHINGTON >> Former President Donald Trump has secretly spoken with President Vladimir Putin of Russia as many as seven times since leaving office, even as he was pressuring Republicans to block military aid to Ukraine to fight Russian invaders, according to a new book by journalist Bob Woodward.\n\nThe book, titled “War” and scheduled to be published next week, describes a scene in early 2024 at Mar-a-Lago, Trump’s estate in Florida, when the former president ordered an aide out of his office so he could conduct a phone call with Putin. The unidentified aide said the two might have spoken a half-dozen other times since Trump left the White House.\n\nThe book also reports that Trump, while still in office early during the COVID-19 pandemic in 2020, secretly sent Putin what were then rare Abbott Point of Care test machines for the Russian’s personal use. Putin, who has been described as particularly anxious about being infected at the time, urged Trump to not publicly reveal the gesture because it could damage the American president politically. “I don’t want you to tell anybody because people will get mad at you, not me,” Putin reportedly told him.\n\nThe disclosures raise new questions about Trump’s relationship with Putin just weeks before an election that will determine whether the former president will reclaim the White House. A copy of the book was obtained by The New York Times. The Washington Post, where Woodward has worked for more than half a century, and CNN, where he often appears as a commentator, also reported on the book today.\n\nWoodward, who rose to fame with his Watergate reporting and regularly produces bestselling books with explosive reporting based on access to high-level sources, attributed his account of the continuing communications between Trump and Putin to a single Trump aide who is not named in the book. The aide offered no specific details beyond saying there had been what Woodward characterized as “maybe as many as seven” contacts. There was no immediate independent confirmation today.\n\nTrump’s campaign dismissed Woodward’s book by assailing the author with typically personal insults — “a total sleazebag” who is “slow, lethargic, incompetent and overall a boring person with no personality” — without addressing any of the specifics reported in it.\n\n“None of these made-up stories by Bob Woodward are true and are the work of a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome,” Steven Cheung, the campaign communications director, said in the statement. Cheung said Trump did not give Woodward access for the book and noted that the former president was suing the author over a previous book.\n\nThe Kremlin likewise denied the reporting in Woodward’s book about conversations between Trump and Putin and the provision of COVID tests. “This is not true,” Dmitry Peskov, a spokesperson, said in a text message. “It’s a typical bogus story in the context of the pre-election political campaign.”\n\nWhile generally disputing Woodward’s account, the Trump campaign statement did not explicitly say whether the former president had spoken with Putin since leaving office and the campaign did not immediately respond to a question about that. But Trump’s oft-expressed affinity for the master of the Kremlin has long baffled even his own appointees, prompted investigations and troubled Republican national security specialists.\n\nU.S. intelligence agencies concluded that Putin had ordered the Russian government to intervene in the 2016 election to help Trump beat former Secretary of State Hillary Clinton, a conclusion that Trump rejected, suggesting that he believed Putin’s denial. While special counsel Robert Mueller did not find a criminal conspiracy that could be proved in court, he documented an unusual number of contacts between Russia and people in Trump’s circle during that campaign.\n\nSince leaving office, Trump has continued to praise Putin. He called the Russian leader a “genius” when Moscow invaded Ukraine in 2022 and since then has refused to say that Ukraine should win the war. He has criticized U.S. aid to Ukraine and leaned on congressional Republicans not to approve more assistance. He has boasted that if he wins he will negotiate an end to the war in Ukraine within 24 hours and do so even before the inauguration.\n\nTrump has not explained how he would do that, but possible terms described last month by his running mate, Sen. JD Vance, R-Ohio, sounded a lot like what Putin would want. Vance said that Russia could keep the Ukrainian territory it has seized by force in violation of international law and receive a “guarantee of neutrality” from Ukraine, which would not be allowed to join NATO.\n\nVice President Kamala Harris, in an interview on “60 Minutes” on Monday night, criticized Trump’s ties with Putin. “Right now, we are supporting Ukraine’s ability to defend itself against Russia’s unprovoked aggression,” she said. “Donald Trump, if he were president, Putin would be sitting in Kyiv right now. He talks about, ‘Oh, he can end it on day one.’ You know what that is? It’s about surrender.”\n\nWoodward’s book does not report what Trump and Putin discussed in the call in early 2024, nor does it provide details about the additional calls mentioned by the Trump aide. It quotes Jason Miller, a top campaign aide to Trump, saying that he had “not heard that they’re talking, so I’d push back on that.” But Miller also said that “I’m sure they’d know how to get in touch with each other” if they did want to talk.\n\nAvril D. Haines, the director of national intelligence appointed by President Joe Biden, hedged on the question when asked by Woodward. “I would not purport to be aware of all contacts with Putin,” she told him. “I wouldn’t purport to speak to what President Trump may or may not have done.”\n\nFormer presidents meet with foreign counterparts after leaving office from time to time. In fact Trump has hosted Prime Minister Benjamin Netanyahu of Israel, Prime Minister Viktor Orban of Hungary and others at Mar-a-Lago. But those meetings were publicly known, and Trump posed for pictures with his guests.\n\nIt would be highly unusual for a former president to privately talk with a top U.S. adversary like Putin without clearing it with the current administration — especially at a time when the United States and Russia are on opposite sides of a war in Europe. Biden has not spoken with Putin since the invasion of Ukraine.\n\nThis article originally appeared in The New York Times.\n\n© 2024 The New York Times Company","summary":"WASHINGTON >> Former President Donald Trump has secretly spoken with President Vladimir Putin of Russia as many as seven times since leaving office, even as he was pressuring Republicans to block military aid to Ukraine to fight Russian invaders, according to a new book by journalist Bob Woodward.","url":"https://www.staradvertiser.com/2024/10/08/breaking-news/trump-kept-secret-contact-with-putin-post-presidency-book-says/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241008_brk_put01.jpg","video":null,"publish_date":"2024-10-08 23:00:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"US","sentiment":-0.133},{"id":258976906,"title":"New York Times poll says Kamala Harris is leading Donald Trump by three points","text":"Democratic White House candidate Kamala Harris is leading her Republican rival Donald Trump by three points, according to a New York Times poll released on Tuesday, October 8th, four weeks before the US election.\n\nThe 59-year-old Democratic vice president has 49 percent of voting intentions nationwide, compared to Trump’s 46 percent.\n\nThe candidate has won the support of 9 percent of Republicans, according to the poll conducted with Siena College.\n\nHarris is trying to win over a part of this electorate based on the hypothesis that some moderate Republicans do not want another presidency of the 78-year-old billionaire.\n\nLast week, the Democrat held a rally with former Republican congresswoman Liz Cheney, repudiated by Trump.\n\nOn Tuesday, she reiterated her intention to name a Republican to her cabinet if she is elected in the presidential elections on November 5.\n\nThe latest New York Times poll, published in mid-September, found the two candidates tied at 47 percent nationally.\n\nBut U.S. presidential elections are held by indirect universal suffrage, so the outcome depends on a handful of closely contested states where the candidates are tied.\n\nThe New York Times poll questioned 3,385 voters nationwide between September 29 and October 6. The margin of error is about 2.4 points.\n\nTYT Newsroom","summary":"Democratic White House candidate Kamala Harris is leading her Republican rival Donald Trump by three points, according to a New York Times&#8230;\n\n\nThe post New York Times poll says Kamala Harris is leading Donald Trump by three points first appeared on The Yucatan Times.","url":"https://www.theyucatantimes.com/2024/10/new-york-times-poll-says-kamala-harris-is-leading-donald-trump-by-three-points/","image":"https://www.theyucatantimes.com/wp-content/uploads/2024/09/harris-trump-handshake_.jpg","video":null,"publish_date":"2024-10-08 23:00:00","author":"Yucatan Times","authors":["Yucatan Times"],"language":"en","category":"politics","source_country":"mx","sentiment":-0.007},{"id":258978534,"title":"‘Nostradamus’ reveals if ‘October surprise’ will change his pick of Harris or Trump winning","text":"Historian Allan Lichtman (left) last month predicted that Vice President Kamala Harris (right) would beat ex-President Donald Trump (center) in the November election (Pictures: AP/YouTube)\n\nThe ‘Nostradamus’ who correctly called almost every US presidential election over four decades recently revealed if Kamala Harris or Donald Trump will win the 2024 contest.\n\nHistorian and American University professor Allan Lichtman, 77, last month predicted that Harris will triumph over Trump, based on his 13 keys to the White House.\n\nWeeks later on Friday, Lichtman was asked if an ‘October surprise’ – which is an unexpected development or scandal a month before the election – would sway his pick. \n\n‘One of the greatest myths of American politics is the October surprise,’ Lichtman told CNN’s Michael Smerconish on SiriusXM. \n\nFormer President Donald Trump was historian Allan Lichtman’s pick to win the 2016 election (Picture: Getty Images)\n\n‘I have never changed my prediction in response to an October surprise because the keys gauged the big picture of incumbent governance in strength and don’t sway by the events of the campaign.’\n\nLichtman’s keys are based on 120 years worth of presidential election results and determined through simple true or false answers to the performance of the party in the White House at the time. They are not based on polling.\n\nThe keys are: Midterm gains, incumbency, primary contest, third party, short-term economy, long-term economy, policy change, social unrest, White House scandal, incumbent charisma, challenger charisma, foreign policy failure and foreign policy success.\n\nSix false keys would indicate that Harris will lose. \n\nVice President Kamala Harris is historian Allan Lichtman’s pick to win the 2024 election (Picture: Reuters)\n\nIn early September, Lichtman had Harris losing three keys – midterm gains, incumbency and incumbent charisma. He did not call the foreign policy failure and foreign policy success keys, but said that if Harris lost both, she would still only have five false keys.\n\n‘Even if both foreign policy keys flipped false, that would mean that there were only five negative keys, which would not be enough for Donald Trump to regain the White House,’ Lichtman told The New York Times at the time. \n\nLichtman, who has correctly predicted nine out of 10 recent elections, has faced criticism on his latest pick including from prognosticator and FiveThirtyEight founder Nate Silver.\n\nHistorian and American University professor Allan Lichtman said an ‘October surprise’ will not change his 2024 election prediction (Picture: Getty Images)\n\nAfter exchanging verbal shots at each other, Lichtman in a video titled ‘Burying the Hatchet with Nate Silver’ on September 30 said: ‘Once I make my final prediction, I don’t actually change that prediction. \n\n‘So we can each do our own thing and respect one another for doing it.’\n\nLichtman was among the few who predicted that Trump would win the 2016 election. His October surprise theory survived the test then, as Trump’s ‘grab ’em by the p****’ remark emerged in an Access Hollywood tape obtained by The Washington Post. Still, Trump won the election.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"The 'Nostradamus' who correctly called almost every US presidential election recently revealed if Kamala Harris or Donald Trump will win.","url":"https://metro.co.uk/2024/10/08/nostradamus-reveals-surprise-will-change-harris-trump-win-21760842/","image":"https://metro.co.uk/wp-content/uploads/2024/10/SEC_224942858-6aee.jpg?quality=90&strip=all","video":null,"publish_date":"2024-10-08 22:59:53","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","source_country":"gb","sentiment":-0.19},{"id":258977552,"title":"Mexico Needs Private Investment in Energy, Economy Minister Says","text":"In the interview, Ebrard portrayed Mexico as investor-friendly and ready to do business, especially with its northern neighbor. \n\n“We need to be very close to the CEOs of the companies. We need to really put on the table the informational content for the decisions that they are going to take,” he said. “We need some sort of trust and friendly approach. We need to work more closely with them in the next six years to be more successful in our main goals.” \n\nHe said one of the administration’s goals is to reduce its reliance on imports from China and other parts of Asia, a message that could play well with both US presidential candidates. That could be addressed in part by buying more products from the US and Europe, Ebrard said. “We are importing a lot of things from China and also Vietnam, and there is no reason for that,” he said.\n\nAt the same time, Mexico would seek to avoid tariffs on its exports. That’s something that Republican presidential candidate Donald Trump has at times floated during his campaign, often referring to Chinese products that enter the US through Mexico. Under President Joe Biden, the US trade office has pressured Mexico to not be a conduit for reduced-price Chinese goods, including steel.\n\nWe need to make “common-sense decisions about the competition with China, to not have disordered tariff policies between Mexico, Canada and the United States,” Ebrard said.","summary":"Mexico’s new president plans to lay out clear rules for private investment in the power sector, a top cabinet official said, acknowledging that the state has insufficient resources to expand renewable energy use and address electricity supply and distribution problems.","url":"https://financialpost.com/pmn/business-pmn/mexico-needs-private-investment-in-energy-economy-minister-says","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/776162676.jpg","video":null,"publish_date":"2024-10-08 22:59:07","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":-0.01},{"id":258976958,"title":"Fox News to Launch New Spanish-Language Show","text":"Fox News Media seems to be aiming at a new demographic with the upcoming launch of a Spanish-language news show called “Fox Noticias.”\n\nThe hour-long show, which will appear on the Spanish-language sports channel Fox Deportes, is intended to be a forum that “spotlights issues impacting the Hispanic community” and will be hosted by Fox & Friends Weekend host Rachel Campos-Duffy, Axios reported.\n\nIts debut episode on Oct. 15 will feature the recently elected president of Panama, Raúl Mulino, along with sports highlights from the recent matches broadcast on Fox Deportes.\n\n“I am beyond grateful for the opportunity to host ‘Fox Noticias,’” said Campos-Duffy, who is Mexican-American. “As the fastest growing electorate, accounting for nearly 20% of the population, the Hispanic American community is thriving, and I am proud to bring a new show that breaks down the news of the day with a focus on the kitchen table issues that matter most to our community.”\n\nThe politically conservative Fox News has historically reached a largely white audience, but it says it has experienced significant growth among Hispanic viewers in its most recent quarter, reportedly reaching 36 percent of all Hispanic cable-news viewers.\n\nThe new program arrives soon after a recent poll found that GOP nominee Donald Trump—whom the network spends much time praising—is doing better with Latino voters than any Republican candidate for president in the past 12 years. His Democratic opponent, Kamala Harris, has the support of 54 percent of registered Latinos, with Trump at 40 percent.\n\nThat poll mirrors a broader trend over the past several election cycles of the historically Democrat-leaning group drifting toward the Right—and Trump.\n\nAhead of the general election in less than a month, Harris and Trump find themselves battling for Latino voters in key battleground states.","summary":"John Lamparsk/GettyFox News Media seems to be aiming at a new demographic with the upcoming launch of a Spanish-language news show called “Fox Noticias.”\n\nThe hour-long show, which will appear on the Spanish-language sports channel Fox Deportes, is intended to be a forum that “spotlights issues impacting the Hispanic community” and will be hosted by Fox & Friends Weekend host Rachel Campos-Duffy, Axios reported.\n\nIts debut episode on Oct. 15 will feature the recently elected president of Panama, Raúl Mulino, along with sports highlights from the recent matches broadcast on Fox Deportes.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/fox-news-to-launch-new-spanish-language-show-hosted-by-rachel-campos-duffy","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2910,w_5174,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1728424926/GettyImages-2101861846_ipdry1","video":null,"publish_date":"2024-10-08 22:46:08","author":"Liam Archacki","authors":["Liam Archacki"],"language":"en","source_country":"US","sentiment":0.293},{"id":258976636,"title":"Millions in Florida warned homes could become coffins when Hurricane Milton hits","text":"The south-eastern US state of Florida is bracing for what could be its worst storm in a century as Hurricane Milton rumbles toward its west coast.\n\nMore than 1 million people in the Tampa Bay area were ordered to evacuate their homes on Tuesday after the system rapidly intensified to a category five storm — the highest level.\n\nThe United States National Hurricane Center has forecast storm surges — an abnormal rise of sea level — of 3 metres to 4.5m along the coastline north and south of Tampa Bay, and 127 millimetres to 254mm or more of rainfall, followed by flash flooding.\n\nA direct hurricane hit on the bay would be the first since 1921.\n\nFlorida Governor Ron DeSantis said: \"Basically the entire peninsula portion of Florida is under some type of either a watch or a warning.\" \n\nWhen will Hurricane Milton hit?\n\nThe hurricane centre expects Milton to make landfall on Wednesday night, local time.\n\nIt was expected to hit as a category three storm, but on Tuesday it regained power to again become a category five with maximum sustained winds of 270 kilometres per hour.\n\nMilton's centre would fall somewhere in the Tampa Bay, which has a population of 3.3 million people. The total area placed under hurricane warnings is home to more than 9.3 million residents.\n\nThe densely populated areas of Tampa city, St Petersburg, and Clearwater fall within this zone, though the storm will likely remain powerful as it moves across the state.\n\n\"Fluctuations in intensity are likely while Milton moves across the eastern Gulf of Mexico, but Milton is expected to be a dangerous major hurricane when it reaches the west-central coast of Florida Wednesday night,\" the hurricane centre said.\n\nMore than a dozen coastal counties issued mandatory evacuation orders, including Tampa's Hillsborough County. Pinellas County, which includes St Petersburg, ordered the evacuation of more than 500,000 people. Lee County said 416,000 people lived in its mandatory evacuation zones.\n\nTampa Mayor Jane Castor warned residents not to try to ride out the storm.\n\nMotorists waited to fill their tanks in lines snaking around petrol stations, with bumper-to-bumper traffic choking roads leading out of Tampa.\n\nAs of Tuesday afternoon, local time, nearly 900 domestic and international flights in the US were delayed and about 700 cancelled. More than 1,500 flights scheduled for Wednesday had already been cancelled, according to flight-tracking data provider FlightAware.\n\nAfter making landfall, Milton is forecast to remain extremely dangerous, causing catastrophic damage and power outages lasting days.\n\nAs of the hurricane centre's latest advisory on Tuesday afternoon, local time, the hurricane was located about 775km south-west of Tampa.\n\n'Matter of life and death'\n\nUS President Joe Biden said on Tuesday he would postpone a trip to Germany and Angola and remain at the White House to monitor Milton. \n\nHe warned it \"could be one of the worst storms in 100 years to hit Florida\", urging those in the storm's path to heed local evacuation orders immediately.\n\n\"You should have already evacuated,\" Mr Biden said on Tuesday. \n\nThe scale of the federal government storm preparation and response was being expanded, he added.\n\nLess than two weeks ago, Hurricane Helene hit Florida's Gulf Coast's barrier islands and beaches, sweeping away tonnes of sand, knocking down dunes and blowing away dune grass. Meteorologists say that could exacerbate Milton's storm surge.\n\nMr DeSantis said trucks had been working 24 hours a day to remove mounds of debris left by Helene for fear Milton could turn them into dangerous projectiles, with 5,000 personnel already helping with clean-up efforts and a further 3,000 on hand for the storm's aftermath.\n\nRelief efforts remain ongoing throughout much of the south-eastern US in the wake of Helene, which made landfall in Florida on September 26 and killed at least 230 people across six states along with causing billions of dollars in damage.\n\nStorm relief efforts have emerged as a political battleground ahead of the US presidential election on November 5.\n\nRepublican candidate Donald Trump has tapped into frustration about the emergency response after Helene and fuelled it with disinformation about disaster-allocated funds being spent on migrants.\n\nHelene was the deadliest natural disaster to hit the US mainland since 2005's Hurricane Katrina, and the death toll is still rising.\n\nABC with wires","summary":"Hurricane Milton is set to make landfall on Florida's west coast as a powerful and extremely dangerous category five storm.","url":"https://www.abc.net.au/news/2024-10-09/hurricane-milton-could-be-floridas-worst-storm-in-century/104448006","image":"https://live-production.wcms.abc-cdn.net.au/0d5ceb94d7c4d63d771aa3c714356ace?impolicy=wcms_crop_resize&cropH=2246&cropW=3993&xPos=0&yPos=151&width=862&height=485","video":null,"publish_date":"2024-10-08 22:45:22","author":"ABC News","authors":["ABC News"],"language":"en","source_country":"AU","sentiment":-0.486},{"id":258976338,"title":"Mayor of Aurora, Colorado Welcomes Visit by Donald Trump","text":"The mayor of a town that made headlines when members of the Venezuelan gang Tren de Aragua allegedly took over apartment buildings has welcomed a visit by former President Donald Trump.Aurora, Colorado, Mayor Mike Coffman said Tuesday that the visit this coming Friday would be an opportunity to put an end to some of the \"exaggerated\" stories about the gang's impact.Trump announced Monday that he would be holding a rally in what had become a \"war zone\" because of Vice President Kamala Harris' open border policies.The Republican presidential candidate has frequently spoken about Aurora as an example of the ways he says the current administration's policies have failed, in a similar way to his unfounded claims about Haitian migrants in Springfield, Ohio.\"Former President Trump's visit to Aurora is an opportunity to show him and the nation that Aurora is a considerably safe city – not a city overrun by Venezuelan gangs,\" Coffman said in a statement Tuesday afternoon. \"My public offer to show him our community and meet with our police chief for a briefing still stands.\"Trump claims at the end of August that the city, close to Denver, had been overrun by criminal migrant gangs after a video showing violence in an apartment building went viral and claims were made that TdA members had taken over the complex.At the time, Coffman told Newsweek that there were concerns about criminal activity, but these had been blown out of proportion when Aurora had supported Venezuelan migrants for many years.\"So, it's my understanding that when you do have a concentration of Venezuelan migrants, sometimes, sadly, that criminal element follows and exploits them within their own immigrant communities,\" he said.A few weeks later, the city's police department identified ten members of the gang who had allegedly caused problems for many months.\"The reality is that the concerns about Venezuelan gang activity have been grossly exaggerated,\" Coffman said Tuesday. \"The incidents were limited to several apartment complexes in this city of more than 400,000 residents.\"The TdA began as a prison gang in Aragua, Venezuela, before expanding rapidly in recent years, according to the U.S. State Department, focusing on human trafficking and other abuses of desperate migrants.The focus on Aurora appeared to have moved on in recent weeks, with Trump and his running mate, Ohio Senator JD Vance, turning their attention to Springfield and accusations that Haitian immigrants were eating pets. Local officials and community leaders repeatedly debunked those claims.Trump later promised he would visit both cities, saying his mass deportation plan would begin here, but he called off the visit to Ohio after pushback from leaders.Friday's planned visit, including a rally at the Gaylord Rockies Resort & Convention Center at 1 p.m. MDT, will bring the focus back onto Aurora.\"Kamala's border bloodbath has made every state a border state, leaving Colorado families at the mercy of criminals,\" the Trump campaign said in its announcement. \"The only solution to stop the border crisis is to elect President Trump, who will secure the border, deport dangerous criminals, and Make America Safe Again.\"","summary":"The city has been impacted by the gang Tren de Aragua, but Mayor Mike Coffman said stories have been \"greatly exaggerated.\"","url":"https://www.newsweek.com/aurora-colorado-donald-trump-visit-venezuelan-gang-immigrants-1966075","image":"https://d.newsweek.com/en/full/2490699/donald-trump-butler-pa.jpg","video":null,"publish_date":"2024-10-08 22:44:24","author":"Dan Gooding","authors":["Dan Gooding"],"language":"en","category":"politics","source_country":"US","sentiment":-0.105}]}