{"offset":0,"number":50,"available":7025,"news":[{"id":277206008,"title":"Jimmy Carter’s conservation legacy - POLITICO","text":"In an interview with Alaska magazine in 2017, Carter recalled how he was “despised” while attending a state fair in Alaska during his presidency.\n\n“The Secret Service decided to double my protection because of the animosity toward me in Alaska, but I enjoyed getting out in the boondocks and fishing,” he told the magazine.\n\nAfter Carter designated the monuments, a group of Alaskans repeatedly protested the move as federal overreach that would harm the local economy. Steiner recalled how Carter was even burned in effigy. \n\nBut Steiner said Carter later prevailed in winning passage of “the most spectacular land conservation deal in U.S. history,” a deal that wound up creating a multibillion-dollar tourism industry for Alaska and helped win over many skeptics.\n\n“Without ANILCA, all of these lands and waters that the world considers global treasures would have been probably changed forever, and for the worse,” Steiner said. \n\nCarter paid close attention to Alaska throughout his post-presidency, which lasted nearly 43 years.\n\nIn 2022, at the age of 97, he sided with conservation groups in filing a legal brief to oppose a land swap approved by Interior Secretary David Bernhardt under former President Donald Trump that would have allowed construction of an 11-mile gravel road through the Izembek National Wildlife Refuge in Alaska. Fearing the move could lead to the unraveling of ANILCA, Carter urged the full 9th U.S. Circuit Court of Appeals to reconsider the case after a smaller three-judge panel led by two Trump-appointed judges cleared the way for the road’s construction. Carter said he wanted to defend “the unrivaled wilderness in the national public lands of Alaska.”\n\nRaskin, whose organization was one of many that joined in the lawsuit to sue Bernhardt, said that having Carter weigh in on the case “made all the difference in the world because it got the attention of the 9th Circuit.” The full court decided to vacate the ruling by the smaller panel.\n\nCarter’s involvement in the Izembek case irked proponents of the road, who said it is needed to help provide the Aleut people in the isolated community of King Cove with access to medical care.\n\nAlaska Republican Sen. Lisa Murkowski, one of the leading critics, said Carter was “strangely confident” in thinking he knew what was best for Alaskans.\n\n“Perhaps he should walk a mile in their shoes, by departing his comfortable home and living there for a while, to see what it is like to be without reliable access to emergency care,” she said.\n\nUnderscoring how complicated conservation decisions can be in Alaska, the Fish and Wildlife Service under the Biden administration in November approved a plan for a land swap that could eventually lead to development of the road. The decision came two years after Interior Secretary Deb Haaland visited residents of King Cove to hear about their frequent difficulty getting to a nearby all-weather airport, which can fly sick people out to hospitals in Anchorage. \n\nOn Sunday, Murkowski posted a short tribute to Carter on the social media platform X that did not mention any disagreements over Alaska policies. \n\n“President Jimmy Carter will be remembered for his service to our nation and his post-presidency dedication to humanitarian efforts across the globe,” she wrote. “He led a remarkable life and left a legacy of peace.”\n\nFighting ‘the power of big oil and developers’\n\nBefore Sen. Edward “Ted” Kennedy decided to challenge Carter for the Democratic presidential nomination in 1980, Carter famously promised to “whip his ass” if he tried.\n\nAnd he did just that, before losing in a landslide in the general election to Ronald Reagan.","url":"https://www.politico.com/news/2024/12/30/jimmy-carters-conservation-legacy-00115771","image":"https://www.politico.com/dims4/default/68011e5/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F16%2Fb7%2Fe9a712974b60b690b53f6ecb5fc6%2Falaska-refuge-road-85878.jpg","video":null,"publish_date":"2024-12-31 01:08:50","author":"Rob Hotakainen","authors":["Rob Hotakainen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.243},{"id":277206006,"title":"Carter to lie in state at the Capitol - Live Updates - POLITICO","text":"Former President Jimmy Carter will lie in state in the U.S. Capitol's rotunda at the invitation of congressional leaders, the Carter Center announced Monday. The memorial services and honors for the former president are expected to span several days and include public events in Atlanta and Washington, followed by a private burial ceremony in his hometown of Plains, Georgia. Carter’s remains will lie in state from the afternoon of Jan. 7 to the morning of Jan. 9. President Joe Biden has already announced a proclamation declaring a National Day of Mourning on Jan. 9, when the large public funeral service is scheduled in Washington. He also ordered U.S. flags to be flown at half-staff for 30 days on federal buildings, military posts and naval stations, as well as all naval vessels. It is customary for the Capitol to be open around the clock to allow visitors to pay respects to former presidents. At the conclusion of the public viewing, Carter’s body would then be taken to the state funeral, likely at the National Cathedral. Since Congress approved the cathedral’s charter in 1893, nearly all memorial services for U.S. presidents have been held there. “We’re going to do a major service in Washington, D.C.,” Biden said Sunday. “That’s a formal procedure that’s underway.” A concurrent resolution is required from the House and Senate to approve the use of the rotunda and the Lincoln catafalque for a lying-in-state ceremony. Those could be taken up this week and are usually cleared without controversy or objection. “We will move forward with these arrangements so that the American people have the opportunity to pay their respects to President Carter before he is laid to rest,” House and Senate leaders from both parties wrote in a message to Carter’s son James Carter III and the Carter Center. Capitol Hill is heading into a month of heightened security with both the certification of the presidential election results on Jan. 6 and President-elect Donald Trump’s inauguration on Jan. 20 designated as national special security events. Fencing is already going up around the Capitol complex in anticipation of those events. The elevated security posture may impact how the public is allowed to enter the Capitol to pay respects to Carter. The last former president to lie in state was George H.W. Bush in 2018, which drew thousands of mourners. Capitol security and operations personnel are familiar with hosting major events in shifting circumstances. Multiple lying-in-honor ceremonies were held during the Covid-19 pandemic.","url":"https://www.politico.com/live-updates/2024/12/30/congress/jimmy-carter-capitol-honor-lying-in-state-funeral-00196127","image":"https://www.politico.com/dims4/default/9876c5f/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fb8%2Fe7%2F2ffe13bc4204b0ecec60e6edbb1a%2Fcapitol-buildling-at-night-capitol-hill-42964.jpg","video":null,"publish_date":"2024-12-31 01:08:50","author":"Katherine Tully-McManus","authors":["Katherine Tully-McManus"],"language":"en","category":"politics","source_country":"us","sentiment":0.04},{"id":277206000,"title":"Elaine Chao's advice for Trump's Labor and Transportation secretaries - Live Updates - POLITICO","text":"Nothing much surprised Elaine Chao when she was named secretary of Labor by former President George W. Bush or secretary of Transportation during Donald Trump’s first term. That’s because she had served in other cabinet positions — and has been vetted five times by the FBI. So she knew the ropes. Chao, whose husband is Sen. Mitch McConnell, isn’t working for Trump this time around, but she has thoughts on what his next administration should be paying attention to. What advice do you have for the next Cabinet secretaries in your positions? No. 1, personnel is policy. No. 2, communicate, communicate, communicate — within the department, as well as with the outside world. It's important to communicate internally so that everybody in the department understands the priorities of the secretary. And No. 3, scheduling. It’s important, because how the secretary spends his or her time is an implicit signal to the organization and the outside stakeholders about your priorities. What’s one thing you didn't know that you wish you did before you got into the job? Before I was secretary of Labor or secretary of Transportation, I was deputy secretary of Transportation. So, there’s not much that surprised me. I was pretty prepared. I do remember that as a deputy, I was drinking from a fire hydrant every single day. It was very, very stressful. By the time I became secretary, I was totally prepared. Experience helps. ... I did learn about the breadth of the Labor Department and how its actions impact every single workplace in America. What do you see as the biggest obstacle facing the next administration? The Surface Transportation Reauthorization Act will expire in 2026 just before the midterm elections. It's going to be a big issue, and they've got to be ready for it. … I also expect consumer acceptance of EVs to keep growing, so I question the effectiveness of relying only on the gasoline tax to fund the Highway Trust Fund that repairs and maintains our national highway system and also the transit system. Where did you go to have a meltdown? The days seem like a pressure cooker, but I would tell appointees that the days are long but the years are short. I’m from an immigrant family, and I was so grateful to be able to give back to this country, and if I had to work extra hard, that was my privilege. Want more? Former Transportation Secretary Ray LaHood says career staffers keep the wheels turning.","url":"https://www.politico.com/live-updates/2024/12/30/congress/donald-trump-cabinet-elaine-chao-00195898","image":"https://www.politico.com/dims4/default/5468ae0/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F28%2F9d%2F8c3c85864570925f805fb5efab0e%2Fqanda-transition-template-chao.jpg","video":null,"publish_date":"2024-12-31 01:08:50","author":"Shia Kapos","authors":["Shia Kapos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.134},{"id":277205882,"title":"Unpopular Take: With Such a Slim Majority It Doesn't Matter Who the Speaker Is","text":"Thank you, President Trump! I’m honored and humbled by your support, as always.Together, we will quickly deliver on your America First agenda and usher in the new golden age of America.The American people demand and deserve that we waste no time. Let’s get to work! 🇺🇸 pic.twitter.com/ljGrB08dRh— Speaker Mike Johnson (@SpeakerJohnson) December 30, 2024\n\nI held this position back when Johnson was chosen over Kevin McCarthy, and I stand by that conclusion. As frustrated as Republicans were over McCarthy's compromises, I didn't believe then and don't believe now that a Republican Speaker of the House with only a slim majority has any room to maneuver. \n\nMcCarthy's ouster in October 2023 led to three weeks of chaos and after all the sturm and drang pretty much nothing changed, and nothing changed because the problem the Republicans had was not who sat in the Speaker's chair but the divisions within the Republican caucus themselves. \n\nIn other words, it took so long to pick a Speaker because Republicans have fundamental disagreements with each other about political and policy strategies, and replacing the Speaker did nothing to change that fact. \n\nYou could put Jim Jordan or Thomas Massie in the Speaker's chair, and it would only make the most marginal of differences if it made any difference at all. In order to pass any bill, you need the votes to do so, and without near unanimity among Republicans, the votes won't be there for policies opposed by either the moderates or the conservatives--unless the Speaker cuts a deal with the Democrats. \n\nEven Donald Trump--who right now stands as a colossus among all other figures in the world--can only push the Republicans in Congress so far. He can make demands, but there are Republicans who stand on \"principle\" who will not buckle, while others in the caucus will not bow to demands they consider either wrong or politically toxic. \n\n🚨 JUST IN: President Trump just BLASTED Kevin McCarthy for pushing the debt ceiling fight out of Biden’s term and into Trump’s while he was SpeakerTrump says this “will go down as one of the DUMBEST political decisions made in years.”In reality, our CURRENT Speaker Johnson… pic.twitter.com/1ju7KGylqU— Nick Sortor (@nicksortor) December 29, 2024\n\nWhich is why we will face another debt ceiling crisis in a few months. Trump wanted to avoid battles over the debt ceiling in the first years of his term, but once again will be drawn into a battle that is a sure loser just as he is fighting to cut government spending and bureaucracy. \n\nIn the medium term, the ballooning debt is a crisis that could destroy our economy, but it's hard to see how having a big fight about it in the first months of the Trump administration will make addressing the debt any easier. The deficit is $2 trillion +/- and it won't get to zero by March, no matter what Trump does. \n\nU.S. hits debt ceiling just as Trump is inaugurated? They’re handing him a ticking time bomb.Same playbook as Canada’s Liberals:$600B added to the deficit$62B deficit this year aloneWhen the new govt takes over, they’ll inherit an economic dumpster fire. 🔥 it’s sabotage. pic.twitter.com/E0SRd41Cq0— Marc Nixon (@MarcNixon24) December 29, 2024\n\nYou can thank Joe Biden for that, not Kevin McCarthy, Mike Johnson, or anybody else in Congress. There simply weren't the votes to do anything about it, and it's not clear there will be anytime soon--although Trump is right, the alternative is too awful to contemplate. \n\nTrump has endorsed Johnson for Speaker again. But the GOP majority will be 5 (and less than that to start). Some (not sure exactly how many) House GOPers will never vote for Johnson. And that's before getting to the problem of...raising the debt ceiling. https://t.co/OT1iiYPST5— Aaron Astor (@AstorAaron) December 30, 2024\n\nThe problem any Speaker of the House faces is not his own ideological preferences being too liberal or too conservative for members of his party but that there are too few members for him to get enough votes for any rational policy at all. Move too far one way and you lose votes; move too far the other way, and you lose votes. Stay the course? Lose votes. \n\nTrump's victory solves a lot of problems, but not the iron laws of math: getting a majority for any bill of consequence in Congress is an almost impossible task. \n\nIf the voters want to support Trump, they should focus their ire on members of Congress who stand in his way rather than blame the Speaker of the House. He can't change the votes of members, but perhaps we can.","url":"https://hotair.com/david-strom/2024/12/30/unpopular-take-with-such-a-slim-majority-it-doesnt-matter-who-the-speaker-is-n3798344","image":"https://media.townhall.com/cdn/hodl/2024/197/dd42281a-f197-42fe-a379-ec1cbdd135fd.jpg","video":null,"publish_date":"2024-12-31 01:07:51","author":"David Strom","authors":["David Strom"],"language":"en","source_country":"us","sentiment":-0.384},{"id":277205884,"title":"Biden: I Shoulda Been The Contendah!","text":"Whose fault was that? And what does that say about Biden's strategic and tactical thinking? \n\nNow Biden apparently wants to retcon 2024, at least among aides, family members, and caretakers. In the middle of the Washington Post's attempt to polish the Biden, ahem, legacy, comes this expression of regret over having handed over the reins to his own hand-picked successor:\n\nBiden and some of his aides still believe he should have stayed in the race, despite the rocky debate performance and low poll numbers that prompted Democrats to pressure him to drop out. Biden and these aides have told people in recent days that he could have defeated Trump, according to people familiar with their comments, who spoke on the condition of anonymity to describe private conversations. Aides say the president has been careful not to place blame on Harris or her campaign.\n\nWhy would anyone blame Harris rather than the man who made it impossible to challenge her? Had Biden simply withdrawn without interfering in a replacement process, Democrats might have chosen to put the nomination up for grabs in a competitive open convention. Her decisive loss resulted directly from that one last incompetent campaign strategy.\n\nI say \"might\" because even without Biden's insistence on pushing her as the replacement, Kamala Harris was still the path of least resistance. She had a clearer title to the funds already raised for the ticket, although Democrat attorneys would have likely pried those loose quickly. Democrats also feared even more debate on the previous three-plus years of catastrophic incompetence, but perhaps feared even more a very public debate over Biden's incompetence and the cover-up in which Harris participated.\n\nWe'll get to Biden's counterfactual in a moment. The response from Democrats is every bit as fatuous as Biden's claim, however:\n\nBut many Democrats blame Harris’s loss on Biden’s insistence in staying in the race so long that by the time he withdrew, Harris had little more than three months to campaign. Others contend that Biden undermined his own message by trying to hold onto the presidency rather than pave the way for a younger group of anti-Trump Democrats who could take the country into the future.“Biden ran on the promise that he was going to be a transitional president, and in effect, have one term before handing it off to another generation,” Sen. Richard Blumenthal (D-Connecticut) said. “I think his running again broke that concept — the conceptual underpinning of the theory that he would end the Trump appeal, he would defeat Trumpism and enable a new era.”\n\nWell, whose fault was that? Democrats went so all-in on Biden's re-election that they deliberately cooked the primaries to avoid a competitive primary that would have clarified the matter. Right up to June 27, the Democrat Party line was that Biden was \"sharp as a tack,\" fit for a second term and necessary to \"save democracy,\" and that any suggestion otherwise was the result of \"cheap fakes\" and Biden's childhood stutter.\n\nWhere was Blumenthal during that entire time? Where were any Democrats who now say that Biden shouldn't have run for a second term, or that now admit that Biden was cognitively impaired throughout his presidency? Dean Phillips would certainly like an answer to that question after being practically the only Democrat to declare that the emperor wore no clothes:\n\nDean Phillips has some regrets. Not about his decision to launch a quixotic primary challenge to President Joe Biden. He stands by that move, which alienated him from his party even as it proved prescient after Biden’s disastrous debate with Donald Trump.But in an exit interview with POLITICO Magazine, the retiring Minnesota Democrat said he wished he had been more successful at fixing what he says is a deeply broken Congress and that he could have delivered more for his constituents. And he made clear he was leaving Capitol Hill extraordinarily frustrated with his party.“We are totally devoid of leadership. We are rudderless,” he said.\n\nAllow me to provide a clarification: Democrats are totally devoid of legitimate leadership. We still have no idea who's been running the White House over the past four years. It clearly hasn't been Joe Biden, who spent nearly half his time on Rehoboth Beach and a large portion of what remains out of sight and out of reach of the press. Was it Jill Biden? Hunter? The Obamas, or their clique? We may never know, especially with the propaganda industry that is the Protection Racket Media.\n\nSo now let's get to the claim in this hagiographic WaPo piece. Would Biden have beaten Trump had he remained on the ticket? Almost certainly not, especially if Biden had to do another debate. One look at the polling before and after June 27 shows that Biden had fallen behind by a significant margin even without accounting for the underestimation of Trump's swing-state strength. Biden hadn't had a lead since October 2023 in the aggregate polling. which is why Biden insisted on trying to bully Trump into an early debate. He'd hoped to use the Manhattan conviction as a debate point to disqualify Trump -- and instead disqualified himself in perhaps the biggest political backfire in modern history, even with that argument explicitly stated in the debate. \n\nAfter the debate and especially after Trump got shot in an assassination attempt less than three weeks later, the support for Biden receded significantly. It rebounded slightly just before Biden withdrew, but Biden trailed by three points in the aggregate and only led in one poll in July before his withdrawal -- out of twenty. (There were two ties.) To reverse that, Biden would have to accomplish three big tasks in 107 days:\n\nDemonstrate complete competency in extemporaneous conditionsCampaign at least as vigorously as TrumpDo another debate in which he remained coherent for 90 minutesProvide some defense of his presidency, especially on the border crisis and economics\n\nDoes anyone think Biden could have accomplished one of those tasks? Has he done anything since that debate that even approached these goals? His handpicked replacement managed to sound coherent and competent in the one debate with Trump, which puts Harris one up on her boss. Otherwise, Kamala Harris was just Joe Biden without dementia as an excuse. \n\nIn retrospect, this election was lost the moment Joe Biden handpicked Kamala Harris -- not as the 2024 nominee but as his 2020 running mate. Their combined incompetence, corruption, and malevolent demagoguery single- (or double-)handedly resucitated Trump's electoral prospects and deservedly doomed Democrats for their chicanery over the past four-plus years.","url":"https://hotair.com/ed-morrissey/2024/12/30/biden-i-shoulda-been-the-contendah-n3798341","image":"https://media.townhall.com/cdn/hodl/2024/180/d08fb36a-9e0d-47ef-8e75-b8bc2a0a7d69.png","video":null,"publish_date":"2024-12-31 01:07:51","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":-0.445},{"id":277205880,"title":"So Much, I've Lost Track: Another $6B in Aid, Etc., to Ukraine Announced Today","text":"The United States on Monday announced nearly $6 billion in additional military and budget assistance for Ukraine as President Joe Biden uses his final weeks in office to surge aid to Kyiv before President-elect Donald Trump takes power.\n\n\r\n Advertisement\r\n\r\n\r\n\r\n\nBiden announced $2.5 billion in additional security assistance for Ukraine. Treasury Secretary Janet Yellen said the United States has made available $3.4 billion in additional budget aid to Ukraine, giving the war-torn country critical resources amid intensifying Russian attacks on Ukrainian civilians and infrastructure.\n\n\"At my direction, the United States will continue to work relentlessly to strengthen Ukraine’s position in this war over the remainder of my time in office,\" Biden said in a statement.\n\nBiden's announcement includes $1.25 billion in military aid drawn from U.S. stockpiles and a $1.22 billion Ukraine Security Assistance Initiative (USAI) package, the final USAI package of Biden's time in office.","url":"https://hotair.com/headlines/2024/12/30/so-much-ive-lost-track-another-6b-in-aid-etc-to-ukraine-announced-today-n3798335","image":null,"video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":0.085},{"id":277205876,"title":"Regime Media: Biggest Underreported Story of 2024? Slidin' Biden","text":"It's so hard to write this column with either a straight face and/or utter contempt. The biggest scandal in American history certainly in the last century, and maybe ever, is the fraud perpetrated by regime media and the Democratic Party in Washington, D.C. as to the mental capacity of Joe Biden from the very beginning of his presidency in 2021. The echoes of the Wall Street Journal blockbuster 11 days ago continue to reverberate, but frustratingly, media admits there was a failure, but just can't seem to put their finger on how it happened and what should be done about it. Montages long and short have been compiled featuring Democrats and their allies and compatriots in regime media gaslighting Americans for the entirety of the Biden administration about how sharp, focused, energetic, and how on top of his game the President is. Here is just the latest version.On at least a couple of the Sunday shows, the obligatory year-ender questions were asked and answered on the panels. Who were the biggest winners and losers? Veteran syndicated columnist Cal Thomas was on Fox News Sunday with Shannon Bream, and did not mince words about his disgust about the job his profession turned in over the past four years. As the Late Charles Krauthammer would say following a rant like that, \"Strong letter to follow.\" The most enraging example of regime media doing a drive-by navel gaze was turned in by the Face the Nation panel hosted by Major Garrett. One of his guests was CBS political and legal correspondent, Jan Crawford. Garrett asked her what the most underreported story of the year was.I guess if Crawford were entering a 12-step program, you could give her credit for taking the first step - admitting there's a problem. She accurately said they should have done more to report Biden wasn't up to doing the job for another term much earlier, and had they done that reporting, perhaps they could have fielded a winning candidate to keep Donald Trump out of the White House. All of that is fine. But who is responsible for looking the other way from Biden's mental decline, from the very beginning? Robert Costa has been around this White House for the entire time, and still believes staff telling him Biden's fine. He is still going with his White House sources telling him the debate performance that demonstrated Emperor Biden wasn't wearing clothes was just a head cold. Costa had every opportunity to say he was lied to as well, but didn't. Ed O'Keefe was in the White House press room every day there was a briefing held. Where was his reporting on Biden's decline back in 2021, 2022, 2023, and 2024? Instead, he just nods his head in agreement with Crawford, as though some unnamed entity is culpable for dropping the ball, and shame on them, whomever they are. Let me take you back to the same Tiffany Network, CBS, from June of 2024. On the CBS Evening News, fellow White House correspondent Nancy Cordes was filling in, and one of the top stories was the magnitude of videos showing Joe Biden at the G7 Summit in Italy wandering off like Grandpa with Sundowner's. Not only did CBS not cover the obvious decline manifesting itself, they latched onto the White House line of deep fakes, and did an entire segment with a guest on the problem with deep fakes, and the misinformation popping up on alternative media sources creating the narrative of Biden losing it.Somehow in Jan Crawford's analysis of what should have been reported more, her own network's involvement in the cover-up of Biden's decline didn't seem to come to mind.CBS was definitely not the only network peddling the cheap fakes nonsense. MSNBC's Nicolle Wallace jumped on the misinformation disinformation train when it left the station. \n\nAs many times as they’ve lied, the media claiming that videos of Biden’s mental decline were “cheap fakes” might have been the death knell to their credibilitypic.twitter.com/BppCErMONa— Ian Miller (@ianmSC) December 20, 2024\n\nOn CNN's State of the Union panel, our friend Scott Jennings turned in a fine eulogy of the Biden administration, complete with disdain for the fraud pulled on the American people. \n\nThe best part of this is CNN contributor Karen Finney, a former advisor to Hillary Clinton, trying to feign shock at how much decline there was in Biden, as if she was totally unaware. Her takeaway? At least Biden showed up and did the job. \n\nJoe Biden is in St. Croix, Virgin Islands, spending his 570th day of vacation and counting. 570 days. In one four-year term, Joe Biden will have been on vacation for 19 months of it. Showing up and doing the job not only is the participation trophy of accomplishments offered up by a lefty political pundit, it doesn't have the added benefit of being remotely true.\n\nSpeaking of Joe Biden in St. Croix, the passing of former President Jimmy Carter at 100-years-old forced the POTUS to put on a suit and tie again and make a statement. No questions, mind you. He still isn't able to handle that and will not be for the rest of his life without a lot of staff intervention and scripting. But he had to say something about his mentor, the gold standard for how to fail as president, a limbo bar of bad that Biden has reset for all time, and a mark that for this country's sake, no one will ever get close to again. \n\nI believe it just dawned on Joe Biden that wherever Carter went, Biden's probably not too far behind, when all is said and done. But having known Carter for over half a century, you'd think that he'd have something profound and winsome to recall about the man and their friendship, right? Nah.\n\nJimmy Carter died, and the best Joe Biden can do is conflate him with his own father, and morph the one phrase he's repeated thousands of times on the campaign trail - the one thought that resides in a neuron that hasn't decayed, and insinuate that Carter said it, too. Apparently, the former President called Biden Joey, too. Who knew? \n\nCarter, of course, got clobbered in his re-elect campaign of 1980, with Ronald Reagan collecting 489 Electoral Votes to Carter's 49, and losing the popular vote to Reagan by 9.7%. There were lots of indicators that it would be a blowout, but one of the signs was a couple years earlier in 1978 when Carter gave what would become known as his Oval Office Malaise speech. \n\nBiden, by comparison, was going to get creamed in the election, and everyone in D.C. power circles, regardless of party, knew it. The only one who didn't realize it, and still doesn't, is Biden himself. He got pushed aside by Barack Obama, Nancy Pelosi, and the senior apparatus of the Democratic Party. Now that the damage is done and the smoldering ruins of his presidency are being picked over, Biden is now forlorn about all the negativity out there.\n\nNegativity, huh? You mean this kind of negativity? \n\nSometimes the Democrat elite tell us what they really think of us. Hillary Clinton thinks we are “deplorables”. Joe Biden thinks we are “garbage.” Kamala Harris thinks we are so stupid as to believe her lies.We deserve better. Vote Trump pic.twitter.com/cwEBnGSbLj— Tulsi Gabbard 🌺 (@TulsiGabbard) October 30, 2024\n\nHow about this kind of negativity?\n\n🔥🚨BREAKING NEWS: Joe Biden is legitimately ‘losing his mind’ on live television at the DNC Convention as he screams in anger in fury when mentioning Donald Trump who humiliated him in their debate in Atlanta Georgia. pic.twitter.com/R0E1vwsqCJ— Dom Lucre | Breaker of Narratives (@dom_lucre) August 20, 2024\n\nBack to the mother of all scandals - regime media aiding and abetting the cover-up of Joe Biden's mental impairment from the outset of his tenure as president. There are so, so many people in media with egg on their face, but perhaps none more than former CNN media watchdog and potato, Brian Stelter. This is from June after the Wall Street Journal ran a story then that suggested Biden was slipping.\n\nIn early June before the Biden/Trump debate, the WSJ did a story on Biden's decline.\"Behind Closed Doors, Biden Shows Signs of Slipping.\"Brian Stelter claimed that it was fake news. Brian is wrong an awful lot. pic.twitter.com/AfPuRzkNrw— MAZE (@mazemoore) December 20, 2024\n\nHow about ABC? Did they cover their own malfeasance in how they treated the President's slipping mental cognition? Nope. Remember, after the fatal debate performance turned in by Joe Biden, George Stephanopoulos and ABC raced in to rescue Biden, to rehabilitate him for the American people. It was George's intention to show that the debate was a one-off bad night, but Biden, even with editing, couldn't be helped. \n\nThis ABC interview was supposed to shut down talk of Biden’s declineHe immediately says he doesn’t remember if he watched the debateHe’s cooked pic.twitter.com/TsELNFUkdP— johnny maga (@_johnnymaga) July 5, 2024\n\nHosting This Week on Sunday, Jonathan Karl set up a carefully-edited video package on the year that was. It mentioned Joe Biden physically suffering from COVID while gingerly descending the short stairs of Air Force One and struggling to get into the Suburban, but did not talk about his mental decline at all. Meet the Press' Kristen Welker avoided politics entirely, instead interviewing a handful of people, including her NBC colleague, Savannah Guthrie. As for the remainder of the White House press corps, The New York Sun's Matthew Rice reports that as a collective, they are all handling the scandal the same way CBS' Ed O'Keefe handled it in the Jan Crawford clip above. They are dodging the obvious questions of who knew he was slipping and when they knew it, because they are all part of the cover-up. \n\nTop White House Reporters, in Obituaries of the Biden Administration, Shy Away From Mentioning President’s Obvious Mental Declinehttps://t.co/Hoeobd9DaF— LetsGo (@readysetcya) December 30, 2024\n\nRegime media is irreparable. President-Elect Donald Trump would be well-served to ice every one of these people out for the duration of his term in office. Starve them of access. Do radio, do Fox News, Newsmax, News Nation, and make use of podcasts. The sooner the news divisions of the New York Times, Washington Post, CBS, NBC, ABC, and CNN are denied the oxygen of access to the presidency and Congressional leadership, the sooner these networks will begin the necessary purge of hyper-partisan Democrats pretending to be journalists, including editors as well as on-air personalities.Jan Crawford and Chris Cillizza are the only ones outside of Fox News that have admitted they have a problem. That's the first step to recovery. They're nowhere near Step number 2, which is admitting that there's a higher power than themselves that could help restore them to sanity. Why? Because to regime media, there is no higher power than that derived from their hatred of Donald Trump. It's sad, but they have not hit rock bottom, yet. Until they do, they all need to be sidelined. All of them.","url":"https://hotair.com/generalissimo/2024/12/30/regime-media-biggest-underreported-story-of-2024-slidin-biden-n3798333","image":"https://media.townhall.com/cdn/hodl/2024/355/ef801597-25c8-4d9c-8991-2d1ffbeb3a5c.jpg","video":null,"publish_date":"2024-12-31 01:07:51","author":"Duane Patterson","authors":["Duane Patterson"],"language":"en","source_country":"us","sentiment":-0.326},{"id":277205878,"title":"Devin Nunes Reemerges","text":"2024 proved to be the year of the reemergence of many once and unfairly pilloried public figures.\n\nElon Musk weathered nonstop attacks on his X social media platform. Furor escalated over his newfound 2024 Trump advocacy—even as he ended 2024 with his iconic Tesla brand still the best-selling car in six states and the most popular electric vehicle in the entire nation.\n\nTesla’s rising stock prices ensured by year’s end that Musk was by far the richest man in the world with a net worth of well over $400 billion. His recyclable SpaceX Super Heavy starship rocket booster mesmerized the nation as it returned to the launch pad to be caught by a huge mechanical arm.\n\nAfter January 6, 2021, the media swore that Donald Trump was supposedly washed up. He left office with a 34 percent approval rating. Over nearly the next four years, Trump would face 91 felony indictments and be liable for over $400 million in assorted fines.","url":"https://hotair.com/headlines/2024/12/30/devin-nunes-reemerges-n3798355","image":null,"video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":0.121},{"id":277205870,"title":"BREAKING: Trump Endorses Johnson for Speaker","text":"If, as is popularly said, the definition of insanity is doing the same thing over and over again, then the House of Representatives will shortly become America's pre-eminent asylum. After spending much of the last session focusing on Beltway food fights while Joe Biden did his Nero act from the Oval Office, the House Republican caucus appears poised to do so again to greet a returning Donald Trump.\n\nHowever, Trump has just put out his best effort to hold this off. Less than an hour ago, Trump endorsed Mike Johnson to return as Speaker, and tried to remind House Republicans to fight for his agenda rather than amongst each other:\n\nWe are the Party of COMMON SENSE, a primary reason that we WON, in a landslide, the magnificent and historic Presidential Election of 2024. ALL SEVEN SWING STATES, 312 ELECTORAL COLLEGE VOTES, AND THE POPULAR VOTE BY MILLIONS OF VOTERS (Despite large scale voter fraud taking place in numerous states, including California, where votes are ridiculously still being counted, or under review!), ALL WON WITH EASE, CALM, & PROFESSIONALISM. Republicans are being praised for having run a “legendary” campaign! Democrats are being excoriated for their effort, having wasted 2.5 Billion Dollars, much of it unaccounted for, with some being used to illegally buy endorsements ($11,000,000 to Beyoncé, who never even sang a song, $2,000,000 to Oprah for doing next to nothing, and even $500,000 to Reverend AL, a professional con man and instigator, who agreed to “interview” their “star spangled” candidates, Kamala and Joe). We ran a flawless campaign, having spent FAR LESS, with lots of money left over. They ran a very expensive “sinking ship,” embracing DOJ & FBI WEAPONIZATION against their political opponent, ME. BUT IT DIDN’T WORK, IT WAS A DISASTER!!! LETS NOT BLOW THIS GREAT OPPORTUNITY WHICH WE HAVE BEEN GIVEN. The American people need IMMEDIATE relief from all of the destructive policies of the last Administration. Speaker Mike Johnson is a good, hard working, religious man. He will do the right thing, and we will continue to WIN. Mike has my Complete & Total Endorsement. MAGA!!!\n\nAre Republicans the party of common sense? Heck, not even Mike Johnson really embodies it, as Trump well knows. Part of this revolt -- not all of it, but part -- has its energy from Trump's intervention in the CR that Johnson first floated before Christmas, a 1500-page porkfest that gave away the store. Trump also complained yesterday about the debt-ceiling extension from Kevin McCarthy two years ago, a point which he wanted Johnson to renegotiate now rather than stick him with the issue in the summer:\n\nThe Democrats must be forced to take a vote on this treacherous issue NOW, during the Biden Administration, and not in June. They should be blamed for this potential disaster, not the Republicans!\n\nThe Speaker fight didn't make much sense last session, 'common' or otherwise, and it makes less sense now. One can make the case that the GOP needed a different kind of speaker to fight against a Democrat president and a Democrat-controlled Senate, but that's not the situation now. The GOP controls both chambers and the White House for the next two years. The Speaker and Senate Majority Leader will follow the president's leadership (within reason) and must work together to push Trump's agenda in the next two years. \n\nThat's why Trump is emphasizing \"IMMEDIATE\" relief in his message. He doesn't just want to hit the ground running, Trump needs to hit the ground running. Two years may be all he gets with this kind of control, and he doesn't want to waste several months of it on a leadership food fight that won't matter to anyone outside the Beltway anyway. As unhappy as Johnson made Trump the last couple of weeks, he knows that a leadership fight will only serve to derail his agenda when time matters most. \n\nFormer Speaker Newt Gingrich blasted the effort to unseat Johnson yesterday in an interview with John Catsimatidis. His contention that Johnson is doing an \"extraordinary job\" may be arguable, but his point about the pointlessness of the challenge is not:\n\nGingrich stressed that Republicans should stay focused on key issues, such as tax cuts, but also be a unified front as the GOP takes over control in the Senate and the White House next month.“They need a Republican unity program for the next two years. These guys who wake up every morning and say, ‘I’m going to vote no. What’s the issue?’ are totally destructive and hand the House over to the Democrats,” Gingrich said. \"So they need to start this new year with a pledge that every Republican is going to stick together – they're going to be a single team.\"\n\nWhat is the point of a challenge, anyway? What agenda won't Johnson serve with Trump in the White House and John Thune in charge of the Senate? This is looking less like a principled stand and more like inside-the-Beltway ambitions in play, at least according to Politico:\n\n Rep. CHIP ROY (R-Texas) is conducting a temperature check to determine the viability of Rep. JIM JORDAN (R-Ohio) and other possible candidates if MIKE JOHNSON is unable to secure another term with the speaker’s gavel, our Olivia Beavers writes in. ...Such conversations come just days before the Friday floor vote that will determine if Johnson can secure a second term as speaker. It could be a bad sign for Johnson that Roy is trying to find a fallback option: To maintain the gavel, Johnson can’t risk losing the support of more than two House Republicans, and Rep. THOMAS MASSIE (R-Ky.) has already publicly announced his opposition. Roy himself was particularly critical of Johnson after the latest government spending bill passed ahead of the holidays.While some Republicans also believe this could be a ploy to gain leverage against Johnson as Roy campaigns to lead the House Rules Committee, which is among the few panels whose leaders and membership are solely appointed by the speaker, Roy allies fiercely dispute these efforts are connected.\n\nWill Trump's endorsement put an end to these back-bench machinations? We'll see, especially if Trump follows up with some pointed commentary aimed at the challengers. Roy's district isn't far from my own, and it has a solidly pro-Trump constituency.\n\nFinally, this comes at an awkward and somewhat ironic time. Congress has to count and conclude the Electoral College votes and process for Trump's win to become official, which takes place in a joint session of Congress. Will this food fight derail Trump's victory, four years after the January 6 riot that nearly derailed Trump's official loss? Er ... probably not, Roll Call reports:\n\nLevitt also said that although the regular House cannot do business without a speaker, it is a different body — constitutionally — when it is part of a joint session to count the votes.“I don’t think, as a constitutional matter, there is an impediment to members of the body proceeding with the electoral count if the body can’t do any work on its own without electing a speaker,” Levitt said.The House, along with the Senate, also typically passes a concurrent resolution to enter in the joint session and lay out the procedures they will follow. Levitt pointed out that those same procedures are also laid out in the 2022 electoral count law, and Harris could rely on the statute to proceed with the count.“As far as the Constitution goes, all the things you need are the Senate, the House and the president of the Senate, who is the sitting vice president,” Levitt said.\n\nLet's hope that common sense prevails and we avoid another embarrassing precedent.","url":"https://hotair.com/ed-morrissey/2024/12/30/here-we-go-again-n3798338","image":"https://media.townhall.com/cdn/hodl/2024/106/33152966-8fce-4101-a082-e0f129f86450.jpg","video":null,"publish_date":"2024-12-31 01:07:51","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.355},{"id":277205860,"title":"Threat to German Democracy Alert: 'Won't Anyone Rid Us of This Troublesome Musk?'","text":"Gracious, the ruling yet fractured coalition in Germany - and the European Union Brahmins by extension - are frazzled with this whole populist thing happening.\n\nBefuddled elites haven't a clue why the Luddites are revolting.\n\nThat is the EU… pic.twitter.com/UwfgNU2V17— Free House (@Freikorps9) December 30, 2024\n\nWE ONLY DO WHAT WE DO IN YOUR BEST INTEREST, UNGRATEFUL VERMIN\n\nIt's as if they've suddenly found themselves playing a game of Whack-a-Mole with dissension in the ranks popping up, and every time they feel as if they've smacked it back?\n\nHere's another annoying peasant populist popping up in a different corner of the once quiet and well-ordered board. \n\nIt's been a bad year for the EU elite. Messy, even.\n\nRampaging farmers started it.\n\nEurope’s governing classes have long been estranged from the real economy – from the world of production, industry and agriculture. To these green-hued technocrats, the economy appears as little more than a set of figures on a spreadsheet, to be regulated and managed towards a ‘better’, ‘greener’ future. To be redesigned according to a schedule of abstract, arbitrary Net Zero targets. All the while, the actual activity of making the stuff we need and use everyday – from energy to food – has remained out of sight and, above all, out of mind.That was until this year, when farmers from across Europe took to the streets to protest against measures that threaten their very existence. In doing so, they finally brought this aloof political class face-to-face with the destructive consequences of their policies.\n\nAnd their traveling tractors of fury across the European landscape seemed to light a fire that had been smoldering for a while in the bellies of citizens tired of shortages and freezing in the name of climate cult pursuits that only served to lower their already modest standard of living and deny them even more freedom at every turn.\n\nBy last January, after the astonishing success of Geert Wilders during that fall's Dutch elections, all the forces of the establishmentarians were gathering to paint populists as \"rightwing extremists\" and throw them out of any electoral contention in any fashion they could, in any country they could. \n\nPolitico.eu was doing its part in the schmear job, moaning that the danger was almost insurmountable. For the record, the government of Italy under Meloni was one of those considered lost to the 'hard right' already - just so you have something to measure by.\n\n...This morning Politico.eu was raising the alarm, helpfully providing a color-coded map to emphasize how the forces of the 'hard-right' parties had thoroughly infiltrated the formerly Halcyon haven of the EU.BE AFRAID - BE VERY AFRAIDThe longstanding effort to keep extremist forces out of government in Europe is officially over.For decades, political parties of all kinds joined forces to keep the hard-right far from the levers of power. Today, this strategy — known in France as a cordon sanitaire (or firewall) — is falling apart, as populist and nationalist parties grow in strength across the Continent.\n\nThe EU Ice Queen was reiterating her stand that not only were populist parties 'right-wing,' they were 'TOOLS OF PUTIN.' So don't be a member.\n\nBe a good lemming.\n\nWe must be clear-eyed:Rassemblement national, AfD, Konfederacja…Different names - but all the same.They are Putin's puppets and proxies and they are trampling on our values.We will not let them destroy what we have built together. pic.twitter.com/nqxR3mzKKr— Ursula von der Leyen (@vonderleyen_epp) May 23, 2024\n\nMeanwhile, the German government was busy having the Alternative for Germany (AfD) party declared an extremist group so the government could legally surveil their leaders and members as the country was going into major regional elections, mind you. I'm sure that had no bearing on anything.\n\nThe opposition Alternative for Germany (AfD) party has lost a major court appeal against the powerful domestic intelligence agency, the Office for the Protection of the Constitution (BfV), with a high court judge allowing the BfV to continue classifying the party as a “suspected case” of right-wing extremism.The move paves the way for the BfV and other authorities to utilize powerful surveillance technologies against the party, including reading emails, browsing histories, and monitoring emails and chats. In effect, anyone associated with the party may now be swept up in the surveillance net that can now be legally deployed against the second most popular party in the country.\n\nAll in the name of PROTECTING DEMOCRACY, of course.\n\nAll the 'protecting' must have been more than people could stand because the EU Brahmin Titanic hit a populist iceberg in the June European Parliamentary elections with a decisive thunk.\n\n...I was on my usual weekend Headline Section duty when the results from the European Union Parliament elections started being tallied. I have to admit I had a Schlitz eating grin on my face updating the intial headline post as the evening wore on. And it did take time because polls in Italy didn't close until 11 p.m., local time. And Away We GO: Macron and Scholz GET HAMMERED in EU Elections UPDATE: A Meloni SWEEPFrench President Emmanuel Macron and German Chancellor Olaf Scholz suffered massive defeats in the European Parliament elections Sunday, as far-right parties made gains that could sway the bloc to take a harder line on migration and upset ambitious climate change plans.Sunday was a shock for supporters of French President Emmanuel Macron. They knew things were a little shaky, but they had no idea it was quite as bad as it really was.\n\nAfD, for all the power of the German government, arrayed against it, fair and foul, rolled to a second-place finish, even with changing voting laws to include 16-year-olds in many places in the EU. EU elites felt young people were sure to stay the Green course, yet country after country fell to a populist tidal wave, rejected by even those same young voters they were counting on.\n\nThe prime minister of Belgium resigned as Flemish national parties took the wins, which was one shocker. There were more.\n\n...In Germany, the AfD (Alternative for Germany) party, even after unending vilification and hamfisted missteps by party leaders feeding into it, still handily pulled off a major upset, becoming the second-largest party in Germany. They smoked the shorts off the Greens and shaved some serious hair from Chancellor Olaf Scholz's ruling coalition....The \"Freedom Party\" in Austria (FPÖ), born of resistance to the COVID lockdowns and then morphing into a fervent anti-Green, anti-immigration group, took the top spot in their elections. Building on this success, they announced they'd be gunning for their country's top elected jobs. A bemused press sounds alarmed but hasn't quite gotten over the shock of \"extremist\" FPÖ winning yet enough to really begin the job of seriously vilifying them. ...Writing in Der Standard newspaper, editor-in-chief Gerold Riedmann said the FPÖ had become a melting pot of people who have \"concerns about migration; who don’t think Putin is all that bad; who felt humiliated by vaccination and corona [virus]; who think climate protection is unnecessary; and who simply want to teach everyone a lesson\".\n\nIt only got worse for entrenched establishment parties as the summer rolled on. What was also worse in the eyes of European voters was what those same parties did to stay in power. All are perfectly legal under their parliamentary systems, and all are done in the name of SAVING DEMOCRACY, you understand. But none of it tracks as very 'democratic.' Far more autocratic.\n\nIn a mad panic over Marine LePen's stunning showing in the first round of voting after French President Emmanuel Macron had dissolved their parliament and called snap elections, traditional French parties, desperate to keep her National Rally (RN) from triumphing, cut deals with the literal devil to deny RN candidates votes. It worked...sort of.\n\n ...There's tons of maneuvering room for skullduggery, and apparently, that was already in the works about ten minutes after the results were announced.French candidates make hurried deals to try to stop far-right National Rally from leading governmentFrench opposition parties made hurried deals Tuesday to try to block a landslide victory for Marine Le Pen’s far-right National Rally in Sunday’s second round of legislative elections, as she said her party would lead the government only if it wins an absolute majority — or close to it.The National Rally, under party president Jordan Bardella, secured the most votes in the first round of the early legislative elections on June 30 but not enough to claim an overall victory that would allow the formation of France’s first far-right government since World War II.......It's SO bad that dissident French Republicans, Les Républicains (LR) - whose leader Eric Ciotti had said he would form a government with LePen should she prevail - decided they would prefer to \"welcome\" a Communist to beat the RN opponent in one constituency rather than chance losing the seat to RN's candidate.\n\n In August, as the American presidential race was heating up, and patrons using Elon Musk's X were enjoying the uncensored access to opinions and news, fussbudget EU fascist Commissioner Thierry Breton stepped in to threaten Musk over a Spaces event he'd announced with, of all people, Donald Trump. \n\nYou see, Breton felt the tender and impressionable eyes and ears of EU subjects should be 'protected' from exposure to the man who might be the next US president because Europeans do not care for him.\n\nSo he fired off a 'Nice little business you have in Europe - be a shame if anything happened to it' letter to Musk. Who basically told him to blow it out his...tiny Thierry.\n\n😂 pic.twitter.com/eVMOZDF2y5— Michael Shellenberger (@shellenberger) August 13, 2024\n\nIt would have been as well if they'd simply let the airwaves and interwebs ring with the sounds of open debate and bonhomie.\n\nBut that is so unEuropean. They feel they have to control everything, and they have done a horrific job of it.\n\nThe French are teetering on the edge of economic disaster, the government is a shell operation, and they have Marine LePen on trial on what many French see as trumped-up charges that the prosecution is now demanding extraordinary punishment for.\n\nFrance’s next presidential election is not due for more than two years, but an important stage in the battle to take Emmanuel Macron’s place in the Élysée Palace will come in just three months’ time — courtesy not of the country’s 43 million voters but a panel of judges in a Paris courtroom.On March 31 the verdict will be announced in a case against Marine Le Pen and 24 leading members of the right-wing populist National Rally party, who stand accused of using fictitious work contracts to embezzle millions of euros of European Union funds for more than a decade.Prosecutors have demanded a five-year jail sentence and €300,000 fine (£249,000) for Le Pen, 56 — and also want her barred from running for public office for five years. Unusually, they have argued that if she is convicted the ban should be imposed immediately, rather than after any appeal process — which would prevent her from taking part in the presidential contest, due in April 2027.\n\nA blind man could see through that. \n\nWho's the THREAT TO DEMOCRACY again?\n\nElon Musk, for sure. Didn't you know? They've decided to settle on this one guy.\n\nThe German government has imploded before our eyes, as has their economy, even as they scramble for ways to nullify the AfD before February's elections. They're trying everything from parliament to the courts to \"why bother voting for them when we won't play nice even if they win\" appeals.\n\nWHY DOES ELON LIKE THEM?\n\n\"None of Germany’s pro-Constitution parties will work with AfD on anything. Even other far-right populist movements refuse to work with them, such as French firebrand Marine LePen. That is who Musk is aligning himself with.\"@KlausMarre's latest on Elon.https://t.co/oMbjWxaVld— WhoWhatWhy (@whowhatwhy) December 30, 2024\n\nAfter the editor of a German paper, Weld, who invited Elon to publish an op-ed resigned because the op-ed 'offended' her, this is what the Friedrich Merz, Christian Democrat (CDU) leader, had to say about Elon writing an op-ed, \"Waah.\"\n\n...Friedrich Merz, leader of the opposition Christian Democrats and current favorite to succeed Scholz as chancellor, said in an interview with the Funke Media Group: “.”Merz described the commentary as “intrusive and pretentious.”\n\nHerr Merz must have missed Starmer's Labour Party literally sending bodies to the States to WORK for Kamala Harris. Of course, elected politician Herr Merz also did his own bit of election interference in friendly Romania's recent election strife, but (C)? That's (D)ifferent.\n\nThe German government is weighing in, of course. Herr Musk is 'free to express his opinion,' as long as he expresses the right opinion.\n\nNot what the German goverment considers a 'far-right' opinion. That's a THREAT TO DEMOCRACY.\n\nThe German government has accused tech billionaire Elon Musk of meddling in the country's election campaign after he repeatedly, and controversially, endorsed the far-right Alternative for Germany (AfD) weeks before Germans are set to vote.“It is indeed the case that Elon Musk is trying to influence the federal election through his statements,\" government spokesperson Christiane Hoffmann said.She said that although Musk was \"free to express his opinion\" it was worth noting Musk was recommending voting for a party that is \"being monitored by the Office for the Protection of the Constitution on suspicion of being right-wing extremist and that has already been recognized as being right-wing extremist in parts.”\n\nElon's old nanny, Thierry, is back at work, bitching away and helping the German government find some way to whack this Musky mole for his mouthiness.\n\nSo, Thierry, why are you, as a Frenchman, trying to interfere in Germany's elections?— Gray Connolly (@GrayConnolly) December 22, 2024\n\n...Isn't this the very definition of foreign interference? We must end the \"double standards\" and apply the #DSA in Europe \n\nThere must not be much left ammo-wise in the European quiver if they only have arrows for one guy - one private American citizen - in their never-ending fight to PROTECT DEMOCRACY...from itself.\n\nOh, and keep their cushy gigs.\n\nI don't think they're light enough on their feet to win this one.","url":"https://hotair.com/tree-hugging-sister/2024/12/30/threat-to-german-democracy-alert-wont-anyone-rid-us-of-this-troublesome-musk-n3798339","image":"https://media.townhall.com/cdn/hodl/2023/258/c24d24e7-6faa-4d1a-b9bc-5b8f714db09e.png","video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.12},{"id":277205856,"title":"Thing of Beauty: Twilight of the Liberal Left","text":"I was struggling to remember what Barack Obama had done since he left the White House. To challenge myself, I decided not to look anything up and truly disgorge whatever images and ideas had been lodged in my memory. There was the jetting around with Richard Branson. There was a podcast of some sort, a Netflix documentary (or documentaries), a chat with Bruce Springsteen. There’s the summer reading list. His wife published a book that outsold even his own. He campaigned, of course, for other Democrats, whether it was candidates in the midterms or Joe Biden, his successor. This year, he and Michelle delivered speeches at the Democratic National Convention that were extraordinarily well-received. I was there, and I was impressed. I did think, and still do, that if either had run in this race against Donald Trump, they could have won.\n\nNone of that matters because the Constitution bars Barack from serving again and Michelle has no interest. They both stumped for Kamala Harris and had nothing to show for it. As Black men bled out of the Democratic coalition, Obama hectored them on the campaign trail for making “excuses” about not wanting a female president. It was professorial Obama at his finest; no hope, no change, merely condemnation for not doing what better-educated elders expected of you. Not surprisingly, few listened to him, and Trump proceeded to annihilate the multiracial Democratic coalition that Obama had assembled in two stunningly successful presidential runs. In 2016, Hillary Clinton was able to cling on to bits of what Obama had left behind—she was still running up the score in Miami-Dade County and dominating along the Rio Grande—and Biden grasped at less of it, benefiting more from an anti-Trump turnout boom that sent him to the White House. Politically and culturally, the Obamas found themselves in a transformed nation, the zeitgeist hurrying past them. The youngest generations, veering rightward, have little regard for them, and aging Democrats are beginning to think of Obama, as the writer Ethan Strauss pointed out, as a Michael Jordan-like presence: the greatest there ever was, but mostly disconnected to the present day. Barack Obama is a symbol, a monument. Like all ex-presidents, this is his fate, and when he’s trundling about doing his surrogate work in 2028, it will be as a specter of what was, and will probably not be again. There will be other Democratic presidents, but there won’t be another Obama.\n\nThe dismantling of the Obama coalition—the great surge of new, nonwhite voters into the Republican Party—doesn’t have to be permanent. Trump’s victory resembles George W. Bush’s in 2004, when he also won the popular vote and was supported by more than 40 percent of Latinos. Two years later, a backlash midterm made Nancy Pelosi speaker, and two years after that, America elected its first Black president. American politics is fickle and fluid; coalitions are made to be broken, and loyalty to party is barely skin-deep. What has grown apparent is that, with this Trump restoration, there will be no second Resistance. The social justice left, the so-called woke, is mostly somnolent. The marches are spare. The talk of anti-fascist uprisings is muted. There is no screaming in the streets, no days of mourning, no promises to decolonize any bookshelves. The women’s march may or may not be on, Black Lives Matter is nowhere to be found, and ICE is not getting abolished. The liberal media has not minted any new star journalists, pundits, or talking heads. Few are railing against Jill Stein or the Russians. The CIA and FBI are not getting sanctified. The untethering of culture and politics, indeed, has begun.","url":"https://hotair.com/headlines/2024/12/30/thing-of-beauty-twilight-of-the-liberal-left-n3798336","image":null,"video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","source_country":"us","sentiment":-0.16},{"id":277205858,"title":"'Time Horizon': Sullivan Tries to Carterize Biden's Awful Legacy","text":"If someone titled a film Time Horizon*, we'd expect a cheesy, 1980s-style low-budget and low-tech yawner, with \"thoroughly forgettable\" as a best-case outcome. If you're trying to explain the legacy of a political figure, \"time horizon\" is a pretty good way to admit sotto voce that his career was a disaster in the present moment.\n\nAnd so we come to Jake Sullivan's attempt to polish Joe Biden's legacy, which comes in the middle of a Washington Post effort to do the same. While this attempt came before news of Jimmy Carter's passing, it's clear that Sullivan wants us to believe that history will also credit Biden with the accomplishments of his successors, rather than assess his presidency accurately:\n\nEven some of his closest advisers, without faulting Biden, conceded recently that his style of governing did not always mesh with today’s politics.“The president has been operating on a time horizon measured in decades, while the political cycle is measured in four years,” Jake Sullivan, Biden’s national security adviser, said in an interview.Sullivan added that Biden’s accomplishments by their nature will take a long time to bear fruit. “How to govern at this moment to set the U.S. up for long-term success has one answer, and how to govern to deal with midterm and presidential elections in the very short term might have a different answer,” he said. “The president went with doing the things that really put America in a strong position.”\n\nAhem. In fact, double ahem. What part of the Kabul Bug-Out \"put America in a strong position\"? That sent a signal of weakness and fecklessness that rippled all the way to the Donbas and to Gaza, not to mention Tehran, Beijing, and Pyongyang. Biden abandoned 14,000 Americans to the Taliban and billions of materiel to extreme Islamist terrorists in 2021. Two years later, Biden and his gutless wonders insisted on imposing their military advice to Israel while threatening to withhold arms sales; Benjamin Netanyahu was smart enough to recognize defeatism and surrender when he saw and heard it, and ignored Biden.\n\nHow about stronger in terms of domestic defense? Biden and his team allowed millions of migrants to swarm unchecked across the southern border after inheriting a stable border from Donald Trump. The resulting flood of migrants exacerbated crime, homelessness, inflation (to which we'll return momentarily), not to mention a national housing crisis. At the same time, Biden and his allies pressed for shifting funds for police to other non-law-enforcement priorities, with some calling for defunding across the board. \n\nOn the economy, Biden eroded the buying power of the working and middle classes in exchange for his global-warming fantasy spending. Despite being warned that a third tranche of stimulus was an idiotic policy in light of supply-chain issues, Biden pushed forward and touched off the worst inflationary wave since Carter. American workers lost ground nearly every quarter of his presidency, while their debt skyrocketed as they struggled to keep up. \n\nAnd let's not forget the worst legacy of the Biden presidency, which is the cover-up of Biden's cognitive incapacity for the office. Jake Sullivan will have to answer for that in time, one hopes, as will Kamala Harris and Biden's other advisers with their \"sharp as a tack\" lies. If the Washington Post was a legitimate news source, it would be asking Sullivan to account for that cover-up rather than provide even more propaganda for a senile failure propped up to disguise the exercise of real power. The \"time horizon\" on that cover-up began before the Kabul Bug-Out, according to new reporting this month from the Wall Street Journal, and was in place by mid-2021:\n\nYet a sign that the bruising presidential schedule needed to be adjusted for Biden’s advanced age had arisen early on—in just the first few months of his term. Administration officials noticed that the president became tired if meetings went long and would make mistakes. They issued a directive to some powerful lawmakers and allies seeking one-on-one time: The exchanges should be short and focused, according to people who received the message directly from White House aides. Ideally, the meetings would start later in the day, since Biden has never been at his best first thing in the morning, some of the people said. His staff made these adjustments to limit potential missteps by Biden, the people said. The president, known for long and rambling sessions, at times pushed in the opposite direction, wanting or just taking more time.The White House denied that his schedule has been altered due to his age.If the president was having an off day, meetings could be scrapped altogether. On one such occasion, in the spring of 2021, a national security official explained to another aide why a meeting needed to be rescheduled. “He has good days and bad days, and today was a bad day so we’re going to address this tomorrow,” the former aide recalled the official saying.\n\nThis is the real Biden legacy -- weakness and incompetence unparalleled in modern American history, combined with a criminal conspiracy and personal corruption capped by the pardon for Hunter Biden. There is no \"time horizon\" possible that could contextualize that into advancing American interests. In fact, the full-court press of lawfare on his political opponents -- including the use of government pressure to censor on-line dissent -- may have set precedents that will weaken liberty for decades to come. \n\nSullivan clearly has the Carter model in mind with this \"time horizon\" nonsense, but it's an absurd construct. Carter spent more than 40 years as a private citizen, focused on charitable works before pushing fully into the NGO realm in foreign policy. The latter has a mixed legacy at best (which David has dissected in part already), but at least Carter focused on something other than himself. Joe Biden spent what little time he had outside of Washington DC power (and apparently a lot of time while in power too) focusing on selling his influence to foreigners through Hunter and his brothers Frank and Jim, and laundering foreign income from that business through Biden Inc's 20-plus LLCs. \n\nBesides, Carter's legacy as president is just as poor as it was in 1981 when Ronald Reagan took office. It wasn't corrupt, but it was just as weak and misguided on both foreign and domestic policy. It is Carter's post-presidential work that elevated him in later years, and still not without controversy, especially in playing footsie with Yasser Arafat and later Hamas. Biden has no such claim to charity with his own time and money, only with ours, and mainly for the benefit of his influence-peddling business model. \n\nThat's the Biden legacy. And if there is justice, Sulluvan will be among those who will have to answer for it. \n\n* - I checked on IMDB, and the title is still available. The closest is Event Horizon, which wasn't too bad in 1997 but was still thoroughly forgettable. Time to suit up Tim Thomerson, David Andrews, and Melanie Griffith!","url":"https://hotair.com/ed-morrissey/2024/12/30/time-horizon-sullivan-tries-to-carterize-bidens-awful-legacy-n3798334","image":"https://media.townhall.com/cdn/hodl/2023/138/1a2e7428-4357-41a6-a8f7-ffef4b59dc8e.jpg","video":null,"publish_date":"2024-12-31 01:07:51","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.036},{"id":277205850,"title":"Trump Makes Huge Announcement for Speaker of the House!","text":"Trump Makes Huge Announcement for Speaker of the House!\n\nOn this full episode of LARRY, we discuss the breaking news that Donald Trump has made an endorsement of Rep. Mike Johnson for Speaker of the House, CNN anchors getting some BRUTAL reality checks, and MUCH, much more!","url":"https://hotair.com/videos/2024/12/30/trump-makes-huge-announcement-for-speaker-of-the-house-n3798352","image":"https://media.townhall.com/cdn/hodl/video/brid/1924140_sd_6772f60bd3242_1735587339.jpg","video":null,"publish_date":"2024-12-31 01:07:51","author":null,"language":"en","source_country":"us","sentiment":-0.286},{"id":277205844,"title":"To Make America Great, Trump Can Enable the Nippon Steel Acquisition","text":"When President-elect Donald Trump takes over as commander in chief again on Jan. 20, a bevy of problems and challenges will confront him. People are still battling a cost-of-living crisis. Wars are raging in Europe and the Middle East. Great concern exists across the United States about the growing power of China and what it may mean for war and peace in Asia and America’s geopolitical strength. The Biden administration’s handling of immigration seems to have resulted primarily in total chaos, leaving people looking for solutions that may be trickier to identify and deploy than the incoming administration believes.","url":"https://hotair.com/headlines/2024/12/30/to-make-america-great-trump-can-enable-the-nippon-steel-acquisition-n3798343","image":null,"video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.051},{"id":277205846,"title":"Netanyahu to Undergo Prostate Removal Sunday","text":"Israeli Prime Minister Benjamin Netanyahu is having his prostate removed on Sunday, his office said, a procedure that comes as he manages multiple crises at once, including the ongoing war in Gaza and his own trial for alleged corruption.\n\nNetanyahu, 75, is among a cohort of older world leaders, including U.S. President Joe Biden, 82, and President-elect Donald Trump, 78, whose health and physical fitness are under deep scrutiny both at home and abroad because of their advanced age and the effect that could have on their leadership.\n\nNetanyahu, who has had a string of health issues in recent years, has gone to great lengths to bolster a public image of himself as a healthy, energetic leader. During his trial this month he boasted about working 18-hour days, even if those long hours are accompanied by a cigar. But as Israel’s longest-serving leader, such a grueling workload over a total of 17 years in power could also take a toll on his well-being.","url":"https://hotair.com/headlines/2024/12/30/netanyahu-to-undo-prostate-removal-sunday-n3798337","image":null,"video":null,"publish_date":"2024-12-31 01:07:51","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":0.274},{"id":277203360,"title":"Woke is dead — let’s make sure it never comes back","text":"Across the non-left media world, it’s now an article of faith that Donald Trump’s emphatic victory is a woke watershed.\n\nAfter asking petulantly for year upon year, “Now have we hit peak woke?” like children on the back seat nagging daddy “are we there yet?” we learn repeatedly from conservative outlets that the progressive lunacy that has tormented us since about 2014 (if not since 1965) has been roundly defeated.\n\nA decisive death knell for identity politics dangles the blessed possibility of no longer squandering our brief duration on this Earth on stupid conversations and debates over whether: women can have penises; racial discrimination cures racism; advancement in employment and education should be determined by skin color; the western civilization that gave us penicillin, Rembrandt, Bach and the Hubble space telescope is a disgrace; being grotesquely fat is healthy; and wearing a sombrero that you bought yourself on Amazon is theft.\n\nFriends, the folks who’ve really been stealing — and high-value items: our precious time, energy and attention — are the doctrinal morons who’ve roped us into addressing these painfully self-evident questions. I have devoted whole afternoons to seriously considering whether a mass movement to sterilize children and cut off their healthy body parts is a good idea.\n\n‘Cancel’ canceled\n\nAgreed, then: We yearn to put this rank idiocy behind us.\n\nIn fact, I’m intensely curious how this period of communal madness will be regarded once it’s foreshortening in the rear-view mirror. Will this era’s edges blur until, in retrospect, “cancel culture” is remembered as rather cute?\n\nWill historians recall only that for a funny little period people cared innocuously more than usual about “social justice?”\n\nOr will the reign of woke instead take its place alongside Mao’s Cultural Revolution, Stalin’s show trials and Pol Pot’s killing fields as a lower-fatality example of a whole society losing its collective mind?\n\nAs for that rear-view mirror, there are promising signs. Preferred pronouns are quietly dropping from email signatures. The sanctimonious University of Michigan is firing diversity, equity and inclusion (DEI) staff. Walmart has dropped the term DEI altogether. Investors are suing the retailer Target for putting commitments to DEI, environmental, social and governance and Pride Month above the interests of shareholders. Formerly left-wing Silicon Valley billionaires are publicly excited about, or even bidding to participate in, the Trump administration.\n\nThe atmosphere on podcasts is suddenly more permissive; why, it might finally be safe to make a joke.\n\nDemocratic media figures are drowning in self-pity, while the viewership of the hectoring MSNBC channel has plummeted. Red states are banning gender-defying care for minors, and these laws have a good chance of holding up in the Supreme Court. The word “retarded” is enjoying a comeback.\n\nStill, I worry that we’re jumping the gun. This dogma has infected all our institutions like a fungus. It won’t be easy to eradicate. Ever notice how quickly, after a full complement of treatments, athlete’s foot comes right back?\n\nOne American election won’t do the trick. There are too many people with a vested interest in wokery because “decolonizing the curriculum,” say, is their job. Many a museum director has been hired expressly to ensure an art collection doesn’t acquire work by white people.\n\nWon’t all go quietly\n\nNumerous black female hires who tick two boxes in a diversity “buy one, get one free” but are sometimes conspicuously under-qualified, such as ousted Harvard president Claudine Gay, owe their appointments to that fungal way of thinking, and they won’t all go quietly.\n\nAmerica’s entire Democratic Party is steeped in this brain rot, and Kamala Harris still came within 1.5 percentage points of winning the popular vote.\n\nOn both sides of the Atlantic, the universities, the judicial system, NGOs, the legal and medical professions, the news media, cultural institutions, theater, publishing, film: They’ve all been putrefied by the zombie fungus. Picture the special effects for “The Last of Us,” all those hairy tendrils and fibrous clumps crawling up the skyscrapers of Midtown Manhattan.\n\nSo this is a long fight that’s not yet won. That’s not to detract from the cheerful impression that we sane people do seem to have gained the upper hand right now.\n\nIndeed, I’ve never doubted that our level-headed and unindoctrinated contingent — however beleaguered, persecuted and shockingly few in number — has always been destined to win, because lunacy eventually collapses from its own contradictions. It has only ever been a question of how much longer we have to put up with this staggering bull.\n\nAs for the present juncture, I have a theory. Let’s remember the nature of the opposition. Wokesters are conformists. They didn’t invent their wretched ideas; they’re reading from a common hymn sheet.\n\nThat’s why they all use the same words and subscribe to the exact same roster of convictions, no matter how preposterous: these people aren’t original thinkers. But they imagine they’re at the cutting edge.\n\nBeing “progressive” means they’re in the vanguard. They think woke makes them modern, makes them hip.\n\nWhatever the more complex truth of the matter, it’s in our interest to promote the trope that woke is over. That woke has been vanquished. That woke is totally yesterday, hopelessly stale and played out. That the rest of us are moving on to genuinely thorny questions that aren’t stupid. That we’ll no longer waste our time pushing back against petty amateur linguists who insist we call the portly “people living with obesity.”\n\nThat, whatever our private reservations about the guy, Trump’s election marks a hard Before and After. That as Kamala would say, we’ve “turned the page” and “we’re not going back.”\n\nIs that an echo?\n\nBecause when you say something enough times (this is a gambit the wokesters themselves have mastered) you can make it true. Wokesters are highly suggestible. Furthermore, most of these folks don’t really care about social justice. They care about appearing to care about social justice. They care about other people’s esteem. They care about fitting in.\n\nThey echo what everyone else around them says, because being a mindless copycat means other mindless copycats will like them and they’ll keep their friends and their jobs. And they care about social fashion.\n\nSo they won’t spout lingo like “cisgender” if that might risk an eye-roll at parties. They won’t want to seem behind the times. If we convince them that woke is over, that their BLM lawn signs are passé, that maundering about “white privilege” is boring and old hat, they’ll drop the whole patriarchy/neurodiversity/heteronormativity et al package in a New York minute.\n\nWe just have to persuade them that woke is unhip. Which it always has been, but some people are slow.\n\nLionel Shriver’s latest book, “Mania,” is published by the Borough Press. Reprinted with permission from Spiked.","summary":"A decisive death knell for identity politics dangles the blessed possibility of no longer squandering our brief duration on this Earth on stupid conversations and debates.","url":"https://nypost.com/2024/12/30/opinion/woke-is-dead-lets-make-sure-it-never-comes-back/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-38z3jblup-1735606785992.jpg?quality=75&strip=all&1735588799&w=1200","video":null,"publish_date":"2024-12-31 01:02:42","author":"Lionel Shriver","authors":["Lionel Shriver"],"language":"en","source_country":"us","sentiment":-0.191},{"id":277203458,"title":"Court of Appeals upholds $5 million judgement against Trump in Carroll case","text":"A federal appeals court has upheld the multimillion-dollar award granted to writer E. Jean Carroll in her defamation case against Donald Trump.\n\nA panel of three judges from the 2nd U.S. Circuit Court of Appeals issued a ruling stating that Trump failed to demonstrate any errors made by the district court during the trial. The ruling also mentioned that Trump did not prove that any errors had a significant impact on his rights, which would warrant a new trial.","summary":"Journalist E. Jean Carroll is seen leaving the courthouse after the damages&#8230;","url":"https://internewscast.com/crime/court-of-appeals-upholds-5-million-judgement-against-trump-in-carroll-case/","image":"https://internewscast.com/wp-content/uploads/2024/12/rewrite-this-title-Five-charged-over-ex-One-Direction-star-Liam.au2Ffs2Ff030a5f3-5b59-4ae3-8ee0-8db7e506280c-380x200.jpeg","video":null,"publish_date":"2024-12-31 01:02:03","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.428},{"id":277202998,"title":"Editorial | Jimmy Carter’s pragmatism and humility offer lessons for the world","text":"Jimmy Carter collected his 2002 Nobel Peace Prize voicing hope that a “bond of our common humanity” would overcome divisions.\nThe late former US president will be remembered for living by that approach, including when he hosted Chinese leader Deng Xiaoping at the start of arguably the best era in China-US ties.\nBeijing was among those around the world sending tributes after Carter died on Sunday aged 100, saying it highly valued his “long-time significant contributions” in promoting the development of bilateral relations and “friendly exchanges and cooperation”.\nPresident Xi Jinping yesterday sent his condolences to his US counterpart, Joe Biden.\nDeng’s Washington visit happened in 1979, when Carter completed work started years earlier by his predecessor Richard Nixon to usher in full diplomatic relations with Beijing.\nIn their White House meeting, Carter and Deng wisely set aside certain entrenched differences enough to achieve “strategic ambiguity” on difficult issues, opening doors to unprecedented cooperation in science, technology, education and commerce.\nDespite opposition from some US lawmakers and critics, Carter insisted he had made the right decision to normalise ties with Beijing. But he also signed the Taiwan Relations Act meant to preserve “non-official” relations with the island. The law remains a sticking point in China-US ties to this day.\nOn the other hand, Carter worked as a peacemaker for more than four decades after leaving office.\nHe was received by almost every former and serving Chinese leader including Jiang Zemin, who called Carter “an old friend” of China. Xi welcomed Carter and his wife, Rosalynn, to Beijing for talks in 2012.\n\nAs president, Carter brought Egyptian and Israeli leaders together, signed treaties over the Panama Canal and with the former Soviet Union on nuclear arms.\nVoters denied him a second term amid inflation, a recession triggered by a fuel shortage, the Soviet invasion of Afghanistan, and the Iran hostage crisis.\nBut his influence in world affairs remained. Carter reminded his successors about an era when people-to-people contacts thrived.\nIn 2019, he wrote to then-president Donald Trump warning of a potential “modern cold war”, contrasting US military spending with China’s focus on infrastructure investment.\nCarter had connections with Hong Kong, too. Hongkongers joined the Carters in India building homes for the poor with the non-profit Habitat for Humanity in 2006. Five years later, he opened a branch of his global non-profit organisation at Baptist University.\nCarter’s passing is poignant against the backdrop of the recent deterioration of China-US ties. Leaders should reflect on the political will and wisdom that found common humanity in the past as they work to stabilise the world’s most important bilateral relationship.","url":"https://www.scmp.com/opinion/comment/article/3292814/jimmy-carters-pragmatism-and-humility-offer-lessons-world","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/12/31/3e74b732-a649-4913-951d-8f5338a28955_787b95c5.jpg","video":null,"publish_date":"2024-12-31 01:00:50","author":"Scmp Editorial","authors":["Scmp Editorial"],"language":"en","source_country":"hk","sentiment":0.237},{"id":277203000,"title":"Our most-read PostMag stories of 2024, from Donald Trump’s yacht sale, to martial arts star Sammo Hung and the Taylor Swift of ancient China","text":"From Donald Trump’s bid to sell an overpriced yacht and an ancient Chinese version of Taylor Swift, to Hong Kong martial arts legend Sammo Hung and the untimely death of iconic singer Teresa Teng, here are our favourite, most-read online stories of the year from PostMag, formerly known as Post Magazine.\n1. When Donald Trump tried to sell for US$115 million a yacht he bought for US$30 million from the Sultan of Brunei\n\nIn 1990, Donald Trump attempted to sell the Trump Princess yacht for US$115 million, despite purchasing it for US$30 million from the Sultan of Brunei. Hong Kong ship brokers doubted it would attract serious bids, considering the inflated price, reported the South China Morning Post at the time.\n2. What the butler saw: Teresa Teng’s death in Chiang Mai in Thailand, and how she found love there\n\nTeresa Teng, the iconic singer, died tragically in Chiang Mai, Thailand in 1995, sparking numerous conspiracy theories. Her untimely death at the height of her fame, aged just 42, could perhaps be compared to the deaths of Elvis Presley, Marilyn Monroe or Princess Diana. A former employee of the hotel where she died recalls that fateful day.\n3. How Taylor Swift’s Singapore effect could only have been achieved in ancient China by one singer, who briefly soared before losing everything\n\nYongxin was a singer who rose to fame during the Tang dynasty, only to lose everything after a rebellion. The fate of the chanteuse, whose voice captivated an emperor until events led her to sing on the streets, demonstrates the ephemeral nature of fame and fortune. Taylor Swift beware!\n4. Why, for some Chinese, ninth day of Lunar New Year is the most important: it’s the day they worship the Jade Emperor – and sugar cane is involved\n\nThe Jade Emperor, or Lord of Heaven, is the supreme god in the Chinese pantheon, and the ninth day of Lunar New Year is a day many in China worship the deity. Among offerings is sugar cane because, as the story goes, in the time of the Ming dynasty on the Lord’s feast day, villagers hid from Japanese pirates in sugar cane fields and were spared.\n5. Hong Kong martial arts film icon Sammo Hung on his career, stars including Donnie Yen, Bruce Lee and Jackie Chan – and eating\n\nHong Kong actor, director and action choreographer Sammo Hung spoke to the South China Morning Post ahead of receiving the 2024 Hong Kong Film Awards’ Lifetime Achievement Award. He told of his extraordinary career spanning over 200 films and shared insights on fellow martial arts stars like Donnie Yen, Bruce Lee and Jackie Chan.","url":"https://www.scmp.com/postmag/culture/article/3291721/our-most-read-postmag-stories-2024-donald-trumps-yacht-sale-martial-arts-star-sammo-hung-and-taylor","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/12/20/5a8c6920-e581-4bb3-a54c-a9e3a0b2335c_2fe4ce9f.jpg","video":null,"publish_date":"2024-12-31 01:00:50","author":"Postmag Reporter","authors":["Postmag Reporter"],"language":"en","source_country":"hk","sentiment":0.457},{"id":277202452,"title":"Kyodo News Digest: Dec. 31, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nChina charged Japanese woman with espionage for activities in Japan\n\nTOKYO - China detained a Japanese woman in 2015, alleging she had engaged in spying activities in Japan, sources familiar with the bilateral relationship said Monday, marking the first known case in which actions taken in Japan became the basis for Chinese criminal prosecution.\n\nThe woman, a Chinese-born former executive of a Japanese language school in her 60s, was detained in Shanghai during a business trip after allegedly conveying a Chinese diplomat's views on the Tokyo-controlled, Beijing-claimed Senkaku Islands in the East China Sea to the Japanese government, the sources said.\n\nTOKYO - Japanese Prime Minister Shigeru Ishiba is seeking to visit the United States to meet with Donald Trump after his inauguration as president on Jan. 20, Japanese government officials said late Monday.\n\nThe president-elect expressed his willingness to hold talks with Ishiba during a press conference on Dec. 16 and, according to a Japanese government source, informed Tokyo of his intention to do so possibly in mid-January before he returns to the White House.\n\nTOKYO - The Nikkei stock index ended the final trading day of 2024 on a down note but, for the year, rose 19 percent from 2023, closing at a record high on strong corporate earnings and a weaker yen boosting export-oriented stocks.\n\nThe 225-issue Nikkei Stock Average ended down 386.62 points, or 0.96 percent, from Friday at 39,894.54. The broader Topix index finished 16.76 points, or 0.60 percent, lower at 2,784.92.\n\nWASHINGTON - Former U.S. President Jimmy Carter, who received the 2002 Nobel Peace Prize for his contribution to peace in the Middle East and easing tensions on the Korean Peninsula in the 1990s, died Sunday, the Carter Center said. He was 100.\n\nCarter, the longest-living former U.S. president in history, who entered hospice care nearly two years ago, died peacefully at his home in Plains, Georgia, surrounded by his family, according to the center.\n\n3 die in hotel fire in Bangkok tourist area, Japanese may be injured\n\nBANGKOK - Three tourists died, and several others, possibly including Japanese nationals, were injured after a fire broke out Sunday night at a hotel near a popular tourist destination in Bangkok, according to media reports and other sources.\n\nAll three fatalities were foreign tourists, identified as a Brazilian woman, a Ukrainian man, and an American man, The Associated Press said Monday, citing Thai police.\n\nJapan's Resona Bank online services hit by suspected cyberattack\n\nTOKYO - Resona Bank said its internet banking service for individual clients was temporarily disrupted through early Monday, suspecting it has been targeted by a cyberattack similar in nature to those that recently struck other Japanese companies.\n\nThe bank said transactions were suspended from around 9 p.m. Sunday to 1:15 a.m. Monday, indicating it may have been the victim of a distributed denial-of-service, or DDoS attack, in which networks are overwhelmed by data from multiple sources over a short period.\n\nTOKYO - Kazuto Ioka's New Year's Eve title rematch against WBA super flyweight champion Fernando Martinez has been canceled after the Argentine developed influenza, Ioka's Shisei gym said Monday.\n\nThe South American boxer requested the cancellation just before the weigh-in the same day. He is expected to retain his world title as the fight was called off due to the illness.\n\nVideo: Shrines in Noto Peninsula ready for New Year visits ahead of 1st anniv. of quake","summary":"Gravestones remain collapsed in Wajima, Ishikawa Prefecture, on Dec. 24, 2024, almost one year...","url":"https://english.kyodonews.net/news/2024/12/659719cb1305-kyodo-news-digest-dec-31-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/0060a98d5356934e8285684c57396860/photo_l.jpg","video":null,"publish_date":"2024-12-31 00:54:51","author":null,"language":"en","source_country":"jp","sentiment":-0.306},{"id":277202454,"title":"Ishiba to seek talks in U.S. with Trump after inauguration","text":"Japanese Prime Minister Shigeru Ishiba is seeking to visit the United States to meet with Donald Trump after his inauguration as president on Jan. 20, Japanese government officials said late Monday.\n\nThe president-elect expressed his willingness to hold talks with Ishiba during a press conference on Dec. 16 and, according to a Japanese government source, informed Tokyo of his intention to do so possibly in mid-January before he returns to the White House.\n\nBut Ishiba thought it would be desirable for both sides to hold a first formal bilateral summit when he visits the United States in February or possibly later, the officials said.\n\nIshiba, who took office in October, told reporters last week he intended to meet with Trump \"at an early date\" to reinforce the bilateral alliance, noting there are \"various views\" within the government about when would be the best time.\n\nSome in the Japanese government favor a meeting between Ishiba and Trump in mid-January as the schedule would give the premier more time to prepare for the next parliamentary session, according to the officials.\n\nDuring the annual ordinary parliamentary session, which typically opens in late January, Japan's prime minister is busy attending debates to win approval from lawmakers for pressing matters such as a budget for the upcoming fiscal year which begins in April.\n\nMeanwhile, his other deputies believe Tokyo should be in no rush to arrange the bilateral meeting as it would be difficult to achieve substantial results through such an event before Trump is back in power, the officials added.\n\nThe Japanese government and the ruling parties are likely to convene the ordinary parliamentary session on Jan. 24.\n\nRelated coverage","summary":"TOKYO - \n \n\nJapanese Prime Minister Shigeru Ishiba is seeking to visit the United States to meet wi...","url":"https://english.kyodonews.net/news/2024/12/4e3d336e7d18-ishiba-to-seek-talks-in-us-with-trump-after-inauguration.html","image":"https://img.kyodonews.net/english/public/images/posts/5da2fc29969ce74d638fa69361650cca/cropped_image_l.jpg","video":null,"publish_date":"2024-12-31 00:54:51","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":-0.039},{"id":277202974,"title":"Lara Loomer comes for ‘welfare queen’ Elon Musk as MAGA war escalates","text":"Lara Loomer again attacked Donald Trump’s “best buddy” Elon Musk on Monday, this time for being a “welfare queen” who has profited from both hefty government subsidies and special visas for his immigrant tech workers.\n\nShe also called Musk on X a “Stage 5 clinger” as he relentlessly orbits around Trump and “slithers” into Mar-a-Lago. “I don’t think that it’s acceptable for billionaires to have this much power and this much access,” she emphasized.\n\nThe blast was the second major hit involving the right-wing gadfly over the double standard on immigrants taking American jobs between what Trump promised his MAGA supporters and Musk’s insistence that H-1B visas continue to be protected for upper-level foreign tech workers.\n\n“What is it going to mean for the future of our country, our national security and the incoming Trump administration if we have a bunch of technocrats, who are also essentially welfare queens because their companies are receiving government subsidies, and they want to take over our defense industry?” Loomer asked Trump’s former White House strategist Steve Bannon on his right-wing War Room podcast.\n\nBannon was even harsher, saying that “sociopathic” Musk and other tech leaders owed the nation “reparations“ for the jobs they have stolen from Americans.\n\n“We haven’t fought these battles over years and years and years to allow American citizens of every race, ethnicity, religion, be gutted by the sociopathic overlords in Silicon Valley,” Bannon raged. “Vivek Ramaswamy ... Elon Musk ... We want it gone ... We want reparations for the tech workers that you stole their lives.”\n\nBannon noted that the issue is “central to the way they gutted the middle class in this country.”\n\nMusk has vowed to go to the mat to protect H-1B immigrants that populate the top tiers of his companies. As for those that oppose Musk, “F***k yourself in the face,” he wrote on X. Trump is now supporting Musk in his fight, though has blasted H-1B visas in the past.\n\nMusk’s companies, meanwhile, have raked in some billions of dollars in U.S. taxpayer-funded subsidies (and major tax cuts) for Tesla and Space X. \n\nThe Los Angeles Times reported in 2015 that Musk’s Tesla empire alone benefited from about $4.9 billion in government subsidies, based on an estimate using a compilation of grants, tax breaks, factory construction, discounted loans, environmental credits, and Tesla buyer tax credits and rebates. His companies have also collected some $20 billion in federal contracts over the past 16 years, USA Today has estimated, citing federal contracting data.\n\nMusk has insisted foreign workers are critical to the success of the American tech industry, while MAGA diehards want American jobs for Americans.\n\nThe tech billionaire last week endorsed a post on X, which he has since deleted, denigrating American workers as “re***ded,” a word widely considered an ugly slur. \n\nVivek Ramaswamy, Musk’s partner in the upcoming Trump-apppointed DOGE task force aiming to carve up the federal government, also blasted Americans as less desirable employees to brainier foreign hires in the U.S. tech world. He blamed the dumbing down of Americans on U.S. culture and the nation’s education even as the incoming Trump administration plans to eliminate the federal Department of Education.","summary":"Steve Bannon, meanwhile, calls for ‘reparations’ from ‘sociopathic’ Musk for jobs he has stolen from Americans with immigrant workers at his companies","url":"https://www.independent.co.uk/politics/maga-loomer-welfare-queen-musk-b2671751.html","image":"https://static.independent.co.uk/2024/12/30/14/GettyImages-1395371342.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/ycDaAiU0-4VHSaSK0.mp4","publish_date":"2024-12-31 00:52:08","author":"Mary Papenfuss","authors":["Mary Papenfuss"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.238},{"id":277201232,"title":"China hacked US treasury - NYT","text":"Jimmy Carter, US President, Nobel Prize Winner, dead at 100Israeli government keeping tight lid on Gaza news coverageSouth Korean airliner crashes, bursts into flamesUSS Cole sailors greeted with cheers on return home before Christmas\n\n China hacked US treasury - NYT The cybersecurity breach was classified as a \"major incident,\" with the intelligence community assessing its impact Alleged state-sponsored Chinese hackers have infiltrated the US Treasury Department, gaining access to unclassified documents and certain workstations used by government employees, according to a letter sent by the department to lawmakers on Monday.The Treasury Department was alerted to the breach on December 8 by BeyondTrust, a third-party software service provider. The hackers obtained a security key used by the vendor to secure a cloud-based service that remotely provides technical support for Treasury Departmental Offices (DO) end users. With this key, the perpetrators were able to override the service's security, remotely access specific workstations, and gain access to unclassified documents maintained on those systems.\"Based on available indicators, the incident has been attributed to a Chinese state-sponsored Advanced Persistent Threat (APT) actor,\" the Treasury Department stated in a formal letter dated December 30. The department classified this breach as a major cybersecurity incident and has collaborated with the FBI, the intelligence community, and other investigators to assess the hack's impact. The compromised service has been taken offline, and there is no evidence that the perpetrators still have access to Treasury information.A spokesperson for the Treasury Department emphasized the seriousness with which they treat such threats and their commitment to working with both private and public sector partners to protect the financial system, according to the New York Times. More details about the breach will be provided in a 30-day supplemental report to Congress.This incident follows recent reports of another breach by a separate alleged Chinese hacking group known as Salt Typhoon, which penetrated deep into US telecommunications systems. The hackers gained access to the phone conversations and text messages of US officials, reportedly including those of President-elect Donald J. Trump and Vice President-elect JD Vance in what was described as \"the largest telecommunications hack in our nation's history.\" The Salt Typhoon breach targeted the networks of major telecommunications companies such as AT&T, Verizon, and Lumen. This access provided the hackers with valuable insights into US surveillance operations, including a nearly complete list of phone numbers that the Justice Department has wiretapped to monitor individuals suspected of crimes or espionage.Beijing has consistently dismissed hacking accusations from Washington. Earlier this month, the Chinese Foreign Ministry stated that the US uses hacking claims to vilify China and justify unilateral sanctions.\"We urge the US to stop using cybersecurity issues to smear and vilify China and to cease imposing illicit unilateral sanctions,\" Chinese Foreign Ministry spokesperson Mao Ning stated. \n\n China hacked US treasury - NYTChina hacked US treasury - NYTRT.com 31st December 2024, 11:02 GMT+11 The cybersecurity breach was classified as a \"major incident,\" with the intelligence community assessing its impact Alleged state-sponsored Chinese hackers have infiltrated the US Treasury Department, gaining access to unclassified documents and certain workstations used by government employees, according to a letter sent by the department to lawmakers on Monday.The Treasury Department was alerted to the breach on December 8 by BeyondTrust, a third-party software service provider. The hackers obtained a security key used by the vendor to secure a cloud-based service that remotely provides technical support for Treasury Departmental Offices (DO) end users. With this key, the perpetrators were able to override the service's security, remotely access specific workstations, and gain access to unclassified documents maintained on those systems.\"Based on available indicators, the incident has been attributed to a Chinese state-sponsored Advanced Persistent Threat (APT) actor,\" the Treasury Department stated in a formal letter dated December 30. The department classified this breach as a major cybersecurity incident and has collaborated with the FBI, the intelligence community, and other investigators to assess the hack's impact. The compromised service has been taken offline, and there is no evidence that the perpetrators still have access to Treasury information.A spokesperson for the Treasury Department emphasized the seriousness with which they treat such threats and their commitment to working with both private and public sector partners to protect the financial system, according to the New York Times. More details about the breach will be provided in a 30-day supplemental report to Congress.This incident follows recent reports of another breach by a separate alleged Chinese hacking group known as Salt Typhoon, which penetrated deep into US telecommunications systems. The hackers gained access to the phone conversations and text messages of US officials, reportedly including those of President-elect Donald J. Trump and Vice President-elect JD Vance in what was described as \"the largest telecommunications hack in our nation's history.\" The Salt Typhoon breach targeted the networks of major telecommunications companies such as AT&T, Verizon, and Lumen. This access provided the hackers with valuable insights into US surveillance operations, including a nearly complete list of phone numbers that the Justice Department has wiretapped to monitor individuals suspected of crimes or espionage.Beijing has consistently dismissed hacking accusations from Washington. Earlier this month, the Chinese Foreign Ministry stated that the US uses hacking claims to vilify China and justify unilateral sanctions.\"We urge the US to stop using cybersecurity issues to smear and vilify China and to cease imposing illicit unilateral sanctions,\" Chinese Foreign Ministry spokesperson Mao Ning stated. \n\n Read This Next Investors exit stocks Monday, Dow Jones tumbles 418 pointsToyota donating $1 million to Trump's inaugurationTurkey's central bank lowers key interest rate to 47.5%Average rate on 30-year mortgage climbs to 6.85%, highest since JulyAirport with runway straddling border of U.S. and Canada to close \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2024 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274904946/china-hacked-us-treasury---nyt","image":"https://cdn.bignewsnetwork.com/ZThkYTRiMjAtMWI.jpg","video":null,"publish_date":"2024-12-31 00:45:50","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.148},{"id":277201770,"title":"Trump enforces prohibition on social media for his Cabinet selections following internal conflict within MAGA.","text":"Donald Trump ’s Chief of Staff has told nominees for Cabinet positions not to post on social media without approval ahead of their Senate confirmation hearings. In a memo reported by the New York Post, Susie Wiles wrote: ‘While this instruction has been delivered previously, I am reiterating that no member of the incoming administration or Transition speaks for the United States or the President-elect himself.\n\n‘Accordingly, all intended nominees should refrain from any public social media posts without prior approval of the incoming White House counsel.’ It came ahead of the start of Senate confirmation hearings for nominees next week. The instruction was reportedly not a consequence of recent social media storms sparked by Elon Musk over migrant visas.\n\nEarlier this week Musk, who will head Trump’s Department of Government Efficiency (DOGE), threatened to ‘go to war’ with MAGA Republicans after he defended visas for skilled foreigners. Trump sided with Musk after a fierce debate over immigration visas sent his supporters into a meltdown. Meanwhile, Democratic senators are fiercely fighting some of Trump’s picks for his second administration.\n\nThey have little power to prevent Trump’s choices from taking their new posts. After the 2024 election the Senate flipped red giving Republicans more seats. Cabinet confirmations only require a simple majority in the 100-member chamber. That means, as long as Republicans stick together, Trump should be able to put his team in place in the new year.\n\nThe most controversial picks include Pete Hegseth to lead the Pentagon, and Kash Patel for head of the FBI. Also in the spotlight are Robert Kennedy Jr., who Trump wants to lead the Department of Health and Human Services (HHS), and Tulsi Gabbard, who he wants as his Director of National Intelligence.\n\nThe row involving Musk came over his support for the H-1B visa program, which allows highly educated immigrants to work in the U.S. for up to six years. Tech companies have used H-1B visas for skilled foreign workers and say they are a critical tool for hard-to-fill positions.\n\nBut some members of Trump’s movement have accused Musk, and others in Trump’s new flank of tech-world supporters, of pushing policies at odds with the ‘America First’ vision.\n\nThey argue the system undercuts U.S. citizens who could take those jobs and have called for it to be eliminated. Musk’s remarks about the visas came after Vivek Ramaswamy, who will co-run the DOGE with him, said this week that American culture was to blame for its need to hire foreign workers.\n\nWant more stories like this from the Daily Mail? Visit our profile page and hit the follow button above for more of the news you need.","summary":"Donald Trump ’s Chief of Staff has told nominees for Cabinet positions&#8230;","url":"https://internewscast.com/celeb/celeb-news/trump-enforces-prohibition-on-social-media-for-his-cabinet-selections-following-internal-conflict-within-maga/","image":"https://i.dailymail.co.uk/1s/2024/12/30/21/93597349-0-Donald_Trump_s_Chief_of_Staff_has_told_nominees_for_Cabinet_posi-a-413_1735592927090.jpg","video":null,"publish_date":"2024-12-31 00:44:09","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.029},{"id":277202022,"title":"Musk Still Crashing at Mar-a-Lago Bachelor Pad to Be Near Bestie Trump: Report","text":"Elon Musk, a key megadonor in the 2024 election, has apparently decided he can’t risk being away from President-elect Donald Trump for more than a few days at a time. To that end, he has since Election Day mainly resided in a cottage at Trump’s Mar-a-Lago club in Palm Beach, Florida, according to a report from The New York Times.\n\n The resort cottage, which is named Banyan and sits a mere few hundred feet from the main residence, ordinarily rents for $2,000 a night. It’s not known whether Musk has paid (or expects to pay) for his many sleepovers in the past two months, or if Trump is accommodating him as a personal guest, as many of Musk’s friends in Silicon Valley do when he visits their homes. But Trump has been known to charge exorbitantly for stays at his properties when he has the opportunity. During his many visits to Mar-a-Lago and his hotels in his first term as president, for instance, he billed the Secret Service as much as five times the government rate for agents traveling with him and his family. Of course, Musk, who’s worth a reported $429 billion, shouldn’t have any trouble covering inflated charges.\n\n Musk’s continued proximity to Trump has been a source of mockery, tension, and speculation as the world’s richest man seeks to push through his personal agenda in Trump’s second term. Less than two weeks after the election, Musk reportedly had a “massive blowup” with a Trump advisor at a Mar-a-Lago dinner over Cabinet picks. His outsize influence over the incoming administration led to grumbling among some MAGA insiders and Democratic taunts about Musk being the actual president — comments that Trump, ever covetous of the spotlight, has publicly attempted to push back against.\n\n Yet Trump also appeared to follow Musk’s lead in opposing a funding deal to avert a government shutdown earlier this month, releasing a statement condemning the bipartisan bill only after Musk repeatedly attacked it on his website X, formerly Twitter. (The House was able, at the last minute, to pass a revised bill that stripped out much of the money originally earmarked for child cancer research, provisions cracking down on junk fees from hotels and ticket sellers, and reforms that would have required so-called pharmacy benefit managers to pass on drug cost savings to insurance plans.) Trump also sided with Musk in a recent schism between the billionaire’s Big Tech clique and anti-immigration MAGA influencers over hiring foreign workers through the H-1B visa program.\n\n And, in a social media post two days after Christmas that was intended to be private (as Trump’s own staff reportedly confirmed), the soon-to-be leader of the free world awkwardly beseeched the Tesla and SpaceX CEO to return to Mar-a-Lago after a brief absence during the holiday. “Where are you?” Trump wrote on Truth Social. “When are you coming to the ‘Center of the Universe,’ Mar-a-Lago. Bill Gates asked to come, tonight. We miss you and x! New Year’s Eve is going to be AMAZING!!! DJT” The “x” Trump missed was evidently Musk’s 4-year-old son, X Æ A-Xii, one of two children — of the at least 11 Musk has — who have stayed with their father at the club.\n\n With just weeks until Trump’s inauguration, Musk is indeed likely to return to his Palm Beach bachelor pad to sit in on more meetings and calls, seeking any personal advantage during the transition of presidential power. His new commission with pharma businessman Vivek Ramaswamy, the Department of Government Efficiency (DOGE), has been busy proposing how to gut agencies and slash regulations in order to benefit their own businesses, and those of other friends. It makes perfect sense that Musk — however much he enjoys dining alongside Trump day in and out — would want to ensure that his investment of a quarter-billion dollars in the 2024 campaign pays those dividends.\n\n At the same time, Musk’s political interests have drifted somewhat. Of late, when he’s not allegedly demonetizing the Trump allies who disagree with him on X, he has trumpeted his support for the far-right Alternative for Germany (AfD) party, which has connections to neo-Nazis. Musk now contends that the AfD alone can “save” Germany, and on Monday declared on X that the party “is going to win an epic victory!” The German government has accused Musk of trying to influence its federal election in February. \n\n That meddling should come as no surprise after a Trump comeback that insiders complain Musk has claimed undue credit for. Still, prioritizing an election abroad instead of U.S. policy in the next two months could further complicate his delicate and co-dependent bromance with Trump. Whatever happens, Musk’s final tab for the long stay at Mar-a-Lago is sure to tell the story.","summary":"The powerful MAGA megadonor has apparently decided he can't bear to be apart from the president-elect","url":"https://www.rollingstone.com/politics/politics-news/trump-musk-mar-a-lago-1235221682/","image":"https://www.rollingstone.com/wp-content/uploads/2024/12/elon-musk-mar-a-lago.jpg","video":null,"publish_date":"2024-12-31 00:42:19","author":"Miles Klee","authors":["Miles Klee"],"language":"en","source_country":"us","sentiment":-0.353},{"id":277200314,"title":"Biden Has Gall to Lecture Us About 'Decency' When Asked a Question on Trump After Jimmy Carter's Death","text":"It was announced on Sunday that Jimmy Carter, the 39th president and our longest living president, died at the age of 100. President Joe Biden spoke about the former president that same day, while still vacationing on St. Croix. \n\nEven while on yet another vacation, Biden sounded old and tired. He also came off as bitter, especially with his response to a question from a reporter about what President-elect Donald Trump could take away from Carter. The reporter managed to ask her question even as the president's handlers could be heard screaming at the press.\n\n\"Decency, decency, decency,\" Biden reiterated with his creepy smile. \"Everybody deserves a shot, everybody,\" Biden continued, still wearing that smile and even sounding as if he was slurring his words a bit. \"Can you imagine Jimmy Carter walking by someone who needed something and just keep walking? Can you imagine Jimmy Carter referring to someone by the way they look or the way they talk? I can't, I can't,\" Biden also emphasized, as he slightly stuttered. \n\n\"You know, I think the end of the deal here is that one of the reasons why we're looked to by the rest of the world,\" Biden continued, offering it's because \"we've laid out what our values are\" and \"we've said what we believe,\" as he spoke about the Declaration of Independence and how there's \"a feeling\" and the rest of the world supposedly \"looks to us, and he was worth looking to,\" with Biden once more speaking about Carter. He then thanked the press and left.\n\nThe unmitigated gall of the corrupt Biden lecturing Americans on decency off of Carter's death pic.twitter.com/B0kTiVfaFq— Jorge Bonilla (@BonillaJL) December 30, 2024\n\nBiden's remarks have garnered plenty of attention, as our sister sites of RedState and Twitchy covered. Users have chimed in to point out he himself doesn't have such \"decency\" and ought not to be lecturing anyone about it, given that he and First Lady Jill Biden have been particularly cruel towards one of their grandchildren, Navy Joan Roberts, the daughter of First Son Hunter Biden. \n\nThey didn't acknowledge the little girl until July of last year, as part of a Friday news dump of sorts, and even then they've still left her out.\n\nPretty sure Carter at least acknowledged all of his grandkids… https://t.co/rNeXQ54jjZ— Vanessa (@Nessakins_) December 30, 2024\n\nFrom a man who sat by while his crackhead son tried to abandon a child.Who slandered an innocent man - literally for decades - as a murderer.Who didn’t have the DECENCY not to check his watch during a Dignified Transfer.I’m not fan of Carter, but Biden isn’t fit to wipe…— Diana Villiers (@DianaVilliers1) December 30, 2024\n\nSays the man who raised the son who cheated on his wife with his ex-sister in-law, you remember the sister in-law he had from his brothers who passed away. Then Mr. Decency pardoned his guilty son & lastly Mr Decency disowns his own grand-daughter to this day.Solid senile Joe— JM (@jamerritt4) December 30, 2024\n\nWhen it comes to his point about how \"we're looked to by the rest of the world,\" the world is in a far worse, less stable place thanks to Biden and his presidency. Our enemies have not only been emboldened, as we saw after that chaotic Afghanistan withdrawal, with Russia's invasion of Ukraine and Hamas attack of Israel also happening under Biden's watch, but our allies are left not knowing if they can count on us. Trump is already pretty much the one in charge, as other world leaders have recognized. \n\nAnother point about \"decency\" comes into play with how Democrats--first Biden in his foolhardy attempt to run for reelection, and then Vice President Kamala Harris as his replacement--ran their 2024 campaign. Even after the first assassination attempt against Trump on July 13 in Butler, Pennsylvania, which resulted in the death of Corey Comperatore, Democrats still continued with their rhetoric about how Trump was supposedly a threat to democracy. \n\nHarris also stuck to how Trump was supposedly a fascist and she and her running mate, Gov. Tim Walz (D-MN), shamefully doubled down on how Trump's supporters were Nazis for daring to attend a rally that Trump held at Madison Square Garden (MSG) days before the election. The ridiculous comparison comes as the Nazis held a rally at MSG on February 20, 1939, when it was at a totally different location.\n\nJonathan Turley, as our sister sites of Twitchy and RedState also covered, put out a thread comparing Biden to Carter. Turley detailed how Biden pardoned Hunter, while Carter did no such thing with his brother, Billy in what Turley described as a \"corruption scandal.\"\n\n...While criminal charges were not brought, there were lingering questions about the $200,000 \"loan\" from Libya and allegations that he paid back only $1000. There were also allegations of other payments in influence-peddling allegations. Sound familiar?...— Jonathan Turley (@JonathanTurley) December 30, 2024\n\n...Here is Carter's statement at the time:\"I am deeply concerned that Billy has received funds from Libya and that he may be under obligation to Libya. These facts will govern my relationship with Billy as long as I am president. Billy has had no influence on U.S. policy or…— Jonathan Turley (@JonathanTurley) December 30, 2024\n\n\"...Instead of showing Carter's honesty, Biden lied for years and then pardoned his own son after repeatedly denying that he would ever do so during the campaign. He pardoned his son for any crimes committed over a ten-year period, including potential crimes that many believe implicated the President himself in the multimillion influence-peddling operation[,]\" Turley wrote towards the end of his thread. \n\n...That record is precisely why \"Some look at Jimmy Carter and see a man of a bygone era with honesty and character.\" They look at Biden himself and say \"We'd all do well to try to be more like Jimmy Carter.\" https://t.co/pkNZaYBrjv— Jonathan Turley (@JonathanTurley) December 30, 2024\n\nSpeaking of Trump, he released a statement over Truth Social on Sunday in response to Carter's death, one that even liberals have been praising.\n\nSuch a statement mentioned in part how \"we all owe [Carter] a debt of gratitude\" and in conclusion read that \"Melania and I are thinking warmly of the Carter Family and their loved ones during this difficult time. We urge everyone to keep them in their hearts and prayers.\"\n\nWho wrote this? Hire him or her for all statements please and thank you 💕 pic.twitter.com/zzh2RDGMqJ— Jessica Tarlov (@JessicaTarlov) December 29, 2024","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/30/biden-has-the-gall-to-lecture-us-about-decency-when-speaking-on-jimmy-carters-death-n2649778","image":"https://media.townhall.com/cdn/hodl/2021/134/b37127ac-6bc1-49f4-b7fe-6cc18f2cc853.jpg","video":null,"publish_date":"2024-12-31 00:36:50","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.323},{"id":277200936,"title":"Biden Plans to Provide Ukraine with $4 Billion in Weaponry","text":"Joe Biden, the President of the United States, has made an announcement regarding sending additional weapons worth almost US$2.5 billion to Ukraine. This decision comes as part of the administration’s effort to utilize all available funds to support Kyiv in its resistance against Russia, before the upcoming transition to President-elect Donald Trump.\n\nThe allocation comprises US$1.25 billion in presidential drawdown authority, permitting the military to utilize existing stock and expedite the delivery of weapons to the battlefield. Furthermore, it includes US$1.22 billion in longer-term weapons packages that will be contracted through the Ukraine Security Assistance Initiative (USAI).\n\nThe primary goal behind the Biden administration’s urgency in supplying weapons to Ukraine is to bolster Kyiv’s negotiating stance as much as possible before the inauguration of President Trump on January 20.\n\nTrump has talked about getting some type of negotiated settlement between Ukraine and Russia and has praised Russian President Vladimir Putin.\n\nMany US and European leaders are concerned that Trump’s talk of a settlement might result in a poor deal for Ukraine, and they worry that he won’t provide Ukraine with all the weapons funding approved by Congress.\n\nThe weapons systems being pulled from existing stockpiles through this latest weapons package include counter-unmanned aerial systems munitions, air defence munitions, ammunition for High Mobility Artillery Rocket Systems (HIMARS), 155mm and 105mm artillery ammunition, air-to-ground munitions, anti-armor systems, tube-launched missiles, fragmentation grenades, and other items and spare parts.\n\nIncluding Monday’s announcement, the US has provided more than US$65 billion ($104.47 billion) in security assistance to Ukraine since Russia invaded its neighbor in February 2022.","summary":"Joe Biden, the President of the United States, has made an announcement&#8230;","url":"https://internewscast.com/news/au/biden-plans-to-provide-ukraine-with-4-billion-in-weaponry/","image":"https://internewscast.com/wp-content/uploads/2024/12/Biden-to-send-4-billion-worth-of-weapons-to-Ukraine.au2Ffs2Fe30ace2d-26e0-4c7e-9856-96c2d75271bb.jpeg","video":null,"publish_date":"2024-12-31 00:36:16","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.238},{"id":277201016,"title":"Trump loses bid to toss verdict in E. Jean Carroll case","text":"Trump loses bid to toss verdict in E. Jean Carroll case\n President-elect Donald Trump has lost a bid to overturn a $5 million dollar verdict against him for sexual abuse and defamation. A federal appeals court upheld the damages awarded to E. Jean Carroll, who accused Trump of raping her in a department store dressing room about 30 years ago.","summary":"President-elect Donald Trump has lost a bid to overturn a $5 million dollar verdict against him for sexual abuse and defamation. A federal appeals court upheld the damages awarded to E. Jean Carroll, who accused Trump of raping her in a department store dressing room about 30 years ago.","url":"https://www.cbsnews.com/video/trump-loses-bid-to-toss-verdict-in-e-jean-carroll-case/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/12/31/8f91e791-5cdd-4233-b2fd-3c0e580556fd/thumbnail/1200x630/a38407c59dd7c2fb9ee91b2a475f0438/1230-en-trumptrial.jpg?v=fa9977353833f46f40b07abcd9d5240b","video":null,"publish_date":"2024-12-31 00:34:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.188},{"id":277200312,"title":"Congresswoman, 68, retires to set better example for aging politicians","text":"A 68-year-old congresswoman is retiring in part to set a better example for other aging politicians.\n\nNew Hampshire Representative Annie Kuster told The Boston Globe that she hopes some of her colleagues will be inspired to leave Congress, and that she wishes President Joe Biden had stepped aside earlier.\n\nShe added that her decision to leave Congress was based on several factors, including President-elect Donald Trump’s return to the White House, but also on her hope that it will make room for younger members.\n\n“I’m trying to set a better example,” she told the newspaper. “I think there are colleagues — some of whom are still very successful and very productive — but others who just stay forever.”\n\n“I’m just not the best gladiator for it right now,” she said of Trump’s return, noting that his comeback, the January 6 Capitol riot, and making room for younger people, all played a role in her decision.\n\nKuster just narrowly escaped as rioters headed to the House chamber during the Capitol riot.\n\n“I’ve said somewhat facetiously, he tried to kill me once, I’m not available for that again,” she said regarding Trump. “What we went through on January 6 and his attempt to overthrow the government took a toll. That was really hard, and not just personally, but on my ability to work across the aisle.”\n\nHer last votes as a member of Congress also pushed her out the door as Elon Musk took down a bipartisan spending deal, almost leading to a government shutdown.\n\nShe said it was “a big part of the reason to leave ... There’s a theme developing when billionaires make decisions about hard-working families’ lives, it comes out just mean. It’s cold-hearted.”\n\nKuster revealed her decision in March, long before Trump won the election and before Biden bowed out to make room for Vice President Kamala Harris.\n\nShe told The Globe that she thought Trump would be able to win after a trip to New Hampshire with Biden when she spent an hour with the president and started to doubt his reelection prospects.\n\n“Just in my heart, [I] reached the conclusion that this would be a very challenging campaign for him, and to put himself out there for another four-year term was going to be a struggle,” she told the paper, noting that the 81-year-old president is capable of finishing his term but that his aging was clear and that he spoke “very softly,” suggesting that Biden’s team “may have” concealed his aging.\n\n“It was hard for me at that time, like, what can one person do?” Kuster asked The Globe. “You know, I did talk with people about [it] and talked with the campaign, it’s just hard to know, looking back on it.”\n\nFollowing Biden’s June 27 debate with Trump which ultimately led to his departure from the race, Kuster hosted a video call with Biden and the New Democrat Coalition, a group of moderate Democrats of which she’s the chair. The meeting grew tense when members challenged Biden on his fitness to continue in office.\n\nKuster said it was “painful” to prepare her remarks for the call. “I haven’t had these kinds of conversations since I talked to my own parents about, you know, their aging and their limitations,” she said.","summary":"‘I think there are colleagues — some of whom are still very successful and very productive — but others who just stay forever,’ noted New Hampshire Representative Annie Kuster","url":"https://www.independent.co.uk/news/world/americas/us-politics/annie-kuster-retirement-congresswoman-aging-b2671818.html","image":"https://static.independent.co.uk/2024/12/30/23/GettyImages-1237570971.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/qOAC0dOD-4VHSaSK0.mp4","publish_date":"2024-12-31 00:32:49","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.165},{"id":277199480,"title":"Must Watch","text":"Dunya News Video\n\nLifestyle-&-Entertainment\n\nDunya-Headlines\n\nDunya News - English\n\nDunya News - Urdu\n\nDunya News Live\n\nDunya Meher Bokhari Kay Sath\n\nHasb-e-Haal\n\nOn The Front\n\nTonight With Samar Abbas\n\nNuqta E Nazar\n\nBaat Niklay Gi\n\nPeyam-E-Subh\n\nIlm-O-Hikmat\n\nDunya TV Special\n\nPersonality\n\nSheikh Rasheed\n\nSiraj ul Haq\n\nJaved Hashmi\n\nNawaz Sharif\n\nTahir-ul-Qadri\n\nIjaz Chaudhry\n\nShahbaz Sharif\n\nHamza Shahbaz\n\nChief Justice\n\nShah Mehmood Qureshi\n\nZaka Ashraf\n\nHafiz Saeed\n\nDr. Abdul Hafeez Shaikh\n\nHina Rabbani Khar\n\nPervaiz Elahi\n\nPervez Khattak\n\nHaji Muhammad Adeel\n\nMushahid Hussain Syed\n\nRaza Rabbani\n\nAhsan Iqbal\n\nAitzaz Ahsan\n\nKhursheed Shah\n\nAltaf Hussain\n\nFazal-ur-Rehman\n\nChaudhry Mohammad Sarwar\n\nAyesha Ghaus\n\nMuzaffar Said\n\nKhawaja Asif\n\nAyyaz Sadiq\n\nRaheel Shareef\n\nPervez Rashid\n\nManzoor Wattoo\n\nJehangir Khan Tareen\n\nMamnoon Hussain\n\nAnwar Zaheer Jamali\n\nAshraf Ghani\n\nSushma Swaraj\n\nHassan Rouhani\n\nChaudhry Nisar\n\nMustafa Kamal\n\nBilawal Zardari\n\nSaad Rafique\n\nDaniyal Aziz\n\nPML-N workers\n\nSyed Murad Ali Shah\n\nQaim Ali Shah\n\nMurad Ali Shah\n\nSardar Sanaullah Khan Zehri\n\nRana Sanaullah Khan\n\nWaseem Akhtar\n\nFarooq Sattar\n\nTallal Chaudry\n\nPPP Workers\n\nMQM London Workers\n\nDonald Trump\n\nTayyip Erdogan\n\nSartaj Aziz\n\nACM Sohail Aman\n\nTariq Jameel\n\nGen Qamar Bajwa\n\nAsif Ali Zardari\n\nMaryam Nawaz\n\nPCB Chairman\n\nCombine press conference\n\nImam of Kaaba\n\nYounis Khan\n\nMarriyum Aurangzeb\n\nDG ISPR Asif Ghafoor\n\nAbid Sher Ali\n\nHussain Nawaz\n\nAsif Kirmani\n\nSohail Aman\n\nMaula Bakhsh Chandio\n\nFawad Chaudhry\n\nFarooq Haider\n\nShahid Khaqan Abbasi\n\nShireen Mazari\n\nSarfraz Ahmed\n\nFaisal Subzwari\n\nCJP Saqib Nisar\n\nAbdul Quddus Bizenjo\n\nMiftah Ismail\n\nZaeem Qadri\n\nNaeem ul Haq\n\nSherry Rehman\n\nQamar Zaman Kaira\n\nFayaz-ul-Hasan Chohan\n\nQamar Javed Bajwa\n\nKhusro Bakhtiar\n\nShafqat Mahmood\n\nShehryar Khan Afridi\n\nMushahid Ullah Khan\n\nHashim Jawan Bakht\n\nFarogh Naseem\n\nUsman Buzdar\n\nNavjot Singh Sidhu\n\nHarsimrat Kaur Badal\n\nTariq Jameel\n\nRaja Basharat\n\nMurad Saeed\n\nMahathir Mohamad\n\nKhurram Sher Zaman\n\nInzamam-ul-Haq\n\nFirdous Ashiq Awan\n\nJaved Iqbal\n\nFaisal Vawda\n\nHafeez Sheikh\n\nMufti Muneeb ur Rehman\n\nSania Nishtar\n\nShaukat Ali Yousafzai\n\nShahzad Akbar\n\nAsif Saeed Khan Khosa\n\nFahmida Mirza\n\nFayyaz ul Hassan Chohan\n\nHammad Azhar\n\nOmar Ayub Khan\n\nShahbaz Gill\n\nFarogh Naseem\n\nMuhammad Zubair\n\nCJP Asif Saeed Khan Khosa\n\nMian Aslam Iqbal\n\nFaisal Javed Khan\n\nRaja Zafar ul Haq\n\nAsad Mehmood\n\nMohammad Faisal\n\nAli Muhammad Khan\n\nSherry Rehman\n\nMisbah ul Haq\n\nMasood Khan\n\nRaja Farooq Haider\n\nShahid Afridi\n\nSaeed Ghani\n\nZulfi Bukhari\n\nAbdul Ghafoor Haideri\n\nZubair Mahmood Hayat\n\nJam Kamal Khan\n\nMahmood Khan\n\nMurtaza Wahab\n\nDr Yasmin Rashid\n\nNoor-ul-Haq Qadri\n\nYasmin Rashid\n\nAnwar Mansoor Khan\n\nFarrukh Habib\n\nZulfiqar Hameed\n\nImran Ismail\n\nMohammad Hafeez\n\nShoaib Malik\n\nAisha Farooqui\n\nMustafa Nawaz Khokhar\n\nAbdul Razak Dawood\n\nAntonio Guterres\n\nMuhammad Basharat Raja\n\nMujahid Anwar Khan\n\nDG ISPR Major General Babar Iftikhar\n\nMike Pompeo\n\nZafar Mirza\n\nMusadik Malik\n\nShehzad Roy\n\nKhalid Maqbool Siddiqui\n\nAjmal Wazir Khan\n\nJam Kamal Khan\n\nMoeed Yousaf\n\nChairman NDMA Lieutenant General Muhammad Afzal\n\nLiaquat Shahwani\n\nShibli Faraz\n\nTaimoor Jhagra\n\nFirdous Shamim Naqvi\n\nGhulam Sarwar Khan\n\nNaveed Qamar\n\nAli Amin Gandapur\n\nRamesh Kumar\n\nCJP Gulzar Ahmed\n\nAzma Bukhari\n\nKamran Bangash\n\nAbdul Qadir Baloch\n\nSanaullah Zehri\n\nAsifa Bhutto\n\nSaleem Mandviwalla\n\nYousaf Raza Gellani\n\nRaja Pervaiz Ashraf\n\nAkbar S Babar\n\nAsad Qaiser\n\nShaukat Tarin\n\nAzam Khan Swati\n\nMohsin Khan Leghari\n\nHaleem Adil Sheikh\n\nFarah Azeem\n\nNoor Alam Khan\n\nMr. Salahuddin\n\nShazia Marri\n\nRaja Riaz Ahmad Khan\n\nDr Shahzad Waseem\n\nAbdul Qadir Patel\n\nAhsan Iqbal\n\nAzhar Sadiq Advocate\n\nSardar Tanveer\n\nMuhammad Moeen Wattoo\n\nJaved Latif\n\nHaji Ghulam Ali\n\nIG Punjab Usman Anwar\n\nSharjeel Memon\n\nHafiz Naeem ur Rehman\n\nFaisal Karim Kundi\n\nAttaullah Tarar\n\nAyesha Gulalai\n\nIrfan Qadir\n\nAhmed Sharif Chaudhary\n\nAnwar ul Haq Kakar\n\nMohsin Naqvi\n\nGohar Ali Khan\n\nReligious group continues sit ins across Karachi\n\nADVERTISEMENT\n\nMore to Watch\n\nADVERTISEMENT\n\nLatest Shows\n\nOn The Front\n\nNuqta E Nazar\n\nDunya Meher Bokhari Kay Sath\n\nPeyam-E-Subh\n\nADVERTISEMENT","url":"https://video.dunyanews.tv/index.php/en/mustwatch/153322/Religious-group-continues-sit-ins-across-Karachi","image":"https://img.dunyanews.tv/images/30Dec24-karachi.jpg","video":null,"publish_date":"2024-12-31 00:29:51","author":null,"language":"en","source_country":"pk","sentiment":-0.349},{"id":277199476,"title":"China offers deep condolences over Jimmy Carter's death","text":"China offers deep condolences over Jimmy Carter's death\n\nBEIJING (Reuters) - China on Monday offered its deep condolences over the death of Jimmy Carter, saying the former US president was the \"driving force\" behind the establishment of diplomatic ties between both countries more than 40 years ago.\n\nCarter died at his home in Plains, Georgia, on Sunday at the age of 100. During his 1977-1981 tenure, the US government established formal relations with China, building on the groundwork laid by former President Richard Nixon and Secretary of State Henry Kissinger earlier in the 1970s.\n\n\"China expresses its deep condolences on the passing of former United States President Jimmy Carter,\" said Mao Ning, spokesperson at the Chinese foreign ministry.\n\n\"Former President Carter was the driving force behind the establishment of diplomatic relations between China and the United States, and made important contributions to the development of China-United States relations and the friendly exchanges and cooperation between the two countries,\" Mao said at a regular news conference.\n\nThe decision by Carter's administration to acknowledge in 1979 Beijing's position that there is but one China and Taiwan is part of China, and to sever formal ties with Taiwan, helped chart a new course in ties.\n\n\"His historic contribution to the normalisation and development of China-US relations will always be remembered by the Chinese people,\" Xie Feng, the Chinese ambassador to the United States, wrote in a post on X.\n\nIn the same year, 1979, the US government, while adhering to its One-China policy, also passed the Taiwan Relations Act, which establishes a legal basis to provide the island with the means to defend itself.\n\nBeijing claims Taiwan as part of its territory and has never renounced the use of force to bring the island under its control.\n\nUS weapons sales to Taiwan allowed by the Taiwan Relations Act remain a point of friction in Sino-US ties to this day, with Beijing regularly urging Washington to adhere to its One-China principle, and laying sanctions on US military suppliers and corporate executives.\n\nOther pacts signed during Carter's tenure included the US-China Science and Technology Agreement (STA) in 1979, a science cooperation deal that some critics say has disproportionately benefited Washington's top geopolitical rival over the decades.\n\nThe pact was renewed this month, weeks before President-elect Donald Trump's Jan 20 inauguration. The State Department said the new deal is significantly narrower than previous iterations, and does not cover critical or emerging technologies.","url":"https://www.dunyanews.tv/index.php/en/World/859510-china-offers-deep-condolences-over-jimmy-carters-death","image":"https://img.dunyanews.tv/news/2024/December/12-30-24/news_big_images/859510_97671046.jpg","video":null,"publish_date":"2024-12-31 00:29:51","author":null,"language":"en","source_country":"pk","sentiment":-0.03},{"id":277199464,"title":"Must Watch","text":"Dunya News Video\n\nLifestyle-&-Entertainment\n\nDunya-Headlines\n\nDunya News - English\n\nDunya News - Urdu\n\nDunya News Live\n\nDunya Meher Bokhari Kay Sath\n\nHasb-e-Haal\n\nOn The Front\n\nTonight With Samar Abbas\n\nNuqta E Nazar\n\nBaat Niklay Gi\n\nPeyam-E-Subh\n\nIlm-O-Hikmat\n\nDunya TV Special\n\nPersonality\n\nSheikh Rasheed\n\nSiraj ul Haq\n\nJaved Hashmi\n\nNawaz Sharif\n\nTahir-ul-Qadri\n\nIjaz Chaudhry\n\nShahbaz Sharif\n\nHamza Shahbaz\n\nChief Justice\n\nShah Mehmood Qureshi\n\nZaka Ashraf\n\nHafiz Saeed\n\nDr. Abdul Hafeez Shaikh\n\nHina Rabbani Khar\n\nPervaiz Elahi\n\nPervez Khattak\n\nHaji Muhammad Adeel\n\nMushahid Hussain Syed\n\nRaza Rabbani\n\nAhsan Iqbal\n\nAitzaz Ahsan\n\nKhursheed Shah\n\nAltaf Hussain\n\nFazal-ur-Rehman\n\nChaudhry Mohammad Sarwar\n\nAyesha Ghaus\n\nMuzaffar Said\n\nKhawaja Asif\n\nAyyaz Sadiq\n\nRaheel Shareef\n\nPervez Rashid\n\nManzoor Wattoo\n\nJehangir Khan Tareen\n\nMamnoon Hussain\n\nAnwar Zaheer Jamali\n\nAshraf Ghani\n\nSushma Swaraj\n\nHassan Rouhani\n\nChaudhry Nisar\n\nMustafa Kamal\n\nBilawal Zardari\n\nSaad Rafique\n\nDaniyal Aziz\n\nPML-N workers\n\nSyed Murad Ali Shah\n\nQaim Ali Shah\n\nMurad Ali Shah\n\nSardar Sanaullah Khan Zehri\n\nRana Sanaullah Khan\n\nWaseem Akhtar\n\nFarooq Sattar\n\nTallal Chaudry\n\nPPP Workers\n\nMQM London Workers\n\nDonald Trump\n\nTayyip Erdogan\n\nSartaj Aziz\n\nACM Sohail Aman\n\nTariq Jameel\n\nGen Qamar Bajwa\n\nAsif Ali Zardari\n\nMaryam Nawaz\n\nPCB Chairman\n\nCombine press conference\n\nImam of Kaaba\n\nYounis Khan\n\nMarriyum Aurangzeb\n\nDG ISPR Asif Ghafoor\n\nAbid Sher Ali\n\nHussain Nawaz\n\nAsif Kirmani\n\nSohail Aman\n\nMaula Bakhsh Chandio\n\nFawad Chaudhry\n\nFarooq Haider\n\nShahid Khaqan Abbasi\n\nShireen Mazari\n\nSarfraz Ahmed\n\nFaisal Subzwari\n\nCJP Saqib Nisar\n\nAbdul Quddus Bizenjo\n\nMiftah Ismail\n\nZaeem Qadri\n\nNaeem ul Haq\n\nSherry Rehman\n\nQamar Zaman Kaira\n\nFayaz-ul-Hasan Chohan\n\nQamar Javed Bajwa\n\nKhusro Bakhtiar\n\nShafqat Mahmood\n\nShehryar Khan Afridi\n\nMushahid Ullah Khan\n\nHashim Jawan Bakht\n\nFarogh Naseem\n\nUsman Buzdar\n\nNavjot Singh Sidhu\n\nHarsimrat Kaur Badal\n\nTariq Jameel\n\nRaja Basharat\n\nMurad Saeed\n\nMahathir Mohamad\n\nKhurram Sher Zaman\n\nInzamam-ul-Haq\n\nFirdous Ashiq Awan\n\nJaved Iqbal\n\nFaisal Vawda\n\nHafeez Sheikh\n\nMufti Muneeb ur Rehman\n\nSania Nishtar\n\nShaukat Ali Yousafzai\n\nShahzad Akbar\n\nAsif Saeed Khan Khosa\n\nFahmida Mirza\n\nFayyaz ul Hassan Chohan\n\nHammad Azhar\n\nOmar Ayub Khan\n\nShahbaz Gill\n\nFarogh Naseem\n\nMuhammad Zubair\n\nCJP Asif Saeed Khan Khosa\n\nMian Aslam Iqbal\n\nFaisal Javed Khan\n\nRaja Zafar ul Haq\n\nAsad Mehmood\n\nMohammad Faisal\n\nAli Muhammad Khan\n\nSherry Rehman\n\nMisbah ul Haq\n\nMasood Khan\n\nRaja Farooq Haider\n\nShahid Afridi\n\nSaeed Ghani\n\nZulfi Bukhari\n\nAbdul Ghafoor Haideri\n\nZubair Mahmood Hayat\n\nJam Kamal Khan\n\nMahmood Khan\n\nMurtaza Wahab\n\nDr Yasmin Rashid\n\nNoor-ul-Haq Qadri\n\nYasmin Rashid\n\nAnwar Mansoor Khan\n\nFarrukh Habib\n\nZulfiqar Hameed\n\nImran Ismail\n\nMohammad Hafeez\n\nShoaib Malik\n\nAisha Farooqui\n\nMustafa Nawaz Khokhar\n\nAbdul Razak Dawood\n\nAntonio Guterres\n\nMuhammad Basharat Raja\n\nMujahid Anwar Khan\n\nDG ISPR Major General Babar Iftikhar\n\nMike Pompeo\n\nZafar Mirza\n\nMusadik Malik\n\nShehzad Roy\n\nKhalid Maqbool Siddiqui\n\nAjmal Wazir Khan\n\nJam Kamal Khan\n\nMoeed Yousaf\n\nChairman NDMA Lieutenant General Muhammad Afzal\n\nLiaquat Shahwani\n\nShibli Faraz\n\nTaimoor Jhagra\n\nFirdous Shamim Naqvi\n\nGhulam Sarwar Khan\n\nNaveed Qamar\n\nAli Amin Gandapur\n\nRamesh Kumar\n\nCJP Gulzar Ahmed\n\nAzma Bukhari\n\nKamran Bangash\n\nAbdul Qadir Baloch\n\nSanaullah Zehri\n\nAsifa Bhutto\n\nSaleem Mandviwalla\n\nYousaf Raza Gellani\n\nRaja Pervaiz Ashraf\n\nAkbar S Babar\n\nAsad Qaiser\n\nShaukat Tarin\n\nAzam Khan Swati\n\nMohsin Khan Leghari\n\nHaleem Adil Sheikh\n\nFarah Azeem\n\nNoor Alam Khan\n\nMr. Salahuddin\n\nShazia Marri\n\nRaja Riaz Ahmad Khan\n\nDr Shahzad Waseem\n\nAbdul Qadir Patel\n\nAhsan Iqbal\n\nAzhar Sadiq Advocate\n\nSardar Tanveer\n\nMuhammad Moeen Wattoo\n\nJaved Latif\n\nHaji Ghulam Ali\n\nIG Punjab Usman Anwar\n\nSharjeel Memon\n\nHafiz Naeem ur Rehman\n\nFaisal Karim Kundi\n\nAttaullah Tarar\n\nAyesha Gulalai\n\nIrfan Qadir\n\nAhmed Sharif Chaudhary\n\nAnwar ul Haq Kakar\n\nMohsin Naqvi\n\nGohar Ali Khan\n\nTrading Corporation faces severe financial crisis\n\nADVERTISEMENT\n\nMore to Watch\n\nADVERTISEMENT\n\nLatest Shows\n\nOn The Front\n\nNuqta E Nazar\n\nDunya Meher Bokhari Kay Sath\n\nPeyam-E-Subh\n\nADVERTISEMENT","url":"https://video.dunyanews.tv/index.php/en/mustwatch/153323/Trading-Corporation-faces-severe-financial-crisis","image":"https://img.dunyanews.tv/images/30Dec24-???????.jpg","video":null,"publish_date":"2024-12-31 00:29:51","author":null,"language":"en","source_country":"pk","sentiment":-0.349},{"id":277199454,"title":"Verizon targeted by Salt Typhoon cyberespionage operation, but networks secure","text":"Verizon targeted by Salt Typhoon cyberespionage operation, but networks secure\n\n(Reuters) - The Chinese-linked Salt Typhoon cyberespionage operation targeted and Verizon's systems, but the wireless carriers' US networks are now secure as they work with law enforcement and government officials, the companies said on Saturday in their first acknowledgment of the attacks.\n\n\"We detect no activity by nation-state actors in our networks at this time. Based on our current investigation of this attack, the People's Republic of China targeted a small number of individuals of foreign intelligence interest,\" an AT&T spokesperson said.\n\nWhile only a few cases of compromised information were identified, AT&T was monitoring and remediating its networks to protect customers data, and continues to work with authorities to assess and mitigate the threat, the spokesperson said.\n\n\"We have not detected threat actor activity in Verizon's network for some time, and after considerable work addressing this incident, we can report that Verizon has contained the activities associated with this particular incident,\" Verizon's Chief Legal Officer said in a statement.\n\nAn independent and highly respected cyber security firm has confirmed the containment, Verizon said.\n\nOn Friday, US officials added a ninth unnamed telecom company to the list of entities compromised by the Salt Typhoon hackers and said the Chinese involved gained access to networks and essentially had broad and full access, giving them the capability to \"geolocate millions of individuals, to record phone calls at will.\"\n\nThe US Department of Defense and the Federal Communications Commission did not immediately respond to Reuters' requests for comment on the company statements. China's foreign ministry could not immediately be contacted for comment.\n\nChinese officials have previously described the allegations as disinformation and said Beijing \"firmly opposes and combats cyber attacks and cyber theft in all forms.\"\n\nOfficials previously alleged hackers targeted Verizon AT&T, Lumen and other telecom companies, and stole telephone audio intercepts along with a large swath of call record data.\n\nIn response to that cyberattack, the US Cybersecurity and Infrastructure Security Agency on Dec. 18 urged senior government and political figures to move mobile communications to end-to-end encrypted apps.\n\nTargets of Salt Typhoon reportedly included officials connected to Democrat Kamala Harris and Republican Donald Trump's presidential campaigns.\n\nSen. Ben Ray Lujan, a Democrat from New Mexico, called Salt Typhoon the \"largest telecommunications hack in our nation's history\" during a Dec. 11 hearing, while Texas Republican Sen. Ted Cruz said the US \"must plug any vulnerabilities in communications networks.\"","url":"https://www.dunyanews.tv/index.php/en/Technology/859431-verizon-targeted-by-salt-typhoon-cyberespionage-operation-but-network","image":"https://img.dunyanews.tv/news/2024/December/12-29-24/news_big_images/859431_96281685.jpg","video":null,"publish_date":"2024-12-31 00:29:51","author":"Salt Typhoon","authors":["Salt Typhoon"],"language":"en","source_country":"pk","sentiment":-0.416},{"id":277199444,"title":"Must Watch","text":"Dunya News Video\n\nLifestyle-&-Entertainment\n\nDunya-Headlines\n\nDunya News - English\n\nDunya News - Urdu\n\nDunya News Live\n\nDunya Meher Bokhari Kay Sath\n\nHasb-e-Haal\n\nOn The Front\n\nTonight With Samar Abbas\n\nNuqta E Nazar\n\nBaat Niklay Gi\n\nPeyam-E-Subh\n\nIlm-O-Hikmat\n\nDunya TV Special\n\nPersonality\n\nSheikh Rasheed\n\nSiraj ul Haq\n\nJaved Hashmi\n\nNawaz Sharif\n\nTahir-ul-Qadri\n\nIjaz Chaudhry\n\nShahbaz Sharif\n\nHamza Shahbaz\n\nChief Justice\n\nShah Mehmood Qureshi\n\nZaka Ashraf\n\nHafiz Saeed\n\nDr. Abdul Hafeez Shaikh\n\nHina Rabbani Khar\n\nPervaiz Elahi\n\nPervez Khattak\n\nHaji Muhammad Adeel\n\nMushahid Hussain Syed\n\nRaza Rabbani\n\nAhsan Iqbal\n\nAitzaz Ahsan\n\nKhursheed Shah\n\nAltaf Hussain\n\nFazal-ur-Rehman\n\nChaudhry Mohammad Sarwar\n\nAyesha Ghaus\n\nMuzaffar Said\n\nKhawaja Asif\n\nAyyaz Sadiq\n\nRaheel Shareef\n\nPervez Rashid\n\nManzoor Wattoo\n\nJehangir Khan Tareen\n\nMamnoon Hussain\n\nAnwar Zaheer Jamali\n\nAshraf Ghani\n\nSushma Swaraj\n\nHassan Rouhani\n\nChaudhry Nisar\n\nMustafa Kamal\n\nBilawal Zardari\n\nSaad Rafique\n\nDaniyal Aziz\n\nPML-N workers\n\nSyed Murad Ali Shah\n\nQaim Ali Shah\n\nMurad Ali Shah\n\nSardar Sanaullah Khan Zehri\n\nRana Sanaullah Khan\n\nWaseem Akhtar\n\nFarooq Sattar\n\nTallal Chaudry\n\nPPP Workers\n\nMQM London Workers\n\nDonald Trump\n\nTayyip Erdogan\n\nSartaj Aziz\n\nACM Sohail Aman\n\nTariq Jameel\n\nGen Qamar Bajwa\n\nAsif Ali Zardari\n\nMaryam Nawaz\n\nPCB Chairman\n\nCombine press conference\n\nImam of Kaaba\n\nYounis Khan\n\nMarriyum Aurangzeb\n\nDG ISPR Asif Ghafoor\n\nAbid Sher Ali\n\nHussain Nawaz\n\nAsif Kirmani\n\nSohail Aman\n\nMaula Bakhsh Chandio\n\nFawad Chaudhry\n\nFarooq Haider\n\nShahid Khaqan Abbasi\n\nShireen Mazari\n\nSarfraz Ahmed\n\nFaisal Subzwari\n\nCJP Saqib Nisar\n\nAbdul Quddus Bizenjo\n\nMiftah Ismail\n\nZaeem Qadri\n\nNaeem ul Haq\n\nSherry Rehman\n\nQamar Zaman Kaira\n\nFayaz-ul-Hasan Chohan\n\nQamar Javed Bajwa\n\nKhusro Bakhtiar\n\nShafqat Mahmood\n\nShehryar Khan Afridi\n\nMushahid Ullah Khan\n\nHashim Jawan Bakht\n\nFarogh Naseem\n\nUsman Buzdar\n\nNavjot Singh Sidhu\n\nHarsimrat Kaur Badal\n\nTariq Jameel\n\nRaja Basharat\n\nMurad Saeed\n\nMahathir Mohamad\n\nKhurram Sher Zaman\n\nInzamam-ul-Haq\n\nFirdous Ashiq Awan\n\nJaved Iqbal\n\nFaisal Vawda\n\nHafeez Sheikh\n\nMufti Muneeb ur Rehman\n\nSania Nishtar\n\nShaukat Ali Yousafzai\n\nShahzad Akbar\n\nAsif Saeed Khan Khosa\n\nFahmida Mirza\n\nFayyaz ul Hassan Chohan\n\nHammad Azhar\n\nOmar Ayub Khan\n\nShahbaz Gill\n\nFarogh Naseem\n\nMuhammad Zubair\n\nCJP Asif Saeed Khan Khosa\n\nMian Aslam Iqbal\n\nFaisal Javed Khan\n\nRaja Zafar ul Haq\n\nAsad Mehmood\n\nMohammad Faisal\n\nAli Muhammad Khan\n\nSherry Rehman\n\nMisbah ul Haq\n\nMasood Khan\n\nRaja Farooq Haider\n\nShahid Afridi\n\nSaeed Ghani\n\nZulfi Bukhari\n\nAbdul Ghafoor Haideri\n\nZubair Mahmood Hayat\n\nJam Kamal Khan\n\nMahmood Khan\n\nMurtaza Wahab\n\nDr Yasmin Rashid\n\nNoor-ul-Haq Qadri\n\nYasmin Rashid\n\nAnwar Mansoor Khan\n\nFarrukh Habib\n\nZulfiqar Hameed\n\nImran Ismail\n\nMohammad Hafeez\n\nShoaib Malik\n\nAisha Farooqui\n\nMustafa Nawaz Khokhar\n\nAbdul Razak Dawood\n\nAntonio Guterres\n\nMuhammad Basharat Raja\n\nMujahid Anwar Khan\n\nDG ISPR Major General Babar Iftikhar\n\nMike Pompeo\n\nZafar Mirza\n\nMusadik Malik\n\nShehzad Roy\n\nKhalid Maqbool Siddiqui\n\nAjmal Wazir Khan\n\nJam Kamal Khan\n\nMoeed Yousaf\n\nChairman NDMA Lieutenant General Muhammad Afzal\n\nLiaquat Shahwani\n\nShibli Faraz\n\nTaimoor Jhagra\n\nFirdous Shamim Naqvi\n\nGhulam Sarwar Khan\n\nNaveed Qamar\n\nAli Amin Gandapur\n\nRamesh Kumar\n\nCJP Gulzar Ahmed\n\nAzma Bukhari\n\nKamran Bangash\n\nAbdul Qadir Baloch\n\nSanaullah Zehri\n\nAsifa Bhutto\n\nSaleem Mandviwalla\n\nYousaf Raza Gellani\n\nRaja Pervaiz Ashraf\n\nAkbar S Babar\n\nAsad Qaiser\n\nShaukat Tarin\n\nAzam Khan Swati\n\nMohsin Khan Leghari\n\nHaleem Adil Sheikh\n\nFarah Azeem\n\nNoor Alam Khan\n\nMr. Salahuddin\n\nShazia Marri\n\nRaja Riaz Ahmad Khan\n\nDr Shahzad Waseem\n\nAbdul Qadir Patel\n\nAhsan Iqbal\n\nAzhar Sadiq Advocate\n\nSardar Tanveer\n\nMuhammad Moeen Wattoo\n\nJaved Latif\n\nHaji Ghulam Ali\n\nIG Punjab Usman Anwar\n\nSharjeel Memon\n\nHafiz Naeem ur Rehman\n\nFaisal Karim Kundi\n\nAttaullah Tarar\n\nAyesha Gulalai\n\nIrfan Qadir\n\nAhmed Sharif Chaudhary\n\nAnwar ul Haq Kakar\n\nMohsin Naqvi\n\nGohar Ali Khan\n\nNo VPN registration applications received yet from companies\n\nADVERTISEMENT\n\nMore to Watch\n\nADVERTISEMENT\n\nLatest Shows\n\nOn The Front\n\nNuqta E Nazar\n\nDunya Meher Bokhari Kay Sath\n\nPeyam-E-Subh\n\nADVERTISEMENT","url":"https://video.dunyanews.tv/index.php/en/mustwatch/153324/No-VPN-registration-applications-received-yet-from-companies","image":"https://img.dunyanews.tv/images/30Dec24-vpn.jpg","video":null,"publish_date":"2024-12-31 00:29:51","author":null,"language":"en","source_country":"pk","sentiment":-0.349},{"id":277199494,"title":"Fani Willis' Trump Case Update: Georgia AG Tries to Block Appeal","text":"Georgia Attorney General Chris Carr is urging his state's highest court to reject an appeal of a recent decision to disqualify Fulton County District Attorney Fani Willis from President-elect Donald Trump's 2020 Georgia election subversion criminal case.Why It MattersThe Georgia Court of Appeals removed Willis from the case earlier this month, ruling that Superior Court Judge Scott McAfee had previously \"erred by failing to disqualify DA Willis and her office\" due to her personal relationship with former prosecutor Nathan Wade. Willis quickly filed papers indicating that she would appeal the decision.Trump was indicted in Fulton County last year alongside 18 codefendants on multiple felony counts related to attempts to overturn President Joe Biden's 2020 election win in Georgia. The president-elect maintains his innocence and claims that Willis and other Democrats are involved in a plot to \"weaponize\" the justice system and \"persecute\" him.What We KnowCarr, a Republican who has announced his candidacy in Georgia's 2026 gubernatorial election, said the following in a statement shared Monday to X, formerly Twitter:\"The Georgia Court of Appeals has ruled that the Fulton County DA created her own conflict and rightfully removed her from the case against President-elect Trump.\"'Lawfare' has become far too common in American politics, and it must end.\"As such, I would encourage the Georgia Supreme Court to not take her appeal.\"It's our hope that the DA will now focus taxpayer resources on the successful prosecution of violent criminals in Fulton County.\"Willis responded to Carr's statement by pointing out that the attorney general is \"a witness in the case he is trying to influence,\" according to Atlanta Journal-Constitution politics reporter Greg Bluestein.\"Apparently, he is more focused on the politics of the 2026 Republican gubernatorial primary rather than the law,\" Willis reportedly said.\"If Mr. Carr cannot separate his ambition to become Governor from his duties as Attorney General, he should resign and focus on being a full-time candidate rather than serving as a constitutional officer sworn to uphold the Constitutions and laws of the United States and Georgia,\" she added.Newsweek reached out for comment to the offices of Willis and Carr via email on Monday.What People Are SayingRepublican Georgia Governor Brian Kemp, in response to Carr's statement on X: \"Agreed, @Georgia_AG! Georgians deserve safe communities and partisan politics out of our courtrooms.\"Georgia Lieutenant Governor Burt Jones, also a Republican, on X: \"I have said for years that Fani Willis orchestrated a political charade against President Trump. When he had opportunities to lead, our Attorney General was missing in action. Where he failed, the Georgia Senate won't. We look forward to holding her accountable at a future hearing.\"What Happens NextRegardless of whether Willis is in charge of the case, Trump's election victory on November 5 and Justice Department rules that dictate sitting presidents cannot be put on trial mean that the Fulton County prosecution and any other criminal proceedings against the president-elect are all but certain to be off the table until at least January 2029.","summary":"Republican Georgia Attorney General Chris Carr on Monday urged the state's highest court to rule against Willis' appeal.","url":"https://www.newsweek.com/fani-willis-trump-case-update-georgia-ag-tries-block-appeal-2007704","image":"https://d.newsweek.com/en/full/2553567/fani-willis-chris-carr-georgia-donald-trump.jpg","video":null,"publish_date":"2024-12-31 00:27:00","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.102},{"id":277198828,"title":"The economic consequences of Mr Trump","text":"By Amol Agrawal In 1925, John Maynard Keynes wrote The Economic Consequences of Mr Churchill criticising the monetary policies of the then British government. Nearly 100 years later, Keynes’ article resonates strongly today. Before making comparisons, we need some background. Ever since humanity invented money, the temptation to create a quick fortune has ironically only led to misfortune. In 1717, the United Kingdom, seeking a solution, fixed the price of its currency to silver under the Master of the Mint Issac Newton. Under this new system, money could be created only based on discovering more silver, which was relatively scarce. In 1819, silver was replaced by gold, leading to the famous gold standard. The system was successful in reining in inflation, leading other countries to adopt it and laying the foundations of globalisation from 1880 to 1913. In 1914, the UK suspended the gold standard due to the First World War. The war needed spending, which was not allowed under the gold standard. After WWI, a British government-commissioned report recommended not just restoring the gold standard, but also at the pre-war price. After much discussion, then Chancellor Winston Churchill restored the pre-war gold standard in 1925. The decision prompted Keynes to write the aforementioned famous article as a critique. It was not the first time Keynes had used the phrase “economic consequences”. In 1920, he wrote his famous book The Economic Consequences of Peace, deploring the harsh economic reparations on Germany. The book was equally prophetic as it paved the way for the rise of Nazism in Germany. In the 1925 article, Keynes argued that the high-inflation years of the war implied devaluation of the currency. However, by restoring it to the pre-war level, the currency would be overvalued. This would mean, in Keynes’s words, “whenever we sell anything abroad, either the foreign buyer has to pay 10 per cent more in his money or we have to accept 10 per cent less in our money”. Keynes argued prophetically that the economic consequences of the decision would be the UK economy becoming uncompetitive, deflation in wages and prices, and severe unemployment. Nearly 100 years after the Churchill article, the suave world-watcher Keynes would be amazed at how his argument resonates strongly even today. He could simply tweak the title of his article to The Economic Consequences of Mr. Trump. Donald Trump’s re-election as the 47th President of the United States of America has rocked world politics and economics. As the 45th President, Trump caused a lot of stir, given his very different ideas about the US role in geopolitics and geoeconomics. His ideology is based on “Making America Great Again”, with which he wants to redraw American priorities. It implies cutting down US spending on the North Atlantic Treaty Organization, imposing high tariffs to reduce American trade deficit, cutting budget deficits, making the government efficient, and so on. He has already announced policies and appointed people for achieving his agenda, causing a lot of anxiety in the world economy yet again. Keynes would surely be amused at how we have learnt so little from economic history. The policies of Trump, just like that of Churchill, are aimed at restoring economic glory, but will end up doing the opposite. The higher tariffs will lower imports but also lead to higher cost of imports, impacting both consumers and manufacturers that import from China. Other countries might also retaliate by increasing their tariffs, disrupting the world trade order which will also impact US exports. “Beggar thy neighbour” policies eventually make everyone a beggar, as we saw during the Great Depression. Trump’s policies to cut government spending are based on the philosophy of Keynes’s rival Friedrich Hayek. However, establishing a department to achieve the objective just undoes the policy. There has also been a huge rally in bitcoin prices, tracking Trump’s appointment of a crypto supporter as the chair of the Securities and Exchange Commission. Ideally, the expectations of a rising US dollar should lead to lower bitcoin prices. Trump has also threatened the BRICS economies with higher tariffs if they promote a BRICS currency. Apart from disrupting trade, globalisation and the dollar, Trump is also expected to jeopardise the limited progress made on climate negotiations. It is just an endless list of self-goals. Keynes would also have noted a worrying similarity between the US’ inability to play a leadership role in the early 21st century and the UK’s inability to do the same in the early 20th century. A lack of leadership policies only created more fissures, taking the world towards multiple conflicts and wars. In the end, Keynes himself had to try and restore world peace by leading the discussions in Bretton Woods, creating the World Bank and the International Monetary Fund (IMF). Let me end the article with an IMF story. In 2019, the IMF published an article imagining Keynes visiting the institution he once created on its 75th anniversary. In it, Keynes was amazed at how much the world had changed in 75 years: the UK slipping in the global hierarchy, currencies floating, and women not just working at the IMF but leading it (Christine Lagarde headed it in 2019). Seeing how the world has panned out since 2019, Keynes would be both tickled and concerned with how his books and article remain prophetic, even 100 years later. The author teaches at Ahmedabad University. Disclaimer: Views expressed are personal and do not reflect the official position or policy of FinancialExpress.com. Reproducing this content without permission is prohibited.","url":"https://www.financialexpress.com/opinion/the-economic-consequences-of-mr-trump/3703794/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/trump.reuterss.jpg","video":null,"publish_date":"2024-12-31 00:23:51","author":"Guest","authors":["Guest"],"language":"en","source_country":"in","sentiment":0.12},{"id":277198820,"title":"Chip design subsidy may be doubled to Rs 30 crore","text":"The ministry of electronics and IT (Meity) is working on a proposal to double the subsidy under the design-linked incentive (DLI) scheme, a key component of India’s Rs 76,000-crore semiconductor incentive programme. Officials said that the proposal, which is under examination, plans to increase the startup subsidy from the current Rs 15 crore to Rs 30 crore as part of the upcoming semiconductor incentive scheme 2.0. Also ReadFrom real to virtual and now AI companions, has technology led to a deeper isolation in our lives? Meity is also considering a capex-linked subsidies to attract larger fabless companies interested in designing chips with intellectual property (IP) developed within the country. This new structure could be similar to the fiscal support provided for setting up fabrication units. The proposed enhancements follow a lacklustre response to the existing DLI scheme, which has benefited 14 startups out of approximately 60 applications. The scheme initially aimed to fund 100 startups, but many applicants lacked a stable client base or failed to secure approvals from companies manufacturing end products. In an effort to improve the programme's reach and effectiveness, the ministry is conducting roadshows to raise awareness among startups and encourage high-quality proposals. The government is also engaging with industry stakeholders to refine the scheme, including proposals to involve venture capitalists (VCs) who could supplement initial funding rounds. A key challenge faced by startups is the capital-intensive nature of semiconductor design, particularly at stages like prototype production and tapeout – the final phase manufacturing. \"Tapeout is a huge milestone for any chip design company. The government should consider providing an additional Rs 15 crore to Rs 30 crore for startups that achieve this stage,\" said Raja Manickam, founder and CEO of iVP Semi. He also emphasised the need for easier disbursement processes, urging the government to move away from reimbursement-based models. To expand the semiconductor footprint, MeitY is also planning to extend the DLI scheme to larger firms capable of generating commercial IPs. Companies like L&T Semiconductor Technologies and MiPhi -a joint venture between Micromax and Phison – have expressed interest in participating. \"There should not be any capping on incentives, especially for bigger companies focused on creating commercial IPs in chips for India,\" said V Veerappan, chairman of the India Electronics and Semiconductor Association (IESA). He added that fostering Indian product companies is crucial for value addition in the semiconductor ecosystem. Of the Rs 76,000 crore allocation for the semiconductor incentive programme, Rs 1,000 crore has been earmarked for the DLI scheme for startups. While startups qualifying under the scheme are entitled to a subsidy of Rs 15 crore, none have yet claimed the deployment-linked incentives of 4-6% of net sales (up to Rs 30 crore per application over five years), as no designs have reached the deployment stage. Also ReadUS President-elect Donald Trump urges Supreme Court to delay TikTok ban or forced sale Experts believe that the limited funding and complex disbursement processes have hindered progress. “The government needs to ease the disbursement process and ensure startups have sufficient support at critical stages,” Manickam said. By revising the scheme, the government aims to establish a robust chip design ecosystem and position India as a global hub for semiconductor innovation.","url":"https://www.financialexpress.com/life/technology-chip-design-subsidy-may-be-doubled-to-rs-30-crore-3703844/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/semicon.reuters.jpg","video":null,"publish_date":"2024-12-31 00:23:51","author":"Jatin Grover","authors":["Jatin Grover"],"language":"en","source_country":"in","sentiment":-0.038},{"id":277198810,"title":"10-year G-Sec yields may ease to 6.60 per cent by March: Tata AMC","text":"The yield on the 10-year benchmark is expected to fall to 6.60% by the end of March and could fall further to 6.50%, Akhil Mittal, senior fund manager-debt at Tata Asset Management, told FE. Also ReadBSE PSU Index: Charting out challenges and opportunities in 2025 after a volatile 2024 On the global front, he said, the policies by new US president Donald Trump are likely to set a new trajectory as the market is going to see how much volatility it adds to the currency market and how strict Trump would be on imposing tariffs. Amid global uncertainties, higher probability of the Reserve Bank of India (RBI) cutting rates in February and the end of supply of the government bonds in the same month are going to help in easing of yields, Mittal added. Another factor which makes the case stronger for a rate cut is the slowdown in economic growth. Though the growth figures for Q2 (July-September) are seen as an outlier, the government and the central bank are maintaining an upwards push in Q3 (October-December) growth on account of government spending. “If Q3 growth doesn't pick up, you will have two consecutive quarters of very low growth and inflation falling in pace. That would probably lead to a steeper rate cut cycle,” Mittal said. He added that in an unexpected scenario, if RBI does not cut rates in February, it may announce additional measures to infuse liquidity in the banking system. Also, the chances of RBI conducting open market operations are very high as it leads to an increase in circulation of high-powered money. Also ReadIn a problem-solving mode The US cut rates in September and the markets assumed a similar turn in policies by all major central banks. Hence, the market added duration bonds. But high inflation prints and tight liquidity conditions did not allow RBI to ease rates. So, the market cut down on the duration in November, Mittal said. Going forward, easing in the system liquidity and cooling inflation will likely see the markets again moving towards a longer duration, he added.","url":"https://www.financialexpress.com/market/10-year-g-sec-yields-may-ease-to-6-60-per-cent-by-march-tata-amc-3703740/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/tata.X.jpg","video":null,"publish_date":"2024-12-31 00:23:51","author":"Anupreksha Jain","authors":["Anupreksha Jain"],"language":"en","source_country":"in","sentiment":-0.354},{"id":277203474,"title":"Appeals Court Upholds Verdict In Trump Sexual Abuse Case","text":"A federal appeals court on Monday upheld a jury verdict ordering President-elect Donald Trump to pay $5 million for sexually abusing and defaming writer E. Jean Carroll.A New York jury found after a nine-day civil trial last year that the former president had sexually abused Carroll at a Manhattan department store in 1996.Trump was ordered to pay $2 million for sexual abuse and another $3 million for defaming Carroll, a former advice columnist for Elle magazine.Trump denied the allegations and appealed the verdict on the grounds that two other women who said Trump had sexually assaulted them too should not have been allowed to testify.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The three-judge panel of the Second US Circuit Court of Appeals disagreed.\"We conclude that Mr. Trump has not demonstrated that the district court erred in any of the challenged rulings,\" they said.\"Further, he has not carried his burden to show that any claimed error or combination of claimed errors affected his substantial rights as required to warrant a new trial.\"Carroll was awarded $83 million by another jury in a separate case she brought against Trump.He has appealed that verdict and Steven Cheung, a Trump spokesman, said the Republican would lodge a further appeal against the $5 million damages awarded in the sexual abuse and defamation case.\"The American People have re-elected President Trump with an overwhelming mandate,\" Cheung said in a statement.\"They demand an immediate end to the political weaponization of our justice system and a swift dismissal of all of the Witch Hunts, including the Democrat-funded Carroll Hoax, which will continue to be appealed,\" he said.Two federal cases brought against Trump by special counsel Jack Smith have been dismissed since he won the November 5 presidential election.Trump was accused of mishandling classified documents after leaving the White House and seeking to overturn the results of the 2020 election but Smith dropped the cases under a Justice Department policy of not prosecuting a sitting president.Trump was convicted in New York in May of 34 counts of falsifying business records to cover up a hush money payment to porn star Stormy Daniels.Judge Juan Merchan recently rejected a bid by the president-elect to have his conviction thrown out but has postponed sentencing indefinitely.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"A federal appeals court on Monday upheld a jury verdict ordering President-elect Donald Trump to pay $5 million for sexually abusing and defaming writer E. Jean Carroll.","url":"https://www.ndtv.com/world-news/appeals-court-upholds-verdict-in-donald-trump-sexual-abuse-case-7367226","image":"https://c.ndtvimg.com/2024-12/h6mgpfb8_trump_625x300_17_December_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-12-31 00:16:48","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.22},{"id":277197802,"title":"Shifting stance","text":"Trump’s support for H-1B visas marks a major shift, offering relief to US companies and Indian tech workers alike\n\nPoliticians seldom walk their talk and do not mind taking u-turns even if it means reversing their own previous positions. Donald Trump the US President elect is the latest example. Trump has expressed his support for the H-1B visa program, which facilitates the entry of skilled foreign workers into the United States. This development comes as a marked departure from his earlier stance during his first presidential term, where he labeled the program ’very bad’ and ‘unfair’ to American workers. Trump’s latest remarks not only align him with tech magnate Elon Musk but also have significant implications for Indian professionals and US companies. The controversy surrounding the H-1B program reignited when Musk took to social media to vociferously defend the program against criticisms from immigration hardliners. Musk’s electric vehicle company, Tesla, alone secured 724 H-1B visas this year, underscoring his vested interest in maintaining the program. Trump echoed Musk’s sentiments in an interview, stating, “I’ve always liked the visas. I have used it many times. It’s a great program.”\n\nThis admission not only signals a softening of his earlier rhetoric but also a pragmatic acknowledgment of the program’s benefits to the US economy. Indian IT professionals stand to benefit immensely from Trump’s change in stance. Historically, Indians have been the largest beneficiaries of the H-1B visa program, occupying a lion’s share of the annual quota. Trump’s endorsement could reassure prospective applicants and existing visa holders about the continuity of the program, which has often been a lifeline for skilled workers seeking opportunities in the United States. The move also counters recent fears of stringent immigration policies that could hinder their aspirations. The US technology sector, which has long relied on the H-1B visa program to address skill shortages, is likely to welcome Trump’s shift. Companies like Google, Microsoft, and Tesla have consistently advocated for thec ontinuation of the program, citing a lack of homegrown talent to meet the industry’s demands. Musk’s pointed critique of American culture’s celebration of mediocrity over excellence highlights the role of foreign talent in driving innovation and maintaining the US’s competitive edge globally. Trump’s stance, however, has drawn ire from far-right activists and prominent figures within his own party. Critics, including Steve Bannon and Nikki Haley, argue that prioritising foreign workers undermines American labour and exacerbates domestic unemployment. Trump’s endorsement of the H-1B visa program reflects a pragmatic shift rather than an ideological reversal. Recognising the indispensable role of skilled immigrants in the US economy, his administration’s move signals a commitment to fostering economic growth and maintaining technological leadership. For Indian professionals, it offers renewed hope, and for US tech companies, it ensures access to the global talent pool they rely on to innovate and thrive.","url":"https://www.dailypioneer.com/2024/columnists/shifting-stance.html","image":"https://www.dailypioneer.com/uploads/2024/story/images/big/shifting-stance-2024-12-30.jpg","video":null,"publish_date":"2024-12-31 00:15:50","author":"Daily Pioneer","authors":["Daily Pioneer"],"language":"en","source_country":"in","sentiment":0.224},{"id":277197846,"title":"Former US President Jimmy Carter, after whom an Indian village was named, passes away at 100","text":"Jimmy Carter, the 39th US president and the third American leader to visit India during which a village in Haryana was named Carterpuri in his honour, has died peacefully at his home in Plains, Georgia surrounded by his family, the Carter Centre said.\n\nCarter died on Sunday aged 100. He was the longest-lived president in US history.\n\n“Today, America and the world lost an extraordinary leader, statesman and humanitarian,” President Joe Biden said in a statement, mourning his loss.\n\nCarter is survived by his children — Jack, Chip, Jeff, and Amy; 11 grandchildren; and 14 great-grandchildren. He was predeceased by his wife Rosalynn and one grandchild.\n\n“My father was a hero, not only to me but to everyone who believes in peace, human rights, and unselfish love. My brothers, sister and I shared him with the rest of the world through these common beliefs. The world is our family because of the way he brought people together, and we thank you for honouring his memory by continuing to live these shared beliefs,” Chip Carter said.\n\nIn his statement, Biden said over six decades, with his compassion and moral clarity, Carter worked to eradicate disease, forge peace, advance civil rights and human rights, promote free and fair elections, house the homeless, and always advocate for the least among the people. He saved, lifted, and changed the lives of people all across the globe.\n\n“He was a man of great character and courage, hope and optimism. We will always cherish seeing him and Rosalynn together. The love shared between Jimmy and Rosalynn Carter is the definition of partnership and their humble leadership is the definition of patriotism. We will miss them both dearly, but take solace knowing they are reunited once again and will remain forever in our hearts,” said Biden and First Lady Dr Jill Biden.\n\nPresident-elect Donald Trump said while he \"strongly disagreed\" with Carter \"philosophically and politically\", he also realised that he truly loved and respected \"our country, and all it stands for\".\n\n\"He worked hard to make America a better place, and for that, I give him my highest respect. He was a truly good man and, of course, will be greatly missed. He was also very consequential, far more than most Presidents, after he left the Oval Office,” Trump said.\n\nCarter was considered a friend of India. He was the first American president to visit India after the removal of the emergency and victory of the Janata Party in 1977. In his address to the Indian parliament, Carter spoke against authoritarian rule.\n\n“India's difficulties, which we often experience ourselves and which are typical of the problems faced in the developing world, remind us of the tasks that lie ahead. Not the Authoritarian Way,” Carter said on January 2, 1978.\n\n“But India's successes are just as important because they decisively refute the theory that in order to achieve economic and social progress, a developing country must accept an authoritarian or totalitarian government and all the damage to the health of the human spirit which that kind of rule brings with it,” he told members of parliament.\n\n“Is democracy important? Is human freedom valued by all people?... India has given her affirmative answer in a thunderous voice, a voice heard around the world. Something momentous happened here last March, not because any particular party won or lost but rather, I think, because the largest electorate on earth freely and wisely chose its leaders at the polls. In this sense, democracy itself was the victor,” Carter said.\n\nA day later at the signing of the Delhi declaration along with then Prime Minister Morarji Desai, Carter said at the heart of the friendship between India and the US is their determination that the moral values of the people must also guide the actions of the states, the governments.\n\n“The United States gave the world an illustration of a new form of government, with a new relation between the citizen and the state — a relation in which the state exists to serve the citizen, and not the citizen to serve the state,” he said.\n\n“India experimented with creating political unity from overwhelming human diversity, enabling people of different cultures and languages and religions to work together, both in independence and also in freedom. Yours is an experiment whose success the world is celebrating anew,” Carter said in the Ashoka Hall of the Rashtrapati Bhawan.\n\nAccording to the Carter Centre, on January 3, 1978, Carter and then First Lady Rosalynn Carter travelled to the village of Daulatpur Nasirabad, an hour southwest of New Delhi. He was the third American president to visit India and the only one with a personal connection to the country – his mother, Lillian, had worked there as a health volunteer with the Peace Corps during the late 1960s.\n\n“The visit was so successful that shortly after, village residents renamed the area 'Carterpuri' and remained in contact with the White House for the rest of President Carter's tenure,\" the Carter Centre said.\n\n\"The trip made a lasting impression: Festivities abounded in the village when President Carter won the Nobel Peace Prize in 2002, and January 3 remains a holiday in Carterpuri,” the centre said, adding that the visit laid the groundwork for an enduring partnership that has greatly benefited both countries.\n\nPresident Carter understood that shared democratic principles formed a strong foundation for a long, fruitful relationship between the US and India. It is, therefore, no surprise that the two nations grew steadily closer in the decades after he left office, it said.\n\n“In fact, since the Carter administration, the US and India have worked closely on energy, humanitarian aid, technology, space cooperation, maritime security, disaster relief, counterterrorism, and more. In the mid-2000s, the United States and India struck a landmark agreement to work toward full civil nuclear cooperation, and bilateral trade has since skyrocketed,” the centre said.\n\n\"In 2010, the first US-India Strategic Dialogue took place in Washington DC, launching what President Barack Obama called 'an unprecedented partnership'. The arc of US-India ties from the Carter administration to the Biden administration is one of increasing cooperation in both depth and breadth. There are many areas of mutual interest — particularly trade and defence — where successful collaboration has fostered interdependency between the two countries,” it said.\n\nRonak D Desai, Partner and India Practice Leader at Paul Hastings law firm, said Carter's presidency marked a pivotal moment in US-India relations.\n\nAfter the strain caused by the Nixon administration's infamous “tilt” toward Pakistan during the Indo-Pakistan War of 1971, Carter understood the critical importance of re-engaging with India as a democratic partner in a rapidly evolving global order. His visit to India in 1978 was not merely symbolic but a substantive effort to rebuild trust and establish a framework for dialogue rooted in mutual respect and shared values, he said.\n\n“While Carter's presidency was often viewed through the lens of domestic challenges, his contributions to US-India relations were transformative,\" Desai said.","url":"https://www.dailypioneer.com/2024/trending-news/former-us-president-jimmy-carter--after-whom-an-indian-village-was-named--passes-away-at-100.html","image":"https://www.dailypioneer.com/uploads/2024/story/images/big/former-us-president-jimmy-carter--after-whom-an-indian-village-was-named--passes-away-at-100-2024-12-30.jpg","video":null,"publish_date":"2024-12-31 00:15:50","author":"Daily Pioneer","authors":["Daily Pioneer"],"language":"en","category":"politics","source_country":"in","sentiment":0.287},{"id":277197818,"title":"Falling Sensex, Rising Rupee: Where is India headed?","text":"The din around the falling Sensex and depreciating Rupee has been hard to miss, and understandably, human nature makes us worry when markets falter. For many investors, even those with mutual fund investments, the recent market trends might feel like storm clouds on the horizon. But markets, much like seasons, naturally cycle through growth, correction, and recovery phases. What’s happening now isn’t the collapse of some fear; rather, it’s a moment for perspective, patience, and clarity about the underlying factors at play.\n\nThe equities landscape has seen corrections in the Sensex and Nifty, particularly since September 2024, causing unease. However, it’s worth noting that these indices have been on a nine-year bull run, delivering around 9per cent growth year-to-date, even after recent declines. Much of the decline stems from significant selling by Foreign Institutional Investors (FIIs), who have offloaded over Rs 1.19 lakh crore worth of equities through exchanges this year. Interestingly, while exiting the secondary market, FIIs have invested more than Rs 1.2 lakh crore in the primary market during 2024, including Rs 17,331 crore in December alone, making them net investors in India. This dual approach suggests the sell-off is more about short-term profit-booking and global fund reallocation than a loss of confidence in India’s long-term growth prospects.\n\nGlobal factors have also fueled this sell-off. China’s aggressive stimulus measures boosted the CSI 300 index by 25per cent since the announcement, diverting significant FII flows from India. Investors, however, are closely watching to see how effectively the government can address structural economic challenges and navigate concerns of potential overvaluation in the market. Weak domestic Q2 earnings, with 44per cent of companies missing profit expectations as per an analyst report, further dampened short-term sentiment.\n\nThe year 2024 was a battleground between bulls and bears, characterised by intense volatility driven by key events such as the Indian general elections, the US presidential race, and a host of geopolitical tensions, including the Israel-Iran conflict. Yet, India’s macroeconomic fundamentals remain strong with high potential bank lending, 13-year low gross non-performing assets (GNPA) at 2.5 per cent as of September 2024, expected inflation easing, and robust private spending. This correction, while concerning, does not signal a structural problem.\n\nNow, let’s address the Rupee, another point of concern. Over 2024, the Rupee depreciated by around three per cent, with approximately two per cent occurring in the last quarter against the US Dollar. The Dollar is strengthening because of Donald Trump’s public pronouncements favouring universal tariff hikes (more on the import of Chinese goods), mass deportation of illegal immigrants and income tax cuts.\n\nIf translated into policy, these are expected to increase the US economy’s inflation. As a result, the 10-year US Treasury yield, now above 4.5per cent, has made US assets more attractive, narrowing the India-US bond yield spread to ~230 basis points, its lowest level since 2006, and has halved in 2 years. All this makes capital outflows from emerging markets, including India. Although the Rupee is hitting lows against the US Dollar, its exchange rate has scaled an all-time high in real terms. The Real Effective Exchange Rate (REER) index of the rupee touched a record of 108 in November 2024, strengthening by 4.5per cent during this calendar year. The REER measures the rupee value not only against the dollar, but against the global currencies.\n\nThis was a broad dollar strengthening that reduced the attractiveness of the Indian currency, thus making it vulnerable to greater selling pressure and further depreciation. The rupee is not weakening as much as the dollar is strengthening against all currencies. The Rupee has appreciated against major currencies like the Euro, Pound, and Australian Dollar. The Euro fell from Rs 91.84 on December 31, 2023, to Rs 89.10 by December 30, 2024. Similarly, the Australian Dollar dropped from Rs 56.64 to Rs 53.33 and Swiss Franc dipped from Rs 98.88 to Rs 94.71 over the same period. This shows the Rupee’s resilience even against some of the world’s strongest currencies.\n\nDespite these challenges, India’s external accounts have shown resilience. The Current Account Deficit (CAD) narrowed slightly to 1.2per cent of GDP in Q2 FY25 from 1.3 per cent in the previous year. The fiscal deficit, which had ballooned to 9.2 per cent during the pandemic, is now down to 5.6 per cent. In this context, the Rupee’s movements reflect global dynamics rather than intrinsic weaknesses in India’s economy. Emerging market currencies, including the Brazilian Real, Indonesian Rupiah, Chinese Yuan, and Russian Ruble, also depreciated against the Dollar, reflecting the Dollar’s global strength rather than specific Rupee weakness.\n\nFor investors, these fluctuations in equities and currency understandably cause concern. Yet, mutual funds remain among the most effective tools for navigating such volatility. Their diversification spreads risk across sectors and asset classes, cushioning downturn impacts. Professional fund management ensures investment decisions are data-driven and strategic, avoiding emotional reactions.\n\nThese strategies work particularly well in volatile markets like today’s. History offers reassurance too. Market corrections are not new, and those who stay invested typically see rewards over time. The Sensex has weathered several corrections, each followed by strong recoveries. Mutual funds’ long-term focus allows investors to ride out market cycles without attempting the challenging task of market timing.\n\nWhat we see today is flux, not collapse. The Sensex and Nifty remain among the top-performing indices globally over the past decade, and the Rupee’s movement aligns with trends in other emerging market currencies. India’s strong economic fundamentals, structural reforms, and strategic trade agreements suggest the long-term trajectory remains upward. This correction is not a reason to exit but a reminder to stay the course.\n\n— The writer is Professor of Finance – XLRI Xavier School of Management and a BJP Leader","url":"https://www.dailypioneer.com/2024/pioneer-exclusive/falling-sensex--rising-rupee--where-is-india-headed-.html","image":"https://www.dailypioneer.com/uploads/2024/story/images/big/falling-sensex--rising-rupee--where-is-india-headed--2024-12-31.jpg","video":null,"publish_date":"2024-12-31 00:15:50","author":"Daily Pioneer","authors":["Daily Pioneer"],"language":"en","source_country":"in","sentiment":-0.04},{"id":277197964,"title":"Heraldsun.com.au","text":"Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n\n \n \n \n \n \n \n Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n \n \n \n $5/WEEK\n \n \n \n \n \n \n\n \n\n \n \n \n $5/WEEK\n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.heraldsun.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n Lock in & save\n \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.heraldsun.com.au/subscriptionterms for full details.","url":"https://www.heraldsun.com.au/news/world/united-states/donald-trump-loses-appeal-in-writers-sexualabuse-verdict/news-story/4d6ec32fbb78c7cd5b179111681c762c","image":"https://content.api.news/v3/images/bin/59cddccbcd9ebc84f61e9cd8918bfc44","video":null,"publish_date":"2024-12-31 00:14:50","author":null,"language":"en","category":"environment","source_country":"au","sentiment":-0.559},{"id":277196254,"title":"US ex-prez Jimmy Carter dies at 100; Amir pays tribute | Kuwait Times Newspaper","text":"WASHINGTON: Flags flew at half-staff across the United States on Monday as global tributes poured in for the life and legacy of Jimmy Carter — the longest-lived US president who died aged 100. The Georgia native, whose unlikely political ascent carried him from picking peanuts on the family farm to the Oval Office, was remembered in glowing eulogies as an ardent defender of human rights and champion of the downtrodden.\n\nHe will be honored with public observances in his beloved home state and in Washington in the coming days. The first president to reach triple digits, Carter had been in hospice care in his hometown of Plains since Feb 2023. The Carter Center, his post-presidential humanitarian and pro-democracy organization, announced Sunday he had died “peacefully” at home “surrounded by his family”.\n\nThe White House flag was lowered to half-staff, while President Joe Biden has scheduled a state funeral for Jan 9 and declared it a National Day of Mourning. HH the Amir Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah sent a cable of condolences to Biden expressing condolences on death of Carter, invoking Almighty Allah to grace his family patience. HH the Crown Prince Sheikh Sabah Al-Khaled Al-Hamad Al-Sabah and HH the Prime Minister Sheikh Ahmad Al-Abdullah Al-Sabah sent similar cables of condolences.\n\nNo formal announcements have been made about ceremonies in Georgia, although the late president is expected to be conveyed by motorcade to the state capitol in Atlanta, The New York Times reported, citing longstanding plans. He will lie in repose for around 36 hours at the Carter Center, the organization said, before being flown to Washington to lie in state at the US Capitol for around the same duration. He will be buried in Plains after the traditional televised funeral at Washington National Cathedral accorded to every US president.\n\nBiden said in a heartfelt speech Sunday that Carter had “lived a life measured not by words, but by his deeds,” while the country’s living former presidents — from Bill Clinton to Donald Trump — lauded his public service, work ethic and commitment to justice. The New York Stock Exchange — which just suffered its longest losing streak since Carter was in the White House — held a minute’s silence.\n\nInternational tributes were led by UN Secretary-General Antonio Guterres and China’s President Xi Jinping, who said he was “deeply saddened,” according to state media.\n\nPope Francis offered “heartfelt condolences,” the Vatican said, recalling Carter’s “firm commitment, motivated by deep Christian faith, to the cause of reconciliation and peace”.\n\nCarter voted for last time in November’s presidential election, casting his ballot by mail, according to his family, after voicing determination to “live to vote for Kamala Harris”, the Democratic vice president who was ultimately defeated by Trump. He was the oldest ever former US president, outliving writers who contributed to his obituaries at The New York Times and Washington Post by seven years and 10 years respectively.\n\nBut his longevity had seemed unlikely when the Southern Democrat revealed in 2015 that he had brain cancer. The US Navy veteran defied the odds to enjoy a long post-presidency, after four years in the Oval Office notable for his success in forging peace between the Zionist entity and Egypt, but overshadowed by the Iran hostage affair and his handling of an oil crisis. The father-of-four lost in a landslide to Ronald Reagan in 1980.\n\nYet in the decades that followed, Carter’s reputation grew through his humanitarian and diplomatic work and his efforts to build homes with his wife Rosalynn as part of Habitat for Humanity. Carter won the Nobel Peace Prize in 2002 “for his decades of untiring effort to find peaceful solutions to international conflicts, to advance democracy and human rights, and to promote economic and social development.”\n\nThe first US president born in a hospital, he taught Sunday school at Maranatha Baptist, his church in Plains, well into his 90s. He was married for 77 years to Rosalynn, a fellow Plains native who had known Carter her entire life. By the time she died at age 96 on Nov 19, 2023, it was the longest presidential marriage in US history. Carter’s final public appearance was at his wife’s memorial service, where he sat in the front row in a wheelchair. – AFP","url":"https://kuwaittimes.com/article/22909/world/america/us-ex-prez-jimmy-carter-dies-at-100-amir-pays-tribute/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2024/12/30/198138.jpg","video":null,"publish_date":"2024-12-31 00:07:52","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","category":"politics","source_country":"kw","sentiment":0.08},{"id":277196280,"title":"Trump loses appeal of $5m defamation, sexual assault verdict | Kuwait Times Newspaper","text":"NEW YORK: A federal appeals court on Monday upheld a $5 million verdict that E Jean Carroll won against Donald Trump when a jury found the US president-elect liable for sexually abusing and later defaming the former magazine columnist. A unanimous three-judge panel of the 2nd US Circuit Court of Appeals in Manhattan rejected Trump’s argument that the trial judge made mistakes in letting jurors hear evidence about the Republican’s alleged past sexual misconduct, making the trial and verdict unfair.\n\nThe court said that evidence, including Trump bragging about his sexual prowess on an “Access Hollywood” video that surfaced during the 2016 US presidential campaign, established a “repeated, idiosyncratic pattern of conduct” consistent with Carroll’s allegations. “Taking the record as a whole and considering the strength of Ms Carroll’s case, we are not persuaded that any claimed error or combination of errors in the district court’s evidentiary rulings affected Mr. Trump’s substantial rights,” the court said in an unsigned decision.\n\nLawyers for Trump did not immediately respond to requests for comment. A lawyer for Carroll did not immediately respond to similar requests. The May 2023 verdict stemmed from an incident around 1996 in a Bergdorf Goodman department store dressing room in Manhattan, where Carroll, now 81, said Trump raped her, and an October 2022 Truth Social post where Trump denied Carroll’s claim as a hoax. Though jurors in federal court in Manhattan did not find that Trump, 78, committed rape, they awarded the former Elle magazine advice columnist $2.02 million for sexual assault and $2.98 million for defamation.\n\nA different jury ordered Trump in January to pay Carroll $83.3 million for defaming her and damaging her reputation in June 2019, when he first denied her rape claim. In both denials, Trump said he did not know Carroll, she was “not my type,” and that she fabricated the rape claim to promote her memoir. He is appealing the $83.3 million verdict.\n\nCarroll’s cases are continuing despite Trump having won a second four-year White House term on Nov 5. In 1997, in a case involving former President Bill Clinton, the US Supreme Court ruled unanimously that sitting presidents have no immunity from civil litigation in federal court over actions predating and unrelated to their official duties as president. Trump’s lawyers argued the $5 million verdict should be thrown out because the trial judge, US District Judge Lewis Kaplan, should not have let jurors hear testimony from two other women who accused Trump of sexual misconduct.\n\nOne, businesswoman Jessica Leeds, said Trump groped her on a plane in the late 1970s. The other, former People magazine writer, Natasha Stoynoff, said Trump forcibly kissed her at his Mar-a-Lago estate in 2005. Trump’s lawyers also said the trial judge should not have let jurors watch the 2005 “Access Hollywood” video, where Trump boasted graphically about forcing himself on women.\n\nBut the court said that in each of these encounters, “Mr. Trump engaged in an ordinary conversation with a woman he barely knew, then abruptly lunged at her in a semi-public place and proceeded to kiss and forcefully touch her without her consent.” It said this was “relevant to show a pattern tending to directly corroborate witness testimony and to confirm that the alleged sexual assault [of Carroll] actually occurred.” — Reuters\n\nThe court also rejected Trump’s claim that Kaplan should have allowed evidence that a prominent Democratic critic, billionaire LinkedIn co-founder Reid Hoffman, funded Carroll’s case, saying it had “little probative value.” Carroll is also a Democrat. Kaplan also oversaw the trial that ended with the $83.3 million verdict. – Reuters","url":"https://kuwaittimes.com/article/22898/world/america/trump-loses-appeal-of-5m-defamation-sexual-assault-verdict/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2024/12/30/198066.jpg","video":null,"publish_date":"2024-12-31 00:07:52","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","category":"politics","source_country":"kw","sentiment":-0.373},{"id":277196304,"title":"US, foreign leaders hail Jimmy Carter’s legacy | Kuwait Times Newspaper","text":"WASHINGTON: Joe Biden led US presidents and other world leaders in paying tribute to Jimmy Carter, who died aged 100. “America and the world lost an extraordinary leader, statesman and humanitarian,” Biden said in a statement released by the White House on Sunday.\n\nHe added later in a televised address that Carter “lived a life measured not by words, but by his deeds.” “We’d all do well to try and be a little more like Jimmy Carter.”\n\nPresident-elect Donald Trump said Americans owe Carter “a debt of gratitude.”\n\n“The challenges Jimmy faced as president came at a pivotal time for our country and he did everything in his power to improve the lives of all Americans,” he said on social media.\n\nAmong former US presidents, Bill Clinton said his predecessor had “worked tirelessly for a better, fairer world.” George W Bush said Carter “dignified the office. And his efforts to leave behind a better world didn’t end with the presidency.”\n\nBarack Obama hailed Carter for teaching “all of us what it means to live a life of grace, dignity, justice and service.”\n\nThe 39th US president “was early to recognize that protecting our shared planet and promoting global public health were vital to national security interests,” Secretary of State Antony Blinken said. Pope Francis “was saddened to learn” of Carter’s death, recalling his “firm commitment, motivated by deep Christian faith, to the cause of reconciliation and peace between peoples, the defence of human rights and the welfare of the poor and those in need”, said Cardinal Pietro Parolin, the Vatican’s secretary of state.\n\nAt the United Nations, Secretary-General Antonio Guterres said Carter would be remembered “for his solidarity with the vulnerable, his abiding grace, and his unrelenting faith in the common good and our common humanity.” World Health Organization chief Tedros Adhanom Ghebreyesus noted Carter’s post-presidency work with his foundation “saved countless lives and helped bring many neglected tropical diseases close to elimination.”\n\nEgyptian leader Abdel Fattah al-Sisi praised Carter as “a symbol of humanitarian efforts” for his role in brokering the historic 1978 Camp David Accords, which established peace between Egypt and its most serious adversary at the time, Zionist entity. Zionist entity President Isaac Herzog said the treaty Carter clinched “remains an anchor of stability throughout the Middle East and North Africa many decades later.”\n\n“His legacy will be defined by his deep commitment to forging peace between nations,” Herzog said. European Commission President Ursula von der Leyen called for Carter’s “noble legacy” to live on.\n\n“His work advanced peace, health and democracy worldwide,” she said. “He will be remembered for his moral leadership.” German Chancellor Olaf Scholz said with the death of Carter, “The United States lost a fighter for democracy. The world lost a great mediator for peace in the Middle East and for human rights.”\n\nCanadian Prime Minister Justin Trudeau said Carter “was always thoughtful and generous with his advice to me.” Mexico’s ministry of foreign affairs called Carter’s death a “regrettable loss.”\n\nBritain’s head of state King Charles III said Carter’s “dedication and humility served as an inspiration to many,” while Prime Minister Keir Starmer paid tribute to the US leader’s “lifelong dedication to peace.” In Panama, where Carter reached an agreement to hand over the Panama Canal, then under US control, President Jose Mulino praised the Democrat for helping his country achieve “full sovereignty.”\n\nBrazil’s Luiz Inacio Lula da Silva hailed Carter as “a lover of democracy and defender of peace,” noting his pressuring of Brazil’s dictatorship to release political prisoners. “He will be remembered forever as a name that defends the idea that peace is the most important condition for development,” Lula said.\n\nThough many focused on his time in office, from 1977-1981, Ukrainian President Volodymyr Zelensky highlighted Carter’s “unwavering support for Ukraine in the face of Russia’s unprovoked aggression.” French President Emmanuel Macron said Carter had “been a steadfast advocate for the rights of the most vulnerable and has tirelessly fought for peace.”\n\nIn China, where Carter’s administration normalized diplomatic relations with Beijing in 1978, leader Xi Jinping said he was “deeply saddened”. Carter “had long made significant contributions to advancing the development of China-US ties and fostering friendly exchanges and cooperation between the two countries”, state broadcaster CCTV reported Xi as saying.\n\nCarter’s legacy lies even beyond Earth, as NASA Administrator Bill Nelson pointed out Sunday.\n\nThe space agency’s Voyager 1 probe, launched in 1977 and still flying through the stars, carries a recorded message from Carter “that captures his core goodness and grace.”\n\nCarter says in the recording: “This is a present from a small distant world, a token of our sounds, our science, our images, our music, our thoughts and our feelings. “We are attempting to survive our time so we may live into yours. We hope someday, having solved the problems we face, to join a community of galactic civilizations.”\n\nNelson, in a statement, added that “President Carter understood an important truth: that we find common ground when we look to the stars.” – AFP","url":"https://kuwaittimes.com/article/22894/world/america/us-foreign-leaders-hail-jimmy-carters-legacy/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2024/12/30/198035.jpg","video":null,"publish_date":"2024-12-31 00:07:52","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","category":"politics","source_country":"kw","sentiment":0.126},{"id":277199110,"title":"2024 Chicago News Recap: Tornadoes, Joliet Homicides, Police Officer Deaths, DNC Protests, and Further Updates","text":"CHICAGO (WLS) — The year 2024 began with our area’s biggest New Year’s Eve party!\n\nCheryl Scott and Terrell Brown teaming up for another spectacular dance performance for “Countdown Chicago.” They played secret agents on a mission to stop an A.I. robot takeover of the city.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nThe new year also led to new action in multiple suburbs to address the growing migrant crisis. Several communities adopted rules to regulate buses dropping off migrants.\n\nLater on in January, Joliet was rocked by a horrific murder spree. Eight people were killed at three separate homes. The suspect taking his own life after a manhunt that led police to Texas.\n\nIt was another record-breaking year for the Great Chicago Blood Drive. ABC7 proudly partnered with the American Red Cross for the 10th annual event. And thanks to our generous donors, we collected more than 2,800 units of blood.\n\nIn February, a tornado outbreak swept through the Chicago, damaging buildings and bringing down power lines and trees.\n\nFebruary also marked the start of a major story that’s still unfolding now in the south suburbs. Village trustees in Dolton formally asked for a federal investigation into embattled Mayor Tiffany Henyard.\n\nAlso happening in February, the trial began for the man charged with killing Chicago Police Officer Ella French. A jury would later find Emonte Morgan guilty of her murder.\n\nThe primary election was held in March, and the most-watched race was for the Democratic nomination for Cook County state’s attorney. Eileen O’Neill Burke won over Clayton Harris III.\n\nChicago also experienced its first measles case in five years. The number of cases continued to rise and led to a weeks-long outbreak that prompted a state response.\n\nAt the end of March, there was a stabbing rampage in Rockford. Four people were killed, including a postal worker and a teenage girl, and seven others were hurt.\n\nIn April, millions looked to the sky to witness the solar eclipse. We had live reports from across our region, as huge crowds gathered to experience the rare phenomenon from the path of totality – or close to it.\n\nThere was an arrest in the death of CPD Officer Luis Huesca, who was shot and killed on his way home from a shift.\n\nApril also saw a big announcement from the Chicago Bears. The team unveiled its proposal for a new lakefront stadium.\n\nThen in May, cicadas were all the buzz! The bugs invaded Illinois during an incredibly rare double emergence.\n\nProtests against the Israel-Hamas war continued on college campuses here and around the country. Students camped out for days, demanding a cease-fire in Gaza.\n\nIn June, former longtime Chicago Alderman Ed Burke was sentenced to two years in prison in his federal corruption case.\n\nAnd later that month, Chicago’s Pride Parade drew huge crowds, with thousands of people lining the streets on the city’s North Side.\n\nIn July of 2024, NASCAR took over the streets of downtown for the second installment of the Chicago Street Race.\n\nA global IT outage brought the world to a grinding halt, causing widespread disruption at airports, banks, and hospitals. The outage would later be blamed on a faulty software update. Here are your compensation rights if you were stranded or delayed by CrowdStrike technology outage.\n\nAlso in July, President Joe Biden announced he was withdrawing from the presidential race.\n\nThat same month, the Republican National Convention was held in Milwaukee, and on the final night, Donald Trump officially accepted his party’s nomination for president.\n\nThen in August, all eyes were on Chicago for the Democratic National Convention. Huge crowds were inside the United Center, large protests took place outside, and the week ended with Vice President Kamala Harris making history, as she became her party’s presidential nominee.\n\nAlso that month, Chicago held the Air and Water Show and the Bud Billiken Parade, bringing people to the lakefront and to Bronzeville on the same weekend.\n\nLater in August, the bodies of six hostages, including Israeli-American Hersh Goldberg-Polin, were discovered in Gaza. Hersh had been held hostage by Hamas since the October 7th attack on Israel.\n\nIn September, there was a second assassination attempt on Trump, following an earlier attempt in July.\n\nThere was also a quadruple murder on board a CTA train. All four victims were gunned down while they were sleeping.\n\nThe White Sox made history by losing their 121st game of the season. They became the team with the worst record ever in modern baseball history.\n\nIn October, the federal corruption trial of former Illinois House Speaker Michael Madigan began, and that trial is still underway today.\n\nThen in November, Trump defeated Harris to win a second term in the White House. The biggest race locally was for Cook County state’s attorney, with Democratic nominee Eileen O’Neill Burke winning the election.\n\nAlso that month, Chicago police lost another one of their own. CPD Officer Enrique Martinez was shot and killed during a traffic stop.\n\nThere was a stunning reversal in the Jussie Smollett case. Nearly three years after the actor was found guilty of lying about being the victim of a hate crime, the Illinois Supreme Court overturned his conviction.\n\nWe kicked off the holiday season as November came to a close. The Wintrust Magnificent Mile Lights Festival, the Millennium Park tree lighting, and other fun festivities spread cheer throughout the month of December.\n\nAnd after a weeks-long back-and-forth with the Chicago City Council, Mayor Brandon Johnson finally got a budget plan approved, without a property tax increase.","summary":"CHICAGO (WLS) &#8212; The year 2024 began with our area&#8217;s biggest New&#8230;","url":"https://internewscast.com/news/us/2024-chicago-news-recap-tornadoes-joliet-homicides-police-officer-deaths-dnc-protests-and-further-updates/","image":"https://internewscast.com/wp-content/uploads/2024/12/rewrite-this-title-Five-charged-over-Liam-Paynes-hotel-plunge-380x200.jpg","video":null,"publish_date":"2024-12-31 00:06:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.149},{"id":277196142,"title":"Trump endorses Mike Johnson to stay on as House Speaker despite government funding turmoil","text":"WEST PALM BEACH, Florida (AP) — President-elect Donald Trump on Monday endorsed House Speaker Mike Johnson, providing crucial backing for the Louisiana Republican as he prepares for what is expected to be another contentious speakership race this week.\n\nTrump said in a post on his social media platform that Johnson “is a good, hard working, religious man” and said he “will do the right thing, and we will continue to WIN.”\n\n“Mike has my Complete & Total Endorsement,” he wrote.\n\nJohnson thanked Trump for the endorsement and added, “The American people demand and deserve that we waste no time. Let’s get to work!”\n\nThe signal of support from Trump comes despite his frustration with a spending deal Johnson pushed through the House days before Christmas that failed to achieve his central goal of raising the debt limit.\n\nBut other Republicans have been less forgiving. Far-right criticism over the spending ordeal has left Johnson’s continued leadership of the incoming GOP majority once again in jeopardy. Though a deal was reached, averting a holiday shutdown, Johnson had to rely on Democrats to keep the government running, highlighting the limits of his influence and exposing cracks in his party’s support.\n\nThe speaker’s first two funding plans collapsed as Trump, who does not take the oath of office until Jan. 20, interceded with calls to suspend or lift the government debt ceiling.\n\nJohnson, who has worked hard to stay close to Trump over the last several months, convinced the president-elect that he would meet his demands to raise the debt limit in 2025.\n\nTrump had remained quiet about Johnson’s fate before a Jan. 3 leadership vote for over a week, even as some Republicans signaled that they may not support Johnson for the role.\n\nRep. Victoria Spartz, one of the Republicans who opposed Kevin McCarthy’s initial bid for the speakership, said in a statement Monday that “our next speaker must show courageous leadership to get our country back on track.”\n\nThe Indiana lawmaker went on to make a series of demands for the next leader of the GOP majority, which included major spending reform. Rep. Andy Harris, who is the chair of the ultra-conservative House Freedom Caucus, had also indicated that Johnson’s future as speaker is not guaranteed before the holidays.\n\nIn a Dec. 20 post on X, Harris said that Republicans have not done enough to bring down “spending, deficits and inflation” since Trump’s electoral victory in November.\n\nBecause of this, Harris wrote, “I am now undecided on what House leadership should look like in the 119th Congress.”","url":"https://www.nation.lk/online/trump-endorses-mike-johnson-to-stay-on-as-house-speaker-despite-government-funding-turmoil-289819.html","image":"https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2024/12/Johnson.jpg","video":null,"publish_date":"2024-12-31 00:06:54","author":"China State","authors":["China State"],"language":"en","category":"politics","source_country":"lk","sentiment":-0.256},{"id":277196872,"title":"Palestinian leader predicts Trump will ‘destroy’ Iran and crumble Hamas","text":"NABLUS, West Bank — A top Palestinian leader told The Post he expects that President-elect Donald Trump will “destroy Iran,” which will cause remaining Hamas influence to crumble.\n\nHamas has been decimated by Israel’s war in the Gaza Strip, but in the West Bank the terror group has been rising up against the Palestinian Authority, which is run by the rival Fatah party.\n\nThe Palestinian Authority is supported by western governments including the US, and Hamas and other Islamist groups accuse it of cozying up to Israel.\n\nPalestinian security forces have been cracking down in particular at refugee camps in the West Bank town of Jenin, where more than a dozen extremist gunmen stole two PA government vehicles earlier this month, parading them around while waving Hamas and ISIS flags.\n\n“We are confronting Hamas’ ideology. Our problem is with Hamas’ link to regimes outside Palestine,” Mohammad Hamdan, Secretary General of the PA’s ruling Fatah party told The Post, referencing Iran in particular.\n\nBut Hamdan said he expects Trump’s return to the White House will lead to the jihadists’ defeat.\n\n”We see that Trump and the ruling government in Israel are planning to destroy Iran, so Hamas [followers] will have no other choice than to become Palestinian,” the Fatah leader predicted. \n\nThe PA has killed at least three extremist militants in Jenin since the Dec. 6 incident as it pledges to either arrest or eliminate all participants.\n\nThe Post spoke with Hamdan and several other top PA leaders in Nablus, about an hour south of Jenin, on Dec. 19.\n\nHamas took over the Gaza Strip after defeating Fatah in a 2006 election. The terror group’s brutal rule included an Islamist crackdown in the Palestinian territory and repeated incursions into Israel. \n\nIt culminated with the Oct. 7, 2023, attack on southern Israel in which terrorists killed 1,200 people and took more than 250 hostage.\n\nFatah, the US and Israel have a shared goal in fighting Hamas, which includes the destruction of the state of Israel as a founding principle.\n\n“Hamas rejects international legitimacy, meaning UN resolutions,” Hamdan said. \n\n“The world cannot accept a situation where a party does not accept international resolutions.”\n\nIn interviews with The Post, Palestinian Authority leaders condemned the growth of Israeli settlements in the West Bank — but acknowledged Israel’s right to exist.\n\nHamdan also said Palestinian Authority President Mahmoud Abbas “still supports realistic relations with the Americans in order to achieve the aspirations of the Palestinians.” \n\nHowever, he also expressed strong skepticism of US policy in the Middle East — and blamed the rise of Islamic extremism on American foreign policy.\n\n“Look what happened in Syria. First, the US declared the rebels to be al Qaeda, and then [last week] an American delegation visited Syria,” he said. “And the one before that, when the Americans struck deals with the Taliban in Afghanistan.”\n\n“We as Palestinians believe that most of these extremist Islamic groups are produced by America by its effort to create a new Middle East,” the secretary general claimed.\n\nA senior Israeli official told The Post that the PA’s opposition to Hamas could further provide leverage for peace talks.\n\n“There could be a historically unprecedented opportunity for the PA” to strengthen its grasp on the Palestinian territories, the official said.\n\nThe Palestinian Authority has been floated as one option to govern the Gaza Strip once the war ends.\n\nHowever, the official said, the Palestinian Authority would need to “stop the corruption” and cease “funding terrorism” on Israeli settlers to “participate in day-after talks” about Gaza’s post-Hamas governance.\n\n“I still prefer [the PA] to radical Islamists,” the official noted.","summary":"A top Palestinian Authority leader told The Post this month he expects that President-elect Donald Trump will “destroy Iran,” which would crumble remaining Hamas cells in the West Bank that the region’s governing body are working to defeat.","url":"https://nypost.com/2024/12/30/world-news/palestinian-leader-predicts-trump-will-destroy-iran-and-crumble-hamas/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/fatah-secretary-general-mohammad-hamdan-96015146.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/l1QLZSyr-RyIcpnTz.mp4","publish_date":"2024-12-31 00:04:55","author":"Caitlin Doornbos","authors":["Caitlin Doornbos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.288},{"id":277195704,"title":"Three senior DOJ officials leaked non-public investigative information ‘days before an election,’ inspector general finds","text":"Three senior Justice Department officials violated internal policies and engaged in “misconduct” when they leaked details about a non-public investigation to the media “days before an election,” the agency’s inspector general revealed Monday.\n\nThe DOJ’s Office of the Inspector General (OIG), which has been run by Michael Horowitz since 2012, launched a probe after it received a complaint alleging that a “politically motivated” disclosure related to “information about ongoing matters” was made in the runup to an unspecified election. \n\n“The OIG investigation found that three then Senior DOJ Officials violated DOJ’s Confidentiality and Media Contacts Policy by leaking to select reporters, days before an election, non-public DOJ investigative information regarding ongoing DOJ investigative matters, resulting in the publication of two news articles that included the non-public DOJ investigative information,” the DOJ OIG said in a brief investigative summary.\n\n“The OIG investigation also found that one of these three then Senior DOJ Officials violated the Confidentiality and Media Contacts Policy and DOJ’s Social Media Policy by reposting through a DOJ social media account links to the news articles,” the summary continued. \n\nThe three officials were no longer DOJ employees when the investigation began and declined or did not respond to interview requests, according to the OIG, which does not have the authority to compel testimony from former employees. \n\n“The OIG has completed its investigation and provided its report to the Office of the Deputy Attorney General and, because the report contained misconduct findings against attorneys, provided its report to the Professional Misconduct Review Unit for appropriate action,” Horowitz’s office said, adding that a report was also provided to the US Office of Special Counsel for potential Hatch Act violations to be investigated. \n\nIt’s unclear what investigation the former DOJ employees are accused of leaking to media outlets.\n\nIn September, Sen. Chuck Grassley also wrote a letter to Attorney General Merrick Garland and FBI Director Christopher Wray that was also forwarded to Horowitz, accusing the DOJ and FBI of “leaking material and information to the media” about an ultimately closed probe into President-elect Donald Trump. \n\nThe shuttered investigation pertained to allegations from a “confidential informant” that Egyptian President Abdel Fatah El-Sisi sought to boost Trump’s 2016 presidential campaign with $10 million in cash. \n\nThe investigation, initially handled by former Special Counsel Robert Mueller’s team, was closed in June 2020 over a “lack of sufficient evidence” — but reported by the Washington Post in August 2024.\n\nThe outlet cited “people familiar with the case” and “thousands of pages of government records, including sealed court filings” in its reporting.\n\nGrassley (R-Iowa) fired off another letter to Garland, Wray and Horowitz, as well as special counsel Jack Smith, after the November 2024 election — to ensure that all records relating to Smith’s investigations into Trump are preserved. \n\nIn the missive, the senator notes that the request is necessary “considering the Justice Department’s past destruction of federal records” related to Mueller’s Trump probe and Smith’s use of at least one FBI special agent who worked aspects of the Mueller investigation and “would’ve most likely had access to or been made aware of information” leaked to the Washington Post about the Egypt-Trump probe. \n\nTrump, 78, has long accused Smith – the prosecutor tasked with leading the classified documents and 2020 election interference inquiries into Trump – of leaking details of his investigation to the media “like a sieve.”\n\nHe raged on social media in June 2023, as he campaigned for the GOP presidential nomination, that Smith “illegally leaked” an audio recording of him seemingly discussing a classified document related to Iran at his Bedminster, NJ, golf club. \n\nA redacted transcript of the recording was included in Smith’s indictment against Trump in the classified documents case, which was dismissed by a federal judge in July.\n\nTrump’s first term in office was marked by leaks during and after the 2016 election about the FBI’s probe into alleged collusion between Russia and his campaign — leading to scathing reports by Horowitz and two separate investigations by Mueller and special counsel John Durham into the bureau’s conduct.\n\nThe OIG even referred ex-FBI boss James Comey for prosecution himself for leaking some internal memos to the media, NBC News reported in 2019, but the DOJ chose not to bring charges.\n\nAnother DOJ corruption probe into Sen. Bob Menendez was also leaked months before the Garden State Democrat’s indictment in September 2023 and ahead of his decision to announce his independent run for re-election, which was later aborted due to his conviction on the bribery charges this year.\n\nReps for the DOJ OIG declined to comment.","summary":"The DOJ’s Office of the Inspector General (OIG) launched a probe after it received a complaint alleging that a “politically motivated” disclosure related to “information about ongoing matters” was made in the runup to an unspecified election. ","url":"https://nypost.com/2024/12/30/us-news/three-senior-doj-officials-leaked-non-public-investigative-information-days-before-an-election-inspector-general-finds/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-m8xexsq22-1735600502755.jpg?quality=75&strip=all&1735582536&w=1200","video":"https://cdn.jwplayer.com/videos/bsrOq7is-RyIcpnTz.mp4","publish_date":"2024-12-31 00:03:58","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.381}]}