{"offset":0,"number":50,"available":7715,"news":[{"id":261230042,"title":"Ex-WaPo editor claims Jeff Bezos colluded with Trump to kill Harris endorsement: ‘Quid-pro-quo’","text":"A high ranking former editor at the Washington Post is claiming that the paper’s billionaire owner, Jeff Bezos, entered into a quid-pro-quo agreement with former President Donald Trump to kill the newspaper’s planned endorsement of Vice President Kamala Harris.\n\nLongtime Post editor-at-large Robert Kagan, who quit after the non-endorsement on Friday, told The Daily Beast that Trump met with executives at Blue Origin – the space company owned and operated by Bezos – after the Post’s announcement, suggesting Bezos entered a deal with the possible next president.\n\n“Trump waited to make sure that Bezos did what he said he was going to do, and then met with the Blue Origin people,” he reportedly said. \n\n“Which tells us that there was an actual deal made, meaning that Bezos communicated, or through his people, communicated directly with Trump, and they set up this quid pro quo.”\n\nDespite the timing of the alleged meeting, Kagan provided no proof of a quid-pro-quo.\n\nReps for Trump, Bezos and The Washington Post did not immediately return requests for comment.\n\nKagan, who has been a longtime critic of Trump, said the alleged collusion between Bezos and Trump had “been in the works for some time” and will lead to “a lot of censorship” in the media as billionaire fold to Trump’s demands to line their own pockets, the outlet reported. \n\nKagan abruptly resigned from his longtime position after CEO William Lewis announced the paper would not be endorsing a presidential candidate in 2024, nor in any future races – breaking 36 years of tradition at the paper. \n\nThe newspaper published an article on Friday written by two reporters saying that editorial page staffers had already drafted an endorsement for Harris over Trump, and were awaiting approval from Lewis and Bezos before it was killed. \n\nBezos, the second-richest person in the world with a net worth valued by Bloomberg Billionaires Index at $209 billion as of Friday, was a frequent target of Trump during his first term in office — mainly due to the Washington Post’s coverage of his administration.\n\nSome WaPo insiders also believe the billionaire Amazon founder, who has not spoken publicly about the 2024 election, does not want to alienate the Republican challenger as he gains momentum to recapture the White House next month. \n\n“This is what we have to look forward to,” Kagan said, according to The Daily Beast. \n\n“All Trump has to do is threaten the corporate chiefs who run these organizations with real financial loss, and they will bend the knee.”\n\nFriday’s decision follows the Los Angels Times, whose billionaire owner, Patrick Soon-Shiong, also declined to issue an endorsement, leading to a flood of resignations from its editorial board.\n\nThe decision by the Post also resulted into 2,000 cancelled subscriptions within 24 hours, which one staffer said was “an unusually high number,” Semafor reported. \n\nFurious high-profile staffers have also taken to social media blasting Friday’s announcement.\n\nAmid fierce backlash that Bezos was responsible for the controversial decision, Lewis, the outlets publisher, denied those claims in a statement, stressing that he himself pulled the plug on the endorsement due to his opposition of presidential endorsements. \n\n“He was not sent, did not read and did not opine on any draft. As Publisher, I do not believe in presidential endorsements. We are an independent newspaper and should support our readers’ ability to make up their own minds,” Lewis said in a statement, according to The Daily Beast.\n\nBut Kagan claimed this “is just the beginning” and that “all the facts” lead to Bezos attempting to transform the longtime paper into an “anti-anti-Trump editorial slant,” according to the outlet. \n\n“We now know what Bezos’ intention was, therefore we now know why he hired Will Lewis,” he said. \n\n“We were the ones who were naïve in thinking that there was anything else going on here.”\n\nBezos, who bought the Washington Post in 2013, hired Lewis in part for his ability to get along with powerful conservative political figures, sources told NPR.","summary":"A high ranking former editor at the Washington Post is claiming that the paper’s billionaire owner, Jeff Bezos, entered into a quid-pro-quo agreement with former President Donald Trump to kill the newspaper’s planned endorsement of Vice President Kamala Harris. Longtime Post editor-at-large Robert Kagan, who quit after the non-endorsement on Friday, told The Daily Beast that &#8230;\n\n\nThe post Ex-WaPo editor claims Jeff Bezos colluded with Trump to kill Harris endorsement: ‘Quid-pro-quo’ appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/ex-wapo-editor-claims-jeff-bezos-colluded-with-trump-to-kill-harris-endorsement-quid-pro-quo/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92461679.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-27 00:49:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.064},{"id":261229978,"title":"List of newspapers that have supported and opposed Trump and Harris","text":"(NewsNation) — The Washington Post announced Friday it will no longer endorse presidential candidates, abandoning a 30-year tradition amid reports that owner Jeff Bezos blocked a planned endorsement of Vice President Kamala Harris.\n\nThe decision comes as major newspapers increasingly step back from presidential endorsements, with the Los Angeles Times making a similar move this week.\n\nWashington Post publisher William Lewis said the decision marks a return to the paper’s earlier practice of not endorsing presidential candidates, describing it as “consistent with the values the Post has always stood for.”\n\nAccording to internal sources cited by the Post, the paper’s editorial board had prepared an endorsement of Harris over former President Donald Trump before the announcement. The reversal prompted criticism from Martin Baron, the Post’s former executive editor, who called it “cowardice, with democracy as its casualty.”\n\nThe LA Times’ decision triggered resignations from its editorial page editor and two editorial board members. Mariel Garza, the departing editorials editor, questioned how the paper could “spend eight years railing against Trump and the danger his leadership poses to the country and then fail to endorse the perfectly decent Democrat challenger.”\n\nThe shifts in both papers have highlighted the growing reluctance of news organizations to make presidential endorsements. The Minnesota Star Tribune also announced in August it would end the practice.\n\nMany newspapers are dropping endorsements as they struggle with declining readership and fear losing subscribers who disagree with their political positions. The trend comes as traditional media faces broader challenges, including evolving reader habits and the need to combat election misinformation.\n\nSome major outlets still endorse, with most backing Harris over Trump\n\nWhile some major publications are stepping back from endorsements, others are maintaining the tradition. The New York Times, Boston Globe, Seattle Times, Las Vegas Sun and The New Yorker have endorsed Harris, while Trump has received backing from the New York Post.\n\nThe Philadelphia Inquirer recently announced its support for Harris, coupling the endorsement with sharp criticism of Trump, whom they described as “a convicted criminal, insurrectionist, tax dodger, sexual harasser, serial liar and Russian sympathizer.”\n\nThe announcements come as Trump has renewed his attacks on the media, recently calling them “the enemy of the people” at an Arizona rally and threatening to revoke CBS’s broadcast license.\n\nThe Associated Press contributed to this report.","summary":"(NewsNation) — The Washington Post announced Friday it will no longer endorse&#8230;","url":"https://internewscast.com/news/us/list-of-newspapers-that-have-supported-and-opposed-trump-and-harris/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Which-newspapers-have-endorsed-and-not-endorsed-800x430.png","video":null,"publish_date":"2024-10-27 00:41:48","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.109},{"id":261229896,"title":"Ex-WaPo editor claims Jeff Bezos colluded with Trump to kill Harris endorsement: ‘Quid-pro-quo’","text":"A high ranking former editor at the Washington Post is claiming that the paper’s billionaire owner, Jeff Bezos, entered into a quid-pro-quo agreement with former President Donald Trump to kill the newspaper’s planned endorsement of Vice President Kamala Harris.\n\nLongtime Post editor-at-large Robert Kagan, who quit after the non-endorsement on Friday, told The Daily Beast that Trump met with executives at Blue Origin – the space company owned and operated by Bezos – after the Post’s announcement, suggesting Bezos entered a deal with the possible next president.\n\n“Trump waited to make sure that Bezos did what he said he was going to do, and then met with the Blue Origin people,” he reportedly said. \n\n“Which tells us that there was an actual deal made, meaning that Bezos communicated, or through his people, communicated directly with Trump, and they set up this quid pro quo.”\n\nDespite the timing of the alleged meeting, Kagan provided no proof of a quid-pro-quo.\n\nReps for Trump, Bezos and The Washington Post did not immediately return requests for comment.\n\nKagan, who has been a longtime critic of Trump, said the alleged collusion between Bezos and Trump had “been in the works for some time” and will lead to “a lot of censorship” in the media as billionaire fold to Trump’s demands to line their own pockets, the outlet reported. \n\nKagan abruptly resigned from his longtime position after CEO William Lewis announced the paper would not be endorsing a presidential candidate in 2024, nor in any future races – breaking 36 years of tradition at the paper. \n\nThe newspaper published an article on Friday written by two reporters saying that editorial page staffers had already drafted an endorsement for Harris over Trump, and were awaiting approval from Lewis and Bezos before it was killed. \n\nBezos, the second-richest person in the world with a net worth valued by Bloomberg Billionaires Index at $209 billion as of Friday, was a frequent target of Trump during his first term in office — mainly due to the Washington Post’s coverage of his administration.\n\nSome WaPo insiders also believe the billionaire Amazon founder, who has not spoken publicly about the 2024 election, does not want to alienate the Republican challenger as he gains momentum to recapture the White House next month. \n\n“This is what we have to look forward to,” Kagan said, according to The Daily Beast. \n\n“All Trump has to do is threaten the corporate chiefs who run these organizations with real financial loss, and they will bend the knee.”\n\nFriday’s decision follows the Los Angels Times, whose billionaire owner, Patrick Soon-Shiong, also declined to issue an endorsement, leading to a flood of resignations from its editorial board.\n\nThe decision by the Post also resulted into 2,000 cancelled subscriptions within 24 hours, which one staffer said was “an unusually high number,” Semafor reported. \n\nFurious high-profile staffers have also taken to social media blasting Friday’s announcement.\n\nAmid fierce backlash that Bezos was responsible for the controversial decision, Lewis, the outlets publisher, denied those claims in a statement, stressing that he himself pulled the plug on the endorsement due to his opposition of presidential endorsements. \n\n“He was not sent, did not read and did not opine on any draft. As Publisher, I do not believe in presidential endorsements. We are an independent newspaper and should support our readers’ ability to make up their own minds,” Lewis said in a statement, according to The Daily Beast.\n\nBut Kagan claimed this “is just the beginning” and that “all the facts” lead to Bezos attempting to transform the longtime paper into an “anti-anti-Trump editorial slant,” according to the outlet. \n\n“We now know what Bezos’ intention was, therefore we now know why he hired Will Lewis,” he said. \n\n“We were the ones who were naïve in thinking that there was anything else going on here.”\n\nBezos, who bought the Washington Post in 2013, hired Lewis in part for his ability to get along with powerful conservative political figures, sources told NPR.","summary":"\"They set up this quid pro quo.\"","url":"https://nypost.com/2024/10/26/us-news/ex-wapo-editor-claims-bezos-colluded-with-trump-to-kill-harris-endorsement/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92461679.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-27 00:40:15","author":"Anna Young","authors":["Anna Young"],"language":"en","source_country":"us","sentiment":-0.064},{"id":261228992,"title":"Michelle Obama criticizes men and labels Trump as senile in a strongly worded response to Kamala Harris’ critics","text":"Former First Lady Michelle Obama hit the campaign trail for Kamala Harris for the first time on Saturday where she called for a ‘grown up in the White House’ and blasted Donald Trump for lies, childish antics and moral decline before making an emotional appeal directly to men.\n\nHer appearance in Kalamazoo. Michigan comes as polls show the presidential race in a dead heat with just ten days to go before the election.\n\nThe former first lady questioned why Harris is being held to a higher standard and must prove she belongs.\n\n‘But for Trump we expect nothing at all, no understanding of policy, no ability to put together a coherent argument, no honesty, no decency, no morals.’\n\nShe said too many people are willing to write off his ‘childish, mean-spirited antics.’\n\nObama accused ex-president for ‘gross incompetence’ while people ask Harris to ‘dazzle’ at every turn.\n\nShe also highlighted what she called Trump’s obvious mental decline, slammed him being a convicted felon and noted he was found liable of sexual assault.\n\nObama said Harris ‘dominated her opponent so thoroughly in the debate he was too scared to face again.’\n\n‘Why on earth is this race even close?’ the former first lady asked as the crowd went wild.\n\nObama said she lays awake at night wonder ‘what in the world is going on? She said Harris has demonstrated she’s ready but asked: ‘as a country, are we ready for this moment?’\n\nThe former first lady said she fears for the country and its children if people forget the stakes in the election. \n\nShe said if Trump becomes president, at some point ugliness will touch everyone’s lives.\n\nObama said she was out campaigning in Michigan because of that fear reminding the crowd she was doing so even though ‘you all know I hate politics.’\n\nHer remark received some laughs as people once called for the former first lady herself to run for president should President Biden end his bid. She previously ruled it out. \n\nHalfway through her speech, the former first lady took an extremely somber note when she pleaded for men not to leave women’s lives in the hands of politicians when it comes to reproductive health care with the overturning of Roe v Wade.\n\nObama went through graphic details of the dangers of being pregnant and childbirth as well as other health challenges women face. She explained the threats of infection and women potentially bleeding out. \n\nShe warned of the chilling effects dismantling the reproductive health care system with the overturning of Roe have had, not just on abortion care but on the entire women’s health care system.\n\nObama also painted a specific picture of how the threats to women’s health will impact the men who love them.\n\n‘I am asking ya’ll from the core of my being to take our lives seriously please,’ she said. ‘Do not put our hands in the lives of politicians, mostly men who have no clue or do not care about we as women are going through.’\n\nShe said ‘please do not hand our fates over to the likes of Trump who knows nothing about us, who has shown deep contempt for us because a vote for him is a vote against us, against our health, against our worth.’\n\nShe told men before casting their votes to ask themselves what side of history do they want to be on and urged those fed up not to sit out the election because women will become collateral damage.\n\nObama also beseeched women to demand the men in their lives do better by them and remember ‘we are more than just baby-making vessels.’\n\nShe said if they are in a household where a man does not value them or their opinion ‘just remember that your vote is a private matter.’\n\nAs the former first lady spoke, she received thunderous applause at times from the energized crowd while attendees passionately nodded along during her deeply emotional appeal. \n\nAt one moment the former first lady even appeared to wipe away a tear. \n\nObama wrapped up her speech by welcoming Harris to the stage where they shared a moment hugging as the arena shook with applause. \n\nTaking the stage, the vice president joked about campaigning in ‘Kamala-zoo.’ \n\nDuring her speech, Harris spoke of being a prosecutor and attorney general and taking on predators and fraudsters and winning. \n\n‘Well in ten days, it’s Donald Trump’s turn,’ she said. It received one of the biggest cheers from the crowd. \n\nEarly in-person voting in Michigan kicked off on Saturday. But more than 1.4 million Michiganders had already voted early by mail in the swing state.\n\nThe latest Quinnipiac poll shows Harris with a four-point lead in Michigan among likely voters including a whopping twenty-point lead among women. But the average of polls shows Trump with a less than half a point lead in the state.\n\nVoters showing up to cast ballots in Kalamazoo on Saturday faced more than an hour wait times to vote. Some decided to try voting another time upon finding out how long they would have to stand in line.\n\nKalamazoo County is a blue county which Biden won in 2020 with more than 58 percent of the vote.\n\nBut Harris will still need to run up the vote in blue areas in order to win the state which went to Trump in 2016 before swinging back to blue in 2020.\n\nJessica Hayback of Kalamazoo showed up at 9:30 am to wait in line. She said she came out because she has hope.\n\n‘I’ve loved Michelle Obama. I’m a big Harris supporter,’ she said. ‘It’s sort of an iconic moment.’\n\nShe is supporting the vice president because she wants an ‘ethical candidate that can represent us with some decency and bring some sanity back to American politics.’\n\nHayback also mentioned abortion rights and Harris’ economic policy ideas.\n\nRuby Hodge, 74, said she came out for the rally to be part of a movement she believes will be beneficial for her grandchildren and young people. She said she is hopeful in Michigan.\n\n‘The issues she espouses, they speak to me. I believe in her sincerity, her honesty. When I listen to her, I cry, I really do,’ Hodge said of the vice president.\n\n‘She is taking it upon herself. She is saying “here I am. I will do this.” And I think she can – I know she can,’ she said.\n\nThis is the former first lady’s first appearance on the campaign trail with Harris, but her speech at the Democratic National Convention was a smashing hit over the summer when she delivered a brutal takedown of Trump while praising the vice president.\n\nIt was widely considered one of if not the best addresses in Chicago.\n\n‘Kamala Harris is more than ready for this moment,’ Obama said. ‘She is one of the most qualified people ever to seek the office of the presidency.’\n\nObama also turned her wrath on Trump with one of the most blistering responses to the ex-president.\n\n‘For years, Donald Trump did everything in his power to try to make people fear us,’ Obama said. ‘His limited and narrow view of the world made him feel threatened by the existence of two hardworking, highly educated, successful people who also happened to be Black.’\n\nShe called Trump a con, misogynistic and racist. One of her zingers about the ex-president went viral.\n\n‘Who’s going to tell him that the job he’s currently seeking might just be one of those “Black jobs”?’\n\nHer husband former President Obama has been hitting the campaign trail for Harris across battleground states. He held his first rally with the vice president on Thursday in Atlanta.\n\nThe former first couple endorsed Harris for president just days after President Biden exited the race with a video featuring a call they had with the vice president.\n\nBefore the rally in Kalamazoo, Harris made a stop at a local doctor’s office in Portage to meet with reproductive health care providers and medical students.\n\nOn Friday, she made a major speech on reproductive freedom with an introduction from Beyonce as abortion rights remains a motivating issue for Democrats since the overturning of Roe v Wade.\n\nAt the rally on Saturday, a series of other Michigan Democratic leaders also took the stage in Kalamazoo.\n\nSenator Gary Peters delivered a speech where he read off quotes from former Trump administration officials criticizing the Democratic presidential nominee.\n\nHe also touted the recent endorsement of Harris by former longtime Republican Michigan Congressman Fred Upton.\n\nThe support from the GOP Michigander comes as Harris has been courting moderate Republicans and Independents on the campaign trail.","summary":"Former First Lady Michelle Obama hit the campaign trail for Kamala Harris&#8230;","url":"https://internewscast.com/news/michelle-obama-criticizes-men-and-labels-trump-as-senile-in-a-strongly-worded-response-to-kamala-harris-critics/","image":"https://internewscast.com/wp-content/uploads/2024/10/1729987801_rewrite-this-title-Michelle-Obama-rips-into-men-and-calls-800x430.jpg","video":null,"publish_date":"2024-10-27 00:11:28","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013},{"id":261228590,"title":"2024 Election: Delta Sigma Theta Chapter in Chicago urges community to vote with ‘Stroll to the Polls’ event","text":"CHICAGO (WLS) — A sorority is encouraging community members in Chicago to vote early.\n\nThe Chicago Metropolitan Alumnae Chapter of Delta Sigma Theta hosted two events Saturday.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nIt was a warm welcome for those who turned out.\n\n“I was so excited to see so many people out to come and vote,” early voter Iane Jennings said. “The excitement, the energy is here.”\n\nThe effort to boost voter engagement in the community was hosted by the Chicago Metropolitan Alumnae Chapter, or CMAC, of Delta Sigma Theta Sorority Incorporated.\n\n“In the Midwest region, we have over 1,000 chapters, and we’re all getting together today to get out the vote,” CMAC President Tasha Levy said. “We’re doing voter education. It’s all about civic engagement… in all generations.”\n\nThe initiative is a part of the sorority’s annual Midwest Impact Day of Service and was supported by several of the Divine 9, the nine historically African-American sororities and fraternities that make up the National Pan-Hellenic Council.\n\n“Beyond that, really encouraging people to be educated about their voting and what’s at stake in terms of this election,” said Tracy Hughes Perkins with Zeta Phi Beta Sorority Inc. Tau Psi Zeta Chapter.\n\nVOTER GUIDE | ABC7 Chicago Your Voice Your Vote 2024 Voter Guide\n\nDarrick Madgett, 19, voted for the first time Saturday.\n\n“I don’t want to say issues, but everyone should have to right to vote, Madgett said.\n\nWhile the Black Greek organizations are non-partisan, they are behind the continued effort to get the vote out. An event on the South Side was just one of two early voting events the organization sponsored, along with one on the West Side.\n\nMany braved long lines to cast their ballot at the early voting site at Olive Harvey College, a city college on the Far South Side.\n\n“I want to make sure my vote counts,” early voter John Williams said. “My grandparents weren’t able to vote, so I want to make sure I vote, and my kids and grandkids vote.”\n\nThe election for president between former President Donald Trump and Vice President Kamala Harris is less than two weeks away. The first African-American sorority, the AKAs, or which Harris is a soror, says mobilization is key.\n\n“We look forward to doing not just for our sorors, but for all of the women in this organization and men in the D9,” said Kimberly Collier, Alpha Kappa Alpha Sorority Inc. Theta Omega Chapter Vice President.\n\nSome at the event Saturday expressed it’s important for Black people to vote.\n\n“We are in unprecedented times right now,” said Vaughn Roland, Omega Psi Phi Rho Mu Mu Chapter voter education committee chair. “You are seeing voter suppression all across the country.”\n\nAdvocacy organization the National Coalition of 100 Black Women Chicago Metropolitan Chapter provided outreach too, as a unified message remains.\n\n“110%, you should get out and vote,” early voter Shearrisa Phillips-Hatcher said.","summary":"CHICAGO (WLS) &#8212; A sorority is encouraging community members in Chicago to&#8230;","url":"https://internewscast.com/news/us/2024-election-delta-sigma-theta-chapter-in-chicago-urges-community-to-vote-with-stroll-to-the-polls-event/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-2024-election-Chicago-Metropolitan-Alumnae-Chapter-of-800x430.jpg","video":null,"publish_date":"2024-10-26 23:59:47","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.26},{"id":261228460,"title":"Supporters of Kamala Harris aim to maintain the unity in the group backing Joe Biden","text":"As President Joe Biden fought to remain in the presidential race this summer, advisers often argued there existed a “Biden coalition” — a cohort only the incumbent could hold together. With Vice President Kamala Harris atop the Democratic ticket, there has been a shift in the focus on these voters, like white working-class voters in places like Pennsylvania, seniors and union members.\n\nA pro-Harris super PAC has been running a series of ads — in heavy rotation during the Major League Baseball playoffs — featuring testimonials from working-class voters, as well as voters who say they previously backed former President Donald Trump, that echo Biden’s message. A coalition of labor groups targeting union members in battleground states is pointing to Biden’s term in office. Sen. Bernie Sanders, I-Vt., has trained his sights on keeping voters who backed Trump in 2016 and Biden in 2020 in the Democratic camp with a populist, progressive pitch that leans on Biden’s accomplishments.\n\nAnd Minnesota Gov. Tim Walz, Harris’ running mate, has had a campaign itinerary that closely mirrors what Biden’s had been in this and previous election cycles. On Friday in Scranton, Pennsylvania — Biden’s hometown — Walz made the case for a new Democratic candidate by highlighting their shared values.\n\n“That patriotism, that fierce patriotism, putting the American people first, is exactly what guides Kamala Harris in the course of her entire career,” Walz said at the same venue where Biden gave an economic address in April.\n\nBiden advisers insist that the president continues to reach key constituencies, albeit in a more under-the-radar fashion. On Friday, he held an official event on tribal land in Arizona, talking to a group of voters who helped tip that state for him four years ago.\n\nAsked who is making the pitch to Biden voters if not Biden, Sen. Chris Coons, D-Del., answered: “Kamala Harris.” The Harris campaign points to events like a recent stop at a union hall in Lansing, Michigan, where she highlighted the administration’s record on manufacturing and the critical role of organized labor in supporting the middle class.\n\nCoons noted the vice president has campaigned in Pennsylvania’s biggest cities, but also in places like Wilkes-Barre, Johnstown and Erie to reach the kinds of voters Biden has long considered his base. The longtime Biden friend said that during his own recent stop in Scranton, he got multiple questions from Democratic supporters about the president, which he in turn used to make a different pitch for getting out the vote for Harris.\n\n“Folks, this is simple. If we lose, it will kill him. Literally,” Coons recalled saying. “If we win, nothing will make him happier.”\n\nHarris has faced a tough balancing act, demonstrating loyalty while also establishing independence from Biden, who continues to suffer in public opinion polls. She has repeatedly said in the closing weeks that her presidency would not be an extension of his. So the president’s allies say their efforts are critical in ensuring that Biden stalwarts are still hearing about the president’s economic accomplishments.\n\nAnd for some voters whom Biden won in 2020, the message has shifted away from being about him.\n\n“The paradox of this moment is that this administration … will go down as one of the most effective and transformative administrations in history,” said Randi Weingarten, president of the American Federation of Teachers. “But there is a difference between what will be seen through a historical lens and what is being seen right now.”\n\nWeingarten, noting that Biden tapped Harris to chair his White House Task Force on Worker Organizing and Empowerment, said her union and others are focused on member-to-member messaging where they act as validators for the vice president to voters who aren’t as familiar with her or who might hear countermessaging from Trump supporters.\n\n“We know her and we’ve worked with her for the last three and a half years, and we’ve become surrogates for her in terms of who she is and what she’s about,” Weingarten said before an event in Scranton that’s part of her union’s nationwide bus tour. “We’ve become in some ways the people who can say, ‘She is us and she fights for us.’”\n\nA series of ads from Future Forward PAC — a group formed to back Biden’s re-election that has pivoted to working to elect Harris — is running ads arguing for tax fairness, a position Biden had put front and center. The ads show a clip of Trump telling campaign donors that they’re “rich as hell” and would get tax cuts if he’s elected.\n\nIn New Hampshire this week, Biden was joined by Sanders to warn what a Republican administration and Congress would mean for another signature administration accomplishment: allowing Medicare to negotiate lower prescription drug prices.\n\nSanders praised Biden and Harris “for having the courage to be the first administration in the history of this country to stand up to the greed of the pharmaceutical industry.” It was one of two dozen events across the country Sanders has attended since September that were meant to highlight a progressive agenda that’s been partly realized under Biden, including stops at coordinated campaign offices in Nevada with members of the Culinary Workers Union, and with United Auto Workers President Shawn Fain in Michigan.\n\nThis weekend, Biden will travel to Pittsburgh to meet with members and leadership from LIUNA, which represents 70,000 workers in the construction and energy industry. The union has held rallies and other organizing events there and in Michigan, Wisconsin and Nevada targeting its own and other union members.\n\nBehind closed doors this week, Biden has had separate meetings with union leaders in Pennsylvania and Wisconsin to discuss efforts to encourage their members to support Harris. He recorded a video and robocall for the Senate candidate in his home state of Delaware, Rep. Lisa Blunt Rochester.\n\n“Biden is achieving more historic results for American families and he maximizes every day in office and traveling the country spotlighting life-changing benefits and Vice President Harris’s role in delivering them,” White House spokesperson Andrew Bates said.","summary":"As President Joe Biden fought to remain in the presidential race this&#8230;","url":"https://internewscast.com/news/us/supporters-of-kamala-harris-aim-to-maintain-the-unity-in-the-group-backing-joe-biden/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Kamala-Harris-allies-seek-to-keep-the-800x430.jpg","video":null,"publish_date":"2024-10-26 23:53:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.02},{"id":261228546,"title":"Fact-checking Trump’s appearance on Joe Rogan’s podcast","text":"By Nicholas Riccardi | Associated Press\n\nIn his three-hour interview with podcaster Joe Rogan, Donald Trump dug in on his false claims about voting, election fraud and his loss in the 2020 presidential election. Rogan helped encourage some of these claims.\n\nThe interview, released late Friday, came on the same day that the former president, on his social media network, re-posted threats to prosecute lawyers, voters and election officials he deems to have “cheated” in the 2024 election.\n\nHere’s a look at some of the claims by the Republican nominee for president and the truth.\n\nTrump did lose the 2020 election\n\nWHAT TRUMP SAID: “I won by like — they say I lost by like — I didn’t lose.”\n\nTHE FACTS: Trump did lose in 2020 to Democrat Joe Biden. Trump’s claims that fraud cost him the race were investigated repeatedly.\n\nTrump’s own attorney general said there were no signs of significant fraud. The Republican-run state Senate in Michigan, one of the swing states where Trump claimed fraud occurred, came to the same conclusion after a lengthy investigation. An investigation by the nonpartisan Legislative Audit Bureau in Wisconsin, ordered by the state’s GOP-controlled Legislature in another state Trump claimed to have been defrauded from winning, also found no substantial fraud.\n\nRogan chortled when Trump was arguing, correctly, that his loss was close. Trump lost the election narrowly in six swing states. If about 81,000 votes had flipped, Trump could have won Arizona, Georgia, Nevada and Wisconsin and gotten enough support in the Electoral College to remain president.\n\nTrump misstated that margin as 22,000 votes.\n\nJudges ruled against Trump on the merits repeatedly\n\nWHAT TRUMP SAID: “What happened is judges don’t want to touch it. They would say, ‘you don’t have standing.’ They didn’t rule on the merits.”\n\nTHE FACTS: That’s not true. Trump and his supporters lost more than 50 lawsuits trying to overturn the election.\n\nA group of Republican-affiliated election lawyers and legal scholars reviewed all 64 of the Trump lawsuits challenging the 2020 election and found only 20 of them were dismissed by judges before a hearing on the merits. In 30 cases, the rulings against Trump came after hearings on the merits.\n\nIn the remaining 14 cases, the report for Stanford University’s Hoover Institution found, Trump and his allies dropped their lawsuits before they even got to the merits phase. “In many cases, after making extravagant claims of wrongdoing, Trump’s legal representatives showed up in court or state proceedings empty-handed, and then returned to their rallies and media campaigns to repeat the same unsupported claims,” the report states.\n\nAlmost every state already uses paper ballots\n\nWHAT TRUMP SAID: “We should go to paper ballots.”\n\nTHE FACTS: Trump and Rogan both argued that voting machines are unreliable and that the United States should rely on paper ballots. Trump even cited his billionaire tech mogul supporter Elon Musk’s enthusiasm for such a change.\n\nAlmost all of the country already made that switch, however.\n\nIn 2020, more than 90% of the election jurisdictions in the U.S. used paper ballots, according to the Brennan Center for Justice. The next year, the federal Election Assistance Commission changed its guidelines to recommend every jurisdiction use paper.\n\nThe only state not to use a voting system with paper ballots or a paper trail of any sort is Republican-run Louisiana.\n\nRepublicans and Democrats encouraged mail voting during the pandemic\n\nWHAT TRUMP SAID: “They used COVID to cheat.”\n\nTHE FACTS: Trump’s central argument is that a grand Democratic conspiracy changed voting procedures during the coronavirus pandemic to make mail voting more popular and that the conspirators then rigged the election against him through those mail votes. That’s not what happened.\n\nIn doing so, Trump was returning to his usual playbook, claiming that any election he doesn’t win is fraudulent. He made that claim about the first contest he lost, Iowa’s 2016 Republican caucus. He even claimed he lost the popular vote in 2016 because of voting by illegal immigrants, though a presidential commission he empaneled to find evidence of it disbanded without finding any proof.\n\nThe 2020 election was free of significant fraud\n\nTHE FACTS: Isolated cases of voters fraud have long occurred, but in modern times have not reached the levels needed to sway a national election. An Associated Press review found fewer than 475 cases in all six battleground states that Trump lost by more than a combined 300,000 votes — far too little to change the outcome.","summary":"The interview, released late Friday, came on the same day that the former president, on his social media network, re-posted threats to prosecute lawyers, voters and election officials he deems to have \"cheated\" in the 2024 election.","url":"https://www.mercurynews.com/2024/10/26/fact-checking-trumps-appearance-on-joe-rogans-podcast/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/sjm-RUMP-ROGAN-1-GET_209307236.jpg?w=1024","video":null,"publish_date":"2024-10-26 23:52:46","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.449},{"id":261229832,"title":"Michelle Obama Appeals to Men on Trump Policies: ‘We Are More Than Just Baby-Making Vessels’","text":"Former First Lady Michelle Obama joined Democratic presidential nominee and Vice President Kamala Harris on Saturday afternoon in Kalamazoo, Michigan for a get-out-the-vote rally and delivered an impassioned speech to appeal to men who may not feel immediately impacted by GOP presidential nominee Donald Trump’s anti-women policies as well as those who may be sitting on the sidelines to get to the polls.\n\n Obama shared that since the eradication of Roe v. Wade and Trump’s promotion of state restrictions, which has already led to catastrophic results, that it will likely only become worse for all.\n\n She brought up Trump’s “deep contempt” for women, explaining that “a vote for him is a vote against us, against our health, against our worth.” Addressing men directly, she asked: “So fellows, before you cast your votes, ask yourselves, what side of history do you want to be on?”\n\n Obama acknowledged the frustration at “the slow pace of change” many must feel. “We all know we have a lot more work to do in this country,” she said. “But to anyone out there thinking about sitting out this election or voting for Donald Trump or a third party candidate in protest because you’re fed up: Let me warn you, your rage does not exist in a vacuum. If we don’t get this election right — your wife, your daughter, your mother, we as women will become collateral damage to your rage.”\n\n Then, she addressed men directly: “So are you, as men, prepared to look into the eyes of the women and children you love and tell them that you supported this assault on our safety?” she said. “And to the women listening, we have every right to demand that the men in our lives, do better by us. We have to use our voices to make these choices clear to the men that we love: Our lives are worth more than their anger and disappointment, and we are more than just baby-making vessels.”\n\n Harris followed, and also addressed women’s suffering when it comes to the loss of reproductive rights.\n\n “Donald Trump still refuses to even acknowledge the pain and suffering he has caused. He insists that, and I’m going to quote, ‘Everybody wanted Roe v. Wade to be overturned.’ Come on, everybody wanted this?’ Women are being denied care during miscarriages, some only being treated once they develop sepsis,” Harris said. “They didn’t want this. Couples just trying to grow their family who have been cut off from IVF treatments — they didn’t want this.\n\n “The men of America seeing their daughters, wives, sisters, and mothers put at risk because their rights have been stripped away. The men of America don’t want this,” she continued. “Women have died because of these bans. How could anybody say that they wanted this? And you have heard me say, I do believe Donald Trump to be an unserious man, but the consequences of him ever being president again are brutally serious.”\n\n Their visit comes on the same day early in-person voting begins statewide in Michigan. Absentee voting has been underway in Michigan for weeks, with around 1.4 million ballots already returned as of Friday morning, according to the Michigan Secretary of State’s Office. Trump also appeared in Michigan for a rally in Detroit suburb Novi on Saturday, where he ripped on Detroit again.\n\n Trump and Harris are running neck and neck nationally along with in the battleground state of Michigan. In 538 Project and ABC News latest polls averages, Harris is at 47.6 percent with Trump at 47.2 percent in the swing state as of Saturday morning. The final The New York Times/Siena Poll published on Friday, shows Harris and Trump deadlocked with 48 percent each for the popular vote nationally.","summary":"“If we don't get this election right, your wife, your daughter, your mother, we as women will become collateral damage to your rage,” former first lady says","url":"https://www.rollingstone.com/politics/politics-news/michelle-obama-kamala-harris-rally-trump-reproductive-rights-michigan-1235144076/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/KamalaHarrisMichelleObama-1.jpg","video":null,"publish_date":"2024-10-26 23:52:05","author":"Althea Legaspi","authors":["Althea Legaspi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.185},{"id":261230770,"title":"Michelle Obama blasts Trump for ‘gross incompetence’ at Harris’s Michigan rally","text":"Michelle Obama laced into Donald Trump in an unsparing speech in Michigan on Saturday, accusing the former president of “gross incompetence” and “amoral character” while challenging Americans to choose Kamala Harris for US president.\n\n“By every measure, she has demonstrated that she’s ready. The real question is, as a country, are we ready for this moment?” the former first lady told a rapt audience in Kalamazoo.\n\nWith the race virtually deadlocked, Obama said she was in battleground Michigan heeding her own advice to “do something”. In raw and strikingly personal terms, she asked why Harris was being held to a “higher standard” than her opponent. His handling of the Covid-19 pandemic and his efforts to cling to power after losing the 2020 election should be disqualifying, Obama argued, adding that Trump’s own former advisers and cabinet secretaries had stepped forward to warn against returning him to power.\n\n“I hope you’ll forgive me if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence while asking Kamala to dazzle us at every turn,” Obama said. “Preach!” a woman shouted.\n\nThe event in Kalamazoo, which Obama referred to as “Kamala-zoo”, was her first appearance on the campaign trail since her blockbuster speech at the Democratic national convention in August. Obama said voters shouldn’t choose Harris because she’s a woman but “because Kamala Harris is a grown-up – and Lord knows we need a grown-up in the White House”.\n\nWhen Obama finished, Beyoncé’s Freedom blared and Harris emerged to thunderous applause. The two women hugged and walked together across the stage. When Harris spoke, she promised to be a president who listened to the American people, unlike her opponent, whom she accused of “looking in the mirror all the time”.\n\n“Just imagine the Oval Office in three months,” she said. “It is either Donald Trump in there stewing over his enemies’ list – or me working for you, checking off my to-do list.”\n\nBefore the event, Harris visited a local doctor’s office in nearby Portage, where she spoke to healthcare providers and medical students about the impact of abortion restrictions. Harris has made protecting what remains of abortion access a major theme of her closing argument to voters, using it to draw a sharp contrast with Trump, who has claimed credit for his role in overturning Roe v Wade but insisted he would allow a nationwide ban as president.\n\n Don’t miss important US election coverage. Get our free app and sign up for election alerts\n\nIn Kalamazoo, both Harris and Obama argued that Trump had no credibility on the matter. But Obama went further, describing the full spectrum of women’s reproductive health – from period cramps to pregnancy to menopause. She lamented the lack of research on women’s health and the racial disparities in treatment. Directing her comments to the “men who love us”, Obama asked them to consider the harm that is done when a government “keeps revoking the basic care from its women”.\n\n“I am asking y’all, from the core of my being, to take our lives seriously,” she said, her voice swelling with emotion. “If we don’t get this election right, your wife, your daughter, your mother, we as women will become collateral damage to your rage.”\n\nAbortion bans, she argued, affected men as well. If something happened during a pregnancy or a delivery and the doctor was prevented from providing care, “you will be the one praying that it’s not too late. You will be the one pleading for somebody, anybody, to do something, and then there is the tragic but very real possibility that in the worst-case scenario, you just might be the one holding flowers at the funeral,” she said.\n\nObama seemed to be speaking of the gaping gender divide that has emerged in this race, with women powering Harris and men turning to Trump. She acknowledged the country had a long way to go, and that change was too slow, but she said sitting out or voting third-party would not move the country forward.\n\nWhile Barack Obama is known as his party’s great orator, Michelle Obama remains one of its most popular albeit reluctant speakers. Having once encouraged Democrats to “go high” when they “go low”, Obama on Saturday made no effort to conceal her disdain for the man who led a years-long campaign questioning her husband’s birthplace.\n\n“In any other profession or arena, Trump’s criminal track record and amoral character would be embarrassing, shameful and disqualifying,” she said.\n\nThe Harris campaign deployed Obama – along with Barack Obama and other leading figures and celebrities – in hopes their star power might add an 11th-hour jolt to a presidential race that has been otherwise static.\n\nHarris and Trump were both in Michigan on Saturday, chasing the state’s 15 electoral votes. After Pennsylvania, where Harris will campaign on Sunday, Michigan is perhaps the next most critical state on the Democrat’s path to the White House.\n\nTrump won the state in 2016, when he tore down the trio of “blue wall” states. But four years later, Michigan delivered Biden his biggest swing state victory and Democrats swept the state in the 2022 congressional midterms, after the supreme court ruling overturning Roe v Wade.\n\nPolls show a dead heat. Trump has sought to exacerbate Democratic divisions over the Biden administration’s handling of Israel’s war in Gaza and Lebanon, elevating the issue in Michigan, where scores of Muslim and Arab American voters have said they cannot support Harris. On Saturday, Trump was joined on stage in Novi, Michigan, by Bill Bazzi, the current and first Muslim mayor of Dearborn Heights.\n\n“I have never seen the devastation that we’re seeing right now,” Bazzi said. “When President Trump was president, there was no wars.”\n\nThe Harris campaign has conducted several outreach attempts to the Arab community, but tensions remain high with little time for a course change and the risk of escalation following Israel’s pre-dawn strikes on Iran. At the event, Harris was interrupted by a pro-Palestinian protester. “We have to end that war,” she responded, as the crowd drowned out the demonstration with “Kamala” chants.\n\nDemocrats are focused on juicing turnout in Detroit – which Trump insulted (again) at his Novi event on Saturday – while aggressively courting women, independents and anti-Trump Republicans in the suburbs. Her campaign recently earned the support of Fred Upton, the state’s long-serving Republican representative who left office in 2022. Upton told the Detroit Free Press that he had never supported a Democrat for president but this year cast an absentee ballot for Harris: “He’s just totally unhinged. We don’t need this chaos.”\n\nSpeaking before Harris, Michigan senator Gary Peters compared the presidential campaign to the highest-stakes job interview. Extending the metaphor, he suggested that they check Trump’s references. The senator quoted Trump’s former chief of staff John Kelly, who recently said on the record that his former boss fit the definition of a fascist.\n\n“Would you hire that guy?” Peters asked. “No!” the crowd thundered back.","summary":"At Kalamazoo event, former first lady and vice-president argue Trump has no credibility on women’s issues\n\nMichelle Obama laced into Donald Trump in an unsparing speech in Michigan on Saturday, accusing the former president of “gross incompetence” and “amoral character” while challenging Americans to choose Kamala Harris for US president.\n\n“By every measure, she has demonstrated that she’s ready. The real question is, as a country, are we ready for this moment?” the former first lady told a rapt audience in Kalamazoo.\n\nDon’t miss important US election coverage. Get our free app and sign up for election alerts\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2024/oct/26/michelle-obama-kamala-harris-michigan-rally","image":"https://i.guim.co.uk/img/media/38d1f9d071f5f14b1a3699dadc5741257be9eff7/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2024-10-26 23:45:05","author":"Lauren Gambino","authors":["Lauren Gambino"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":261228964,"title":"Michelle Obama says she's a 'little angry' at the hesitation to vote for Harris","text":"KALAMAZOO, Mich. — Michelle Obama stood before a few thousand people packed into a high school gym on the first day of early voting in Michigan and confessed she was frustrated — and a “little angry” — at some of the things she’s heard about why people are holding back on support for Vice President Harris.\n\nSpeaking directly to the stark gender divide that polls show is a feature of this presidential campaign, Obama railed against “the lie that we do not know who Kamala is or what she stands for,” saying too many voters are shrugging off former President Donald Trump’s character and his track record on a wide range of issues.\n\nTrump was also campaigning in Michigan this weekend, making a stop in Traverse City late Friday night, and a second in the Detroit suburbs on Saturday.\n\nPolls show the race is extremely tight in swing states like Michigan, and Democrats — including former President Barack Obama — have been urgently working to shore up enthusiasm for Harris among Black men, young voters, and other parts of the Democratic base.\n\n“I hope you'll forgive me if I'm a little frustrated that some of us are choosing to ignore Donald Trump's gross incompetence while asking Kamala to dazzle us at every turn,” the former first lady said in her first appearance on the campaign trail with Harris.\n\n“I hope that you will forgive me if I'm a little angry that we are indifferent to his erratic behavior, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse — all of this while we pick apart Kamala’s answers from interviews that he doesn't even have the courage to do, y’all,” she said.\n\nObama described Harris as a “grown up” with a clear set of policies, and said she fears “too many people are willing to write off Trump’s childish, mean spirited antics by saying, ‘Well, Trump's just being Trump,’ rather than question his horrible behavior. Some folks think he's funny.”\n\n“That's exactly how he got elected the first time — folks gave him a pass and rolled the dice betting that he couldn't possibly be that bad,” she said.\n\nHarris and Obama focused on women's health care\n\nHarris focused much of her remarks on Saturday on abortion restrictions. She had made a stop at a local doctor’s office in Kalamazoo before the rally and talked to providers and medical students about concerns Trump would expand abortion restrictions nationally, should he win.\n\nDoctors were also featured in her Friday night rally in Houston, making the case that they were unable to provide adequate care for women because of new abortion restrictions.\n\n“Remember how we got here,” Harris told the Saturday rally. “Donald Trump hand-selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe v. Wade. They did as he intended,” she said.\n\nObama pointedly named a long list of women’s everyday reproductive health issues – cramps, nausea, hot flashes, lumps, and pap smears – and said a second Trump presidency could have a “chilling effect” on doctors being willing to specialize in women’s health care because of abortion restrictions.\n\nShe spoke specifically to men in her remarks, emphasizing that further restrictions on abortion and other aspects of women’s health care would impact them and their sons, too.\n\n“I am asking y'all from the core of my being to take our lives seriously — please,” Obama said. “Do not put our lives in the hands of politicians — mostly men — who have no clue or do not care about what we, as women, are going through.”","summary":"Polls show some Democrats aren't excited to vote for Vice President Harris. On Saturday, Michelle Obama railed against “the lie that we do not know who Kamala is or what she stands for.\"","url":"https://www.npr.org/2024/10/26/nx-s1-5166173/michelle-obama-kamala-harris-donald-trump-abortion","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3840x2160+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6c%2F26%2F7292e78d43f68bb019967eff28d6%2Fgettyimages-2180508866.jpg","video":null,"publish_date":"2024-10-26 23:44:05","author":"Deepa Shivaram","authors":["Deepa Shivaram"],"language":"en","source_country":"us","sentiment":-0.338},{"id":261228860,"title":"Biden says Elon Musk was an 'illegal worker' when he began U.S. career","text":"President Joe Biden called out Tesla and SpaceX CEO Elon Musk, now a Republican megadonor and Trump campaign surrogate, for hypocrisy on immigration on Saturday, saying Musk launched his long career in the U.S. as an \"illegal worker\" before becoming the world's wealthiest man.\n\nThe president made these remarks at a campaign event to support Democrats that took place in Pittsburgh, Pennsylvania, on Saturday.\n\nLabeling Musk as former President Donald Trump's wealthy new \"ally,\" Biden said, \"That wealthiest man in the world turned out to be an illegal worker here when he was here,\" referring to Musk.\n\n\"He was supposed to be in school when he came on a student visa. He wasn't in school. He was violating the law. He's talking about all these 'illegals' coming our way,\" Biden added.\n\nHe then criticized Trump and Republicans for failing to sign legislation that would fix \"the problem with the border.\" He added, \"We have fewer people crossing the border illegally now — or crossing the border period — than at any time since his third year as President of the United States.\"\n\nThe Trump campaign did not immediately respond to CNBC's request for comment on Biden's remarks.\n\nMusk recently completed a series of \"town hall\" events in the same swing state of Pennsylvania, where he sought to convince voters to back Trump and Trump's policies. Musk also stirred up his fan base there by doling out $1 million lottery-style prizes to registered voters in swing states who signed a petition distributed by his pro-Trump group, America PAC.\n\nAccording to an analysis by the Peterson Institute for International Economics, Trump's new immigration policy proposals include plans for the largest deportation operation in U.S. history, ending birthright citizenship, and revoking the visas of and deporting foreign students who are pro-Palestinian protestors, among others.\n\nBiden's comments about Musk, his Trump alliance and hypocrisy on immigration followed a Washington Post report that cites correspondence, legal records and multiple people who helped Musk attain a work visa in 1996 after he had already been working here without one.\n\nMusk had arrived in the U.S. with the stated intention of attending grad school at Stanford in the mid-90s. He did not enroll in the program to which he said he was accepted and instead began to build a venture-backed startup called Zip2 with his brother.\n\nThe Washington Post wrote that investors in Musk's first company worried about their \"'founder being deported' and gave him a deadline for obtaining a work visa.\"\n\nZip2 sold for about $300 million in 1999, a windfall that enabled Elon Musk to later become an early investor in and chairman of Tesla, and to start his capital-intensive aerospace venture SpaceX, which is now a major U.S. defense contractor.\n\nThose businesses have propelled Musk to become the world's wealthiest person on paper. According to Forbes, the Tesla CEO's net worth stands at around $274 billion today.\n\nIn late 2022, Musk used that considerable wealth to acquire the social network Twitter in a $44 billion buyout.\n\nOn the platform, since rebranded X, Musk has repeatedly claimed in posts seen by his massive online fan base that \"open borders\" and undocumented immigrants are somehow harming the United States.\n\nHe also has shared the false claim that noncitizens are systematically voting in U.S. elections, a conspiracy theory floated by conservative groups to lay the legal groundwork to contest the election results if the Democratic nominee, Vice President Kamala Harris, wins the presidency.\n\nIn the U.S., it's already a federal crime and a crime under every state's laws for noncitizens to register or vote in federal elections.\n\nAccording to studies compiled by the Brennan Center for Justice, \"extensive research reveals that fraud is very rare, voter impersonation is virtually nonexistent, and many instances of alleged fraud are, in fact, mistakes by voters or administrators. The same is true for mail ballots, which are secure and essential to holding a safe election amid the coronavirus pandemic.\"\n\n— CNBC's Rebecca Picciotto contributed to this report.","summary":"Elon Musk has become a regular campaign surrogate for Donald Trump in the presidential race against Vice President Kamala Harris.","url":"https://www.cnbc.com/2024/10/26/biden-elon-musk-illegal-worker-began-career.html","image":"https://image.cnbcfm.com/api/v1/image/107018481-1645551002061-biden_musk.jpg?v=1668037456","video":null,"publish_date":"2024-10-26 23:40:08","author":"Lora Kolodny","authors":["Lora Kolodny"],"language":"en","category":"politics","source_country":"US","sentiment":-0.248},{"id":261227940,"title":"Michelle Obama admits fear that Donald Trump could retake White House","text":"Michelle Obama on Saturday aired her “genuine fear” that Donald Trump could retake the White House as the popular former first lady made a passionate appeal to voters in the desperately close US election.\nShe said Democratic candidate Kamala Harris would be an “extraordinary president of the United States” if elected in just 10 days.\nBut, with polls forecasting a virtual dead heat, Obama also spoke of a sense of frustration and anxiety that few on Harris’ team dare express after she lost some momentum in recent weeks.\n“My hope about Kamala is also accompanied by some genuine fear,” Obama said, ripping into Trump’s record and asking, “Why is this race even close?”\n“I’m a little angry that we are indifferent to his erratic behaviour, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse.”\n\nObama, appearing alongside Harris in swing state Michigan, hammered home Harris’s campaign message that abortion rights – and women’s healthcare overall – are at stake on the ballot.\n“Please do not hand our fates over to the likes of Trump,” Obama said, adding that the former US president could effectively ban abortion nationwide.\nBoth Trump and Harris were in Michigan on Saturday searching for holdout votes, with Trump returning on his own anti-immigrant campaign theme at a raucous rally.\nHe launched bitter personal attacks on Harris and accused her of pushing an “open border” migration policy.\n“She’s a dope,” he said. “This person cannot be president.”\n“She will destroy our country. Everyone knows it. No one respects her. The United States is now occupied country. Kamala broke it, we will fix it.”\nWith more than 38 million people already casting early ballots, Americans are deciding whether to elect the country’s first-ever woman president, or its oldest commander in chief.\nTrump, 78, still refuses to accept his defeat in the vote four years ago and is expected to reject the result if he loses again – potentially pitching the United States into chaos.\n\nTrump swept the three Blue Wall states – Michigan, Wisconsin and Pennsylvania – in his shock victory in 2016 only to see Joe Biden reclaim them four years later. He hopes to claw back one or more of the trio, and win the so-called Sun Belt swing states to propel him back into power.\nAfter his Michigan event, Trump headed straight to Pennsylvania for another rally on Saturday evening.\nHarris kept her focus on abortion rights – a weak point for Republicans – by visiting a local doctor’s office and meeting doctors, staff and medical students.\n“Because of Trump and what he did with the Supreme Court, we are looking at a healthcare crisis in America,” Harris told reporters, referring to justices chosen by Trump who tipped the court into ending the national right to abortion in 2022.\nThe penultimate weekend before the vote began on Friday evening with Harris appearing alongside superstar Beyoncé, and Trump giving a three-hour interview with Joe Rogan, America’s most popular podcaster.\n\nOn Sunday Harris, 60, will campaign in Philadelphia, Pennsylvania, the largest city in the largest of the swing states likely to determine the winner under the US electoral college system.\nShe will criss-cross the city, especially historically Black and Latino districts, trying to persuade uncommitted residents to cast their vote.\nTrump will rally his supporters on Sunday evening in Madison Square Garden, the famous arena in the heart of heavily Democratic New York.\nThe brash billionaire and one-time reality television star appears keen to orchestrate a grand spectacle, and demonstrate he can fill an arena in a liberal bastion.\nBut critics, including Trump’s 2016 rival Hillary Clinton, have noted that Madison Square Garden was also the scene of a 1939 pro-Nazi rally organised by a group supportive of Adolf Hitler.\nPart of Harris’s election strategy is to peel moderate Republicans away from Trump, who often demeans some Americans as the “enemy”.","summary":"‘Why is this race even close?’ the former US first lady asked as campaigned for Democrat US presidential candidate Kamala Harris.","url":"https://www.scmp.com/news/world/united-states-canada/article/3284024/michelle-obama-admits-fear-donald-trump-could-retake-white-house","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/27/ba5acf75-43c4-4a09-b278-e7e177ae52ee_31c8a647.jpg","video":null,"publish_date":"2024-10-26 23:38:09","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":0.029},{"id":261228456,"title":"Democrats Unite in Praise of Michelle Obama at Harris’ Michigan Rally","text":"Democrats were reminded of what they are missing on Saturday night as Michelle Obama tore into Donald Trump in a Michigan stump speech for Kamala Harris.\n\nThe former first lady, who once again said that she ‘hates politics,’ still inspires devotion from liberals and hypothetical polling shows her as a much more competitive Trump challenger than Harris.\n\nShe called for a ‘grown up in the White House’ and blasted Trump for lies, childish antics and moral decline before making an emotional appeal directly to men. \n\nThe speech drew praise from Democrats online, with many stating that Michelle Obama would have been a better presidential candidate than Harris.\n\n‘Michelle Obama working on the stump this weekend like she knows that if Harris doesn’t get elected she’s gonna be asked to run for office every f***ing day for the next four years,’ one X user wrote.\n\nAnother Harris/Walz backer said: ‘If Harris doesn’t win, Michelle Obama needs to run in 2028.’\n\n‘Michelle Obama would be THE BEST PRESIDENT! I won’t question her reasons not to run, but when a woman of her incredible intelligence & unquestionable ethic backs a candidate, then please understand that that person is worthy of your support,’ said another.\n\nHalf-jokingly, another wrote: ‘If Trump wins let’s all collectively blame Michelle Obama for putting her own lack of desire to run for POTUS over stopping fascism because every time I hear her speak, I am reminded there is no way she wouldn’t have won both the nomination and the general election.’\n\n‘Michelle Obama would cruise if she ever decided to run,’ said a Harris voter watching the speech.\n\nPolling from as recently as this past July suggest that last tweet might be correct. \n\nA Reuters survey released then showed that 55 percent of registered voters hold a favorable opinion of Michelle Obama.\n\nMichelle was also the only Democrat in the poll who commanded enough public support to potentially defeat the former president in an election.\n\nIn fact, she blew Trump out the water in a head-to-head matchup (50 percent to 39 percent). \n\nHarris and other potential Biden substitutes – including ambitious California Governor Gavin Newsom and Michigan’s Gretchen Whitmer – were either tied or lagged behind Trump.\n\nThat said, Obama was fierce and in favor of Harris when she spoke in Kalamazoo Saturday, first reciting the critiques of the vice president. \n\n‘They accuse her of not providing enough policy detail. Some wonder, do we really know her? Is she too aggressive? Is she not aggressive enough? There are folks sowing seeds of doubt about whether she’s who she appears to be,’ she said. \n\n‘Now, don’t get me wrong, voters have every right to ask hard questions of any candidate seeking office, but can someone tell me why we are once again holding Kamala to a higher standard than her opponent?\n\n‘These folks know that nothing this man says or does is funny in any way. So I hope you’ll forgive me if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence while asking Kamala to dazzle us at every turn.’ \n\nObama made plenty of time for harsh words against Trump.\n\n‘When the American people fired him from a job that was too big for him to begin with, he tried to steal it,’ she said.\n\nShe exclaimed at how much the idea of a second Trump term worries her for the future of the United States. \n\n‘I hope that you will forgive me if I am worried that we will blow this opportunity to finally turn the page on the ugliness once and for all, because, believe me, if Donald Trump is president again at some point or another, that ugliness will touch all of our lives.’\n\nObama biographers – who spent hours interviewing those close to the family – still insist there is ‘absolutely nothing’ that would convince her to pursue the presidency.\n\nHer time in the White House was such an ‘ordeal’ nothing would persuade her to go back, Peter Slevin, author of ‘Michelle Obama: A Life’, told DailyMail.com. \n\n‘It was eight years of an ordeal. And she asks: “Why would I do that again and try to be in charge?”,’ he said.\n\n‘She doesn’t want to put herself through it for one thing, and she feels as though she’s done her time in the public eye.’\n\nIt’s easy to see why Michelle has been put off.\n\nIn her eight years as First Lady, she endured years of racist and sexist personal attacks.\n\nEven more distressing than the personal attacks were the conspiracy theories.\n\nAnd while the attacks continued, Michelle had to grapple with the sudden and profound loss of privacy and autonomy that any first family faces.\n\nIn particular, she struggled to raise her two young daughters Malia and Sasha with a degree of normalcy.\n\nHowever, she and Barack both endorsed Harris when she declared her intention to run and Michelle has now appeared multiple times to get out the vote for the vice president.","summary":"Democrats were reminded of what they are missing on Saturday night as&#8230;","url":"https://internewscast.com/news/us/democrats-unite-in-praise-of-michelle-obama-at-harris-michigan-rally/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Democrats-are-all-saying-the-same-thing-800x430.jpg","video":null,"publish_date":"2024-10-26 23:37:44","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.477},{"id":261230100,"title":"Michelle Obama Admits Fear Over Vote Result, Slams Trump","text":"Michelle Obama on Saturday aired her \"genuine fear\" that Donald Trump could retake the White House as the popular former first lady made a passionate appeal to voters in the desperately close US election.Both Trump and Kamala Harris were in Michigan searching for holdout votes ahead of the November 5 election, with Harris focused on abortion rights and Trump returning to his anti-immigrant campaign theme.Obama said Democratic candidate Harris would be an \"extraordinary president of the United States\" if elected in just 10 days. But, with polls forecasting a virtual dead heat, she also spoke of a sense of frustration and anxiety that few on Harris's team dare express after she lost some momentum in recent weeks.\"My hope about Kamala is also accompanied by some genuine fear,\" Obama said, ripping into Trump's record and asking, \"Why is this race even close?\"\"I'm a little angry that we are indifferent to his erratic behavior, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse.\"Obama, appearing alongside Harris, hammered home the vice president's message that abortion rights -- and women's health care overall -- are at stake on the ballot.\"Please do not hand our fates over to the likes of Trump,\" Obama said, adding he could effectively ban abortion nationwide.At his rally, Trump launched bitter personal attacks on Harris and accused her of pushing an \"open border\" migration policy.\"She's a dope,\" he said. \"This person cannot be president.\"\"She will destroy our country. Everyone knows it. No one respects her. The United States is now occupied country. Kamala broke it, we will fix it.\"With more than 38 million people already casting early ballots, Americans are deciding whether to elect the country's first-ever woman president, or its oldest commander in chief.Trump, 78, still refuses to accept his defeat in the vote four years ago and is expected to reject the result if he loses again -- potentially pitching the United States into chaos.Trump swept the three Blue Wall states -- Michigan, Wisconsin and Pennsylvania -- in his shock victory in 2016 only to see Joe Biden reclaim them four years later.He hopes to claw back one or more of the trio, and win the so-called Sun Belt swing states to propel him back into power.After his Michigan event, Trump headed straight to Pennsylvania for another rally on Saturday evening.Harris further highlighted abortion rights -- a weak point for Republicans -- by visiting a local doctor's office and meeting with physicians, staff and medical students.\"Because of Trump and what he did with the Supreme Court, we are looking at a health care crisis in America,\" she told reporters, referring to justices chosen by Trump who tipped the court into ending the national right to abortion in 2022.The penultimate weekend before the vote began on Friday evening with Harris appearing alongside superstar Beyonce, and Trump giving a three-hour interview to Joe Rogan, America's most popular podcaster.On Sunday Harris, 60, will campaign in Philadelphia, Pennsylvania, the largest city in the largest of the swing states likely to determine the election winner.She will criss-cross the city, especially historically Black and Latino districts, trying to persuade uncommitted residents to cast their vote.Trump will rally his supporters on Sunday evening in Madison Square Garden, the famous arena in the heart of heavily Democratic New York.The brash billionaire and onetime reality television star appears keen to orchestrate a grand spectacle, and demonstrate he can fill an arena in a liberal bastion.But critics, including Trump's 2016 rival Hillary Clinton, have noted that Madison Square Garden was also the scene of a 1939 pro-Nazi rally organized by a group supportive of Adolf Hitler.Part of Harris's election strategy is to peel moderate Republicans away from Trump, who often demeans some Americans as the \"enemy.\"Harris told her supporters that as a prosecutor she \"took on perpetrators of all kinds -- predators, fraudsters and repeat offenders. I took them on and I won.\"In 10 days, it's Donald Trump's turn.\"","summary":"Michelle Obama on Saturday aired her \"genuine fear\" that Donald Trump could retake the White House as the popular former first lady made a passionate appeal to voters in the desperately close US election.","url":"https://www.ibtimes.com.au/michelle-obama-admits-fear-over-vote-result-slams-trump-1852829","image":"https://d.ibtimes.com.au/en/full/1863380/kamala-harris-walks-stage-houston-texas.jpg","video":null,"publish_date":"2024-10-26 23:36:07","author":"Aurelia End","authors":["Aurelia End"],"language":"en","category":"politics","source_country":"au","sentiment":-0.116},{"id":261228566,"title":"Rudy Giuliani Forced to Give Up NYC Condo and Yankees Memorabilia to Election Workers He Defamed","text":"Court Forces Giuliani to Surrender Luxury Assets to Georgia Election Workers\n\nOn Tuesday, a federal judge ordered Rudy Giuliani, a former attorney for Donald Trump and ex-mayor of New York City, to surrender all his valuable assets, including his Manhattan penthouse, to Ruby Freeman and Shaye Moss— the Georgia election workers he defamed. Judge Lewis Liman from Manhattan’s federal court specified that Giuliani must transfer his interest in the property within seven days to a receivership controlled by Freeman and Moss. \n\n$148 Million Surrender \n\nTo satisfy a $148 million defamation judgment, Giuliani must surrender a range of high-value assets. The list includes his Madison Avenue penthouse, worth over $5 million, a 1980 Mercedes owned by actress Lauren Bacall, and 26 luxury watches. Freeman and Moss, through a court-ordered receivership, will oversee the liquidation of these items, likely through high-end auction houses like Sotheby’s to ensure top returns. Additionally, Giuliani’s collection of rare memorabilia, including a signed Joe DiMaggio Yankees jersey, will also go up for sale.\n\nWhere It All Started\n\nThe case against Giuliani traces back to the 2020 election when he made claims about election fraud involving Georgia election workers Freeman and Moss. These false allegations led to public backlash, causing Freeman and Moss to face severe harassment and threats. In 2023, a court awarded them $150 million in damages for the defamation, emotional distress, and punitive impact of Giuliani’s actions.\n\nOnly Exemption— A Watch! \n\nAmong the assets in question is a watch with sentimental value, given to Giuliani by his grandfather. Although Judge Liman recognized its importance, he initially rejected Giuliani’s plea to exempt it from liquidation, noting it didn’t meet exemption criteria due to its high value. It is the only item that may not be subject to liquidation.\n\nFamily Feud Over Yankee Rings\n\nA twist in the case includes four Yankees World Series rings that Giuliani’s son, Andrew, claims were gifts from his father. Andrew argues these rings should not be included in the asset turnover, and provided evidence to back his claim. The court will review this dispute as Freeman and Moss’s legal team contests the exemption of the valuable sports jewelry.\n\nA Price for Public Misinformation\n\nAttorney Michael Gottlieb, representing Freeman and Moss, remarked on the broader implications of this ruling, arguing that it would serve as a warning to public figures about the potential consequences of misinformation, CNN reported.\" Attorney Aaron Nathan also echoed, \"This outcome should send a powerful message that there is a price to pay for those who choose to intentionally spread disinformation.\"\n\nDefense Team Cries Unfair Punishment\n\nTed Goodman, a spokesperson for Giuliani, stated on Wednesday that the former mayor is “being unfairly punished by partisan, political activists” as they force him to relinquish deeply personal belongings during his appeal, USA Today reported. Goodman also claimed, “They are attempting to bully and intimidate him into silence through the weaponization of our justice system and obvious lawfare.” Despite the judgment, he emphasized that Giuliani remains confident he will eventually prevail.","summary":"Rudy Giuliani has been court-ordered to liquidate assets valued at $148 million to compensate Georgia election workers.","url":"https://www.inquisitr.com/rudy-giuliani-forced-to-give-up-nyc-condo-and-yankees-memorabilia-to-election-workers-he-defamed","image":"https://dab57h0r8ahff.cloudfront.net/721881/uploads/d15f2b50-93ba-11ef-ad39-4146e3c6db55_1200_630.jpeg","video":null,"publish_date":"2024-10-26 23:33:00","author":"INQUISITR,Prachi Mallick","authors":["INQUISITR","Prachi Mallick"],"language":"en","category":"politics","source_country":"US","sentiment":0.214},{"id":261228844,"title":"Liz Cheney Is Certain That Kamala Harris Will Win","text":"How do you get rid of the Electoral College? The easiest path is for both parties to suffer an Electoral College inversion — to win more popular votes nationwide but lose the election — in proximity to each other. That way everyone experiences the unfairness of the system, providing the necessary momentum for constitutional change.\n\nUnfortunately, the Democrats have been on the short end of all Electoral College inversions in the country’s history and twice in this century alone, which is why many people think the debate over how we choose our president is unavoidably partisan. It isn’t.\n\nAs Nate Cohn, the chief political analyst of The Times, explained in his Friday newsletter, current polling and demographic trends suggest that Donald Trump could plausibly win more popular votes than Kamala Harris next month and yet lose in the Electoral College.\n\nThis scenario is not particularly likely for a number of reasons Cohn lays out, but neither is it remote. As he noted, even though the Democrats have won the popular vote in seven of the past eight presidential elections, under slightly different circumstances the outcome in a few of those elections could have been reversed.\n\nIf there is an overriding theme of the 2024 election so far, it’s that nothing is likely and anything is possible. So let’s take this opportunity to engage in a fun mental exercise: What if Trump prevails in the popular vote and still loses the Electoral College? One thing we can say with certainty is that Republicans, despite their consistent defenses of the college, will be hopping mad.\n\nHow can we be so sure? Because they’ve already told us. Most people forget that in the weeks leading up to the 2000 election, there were warnings that the Electoral College and the popular vote would diverge — in Al Gore’s favor. George W. Bush’s team was not going to take that lying down. Inside the Bush campaign, there was talk of a P.R. blitz to remind Americans of the Electoral College’s “essential unfairness.” In an article in The New York Daily News days before the election, an unnamed Bush aide was quoted as predicting a popular uprising “because the will of the people will have been thwarted.” It didn’t work out that way, of course. But even the possibility was enough to get the right’s engines running.\n\nThen there was Election Day 2012, when early returns suggested Mitt Romney might prevail in the popular vote but lose the Electoral College to President Barack Obama. Donald Trump, a private citizen at the time who supported Romney, tweeted, “The electoral college is a disaster for a democracy.”\n\nTo this I can only say, amen. As the rest of us have been arguing for decades, it is wrong for a representative democracy to reject majority rule in the biggest election of all. Alas, as Republicans never tire of pointing out, these are the rules of the game. If Kamala Harris wins the Electoral College with fewer popular votes, she will be the president no less than Donald Trump was in 2016 or George W. Bush was in 2000.\n\nThen, perhaps, we could have a real conversation about ending this absurd, antidemocratic system once and for all.","summary":"And it’s not because of democracy issues.","url":"https://www.nytimes.com/live/2024/10/22/opinion/thepoint/liz-cheney-kamala-harris","image":"https://static01.nyt.com/images/2024/01/26/opinion/The-Point-Promo-Image/The-Point-Promo-Image-facebookJumbo.png","video":null,"publish_date":"2024-10-26 23:30:39","author":"Alexandra Ellerbeck,Brent Staples,Bret Stephens,David Brooks,David Firestone,David French,Farah Stockman,Jesse Wegman,Katherine Miller,Mara Gay,Meher Ahmad,Michelle Cottle,Neel V. Patel,Patrick Healy,Thomas L. Friedman","authors":["Alexandra Ellerbeck","Brent Staples","Bret Stephens","David Brooks","David Firestone","David French","Farah Stockman","Jesse Wegman","Katherine Miller","Mara Gay","Meher Ahmad","Michelle Cottle","Neel V. Patel","Patrick Healy","Thomas L. Friedman"],"language":"en","source_country":"us","sentiment":-0.333},{"id":261227630,"title":"‘Frustrated’ Michelle Obama worries US will ‘blow this opportunity’ during first campaign trail appearance for Kamala Harris","text":"A “frustrated” Michelle Obama attacked Donald Trump during her first campaign trail appearance for Kamala Harris, worrying that the US “will blow this opportunity to finally turn the page on the ugliness” by re-electing the former president.\n\nThe former first lady did not shy away from slamming the 45th president and his supporters alike during an impassioned speech at Harris’ rally in Kalamazoo, Mich. — her first time stumping for the vice president since the Democratic National Convention in August. \n\nTrump supporters and undecided voters hold Harris to a high and unfair double standard while letting the ex-commander in chief coast with little criticism, Obama claimed.\n\n“I hope you’ll forgive me if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence while asking Kamala to dazzle us at every turn,” Obama, 60, told the crowd.\n\n“I hope that you will forgive me if I’m a little angry that we are indifferent to his erratic behavior, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse — all of this while we pick apart countless answers from interviews that he doesn’t even have the courage to do.”\n\nObama pointed to the growing list of former Trump allies who have jumped from the MAGA ship in recent years as proof of the ex-president’s incompetence — including his former chairman of the joint chiefs of staff who labeled the politician as a “fascist.”\n\nThe former first lady also went after those choosing to abstain from the 2024 presidential election, claiming that their disregard equates to casting a vote for Trump.\n\n“I hope that you will forgive me if I am worried that we will blow this opportunity to finally turn the page on the ugliness once and for all. Because believe me, if Donald Trump is president again at some point or another, that ugliness will touch all of our lives,” Obama said. \n\n“It will not matter what you look like, how you worship, who you love, or how you vote — if you don’t make six or eight or 12 figures, if you’re not famous, if you criticize or disagree with him in any way, If he doesn’t view you as his equal or relevant to his ambitions. I promise you, He will not think about you when he gets into the Oval Office, and that will have real consequences for all of us.”\n\nHarris continued the Trump flaying when Obama welcomed her onto the rally stage.\n\nThe veep snuck in several digs while touting her resume as a courtroom prosecutor, district attorney and California’s attorney general.\n\n“In those roles, I took on perpetrators of all kinds: creditors, fraudsters and repeat offenders. I took them on and I won,” the Democratic presidential nominee said.\n\n“Well, Michigan. In 10 days, it’s Donald Trump’s turn.”\n\nAlthough familiar, the dig resulted in an eruption of cheers throughout the Wings Event Center.","summary":"A “frustrated” Michelle Obama attacked Donald Trump during her first campaign trail appearance for Kamala Harris, worrying that the US “will blow this opportunity to finally turn the page on the ugliness” by re-electing the former president. The former first lady did not shy away from slamming the 45th president and his supporters alike during &#8230;\n\n\nThe post ‘Frustrated’ Michelle Obama worries US will ‘blow this opportunity’ during first campaign trail appearance for Kamala Harris appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/frustrated-michelle-obama-worries-us-will-blow-this-opportunity-during-first-campaign-trail-appearance-for-kamala-harris/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92457199.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-26 23:30:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.001},{"id":261228462,"title":"Trump Criticizes Detroit Once More While Asking for Votes in a Suburb of Michigan’s Biggest City","text":"NOVI, Mich. – Donald Trump further denigrated Detroit while appealing for votes Saturday in a suburb of the largest city in swing state Michigan.\n\n“I think Detroit and some of our areas makes us a developing nation,” the former president told supporters in Novi. He said people want him to say Detroit is “great,” but he thinks it “needs help.”\n\nThe Republican nominee for the White House had told an economic group in Detroit earlier this month that the “whole country will end up being like Detroit” if Democrat Kamala Harris wins the presidency. That comment drew harsh criticism from Democrats who praised the city for its recent drop in crime and growing population.\n\nTrump later headed to Pennsylvania, another crucial swing state, where he appealed to young voters by promising them better conditions as they start their careers.\n\nTrump’s stop in Novi, after an event Friday night in Traverse City, is a sign of Michigan’s importance in the tight race. Harris held a rally in Kalamazoo Saturday with former first lady Michelle Obama, who gave a searing denunciation of Trump and questioned why it was close, saying, “I lay awake at night wondering, ‘What in the world is going on?’”\n\nThe candidates in the final stretch of the campaign have made frequent visits to Michigan, a state Trump won in 2016 but Democrat Joe Biden carried four years later.\n\nMichigan is home to major car companies and the nation’s largest concentration of members of the United Auto Workers. It also has a significant Arab American population, and many have been frustrated by the Biden administration’s support for Israel’s offensive in Gaza after the attack by Hamas against Israel on Oct. 7, 2023.\n\nDuring his rally, Trump spotlighted local Muslim and Arab American leaders who joined him on stage. These voters “could turn the election one way or the other,” Trump said, adding that he was banking on ”overwhelming support” from those voters in Michigan.\n\n“When President Trump was president, it was peace,” said one of those leaders, Mayor Bill Bazzi of Dearborn Heights. “We didn’t have any issues. There was no wars.”\n\nWhile Trump is trying to capitalize on the community’s frustration with the Democratic administration, he has a history of policies hostile to this group, including a travel ban targeting Muslim countries while in office and a pledge to expand it to include refugees from Gaza if he wins on Nov. 5.\n\nA Trump ally, Republican Rep. Darrell Issa of California, the grandson of Lebanese immigrants, told reporters that Trump was winning over support from more Arab Americans and has cultivated relationships with leaders in the Middle East that would bring more stability to the region.\n\nIn lengthy remarks to supporters, Trump went after Harris and the media with familiar barbs and promoted immigration and energy policies that are campaign staples. For example, he said immigrants are “taking the Black population jobs and they’re taking the Hispanic jobs.” Government data contradicts this claim, showing that immigrant labor contributes to economic growth and provides promotional opportunities for native-born workers.\n\nLater Saturday, Trump traveled to State College, Pennsylvania, the home of Penn State University. He told a crowd that included more young people than usual that under his leadership, they will “inherit the freest, strongest and most powerful nation on Earth.”\n\n“If you vote for me, I will ensure that you begin your careers, young people, in a roaring economy at a time of unprecedented peace and prosperity,” he said.\n\nHe repeatedly praised the university’s national championship-winning wrestling team, inviting several of its athletes onstage to shake his hand.\n\nIn both campaign stops on Saturday, Trump called attention to how an influx of Haitian migrants have impacted Springfield, Ohio. But he stopped short of repeating false claims about immigrants eating pets, a narrative that had drawn pushback from members of both parties and prompted bomb threats on some schools and government buildings.\n\nTrump took the stage an hour and 40 minutes after he was originally billed to speak. An hour into his remarks, the crowd had become noticeably bare in the back of the arena, especially as the kickoff of Sunday night’s Penn State game at Wisconsin neared.\n\nSwenson reported from New York.","summary":"NOVI, Mich. – Donald Trump further denigrated Detroit while appealing for votes&#8230;","url":"https://internewscast.com/local-news/trump-criticizes-detroit-once-more-while-asking-for-votes-in-a-suburb-of-michigans-biggest-city/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trump-again-denigrates-Detroit-while-appealing-for-700x430.jpg","video":null,"publish_date":"2024-10-26 23:29:42","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.048},{"id":261227220,"title":"Biden says Elon Musk was an ‘illegal worker’ when he began U.S. career","text":"President Joe Biden called out Tesla and SpaceX CEO Elon Musk, now a Republican megadonor and Trump campaign surrogate, for hypocrisy on immigration on Saturday, saying Musk launched his long career in the U.S. as an “illegal worker” before becoming the world’s wealthiest man.\n\nThe president made these remarks at a campaign event to support Democrats that took place in Pittsburgh, Pennsylvania, on Saturday.\n\nLabeling Musk as former President Donald Trump’s wealthy new “ally,” Biden said, “That wealthiest man in the world turned out to be an illegal worker here when he was here,” referring to Musk.\n\n“He was supposed to be in school when he came on a student visa. He wasn’t in school. He was violating the law. He’s talking about all these ‘illegals’ coming our way,” Biden added.\n\nHe then criticized Trump and Republicans for failing to sign legislation that would fix “the problem with the border.” He added, “We have fewer people crossing the border illegally now — or crossing the border period — than at any time since his third year as President of the United States.”\n\nThe Trump campaign did not immediately respond to CNBC’s request for comment on Biden’s remarks.\n\nMusk recently completed a series of “town hall” events in the same swing state of Pennsylvania, where he sought to convince voters to back Trump and Trump’s policies. Musk also stirred up his fan base there by doling out $1 million lottery-style prizes to registered voters in swing states who signed a petition distributed by his pro-Trump group, America PAC.\n\nAccording to an analysis by the Peterson Institute for International Economics, Trump’s new immigration policy proposals include plans for the largest deportation operation in U.S. history, ending birthright citizenship, and revoking the visas of and deporting foreign students who are pro-Palestinian protestors, among others.\n\nBiden’s comments about Musk, his Trump alliance and hypocrisy on immigration followed a Washington Post report that cites correspondence, legal records and multiple people who helped Musk attain a work visa in 1996 after he had already been working here without one.\n\nMusk had arrived in the U.S. with the stated intention of attending grad school at Stanford in the mid-90s. He did not enroll in the program to which he said he was accepted and instead began to build a venture-backed startup called Zip2 with his brother.\n\nThe Washington Post wrote that investors in Musk’s first company worried about their “‘founder being deported’ and gave him a deadline for obtaining a work visa.”\n\nZip2 sold for about $300 million in 1999, a windfall that enabled Elon Musk to later become an early investor in and chairman of Tesla, and to start his capital-intensive aerospace venture SpaceX, which is now a major U.S. defense contractor.\n\nThose businesses have propelled Musk to become the world’s wealthiest person on paper. According to Forbes, the Tesla CEO’s net worth stands at around $274 billion today.\n\nIn late 2022, Musk used that considerable wealth to acquire the social network Twitter in a $44 billion buyout.\n\nOn the platform, since rebranded X, Musk has repeatedly claimed in posts seen by his massive online fan base that “open borders” and undocumented immigrants are somehow harming the United States.\n\nHe also has shared the false claim that noncitizens are systematically voting in U.S. elections, a conspiracy theory floated by conservative groups to lay the legal groundwork to contest the election results if the Democratic nominee, Vice President Kamala Harris, wins the presidency.\n\nIn the U.S., it’s already a federal crime and a crime under every state’s laws for noncitizens to register or vote in federal elections.\n\nAccording to studies compiled by the Brennan Center for Justice, “extensive research reveals that fraud is very rare, voter impersonation is virtually nonexistent, and many instances of alleged fraud are, in fact, mistakes by voters or administrators. The same is true for mail ballots, which are secure and essential to holding a safe election amid the coronavirus pandemic.”\n\n— CNBC’s Rebecca Picciotto contributed to this report.","summary":"President Joe Biden called out Tesla and SpaceX CEO Elon Musk, now a Republican megadonor and Trump campaign surrogate, for hypocrisy on immigration on Saturday, saying Musk launched his long career in the U.S. as an &#8220;illegal worker&#8221; before becoming the world&#8217;s wealthiest man. The president made these remarks at a campaign event to support &#8230;\n\n\nThe post Biden says Elon Musk was an &#8216;illegal worker&#8217; when he began U.S. career appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/biden-says-elon-musk-was-an-illegal-worker-when-he-began-u-s-career/","image":"https://image.cnbcfm.com/api/v1/image/107018481-1645551002061-biden_musk.jpg?v=1668037456&w=1920&h=1080","video":null,"publish_date":"2024-10-26 23:21:07","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":261227108,"title":"Examining Misleading Claims and False Information About the 2024 Election: Insights from Associated Press","text":"MICHIGAN, USA — A steady stream of false and misleading information is circulating online around the 2024 election. Since early voting began there have been false reports of ballots for former President Donald Trump in Pennsylvania being destroyed; more registered voters than those eligible to vote in Michigan; and a voter’s choice being “flipped” by a Dominion voting machine in Georgia.\n\nHere’s a look at the facts.\n\nCLAIM: A video shows ballots marked for Trump being destroyed in Bucks County, Pennsylvania, while those for Vice President Kamala Harris were put back in their envelopes to be counted.\n\nTHE FACTS: The Bucks County Board of Elections identified the video as “fake” Thursday afternoon. And the FBI and other U.S. intelligence agencies said the video was “manufactured and amplified” by Russian actors.\n\n“The envelope and materials depicted in this video are clearly not authentic materials belonging to or distributed by the Bucks County Board of Elections,” the board said in a statement. The video was reported to law enforcement.\n\nIn a statement released late Friday, the FBI, the Office of the Director of National Intelligence and the Cybersecurity and Infrastructure Security Agency said the video is “part of Moscow’s broader effort to raise unfounded questions about the integrity of the U.S. election and stoke divisions among Americans.”\n\nBob Harvie and Diane Ellis-Marseglia, chair and vice chair of the board, respectively, called the video “dangerous misinformation\" in a joint statement.\n\nThe Bucks County district attorney’s office said in an emailed statement Thursday evening that they and the Yardley Borough Police Department investigated the video and “concluded that this video was fabricated in an attempt to undermine confidence in the upcoming election.”\n\nThe X user who popularized the inauthentic video has previously shared multiple narratives created by a Russian disinformation network known as Storm-1516 or CopyCop, raising questions over whether it originated as part of a foreign influence campaign.\n\nThe FBI statement also warned that U.S. intelligence officials expect Russia will “create and release additional media content that seeks to undermine trust in the integrity of the election and divide Americans” in the coming weeks.\n\n— Associated Press writers Melissa Goldin and Ali Swenson in New York contributed this report.\n\nCLAIM: Michigan has 500,000 more registered voters than people eligible to vote, which creates the potential for widespread fraud.\n\nTHE FACTS: This is missing context. While the state does have more total voter registrations than eligible voters, that number includes voters who are inactive but cannot yet be removed from voter rolls under federal and state laws. The number of active voters is far less than those who are eligible to vote, and experts say there is no reason to believe that widespread fraud will result.\n\nStill, numerous social media users suggested the numbers were proof that Michigan is trying to cheat in the 2024 election. Among them was billionaire X owner Elon Musk, who has committed at least $70 million in support of Trump.\n\n“Jocelyn Michelle Benson, shame on you for blatantly lying to the public!” Musk wrote in an X post directed at Michigan’s secretary of state. “You only plan to remove ineligible voters AFTER this election. That necessarily means that there are far more people registered to vote than there eligible voters.”\n\nBenson responded on X, stating: “Let’s be clear: @elonmusk is spreading dangerous disinformation. Here are the facts: There aren’t more voters than citizens in Michigan. There are 7.2 million active registered voters and 7.9 citizens of voting age in our state. Musk is pushing a misleading number that includes 1.2 million inactive records slated for removal in accordance with the law.”\n\nMusk did not respond to a request for comment from The Associated Press.\n\nThere were approximately 7.9 million people of voting age in Michigan as of July 1, 2023. This figure is 500,000 fewer than the total registered voters — approximately 8.4 million. But that’s because the total registered voters include 1.2 million voters who are inactive. Those labeled inactive have not voted for six consecutive years or have not responded to a notice confirming their residency. Inactive voters are still eligible to vote.\n\nUnder state and federal law, voters are only removed from voter rolls after they have been sent a notice that their registration is subject to cancellation and two subsequent federal election cycles have passed without any response or voting activity. Voter registration cannot be canceled only because of a failure to vote.\n\nThis waiting period is why there are more total registered voters than eligible ones in the state.\n\nMore than 339,000 voter registrations are slated for cancellation in 2025 and more than 257,000 in 2027. As of March 2024, Michigan had canceled more than 800,000 voter registrations since 2019, including 273,609 for possible changes of residency, 532,513 for deaths and 16,716 at the request of the voter, according to its Department of State.\n\nThe Republican National Committee and two individual voters filed a federal lawsuit in March against Benson and Michigan Bureau of Elections Director Jonathan Brater for allegedly failing to “maintain clean and accurate voter registration records.” The suit was dismissed Tuesday by U.S. District Judge Jane Beckering, who said the plaintiffs lacked legal standing and, regardless, did not state a plausible claim.\n\nMichigan is hardly the only state with large numbers of inactive voters on its rolls. Every state — aside from the six which are exempt from the National Voter Registration Act — must send voters a cancellation notice and wait two federal election cycles before removing inactive voters.\n\nThe large number of inactive voters is a sign of robust list maintenance, according to David Becker, the founder and executive director of The Center for Election Innovation and Research, who served as a co-chair on Michigan’s Election Security Advisory Commission.\n\nRead the full fact check here.\n\nCLAIM: A Dominion voting machine in Whitfield County, Georgia, flipped a vote to a candidate not marked by the voter.\n\nTHE FACTS: That’s false. The Whitfield County Board of Elections and Registrars issued a press release Oct. 19, noting the case involved one voter out of 6,000 ballots cast since early voting began Oct. 15. The ballot was spoiled, and the voter cast a replacement that was counted. Officials said there was no problem with the voting machine.\n\nGabriel Sterling, chief operating officer for the Georgia secretary of state’s office, said every report they’ve seen so far of someone saying their printed ballot didn’t reflect their selections on the touchscreen voting machine has been a result of voter error.\n\nThe statements followed a post by U.S. Rep. Marjorie Taylor Greene, who claimed on X that a voting machine had changed a voter’s ballot in her Georgia district during early voting. She later updated her post to include a statement from county election officials explaining what happened and thanking them for resolving the issue.\n\nWhitfield County election officials said in the press release that the voter noticed when reviewing their printed ballot that it didn’t reflect their choice. A poll worker assisted the voter in marking their choice and casting their vote.\n\n“Georgia law allows voters to spoil their printed ballot if they make the wrong selection on the ballot marking device. If a voter requests to change their selections, they are immediately given a new opportunity to make and print the correct choice,” officials said.\n\nThey noted that if there was reason to suspect that the machine made an error it would be taken out of service. No machines were taken out of service, county election officials said.\n\nFind AP Fact Checks here","summary":"With early voting underway, false and misleading reports have emerged online. MICHIGAN,&#8230;","url":"https://internewscast.com/news/examining-misleading-claims-and-false-information-about-the-2024-election-insights-from-associated-press/","image":"https://img.onesignal.com/permanent/bf8f00fb-e04a-4fe5-8e4d-a31886d1740f.png","video":null,"publish_date":"2024-10-26 23:19:01","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.337},{"id":261227664,"title":"Early Voters In Battleground Georgia Already Top More Than Half Of 2020 Turnout","text":"A surge of early voting in Georgia has resulted in the casting of more than half the number of ballots for the 2020 presidential election.Nearly 2.58 million Peach State residents had voted in person as of Saturday afternoon, according to data posted online by the Secretary of State's Office.Another 168,031 absentee ballots had been returned and accepted.Early voting in Georgia — one of seven swing states expected to decide this year's race for the White House — began on Oct. 15 and is scheduled to continue through November 1.Fewer than 5 million votes were cast in 2020, leading Gabriel Sterling, chief operating officer of the Secretary of State's Office, to tout this year's early turnout when it passed the 50 percent mark from four years ago.\"So for people like Joe Biden & Stacey Abrams, you were wrong saying we had voter suppression here,\" Sterling, a Republican, wrote Friday night on X. \"It's easy to register & vote in Georgia ... and really hard to even try to cheat. Great job by our voters & counties.\"Georgia's voter registration records don't include party affiliation so it's unclear whether the early turnout is likely to favor Democratic nominee Vice President Kamala Harris or former President Donald Trump, the GOP candidate.A Real Clear Politics polling average shows Trump with a 2.2 percent edge over Harris, although the results of nearly every recent survey were within the margin of error.Earlier this week, Secretary of State Brad Raffensberger said he expected that early and absentee voters would cast 65 percent to 70 percent of all ballots this year and that \"maybe even 75 percent of all the vote totals will be reported no later than 8 p.m. on election night.\"\"What we will be waiting for is the overseas ballots that come in no later than Friday, and so those will then be the final numbers,\" he told CBS' \"Face the Nation\" on Sunday. \"I understand we're very competitive, and that's why we've done everything since day one to make sure we have fast, accurate and secure elections for all my voters here in Georgia.\"In 2020, Trump lost to Joe Biden by just 11,779 votes, leading to an infamous, January 2, 2021, phone call to Raffensberger during which Trump falsely claimed there had been widespread election fraud, including ballot \"shredding.\"\"All I want to do is this: I just want to find 11,780 votes, which is one more than we have because we won the state,\" he said.The call helped lead to the indictment of Trump and 18 others in an alleged scheme to illegally overturn the election results.That case is on hold pending oral arguments scheduled for December 5 before the Georgia Court of Appeals over a defense effort to disqualify Fulton County District Attorney Fani Willis.Four defendants in the case struck plea deals with prosecutors, but Trump and the others have all pleaded not guilty.","summary":"Secretary of State Brad Raffensberger has said that early and absentee voters would likely cast 65 percent to 70 percent of all ballots this year.","url":"https://www.ibtimes.com/early-voters-battleground-georgia-already-top-more-half-2020-turnout-3748294","image":"https://d.ibtimes.com/en/full/4556977/georgia-early-voting.jpg","video":null,"publish_date":"2024-10-26 23:18:20","author":"Bruce Golding","authors":["Bruce Golding"],"language":"en","category":"politics","source_country":"US","sentiment":-0.326},{"id":261227926,"title":"US November 5 Election: It’s Looking Donald Trumpish","text":"As the American general elections approach on November 5, the polit-ical environment is as turbulent as ever. The race for the White House has taken on an unpredictable turn, dominat-ed by polarizing debates, media bias, and unprecedented events that are shifting public opinion in ways never seen before.\n\nOne of the most striking as-pects of this election is the num-ber of assassination attempts that Donald Trump has faced— three in total by recent investiga-tions. These attempts underscore the intensity of the forces against him, as many perceive his rise as a threat to entrenched political structures. Trump’s anti-estab-lishment stance, which gained him a formidable following in 2016, has only deepened the di-vide between his supporters and opponents.\n\nMeanwhile, the Democratic Party, led by President Joe Biden and Vice President Kamala Har-ris, is struggling to maintain a unified message. Harris’ stance on issues such as abortion and LGBTQ+ rights has become a flashpoint. On abortion, Harris has consistently advocated for a woman’s right to choose, which aligns with Democratic values, but this position remains divi-sive. Many conservative voters see this as part of a broader cultural shift that distances the country from its traditional val-ues. On LGBTQ+ issues, Harris has stood firm, promoting equal-ity and inclusion, but these stanc-es have become hot-button issues for those advocating for religious freedoms and conservative poli-cies. I am informed also that she’s advocating for the removal of the word ‘God’ in the enshrined con-stitution of the USA.\n\nAdding to the volatile mix is the media’s role in shaping the narrative of the elections. Trump has always had a combative re-lationship with mainstream me-dia outlets like CNN and other pro-Democrat media networks, which have continued their re-lentless critique of his policies, character, and handling of the presidency. These negative re-ports, however, have done little to dampen the enthusiasm of his base, who see these attacks as part of a coordinated attempt to tarnish his image. In fact, for many of his supporters, these media campaigns only reinforce their belief that Trump is the one leader willing to stand against the tide of biased coverage.\n\nThe international scene is equally chaotic. The ongoing Is-raeli-Palestinian conflict, with the added threat from Hezbollah, is a stark reminder of the fragile state of global peace. The Middle East remains a flashpoint for terrorism and war, with no clear solution in sight. Under Biden’s administration, critics argue that American influence has waned in the region, with Israel feeling increasingly isolated and vulner-able. Trump, on the other hand, has long positioned himself as a dealmaker capable of bringing peace to the Middle East. His ad-ministration’s efforts to broker peace agreements between Israel and several Arab nations during his first term stand as evidence of his capacity to navigate com-plex diplomatic waters.\n\nA recent conversation with a childhood friend of mine, a Ni-gerian-American who now lives in the U.S. and who is among the early voters for Trump, added a personal angle to my understand-ing of Trump’s appeal. He argued passionately that Trump is the only leader who can re-order the world if given another chance. “Trump’s approach may be un-conventional, but he’s a strong leader, and that’s what the world needs right now,” he said, refer-ring to Trump’s foreign policies and economic strategies. He emphasized that Trump would not just focus on making Amer-ica stronger, but that his leader-ship would create a ripple effect across the globe, forcing nations to re-evaluate their alliances and trade partnerships in a way that would lead to more stability.\n\n“Trump understands how to negotiate from a position of strength,” my friend contin-ued, “and that’s what it takes to bring peace in today’s world. He doesn’t back down to threats. Look at North Korea, look at the Middle East—he made progress where others failed.” For him, Trump’s ability to challenge the global order was not a threat, but a necessary move to make last-ing changes. “He’s willing to do what it takes, even if it means shaking things up. That’s how peace is made in the long run,” he concluded.\n\nHearing this from someone who had experienced life both in Nigeria and the U.S., and who had been a part of both political systems, gave me a deeper insight into why Trump’s leadership still resonates with so many, even those living outside the U.S.\n\nBenefits of a Trump Presidency for Nigeria\n\nFor Nigeria, a Trump presiden-cy could offer several benefits, particularly in the realm of elec-toral transparency and fairness. One cannot forget how, during President Obama’s administra-tion, Nigeria was pressured into a political change that has had lasting effects. In 2015, Obama played a crucial role in ensuring that then-President Goodluck Jonathan conceded defeat to Muhammadu Buhari, ushering in an era that many Nigerians now look back on as harrowing. Buhari’s eight years in power have been marked by economic decline, security challenges, and widespread dissatisfaction. The pressure from the Obama admin-istration left Nigeria with a gov-ernment that many argue was not equipped to lead the country into a more prosperous future.\n\nFurthermore, under Biden’s administration, Nigeria has wit-nessed a frustrating lack of trans-parency concerning the political rise of Bola Tinubu, the current president. Despite numerous questions surrounding Tinubu’s background and qualifications, the Biden administration has not taken any decisive steps to push for clarity. This inaction has al-lowed a lack of accountability to fester, with many Nigerians feel-ing that their voices have been drowned out by the global powers at play.\n\nA Trump presidency, however, would likely bring a different ap-proach. Trump has demonstrated a willingness to challenge global institutions and insist on fairness and transparency. For Nigeria, this could mean a presidency that does not tolerate election rigging, corruption, or manipu-lation by external forces. Trump’s insistence on “America First” policies may extend to demand-ing that other nations, including Nigeria, adhere to principles of equity, fairness, and probity in their elections.\n\nMoreover, Trump’s track record shows that he is not afraid to ques-tion the status quo, which could lead to more international pres-sure on African leaders to uphold democratic values. Unlike Biden, Trump’s administration might not turn a blind eye to electoral irregularities or refuse to address concerns about leaders like Tinu-bu. Instead, Trump’s presidency would likely advocate for a more transparent, accountable, and just political system in Nigeria, fostering a democracy where the people’s voices truly matter.\n\nAs November 5 draws clos-er, one cannot help but feel that the political winds are blowing toward a Trump resurgence. De-spite the controversies surround-ing him, Trump has shown an un-shakable resilience. His message of putting “America First,” his promises of a stronger economy, and his ability to challenge the status quo resonate deeply with a large portion of the American electorate.\n\nIn a world fraught with conflict, media manipulation, and social division, many believe that only a Donald Trump presidency can re-store a sense of order. Whether it is reining in the influence of a bi-ased media, addressing America’s cultural and moral dilemmas, or brokering peace in conflict zones, Trump’s unorthodox approach may be exactly what is needed to steer the world back toward peace and tranquility.\n\nAs the final votes are cast on November 5, it’s looking Donald Trumpish. And for his support-ers, that’s exactly the outcome they are hoping for.\n\nDennis Olise, a political analyst, wrote in from Lagos.","summary":"As the American general elections approach on November 5, the polit­ical environment is as turbulent as ever. The race for the White House has taken on an unpredictable turn, dominat­ed by polarizing debates, media bias, and unprecedented events that are shifting public opinion in ways never seen before. One of the most striking as­pects of [&#8230;]","url":"https://independent.ng/us-november-5-election-its-looking-donald-trumpish/","image":"https://independent.ng/wp-content/uploads/Kamala-Harris-and-Donald-Trump.jpg","video":null,"publish_date":"2024-10-26 23:16:00","author":"Ottih Chinedu","authors":["Ottih Chinedu"],"language":"en","category":"politics","source_country":"ng","sentiment":0.244},{"id":261226724,"title":"Trajectory of Harris Campaign Not Headed in Good Direction","text":"NBC elections analyst Steve Kornacki runs down the results of a new CNBC poll giving Donald Trump a 48-46 lead over Kamala Harris nationally, and Harris a negative ten popularity rating, 10 days before the 2024 election.\n\nSTEVE KORNACKI, NBC NEWS: This is what the CNBC poll finds: Trump 48 to 46 over Harris.\n\nThere is a breakout here just of the seven core battleground states. It's not quite as extensive a pool of voters, so the margin of error for just the battleground states is a little bit higher. But what the seven battleground state result shows is Trump at 48% across those seven states and Harris at 47% across those states.\n\nNow, obviously, they don't vote as a bloc; they vote individually. So just to give you a sense, though, in the battlegrounds, it\u0019s a result that looks like the national result here, although even a point closer.\n\nSo, you know, a notable finding that way. I think the bigger picture story is this was suggested as well in our own NBC poll recently. In the CNBC poll, it asks about the basic perception of the two candidates: Do you have a positive or negative feeling toward Trump or toward Harris?\n\nAnd you can see right here, neither one of them has a greater positive than negative; they're both not that popular. But Trump, you can see the gap here, 42 positive, 48 negative. He is six points underwater on this question. Harris: 39 positive, 49 negative. She's 10 points negative on this question.\n\nAnd the significance here is the trajectory of the Harris campaign on this sort of feelings thermometer. When she first got in the race, when she first entered, she was, you know, basically in the same ballpark as Trump on positive and negative.\n\nAfter about six weeks as a candidate, she had actually, in our poll, moved above water on this question. A couple of weeks ago, we were polling this, and she had a higher positive than negative and had established an advantage. But now, our own NBC poll a couple weeks ago and now this CNBC poll both find that the advantage she seemed to have established here, you know, say back in September on this question, is gone. She's back in that underwater territory with Trump again.\n\nAnd again, you take that and you look at the national result of Trump ahead by two. There's probably a linkage between these things.\n\nRelated Topics: Harris Campaign, Election 2024, MSNBC, Kamala Harris, Steve Kornacki\n\n Show comments\n Hide Comments \n\n Send Tips\n\n Follow Us\n\n Latest Political Videos\n\n In The News\n\n David Brooks: Voters Don't Take The Fascism Claim Seriously Because Trump Was Already President, Wasn't A Fascist\n\n Kornacki: Harris No Longer More Popular Than Trump In New CNBC, NBC Polls\n\n Vance: Don't Cast Aside Friends And Family Members Over Politics, \"Not Worth It\"\n\n CNN's Enten: Trump Has A Real Shot At Winning Popular Vote, Start Mentally Preparing For The Possibility\n\n Mark Levin: Democrats Are Already Plotting To Cripple A Trump Presidency, \"These People Are Revolutionaries\"\n\n Most Popular VideosMost Popular VideosPolitical VideosIn The NewsCHANGING LANESRC Original Video RealClearPolitics: Kamala on CNN, Swing State Polls, Third Party Candidates Debate, Are Men Ready for a Woman President?CNN's Enten: Rising Support Among Independent Voters Good Sign For TrumpVance: Don't Cast Aside Friends And Family Members Over Politics, \"Not Worth It\"Halperin: I'm Not Saying Trump Is Going To Win In A Landslide, But He Is Very Active In NM, MN, VA & NHFull Video: Donald Trump On \"Joe Rogan Experience\"CNN's Enten: Trump Has A Real Shot At Winning Popular Vote, Start Mentally Preparing For The PossibilityBret Baier House & Senate Electoral Map: Trump's Popularity In Ohio Is Lifting Moreno's Senate CampaignHalperin: Polling Continues To Trend For Trump, Democrats Are Feeling There's \"No Time Left\" For Harris To Get BetterTom Bevan: Trump Holds Slim Lead In Key Battleground StatesYou may like\nHerbeautyKhloe Kardashian Regrets \"Tramp Stamp\" TattooHerbeautyHerbeautyHerbeautyHollywood Isn\u0019t The Easiest Place To Navigate - Ask These Stars!HerbeautyHerbeautyBrainberriesAncient Rome: Stunningly Preserved Bronze Statues Found In ToledoBrainberriesBrainberriesHerbeautyAt 9 Years Old, This Young Girl Dazzled The World Of FashionHerbeautyHerbeauty\n\n Video Archives\n\n Popular in the Community\n\n PoliticsPolicyMarketsWorldDefenseEnergyHealthScienceReligionInvestigationsEducationFoundationHistoryBooks & CulturePublic AffairsFloridaPennsylvania\n\n Privacy Policy\n Advertise With Us\n\n View Mobile Site\n\n Copyright � 2024 RealClearHoldings, LLC. Do Not Sell My Personal Information\n\n �2024 RealClearPolitics | Go to full site","summary":"","url":"https://www.realclearpolitics.com/video/2024/10/26/kornacki_after_six_weeks_as_candidate_harris_is_less_popular_than_trump_in_new_cnbc_poll.html","image":"https://assets.realclear.com/images/66/667629_5_.jpg","video":null,"publish_date":"2024-10-26 23:07:22","author":"MSNBC,Steve Kornacki,Tim Hains","authors":["MSNBC","Steve Kornacki","Tim Hains"],"language":"en","source_country":"US","sentiment":-0.14},{"id":261226728,"title":"Trump Is a Fascist. A Clear and Present Danger to the Country","text":"Hillary Clinton sounded the alarm that Donald Trump is a fascist during an interview Thursday night with CNN's Kaitlan Collins: \n\nKAITLAN COLLINS, CNN: Do you agree with John Kelly, with Vice President Harris, that Donald Trump does meet the definition of a fascist?\n\nHILLARY CLINTON: Kaitlan, I do. And it's not only people like former Chief of Staff, Marine General John Kelly, who is telling us this and warning us.\n\nIt's people, who have really studied what fascism is and what fascist leadership looks like. People, like Professor Timothy Snyder. People, like former professor Paxton, who just recently came out and said that he had studied fascism during the war, particularly the Nazis, Vichy France, and he had been reluctant to use the term. But he had concluded, as so many people now are, that, sadly, here in America, the term fits.\n\nOne other thing that you'll see next week, Kaitlan, is Trump actually reenacting the Madison Square Garden rally in 1939. I write about this in my book. President Franklin Roosevelt was appalled that neo-Nazis, fascists, in America, were lining up to essentially pledge their support for the kind of government that they were seeing in Germany. So, I don't think we can ignore it. Now, it may be a leap for some people, and a lot of others may think, I don't want to go there, I don't want to say that. But please, open your eyes to the danger that this man poses to our country, because I think it is clear and present for anybody paying attention.\n\nCOLLINS: Yes, you write in your book about Lindbergh, and just how he was viewed in the U.S. as such a hero, and what that would have looked like, had Pearl Harbor not have happened. You're looking back at the history of this country.\n\nBut to hear such a significant statement, like that one, from -- you make a good point, not just people who've studied it, but from General Kelly, who worked very closely with Donald Trump. Obviously, General Milley did as well.\n\nBut I think when you hear that, and then you look at it from a campaign perspective, there have been people, who have said for years that they do believe Donald Trump has fascist tendencies, or is a fascist, just outright himself. I think the question is, does it reach voters that Harris needs to reach right now. How do you see that?\n\nRODHAM CLINTON: I think that's a fair question, Kaitlan, and I can't wholly answer it.\n\nBut I think, number one, you have a duty, when you're running for president. I tried to sound the alarm about him, back in 2016. But it was really an uphill climb, because people could not literally imagine that he posed a danger, or that his character was so lacking, when it came to the responsibility of being President. So, I totally understand that. But now, there's just too much evidence about what he wants to do, what he is saying he wants to do.\n\nSo, number one, I think that someone running for president, like Vice President Harris, really has a duty to sound the alarm.\n\nAnd secondly, I think that there are people, who are still paying attention. Maybe they're leaning one way or the other. And they hear John Kelly, or they hear General Milley, or they hear President Obama, or Vice President Harris. And it causes them to think really hard, Why would we take that risk?\n\nAnd so, I think that, sometimes in politics, you've got to do what is not only right, but important. And it is important to make a case, as well as we can, before this election, about what kind of man this is, and what kind of President he is promising to be.\n\nRelated Topics: Hillary Clinton, Fascism, Election 2024, Harris Campaign, CNN\n\n Show comments\n Hide Comments \n\n Send Tips\n\n Follow Us\n\n Latest Political Videos\n\n In The News\n\n David Brooks: Voters Don't Take The Fascism Claim Seriously Because Trump Was Already President, Wasn't A Fascist\n\n Kornacki: Harris No Longer More Popular Than Trump In New CNBC, NBC Polls\n\n Vance: Don't Cast Aside Friends And Family Members Over Politics, \"Not Worth It\"\n\n CNN's Enten: Trump Has A Real Shot At Winning Popular Vote, Start Mentally Preparing For The Possibility\n\n Mark Levin: Democrats Are Already Plotting To Cripple A Trump Presidency, \"These People Are Revolutionaries\"\n\n Most Popular VideosMost Popular VideosPolitical VideosIn The NewsCHANGING LANESRC Original Video RealClearPolitics: Kamala on CNN, Swing State Polls, Third Party Candidates Debate, Are Men Ready for a Woman President?CNN's Enten: Rising Support Among Independent Voters Good Sign For TrumpVance: Don't Cast Aside Friends And Family Members Over Politics, \"Not Worth It\"Halperin: I'm Not Saying Trump Is Going To Win In A Landslide, But He Is Very Active In NM, MN, VA & NHFull Video: Donald Trump On \"Joe Rogan Experience\"CNN's Enten: Trump Has A Real Shot At Winning Popular Vote, Start Mentally Preparing For The PossibilityBret Baier House & Senate Electoral Map: Trump's Popularity In Ohio Is Lifting Moreno's Senate CampaignHalperin: Polling Continues To Trend For Trump, Democrats Are Feeling There's \"No Time Left\" For Harris To Get BetterTom Bevan: Trump Holds Slim Lead In Key Battleground StatesYou may like\nBrainberriesThis Bug Lives In Water, And Is Giant!BrainberriesBrainberriesHerbeautyWomen Love These Great Tips To Making Your Teeth Look WhiterHerbeautyHerbeautyBrainberriesPlus-Size Babes Who Will Make Your Heart RaceBrainberriesBrainberriesBrainberriesWhat Bones Actors Have Been Up To Since The Show's Final EpisodeBrainberriesBrainberries\n\n Video Archives\n\n Popular in the Community\n\n PoliticsPolicyMarketsWorldDefenseEnergyHealthScienceReligionInvestigationsEducationFoundationHistoryBooks & CulturePublic AffairsFloridaPennsylvania\n\n Privacy Policy\n Advertise With Us\n\n View Mobile Site\n\n Copyright � 2024 RealClearHoldings, LLC. Do Not Sell My Personal Information\n\n �2024 RealClearPolitics | Go to full site","summary":"","url":"https://www.realclearpolitics.com/video/2024/10/25/hillary_clinton_please_open_your_eyes_to_the_clear_and_present_danger_fascist_trump_poses_to_this_country.html","image":"https://assets.realclear.com/images/66/667530_5_.jpg","video":null,"publish_date":"2024-10-26 23:07:21","author":"CNN,Hillary Clinton,Tim Hains","authors":["CNN","Hillary Clinton","Tim Hains"],"language":"en","category":"politics","source_country":"US","sentiment":-0.533},{"id":261226726,"title":"Democrats Are the Party of Hate, Bitterness & The Machine","text":"Tucker Carlson spoke Wednesday night at a Turning Point Action even with Donald Trump in Georgia: \n\nTUCKER CARLSON: The story the country tells itself about reality has flipped. None of the normal people are supporting the Democratic Machine. Tim Walz is supporting the Democratic Machine -- a man you would never allow to babysit your own children. That's the archetype. \n\nIt's the party of weirdos, envy, hate, resentment, bitterness, weakness, and a total lack of creativity. It's a party of conformity, the party of the machine, where it doesn't matter who the candidate is because individuals are immaterial. All that matters is the collective. That's the Soviet model, and opposing them is the rest of the country, slowly waking up to the fact that these people have no moral authority whatsoever. \n\nThey have no legitimacy in a democracy where the government must rule by the consent of the governed. They have no consent. The way they've treated this country over the past four years is the most shocking thing I've ever seen in 55 years: to allow millions of people, mostly young men with no skills and no English, into our country illegally, then fly them around at our expense, give them phones, and put them on welfare\u0014programs that no American citizen can get. It is the most insulting thing imaginable.\n\nYes, boo, but it's worse than \"boo.\" That's the biggest crime in the history of the United States of America. It takes incredible stones, incredible gall, for the people who did that to stand up on a stage and give you a lecture about how you're immoral. It's too much!\n\nThat's the second important thing about this election. The first is that every person in this room needs to understand you are not in a despised minority. You are in an incredibly gentle and tolerant majority who put up with this crap for way too long, as they insulted not only you, but the memory of your ancestors who died for this country. They tore down statues to their memory -- people who have never built anything in their lives. They went out of their way to humiliate you and spit on you, and on the graves of your ancestors. And that's not an exaggeration. They did that.\n\nThis country is so nice, it's so polite, it's so thoughtful and empathetic and sweet -- it's the kind of country that loves dogs and gives directions to strangers -- that we put up with it for four years. But we can't anymore. We just can't.\n\nYou can watch his full speech here","summary":"","url":"https://www.realclearpolitics.com/video/2024/10/24/tucker_carlson_democrats_are_the_party_of_weirdos_resentment_weakness_and_conformity.html","image":"https://assets.realclear.com/images/66/667388_5_.jpg","video":null,"publish_date":"2024-10-26 23:07:17","author":"Tim Hains,TPAction,Tucker Carlson","authors":["Tim Hains","TPAction","Tucker Carlson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.257},{"id":261226620,"title":"Michelle Obama Blasts Donald Trump’s ‘Gross Incompetence’ at Kamala Harris Rally","text":"She says Trump’s showing obvious mental decline, erratic behavior and cites his felony record as other reasons he shouldn’t win four more years in the White House. Basically, Obama left no insult in the proverbial quiver during this rally.","summary":"Play video content Michelle Obama says Donald Trump&#8216;s not competent enough to be president &#8230; blasting the former prez for the mistakes she feels he made in his first term &#8212; and, saying he straight-up tried to steal the job. The former First Lady of the United States spoke at Kamala Harris&#8216; rally in Kalamazoo, &#8230;\n\n\nThe post Michelle Obama Blasts Donald Trump&#8217;s &#8216;Gross Incompetence&#8217; at Kamala Harris Rally appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/entertainment/michelle-obama-blasts-donald-trumps-gross-incompetence-at-kamala-harris-rally/","image":"https://imagez.tmz.com/image/6d/16by9/2024/10/26/6d7d69f660564f20a789c195d648ae64_xl.jpg","video":null,"publish_date":"2024-10-26 23:07:04","author":"Ashleigh Durden","authors":["Ashleigh Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.374},{"id":261226452,"title":"Michelle Obama Criticizes Men and Calls Trump Senile in Strong Defense of Kamala Harris","text":"Former First Lady Michelle Obama hit the campaign trail for Kamala Harris for the first time on Saturday where she called for a ‘grown up in the White House’ and blasted Donald Trump for lies, childish antics and moral decline before making an emotional appeal directly to men.\n\nHer appearance in Kalamazoo. Michigan comes as polls show the presidential race in a dead heat with just ten days to go before the election.\n\nThe former first lady questioned why Harris is being held to a higher standard and must prove she belongs.\n\n‘But for Trump we expect nothing at all, no understanding of policy, no ability to put together a coherent argument, no honesty, no decency, no morals.’\n\nShe said too many people are willing to write off his ‘childish, mean-spirited antics.’\n\nObama accused ex-president for ‘gross incompetence’ while people ask Harris to ‘dazzle’ at every turn.\n\nShe also highlighted what she called Trump’s obvious mental decline, slammed him being a convicted felon and noted he was found liable of sexual assault.\n\nObama said Harris ‘dominated her opponent so thoroughly in the debate he was too scared to face again.’\n\n‘Why on earth is this race even close?’ the former first lady asked as the crowd went wild.\n\nObama said she lays awake at night wonder ‘what in the world is going on? She said Harris has demonstrated she’s ready but asked: ‘as a country, are we ready for this moment?’\n\nThe former first lady said she fears for the country and its children if people forget the stakes in the election. \n\nShe said if Trump becomes president, at some point ugliness will touch everyone’s lives.\n\nObama said she was out campaigning in Michigan because of that fear reminding the crowd she was doing so even though ‘you all know I hate politics.’\n\nHer remark received some laughs as people once called for the former first lady herself to run for president should President Biden end his bid. She previously ruled it out. \n\nHalfway through her speech, the former first lady took an extremely somber note when she pleaded for men not to leave women’s lives in the hands of politicians when it comes to reproductive health care with the overturning of Roe v Wade.\n\nObama went through graphic details of the dangers of being pregnant and childbirth as well as other health challenges women face. She explained the threats of infection and women potentially bleeding out. \n\nShe warned of the chilling effects dismantling the reproductive health care system with the overturning of Roe have had, not just on abortion care but on the entire women’s health care system.\n\nObama also painted a specific picture of how the threats to women’s health will impact the men who love them.\n\n‘I am asking ya’ll from the core of my being to take our lives seriously please,’ she said. ‘Do not put our hands in the lives of politicians, mostly men who have no clue or do not care about we as women are going through.’\n\nShe said ‘please do not hand our fates over to the likes of Trump who knows nothing about us, who has shown deep contempt for us because a vote for him is a vote against us, against our health, against our worth.’\n\nShe told men before casting their votes to ask themselves what side of history do they want to be on and urged those fed up not to sit out the election because women will become collateral damage.\n\nObama also beseeched women to demand the men in their lives do better by them and remember ‘we are more than just baby-making vessels.’\n\nShe said if they are in a household where a man does not value them or their opinion ‘just remember that your vote is a private matter.’\n\nAs the former first lady spoke, she received thunderous applause at times from the energized crowd while attendees passionately nodded along during her deeply emotional appeal. \n\nAt one moment the former first lady even appeared to wipe away a tear. \n\nObama wrapped up her speech by welcoming Harris to the stage where they shared a moment hugging as the arena shook with applause. \n\nTaking the stage, the vice president joked about campaigning in ‘Kamala-zoo.’ \n\nDuring her speech, Harris spoke of being a prosecutor and attorney general and taking on predators and fraudsters and winning. \n\n‘Well in ten days, it’s Donald Trump’s turn,’ she said. It received one of the biggest cheers from the crowd. \n\nEarly in-person voting in Michigan kicked off on Saturday. But more than 1.4 million Michiganders had already voted early by mail in the swing state.\n\nThe latest Quinnipiac poll shows Harris with a four-point lead in Michigan among likely voters including a whopping twenty-point lead among women. But the average of polls shows Trump with a less than half a point lead in the state.\n\nVoters showing up to cast ballots in Kalamazoo on Saturday faced more than an hour wait times to vote. Some decided to try voting another time upon finding out how long they would have to stand in line.\n\nKalamazoo County is a blue county which Biden won in 2020 with more than 58 percent of the vote.\n\nBut Harris will still need to run up the vote in blue areas in order to win the state which went to Trump in 2016 before swinging back to blue in 2020.\n\nJessica Hayback of Kalamazoo showed up at 9:30 am to wait in line. She said she came out because she has hope.\n\n‘I’ve loved Michelle Obama. I’m a big Harris supporter,’ she said. ‘It’s sort of an iconic moment.’\n\nShe is supporting the vice president because she wants an ‘ethical candidate that can represent us with some decency and bring some sanity back to American politics.’\n\nHayback also mentioned abortion rights and Harris’ economic policy ideas.\n\nRuby Hodge, 74, said she came out for the rally to be part of a movement she believes will be beneficial for her grandchildren and young people. She said she is hopeful in Michigan.\n\n‘The issues she espouses, they speak to me. I believe in her sincerity, her honesty. When I listen to her, I cry, I really do,’ Hodge said of the vice president.\n\n‘She is taking it upon herself. She is saying “here I am. I will do this.” And I think she can – I know she can,’ she said.\n\nThis is the former first lady’s first appearance on the campaign trail with Harris, but her speech at the Democratic National Convention was a smashing hit over the summer when she delivered a brutal takedown of Trump while praising the vice president.\n\nIt was widely considered one of if not the best addresses in Chicago.\n\n‘Kamala Harris is more than ready for this moment,’ Obama said. ‘She is one of the most qualified people ever to seek the office of the presidency.’\n\nObama also turned her wrath on Trump with one of the most blistering responses to the ex-president.\n\n‘For years, Donald Trump did everything in his power to try to make people fear us,’ Obama said. ‘His limited and narrow view of the world made him feel threatened by the existence of two hardworking, highly educated, successful people who also happened to be Black.’\n\nShe called Trump a con, misogynistic and racist. One of her zingers about the ex-president went viral.\n\n‘Who’s going to tell him that the job he’s currently seeking might just be one of those “Black jobs”?’\n\nHer husband former President Obama has been hitting the campaign trail for Harris across battleground states. He held his first rally with the vice president on Thursday in Atlanta.\n\nThe former first couple endorsed Harris for president just days after President Biden exited the race with a video featuring a call they had with the vice president.\n\nBefore the rally in Kalamazoo, Harris made a stop at a local doctor’s office in Portage to meet with reproductive health care providers and medical students.\n\nOn Friday, she made a major speech on reproductive freedom with an introduction from Beyonce as abortion rights remains a motivating issue for Democrats since the overturning of Roe v Wade.\n\nAt the rally on Saturday, a series of other Michigan Democratic leaders also took the stage in Kalamazoo.\n\nSenator Gary Peters delivered a speech where he read off quotes from former Trump administration officials criticizing the Democratic presidential nominee.\n\nHe also touted the recent endorsement of Harris by former longtime Republican Michigan Congressman Fred Upton.\n\nThe support from the GOP Michigander comes as Harris has been courting moderate Republicans and Independents on the campaign trail.","summary":"Former First Lady Michelle Obama hit the campaign trail for Kamala Harris&#8230;","url":"https://internewscast.com/news/us/michelle-obama-criticizes-men-and-calls-trump-senile-in-strong-defense-of-kamala-harris/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Michelle-Obama-rips-into-men-and-calls-800x430.jpg","video":null,"publish_date":"2024-10-26 23:03:22","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013},{"id":261226650,"title":"Musk briefly worked illegally in US in 1990s: report","text":"The Washington Post is reporting that South African-born billionaire businessman Elon Musk worked illegally in the United States during a brief period in the 1990s while building a startup company.\n\nThe Post reported that Musk arrived in Palo Alto, California, in 1995 to attend Stanford University but never enrolled in his graduate studies program there.\n\nInstead, he developed software company Zip2, which sold in 1999 for around $US300 million ($A454 million), according to the outlet.\n\nTwo immigration law experts quoted by the Post said Musk would have needed to be enrolled in a full course of study in order to maintain a valid work authorisation as a student.\n\nMusk did not respond to requests for comment sent to four of his companies - SpaceX, Tesla, the social media company X and The Boring Company - nor did Musk's lawyer Alex Spiro.\n\nMusk in a 2020 podcast cited by the Post said: \"I was legally there, but I was meant to be doing student work. I was allowed to do work sort of supporting whatever\".\n\nThe Washington Post cited two former Musk colleagues who recalled Musk receiving his US work authorisation in or around 1997.\n\nMusk has endorsed Republican presidential candidate Donald Trump in the November 5 US election.\n\nTrump has for years portrayed migrants as invaders and criminals, and during his 2017-2021 presidency took stringent steps to curb legal and illegal migration.\n\nHe is promising the biggest deportation effort in US history if he is re-elected.","summary":"South African-born tech entrepreneur and billionaire Elon Musk worked illegally in the United States in the 1990s, The Washington Post says in a report.","url":"https://thewest.com.au/news/crime/musk-briefly-worked-illegally-in-us-in-1990s-report-c-16535853","image":"https://images.thewest.com.au/publication/C-16535853/f0e722412ad3353d21bbf5cb122cdbb18e096e69-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-10-26 23:02:28","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.278},{"id":261226400,"title":"‘Frustrated’ Michelle Obama worries US will ‘blow this opportunity’ during first campaign trail appearance for Kamala Harris","text":"A “frustrated” Michelle Obama attacked Donald Trump during her first campaign trail appearance for Kamala Harris, worrying that the US “will blow this opportunity to finally turn the page on the ugliness” by re-electing the former president.\n\nThe former first lady did not shy away from slamming the 45th president and his supporters alike during an impassioned speech at Harris’ rally in Kalamazoo, Mich. — her first time stumping for the vice president since the Democratic National Convention in August. \n\nTrump supporters and undecided voters hold Harris to a high and unfair double standard while letting the ex-commander in chief coast with little criticism, Obama claimed.\n\n“I hope you’ll forgive me if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence while asking Kamala to dazzle us at every turn,” Obama, 60, told the crowd.\n\n“I hope that you will forgive me if I’m a little angry that we are indifferent to his erratic behavior, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse — all of this while we pick apart countless answers from interviews that he doesn’t even have the courage to do.”\n\nObama pointed to the growing list of former Trump allies who have jumped from the MAGA ship in recent years as proof of the ex-president’s incompetence — including his former chairman of the joint chiefs of staff who labeled the politician as a “fascist.”\n\nThe former first lady also went after those choosing to abstain from the 2024 presidential election, claiming that their disregard equates to casting a vote for Trump.\n\n“I hope that you will forgive me if I am worried that we will blow this opportunity to finally turn the page on the ugliness once and for all. Because believe me, if Donald Trump is president again at some point or another, that ugliness will touch all of our lives,” Obama said. \n\n“It will not matter what you look like, how you worship, who you love, or how you vote — if you don’t make six or eight or 12 figures, if you’re not famous, if you criticize or disagree with him in any way, If he doesn’t view you as his equal or relevant to his ambitions. I promise you, He will not think about you when he gets into the Oval Office, and that will have real consequences for all of us.”\n\nHarris continued the Trump flaying when Obama welcomed her onto the rally stage.\n\nThe veep snuck in several digs while touting her resume as a courtroom prosecutor, district attorney and California’s attorney general.\n\n“In those roles, I took on perpetrators of all kinds: creditors, fraudsters and repeat offenders. I took them on and I won,” the Democratic presidential nominee said.\n\n“Well, Michigan. In 10 days, it’s Donald Trump’s turn.”\n\nAlthough familiar, the dig resulted in an eruption of cheers throughout the Wings Event Center.","summary":"\"Believe me, if Donald Trump is president again at some point or another, that ugliness will touch all of our lives.\"","url":"https://nypost.com/2024/10/26/us-news/michelle-obama-worries-us-will-blow-this-opportunity-at-kamala-harris-rally/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92457199.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/h0PsAlK2-RyIcpnTz.mp4","publish_date":"2024-10-26 23:01:47","author":"Katherine Donlevy","authors":["Katherine Donlevy"],"language":"en","source_country":"us","sentiment":0.001},{"id":261229872,"title":"Harris bets on women and young voters in campaign’s final sprint","text":"More than 31 million Americans have already cast their ballots in a presidential race that at times feels like it will never end. Both campaigns are now sifting through the early return data with the hope of better understanding how crucial swing state voters will behave on Election Day.\n\nFor now, those early voting numbers favor Democrats by the slightest of margins, with 43% of early ballots submitted by registered Democrats compared to just 39% for registered Republicans. But drawing insight from early voting is a risky proposition, especially when Election Day turnout remains a significant unknown. That hasn’t stopped the Vice President Kamala Harris’ campaign from touting their above-average performance among two key demographics: women and younger voters.\n\nThe campaign has been open about the fact that rallying women and young people is a critical element of the Democratic nominee’s victory strategy. Here’s what the data tells us right now, and what it could mean for both candidates as the presidential contest races to a conclusion on Nov. 5.\n\nThe Harris campaign can take some comfort in the fact that women—and especially Gen Z and millennial women—are still showing up to the polls at record-breaking levels two years after the Supreme Court’s decision to overturn Roe v. Wade. According to data compiled by NBC News, nearly 900,000 more women than men have cast early ballots across seven key swing states. But state turnout numbers aren’t created equal. \n\nIn must-win Pennsylvania, for example, women have outpaced men in early voting returns by an eye-popping 13 points. Women are also posting historic early turnout margins in Michigan (+14), Wisconsin (+12), Georgia (+12) and North Carolina (+9). But the Harris campaign’s eyes remain fixed on Nevada, where for the first time men outnumber women in early turnout by 3 points. \n\nNevada remains a headache for Harris’ field team. Four years of GOP efforts to warm their supporters to early voting seem to be paying off, with registered Republicans taking a 4-point lead in overall early election returns. That’s normally an area where Democrats thrive, yet early indicators point to a nail-biter of a race that Nevada election experts say is a warning sign for Harris. If Nevada falls into Republican nominee Donald Trump’s column on election night, Harris’ path to victory will depend almost entirely on capturing Pennsylvania. \n\nOne major wild card: Nevada’s ballot referendum enshrining abortion rights into the state constitution. Those types of state measures have previously bolstered Democratic Election Day turnout, and it’s no coincidence that Harris’ field operation in the Silver State is now focusing heavily on abortion messaging. That’s a smart play, because a slate of new polls indicates abortion is the most effective issue for engaging both women and younger voters.\n\nA new NBC News poll finds that fully one-half of younger voters support Harris, compared to just one-third who support Trump. That in itself isn’t surprising. But the gender breakdowns—and the issues motivating younger voters—tell a story that should have Republicans concerned. Nearly 60% of Gen Z women support Harris, who also draws a slight majority of support (42% vs 40%) among young men. \n\nA CNBC/Generation Lab survey found similar numbers, with Harris leading Trump by 20 points among younger Americans. That’s a huge leap from July, when Harris led Trump by 13 points. Those young voters are also more issue savvy than prior polling would suggest, and they are ready to cast their ballots for pro-abortion candidates.\n\nThe NBC News poll found that young women now rank abortion as the second most important issue behind the economy and inflation. More importantly, about one-half (48%) of women now say they would never vote for a candidate who opposes reproductive freedom. That’s a strong indicator that voter anger over the Supreme Court’s 2022 Dobbs decision remains high, and historical data tells us that voters furious over losing reproductive freedom are more motivated than the average voter to cast a ballot either early or on Election Day. When their state also has an abortion measure on the ballot, those numbers leap even higher.\n\nThe Associated Press found similar levels of enthusiasm for reproductive freedom among women and young voters in North Carolina, a state the Trump campaign clearly fears it could lose. Trump spent much of the past week campaigning in North Carolina. Harris has also invested heavily in North Carolina, both in terms of advertising dollars and campaign stops in Raleigh and Greenville earlier this month.\n\nNow Harris faces a bigger challenge: bringing out younger voters on Election Day. That has proven difficult in past election cycles, with Gen Z and millennial turnout lagging behind their older Gen X and Baby Boomer peers. But there are encouraging signs that the trend is shifting. 2022 marked Gen Z’s first midterm election, and America’s youngest voters made their electoral debut with higher turnout than past generations. \n\n“Historical turnout data confirm that today’s young people are among the most electorally engaged in recent decades,” says the Center for Information and Research on Civic Learning and Engagement. “31% of young people under age 30 voted in 2022. That’s the third-highest youth turnout in a midterm cycle in the past 50 years.”\n\nStill, challenges remain. Roughly one-third (32%) of young voters told CNBC/Generation Lab pollsters that they “still were not sure where and how they would vote.” Another one-third said they would wait until Election Day to cast ballots. That makes Harris’ field operation an absolutely critical element of her swing-state strategy. If those young voters end up skipping Election Day, their absence could easily cost Harris her razor-thin advantages in Michigan, Wisconsin, and North Carolina.\n\nSo, what is the state of the race? Unfortunately for Harris, the 2024 presidential contest is still defined by narrow margins and coin-flip swing states. \n\nBut unlike Trump, who has largely outsourced his voter engagement operation to bumbling billionaires like X CEO Elon Musk, Harris can take some comfort in the fact that her core message clearly resonates with her target voter groups. In a race likely to be decided by a few thousand votes spread across seven swing states, that could make all the difference.","summary":"More than 31 million Americans have already cast their ballots in a presidential race that at times feels like it will never end. Both campaigns are now sifting through the early return data with the hope of better understanding how crucial swing state voters will behave on Election Day.\n\n\n\nFor now, those early voting numbers favor Democrats by the slightest of margins, with 43% of early ballots submitted by registered Democrats compared to just 39% for registered Republicans. But drawing insight from early voting is a risky proposition, especially when Election Day turnout remains a significant unknown. That hasn’t stopped the Vice President Kamala Harris’ campaign from touting their above-average performance among two key demographics: women and younger voters.\n\n\n\nThe campaign has been open about the fact that rallying women and young people is a critical element of the Democratic nominee’s victory strategy. Here’s what the data tells us right now, and what it could mean for both candidates as the president","url":"https://www.dailykos.com/story/2024/10/26/2279587/-Harris-bets-on-women-and-young-voters-in-campaign-s-final-sprint?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1360075/story_image/GettyImages-2179998290.jpg?1729895704","video":null,"publish_date":"2024-10-26 23:00:04","author":"Max Burns","authors":["Max Burns"],"language":"en","source_country":"US","sentiment":-0.213},{"id":261230114,"title":"LA Times Non-Endorsement of Kamala Harris Is Due to Biden-Harris Admin's Stance on Gaza War","text":"The daughter of the Los Angeles Times‘s owner explained that the paper’s non-endorsement of Vice President Kamala Harris was based on the Biden-Harris administration’s stance on the ongoing war between Israel and Hamas in Gaza.\n\nNika Soon-Shiong, 31, daughter of Patrick Soon-Shiong, the owner of the Los Angeles Times, explained to the New York Times that her family made a “joint decision” to not endorse either Harris or former President Donald Trump.\n\n“Our family made the joint decision not to endorse a presidential candidate,” Nika Soon-Shiong told the outlet. “This was the first and only time I have been involved in the process. As a citizen of a country openly financing genocide, and as a family that experienced South African Apartheid, the endorsement was an opportunity to repudiate justifications for the widespread targeting of journalists and ongoing war on children.”\n\nIn response to his daughter’s statement, a spokeswoman for Patrick Soon-Shiong told the outlet that the owner’s daughter “speaks in her own personal capacity,” adding that she did “not have any role” with the paper and did not “participate in any decision or discussion with the editorial board.”\n\nAs Breitbart News’s Wendell Husebo previously reported, the Times, which is Harris’s hometown newspaper, announced that it would not be endorsing Harris or Trump in the presidential election. The paper has previously endorsed President Joe Biden, former President Barack Obama, and former Secretary of State Hillary Clinton.\n\nDays after the Times‘s non-endorsement of Harris, the Washington Post announced that it would also not be endorsing a presidential candidate in the election.\n\nWilliam Lewis, who serves as a publisher and chief executive officer for the Post, wrote in an opinion piece that the newspaper was “returning” to its “roots of not endorsing presidential candidates.”\n\nThe Washington Post will not be making an endorsement of a presidential candidate in this election. Nor in any future presidential election. We are returning to our roots of not endorsing presidential candidates.\n\nThe lack of endorsements from the Los Angeles Times and the Washington Post comes as the Teamsters Union previously declined to endorse a candidate in the election, despite polling that showed almost 60 percent of the union’s members supported Trump, while 34 percent supported Harris.","summary":"The daughter of the Los Angeles Times's owner explained that the paper's non-endorsement of Vice President Kamala Harris was based on the Biden-Harris administration's stance on the ongoing war between Israel and Hamas in Gaza.\n\n\nThe post LA Times Non-Endorsement of Kamala Harris Is Due to Biden-Harris Admin&#8217;s Stance on Gaza War appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/26/la-times-non-endorsement-of-kamala-harris-is-due-to-biden-harris-admins-stance-on-gaza-war/","image":"https://media.breitbart.com/media/2024/10/Los-Angeles-Times-Non-endorsement-of-Kamala-Harris-640x335.jpg","video":null,"publish_date":"2024-10-26 22:58:36","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"us","sentiment":-0.141},{"id":261227542,"title":"Harris allies seek to keep the 'Biden coalition' in the fold","text":"As President Joe Biden fought to remain in the presidential race this summer, advisers often argued there existed a “Biden coalition” — a cohort only the incumbent could hold together. With Vice President Kamala Harris atop the Democratic ticket, there has been a shift in the focus on these voters, like white working-class voters in places like Pennsylvania, seniors and union members. A pro-Harris super PAC has been running a series of ads — in heavy rotation during the Major League Baseball playoffs — featuring testimonials from working-class voters, as well as voters who say they previously backed former President Donald Trump, that echo Biden’s message. A coalition of labor groups targeting union members in battleground states is pointing to Biden’s term in office. Sen. Bernie Sanders, I-Vt., has trained his sights on keeping voters who backed Trump in 2016 and Biden in 2020 in the Democratic camp with a populist, progressive pitch that leans on Biden’s accomplishments. And Minnesota Gov. Tim Walz, Harris’ running mate, has had a campaign itinerary that closely mirrors what Biden’s had been in this and previous election cycles. On Friday in Scranton, Pennsylvania — Biden’s hometown — Walz made the case for a new Democratic candidate by highlighting their shared values. “That patriotism, that fierce patriotism, putting the American people first, is exactly what guides Kamala Harris in the course of her entire career,” Walz said at the same venue where Biden gave an economic address in April. Biden advisers insist that the president continues to reach key constituencies, albeit in a more under-the-radar fashion. On Friday, he held an official event on tribal land in Arizona, talking to a group of voters who helped tip that state for him four years ago. Asked who is making the pitch to Biden voters if not Biden, Sen. Chris Coons, D-Del., answered: “Kamala Harris.” The Harris campaign points to events like a recent stop at a union hall in Lansing, Michigan, where she highlighted the administration’s record on manufacturing and the critical role of organized labor in supporting the middle class. Coons noted the vice president has campaigned in Pennsylvania’s biggest cities, but also in places like Wilkes-Barre, Johnstown and Erie to reach the kinds of voters Biden has long considered his base. The longtime Biden friend said that during his own recent stop in Scranton, he got multiple questions from Democratic supporters about the president, which he in turn used to make a different pitch for getting out the vote for Harris. “Folks, this is simple. If we lose, it will kill him. Literally,” Coons recalled saying. “If we win, nothing will make him happier.” Harris has faced a tough balancing act, demonstrating loyalty while also establishing independence from Biden, who continues to suffer in public opinion polls. She has repeatedly said in the closing weeks that her presidency would not be an extension of his. So the president’s allies say their efforts are critical in ensuring that Biden stalwarts are still hearing about the president’s economic accomplishments. And for some voters whom Biden won in 2020, the message has shifted away from being about him. “The paradox of this moment is that this administration … will go down as one of the most effective and transformative administrations in history,” said Randi Weingarten, president of the American Federation of Teachers. “But there is a difference between what will be seen through a historical lens and what is being seen right now.” Weingarten, noting that Biden tapped Harris to chair his White House Task Force on Worker Organizing and Empowerment, said her union and others are focused on member-to-member messaging where they act as validators for the vice president to voters who aren’t as familiar with her or who might hear countermessaging from Trump supporters. “We know her and we’ve worked with her for the last three and a half years, and we’ve become surrogates for her in terms of who she is and what she’s about,” Weingarten said before an event in Scranton that’s part of her union’s nationwide bus tour. “We’ve become in some ways the people who can say, ‘She is us and she fights for us.’” A series of ads from Future Forward PAC — a group formed to back Biden’s re-election that has pivoted to working to elect Harris — is running ads arguing for tax fairness, a position Biden had put front and center. The ads show a clip of Trump telling campaign donors that they’re “rich as hell” and would get tax cuts if he’s elected. In New Hampshire this week, Biden was joined by Sanders to warn what a Republican administration and Congress would mean for another signature administration accomplishment: allowing Medicare to negotiate lower prescription drug prices. Sanders praised Biden and Harris “for having the courage to be the first administration in the history of this country to stand up to the greed of the pharmaceutical industry.” It was one of two dozen events across the country Sanders has attended since September that were meant to highlight a progressive agenda that’s been partly realized under Biden, including stops at coordinated campaign offices in Nevada with members of the Culinary Workers Union, and with United Auto Workers President Shawn Fain in Michigan. This weekend, Biden will travel to Pittsburgh to meet with members and leadership from LIUNA, which represents 70,000 workers in the construction and energy industry. The union has held rallies and other organizing events there and in Michigan, Wisconsin and Nevada targeting its own and other union members. Behind closed doors this week, Biden has had separate meetings with union leaders in Pennsylvania and Wisconsin to discuss efforts to encourage their members to support Harris. He recorded a video and robocall for the Senate candidate in his home state of Delaware, Rep. Lisa Blunt Rochester. “Biden is achieving more historic results for American families and he maximizes every day in office and traveling the country spotlighting life-changing benefits and Vice President Harris’s role in delivering them,” White House spokesperson Andrew Bates said.","summary":"As President Joe Biden fought to remain in the presidential race this summer, advisers often argued there existed a “Biden coalition” — a cohort only the incumbent could hold together.","url":"https://www.nbcnews.com/politics/2024-election/kamala-harris-allies-seek-keep-biden-coalition-fold-rcna177419","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241036-biden-ch-0944-66666a.jpg","video":null,"publish_date":"2024-10-26 22:55:22","author":"Mike Memoli","authors":["Mike Memoli"],"language":"en","category":"politics","source_country":"us","sentiment":-0.02},{"id":261225978,"title":"Washington Post publisher says he killed Kamala Harris endorsement,  not Jeff Bezos:  report","text":"Washington Post CEO Williams Lewis said he pulled the plug on the paper’s endorsement of Vice President Kamala Harris – amid fierce backlash that owner Jeff Bezos was responsible for the controversial decision. \n\nLewis rejected claims the Amazon billionaire killed the already planned endorsement for the Democratic nominee – breaking 36 years of tradition at the paper – just 11 days before the 2024 election, stressing that he himself is against presidential endorsements. \n\n“Reporting around the role of The Washington Post owner and the decision not to publish a presidential endorsement has been inaccurate,” Lewis said in a statement, according to The Daily Beast. \n\n“He was not sent, did not read and did not opine on any draft. As Publisher, I do not believe in presidential endorsements. We are an independent newspaper and should support our readers’ ability to make up their own minds.”\n\nFriday’s decision – which will also stand for “any future presidential election,” according to Lewis – follows the Los Angels Times, whose billionaire owner, Patrick Soon-Shiong, also declined to issue an endorsement, leading to a flood of resignations from its editorial board. \n\nFollowing the announcement, the newspaper published an article written by two reporters saying that editorial page staffers had already drafted an endorsement for Harris over former President Donald Trump, and were awaiting approval from Lewis and Bezos before it was squashed. \n\nOne WashPo editor, Robert Kagan, has already resigned over the decision, while 2,000 readers canceled their subscriptions within 24 hours, which one staffer said was “an unusually high number,” Semafor reported.\n\nFurious high-profile staffers have also taken to social media blasting Friday’s announcement. \n\n“I didn’t sign up to be a journalist to be silent on what matters most. I didn’t come here to be a coward. Some of us really, truly believe in speaking truth to power. We were betrayed today,” Washington Post columnist Karen Attiah wrote on X Friday.\n\nMarty Baron, the former editor of The Washington Post, called the paper’s decision “cowardice, with democracy at its casualty.”\n\nFamed Watergate reporters Bob Woodward and Carl Bernstein also criticized the decision to keep the Washington Post neutral in the 2024 presidential race by declining to endorse Harris for president.\n\n“We respect the traditional independence of the editorial page, but this decision 11 days out from the 2024 presidential election ignores the Washington Post’s own overwhelming reportorial evidence on the threat Donald Trump poses to democracy,” the pair said in a statement published by CNN Friday.\n\nBezos, who bought the Washington Post in 2013, has not publicly weighed in on the presidential election, amid claims by some WashPo insider who speculate Bezos does not want to alienate Trump as he gains momentum to recapture the White House.","summary":"Lewis rejected claims the Amazon billionaire killed the already planned endorsement for the Democratic nominee.","url":"https://nypost.com/2024/10/26/us-news/washington-post-ceo-william-lewis-takes-the-blame-for-killing-presidential-endorsement-for-kamala-harris/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92454921.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/kvPHxM3U-RyIcpnTz.mp4","publish_date":"2024-10-26 22:51:27","author":"Anna Young","authors":["Anna Young"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":261225820,"title":"Donald Trump's and Kamala Harris' Michigan Rally Crowd Sizes Compared","text":"Former President Donald Trump and Vice President Kamala Harris' dueling Michigan rallies were packed on Saturday.There are less than 10 days until the November 5 presidential election and supporters of Trump, the GOP nominee, and Harris, the Democratic nominee, in the battleground state of Michigan came out to cheer the candidates on.Trump's afternoon rally in Novi, about a 40-minute drive northwest of Detriot, was held at Suburban Collection Showplace. According to Getty photos and video shared on social media, there was a large crowd behind, in front of and on the sides of Trump's podium.Steven Cheung, Trump's communications director, told Newsweek via email Saturday evening, that the Novi rally was filled to \"maximum capacity with thousands outside.\"Meanwhile, the stands at the Wings Event Center in Kalamazoo were filled at Harris' rally with former first lady Michelle Obama Saturday evening, according to video on social media. The floor level was also packed with Harris supporters by her podium.Rally crowd sizes have become a talking point during the election. Harris' campaign has repeatedly mocked Trump's rally crowd sizes while boasting about the high number of attendees at the vice president's events.Meanwhile, Trump has maintained that he gets more attendees at his rallies. At one point, he said Harris used artificial intelligence (AI) in a photo to bolster her crowd size at a Detroit rally.Referencing a photo taken at that rally, Trump wrote on social media in August, \"Has anyone noticed that Kamala CHEATED at the airport? There was nobody at the plane, and she 'A.I.'d' it, and showed a massive 'crowd' of so-called followers, BUT THEY DIDN'T EXIST!\"The former president also said the large crowd at Harris' rally was \"fake,\" adding, \"She should be disqualified because the creation of a fake image is ELECTION INTERFERENCE. Anyone who does that will cheat at ANYTHING!\"A Harris campaign official told Newsweek at the time, \"I can confirm that the photo was taken by Harris campaign staff and not modified by AI in any way.\"How Are the Candidates Doing in Michigan?Harris and Trump are running neck and neck in Michigan. The vice president has a slight lead of 0.2 points, with 47.9 percent compared to Trump's 47.7 percent, according to poll aggregator FiveThirtyEight's polling averages for the state.How Are the Candidates Doing Nationally?Harris has a 1.4-point lead over Trump on the national stage. She has 48 compared to Trump's 46.6 percent, FiveThirtyEight says.","summary":"Trump and Harris' dueling Michigan rallies were packed on Saturday as both compete for the battleground state.","url":"https://www.newsweek.com/donald-trump-kamala-harris-michigan-rally-crowd-size-1975461","image":"https://d.newsweek.com/en/full/2505118/trump-harris.png","video":null,"publish_date":"2024-10-26 22:47:26","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"US","sentiment":-0.049},{"id":261228310,"title":"Beyonce Stole From Me, Claims Amber Rose! She:","text":"We value your privacy\n\n We and our \npartners store and/or access information on a device, such as cookies and process personal data, such as unique identifiers and standard information sent by a device for personalised advertising and content, advertising and content measurement, audience research and services development.With your permission we and our partners may use precise geolocation data and identification through device scanning. You may click to consent to our and our 1449 partners’ processing as described above. Alternatively you may access more detailed information and change your preferences before consenting or to refuse consenting.Please note that some processing of your personal data may not require your consent, but you have a right to object to such processing. Your preferences will apply to this website only. You can change your preferences or withdraw your consent at any time by returning to this site and clicking the \"Privacy\" button at the bottom of the webpage. \n\nMORE OPTIONS\n\n Got A Tip?\n\n Star Seeker \n\n Skip to content\n\n Main Navigation \n\nRelationships\n\nControversy\n\n \n\n \n\nBeyonce Stole From Me, Claims Amber Rose! She: \n\nThis is ridiculous! Beyonce???? Amber Rose…\n\nRelated Posts\n\n Amber Rose Claims Beyoncé Stole Her RNC Speech After The Singer’s Appearance At Kamala Harris’ Houston Rally! \n\n Amber Rose Commits Fraud And CONFESSES! She Admitted… \n\n Amber Rose Is A Hypocrite And A SCAMMER! Receipts Here!!! \n\n Amber Rose's Children... \n\nFrom The Web\n\nHeidi Klum's Daughter Looks Like Her Iconic Dad\nlearnitwise\n\nThe Close Relationship Between Stress and Sleep\n\nFour Easy Tips to Keep Your Kids Safe Online\n\nThe Best Places to Buy College Apparel Make Showing College Pride Too Easy\n\nThe New Normal of Selling a Home Today\n\nFeatured Local Savings\n\n CLICK HERE TO COMMENT\n\n \n\nOct 26, 2024 15:45pm PDT\n\nDonald Trump \n\nJamie Foxx Is Playing Us! About Diddy:\n\n \n\nChris Brown Raped A Dancer Aboard Diddy’s Yacht, She Claims! AND:\n\n \n\nJames Franco Reveals He Was Dumped By Seth Rogen! AND...\n\n \n\nDiddy Freak Off Tapes LEAK! In Them:\n\n Click To Watch\n\nFollow Perez\n\nTop Celebrities\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n View All Celebrities\n\nLatest Video\n \n\nJamie Foxx Is Playing Us! About Diddy:\n\n Galleries\n\n PerezTV\n\n \n\n \nAdvertising\n \n\n \n\n \n\n \n\nCopyright © 2024 PerezHilton.com | All Rights Reserved\n\nDo Not Sell My Personal Information","summary":"This is ridiculous! Beyonce???? Amber Rose&#8230; [...]\n\n\nRead More...\n\n\nThe post Beyonce Stole From Me, Claims Amber Rose! She: appeared first on Perez Hilton.","url":"https://perezhilton.com/beyonce-stole-from-me-claims-amber-rose-she/","image":"https://i3.ytimg.com/vi/uNtWe2PDqNs/hqdefault.jpg","video":null,"publish_date":"2024-10-26 22:45:44","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","source_country":"us","sentiment":0.075},{"id":261228108,"title":"Trump, Harris tied with 49% each in new national Emerson poll","text":"The latest poll shows a slight change from early October, when Harris had 50% support among likely voters compared with Trump’s 48%.\n\nThe top issue for voters is still the economy at 45%, followed by immigration (14%), threats to democracy (14%), abortion access (7%), healthcare (6%) and crime (4%).\n\nThe survey, which was conducted by phone with around 1,000 likely voters, has a margin of error of plus or minus 3 percentage points.","summary":"The latest poll shows a slight change from early October, when Harris had 50% support among likely voters compared with Trump’s 48%.","url":"https://fortune.com/2024/10/26/presidential-poll-emerson-donald-trump-kamala-harris-49-49-tie/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/10/GettyImages-2180559584-e1729982115391.jpg","video":null,"publish_date":"2024-10-26 22:42:42","author":"Bloomberg,Gabriela Mello","authors":["Bloomberg","Gabriela Mello"],"language":"en","category":"politics","source_country":"US","sentiment":-0.2},{"id":261226144,"title":"Michelle Obama slams ‘predator’ Trump as she delivers bleak warning for reproductive health at Harris rally","text":"Michelle Obama slammed Donald Trump as a “felon, slumlord” and a “predator” in a fiery speech in Michigan, where she delivered a stark warning for the future of reproductive rights in the US should the former president return to the White House.\n\nIn some of her most potent remarks on the campaign trail thus far, the former First Lady painted a sobering picture of the state of abortion rights and pregnancy care in the years after the Supreme Court overturned Roe v Wade and revoked a constitutional right to abortion access.\n\nTrump has “no honor, no decency, no morals,” Obama said from Kalamazoo, Michigan, which she rebranded as “Kamala-zoo.”\n\n“People write off his ‘childish indecency’ as Trump just being Trump,” she said. “Rather than question his horrible behavior, some folks think he’s just funny.”\n\nShe added: “I hope you’ll forgive me if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence, while asking Kamala to dazzle us at every turn.\n\n“I hope that you’ll forgive me if I’m a little angry that we are indifferent to his erratic behavior, his obvious mental decline, his history as a convicted felon, a known slum lord, a predator found liable for sexual abuse,” said Obama, referencing Trump’s guilty verdict in Manhattan in his hush money scandal, his infamous history as a landlord, and a verdict in a defamation trial from a woman who accused him of sexual assault.\n\nObama also described various common but terrifying scenarios in pregnancies gone wrong, drawing a contrast between Trump’s healthcare agenda and Harris’s support for abortion rights.\n\n“I don’t want to be a downer, y’all, but in many cases, there is no warning, and things go bad very quickly, and when it happens, every second of hesitation or delay can lead to devastating outcomes,” she said.\n\n“Do not put our lives in the hands of politicians, mostly men, who have no clue or do not care about what we as women are going through, who don’t fully grasp the broad reaching health implications that their misguided policies will have on our health outcomes,” Obama added.\n\nAddressing male voters directly, she added: “Are you, as men, prepared to look into the eyes of the women and children you love and tell them that you supported this assault on our safety?”\n\nPeople who withhold their vote as they put Harris to a purity test are making women “collateral damage to your rage,” according to Harris.\n\n“We are more than baby-making vessels,” she said.\n\nThe former First Lady’s speech comes after Harris held a rally focused explicitly on women’s reproductive rights in Houston, Texas, along with music superstar Beyonce.\n\n“I’m not here as a celebrity,” Beyonce told supporters in her native Houston on Friday. “I’m not here as a politician. I’m here as a mother, a mother who cares deeply about the world my children, and all of our children, are living in. A world where we have the freedom to control our bodies,” \n\nAt his own rally in Pennsylvania on Saturday, Trump said that attendees of Harris’ Houston rally had only gone to see Beyonce sing, which she did not, and that the music superstar did not know who the vice president was.\n\n“[Harris] had Beyonce because she can’t draw a crowd. See this crowd, this crowd is packed. I could sell it out three times.” he said. “And we don’t have Beyonce who couldn’t fill the arena last night,” he said.\n\n“But the people went there because they thought they’re going to hear Beyonce sing, right? Beyonce got out and said, ‘Hello, ladies and gentlemen, I’d like to endorse her. What’s her name? What’s her name? What is her name again? Oh, I’m going to endorse her.’\n\n“So what happened is the crowd came because they thought she was going to sing. Then she turned around, she left, and Kamala started speaking, and it was a disaster.”\n\nHe previously baselessly claimed that people had “booed” Beyonce as she left the stage.\n\nBack in Michigan, Obama turned her anger towards Trump and those who hold Harris to “a higher standard” than her opponent.\n\n“We expect her to be intelligent, articulate, have a clear set of policies, and never show too much anger … But for Trump? We expect nothing at all,” she said. “No understanding of policy, no ability to put together coherent arguments.”","summary":"In some of her most potent remarks on the campaign trail thus far, the former First Lady painted a sobering picture of the state of abortion rights and pregnancy care in the years after Roe v Wade","url":"https://www.independent.co.uk/news/world/americas/us-politics/michelle-obama-kamala-harris-trump-abortion-b2636257.html","image":"https://static.independent.co.uk/2024/10/26/22/5245890eb20447c4bdeb1194ed67fca8.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/RuRslwPm-4VHSaSK0.mp4","publish_date":"2024-10-26 22:41:04","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":-0.07},{"id":261226946,"title":"Don’t Cancel <em>The Washington Post</em>. Cancel Amazon Prime.","text":"The biggest story in months about media and democracy wasn’t an article—it was the absence of one. The news broke yesterday afternoon: For the first time in almost 50 years, The Washington Post would not be endorsing a presidential candidate. In fact, it would be ending the practice altogether. An endorsement—of Kamala Harris—had been drafted by “editorial page staffers,” a Post article reported, but then came the decision not to publish it. That choice was made not by the paper’s editorial board or newsroom leadership, the Post (and others) reported, citing anonymous sources, but by its owner, Amazon founder Jeff Bezos.\n\nBezos, as it happens, has billions of dollars in contracts before the federal government. It did not take long for people to start suggesting that the decision not to endorse might have had little to do with journalistic principle and much to do with the relationship between Bezos and the famously vindictive person who, if elected president of the United States, could soon have major influence over his businesses. “This is cowardice, a moment of darkness that will leave democracy as a casualty,” Martin Baron, a former Post executive editor, told NPR. “Donald Trump will celebrate this as an invitation to further intimidate The Post’s owner, Jeff Bezos (and other media owners). History will mark a disturbing chapter of spinelessness at an institution famed for courage.” (Bezos has not commented on the endorsement decision. The Post’s communications chief told the paper’s reporters, “This was a Washington Post decision to not endorse.”)\n\nAverage people have few ways of combating forces bigger than them, forces such as the threat of authoritarianism, the boiling-frog encroachment on free expression, and the near-unchecked power of the ultrarich. But consumer choice is one thing they do have. And in the hours immediately after the non-endorsement was made public, Post readers pulled the lever they knew to pull, the lever they have been pulling roughly as long as newspapers have existed: They canceled their subscriptions. As Max Tani reported in Semafor, relying on accounts from anonymous sources, “in the 24 hours ending Friday afternoon, about 2,000 subscribers canceled their subscriptions.” (In the same piece, Tani quoted a source saying that the number of canceled subscriptions was “not statistically significant.”) NPR, citing internal Post correspondence, reported that “more than 1,600 digital subscriptions had been cancelled less than four hours after the news broke.”\n\nIt was a reasonable impulse. But if Bezos is, indeed, why the Post is no longer endorsing candidates, and if people are worried about his outsize influence on our society, they should not be canceling their newspaper subscriptions. They should be canceling their Amazon Prime subscriptions.\n\nAmazon is the biggest store in the world, the second-largest private employer in the United States, and the reason Bezos was rich enough to buy the Post in the first place. And Amazon, as I have previously reported, is powered by Prime, which in and of itself generates tremendous revenue for the company, in addition to facilitating ever more shopping. Last year, the company’s revenue from its membership offerings alone came to $40.2 billion. This is roughly twice as much as the 2022 revenue of every publicly traded newspaper company in the country combined, and infinitely more than that of the Post, which in May reported that it had lost $77 million in the past year, largely as a result of declining paid readership. The United States has roughly 127 million households. Recent estimates show that U.S. consumers hold 180 million Prime subscriptions and fewer than 21 million newspaper subscriptions.\n\nAmazon Prime subscriptions pay for Amazon to grow—to gobble up market share, put small stores out of business, and make Bezos more powerful. Newspaper subscriptions, by the same token, pay for newspapers to grow. They pay for reporting and editing and fact-checking and the skilled labor of a vanishing class of people—people dedicated to the careful work of gathering the news, verifying the accuracy of information, and endeavoring to ensure a well-informed citizenry. The people who do that work are not the ones responsible for killing the Post’s endorsement. But they are the ones who are likely to be laid off, furloughed, bought out, or underpaid if company revenue dwindles as a result of subscription cancellations.\n\nSubscriptions enable fearlessness and independence; they allowed the Post to publish the Pentagon Papers and unravel the Watergate scandal, which led to President Richard Nixon’s resignation in 1974. (This was also, of course, when advertising revenue still sustained the news business.) Bob Woodward and Carl Bernstein, who anchored the Watergate coverage, released a statement yesterday calling the decision not to endorse “surprising and disappointing,” especially given the paper’s “own overwhelming reportorial evidence on the threat Donald Trump poses to democracy.”\n\nJournalism is expensive. And the news industry is in crisis in part because not enough people are willing to pay for it. Woodward and Bernstein reported on Watergate for two years before Nixon resigned; while they did, subscribers helped pay their salaries, as well as the salaries of the editors and production staff who worked to bring their stories to the public. In 2022, Post reporters won the Pulitzer Prize for public service, one of the industry’s highest honors, for stories about the chaos that befell their city on Jan. 6, 2021, after a group of people stormed the Capitol and attempted to overthrow a legitimately elected president. Subscribers helped pay for that work too. But their numbers keep dwindling. This is why, in recent years, some news organizations have come to rely on the largesse of individual billionaires. The people whom American journalism institutions were built to serve—average readers—are no longer paying the check.\n\nReaders who’ve written to cancel their Post subscriptions have cited the endorsement decision, but they have also cited the paper’s general decline: “There just isn’t much to read in The Post anymore, and it is no longer a local paper in any meaningful sense,” one wrote. But if those readers want a robust local newspaper, an institution to keep holding the powerful to account, Post subscriptions aren’t the problem. They’re the solution. The best thing those readers can do is cancel their $139 annual Prime subscriptions, if they have them, and invest that money in the journalism they say they want and need.","summary":"The subscription money enriching Jeff Bezos could instead be spent on the journalism crucial to preserving democracy.","url":"https://www.theatlantic.com/culture/archive/2024/10/washington-post-bezos-amazon-prime-cancel/680421/","image":"https://cdn.theatlantic.com/thumbor/R-ErZVGois_YVFC27CKxAy82yfs=/0x0:2000x1042/1200x625/media/img/mt/2024/10/GettyImages_1079533948-1/original.jpg","video":null,"publish_date":"2024-10-26 22:41:00","author":"Ellen Cushing","authors":["Ellen Cushing"],"language":"en","category":"politics","source_country":"US","sentiment":-0.267},{"id":261229842,"title":"Foreign threats to the US election are on the rise, and officials are moving faster to expose them","text":"WASHINGTON (AP) — A presidential candidate’s phone is hacked. A fake video falsely shows ballots burned in Pennsylvania. National security officials warn that U.S. adversaries may incite violent protests after Election Day.\n\nThese developments — all revealed in the past week — show how Russia, China and Iran have increased the pace of efforts to meddle in American politics ahead of next month’s election, just as intelligence officials and security analysts had predicted.\n\nAt the same time, officials, tech companies and private researchers have adopted a more aggressive defense by swiftly exposing foreign election threats, highlighting the lessons learned from past election cycles that revealed America’s vulnerability to disinformation and cyberespionage.\n\nOfficials say the U.S. election system is so secure that no foreign nation could alter the results at a scale necessary to change the outcome. Nevertheless, authoritarian adversaries have leveraged disinformation and cyberespionage to target campaigns and voters while stoking distrust and discord.\n\nHere’s what to know as the presidential election approaches:\n\nRussia is the top threat\n\nRussia is the most active and sophisticated nation working to manipulate the U.S. election, using fake websites, state-controlled media and unwitting Americans to spread misleading and polarizing content aimed at undermining confidence in elections.\n\nThe Kremlin’s disinformation apparatus seizes on contentious issues like immigration, crime, the economy or disaster relief. The goal is to weaken the U.S., erode support for Ukraine as it fights off Russian invaders and reduce America’s ability to counter Russia’s growing ties to China, North Korea and Iran, officials have said.\n\nIntelligence officials and private security analysts have determined that Russia supports former President Donald Trump, and is using disinformation — sometimes AI-generated — to smear his Democratic opponent, Vice President Kamala Harris. Trump has praised Russian President Vladimir Putin, suggested cutting funds to Ukraine and repeatedly criticized the NATO military alliance.\n\nIn one particularly audacious campaign, Russia staged a video that falsely accused Harris of paralyzing a woman in a car crash years ago. Another video made fictitious allegations against Harris’ running mate, Minnesota Gov. Tim Walz.\n\nOn Friday, the FBI confirmed Moscow’s role in creating a third video supposedly showing the destruction of mail ballots in Pennsylvania. Local election officials quickly debunked the video as false.\n\nRussia also has tried to pay American influencers who spread the Kremlin’s preferred narratives. Last month, U.S. authorities accused two Russian state media employees of funneling $10 million to a Tennessee company to create pro-Russian content. The company then paid several popular right-wing influencers, who have said they had no idea their work was being supported by Russia.\n\nMoscow’s campaign won’t end on Election Day. Instead, intelligence officials and private security analysts predict Russia will exploit claims of election irregularities to suggest the results can’t be trusted. A recently declassified intelligence memo said Russia may also encourage violent protests after the election.\n\n“Putin’s aim is to foment chaos, division and polarization in our society,” said Michael McFaul, a former U.S. ambassador to Russia who now teaches at Stanford University.\n\nRussia has rejected claims that it seeks to influence the U.S. election. A message left with Russia’s embassy in Washington was not immediately returned Saturday.\n\nIranian hack-and-leak operations\n\nIran has been a particularly brazen player in foreign interference this year.\n\nIt’s accused of hacking Trump campaign associates and offering the stolen communications to media organizations and Democrats in hopes that damaging stories would emerge that could hurt the Republican’s prospects. Emails dangling dirt were sent to people associated with President Joe Biden’s campaign, but there’s no indication anyone replied, officials have said.\n\nThe Justice Department last month charged three Iranian hackers who remain at large, accusing them of a yearslong operation targeting a vast array of victims.\n\nU.S. officials have described the hacking as part of a broader effort to interfere in an election that Iran perceives as particularly consequential. Iran, they say, has made clear its opposition to the Trump campaign. His administration ended a nuclear deal with Iran, reimposed sanctions and ordered the killing of Iranian Gen. Qassem Soleimani, an act prompting Iran’s leaders to vow revenge.\n\nIn addition to the cyberoperations, U.S. officials have repeatedly expressed concern about the potential for Iran to carry out violence on U.S. soil against Trump or other members of his administration. Officials in 2022 brought charges in a foiled Iranian plot to kill Trump’s national security adviser, John Bolton, and this year charged a Pakistani man with ties to Iran in a plot to carry out political assassinations in the U.S., including potentially of Trump.\n\nLeaders in Tehran also may try to encourage violent protests after the election, according to the declassified intelligence memo. Authorities say Iran also covertly funded and supported protests in the U.S. over Israel’s war in Gaza.\n\nIranian authorities have dismissed allegations that the country is seeking to influence the election. Iran’s mission to the United Nations released a statement this week saying, “Iran neither has any motive nor intent to interfere in the U.S. election.”\n\nA neutral China?\n\nU.S. intelligence officials believe China is taking a more neutral stance in the election and is focused on down-ballot races, targeting candidates from both parties based on their positions on issues of key importance to Beijing, including support for Taiwan.\n\nBut the Chinese government has for years operated a sophisticated hacking operation targeting all manners of Western life and industry that goes well beyond election influence.\n\n“From city council to president, they want access,” said Adam Darrah, a former CIA political analyst who is now vice president of intelligence at the cybersecurity firm ZeroFox, which tracks foreign online threats.\n\nOn Friday, news broke that Chinese hackers as part of a much broader espionage effort had targeted cellphones used by Trump, his running mate JD Vance and people associated with Harris’ campaign. It was not immediately clear what data, if any, had been accessed.\n\nA spokesperson for the Chinese Embassy in Washington said they were unfamiliar with the details and couldn’t comment but contended that China is routinely victimized by cyberattacks and opposes the activity.\n\nAre these tactics new?\n\nHardly. Foreign adversaries, including the same ones blamed for meddling now, have sought to interfere in the last several election cycles — with varying degrees of success.\n\nBut the U.S. government, blamed for sitting on information about the scope of Russian interference in the 2016 election, has worked this year to aggressively call out foreign threats as part of an effort to reduce their impact and assure Americans that the election is secure.\n\nIn 2016, Russian military intelligence officers hacked into the email accounts of Hillary Clinton’s campaign chairman and the Democratic Party and released tens of thousands of communications in an effort to boost Trump’s successful presidential campaign.\n\nRussia also engaged that year in a huge but hidden social media trolling campaign aimed at sowing discord on hot-button social issues, creating division in the American electoral process and harming Clinton’s bid for president.\n\nThe antics continued in the 2020 election cycle when a Ukrainian lawmaker described at the time by U.S. officials as an “active Russian agent ” released audio recordings of Democrat Joe Biden, who was then running for president.\n\nThat same year, Iranian hackers were blamed for emails purported to come from the far-right group The Proud Boys that officials said were designed to harm Trump’s candidacy.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — A presidential candidate&#8217;s&#160;phone is hacked. A fake&#160;video falsely shows ballots burned&#160;in Pennsylvania. National security officials warn that U.S. adversaries may incite violent...","url":"https://whdh.com/news/foreign-threats-to-the-us-election-are-on-the-rise-and-officials-are-moving-faster-to-expose-them/","image":"https://whdh.com/wp-content/uploads/sites/3/2023/11/vote-1.jpg?quality=60&strip=color","video":null,"publish_date":"2024-10-26 22:34:57","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":261229844,"title":"‘Take our lives seriously,’ Michelle Obama pleads as she rallies for Kamala Harris in Michigan","text":"KALAMAZOO, Mich. (AP) — Michelle Obama challenged men to support Kamala Harris ‘ bid to be America’s first female president, warning at a rally in Michigan on Saturday that women’s lives would be at risk if Donald Trump returned to the White House.\n\nThe former first lady described the assault on abortion rights as the harbinger of dangerous limitations on healthcare for women. Some men may be tempted to vote for Trump because of their anger at the slow pace of progress, Obama said, but “your rage does not exist in a vacuum.”\n\n”If we don’t get this election right, your wife, your daughter, your mother, we as women will become collateral damage to your rage,” Obama said. “So are you as men prepared to look into the eyes of the women and children you love and tell them you supported this assault on our safety?”\n\nThe rally in Kalamazoo was Obama’s first appearance on the campaign trail since she spoke at the Democratic National Convention over the summer, and her remarks were searing and passionate in their support of Harris.\n\n“By every measure, she has demonstrated that she’s ready,” the former first lady said. “The real question is, as a country, are we ready for this moment?”\n\nObama added, “Do not buy into the lies that we do not know who Kamala is or what she stands for. This is somebody who understands you, all of you.”\n\nAlthough Obama has been a reluctant campaigner over the years, she showed no hesitation on Saturday as her speech stretched from the political to the personal. Obama said she fears for the country and struggles to understand why the presidential race remains close.\n\n“I lay awake at night wondering, ‘What in the world is going on?’” she said.\n\nHer voice vibrating with emotion, Obama talked about the struggle for women to understand and care for their own bodies, whether it’s their menstrual cycles or menopause. And she spoke about the dangers of childbirth, when a split-second decision can mean the difference between life and death for a mother and her baby.\n\n“I am asking y’all from the core of my being to take our lives seriously,” Obama pleaded.\n\nHarris took the stage after Obama and promised the crowd that she would keep their interests in mind — unlike Trump, who she accused of only being interested in himself.\n\n“There is a yearning in our country for a president who sees the people, not just looking in the mirror all the time, but sees the people, who gets you and who will fight for you,” she said.\n\nThe rally in Kalamazoo followed Harris’ visit to a local doctor’s office in Portage to talk with health care providers and medical students about the impact of abortion restrictions. One of them said they have patients visiting from other parts of the country where there are strict limitations on abortion, and another said she’s worried that people won’t want to practice in important areas of medicine because of fears about government intrusion.\n\n“We are looking at a health care crisis in America that is affecting people of every background and gender,” Harris told reporters before visiting the doctor’s office.\n\nHarris appeared with Beyoncé on Friday in Houston, and she campaigned with former President Barack Obama and Bruce Springsteen on Thursday in Atlanta.\n\nIt’s a level of celebrity clout that surpasses anything that Trump, the Republican nominee, has been able to marshal this year. But there’s no guarantee that will help Harris in the close race for the White House. In 2016, Hillary Clinton lost to Trump despite firing up her crowds with musical performances and Democratic allies.\n\nTrump brushed off Harris’ attempt to harness star power for her campaign.\n\n“Kamala is at a dance party with Beyoncé,” the former president said Friday in Traverse City, Michigan. Trump, the Republican nominee for president, held a rally in Novi, a suburb of Detroit, on Saturday before a later event in State College, Pennsylvania.\n\nSaturday is the first day that early in-person voting became available across Michigan. More than 1.4 million ballots have already been submitted, representing 20% of registered voters.\n\nWhen Clinton was running against Trump, Michelle Obama inspired Democrats with the slogan “when they go low, we go high.”\n\nBut this year, at the Democratic National Convention in Chicago, she adopted a more biting approach. She accused Trump of “doubling down on ugly, misogynistic, racist lies as a substitute for real ideas and solutions that will actually make people’s lives better.”\n\nWhile Harris was with Obama in Michigan, President Joe Biden visited the Laborers’ International Union of North America in Pittsburgh. He mentioned that Harris once walked a picket line with the United Auto Workers — “she has a backbone like a ramrod” — while Trump has undermined organized labor.\n\n“He views unions as getting in the way of the accumulation of wealth for individuals,” Biden said. “It’s in labor’s interest to defeat Donald Trump, more than any other race you’ve been in.”\n\nBiden’s remarks to the mostly male audience referenced the gender divide that has been a consistent feature of this year’s presidential race.\n\nSpeaking on Trump, Biden said, “I’m just gonna say straight up, he’s a loser as a man.”\n\nHe also said that women deserve more opportunities than they’ve received in the past.\n\n“They can do anything any man can do, including be president of the United States of America,” Biden said.\n\nMadhani reported from Pittsburgh and Megerian reported from Washington.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"KALAMAZOO, Mich. (AP) —&#160;Michelle Obama&#160;challenged men to support&#160;Kamala Harris&#160;&#8216; bid to be America&#8217;s first female president, warning at a rally in Michigan on Saturday that...","url":"https://whdh.com/news/take-our-lives-seriously-michelle-obama-pleads-as-she-rallies-for-kamala-harris-in-michigan/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/07/image-2-17.jpg?quality=60&strip=color","video":null,"publish_date":"2024-10-26 22:32:36","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":0.063},{"id":261225466,"title":"Carson Jerema: No, the Washington Post didn’t just let democracy die in darkness","text":"But suddenly, because the Post will not be endorsing Democrat Kamala Harris, the antiquated practice of political endorsements by editorial boards has been sanctified. To be clear, the paper isn’t endorsing Trump, it is merely not endorsing anyone.\n\nLongtime columnist and editor-at-large Robert Kagan quit over the decision. “This is obviously an effort by (Washington Post owner) Jeff Bezos to curry favour with Donald Trump,” he told CNN. Kagan is, of course, a Bush-era Republican who left the party over Trump. Some of his columns include: “A Trump dictatorship is increasingly inevitable. We should stop pretending,” and “The Trump dictatorship: How to stop it.”\n\nPresumably, Kagan was free to continue expressing his views, doing his part to resist the darkness, but the absence of a political endorsement was too much to bear.\n\nThe Washington Post Guild, the union representing the newsroom, released a statement that it was “deeply concerned” that the paper “would make the decision to no longer endorse presidential candidates.”\n\nIt went on to explain that “The role of an Editorial Board is to do just this: to share opinions on the news impacting our society and culture and endorse candidates to help guide readers.”","summary":"Progressives melt over decision not to endorse a presidential candidate","url":"https://nationalpost.com/opinion/carson-jerema-no-the-washington-post-didnt-just-let-democracy-die-in-darkness","image":"https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/10/2180145975.jpg","video":null,"publish_date":"2024-10-26 22:31:17","author":"Carson Jerema","authors":["Carson Jerema"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.029},{"id":261224688,"title":"Lara Trump Mocked for Wearing 'Tacky' Trump Necklace During Interview: \"Gaudy Gold Dog Collar\"","text":"Lara Trump stirred up social media chatter by sporting a unique accessory during a recent interview: a bold necklace featuring an image of her father-in-law, former President Donald Trump. Critics quickly took to X (formerly known as Twitter) to mock the choice. One user posted the clip with the caption, \"RNC Co-Chair Lara Trump wore a giant necklace of Trump for her interview with paid Russian disinformation asset Benny Johnson.”\n\nAs per OK! Magazine, one user wrote, \"Tacky AND trashy. The Trump way.\" In agreement, another user added, \"Her gaudy gold dog collar.\" Someone else added, “At some point, they will realize how ridiculous this all is, right?” Another user added, “Why does her face look like she overdosed on Botox?” As if this was not enough, someone else tweeted, “But they claim to be “Christians” but stay worshipping this false idol. MAGA Christians can’t tell me nothing because I don’t want to hear it. They don’t practice what they preach. Can’t wait for this election to be over. Gosh.”\n\nThe necklace was just the beginning, as Lara also made headlines with her spirited defense of Donald, dismissing allegations of racism. During an interview with Charlamagne tha God, she claimed, “I’ve known this man for 16 years. And, you know, you can go to each of those incidents, and you know, there was, there was never any, any proof of anything.”\n\nInterestingly, Lara said this despite his controversial comments about migrants and Haitian immigrants. The statement prompted a laugh from Charlamagne, who pointedly remarked, \"It’s hysterical. But, I mean, people act like there’s no such thing as Google or we don’t have TV, radio.” Still, Lara remained steadfast in her defense, urging viewers to judge Donald by his actions rather than what she saw as a 'knee-jerk' label of racism.\n\nBesides, this wasn't Lara’s first time defending her father-in-law against controversy. In past appearances, the RNC co-chair has minimized his inflammatory language, including his remarks toward Vice President Kamala Harris, whom he referred to as 'mentally disabled,' at rallies. She brushed off the rhetoric and exclaimed, “...this is Donald Trump and he has never tried to make himself out to be anyone other than who he is. And obviously he’s kind of joking around there with the crowd at a Trump rally when he says those things,” as noted by HuffPost.\n\nAlthough Republicans worry Trump’s tone could impact down-ballot races, Lara disagreed, asserting he had consistently boosted GOP candidates, maintaining a strong influence on the party’s success. According to her, Democrats are the ones who should be nervous, particularly about their chances in Congress. She remarked, “So any concerns anyone has about Donald Trump being on the ticket with them, on the Republican side, I really don’t buy. I think the Democrats are probably worried about losing the Senate and possibly not being able to gain any ground in the House because Donald Trump is on the ticket.”","summary":"The necklace was just the beginning, as Lara also made headlines with her spirited defense of Trump, dismissing allegations of racism.","url":"https://www.inquisitr.com/lara-trump-mocked-for-wearing-tacky-trump-necklace-during-interview-gaudy-gold-dog-collar","image":"https://dab57h0r8ahff.cloudfront.net/721868/uploads/81193550-937e-11ef-bbca-e1dca46a5f54_1200_630.jpeg","video":null,"publish_date":"2024-10-26 22:30:08","author":"INQUISITR,Ishita Sen Gupta","authors":["INQUISITR","Ishita Sen Gupta"],"language":"en","category":"politics","source_country":"US","sentiment":-0.258},{"id":261225562,"title":"As US election looms, Biden aides struggle with Middle East wars","text":"In Lebanon, Israel continues to pound Hezbollah positions and, defying US admonitions, to strike targets in residential Beirut. The attacks have killed hundreds of women and children. A month ago, after the start of Israel’s offensive in Lebanon to disrupt Hezbollah rocket fire, the Biden administration tried and failed to get a cease-fire and has since stopped calling for an immediate halt to the fighting.\n\nAnd the region is bracing for possible Iranian reprisals after Israel’s airstrikes Saturday, which were themselves a response to an October 1 Iranian ballistic missile barrage against Israel, the second such assault by Iran this year.\n\nIsrael’s use of its military might – and the civilian casualties that accompany it, including young Palestinians who burned alive in tents after an Israeli strike near a Gaza hospital – has left many Democrats wringing their hands.\n\nPolls in the critical state of Michigan show a toss-up between Harris and former president Donald Trump, the Republican contender. Many Arab American voters there say they are repulsed by the Biden administration’s unceasing weapons shipments to Israel. Some Democrats believe that losing their votes could tip the state – and perhaps the entire election.\n\n“As for Arab and Muslim voters, they view Harris as beyond redemption because of Gaza, and now Lebanon,” said Hashemi. “Most will be voting for a third-party candidate or they will be boycotting this election. Some might naively vote for Trump out of frustration.”\n\nTrump has at times expressed total support for Israel, and he and Netanyahu share a transactional outlook. He and his aides enacted controversial policies during his administration that supported Netanyahu’s positions. But Trump has also called on Israel to “stop killing people” in Gaza.","summary":"If Joe Biden and Kamala Harris have any hope that the warring parties will silence their guns before the US election, there was no sign that US Secretary of State Antony Blinken’s recent trip could pave the way for that.","url":"https://www.brisbanetimes.com.au/world/north-america/as-us-election-looms-biden-aides-struggle-with-middle-east-wars-20241026-p5kljc.html","image":"https://static.ffx.io/images/$zoom_0.34101977276080864%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_113%2C$y_89/t_crop_custom/q_86%2Cf_auto/cc8fcded7247304bd3ae84935928e20236c8bca0","video":null,"publish_date":"2024-10-26 22:30:00","author":"Edward Wong,Michael Crowley","authors":["Edward Wong","Michael Crowley"],"language":"en","category":"politics","source_country":"au","sentiment":-0.607},{"id":261225556,"title":"As US election looms, Biden aides struggle with Middle East wars","text":"In Lebanon, Israel continues to pound Hezbollah positions and, defying US admonitions, to strike targets in residential Beirut. The attacks have killed hundreds of women and children. A month ago, after the start of Israel’s offensive in Lebanon to disrupt Hezbollah rocket fire, the Biden administration tried and failed to get a cease-fire and has since stopped calling for an immediate halt to the fighting.\n\nAnd the region is bracing for possible Iranian reprisals after Israel’s airstrikes Saturday, which were themselves a response to an October 1 Iranian ballistic missile barrage against Israel, the second such assault by Iran this year.\n\nIsrael’s use of its military might – and the civilian casualties that accompany it, including young Palestinians who burned alive in tents after an Israeli strike near a Gaza hospital – has left many Democrats wringing their hands.\n\nPolls in the critical state of Michigan show a toss-up between Harris and former president Donald Trump, the Republican contender. Many Arab American voters there say they are repulsed by the Biden administration’s unceasing weapons shipments to Israel. Some Democrats believe that losing their votes could tip the state – and perhaps the entire election.\n\n“As for Arab and Muslim voters, they view Harris as beyond redemption because of Gaza, and now Lebanon,” said Hashemi. “Most will be voting for a third-party candidate or they will be boycotting this election. Some might naively vote for Trump out of frustration.”\n\nTrump has at times expressed total support for Israel, and he and Netanyahu share a transactional outlook. He and his aides enacted controversial policies during his administration that supported Netanyahu’s positions. But Trump has also called on Israel to “stop killing people” in Gaza.","summary":"If Joe Biden and Kamala Harris have any hope that the warring parties will silence their guns before the US election, there was no sign that US Secretary of State Antony Blinken’s recent trip could pave the way for that.","url":"https://www.theage.com.au/world/north-america/as-us-election-looms-biden-aides-struggle-with-middle-east-wars-20241026-p5kljc.html","image":"https://static.ffx.io/images/$zoom_0.34101977276080864%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_113%2C$y_89/t_crop_custom/q_86%2Cf_auto/cc8fcded7247304bd3ae84935928e20236c8bca0","video":null,"publish_date":"2024-10-26 22:30:00","author":"Edward Wong,Michael Crowley","authors":["Edward Wong","Michael Crowley"],"language":"en","category":"politics","source_country":"au","sentiment":-0.607},{"id":261224538,"title":"As US election looms, Biden aides struggle with Middle East wars","text":"In Lebanon, Israel continues to pound Hezbollah positions and, defying US admonitions, to strike targets in residential Beirut. The attacks have killed hundreds of women and children. A month ago, after the start of Israel’s offensive in Lebanon to disrupt Hezbollah rocket fire, the Biden administration tried and failed to get a cease-fire and has since stopped calling for an immediate halt to the fighting.\n\nAnd the region is bracing for possible Iranian reprisals after Israel’s airstrikes Saturday, which were themselves a response to an October 1 Iranian ballistic missile barrage against Israel, the second such assault by Iran this year.\n\nIsrael’s use of its military might – and the civilian casualties that accompany it, including young Palestinians who burned alive in tents after an Israeli strike near a Gaza hospital – has left many Democrats wringing their hands.\n\nPolls in the critical state of Michigan show a toss-up between Harris and former president Donald Trump, the Republican contender. Many Arab American voters there say they are repulsed by the Biden administration’s unceasing weapons shipments to Israel. Some Democrats believe that losing their votes could tip the state – and perhaps the entire election.\n\n“As for Arab and Muslim voters, they view Harris as beyond redemption because of Gaza, and now Lebanon,” said Hashemi. “Most will be voting for a third-party candidate or they will be boycotting this election. Some might naively vote for Trump out of frustration.”\n\nTrump has at times expressed total support for Israel, and he and Netanyahu share a transactional outlook. He and his aides enacted controversial policies during his administration that supported Netanyahu’s positions. But Trump has also called on Israel to “stop killing people” in Gaza.","summary":"If Joe Biden and Kamala Harris have any hope that the warring parties will silence their guns before the US election, there was no sign that US Secretary of State Antony Blinken’s recent trip could pave the way for that.","url":"https://www.smh.com.au/world/north-america/as-us-election-looms-biden-aides-struggle-with-middle-east-wars-20241026-p5kljc.html","image":"https://static.ffx.io/images/$zoom_0.34101977276080864%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_113%2C$y_89/t_crop_custom/q_86%2Cf_auto/cc8fcded7247304bd3ae84935928e20236c8bca0","video":null,"publish_date":"2024-10-26 22:30:00","author":"Edward Wong,Michael Crowley","authors":["Edward Wong","Michael Crowley"],"language":"en","category":"politics","source_country":"au","sentiment":-0.607},{"id":261229840,"title":"Trump denigrates Detroit while appealing for votes in a suburb of Michigan’s largest city","text":"NOVI, Mich. (AP) — Donald Trump further denigrated Detroit while appealing for votes Saturday in a suburb of the largest city in swing state Michigan.\n\n“I think Detroit and some of our areas makes us a developing nation,” the former president told supporters in Novi. He said people want him to say Detroit is “great,” but he thinks it “needs help.”\n\nThe Republican nominee for the White House had told an economic group in Detroit earlier this month that the “whole country will end up being like Detroit” if Democrat Kamala Harris wins the presidency. That comment drew harsh criticism from Democrats who praised the city for its recent drop in crime and growing population.\n\nTrump’s stop in Novi, after an event Friday night in Traverse City, is a sign of Michigan’s importance in the tight race. Harris is scheduled for a rally in Kalamazoo later Saturday with former first lady Michelle Obama on the first day that early in-person voting becomes available across Michigan. More than 1.4 million ballots have already been submitted, representing 20% of registered voters. Trump won the state in 2016, but Democrat Joe Biden carried it four years later.\n\nMichigan is home to major car companies and the nation’s largest concentration of members of the United Auto Workers. It also has a significant Arab American population, and many have been frustrated by the Biden administration’s support for Israel’s offensive in Gaza after the attack by Hamas against Israel on Oct. 7, 2023.\n\nDuring his rally, Trump spotlighted local Muslim and Arab American leaders who joined him on stage. These voters “could turn the election one way or the other,” Trump said, adding that he was banking on ”overwhelming support” from those voters in Michigan.\n\n“When President Trump was president, it was peace,” said one of those leaders, Mayor Bill Bazzi of Dearborn Heights. “We didn’t have any issues. There was no wars.”\n\nWhile Trump is trying to capitalize on the community’s frustration with the Democratic administration, he has a history of policies hostile to this group, including a travel ban targeting Muslim countries while in office and a pledge to expand it to include refugees from Gaza if he wins on Nov. 5.\n\nA Trump ally, Republican Rep. Darrell Issa of California, the grandson of Lebanese immigrants, told reporters that Trump was winning over support from more Arab Americans and has cultivated relationships with leaders in the Middle East that would bring more stability to the region.\n\nIn lengthy remarks to supporters, Trump went after Harris and the media with familiar barbs and promoted immigration and energy policies that are campaign staples. For example, he said immigrants are “taking the Black population jobs and they’re taking the Hispanic jobs.” Government data contradicts this claim, showing that immigrant labor contributes to economic growth and provides promotional opportunities for native-born workers.\n\nTrump was heading next to a rally in State College, Pennsylvania.\n\nSwenson reported from New York.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"NOVI, Mich. (AP) —&#160;Donald Trump&#160;further&#160;denigrated Detroit&#160;while appealing for votes Saturday in a suburb of the largest city in&#160;swing state Michigan. “I think Detroit and some...","url":"https://whdh.com/news/trump-denigrates-detroit-while-appealing-for-votes-in-a-suburb-of-michigans-largest-city/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/10/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbTJudHhkZjQwMDA3M2I2bTN2a3N1b3J6-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtMm50bHB4OTAwMHYyNnA5NWFnOTB3eXo.jpg?quality=60&strip=color","video":null,"publish_date":"2024-10-26 22:29:30","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.009},{"id":261228834,"title":"Mayor Adams Bucks Harris and Democrats on Calling Trump a ‘Fascist’","text":"Mayor Eric Adams of New York said on Saturday that former President Donald J. Trump should not be called a “fascist” or compared to Adolf Hitler, a rejection of Democrats’ closing focus in the final days of the 2024 campaign on the eve of Mr. Trump’s rally in Midtown Manhattan.\n\nThe embattled mayor, who has been indicted on federal bribery and corruption charges, made the comments at a time when Mr. Trump has been trying to make inroads with Black voters, and especially Black men, in his campaign against Vice President Kamala Harris, the Democratic nominee.\n\nMs. Harris has said in recent days that she agrees with Mr. Trump’s former White House chief of staff, Lt. Gen. John F. Kelly, that the former president meets the definition of a fascist. Mr. Kelly also described Mr. Trump as offering praise for Hitler.\n\nMr. Adams, mayor of America’s largest city and one of the country’s most prominent Black elected officials, was briefing reporters about security plans ahead of Mr. Trump’s rally Sunday at Madison Square Garden when he was asked if he believed the former president was a fascist.","summary":"Mayor Eric Adams of New York, an embattled Democrat who has been indicted on federal corruption charges, has been careful in what he says about the former president.","url":"https://www.nytimes.com/2024/10/26/us/politics/trump-fascist-mayor-adams.html","image":"https://static01.nyt.com/images/2024/10/26/multimedia/26election-live-adams-fchk/26election-live-adams-fchk-facebookJumbo.jpg","video":null,"publish_date":"2024-10-26 22:29:13","author":"Alyce McFadden,Maggie Haberman","authors":["Alyce McFadden","Maggie Haberman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":261224606,"title":"Trump calls Anderson Cooper of CNN by a woman’s name","text":"NOVI, Mich. – Former President Donald Trump has repeatedly referred to CNN anchor Anderson Cooper with a woman’s first name in recent days as the Republican presidential nominee focuses his closing message on a hypermasculine appeal to men.\n\nOn a Friday morning post on Trump’s social media site Truth Social, the former president referred to one of the most prominent openly gay journalists in the U.S. as “Allison Cooper.”\n\nTrump made the subtext even more explicit later Friday during a rally in Traverse City, Michigan, where he criticized a town hall Cooper hosted with Vice President Kamala Harris.\n\n“If you watched her being interviewed by Allison Cooper the other night, he’s a nice person. You know Allison Cooper? CNN fake news,” Trump said, before pausing and saying in a mocking voice: “Oh, she said no, his name is Anderson. Oh, no.”\n\nOn Saturday, Trump repeated the name during another Michigan rally. “They had a town hall,” Trump said. “Even Allison Cooper was embarrassed by it. He was embarrassed by it.”\n\nIn referring to Cooper with a woman’s name, Trump appeared to turn to a stereotype heterosexual people have long deployed against gay men. Such rhetoric evokes the trope of gay men as effeminate and comes as Trump aims to drive up his appeal among men in the final stages of his bid to return to the White House.\n\nThe former president on Friday recorded a three-hour interview with Joe Rogan, a former mixed martial arts commentator whose podcast is wildly popular among young men. On Oct 19, Trump kicked off a Pennsylvania rally discussing legendary golfer Arnold Palmer’s genitalia.\n\nThe Trump campaign did not respond to a request for comment. A representative for Cooper declined to comment.","summary":"NOVI, Mich. – Former President Donald Trump has repeatedly referred to CNN&#8230;","url":"https://internewscast.com/local-news/trump-calls-anderson-cooper-of-cnn-by-a-womans-name/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trump-refers-to-CNN039s-Anderson-Cooper-by-700x430.jpg","video":null,"publish_date":"2024-10-26 22:29:10","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.137},{"id":261227996,"title":"What We Know About Israel’s Strikes On Iran","text":"Skip to contentSkip to site index\n\nnew video loaded: What We Know About Israel’s Strikes On Iran\n\nWhat We Know About Israel’s Strikes On Iran\nBy Maria Abi-Habib, Christina Shaman, Nikolay Nikolov and Laura Salaberry•October 26, 2024\nAfter military-on-military attacks, will Israel and Iran be able to contain their conflict? Maria Abi-Habib, an investigative correspondent for The New York Times, looks at an unprecedented new chapter in the Middle East.\n\nBehind the Reporting\nRecent Episodes\n\nNOW PLAYING\nWhat We Know About Israel’s Strikes On Iran\n\nWhy Are North Korean Troops in Russia?\n\nHow the Storm Shook Up North Carolina’s Election\n\nIn Georgia, Harris Risks a Split in the Muslim and Arab Vote\n\nInside the Effort to Change How Seeds Grow\n\n3 Horror Movies to Watch for Halloween\n\nWhere Harris and Trump Stand on Abortion\n\nInside Wisconsin’s Fight Over Ballot Drop Boxes\n\nWhy Israel Targeted Yahya Sinwar\n\nWill the Polls in 2024 Be More Accurate Than in 2016 and 2020?\n\nElon Musk Is Going All In to Elect Donald Trump\n\nWhere Trump and Harris Stand on Immigration\n\nThe Brutal Reality of Panda Breeding\n\n4 Creepy Books to Read This Halloween\n\nGOP Is Making Inroads With Black and Hispanic Voters\n\nHow Palestinians Are Roadblocked in the West Bank\n\nHow Trump Distorted a Claim About Migrant Children\n\nHow Harris and Trump Are Battling for Pennsylvania\n\nWhy Milton and Helene ‘Exploded’ in Strength\n\nHow Book Bans Happen Under the Radar\n\nHow Trump’s Speeches Raise Questions About Age\n\nThe Fight for Rural America\n\nWhere Trump and Harris Stand on the Economy\n\nWhat to Know About the Verdict in the Tyre Nichols Case\n\nRecent episodes in Behind the Reporting\n\nNOW PLAYING\n\nWhat We Know About Israel’s Strikes On Iran\n\nWhy Are North Korean Troops in Russia?\n\nHow the Storm Shook Up North Carolina’s Election\n\nIn Georgia, Harris Risks a Split in the Muslim and Arab Vote\n\nInside the Effort to Change How Seeds Grow\n\n3 Horror Movies to Watch for Halloween\n\nWhere Harris and Trump Stand on Abortion\n\nInside Wisconsin’s Fight Over Ballot Drop Boxes\n\nWhy Israel Targeted Yahya Sinwar\n\nWill the Polls in 2024 Be More Accurate Than in 2016 and 2020?\n\nElon Musk Is Going All In to Elect Donald Trump\n\nWhere Trump and Harris Stand on Immigration\n\nShow more videos from Behind the Reporting\n\nLatest Video\nHong Kong Protests\n2020 Elections\nMost-Viewed\nVisual Investigations\nThe Dispatch\nDiary of a Song\nHow We Got Here\n\nAdvertisementSKIP ADVERTISEMENT\n\nSite Information Navigation\n\n© 2024 The New York Times Company\n\nAccessibility\nWork with us\n\nT Brand Studio\nYour Ad Choices\nPrivacy Policy\nTerms of Service\nTerms of Sale\n\nInternational\n\nSubscriptions\n\nManage Privacy Preferences","summary":"After military-on-military attacks, will Israel and Iran be able to contain their conflict? Maria Abi-Habib, an investigative correspondent for The New York Times, looks at an unprecedented new chapter in the Middle East.","url":"https://www.nytimes.com/video/world/middleeast/100000009785277/what-we-know-about-israels-strikes-on-iran.html","image":"https://static01.nyt.com/images/2024/10/26/world/middleeast/THUMBNAIL-iran/THUMBNAIL-iran-facebookJumbo.jpg?video-overlay","video":null,"publish_date":"2024-10-26 22:25:29","author":"Christina Shaman,Maria Abi-Habib,Nikolay Nikolov and Laura Salaberry","authors":["Christina Shaman","Maria Abi-Habib","Nikolay Nikolov and Laura Salaberry"],"language":"en","category":"politics","source_country":"us","sentiment":-0.119},{"id":261228304,"title":"Amber Rose Claims Beyoncé Stole Her RNC Speech After The Singer’s Appearance At Kamala Harris’ Houston Rally!","text":"Amber Rose is not too happy with Beyoncé right now…\n\nFor those who don’t know, the 41-year-old television personality publicly endorsed Donald Trump for the 2024 presidential election earlier this year. Fans could not believe her support for the convicted felon as she not only was once against him, but she founded SlutWalk — an organization fighting to end rape culture, including victim-shaming and slut-shaming of sexual assault victims. How could someone like her support Trump, who goes against what she stands for?! A man who a jury found he had committed sexual abuse! Not to mention he has been accused multiple times of sexual assault by other women! Like, how can she be backing this guy?!\n\nIt’s absolutely mind-boggling. Yet it happened. Amber even gave a speech at the Republican National Convention about why she’s voting for Trump. Now, here is where her current issue with Beyoncé comes in. Amber Rose claimed on Instagram on Friday night that the singer stole her RNC speech following her appearance at Kamala Harris’ rally in Houston! According to a screenshot from the Shade Room, the model wrote:\n\n“She wanna be me so bad. Literally took my whole speech.”\n\nFor starters, this is Queen Bey we are talking about here. We highly doubt she wants to be Amber! As for the speech? Both of the women did talk about motherhood and how that impacts who they were voting for. Other than that? These are two very different speeches! Beyoncé told the crowd in Houston on Friday at one point:\n\n“I’m not here as a celebrity. I’m not here as a politician. I’m here as a mother. A mother who cares deeply about the world my children and all of our children live in. A world where we have the freedom to control our bodies. A world where we’re not divided. Our past, our present, our future, merge to meet us here. Imagine our daughters growing up seeing what’s possible with no ceilings, no limitations. Imagine our grandmothers, imagine what they feel right now. Those who have lived to see this historic day.”\n\nWatch the powerful and uplifting speech (below):\n\n.@Beyonce’s full remarks in support of Vice President Harris pic.twitter.com/CPCaFKkO9o\n— Kamala HQ (@KamalaHQ) October 26, 2024\n\nAt the RNC in July, Amber also introduced herself as a mom, saying:\n\n“My whole world revolves around providing for my children, keeping them safe, and giving them an opportunity for a better life. That’s something that unites all American parents, whether we’re Republicans, Democrats, Conservatives, or Liberals — we all want a better country for our children. But I’m here tonight to tell you, no matter your political background, that the best chance we have to give our babies a better life is to elect Donald Trump, President of the United States.”\n\nWe still cannot believe she is for Trump now… Oof. Check it out (below):\n\nYeah… It’s a bit of a reach to say Bey stole the entire speech after watching both of them! And fans would agree! They took to the comments of the Shade Room and roasted Amber for her claims:\n\n“If REACHING were a person Amber please, not now”\n“Amber Rose, we promise you more than anything that Beyoncé does NOT want to be you”\n“To say THEEE beyonce wanna be you is wild asf”\n“Sorry she don’t even notice you”\n“The fact she typed this is hilarious… this is a stretch I didn’t see coming”\n“GIRL BYE – I’m a mother and all mothers worth their weight have the same wish, drive and dedication-”\n\nWhat do YOU think, Perezcious readers? Let us know in the comments!\n\n[Image via MEGA/WENN]","summary":"Amber Rose is not too happy with Beyoncé right now… For those who don&#8217;t know, the 41-year-old television personality publicly endorsed Donald Trump for the 2024 presidential election earlier this year. Fans could not believe her support for the convicted felon as she not only was once against him, but she founded SlutWalk &#8212; an [...]\n\n\nRead More...\n\n\nThe post Amber Rose Claims Beyoncé Stole Her RNC Speech After The Singer’s Appearance At Kamala Harris’ Houston Rally! appeared first on Perez Hilton.","url":"https://perezhilton.com/amber-rose-claims-beyonce-stole-rnc-speech-kamala-harris-houston-rally-appearance/","image":"https://perezhilton.com/wp-content/uploads/2024/10/Amber-Rose-Accuses-Beyonce-Of-Stealing-Her-RNC-Speech-After-Kamala-Harris-Rally.jpg","video":null,"publish_date":"2024-10-26 22:25:18","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","source_country":"us","sentiment":0.088}]}