{"offset":0,"number":50,"available":9797,"news":[{"id":366827478,"title":"Montreal universities brace for tensions as city marks Oct. 7 anniversary","text":"Advertisement oopStory continues belowThis advertisement has not loaded yet, but your article continues below.\n\n Manage My Account \n\nAdvertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.\n\nArticle contentAmid the continuing war, U.S. President Donald Trump claimed Sunday that his team was close to brokering a peace deal between Israel, Hamas and several countries.Article contentOn Truth Social, Trump said “very positive discussions” were underway to secure hostage releases and end the war in Gaza. “The technical teams will again meet Monday in Egypt,” he wrote. “The first phase should be completed this week.”Article content Montreal police stand and watch as a group of protesters set up a Sukkah on Monday. Photo by Dave Sidaway /Montreal GazetteArticle contentHow Montreal police and universities are preparingArticle contentWith several demonstrations and vigils planned across the city, Montreal police confirmed they will maintain a visible presence near universities on Tuesday but declined to provide operational details.Article contentAll major universities — including McGill, Concordia, Université de Montréal and UQAM — said they will remain open.Article contentMcGill provost Christopher Manfredi told students that classes will proceed as scheduled but entry to buildings will require valid identification.Article contentAdvertisement 3Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentMeanwhile, Concordia spokesperson Vannina Maestracci said additional security will be deployed but declined to share more details.Article content“Students can express their views and protest peacefully,” she added. “But blocking classrooms or entrances is prohibited and violence will not be tolerated.”Article contentAt UQAM, spokesperson Jenny Desrochers said the university “remains open and continues its activities,” while Université de Montréal spokesperson Geneviève O’Meara said professors were instructed to hold classes “unless conditions make it unsafe to do so.”Article contentWhat happened MondayArticle contentAhead of the anniversary, tensions flared at Concordia University on Monday as pro-Palestinian protesters began strike action, including picketing and classroom disruptions.Article contentVideos shared on social media show security officers confronting a small group of protesters.Article contentAdvertisement 4Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentIn one clip posted by SPHR Concordia — one of the main pro-Palestinian student groups — organizers accused university officials of assaulting students and urged others to join Tuesday’s demonstrations.Article contentMeanwhile the Federation CJA condemned the disruptions, saying they “threaten the safety of students and disrupt a peaceful campus environment.”Article contentYair Szlak, president and CEO of the Federation CJA, told The Gazette the Jewish community remains deeply shaken as the anniversary approaches.Article content“We’re still reeling from that act of war,” he said. “While we mourn and commemorate this day, we’re also seeing unbelievable levels of antisemitism on the streets of Montreal. Universities have a duty to keep all students safe — Jewish or not. We saw what happened last year when no action was taken.”Article content“Faculty have the right to demonstrate,” he added, “but when protests disrupt classes or turn violent, they must be held accountable.”Advertisement 2This advertisement has not loaded yet.\n\nAdvertisement 3Story continues belowThis advertisement has not loaded yet, but your article continues below.\n\nArticle content A group of protesters set up a Sukkah, a temporary, walled structure built for the Jewish holiday of Sukkot on the McGill University campus on Monday. Photo by Dave Sidaway /Montreal GazetteArticle contentOther students were seen preparing for the strikes by making signs. One student, who asked not to be named, said they supported the strike because Concordia “still invests in companies that profit from Israel.”Article contentThey added that the university’s disciplinary measures against activists have gone too far and that it has suppressed freedom of expression.Article contentEarlier Monday, a vigil was held on McGill’s downtown campus to honour victims and hostages of the Oct. 7 attack.Article content“It started around 11:30 and ended just before 1,” said Anastasia Zorchinsky, a Concordia Student Union council member who attended. “The purpose was to commemorate the victims and hostages — one of the biggest massacres of Jewish people since the Holocaust.”Article contentZorchinsky said the atmosphere on Montreal campuses has felt increasingly unsafe over the past two years.Article content“It’s very unsafe for any student, not even just Jewish students, to attend campus,” she said.Article contentAdvertisement 5Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentOn the hostages still held by Hamas, she added: “I really hope they come back. Everyone does. The war would have been over long ago if Hamas had surrendered and released them.”Article contentLater in the afternoon, dozens of students gathered on McGill’s lower field and erected a tent-like structure. Organizers from Independent Jewish Voices McGill — an anti-Zionist Jewish student group — said it was a sukkah, the traditional shelter built during Sukkot, reinterpreted as a political statement in solidarity with Palestinians.Article content“It’s meant to remind us of the instability faced by those fleeing oppression,” said organizer Hugo Victor Solomon. “In light of the ongoing genocide of the Palestinian people, we wanted to honour that and incorporate it into the spirit of the holiday.”Article contentSolomon added that he was also skeptical of Trump’s proposed peace deal.Article content“It feels naive to get my hopes up,” he said. “We’ve seen this before — brief ceasefires that collapse.Article content“But I want the death to stop. I want the bombing to stop. I want everyone imprisoned — Palestinian and Israeli alike — to be freed.”Article contentAdvertisement 3This advertisement has not loaded yet.\n\nFeatured Local Savings","summary":"Student strikes, vigils and protests planned across the city","url":"https://montrealgazette.com/news/montreal-universities-brace-for-tensions-as-city-marks-oct-7-anniversary","image":"https://smartcdn.gprod.postmedia.digital/montrealgazette/wp-content/uploads/2025/10/xxxxx-9715_299159092.jpg","video":null,"publish_date":"2025-10-07 01:02:50","author":"Harry North","authors":["Harry North"],"language":"en","source_country":"ca","sentiment":-0.058},{"id":366828038,"title":"Donald Trump Says Sean ‘Diddy’ Combs Asked for a Presidential Pardon After 4-Year Sentence","text":"Donald Trump said Sean “Diddy” Combs reached out for a presidential pardon — but it doesn’t sound like he’s getting one anytime soon.\n\n“A lot of people have asked me for pardons,” Trump said in the Oval Office on Monday. “I call him ‘Puff Daddy.’ He has asked me for a pardon.”\n\nQuestions have circulated for months over whether the president would be willing to use his presidential powers to pardon Combs following the disgraced music mogul’s federal sex crimes trial. On Friday, Combs was sentenced to four years and two months in prison after being found guilty on two counts of transportation to engage in prostitution. Trump did not give a firm answer on whether a pardon is coming, though he hinted back in August that the answer was probably a no.\n\n“You had the power and the resources to keep it going, and because you weren’t caught,” Judge Arun Subramanian told the rapper Friday at his sentencing hearing. “You paid for and organized these acts. You were no John. You were responsible for that, even if your currency was sexual desires and not money.”\n\nCombs’ sentence could have been worse with the prosecution asking for 11 years behind bars. His defense team asked for 14 months with credit for time served. The two prostitution convictions carried a maximum sentence of 10 years each. \n\nMonday didn’t mark the first time Trump had spoken on the topic. Back in August, the president was asked in a Newsmax interview if he would consider pardoning the music mogul ahead of his sentencing. Trump spoke to their personal relationship fraying as one reason he was on the fence.\n\n“You know, I was very friendly with him,” Trump said at the time. “I get along with him great, and he seemed like a nice guy. I didn’t know him well. But when I ran for office, he was very hostile.”\n\n“He said some not-so-nice things about you, sir,” Newsmax host Rob Finnerty said.\n\n“It’s hard, you know? Like you, we’re human beings, and we don’t like to have things cloud our judgment, right? But when you knew someone and you were fine, and then you run for office and he made some terrible statements, so I don’t know, it’s more difficult. Makes it more — I’m being honest — it makes it more difficult to do.”\n\n“But more likely a no for Combs, it sounds like?” Finnerty asked.\n\n“I would say so,” Trump said.\n\nIn the Oval Office on Monday, Trump was also asked about another high-profile figure people have questioned if he would pardon — Ghislaine Maxwell. While the Supreme Court rejected hearing the Jeffrey Epstein associate’s appeal on Monday, the president didn’t fully shut the book on that conversation.\n\n“You know, I haven’t heard the name in so long. I can say this, that I’d have to take a look at it. I would have to take a look.” Trump then asked about the Supreme Court ruling.\n\n“I will speak to the DOJ,” he said. “I wouldn’t consider it or not consider it. I don’t know anything about it, so, but I will speak to the DOJ.”","summary":"The disgraced music mogul was sentenced Friday after being found guilty on two counts of transportation to engage in prostitution\n\n\nThe post Donald Trump Says Sean ‘Diddy’ Combs Asked for a Presidential Pardon After 4-Year Sentence appeared first on TheWrap.","url":"https://www.thewrap.com/donald-trump-diddy-presidential-pardon-request/","image":"https://www.thewrap.com/wp-content/uploads/2025/10/Donald-Trump-Diddy.jpg","video":null,"publish_date":"2025-10-07 00:54:18","author":"Casey Loving","authors":["Casey Loving"],"language":"en","category":"politics","source_country":"US","sentiment":-0.436},{"id":366826734,"title":"Trump claims his tariff power helped avert India-Pakistan war, says “seven planes were shot down”","text":"APPresident Donald Trump speaks to reporters during an executive order signing in the Oval Office at the White House, Monday, Oct. 6, 2025, in Washington.\n\nUS President Donald J. Trump on Monday (local time) said that his power to impose tariffs prevented seven 'raging wars', including a major conflict between India and Pakistan during the recent Operation Sindoor.Responding to a question on whether he would change his stance on tariffs during a White House briefing, Trump said, \"If I didn't have the power of tariffs, you would have at least four of the seven wars raging... If you look at India and Pakistan, they were ready to go at it. Seven planes were shot down... I don't want to say exactly what I said, but what I said was very effective... Not only did we make hundreds of billions of dollars, but we're a peacekeeper because of tariffs.”Trump’s remarks referred to the tensions that followed India’s Operation Sindoor in May 2025, when the Indian Armed Forces conducted air and missile strikes on terror bases in Pakistan occupied Kashmir (PoK) and Pakistan, following a terror attack in Pahalgam that killed 26 civilians.This is not the first time Trump has claimed to have prevented a war between the two Asian neighbours as he has repeatedly cited tariffs as a key foreign policy tool to have helped to stop 'nuclear war' between India and Pakistan.India has consistently dismissed claims of foreign intervention in its national security operations. The Ministry of External Affairs reiterated that “no third-party mediation was sought or accepted” during Operation Sindoor. Officials have maintained that Pakistan had reached out to India's DGMO to stop the war.Live Events Prime Minister Narendra Modi has maintained India's autonomy in its national security decisions, particularly during Operation Sindoor. In a statement to the Lok Sabha on July 29, 2025, he clarified that \"no world leader asked India to stop its counter-terror operation against Pakistan.\"Furthermore, during his address to the nation on May 12, 2025, following the Pahalgam terror attack, Prime Minister Modi stressed on India's commitment to eradicating terrorism. He said, \"We gave full freedom to the Indian forces to wipe out the terrorists.\"External Affairs Minister S. Jaishankar also clarified that trade discussions with the US did not take place during the period of Operation Sindoor, countering Trump’s suggestion that tariff threats had any bearing on India’s military posture.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump tariffsIndia Pakistan conflictOperation Sindoortariff powerIndia Pakistan tensionUS President Donald J. Trumptrump on india pakistan warLok Sabhatrump tariffs on indiatrump tariff news\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump tariffsIndia Pakistan conflictOperation Sindoortariff powerIndia Pakistan tensionUS President Donald J. Trumptrump on india pakistan warLok Sabhatrump tariffs on indiatrump tariff news(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"US President Donald J. Trump asserted his tariff authority averted seven wars. He specifically mentioned preventing a major India-Pakistan conflict during Operation Sindoor. India has consistently rejected foreign intervention claims. New Delhi maintains its national security operations are autonomous. India's External Affairs Minister confirmed no trade talks occurred during the operation.","url":"https://economictimes.indiatimes.com/news/india/trump-claims-his-tariff-power-helped-avert-india-pakistan-war-says-seven-planes-were-shot-down/articleshow/124350880.cms","image":"https://img.etimg.com/thumb/msid-124350921,width-1200,height-630,imgsize-81690,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-07 00:49:41","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","source_country":"in","sentiment":-0.116},{"id":366826696,"title":"Biden judge gives Trump brutal 48-hour deadline as Dems sue over troops deploying in crime-ravaged Chicago","text":"A Biden-appointed judge is giving Donald Trump 48 hours to respond to a lawsuit led by Democrat leaders in Illinois over his efforts to deploy the National Guard to Chicago. \n\nJudge April Perry set a midnight Wednesday deadline for a response from the federal government and scheduled a Thursday hearing in the lawsuit filed Monday.\n\nIn the meantime, Perry has opted not to temporarily block the deployment, paving the way for Trump to send in as many as 200 Texas National Guard troops overnight.\n\nAccording to The New York Times, the troops will be flown in via military aircraft and will begin operations on the ground no sooner than Wednesday. \n\nThe lawsuit railing against the move alleges that 'these advances in President Trump's long-declared ''War'' on Chicago and Illinois are unlawful and dangerous.'\n\n'The American people, regardless of where they reside, should not live under the threat of occupation by the United States military, particularly not simply because their city or state leadership has fallen out of a president's favor,' the lawsuit says.\n\nTrump has argued that the troops are needed to help fight crime in Chicago and to ensure that federal agents can enforce immigration laws in the city, which limits cooperation with federal immigration enforcement.\n\nThe president threatened Monday to use emergency powers against rebellion to deploy more troops into Democratic-led US cities, intensifying his rhetoric as his attempts to mobilize the military face legal challenges.\n\nThe Republican leader openly mulled use of the Insurrection Act after a federal judge in Oregon temporarily halted a National Guard deployment in Portland, while another judge in Illinois allowed a similar move to proceed for now in Chicago. \n\nBoth cities have seen surges of federal agents as part of Trump's mass deportation drive, prompting protests outside immigration processing facilities.\n\n'We have an Insurrection Act for a reason. If I had to enact it I would do that,' Trump told reporters in the Oval Office.\n\n'If people were being killed and courts were holding us up or governors or mayors were holding us up, sure I would do that.'\n\nIllinois officials had filed a suit seeking to block the deployment in Chicago, but Judge Perry, an appointee of Trump's Democratic predecessor Joe Biden, declined to issue an immediate temporary restraining order.\n\nShe scheduled a full hearing on the matter for Thursday and asked the government to inform the court to provide more information.\n\nThe debate mushroomed after it became known that Republican-led Texas was planning to send 200 of its federalized National Guard troops to Illinois, a move that infuriated Democratic Governor JB Pritzker.\n\n'They should stay the hell out of Illinois,' said Pritzker.\n\nHe also accused federal immigration agents conducting raids in Chicago of 'thuggery,' using 'excessive force,' and illegally detaining US citizens.\n\nTrump's comments about the centuries-old Insurrection Act came just minutes after Pritzker warned that Trump was creating a pre-meditated 'escalation of violence' as a pretext to invoke the emergency powers. \n\n'The Trump administration is following a playbook: cause chaos, create fear and confusion, make it seem like peaceful protesters are a mob by firing gas pellets and tear gas canisters at them,' Pritzker told a press conference.\n\n'Why? To create the pretext for invoking the Insurrection Act so that he can send the military to our city.'\n\nTrump over the weekend authorized deployment of 700 National Guard members to Chicago despite the opposition of elected Democratic leaders including Pritzker and the city's mayor.\n\nIn their lawsuit, the state Attorney General Kwame Raoul and counsel for Chicago accused Trump of using US troops 'to punish his political enemies.'\n\n'The American people, regardless of where they reside, should not live under the threat of occupation by the United States military, particularly not simply because their city or state leadership has fallen out of a president's favor,' they said.\n\nIn the press conference with Pritzker, Raoul described such planned deployments to Illinois as 'unlawful and unconstitutional, no matter where these forces come from.'\n\nHomeland Security Secretary Kristi Noem has defended the plan to send troops to Chicago, claiming that the third-largest US city is 'a war zone.'\n\nTrump has similarly called Portland 'war-ravaged,' but District Judge Karin Immergut issued a temporary block on the Oregon troop deployment, saying 'the president's determination was simply untethered to the facts.'\n\n'This is a nation of Constitutional law, not martial law,' wrote Immergut, a Trump appointee.\n\nThe Trump administration is appealing the ruling, the White House said.\n\nIllinois and Oregon are not the first states to file legal challenges against the Trump administration's deployment of the National Guard.\n\nCalifornia filed suit after Trump sent troops to Los Angeles earlier this year to quell protests sparked by a crackdown on undocumented migrants, with the case still working its way through courts.","summary":"Judge April Perry set a midnight Wednesday deadline for a response from the federal government and scheduled a Thursday hearing in the lawsuit filed Monday.","url":"https://www.dailymail.co.uk/news/article-15168391/Biden-judge-Trump-brutal-deadline-troops-Chicago.html","image":"https://i.dailymail.co.uk/1s/2025/10/07/01/102761839-0-image-a-19_1759796823238.jpg","video":null,"publish_date":"2025-10-07 00:41:52","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.482},{"id":366826714,"title":"Gavin Newsom rages at Trump as FAA issues warning that there will be no air traffic controllers at Burbank Airport","text":"California Governor Gavin Newsom has slammed Donald Trump as travelers in Los Angeles brace for chaos and major delays to flights due to the government shutdown.\n\nThe Federal Aviation Authority on Monday warned air traffic control towers at Hollywood Burbank Airport would be unmanned until at least 10pm local time.\n\nNewsom blamed the lack of staffing on the government shutdown and hammered Trump on X. \n\n'Thanks, @realDonaldTrump! Burbank Airport has ZERO air traffic controllers from 4:15pm to 10pm today because of YOUR government shutdown,' the California governor wrote. \n\nThe White House, when asked for comment by The Daily Mail, sent an automatic reply putting responsibility for the shutdown on Democrats. \n\n'Due to staff shortages resulting from the Democrat Shutdown, the typical 24/7 monitoring of this press inbox may experience delays,' it read.\n\n'As you await a response, please remember this could have been avoided if the Democrats voted for the clean Continuing Resolution to keep the government open.'\n\nWithout on-site air traffic controllers, the airport's arrivals and departures will be managed by TRACON, a team working out of San Diego which already handles much of Burbank's traffic. \n\nThe FAA told ABC7 that it was working to get staffers to the airport before 10pm local time. \n\nHowever, for the time being, the Burbank Airport air traffic tower is not being manned by anyone. \n\nAirports in both Denver and Newark were also experiencing ground delays due to staffing shortages, The New York Times reported. \n\nDenver International Airport currently faces delays of about 40 minutes, while Newark Liberty International Airport is close to an hour. \n\nIt's unclear how long staffing issues would affect schedules or how many employees have left their post. \n\nThe government shutdown is currently in its sixth day with no sign of a resolution in the Senate. \n\nTransportation Secretary Sean Duffy said Monday that the government shutdown is putting more stress on air traffic controllers who already have an extremely stressful job, as well as threatening a program that small communities rely on to help subsidize airline service.\n\nControllers are expected to continue working without a paycheck, Duffy said, so they are now worried about how to pay their bills in addition to worrying about keeping flights safe.\n\n'Now what they think about as they´re controlling our airspace is, how am I going to pay my mortgage? How do I make my car payment? I have a couple kids at home. How do I put food on the table? I´m working six days a week. Do I have to take a second job and drive Uber when I'm already exhausted from doing a job that's already stressful to think about how I can make extra money because the government may not provide me a paycheck?' Duffy said.\n\nThe Transportation Department has been able to keep the air traffic controller academy in Oklahoma City open for now with funding from previous years, but Duffy is still concerned about the potential impact on efforts to hire and train new controllers in the hope of eliminating a longstanding shortage. \n\nDuffy said the support staff who train controllers after they come out of the academy could be laid off.\n\nThe head of the air traffic controllers union, Nick Daniels, stayed away from political comments, but he urged Congress to end the shutdown.\n\n'We need to bring this shutdown to a close, so that the Federal Aviation Administration and the committed aviation safety professionals can put this distraction behind us, and completely focus on their vital work,' Daniels said.\n\nDuffy said there has already been a small uptick in controllers calling out sick in a few places. \n\nIf that gets worse as the shutdown drags on, the FAA could be forced to reduce the number of takeoffs and landings, which would create delays and possibly cancellations.\n\nThe Essential Air Service program that subsidizes airline service to small communities across the country will also quickly run out of money. \n\nDuffy said that program enjoys strong bipartisan support and provides an important lifeline to many small communities. \n\nIt is especially important in Alaska, where flying is the only way to travel between many communities.\n\n'That money runs out this Sunday. So there´s many small communities across the country that will now no longer have the resources to make sure they have air service in their community,' Duffy said.","summary":"The Federal Aviation Authority on Monday warned air traffic control towers at Hollywood Burbank Airport would be unmanned until at least 10pm local time.","url":"https://www.dailymail.co.uk/news/article-15168369/Gavin-Newsom-rages-Trump-FAA-issues.html","image":"https://i.dailymail.co.uk/1s/2025/10/07/01/102761093-0-image-a-23_1759795686974.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/25/3225338855377946075/1024x576_MP4_3225338855377946075.mp4","publish_date":"2025-10-07 00:39:05","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.339},{"id":366824934,"title":"Gavin Newsom Lashes Out at Trump for Lack of Air Traffic Controllers","text":"California Governor Gavin Newsom criticized President Donald Trump amidst anticipated travel disruptions in Los Angeles due to the government shutdown.\n\nThe Federal Aviation Authority announced on Monday that air traffic control towers at Hollywood Burbank Airport would be unstaffed until at least 10pm local time.\n\nNewsom blamed the lack of staffing on the government shutdown and hammered Trump on X. \n\n“Thanks, @realDonaldTrump! Burbank Airport has ZERO air traffic controllers from 4:15pm to 10pm today because of YOUR government shutdown,” the California governor expressed.\n\nThe White House, when asked for comment by The Daily Mail, sent an automatic reply putting responsibility for the shutdown on Democrats. \n\n‘Due to staff shortages resulting from the Democrat Shutdown, the typical 24/7 monitoring of this press inbox may experience delays,’ it read.\n\n“As you await a response, please remember this could have been avoided if the Democrats voted for the clean Continuing Resolution to keep the government open.”\n\nIn the absence of on-site air traffic controllers, TRACON, a team based in San Diego that manages a significant portion of Burbank’s air traffic, will oversee the airport’s arrivals and departures.\n\nThe FAA told ABC7 that it was working to get staffers to the airport before 10pm local time. \n\nHowever, for the time being, the Burbank Airport air traffic tower is not being manned by anyone. \n\nAirports in both Denver and Newark were also experiencing ground delays due to staffing shortages, The New York Times reported. \n\nDenver International Airport currently faces delays of about 40 minutes, while Newark Liberty International Airport is close to an hour. \n\nIt’s unclear how long staffing issues would affect schedules or how many employees have left their post. \n\nThe government shutdown is currently in its sixth day with no sign of a resolution in the Senate. \n\nTransportation Secretary Sean Duffy said Monday that the government shutdown is putting more stress on air traffic controllers who already have an extremely stressful job, as well as threatening a program that small communities rely on to help subsidize airline service.\n\nControllers are expected to continue working without a paycheck, Duffy said, so they are now worried about how to pay their bills in addition to worrying about keeping flights safe.\n\n‘Now what they think about as they´re controlling our airspace is, how am I going to pay my mortgage? How do I make my car payment? I have a couple kids at home. How do I put food on the table? I´m working six days a week. Do I have to take a second job and drive Uber when I’m already exhausted from doing a job that’s already stressful to think about how I can make extra money because the government may not provide me a paycheck?’ Duffy said.\n\nThe Transportation Department has been able to keep the air traffic controller academy in Oklahoma City open for now with funding from previous years, but Duffy is still concerned about the potential impact on efforts to hire and train new controllers in the hope of eliminating a longstanding shortage. \n\nDuffy said the support staff who train controllers after they come out of the academy could be laid off.\n\nThe head of the air traffic controllers union, Nick Daniels, stayed away from political comments, but he urged Congress to end the shutdown.\n\n‘We need to bring this shutdown to a close, so that the Federal Aviation Administration and the committed aviation safety professionals can put this distraction behind us, and completely focus on their vital work,’ Daniels said.\n\nDuffy said there has already been a small uptick in controllers calling out sick in a few places. \n\nIf that gets worse as the shutdown drags on, the FAA could be forced to reduce the number of takeoffs and landings, which would create delays and possibly cancellations.\n\nThe Essential Air Service program that subsidizes airline service to small communities across the country will also quickly run out of money. \n\nDuffy said that program enjoys strong bipartisan support and provides an important lifeline to many small communities. \n\nIt is especially important in Alaska, where flying is the only way to travel between many communities.\n\n‘That money runs out this Sunday. So there´s many small communities across the country that will now no longer have the resources to make sure they have air service in their community,’ Duffy said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCalifornia Governor Gavin Newsom criticized President Donald Trump amidst anticipated travel disruptions&#8230;\n\n\nThis Post: Gavin Newsom Lashes Out at Trump for Lack of Air Traffic Controllers first appeared on Internewscast Journal","url":"https://internewscast.com/news/gavin-newsom-lashes-out-at-trump-for-lack-of-air-traffic-controllers/","image":"https://internewscast.com/wp-content/uploads/2025/10/Gavin-Newsom-rages-at-Trump-over-air-traffic-controller-shortage.jpg","video":null,"publish_date":"2025-10-07 00:38:07","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.267},{"id":366824282,"title":"Gaza talks turn to key sticking points between Israel and Hamas","text":"SHARM EL-SHEIKH, Egypt - Delegations from Israel and Hamas held their first day of indirect negotiations in Egypt on Monday on U.S. President Donald Trump's plan to halt the war in Gaza, wrestling with contentious issues such as demands that Israel withdraw and Hamas disarm.Israel and Hamas have both endorsed the overall principles behind Trump's plan, under which fighting would cease, hostages would go free and aid would pour into Gaza.The plan also has the backing of Arab and Western states. Trump has called for negotiations to take place swiftly toward a final deal, in what Washington hails as the closest the sides have yet come to ending the 2-year-old conflict.","summary":"Israel and Hamas both endorse the overall principles behind Trump's plan, under which fighting would cease, hostages would go free and aid would pour into Gaza.","url":"https://www.japantimes.co.jp/news/2025/10/07/world/politics/gaza-talks-sticking-points-israel-hamas/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/10/07/498131.jpg?v=3.1","video":null,"publish_date":"2025-10-07 00:37:00","author":"Ahmed Fahmy,Andrew Mills,Nidal Al-Mughrabi,Web Master","authors":["Ahmed Fahmy","Andrew Mills","Nidal Al-Mughrabi","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.511},{"id":366825328,"title":"Who is Karin Immergut, the Judge Who Blocked Trump's Oregon Troop Plan Twice in Two Days?","text":"A federal judge appointed by President Donald Trump has twice ruled against him in recent days, blocking his efforts to deploy National Guard troops to Oregon. Late on Sunday, Judge Karin J Immergut issued a temporary restraining order halting Trump's plan to send California National Guard units to Portland, Oregon. It was the second time in two days she had sided against the administration. On Saturday, Immergut also blocked the President from federalising the Oregon National Guard, warning that the administration's arguments for doing so \"risk blurring the line between civil and military federal power — to the detriment of this nation.\" Trump Lashes Out at His Own Appointee The infuriated the President, who said: \"I wasn't served well by the people that pick judges.\" \"I appointed the judge, and he goes like that,\" Trump told reporters. \"So, I wasn't served well. Obviously, if he made that decision — Portland is burning to the ground. You have agitators, instigators, all you have to do is look at your television… It's burning to the ground. The governor, the mayor, the politicians, they're petrified for their lives. And that judge, he ought to be ashamed of himself.\" Trump repeatedly referred to the judge as a man during his remarks. White House Deputy Chief of Staff Stephen Miller also attacked the ruling, calling it a \"legal insurrection\" in a post on X. formerly Twitter. Who is Judge Karin J Immergut? Immergut, 64, is a long-serving legal professional with decades of experience in Oregon's judicial system. Born in Brooklyn, New York, she attended Amherst College and earned her law degree from the University of California, Berkeley in 1987. She began her career at the law firm Covington & Burling in Washington, DC, before serving as an assistant US attorney in California from 1988 to 1992. Immergut has spent much of her professional life in Oregon. She worked as an assistant US attorney there from 2001 to 2003 before being nominated by President George W Bush to serve as U.S. attorney for the District of Oregon, a position she held until 2009. Also Read: Trump Just Sent Troops to Oregon — Here's Why California Governor Newsom Says It's 'Authoritarian' From 2009 to 2019, she served as a judge on the Multnomah County Circuit Court in Portland, overseeing felony cases, complex civil matters and death penalty proceedings. In her 2019 questionnaire for the Senate Judiciary Committee, Immergut wrote that she had presided over roughly 250 trials and hundreds of civil motions. \"I have also handled dozens of judicial settlement conferences in both civil and criminal cases,\" she said, noting her work on the court's drug diversion program aimed at rehabilitation. The Senate confirmed her 2019 appointment to the federal bench by voice vote, after the Judiciary Committee advanced her nomination by 20–2. Only Democratic Senators Mazie Hirono of Hawaii and Kamala Harris of California voted against her. Part of the Clinton Impeachment Probe Immergut briefly stepped into the national spotlight in 1998 when she worked as associate independent counsel for Kenneth Starr during the investigation that led to the impeachment of President Bill Clinton. She was one of two lawyers who personally interviewed Monica Lewinsky about her relationship with the president. Critics accused the team of asking invasive questions, but Immergut later defended her approach. She said she needed \"very detailed information about those [sexual] contacts because the perjury allegation was dependent on the details of the President's testimony.\" In May 2024, Chief Justice John Roberts appointed Immergut to a seven-year term on the Foreign Intelligence Surveillance Court (FISC), which reviews government requests to conduct electronic surveillance and searches in national security investigations. Judges on the court undergo additional background checks to handle classified material. She is also listed to teach a Stanford Law School course in 2025 titled \"The Role of the Special Counsel: From Watergate to Jack Smith.\" Immergut's rulings mark the latest judicial pushback against President Trump's attempts to deploy federal forces to US cities. Governor JB Pritzker of Illinois and officials in Oregon have called Trump's deployment plans unconstitutional, setting up an intensifying legal and political showdown. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Immergut's rulings mark the latest judicial pushback against President Trump's attempts to deploy federal forces to US cities","url":"https://www.timesnownews.com/world/us/us-news/who-is-judge-karin-immergut-us-president-donald-trump-oregon-national-guard-article-152953556","image":"https://images.timesnownews.com/thumb/msid-152953557,thumbsize-27492,width-1280,height-720,resizemode-75/152953557.jpg","video":null,"publish_date":"2025-10-07 00:33:24","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.306},{"id":366826688,"title":"Biggest Bombshells From Kamala Harris' Book '107 Days' — Including Biden's 'Reckless' Reelection Bid and How He Failed to Defend Her From Critics","text":"Kamala Harris does not hold back in her new book, calling out the former president several times.\n\nRadarOnline.com can reveal the biggest revelations from 107 Days.Letting Joe Biden Decide on Reelection Was 'Reckless'For Harris, letting Joe and Jill Biden decide on the 46th U.S. president's reelection was foolhardy.\n\n\"'It's Joe and Jill's decision.' We all said that, like a mantra, as if we'd all been hypnotized. Was it grace, or was it recklessness? In retrospect, I think it was recklessness,\" the former vice president wrote in her new book, 107 Days.\n\nKamala added, per the first excerpt shared by The Atlantic, \"The stakes were simply too high. This wasn't a choice that should have been left to an individual's ego, an individual's ambition. It should have been more than a personal decision.\"Why Kamala Harris Never Urged Joe Biden to End His Reelection BidIn 107 Days, Harris admitted for the first time that she could not tell Joe to step aside despite the heightened concerns over his health and age.\n\n\"During all those months of growing panic, should I have told Joe to consider not running? Perhaps,\" Harris wrote. \"But the American people had chosen him before in the same matchup. Maybe he was right to believe that they would do so again.\"\n\nShe explained: \"And of all the people in the White House, I was in the worst position to make the case that he should drop out. I knew it would come off to him as incredibly self-serving if I advised him not to run. He would see it as naked ambition, perhaps as poisonous disloyalty, even if my only message was: Don't let the other guy win.\"\n\nJill, on the other hand, declared she was \"all in\" on her husband's bid to maintain his position as the presumptive Democratic presidential nominee. She told a military crowd in Wilmington, North Carolina, she would back Joe as \"he has always supported [her] career.\"How Kamala Harris Reacted When Joe Biden Barely Mentioned Her in His Oval Office AddressHarris watched Joe's Oval Office exit speech at a hotel, calling the former president's address a \"good one\" that drew \"on the history of the presidency to locate his own place within it.\"\n\nHowever, she took notice of how he barely mentioned her, with her staff pointing out \"it was almost nine minutes into the 11-minute address\" before they heard Harris' name.\n\n\"I want to thank our great vice president, Kamala Harris. She is experienced, she's tough, she's capable. She's been an incredible partner to me and a leader for our country,\" she quoted Joe, adding, \"And that was it.\"Joe Biden's Team Failed to Defend Kamala Harris PubliclyHarris' relationship with the White House and Joe's staff seemed troubled, as she wrote about the alleged profound distrust they held toward her.\n\n\"When Fox News attacked me on everything from my laugh, to my tone of voice, to whom I'd dated in my 20s, or claimed I was a 'DEI hire,' the White House rarely pushed back with my actual résumé: two terms elected D.A., top cop in the second-largest department of justice in the United States, senator representing one in eight Americans,\" she pointed out.\n\nShe also dropped her complaints and expressed frustrations with the White House communications team for failing to fight back and defend her against bad press.\n\nPer Harris, she \"often learned that the president's staff was adding fuel to negative narratives that sprang up around [her].\" Although the stories were \"unfair or inaccurate,\" she alleged Joe's inner circle \"seemed fine with it.\"\n\n\"Indeed, it seemed as if they decided I should be knocked down a little bit more,\" Harris added.Joe Biden's Inner Circle Resented Kamala Harris' PopularityIn her account, Harris said people around Joe \"didn't like the contrast that was emerging,\" recalling how his inner circle was not pleased when the polls showed her rising popularity during the then-president's 2024 campaign.\n\nShe mentioned her Selma, Alabama, speech about the humanitarian crisis in Gaza in her book, noting it was \"vetted and approved\" by the White House and the National Security Council. According to Kamala, the West Wing was reportedly displeased when the address went viral.\n\n\"I was castigated for, apparently, delivering it too well,\" she divulged.\n\nHarris wrote: \"Their thinking was zero-sum: If she's shining, he's dimmed. None of them grasped that if I did well, he did well. That given the concerns about his age, my visible success as his vice president was vital. It would serve as a testament to his judgment in choosing me and reassurance that if something happened, the country was in good hands. My success was important for him. His team didn't get it.\"Joe Biden's Debate Blunder Stemmed From ExhaustionAlthough Harris criticized the reelection bid's \"recklessness\" and the resentment from Joe's aides, she still defended the ex-POTUS while writing about his disastrous debate performance against Donald Trump.\n\n\"Many people want to spin up a narrative of some big conspiracy at the White House to hide Joe Biden's infirmity,\" she shared. \"Here is the truth as I lived it. Joe Biden was a smart guy with long experience and deep conviction, able to discharge the duties of president. On his worst day, he was more deeply knowledgeable, more capable of exercising judgment, and far more compassionate than Donald Trump on his best.\"\n\nRather than attributing it to cognitive decline, Harris suggested Joe's fumble was due to fatigue as the debate happened \"after two back-to-back trips to Europe and a flight to the West Coast for a Hollywood fundraiser.\"\n\nShe strongly highlighted in the book: \"I don't believe it was incapacity. If I believed that, I would have said so. As loyal as I am to President Biden, I am more loyal to my country.\"","summary":"Kamala Harris' new book, '107 Days,' uncovers shocking moments from her whirlwind presidential run during the 2024 election.","url":"https://radaronline.com/p/kamala-harris-book-107-days-biggest-bombshells-joe-biden-reckless/","image":"https://media.radaronline.com/brand-img/AEdkWCEt4/0x0/kamala-harris-new-book-107-days-biggest-bombshells-1759740417991.jpg","video":null,"publish_date":"2025-10-07 00:30:00","author":"Angilene Gacute","authors":["Angilene Gacute"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":366826480,"title":"Galamsey Operations A Betrayal Of Our Homeland  Ghana ","text":"By: Rev. Fr. Ignatius James Yaw Amponsah \n\nINTRODUCTION \n\nMy dear country men and women, our dear motherland Ghana is at the crossroads, and seems to be thorn between the devil and the deep blue sea. This precarious situation has arisen considering the current situation of Ghana our Motherland, where reports from the illegal mining enclave claim that pregnant women have been giving birth to disfigured and malformed babies. Apropos wildlife, animals in the bush are drinking from stagnant water bodies contaminated with poisonous heavy chemicals like mercury, arsenic, cyanide, iron, lead etc. The devastated forest and arable farmlands besides, poisoning of foodstuffs, water bodies and our share of the sea that God has given us, with careless abandon, are all due to the destructive and very dangerous surface mining that has today become an OPEN NATIONAL SORE. This bodes ill for the national health and image of our beloved country Ghana \n\nIS GALAMSEY OPERATIONS A BETRAYAL OF THE GHANAIAN ETHOS? \n\nMany Africans were righteously angry when President Donald Trump classified some African migrants in the USA, as coming from “SHIT – HOLE” countries. As an African and a Reverend Father, not only do I see the description as un-presidential, but PLEASE, let us not cover up for those, who have looked on, and allowed Motherland, Ghana to be so devastated by the activities of galamsey. The country is virtually on its knees because foreigners are those who are led on by Ghanaian \n\nnationals, to destroy the ecosystem, the food-chain and the hydrogen and carbon cycles. Those entrusted with the public purse and the national security architecture of Ghana, should be blamed heavily for the devastation of Ghana’s arable lands and water bodies. They have or had every opportunity to stop destructive and dangerous surface mining in Ghana, but they have failed so far to exercise their constitutional mandate because of their parochial and vested interest. \n\nThe MOST PAINFUL PART of this galamsey debacle is that, some people even argue that the galamsey operations is the source of livelihood for over 3 million Ghanaians, as if to suggest that the earnings from gold are more valuable or precious than the lives of the over 33 million Ghanaians. As a very passionate Ghanaian, some questions agitate the mind and beg for answers. \n\nThe questions we all need to ask as Ghanaians are: \n\n Is gold the only commodity that can help us to take care of the financial needs of Ghana, such that we should allow such a devastation to hit the nation? \n Can duty bearers and government appointees including the minerals commission tell us the percentage of gold exports that the state benefits from galamsey activities, and how much by way of taxes goes into the national kitty? \n If Ghana bans surface mining and concentrates only on underground mining, will we not be able to take care of our financial needs as a NATION? \n Why has the death of the eight (8) noble Ghanaians not been the most potent justification for eliminating galamsey operations in the country forthrightly? Don’t we betray the collective memories of the gallant eight (8) men who \n\nperished in the helicopter crash if we continue to pussy-foot about the galamsey menace? \n\nIndeed, we can’t blame anybody else for the unprecedented ENVIRONMENTAL DEVASTATION that has hit Ghana our Motherland, except those, who have been put in-charge of the nation to manage its resources for the common good of all the citizens. \n\nSTATE OF EMERGENCY: TO BE OR NOT TO BE \n\nWe need a STATE OF EMERGENCY on galamsey now!. Simply because there is no time to waste, due to all the terrible consequences of the activities of galamsey on the social, economic, cultural, environmental, and political as well as the national security implications for the survival of the 36 million Ghanaian population. With all due respect, our Motherland Ghana, on fire; and anybody pushing away the call for the STATE OF EMERGENCY on galamsey, is just simply asking Ghanaians to use buckets to put off the fire instead of water tankers. If such people begin to see some of their family members giving birth to malformed babies, probably they will see how the galamsey menace is so close to them. \n\nRespectfully, some people are making the lame argument that, the STATE OF EMERGENCY on galamsey will prevent people from going on with their genuine or rightful duties, and that it will bring untold hardships to innocent people. This emotive argument is invalid; and with the greatest respect, such people are unknowingly throwing huge dust onto the eyes of the public. The state of emergency will be specific to galamsey operations, unauthorized possession and movement of mining chemicals and equipment shall be a crime against the state. How this direct \n\nmeasure targeted to deal with the galamsey menace and the industry around it affect \n\nfarming activities and daily economic and business ventures of the residents in the enclave is the biggest joke of the century. \n\nALTERNATIVE LIVELIHOODS FOR THE YOUTH IN GALAMSEY \n\nThe call for the introduction of alternative livelihoods for the youth in the galamsey endemic areas is a very important one. Accordingly, as far as the youth, who are in galamsey are concerned, wherever they are, they can be assembled and given aggressive and effective EDUCATION on the terrible CONSEQUENCES of their activities at the galamsey sites. This should be the point of contact where the need emerges also to encourage them to embrace alternative and sustainable livelihoods. \n\nIt is my firm belief that if the said youth are given aggressive and effective EDUCATION on the terrible CONSEQUENCES of their galamsey business, they will NOT allow themselves to be misused by some of the political party financiers, who are heavily involved in the terrible devastation of our arable farmlands and water bodies through galamsey. \n\nAfter the said education, interested youth, who want to be employed for the reclamation of the devasted lands and water bodies, should be registered for employment, that goes with a living wage, to enable them to take care of themselves and their families. \n\nThe youth in the land reclamation and afforestation programme, should be encouraged to take care of the trees planted, until such time that, they can be migrated onto the government’s flash ship programming of agribusiness.\n\nThe protocol for reclamation of land in galamsey endemic areas should emphasis that, NO FOOD CROPS SHOULD BE PLANTED IN THE CONTAMINATED AREAS, since the heavy metals stay in the soil for very long periods. Rather, economic trees should be planted to prevent people from consuming poisonous chemicals that are already embedded in the soil, and which the crops will absorb eventually. \n\nCONCLUSION \n\nIt is the opinion of many that galamseyers, who are bent on continuously poisoning Ghanaians and not willing to obey the dictates of the STATE OF EMERGENCY on galamsey, because of their parochial interest, should be REMOVED FROM OUR MIDST and kept somewhere else; just to enable Ghanaians to enjoy a HEALTHY ENVIRONMENT, for the good of all, and to the Glory of God. \n\nWritten By: \n\nRev. Fr. Ignatius James Yaw Amponsah \n\nAkyem Ntronang \n\n[email protected] \n\nMobile: (0240744686)","summary":"Galamsey Ghana Illegal Mining By: Rev. Fr. Ignatius James Yaw Amponsah    INTRODUCTION  My dear country men and women, our dear motherland Ghana is at the crossroads,  and seems to be thorn between the devil and the deep blue sea. This precarious  situation has arisen considering the current situation of Ghana our Motherland, where reports from [&#8230;]\n\n\nThe post Galamsey Operations A Betrayal Of Our Homeland  Ghana  appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/10/07/galamsey-operations-a-betrayal-of-our-homeland-ghana/","image":"https://b843437.smushcdn.com/843437/wp-content/uploads/2025/09/galamsey-ghana-illegal-mining-scaled.webp?lossy=2&strip=1&webp=1","video":null,"publish_date":"2025-10-07 00:27:12","author":"Ghana News","authors":["Ghana News"],"language":"en","source_country":"gh","sentiment":-0.191},{"id":366824572,"title":"The disgraceful leniency shown to Brett Kavanaugh’s would-be assassin","text":"Just weeks after a crazed killer fatally shot conservative Charlie Kirk, a liberal judge let off Supreme Court Justice Brett Kavanaugh’s would-be assassin with a sentence of a mere eight years, instead of the 30 years prosecutors sought.\n\nIs there any wonder “assassination culture” is on the rise?\n\nGood for Attorney General Pam Bondi for vowing to have the Justice Department appeal this outrageous, misguided leniency.\n\n“The attempted assassination of Supreme Court Justice Brett Kavanaugh was a disgusting attack against our entire judicial system by a profoundly disturbed individual,” Bondi tweeted.\n\n“@TheJusticeDept will be appealing the woefully insufficient sentence.”\n\nIn issuing the sentence, Judge Deborah Boardman (who was appointed by President Joe Biden) apparently took pity on Nicholas Roske, who came from California with a pistol, ammunition, zip ties, pepper spray and burglary tools in a plot to kill the right-leaning justice at his Maryland home after the Supreme Court’s decision to strike down Roe v. Wade.\n\nRoske later admitted he was targeting at least three justices in a bid to alter the court’s decisions “for decades to come,” per the feds.\n\nTrue, Roske — who came out as a trans woman after being nabbed and now goes by the name “Sophie” — appears to have been suffering mental issues.\n\nBut Kirk’s killer and the two men who tried to assassinate President Donald Trump almost surely had psychological problems, too. That’s not unusual.\n\nMeanwhile, Democrats can’t seem to halt their inflammatory rhetoric about those on the right, and disturbed individuals interpret that as a message that conservatives need to be targeted.\n\nShowing these people leniency only encourages more violence.\n\n“The sentence imposed in this case must send the powerful message” that the “ends never justify the means and that the consequences are not worth engaging in these acts,” prosecutors stressed.\n\nAbsolutely right. \n\nIt’s up to judges to make sure those consequences are serious enough.","summary":"Showing these people leniency only encourages more violence.","url":"https://nypost.com/2025/10/06/opinion/good-for-pam-bondi-for-vowing-to-appeal-the-outrageous-sentence-for-brett-kavanaughs-assassin/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/justice-brett-kavanaugh-holds-personal-111193162_7e90cb-e1759791007183.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-07 00:23:36","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"zm","sentiment":-0.299},{"id":366825870,"title":"Jane Goodall revealed which world leaders she would send to space in Netflix interview","text":"Conservationist Jane Goodall, who recently passed away at 91, expressed a wish to send several world leaders, including Donald Trump, on one of Elon Musk's SpaceX flights. \n\nThis revelation came from a posthumously released interview for the Netflix documentary series Famous Last Words, which Goodall understood would be released after her death. \n\nGoodall listed individuals she 'didn't like' for the hypothetical space journey, specifically naming Elon Musk, Donald Trump, Vladimir Putin, Xi Jinping, Benjamin Netanyahu, and Trump's supporters. \n\nAs a United Nations Messenger of Peace, she also spoke out against global conflicts, including the 'genocide of the people of Gaza,' in a statement for the International Day of Peace. \n\nGoodall had previously compared Donald Trump's behavior to the dominance rituals of male chimpanzees she observed.","summary":"","url":"https://www.independent.co.uk/bulletin/news/jane-goodall-famous-last-words-trump-musk-b2840586.html","image":"https://static.independent.co.uk/2025/10/04/13/45/GettyImages-1144621945.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/RnjyX9Sy-OhrQWqOm.mp4","publish_date":"2025-10-07 00:22:35","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","source_country":"gb","sentiment":-0.224},{"id":366825320,"title":"School Assembly News Headlines Today (Oct 7): Top National, International & Sports Updates + Thought of the Day","text":"If you’re a student on the lookout for news headlines to read out in your school assembly, you’re at the right place! We’ve compiled a list of the most important national, international, and sports-related news items to keep students well-informed about the latest events happening both within the country and across the world. National News President Droupadi Murmu will visit the Sabarimala Temple on October 22.The Centre has launched major conservation projects for tigers, dolphins, gharials, and sloth bears.The Assam Cabinet has approved the introduction of a Unified Pension Scheme.Odisha Chief Minister Naveen Patnaik inaugurated ₹1,100-crore projects for Nuapada district.Delhi Chief Minister Arvind Kejriwal announced that Maharishi Valmiki Jayanti will now be a public holiday in the city.The Delhi High Court observed that the Delhi Government has not implemented reservation for transgenders despite a Supreme Court order.The Supreme Court has dismissed a plea seeking preservation of video recordings of court proceedings.Shipping Minister Sarbananda Sonowal said that 112 new vessels will be built under joint ventures with oil PSUs.Karnataka Chief Minister Siddaramaiah said the government has no stand yet on the Lingayat community’s demand for separate religion status.The rupee rose by 5 paise against the US dollar, while gold prices surged by ₹2,700, crossing ₹1.23 lakh per 10 grams in Delhi. Don't Miss | 47,000 Foreign Students in Canada May Be In Canada Illegally, Indians Top the List: IRCC International News India has said it is ready to work with any government in Bangladesh chosen by its people.Israel and Hamas have begun indirect peace talks in Egypt, ahead of the first anniversary of the Gaza war.UNESCO has nominated an Egyptian candidate as its new Director-General, following the US withdrawal.India has launched the UPI payment system in a Qatari supermarket, marking another milestone for digital payments abroad.The United States, under Donald Trump, will impose 25% tariffs on imported trucks starting November 1.Nepal’s death toll due to landslides and floods has reached 60, while its Election Commission has approved the schedule for general elections.Venezuela has denounced an alleged “extremist plan” to attack the shuttered US Embassy complex. Sports News India defeated Pakistan by 88 runs in the Women’s World Cup 2025 match held in Colombo.Prime Minister Narendra Modi praised India’s performance in the World Para Athletics Championships, calling it historic.In the APL League, Rajputana Royals remain unbeaten, while Kakatiya Knights secured their first victory.South Africa beat New Zealand by six wickets in a Women’s World Cup match played in Indore.Prakaash, Hruthik, and Tavish advanced to the second round at the U-16 Fenesta Open Tennis Tournament.Mumbai will play a three-day practice match against Maharashtra ahead of the Ranji Trophy 2025–26 season.Sunil Joshi has stepped down as Punjab Kings’ spin bowling coach.The Indian men’s water polo team lost 6–20 to Kazakhstan in the Asian Aquatics Championship.Pakistan’s Sidra Amin has been reprimanded by the ICC for a code of conduct breach during the match against India. Thought of the Day Every morning is a new beginning. Take a deep breath, smile, and start again. हर सुबह एक नई शुरुआत होती है। गहरी सांस लो, मुस्कुराओ और फिर से शुरू करो। Recommended | Indian Student with ₹89 Lakh Columbia Scholarship Denied US Visa for ‘Lack of Strong Ties to India’","summary":"Take a look at the major national, international, and sports highlights of the day. You may use it in the school assembly on October 7, 2025.","url":"https://www.timesnownews.com/education/school-assembly-news-headlines-today-oct-7-top-national-international-sports-updates-thought-of-the-day-article-152953546","image":"https://images.timesnownews.com/thumb/msid-152953547,thumbsize-51262,width-1280,height-720,resizemode-75/152953547.jpg","video":null,"publish_date":"2025-10-07 00:21:37","author":"Deepali Samaniya","authors":["Deepali Samaniya"],"language":"en","source_country":"in","sentiment":-0.135},{"id":366822620,"title":"White House: No Decision Yet on Tariff Rebate Checks","text":"No decision has been made on President Donald Trump’s proposal to send Americans rebate checks funded by revenues collected from tariffs, the White House said Monday.\n\nTrump is floating the idea of distributing part of the hundreds of billions of dollars the Treasury has collected since April, when he imposed global tariffs aimed at restoring fair trade relations between the United States and the rest of the world. The U.S. Supreme Court will soon hear arguments on whether the president can use his emergency powers to issue these customs duties in the first place.","summary":"Trump is floating the idea of distributing part of the hundreds of billions of dollars the Treasury has collected since April.","url":"https://www.theepochtimes.com/us/white-house-no-decision-yet-on-tariff-rebate-checks-5925473","image":"https://img.theepochtimes.com/assets/uploads/2025/09/05/id5911031-AP25233443101007-OP-300x180.jpg","video":null,"publish_date":"2025-10-07 00:12:36","author":"Bill Pan","authors":["Bill Pan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.501},{"id":366824942,"title":"Supreme Court Rules Ghislaine Maxwell Cannot Use Epstein Deal as Protection","text":"The U.S. Supreme Court has declined to hear convicted sex trafficker Ghislaine Maxwell’s appeal on Monday. Her appeal argued that the non-prosecution agreement Jeffrey Epstein obtained in 2007 to avoid federal charges for himself and potential co-conspirators in Florida should have protected her from prosecution in New York.\n\nThe justices’ orders list extended nearly 40 pages without providing a written explanation for the numerous case rejections, including Maxwell’s. This leaves the 63-year-old reliant on whether Epstein’s former associate, President Donald Trump, or a future president, will grant her the pardon she desires.\n\nWhile Maxwell’s appeal was pending, the DOJ led by U.S. Attorney General Pam Bondi abruptly ended the anticipated release of the “Epstein files,” upsetting Trump’s base by asserting there was no actual “client list” connecting elites to Epstein, no evidence of potential blackmail of influential individuals, nor an alternate explanation for Epstein’s 2019 jail suicide before facing a sex-trafficking trial.\n\nThe government subsequently opposed Maxwell’s request for a writ of certiorari, labeling her reliance on the non-prosecution agreement (NPA) as plainly “incorrect.”\n\n“Petitioner reiterates her argument that Epstein’s nonprosecution agreement with the U.S. Attorney for the Southern District of Florida prevented her prosecution by the U.S. Attorney for the Southern District of New York. This argument is incorrect, and petitioner does not demonstrate it would prevail in any court of appeals,” the DOJ stated. “This case would also be an inappropriate vehicle for addressing the issues raised in the petition for a writ of certiorari.”\n\nThe actual NPA, DOJ emphasized, was cut while the “government was not even aware of petitioner [Maxwell]’s role in Epstein’s scheme at that time” — and unlike others in Epstein’s orbit, Maxwell’s name did not appear in the agreement.\n\nMaxwell insisted that she “never should have been charged,” that the government caved to “public outrage over an unpopular non-prosecution agreement,” and punished her instead of the “person responsible for the crimes,” but these contentions have now crashed and burned.\n\nThe onetime British socialite, who once boasted ties to the Clintons and Prince Andrew, had been incarcerated in Tallahassee’s federal lockup, but following her July interview by Deputy Attorney General Todd Blanche, she was moved to FPC Bryan, a “minimum security federal prison camp” in Texas.\n\nIn that interview, Maxwell was pressed about whether she had ever witnessed wrongdoing on the part of the president, and she said no.\n\nBlanche, Trump’s former criminal defense attorney, also questioned her about putting together a birthday book for Epstein’s 50th birthday and whether she recalled Trump submitting a “bawdy” letter, which the Wall Street Journal reported despite the president’s realized threats to sue.\n\nMaxwell said she “never” saw “gentleman” Trump act inappropriately with anyone. At the same time, Maxwell said it was “true” that she put together the Epstein 50th “birthday book” and claimed she did not remember a Trump letter.\n\nMaxwell explained that she got the idea from her mother, who put together a birthday book for Ghislaine’s father Robert Maxwell’s 60th birthday. Maxwell further said that the “ask” of birthday book letter-writers was “say anything you want on a piece of paper.”\n\nAs Blanche continued probing about whether Maxwell specifically remembered Trump “submitting a letter or a card or a note,” Maxwell said “I don’t” and that she didn’t have any recollection of a “picture of a naked woman or something like that,” as Blanche put it in his question.\n\nAt another point during the interview, Blanche asked about the “birthday book” again and Maxwell again said she didn’t remember asking Trump to submit a letter but suggested it was possible Epstein himself asked Trump to do so.\n\n“I did ask some people. I don’t remember Mr. Trump. I don’t remember who I did ask, but Epstein also asked people himself directly,” Maxwell said. “So it could have happened that way, if it happened at all.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nProsecutors reported finding this photograph of Jeffrey Epstein and Ghislaine Maxwell during&#8230;\n\n\nThis Post: Supreme Court Rules Ghislaine Maxwell Cannot Use Epstein Deal as Protection first appeared on Internewscast Journal","url":"https://internewscast.com/crime/supreme-court-rules-ghislaine-maxwell-cannot-use-epstein-deal-as-protection/","image":"https://internewscast.com/wp-content/uploads/2025/10/Ghislaine-Maxwell-cant-hide-behind-Epstein-deal-SCOTUS.jpg","video":null,"publish_date":"2025-10-07 00:10:08","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.39},{"id":366825872,"title":"Trump reignites health speculation after CNN interview","text":"President Donald Trump has reignited speculation about his health and physical stamina following a peculiar text message interview with CNN's Jake Tapper over the weekend. \n\nDuring the purported exchange, Tapper displayed Trump's responses to questions about the Israel-Hamas peace plan and the ongoing government shutdown, including replies like 'Total Obliteration' and 'Good, we are winning and cutting costs big time!' \n\nThe interview raised questions as Trump is not known for frequently using text messages or email, and Tapper did not explain how he verified the messages originated from the President himself. \n\nConcerns about Trump's health have persisted for months, with observers noting slurred speech, bruising on his hands, swollen ankles, and a reduction in public appearances. \n\nThe White House previously stated Trump was diagnosed with Chronic Venous Insufficiency and has dismissed other health speculations, while Vice President JD Vance has recently taken a more prominent role in administration messaging.","summary":"","url":"https://www.independent.co.uk/bulletin/news/trump-health-interview-cnn-jake-tapper-b2840584.html","image":"https://static.independent.co.uk/2025/10/06/20/17/President-Trump-Speaks-In-The-Oval-Office-5968lg59.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/F0odvx5M-OhrQWqOm.mp4","publish_date":"2025-10-07 00:07:03","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","source_country":"gb","sentiment":-0.531},{"id":366821438,"title":"Judge moves Comey arraignment up a day, citing security concerns","text":"“Because there are multiple previously-scheduled matters that are expected to draw large numbers of people to the courthouse at the same time as the arraignment, and because it is necessary to ensure the security of the Court, the parties, and the public, it is hereby ORDERED that Defendant is summoned to appear for arraignment before this Court on Wednesday, October 8, 2025, at 10:00 a.m.,” U.S. District Judge Michael Nachmanoff wrote.\n\nIt remains unclear what other court cases are expected to draw large crowds on Thursday.\n\nLast month, Comey was indicted by a federal grand jury on two felony counts for obstructing a congressional proceeding and making a false statement to Congress. Both charges stem from the former FBI director’s 2020 testimony before the Senate Judiciary Committee about the bureau’s handling of the Trump-Russia investigation.\n\nThe indictment dropped days after President Donald Trump publicly pressured Attorney General Pam Bondi to use her prosecutorial authority to go after Comey, New York Attorney General Letitia James, and Sen. Adam Schiff (D-CA). Trump has frequently referred to them as his political enemies.\n\nComey maintains his innocence and vows to fight the allegations in court.\n\nHis arraignment will now proceed on Wednesday, with the Biden-appointed judge presiding over the case.\n\nThe scheduling change comes hours after House Oversight Committee Chairman James Comer (R-KY) withdrew Comey’s subpoena to appear for a deposition before Congress regarding the ongoing investigation of the late sex offender Jeffrey Epstein. Comey denied he knew anything about the Epstein files.\n\nWhen the Epstein files debacle blew up in July, Trump accused Comey and others of making up the Epstein files. The president also blamed Comey for his involvement in what he called the “Russia hoax.”\n\nCOMEY WON’T APPEAR BEFORE HOUSE OVERSIGHT, DENIES KNOWLEDGE OF EPSTEIN FILES\n\nComey is accused of lying to Congress under oath about not authorizing leaks of anonymous information to the media about the investigations into Trump’s alleged collusion with Russia in the 2016 presidential election and former Secretary of State Hillary Clinton’s alleged involvement in tying Trump to Russia.\n\nA possible third count pertained to an alleged false statement made by Comey about whether he was aware of the “Clinton plan” to smear Trump as a Russian colluder, but that charge did not make its way into the indictment after the grand jury could not agree on it.","summary":"A federal judge decided on Monday to move the arraignment for former FBI Director James Comey up one day this week because of security concerns at the courthouse in Alexandria, Virginia. Comey was previously scheduled to appear at his arraignment on Thursday. &#8220;Because there are multiple previously-scheduled matters that are expected to draw large numbers [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3839859/judge-moves-james-comey-arraignment/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25137027776023-1.jpg?w=696","video":null,"publish_date":"2025-10-07 00:06:58","author":"David Zimmermann","authors":["David Zimmermann"],"language":"en","source_country":"US","sentiment":-0.449},{"id":366826764,"title":"Sean ‘Diddy’ Combs’ lawyers want him sent to a New Jersey federal prison that offers drug treatment","text":"By MICHAEL R. SISAK and LARRY NEUMEISTER\n\nNEW YORK (AP) — Sean “Diddy” Combs’ lawyers want the hip-hop mogul sent to a low-security federal prison in New Jersey to serve his four-year, two-month prison sentence, telling a judge Monday that the facility’s drug treatment program will help him stay clean.\n\nIn a letter, Combs’ lawyers urged the judge presiding over his case, Arun Subramanian, to “strongly recommend” that the federal Bureau of Prisons place Combs at FCI Fort Dix, a massive prison located on the grounds of the joint military base McGuire-Dix-Lakehurst.\n\nFCI Fort Dix, one of several dozen federal prisons with a residential drug treatment program, will best allow Combs “to address drug abuse issues and to maximize family visitation and rehabilitative efforts,” Combs lawyer Teny Geragos wrote.\n\nAlso Monday, President Donald Trump told reporters that Combs had asked him for a pardon. Trump, referring to Combs by the nickname “Puff Daddy,” did not say if he would grant the request. A message seeking comment on Trump’s remarks was left for Combs’ lawyers and his publicity team.\n\nCombs’ sentencing Friday on charges he transported people across state lines for sexual encounters capped a federal case that featured harrowing testimony about violence, drugs and so-called “freak-offs,” and exposed the sordid private life of one of the most influential figures in music.\n\nThe “I’ll Be Missing You” singer was convicted in July under the federal Mann Act, which bans transporting people across state lines for any sexual crime. His trial ended in a split verdict, with acquittals on sex trafficking and racketeering charges that could have put him behind bars for life.\n\nCombs has been locked up at a Brooklyn federal jail, the Metropolitan Detention Center, since his arrest in September 2024. That time will be subtracted from his sentence, meaning he could get out in about three years.\n\nSubramanian has not yet acted on the request to place him at FCI Fort Dix.\n\nJudges often make recommendations about where inmates should serve time, but it’s ultimately up to the Bureau of Prisons to decide. Those decisions, the agency has said, are based on a variety of factors, including the severity of the offense, the required security level and an inmate’s programming needs.\n\nFCI Fort Dix, the largest single federal prison by population with just under 3,900 inmates, is about 64 miles southwest of New York City, where Combs was born and rose to fame as a rapper and entrepreneur in an array of businesses, including fashion, television and liquor. An adjacent minimum-security prison camp has 210 inmates.\n\nThe facility has been home to a number of high-profile inmates over the years, including mobsters, corrupt politicians and “Pharma Bro” Martin Shkreli. For a time, it was run by the warden who had been in charge of a Manhattan federal jail when financier Jeffrey Epstein killed himself at the jail in 2019. That warden, Lamine N’Diaye, has since retired.\n\nIn 2021, a 27-year-old Fort Dix inmate was stabbed in the eyeball by a fellow prisoner.\n\nIn 2019, a Fort Dix inmate, a former inmate and two other people were arrested for using a drone to smuggle in contraband including cellphones, tobacco, weight-loss supplements and eyeglasses. The same year, a Fort Dix correctional officer pleaded guilty in a separate case to pocketing bribes to smuggle in contraband.\n\nDuring his time at Fort Dix, Shkreli ended up in solitary confinement amid allegations he was using a contraband smartphone to run his drug company from behind bars. Inmates are forbidden from conducting business and possessing cellphones.","summary":"They told a judge the facility’s drug treatment program will help him stay clean.","url":"https://www.bostonherald.com/2025/10/06/diddy-drug-treatment-prison/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Sexual_Misconduct_Diddy_46540_80638f.jpg?w=1024&h=576","video":null,"publish_date":"2025-10-07 00:03:03","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.138},{"id":366819560,"title":"Sean ‘Diddy’ Combs’ lawyers want him sent to a New Jersey federal prison that offers drug treatment","text":"By MICHAEL R. SISAK and LARRY NEUMEISTER\n\nNEW YORK (AP) — Sean “Diddy” Combs’ lawyers want the hip-hop mogul sent to a low-security federal prison in New Jersey to serve his four-year, two-month prison sentence, telling a judge Monday that the facility’s drug treatment program will help him stay clean.\n\nIn a letter, Combs’ lawyers urged the judge presiding over his case, Arun Subramanian, to “strongly recommend” that the federal Bureau of Prisons place Combs at FCI Fort Dix, a massive prison located on the grounds of the joint military base McGuire-Dix-Lakehurst.\n\nFCI Fort Dix, one of several dozen federal prisons with a residential drug treatment program, will best allow Combs “to address drug abuse issues and to maximize family visitation and rehabilitative efforts,” Combs lawyer Teny Geragos wrote.\n\nAlso Monday, President Donald Trump told reporters that Combs had asked him for a pardon. Trump, referring to Combs by the nickname “Puff Daddy,” did not say if he would grant the request. A message seeking comment on Trump’s remarks was left for Combs’ lawyers and his publicity team.\n\nCombs’ sentencing Friday on charges he transported people across state lines for sexual encounters capped a federal case that featured harrowing testimony about violence, drugs and so-called “freak-offs,” and exposed the sordid private life of one of the most influential figures in music.\n\nThe “I’ll Be Missing You” singer was convicted in July under the federal Mann Act, which bans transporting people across state lines for any sexual crime. His trial ended in a split verdict, with acquittals on sex trafficking and racketeering charges that could have put him behind bars for life.\n\nCombs has been locked up at a Brooklyn federal jail, the Metropolitan Detention Center, since his arrest in September 2024. That time will be subtracted from his sentence, meaning he could get out in about three years.\n\nSubramanian has not yet acted on the request to place him at FCI Fort Dix.\n\nJudges often make recommendations about where inmates should serve time, but it’s ultimately up to the Bureau of Prisons to decide. Those decisions, the agency has said, are based on a variety of factors, including the severity of the offense, the required security level and an inmate’s programming needs.\n\nFCI Fort Dix, the largest single federal prison by population with just under 3,900 inmates, is about 64 miles southwest of New York City, where Combs was born and rose to fame as a rapper and entrepreneur in an array of businesses, including fashion, television and liquor. An adjacent minimum-security prison camp has 210 inmates.\n\nThe facility has been home to a number of high-profile inmates over the years, including mobsters, corrupt politicians and “Pharma Bro” Martin Shkreli. For a time, it was run by the warden who had been in charge of a Manhattan federal jail when financier Jeffrey Epstein killed himself at the jail in 2019. That warden, Lamine N’Diaye, has since retired.\n\nIn 2021, a 27-year-old Fort Dix inmate was stabbed in the eyeball by a fellow prisoner.\n\nIn 2019, a Fort Dix inmate, a former inmate and two other people were arrested for using a drone to smuggle in contraband including cellphones, tobacco, weight-loss supplements and eyeglasses. The same year, a Fort Dix correctional officer pleaded guilty in a separate case to pocketing bribes to smuggle in contraband.\n\nDuring his time at Fort Dix, Shkreli ended up in solitary confinement amid allegations he was using a contraband smartphone to run his drug company from behind bars. Inmates are forbidden from conducting business and possessing cellphones.","summary":"They told a judge the facility’s drug treatment program will help him stay clean.","url":"https://www.twincities.com/2025/10/06/diddy-drug-treatment-prison/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Sexual_Misconduct_Diddy_46540_80638f.jpg?w=1024&h=576","video":null,"publish_date":"2025-10-07 00:03:03","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.138},{"id":366822898,"title":"Karen Carney reveals she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit","text":"SHARE SELECTION\n\nHome and Garden\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nPrivacy Policy\n\nTuesday, Oct 7th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nBritain's phone theft kingpins: Gang who export HALF of UK's snatched handsets and made a fortune shipping 40,000 to China is smashed in dramatic raids \n\nRevealed: How Dame Jilly Cooper died in the hours after falling at Grade II listed home in The Cotswolds - as tributes pour in following the Queen of the bonkbuster's death aged 88\n\nAmerican liberal says he's now a Trump supporter after seeing how rough and dangerous London has become\n\nRevealed: Which slimming jab REALLY works best. The doctors' ultimate expert guide on which to pick, how to save money, beat every side effect... and what you need to know about the 'golden dose'\n\nWhat causes those unsightly red lumps on your legs that just won't go away. DR SCURR reveals the answer, when to worry - and what you should do next\n\nMother 'murdered' her son, five, and tried to kill herself after 'challenges of caring for him' made her depressed, court hears\n\nIn Jilly Cooper country, every man wanted to be in the saddle, and every woman was yearning for a good hard gallop, writes CHRISTOPHER STEVENS\n\nBackstage bloodbath leaves Loose Women in turmoil: Insiders reveal twist that's left show fighting for survival - as they tell KATIE HIND exactly who is feuding with who and which panellist everyone else 'despises'\n\nFunctioning alcoholics hide in plain sight... so are YOU one? These are the six signs you might have a problem: DR MAX PEMBERTON\n\nRachel Reeves is coming under mounting pressure to rule out a 'knee-jerk' raid on pension lump sums before the Budget, with speculation the Chancellor may reduce the amount savers can withdraw tax-free from their retirement pot\n\nMother, 42, who drowned toddler daughter, two, at a beauty spot after stopping medication for postnatal depression is jailed\n\nThe 24 must-have items for autumn, picked by top fashion editor HANNAH SKELLEY. They'll renew your look and be the envy of friends - from the best suede shopper to the ultimate gilet\n\n'Never again': Robert Jenrick will pledge to end two-tier justice as he warns the Sentencing Council is 'not fit for purpose'\n\nHow to cure your sciatica for good - WITHOUT powerful drugs: Our experts reveal the simple steps and lifestyle tweaks to save yourself from the debilitating condition\n\nMother of Israeli hostage snatched by Hamas at Nova festival hopes peace deal talks will see her 'strong, beautiful' son released\n\nGraham Norton Show audience member makes explosive claims about 'uncomfortable' moment host shut down inappropriate question to Taylor Swift from Jodie Turner-Smith\n\nNicole Kidman is supported by children Sunday Rose, 17, and Faith, 14, at star-studded Chanel catwalk show in Paris as they make their first appearance together since actress confirmed her marriage is over\n\nWHO accuses vape manufacturers of hooking a generation of children on e-cigarettes as teen users hit 15million worldwide\n\nRenewables overtake coal globally for the first time on RECORD - showing the world is finally reaching a 'crucial turning point' in the shift towards clean power\n\nKey North Atlantic current is on the brink of COLLAPSING - plunging Europe into a 'Little Ice Age', scientists warn\n\nMick Philpott's mate who burned six children to death in twisted arson plot dies at 58\n\nIs Emma Watson secretly engaged to student boyfriend Kieran Brown? After that very public savaging by JK Rowling, Harry Potter star wore a beaming smile and a sparkling diamond ring at Paris Fashion Week\n\nRICHARD LITTLEJOHN: Football clubs take the knee for BLM - so why did they almost all ignore the shocking synagogue attack?\n\nScientists REVERSE Alzheimer's in mice using nanoparticles - and they say the same technique could be effective in humans\n\nKaren Carney reveals she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit\n\nHave YOU got a story? Email tips@dailymail.com \nBy AMELIA WYNNE, SHOWBUSINESS REPORTER \n Published:23:59 BST, 6 October 2025 |Updated:01:02 BST, 7 October 2025 \n\nKaren Carney has revealed that she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit.\nThe former footballer, 38, is already winning over fans with pro partner Carlos Gu, 32, on the BBC dancing show. \nBut now she has opened up to Women's Health UK on the Just As Well podcast about getting back to herself after the 'negative' backlash she had to endure for simply doing her job.\nKaren has been a regular broadcaster for live football on TNT Sports, Sky Sports, ITV and Amazon Prime, including Women's Super League and men's Premier League matches since 2019. \nKaren explained: 'I think I had it quite bad about four years ago, that was very, very challenging. But since then, whether you like it or not, you have to build resilience.\n'And I think for me, my attitude - put my athlete hat on - is to be the best version of myself. Work as hard as I can, be a great team player, and actually what we learned in football was never to impress your manager, impress your teammates. \n\nView gallery\n\nKaren Carney has revealed that she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit\n\nView gallery\n\nShe has opened up to Women's Health UK on the Just As Well podcast about getting back to herself after the 'negative' backlash she had to endure for simply doing her job\n\nNicole Kidman is supported by children Sunday Rose and Faith\n\n4.7k viewing now\n\nBackstage bloodbath at Loose Women: KATIE HIND reveals the feuds\n\n43.8k viewing now\n\nIs Emma Watson secretly engaged to student boyfriend Kieran Brown?\n\n795 viewing now\n\n'So for me, if I'm next to someone like a Roy Keane or an Ian Wright, or whoever it might be, if they're happy with me and they know I worked hard, they know I've done my research, they know I've done my prep, then that's all that matters to me…\n'The rest, I can't control what people think about me. I genuinely can't. I've had to just go with that mindset. \n'But Jesus Christ, it has knocked my confidence…it's why I wanted to do Strictly as well to rebuild my confidence again because the negativity has crushed me.'\nIt comes after on last Saturday's episode of Strictly Karen revealed she has suffered from a spinal condition since childhood, and has shared how it affects her ability to perform.\nDuring the last instalment of the hit BBC show Karen and Carlos were seen rehearsing for their second live performance - a Tango set to Dua Lipa's hit Training Season. \nHowever, during a break from training, Karen opened up about her health struggles, admitting she suffers from a curved spine that makes it difficult to achieve the correct posture for ballroom routines. \nShe told the cameras: 'I have this thing called Scheuermann's, I've had it since I was a kid. \n'It's a curve in my spine, it's really, really hard for me to open my back up to certain elements that I just won't be able to do as well as I'd love to, but Carlos is really supportive, really encouraging.' \n\nView gallery\n\nKaren has been a regular broadcaster for live football on TNT Sports, Sky Sports, ITV and Amazon Prime, including Women's Super League and men's Premier League matches since 2019\nDespite the challenge, Karen powered through and took to the dancefloor for their Tango routine.\nHowever, the performance saw them slip down the leaderboard with a total score of 20 points, a full 11 points lower than their 'sensational' week one jive.\nFollowing their performance, judge Motsi Mabuse praised Karen for speaking openly about her condition: 'Thank you for sharing with us about your curved spine. \nShe continued: 'It's going to be something that we have to challenge here to see how far we can really stretch and open up because it's a ballroom dance, and there's a specific posture that we need. \n'That being said, last week you were top of the leaderboard and there was a bit of an ease in the way you attacked, this week I could feel the nerves.' \n\n Strictly returns for Week Two as birthday girl Amber Davies tops the leaderboard while Ross King breaks down in tears and Thomas Skinner's salsa goes viral for all the wrong reasons \nScheuermann's disease, also known as Scheuermann's kyphosis, is a growth disorder that causes abnormally shaped, wedge-like vertebrae in the thoracic spine, often leading to a hunched posture in adolescence. \nSymptoms can include back pain, stiffness, and fatigue, and in more severe cases, the condition can even affect breathing. \nKaren's revelation about her health condition came days after her dance experience was revealed, after she stunned viewers with her incredible first performance. \nThe new Strictly favourite took to the ballroom on opening night with her partner Carlos, where they danced a jive.\nHer jaw-dropping efforts saw her jump straight to the top of the leaderboard, leaving the judges impressed and viewers at home shocked.\nHowever, in an old interview, she told how she had originally trained in dance as a child before getting into football seriously.\nShe said: 'I enjoyed football when I was a kid and had loads of kick abouts, but I didn't join my first club until I was 11.\n'Until then, it was all about dancing for me.\n'We did loads of different routines and genres of music; street dancing, hip-hop, disco, rock 'n' roll, slow dancing, team dances.'\n\nJudge Motsi praises Karen Carney for opening up about spine condition\n\nProgress: 0%\n\nCurrent Time 0:00\n\nDuration Time 0:30\n\nVideo Quality\n\nText Edge Style\nFont Family\n\nView gallery\n\nIt comes after on last Saturday's episode of Strictly Karen revealed she has suffered from a spinal condition since childhood, and has shared how it affects her ability to perform\nThe Sun reported Karen also saying: 'When I got a bit older and my football matches switched to a Sunday, I had some choices to make.\n'I decided to give up dancing when I was 15.'\nShe continued: 'My agility, my strength, my power and how I move my feet during a match are all definitely down to dancing, 100 per cent.\n'I was quite little, but I was quite strong, and that was because all the dancing made my muscles stronger.' \nThe full Women's Health Just As Well episode is available on major podcast platforms. \n\nSTRICTLY LINEUP 2025\n\nHarry Aikines-Aryeetey\n\nProfession: Olympic Sprinter and Gladiator\nHarry says: 'I'll be bringing tons of energy to light up the dance floor. Let's hope I'm as quick picking up the routines as I am on the track.'\nAlex Kingston\n\nProfession: Doctor Who actress\nThe actress teases: 'My hips don't lie.'\nBalvinder Sopal \n\nProfession: EastEnders actress\nBalvinder says: 'I’m far too excited to put into words how I feel but I’m incredibly excited at the prospect of dancing across the ballroom.'\n\nProfession: Drag performer \nShe says: 'Strictly is a national institution and I can't wait to get started. All that's left to say is: good luck to my partner! Here's hoping they can help me go from La Voix into La Danse.' \n\nThomas Skinner \n\nProfession: Reality star and entrepreneur \nHe says: 'Bring on the sequins, sambas and most importantly, the BOSH to the ballroom!' \n\nVicky Pattison\n\nProfession: Reality TV star\nShe says: 'I'm absolutely buzzing to be part of this year's Strictly Come Dancing line-up... but I'd be lying if I said I wasn't terrified.' \n\nKaren Carney \n\nProfession: Football pundit\nShe says: 'I’m such a huge fan of the show and I can’t believe I’m finally getting the chance to take part.' \nGeorge Clark\n\nProfession: YouTuber \nHe says: 'Never thought I’d say this… but I’m doing Strictly! Honestly, I’ve got no idea what I’m doing but I’m excited to get stuck in … and potentially fall over a fair bit.' \n\nJimmy Floyd Hasselbaink\n\nProfession: Former Chelsea and Netherlands striker and ex-England coach.\nHe says: 'Swapping the pitch for the ballroom is certainly not something I’ve done before but I’m looking forward to tackling a fun challenge! Bring on a new type of footwork, with hopefully no own goals.'\nEllie Goldstein \n\nProfession: Model, influencer and disability ambassador \nShe says: 'It’s a show I’ve loved watching for so long, and the chance to now be part of it feels like a dream'.\nChris Robshaw\n\nProfession: Rugby player\nHe says: 'This is about as far out of my comfort zone as it gets! I’m hoping to take my dad-dancing to a whole new level, and my mum can’t wait to drag me along to her Zumba class'. \nStefan Dennis\n\nProfession: Actor\nHe says: 'Looking forward to the sparkle and reaching for the sky.'\n\nProfession: Showbiz correspondent\nHe says: 'I can’t wait to learn from the best, meet my fellow contestants, and, most importantly… try not to step on too many toes!'\n Lewis Cope\n\nProfession: Actor\nHe says: 'I'm so excited to be swapping the Dales for the dance floor and joining this year's Strictly Come Dancing.'\nAmber Davies \n\n Profession: West End star\n She says: 'This has been the craziest 24 hours of my life. I’ve watched Strictly with my family since I was younger and to now be part of the show is a dream come true.'\n\nAmazonBBCITVKaren Carney\n\nShare or comment on this article: \nKaren Carney reveals she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit\n\nAdd comment\n\nComments (0)\n\nComments are subject to our House rules and Terms\n\nLog in to comment\n\nWorst rated\n\nNo one seems to have shared their thoughts on this topic yet\nLeave a comment so your voice will be heard first.\nTerms | Privacy | Feedback\n\nREVEALED: How Dame Jilly Cooper died in the hours after falling at Grade II listed home in The Cotswolds - as tributes pour in\n\nNicole Kidman is supported by children Sunday Rose, 17, and Faith, 14, at star-studded Chanel catwalk show \n\nIs Emma Watson secretly engaged to student boyfriend Kieran Brown?\n\nSpeculation \n\nTaylor Swift brings showgirl glamor in dazzling never-before-seen snaps from Selena Gomez wedding\n\nNicole Kidman joins glamorous Margot Robbie and Kendall Jenner at star-studded Chanel show during Paris Fashion Week\n\nThe perfect gift for curious kids: A look inside the magazine that beats screen time - and is bursting with fun facts, puzzles and jokes!\n\nLauren Sanchez and Jeff Bezos put on a loved-up display as they join a host of stars at the Paris Fashion Week Chanel show\n\nNecking with James Bond, bed-hopping in the Cotswolds and why modern men are just too wet: JILLY COOPER's rollicking last interview\n\nNicole Kidman's wedding ring is notably absent as she greets fans in Paris after confirming the end of her marriage\n\nWhy NOW is the time to take that solo adventure: Seven reasons why traveling alone has never been easier, safer, or more awe-inspiring\n\nI'm A Celebrity All Stars full line-up 'revealed' - with pop star, soap legend and football ace among the famous faces\n\nThylane Blondeau stuns at the Miu Miu show during Paris Fashion Week after insisting she has never had cosmetic surgery\n\n Nicole Kidman sees Matthieu Blazy bring Chanel bang up-to-date with debut collection, writes LAURA CRAIK\n\nBig Brother housemates turn on George as he claims homeless people should stop 'deflecting responsibility'\n\nExotic spices and fresh catches: The luxury retreats serving up unforgettable flavours\n\nMargot Robbie displays her toned physique in a bralet and navy quilted co-ord at the Chanel fashion show in Paris\n\nKaren Carney reveals she is using Strictly to help 'rebuild confidence' after being 'crushed' by abuse she faced as a pundit\n\nRosie Jones and her friend attacked by thugs who threw red wine at them in 'ableist and homophobic' assault on a train\n\nNicole Kidman debuts break-up bangs at PFW amid Keith Urban split\n\nShowed off a post-breakup makeover a\n\nThe tights shake-up: How castor oil is transforming comfort, style and sustainability... thanks to one trailblazing brand!\n\nDemi Lovato shows off her incredibly taut face as she wears a daring bodysuit at Coperni show during Paris Fashion Week\n\nNicole Kidman and Keith Urban's daughter Sunday Rose steps out at Miu Miu fashion show in Paris amid her parents' marriage split\n\nKendall Jenner looks effortlessly chic in a black pencil skirt as she makes a front row appearance at Chanel catwalk show\n\nKim Kardashian trolls accuse her of copying Kanye's wife Bianca as she models short hair and see-through top\n\nUnder fire \n\nPopular money app launches new feature that could help you save £2,000* a year\n\nLily-Rose Depp looks effortlessly chic as she joins mum Vanessa Paradis at the Chanel catwalk show during Paris Fashion Week\n\nDiddy begs judge to let him spend his four-year sentence at low-level New Jersey prison\n\nThe rapper is facing a lenghty jail term \n\nJames Corden and Ruth Jones reunite at the London Palladium as comedy collaborators host special event \n\nGwyneth Paltrow and Apple Martin's GAP collection has landed in the UK - here's exactly what our editor predicts will sell out\n\nThis autumn it is all about 'Cowboy Chic': How everyone can wear this western-inspired trend in ultimate style and comfort (and on a budget!)\n\nGraham Norton Show audience member makes claims about moment host shut down inappropriate question to Taylor Swift\n\nJason Kelce interrogates panicked brother Travis over Taylor Swift wedding plans\n\nSo many questions \n\nHuge 90s pop star looks unrecognisable three decades on - but can you guess who it is?\n\nCHRISTOPHER STEVENS on Joe Wicks: Licensed To Kill: Why The Body Coach's ultra-processed food protest needs its own warning\n\n'It allowed me to grow my income without taking too much risk': The secret behind one business owner's expansion\n\nKatie Price buys ANOTHER dog - despite animal charities calling for a ban on her owning pets after string of tragedies\n\nGeorge Clooney, 64, admits to past drug use as he describes wild trip gone horribly wrong\n\nSpeaking to Esquire magazine\n\nLori Loughlin smiles as she ditches her wedding rings when seen for FIRST time since Mossimo split\n\nStepping out \n\nJoJo Siwa is supported by boyfriend Chris Hughes at her London show as she shares sweet on-stage tribute \n\nWhy booking a ski package beats going DIY - and could save you enough for an extra après-ski... or two!\n\nJulianne Hough's shocking blackface Halloween costume resurfaces: 'How did she think this was acceptable?'\n\nTaylor Swift appears to give former BFF Blake Lively another shout-out in Life of a Showgirl with her JEWELRY\n\nEmily Blunt reunites with Anne Hathaway on The Devil Wears Prada 2 set after filming relocated to fashion hotspot Milan\n\nLove Island star Demi Jones shares moving post about her thyroid cancer battle after being diagnosed at the age of just 22\n\nWayne Lineker leaves Ibiza as he admits the party lifestyle makes him 'miserable' and he 'needs a little more time to heal' now he's sober\n\nDavid Morrissey becomes a grandad at 61 as his ex-wife Esther Freud reveals the baby has brought them closer after divorce\n\nJenelle Evans' mother Barbara suffered stroke that landed her in the hospital\n\nRachel Zegler oozes sophistication as she joins FKA twigs and Eiza Gonzalez at the Thom Browne show in Paris\n\nDenise Richards and Aaron Phypers REUNITE for explosive court battle as he demands $150K to cover his bills\n\nLooking for a time saver? The Hoover Hydro Pet cordless vacuum AND mop is on sale and proving a hit with busy households\n\nLove Island Australia drops raunchy new teaser ahead of season seven premiere: 'Most sinful series ever'\n\nComing soon \n\nVictoria Coren Mitchell breaks silence as BBC removes her episode of Have I Got News For You from iPlayer over error\n\nTaylor Swift breaks silence on what friend Selena Gomez's $4M wedding to Benny Blanco was really like\n\nOpening up \n\nWoman at centre of Christian Horner sex texts scandal is paid HUGE fee to drop her allegations\n\nAbsolutely everything inside ESPA's beauty advent calendar - it's basically a spa retreat in a box\n\nThe King's goddaughter India Hicks shares snaps of her daugher Domino, 17, with Heidi Klum at Paris Fashion Week \n\nKylie Jenner savagely trolled for 'delusional' comment about her looks as fans accuse her of faking green eyes\n\nOlivia Wilde oozes boho chic as she and stylish Lana Del Rey lead star arrivals at the Zimmermann PFW show\n\nTravis Kelce arrives for Chiefs vs Jaguars after his 36th birthday as Taylor Swift prepares for Jimmy Fallon show\n\n10 pieces from JD Williams' new autumn collection that our fashion team has already added to their September wishlist\n\nBBC Scotland director: We need to make more dramas with international appeal to take on streaming giants\n\nMontana Brown blasted for claiming teachers 'make pupils watch films all day' as she looks at schools for her son\n\nGavin and Stacey star Joanna Page reveals she was 'sexually bullied' by male colleagues throughout her career - and STILL faces it at 48\n\nJennifer Lopez has terse four-word response to awkward Ben Affleck question during interview\n\nAna de Armas poses with a mystery man in Paris... as she has not been seen with beau Tom Cruise in 10 weeks\n\nTaylor Swift makes history as she breaks multiple streaming records on Spotify, Apple Music and Amazon \n\nHilaria Baldwin forced to address marriage rumors after DWTS appearance\n\nSpoke out on her marriage to the star \n\nThe new Adolescence? BBC drops first look at teen thriller Wild Cherry about posh schoolgirls and mums ripped apart by devastating scandal\n\nCillian Murphy's 'resting bored face' while Taylor Swift talks about her engagement to Travis Kelce leaves Graham Norton viewers in hysterics\n\nKylie Jenner flaunts her curves in a plunging sheer black lace dress as she makes a showstopping entrance for Paris Fashion Week's Miu Miu show\n\nJennifer Lopez, 56, wears a silk ROBE when heading out for a night of fun... as she has been single for over a year now\n\nCountry star attacks ICE in incendiary new anthem warning America amid Portland chaos\n\nPlus-size TV star died after van ramp snapped and sent his wheelchair tumbling onto sidewalk, lawsuit alleges\n\nPassed away last year\n\nLeonardo DiCaprio, 50, goes out of his way to hide his face after romantic dinner with Vittoria Ceretti, 27, in Paris\n\nNewlywed Lauren Sanchez is still sporting her bridal white wardrobe as she hold hands with Jeff Bezos while leaving The Ritz in Paris\n\nBritish actor John Woodvine who starred in An American Werewolf In London, The Crown and Z Cars dies aged 96 \n\nAll the hidden messages in Taylor Swift's The Fate Of Ophelia music video including several nods to Travis Kelce... after THAT raunchy sex song\n\nInfluencer Rolling Ray's cause of death revealed after shock passing aged 28\n\nShock passing \n\nRita Ora posts a cheeky snap of Cara Delevingne as she takes her fans behind the scenes at Paris Fashion Week\n\nEmma's charm offensive? Harry Potter star plasters a grin on her face at Miu Miu's PFW branded 'ignorant of how ignorant she is' by JK Rowling\n\nTaylor Swift says she would 'NEVER' go to space like former nemesis Katy Perry after Blue Origin flight backlash\n\nRichard E. Grant wears leather apron to walk Miu Miu catwalkaged 67 in front of Kylie Jenner and Emma Watson after dazzling on the Burberry runway\n\nJulia Fox reveals she blew $68,000 in one night on a designer shopping spree on her ex's credit card but had to pay it back when he dumped her\n\n'Disturbing' Netflix series 'giving viewers nightmares all night long' rockets to the top of the charts as fans 'binge every episode in one day'\n\nStacey Solomon treats daughter Rose to a £1K a-night stay at The Shard for her fourth birthday as they enjoy a luxury shopping spree before an amazing sky view dinner\n\nNew MAFS UK intruder leaves co-stars screaming with OUTRAGEOUS sex jibe minutes after arriving - as groom faces grilling from hell at hands of mother-in-law\n\nPeaky Blinders fans have a big complaint about drama's return as BBC and Netflix team up for two more series - sharing fears that new episodes will be 'worthless'\n\nRyan Murphy's new Netflix series Monster: The Ed Gein Story slammed by true crime fans: 'So far from what happened'\n\n'Obsessive' Antiques Roadshow guest stunned into silence as he learns value of 'really rare' collection which has skyrocketed in value\n\nAnatomy of a tragedy: Liam Payne's final moments retraced, including singer's 'disturbing' behaviour 30 minutes before he fell 40ft to his death f\n\nOzzy Osbourne talks his own mortality as he admits 'death's been knocking at my door for six years' in posthumous memoir and reveals his 'biggest fear' \n\nRivals stars Emily Atack and Alexander Hassell lead cast paying tribute to 'wonderful and divine Queen' Jilly Cooper following her death aged 88 \n\nTerri Iwrin shares 'upsettingly hot' photo of son Robert - amid rumours that the single Wildlife Warrior is heading for The Bachelor\n\nRomeo Beckham and ex Kim Turnbull are both spotted at the Singapore Grand Prix - days after he shared a new snap of a mystery girl\n\nJK Rowling once called me an amoral celebrity toady, but I vocally defend the way she's standing up for women's rights in the face of the cancel culture mob: PIERS MORGAN\n\nTaylor Swift's fiance Travis Kelce spent his 36th birthday watching his future wife on the big screen\n\nStephen Mulhern drops to his knees and begs studio audience 'help him!' as Catchphrase contestants fail to guess easy riddles - but can YOU solve them\n\nFury as ex Loose Women star Saira Khan brands flag-raisers 'a bunch of saddos' who 'drink a lot' as she backs Gary Neville's claim that 'angry middle-aged white men' are dividing Britain\n\nJames Morrison has found happiness with 'adventurer' girlfriend Mariel Jones following the tragic death of his estranged wife \n\nTaylor Swift makes surprise confession on her song 'about ex Joe Alwyn' as she insists fans have 'always had the wrong idea' about it\n\nWas Tom Skinner's Strictly exit a BBC conspiracy? Amy Dowden complains they missed out as vote-off is branded a 'sigh of relief' for execs\n\nScarlett Moffatt flaunts her dramatic weight loss after dropping from a size 18 and undergoing a glamorous makeover\n\nThis Morning's Ben Shephard screams 'cut the feed!' during 'dangerous' Jeff Brazier scooter stunt\n\nBritish pop star Perrie Edwards reveals the heartbreaking reason she was too scared to eat while touring with Little Mix: 'I'd be starving'\n\nJulia Fox recalls breaking down in tears over how uncomfortable she felt in her outfits on the Uncut Gems press tour after being 'influenced' by others\n\n'I'm not getting married to quit my job': Taylor Swift says it's 'shockingly offensive' to claim this is her last album as she heaps praise on Travis Kelce\n\nCharlize Theron ignores former co-star Johnny Depp as she shuns his 'slow return to the spotlight' at Dior PFW after court case\n\nKate Ferdinand shows off her incredible figure in a white bikini as she gears up for a lavish pool day in Dubai with husband Rio\n\nTV adventurer Levison Wood secretly welcomes his first child with girlfriend Ana Protasio as his partner shares the baby girl's sweet name\n\nMeghan is ridiculed for her 'Zoolander' walk for cameras in Paris and boasting about her 'return to the shows after 10 years' (when she was on the Z-list) \n\nOlivia Attwood poses in a lace bra as she flashes her taut midriff for a racy photoshoot\n\nBeat The Chasers viewers 'absolutely gutted' as contestant is 'robbed' in final round by ITV rejecting 'correct' answer - but who's in the wrong?\n\nStrictly's Thomas Skinner brushes off elimination at the pub as he's spotted drinking and smoking after becoming first star to be voted off \n\n'May Jilly Cooper's hereafter be filled with impossibly handsome men and devoted dogs': Queen Camilla pays heartfelt tribute to Rivals author \n\nClaire Sweeney shares tribute to late ex boyfriend Ricky Hatton as she marks his first birthday since he died\n\nOlivia Munn jokes 'Asian families have zero personal space' as she is forced to sleep in the BATHTUB for her last night at Paris Fashion Week after her parents invaded her hotel suite\n\nJeremy Clarkson admits next series of Clarkson's Farm is 'a conveyor belt of misery' as he's forced to 'send the cameras away' after string of major setbacks\n\nAbbey Clancy turns heads as she poses in a sheer lace co-ord for a sizzling new F&F photoshoot\n\nHow Dame Jilly Cooper delighted fans with surprise cameo appearance in Disney's adaption of her best-selling novel Rivals\n\nRichard Hammond gives his verdict on the future of Top Gear - and admits Freddie Flintoff's horror crash 'triggered' his own trauma from high-speed accident \n\nDIY SOS' Nick Knowles shares emotional update about his wife's recovery after complications during life-changing surgery which left her sobbing in agony\n\nTommy Fury left 'feeling so small' as Game of Thrones star and 'world's tallest athlete' towers over him\n\nCharlotte Church almost spills out of her plunging red gown as she makes a rare red carpet appearance with son Dexter Henson\n\nLauren Sanchez wears a cleavage boosting silk Valentino dress as she joins husband Jeff Bezos and his daughter for a lavish dinner \n\nPOLL OF THE DAY: Was it tasteless for Meghan to post a video of herself driving past the tunnel where Diana died?\n\nLady Gaga turns heads in a sheer Gucci dress as she and fiancé Michael Polansky hire out a Mayfair cocktail bar for date night\n\nPamela Anderson continues to rock her new copper cropped hair style during Paris Fashion Week\n\nDame Jilly Cooper dies aged 88: 'Queen of the bonkbuster' author who wrote Rivals and Riders passes away after a fall as family pay tribute\n\nInside the wedding album of Dame Joan Collins' son Alexander Newley, 60, as he marries his bride at romantic castle\n\nSort Your Life Out's Dilly Carter breaks down in tears recounting strain of juggling her cancer diagnosis with caring for her bipolar mum\n\nFrankie Bridge admits she squandered the fortune from her early pop star days after finding fame at the age of 12 with S Club Juniors\n\nEngland World Cup winner Lewis Moody, 47, breaks down as he reveals moment he told sons he has motor neurone disease \n\nLewis Capaldi jokes he was 'b*tched by Brundle' after the F1 legend swerved his handshake and awkwardly mistook his brother for him\n\nTaylor Swift drops further hints her new song Actually Romantic is about fellow pop star Charli XCX after she was 'roasted' over the track\n\nMeghan Markle savaged for 'utterly bewildering' Instagram video as she's driven past Diana crash tunnel with feet on the seat\n\nChris Robshaw's wife Camilla Kerslake covers his modesty with a big rugby ball emoji as she posts racy shirtless snap\n\nThomas Skinner is the first celebrity to be voted off Strictly Come Dancing - as devastated Amy Dowden thanks him for 'bringing her back'\n\nBBC announces future of The Graham Norton Show after 18 years on screens and string of awards\n\nBritney Spears worries fans with claims her leg 'snapped' as she shows off large bruises on her arms after sons' visit\n\nCharli XCX responds to Taylor Swift's 'diss track' by revealing she's back in the recording studio\n\nEastEnders' Kellie Bright reveals parenting struggle that left her family 'drained and maddened' as she makes desperate plea to schools\n\nJustin Bieber shows off his wild side while enjoying boys' trip in Scotland after fans trolled him over ex Selena Gomez's marriage\n\nAmy Schumer shows off dramatic weight loss in leggy snap after Ozempic nightmare\n\nShowcased her shrinking frame\n\nTaylor Swift exudes provocative showgirl glamour in daring rope dress and brunette hair in new Fate of Ophelia music video\n\nRonnie O'Sullivan, 49, reveals plans for retirement with his new wife after she gave him an ultimatum to quit the UK for Dubai amid fears he'll quit snooker\n\nKylie Jenner dares to bare in sheer lace blouse and see-through skirt as she poses in racy snaps\n\nSydney Sweeney's romance with Scooter Braun continues to heat up as they hold hands in NYC\n\nPamela Anderson shows off her new short strawberry blonde locks as she leads the stars at the Paris Fashion Week Valentino show\n\nTina Turner's son Ike Jr. dies one day after his 67th birthday\n\nPassed away in Los Angeles on Saturday\n\nTaylor Swift shares sexy BTS snaps from The Fate of Ophelia music video... as she breaks streaming record\n\nEric Clapton is locked in bitter planning row with millionaire neighbours after claiming their plans for £2.3m Surrey Hills home will threaten his 'sanctuary'\n\nKim Kardashian puts on a very racy display as she goes braless in sheer vintage Margiela top\n\nBen Stiller reveals separation from wife of two decades caused him to feel 'disconnected' from his family in new documentary\n\nBackstage bloodbath leaves Loose Women in turmoil: Insiders reveal show is fighting for survival after shock sacking\n\nRevealed: Queen Elizabeth II's final state visit that perfectly encapsulated her subtle influence\n\nAmanda Holden puts on a leggy display in sexy boots for new snaps - after revealing the perils of raising teenage girls\n\nPrincess Beatrice's navy broderie blouse is in high demand - but luckily it comes in white as well\n\nVictoria Beckham reveals what she really thought about THAT viral Rolls Royce moment in her husband David's Netflix documentary\n\nHome and Away star Isabel Lucas is pregnant with her first child at 40 after debuting new surfer boyfriend\n\nNicole Kidman puts on a brave face as she makes FIRST public appearance since Keith Urban divorce filing\n\nStepping out \n\nHuge pop star's nepo baby daughter, 14, 'set to follow in her mother's footsteps' in the music industry\n\nAlan Carr says fans will see 'a different side to him' on The Celebrity Traitors... and insists there will be 'no comedy'\n\nEmily Blunt looks elegant in a cream silk skirt as she films The Devil Wears Prada 2 with co-star Justin Theroux on location in Milan\n\nMiley Cyrus reveals dad Billy Ray cried after she wrote her song Secrets about their rift\n\nJeremy Renner reveals why he shared rare photo of daughter, 12, two years after horror snowplow accident\n\nMartin Brundle apologises to Lewis Capaldi after he awkwardly left him hanging for F1 grid walk handshake - just after mistaking him for his brother!\n\nMy seven-year-old loves Taylor Swift and I've always enjoyed her good, clean image. But her new album is disgustingly raunchy\n\nBig Brother's Zelah is accidentally 'outed' as transgender in front of all the housemates - after he narrowly avoided eviction\n\nErin Richards is pregnant! The Crown and Gotham star reveals she's expecting her second child at the BAFTA Cymru Awards\n\nFKA twigs goes topless beneath a stylish leather co-ord as she joins indie rockers The Last Dinner Party at Alexander McQueen show in Paris\n\nAmy Dowden joins Amber Davies and Anna Maxwell Martin on the red carpet at the BAFTA Cymru Awards after Strictly exit\n\nIconic 80s actress and Oscar nominee cuts glamorous figure months before milestone 80th birthday... who is she?\n\nMeghan Markle posts 'insensitive' video of her with feet up in limo being driven past tunnel where Princess Diana's fatal car crash occurred\n\nLana Del Rey makes extremely rare appearance with her alligator tour guide husband Jeremy Dufrene in Paris \n\nAmber Davies exudes glamour in a bejewelled pencil skirt as she joins lookalike sister Jade at the BAFTA Cymru Awards\n\nPregnant Pixie Lott cradles her baby bump as she the sings national anthem for thousands of fans at Tottenham Hotspur Stadium\n\nOlivia Wilde flashes her abs in white lace co-ord as she joins stylish Aimee Lou Wood and Rita Ora at Paris Fashion Week Chloe show\n\nMichelle Williams puts on a VERY leggy display in a thigh-skimming white minidress as she leads the glamour at Lacoste catwalk show in Paris\n\nThe quiet Osbourne breaks her silence: After 25 years Ozzy's eldest child Aimee to reveal all in new documentary\n\nDelighted Taylor Swift spots Cillian Murphy's son, 17, in the audience and labels the teen 'the future of our world' during Graham Norton Show\n\nClaudia Schiffer, 55, shows off her ageless good looks as she joins Liv Tyler on the front row for Chloe catwalk show at Paris Fashion Week\n\nHelen Flanagan reveals she was left bed bound for days by 'debilitating' disorder - but £1 'female Viagra' pill saved her\n\nTaylor Swift squashes Dwayne 'The Rock' Johnson in box office showdown with The Official Release Party of a Showgirl\n\nJustin and Hailey Bieber's son Jack Blues pays homage to dad in sweet throwback merch\n\nHailey took to Instagram over the weekend \n\nDog the Bounty Hunter makes dramatic intervention to save his fired cop son over deadly crash \n\nDavid Beckham shares sweet snap of daughter Harper, 14, sitting on his knee backstage as family shows support for Victoria\n\nBirthday boy Travis Kelce rocks quirky outfit as he lands in Jacksonville after turning 36\n\nPoppy Delevingne looks phenomenal in distinctive faux fur and leather jacket as she attends Chloe catwalk show in Paris\n\nCHRISTOPHER STEVENS reviews Frauds on ITV: How do you pinch a priceless Dali painting? I can't wait to find out...\n\nJennifer Garner proves she's also a cool mom after their ex stepmom Jennifer Lopez took them on shopping spree\n\nQuality time \n\nOre Oduba's ex wife Portia reveals she has found love again as she cosies up to new man just one year after shock split from the Strictly winner\n\nTravis Kelce shows strain with ex Kayla Nicole in resurfaced videos after Taylor Swift diss track\n\nAmanda Holden reveals the perils of parenting teenage girls as youngest daughter Hollie, 14, 'won't speak to her'\n\nRomeo Beckham shares new photo of mystery girl after he liked ex Kim Turnbull's sizzling bikini snaps\n\nSmitten Madison Beer enjoys sideline kiss with Justin Herbert as she supports NFL-star beau in Los Angeles\n\nPeter Crouch returns to the pitch six years after retiring as a striker as he tries his hand at American football in London\n\nRosie Huntington-Whiteley shows off her lithe legs in a sophisticated blazer dress as she leaves the Ritz in Paris\n\nI was on Four Weddings and WON - but our honeymoon prize came with two major catches we were totally unprepared for\n\nCeline Dion health update as she makes a rare appearance with her sons as she enjoys Paul McCartney's Las Vegas concert\n\nJane Fonda revives Cold War-era activist group to defend free speech amid 'most frightening' times\n\nGetting involved \n\nJennifer Aniston reveals why she respects journalists 'more' than ever\n\nShe stars in The Morning Show\n\nEmma Watson looks carefree as she steps out at Paris Fashion Week after being branded 'ignorant of how ignorant she is' by JK Rowling\n\nAmerican superstar Harry Connick Jr. looks effortlessly stylish as he cheers on his beloved NBA team at Rod Laver Arena\n\nTop Stories\n\nLIVE TOP STORIES\n\nNicole Kidman ditches wedding ring with killer new look after Keith Urban split\n\nDaily Star·4hrs ago\nSee more versions\n\nRosie Jones attacked in vile 'ableist and homophobic' assault on night out\n\nDaily Mirror·10hrs ago\nSee more versions\n\nSelena Gomez shares video of Taylor Swift hyping her up before her wedding\n\nABC News·52mins ago\nSee more versions\n\nStrictly Come Dancing star pulls out of show as they issue apology to fans\n\nDaily Star·6hrs ago\nSee more versions\n\nMAFS UK fans make Ofcom complaints after 'disgraceful' episode\n\nDaily Star·7hrs ago\nSee more versions\n\nMarried At First Sight's Reiss Boyce: his age, his 'dirty' job and his TOWIE ex\n\nHeat World·9hrs ago\nSee more versions\n\nWhat Taylor Swift's \"Life of a Showgirl\" era teaches us about reinvention and resilience\n\nWyoming Tribune Eagle·7hrs ago\nSee more versions\n\nI'm A Celebrity All Stars line-up – soap legend, fan favourite and sports icon\n\nDaily Star·7hrs ago\nSee more versions\n\nThylane Blondeau stuns at the Miu Miu show during Paris Fashion Week\n\nDaily Mail·9hrs ago\nSee more versions\n\nDonald Trump says Diddy has made pardon request after sentencing\n\nDaily Mirror·3hrs ago\nSee more versions\nClick here to view more \n\nDaily Mail Celeb\n\nDaily Mail Celeb\n\n@DailyMailCeleb\n\nMORE DON'T MISS\n\nVice Principals actress Kimberly Hébert Gregory dead at 52\n\nFKA twigs is hand-in-hand with boyfriend Jordan Hemingway as couple leave the Siena Party during Paris Fashion Week\n\nSydney Sweeney earns major career triumph after American Eagle backlash\n\nThe actress marked a major milestone\n\nMeghan Markle shares very glamorous prep for Paris Fashion week appearance, including practising French on Duolingo and eating 'frites' \n\nLauryn Goodman 'has no plans to see Jack Draper again' after one coffee date with the tennis ace she met on Raya\n\nJoJo Siwa fan addresses being thrown out of her concert over 'offensive' hoodie and insists she didn't know about cruel hairline memes\n\nVictoria Beckham 'cried' during her 'triggering' new documentary and reveals she didn't like herself in husband David's series\n\nSNL makes mockery of JK Rowling as her trans clash with Emma Watson reaches boiling point\n\nSNL aired a controversial skit\n\nDavinia Taylor, 47, reveals why she left the Primrose Hill party set behind as she shares simple lifestyle hacks that have given her a biological age of 20\n\nKate Garraway admits she has 'done a lot of crying' after the death of her husband Derek Draper as she reveals Celebrity Traitors is a chance to have fun\n\nThe most recognisable celebrities in the world.... but were forced into adopting stage personas - can YOU match the birth name to the star?\n\nFerne McCann admits she and fiancé Lorri Haines are rarely intimate after having children as she reveals they 'still have no plans to get married'\n\nHollywood's long-lasting golden couples who prove love isn't dead yet... after Nicole Kidman and Keith Urban's shock split\n\nBodyguard to the stars spills secrets of what it's like to work for the A-list - from covering up affairs to the billionaires who were incredibly tight\n\nI was on Dragons' Den and it was utterly terrifying - there were two major setbacks behind the scenes and I couldn't believe what the BBC cut during editing\n\nBrave in the face of his own mortality amid ALS battle, insiders reveal Eric Dane's tragic reality: 'He knows his fate'\n\nMeghan Markle accused of copying 'birthday twin' after Royal posts similar photos to the Suits star\n\nKate Middleton can't stop wearing burgundy this season - here's how to style autumn's chicest trend\n\nMartin Brundle hosts another CHAOTIC Formula One grid walk with 'Lewis Capaldi interview' - before accidentally snubbing the Scottish singing superstar?\n\nVictoria Beckham empathises with the Gallaghers' mother on 'tough' decades-long feud as she hints at her feelings about issues with son Brooklyn\n\nEva Longoria sends pulses racing in plunging bejewelled gown as she cosies up to model Baptiste Giabiconi and mingles with royalty\n\nGary Neville sparks fury by claiming 'angry middle-aged white men' flying Union Jack flags are dividing Britain in wake of Manchester synagogue attack\n\nCurse of the House of Guinness: How brewing dynasty has been plagued by tragedy and scandal - from a marriage witnessed by Hitler to suicide, affairs and armed robbery\n\nIsla Fisher steps out with her rarely-seen young son at NFL game in London- after breaking silence on split with Sacha Baron Cohen\n\nA sunny Sunday in Balmoral: The King and Queen wave at well-wishers at they drive to church\n\nJulia Roberts bemoans 'super-male dominated' Hollywood as 'fearless' star reveals how she has combatted the industry during her three decade career\n\nNicole Kidman and Keith Urban's model daughter Sunday Rose leans on cousin Lucia Hawley for support in Paris amid her parents' marriage split\n\nMeghan Markle embraces Anna Wintour but has a VERY awkward headbutt with designer after stunning Paris Fashion Week\n\nA new Time Lord? Prince William tours set of Doctor Who at Cardiff studios ahead of the Welsh BAFTAs\n\nKim Kardashian continues to channel Kris Jenner with momager's trademark pixie cut at BoF gala during Paris Fashion Week\n\n'Why can nobody do the accent? Shane MacGowan's widow leads Irish criticism of Netflix's House of Guinness\n\nDavina McCall breaks down in tears as she reveals the moment she decided she must have brain surgery on her tumour while out on a run\n\nMovie fans 'emotionally destroyed' by 'heartbreaking' new film that 'ends with a gut punch' - claiming emotional scenes left them 'in tears'\n\nKyle Walker's former lover Lauryn Goodman is 'dating tennis ace Jack Draper after matching on celeb dating app'\n\nLiam Payne's mentor Nicole Scherzinger reveals heartbreaking final text to him on the day of his death\n\nHow Nicole Kidman secretly nursed her broken heart in London... from runs on Hampstead Heath, dinners at Nobu, and a trip to Wimbledon - and the role played by Isla Fisher: KATIE HIND\n\nKim Kardashian wears JUST a fur coat as a dress as she joins Leonardo DiCaprio at Paris Fashion Week soirée\n\nRICHARD EDEN reveals the secret trick Prince William uses to keep prying eyes away\n\nMeghan's own catwalk moment: Duchess of Sussex 'struts' out of hotel on the way to Balenciaga show\n\nEmily Ratajkowski looks chic in a leopard print coat as she steps out with a male companion for a night out during Paris Fashion Week\n\nMeghan Markle suffers 'awkward' greeting with Balenciaga designer as pair bash heads during air kiss gone wrong at Paris Fashion week \n\nThe picture they tried to bury: Prince Andrew and Jeffrey Epstein enjoy shooting party at the Queen's hunting lodge... with the billionaire also accused of having sex with teenager Virginia\n\nHow Jennifer Aniston fixed my broken heart, by her new man: Hypnotherapist and life coach opens up on how she has made him smile\n\nThomas Skinner leaves Strictly fans 'traumatised' with latest performance - as partner Amy Dowden gushes 'life's too short not to take risks'\n\nKourtney Kardashian joins mini-me daughter Penelope for coffee run with Travis Barker in Palm Springs as sister Kim lights up Paris Fashion Week\n\nJackie Apostel, 29, publicly hits back at troll's swipe over her age-gap relationship with Cruz Beckham, 20, after clan put on a united front at Victoria's show\n\nInside the Windsor walkabout where Kate Middleton 'went into self preservation mode' after Prince Harry and Meghan Markle stepped down as working Royals\n\nInside Tyson Fury's wedding to Paris: Boxer salvaged love with a text after break-up just months before, she thought he was an 'old man'\n\nTaylor Swift reveals even MORE songs are on the way after blockbuster release of The Life Of A Showgirl\n\nJon Hamm crashes Bad Bunny's SNL monologue as rapper pokes fun at actor's viral clip at Puerto Rico concert\n\nRobbie Williams forced to cancel final tour gig in Turkey over terror fears as hitmaker tells fans decision to axe performance 'was beyond our control'\n\nCharli XCX goes braless in see-through dress as she is seen for the first time since Taylor Swift 'diss track' at BoF event during Paris Fashion Week\n\nBad Bunny trolls MAGA critics of his Super Bowl halftime show while hosting Saturday Night Live\n\nUS singer Teddy Swims savaged by Aussie viewers over NRL Grand Final performance and odd choice to wear a kilt: 'Meat Loaf was better than this'\n\nRosie Huntington-Whiteley, FKA Twigs and Anne Hathaway step out for Balenciaga's Paris Fashion Week show as they rub shoulders with Meghan Markle\n\nStrictly returns for Week Two as birthday girl Amber Davies tops the leaderboard while Ross King breaks down in tears \n\nPaloma Faith reveals she saw a BBC psychologist 'all the time' while filming The Celebrity Traitors after finding the show 'intense'\n\nMeghan Markle makes surprise appearance at Paris Fashion Week in first visit to Europe for more than two years\n\nCelebrity Traitors stars dress to impress in new series of BBC reality show - but which whose outfit cost £15,000?\n\nLifting Amy will be a doddle after this! Thomas Skinner returns to his day job delivering mattresses in between Strictly rehearsals\n\nIris Law leads the glamour in a figure hugging dress as she joins Winnie Harlow and Lennon Gallagher at the CARBONE Dubai launch party\n\nDemi Lovato wows in revealing cutout look with stylish Jenna Ortega and Taylor Hill at star-studded Paris Fashion Week show\n\nEmma Watson's sheltered life of luxury at Oxford: How millionaire Potter star mingles with students half her age and attends secret society gatherings\n\nSydney Sweeney's boyfriend Scooter Braun gets 'real' on romance as nemesis Taylor Swift soars with new album\n\nGrey's Anatomy star gives candid health update after being diagnosed with Hashimoto's disease\n\nLeopard print-clad Rita Ora puts on a VERY leggy display in black leather hot pants as she steps out in Paris during Fashion Week\n\nFreddy Brazier reveals he will name his child after his late-mother Jade Goody in touching tribute if his pregnant ex welcomes a baby girl\n\n'It should be for people who've never danced': Strictly's Nadiya wades into row over trained celebrities after former musicals star Amber Davies is drafted in\n\n'If we die tonight, do you think that Meghan will come to my funeral?': Why drinking PG Tips with Thomas Markle as his 19th-floor Philippines apartment was rocked by an earthquake was the most surreal moment of my life, writes CAROLINE GRAHAM\n\nHailey Bieber goes pantless as she flaunts her impossibly long legs in daring leather jacket look\n\nIs Robert Irwin heading for The Bachelor? Rumours heat up that the single star could be looking for love on TV - after stripping off for Dancing With The Stars\n\n'They're ruining rehearsals': Strictly insiders kick out at chaperones brought in to avoid another scandal\n\nFreddie Flintoff reveals how his cricket instincts saved his life during horrific Top Gear car crash: 'Half my face is different, but I'm not dead'\n\nHollywood star and son of acting icon dead at 84 after mystery illness\n\nSimon Cowell returns to Britain's Got Talent with a painful injury as he reveals the 'real reason' behind his absence after throwing auditions into chaos\n\nTaylor Swift leaves Leonardo DiCaprio and The Rock eating her dust in box office blowout\n\nPrince William 'deeply proud' as he unveils finalists for this year's Earthshot Prize in new video - with British firms vying for £1million award\n\nStrictly's Karen Carney reveals childhood health condition that could impact her performance on the dancefloor\n\nKris Jenner reacts to Kim Kardashian's dramatic new haircut after fans say she's channeling mom\n\nMadonna, 67, keeps a very low profile as she blends into the crowd with her toy boy lover Akeem Morris, 29, to support Chelsea at Stamford Bridge\n\nGolden Bachelor's Gerry Turner engaged after shock split... to blonde beauty who slid into his DMs\n\nKris Jenner who? Kim Kardashian is the spitting image of her mum as she debuts iconic pixie cut at Paris Fashion Week\n\nNick Knowles' wife Katie Dadzie rushed to hospital with complications from lifesaving surgery that's left her 'crying with the pain'\n\nCaprice warns people against using weight loss jabs after she suffered terrible side effects from trying to lose 20lbs out of fear of being fat-shamed\n\nRihanna steps out for FIRST TIME since welcoming third child as she celebrates ASAP Rocky's birthday in Hollywood\n\nThe Celebrity Traitors star David Olusoga confesses he has rewatched 36 hours of the show to prepare\n\nBenidorm star Asa Elliott reveals the staggering amount of royalties he receives 10 years after starring on the show\n\nMeghan Markle's 'indestructible perma-smile' next to a 'dissolved' Prince Harry was a last-ditch attempt at proving herself\n\nBrooks Nader risks yet another wardrobe malfunction as she struggles to contain her assets at PFW\n\nA tale of two midlife crisis: How Hollywood nice guys Hugh Jackman and Keith Urban shocked the world by ending their long marriages and went on to date younger women\n\nKylie Jenner nearly spills out of VERY sheer top in Paris after not being seen with Timothee Chalamet in months\n\nDemi Lovato shows off her incredibly taut face as she leads the stars attending Vivienne Westwood show during Paris Fashion Week\n\nKelly Osbourne shares heartache over watching mother Sharon care for sick Ozzy through to his final moments\n\nParis Fury's wedding plans for daughter Venezuela, 16, 'revealed' after her 'shock' engagement to boxer boyfriend\n\nMeghan and Kate's feud was rumoured to have started BEFORE the wedding - but did Kate hand her the bouquet on the big day?\n\nTV star reveals his nepo father has a cameo in his latest Netflix show as he sneaks him on set - but can YOU guess who it is?\n\nTravis Kelce's ex Kayla Nicole FIRES BACK at Taylor Swift after singer's Life of a Showgirl jab\n\nMy war with Harry & Meghan, by PIERS MORGAN: What really happened, their absurd accusations, the brutal truth about post-royal life... and how I believe their royal racism lies helped kill off woke \n\nTessa Thompson, 42, links arms with boyfriend Brandon Green, 31, as they enjoy night out at Grand Palais Party in Paris\n\nJeff Bezos and Lauren Sanchez are morphing into each other with bold matching outfits during Paris getaway\n\nI met Alesha Dixon out shopping away from Britain's Got Talent - she showed her true colours when there were no cameras around\n\nTravis Kelce dealt major Golden Globes snub as fiancee Taylor Swift celebrates Life of a Showgirl release\n\nStorm Amy batters Britain: Jason Manford suffers terrifying flight drama, cars are smashed and trees downed as 100mph winds sweep country\n\nKelsey Parker 'is struggling to help her children navigate the grief of losing stillborn sibling Phoenix as it brings back loss of her late husband Tom'\n\nRevealed - £160M Tyson Fury's daughter and her VERY modest start to married life: Venezuela, 16, and her scrap metal dealer fiancé are building a home at caravan park\n\nTaylor Swift ROASTED by Charli XCX fans over Actually Romantic diss track after she was seen dancing to her performance at the Grammys\n\nKeith Urban DROPS song inspired by Nicole Kidman out of tour setlist amid shock divorce\n\nReal Housewives of Orange County star MARRIES Shannon Beador's ex\n\nJessica Alba is chic 48th Mill Valley Film Festival after reunion with estranged husband\n\nFrom Hollyoaks... to Hollywood? The unlikely British soap stars who cracked America after quitting the UK - as Michelle Ryan returns to EastEnders\n\nKylie Jenner puts on a very racy display in a tiny lace bra as she steps out for dinner during PFW\n\nTaylor Swift reveals how her mum Andrea and brother Austin were able to get back her masters after years-long music battle\n\nCamilla Kerslake hopes her 'big mouth' doesn't land Strictly star husband Chris Robshaw in the bottom two after taking swipe at 'experienced dancers' \n\nHow Jenny Powell stays in incredible shape at 57: From multiple hot yoga sessions a week to her secret weapon bone broth\n\nThe varied fates of Love Island season three: From huge TV success to freak accidents and high profile romances\n\nStevie Nicks wishes Lindsey Buckingham a happy birthday... after getting him kicked out of Fleetwood Mac\n\nRita Ora flashes her silver underwear in a racy sheer dress as she joins Cynthia Erivo and Shanina Shaik at Edward Enninful's EE72 party during Paris Fashion Week\n\nAJ Odudu stuns in a silk mini dress and suspenders as she joins Big Brother co-host Will Best ahead of show\n\nDr oh no! 007 fans blast 'woke' Amazon for removing sexy Bond girls and even spy's gun from posters\n\nA look back at happier times as Brooklyn Beckham and wife Nicola Peltz snub Victoria's Paris Fashion Week show after smiling on the front row last year\n\nA House Of Dynamite review: This nuclear war thriller is terrifyingly realistic and a masterclass in cinematic tension, raves MATTHEW BOND\n\nDavid Beckham gushes over his amazing wife as the family sit united on the front row at Victoria's fashion show while Brooklyn's absence is felt more than ever\n\nSacha Baron Cohen, 53, looks in good spirits as he enjoys night out in Paris after being pictured with OnlyFans model Hannah Palmer, 27\n\nJulia Fox puts on a leggy display in a quirky mini dress with giant shoulder pads as she attends De Beers Group launch event in NYC\n\nKylie Jenner flashes her sculpted midriff in skimpy bra with Rosalia after viral 'awkward' moment amid PFW\n\nRebekah Vardy and husband Jamie 'land huge deal for reality show with ITV' as she moves on from Wagatha Christie scandal\n\nOzzy Osbourne takes final savage dig at fellow rocker Sting as he proves bitter feud continued until the end in new documentary\n\nLike Princess Diana, Sarah Ferguson's marriage broke down after her second pregnancy - and she had a scandalous affair when she was carrying Eugenie\n\nThe outrageous moments cut from Open House: The Great Sex Experiment to keep show on right side of Ofcom - as star of show reveals what REALLY goes on BTS\n\nJustin Bieber enjoys stay at plush Gleneagles resort in Scotland - as he lines up for his shot on the world famous golf course\n\nNetflix fans 'too scared to sleep' after streaming 'absolutely terrifying' new thriller that 'demands to be binge-watched'\n\nThe Beckhams put on a united front as they head to Victoria's Paris Fashion Week show while eldest son Brooklyn, 26, is a no-show\n\nSacha Baron Cohen says synagogue attack is 'part of the biggest surge in hatred of Jews since the Nazis'\n\nStrictly's Vicky Pattison reveals she went back to therapy before taking part in the show as she weighs in on the controversy surrounding contestants with dance experience\n\nPaul O'Grady's grave finally has a headstone two and a half years after his death and a 'lengthy application process'\n\nOne year on, look who's a front row no-show: For years it was a family affair, but Victoria Beckham's latest fashion show was a painful reminder of her estrangement from eldest son Brooklyn, by KATIE HIND\n\nAMANDA PLATELL: Like Nicole Kidman, I too was abandoned by a pathetic mid-life crisis bloke who felt diminished by my achievements... I know why they do it\n\nKim Kardashian makes glamorous arrival in fur coat at Paris Fashion Week after trying to upstage Taylor Swift's new album\n\nLola Young 'in secret legal row with US producer Carter Lang over hit song Messy' - after singer announced career hiatus to 'work on herself'\n\nNewlyweds Jeff Bezos and Lauren Sanchez put on sweet display as they return to Italy two months after lavish Venice wedding\n\nUnCANCELLED? Blake Lively shows support for ex-BFF Taylor Swift as rumors swirl song is about their rocky relationship\n\nSelena Gomez shares glimpse as she writes her vows in BTS photos from Benny Blanco wedding\n\nVictoria Beckham grabs proud husband David for a passionate kiss as she beams with pride after Paris Fashion Week show as Brooklyn snubs event amid feud\n\nThe THREE singers Keith Urban's been cosying up to revealed - now Nicole Kidman's on the warpath and has done the thing every estranged husband fears most: ALISON BOSHOFF\n\nMariah Carey breaks silence on rumored feud with Eminem after he offered her INSULTING movie role in 8 Mile\n\nThe Celebrity Traitors 'will return for series two' as they scout for next A-lister lineup ahead of spin-off debut\n\nIsla Fisher wows in a strapless gown with daring slit after breaking silence on her divorce as she leads the stars at the Albie Awards\n\nIt's day one of Diddy's comeback tour: MAUREEN CALLAHAN's dark prediction of Sean Combs' shameless next act... and who'll be welcoming him back with open arms\n\nBig Brother's second housemate evicted as Gani Khan leaves the house in a dramatic live show rocked by Storm Amy\n\nKaia Gerber puts on a leggy display in a silky black dress as she joins Heidi Klum and her daughter Leni at an afterparty at Costes hotel in Paris\n\nTaylor Swift reveals how Travis Kelce 'went all out' with 'very strategic' proposal amid album release\n\nNepo baby, 18, takes Paris Fashion Week by storm as he steps out with iconic drama actress mom in rare public sighting\n\nAnnabel Croft, 59, becomes a grandmother for the first time as her daughter Amber, 31, gives birth to a baby boy - two years after the tragic death of her beloved husband\n\nBLACKPINK star Rosé tipped for Grammys glory after brutal 'mean girl' snub at Fashion Week\n\nFreddy Brazier cuts a stylish figure as he joins Princess Andre and her loved up brother Junior as they lead the stars at Tulleys Farm Shocktober Fest\n\nFans erupt at Taylor Swift's 'dig' at Travis Kelce's ex Kayla Nicole in wild The Life of a Showgirl track\n\nFarewell, Queen of Snobs: Actress who made haughty Hyacinth Bucket a TV comedy legend, writes CHRISTOPHER STEVENS\n\nRebel Wilson denies ordering the creation of 'malicious websites' about The Deb producer - as new details emerge about her latest legal threat\n\nSoo Catwoman dies aged 70: Model and punk icon's children release heartbreaking statement after star fell into a coma\n\nI've loved Taylor Swift for years. So believe me when I say: Her new album proves Travis Kelce is the worst thing to ever happen to her, writes KENNEDY\n\nDiddy sentenced to 50 MONTHS in prison for prostitution offenses as he's branded a vile and unrepentant woman beater\n\nTale of two T-shirts: How Brooklyn and Cruz Beckham both chose to wear personalised tops to send VERY different messages\n\nWhy Swifties are going crazy for the 'Easter Eggs' in her new album Life of a Showgirl\n\nOasis legend Paul 'Bonehead' Arthurs is diagnosed with prostate cancer and says he will take a break from the band's worldwide reunion tour\n\nTaylor Swift fans are convinced that singer's song 'CANCELLED!' is about Chiefs WAG bestie Brittany Mahomes\n\nKelly Clarkson is 'healed' by a celebrity after admitting she feels intense grief over the death of her ex-husband\n\nTaylor Swift reveals MAJOR wedding detail as she confirms she is already planning her Travis Kelce nuptials\n\nHow Keith Urban once snorted £157K worth of cocaine over a few days - as details emerge about his staggering drug and alcohol addiction \n\nJamie Redknapp issues apology live on Sky Sports to Lord Sugar after Apprentice star threatened to sue following claim he left Tottenham in 'a mess'\n\nDiddy stands frozen like a statue as he gets FOUR YEARS prison for prostitution offenses by judge who branded him a depraved predator: LIVE UPDATES\n\nJason Manford forced to cancel gig due to Storm Amy just hours before taking to the stage as flight diverts\n\nCharlize Theron sports a black bra with a statement necklace and white suit as she joins Raye and Jenna Ortega at Givenchy Paris Fashion Week show\n\nRobert Pattinson shares rare comments on fatherhood as he poses in quirky shoot for ICON Magazine \n\nGrime rapper Skepta appears in court charged with drug-driving and speeding\n\n50 Cent makes wild Diddy jibe as his nemesis is sentenced to four years in jail\n\nLady Gaga reveals whether she wants children with fiance Michael Polansky\n\nDiddy says SORRY to Cassie as he speaks for first time in 13 months at prostitution sentencing hearing\n\nBig Brother first live eviction thrown into chaos as Storm Amy forces ITV bosses to make brutal backdoor eviction twist\n\nAwkward moment between Kylie Jenner and 'best friend' Rosalia at Fashion Week shocks fans\n\nFans rip into 'cringe' Love Island star after excruciatingly awkward exchange with Suni Lee goes viral\n\nToday's headlines\n\nBritain's phone theft kingpins: Gang who export HALF of UK's snatched handsets and made a fortune shipping...\n\nRevealed: How Dame Jilly Cooper died in the hours after falling at Grade II listed home in The Cotswolds -...\n\nMother who faked terminal cancer to con boyfriend into paying for boob job must pay back £30,000\n\nRevealed: Which slimming jab REALLY works best. The doctors' ultimate expert guide on which to pick, how to...\n\nWhat causes those unsightly red lumps on your legs that just won't go away. DR SCURR reveals the answer,...\n\nMother, 42, who drowned toddler daughter, two, at a beauty spot after stopping medication for postnatal...\n\nNicole Kidman is supported by children Sunday Rose, 17, and Faith, 14, at star-studded Chanel catwalk show...\n\nBackstage bloodbath leaves Loose Women in turmoil: Insiders reveal twist that's left show fighting for...\n\nFunctioning alcoholics hide in plain sight... so are YOU one? These are the six signs you might have a...\n\nParents die in hot bath after drinking to celebrate four-year-old daughter's birthday - leaving the girl an...\n\nGraham Norton Show audience member makes explosive claims about 'uncomfortable' moment host shut down...\n\nThe 24 must-have items for autumn, picked by top fashion editor HANNAH SKELLEY. They'll renew your look and...\n\n'Obsessive' Antiques Roadshow guest stunned into silence as he learns value of 'really rare' collection...\n\nHow to cure your sciatica for good - WITHOUT powerful drugs: Our experts reveal the simple steps and...\n\nBaffling new theory emerges about missing boy Gus, 4, who vanished on an Outback station - as search...\n\nLauren Sanchez and Jeff Bezos put on a loved-up display as they join a host of stars at the Paris Fashion...\n\nMoment furious bystanders confront young woman as she cuts down yellow ribbons for Israeli hostages from a...\n\nMother 'murdered' her son, five, and tried to kill herself after 'challenges of caring for him' made her...\n\nAmerican liberal says he's now a Trump supporter after seeing how rough and dangerous London has become\n\nKey North Atlantic current is on the brink of COLLAPSING - plunging Europe into a 'Little Ice Age',...\n\n'Trump has COMPLETELY lost it': President attacked after making extraordinary 9/11 claim\n\nI'm A Celebrity All Stars' full line-up 'revealed' - with pop star, soap legend and football ace among the...\n\nRICHARD LITTLEJOHN: Football clubs take the knee for BLM - so why did they almost all ignore the shocking...\n\nVictoria Coren Mit","summary":"Karen has revealed that she is using Strictly to help 'rebuild confidence' after being 'crushed' by the sexist abuse she faced as a football pundit.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15168279/Karen-Carney-Strictly-confidence-crushed-sexist-abuse.html","image":"https://i.dailymail.co.uk/1s/2025/10/06/23/102758379-0-image-m-61_1759790277892.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/04/3305095641514856139/1024x576_MP4_3305095641514856139.mp4","publish_date":"2025-10-07 00:02:53","author":"Amelia Wynne,Editor","authors":["Amelia Wynne","Editor"],"language":"en","source_country":"gb","sentiment":0.118},{"id":366825414,"title":"Hamas and Israel open talks in Egypt under Trump's Gaza peace plan","text":"Delegations from Hamas and Israel on Monday (October 6, 2025) began indirect talks in Egypt on ending the nearly two-year war in Gaza, with U.S. President Donald Trump judging that the Palestinian militant group was ready to compromise over his proposals for a deal.\n\nAl-Qahera News, which is linked to Egyptian state intelligence, said the first round of talks ended \"amid a positive atmosphere\" and would continue on Tuesday (October 7, 2025).\n\nBehind closed doors and under tight security, negotiators were to speak through mediators shuttling back and forth, only weeks after Israel tried to kill Hamas's lead negotiators in a strike on Qatar.\n\nAl-Qahera News earlier said delegations were \"discussing preparing ground conditions for the release of detainees and prisoners\".\n\n\"Egyptian and Qatari mediators are working with both sides to establish a mechanism\" for the release of hostages held in Gaza in exchange for Palestinians held in Israeli jails, it said.\n\nMr. Trump told reporters at the White House he was \"pretty sure\" a peace deal was possible.\n\n\"I think Hamas has been agreeing to things that are very important... I think we're going to have a deal.\"\n\nHamas's lead negotiator Khalil al-Hayya, who survived Israel's attack on the Palestinian Islamist movement's leaders in Doha last month, held a meeting with Egyptian intelligence officials ahead of the talks, an Egyptian security source said.\n\nThis round of negotiations, launched on the eve of the second anniversary of Hamas's October 7, 2023 attack that sparked the war, \"may last for several days\", said a Palestinian source close to Hamas's leadership.\n\n\"We expect the negotiations to be difficult and complex, given the occupation's intentions to continue its war of extermination,\" he told AFP.\n\nMr. Trump, whose envoy Steve Witkoff and son-in-law Jared Kushner are expected in Egypt, has urged negotiators to \"move fast\" to end the war in Gaza, where Israeli strikes continued on Monday.\n\nAt least seven Palestinians were killed in the latest Israeli air strikes, according to Mahmud Bassal, spokesman for Gaza's civil defence agency.\n\nAFP footage showed explosions in the Gaza Strip, with plumes of smoke rising over the skyline, even after U.S. Secretary of State Marco Rubio said Israel must stop bombing the territory.","summary":"\"I think Hamas has been agreeing to things that are very important... I think we're going to have a deal, U.S. President Trump said\"","url":"https://www.thehindu.com/news/international/hamas-and-israel-open-talks-in-egypt-under-trumps-gaza-peace-plan/article70133711.ece","image":"https://th-i.thgim.com/public/incoming/r55t00/article70129064.ece/alternates/LANDSCAPE_1200/AP10_05_2025_000430B.jpg","video":null,"publish_date":"2025-10-07 00:02:45","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.284},{"id":366820770,"title":"Japan is getting a new leader, but her government could be over before it begins","text":"Sanae Takaichi is poised to make history as Japan’s first female prime minister, but her government may be imperilled before it even begins amid a deepening rift within the ruling coalition.\nThe Liberal Democratic Party Takaichi now leads and its long-time junior partner, Komeito, have been in coalition for 26 years. Without Komeito’s parliamentary support, the LDP would lose its majority in the Diet, forcing its leader to seek new political allies.\nYet analysts warn that Takaichi’s hardline conservative platform and outspoken views on immigration and wartime history have left her with few viable partners, raising the prospect of legislative paralysis just as Japan faces renewed economic strain from US President Donald Trump’s tariffs and mounting security tensions with China.\n“There is going to be a lot of political unpredictability with few good options for Takaichi,” Michael Cucek, a professor of Asian Studies at Temple University’s Tokyo campus, told This Week in Asia. “One possibility is simply that the LDP swallows its pride and soldiers on as it has been doing under [Shigeru] Ishiba and we wait for the post-Takaichi era.”\n\nThe suggestion that the clock might already be ticking on Takaichi’s leadership evokes an unsettling image for Japan: slipping back into an era of revolving-door prime ministers, with leaders like Ishiba serving barely a year before being forced out.\nWithin hours of Takaichi being elected as the first female head of the LDP – and, in all likelihood, Japan’s first female prime minister when the Diet formally convenes in the coming weeks – Komeito’s leader Tetsuo Saito and senior colleagues met her to air their misgivings.\nThe first concern, Saito later told local media, was the possibility of Takaichi’s cabinet members visiting the Yasukuni Shrine, a memorial in Tokyo honouring Japan’s war dead, including 14 Class A war criminals.\n\nTakaichi, who has visited the shrine in the past, has said she intends to continue doing so as prime minister – a stance bound to provoke anger in China and both North and South Korea.\nKomeito’s second objection stems from Takaichi’s outspoken stance on foreign nationals living in Japan. In July’s upper house election, right-wing parties that campaigned on anti-immigration sentiment, such as the populist Sanseito, performed strongly, reflecting a hardening shift among sections of the electorate towards nationalist rhetoric and social conservatism.\nSaito told reporters he had warned Takaichi that Komeito would be unable to remain in the coalition unless it received clear reassurances on both issues.\nFor Takaichi, who has built her career on ideological conviction, such reassurances are unlikely. Yet without new allies, her government risks political gridlock before it has even been sworn in.\n\n‘Nihilistic glee’\nDuring her leadership campaign, Takaichi floated the idea of partnering with Sanseito, which surged from a single seat to 14 in the 248-member upper chamber in July’s election.\nBut that alliance could be politically perilous, according to Cucek, adding that Takaichi would want to win back those voters who had abandoned the LDP for the far-right.\nSaneito’s leader would also recognise that “aligning with the LDP to become part of its alliance traditionally means that the party does not do well in the next election”, he said.\nCompetition between LDP and Sanseito candidates over constituencies presents a further complication that could become existential for the ruling party.\n\n“Without Komeito’s support, which has always mobilised millions of votes for the LDP, Sanseito could very easily siphon off enough voters in single-member districts to wipe the LDP out,” Cucek said.\n“Sanseito would be willing to run candidates as spoilers against the LDP to wipe out conservatism in an outpouring of nihilistic glee.”\nBeyond Sanseito, the LDP has only limited options. The regional Japan Innovation Party, based in Osaka, has been mentioned as an alternative but also appears weakened. The populist Democratic Party for the People could, in theory, serve as a partner, but personalities may clash.\nYuichiro Tamaki, leader of the DPP, “has an absolutely titanic ego and I do not see any way that he and Takaichi could work together”, Cucek said. “Yes, the two parties do align on some economic proclivities but this would be a matter of clashing personalities.”\nIf the relationship with Komeito cannot be patched up … then Takaichi has no choice but to continue Ishiba’s policy of working with other parties\nToshimitsu Shigemura, politics professor\nToshimitsu Shigemura, a professor of politics and international relations at Waseda University in Tokyo, agreed that Takaichi’s search for a stable partner looked “extremely difficult”.\n“The differences on policy with the Japan Innovation Party are too wide and while an agreement with the DPP might look simpler, I do not see their membership agreeing,” he said.\n“If the relationship with Komeito cannot be patched up, and I think at this point that would be difficult, then Takaichi has no choice but to continue Ishiba’s policy of working with other parties on individual items of legislation and trying to rebuild the LDP to win more seats at the next election.”\nAnalysts caution that calling an earlier election could be risky for Takaichi, with much depending on how she handles the next few months – especially the passage of the national budget.\nIf she wins over enough voters from other parties and makes progress on rebuilding the LDP, then an election in February after the final passage of the budget cannot be ruled out, according to Cucek.","summary":"Sanae Takaichi is poised to make history as Japan’s first female prime minister, but her government may be imperilled before it even begins amid a deepening rift within the ruling coalition.\nThe Liberal Democratic Party Takaichi now leads and its long-time junior partner, Komeito, have been in coalition for 26 years. Without Komeito’s parliamentary support, the LDP would lose its majority in the Diet, forcing its leader to seek new political allies.\nYet analysts warn that Takaichi’s hardline...","url":"https://www.scmp.com/week-asia/politics/article/3328004/japans-first-female-pm-hits-political-gridlock-she-even-takes-office","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/06/93a1790c-a384-4d21-b3e1-791d75f1d4b8_b636ffa8.jpg","video":null,"publish_date":"2025-10-07 00:00:09","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","category":"politics","source_country":"cn","sentiment":0.076},{"id":366825792,"title":"Donald Trump news: US President schedules UFC fight at the White House on his 80th birthday","text":"US President Donald Trump has confirmed plans to host a major UFC fight on the White House lawn to celebrate his 80th birthday next year.\n\nThe event is scheduled for June 14, 2026, and will also mark the 250th anniversary of the United States’ independence.\n\n“On June 14 next year, we’re gonna have a big UFC fight at the White House, right at the White House, on the grounds of the White House,” Mr Trump, 79, said during his October 5 speech at the Naval Station Norfolk in Virginia.\n\nLast month, the White House teased the dramatic setup for the fight—a brightly lit cage and two large screens—via a post on X with the caption, “SEE YOU ON THE SOUTH LAWN @UFC.”\n\nThe event is part of the nationwide “America250” celebrations, which Mr Trump has promoted as honouring the country’s historic sites, national parks, and battlefields.\n\n“Does anybody watch UFC? The great Dana White? We’re going to have a UFC fight. We’re going to have a UFC fight — think of this — on the grounds of the White House. We have a lot of land there,” Mr Trump said.\n\nThe UFC’s CEO, Dana White, has confirmed the fight will take place as part of the 250th anniversary.\n\n“We’re going to build a little (octagon). We’re not, Dana is going to do it. Dana is great, one of a kind,” Mr Trump continued of the event plans for 2026.\n\n“(There’s) going to be a UFC fight, championship fight, full fight, like 20,000 to 25,000 people, and we’re going to do that as part of ‘250’ also.”\n\nWhite told The Associated Press in August, “Think about that, the 250th birthday of the United States of America, the UFC will be on the White House south lawn live on CBS.”\n\nMr Trump, who attended multiple UFC fights during his 2024 campaign, including a March event in Miami where the crowd chanted against President Joe Biden, also shared photos from UFC 309 in November alongside Elon Musk, Kid Rock, and UFC CEO Dana White.","summary":"US President Donald Trump has confirmed plans to host a major UFC fight on the White House lawn to celebrate his 80th birthday next year. ","url":"https://thewest.com.au/news/world/donald-trump-news-us-president-schedules-ufc-fight-at-the-white-house-on-his-80th-birthday-c-20263781","image":"https://images.thewest.com.au/publication/C-20263781/c1cb8b8436897176a0d5d21695372aa9c4acc5b7-16x9-x0y34w4111h2312.jpg?imwidth=1200","video":null,"publish_date":"2025-10-06 23:56:34","author":"Kimberley Braddish","authors":["Kimberley Braddish"],"language":"en","category":"politics","source_country":"au","sentiment":0.212},{"id":366826768,"title":"Trump approves Alaska mining road to boost copper, zinc production","text":"By MATTHEW DALY\n\nWASHINGTON (AP) — President Donald Trump on Monday ordered approval of a proposed 211-mile road through an Alaska wilderness to allow mining of copper, cobalt, gold and other minerals.\n\nThe long-debated Ambler Road project was approved in Trump’s first term, but was later blocked by the Biden administration after an analysis determined the project would threaten caribou and other wildlife and harm Alaska Native tribes that rely on hunting and fishing.\n\nThe gravel road and mining project, north of Fairbanks, Alaska, “is something that should’ve been long operating and making billions of dollars for our country and supplying a lot of energy and minerals,” Trump said at an Oval Office ceremony. Former President Joe Biden “undid it and wasted a lot of time and a lot of money, a lot of effort. And now we’re starting again. And this time we have plenty of time to get it done,” Trump added.\n\nIn a related development, the White House announced it is taking 10% equity stake in Trilogy Metals, a Canadian company that is seeking to develop the Ambler site along with an Australian partner.\n\nThe U.S. government said last week it is taking a minority stake in Lithium Americas, another Canadian company that is developing one of the world’s largest lithium mines in Nevada. The Department of Energy will take a 5% equity stake in the company and a 5% stake in the Thacker Pass lithium mining project, a joint venture with General Motors.\n\nInterior Secretary Doug Burgum said approval of Ambler Road will unlock access to copper, cobalt and other critical minerals “that we need to win the AI arms race against China.”\n\nSupporters, including Alaska’s congressional delegation, have said the road is needed to reach a large copper deposit worth more than $7 billion. Copper is used in production of cars, electronics and even renewable energy technologies such as wind turbines.\n\nOpponents, including a consortium of 40 federally recognized tribes, worry that development allowed by the road would put subsistence harvests at risk because the lands include important habitat for salmon and caribou.\n\nKarmen Monigold, an Inupiaq member of Protect the Kobuk, a Northwest Arctic advocacy group opposed to the access road, said she cried when she first learned of Trump’s actions. “And then I reminded myself of who we are, and who our people are and how far we’ve come,” she said Monday in a telephone interview. “They tried to assimilate us, to wipe us out and yet we’re still here. We still matter.”\n\nMonigold said she hopes Alaska Native groups will file lawsuits, as they’ve done before, to halt the project.\n\nThe two-lane gravel road includes about 26 miles that would cut through Gates of the Arctic National Park and Preserve. The road would also cross 11 rivers and thousands of streams before reaching the site of a future mine.\n\nThe Republican-controlled House approved a bill last month that would pave the way for Trump to expand mining and drilling on public lands in Alaska and other states. The vote, largely along party lines, would repeal land management plans adopted in the closing days of Biden’s administration that restricted development in large areas of Alaska, Montana and North Dakota.\n\nBiden’s goal was in part to reduce climate-warming emissions from the burning of fossil fuels extracted from federal land. Under Trump, Republicans are casting aside those concerns as they open more taxpayer-owned land to development, hoping to create more jobs and revenue and boost fossil fuels such as coal, oil and natural gas. The administration also has pushed to develop critical minerals, including copper, cobalt, gold and zinc.\n\nWhile Trump has often said, “drill, baby, drill,” he also supports “mine, baby, mine,” Burgum said. “We’ve got to get back in the mining business.”\n\nTrump’s order finds that the proposed road is in the public interest, given U.S. needs for domestic critical minerals, and says there is no economically feasible alternative route.\n\nThe decision directs the federal Bureau of Land Management, National Park Service and U.S. Army Corps of Engineers to reissue necessary permits to construct the road.\n\nTristen Pattee, an Inupiaq who serves as an environmental technical supervisor at Red Dog zinc mine near Kotzebue, Alaska, said approval of the road is long overdue.\n\n“I’m excited for the opportunities that are going to be coming in and all the jobs that will be created,” he said. “I look forward to them responsibly building the road and making sure it’s operated as permitted.”\n\nAmbler Metals, a joint venture between Trilogy Metals and Australia-based South32, thanked Trump for jump-starting the Ambler project.\n\n“This road will help secure the critical minerals our country needs for economic competitiveness and national defense, while also delivering meaningful benefits here at home,” said managing director Kaleb Froehlich.\n\nAssociated Press writer Annika Hammerschlag in Seattle contributed to this story.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org","summary":"The long-debated Ambler Road project was approved in the first Trump administration.","url":"https://www.bostonherald.com/2025/10/06/trump-alaska-mining-road/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Trump_Alaska_Mining_Road_83671-3.jpg?w=1024&h=683","video":null,"publish_date":"2025-10-06 23:53:37","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.065},{"id":366819564,"title":"Trump approves Alaska mining road to boost copper, zinc production","text":"By MATTHEW DALY\n\nWASHINGTON (AP) — President Donald Trump on Monday ordered approval of a proposed 211-mile road through an Alaska wilderness to allow mining of copper, cobalt, gold and other minerals.\n\nThe long-debated Ambler Road project was approved in Trump’s first term, but was later blocked by the Biden administration after an analysis determined the project would threaten caribou and other wildlife and harm Alaska Native tribes that rely on hunting and fishing.\n\nThe gravel road and mining project, north of Fairbanks, Alaska, “is something that should’ve been long operating and making billions of dollars for our country and supplying a lot of energy and minerals,” Trump said at an Oval Office ceremony. Former President Joe Biden “undid it and wasted a lot of time and a lot of money, a lot of effort. And now we’re starting again. And this time we have plenty of time to get it done,” Trump added.\n\nIn a related development, the White House announced it is taking 10% equity stake in Trilogy Metals, a Canadian company that is seeking to develop the Ambler site along with an Australian partner.\n\nThe U.S. government said last week it is taking a minority stake in Lithium Americas, another Canadian company that is developing one of the world’s largest lithium mines in Nevada. The Department of Energy will take a 5% equity stake in the company and a 5% stake in the Thacker Pass lithium mining project, a joint venture with General Motors.\n\nInterior Secretary Doug Burgum said approval of Ambler Road will unlock access to copper, cobalt and other critical minerals “that we need to win the AI arms race against China.”\n\nSupporters, including Alaska’s congressional delegation, have said the road is needed to reach a large copper deposit worth more than $7 billion. Copper is used in production of cars, electronics and even renewable energy technologies such as wind turbines.\n\nOpponents, including a consortium of 40 federally recognized tribes, worry that development allowed by the road would put subsistence harvests at risk because the lands include important habitat for salmon and caribou.\n\nKarmen Monigold, an Inupiaq member of Protect the Kobuk, a Northwest Arctic advocacy group opposed to the access road, said she cried when she first learned of Trump’s actions. “And then I reminded myself of who we are, and who our people are and how far we’ve come,” she said Monday in a telephone interview. “They tried to assimilate us, to wipe us out and yet we’re still here. We still matter.”\n\nMonigold said she hopes Alaska Native groups will file lawsuits, as they’ve done before, to halt the project.\n\nThe two-lane gravel road includes about 26 miles that would cut through Gates of the Arctic National Park and Preserve. The road would also cross 11 rivers and thousands of streams before reaching the site of a future mine.\n\nThe Republican-controlled House approved a bill last month that would pave the way for Trump to expand mining and drilling on public lands in Alaska and other states. The vote, largely along party lines, would repeal land management plans adopted in the closing days of Biden’s administration that restricted development in large areas of Alaska, Montana and North Dakota.\n\nBiden’s goal was in part to reduce climate-warming emissions from the burning of fossil fuels extracted from federal land. Under Trump, Republicans are casting aside those concerns as they open more taxpayer-owned land to development, hoping to create more jobs and revenue and boost fossil fuels such as coal, oil and natural gas. The administration also has pushed to develop critical minerals, including copper, cobalt, gold and zinc.\n\nWhile Trump has often said, “drill, baby, drill,” he also supports “mine, baby, mine,” Burgum said. “We’ve got to get back in the mining business.”\n\nTrump’s order finds that the proposed road is in the public interest, given U.S. needs for domestic critical minerals, and says there is no economically feasible alternative route.\n\nThe decision directs the federal Bureau of Land Management, National Park Service and U.S. Army Corps of Engineers to reissue necessary permits to construct the road.\n\nTristen Pattee, an Inupiaq who serves as an environmental technical supervisor at Red Dog zinc mine near Kotzebue, Alaska, said approval of the road is long overdue.\n\n“I’m excited for the opportunities that are going to be coming in and all the jobs that will be created,” he said. “I look forward to them responsibly building the road and making sure it’s operated as permitted.”\n\nAmbler Metals, a joint venture between Trilogy Metals and Australia-based South32, thanked Trump for jump-starting the Ambler project.\n\n“This road will help secure the critical minerals our country needs for economic competitiveness and national defense, while also delivering meaningful benefits here at home,” said managing director Kaleb Froehlich.\n\nAssociated Press writer Annika Hammerschlag in Seattle contributed to this story.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org","summary":"The long-debated Ambler Road project was approved in the first Trump administration.","url":"https://www.twincities.com/2025/10/06/trump-alaska-mining-road/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Trump_Alaska_Mining_Road_83671-3.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-06 23:53:37","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.065},{"id":366819732,"title":"Trump says Sean 'Diddy' Combs asked him for a pardon","text":"President Donald Trump said Monday that Sean \"Diddy\" Combs has reached out to ask for a pardon following his conviction on two prostitution-related charges.\n\n\"A lot of people have asked me for pardons,\" Trump told reporters in the Oval Office. \"I call him Puff Daddy, [he] has asked me for a pardon.\"\n\nA representative for Combs declined to comment on Trump's remarks Monday.\n\nCombs was sentenced on Friday to over four years in prison. He will get credit for the 12 months he's already served at the Metropolitan Detention Center in Brooklyn since his arrest in September 2024, as well as be fined $500,000.\n\nCombs' lawyers, who spoke exclusively with ABC News on Friday, said they are considering an appeal, arguing that the judge unfairly imposed a sentence four times longer than what they had requested and that it was improperly based on unproven allegations not included in the conviction.\n\n\"The jury made it very clear in their verdict that they acquitted him of the sex trafficking and the RICO counts,\" lead attorney Teny Geragos said at the time. \"Not guilty means not guilty.\"\n\nAccording to a letter from his legal team, Combs has asked to serve his sentence at FCI Fort Dix, a low-security federal prison in New Jersey that houses about 4,000 inmates and offers a drug treatment program known as RDAP, or the Residential Drug Abuse Program.\n\n\"In order to address drug abuse issues and to maximize family visitation and rehabilitative efforts, we request that the Court strongly recommend to the Bureau of Prisons that Mr. Combs be placed at FCI Fort Dix for RDAP purposes and any other available educational and occupational programs,\" defense attorney Teny Geragos said in the letter on Monday.\n\nTrump's comments came after he was asked about another possible pardon -- for Ghislaine Maxwell, a former associate of Jeffrey Epstein. The Supreme Court on Monday declined to hear Maxwell's appeal challenging her sex trafficking conviction, without offering an explanation.\n\n\"I'll take a look at it,\" Trump said. \"I will speak to the Justice Department,\" he added.\n\nMaxwell is currently serving a prison sentence for her role in helping Epstein recruit, groom and abuse underage girls as part of a sex trafficking scheme.","summary":"The music mogul was sentenced to 50 months in prison on Friday.","url":"https://abcnews.go.com/ABCNews/US/trump-sean-diddy-combs-asked-pardon/story?id=126273920","image":"https://i.abcnewsfe.com/a/89717e4d-3e36-4ee4-8f6e-9f62053e2521/trump-1-ap-er-251006_1759787335052_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-10-06 23:51:02","author":"Shafiq Najib","authors":["Shafiq Najib"],"language":"en","source_country":"us","sentiment":-0.19},{"id":366824574,"title":"Sharpie shows us how it’s done —invest in Americans and we’ll produce again","text":"President Donald Trump loves a good Sharpie, and now he has all the more reason to love the company that makes them.\n\nThe president signed the flurry of executive orders the day he returned to office with a Sharpie.\n\nHe’s used them for years since discovering they were more reliable than more expensive pens.\n\nThey have another merit, too: They’re almost entirely made in America.\n\nOnly the felt tip of a Sharpie comes from abroad — it’s made in Japan, according to The Wall Street Journal’s Natasha Khan, who published an eye-opening article on the penmaker this week.\n\nWhat makes Newell Brands, the corporation that makes Sharpies, so newsworthy is its success in saving money — and holding down consumer prices — by making the pens in America.\n\nNewell was once as dazzled as other manufacturers by the prospect of making its products more cheaply in Asia.\n\nBut in 2018, Newell’s Chris Peterson decided to try making the latest Sharpie, a gel version, at the company’s factory in Maryville, Tenn.\n\nPrompted perhaps by the political environment of the first Trump administration, the company had already been trying to move some manufacturing back to America from China.\n\nThe new pen required updating its Tennessee plant’s equipment and training workers to operate and maintain the new machines.\n\nThat’s what made the project a triumph — investment in an American factory, and in the Americans working there.\n\nThis country can make top-quality consumer goods at affordable prices, but only if companies invest in their equipment and in enhancing their workers’ skills.\n\nPeterson had the company pay to send factory-floor workers to college.\n\nThey came back ready to take on more technically demanding tasks, and their wages shot up, on average by 50% over the last five years in the CEO’s estimation.\n\nThe mandarins of globalization say higher wages surely have to mean lower profits, and doesn’t better machinery mean fewer workers?\n\nBut Newell’s production costs dropped even as employment levels held steady: The company, its plant and its workers improved together.\n\nNot every story in American manufacturing has such a happy outcome, of course — but Newell has proved the process that once led manufacturers and their workers alike to prosper still works in the 21st century.\n\nFord Motor Company famously discovered it could sell more cars by paying its workers well enough they could afford to buy the automobiles they were making.\n\nLong before globalization and containerized shipping, America’s national economy boomed thanks to a virtuous cycle of rising wages, more technological investment, an increasingly educated workforce and higher consumer spending on products made in America.\n\nSuccess at home led to success abroad: America was an exporting superpower that “ran persistent trade surpluses” from 1870 to 1970, according to the Federal Reserve Bank of St. Louis.\n\nTrump wants to make American manufacturing great again — but tariffs, which can help, are not enough by themselves.\n\nThe Sharpie case shows more domestic investment is critical.\n\nOne reason for American manufacturing’s relative decline in recent decades has been the high cost of building new plants or renovating old ones.\n\nEven if it’s profitable to manufacture in America, the upfront expenses are a hurdle, especially when foreign countries, which subsidize their industries in myriad ways, offer quicker returns on investment.\n\nTrump incurred the wrath of free-market purists by getting government more involved in businesses like Intel and US Steel.\n\nYet industries like chip-making and steel — or for that matter ship-building and aerospace — are sectors with heavy government involvement throughout the world.\n\nThe few countries that have significant manufacturing in those fields all use government to sustain their industries.\n\nMany smart free-market economists are dangerously naive about this. \n\nAt a recent Dallas-area debate I participated in, National Review economics editor Dominic Pino (who’s since moved to The Washington Post) contrasted “the government-driven protectionist model that we have used for US Steel for decades,” which has “now resulted in the quasi-nationalization of that company,” with “FedEx, which is profitable, employs way more Americans . . . and actually delivers services that Americans use every single day.”\n\nTrouble is, nowhere on earth is steel manufacturing as fully private an enterprise as FedEx is.\n\nThe choice Pino was presenting wasn’t between government-backed steel or free-market steel — it was between partly government-backed steel or no domestic steel-making at all.\n\nFor most American manufacturers, private investment is enough — though even then, government must consider what unfair practices other countries may adopt to lure investment away from our shores.\n\nThere’s also a role for government in ensuring a reasonably level playing field at home, so investment isn’t incentivized out of manufacturing and into other sectors without the heavy upfront costs of plants and machinery.\n\nBut the example of Newell Brands shows business leaders themselves, without any government help, can work miracles and defy globalization’s laws of gravity when they put capital behind America’s workers and factories.\n\nDaniel McCarthy is the editor of Modern Age: A Conservative Review and editor-at-large of The American Conservative.","summary":"This country CAN make top-quality consumer goods at affordable prices, but only if companies invest in their equipment and in enhancing their workers’ skills.","url":"https://nypost.com/2025/10/06/opinion/sharpies-success-story-invest-and-americans-will-produce-again/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/u-s-president-donald-trump-109312994.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-06 23:45:33","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.087},{"id":366820764,"title":"Trump says he will consider pardons for Ghislaine Maxwell and Sean ‘Diddy’ Combs","text":"US President Donald Trump on Monday left the door open to a pardon for Ghislaine Maxwell, who was convicted of helping the late financier and convicted sex offender Jeffrey Epstein sexually abuse teenage girls.\nTrump also said that Sean “Diddy” Combs, who was sentenced on Friday to more than four years in prison over his conviction on prostitution-related charges, had requested a pardon.\nOn the same day that the US Supreme Court declined to hear Maxwell’s bid to overturn her conviction, Trump, when asked whether he would set Maxwell free himself through a pardon, said he would speak to the Department of Justice.\n“I haven’t heard the name in so long. I can say this, that I’d have to take a look at it. I would have to take a look,” he said. “I will speak to the DOJ.”\nThe Epstein case has dogged Trump and his Justice Department for months, creating upset among Trump’s Make America Great Again political base, which has been unusually critical of the administration for not releasing more information about Epstein’s crimes and alleged associates.\nTrump and Epstein were friends but had a falling out. Epstein died in a Manhattan prison cell in 2019.\nIssuing a pardon to Maxwell would carry political risk for Trump. Both his supporters and his Democratic opponents have demanded the administration release files from the Justice Department’s Epstein investigation.\n\nThe president said a lot of people asked him for pardons and referenced Combs. “I call him Puff Daddy, [he] has asked me for a pardon,” Trump said.\nLaywers for Combs have said they are planning to appeal after the Grammy-winning artist and music executive was sentenced on Friday for transporting people across state lines for sexual encounters.\nThe case shattered his carefully cultivated reputation as an affable celebrity entrepreneur, A-list party host and reality television star.\nIt culminated in a public reckoning for the 55-year-old hip-hop star, who made a plea for leniency and wept as his lawyers played a video portraying his family life, career and philanthropy.\nUS District Judge Arun Subramanian also fined Combs US$500,000, the maximum allowed.\nAdditional reporting by Associated Press","summary":"US President Donald Trump on Monday left the door open to a pardon for Ghislaine Maxwell, who was convicted of helping the late financier and convicted sex offender Jeffrey Epstein sexually abuse teenage girls.\nTrump also said that Sean “Diddy” Combs, who was sentenced on Friday to more than four years in prison over his conviction on prostitution-related charges, had requested a pardon.\nOn the same day that the US Supreme Court declined to hear Maxwell’s bid to overturn her conviction, Trump,...","url":"https://www.scmp.com/news/world/united-states-canada/article/3328062/trump-says-he-will-consider-pardons-ghislaine-maxwell-and-sean-diddy-combs","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/07/ebcca9a2-725b-4062-892a-af58123dd485_a47ee054.jpg","video":null,"publish_date":"2025-10-06 23:43:51","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"cn","sentiment":-0.059},{"id":366825318,"title":"Inside Trump’s Secret War: DOJ Legal Opinion Authorises Strikes On Hidden List Of Drug Cartels","text":"A classified legal opinion from the US Justice Department’s Office of Legal Counsel (OLC) has granted President Donald Trump broad authority to conduct lethal strikes against a secret list of drug cartels, CNN reported, citing multiple sources familiar with the matter. The opinion argues the president can authorise deadly force against traffickers who pose an imminent threat to Americans — effectively framing cartels as enemy combatants rather than criminal groups. According to legal experts, the OLC memo could justify an open-ended campaign of lethal force against targets not publicly designated as terrorist organisations. “By this logic, any small, medium or big group that is trafficking drugs into the US could be treated as waging an attack against the United States,” said a former Pentagon lawyer quoted by CNN. Pentagon and CIA Lean on Memo for Covert Action A Defence Department memo to lawmakers last week cited the OLC’s opinion to justify a series of US military strikes on suspected drug-smuggling boats in the Caribbean. The Pentagon claimed the United States is in an “armed conflict” with drug cartels, with traffickers labelled as “unlawful combatants.” Defence Secretary Pete Hegseth confirmed at least four lethal strikes in recent weeks, including one that killed four people. Meanwhile, sources told CNN that the CIA’s authorities have been quietly expanded to include lethal targeting against cartel actors in Mexico and Venezuela. This follows Trump’s classified directive empowering both the military and intelligence community to “neutralise” transnational cartels operating in Latin America. Legal and Ethical Concerns Within the Pentagon Within the Department of Defense, several Judge Advocate General (JAG) officers and international law experts have reportedly raised concerns about the legality of such strikes. “The way forward is just to eat it and act in accordance with the Secretary’s policies,” one current JAG officer said anonymously. Lawmakers have requested a copy of the OLC opinion, but neither the DOJ nor the Pentagon has provided it to Congress. Attorney General Pam Bondi is expected to face questions on Capitol Hill over the administration’s expanding definition of “armed conflict” in the global war on drugs. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"A classified Justice Department opinion has granted President Donald Trump the legal authority to order lethal strikes against a secret and expansive list of Latin American drug cartels, CNN has reported. The opinion, drafted by the DOJ, argues the president can use deadly force against traffickers.","url":"https://www.timesnownews.com/world/us/us-news/inside-trumps-secret-war-doj-legal-opinion-authorises-strikes-on-hidden-list-of-drug-cartels-article-152953376","image":"https://images.timesnownews.com/thumb/msid-152953498,thumbsize-73362,width-1280,height-720,resizemode-75/152953498.jpg","video":null,"publish_date":"2025-10-06 23:43:37","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":0.132},{"id":366822872,"title":"Mother of Israeli hostage snatched by Hamas at Nova festival hopes peace deal talks will see her 'strong, beautiful' son released","text":"Hamas took Ditza Or's son Avinatan hostage two years ago today, but she dreams that soon she may finally be able to put her ear to his chest and hear his heartbeat.\n\n'That's how he used to hug me,' the British-Israeli tells the Daily Mail of her 'strong, beautiful' 32-year-old boy who was dragged into Gaza from the Nova festival on October 7, 2023.\n\n'You know, he's very tall – my ear is at the height of his heart.'\n\nThe world saw the appalling images that day of Avinatan's girlfriend, Noa Argamani, being kidnapped on a motorbike while he watched on helplessly.\n\nHer image went around the world following a powerful front page by The Mail on Sunday that became a symbol of the atrocity in which 1,200 were killed and 251 kidnapped.\n\nBut while Noa, 27, was rescued by the IDF in June last year, and any remaining female hostages were freed as part of a ceasefire last January, Ms Or still waits for her son.\n\nNow though, following Donald Trump's peace proposal last week, there is hope that all 48 hostages – of whom 20, including Avinatan, are believed to be alive – could soon be free.\n\nDelegations from Israel and Hamas began negotiations in Cairo yesterday and the US President urged them to 'move fast' on Sunday evening.\n\nHe described the talks as 'very successful, and proceeding rapidly' and Hamas was last night reportedly seeking guarantees on Israel's withdrawal if they release the hostages.\n\nMs Or, 58, said: 'When he was taken, I locked my heart very strongly and said I will not let hope in until it happens.\n\n'But now cracks are opening around my heart and light is coming in. I am afraid, I am anxious, I am excited. I am trying not to be too happy and hopeful, not to let the light come in yet, because it's all very uncertain.'\n\nAsked what she would do on meeting Avinatan, she said: 'The first thing I'll do when I see him is probably cry – and, like a mother who has just given birth, I'll check him all over, check his fingers, his eyes, and look at his face.\n\n'I want to put my ear on his chest and hear his heartbeat.'\n\nNoa and Avinatan had been together for over a year before the Hamas attack and Ditza only met her son's girlfriend for the first time after she was rescued.\n\nNoa has since flown around the world campaigning for her boyfriend, tirelessly meeting world leaders and giving inspiring speeches – but she still finds the time to support Ditza. \n\n'Noa gives us strength,' she said. 'She joins us at family occasions – like when my daughter got married a few months ago. She is part of the family in a special way.'\n\nShe has also shared stories of the bravery of Avinatan on October 7. 'Noa told me that when they were abducted, he had a few chances to run away from their captors, but he chose to stay by her side and not leave her with those monsters.\n\n'He is very strong, and in a way, he chose his destiny – his greatness is part of who he is. He would always protect others. He is very special.'\n\nNew details emerged yesterday of the horrors inflicted that day as Israel released files showing October 7 mastermind Yahya Sinwar gave instructions on how to film the slaughter.\n\nTerrorists were urged to prioritise kidnapping 'children and women' and broadcast footage of the slaughter 'to incite the masses [in Gaza] to go out and support us'.\n\nSince her son was taken, Ditza says the last two years have felt like 'just trying to survive'.\n\nThe deeply religious mother-of-seven says she draws strength from the prayers of others, saying: 'This is what keeps me breathing, positive, and hopeful.'\n\nThe last image she has of Avinatan in her head is from a family event to mark the birth of a grandchild – and now, the same daughter is hosting an event this week to celebrate the birth of another child.\n\n'It was in a beautiful park near our home – we were so happy,' she says. 'This Thursday we will be in the same place. I am wishing and praying that Avinatan will be here for it.","summary":"Hamas took Ditza Or's son Avinatan hostage two years ago today, but she dreams that soon she may finally be able to put her ear to his chest and hear his heartbeat.","url":"https://www.dailymail.co.uk/news/article-15168393/Mother-Israeli-hostage-Hamas-Nova-festival-peace-deal-son-released.html","image":"https://i.dailymail.co.uk/1s/2025/10/07/00/102759405-0-image-m-49_1759793026920.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/06/15/887104628689880601/1024x576_MP4_887104628689880601.mp4","publish_date":"2025-10-06 23:43:32","author":"Andy Jehring,Editor,Natalia Lisbona","authors":["Andy Jehring","Editor","Natalia Lisbona"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.3},{"id":366825910,"title":"Sean 'Diddy' Combs' lawyers want him sent to a New Jersey federal prison that offers drug treatment","text":"Sean “Diddy” Combs’ lawyers want the hip-hop mogul sent to a low-security federal prison in New Jersey to serve his four-year, two-month prison sentence, telling a judge Monday that the facility’s drug treatment program will help him stay clean.\n\nIn a letter, Combs’ lawyers urged the judge presiding over his case, Arun Subramanian, to “strongly recommend” that the federal Bureau of Prisons place Combs at FCI Fort Dix, a massive prison located on the grounds of the joint military base McGuire-Dix-Lakehurst.\n\nFCI Fort Dix, one of several dozen federal prisons with a residential drug treatment program, will best allow Combs “to address drug abuse issues and to maximize family visitation and rehabilitative efforts,” Combs lawyer Teny Geragos wrote.\n\nAlso Monday, President Donald Trump told reporters that Combs had asked him for a pardon. Trump, referring to Combs by the nickname “Puff Daddy,” did not say if he would grant the request. A message seeking comment on Trump’s remarks was left for Combs’ lawyers and his publicity team.\n\nCombs’ sentencing Friday on charges he transported people across state lines for sexual encounters capped a federal case that featured harrowing testimony about violence, drugs and so-called “freak-offs,” and exposed the sordid private life of one of the most influential figures in music.\n\nThe “I’ll Be Missing You” singer was convicted in July under the federal Mann Act, which bans transporting people across state lines for any sexual crime. His trial ended in a split verdict, with acquittals on sex trafficking and racketeering charges that could have put him behind bars for life.\n\nCombs has been locked up at a Brooklyn federal jail, the Metropolitan Detention Center, since his arrest in September 2024. That time will be subtracted from his sentence, meaning he could get out in about three years.\n\nSubramanian has not yet acted on the request to place him at FCI Fort Dix.\n\nJudges often make recommendations about where inmates should serve time, but it’s ultimately up to the Bureau of Prisons to decide. Those decisions, the agency has said, are based on a variety of factors, including the severity of the offense, the required security level and an inmate’s programming needs.\n\nFCI Fort Dix, the largest single federal prison by population with just under 3,900 inmates, is about 64 miles (103 kilometers) southwest of New York City, where Combs was born and rose to fame as a rapper and entrepreneur in an array of businesses, including fashion, television and liquor. An adjacent minimum-security prison camp has 210 inmates.\n\nThe facility has been home to a number of high-profile inmates over the years, including mobsters, corrupt politicians and “Pharma Bro” Martin Shkreli. For a time, it was run by the warden who had been in charge of a Manhattan federal jail when financier Jeffrey Epstein killed himself at the jail in 2019. That warden, Lamine N’Diaye, has since retired.\n\nIn 2021, a 27-year-old Fort Dix inmate was stabbed in the eyeball by a fellow prisoner.\n\nIn 2019, a Fort Dix inmate, a former inmate and two other people were arrested for using a drone to smuggle in contraband including cellphones, tobacco, weight-loss supplements and eyeglasses. The same year, a Fort Dix correctional officer pleaded guilty in a separate case to pocketing bribes to smuggle in contraband.\n\nDuring his time at Fort Dix, Shkreli ended up in solitary confinement amid allegations he was using a contraband smartphone to run his drug company from behind bars. Inmates are forbidden from conducting business and possessing cellphones.","summary":"Sean “Diddy” Combs’ lawyers want the hip-hop mogul sent to a low-security federal prison in New Jersey to serve his four-year, two-month prison sentence","url":"https://www.independent.co.uk/news/new-jersey-donald-trump-new-york-jeffrey-epstein-bureau-of-prisons-b2840582.html","image":"https://static.independent.co.uk/2025/10/04/17/Sexual_Misconduct_Diddy_46540.jpg?width=1200","video":null,"publish_date":"2025-10-06 23:43:14","author":"Michael R. Sisak,Michael R. Sisak and Larry Neumeister","authors":["Michael R. Sisak","Michael R. Sisak and Larry Neumeister"],"language":"en","source_country":"gb","sentiment":-0.16},{"id":366824566,"title":"Stream It Or Skip It: ‘Famous Last Words: Dr. Jane Goodall’ on Netflix, The First Episode In A New Posthumous Interview Series That Gives Public Figures A Chance To Speak From Beyond The Grave","text":"In Netflix’s interview show Famous Last Words: Dr. Jane Goodall, the recently deceased anthropologist sat with producer and host Brad Falchuk prior to her death to discuss her life. The special is purported to be the start of a new series, one that allows public figures the chance to speak freely knowing that the interview will only air after their death. It might sound ghoulish but instead it’s uplifting, an opportunity to reflect on a life well-lived. As Goodall calmly sips a whiskey, she’s equally reflective and honest about everything from her marriages, motherhood, and her real feelings about the most powerful men in the world. \n\nFAMOUS LAST WORDS – DR. JANE GOODALL: STREAM IT OR SKIP IT?\n\nOpening Shot: “When someone important dies, all you long for is just a little more time with them,” reads an opening title card. That sets up the premise of Netflix’s new, fascinating series that, one assumes, will only drop episodes after the death of cultural icons, like this first episode with Dr. Jane Goodall, in order to let us have one more (posthumous) moment with her.\n\nThe Gist: Famous Last Words is a great premise: the new series on Netflix, hosted by Brad Falchuk (of Gwyneth Paltrow’s husband fame), features an interview with a unique, beloved figure, filmed before their death, allows them the opportunity to offer a final, public message to the world. The subject of these interviews is well aware that these conversations will not air until after their death, whether that’s a matter of weeks, months or even years. (The New York Times reports that Goodall’s interview was filmed in March, and Netflix has at least three others banked, though they won’t reveal who the subjects are.)\n\nUpon Jane Goodall’s death last week at the age of 91, Netflix released an episode with the famed anthropologist and primatologist whose work with chimpanzees was groundbreaking and helped us better understand not just the animals but humans’ link to the animal world. \n\nAt the start of the interview, Goodall credits her mother’s support as one of the primary reasons she pursued her dream of working with animals. As a child, Goodall explains that her mother was never upset when she played with worms or disappeared for hours as a time to be with animals, and that her mother’s supportive, inquisitive nature led Goodall to feel like her interests mattered and were worth pursuing.\n\nGoodall is as humble as they come and often mentions how perplexed she is that she’s world famous, an “icon.” Her humility and quiet demeanor make it all the more fun when she’s asked who she dislikes, and she easily rolls off a list of political and business leaders, including Elon Musk, Donald Trump, Vladimir Putin and Benjamin Netanyahu, all of whom she says she wished would board one of Musk’s SpaceX rockets to another planet. Goodall compares the men on board this hypothetical rocket to the alpha male chimps she studies, whose aggression is the primary way they fight for dominance. (Though she doesn’t get deeply political, it’s clear that her passions for conservation and scientific research are at odds with much of what these men represent.)\n\nOf course it’s juicy and fun to hear someone air out their grievances and name names, but the more fascinating aspects of Goodall’s interview concern the more magical, mystical air that encircles her. She discusses her ability to communicate not just with animals but with nature in general, recounting a time when she simply asked the rain to stop, and it did. In another spiritual aside, she reveals seeing the spirit of her deceased husband who came to her after his death, reinforcing her belief that there is some kind of afterlife. \n\nThe interview is brief, under an hour, and covers topics that are very personal in nature, including her surprising thoughts on her two marriages, motherhood, and the deep relationships she’s had with the animals in her life. Though there is one thing she refuses to reveal – the name of a man she once loved – Goodall is open to talk about her life and the afterlife with the calm assuredness that has made her one of the most trusted figures of the past century.\n\nWhat Shows Will It Remind You Of? Famous Last Words is based on the Danish series The Last Word. What sets it apart from other similar interview shows is the specter of death looming throughout. Not in a creepy way, but here it forces Goodall to be reflective and consider her life as a whole and her legacy. While the subject’s death promises a certain level of insulation from any blowback to their hot takes or opinions, in this case, there’s nothing too controversial.\n\nOur Take: The set of Famous Last Words looks like the set of many other great interview shows like Inside The Actor’s Studio or My Next Guest Needs No Introduction, just two chairs atop a small platform. But there is no audience and there’s not even a crew on set, all the cameras are operated remotely so that Goodall is comfortable enough to speak candidly with no judgment or interruption. While Brad Falchuk is a good-enough interviewer, moving the conversation along and showing genuine affection and respect for Goodall, he seems an odd choice as host, perhaps mostly because he’s not a known personality. (I say that word in the truest sense: as someone who is mainly behind the camera, he comes to the show without a preexisting persona, and comes off as reverent but a bit dry, though Goodall needs little coaxing to deliver quality soundbites.)\n\nWhat was so moving about the entire episode was the way Goodall flowed between topics and was able to articulate the meaning of so many key moments in her life. In discussing her mother, who supported Jane’s passion for bugs and animals even as a toddler, it’s a lesson in what it means to be an unconditionally loving, non-judgmental parent. As she reflects on her love of nature, she recalls how entertained she was while watching two dung beetles get in a fight, and it’s honestly just as good as anything on DeuxMoi. Goodall bridges a gap between several generations; born in 1934, she lived through World War II, she lived through an era where women scientists had to fight for credibility, she has seen the planet undergo colossal devastation thanks to climate change, and despite all the reasons she might have to be bitter and frustrated by the state of the world, she remains progressive, optimistic, and ahead of her time. Aside from a couple of personal anecdotes, there’s nothing Goodall says in this interview is something she wouldn’t say freely at any other time, but there is some comfort in getting one last moment with her, one last chance to deliver words to remember her by.\n\nParting Shot: As the interview ends, Falchuk excuses himself to give the floor over to Goodall, allowing her to speak freely with some parting words. Goodall offers a speech, roughly three minutes long, about how every single human life matters and makes a difference, closing with, “Do your best while you’re still on this beautiful planet Earth that I look down upon from where I am now. God bless you all.” \n\nMemorable Dialogue: “I’m dead so I won’t have repercussions,” Goodall laughs when she’s told that the interview she’s filming is one where she can speak freely about any topic she likes. \n\nOur Call: The premise of Famous Last Words inherently makes for a much more moving and candid interview show than most others, and Goodall is not only game to openly discuss her successes, her grievances and her public image, but her wit and humility which shine through help emphasize the magnitude of our loss. STREAM IT.\n\nLiz Kocan is a pop culture writer living in Massachusetts. Her biggest claim to fame is the time she won on the game show Chain Reaction.","summary":"I SEE DEAD PEOPLE!","url":"https://decider.com/2025/10/06/famous-last-words-dr-jane-goodall-netflix-review/","image":"https://decider.com/wp-content/uploads/2025/10/Jane-Goodall.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/6oIboW9r-QVS3bn7S.mp4","publish_date":"2025-10-06 23:40:00","author":"Liz Kocan,mliss1578","authors":["Liz Kocan","mliss1578"],"language":"en","source_country":"zm","sentiment":0.175},{"id":366825316,"title":"Two Years Since the Deadly Hamas Attack, Can Trump's Plan Really Bring Peace to Gaza?","text":"It has been two years since Hamas-led militants stormed into Israel, triggering one of the bloodiest episodes in the modern history of the conflict. Nearly 1,200 Israelis were killed in the attacks on October 7, 2023, and 251 hostages were abducted and taken to Gaza. The attack pushed an already volatile Middle East into deeper crisis. However, now, as talks resume under US President Donald Trump's peace plan, hopes for an end to the war are flickering back to life. The Initial Attack and Its Retaliation On October 7, 2023, fighters from Hamas and allied militias breached the fortified border of Gaza and launched a relentless attack on Southern Israel. Israel, caught off guard by the scale of the operation, has described it as \"the darkest day in decades.\" The next day, the Israeli government began a full-scale military response. Since then, operations by the Israel Defense Forces (IDF) have killed at least 66,000 people, according to figures released by Gaza's Hamas-run health authorities. Around 80% of the dead are reported to be civilians, though independent agencies warn the real toll may be even higher. The International Organization for Migration estimates that 90% of Gaza's homes have been damaged or destroyed. Roughly 1.9 million of the enclave's 2.1 million residents have been displaced. Israel's blockade of Gaza has caused severe food shortages, with a UN-backed famine monitor reporting at least 450 deaths due to starvation, including 150 children. Trump's Ceasefire Plan Last month, US President Donald Trump unveiled a 20-point peace plan intended to end the war and start the reconstruction of Gaza. The proposal, which was put forth alongside Israeli Prime Minister Benjamin Netanyahu, included the release of hostages and the gradual rebuilding of Gaza under international supervision. Hamas, which has been severely weakened since the beginning of the conflict as several of their top leaders have been killed by IDF, has released several hostages on October 3, 2025. Despite this being the first mark of progress in implementing the peace plan, several of the provisions, including those surrounding Gaza's governance, continue to remain unacceptable for Hamas. Former Israeli ambassador to Washington, Michael Oren, told The Excerpt podcast that shifting political realities may offer an opening. \"I am actually much more hopeful today than a decade ago,\" he said. \"Despite two of the most difficult years in the history of Israel and the Middle East, shifting geopolitical conditions may open new paths to peace.\" Even Netanyahu has been cautious in his assessment. He acknowledged that while the plan could pave the way for a ceasefire, it also carried the risk of renewed escalation. Gaza's Humanitarian Crisis Across Gaza, the destruction is near total. Satellite imagery shows large swathes of Gaza City reduced to rubble. Almost every resident has been displaced at least once since the conflict began. The United Nations says one in three people now go without food for days, underscoring the depth of the humanitarian crisis. Netanyahu has rejected accusations that Israel is deliberately starving the population, claiming Hamas has diverted aid \"for its own purposes.\" But US Senator Chris Van Hollen, who visited Gaza as part of a congressional fact-finding mission, sharply criticized Israel's actions. \"Israel is implementing a plan to ethnically cleanse Gaza of Palestinians, and is using hunger as a weapon of war,\" he said. How the Conflict Affected the Entire Region The war's second year has redrawn much of the Middle East's political map. Israeli airstrikes have reached far beyond Gaza, striking targets in Lebanon, Syria, Yemen, and, most dramatically, Iran. In Lebanon, Israeli operations against Hezbollah have killed more than 3,100 people, including the group's longtime leader, Hassan Nasrallah. The IDF's 2024 campaign pushed Hezbollah fighters north of the Litani River before a ceasefire took effect on 26 November. Despite that truce, Israeli bombardments have continued, with officials citing Hezbollah's refusal to disarm. By mid-2025, Israel's focus had shifted toward Iran. After years of covert \"shadow warfare,\" the two states fought openly for 12 days in June 2025. The so-called 12-Day War saw Israeli strikes devastate parts of Iran's military infrastructure and prompted US air raids on Iranian nuclear facilities. Though the raids' effectiveness remains disputed, they allowed President Trump to declare victory and press both sides to halt hostilities. Iran's limited retaliation — a symbolic missile strike on a US base in Qatar — appeared designed to avoid escalation. Elsewhere, Israel has targeted Houthi rebels in Yemen who had attacked commercial ships in the Red Sea. In Syria, the collapse of Bashar al-Assad's regime has enabled Israel to occupy parts of the southern buffer zone near the Golan Heights, in violation of a 1974 agreement. In September, an Israeli strike in Doha aimed at killing senior Hamas figures failed, instead provoking rare unity among Gulf states and anger in Washington. Backlash over the strikes, however, brought Israel to accept the ceasefire plan as both US and Qatari officials pushed for broader talks. The Hostage Question Of the 251 hostages taken captive on October 7, 2023, most have been released through earlier ceasefire deals, or their remains have been returned. Roughly 20 people are still believed to be alive in captivity, while the bodies of at least 25 others have yet to be recovered. Families continue to hold vigils and protests demanding their release. Outside the United Nations General Assembly in New York last month, demonstrators displayed a banner reading: \"48 hostages are waiting for leaders to make courageous decisions.\" Macabit Mayer, whose twin nephews Ziv and Gali Berman remain in captivity, spoke emotionally at the rally. \"Her heart was racing and she could not breathe… an entire nation wants to breathe again,\" she said. The brothers marked their 28th birthday in captivity this September. The Road Ahead Two years on, Gaza lies shattered with its people displaced, its infrastructure decimated, and its future uncertain. Thousands of people have lost their lives and the conflict has reshaped the entire landscape of the Middle East. Although Trump's ceasefire plan may offer an end to the instability, analysts have cautioned that real peace in the region is still miles away.","summary":"Across Gaza, the destruction is near total. Satellite imagery shows large swathes of Gaza City reduced to rubble","url":"https://www.timesnownews.com/world/middle-east/israel-hamas-war-two-years-trump-gaza-ceasefire-plan-article-152953370","image":"https://images.timesnownews.com/thumb/msid-152953491,thumbsize-23344,width-1280,height-720,resizemode-75/152953491.jpg","video":null,"publish_date":"2025-10-06 23:39:55","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.211},{"id":366826422,"title":"Ex-Auburn coach Bruce Pearl responds to ESPN host hoping he was pressured to leave because he was 'divisive'","text":"Bruce Pearl stepped down as the Auburn Tigers men’s basketball head coach on Monday, and a longtime ESPN host appeared rather pleased about the news. \"Pardon the Interruption\" host Michael Wilbon called Pearl a \"divisive person\" and hoped there was \"pressure\" to push him out of the program. \"He had become a divisive person, it seems to me, intentionally. And I hope there was pressure to just get him out,\" Wilbon said. Pearl appeared on \"The Will Cain Show\" on Monday and offered a response to Wilbon, who he said he \"loves,\" adding that a \"dear friend\" of Wilbon reached out and said Wilbon's sentiments were \"probably political\" and \"not antisemitic.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I was a regular on ‘Pardon the Interruption.’ And I love Tony and Mike and have had great relationships with them… If there's anything I'm not, that is divisive. I've tried to bring people together my entire life. Maybe it's an example of why we can't agree to disagree about saying things politically,\" Pearl said. TARLETON STATE MEN’S BASKETBALL COACH BILLY GILLISPIE ON LEAVE AMID INVESTIGATION INTO ANONYMOUS COMPLAINT \"I was not forced out. I love Auburn. I love the opportunity now to be able to do some things for faith and family and our country, to be an advocate for Israel, an advocate for education. I'm looking forward to being able to do those things while my son is winning basketball games.\" Pearl, who is Jewish, has expressed his fervent support for Israel in the face of rising antisemitism in the U.S. since the Oct. 7 terror attacks in Israel. He’s been a supporter of how President Donald Trump has handled the conflicts in the Middle East as well. CLICK HERE TO GET THE FOX NEWS APP Pearl was one of the most successful men’s basketball coaches at the university. He was 246-125 as the Tigers’ head coach and led the team to two Final Four appearances. Fox News' Ryan Gaydos contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"After Michael Wilbon called Bruce Pearl &quot;divisive,&quot; the former Auburn men&apos;s head basketball coach responded to the ESPN analyst to say he is anything but.","url":"https://www.foxnews.com/sports/ex-auburn-coach-bruce-pearl-responds-espn-host-hoping-he-pressured-leave-because-he-divisive","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/bruce-pearl-10625.jpg","video":null,"publish_date":"2025-10-06 23:39:48","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"US","sentiment":0.089},{"id":366822168,"title":"Marjorie Taylor Greene demands ‘English-official’ law be passed before Bad Bunny’s Super Bowl performance","text":"Marjorie Taylor Greene has hit out at Spanish-language rapper Bad Bunny over his impending Super Bowl performance by calling for Congress to make English the official language of the U.S.\n\nIn a post on X Monday, the far-right congresswoman called Bad Bunny's selection \"perverse\" and \"unwanted\", while accusing the NFL of putting on \"demonic sexual performances\" during its halftime shows.\n\n\"Bad Bunny says America has four months to learn Spanish before his perverse unwanted performance at the Super Bowl halftime. It would be a good time to pass my bill to make English the official language of America,\" Taylor Greene said.\n\nThat was in response to the Puerto Rican musician's guest appearance on Saturday Night Live at the weekend, in which he told audiences after speaking a few phrases in Spanish: \"If you didn’t understand what I just said, you have four months to learn.\"\n\nKnown in ordinary life as Benito Antonio Martinez Ocasio, Bad Bunny speaks both English and Spanish but famously sticks to the latter in his music and public appearances. He has also repeatedly criticized President Donald Trump.\n\nThough English remains by far the main language of American life, Congress has never officially designated it as such. In March, Trump signed an executive order to that effect, but it's unclear how much legal force that has.\n\nTaylor Greene's law, also proposed in March, would make English \"the official language of the United States\" and require anyone wanting to become a naturalized citizen to \"read and understand\" the Constitution and the Declaration of Independence in English.\n\nThe NFL announced last week that Bad Bunny, one of the world's most-streamed artists and a three-time Grammy winner, would perform the halftime show at next year's Super Bowl LIV.\n\n\"What I’m feeling goes beyond myself,\" Bad Bunny said in a statement. \"This is for my people, my culture, and our history.\" Then he switched to Spanish, and concluded: \"Go and tell your grandma that we will be the SUPER BOWL HALFTIME SHOW!\n\nTrump officials and allies were outraged, with Homeland Security Secretary Kristi Noem vowing to station ICE agents at the Super Bowl to catch anyone who is not a \"law-abiding American who love[s] this country\".\n\nReferring to the NFL, she said: \"They suck, and we’ll win, and God will bless us, and we’ll stand and be proud of ourselves at the end of the day, and they won’t be able to sleep at night, because they don’t know what they believe, and they’re so weak, we’ll fix it.”\n\nConservative commentator Benny Johnson said the NFL was \"self-destructing\", while anti-DEI campaigner Robbie Starbuck accused it of \"pushing left-wing social issues\". \n\nPodcaster Josie Glabach called Bad Bunny \"a demonic Marxist\", and Fox News host Tomi Lahren falsely claimed that he as \"not an American artist\". \n\nPuerto Rico, where Bad Bunny was born and biased, is a U.S. territory.","summary":"The far-right congresswoman called Bad Bunny’s selection for the Super Bowl ‘perverse’ and ‘unwanted’ as she fumed about his impending halftime show","url":"https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-bad-bunny-super-bowl-halftime-show-b2840577.html","image":"https://static.independent.co.uk/2025/09/29/03/Super_Bowl_Bad_Bunny_42183.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/ng4ducra-4VHSaSK0.mp4","publish_date":"2025-10-06 23:39:43","author":"Io Dodds","authors":["Io Dodds"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.009},{"id":366819738,"title":"Democrats to highlight DOJ 'weaponization,' Epstein files in Bondi's Senate hearing","text":"President Donald Trump's tightening grip over the Justice Department to target his political opponents and lawmakers' increasing calls for the release of more files from federal investigations into deceased sex offender Jeffrey Epstein are likely to take center stage at a contentious Senate hearing Tuesday for Attorney General Pam Bondi. \n\nThe hearing before the Senate Judiciary Committee is the first time since July that Bondi has faced questions from lawmakers and follows a tumultuous summer for the department that included deployments of federal law enforcement to Democratic-run cities, a growing number of investigations announced into Trump's political foes and the controversial indictment of former FBI Director James Comey. \n\nAs ABC News first reported, the move to seek Comey's indictment came over the objections of career prosecutors and followed Trump's removal of his appointee to lead the U.S. Attorney's Office for the Eastern District of Virginia, Erik Siebert, who expressed reservations about pursuing charges against Comey and New York Attorney General Letitia James, sources told ABC News.\n\nTrump eventually installed a White House aide and former personal attorney Lindsey Halligan to lead the office and move forward with the case against Comey, and a grand jury narrowly voted to indict him on two counts of making false statements to Congress and obstructing a congressional investigation -- while declining to indict on a third false statements charge. Comey has denied wrongdoing and is set to appear Thursday in federal court for his arraignment.\n\nWhile sources told ABC News that leadership at DOJ expressed reservations about pursuing the case, Bondi and FBI Director Kash Patel went on to publicly cheer news of Comey's indictment in news interviews and social media posts. \n\nThe next week, the administration moved to fire a top national security prosecutor in the office, Michael Ben'Ary, over a misleading social media post that falsely suggested he was among the prosecutors who resisted charging Comey. \n\nBen'Ary was leading a major case against one of the alleged plotters of the Abbey Gate bombing during the U.S. withdrawal from Afghanistan. In a scathing departure letter, Ben'Ary set his sights squarely on the Justice Department's leadership and labeled his removal as just one in a series of recent moves taken to root out career officials for political reasons at the expense of the nation's security. \n\n“This example highlights the most troubling aspect of the current operations of the Department of Justice: the leadership is more concerned with punishing the President's perceived enemies than they are with protecting our national security,\" Ben'Ary wrote. \"Justice for Americans killed and injured by our enemies should not be contingent on what someone in the Department of Justice sees in their social media feed that day.”\n\nThe DOJ declined to comment when asked about Ben'Ary's letter.\n\nThose actions have caused unprecedented turmoil at the Eastern District, which oversees some of the nation's most sensitive national security, terrorism and espionage investigations.\n\nCurrent and former officials say that turmoil has reverberated further across the Justice Department's workforce around the country, with attorneys concerned they'll face professional repercussions if they resist taking part in politicized investigations or prosecutions.\n\nOn Monday, nearly 300 DOJ employees who left the department since Trump's inauguration released a letter on the eve of Bondi's hearing describing her leadership as \"appalling\" in its treatment of the career workforce and the elimination of longstanding norms of independence from the White House. \n\n\"We call on Congress to exercise its oversight responsibilities far more vigorously,\" the former employees said. \"Members in both chambers and on both sides of the aisle must provide a meaningful check on the abuses we’re witnessing. And we call on all Americans -- whose safety, prosperity, and rights depend on a strong DOJ -- to speak out against its destruction.\"\n\nThe DOJ declined to comment on the letter.\n\nBondi will likely also face heavy scrutiny over conflicting statements out of the administration on the Epstein files, after the Justice Department and FBI said in a July letter that no further releases were warranted and that there was no evidence suggesting others participated or enabled Epstein's abuse of minor girls. \n\nDemocrats have accused the administration of seeking to cover up any mentions of Trump or high-profile appointees who had past associations with Epstein, which the administration has denied. \n\nTrump and Epstein, who died by suicide in 2019 while awaiting trial on charges of trafficking young girls and women, were friends in the 1990s but the president said the relationship soured after Epstein poached some employees from Trump's Florida club after he explicitly warned him not to do so.\n\nAn effort underway in the House of Representatives to hold a vote on a measure that would demand the administration release the entirety of the files has been put on hold after Speaker Mike Johnson sent the House home amid the ongoing government shutdown. \n\nThe recent rise in acts of political violence will also likely be a central focus of questions to Bondi. Trump has recently ordered the department to ramp up investigations into so-called \"radical left\" organizations that he and other senior White House officials have alleged, without providing evidence, as helping to fund perpetrators who have attacked federal law enforcement officials dispatched around the country. \n\nJust days after Trump's comments, a senior official in the Justice Department ordered several U.S. Attorney's offices around the country to prepare to open sweeping criminal investigations in to the Open Society Foundations founded by billionaire George Soros, naming criminal statutes ranging from robbery, material support for terrorism and racketeering, ABC News previously confirmed.\n\nIn a statement, the Open Society Foundations called the accusations \"politically motivated attacks on civil society, meant to silence speech the administration disagrees with and undermine the First Amendment right to free speech.\"\n\nIn her most recent appearances before the House and Senate in late June, Bondi sought to brush off pointed questions from Democrats by repeatedly deflecting to crimes committed by undocumented immigrants in their states and districts that were among briefing materials she brought with her to the hearings. \n\nShe has also dismissed any characterization of the Justice Department appearing to work in lockstep with the White House as \"politicization\" of law enforcement. Bondi and other senior DOJ officials have instead argued that the two federal cases brought against Trump by a special counsel under the Biden Administration represented a far more egregious example of weaponization, echoing grievances leveled at the department by Trump. \n\n\"Whether you're a former FBI director, whether you're a former head of an intel community, whether you are current state and local elected official, whether you are a billionaire funding organizations to try to keep Donald Trump out of office -- everything is on the table,\" Bondi said in a Fox News appearance last month. \"We will investigate and will end the weaponization -- no longer will there be a two-tier system of justice.\"","summary":"The hearing follows a tumultuous summer for the Department of Justice.","url":"https://abcnews.go.com/Politics/democrats-highlight-doj-weaponization-epstein-files-bondis-senate/story?id=126260560","image":"https://i.abcnewsfe.com/a/90b4ff82-f190-417d-957f-deaa8d193c3a/pam-bondi-2-ap-gmh-250926_1758890268268_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-10-06 23:37:57","author":"Alexander Mallin","authors":["Alexander Mallin"],"language":"en","category":"politics","source_country":"us","sentiment":0.138},{"id":366826314,"title":"Solar and wind power has grown faster than electricity demand this year, report says","text":"By ALEXA ST. JOHN\n\nWorldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new analysis.\n\nGlobal solar generation grew by a record 31% in the first half of the year, while wind generation grew by 7.7%, according to the report by the energy think tank Ember, which was released after midnight Tuesday London time. Solar and wind generation combined grew by more than 400 terawatt hours, which was more than overall global demand increased in the same period, it found.\n\nThe findings suggest it is possible for the world to wean off polluting sources of power — even as demand for electricity skyrockets — with continued investment in renewables including solar, wind, hydropower, bioenergy and geothermal energies.\n\n“That means that they can keep up the pace with growing appetite for electricity worldwide,” said Małgorzata Wiatros-Motyka, senior electricity analyst at Ember and lead author of the study.\n\nAt the same time, total fossil fuel generation dropped slightly, by less than 1%.\n\n“The fall overall of fossil may be small, but it is significant,” said Wiatros-Motyka. “This is a turning point when we see emissions plateauing.”\n\nThe firm analyzes monthly data from 88 countries representing the vast majority of electricity demand around the world. Reasons that demand is increasing include economic growth, electric vehicles and data centers, rising populations in developing countries and the need for more cooling as temperatures rise.\n\nMeeting that demand by burning fossil fuels such as coal and gas for electricity releases planet-warming gases including carbon dioxide and methane. This leads to more severe, costly and deadly extreme weather.\n\nAnalyzing major markets\n\nEmber also dedicated part of its report to an analysis of China, India, the European Union and the U.S. Combined, they account for nearly two-thirds of electricity generation and carbon dioxide emissions from the power sector globally.\n\nIn the first six months of the year, China added more solar and wind than the rest of the world combined, and its fossil fuel generation fell by 2%, the report said.\n\nIndia saw record solar and wind growth that outpaced the growth in demand. India’s fossil fuel generation also dropped.\n\nIn both nations, emissions fell.\n\n“It’s often been said by analysts that renewable energy doesn’t really lead to a reduction in fossil fuel use,” said Michael Gerrard, founder and director of the Columbia University Sabin Center for Climate Change Law, who was not involved in the report. “This report highlights an encouraging step in the opposite direction.”\n\nBut in the U.S., demand growth outpaced the growth of clean power generation. In the E.U., sluggish wind and hydropower generation contributed to higher coal and gas generation, the report said. In both markets, fossil fuel generation and emissions increased.\n\nChallenges in the US\n\nThe U.S. clean energy market faces challenges as President Donald Trump’s administration shifts federal policy away from renewables and toward boosting coal, oil and gas production. The administration has terminated Biden-era funding that supported clean energy projects, repealed policy underpinning climate-related regulation and halted wind energy developments.\n\nMeanwhile, the administration has lifted barriers to coal mining, granted two years of regulatory relief to coal-fired power plants and other polluting industries and dedicated millions of dollars to these coal plants.\n\nIn his speech at the United Nations General Assembly last month, Trump attacked renewable energy and questioned the validity of the concept of climate change.\n\nExperts warn that Trump’s efforts to block clean energy will have a long-term impact.\n\n“The federal government is greatly increasing the growth of artificial intelligence, which is going to massively increase electricity demand, and they’re also shutting down the cheapest new sources of electricity, wind and solar. That’s going to lead to a gap in supply and demand,” Gerrard said.\n\nRenewables “still have an opportunity to make inroads in to displacing fossil fuels, even with some demand growth,” said Amanda Smith, senior scientist at research organization Project Drawdown, who also wasn’t involved in the report. But, Smith said: “I am very cautiously optimistic that renewables can continue to grow and continue to displace fossil fuels in the U.S. I am more optimistic on the world scale.”\n\nAlexa St. John is an Associated Press climate reporter. Follow her on X: @alexa_stjohn. Reach her at ast.john@ap.org.\n\nRead more of AP’s climate coverage.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Solar and wind generation combined grew by more than 400 terawatt hours.","url":"https://www.mercurynews.com/2025/10/06/climate-renewable-energy-report/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/Climate_Renewable_Energy_Report_53098-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-06 23:37:02","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":0.206},{"id":366819898,"title":"Solar and wind power has grown faster than electricity demand this year, report says","text":"By ALEXA ST. JOHN\n\nWorldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new analysis.\n\nGlobal solar generation grew by a record 31% in the first half of the year, while wind generation grew by 7.7%, according to the report by the energy think tank Ember, which was released after midnight Tuesday London time. Solar and wind generation combined grew by more than 400 terawatt hours, which was more than overall global demand increased in the same period, it found.\n\nThe findings suggest it is possible for the world to wean off polluting sources of power — even as demand for electricity skyrockets — with continued investment in renewables including solar, wind, hydropower, bioenergy and geothermal energies.\n\n“That means that they can keep up the pace with growing appetite for electricity worldwide,” said Małgorzata Wiatros-Motyka, senior electricity analyst at Ember and lead author of the study.\n\nAt the same time, total fossil fuel generation dropped slightly, by less than 1%.\n\n“The fall overall of fossil may be small, but it is significant,” said Wiatros-Motyka. “This is a turning point when we see emissions plateauing.”\n\nThe firm analyzes monthly data from 88 countries representing the vast majority of electricity demand around the world. Reasons that demand is increasing include economic growth, electric vehicles and data centers, rising populations in developing countries and the need for more cooling as temperatures rise.\n\nMeeting that demand by burning fossil fuels such as coal and gas for electricity releases planet-warming gases including carbon dioxide and methane. This leads to more severe, costly and deadly extreme weather.\n\nAnalyzing major markets\n\nEmber also dedicated part of its report to an analysis of China, India, the European Union and the U.S. Combined, they account for nearly two-thirds of electricity generation and carbon dioxide emissions from the power sector globally.\n\nIn the first six months of the year, China added more solar and wind than the rest of the world combined, and its fossil fuel generation fell by 2%, the report said.\n\nIndia saw record solar and wind growth that outpaced the growth in demand. India’s fossil fuel generation also dropped.\n\nIn both nations, emissions fell.\n\n“It’s often been said by analysts that renewable energy doesn’t really lead to a reduction in fossil fuel use,” said Michael Gerrard, founder and director of the Columbia University Sabin Center for Climate Change Law, who was not involved in the report. “This report highlights an encouraging step in the opposite direction.”\n\nBut in the U.S., demand growth outpaced the growth of clean power generation. In the E.U., sluggish wind and hydropower generation contributed to higher coal and gas generation, the report said. In both markets, fossil fuel generation and emissions increased.\n\nChallenges in the US\n\nThe U.S. clean energy market faces challenges as President Donald Trump’s administration shifts federal policy away from renewables and toward boosting coal, oil and gas production. The administration has terminated Biden-era funding that supported clean energy projects, repealed policy underpinning climate-related regulation and halted wind energy developments.\n\nMeanwhile, the administration has lifted barriers to coal mining, granted two years of regulatory relief to coal-fired power plants and other polluting industries and dedicated millions of dollars to these coal plants.\n\nIn his speech at the United Nations General Assembly last month, Trump attacked renewable energy and questioned the validity of the concept of climate change.\n\nExperts warn that Trump’s efforts to block clean energy will have a long-term impact.\n\n“The federal government is greatly increasing the growth of artificial intelligence, which is going to massively increase electricity demand, and they’re also shutting down the cheapest new sources of electricity, wind and solar. That’s going to lead to a gap in supply and demand,” Gerrard said.\n\nRenewables “still have an opportunity to make inroads in to displacing fossil fuels, even with some demand growth,” said Amanda Smith, senior scientist at research organization Project Drawdown, who also wasn’t involved in the report. But, Smith said: “I am very cautiously optimistic that renewables can continue to grow and continue to displace fossil fuels in the U.S. I am more optimistic on the world scale.”\n\nAlexa St. John is an Associated Press climate reporter. Follow her on X: @alexa_stjohn. Reach her at ast.john@ap.org.\n\nRead more of AP’s climate coverage.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Solar and wind generation combined grew by more than 400 terawatt hours.","url":"https://www.denverpost.com/2025/10/06/climate-renewable-energy-report/","image":"https://www.denverpost.com/wp-content/uploads/2025/10/Climate_Renewable_Energy_Report_53098-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-06 23:37:02","author":"Gqlshare,The Associated Press","authors":["Gqlshare","The Associated Press"],"language":"en","source_country":"US","sentiment":0.206},{"id":366819556,"title":"Solar and wind power has grown faster than electricity demand this year, report says","text":"By ALEXA ST. JOHN\n\nWorldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new analysis.\n\nGlobal solar generation grew by a record 31% in the first half of the year, while wind generation grew by 7.7%, according to the report by the energy think tank Ember, which was released after midnight Tuesday London time. Solar and wind generation combined grew by more than 400 terawatt hours, which was more than overall global demand increased in the same period, it found.\n\nThe findings suggest it is possible for the world to wean off polluting sources of power — even as demand for electricity skyrockets — with continued investment in renewables including solar, wind, hydropower, bioenergy and geothermal energies.\n\n“That means that they can keep up the pace with growing appetite for electricity worldwide,” said Małgorzata Wiatros-Motyka, senior electricity analyst at Ember and lead author of the study.\n\nAt the same time, total fossil fuel generation dropped slightly, by less than 1%.\n\n“The fall overall of fossil may be small, but it is significant,” said Wiatros-Motyka. “This is a turning point when we see emissions plateauing.”\n\nThe firm analyzes monthly data from 88 countries representing the vast majority of electricity demand around the world. Reasons that demand is increasing include economic growth, electric vehicles and data centers, rising populations in developing countries and the need for more cooling as temperatures rise.\n\nMeeting that demand by burning fossil fuels such as coal and gas for electricity releases planet-warming gases including carbon dioxide and methane. This leads to more severe, costly and deadly extreme weather.\n\nAnalyzing major markets\n\nEmber also dedicated part of its report to an analysis of China, India, the European Union and the U.S. Combined, they account for nearly two-thirds of electricity generation and carbon dioxide emissions from the power sector globally.\n\nIn the first six months of the year, China added more solar and wind than the rest of the world combined, and its fossil fuel generation fell by 2%, the report said.\n\nIndia saw record solar and wind growth that outpaced the growth in demand. India’s fossil fuel generation also dropped.\n\nIn both nations, emissions fell.\n\n“It’s often been said by analysts that renewable energy doesn’t really lead to a reduction in fossil fuel use,” said Michael Gerrard, founder and director of the Columbia University Sabin Center for Climate Change Law, who was not involved in the report. “This report highlights an encouraging step in the opposite direction.”\n\nBut in the U.S., demand growth outpaced the growth of clean power generation. In the E.U., sluggish wind and hydropower generation contributed to higher coal and gas generation, the report said. In both markets, fossil fuel generation and emissions increased.\n\nChallenges in the US\n\nThe U.S. clean energy market faces challenges as President Donald Trump’s administration shifts federal policy away from renewables and toward boosting coal, oil and gas production. The administration has terminated Biden-era funding that supported clean energy projects, repealed policy underpinning climate-related regulation and halted wind energy developments.\n\nMeanwhile, the administration has lifted barriers to coal mining, granted two years of regulatory relief to coal-fired power plants and other polluting industries and dedicated millions of dollars to these coal plants.\n\nIn his speech at the United Nations General Assembly last month, Trump attacked renewable energy and questioned the validity of the concept of climate change.\n\nExperts warn that Trump’s efforts to block clean energy will have a long-term impact.\n\n“The federal government is greatly increasing the growth of artificial intelligence, which is going to massively increase electricity demand, and they’re also shutting down the cheapest new sources of electricity, wind and solar. That’s going to lead to a gap in supply and demand,” Gerrard said.\n\nRenewables “still have an opportunity to make inroads in to displacing fossil fuels, even with some demand growth,” said Amanda Smith, senior scientist at research organization Project Drawdown, who also wasn’t involved in the report. But, Smith said: “I am very cautiously optimistic that renewables can continue to grow and continue to displace fossil fuels in the U.S. I am more optimistic on the world scale.”\n\nAlexa St. John is an Associated Press climate reporter. Follow her on X: @alexa_stjohn. Reach her at ast.john@ap.org.\n\nRead more of AP’s climate coverage.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Solar and wind generation combined grew by more than 400 terawatt hours.","url":"https://www.twincities.com/2025/10/06/climate-renewable-energy-report/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Climate_Renewable_Energy_Report_53098-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-06 23:37:02","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.206},{"id":366818576,"title":"Solar and wind power has grown faster than electricity demand this year, report says","text":"By ALEXA ST. JOHN\n\nWorldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new analysis.\n\nGlobal solar generation grew by a record 31% in the first half of the year, while wind generation grew by 7.7%, according to the report by the energy think tank Ember, which was released after midnight Tuesday London time. Solar and wind generation combined grew by more than 400 terawatt hours, which was more than overall global demand increased in the same period, it found.\n\nThe findings suggest it is possible for the world to wean off polluting sources of power — even as demand for electricity skyrockets — with continued investment in renewables including solar, wind, hydropower, bioenergy and geothermal energies.\n\n“That means that they can keep up the pace with growing appetite for electricity worldwide,” said Małgorzata Wiatros-Motyka, senior electricity analyst at Ember and lead author of the study.\n\nAt the same time, total fossil fuel generation dropped slightly, by less than 1%.\n\n“The fall overall of fossil may be small, but it is significant,” said Wiatros-Motyka. “This is a turning point when we see emissions plateauing.”\n\nThe firm analyzes monthly data from 88 countries representing the vast majority of electricity demand around the world. Reasons that demand is increasing include economic growth, electric vehicles and data centers, rising populations in developing countries and the need for more cooling as temperatures rise.\n\nMeeting that demand by burning fossil fuels such as coal and gas for electricity releases planet-warming gases including carbon dioxide and methane. This leads to more severe, costly and deadly extreme weather.\n\nAnalyzing major markets\n\nEmber also dedicated part of its report to an analysis of China, India, the European Union and the U.S. Combined, they account for nearly two-thirds of electricity generation and carbon dioxide emissions from the power sector globally.\n\nIn the first six months of the year, China added more solar and wind than the rest of the world combined, and its fossil fuel generation fell by 2%, the report said.\n\nIndia saw record solar and wind growth that outpaced the growth in demand. India’s fossil fuel generation also dropped.\n\nIn both nations, emissions fell.\n\n“It’s often been said by analysts that renewable energy doesn’t really lead to a reduction in fossil fuel use,” said Michael Gerrard, founder and director of the Columbia University Sabin Center for Climate Change Law, who was not involved in the report. “This report highlights an encouraging step in the opposite direction.”\n\nBut in the U.S., demand growth outpaced the growth of clean power generation. In the E.U., sluggish wind and hydropower generation contributed to higher coal and gas generation, the report said. In both markets, fossil fuel generation and emissions increased.\n\nChallenges in the US\n\nThe U.S. clean energy market faces challenges as President Donald Trump’s administration shifts federal policy away from renewables and toward boosting coal, oil and gas production. The administration has terminated Biden-era funding that supported clean energy projects, repealed policy underpinning climate-related regulation and halted wind energy developments.\n\nMeanwhile, the administration has lifted barriers to coal mining, granted two years of regulatory relief to coal-fired power plants and other polluting industries and dedicated millions of dollars to these coal plants.\n\nIn his speech at the United Nations General Assembly last month, Trump attacked renewable energy and questioned the validity of the concept of climate change.\n\nExperts warn that Trump’s efforts to block clean energy will have a long-term impact.\n\n“The federal government is greatly increasing the growth of artificial intelligence, which is going to massively increase electricity demand, and they’re also shutting down the cheapest new sources of electricity, wind and solar. That’s going to lead to a gap in supply and demand,” Gerrard said.\n\nRenewables “still have an opportunity to make inroads in to displacing fossil fuels, even with some demand growth,” said Amanda Smith, senior scientist at research organization Project Drawdown, who also wasn’t involved in the report. But, Smith said: “I am very cautiously optimistic that renewables can continue to grow and continue to displace fossil fuels in the U.S. I am more optimistic on the world scale.”\n\nAlexa St. John is an Associated Press climate reporter. Follow her on X: @alexa_stjohn. Reach her at ast.john@ap.org.\n\nRead more of AP’s climate coverage.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Solar and wind generation combined grew by more than 400 terawatt hours.","url":"https://www.bostonherald.com/2025/10/06/climate-renewable-energy-report/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Climate_Renewable_Energy_Report_53098-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-06 23:37:02","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.206},{"id":366822174,"title":"Israel-Hamas Ceasefire Talks To Continue On Tuesday","text":"The discussions between Hamas and mediators will continue on Tuesday “amid a positive atmosphere,” according to Egypt media reports.\nThe indirect talks between Israel and Palestine negotiators began in Sharm El-Sheikh on Monday to discuss the terms of a US-proposed plan for a ceasefire in Gaza.\nAccording to Al-Qahera News, which is close to Egypt’s intelligence services, the discussions are focused on preparing the ground for a potential exchange of hostages held by Hamas in Gaza and Palestinian prisoners in Israeli jails. The talks are being held behind closed doors, with Egyptian and Qatari mediators shuttling between the two sides.\nThe discussions are based on a proposal from US President Donald Trump to halt hostilities and initiate a broader peace process.\nTrump’s plan includes the disarmament of Hamas and a phased withdrawal of Israeli forces from Gaza, in return for the release of hostages and political transition in the territory.\nHamas’s delegation is being led by senior negotiator Khalil al-Hayya, who recently survived an Israeli strike in Doha. He met with Egyptian intelligence officials before the negotiations began, according to an Egyptian security source.\nThis round of talks comes on the eve of the second anniversary of Hamas’s October 7, 2023 attack, which triggered the war.\nMeanwhile, British Prime Minister Keir Starmer called for the release of the hostages by Hamas on the second anniversary of the October 7 attacks.\n“Time does not diminish the evil we saw that day,” Starmer said of the October 7 massacre. “The brutal, cold blooded torture and murder of Jews in their own homes. And the taking of hostages, including British citizens, some of whom remain in Gaza today.”\n“Release the hostages. Surge aid into Gaza. And a ceasefire that can lead to a lasting and just peace as a step towards a two-state solution,” he added.\nThis comes after the UK government formally recognised a Palestinian government.\n“We welcome the US initiative towards peace in the Middle East, and this government will do everything in our power to bring about the day where every child of Israel can live peacefully, alongside their Palestinian neighbors, in safety and security,” Starmer added.","summary":"British Prime Minister Keir Starmer called for the release of the hostages by Hamas on the second anniversary of the October 7 attacks.","url":"https://www.news18.com/world/israel-hamas-ceasefire-talks-to-continue-on-tuesday-ws-lo-9618504.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/gaza-2025-09-e07a76a381322c0dad54d9a7b32f50f7.jpg","video":null,"publish_date":"2025-10-06 23:36:39","author":"News18,Ranu Joardar","authors":["News18","Ranu Joardar"],"language":"en","category":"politics","source_country":"in","sentiment":0.111},{"id":366821446,"title":"Jeffries and Schumer deny Trump’s claim about bipartisan shutdown talks: ‘Isn’t true’","text":"House Minority Leader Hakeem Jeffries (D-NY) and Senate Minority Leader Chuck Schumer (D-NY) on Monday refuted Trump’s statement, with both Schumer saying it “isn’t true.”\n\n“Trump’s claim isn’t true — but if he’s finally ready to work with Democrats, we’ll be at the table,” Schumer said in a statement Monday. “For months, Democrats have been calling on Donald Trump and congressional Republicans to come to the table and work with us to deliver lower costs and better healthcare for the American people.”\n\n“If President Trump and Republicans are finally ready to sit down and get something done on healthcare for American families, Democrats will be there — ready to make it happen,” he continued. \n\nJeffries leaned into this sentiment at a Tuesday afternoon press conference where he said he did not “know of any Democrats who have spoken to President Trump or members of his administration on this issue of reopening the government, enacting a bipartisan spending agreement, and addressing the Republican health care crisis.”\n\n“House and Senate Democrats have consistently made clear that we will sit down with anyone, at any time, and at any place, whether here at the Capitol or over at the White House to reopen the government, to enact a bipartisan spending agreement that actually meets the needs of the American people,” Jeffries said.\n\nThe conflicting statements of ongoing negotiations between the White House and Democratic leadership come after House Speaker Mike Johnson (R-LA) decided to keep the House in recess for the third week in a row last Friday. \n\nAs Johnson kept Republicans at home, Jeffries told reporters he would bring House Democrats back to the Capitol to show they were ready to strike a deal to reopen the government. Democrats spent last week in Washington holding many press conferences and crowding the House floor to blame Republicans in power for the shutdown. \n\nThe federal government shut down last Wednesday after the Senate failed to pass a House GOP continuing resolution to fund the government through Nov. 21.\n\nThe GOP short-term funding bill passed the House, but failed five times in the Senate to reach the 60-vote threshold. Democrats have also put forth their own plan to keep the government open through Oct. 31 that includes various pet projects that Republicans oppose, including permanently extending expiring Obamacare tax credits, rolling back Medicaid cuts in the One Big Beautiful Bill, and restoring federal aid to NPR and PBS public radio and TV stations. The Senate has rejected that proposal five times as well.\n\nSchumer wants to keep enough of his Democratic caucus in line to force Republicans to strike a deal that meets some of his healthcare demands. So far, only three Democrats have voted to break the filibuster to advance the GOP plan to fund the government. \n\nSenate Majority Leader John Thune (R-SD) needs eight Democrats to flip to reach the 60-vote threshold, with Sen. Rand Paul (R-KY) voting against advancing the legislation.","summary":"President Donald Trump&#8216;s claim Monday afternoon that his administration is &#8220;speaking with Democrats&#8221; as part of negotiations to end the government shutdown quickly drew the ire of congressional Democratic leadership. “We are speaking with the Democrats, and some very good things could happen with respect to healthcare,” Trump said Monday while speaking to reporters. “I’d [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3839809/jeffries-schumer-deny-trump-claim-bipartisan-shutdown-talks/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/jeffries-house-democrats-virtual-meeting-shutdown-continues.jpg?w=696","video":null,"publish_date":"2025-10-06 23:36:21","author":"Lauren Green","authors":["Lauren Green"],"language":"en","category":"politics","source_country":"US","sentiment":-0.453},{"id":366828046,"title":"Karoline Leavitt Shuts Down Kaitlan Collins Over National Guard Portland Deployment: ‘Go on the Ground and Take a Look’ | Video","text":"Karoline Leavitt and Kaitlan Collins went back and forth about Donald Trump’s continued attempts to deploy the National Guard in Portland.\n\nDuring Monday’s White House press briefing, the CNN reporter asked the press secretary about a federal judge’s argument over the weekend that the president could not deploy other states’ National Guard to Portland. Collins followed that up by asking if the local officials in Portland were even asking for the government’s aid.\n\n“With all due respect to that judge, I think her opinion is untethered in reality and in the law,” Leavitt said. “We are appealing that decision, as you know we expect a hearing on it pretty quickly, and we’re very confident in the president’s legal authority to do this, and we are very confident we will win on the merits of the law.”\n\nAgain, Collins asked whether local officials were seeking help from Trump in the National Guard during the anti-ICE protests taking place. She added that in conversations with the Portland chief of police “he said that the president’s claims just don’t match up with what’s happening on the ground.”\n\n“I would encourage you as a reporter to go on the ground and to take a look for yourself,” Leavitt responded. “Because there’s been many members of the press, not press in this room, but independent journalists, some of whom we’ll be inviting to the White House very soon to share their stories, because they have been in the middle of these riots, and they have witnessed the anarchy that is taking place night after night. It’s on video. You should play it on your show. You have a great opportunity in primetime on CNN to show your audience.”\n\nShe added: “Yeah, but you’re probably talking to partisan Democrat officials who are opposed to everything this president does. You should also ask the people who live in Portland. We’ve actually heard from many members of the community who have said that this is complete civil disobedience. It’s a mess. It’s been loud. It’s being troubling for neighbors in the community who are just trying to live peacefully. And these people are not there to peacefully protest. They are there to cause mayhem and havoc.”\n\nCollins shared the full exchange on her social media, which you can watch above. When another account posted Leavitt’s remarks directing Collins and CNN to go on the ground in Portland and see how bad it really was, Collins commented with video of her interview with the Portland chief of police saying Trump’s claims compared to the city’s realities are not lined up.\n\n“I was quoting the Portland police chief,” she wrote.\n\nCollins and Leavitt were not the only CNN jouranlist and White House staffer to get into a verbal altercation on Monday. Stephen Miller and Boris Sanchez also traded words about the National Guard being deployed into Portland to help combat what Miller called “street terrorists.”","summary":"\"You’re probably talking to partisan Democrat officials who are opposed to everything this president does,\" the press secretary adds\n\n\nThe post Karoline Leavitt Shuts Down Kaitlan Collins Over National Guard Portland Deployment: ‘Go on the Ground and Take a Look’ | Video appeared first on TheWrap.","url":"https://www.thewrap.com/karoline-leavitt-kaitlan-collins-cnn-portland-national-guard-clip/","image":"https://www.thewrap.com/wp-content/uploads/2025/10/KaitlanCollinsKarolineLeavitt.jpg","video":null,"publish_date":"2025-10-06 23:35:38","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","source_country":"US","sentiment":-0.274},{"id":366826438,"title":"Rosie O'Donnell applies for Irish citizenship, White House says it's 'great news for America'","text":"Rosie O'Donnell is applying for Irish citizenship amid her ongoing feud with President Donald Trump. In an interview with the U.K.'s Daily Telegraph, the 63-year-old comedian explained she is putting herself in \"self-imposed (political exile)\" in Ireland after she first moved there in January of this year. \"I am applying and about to be approved for my Irish citizenship as my grandparents were from there and that’s all you need,\" she told the outlet. \"It will be good to have my Irish citizenship, especially since Trump keeps threatening to take away mine.\" \"What great news for America!\" White House spokesperson Abigail Jackson told Fox News Digital about the news. ELLEN DEGENERES BACKS ROSIE O'DONNELL AFTER TRUMP THREATENED TO REVOKE HER U.S. CITIZENSHIP The \"A League of Their Own\" star first announced that she had moved to Ireland in March, saying she made the move just five days before President Trump's 2025 inauguration, telling her TikTok followers, \"It's been pretty wonderful.\" A few months after O'Donnell announced her big move, President Trump took to his social media platform Truth Social in July, with threats of stripping the comedian of her United States citizenship. \"It will be good to have my Irish citizenship, especially since Trump keeps threatening to take away mine.\" \"Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,\" he wrote. \"She is a Threat to Humanity, and should remain in the wonderful Country of Ireland, if they want her. GOD BLESS AMERICA!\" O'Donnell responded to the threat on her social media accounts, saying President Trump \"has always hated the fact that i see him for who he is,\" calling him \"a criminal con man sexual abusing liar out to harm our nation to serve himself.\" LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS The president later renewed his threats to revoke her citizenship in September, writing on his Truth Social account that he is giving the subject \"serious thought\" because \"She is not a Great American and is, in my opinion, incapable of being so!\" Once again, O'Donnell was quick to fire back at the president on her Substack account. \"He can't do that because it's against the Constitution, and even the Supreme Court has not given him the right to do that ... he's not allowed to do that, the only way you're allowed to take away someone's citizenship is if they renounce it themselves, and I will never renounce my American citizenship,\" the \"Now and Then\" star said. \"I am a very proud citizen of the United States.\" \"I am also getting my citizenship here so I can have dual citizenship in Ireland and the United States because I enjoy living here,\" she added. \"It's very peaceful. I love the politics of the country. I love the people and their generous hearts and spirit. And it's been very good for my daughter. But I still want to maintain my citizenship in the United States. My children are there. I will be there visiting and go to see them. And I have the freedom to do that, as does every American citizen.\" CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER Under the United States Constitution, a president does not have the power to strip the citizenship of someone born in the country, meaning since O'Donnell was born in New York, her citizenship is protected by the 14th Amendment. The feud between the president and the comedian goes back almost two decades. It began in 2006 when O'Donnell criticized him while she was a co-host on \"The View.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Rosie O&apos;Donnell shared she is applying for Irish citizenship following multiple threats from President Donald Trump to revoke her United States citizenship.","url":"https://www.foxnews.com/entertainment/rosie-odonnell-applies-irish-citizenship-white-house-says-its-great-news-america","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/rosie-odonnell-flowers.jpg","video":null,"publish_date":"2025-10-06 23:34:37","author":"Lori Bashian","authors":["Lori Bashian"],"language":"en","category":"politics","source_country":"US","sentiment":0.075},{"id":366821506,"title":"U.S. government to take 10-per-cent stake in Canadian mining company Trilogy Metals (Business)","text":"Vancouver-based Trilogy Metals Inc. says the U.S. government will take a 10-per-cent stake in the mineral exploration company, which has mining interests in Alaska that Washington wants to see developed.\n\nThe U.S. government is spending US$35.6 million on the stake, and has options to increase it further in the future. The transaction remains subject to regulatory and other approvals.\n\nThe announcement comes as U.S. President Donald Trump signed an executive order that directs a road to be built in Alaska allowing access to the Ambler mining district, an area rich in copper where Trilogy Metals has an interest through a joint venture.\n\nThe long-debated Ambler Road project was approved in the first Trump administration, but was later blocked by the Biden administration after an analysis determined the project would threaten caribou and other wildlife and harm Indigenous peoples that rely on hunting and fishing.\n\n\"This proposed partnership with the U.S. Government represents a significant milestone for Trilogy Metals and for the development of a secure, domestic supply of critical minerals for America in Alaska,\" Trilogy Metals CEO Tony Giardini said in a news release.\n\nThe partnership interest underscores the strategic importance of Trilogy's Upper Kobuk Mineral Projects in supporting U.S. energy, technology, and national security priorities, he said.\n\nU.S. Secretary of the Interior Doug Burgum said the investment will help secure critical mineral supplies.\n\n\"They're (Trilogy Metals) one of the companies that has mining claims in this area that is a remote wilderness right now, and again making that investment so we can make sure that we're securing these critical mineral supplies and that ownership in that company will benefit the American people,\" he said.\n\nThe U.S. government said last week it is taking a minority stake in Lithium Americas, another Canadian-headquartered company that is developing one of the world’s largest lithium mines in Nevada.","summary":"Vancouver-based Trilogy Metals Inc. says the U.S. government will take a 10-per-cent stake in the mineral exploration company, which has mining interests in Alaska that Washington wants to see developed. The U.S. government is spending US$35.6 million on the stake, and has options to increase it fur...","url":"https://www.castanet.net/news/Business/576462/U-S-government-to-take-10-per-cent-stake-in-Canadian-mining-company-Trilogy-Metals","image":"https://www.castanet.net/content/2025/10/ecffea075a0afe714922a886857691dffb9802cb576f914f71fecd0f5509b908.jpg","video":null,"publish_date":"2025-10-06 23:33:00","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":0.076},{"id":366821318,"title":"Republican Says Jack Smith Violated &#039;Personal Property&#039; in January 6 Probe","text":"Sen. Chuck Grassley, a Republican from Iowa, accused the FBI and former special counsel Jack Smith of violating lawmakers’ “personal property and constitutional rights” after revealing that agents analyzed the phone records of more than a half dozen Republican members of Congress in 2023 as part of the investigation into efforts by President Donald Trump to overturn the 2020 election.\n\nThe data, released Monday by GOP senators, showed call dates and times but not content, covering several days during the week of Jan. 6, 2021, when pro-Trump rioters stormed the U.S. Capitol in an attempt to stop certification of Joe Biden’s victory.\n\nWhy It Matters\n\nThe disclosure sheds new light on the now-closed probe, which examined Trump’s efforts to remain in power after his election loss. Smith’s Office of Special Counsel indicted Trump in August 2023 on charges of conspiring to overturn the results, but the case was dropped the following year after Trump’s return to office. The Justice Department cited a long-standing opinion that a sitting president cannot face federal prosecution.\n\nSpecial counsel Jack Smith speaks to reporters Friday, June 9, 2023, in Washington. Former President Donald Trump is facing 37 felony charges related to the mishandling of classified documents according to an indictment unsealed on Friday. (AP Photo/Alex Brandon)\n\nWhat To Know\n\nGrassley, who chairs the Senate Judiciary Committee, said the FBI’s action represented an “egregious overreach.” He disclosed the subpoena after obtaining an internal FBI document labeled a “preliminary toll analysis,” dated Sept. 27, 2023. \n\nThe document listed nine Republican lawmakers whose phone data was reviewed: Sens. Lindsey Graham of South Carolina, Bill Hagerty and Marsha Blackburn of Tennessee, Josh Hawley of Missouri, Dan Sullivan of Alaska, Tommy Tuberville of Alabama, Ron Johnson of Wisconsin, Cynthia Lummis of Wyoming, and Rep. Mike Kelly of Pennsylvania.\n\nThe senators said the records were obtained through a grand jury subpoena, though it is unclear why those lawmakers were targeted or what evidence, if any, investigators found. The analysis was conducted by an FBI special agent and authorized by two supervisors, according to the document.\n\nMost of the lawmakers named were among those who supported challenges to the 2020 results. After the Jan. 6 violence disrupted the certification, some voted to uphold Biden’s victory, while others maintained their objections.\n\nIn August, it was revealed that the OSC, an independent federal agency, opened an investigation into Smith.\n\nThe investigation centers on allegations that Smith violated the Hatch Act, a federal law prohibiting certain government officials from engaging in political activities while in office.\n\nWhat People Are Saying\n\nFBI Director Kash Patel posted on X, “We recently uncovered proof that phone records of U.S. lawmakers were seized for political purposes. That abuse of power ends now. Under my leadership, the FBI will deliver truth and accountability, and never again be weaponized against the American people.”\n\nGrassley posted on X, “This document shows the Biden FBI spied on 8 of my Republican Senate colleagues during its Arctic Frost investigation into “election conspiracy” Arctic Frost later became Jack Smith’s elector case against Trump BIDEN FBI WEAPONIZATION = WORSE THAN WATERGATE”\n\n\"It should shock every American.\"Senator Ron Johnson calls out \"major corruption\" as he responds to accusations that Jack Smith tracked private calls, communications of nearly a dozen Republican senators. pic.twitter.com/EhRiDKkmYd— Fox News (@FoxNews) October 6, 2025 \n\nWhat Happens Next\n\nGrassley said Monday he does not plan to launch a separate congressional investigation, citing confidence that Patel and FBI Deputy Director Dan Bongino — both Trump loyalists — will review the matter internally. Still, he called for accountability within the bureau, saying, “If heads don’t roll in this town, nothing changes.”\n\nUpdates: 10/6/25, 7:41 p.m. ET: This article was updated with new information and remarks. \n\nThis article includes reporting by the Associated Press.","summary":"Grassley, who chairs the Senate Judiciary Committee, said the FBI’s action represented an “egregious overreach.”","url":"https://www.newsweek.com/jack-smith-grassley-jan-6-probe-fbi-phone-records-10836551","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/AP23160692022259.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-06 23:30:49","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.425},{"id":366820428,"title":"Trump bailout for trade-hit US farmers expected this week","text":"US Farmers are already set to receive near-record government payments of more than US$40 billion this year. (EPA Images pic)\nWASHINGTON: The Trump administration is expected to announce a plan as soon as Tuesday to bail out US farmers stung by trade disputes and big harvests, with the initial outlay potentially totaling up to US$15 billion, according to sources familiar with the matter.\nThe plan, however, could be difficult to roll out as an ongoing government shutdown prevents the kind of Congressional action needed to approve such a large payout, and existing government reserves fall short, the sources said.\nFarmers generally support President Donald Trump but have pressed his administration for trade deals as China continues to spurn US soybean purchases amid tit-for-tat tariffs, and a record corn harvest threatens to sink farmer profits.\nRepublican lawmakers have warned farmers face \"financial calamity\" if they do not receive aid by the end of the year. Treasury secretary Scott Bessent said last week that the White House would announce aid for farmers on Tuesday.\nThree sources told Reuters they expected the administration to announce the package this week.\nOne of those sources said the bailout would total somewhere between US$10 billion and US$15 billion, and would be a necessary bridge to get farmers through the harvest months and could be followed by additional aid.\nThe funds would go to soybean farmers affected by the China trade spat, as well as other types of commodity farmers, though the exact details were not yet determined, that source said.\nA US Department of Agriculture spokesman said farmers are benefiting from lower taxes, trade deals and updates to farm programs included in Trump's July tax-cut and spending bill.\n\"President Trump has made it clear he will not leave farmers behind, so USDA will continue to assess the farm economy and explore the need for further assistance, however, there is nothing new to share at this time,\" the spokesman said.\nNational Economic Council director Kevin Hassett on Monday said the White House had held several meetings on farmer aid in the past two weeks.\n\"We're taking big measures and those big measures are going to be public really, really soon,\" he said on CNBC.\nShutdown complicates aid plan\nTrump has said repeatedly that the administration will use tariff income to pay for farmer aid. But such direct payments to farmers are statutorily capped at US$350 million, a fraction of the sum being discussed, and can only be adjusted by Congress.\nThat adjustment is difficult to achieve while the federal government is shut down, two of the sources said.\nAnother option is to draw down funds from the Commodity Credit Corporation, a financing mechanism at the USDA that is typically refilled each year in autumn, but has not been refilled because of the shutdown, said Jonathan Coppess, associate professor at the University of Illinois Urbana-Champaign.\nDuring Trump's first term, he used the CCC to pay farmers more than US$23 billion in trade aid, about a US$3 billion overpayment, according to the Government Accountability Office.\nThe remaining funds currently in the CCC are likely insufficient to pay for the package being discussed, Coppess said.\nFarmers are already set to receive near-record government payments of more than US$40 billion this year, fueled by disaster and economic aid passed by Congress last year.","summary":"The ongoing government shutdown is complicating efforts to deliver the promised support to Donald Trump's key voter base.","url":"https://www.freemalaysiatoday.com/category/business/2025/10/07/trump-bailout-for-trade-hit-us-farmers-expected-this-week","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/05/0540d087-9225537_1600x1000_1.webp","video":null,"publish_date":"2025-10-06 23:26:31","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"my","sentiment":-0.438},{"id":366826436,"title":"Democrats stand by Virginia AG hopeful who fantasized about killing GOP lawmaker","text":"Top Democrats are refusing to abandon Virginia attorney general candidate Jay Jones despite a report revealing that he wished death on a Republican colleague. Days after a bombshell National Review report exposed text messages in which Jones fantasized about shooting a Republican colleague in the head and harm coming to his children in 2022, Fox News Digital reached out to top Democrats who endorsed Jones and inquired whether their endorsements stand. Dem. Sen. Cory Booker, who endorsed Jones in June, has not rescinded his endorsement of Jones and his office did not immediately respond to a request for comment from Fox News Digital. The offices of three Democratic House members who have endorsed Jones, Reps. Eugene Vindman, Robert Scott, and Suhas Subramanyam, also did not respond to a request for comment on whether their endorsements still stand. LIBERAL MSNBC PANELIST CALLS FOR VIRGINIA AG CANDIDATE TO DROP OUT OVER VIOLENT TEXT MESSAGES Vindman’s Republican opponent, Tara Durant, criticized him over his silence in a press release Monday, saying, \"At a time when political violence is becoming all too real, Virginians deserve leaders who will lower the temperature and call out dangerous rhetoric — not turn a blind eye when it’s politically convenient.\" On Sunday, after the National Review report, Vindman reaffirmed his support for Jones in a post on X. Virginia’s two Democratic senators, Mark Warner and Tim Kaine, have not officially endorsed Jones but also have not explicitly called for him to exit the race. Warner, according to Virginia Mercury, called the Jones texts \"appalling\" and \"inconsistent with the person I’ve known.\" Kaine told Fox News Digital in a statement that Jones's future is in the hands of voters. \"There is nothing that can justify these indefensible words and they are contrary to all I’ve known about Jay Jones for decades,\" Kaine said. \"With hundreds of thousands of Virginians already having voted, it’s up to Virginians to decide.\" Warner's office did not immediately respond to a request for comment from Fox News Digital. Spanberger, running for governor in one of the most closely watched races in the country, condemned Jones' messages but stopped short of calling on him to withdraw from the race. YOUNGKIN SAYS DEMOCRAT AG CANDIDATE JAY JONES MUST 'STEP AWAY IN DISGRACE’ OVER TEXTS ABOUT FORMER GOP LEADER \"I made clear to Jay that he must fully take responsibility for his words,\" a Spanberger statement said. \"As a candidate — and as the next governor of our commonwealth — I will always condemn violent language in our politics.\" Fox News Digital reached out to Spanberger’s campaign on Monday evening but did not immediately receive a response. The Virginia Beach Democratic Committee issued a statement affirming its support for Jones, calling for all Virginians to \"line up behind\" him. \"We are lined up, ten toes down, ready to organize, mobilize and deliver voters for Jay and our entire Democratic ticket,\" the statement read. \"Recent press may have spotlighted past mistakes. We say, let those without sin cast the first stone. Jay Jones has taken responsibility, apologized and shown he is committed to serving with integrity and accountability that his public record already shows.\" VIRGINIA AG CANDIDATE JAY JONES CONVICTED OF RECKLESS DRIVING, CALLS IT 'MISTAKE' The offices of the two top Democrats in Congress, Sen. Chuck Schumer and Rep. Hakeem Jeffries, did not immediately respond to a request for comment on whether Jones should stay in the race. A variety of liberal advocacy groups have endorsed Jones as well, including Everytown for Gun Safety, who donated $200,000 to Jones earlier this year and endorsed him. The gun control group did not respond Monday when asked if they would rescind the endorsement. Republicans across the country, citing the connection between violent rhetoric from the left and political violence resulting in two assassination attempts against President Donald Trump and the murder of Charlie Kirk, have been vocal in calling for Jones to drop out of the race. \"Democrat Jay Jones should drop out of the race immediately and the people of Virginia must continue to have a great attorney general in Jason Miyares who, by the way, has my complete and total endorsement,\" Trump wrote in a Truth Social post. Meanwhile, Republican Virginia Attorney General Jason Miyares and Lt. Gov. Winsome Earle-Sears sharply criticized Jones over the weekend, saying that his recently published 2022 text messages raise serious questions about his fitness for office. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Jones has apologized for the texts, calling the remarks \"embarrassing and shameful,\" and said he had reached out personally to Gilbert and his family. Fox News Digital reached out to the Jones campaign for comment on plans to stay in the race but did not immediately hear back. Fox News Digital’s Amanda Macias contributed to this report.","summary":"Democrats both in Virginia and nationwide are standing by attorney general candidate Jay Jones despite a report he fantasized about shooting a GOP colleague in the head.","url":"https://www.foxnews.com/politics/democrats-stand-virginia-ag-hopeful-who-fantasized-about-killing-gop-lawmaker","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/jay-jones-virginia.png","video":null,"publish_date":"2025-10-06 23:25:16","author":"Andrew Miller","authors":["Andrew Miller"],"language":"en","category":"politics","source_country":"US","sentiment":-0.278},{"id":366821552,"title":"US government shutdown enters second week, no end in sight","text":"WASHINGTON: The US government shutdown entered its second week on Monday (Oct 6), with no sign of a deal between President Donald Trump's Republicans and Democrats to end the crisis.\n\nDemocrats are refusing to provide the handful of votes the ruling Republicans need to reopen federal departments, unless an agreement is reached on extending expiring \"Obamacare\" healthcare subsidies and reversing some cuts to health programmes passed as part of Trump's signature \"One Big Beautiful Bill\".\n\nWith the government out of money since Wednesday and grinding to a halt, Senate Democrats looked set to vote against a House-passed temporary funding bill for a fifth time.\n\nThe hard line taken by Democrats marks a rare moment of leverage for the opposition party in a period when Trump and his ultra-loyal Republicans control every branch of government and Trump himself is accused of seeking to amass authoritarian-like powers.\n\nWith funding not renewed, non-critical services are being suspended.\n\nSalaries for hundreds of thousands of public sector employees are set to be withheld from Friday, while military personnel could miss their paychecks from Oct 15.\n\nAnd Trump has upped the ante by threatening to have large numbers of government employees fired, rather than just furloughed - placed on temporary unpaid leave status - as is normally done during shutdowns.\n\nThe president said on Sunday that workers were already being fired, but White House spokeswoman Karoline Leavitt walked back the comments a day later, saying he was only \"referring to the hundreds of thousands of federal workers who have been furloughed\".\n\nRepublicans are digging in their heels, with House Speaker Mike Johnson telling his members not even to report to Congress unless the Democrats cave, insisting any healthcare negotiation be held after re-opening the government.\n\n\"If he's serious about lowering costs and protecting the healthcare of the American people, why wait?\" Senate Minority Leader Chuck Schumer said in a challenge to Johnson on Monday.\n\n\"Democrats are ready to do it now,\" he wrote on X.","summary":"","url":"https://www.channelnewsasia.com/world/us-government-shutdown-second-week-no-deal-republicans-democrats-5387321","image":"https://dam.mediacorp.sg/image/upload/s--ikg8UCw3--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2023-11:afp_watermark_14112023,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2025/10/07/000_77wf6p6.jpg?itok=TmzjQQrV","video":null,"publish_date":"2025-10-06 23:25:06","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.536},{"id":366822740,"title":"Sources: Trump official bypassed ethics rules in targeting Fed governor","text":"WASHINGTON >> The Trump appointee accusing the president’s political foes of mortgage fraud skipped over his agency’s inspector general when making criminal referrals, according to seven people familiar with the matter, bypassing rules meant to ensure that federal officials don’t abuse their power for partisan purposes.\n\nBill Pulte, director of the Federal Housing Finance Agency, earlier this year made criminal referrals against targets including Lisa Cook, the Federal Reserve governor whom President Donald Trump has tried to dismiss, for alleged crimes related to their mortgages. Breaking with standard procedures, Pulte circumvented that agency’s internal watchdog, typically the office that would make such referrals, by asking the Justice Department to investigate Cook and two other prominent officials.\n\n“The referrals did not come from the OIG,” one of these people said, using shorthand for the office of the inspector general. “It took people there by surprise.”\n\nCook has denied Pulte’s accusations.\n\nPulte didn’t respond to requests for comment for this story.\n\nSpokespersons for the Justice Department and the FHFA inspector general’s office declined to comment. The White House press office didn’t respond to requests for comment. Pulte’s accusations are at the center of ongoing efforts by the Trump administration to seek criminal charges against perceived foes of the president’s politics and policies.\n\nThe campaign last month led to a criminal indictment against a former director of the Federal Bureau of Investigation. In Cook’s case, the Trump-Pulte effort has been criticized by legal experts as a move to oust a senior policymaker from the Federal Reserve — an independent institution critical to the U.S. economy that the president has increasingly sought to bend to his will.\n\nTrump has argued the investigations are focused on “justice,” not political targets. “It’s about justice, really,” he told reporters, following the indictment of the former FBI director. “It’s not revenge.”\n\nBy appealing directly to the Justice Department and publicly airing accusations that had not fully been investigated, Pulte broke with decades of precedent and ethics regulations, the people familiar with the matter said. Five of these people, and independent legal experts consulted by Reuters, said Pulte’s moves defied so-called “impartiality” regulations, among other rules meant to prevent political witch hunts.\n\n“You can’t single out people for prosecution for political reasons,” said Richard Painter, a former associate counsel to President George W. Bush and that administration’s top ethics attorney. “It’s a clear violation of federal law.”\n\nPulte’s actions, legal experts told Reuters, violate various ethics norms and regulations. In addition to “impartiality” rules designed to ensure government officials remain unbiased in decision-making, the experts said it could flout the agency’s own procedures, protections under the Privacy Act, and the constitutional right to due process under the Fifth Amendment.\n\nBecause ethics rules can be subject to interpretation and to an administration’s willingness to enforce them, however, it’s unclear whether Pulte’s actions will undermine his accusations of mortgage fraud or affect his authority as agency director. Trump himself has praised Pulte, lauding him in one social media post, writing: “DON’T LET THE RADICAL LEFT WEAKLINGS STOP YOU!”\n\nThe president’s push to target political opponents with criminal prosecution has intensified. In late September, a grand jury indicted James Comey, the former FBI director and longtime object of Trump criticism, in an alleged perjury case. The indictment arrived shortly after Trump in a social media post called on the attorney general to prosecute him.\n\nComey has denied any wrongdoing. The investigation of Cook comes as Trump seeks a more pliant Federal Reserve, the U.S. central bank. Although the Fed has long operated free of political meddling, Pulte has joined Trump and other administration officials in criticizing its governors and calling for them to cut interest rates more aggressively.\n\nThe Supreme Court last week declined to allow Trump’s dismissal of Cook, suspending the matter until it can hear full arguments in the White House’s bid to remove her.\n\nAlmost immediately after his March confirmation at the FHFA, Pulte became an outspoken voice of the administration. The FHFA is a low-profile agency created after the 2008 financial crisis to oversee elements of the mortgage-lending sector.\n\nWithin months of his arrival, its new chief was aggressively attacking Cook. In August, citing alleged irregularities in her mortgage paperwork, Pulte publicized his request that the Justice Department investigate the Fed governor, targeting her on social media and accusing her of “blatant mortgage fraud.”\n\nTo ensure the independence of probes such as those initiated by Pulte, legal experts said, the politically appointed head of a federal agency would typically ask an inspector general to investigate alleged wrongdoing. At many federal agencies, the office of inspector general exists to independently investigate fraud, waste and abuse.\n\nAny evidence obtained during a probe would then be referred to criminal investigators by the inspector general, not the agency head. In no circumstances, these experts added, would the officials involved be expected to publicize an investigation, disregarding any presumption of innocence and potentially tainting the possibility of a fair trial.\n\n“One indication that the criminal mortgage referrals were political in nature is that the referrals were released publicly,” said Andrew Tessman, a former federal prosecutor in Washington and West Virginia who investigated mortgage fraud cases. “That would never happen that way before.”\n\nShortly after taking the helm of the FHFA, Pulte set up a new channel to receive anonymous tips about mortgage fraud. The agency would welcome tips from “anyone and everyone,” he wrote in April on X, the social media site. The new tip line puzzled some staff, six of the people familiar with the matter told Reuters, because the agency already had such an outlet, overseen by the inspector general’s office.\n\nReuters couldn’t determine whether Pulte, by establishing a new channel outside the department that historically probed mortgage fraud claims, planned from the start to avoid the inspector general. The earlier tip line, like the office of the inspector general itself, had been established by design to remain free from interference even by agency staff, three people familiar with its workings said.\n\nIn addition to his campaign against Cook, Pulte made similar criminal referrals against New York Attorney General Letitia James and Democratic Congressman Adam Schiff. Trump called on U.S. Attorney General Pam Bondi to prosecute James, Schiff and Comey in a Sept 20 Truth Social post.\n\nJames and Schiff have denied wrongdoing. None of the referrals has led the Justice Department to announce any criminal indictment. The federal prosecutor overseeing the James investigation resigned in September after Trump publicly said he’d lost confidence in him.\n\nSince Pulte made the referrals, according to documents reviewed by Reuters, officials from the FHFA and other federal agencies have collaborated with the Justice Department in the ensuing probes. The officials have included representatives from the FBI, the Internal Revenue Service and the inspectors general’s office of the Department of Housing and Urban Development, the documents show.\n\nSpokespersons for the FBI and IRS didn’t respond to requests for comment. An automated email from the HUD inspector general’s office said the office is closed because of the ongoing government shutdown.\n\nLast month, Reuters reported that the mortgage paperwork associated with one of Cook’s residences showed that she had declared an Atlanta residence to her lender as a “vacation home.” The declaration appears to counter other documentation cited by Pulte, suggesting that Cook, in an alleged bid to secure better lending terms, had declared the home her primary residence.","summary":"WASHINGTON >> The Trump appointee accusing the president&#8217;s political foes of mortgage fraud skipped over his agency&#8217;s inspector general when making criminal referrals, according to seven people familiar with the matter, bypassing rules meant to ensure that federal officials don&#8217;t abuse their power for partisan purposes.","url":"https://www.staradvertiser.com/2025/10/06/breaking-news/sources-trump-official-bypassed-ethics-rules-in-targeting-fed-governor/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/10/web1_20251008_brk_bpu01.jpg","video":null,"publish_date":"2025-10-06 23:20:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.303}]}