{
    "offset": 0,
    "number": 50,
    "available": 6647,
    "news": [
        {
            "id": 260993538,
            "title": "Democratic lawmakers request probe into Trump son-in-law after Saudi report",
            "text": "The Democratic chair of the U.S. Senate Finance Committee and a prominent Democratic congressman asked the U.S. attorney general on Thursday to appoint a special counsel to investigate whether Jared Kushner, former President Donald Trump's son-in-law, was functioning as an unregistered foreign agent for Saudi Arabia, according to a letter from the lawmakers.\n\nThe letter from U.S. Senator Ron Wyden and U.S. Representative Jamie Raskin cited an Oct. 4 Reuters report that revealed that Kushner on multiple occasions had discussed U.S.-Saudi diplomacy concerning Israel with Saudi Arabia’s de facto ruler, Crown Prince Mohammed bin Salman, since leaving government.\n\n\"This revelation is deeply disturbing, as Mr. Kushner appears to be influencing U.S. foreign policy by acting as a political consultant to the Saudi government while also accepting their money,\" Wyden and Raskin wrote in the eight-page letter to Attorney General Merrick Garland. The letter has not been previously reported.\n\n\"Mr. Kushner's proximity to President Trump and the potential for political interference warrants the appointment of a Special Counsel,\" the letter added.\n\nSaudi Arabia has invested $2 billion into a private equity fund, Affinity Partners, that Kushner, who was a top adviser on the Middle East during Trump's administration, founded in 2021 after leaving government, according to congressional investigators.\n\nIn a statement, Kushner said, \"There is no conflict of interest.\" He dismissed the letter as \"silly political stunts.\"\n\nChad Mizelle, Chief Legal Officer at Affinity Partners, called the request for a Special Counsel \"a disgraceful attempt by Wyden and Raskin to turn an already weaponized DOJ into a fully political operation with accusations that have no merit or evidence.\"\n\nThe Department of Justice and the Saudi Arabian embassy did not immediately respond to requests for comment.\n\nSaudi Arabia's investments in Kushner's fund have been criticized by ethics experts, Democrats in Congress and some Republicans, who have expressed concern that Saudi Arabia’s stake can look like a payoff since Kushner worked on Saudi issues before leaving Trump's White House.\n\n\"There is substantial reason to believe,\" the letter wrote, \"that the Saudi government's decision to engage Affinity for investment advice is a fig leaf for funneling money directly to Mr. Kushner and his wife, Ivanka Trump.\"\n\nAffinity and Kushner have previously denied that Saudi Arabia's investments are a payoff or a conflict of interest. Affinity has said Wyden and his Senate staff do not understand the realities of private equity.\n\nThe letter comes less than two weeks before the Nov. 5 U.S. presidential election between Trump, a Republican, and Democrat Kamala Harris. Special counsel investigations have more political independence than prosecutions run by Justice Department attorneys, though special counsels can be fired by the Attorney General.\n\nDuring his time as Trump's special advisor, Kushner engineered the Abraham Accords, a series of agreements in which Islamic nations established diplomatic ties with Israel in exchange for concessions by the United States. Saudi Arabia never signed on but the Biden Administration has tried to encourage the kingdom to normalize relations with Israel, an effort that appeared to stall amid the Gaza conflict.\n\nThe Oct. 4 Reuters report, quoting a source familiar with the discussions, said Kushner's talks with Saudi Arabia’s crown prince included the process of normalizing relations between Israel and Saudi Arabia. The source did not identify when the talks took place and whether they occurred before or after the start of the Gaza conflict.\n\nThe U.S. Foreign Agents Registration Act, or FARA, requires agents of foreign interests who engage in political activity to register with the Department of Justice.\n\nWyden is the chairman of the Senate Finance Committee and has been investigating investments by Saudi Arabia and other countries in Kushner's funds since June. Raskin is the ranking member of the House Committee on Oversight and Accountability.\n\n© Thomson Reuters 2024.",
            "summary": "The Democratic chair of the U.S. Senate Finance Committee and a prominent Democratic congressman asked the U.S. attorney general on Thursday to appoint a special counsel to investigate…",
            "url": "https://japantoday.com/category/world/exclusive-democratic-lawmakers-request-probe-into-trump-son-in-law-after-reuters-saudi-report1",
            "image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/5b/5b/36ccf32b5a872ffe7c15445f06d066363355/tagreuters/_w1700.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:28:54",
            "author": "Aram Roston,Japan Today Editor",
            "authors": [
                "Aram Roston",
                "Japan Today Editor"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "jp",
            "sentiment": -0.546
        },
        {
            "id": 260993530,
            "title": "Putin closes BRICS summit that sought to expand Russia's global clout",
            "text": "Russian President Vladimir Putin on Thursday closed a summit of the BRICS bloc of developing economies, praising its role as a counterbalance to what he called the West's “perverse methods.\"\n\nThe three-day summit in the city of Kazan was attended by leaders or representatives of 36 countries, highlighting the failure of U.S.-led efforts to isolate Russia over its actions in Ukraine.\n\nThe conflict came up repeatedly at the meeting, which saw the first visit to Russia from U.N. Secretary-General Antonio Guterres in more than two years and drew an angry reaction from Kyiv. Guterres called for “a just peace” in Ukraine, in line with the U.N. Charter, international law and General Assembly resolutions. He also urged an immediate end to the fighting in Gaza, Lebanon and Sudan.\n\nAt a news conference Thursday night, Putin was asked about former U.S. President Donald Trump's promise to end the fighting in Ukraine.\n\n“What Mr. Trump said recently, what I heard, (is) he spoke about the desire to do everything to end the conflict in Ukraine,\" Putin said. \"It seems to me that he said it sincerely. We certainly welcome statements of this kind, no matter who makes them.”\n\nPutin also was asked about whether any North Korean troops were in Russia, which he neither confirmed nor denied. The U.S. said Wednesday that 3,000 North Korean troops have been deployed to Russia and are training at several locations.\n\n“Images (of North Korean soldiers in Russia) are a serious thing, if there are images, then they reflect something,\" he said when asked about satellite images of troops.\n\nPutin noted that lawmakers in Moscow earlier in the day ratified a pact with North Korea on mutual military assistance as part of a “strategic partnership” with Pyongyang..\n\n“We have never doubted that the North Korean leadership takes our agreements seriously. What and how we will do within the framework of this article (of the agreement) is our business,” he said. \n\nThe summit covered the deepening of financial cooperation, including the development of alternatives to Western-dominated payment systems, efforts to settle regional conflicts and expansion of the BRICS group of nations.\n\nThe alliance that initially included Brazil, Russia, India, China and South Africa when it was founded in 2009 has expanded to embrace Iran, Egypt, Ethiopia, the United Arab Emirates and Saudi Arabia. Turkey, Azerbaijan and Malaysia have formally applied to become members, and several other countries have expressed interest in joining.\n\nThe Kremlin touted the summit as “the largest foreign policy event ever held” by Russia.\n\nSpeaking at what was dubbed the “BRICS Plus” session, which included countries that are considering joining the bloc, Putin accused the West of trying to stem the growing power of the Global South with “illegal unilateral sanctions, blatant protectionism, manipulation of currency and stock markets, and relentless foreign influence ostensibly promoting democracy, human rights, and the climate change agenda.”\n\n“Such perverse methods and approaches -– to put it bluntly -– lead to the emergence of new conflicts and the aggravation of old disagreements,” Putin said. “One example of this is Ukraine, which is being used to create critical threats to Russia’s security, while ignoring our vital interests, our just concerns, and the infringement of the rights of Russian-speaking people.”\n\nRussia has specifically pushed for the creation of a new payment system that would offer an alternative to the global bank messaging network SWIFT and allow Moscow to dodge Western sanctions and trade with partners.\n\nIn a joint declaration Wednesday, participants voiced concern about “the disruptive effect of unlawful unilateral coercive measures, including illegal sanctions” and reiterated their commitment to enhancing financial cooperation within BRICS. They noted the benefits of “faster, low-cost, more efficient, transparent, safe and inclusive cross-border payment instruments built upon the principle of minimizing trade barriers and non-discriminatory access.”\n\nChina's President Xi Jinping has emphasized the bloc’s role in ensuring global security. Xi noted that China and Brazil have put forward a peace plan for Ukraine and sought to rally broader international support for it. Ukraine has rejected the proposal.\n\n“We should promote the de-escalation of the situation as soon as possible and pave the way for a political settlement,” Xi said.\n\nPutin and Xi had announced a “no-limits” partnership weeks before Russia sent troops into Ukraine in 2022. They already met twice earlier this year, in Beijing in May and at a Shanghai Cooperation Organization summit in Kazakhstan in July.\n\nRussia’s cooperation with India also has flourished as New Delhi sees Moscow as a time-tested partner since the Cold War despite Russia’s close ties with India’s rival, China. While Western allies want New Delhi to be more active in persuading Moscow to end the fighting in Ukraine, Indian Prime Minister Narendra Modi has avoided condemning Russia while emphasizing a peaceful settlement. \n\nAddressing the BRICS Plus session, Guterres urged an immediate end to the fighting in Gaza, Lebanon, Ukraine and Sudan. “We need peace in Ukraine, a just peace in line with the U.N. Charter, international law and General Assembly resolutions,” he said.\n\nRussia's Kremlin-controlled media touted the summit as a massive policy coup that left the West fearing the loss of its global clout. State TV shows and news bulletins underscored that BRICS countries account for about half the world's population comprising the “global majority” and challenging Western “hegemony.”\n\nTV hosts elaborately quoted Western media reports saying that the summit highlighted the failure to isolate Moscow. “The West, the U.S., Washington, Brussels, London ended up isolating themselves,” said Yevgeny Popov, host of a popular political talk show on state channel Rossiya 1.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.",
            "summary": "Russian President Vladimir Putin on Thursday closed a summit of the BRICS bloc of developing economies, praising its role as a counterbalance to what he called the West's…",
            "url": "https://japantoday.com/category/world/putin-presides-over-brics-summit-seeking-to-expand-russia%27s-clout",
            "image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/90/eb/35b2911ddbab4bc2d32b64d7b2a2656e7620/download/_w1700.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:28:36",
            "author": "Japan Today Editor",
            "authors": [
                "Japan Today Editor"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "jp",
            "sentiment": -0.119
        },
        {
            "id": 260993536,
            "title": "Harris deploys Springsteen in celeb-heavy push",
            "text": "Kamala Harris will stage a star-studded rally Thursday night alongside Barack Obama and rock legend Bruce Springsteen, as she attacked her rival Donald Trump for being too \"exhausted\" to serve as U.S. president.\n\nHarris is cranking up the celebrity wattage -- including with Beyonce in Texas on Friday, according to reports -- at a series of concerts in battleground states to boost support in the final days of a nail-biting election.\n\nThursday's rally in Atlanta, Georgia will be Harris's first campaign stop with Obama, the only Black president in American history and who remains widely popular with Democratic voters.\n\nLarge numbers of Americans, including about 2.2 million in Georgia, have already cast ballots in early voting, reflecting intense engagement ahead of Election Day November 5.\n\nSpringsteen will bring his brand of socially conscious, working-class anthems like \"Badlands\" and \"My Hometown\" to get out the vote and bolster Harris's blue-collar credentials.\n\nThe vice president raised the stakes further in a CNN appearance late Wednesday when she said she considers 78-year-old Trump to be a \"fascist\" -- as charged in a bombshell interview by the Republican's former chief of staff John Kelly.\n\nTrump, the oldest major presidential nominee in U.S. history and the first to be running with a criminal record, is also casting the election as an existential battle for the United States.\n\nBut it will have profound personal implications too, given he is the subject of serious criminal probes into his attempt to overturn his 2020 election loss and his post-presidential hoarding of top-secret documents.\n\nIn a radio interview on his way to campaign rallies in Arizona and Nevada -- both swing states -- Trump announced that if elected he'd fire the special prosecutor overseeing his remaining cases in \"seconds.\"\n\nHarris, 60, for her part assailed Trump for \"plotting revenge and retribution\" against his political enemies, and took a swipe at his energy levels.\n\n\"The sad part about that is he's trying to be president of the United States -- probably the toughest job in the world -- and he's exhausted,\" she told reporters.\n\nThe election remains a toss-up, with the two candidates jostling within the margin of error in polls from all the swing states set to tip the overall national result.\n\nU.S. media reported Thursday that Beyonce -- whose hit \"Freedom\" is already the Harris campaign signature song -- will join the Democrat when she visits Houston on Friday to highlight reproductive rights.\n\nHarris declined to confirm the reports, but urged Americans to \"stay tuned.\"\n\nOther big names helping Harris include rapper Eminem, Usher and Megan Thee Stallion.\n\nObama, 63, has been making his own headlining appearances in support of Harris in a slew of swing states, including Pennsylvania, Wisconsin and Michigan.\n\nThe Harris campaign hopes the former president will reverse fears of eroding support among Black voters.\n\nHarris, 60, is of mixed Black and South Asian heritage, and is vying to become the country's first female president.\n\nTrump is expected to attack Harris's economic policies at a rally in Tempe, Arizona.\n\nHis campaign said the current vice president had \"made the American Dream of home ownership unreachable for young Americans and families.\"\n\nTrump will then attend a Las Vegas rally aimed at recruiting volunteers and celebrating the Asian American and Pacific Islander community.\n\nLike Harris, Trump also heads Friday to Texas, where he is to deliver remarks on border security.\n\nOn his flight across the country, Trump told conservative radio host Hugh Hewitt, an ardent supporter, that he would instantly fire the special prosecutor overseeing his unprecedented slew of criminal cases.\n\n\"Oh, it's so easy,\" Trump said. \"I would fire him within two seconds.\"\n\nThe hiring and firing of special counsels -- prosecutors who work at arm's length from the Justice Department in politically sensitive cases -- is the responsibility of the U.S. attorney general, who is in turn appointed by the president.",
            "summary": "Kamala Harris will stage a star-studded rally Thursday night alongside Barack Obama and rock legend Bruce Springsteen, as she attacked her rival Donald Trump for being too &quot;exhausted&quot;…",
            "url": "https://japantoday.com/category/world/harris-showcases-springsteen-in-star-studded-swing-state-stop",
            "image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/e0/42/0d8f7cd515f737b70e80800d18f016c297b7/e0420d8f7cd515f737b70e80800d18f016c297b7/_w1700.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:28:22",
            "author": "Drew Angerer,Japan Today Editor",
            "authors": [
                "Drew Angerer",
                "Japan Today Editor"
            ],
            "language": "en",
            "source_country": "jp",
            "sentiment": 0.029
        },
        {
            "id": 260991788,
            "title": "Ballots burned in Arizona mailbox fire days before election",
            "text": "PHOENIX — A mailbox in central Phoenix with 20 ballots inside was set ablaze early Thursday morning. \n\nThe ballots placed inside the box at 7th Avenue and Indian School Road were damaged as a result of the fire, according to ABC 15 Arizona. It’s unknown if the motive was election-related. \n\nThe mail drop box appeared to be gone when The Post physically checked the scene Thursday morning, with just one of the usual two there remaining.\n\nThe suspect was arrested Thursday afternoon, said Phoenix Mayor Kate Gallego, who thanked authorities for “swift action.” \n\n“An unknown individual arrived early Thursday to the United States Post Office, located at 3905 North 7th Avenue and lit a fire inside the blue drive-up collection mailbox. The Phoenix Fire Department responded, firefighters forced the box open and extinguished the fire,” the department told The Post. \n\n“Approximately 20 electoral ballots were damaged, along with additional miscellaneous mail. The Postal Inspector took possession of the damaged ballots and mail. The Phoenix Fire Investigations Task Force, which includes Phoenix Police detectives and Phoenix Fire investigators, are working with US Postal Inspectors.”\n\nMaricopa County Recorder Stephen Richer told The Post people who dropped their ballot off at the mailbox recently should make sure it’s received.\n\n“We are waiting for details from law enforcement. We encourage all voters who used that mailbox in the last 36 hours to check the status of their ballots at BeBallotReady.Vote. Successful delivery is usually reflected on that website within 72 hours,” he said. “Voters should be aware that tomorrow, October 25, is the last day to request a replacement ballot. If a voter believes they were impacted by this incident they can learn more about how to make that request at Request.Maricopa.Vote.”\n\nArizona is a hotly contested swing state, with former President Donald Trump rallying Thursday in Tempe.\n\nHe’s up 1 point against Vice President Kamala Harris, per the latest Marist College poll.\n\nDemocratic vice-presidential nominee Tim Walz is visiting the Grand Canyon State Saturday, and his Republican counterpart J.D. Vance rallied voters in Tucson and Peoria Tuesday.",
            "summary": "PHOENIX — A mailbox in central Phoenix with 20 ballots inside was set ablaze early Thursday morning. The ballots placed inside the box at 7th Avenue and Indian School Road were damaged as a result of the fire, according to ABC 15 Arizona. It&#8217;s unknown if the motive was election-related. The mail drop box appeared to...",
            "url": "https://nypost.com/2024/10/24/us-news/ballots-burned-in-arizona-mailbox-fire-days-before-election/",
            "image": "https://nypost.com/wp-content/uploads/sites/2/2024/10/2179767962.jpg?quality=75&strip=all&w=1200",
            "video": null,
            "publish_date": "2024-10-24 21:26:26",
            "author": "Cameron Arcand",
            "authors": [
                "Cameron Arcand"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.203
        },
        {
            "id": 260991786,
            "title": "Nearly 1 million migrants staying ‘indefinitely’ in US under Biden-Harris ‘quiet amnesty’: House panel",
            "text": "Almost 1 million illegal migrants have been given “quiet amnesty” under President Biden and Vice President Kalama Harris, according to an eye-opening House panel report.\n\nThe House Judiciary Committee released a 16-page report Thursday revealing that more than 700,000 migrants have had their immigration cases dismissed, terminated, or administratively closed as the US grapples with an overwhelming surge at the southern border under the progressive administration.\n\nIn addition, the Department of Homeland Security failed to even file the necessary documentationto begin immigration court removal proceedings in roughly 200,000 cases, the report found.\n\n“Through administrative maneuvering at both the Justice Department and DHS, the Biden-Harris Administration has already ensured that nearly 1 million illegal aliens can remain in the United States without the possibility of deportation — and that trend shows no sign of stopping,” the Republican-led committee said.\n\n“This sort of quiet amnesty has become a staple of the Biden-Harris Administration’s immigration courts.”\n\nThe data compiled by the House committee — which tracked immigration cases between Jan. 20, 2021, and June 30, 2024 — found that the vast majority of the migrants had their cases dismissed, with a total of 459,356 cases dismissed over the almost four-year period. \n\nMeanwhile, 172,645 were terminated and 71,465 cases were administratively closed.\n\nThat is a whopping 575% increase from the more than 104,000 migrants who had their cases dismissed, terminated or administratively closed under the Trump administration, according to a Post analysis of data.\n\nJust 90,692 immigration cases were terminated under former President Donald Trump’s term, according to data compiled by the Transactional Records Access Clearinghouse at Syracuse University. That figure also includes those cases that were dismissed, as the Justice Department’s Executive Office for Immigration Review didn’t split the two categories prior to the Harris-Biden administration. \n\nAn additional 13,590 were administratively closed under Trump, according to data obtained by the House Judiciary Committee.\n\nOver 85% of the record-breaking number of asylum seekers apprehended crossing the besieged southern border under the Harris-Biden administration were being released into the US pending immigration hearings, Homeland Security Secretary Alejandro Mayorkas admitted in January.\n\nRoughly 700 immigration judges then oversee the sprawling EOIR migrant docket, which hit an all-time high of more than 3 million backlogged cases as of December 2023.\n\nAs a result, Attorney General Merrick Garland — who was appointed by President Biden — restored the policy of “administrative closure” in July 2021 by reversing Trump-era restrictions. He argued that the decision would let judges focus on “higher-priority cases.”\n\nAn April 3, 2022, memo authored by Immigration and Customs Enforcement Principal Legal Advisor Kerry Doyle also pointed to the backlog to argue for the closure of all cases that don’t pose a threat to national security, public safety or border security.\n\nThis meant that DHS lawyers would be able to decline to file a “Notice to Appear” for immigration cases or swiftly kick the so-called “nonpriority cases” off the docket.\n\nFormer EOIR Director David Neal also put his thumb on the scale in a memo urging judges to side with agency lawyers who push for migrant case dismissals.\n\nThe culmination of these policies and guidance has now left hundreds of thousands of migrants in legal limbo as the dismissals do not provide them with documentation.\n\nHowever, the asylum seekers are still able to stay in the US “indefinitely without facing immigration consequences” because it also means they have not been put into deportation proceedings, according to the House panel report.\n\nFormer President Donald Trump’s “Remain in Mexico” policy had forced most migrants to await their immigration court hearings south of the US border, reducing border crossing by as much as 70%, border officials say.\n\nHouse Speaker Mike Johnson told The Post last week that he had begged Biden to reinstate the program — but the commander-in-chief refused.\n\n“‘It’s complicated,’” he said, according to Johnson (R-La.). “‘Mexico doesn’t want that.’”\n\nBut as the crisis at the border spiraled, Biden was forced to reverse course in June and issued an executive order to temporarily close the border when migrant crossings exceeded 2,500 per day over a week-long period.\n\nThe order would still allow for as many as 1.8 million migrants to come into the country via other paths — including the Harris-Biden humanitarian parole process, which congressional Republicans have argued is an abuse of the system.\n\nStill, border encounters have since plummeted 55% and DHS has touted the removal of more than 700,000 migrants in fiscal year 2024 — its highest figure since 2010 under former President Barack Obama.\n\nVoters in the seven critical swing states — Nevada, Arizona, Wisconsin, Michigan, Pennsylvania, North Carolina and Georgia — have consistently listed immigration as one of their top concerns in the 2024 election.\n\nTrump is seen as “best able to handle” illegal immigration by the voters, besting Harris by a 16-point margin (52% to 36%), a Wall Street Journal survey in October found.\n\nIn a CNN town hall Wednesday night, Democratic presidential nominee Harris acknowledged that many more immigration judges were needed to hear cases — but stressed that her and Biden did “the right thing” on the border.\n\nThe Justice Department declined to comment. \n\nRepresentatives for the Department of Homeland Security did not immediately respond to a request for comment.",
            "summary": "\"Through administrative maneuvering at both the Justice Department and DHS, the Biden-Harris Administration has already ensured that nearly 1 million illegal aliens can remain in the United States without the possibility of deportation -- and that trend shows no sign of stopping,\" the House Judiciary Committee said.",
            "url": "https://nypost.com/2024/10/24/us-news/nearly-1-million-migrants-staying-indefinitely-in-us-under-biden-harris-quiet-amnesty-house-panel/",
            "image": "https://nypost.com/wp-content/uploads/sites/2/2024/10/92286599.jpg?quality=75&strip=all&w=1200",
            "video": "https://cdn.jwplayer.com/videos/N5pYHVyK-RyIcpnTz.mp4",
            "publish_date": "2024-10-24 21:25:20",
            "author": "Josh Christenson",
            "authors": [
                "Josh Christenson"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.121
        },
        {
            "id": 260992210,
            "title": "What is fascism? And why does Harris say Trump is a fascist?",
            "text": "WASHINGTON (AP) — Vice President Kamala Harris was asked this week if she thought Donald Trump was a fascist, and she replied “Yes, I do.” She subsequently called him the same thing herself, saying voters don’t want “a president of the United States who admires dictators and is a fascist.”\n\nBut what exactly is a fascist? And does the meaning of the word shift when viewed through a historical or political prism — especially so close to the end of a fraught presidential race?\n\nHere’s a closer look:\n\nWhat is fascism?\n\nAn authoritarian, ultranationalist political ideology and movement. It is often associated with the far right and characterized by a dictatorial leader who uses military forces to help suppress political and civil opposition.\n\nHistory’s two most famous fascists were Nazi chief Adolf Hitler in Germany and Italian dictator Benito Mussolini. Known as Il Duce, or “the duke,” Mussolini headed the National Fascist Party, which was symbolized by an eagle clutching a fasces — a bundle of rods with an axe among them.\n\nAt Mussolini’s urging, in October 1922, thousands of “Blackshirts,” or “squadristi,” made up an armed fascist militia that marched on Rome, vowing to seize power. Hitler’s Nazis similarly relied on a militia, known as the “Brownshirts.” Both men eventually imposed single-party rule and encouraged violence in the streets. They used soldiers, but also fomented civilian unrest that pit loyalists against political opponents and larger swaths of everyday society.\n\nHitler and Mussolini censored the press and issued sophisticated propaganda. They played up racist fears and manipulated not just their active supporters but everyday citizens.\n\nToday, the term fascism has taken on a looser political definition and is often evoked as a catch-all for efforts to spread oppression and racism — as well as to decry dictators or leaders who embrace totalitarian tactics.\n\nIt is not just the left that has used the term, denoucning a push rightward in the U.S. and in many parts of the world. Some conservatives decried lockdowns imposed during the coronavirus pandemic as “fascist.”\n\nWhat are other historical examples of fascism?\n\nHitler and Mussolini are its two biggest names, but it gets murkier from there.\n\nDoes military dictator Augusto Pinochet’s 17-year, ironfisted rule in Chile qualify? What about Indonesian strongman Suharto or Spain’s Francisco Franco? Were the regimes of Ferenc Szálasi in Hungary and Brazil’s Plínio Salgado fascist? Where does American neo-Nazi leader David Duke fit?\n\nIndeed, critics sometimes describe modern U.S. extremist groups — including movements that have cheered Trump, like the Proud Boys — as fascists or neo-fascists. Those labels may be more steeped in political ideology than clear historical parallels.\n\nWhy is Harris calling Trump a fascist?\n\nThe vice president has long criticized Trump as being mentally unstable and not a true believer in, or defender of, the nation’s founding democratic principles.\n\nShe notes that Trump suggested he’d deploy the military to target political opponents, including people he has decried as the “enemy from within.” The former president has long talked about attacking his enemies and declared to his supporters that he would be their “retribution.”\n\n“He’s talking about the American people. He’s talking about journalists, judges, nonpartisan election officials,” Harris said Wednesday night at a CNN town hall.\n\nTrump has threatened to take action against television networks and news organizations for coverage he deems unfavorable. And, when now-President Joe Biden challenged him during a 2020 debate to denounce the Proud Boys, Trump replied: “Proud Boys, stand back and stand by.”\n\nA mob of pro-Trump supporters stormed the U.S. Capitol on Jan. 6, 2021, seeking to overturn Trump’s loss to Biden after Trump gave a speech propagating falsehoods about the election and exhorting the crowd to “fight like hell.” Among the people imprisoned in connection with Jan. 6 was the leader of the Proud Boys, accused of orchestrating a failed plot to keep Trump in power.\n\nHarris has been building toward the characterization. During an interview with her in Detroit on Oct. 15, radio host Charlamagne Tha God, said Trump was increasingly embracing fascism and asked, “Why can’t we just say it?” “Yes, we can say that,” Harris replied.\n\nThen, Trump’s longest-serving former chief of staff, retired Marine Corps Gen. John Kelly, warned that the former president meets the definition of a fascist. He said Trump, while in office, suggested that Hitler “did some good things,” and that Trump valued personal loyalty above the Constitution.\n\nTrump’s campaign has accused Kelly of lying and brushed aside Harris’ criticism, with spokesperson Karoline Leavitt responding, “Kamala will say anything to distract from her open border invasion and record high inflation.” Trump has described Jan. 6 as a “day of love.”\n\nHow do experts on fascism view Trump?\n\nThey are divided. Some do not see Trump as meeting the classic historical definition of a fascist, but rather increasingly moving toward politics that have fascist tendencies.\n\nDavid Kertzer, a Brown University professor and Italian historian, said he was “a little horrified” to hear Harris call Trump a fascist given the term’s “historical resonance.” He said there are some similarities, including “mass movement, a cult of the strongman.” He noted that Trump sometimes juts out his chin, though he isn’t prone to tearing off his shirt and bare his chest, like Mussolini did.\n\nKertzer said that fascism involved “a one-party state, a banishing of all opposition newspapers and jailing people who disagreed,” and that, while Trump has talked about jailing opponents, he’s not moved toward embracing other key facets of the movement.\n\n“There are certain echoes, but in terms of turning the Republican Party into a one-party state, that seems rather farfetched at the moment,” said Kertzer, author of “The Pope and Mussolini: The Secret History of Pius XI and the Rise of Fascism in Europe.”\n\nDavid Clay Large, a senior fellow at the University of California, Berkeley’s Institute of European Studies, said “the alarm bells now going off may be somewhat overblown.”\n\n“Our democratic institutions, however beleaguered, remain much stronger than those of the European nations that turned fascist in the ‘20s and ’30s,” Large said. Still, he added, there would be “a real danger to these institutions” in a second Trump presidential term.\n\nThe rise of far-right parties across Europe and Trump’s control of the GOP, Large said, carves out “an entirely new situation: The center cannot hold as it once did.”\n\nAdd to that mix social media, which in the digital age mirrors the use of propaganda, amping up emotions and division, he said.\n\n“Where everyone’s an expert, we’ve lost respect for factuality, objectivity, and actual expert opinion,” Large said.\n\n—- Kellman reported from London.",
            "summary": "WASHINGTON (AP) — Vice President Kamala Harris was asked this week if she thought Donald Trump was a fascist, and she replied “Yes, I do.” She subsequently called him the same thing herself, saying voters don't want “a president of…",
            "url": "https://www.thestar.com/news/world/united-states/what-is-fascism-and-why-does-harris-say-trump-is-a-fascist/article_62539af4-d5aa-5af9-a256-0bf091e09038.html",
            "image": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/6/63/663a31ec-274d-54c7-a8a1-843393150217/671abb2f309cd.image.jpg?crop=1280%2C672%2C0%2C110&resize=1200%2C630&order=crop%2Cresize",
            "video": null,
            "publish_date": "2024-10-24 21:21:13",
            "author": "Will Weissert And Laurie Kellman The Associated Press,Wire Content",
            "authors": [
                "Will Weissert And Laurie Kellman The Associated Press",
                "Wire Content"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "CA",
            "sentiment": 0.062
        },
        {
            "id": 260992208,
            "title": "What is fascism? And why does Harris say Trump is a fascist?",
            "text": "What is fascism? And why does Harris say Trump is a fascist?\n\nSkip to main content\n\nYou have permission to edit this image.\n\nMan critically injured after daylight shooting in North York\n\nProsecutors to recommend resentencing Erik and Lyle Menendez in 1989 killings of their parents\n\nIsraeli strike on Gaza shelter kills 17 as Blinken says cease-fire talks will resume\n\nThis combination of photos taken Monday, Oct. 21, 2024, shows Democratic presidential nominee Vice President Kamala Harris speaking during a town hall in Malvern, Pa., left, and Republican presidential nominee former President Donald Trump delivering remarks on Hurricane Helene in Swannanoa, N.C.. (AP Photo)\n\nInternational\n\nInternational-politics\n\nDistrict Of Columbia\n\nUnited States\n\nAs featured on\n\nUnited States\n\nWhat is fascism? And why does Harris say Trump is a fascist?\n\nWASHINGTON (AP) — Vice President Kamala Harris was asked this week if she thought Donald Tru…\n\nUnited States\n\nWhat is fascism? And why does Harris say Trump is a fascist?\n\nHurricane Kristy strengthens into a Category 5 storm in the Pacific Ocean\n\n48 mins ago\n\nUnited States\n\nMcDonald’s says onions from California-based produce company linked to deadly E. coli outbreak\n\n49 mins ago\n\nUnited States\n\nForced assimilation and abuse: How US boarding schools devastated Native American tribes\n\nUnited States\n\nTimeline of the Menendez brothers’ murder case\n\nTop Trending\n\nHow an Air Canada agent stopped this convicted Toronto cop from fleeing Canada\n\nProvincial Politics\n\nDoug Ford’s government finds that giving every Ontarian a cheque isn’t as simple as it sounds\n\nCanada will slash 2025 target for permanent residents by 21 per cent\n\nJustin Trudeau rebuffs dramatic challenge after 24 Liberal MPs urge him to step down by Monday\n\nBritish Columbia\n\nB.C. election recounts triggered in two ridings, delaying result for a week\n\nGifts for today. Memories for a lifetime.\n\nFor many financially vulnerable children across the GTA, a gift from The Toronto Star Santa Claus Fund is the only one they will receive this holiday season. Your kindness makes it happen.\n\nDonate Today\n\nTerms of Use\n\n| Privacy Policy\n\n| Advertising Terms\n\n| Accessibility\n\n© Copyright Toronto Star Newspapers Limited 1996 - 2024\n\nThe Toronto Star and thestar.com, each property of Toronto Star Newspapers Limited, 8 Spadina Avenue, 10th Floor, Toronto, ON M5V 0S8\n\nSorry, an error occurred.\n\nAlready Subscribed!\n\nGet StartedManage Service\n\nCancel anytime\n\nYou are logged in\n\n Switch accounts\n\nSecure transaction. Cancel anytime.\nHave an account? Log In\n\nSign up with\n\nHave an account? Log In\n\nYou're all set!\n\nThank you .\n\nYour account has been registered, and you are now logged in.\n\nCheck your email for details.\n\nSign in with\n\nAdmin login\n\nNeed an account? Sign Up\n\nReset Password\n\nSubmitting this form below will send a message to your email with a link to change your password.\n\nForgot Password\n\nAn email message containing instructions on how to reset your password has been sent to the email address listed on your account.\n\nEmail me a log in link\n\nPromotional Offers\n\nNo promotional rates found.\n\nPurchase Gift\nPurchase Access\n\nSee More Offers\n\nSecure & Encrypted\n\nYou're all set!\n\nYour gift purchase was successful!\nYour purchase was successful, and you are now logged in.\n\nToday's total:\n\nTransaction ID:\n\nA receipt was sent to your email.\n\nAn error occurred\n\nThis offer is currently unavailable.",
            "summary": "This combination of photos taken Monday, Oct. 21, 2024, shows Democratic presidential nominee Vice President Kamala Harris speaking during a town hall in Malvern, Pa., left, and Republican presidential nominee former President Donald Trump delivering remarks on Hurricane Helene in…",
            "url": "https://www.thestar.com/news/world/united-states/what-is-fascism-and-why-does-harris-say-trump-is-a-fascist/image_663a31ec-274d-54c7-a8a1-843393150217.html",
            "image": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/6/63/663a31ec-274d-54c7-a8a1-843393150217/671abb2f309cd.image.jpg?crop=1280%2C672%2C0%2C110&resize=1200%2C630&order=crop%2Cresize",
            "video": null,
            "publish_date": "2024-10-24 21:21:13",
            "author": null,
            "language": "en",
            "category": "politics",
            "source_country": "CA",
            "sentiment": 0.074
        },
        {
            "id": 260992328,
            "title": "Trump vows to oust special counsel, as he, Harris race through swing states",
            "text": "United States presidential candidate Donald Trump has said he plans to fire the special prosecutor investigating him if he wins the election, a bullish threat as polls nudge slightly his way 12 days before the vote.\n\nThe Republican candidate and former president made the comment in an interview on Thursday with a conservative radio host, saying he would dismiss special counsel Jack Smith – who has brought two federal cases against him – “within two seconds”.\n\nTrump’s remarks – which his opponent Kamala Harris’s campaign said was proof he sees himself as “above the law” – aired before he was to head to the battleground states of Arizona and Nevada for campaign rallies.\n\n“Jack Smith is a scoundrel … He’ll be one of the first things addressed,” Trump told the radio host Hugh Hewitt.\n\nSmith’s case against Trump is focused on his alleged attempts to overturn the 2020 election results. If re-elected, Trump would not have the authority to unilaterally fire the special counsel, but could direct the Justice Department to do so.\n\nHarris, meanwhile, was scheduled to appear with former President Barack Obama and rock icon Bruce Springsteen at a rally in the swing state of Georgia.\n\nIncreasingly, Harris’s campaign has turned to influential celebrities to headline events and get out the vote.\n\nThursday evening, Grammy winner James Taylor will share the stage with Harris’s running mate Tim Walz in North Carolina, another pivotal election state that is recovering from the throes of a deadly hurricane.\n\nAnd on Friday night, music sensation Beyonce – whose song, Freedom, has become the Harris campaign’s signature track – will appear with the vice president at a rally in Houston.\n\n’50-50 forecast’\n\nThe campaign blitz across battleground states has intensified as Trump and Harris remained in a dead heat in the polls, with Trump showing slight gains in recent weeks.\n\nAccording to the 538 polling aggregator, Trump holds a minor lead in four of the seven US swing states that are likely to determine the election – North Carolina, Georgia, Pennsylvania and Arizona. Harris has a small advantage in two of the states – Michigan and Wisconsin – while the candidates are squarely tied in Nevada.\n\nIn all seven states, the difference is under two percentage points, well within the polls’ margin of error, meaning the states are a toss-up.\n\nPollster and 538 founder, Nate Silver, said the data indicated Harris and Trump’s odds of victory are close to 50-50, even if his instinct is that Trump will edge it out.\n\n“My gut says Donald Trump,” Silver said in a guest essay for The New York Times. “But I don’t think you should put any value whatsoever on anyone’s gut – including mine.”\n\n“Instead,” Silver said, “you should resign yourself to the fact that a 50-50 forecast really does mean 50-50. And you should be open to the possibility that those forecasts are wrong.”\n\nIn a contrasting essay, James Carville, a longtime Democratic consultant who famously managed former President Bill Clinton’s winning campaign in 1992, reached another conclusion, saying he is “certain” Harris will come out ahead.\n\nWriting for The New York Times, Carville pointed to a string of recent election defeats for Republicans and Harris’s massive fundraising advantage as evidence of an upcoming Harris victory.\n\nPart of his reasoning was “100 percent emotional”, he confessed.\n\n“I refuse to believe that the same country that has time and again overcome its mistakes to bend its future towards justice will make the same mistake twice,” he wrote.\n\nEarly votes pouring in\n\nWith early voting in full swing in most US states, almost 30 million Americans have already cast their votes early, according to the University of Florida’s Election Lab tracker.\n\nPreliminary data shows registered Democrats leading Republicans in the early count, though it does not indicate how they voted, and Republicans expect to close the gap on Election Day.\n\nTrump, who previously discouraged early voting, has come around to it this year, saying, “The main thing to me is, you’ve got to vote.”",
            "summary": "Trump will rally Thursday evening in Arizona and Nevada; Harris to appear with Obama, Springsteen in Georgia.",
            "url": "https://www.aljazeera.com/news/2024/10/24/trump-vows-to-oust-special-counsel-as-he-harris-race-through-swing-states?traffic_source=rss",
            "image": "https://www.aljazeera.com/wp-content/uploads/2024/10/2024-10-24T064216Z_709110090_RC2T6AAK6TIE_RTRMADP_3_USA-ELECTION-TRUMP-1729799828.jpg?resize=1920%2C1440",
            "video": null,
            "publish_date": "2024-10-24 21:18:54",
            "author": "Al Jazeera,Apps Support",
            "authors": [
                "Al Jazeera",
                "Apps Support"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "QA",
            "sentiment": -0.078
        },
        {
            "id": 260990786,
            "title": "New National Poll Shows Donald Trump Hold Slim Lead",
            "text": "Former President Donald Trump is holding a slim national lead over Vice President Kamala Harris less than two weeks before Election Day, according to a new poll.A poll released on Thursday by CNBC showed Trump, the Republican nominee, ahead of Harris, the Democratic nominee, by just 2 percentage points among registered U.S. voters, with the former president preferred by 48 percent of respondents while the vice president was preferred by 46 percent. Another 5 percent of voters said that they were still undecided, while 1 percent intended to vote for a different candidate.Trump's lead shrunk to 1 point in a crucial subset of those surveyed for the CNBC poll—voters in the battleground states of Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. Trump was backed by 48 percent of battleground voters, while 47 percent preferred Harris.The poll was conducted for CNBC by Public Opinion Strategies, which served as the Republican pollster, and Hart Research, which served as the Democratic pollster, for the survey. The survey was conducted from October 15 to 19 and had a total sample of 1,000 voters nationwide. The nationwide sample included 186 voters from Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. An additional 400 voters were interviewed in those states for a total sample of 586. It has a margin of error of 3.1 percent for all registered voters and 4 percent for battleground voters.Newsweek has reached out for comment to the Trump and Harris campaigns via email on Thursday.Trump was also leading nationally by 2 points (51 to 49 percent) in a HarrisX/Forbes poll released on Wednesday, although 12 percent of voters surveyed said they were still \"weighing their choices.\" The survey polled 1,244 likely voters between October 21 and 22 and had a margin of error of 2.5 percent.However, a national poll released by TIPP on Thursday showed Harris ahead of Trump by 3 points (50 to 47 percent). The poll was conducted among 1,260 likely voters between October 21 and October 23 and has a margin of error of 2.8 percent.While several additional recent surveys have been favorable towards the vice president, the overall polling pictured suggests that the race is in a dead heat.Harris continues to maintain a small but somewhat diminished national lead over Trump in an average of recent polls compiled by FiveThirtyEight. The Democratic candidate had a 1.7 percent advantage as of Thursday afternoon. She was ahead by up to 2.8 percent earlier this month.Averages of battleground state polls are even closer, although Trump currently has leads of a little more than 1 percent in Georgia, Arizona and North Carolina, according to FiveThirtyEight.Micah Roberts of Public Opinion Strategies told CNBC that Trump was ahead in his polling \"because he's winning men by more than he's losing women.\"\"It's a difference because of younger men, and the advantage among younger men is strong, and it's just not as strong for Harris among younger women, and older women especially,\" he said.While other recent polls have also shown that Trump has a clear lead with men and Harris has a clear lead with women, some surveys suggest that Harris' edge among women could outweigh Trump's advantage among men.A poll released on Wednesday by The Economist/YouGov showed that the former president recently tripled his advantage among male voters, going from a 3-point lead last week to a 9 point lead this week. Meanwhile, the poll showed Harris with a larger lead of 13 points among women.In every U.S. presidential election since 1980, more women have cast ballots than men, according to the Center for American Women and Politics (CAWP).",
            "summary": "Most recent polls suggest that the presidential election is in a dead heat less than two weeks before Election Day.",
            "url": "https://www.newsweek.com/new-national-poll-shows-donald-trump-hold-slim-lead-1974592",
            "image": "https://d.newsweek.com/en/full/2503904/donald-trump-national-poll-leading-kamala-harris.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:17:11",
            "author": "Aila Slisco",
            "authors": [
                "Aila Slisco"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.175
        },
        {
            "id": 260990974,
            "title": "Donald Trump called out by boxing champ Usyk to use 'influence over Putin' to free Ukraine",
            "text": "Donald Trump has been called out by world heavyweight boxing champion Oleksandr Usyk to use his \"influence over Putin\" to help his home country of Ukraine.\n\nThe former US president is due to appear on Joe Rogan's podcast, the Joe Rogan Experience, on Friday (October 25), which prompted Usyk to take a break from promoting his rematch with Tyson Fury and request a question to be asked to Trump. However, the episode will be filmed tomorrow but it is unknown when it will be released online and whether the world class boxer's question will be asked .\n\nUsyk, who spent time himself on the frontlines during Russia's invasion, asked if Trump could help free Ukraine from Russian captivity \"right away\" by using his \"influence\" over President Putin. \n\nThe world heavyweight boxing champ also asked for the Azovstal Defenders, who were captured while fighting Russia in Mariupol., to be freed.\n\nUsyk wrote on X: \"Dear @joerogan, could you ask @realDonaldTrump when he'll appear on your podcast: if Mr. President is so confident in his influence over Putin, could he help #FreeAzovstalDefenders and all Ukrainians from Russian captivity right away? Time is of the essence. Sincerely, Oleksandr\"\n\nBack in May 2023, Trump said he could settle the war between Russia and Ukraine in one day if his run for presidency is successful. \n\nAt the CNN town hall, Trump said: “They’re dying, Russians and Ukrainians. I want them to stop dying. And I’ll have that done — I’ll have that done in 24 hours.” \n\nThen last month after a meeting with Ukraine president Volodymyr Zelenskyy, Trump dounled down saying the war would end \"very quickly\" with him in charge\n\nTrump said: “We have a very good relationship, and I also have a very good relationship, as you know, with President Putin,” \n\n\"And I think if we win, I think we’re going to get it resolved very quickly … I really think we’re going to get it … but, you know, it takes two to tango.”\n\nSo far, Usyk has not had a response from either Rogan or Trump to his question.\n\nUysk, a father-of-three, spoke last year about his time on the frontlines. As reported by The Sun, He explained: “Through binoculars, from 900 metres, I saw my enemies running, exploding tanks and broken houses. I saw people with no legs and arms.\n\n“I saw people walking but looking like they were dead. When I was going in the car around the city, I realised it was a dead city. I saw children’s toys and playgrounds but everything looked dead, there was no energy in the city.\n\n“I realised that one day that place, on that ground, kids were playing. But now it is dead.”\n\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters.",
            "summary": "World heavyweight champion Oleksandr Usyk has asked a question to former US President Donald Trump ahead of his appearance on the Joe Rogan Experience tomorrow",
            "url": "https://www.dailystar.co.uk/news/us-news/donald-trump-called-out-boxing-33966480",
            "image": "https://i2-prod.dailystar.co.uk/incoming/article33966647.ece/ALTERNATES/s1200/0_AHP_CHP_29559JPG.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:14:12",
            "author": "Simon Hamalienko",
            "authors": [
                "Simon Hamalienko"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "gb",
            "sentiment": 0.093
        },
        {
            "id": 260991762,
            "title": "Teamsters plead with fellow members to back Harris in battleground state Wisconsin",
            "text": "OSHKOSH, Wisconsin — On a crisp fall morning last week, a UPS worker donning a brown uniform rushed toward the warehouse here to start his shift when a group of fellow Teamsters handed him campaign literature supporting Kamala Harris for president. The worker grew visibly agitated, gestured with his arms and raised his voice. But he wasn’t angry at those offering him a sample ballot. He was going on about former Republican Gov. Scott Walker’s 2011 war on unions that gutted labor power in the state. He also talked about how former president Donald Trump had promised to bring a deluge of work to the state, like through Foxconn, that never materialized. “Don’t they remember the history of Republicans attacking unions? Their memories are so short,” the man said, incredulous that any union member in Wisconsin is now backing Trump. “This is great,” he said, holding up a sample ballot and separate fliers for Harris and Gov. Tim Walz, as well as to reelect Democratic Sen. Tammy Baldwin. It was just one of dozens of conversations that took place here over 90 minutes in between shifts at this UPS facility. Teamsters members who backed Harris carried out what’s considered by the campaign to be among the most persuasive of arguments: those made peer-to-peer. It was a slice of a broader strategy playing out again and again throughout Wisconsin as well as the battlegrounds of Michigan and Pennsylvania that aimed ultimately to reach white working class voters who surveys show prefer Trump in massive numbers. A recent NBC News national poll showed Trump held a 56%-42% lead with white voters and a 65%-33% lead among whites without college degrees. Those numbers reflect the battle that’s up ahead for Harris’ team as it grinds out the final days of the campaign. But with essential blue wall battleground states still seemingly in a dead heat, according to polls, part of the strategy behind the Harris campaign has been to work at gaining at the margins among various groups that have favored Trump in the past. This kind of union organizing is just one example of the various efforts — from reaching out to soft Republicans to canvassing rural counties — a well-funded Harris campaign has employed to target specific demographics with just 12 days to the Nov. 5 election. “I will contrast this with the type of top-down astroturf organizing that Elon Musk is attempting somewhat unsuccessfully,” Josh Orton, Harris’ senior adviser for labor said of the Teamsters efforts. “For these types of peer-to-peer conversations to be successful, to be trusted, to be persuasive, there has to be an existing relationship. There has to be trust, and it has to be based on facts.” Sean O’Brien, the general president of the International Brotherhood of Teamsters, announced last month that the national union would not endorse in the race, in what was considered a blow to Harris after the group backed President Joe Biden in 2020. (However, there were signs in July, according to Reuters reporting, that after Biden’s concerning debate performance the group was considering not endorsing). After the news broke that the national organization wouldn’t endorse Harris, however, local Teamsters groups, including many of the largest, swiftly backed Harris. In all, the campaign says 1.5 million Teamsters nationally have backed Harris. Trump spokeswoman Karoline Leavitt, however, credited Trump for the lack of endorsement from the national union, saying he “neutralized the endorsement for the first time in decades.” “Team Trump has a data-driven, people-powered ground operation in every single battleground state,” Leavitt said. “We have trained tens of thousands of volunteer captains, who are specifically focused on getting out the vote and encouraging Americans in their respective communities to vote for President Trump and President Trump has more enthusiasm on the ground than Kamala Harris, as reflected by the Real Clear Politics average that has him winning in every battleground state.” Analysts, however, have warned of putting too much stock into that polling average, noting that it includes a bevy of surveys from red-leaning firms that can warp averages. Regardless, even those numbers hover within the margin of error. Still, Leavitt pointed to an internal Teamsters survey that showed overwhelming support for Trump. There were other highlights of labor support for Harris. Later in the same day as the Teamsters canvassing, Jim Ridderbush, vice president of the United Food and Commercial Workers Local 1473 spoke at a rally in Green Bay. “She walked the picket line with striking auto workers in 2019,” Ridderbush said to cheers. He contrasted that with Trump, arguing the former president didn’t think about working people but instead gave massive tax breaks to companies that shifted new jobs overseas. “He went even further to attack the ability of unions to organize, Ridderbush said. “The bottom line is, Trump’s a scab.” Chants broke out in the crowd: “Trump’s a scab! Trump’s a scab!” The United Auto Workers union, which has a vast representation in the swing state of Michigan, has also put its weight behind Harris. It recently released its own internal polling data conducted by Democratic pollster Celinda Lake, where it says among UAW members without a college degree, Harris now holds a five-point lead. “When members hear directly from other members about what’s at stake and which candidate will have their backs, we’re able to break through,” UAW President Shawn Fain said in a statement. “By engaging our members and highlighting the issues that matter — their paychecks, their families, and their futures -- the union makes a real difference.” Back in Oshkosh, several laborers in Wisconsin cited massive infrastructure buildup under the Biden administration that they say will boost union jobs for at least a decade. That investment included providing more than $1 billion in funding to replace the John A. Blatnik Bridge between Duluth, Minnesota, and Superior, Wisconsin. Daniel Jones a 37-year Teamster, pointed to that project and to both Biden and Harris walking picket lines as signs that they would back labor. “That’s going to give building trades unions, as well as the iron workers gainful employment for many years, it’s my tax money going to union workers,” Jones said. “Donald Trump had four years to create an infrastructure bill. He would promise it, he’d never get it done.” Bill Carroll, secretary-treasurer of Teamsters Local 344, pointed to the conservative policy document Project 2025 and Trump’s ties to it as among the warning signs if Trump returns to the White House. “The labor section of Project 2025 is just a continuation of Scott Walker policies: attack public sector bargaining, national right to work, eliminating prevailing wage laws — right down the line, things that will damage the ability of average working Americans, especially in organized labor,” he said. Trump has disavowed Project 2025, even though many of his allies were involved in drafting it. Some workers gave a thumbs up as they quickly walked by grabbing the fliers. One called out with a smile “already did it!,” while others shared a similar sentiment. Some complained about Trump, noting that he and billionaire Tesla creator Elon Musk held a public conversation in which they laughed about firing striking workers. There were sporadic critics too. One man, who would not give his name, walked past the group indicating he was a solid Trump supporter. “I’m Trump all the way,” he said. When asked about Trump seeming to praise firing striking workers, he paused, “Well, you would hate to see it.” Jacob Ralph, a 28-year-old from Oshkosh, quietly took the fliers. He said he hadn’t thought much about the election yet but that he was leaning toward Harris. “She’s a lot safer,” he said. Another union member, Lori Jensen of Neenah, said she did not want to say who she supported, citing a highly-volatile political environment in Wisconsin and deep divisions in her family. “It’s too explosive for me,” she said. She noted, however, that she supported her local council, which has backed Harris. At one point, a worker turned to walk closer to the group once he learned they were advocating for Harris. He antagonized them. “You didn’t hear about Sean O’Brien? How come Sean O’Brien didn’t endorse her?” he said. “I can’t speak for Sean,” one of the organizers said and noted that members were free to back whom they pleased. The man shot back: “You don’t follow your president?” The organizer responded, “I’ll let Sean speak for himself.\"",
            "summary": "The Teamsters union in Wisconsin is among the groups urging members to support Democrats, who they say have stood with labor.",
            "url": "https://www.nbcnews.com/politics/2024-election/teamsters-plea-battleground-state-wisconsin-fellow-members-back-harris-rcna177116",
            "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241024-Kamala-Harris-Bill-Carroll-ew-347p-ee7014.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:11:09",
            "author": "Natasha Korecki",
            "authors": [
                "Natasha Korecki"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.209
        },
        {
            "id": 260991922,
            "title": "‘The Brady Bunch’ Reboot Was Spiked at CBS Due to Cindy Actress Susan Olsen’s Documented Hate Speech",
            "text": "“The Brady Bunch” star Susan Olsen was among the OG actors included in a reboot of the beloved sitcom, though it failed to get off the ground due to her controversial comments and hate speech.\n\nThe revival series, which was in early development at CBS Studios, would’ve seen the “Brady Bunch” siblings all the grown up, and provided updates on where each one was at in life, with families of their own. Olsen’s character Cindy (the youngest “Brady Brunch” sibling) was on track to be portrayed as a libertarian podcaster, until Olsen’s real-life views thwarted the series, Olsen revealed on the #WalkAway Campaign podcast.\n\nAfter a homophobic and inflammatory private message — which resulted in her firing from L.A. Talk Radio — was discovered by the studio, Olsen said the studio conducted a web search into her past controversial comments, which eventually turned into a 50 page document that Olsen said was the nail in her coffin. “The resounding result was, ‘No, we cannot have her in a show,’” Olsen said.\n\n“I did have a phone call with my [TV] siblings and my agent,” Olsen said. “Everybody was saying, ‘We’re sorry, but they just won’t budge. They just will not have you in this.’ I’m like, Wow, I’ve been canceled. A role that I’ve played for over 50 years, I can’t play it now because I’m too dangerous. I was like, ‘Well, OK guys, good luck, I hope you can sell it.’”\n\nWhile Olsen said the decision was a result of her revealing that she voted for Donald Trump, an individual knowledgable of the situation told TheWrap the issue did not stem from her support of a certain political candidate, but instead from her controversial comments and hate speech. CBS Studios declined to comment.\n\nOlsen stood by her comments during her podcast appearance, calling them “her greatest hits,” and saying “if I put it out there, then I meant it.”\n\nPrior to the search into all of her past controversial comments, Olsen said CBS Studios had offered her the opportunity to take a course after learning about the homophobic incident, which Olsen had agreed to. “I thought, ‘Hey, it’ll green light the show … It’s the least I can do for my siblings because they’ve having a problem with me,’” Olsen said. \n\nThe actress added that while she said she was eager to “consult with media experts” on the matter, she never received information on a course, as the studio came to find her past comments were too much to overcome.",
            "summary": "\"The resounding result was, 'No, we cannot have her in a show,'\" the actress says\n\n\nThe post &#8216;The Brady Bunch&#8217; Reboot Was Spiked at CBS Due to Cindy Actress Susan Olsen&#8217;s Documented Hate Speech appeared first on TheWrap.",
            "url": "https://www.thewrap.com/the-brady-bunch-reboot-susan-olsen-trump-cbs-studios/",
            "image": "https://www.thewrap.com/wp-content/uploads/2023/09/Brady-Bunch-e1694464489776.jpeg",
            "video": null,
            "publish_date": "2024-10-24 21:08:51",
            "author": "Loree Seitz",
            "authors": [
                "Loree Seitz"
            ],
            "language": "en",
            "source_country": "US",
            "sentiment": -0.68
        },
        {
            "id": 260990186,
            "title": "Beyonce expected to appear at rally for Kamala Harris's campaign in Texas",
            "text": "SUPERSTAR BEYONCE IS expected to appear at a rally for US Vice President Kamala Harris in Texas tomorrow.\n\nHarris’s presidential campaign has taken on Beyonce’s 2016 track Freedom as its anthem and the singer’s planned appearance brings some star power to what has become a key theme of the Democratic nominee’s bid.\n\nShe is heading to the reliably Republican state just 10 days before Election Day in an effort to refocus her campaign against former president Donald Trump on reproductive care, which Democrats see as a make-or-break issue this year.\n\nHouston-born Beyonce’s appearance is expected to draw even more attention to the event.\n\nThe trip is set to feature women who have been affected by Texas’s restrictive abortion laws, which took effect after the Supreme Court overturned Roe v Wade in 2022.\n\nShe has campaigned in other states with restrictive abortion laws, including Georgia which is among the seven most closely contested states.\n\nThe Democrat has centred her campaign around the idea that Trump is a threat to American freedoms, from reproductive and LGBT+ rights to the freedom to be safe from gun violence.\n\nBeyonce gave Harris permission early in her campaign to use Freedom, a soulful track from her 2016 landmark album Lemonade, in her debut ad. Harris has used its thumping chorus as a walk-out song at rallies ever since.\n\nBeyonce’s alignment with Harris is not the first time that the Grammy winner has aligned with a Democratic politician. Barack Obama and his wife, Michelle, danced while Beyonce performed at a presidential inaugural ball in 2009.\n\nIn 2013, she sang the national anthem at Obama’s second inauguration. Three years later, she and her husband Jay-Z performed at a pre-election concert for Democrat Hillary Clinton in Cleveland.\n\n“Look how far we’ve come from having no voice to being on the brink of history — again,” Beyonce said at the time. “But we have to vote.”\n\nSpeculation over whether the superstar would appear at this summer’s Democratic National Convention in Chicago reached a fever pitch on the gathering’s final night, with online rumours swirling after celebrity news site TMZ posted a story that said: “Beyonce is in Chicago, and getting ready to pop out for Kamala Harris on the final night of the Democratic convention.”\n\nThe site attributed it to “multiple sources in the know”, none of them named.\n\nAbout an hour after Harris ended her speech, TMZ updated its story to say, “To quote the great Beyonce: We gotta lay our cards down, down, down… we got this one wrong.”\n\nIn the end, Harris took the stage to star’s song but that was its only appearance.\n\nLast year, Harris and her husband, Doug Emhoff, attended Beyonce’s Renaissance World Tour in Maryland after getting tickets from the star.\n\n“Thanks for a fun date night, @Beyonce,” Ms Harris wrote on Instagram.",
            "summary": "Houston-born Beyonce’s appearance is expected to draw even more attention to the event.",
            "url": "https://www.thejournal.ie/beyonce-expected-to-appear-at-rally-for-kamala-harriss-campaign-6524109-Oct2024/",
            "image": "https://img2.thejournal.ie/article/6524109/river/?height=400&version=6524133",
            "video": null,
            "publish_date": "2024-10-24 21:08:40",
            "author": "View All Articles",
            "authors": [
                "View All Articles"
            ],
            "language": "en",
            "source_country": "ie",
            "sentiment": 0.122
        },
        {
            "id": 260989786,
            "title": "‘We can’t change our history’ on slave trade, says Keir Starmer",
            "text": "During the interview with the BBC, Sir Keir was also asked about a complaint Donald Trump’s team has filed against the Labour Party objecting to its staff and activists volunteering for Kamala Harris’s presidential campaign. \n\n“I think this needs to be seen for what it is,” the prime minister said, adding: “It is some Labour Party members and staff in their free time campaigning. \n\n“It’s happened in every election in different parts of the world. All political parties do it… I think it needs to be put in it’s proper perspective.”\n\nSir Keir added that both he and Trump wanted to have a “good working relationship” and that the pair recently had dinner together. \n\nHe dismissed suggestions that his party were still adjusting to being in government, saying he had “absolute clarity” on his “number one mission” of economic growth. \n\nNext Wednesday Chancellor Rachel Reeves, will set out the government’s tax and spending plans in the Budget.\n\nAhead of this Reeves told the BBC she would be changing the government’s self-imposed debt rules to free up money for infrastructure spending. \n\nAsked about the Budget, Sir Keir said the economy barely grew under the Conservatives and that he wanted to “clear the decks” and “clear up the mess”.\n\n“I believe in running towards problems. If you know what the problem is, what the challenge is, every business knows this, every family knows it, run towards it and fix it.”\n\nThe Conservatives have challenged Labour’s argument that they created a £22bn black hole in the economy and questioned the chancellor’s decision to change the debt rules. \n\nThe party’s shadow Treasury minister Gareth Davies said “uncertainty over additional borrowing risks interest rates staying higher and for longer. \n\n“It’s families up and down the country who would pay the price.”",
            "summary": "BBC The UK &#8220;can&#8217;t change our history&#8221;, Prime Minister Sir Keir Starmer has told the BBC when asked about paying reparations to countries impacted by the transatlantic slave trade. His comments come after diplomatic sources told the BBC that Commonwealth heads of government want to start a &#8220;meaningful conversation&#8221; about an issue that could mean &#8230;\n\n\nThe post &#8216;We can&#8217;t change our history&#8217; on slave trade, says Keir Starmer appeared first on WorldNewsEra.",
            "url": "https://worldnewsera.com/news/uk/we-cant-change-our-history-on-slave-trade-says-keir-starmer/",
            "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32c4/live/8ce9b560-9245-11ef-b3c2-754b6219680e.jpg",
            "video": null,
            "publish_date": "2024-10-24 21:07:03",
            "author": "Evelyn Blackwell",
            "authors": [
                "Evelyn Blackwell"
            ],
            "language": "en",
            "source_country": "us",
            "sentiment": -0.089
        },
        {
            "id": 260991696,
            "title": "'Trump whisperer': Republicans are betting on this GOP senator’s ability to 'tamp down' ex-president",
            "text": "US Senator Bill Hagerty (R-TN), who worked on former President George H.W. Bush and Senator Mitt Romney’s 2012 campaign, is expected to play a pivotal role as the Donald \"Trump whisperer\" in a second MAGA administration, according to a Thursday, October 24 Politico report.\n\nAlthough Hagerty \"has morphed into a MAGA warrior since joining Trump’s transition team in 2016,\" Politico reports, the Tennessee lawmaker has \"still maintained his standing with the GOP’s old-school core.\"\n\nConsidering his experience as a diplomat, the news outlet emphasizes that \"mainstream Republicans and foreign diplomats are pinning their hopes\" on the former US ambassador to Japan \"to help tamp down\" the ex-president's \"most extreme impulses.\"\n\nREAD MORE: 'Not going down that road': Fox host shuts down guest as soon as he says 'John Kelly'\n\nPolitico reports: \n\nThe Tennessee senator is already trying to demonstrate he’s up to the task. Hagerty on Wednesday went on CNN to defend Trump against the allegations that he had expressed admiration for Adolf Hitler, saying the former president’s record in office 'debunks these claims.' He then pivoted to the economy, saying Trump 'had our economy working; people respected us; nations respected us; we had people better off in every demographic group.'\n\n\"He combines the experience of a diplomat with the business savvy of an entrepreneur, and a senator who understands how to get things done on the Hill,\" former Trump national security adviser turned-critic, retired Gen. H.R. McMaster, told the news outlet. \"And he has relationships around the world that are relevant — whether it’s [for secretary of] Commerce, Treasury or State.\"\n\nWhile McMaster believes Hagerty is needed alongside the potential next president of the United States, Politico reports, close allies to the senator \"say the idea he would moderate Trump is misguided. While Hagerty has a 'very soothing way about him,' said Stephen Miller, Trump’s former senior adviser, 'he is as MAGA as MAGA can get.'\"\n\nREAD MORE: 'Within two seconds': Trump vows to fire special counsel Jack Smith if elected president\n\nMiller added, \"He has an amazing ability to disarm people to bring people together to find common ground. But I can tell you, if he was in any position to execute on a Trump policy, he would do that as vigorously and vociferously as the situation required.\"\n\nPolitico's full report is available here.",
            "summary": "US Senator Bill Hagerty (R-TN), who worked on former President George H.W. Bush and Senator Mitt Romney’s 2012 campaign, is expected to play a pivotal role as the Donald \"Trump whisperer\" in a second MAGA administration, according to a Thursday, October 24 Politico report.\n\nAlthough Hagerty \"has morphed into a MAGA warrior since joining Trump’s transition team in 2016,\" Politico reports, the Tennessee lawmaker has \"still maintained his standing with the GOP’s old-school core.\"\n\nConsidering his experience as a diplomat, the news outlet emphasizes that \"mainstream Republicans and foreign diplomats are pinning their hopes\" on the former US ambassador to Japan \"to help tamp down\" the ex-president's \"most extreme impulses.\"\n\nREAD MORE: 'Not going down that road': Fox host shuts down guest as soon as he says 'John Kelly'\n\nPolitico reports: \n\nThe Tennessee senator is already trying to demonstrate he’s up to the task. Hagerty on Wednesday went on CNN to defend Trump against the allegations that he had expressed admir",
            "url": "https://www.alternet.org/bill-hagerty-politico/",
            "image": "https://www.alternet.org/media-library/image.jpg?id=53871659&width=1200&height=600&coordinates=0%2C85%2C0%2C85",
            "video": null,
            "publish_date": "2024-10-24 21:04:09",
            "author": "Maya Boddie",
            "authors": [
                "Maya Boddie"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.041
        },
        {
            "id": 260990088,
            "title": "Republicans make late play for Jacky Rosen Senate seat in Nevada",
            "text": "The Senate Leadership Fund, a super PAC linked to Senate Minority Leader Mitch McConnell (R-KY), will spend $6.2 million to advertise on TV, radio, and digital in the campaign’s final two weeks.\n\nUntil this point, the group had largely spent in more competitive states, like Ohio and Montana, but the funds signal newfound hope that Brown can pull off an upset with former President Donald Trump at the top of the ticket.\n\n“Jacky Rosen has been a reliable vote for the Democrats’ extreme agenda and is a lackluster candidate,” Steven Law, the president and CEO of the Senate Leadership Fund, said in a statement. “President Trump is doing very well in Nevada and we think Sam Brown can too.” \n\nTrump is virtually tied with Vice President Kamala Harris in Nevada, trading the lead with her in the most recent polling. But the race has trended 2 points in his favor since the start of the month, according to a RealClearPolitics average.\n\nBrown, a combat veteran challenging first-term Sen. Jacky Rosen (D-NV), still has ground to make up. He is 7 points behind in Senate Leadership Fund polling leaked earlier this month.\n\nBut Republicans have been encouraged by their ballot advantage in the first days of early voting in Nevada, a practice typically dominated by the Democrats.\n\nThe Rosen campaign predicted that Brown would struggle “no matter how much Mitch McConnell’s Super PAC decides to spend here.”\n\n“The fact is that Sam Brown is a failed politician whose struggling campaign has been losing support from all sides thanks to his tenuous ties to Nevada, his extreme MAGA positions, and his disqualifying anti-abortion record,” Rosen spokeswoman Johanna Warshaw said in a statement.\n\nMeanwhile, Democrats have committed $80 million to advertising in the Senate race, two-thirds more than their Republican counterparts.\n\nThe infusion of cash comes as Republicans, who are favored to retake the Senate majority without Nevada, direct their funds across the map.\n\nAmerican Crossroads, another McConnell-linked PAC, slashed $2.8 million in planned spending for Montana on Thursday as Republican Tim Sheehy takes a comfortable lead in his Senate race.\n\nMeanwhile, SLF and American Crossroads have made repeated investments in Pennsylvania, one of four “toss-up” states, including $1 million from each organization on Thursday.\n\nAs of now, the Cook Political Report rates the Nevada Senate race as “lean Democrat.”",
            "summary": "National Republicans are making a late investment in the Nevada Senate race as polls show an improving environment for their nominee, Sam Brown. The Senate Leadership Fund, a super PAC linked to Senate Minority Leader Mitch McConnell (R-KY), will spend $6.2 million to advertise on TV, radio, and digital in the campaign’s final two weeks. [&#8230;]",
            "url": "https://www.washingtonexaminer.com/news/campaigns/congressional/3202396/mcconnell-late-play-jacky-rosen-senate-seat-nevada/",
            "image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/10/donald-trump-sam-brown-nevada.webp",
            "video": null,
            "publish_date": "2024-10-24 21:01:15",
            "author": "David Sivak",
            "authors": [
                "David Sivak"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": 0.029
        },
        {
            "id": 260991398,
            "title": "Black Women And Kamala Harris: A Conversation With Strategist Aimee Allison",
            "text": "Source: Joe Raedle / Getty In a world rife with systemic exclusion and a relentless struggle for justice, Aimee Allison is dedicated to creating inclusive and equitable spaces for Black women across the U.S. As she nears her 55th birthday—solidly placing her in Generation X—Allison is more energized than ever to champion social justice, striving for a future where Black women are not only heard and seen but empowered to thrive. This election season is particularly personal for her–as it is for all Black women. There are crucial issues at stake for Black women, from maternal morbidity to police and white supremacist violence, from income equity and underresourced schools to reproductive rights and crippling student loan debt. To address these challenges, Aimee has invested her heart and soul into She the People, a national organization empowering Black women and women of color to lead America into a new political era. By harnessing the power of media, research, and analysis to illuminate the strength of Black women’s–and women of color’s voting power– Aimee’s work is pivotal in boosting electoral engagement and advocating for racial, economic, and gender justice. Aimee Allison Source: Sergio Flores / Getty Through her influential writings in publications like The New York Times, Newsweek, The Washington Post, and Essence Magazine, Allison compellingly argues that Black women–the Democratic party’s most loyal demographic–and women of color are the backbone of American democracy. They play a pivotal role in shaping a more equitable future. Her advocacy not only highlights their contributions but also serves as a clarion call for greater representation and empowerment in the political landscape. Aimee’s lifelong commitment to electing women of color was exemplified by her role in organizing the nation’s first Presidential Forum for women of color in 2019, where she interviewed Vice President Kamala Harris and other candidates before an audience of thousands. Now, as she rallies behind Harris’ historic presidential campaign, Allison is confident that the Democratic candidate can tackle the pressing issues Black women are eager to address, but there’s more work needed to be done to fully secure younger women’s support and trust. Black women Gen Zers and younger Millennials In September, Aimee, a California native collaborated with 2040 Strategy Group to conduct the only election cycle poll specifically targeting women of color. The findings revealed very strong support for Harris among Black women over 40, yet a notable disconnect persists with Black female voters from Gen Z and millennial generations. Many from these younger groups expressed that they feel they don’t truly know Harris and are eager to learn more about her experiences growing up as a Black woman in Oakland. They seek to understand how her journey intertwines with their own aspirations for social justice and reform, particularly in a city steeped in rich Black history. Although Harris is far too young to have been part of the Black Power movement of the late 1960s and early-mid 1970s, Oakland was the birthplace of the Black Panthers and, until recent gentrification, was home to scores of progressive Black activists and activists of color. “Just mentioning her identity as a Black woman raises support amongst younger Black women by 10%. They go from the undecided column to supporting,” Aimee told NewsOne of the poll findings. Gen Z and millennial voters are encouraged by Kamala Harris having addressed two critical issues: the student loan debt crisis and the threats to reproductive rights. Both hold significant consequences for Black women if left in the hands of politicians who’ve already harmed them. Even still, Aimee noted, “We found that for younger Black women, it’s not a choice between, ‘Oh, Kamala Harris or Donald Trump.’ It’s more like, ‘Am I going to stay home and not vote, or, am I going to vote for Kamala Harris?’” She continued, adding “I think the rest of the country is starting to acknowledge that younger Black women are exercising power. The issue is, how do we translate what younger Black women need to what the campaigns are actually doing?” Why voting is critical for younger Black women Black women carry a disproportionate share of the staggering $1.6 trillion in federal student debt, facing higher averages than any other demographic. In fact, these educated Black women have 43% more undergraduate debt compared to their white female counterparts, according to Forbes. Reproductive rights, also a vital concern for Black women voters, are rooted in a complex web of historical, social, and political factors. They have long been advocates for reproductive justice, which extends beyond the right to abortion to include access to contraception and maternal healthcare. The overturning of Roe v. Wade in June 2022 disrupted access to contraceptives and has put the lives of Black women who are pregnant at risk or killed them disproportionately. Cases like Amber Thurman’s–the Georgia mom who died needlessly because of the Trump Supreme Court’s Dobbs decision that took away women’s control of their bodies–are especially haunting. And it’s also true that Black women are three times more likely to die from pregnancy-related complications than white women. They also face higher rates of serious conditions such as hypertension and preeclampsia. The Fierce Urgency of Now Aimee, who is actively engaging with officials from Harris’ team, emphasized that the Democratic candidate is committed to personally connecting with young Black women voters and has her foot on the ground talking to them directly about her plans for change. This outreach could potentially boost their support by as much as 20%. As the stakes grow higher, the demand for effective solutions has never been more urgent. “We have to remind people of those issues, and [that] with Donald Trump, we have no chance to advance our interests. Now, having said that, Black women, in general [are tired] of our vote being taken for granted. That’s why I started She the People,” Aimee said. “Stop going to us a month and a half before the election, and just assuming that we’ll vote.” Aimee warns, “We found that for younger Black women, it’s not a choice between, ‘Oh, Kamala Harris or Donald Trump.’ It’s more like, ‘Am I going to stay home and not vote, or am I going to vote for Kamala Harris?’” Aimee noted. “I think the rest of the country is starting to acknowledge that younger Black women are exercising power. The issue is, how do we translate what younger Black women need to what the campaigns are actually doing?” Part 2 of this critical conversation will run tomorrow See Also: Kamala Harris Is Every Overqualified Black Woman Who Has Had To Confront White Mediocrity ‘The Black Ballot’: Tamika Mallory Addresses Activism And The 2024 Election 10 Black Women Who Have Helped Shape U.S. Foreign Policy 8 photos",
            "summary": "Aimee Allison discussed the key factors influencing voter sentiment and what Harris needs to do to resonate more effectively with this important demographic.",
            "url": "https://newsone.com/5649155/aimee-allison-kamala-harris/",
            "image": "https://newsone.com/wp-content/uploads/sites/22/2017/05/14957440495749.jpg?quality=80&strip=all&w=1024&crop=0,0,100,751px",
            "video": null,
            "publish_date": "2024-10-24 21:00:34",
            "author": "Shannon Dawson",
            "authors": [
                "Shannon Dawson"
            ],
            "language": "en",
            "source_country": "US",
            "sentiment": 0.426
        },
        {
            "id": 260989862,
            "title": "Starmer has not spoken to Trump about US election interference row",
            "text": "The Prime Minister has not spoken to Donald Trump since the presidential candidate’s campaign claimed the Labour Party was interfering in the US election.\n\nSir Keir Starmer was asked if he had called Mr Trump to smooth over the row about Labour staffers campaigning for Kamala Harris.\n\n“No, he’s in the middle of a campaign,” Sir Keir told ITV.\n\n“Also I think we need just a little bit of perspective here. This is Labour Party members of staff volunteering in their spare time in the election. It’s happened at every election, it happens across the world.”\n\nMr Trump’s team has filed an official complaint with US federal election authorities, in which they claim the UK Labour Party has “made, and the Harris campaign has accepted, illegal foreign national contributions”.\n\nSenior Labour officials were also said to have met Ms Harris’s campaign staff.\n\nSir Keir has insisted that his relationship with Mr Trump, who could be the next US president following the closely fought race, would not be jeopardised by the incident.\n\nWhen he travelled to New York in September, Sir Keir had also hoped to meet Ms Harris but was not able to schedule a meeting.\n\nThe Labour Party has said it is common practice for campaigners of all political persuasions from around the world to volunteer in US elections and that any Labour activists who take part do so at their own expense and in line with US laws and rules.",
            "summary": "Sir Keir Starmer said he has not spoken to Donald Trump since his campaign accused the Labour Party of interfering in the US election.",
            "url": "https://www.standard.co.uk/news/politics/keir-starmer-donald-trump-labour-party-prime-minister-new-york-b1189992.html",
            "image": "https://static.standard.co.uk/2024/10/24/22/b0e0d778bb4aa6cdb3bf972d7c7aa3dbY29udGVudHNlYXJjaGFwaSwxNzI5ODg3ODc2-2.72006355.jpg?width=1200",
            "video": null,
            "publish_date": "2024-10-24 21:00:28",
            "author": "David Lynch",
            "authors": [
                "David Lynch"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "GB",
            "sentiment": -0.084
        },
        {
            "id": 260989800,
            "title": "Blocking Illegal Immigrants From Entering US If at Capacity Is Illegal: Appeals Court",
            "text": "Preventing illegal immigrants from crossing the U.S.–Mexico border if U.S. officials say a port of entry is at capacity is illegal, a federal appeals court ruled on Oct. 23.\n\nOne judge dissented.\n\nThe so-called metering policy, implemented in 2016 under President Barack Obama and continued under President Donald Trump and President Joe Biden, saw federal immigration officials refuse to let illegal immigrants cross into the United States if the number of border crossers at ports exceeded a certain number.\n\n“If we don’t have the resources to let them in on a particular day, they are going to have to come back,” Homeland Security Secretary Kirstjen Nielsen said on cable television in 2018.\n\nImmigration rights advocates sued, arguing the policy was illegally denying migrants the right to enter the United States and claim asylum. A district court judge in 2021 ruled that the policy violated federal law that requires immigration officers to inspect newly arrived illegal immigrants and refer them for an interview if they say they’re applying for asylum.\n\nConstruing the law as allowing officers to turn back illegal immigrants until an unspecified time “would permit defendants to turn back asylum seekers any number of times—perhaps indefinitely—without running afoul of their statutory obligations,” U.S. District Judge Cynthia Bashant said at the time.\n\nThe policy was rescinded shortly after Bashant’s ruling.\n\n“A noncitizen stopped by U.S. officials at the border is eligible to apply for asylum under” the law, U.S. Circuit Judge Michelle Friedland wrote for the majority.\n\nThe law in question states in part, “Any alien who is physically present in the United States or who arrives in the United States (whether or not at a designated port of arrival and including an alien who is brought to the United States after having been interdicted in international or United States waters), irrespective of such alien’s status, may apply for asylum.”\n\nGovernment lawyers had argued that immigrants had not arrived until they were on U.S. soil and had presented themselves to officials, but the judge indicated that that interpretation means an asylum seeker would be better off in some instances crossing the border between ports of entry.\n\n“If she manages to surreptitiously cross the border, she will be able to apply for asylum. We do not think Congress would have created that incentive,” the judge said.\n\nU.S. Circuit Judge John Owens joined Friedland.\n\nU.S. Circuit Judge Ryan Nelson said in a dissent that the key point is the law says “arrives in,” not just “arrive.” He said the law means immigrants must be physically present in the United States to apply for asylum.\n\nNelson also said that the ruling “imposes on the federal government—for the first time—an obligation to interview asylum seekers who are still in Mexico.”",
            "summary": "The so-called metering policy was implemented in 2016 and rescinded in 2022.",
            "url": "https://www.theepochtimes.com/us/blocking-illegal-immigrants-from-entering-us-if-at-capacity-is-illegal-appeals-court-5747361",
            "image": "https://img.theepochtimes.com/assets/uploads/2017/09/22/Texas-Benjamin_Chasteen-20170526-8153-300x180.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:59:14",
            "author": "Zachary Stieber",
            "authors": [
                "Zachary Stieber"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.317
        },
        {
            "id": 260991106,
            "title": "Lauren Boebert claims Morning Joe host’s rhetoric is ‘getting Republicans shot’",
            "text": "Far-right lawmaker Lauren Boebert has claimed that a MSNBC journalist is using rhetoric that “is getting Republicans shot.”\n\nRepresentative Boebert of Colorado posted a clip of ‘Morning Joe’ host Mika Brzezinski telling viewers that Donald Trump is “killing” women over his stance on reproductive rights.\n\n“This is the future that we’re looking at in the next Trump term, if there is one,” Brzezinski said in the clip. “But this is what voters know right now, that he is killing us, talking about us women, he is killing us…He is putting our reproductive health at risk, and some women have died already because of this.”\n\nBoebert responded on X, stating that Trump “is not killing women” and that Brzezinski’s “rhetoric is the stuff that is getting Republicans shot.”\n\nSince the fall of Roe v Wade, the Supreme Court decision that guaranteed nationwide abortion access, pregnant people have faced significant barriers to reproductive healthcare which can have life-altering, and at times life-threatening, consequences. \n\nBy creating a conservative majority on the Supreme Court during his presidency, Trump made Dobbs v Jackson — the decision that overturned Roe v Wade — possible.\n\nBoebert isn’t the first Republican to blame Democratic rhetoric or Kamala Harris for threats against former president Donald Trump and others.\n\nOn Wednesday, Marjorie Taylor Greene claimed that Kamala Harris was going to get Trump “killed” after the vice president addressed reports that he wanted “the kind of generals [Adolf] Hitler had.”\n\nThe Georgia congresswoman described Harris as a “desperate, dangerous” liar, in response to a statement she made about her Republican rival on Wednesday.\n\n“Donald Trump said that because he does not want a military that is loyal to the United States Constitution,” Harris said. “He wants a military that is loyal to him. He wants a military who will be loyal to him, personally, one that will obey his orders even when he tells them to break the law or abandon their oath to the Constitution of the United States.”\n\nTrump himself has even blamed Harris, saying her “rhetoric” incited violence against him.\n\nIn July, Thomas Crooks opened fire at a Trump rally in Butler, Pennsylvania, killing one attendee and shooting the former president in the ear.\n\nThen, in September, Ryan Wesley Routh was arrested after federal officials said he aimed a gun through the bushes at Trump National Golf Club in West Palm Beach, Florida, while the former president was golfing.",
            "summary": "Mika Brzezinski said Donald Trump is ‘killing’ women on MSNBC’s Morning Joe",
            "url": "https://www.independent.co.uk/news/world/americas/us-politics/lauren-boebert-msnbc-assassination-republican-b2635226.html",
            "image": "https://static.independent.co.uk/2024/10/24/21/SEI225327731.jpg?width=1200",
            "video": null,
            "publish_date": "2024-10-24 20:58:19",
            "author": "Katie Hawkinson",
            "authors": [
                "Katie Hawkinson"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "gb",
            "sentiment": -0.328
        },
        {
            "id": 260989802,
            "title": "Florida AG Sues DOJ for Blocking Investigation of Trump Assassination Attempt",
            "text": "The state of Florida is suing the U.S. Department of Justice (DOJ) for attempting to block its independent investigation into the assassination attempt on former President Donald Trump in West Palm Beach.\n\nFlorida’s Attorney General Ashley Moody filed a complaint against U.S. Attorney General Merrick Garland in the Southern District Court of Florida on Oct. 23, arguing the actions taken by the federal government are a violation of the 10th Amendment, and pose a “genuine threat” to Florida’s ability to investigate state law violations.\n\n“These officials have stated that Florida may not conduct its own investigation, may not interview witnesses, and may only cooperate with the federal government’s investigation,” Moody writes in her complaint.\n\n“Florida sues to vindicate its sovereign interest to investigate violations of state law, as delay may impact the outcome of any prosecution,” she wrote.\n\nMoody’s complaint states the DOJ began impeding Florida’s investigation only a few days after Florida’s Gov. Ron DeSantis signed the Sept. 17 executive order announcing the statewide investigation.\n\nMoody sent a letter to U.S. Attorney Markenzy Lapointe and FBI Director Christopher Wray for clarification on the DOJ’s intentions to invoke that legislation on Sept. 23.\n\nAttempted assassination of a major presidential candidate is one of those violations covered by that federal law, but the charge was not added by federal prosecutors until Sept. 24.\n\nMoody received a response from Lapointe on Sept. 30, saying the federal indictment adding the attempted assassination charge “resolves any potential uncertainty” about whether or not the legislation applies to the investigation.\n\nMoody’s complaint said Lapointe’s response did not provide any further guidance on what the statute prohibits or how the federal government intended to enforce it.\n\nLapointe stated in her letter, “Congress plainly envisioned federal investigative and prosecutive primacy in the first instance for attempted assassinations such as occurred here, the same provision does not preclude state prosecutions permissibly following the conclusion of the federal prosecution.”\n\nTwo days later, the federal prosecutors requested an indefinite delay in the scheduling of Routh’s trial, citing the large amount of evidence needed to be reviewed by the prosecutors.\n\nThat request was denied by Judge Aileen Canon, but the Nov. 18 trial was still pushed back to Feb. 10, 2025, which prevented Florida from starting its independent investigation, as the state may not interview witnesses or execute warrants or subpoenas until the federal investigation and prosecution are concluded.\n\n“Every day that Florida is prevented from investigating, the State’s case becomes harder to prove at trial,” Moody said. “By contrast, the federal government suffers no injury from Florida investigating state law crimes, as the State has no intention of interfering with or obstructing the federal investigation.”\n\nMoody invokes the 10th Amendment, arguing that the DOJ’s reading of the law violates the amendment’s anticommandeering rule by attempting to dictate the actions of state officials.\n\nMoody also noted concerns about perceived bias within the DOJ against the former president.\n\n“The State of Florida has been clear that a dual-track investigation would be in the best interest of all parties involved,” Moody later said in a press release. “It is not lost on us that the American people have concerns about federal agencies exclusively handling this matter while simultaneously investigating and attempting to prosecute President Trump.\n\nThe Department of Justice declined The Epoch Times’ request to comment, deferring to 18 U.S.C. § 351 (f) and Lapointe’s response letter to Moody.",
            "summary": "'Florida sues to vindicate its sovereign interest to investigate violations of state law,’ Ashley Moody said in her complaint.",
            "url": "https://www.theepochtimes.com/us/florida-ag-sues-doj-for-blocking-investigation-of-trump-assassination-attempt-5747142",
            "image": "https://img.theepochtimes.com/assets/uploads/2024/10/17/id5743137-GettyImages-2172608196KO-300x180.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:57:53",
            "author": "T.j. Muscaro",
            "authors": [
                "T.j. Muscaro"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.567
        },
        {
            "id": 260990092,
            "title": "Harris seeks to rival Trump’s showmanship with star-studded lineup",
            "text": "Obama will appear with Harris on Thursday in Atlanta, their first rally together since he began campaigning on her behalf. Obama will continue his battleground state tour Monday in Philadelphia.\n\nBeyonce will then reportedly speak and perform before Harris’s event Friday in the music icon’s hometown of Houston, Texas, a prospect that was teased this summer during the Democratic National Convention in Chicago.\n\nThe rallies are Harris’s latest and possibly last attempt to increase voter enthusiasm as momentum in the race moves somewhat in former President Donald Trump’s direction. In the past, she has enlisted the help of celebrities, from Oprah Winfrey to Bruce Springsteen.\n\nHowever, the guest appearances also pose a political liability to her campaign. Harris, already competing for the spotlight with Trump, could get overshadowed when handing it to her special guests, or they could create a distraction.\n\nThere are not many politicians who can demonstrate the same showmanship as Trump, who dominated headlines this week for working a fryer at a McDonald’s in Pennsylvania. On Sunday, he will stage a splashy rally at New York City‘s Madison Square Garden.\n\nHarris has found her own ways to make her mark on what continues to be a toss-up contest. She will deliver her “closing argument” in remarks one week before Election Day from the Ellipse, the same place Trump addressed a crowd before the Jan. 6 attack on the Capitol.\n\nHowever, Harris now finds herself in the headlines with Obama, but not all of them are positive.\n\nObama was praised for a rally Tuesday in Detroit, where he rapped “Lose Yourself” after Eminem introduced him onstage. Earlier this month, Obama stirred controversy by suggesting that sexism is the reason for the perceived reluctance of black men to support Harris.\n\nDemocratic strategist Stefan Hankin conceded “the two-sentence clip” of Obama telling at a Pittsburgh party campaign field office that black men seem not to be “feeling the idea of having a woman as president” sounded “weird” without “the context.”\n\n“There’s always gonna be people out there to take the, slice down whatever speech you give or whatever comment you give and put it in the worst light humanly possible,” Hankin told the Washington Examiner.\n\nThe Harris campaign has carefully managed her previous engagements with Obama, with the vice president and Gov. Tim Walz (D-MN) holding their own rally in Milwaukee when Obama and former first lady Michelle Obama spoke at the Democratic convention in their hometown. The Obamas were also not included in-person on camera in their endorsement video for Harris, with only their voices heard.\n\nDemocrats have dismissed speculation the Harris campaign is concerned that Barack Obama could overshadow the vice president, unlike their concerns about his dynamic with President Joe Biden.\n\n“She is not concerned about being overshadowed by Obama,” Aggressive Progressive podcast host Christopher Hahn told the Washington Examiner. \n\nMeanwhile, the Trump campaign has embraced the former president’s newfound momentum, contending his “celebrity alone is enough to fill stadiums.”\n\nTrump’s crowd sizes have become a personal sensitivity and political vulnerability for the former president, one that Harris took advantage of during their one and only debate last month in Philadelphia.\n\nRegardless, the Trump campaign argued the former president has regained his position in the polls after Harris’s summer surge because “everyday families know that only he can lower costs, secure the border, and ‘Make America Great Again‘ after Kamala’s four years of failure.”\n\n“Kamala wants to be overshadowed because she loses votes every time she opens her mouth, but President Trump will continue to share his winning message to Americans far and wide,” Republican National Committee spokeswoman Anna Kelly told the Washington Examiner.\n\nSpringsteen’s performance at the Harris and Barack Obama rally will launch what the vice president’s campaign is calling its “When We Vote We Win” concert series, which will include all seven battleground states.\n\nThe Harris campaign told the Washington Examiner the concert series is an opportunity to turn voter enthusiasm into actual votes and supporters into volunteers, even if that is relational organizing or convincing their family and friends to cast their ballots for the vice president.\n\n“Celebrities play a critical role in driving energy and excitement at such an important part of the campaign,” Michael Hardaway, a former aide to House Minority Leader Hakeem Jeffries (D-NY), Barack Obama, and Sen. Dick Durbin (D-IL), told the Washington Examiner. “It’s especially helpful when those celebrities are willing to join a candidate when they visit their hometown.”\n\n“It’s also great because their participation encourages their peers to dip their toe in the water and join them in supporting a candidate,” Hardaway said. “Usher, Eminem, Willie Nelson, and Beyonce are obviously four of the biggest stars in the history of music, so this is a huge get for Kamala at this point.”\n\nHarris’s star power has attracted criticism from Trump, who complained about the vice president’s rally-turned-concert this summer, featuring Megan Thee Stallion and Quavo, in Atlanta.\n\n“Crazy Kamala Harris, voted the WORST Vice President in American history, needed a concert to bring people into the Atlanta arena, and they started leaving 5 minutes into her speech,” Trump wrote on social media at the time. “I don’t need concerts or entertainers, I just have to MAKE AMERICA GREAT AGAIN!!!”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nMiddlebury College political science professor Bert Johnson advised the Harris campaign not to compare its events with those of Trump “or to try to duplicate the spectacle.” \n\n“As with more standard joint appearances and endorsements, Harris’s team is likely betting on garnering relatively friendly local and social media coverage,” Johnson told the Washington Examiner. \n\nMarisa Schultz contributed to this report.",
            "summary": "Vice President Kamala Harris is attempting a high-risk, high-reward strategy by bringing out heavy-hitter surrogates, from former President Barack Obama to Beyonce, in the closing days of her 2024 campaign. Obama will appear with Harris on Thursday in Atlanta, their first rally together since he began campaigning on her behalf. Obama will continue his battleground state tour Monday in [&#8230;]",
            "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3199846/harris-seeks-rival-trump-showmanship-star-studded-lineup/",
            "image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/10/obama-harris-relationship-history.webp",
            "video": null,
            "publish_date": "2024-10-24 20:57:49",
            "author": "Naomi Lim",
            "authors": [
                "Naomi Lim"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.044
        },
        {
            "id": 260989188,
            "title": "Dollar Weakens Against the Real, Closing at R$ 5.66",
            "text": "The dollar experienced a turbulent trading session, influenced by various factors including reactions to the IPCA-15 inflation indicator, U.S. economic data, and remarks from key Brazilian officials.\n\nBy the end of the trading day, the U.S. dollar (USDBRL) closed at R$ 5.6629, marking a decline of 0.69%. This trend mirrored movements in international markets, where the DXY index, which measures the dollar against a basket of six global currencies, fell by 0.41%.\n\nSeveral elements contributed to the dollar‘s instability. Weakness in commodity prices, ongoing uncertainties regarding Brazil’s fiscal situation, and expectations surrounding the upcoming U.S. elections all played significant roles.\n\nDomestically, market participants reacted to the latest IPCA-15 report, which serves as a preliminary gauge of inflation. In October, this index rose by 0.54%, a notable increase from September’s 0.13%.\n\nIn addition, Aaalysts had anticipated a rise of 0.50%. Over the past year, the index climbed from 4.12% to 4.47%. This marks its highest level since February and brings it near the inflation target ceiling of 4.50%.\n\nItaú economists noted that this inflation reading was qualitatively worse than expected compared to previous figures.\n\nLuciana Rabelo from Itaú Unibanco attributed this trend to a tight labor market. This situation follows deflation in cinema and vehicle insurance costs.\n\nMarket Insights\n\nInvestors also monitored further comments from central bank officials throughout the day. Diogo Guillen, the Central Bank‘s Director of Economic Policy, emphasized that future interest rate hikes will be based on data analysis.\n\nThis approach allows for flexibility in responding to changing economic conditions. Finance Minister Fernando Haddad stated that if there is a need to strengthen parameters for sustaining fiscal frameworks, the government will pursue that path.\n\nDuring an interview at a G20 finance event alongside Central Bank President Roberto Campos Neto, Haddad expressed confidence in the defined fiscal parameters.\n\nHe indicated that there is no need for reformulating regulations but rather demonstrated their credibility over time.\n\nCampos Neto echoed these sentiments. He suggested that forthcoming fiscal measures from President Luiz Inácio Lula da Silva’s administration could alleviate market concerns regarding public finances.\n\nOn an international scale, the race for the White House remains a focal point for analysts. A potential victory for former President Donald Trump is viewed as potentially detrimental to the Brazilian currency.\n\nHis inflationary economic promises could keep U.S. interest rates elevated. Additionally, recent U.S. labor market data showed initial jobless claims dropping to 227,000 last week from 242,000 previously.\n\nThis figure fell below economists’ expectations of 242,000. This outcome may bolster the dollar in upcoming sessions. It reinforces expectations for gradual monetary easing by the Federal Reserve, thereby increasing Treasury yields.",
            "summary": "The dollar experienced a turbulent trading session, influenced by various factors including reactions to the IPCA-15 inflation indicator, U.S. economic data, and remarks from key Brazilian officials. By the end of the trading day, the U.S. dollar (USDBRL) closed at R$ 5.6629, marking a decline of 0.69%. This trend mirrored movements in international markets, where [&#8230;]",
            "url": "https://www.riotimesonline.com/dollar-weakens-against-the-real-closing-at-r-5-66/",
            "image": "https://www.riotimesonline.com/wp-content/uploads/2024/10/istockphoto-1305402268-612x612-1.webp",
            "video": null,
            "publish_date": "2024-10-24 20:57:06",
            "author": "RT Staff Reporters",
            "authors": [
                "RT Staff Reporters"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "br",
            "sentiment": 0.159
        },
        {
            "id": 260989078,
            "title": "Watch Live: Trump campaigns in Arizona",
            "text": "New York Post\n\n See All Videos \n\nWatch Live: Trump campaigns in Arizona\n\nOctober 24, 2024 | 4:56pm\n\nFormer President Donald Trump is in Tempe, Arizona for the second of two campaign stops today. Trump will be speaking to supporters at Mullett Arena on the Arizona State University campus at 5pm ET.\n\n Share thison",
            "summary": "Former President Donald Trump is in Tempe, Arizona for the second of two campaign stops today. Trump will be speaking to supporters at Mullett Arena on the Arizona State University campus at 5pm ET.",
            "url": "https://nypost.com/video/watch-live-trump-campaigns-in-arizona-2/",
            "image": "https://nypost.com/wp-content/uploads/sites/2/2024/10/trump_91e392.png?w=1200",
            "video": null,
            "publish_date": "2024-10-24 20:56:02",
            "author": "New York Post Video",
            "authors": [
                "New York Post Video"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.076
        },
        {
            "id": 260989400,
            "title": "Small-town mayor candidate who runs Trump Town USA merchandise store accused of assaulting ex-employees",
            "text": "A candidate for mayor in a small Virginia town was arrested at the Trump Town USA store he owns less than two weeks before the election.\n\nDonald “Whitey” Taylor, a 74-year-old running for mayor in the 250-person town of Boones Mill, was arrested on Tuesday and now faces four misdemeanor charges: three counts of assault and battery and one count of indecent exposure, court records show. He owns a store that sells pro- Trump merchandise.\n\nThe complaints stem from three women who all worked at the store. One woman claimed that in September, Taylor had asked her to go to the back of the store, where he exposed himself while sitting in a swivel chair and asked her for oral sex, the report claims. \n\nThe woman alleged that her boss also pressured her into staying at his apartment, as he had made dinner for them.\n\nThen, in October, before giving the woman her paycheck, Taylor allegedly groped her buttocks, the documents say.\n\n“I struggled to get away,” she said. “He has repeatedly sexually, mentally, emotionally, physically, and verbally harassed me.”\n\nDays later, a second woman alleged that Taylor grabbed her arm and “shoved his hand” into her pants. He prevented her from leaving the back of the store, she alleged.\n\nThis woman also claimed that for years before this incident, her boss had made inappropriate remarks toward her. “The assault and emotional distress I have endured from 2022-2024 has gone on long enough,” the court documents say, according to WDBJ7.\n\nThree days after the second incident, a third woman claimed that at the back of the store, when she requested her paycheck, he handed it to her before he asked her for a hug and grabbed her breast. The store owner then made a sexual comment about his employee’s body, she claimed.\n\nTaylor wrote in a Facebook post on Thursday that he believes the claims are driven by politics: “Hey guys, all this you’re seeing on the news is fake news election interference for my mayor election. I’m going after the misappropriation of funds in BoonesMill. The worst of any small town in the USA, population of 278.”\n\nTaylor, who has vowed to “Make Boones Mill Great Again” if elected, was released on his own recognizance, court records show. His arraignment is scheduled for October 30 in Franklin County General District Court.\n\nThe Independent has contacted Taylor for comment.",
            "summary": "Donald “Whitey” Taylor was arrested at the Trump Town USA store in Boones Mill",
            "url": "https://www.independent.co.uk/news/world/americas/crime/mayor-candidate-donald-taylor-trump-town-usa-b2635212.html",
            "image": "https://static.independent.co.uk/2024/10/24/20/Screenshot-2024-10-24-at-3.18.58%E2%80%AFPM.jpg?width=1200",
            "video": null,
            "publish_date": "2024-10-24 20:52:12",
            "author": "Kelly Rissman",
            "authors": [
                "Kelly Rissman"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "gb",
            "sentiment": -0.619
        },
        {
            "id": 260990870,
            "title": "Rolls Royce, Lamborghini, and Tesla: Look inside Donald Trump’s garage",
            "text": "It’s hard to imagine former President Donald Trump behind the wheel of a car – especially because former commanders-in-chief are barred from driving on public roads – but that hasn’t stopped the Republican nominee from building up an extensive collection of flashy rides over the years.\n\nTrump is known for his extravagant taste – this is, after all, the man who once claimed a gilded penthouse as his primary residence and who currently lives in an upscale golf resort. He also has expressed a love for the open road in the past.\n\nIn the waning days of Trump’s 2020 campaign, he spoke enviously to truck drivers at a rally in Allentown, Pennsylvania, while complimenting their vehicles.\n\n“You think I could hop into one of them and drive it away,” the former president asked his supporters. “I’d love to do — just drive the hell out of here, just get the hell out of this.”\n\nWhile Trump apparently never got the chance to drive a truck, he has been able to spend time behind the wheels of some other enviable vehicles over the years.\n\nEarlier this year, one of Trump’s former vehicles was in the news when it sold at auction for $1.1 million. The car – a custom 1997 Lamborghini (VWAGY) Diablo VT roadster – belonged to the former president until he sold it in 2002.\n\n“Trump was allowed to custom-order this Diablo because of a special relationship with Lamborghini, which provided him with some “loaner” Diablos for brand and model promotional purposes,” the auction’s lot description explained.\n\nTrump has also combined his love of flashy rides with his passion for selling things that have his name written on them. In the 1980s, for example, Trump commissioned a signature series of limousines from Cadillac (GM).\n\n“A decision has been made to go into production on two Cadillac-body limousines using my name,” he said at the time. “The Trump Golden Series will be the most opulent stretch limousine made. The Trump Executive Series will be a slightly less lavish version of the same car.”\n\nThe vehicles featured a gilded interior, with two bars, a television screen, and requisite Trump branding throughout. Though the then-real estate magnate envisioned selling 50 limos, only a handful were ever manufactured.\n\nClick through to see more of the flashy cars that Trump has owned throughout the years. \n\n1956 Rolls-Royce Silver Cloud\n\n1997 Lamborghini Diablo\n\n2007 Ferrari F430 F1 Coupe\n\n2010 Rolls-Royce Phantom\n\n1988 Cadillac Trump Golden Series Limousine",
            "summary": "It’s hard to imagine former President Donald Trump behind the wheel of a car – especially because former commanders-in-chief are barred from driving on public roads – but that hasn’t stopped the Republican nominee from building up an extensive collection of flashy rides over the years.\n\nRead more...",
            "url": "https://qz.com/look-inside-donald-trump-s-garage-1851680832",
            "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d4b6b87fd40256d91c080db72c300f65.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:51:00",
            "author": "Madeline Fitzgerald",
            "authors": [
                "Madeline Fitzgerald"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.132
        },
        {
            "id": 260989020,
            "title": "Michigan youth pastor arrested on charges of criminal sexual conduct against minors",
            "text": "A Michigan church youth pastor who moonlights as a Christian rock singer and has performed before high-profile conservative audiences has been accused of preying on teenagers in his father’s flock for more than 10 years. Zachary Radcliff, 29, was fired Oct. 12 from his job as the music and youth director of Oakwood Church in Ypsilanti, an Ann Arbor suburb, 10 days after the Michigan State Police launched an investigation. His father, Frank Radcliff, is the church's senior pastor. “We realized while talking to him that there was more to the situation than was being expressed,” the church said in a statement posted on its website. Zachary Radcliff was arrested over the weekend and charged with one count of first-degree criminal sexual conduct, two counts of aggravated child sexually abusive activity, two counts of child sexually abusive activity and six counts of using a computer to commit crime, according to court records. He was being held on $3 million bond. “The investigation shows the alleged offenses have been occurring since as early as 2011,” the Michigan State Police said on its official X account, which noted that the alleged victims ranged in age from 12 to 17. The date of offense for the charges against Radcliff is June 27, 2014, according to court records. The state police said that is because the majority of the alleged offenses happened around that time. But the church, which is cooperating with the police investigation, shed more light on what Radcliff is accused of doing in its statement. “The information that we received was shocking,” it said. “We were told that Zachary had been soliciting inappropriate photos and possibly videos from teens. We have also heard other stories. This information has ripped our hearts apart.” Radcliff, who lives just south of Ann Arbor in the town of Saline, faces anywhere from 20 years to life in prison if convicted on the most serious charges against him, according to court records. The state police said it launched its investigation of Radcliff on Oct. 2 after being told that he had allegedly solicited sexually abusive material from a minor. A search warrant was executed at his office and residence. Radcliff, according to his Liberty Music Group: God and Country Record Label biography, is “an alumnus of Liberty University’s School of Music.” “He has a passion not only as a musician and songwriter but also as a public citizen to do his part to make this country be the best it can be,” it reads. “His country style and humble blue-collar background influence his musical style and fan base. He has a passion for God, country, and music which is exuded in his personality.” Before his arrest, Radcliff was carving out a musical career that included a performance in 2019 at the Conservative Political Action Conference (CPAC). An ardent supporter of former President Donald Trump, Radcliff also posted a video on YouTube of himself performing his patriotic anthem “I’ll Stand” in November 2019 as part of the convocation at Liberty University. Donald Trump Jr. can be seen in the background along with then Liberty University President Jerry Falwell Jr. In the description beneath the video, it says that Radcliff “shared the stage with Donald Trump Jr, Kimberly Guilfoyle, Jerry Falwell, Becki Falwell, Tim Lee, and Charlie Kirk.”",
            "summary": "A Michigan church youth pastor who moonlights as a Christian rock singer and has performed before high-profile conservative audiences has been accused of preying on teenagers in his father’s flock for more than 10 years.",
            "url": "https://www.nbcnews.com/news/us-news/michigan-youth-pastor-arrested-charges-criminal-sexual-conduct-minors-rcna177062",
            "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241024-oakwood-church-michigan-mn-1555-409db4.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:50:38",
            "author": "Corky Siemaszko",
            "authors": [
                "Corky Siemaszko"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.057
        },
        {
            "id": 260988942,
            "title": "Trump Supporter Threatens Kamala Harris, Says She's 'Gonna Meet Her Maker' Soon: \"I Think She's...\"",
            "text": "A die-hard Donald Trump fan recently asserted that Vice President Kamala Harris would soon meet her 'maker.' The supporter, named Andrew, didn't hesitate to warn the Democrat presidential nominee about the upcoming polls as he spoke to Right Side Broadcasting Network (RSBN); the conversation took place right before the former President's town hall event in Pennsylvania on Sunday, October 20. In fact, Andrew even threatened the Harris-Walz campaign with dire consequences and that Harris still had time to take her name out of the race. \n\nAccording to Raw Story, the supporter said that he was there to 'represent the truth, Jesus Christ.' He went on to claim that the incumbent VP and other Democrat politicians had 'sold out for the devil.' This didn't end there as he started calling Harris a 'dumb woman.' \"They don't want anything to do with God. I think [Harris] better get on her hands and her knees and start crying out to the one and true living God because if not, she's gonna meet her maker real quick. I think she's dumb. She's one of the dumbest women that could ever run. She shouldn't run,\" the supporter who shared that his name was Andrew said. \n\nWhat started as a rant out of anguish turned into a menacing monologue as Andrew continued by saying, \"This is a man's world. This is a man's country. This... this country is supposed to be run like a business. And that is why Donald Trump is the one that we need at this moment.\" The comment passed by the Trump supporter has since then gone viral with many criticizing the statements made by him. Users took to X (formerly known as Twitter) to share their views. @klst86 shared, \"Crazy that there’s a male loneliness epidemic, eh?\" @DarickR tweeted, \"Make sure you vote because he’s going to. \" \n\n@carollmieux stated, \"This has been a country where white racist, misogynist men ruled over all. And look at what an \"ungodly\" mess they've made with selfishness & hate. You've had your chance to do right by America's commitment to Justice& men like you failed miserably. It's time for women and good men who are committed to doing right by all, to lead. Threatening others will land you in jail.\" @Godlesswh_re expressed her anger by writing, \"This is infuriating. I can't express my thoughts on this without being suspended.\" \n\n@Caffeinefreak quipped, \"Can’t wait for the MAGA tears when she wins. We’ll see how manly you are then Andy.\" @PortiaMcGonagal tweeted, \"And now, \"Andrew\", you're going to meet the FBI!\" Andrew's words have left many wondering if this is the general temperament of Trump voters. Many couldn't believe that the supposed Republican nominee supporter was calling the United States of America a male-centric nation in the 21st century. Nevertheless, it remains to be seen how the opposing political leaders react to such agitated statements.",
            "summary": "The conversation took place right before former President Donald Trump&#39;s town hall event in Pennsylvania on Sunday, October 20. ",
            "url": "https://www.inquisitr.com/trump-supporter-threatens-kamala-harris-says-shes-gonna-meet-her-maker-soon-i-think-shes",
            "image": "https://dab57h0r8ahff.cloudfront.net/721135/uploads/16b2b660-8fb8-11ef-8a2b-8b704d6cd0a7_1200_630.jpeg",
            "video": null,
            "publish_date": "2024-10-24 20:45:00",
            "author": "INQUISITR,Tavishi",
            "authors": [
                "INQUISITR",
                "Tavishi"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.328
        },
        {
            "id": 260989190,
            "title": "Oil Prices Decline Amid U.S. Elections and Middle East Concerns",
            "text": "Oil prices continued their downward trend, influenced by economic data from the United States and Europe. The upcoming U.S. elections and ongoing conflicts in the Middle East remain significant factors to watch.\n\nOn Thursday, October 24, oil closed lower once again. The Brent crude contracts for December fell by 0.77%, settling at $74.38 per barrel on the Intercontinental Exchange in London.\n\nSimilarly, West Texas Intermediate (WTI) contracts for December dropped by 0.81%, ending at $70.19 per barrel on the New York Mercantile Exchange. At one point during the session, WTI traded below $69 per barrel.\n\nThe decline in oil prices stemmed from increasing market risk aversion. In Europe, business activity in the eurozone stagnated this month, remaining in contraction territory.\n\nThe preliminary Composite Purchasing Managers’ Index (PMI) compiled by S&P Global rose slightly to 49.7 in October, up from 49.6 in September. Analysts had anticipated a more substantial increase to 49.8.\n\nDespite this monthly improvement, the index stayed below the critical mark of 50, indicating a contraction in industrial activity for the second consecutive month. The slower economic growth in Europe heightened concerns regarding energy demand.\n\nOil also served as a “risk thermometer,” reflecting rising investor caution amid speculation about a potential victory for Donald Trump in the upcoming presidential election.\n\nAdditionally, worries about possible disruptions to oil supply due to Middle Eastern conflicts lingered. Analysts at Julius Baer noted that despite these uncertainties, oil prices have remained relatively stable in recent days.\n\nThey highlighted that market anxiety surrounding a direct confrontation between Israel and Iran is “palpable,” yet long-term outlooks appear more tempered.\n\nIn short, the bank has adjusted its forecasts and now predicts oil prices will reach $65 per barrel by the end of 2025.",
            "summary": "Oil prices continued their downward trend, influenced by economic data from the United States and Europe. The upcoming U.S. elections and ongoing conflicts in the Middle East remain significant factors to watch. On Thursday, October 24, oil closed lower once again. The Brent crude contracts for December fell by 0.77%, settling at $74.38 per barrel [&#8230;]",
            "url": "https://www.riotimesonline.com/oil-prices-decline-amid-u-s-elections-and-middle-east-concerns/",
            "image": "https://www.riotimesonline.com/wp-content/uploads/2024/10/1726164643737.webp",
            "video": null,
            "publish_date": "2024-10-24 20:44:02",
            "author": "RT Staff Reporters",
            "authors": [
                "RT Staff Reporters"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "br",
            "sentiment": -0.21
        },
        {
            "id": 260988190,
            "title": "Trump team bullish about 2024 election victory as early votes roll in: ‘Things look pretty good’",
            "text": "Donald Trump’s campaign has expressed cautious optimism about the Republican nominee’s chances of becoming the 47th president, with early voting numbers indicating the former chief executive is on course to defeat Vice President Kamala Harris.\n\nWhile officials have insisted that “anything can happen” and that it is “too early to declare victory,” the initial returns from key states look better for the 78-year-old than both the 2016 and 2020 elections. \n\n“Overall, both nationally and in battleground states, we are seeing strong returns for Republicans so far,” a Trump campaign adviser said on a surrogate call Wednesday.\n\n“From where we’re sitting right now, things look pretty good. Encouraging signs across the board. The voter registration gains in all the partisan registration states have been tremendously in our favor.”\n\nAs of Monday, the number of Republican-registered early voters in the swing states of Arizona, North Carolina, Nevada and Pennsylvania were up double-digits from 2020, the Trump team said.\n\nMeanwhile, the number of returned mail-in ballots are down “quite substantially” from 2020 in Pennsylvania, as well as 79% in Georgia and 25% in Michigan — a possible sign that Democrats, the main practitioners of mail-in voting, are not turning out for Harris the way they did for Joe Biden four years ago. \n\nRepublicans are also seeing “sustained overperformance” in Virginia and Ohio, the Trump adviser said. \n\n“It’s certainly too early to begin declaring victory,” they cautioned, “but it is certainty worth pointing out that our share of the early vote is turning in the right direction.” \n\nThe campaign’s mood has been helped by national polls from the Wall Street Journal and CNBC, both of which show Trump ahead of Harris in the national popular vote — which has not been won by a Republican in 20 years.\n\nDespite the good vibes, Trump has urged his supporters to turn out early and in record numbers so that the election is “too big to rig.”\n\n“President Trump continues to dominate in poll after poll, Republicans have made massive voter registration gains, and we are far outperforming in our share of the early vote relative to two or four years ago across all battleground states,” Trump 2024 national press secretary Karoline Leavitt said in a statement.\n\n“Voters know that Kamala Harris has destroyed our country, but President Trump will fix it — and that is why he is well-positioned for victory on November 5.”\n\nOn the other side, Democrats have expressed visible nervousness about the state of the race, with both former President Barack Obama and Harris campaign manager Jen O’Malley Dillon saying they believe the election will be “tight.”\n\n“We have yet to see the same kinds of energy and turnout in all corners of our neighborhoods and communities as we saw when I was running,” Obama said earlier this month at a “Black Voters for Harris” event in Pittsburgh, alluding to poll numbers suggesting Trump may put up the best performance of any Republican nominee among that demographic in 64 years.\n\nAnother top Harris surrogate, former President Bill Clinton, said Wednesday in Arizona that Harris is “extremely vulnerable, more vulnerable than she deserves to be.”\n\nPrivately, a campaign official suggested to NBC News this week that there are fears “that maybe Michigan or Wisconsin will fall” out of reach for Harris, in a repeat of Trump’s sweep of the so-called “Blue Wall” eight years ago.\n\nSome Democrats also told The Post they were unhappy with Harris opting to spend Friday in deep-red Texas to discuss abortion rather than going to a true battleground.\n\n“They are not thinking ‘Blue Wall’ at all. They are just not thinking,” one party insider said.\n\n“Her press operation is that of a first-time congressional candidate running as a sacrificial lamb.”",
            "summary": "The number of Republican-registered early voters in the swing states of Arizona, North Carolina, Nevada and Pennsylvania are up double-digits from 2020.",
            "url": "https://nypost.com/2024/10/24/us-news/trump-team-bullish-about-2024-election-victory-as-early-votes-roll-in-things-look-pretty-good/",
            "image": "https://nypost.com/wp-content/uploads/sites/2/2024/10/republican-presidential-nominee-former-u-92296374.jpg?quality=75&strip=all&w=1200",
            "video": "https://cdn.jwplayer.com/videos/7w6ouiXn-RyIcpnTz.mp4",
            "publish_date": "2024-10-24 20:41:19",
            "author": "Diana Glebova",
            "authors": [
                "Diana Glebova"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.299
        },
        {
            "id": 260989314,
            "title": "Harris flubs CNN event",
            "text": "Vice President Kamala Harris has struggled to explain her plan for the US at a voter town hall organized by CNN, giving non-answers to easy questions and preferring to attack her rival Donald Trump instead.\n\nDemocrats nominated Harris in July, after pressuring President Joe Biden to drop out of the race. She has since tried to present herself as an agent of change, even though Biden has repeatedly said she was involved in all of the current administration’s policies from day one.\n\n“There was a lot that was done, but there’s more to do. And I’m pointing out things that need to be done that haven’t been done but need to be done,” Harris told CNN’s Anderson Cooper on Wednesday, asked why none of her current policy ideas got implemented since 2021.\n\nIn a post-event panel, Republican pundit and former Trump campaign aide David Urban called it a “word-salad answer.” He also said the GOP would gladly pay for another hour of the town hall just to keep Harris talking.\n\nThe ‘Trump War Room’ campaign account on X eagerly shared excerpts from the town hall, in which Harris missed even the most softball questions. At one point, for example, Cooper asked Harris a leading, “softball” question, suggesting that she has “evolved” on three previously controversial and unpopular positions, to which she was clearly just supposed to say yes. Instead, the Democrat began talking about the intricacies of her plan.\n\nIn another exchange that went viral, Cooper reminded Harris that she called the border wall “stupid, useless, and a medieval vanity project,” yet she voted in favor of spending $650 million to finish building it.\n\n“Well let’s talk about Donald Trump,” Harries replied, cackling. She ended up claiming that she disagreed with how Trump went about building the wall, not the wall as such.\n\n“’Trump bad’ is not a message that will get her elected,” Urban noted later.\n\n“She focused a lot more on Donald Trump, I think it’s fair to say, than she did on the many specifics of what she would do as president,” said another CNN anchor, Jake Tapper.\n\n“If her goal was to close the deal, they’re not sure she did that,” CNN’s Dana Bash, who moderated the Biden-Trump debate in June, said she heard from some Democrats. While the voters may understand better who Harris is, they aren’t sure what she would do, Bash added. “The question about her legislative priorities, name one? There wasn’t one.”\n\nHarris kept coming back around to her past as a prosecutor in San Francisco and the state of California, whether the questions were about immigration or the cost of groceries. She also admitted she would implement price controls, “reform” the US Supreme Court because she disagreed with some of its rulings, and create “parity around what the richest people pay in terms of their taxes,” without explaining what that might actually mean.",
            "summary": "US Vice President Kamala Harris struggled to explain her plan for the US, preferring to attack her rival Donald Trump instead \nRead Full Article at RT.com",
            "url": "https://www.rt.com/news/606395-harris-cnn-campaign-fail/",
            "image": "https://mf.b37mrtl.ru/files/2024.10/article/671a912485f54062797a7864.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:40:30",
            "author": null,
            "language": "en",
            "source_country": "ru",
            "sentiment": -0.124
        },
        {
            "id": 260989036,
            "title": "What the Justice Department could look like under a Kamala Harris presidency",
            "text": "WASHINGTON — Kamala Harris’s team is quietly considering potential nominees for attorney general, looking at who could serve as America’s top federal law enforcement official if she defeats Donald Trump, the federal criminal defendant who sent the Justice Department spiraling into chaos during his presidency and as he tried to overturn his 2020 election loss. Harris, a former prosecutor herself, is known to have a good relationship with Attorney General Merrick Garland, who has overseen the sprawling investigation into the Jan. 6 attack on the U.S. Capitol and appointed special counsel Jack Smith, who brought two criminal cases against Trump. But Garland has already spent more than three-and-a-half grueling years leading the Justice Department and is slowly climbing the list of longest-serving attorneys general in American history. And Harris has said that her potential presidency would not be a continuation of Joe Biden’s administration. There are lots of variables in the air, including the timeline of a theoretical Garland departure at a critical juncture for the department, when many career employees are on edge about what DOJ's future looks like if Trump wins, or falsely declares victory, as he did in 2020. Garland — who oversaw the Justice Department in the wake of its biggest crisis since Watergate, when Trump tried to enlist Justice Department appointees to overturn his election loss — is likely to stay on at least long enough to ensure a smooth transition. Another chief factor is the party makeup of the Senate, which would need to confirm any potential Harris nominee if she takes the White House. Still, a few names have surfaced for the position of 87th attorney general of the United States. Four sources familiar with the Harris campaign’s discussions tell NBC News that there are three main names under consideration: North Carolina Gov. Roy Cooper, who was on Harris' vice presidential short list; former Associate Attorney General Vanita Gupta, who served as the No. 3 official at the Justice Department until earlier this year; and U.S. Attorney for the Southern District of New York Damian Williams. Another name in the mix is Sen. Catherine Cortez Masto, D-Nev., two sources said, although she is less than two years into the six-year term she was elected to in 2022, which would complicate matters given that the Senate is expected to be closely divided in the next session. If Cortez Masto left the Senate to become attorney general, Nevada’s Republican governor would then get to pick the state’s senator through the next general election. Three Harris team officials said that potential names are being floated for attorney general but that discussions are still preliminary because Harris is focused on campaigning and winning the election in 12 days.“The Transition is not doing any personnel selection pre-election and any speculation to the contrary is fiction,” a spokesperson for the Harris transition team told NBC News. “Instead, we are focused on setting up the infrastructure necessary to be ready.” Cooper, who long served as North Carolina’s attorney general, is finishing his second term as the state’s governor and is term-limited from running again this year. Cooper backed out of consideration to be Harris’ vice presidential nominee over the summer, saying the timing was wrong. (Democrats had worried about a state law that might have allowed North Carolina's far-right lieutenant governor to take over in Cooper's absence as he campaigned across the country). The governor had a speaking slot at the Democratic National Convention this summer, where he spoke about Harris’ leadership. Gupta, who won Senate confirmation on a 51-49 vote as associate attorney general in 2021, is a former American Civil Liberties Union lawyer who headed the Justice Department's Civil Rights Division during former President Barack Obama’s second term. Despite her close confirmation vote, Gupta has strong relationships across the aisle, having won praise from many conservatives and law enforcement officials, including the Major Cities Chiefs Association, the International Association of Chiefs of Police and even the National Fraternal Order of Police, which has thrice endorsed Trump, for what the head of the FOP described as her \"open and candid\" working relationship with police organizations. Grover Norquist, the founder and president of Americans for Tax Reform, previously said Gupta was \"strongly qualified, effective, principled, and driven by a desire to seek common purpose and consensus.\" Williams has served as the first Black U.S. Attorney for the Southern District of New York — an office jokingly referred to as the “Sovereign District of New York” due to its size and perceived independence from Justice Department headquarters — since 2021. He was confirmed to the job on a unanimous voice vote in the Senate. Williams has overseen numerous high-profile prosecutions including the conviction of Sen. Bob Menendez, D-N.J., on corruption charges, the ongoing prosecution of Democratic New York City Mayor Eric Adams and cases against prominent figures like Sean \"Diddy\" Combs, cryptocurrency fraudster Sam Bankman-Fried and sex trafficker and Jeffrey Epstein associate Ghislaine Maxwell. Harris’ campaign features numerous Justice Department veterans, including Tony West, her brother-in-law who, like Gupta, served in the No. 3 position at the Justice Department. In the closing days of her campaign, Harris is navigating tricky waters related to DOJ: Having to make a case against Trump to the American people while simultaneously not making any comments that Trump’s defense team might use in a future court filing that might further delay or complicate the DOJ-appointed special counsel's election interference case against him; a case Trump already managed to kick back past the 2024 election. On Tuesday, Harris is scheduled to make her “closing argument” to voters across the country with a speech at the Ellipse, where Trump lied to his supporters about the 2020 election on Jan. 6, 2021, urging them to go to the Capitol and “fight like hell.” Trump regularly downplays the violent attack on the U.S. Capitol and praises the criminal defendants who carried it out, promising to pardon an untold number of them during his first days in office. In a recent filing, Smith’s office said Trump bears responsibility for the Jan. 6 attack, saying the Republican nominee “willfully caused his supporters to obstruct” the certification of Biden’s victory. While many Jan. 6 defendants have told courts they were “duped” by Trump’s lies about the 2020 election and regret that they were gullible enough to fall for them in the first place, Trump has not backed down from the election falsehoods, which his lawyers have maintained were based in good faith and “not unreasonable at the time.” The Harris campaign is preparing for the possibility that Trump once again claims victory regardless of reality, as even some of his allies expect him to do. Trump has been setting the stage, focusing his ire on majority non-white cities in swing states, including Detroit and Philadelphia.",
            "summary": "Kamala Harris’s team is quietly considering potential nominees for attorney general to lead the Justice Department if she beats Donald Trump in the 2024 election.",
            "url": "https://www.nbcnews.com/politics/2024-election/justice-department-attorney-general-nominee-kamala-harris-president-rcna176171",
            "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241018-kamala-harris-ew-410p-6c772a.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:39:49",
            "author": "Monica Alba,Yamiche Alcindor",
            "authors": [
                "Monica Alba",
                "Yamiche Alcindor"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.076
        },
        {
            "id": 260987696,
            "title": "Trump: I’ll fire special counsel ‘within 2 seconds’ if re-elected",
            "text": "In an interview with conservative radio host Hugh Hewitt on Thursday, former President Donald Trump said that he would fire special counsel Jack Smith “within two seconds” of taking office if re-elected in November.\n\nTrump made the comments in response to a question over whether he’d first pardon himself or terminate Smith to remove the legal cloud hanging over him as president. \n\nSmith, who was appointed by Attorney General Merrick Garland in 2022, has repeatedly been targeted by the Republican candidate for charging him with attempting to illegally overturn the 2020 presidential election, which Trump lost.\n\n“It’s so easy. I would fire him within two seconds, he’ll be one of the first things addressed,” claimed the 45th president during the interview, before calling Smith a “crooked person.”\n\nJustice Department takeover\n\nIf Trump is re-elected on 5 November, he could order the Justice Department to remove Smith after being sworn into office in January. However, it wouldn’t be as simple as removing Smith himself. The special counsel is not a presidential appointee and cannot be dismissed by the president alone.\n\nWhen he was investigated by special counsel Robert Mueller during his presidency, Trump urged his then-White House counsel, Don McGahn, to press the Justice Department to terminate Mueller. McGahn refused.\n\nSmith has brought two federal cases against Trump. The first case accused him of illegally retaining classified documents at his Mar-a-Lago estate in Florida. It was dismissed in July, a decision that Smith is appealing.\n\nThe other, more serious case charges him with plotting to overturn the 2020 presidential election. It has been delayed by the conservative-dominated Supreme Court in a 6-3 opinion conferring broad immunity for official acts made while president.\n\nEarlier this month, the Department of Justice, with Smith, filed a 165-page document attempting to circumvent the immunity ruling, claiming it was a “private criminal effort,” as Trump was no longer president during the 6 January riots.\n\nThe final days\n\nAfter Trump said he would fire Smith, Hewitt raised the possibility that Congress could impeach Trump over the move. Trump replied that he did not believe that would happen.\n\n“I don’t think they’ll impeach me if I fire Jack Smith,” Trump said. “Jack Smith is a scoundrel.”\n\nThe former president’s comments come a day after his chief of staff from 2017 to 2019, General John Kelly, described his old boss as a “fascist,” and claimed he had asked for “Hitler’s generals,” comments the Trump campaign denies.\n\nAs the race for the White House enters its final days, both candidates are frantically making pit stops across the handful of swing states that will decide the election. The Harris campaign has recently pivoted from its message of “joy” to making stark warnings about her opponent.\n\n“We know what Donald Trump wants. He wants unchecked power,” Harris said in a speech on Wednesday. “The question in 13 days will be: What do the American people want?”",
            "summary": "Jack Smith, who was appointed in 2022, has charged Trump with multiple offenses concerning his efforts to overturn the result of the 2020 election. ADVERTISEMENT In an interview with conservative radio host Hugh Hewitt on Thursday, former President Donald Trump said that he would fire special counsel Jack Smith &#8220;within two seconds&#8221; of taking office &#8230;\n\n\nThe post Trump: I’ll fire special counsel &#8216;within 2 seconds&#8217; if re-elected appeared first on WorldNewsEra.",
            "url": "https://worldnewsera.com/news/europe/trump-ill-fire-special-counsel-within-2-seconds-if-re-elected/",
            "image": "https://static.euronews.com/articles/stories/08/81/30/80/1200x675_cmsv2_a88f7578-3da0-52df-991e-92d5f38ce8fb-8813080.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:37:04",
            "author": "Evelyn Blackwell",
            "authors": [
                "Evelyn Blackwell"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.447
        },
        {
            "id": 260991926,
            "title": "Rich Get Richer: Elon Musk’s Net Worth Rockets $27 Billion Higher on Strong Tesla Earnings",
            "text": "The world’s richest man just got a lot richer. Elon Musk, thanks to Tesla’s stock price racing higher following a strong earnings report, saw his net worth increase $26.9 billion on Thursday. \n\nThat pushed his net worth to $270.4 billion, according to Forbes’ real-time billionaires tracker. Musk, who runs Tesla, SpaceX and X, now leads Oracle co-founder Larry Ellison, the guy behind him in the rich guy rankings, by $58.2 billion. (Ellison is worth $212.2 billion.) \n\nThe 53-year-old Musk saw his net worth surge on Thursday because Tesla’s stock price jumped 21.9% percent — marking the car company’s biggest single-day stock increase since 2013. Tesla’s stock moved up after the company reported better-than-anticipated Q3 earnings on Wednesday. \n\nEven with the Thursday boost, Musk has been richer at previous points in his life, like in late 2021, when he became the world’s first person worth $300 billion. \n\nTesla’s chief executive has been busy of late, and not just with his electric car company. SpaceX pulled off an unprecedented rocket landing earlier this month by grabbing a descending rocket using “pincer-like arms more familiarly known as chopsticks,” CBS reported. \n\nMusk’s also been busy trying to get his preferred presidential candidate, Donald Trump, back in the White House. \n\nHe publicly endorsed Trump after his first assassination attempt in Butler, Pennsylvania, in July. Since then, he’s posted on X in favor of Trump, hosted a live conversation with him on X Spaces in August, and joined Trump on stage when he returned to Butler earlier this month.\n\nMusk has also put a lot of money into helping Trump beat Democratic nominee Kamala Harris. Musk reported last week he’d donated $75 million to America PAC, his pro-Trump political action committee. America PAC’s website, which includes a picture of Musk in his “dark MAGA” hat, lists a handful of top priorities, including free speech, safe cities and secure borders. \n\nVice President Harris, meanwhile, isn’t hurting for big money donors, either. \n\nHarris has raised more than $1 billion since replacing President Joe Biden as the Democratic nominee in July, and her backers include Netflix co-founder Reed Hastings, former Facebook COO Sheryl Sandberg and LinkedIn co-founder Reid Hoffman.\n\nOn Tuesday, it was reported Bill Gates — who Forbes ranks as the 12th richest man in the world, with a net worth of $105 billion — donated $50 million to help Harris win the election.",
            "summary": "The industrialist is now worth $270.4 billion, boosted by an electric quarter for his car company \n\n\nThe post Rich Get Richer: Elon Musk&#8217;s Net Worth Rockets $27 Billion Higher on Strong Tesla Earnings appeared first on TheWrap.",
            "url": "https://www.thewrap.com/elon-musk-net-worth-higher-26-billion-richest-man-tesla/",
            "image": "https://www.thewrap.com/wp-content/uploads/2024/10/Musk_Trump.png",
            "video": null,
            "publish_date": "2024-10-24 20:35:37",
            "author": "Sean Burch",
            "authors": [
                "Sean Burch"
            ],
            "language": "en",
            "source_country": "US",
            "sentiment": 0.238
        },
        {
            "id": 260990684,
            "title": "Army Secretary Wormuth's Tenure May Soon End. But She Still Has Ideas for Improving Soldiers' Lives.",
            "text": "Army Secretary Christine Wormuth's tenure may be approaching its end, and she is preparing to pass the baton -- and raft of important issues for the service's future -- to her successor.\n\nChief among those issues for her are more stability and predictability in the lives of soldiers, more mobility in their careers and flexibility for spouses to build civilian careers, Wormuth told Military.com in a recent interview.\n\n\"We have to start looking seriously at the question about how we operate as an Army, what kind of lifestyle we offer,\" she said. \"The things that young people want are demonstrably different from what the people at the age of our generals and command sergeants major experienced.\"\n\nRead Next: Expanded Tricare Coverage for IVF Should Be in Compromise Defense Bill, Lawmakers Urge\n\nWormuth, who previously served as the Pentagon's under secretary of defense for policy and made history as the first female Army secretary, was nominated by President Joe Biden and assumed her post in May 2021.\n\nFor now, it's unclear how much longer she'll be in the role. Her days are likely numbered if former President Donald Trump, a Republican, wins the election. On the other hand, if Vice President Kamala Harris clinches the presidency, Wormuth could stay on, take on a new role in the administration or leave public service altogether.\n\nWhen looking to the future -- and potentially a new Army civilian leader -- Wormuth said she believes the service's approach to recruiting needs a fundamental shift away from its old sledgehammer tactics. She envisions a more strategic, nuanced method -- one that positions the Army as a competitive employer, akin to a dynamic tech company actively seeking top talent.\n\nInstead of casting a wide net with generic appeals, Wormuth wants the Army to hone in on specific skill sets, tailoring its outreach efforts to attract a diverse pool of qualified candidates. The service has made some moves toward that mode of thinking, but it will likely take years for it to see the fruits of that labor.\n\nPart of that, Wormuth noted, is that the Army's next wave of leadership needs to look at whether instead of moving to a new duty station every 2-3 years, that model can be shifted to five years.\n\n\"It obviously depends on what happens with the election, to see whether I personally will be able to continue to take that forward and work on real solutions,\" she said. \"But if I have a successor, that person and the [chief of staff of the Army] need to be thinking about this.\"\n\nPart of the rationale for not moving troops around so much is allowing their spouses to more easily build careers. In a report published earlier this year, the Government Accountability Office found that only half of military spouses are employed, a third of whom are part-time workers.\n\nThe report highlighted the difficulties military spouses face in maintaining consistent employment, largely due to the constant upheaval caused by relocations and the unpredictable schedules of service members. Many spouses often find themselves functioning as single parents, juggling grocery shopping, school drop-offs and managing the household alone while their partners are away on duty or dealing with irregular hours.\n\nIn a recent address to the force, Wormuth noted that the service leans far too heavily on \"spouses and partners as a de-facto unpaid Army labor force,\" and that internal service data shows most officers leave the service for more stability and a better family life in the private sector.\n\n\"Spouse employment doesn't improve very much year over year,\" Wormuth said. \"Despite various programs we have, fundamentally, if you're moving every 2-3 years, it's hard to have a job, much less build a career.\"\n\nMeanwhile, the Army is juggling a wide array of missions, from combat operations in the Middle East and Africa to expanding its influence in the Pacific and reinforcing NATO's frontlines in Europe. Most recently, the service deployed 100 soldiers to Israel to bolster air defenses amid growing regional tensions.\n\nThose high demands are taking a heavy toll on the force. Soldiers today are spending more time away from home than they did even during the height of the post-9/11 wars. The constant deployments, intensive training cycles and prolonged separations from their families have created a relentless pressure-cooker environment for many service members, which has also been exacerbating a suicide crisis in the ranks.\n\nCountering that is difficult, Wormuth explained, as the Army ultimately must meet the needs of the current administration's national security strategy. But there are ways to alleviate pressure on the margins, including combatant commanders properly measuring how many troops they need for a given mission. Another solution could be expanding the Army's permanent presence in Poland, which is now only a tiny garrison.\n\n\"We wouldn't be having to move brigades back and forth year after year to do rotation deployments,\" she said, noting there are also the realities of the up-front cost of building a major base. \"Poland has been eager to host for some time now, ... but it's also a question of where would a brigade come from?\"\n\nDuring her tenure, Wormuth has overseen the Army's shift away from two decades of counterinsurgency operations, and its new focus on preparing the force for potential large-scale conflicts -- chief among them China in the Indo-Pacific region. At the same time, the Army has been key in ramping up munitions production to supply Ukraine as it defends against an invasion by Russia.\n\nBut Wormuth has also turned her attention inward, making quality-of-life issues for soldiers and their families a North Star of her tenure.\n\nTwo key accomplishments were nearly doubling the budget for barracks construction and maintenance to $2 billion; shifting funds from the Army's relatively flat budget to pay for replacing the service's sometimes dilapidated living quarters; and policy saying that only a general can deny a soldier's parental leave -- a radical change to the Army status quo.\n\nWormuth's name is commonly floated around as a candidate for defense secretary in a Harris administration. It's incredibly rare for Army secretaries to stay on and not be replaced under new administrations, even among the same political parties. Potential picks for her successor in a possible Harris administration are already being vetted, according to one Democratic source with direct knowledge of the situation.\n\nWormuth has so far brought a rare continuity to the role, serving the second-longest term since the Sept. 11 attacks. Her tenure stands in stark contrast to the position's revolving door nature. The role has often been marked by transient leadership with frequent interim appointments.\n\nJohn McHugh, who served from 2009 to 2015 under President Barack Obama, held the position for a notably long tenure compared to the norm, making him one of the longest-serving secretaries in recent history.\n\n\"We'll see what the American voter decides,\" Wormuth said. \"I just hope that the American public respects whatever the American voter decides and does so without violence.\"\n\nHow the Army's Retiring Top Enlisted Soldier Fought to Make Life Better for Troops by Being Open About Himself",
            "summary": "Army Secretary Christine Wormuth, who previously served as the Pentagon's under secretary of defense for policy and made history as the first female Army secretary, was nominated by President Joe Biden and assumed her post in May 2021.",
            "url": "https://www.military.com/daily-news/2024/10/24/army-secretary-wormuths-tenure-may-soon-end-she-still-has-ideas-improving-soldiers-lives.html",
            "image": "https://images05.military.com/sites/default/files/styles/full/public/2024-10/mil-wormuth-visits-troops-grafenwoehr-1800.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:33:42",
            "author": "Steve Beynon",
            "authors": [
                "Steve Beynon"
            ],
            "language": "en",
            "source_country": "us",
            "sentiment": -0.168
        },
        {
            "id": 260991928,
            "title": "Kamala Harris CNN Town Hall Draws 3.3 Million Viewers, On Par With Trump Fox News Town Hall",
            "text": "You are reading an exclusive WrapPRO article for free. Want to level up your entertainment career? Go here for more information.\n\nKamala Harris’ CNN town hall delivered solid ratings just under two weeks ahead of the 2024 election. \n\nAs Harris sat down with CNN’s Anderson Cooper to discuss the election’s most pressing issues, the town hall scored 3.33 million viewers, according to Nielsen live-plus-same-day figures. The event, which began at 9 p.m. ET and ran for approximately an hour and 11 minutes, also drew in 744,000 viewers in the key cable demo among adults 25-54.\n\nHarris’ town hall ranked as the No. 1 most-watched program on cable among total viewers, and the No. 2 most-watched cable program in the key cable demo, behind only the NBA on ESPN.\n\nThe Harris town hall on CNN was up just slightly compared to Donald Trump’s women’s issues town hall last week, which scored 3.1 million viewers on Fox News, and tripled the 1.04 million viewers who tuned into Harris’ Univision town hall earlier this month.\n\nStill, viewership for the CNN town hall was nearly doubled by Harris’ Fox News interview with Bret Baier on “Special Report With Bret Baier,” which brought in 7.8 million viewers just over a week ago. \n\nThe town hall boosted CNN to become the most-watched cable news network during the time of the event among both total viewers and in the key demo, outpacing Fox News, which scored 3.23 million total viewers and 423,000 demo viewers, as well as MSNBC, which saw a total viewership of 1.33 million and a demo viewership of 155,000.\n\nIn the demo, the CNN Harris town hall scored the biggest audience among adults 25-54 than any other single candidate town hall in 2024, climbing above Trump’s Fox News town halls, which scored 576,000 demo viewers in January, 358,000 demo viewers in February and 440,000 viewers in the demo earlier in October. \n\nAs the town hall streamed live on Max and CNN.com, CNN’s web platform scored nearly half a million total day live starts on Wednesday.",
            "summary": "The Anderson Cooper-moderated event ranked as cable's No. 1 most-watched program\n\n\nThe post Kamala Harris CNN Town Hall Draws 3.3 Million Viewers, On Par With Trump Fox News Town Hall appeared first on TheWrap.",
            "url": "https://www.thewrap.com/kamala-harris-cnn-town-hall-ratings/",
            "image": "https://www.thewrap.com/wp-content/uploads/2024/10/Kamala-Harris-at-CNN-Town-Hall-Agrees-Donald-Trump-Is-a-Fascist.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:33:33",
            "author": "Loree Seitz",
            "authors": [
                "Loree Seitz"
            ],
            "language": "en",
            "source_country": "US",
            "sentiment": -0.085
        },
        {
            "id": 260989464,
            "title": "Trudeau announces immigration restrictions as electoral defeat looms",
            "text": "“We’re going to significantly reduce the number of immigrants coming to Canada for the next two years. This is temporary — to pause our population growth and let our economy catch up,” he announced in a post on X. “We have to get the system working right for all Canadians.”\n\nAt a news conference, Trudeau pitched the change as a temporary “pause” in order to allow logistics to catch up with the growing population, promising further investments in healthcare, housing, and social services.\n\n“Our immigration system has always been responsible and it has always been flexible,” he said. “We are acting today because of the tumultuous times as we emerged from the pandemic, between addressing labor needs and maintaining population growth, we didn’t get the balance quite right.”\n\n“Immigration is essential for Canada’s future, but it must be controlled and it must be sustainable,” Trudeau added.\n\nThe plan, put forward by Immigration Minister Marc Miller, calls for a 20% reduction in permanent residents in 2025, then continue to drop by roughly 4% annually through 2027, Bloomberg reported. From 2024 to 2025, the total planned number of immigrants will be reduced from 500,000 to 395,000.\n\nIn another unprecedented move, the number of non-permanent residents faces its first-ever limit, declining the expected number by hundreds of thousands.\n\nTrudeau adopted some rhetoric previously used by former President Donald Trump in blaming corporations for using immigrants to undercut the wages of native Canadians.\n\n“Far too many corporations have chosen to abuse our temporary measures employed in exploiting foreign workers while refusing to hire Canadians for a fair wage,’’ he said. “While under the watch of provinces, some colleges and universities are bringing in more international students than communities can accommodate, treating them as an expendable means to line their own pockets. That’s unacceptable.”\n\nAmong the new immigration restrictions are measures that place a limit on the percentage of companys’ workers that are foreigners.\n\nCanada has one of the most liberal immigration policies on Earth, with one in five Canadians being born abroad. The ruling Liberal Party has overseen one of the largest migration waves in the country’s history, which it argues is necessary to stay economically competitive in the modern world.\n\nThis argument was undercut by an inability to properly recover after the COVID-19 pandemic. Anger over the economic system and a massive wave of immigration has caused the Liberal Party to plummet in the polls, setting the Conservatives up for a likely victory in late 2025.\n\nThe situation is so dire that Trudeaux is facing calls from many within his own party to not run for a fourth term of office next year.\n\nConservative Party Leader Pierre Poilievre, a prime minister hopeful, accused his rival of destroying the country’s immigration system.\n\n“He has destroyed our immigration system through his own personal incompetence and destroyed 150 years of common sense consensus with the Liberals and Conservatives on that subject,” Poilievre said.\n\n“He cannot fix what he broke on immigration and housing or anything else because he is busy fighting his own caucus,” he added.\n\nCanada has welcomed 3 million new migrants since the COVID-19 pandemic, shooting the population up from 38 million to 41 million people in just a few years. This growth saw housing costs rise, breeding popular discontent.",
            "summary": "Canadian Prime Minister Justin Trudeau announced restrictions on immigration for the coming years, as a major electoral defeat looms large. &#8220;We’re going to significantly reduce the number of immigrants coming to Canada for the next two years. This is temporary — to pause our population growth and let our economy catch up,&#8221; he announced in [&#8230;]",
            "url": "https://www.washingtonexaminer.com/policy/immigration/3202036/trudeau-announces-immigration-restrictions-electoral-defeat-looms/",
            "image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Trudeau-immigration.webp",
            "video": null,
            "publish_date": "2024-10-24 20:28:43",
            "author": "Brady Knox",
            "authors": [
                "Brady Knox"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.352
        },
        {
            "id": 260987482,
            "title": "Trump says he’d fire Jack Smith quickly if he wins another term in office",
            "text": "(CNN) — Donald Trump said Thursday that he would use presidential powers to end Jack Smith’s probe into multiple criminal cases he’s brought against the former president, promising to fire the special counsel who has indicted him on multiple criminal charges.\n\n“Oh, it’s so easy. It’s so easy,” Trump said when asked by conservative radio host Hugh Hewitt whether he would “pardon yourself” or “fire Jack Smith.”\n\n“I would fire him within two seconds,” Trump said.\n\nSmith was appointed as special counsel by Attorney General Merrick Garland to oversee two investigations into Trump regarding his efforts to overturn the results of the 2020 election and his alleged mishandling of classified documents. The classified documents case was ultimately dismissed by a federal judge, but Smith is appealing.\n\nTrump still faces charges in Smith’s election subversion case. After the Supreme Court ruling on presidential immunity, Smith filed a superseding indictment in August that slimmed down the allegations but didn’t drop the four charges that were brought against Trump.\n\nTrump faces charges of conspiracy to defraud the United States, conspiracy to obstruct an official proceeding, obstruction of and attempt to obstruct an official proceeding and conspiracy against rights.\n\nIf the former president were to fire Smith, that would allow the Department of Justice and Trump’s attorney general to drop the charges against him and end the court cases.\n\nTrump, who was convicted earlier this year of 34 felony counts in a separate New York case against him, has repeatedly claimed without evidence that the justice system is being weaponized against him because he’s running for president. But Trump has suggested on multiple occasions he would weaponize the justice system against his political rivals if reelected.\n\nTrump’s comments to Hewitt aren’t the first time he’s suggested he would fire Smith. Trump, who frequently rails against Smith on the campaign trail, told Breitbart last July that he “wouldn’t keep” the special counsel if he were reelected.\n\n“I wouldn’t keep him,” Trump said when asked if he would fire Smith. “Jack Smith? Why would I keep him?”\n\nTrump has routinely on the campaign trail suggested he would weaponize the justice system to go after his political opponents if reelected. The former president has said several times he feels entitled to go after his political opponents because of his own criminal charges and has vowed to appoint a special prosecutor to “go after” President Joe Biden and his family if he wins back the White House.\n\nTrump has also labeled his political opponents “the enemy from within” as he ramps up his rhetoric against his perceived enemies in the final stretch of the campaign. Trump has called Democratic Reps. Adam Schiff and Nancy Pelosi “the enemy from within” and has claimed they pose a greater threat than foreign adversaries.\n\nTrump has gone so far as to suggest using the military to handle “the enemy from within” on Election Day, saying that he isn’t worried about chaos from his supporters or foreign actors, but instead from “radical-left lunatics.” Vice President Kamala Harris has highlighted Trump’s comments on the campaign trail as she argues he is “unstable,” “unhinged” and out for “unchecked power.”\n\nThe-CNN-Wire™ & © 2024 Cable News Network, Inc., a Time Warner Company. All rights reserved.",
            "summary": "(CNN) — Donald Trump said Thursday that he would use presidential powers to end Jack Smith’s probe into multiple criminal cases he’s brought against the...",
            "url": "https://wsvn.com/news/politics/trump-says-hed-fire-jack-smith-quickly-if-he-wins-another-term-in-office/",
            "image": "https://wsvn.com/wp-content/uploads/sites/2/2024/10/102424-Trump-at-Turning-Point-PAC.jpg?quality=60&strip=color",
            "video": "https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/74ab6595-05d1-41c7-9cb4-45f40ab366e0/8690857f-34b7-4ade-95cf-fa5f148b7725/main.mp4?fastly_token=NjcxYjA2ODdfM2Y0YmZhZDBkNTZhNTkxNmUyZmNhMmNhODQ4NjFhMzhhN",
            "publish_date": "2024-10-24 20:28:26",
            "author": "Kevin Boulandier",
            "authors": [
                "Kevin Boulandier"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.304
        },
        {
            "id": 260988632,
            "title": "Stacey Williams and the Latest Installment of the Donald Trump–Jeffrey Epstein Story",
            "text": "“It became very clear then,” Williams told the paper, “that he and Donald were really, really good friends and spent a lot of time together.” At the time, Epstein was a New York social fixture but not yet a figure of international notoriety; Trump was a real estate developer and tabloid mainstay. Williams was in her mid-20s.\nA few months later, Williams said, she and Epstein were on a walk, and he suggested that they visit Trump Tower. Moments after arriving, she claimed, she experienced what she took to be a “twisted game” between the two men.\nAccording to Williams, Trump began groping her just after greeting her. She said he put his hands “all over my breasts” as well as her waist and butt. She said she froze because she was “deeply confused,” but that she believed she saw Epstein and Trump smiling at each other.\n“These accusations, made by a former activist for Barack Obama and announced on a Harris campaign call two weeks before the election, are unequivocally false,” Karoline Leavitt, press secretary for the Trump campaign, told The Guardian. “It’s obvious this fake story was contrived by the Harris campaign.”\nWilliams had previously recounted details of the allegation on social media and during a Zoom call on Monday organized by a group called Survivors for Kamala. After the alleged incident, she said on the call, “Jeffrey and I left and he didn’t look at me or speak to me and I felt this seething rage around me, and when we got down to the sidewalk, he looked at me and just berated me, and said: ‘Why did you let him do that?’”\nThe allegation comes just weeks before the presidential election, and a few years after Epstein’s death in a federal prison while awaiting trial on sex trafficking charges. Trump was then approaching the end of his presidential term, and the outcry over Epstein’s crimes—as well as those of his associate Ghislaine Maxwell—prompted a fresh round of inquiry into the long-running ties between the two men. In one of his most infamous remarks, Trump told New York in 2002 that he had known Epstein, a “terrific guy,” for 15 years.\n“He’s a lot of fun to be with,” Trump said. “It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.”\nThe relationship traces back, as with so many of Epstein’s connections, to Maxwell. Her father, the British media mogul Robert Maxwell, hosted Trump on his yacht, the Lady Ghislaine, when he was attempting to buy the New York Post in 1989 and make the corresponding social inroads. Ghislaine became friendly with Trump’s first wife, Ivana, according to former Epstein business associate Steven Hoffenberg. (Rumors of Trump’s affair with Marla Maples began circulating in 1990, and he and Ivana divorced in 1992.) Maxwell and Epstein began dating in the ‘90s, and Hoffenberg said Trump was especially fond of her.\nBy 1992, Trump and Epstein were inviting one another to parties in New York and Palm Beach. That year, 28 young women flew to Mar-a-Lago for a calendar-girl contest organized by a Florida businessman named George Houraney. Trump and Epstein were the only two men on the guest list, Houraney said in a 2019 interview with The New York Times.\n“Look, Donald, I know Jeff really well,” Houraney recalled himself telling Trump in the interview with the Times. “I can’t have him going after younger girls.” He said Trump brushed him off.\nThe two men fell out at some point in the aughts, for reasons that remain to some degree unclear. They had a dispute over a Palm Beach mansion in 2004, a few years before Epstein signed a non-prosecution agreement related to soliciting a child for sex. In 2015, Trump called Epstein’s private island an “absolute cesspool” and encouraged reporters to ask Prince Andrew about it.\nAfter Epstein was arrested in 2019, Trump sat in the Oval Office as he told reporters that he “knew him, like everybody in Palm Beach knew him.”\n“I haven’t spoken to him in 15 years,” Trump said. “I was not a fan of his, that I can tell you.” He declined to expand on the reason for their relationship ending, saying it didn’t “make any difference.”\nEpstein-Trump scrutiny has largely subsided in recent years amid the overall deluge of Trump scandal and following the criminal conviction of Maxwell, Epstein’s best-known associate. But the two men left a long trail behind them and one that, with Williams’s allegation surfacing ahead of a potential second presidential term for Trump, is perhaps still unfolding. “In those days, if you didn’t know Trump and you didn’t know Epstein,” former Harvard Law School professor Alan Dershowitz, who has represented both men, told the Times in 2019, “you were a nobody.”",
            "summary": "The former president and late financier built a long-running relationship in New York and Palm Beach. A former model has now accused Trump of groping her in 1993 in what she described as a “twisted game” between the duo.",
            "url": "https://www.vanityfair.com/news/story/stacey-williams-and-the-donald-trump-jeffrey-epstein-story",
            "image": "https://media.vanityfair.com/photos/64ef758158af7af179617791/16:9/w_1392,h_783,c_limit/vf823-epstein-trump.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:19:35",
            "author": "Dan Adler",
            "authors": [
                "Dan Adler"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": -0.098
        },
        {
            "id": 260990850,
            "title": "Trump: I’ll fire special counsel 'within 2 seconds' if re-elected",
            "text": "In an interview with conservative radio host Hugh Hewitt on Thursday, former President Donald Trump said that he would fire special counsel Jack Smith \"within two seconds\" of taking office if re-elected in November.Trump made the comments in response to a question over whether he'd first pardon himself or terminate Smith to remove the legal cloud hanging over him as president. Smith, who was appointed by Attorney General Merrick Garland in 2022, has repeatedly been targeted by the Republican candidate for charging him with attempting to illegally overturn the 2020 presidential election, which Trump lost.\"It's so easy. I would fire him within two seconds, he'll be one of the first things addressed,\" claimed the 45th president during the interview, before calling Smith a \"crooked person.\"Justice Department takeoverIf Trump is re-elected on 5 November, he could order the Justice Department to remove Smith after being sworn into office in January. However, it wouldn’t be as simple as removing Smith himself. The special counsel is not a presidential appointee and cannot be dismissed by the president alone.When he was investigated by special counsel Robert Mueller during his presidency, Trump urged his then-White House counsel, Don McGahn, to press the Justice Department to terminate Mueller. McGahn refused.Smith has brought two federal cases against Trump. The first case accused him of illegally retaining classified documents at his Mar-a-Lago estate in Florida. It was dismissed in July, a decision that Smith is appealing.The other, more serious case charges him with plotting to overturn the 2020 presidential election. It has been delayed by the conservative-dominated Supreme Court in a 6-3 opinion conferring broad immunity for official acts made while president.Earlier this month, the Department of Justice, with Smith, filed a 165-page document attempting to circumvent the immunity ruling, claiming it was a “private criminal effort,” as Trump was no longer president during the 6 January riots.The final daysAfter Trump said he would fire Smith, Hewitt raised the possibility that Congress could impeach Trump over the move. Trump replied that he did not believe that would happen.\"I don't think they'll impeach me if I fire Jack Smith,\" Trump said. \"Jack Smith is a scoundrel.\"The former president’s comments come a day after his chief of staff from 2017 to 2019, General John Kelly, described his old boss as a “fascist,” and claimed he had asked for “Hitler’s generals,” comments the Trump campaign denies.As the race for the White House enters its final days, both candidates are frantically making pit stops across the handful of swing states that will decide the election. The Harris campaign has recently pivoted from its message of “joy” to making stark warnings about her opponent.“We know what Donald Trump wants. He wants unchecked power,” Harris said in a speech on Wednesday. “The question in 13 days will be: What do the American people want?”",
            "summary": "Trump: I’ll fire special counsel 'within 2 seconds' if re-elected",
            "url": "https://www.euronews.com/2024/10/24/trump-ill-fire-special-counsel-within-2-seconds-if-re-elected",
            "image": "https://static.euronews.com/articles/stories/08/81/30/80/1440x810_cmsv2_a88f7578-3da0-52df-991e-92d5f38ce8fb-8813080.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:17:52",
            "author": "Gregory Holyoke",
            "authors": [
                "Gregory Holyoke"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "fr",
            "sentiment": -0.422
        },
        {
            "id": 260986460,
            "title": "The Apprentice: Stephen Nolan gives brutally honest review of Donald Trump movie",
            "text": "Stephen Nolan has given fans his verdict on the new film charting the rise of Donald Trump - and it certainly isn't glowing.\n\nThe BBC' presenter took to X on Thursday evening as he left a local cinema and pulled no punches as he shared his thoughts on The Apprentice movie.\n\nThe film tells the story of Mr Trump’s career as a property businessman in the 1970s and 1980s with actor Sebastian Stan playing the former US president.\n\nREAD MORE: Stephen Nolan thanks NHS as mum returns home from hospital\n\nREAD MORE: Stephen Nolan in top five highest paid BBC presenters as earnings published\n\nThe Nolan Show host took to X on Thursday evening as he left a local cinema pulled no punches as he shared his thoughts on The Apprentice movie.\n\nHe wrote: \"Just out of the cinema after that awful Trump movie . Apologies to anybody sitting beside me for my snoring during the movie, but it was total keek.\"\n\nThe Apprentice has attracted controversy as it was released on October 11th in the US, before the country goes to the polls in November, where Mr Trump will bid for a second term as president, against current vice-president Kamala Harris.\n\nMeanwhile speaking to the PA news agency, Romanian-born American actor, Stan, said it will take “two years to get over” playing Trump in The Apprentice. He likened playing a real-life character to being in a relationship and said learning their “tics” was “like learning an instrument”.\n\nStan told PA: “It’s so technical, and when you’re trying to play a real person, you want to get their tics, their mannerisms, their way of speaking, and it’s not natural. You just have to kind of practise it like you’re learning an instrument every day more and more, and then eventually you can do it in your sleep.\n\n“I kind of liken it to a relationship (losing a character’s mannerisms) – when you break up with somebody, they say, ‘how long have you been in the relationship?’ And you’re like, ‘two years’, and they’re like, ‘it’s going to take two years to get over it’.”\n\nIt comes after the 41-year-old told British GQ he had found it difficult to lose Mr Trump’s mannerisms when reprising his role as Bucky Barnes in a new Marvel film titled Thunderbolts, set for release in May next year.\n\nHe told the magazine: “I went off to Marvel after (The Apprentice) and we were doing scenes, and I would do something, a thing or two, and be like, f***, this is still living somewhere.”\n\nFor all the latest news, visit the Belfast Live homepage here and sign up to our politics newsletter here.",
            "summary": "The BBC' presenter took to X on Thursday evening as he left a local cinema and pulled no punches as he shared his thoughts on The Apprentice movie.",
            "url": "https://www.belfastlive.co.uk/news/belfast-news/apprentice-stephen-nolan-gives-brutally-30225422",
            "image": "https://i2-prod.belfastlive.co.uk/incoming/article14896904.ece/ALTERNATES/s1200/nolan-1.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:14:36",
            "author": "belfastlive.co.uk",
            "authors": [
                "belfastlive.co.uk"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "gb",
            "sentiment": -0.211
        },
        {
            "id": 260986626,
            "title": "LA Times Editorials Editor Quits After Paper’s Owner Blocks Harris Endorsement",
            "text": "The editor for the Los Angeles Times editorial section resigned on Wednesday after the newspaper’s owner reportedly stopped its editorial board from endorsing Vice President Kamala Harris for president.\n\nEditorials editor Mariel Garza told the Columbia Journalism Review’s Sewell Chan in an interview that she quit because the newspaper was remaining silent on the presidential race.\n\n“I am resigning because I want to make it clear that I am not OK with us being silent,” Garza told Chan. “In dangerous times, honest people need to stand up. This is how I’m standing up.”\n\nL.A. Times owner Patrick Soon-Shiong said the editorial board was asked to provide a factual analysis of Vice President Kamala Harris’s and former President Donald Trump’s positive and negative policies and their effects during their time in office.\n\n“Instead of adopting this path as suggested, the Editorial Board chose to remain silent and I accepted their decision.”\n\nGarza told the Columbia Journalism Review that the board had planned to endorse Harris and that she had drafted an outline of the editorial, which was rejected.\n\nThe paper’s list of endorsements included candidates for the U.S. House and Senate, state Legislature, state attorney general, Los Angeles County Superior Court, Los Angeles Unified School District, Community College District, and Los Angeles City Council, along with endorsements for a number of propositions and measures.\n\nIn her resignation letter addressed to L.A. Times editor Terry Tang, Garza wrote, “I’m standing up by stepping down.”\n\nShe said that the “non-endorsement undermines the integrity of the editorial board and every single endorsement we make, down to school board races.”\n\nAccording to the Columbia Journalism Review, Soon-Shiong informed the editorial board on Oct. 11 that the paper would not be making a presidential endorsement this year.\n\nSoon-Shiong purchased the newspaper in 2018.\n\nThe Trump campaign said the L.A. Times’ decision is a “humiliating blow for the Harris–Walz” campaign, after the state’s largest newspaper previously endorsed Harris during the 2014 race for California attorney general and in 2016 for U.S. Senate.\n\nIn 2010, the newspaper listed both candidates for state attorney general—Democratic candidate Kamala Harris and Republic candidate Steve Cooley—on its endorsements page.\n\nThe Epoch Times reached out to Garza, Soon-Shiong, and the L.A. Times for comment but received no replies by publication time.",
            "summary": "Mariel Garza said she's ‘standing up by stepping down’ after L.A. Times' owner asked the editorial board for nonpartisan analysis of the presidential nominees.",
            "url": "https://www.theepochtimes.com/us/la-times-editorials-editor-quits-after-papers-owner-blocks-harris-endorsement-5747269",
            "image": "https://img.theepochtimes.com/assets/uploads/2024/01/23/id5572511-GettyImages-1935923064-300x180.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:13:23",
            "author": "Kimberly Hayek",
            "authors": [
                "Kimberly Hayek"
            ],
            "language": "en",
            "source_country": "us",
            "sentiment": -0.342
        },
        {
            "id": 260987014,
            "title": "Beyoncé joining Harris in Texas as campaign ramps up endorsements",
            "text": "Beyoncé joining Harris in Texas as campaign ramps up endorsements\n Vice President Kamala Harris is joining former President Barack Obama in Georgia and will be joined by Beyoncé in Texas as endorsements for her campaign continue to emerge. This comes as comments linking former President Donald Trump to fascism reverberate before the election. CBS News' Nidia Cavazos has more.",
            "summary": "Vice President Kamala Harris is joining former President Barack Obama in Georgia and will be joined by Beyoncé in Texas as endorsements for her campaign continue to emerge. This comes as comments linking former President Donald Trump to fascism reverberate before the election. CBS News' Nidia Cavazos has more.",
            "url": "https://www.cbsnews.com/video/beyonc-joining-harris-in-texas-as-campaign-ramps-up-endorsements/",
            "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/24/3198355c-fe51-4a23-8267-ce1a4eef4d04/thumbnail/1200x630/66fc102bc5e0bc8c0878fea53b4c0276/cbsn-fusion-beyonc-joining-harris-in-texas-as-campaign-ramps-up-endorsements-thumbnail.jpg?v=385d1369b2f0aca0a059",
            "video": null,
            "publish_date": "2024-10-24 20:12:00",
            "author": null,
            "language": "en",
            "source_country": "US",
            "sentiment": -0.4
        },
        {
            "id": 260986728,
            "title": "Fox News edited Trump interview days after former president slammed Harris over ‘60 Minutes’ sit down",
            "text": "Fox News edited Donald Trump’s sit-down chat with voters at a Bronx barbershop - days after Trump condemned 60 Minutes for doing the same with Vice President Kamala Harris’s interview.\n\nOn Monday, the network ran a roughly 15-minute edition of its barbershop interview series featuring the former president. Lawrence Jones, co-host of Fox and Friends, has been traveling around the country speaking with voters at barbershops.\n\nAt a Bronx barbershop, Trump sat with a group of locals and answered their questions about taxes, immigration, education, energy and more. The former president gave vague but on-topic answers making promises for a wealthier country with lower taxes for all, healthier food and less crime.\n\nBut raw footage from the event, posted on Instagram by an attendee, depicts Trump as he appears at rallies – giving long-winded, rambling answers that often veer off topic and are peppered with bits of misinformation.\n\nA spokesperson for Fox News said, “Every one of Fox & Friends barbershop segments are pre-taped and edited. The Bronx edition ran for nearly an hour and was cut for time and clarity.”\n\nIn the raw footage, Trump exaggerated the number of immigrants in Springfield, Ohio and falsely claimed the Democratic Republic of the Congo is sending prisoners into the United States. He also baselessly said New York City Mayor Eric Adams was unfairly indicted by Democrats because he criticized migrants coming into New York.\n\nAll of that was omitted from the broadcast. \n\nAnswers were also cut to appear more concise. While answering a question about eliminating federal taxes, the Fox News segment excluded a long tangent Trump went on that was featured in the raw footage. The Independent has asked the Trump campaign for comment.\n\nPre-taped segments for broadcast are often edited and cut to fit in the allotted time slot when it airs.\n\nBut the recent development, first reported by CNN, is ironic given Trump has condemned 60 Minutes for editing its interview with Harris to similarly fit in a time slot.\n\nIn rallies, he’s told supporters CBS should have its license revoked for editing Harris’s interview – something he baselessly suggested was a crime. \n\nCBS said in a statement that Trump’s accusation the network “deceitfully” edited the interview was “false”. They clarified that an excerpt of the interview was cut and given to Face the Nation but that the full version of the cut was in the broadcast.\n\n“When we edit any interview, whether a politician, an athlete, or movie star, we strive to be clear, accurate and on point. The portion of her answer on 60 Minutes was more succinct, which allows time for other subjects in a wide ranging 21-minute-long segment,” CBS said.",
            "summary": "Trump has called for CBS to have its broadcasting license revoked for editing it’s interview with Harris",
            "url": "https://www.independent.co.uk/news/world/americas/fox-news-trump-barbershop-edited-b2635203.html",
            "image": "https://static.independent.co.uk/2024/10/24/20/newFile-3.jpg?width=1200",
            "video": null,
            "publish_date": "2024-10-24 20:11:36",
            "author": "Ariana Baio",
            "authors": [
                "Ariana Baio"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "gb",
            "sentiment": -0.025
        },
        {
            "id": 260986624,
            "title": "Trump to Appear With Tucker Carlson in Arizona Just Days Before Election",
            "text": "Former President Donald Trump is scheduled to appear with former Fox News host Tucker Carlson in Arizona on Oct. 31.\n\nAll proceeds from the event will go toward hurricane relief.\n\nThe event was announced hours before Carlson took the stage at a Turning Point Action rally in Duluth, Georgia, to rally support for Trump.\n\nCarlson noted that Trump has faced various investigations, indictments, political attacks, and assassination attempts since joining the political sphere.\n\n“And he’s going to win anyway!” he told the crowd before Trump took the stage.\n\nCarlson has been a staunch supporter of the 45th president, joining him at sporting events and sitting in the VIP box at the Republican National Convention in Milwaukee in July. He is also close with Trump’s running mate, Sen. JD Vance (R-Ohio).\n\n“When he stood up after being shot in the face, bloodied, and put his hand up, I thought, at that moment, that was a transformation. This was no longer a man,” Carlson said in July.\n\n“I think it was divine intervention. But the effect that it had on Donald Trump [was that] he was no longer just a political party’s nominee, or a former president, or a future president. This was the leader of a nation. And I think there’s a difference.”\n\nArizona, a battleground state, is expected to play a vital role in determining the next president. Trump’s appearance there will allow him to make a final pitch for why he is the right candidate for the job.\n\nVice President Kamala Harris, the Democratic nominee, has been making her final rounds in the swing states with the help of high-profile supporters such as Oprah Winfrey and former Presidents Barack Obama and Bill Clinton. Bruce Springsteen is slated to perform at a rally featuring Harris and Obama in Atlanta on Oct. 24.\n\nOn Oct. 29, the Democrat will make her closing argument for why she should occupy the Oval Office with a speech on Washington’s Ellipse—the same spot where Trump delivered his remarks on Jan. 6, 2021.",
            "summary": "The former president will be able to make a final appeal to voters in a key swing state.",
            "url": "https://www.theepochtimes.com/us/trump-to-appear-with-tucker-carlson-in-arizona-just-days-before-election-5746496",
            "image": "https://img.theepochtimes.com/assets/uploads/2024/01/19/id5569482-Trump-and-Tucker-Carlson-300x180.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:08:16",
            "author": "Jackson Richman,Samantha Flom",
            "authors": [
                "Jackson Richman",
                "Samantha Flom"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "us",
            "sentiment": -0.363
        },
        {
            "id": 260985454,
            "title": "Billboard’s Greatest Pop Stars of the 21st Century: No. 7 — Kanye West",
            "text": "With the first quarter of the 21st century coming to a close, Billboard is spending the next few months counting down our staff picks for the 25 greatest pop stars of the last 25 years. You can see the stars who have made our list so far here, and now we remember the century in Kanye West — whose career has featured near-unparalleled runs of artistic brilliance and pop cultural centrality, but whose legacy has grown more complicated by the year over the last decade. \n\n It’s funny now to think of a time when confusion over Kanye West’s first name was a common issue. Like NBA star Dwyane Wade (who, like West, also went pro in 2003-04), a lot of people who hadn’t seen or heard his name before – an Ethiopian-French name meaning “only one” – mentally jumbled the placement of the “y,” leading to a lot of first-time misspellings and mispronunciations when bracing it for the first time. The Netflix documentary jeen-yuhs includes an early-’00s scene of an unknowing receptionist referring to Kanye as “Cayenne,” and West himself even bemoaned the then-still-common cognition error in his 2005 hit “Diamonds From Sierra Leone”: “Now all I need is y’all to pronounce my name/ It’s Kanye, but some of my plaques, they still say ‘Kayne.’” \n\n Flash forward to two decades later, and it’s damn near impossible to imagine a single person on the planet who doesn’t know Kanye’s name. For a solid 20 years now, the monocultural figure has been in headlines on a weekly basis – sometimes daily, sometimes hourly – for just about every reason an artist can be. He’s been attached to stories about every kind of commercial and critical achievement: chart-topping singles and albums, best-of year-end and decade-end list placements, award wins and losses – even ones that weren’t his own. He’s also been at the center of celebrity weddings, billion-dollar business dealings, friendships and feuds with plenty of the other most famous people of the 21st century; one sitting U.S. president publicly thanked him for his “very cool” service, another called him a jackass. \n\n And he’s also dominated the news for things no one should ever want to be known for – for ignorant comments and for allegations of terrible behavior, and for ensuing backlash that pushed him to the fringes of an industry he once lorded over from the absolute center. But even in 2024 – and even after he legally changed his name to the less scrambleable “Ye” – you can still never go too long without hearing the name Kanye. That’s how inextricable Mr. West was to American life in the first two decades of this century, that’s how brilliant his music and artistry were for the great majority of that period, that’s how blinding his sheer star power was throughout, and that’s how unshakeable he ultimately still remains in the culture today. \n\n But before Kanye was the Kanye that the whole world would know, he began the 21st century as a Chi-town college dropout still trying to make his name as a producer. In the late ‘90s, he’d gotten beats on albums by hitmakers like Jermaine Dupri, Foxy Brown and Goodie Mob, but in 2000 that he would land the placement that would jumpstart the next phase of his career: “This Can’t Be Life,” from Jay-Z’s The Dynasty: Roc La Familia. The beat exemplified Kanye’s signature early-career production style: a classic soul sample, pitched up to the heavens, laid over the knocking snare from Dr. Dre’s “Xxplosive.” The song wasn’t a single, but it was a highlight from Jay’s third straight No. 1 album, getting him in the good graces of the rapper (and his Roc-a-Fella label) who was about to become the most powerful in hip-hop.\n\n That takeover kicked off in earnest on 2001’s The Blueprint, Jay-Z’s career-defining masterpiece, on which Kanye placed five beats (including, appropriately, Jay’s beef track “Takeover”). The most important song on the set for the producer was “Izzo (H.O.V.A.),” a Jackson 5-lifting pop-rap singalong which gave the rapper his first Hot 100 top 10 hit as a lead artist, and gave the producer his first Hot 100 hit, period. From there, the floodgates opened for Kanye, and by the end of 2002, he’d scored Hot 100 hits with Scarface, Trina and Talib Kweli – as well as second Jay smash “03 Bonnie & Clyde,” this time with a newly solo Beyoncé riding shotgun – making him a rising star in a golden age of superproducers. \n\n But Kanye wasn’t satisfied with superproducerdom, since he’d long harbored aspirations of being an MC as well. While by 2002, hip-hop producers grabbing the mic had become relatively common – Kanye’s production heroes Dr. Dre and Q-Tip had both found stardom doing so in the ‘90s, while Pharrell’s falsetto was becoming as ubiquitous in 2000s top 40 as his beats – Kanye found difficulty convincing labels to take him seriously as a rapper, partly because his middle-class image and rhymes largely conflicted with the street rap ruling radio at the time. Eventually, Roc-a-Fella signed him — in large part to keep his beatmaking talents in-house — but even they weren’t totally convinced yet. \n\n His debut single would quickly validate their decision. While Kanye had been garnering notice with mixtapes like Get Well Soon and I’m Good, as well as for additional hit beats for Alicia Keys (“You Don’t Know My Name”) and Ludacris (“Stand Up,” his first Hot 100 No. 1 as a producer), “Through the Wire” was the song that brought Kanye to national renown. Inspired by a near-fatal 2002 car accident – he rapped the song (over a chipmunked sample from Chaka Khan’s ‘80s R&B hit “Through the Fire”) while his jaw was still wired shut, hence the title – “Wire” introduced Kanye as a clever, compelling and culturally omnivorous underdog, winning listeners over with both its triumphant message and its well-placed references to everything from Vanilla Sky to Making the Band. Helped by an MTV-conquering living-collage music video, the song reached No. 15 on the Hot 100, establishing Kanye’s two-way bonafides and building massive buzz for his debut album. \n\n The College Dropout, released in Feb. 2004, lived up to the hype. Drawing rapturous reviews and debuting at No. 2 on the Billboard 200 with 441,000 in first-week sales, the album spawned three more huge hits in “All Falls Down,” “Jesus Walks” and “Slow Jamz” (his first Hot 100 No. 1 as a recording artist, though the song was originally featured on fellow Chicago rapper Twista’s Kamikaze album with Kanye as a featured artist). The album made Kanye a cultural phenomenon and media darling, as his pink polos, popped collars and unique combination of arrogance and insecurity (“We all self-conscious, I’m just the first to admit it,” he boasted on “Falls”) made him an irresistible presence, and his oft-uplifting storytelling drew stark contrast with the crime tales and caddishness of the previous year’s breakout rapper, 50 Cent. (50 would later theorize that his own ubiquity directly led to Kanye’s subsequent success.) \n\n In particular, “Jesus Walks” took Kanye into the center of public discourse for his grappling with his faith in a way that was extremely rare (and risky) for pop music at the time. The song only reached No. 11 on the Hot 100, lower than “Falls” and “Jamz,” but made its way to a lot of new fans outside of mainstream hip-hop, and drew the most critical acclaim of any of Dropout’s singles. “Jesus” nominated for two awards at the 2005 Grammys, where Ye’s attendance was a source of much discussion in the lead-up – since he’d previously crashed the stage at the 2004 American Music Awards to protest country hitmaker Gretchen Wilson beating him for best new artist. The awards outburst – certainly not the last of its kind for Ye – drew some backlash and ratcheted up Grammy night tension, which turned out to be for naught when he won best rap album for Dropout. “Everybody wanted to know what I would do if I didn’t win,” Kanye offered in his still-oft-referenced acceptance speech. “I guess we’ll never know.”\n\n As successful as Kanye’s debut was, his sophomore album would prove it was just the beginning. Late Registration debuted at No. 1 in Aug. 2005 with nearly two times the first-week number of Dropout, and its second single – the Jamie Foxx-featuring “Gold Digger,” a comedic and absurdly catchy tribute to (and warning about) get-rich-quick female social climbers – became Kanye’s first No. 1 as a lead artist, and an immediate pop classic. The album’s expanded sonic palette, aided by co-producer (and regular Fiona Apple collaborator) Jon Brion, proved Ye was no one-trick wonder as a beatsmith, while songs like “Hey Mama” and “Heard ‘Em Say” plumbed new depths of personal and political subject matter lyrically. The latter side of Ye would also come into full focus that year on a televised benefit for those hit hardest by Hurricane Katrina, where his frustration over the then-President’s slow response in providing aid to the less-well-off victims of the incident boiled over into his second unforgettable quote of 2005: “George Bush doesn’t care about Black people.” \n\n Kanye would spend much of 2006 touring – taking a brief pause for another stage-crashing incident at the ‘06 MTV EMAs, where he greeted news of his “Touch the Sky” losing best video to Justice vs. Simien’s “We Are Your Friends” with a loud “Oh, HELL no!” – and drawing inspiration for his next studio album, 2007’s “stadium status”-aspiring Graduation. Though the set was scheduled a week after rival 50 Cent’s Curtis album was due, Kanye later moved it up to the same day, starting a much-hyped sales battle that 50 would raise the stakes of by swearing he’d retire if he lost. Graduation ultimately soared past Curtis, selling 957,000 (still Kanye’s best first-week number) to Curtis’ 691,000, confirming Ye – who by then had also embraced electronic influences (particularly via Daft Punk-sampling lead single “Stronger,” another Hot 100 No. 1) and high fashion – as hip-hop’s present and future. Once again earning rave reviews, Graduation made Kanye 3-for-3, and very arguably the biggest artist in the world. (50 declined to retire as promised, but his career was never the same again.)\n\n While Kanye was on top of the word artistically and commercially, he was about to hit a personal low. In late 2007, his mother Donda passed, and the next year, he broke off his engagement with long-time girlfriend Alexis Phifer – with both events inspiring the decidedly downbeat tone of his next album, 2008’s 808s and Heartbreak. Though Kanye had rarely sung on his records before, 808s mostly featured his Auto-Tuned warbling – with rapping kept to a minimum – of heart-on-sleeve lyrics over icy, synth-driven beats that felt a world away from the chipmunk soul he’d made his name on. The album became his third straight No. 1 and spawned a pair of top five Hot 100 hits in “Love Lockdown” and “Heartless,” but for the first time in his career, critics and fans were mixed on the new set. Time would largely prove Ye simply ahead of the curve, however, as the combination of chilly nu-wave sonics and hip-hop/R&B hybridized vocals (largely inspired by Kid Cudi, a signee to Ye’s GOOD Music imprint) ended up being profoundly influential on leading 2010s hitmakers like Travis Scott, Childish Gambino and Drake. \n\n Though 808s wasn’t the unqualified success of Kanye’s first three albums, he was still one of pop music’s leading artists at the time of the 2009 MTV Video Music Awards. That night would quickly prove infamous for Ye, as the megastar – seen with a bottle of Hennessy on the red carpet – would grab the mic during Taylor Swift’s best female video acceptance speech to claim that the award should have gone to fellow nominee Beyoncé instead. Though Ye’s stage-crashing antics were well-known by that point, none of them had ever occurred on this widely watched an event, or with co-stars as well known as Swift or Beyoncé – or during the social media era, as the then-rising app Twitter gave everyone watching the opportunity to express their disbelief and/or disapproval in unison. Kanye had received blowback for plenty of moments in his career to this point, but never backlash on this level; the public response was so immediate and so loud that he pulled out of his planned Fame Kills tour alongside Lady Gaga and essentially went into hiding in Hawaii for the rest of the year. \n\n The experience ended up leading to Kanye’s next album, 2010’s My Beautiful Dark Twisted Fantasy. Recorded in a free-flowing Hawaii studio setup with a rotating cast of high-profile collaborators, Fantasy featured Ye really leaning into playing the anti-hero (if not the outright villain) for the first time on cinematic hits like “Power,” “Monster” and “All of the Lights,” with newly growling, grimy, ‘70s rock-influenced production. He did still make room for contrition, however, particularly on the spellbinding album centerpiece “Runaway,” which he unveiled with an instantly iconic performance at – where else? – the 2010 VMAs. The album debuted at No. 1 with nearly 500,000 in first-week sales, and drew Ye’s most ecstatic reviews yet: Leading critical voice Pitchfork, which a decade earlier had been an indie rock-rooted publication that might not have even reviewed a rap blockbuster like Fantasy, gave the set its first 10.0 score for a new album since 2002 – a sign not only of Ye’s now-unanimous acclaim, but of how he’d helped shift the entire critical discourse over the course of his career. \n\n For the next couple years, Ye was unquestionably back, and as entrenched in the mainstream as ever. In 2011, he teamed up with longtime collaborator, label head and big brother Jay-Z for the gaudy Watch the Throne, a purposeful exercise in hip-hop opulence and excess that nonetheless contained several classic moments: “N—as in Paris,” in particular, with its imminently quotable lyrics and earthquaking dubstep drop, proved a culture-moving moment, particularly when the duo started playing it double-digit times in a row on tour. The next year, his Cruel Summer quasi-compilation collected songs from then-rising GOOD Music artists like Big Sean, Teyana Taylor and newly solo Clipse rapper Pusha T – but the best and biggest songs were all headlined by Kanye, including the hit singles “Mercy” and “Clique.” Meanwhile, Ye had started to date reality TV superstar and budding entrepreneur Kim Kardashian, increasing his Q rating and pushing him to new corners of pop culture, as he also began premiering his “DW by Kanye West” lines of women’s clothing during Paris Fashion Week.\n\n By summer 2013, it had been nearly three years since the last new Kanye solo album – the longest layover of his career to that point – and rumors of a dark and difficult set had long buzzed around hip-hop blogs and fan communities, many of which by this point (particularly the Kanye to The forum) were tracking Kanye’s happenings with singular diligence and worship. The rumors were true: after a ninth-inning edit job by legendary “reducer” Rick Rubin, Yeezus debuted as Ye’s most-abrasive and least-commercial set, equally influenced by 2010s Chicago drill rap and 1980s Chicago acid house, with largely aggressive, hedonistic lyrics that seemed to occasionally border on outright nihilism. Yeezus made Fantasy sound like “Through the Wire,” and not all listeners were down with the darkness – but the set generally drew song reviews and fan response, and became his sixth straight album to debut at No. 1. \n\n Beginning with Yeezus, though, West’s output generally trended away from playing the pop crossover game. Just a couple years earlier, he had picked up his fourth Hot 100 No. 1 by appearing on the single version of top 40 megastar Katy Perry’s “E.T.”; such pop appearances would quickly be unthinkable for the post-Yeezus Kanye, who began reserving his guest appearances almost exclusively for fellow rappers and occasional R&B stars. Music videos also became rarer, as did award show performances and media interviews – and Yeezus notably contained no pre-release singles, though “Bound 2” eventually became a No. 12 hit following the release of its Kim Kardashian-co-starring, easily parodied music video. \n\n In fact, West’s primary engagement with pop music and pop culture in the mid-’10s came through his continued back-and-forth with Swift – who, a half-decade after their initial VMAs conflict, was still linked to West in ways neither of them could really shake, with the latter apologizing for the incident but then later seemingly retracting his apology. At the 2015 VMAs, the two appeared to bury the hatchet, as Swift introduced West as the recipient of the Michael Jackson Video Vanguard Award, with her speech even making joking reference to the ‘09 incident. But in early 2016, Kanye released “Famous,” which included the lyric “I feel like me and Taylor might still have sex/ Why?/ I made that b–ch famous,” seemingly resetting the dormant beef in an instant. Swift appeared to respond to the song when accepting the album of the year Grammy just days later, warning the young women watching of “the people along the way who try to… take credit for your accomplishments and your fame.” (A video for the song, released months later, would further the acrimony by picturing a nude wax sculpture of Swift, along with similar sculptures of Ye and many other celebrities, sleeping together in a giant bed.) \n\n “Famous” appeared on The Life of Pablo, Kanye’s first album since Yeezus, released in Feb. 2016 after several false starts and renamings. The album was less difficult than its predecessor, but far messier – particularly because West was still tinkering with the album by the time it was released as an exclusive on the new streaming service Tidal, of which he was a co-owner. Months into the album’s release, he was still reworking songs and fiddling with the tracklist – which, depending on who you asked, either made a profound statement on the permanent malleability of the album format in the streaming era or simply displayed Kanye’s increasing lack of artistic self-assuredness. Regardless, the set was mostly received well, giving Ye yet another No. 1 and spawning fan favorites like the two-part “Father Stretch My Hands,” the Kendrick Lamar teamup “No More Parties in LA” and the gospel-influenced, Chance the Rapper-spotlighting opener “Ultralight Beam.” \n\n More notable than the actual music on Pablo might have been the event that premiered it: a live listening party at New York’s Madison Square Garden, the largest scale such an event had been conceived on to that point. In truth it was far larger than even a simple arena gig, because thanks to livestreaming, it also became a communal event on social media, with secondhand excitement over the quasi-live show extended to the album itself. The Pablo era was further helped by the successful and acclaimed Saint Pablo Tour that followed, and the soon-omnipresent merch from it that – along with his increasingly successful Adidas partnership – officially turned Kanye into a lifestyle brand. Perhaps best of all for Ye, Snapchat video released online by Kim Kardashian – then his wife, as the couple were married in 2014 – seemed to show Swift giving him her pre-release approval for the controversial “Famous” lyric, which flipped public sentiment back against the pop megastar and towards Kanye. He was just a couple months away from ending 2016 on a high note to rival any in his career to that point. \n\n It was not to be that simple. West’s year was shaken first by wife Kardashian’s robbery at gunpoint in Paris that October, forcing him to cancel multiple Pablo dates. Then, after Donald Trump was elected president in November, Kanye expressed onstage that he didn’t vote in the election, but would have supported Trump if he had – kicking off a run of erratic on-stage behavior that also included his ranting about Beyoncé’s alleged politicking at the 2016 VMAs and how Jay-Z never called him after Kardashian’s robbery. He eventually pulled the plug on the rest of the tour, and was hospitalized that Thanksgiving for temporary psychosis – after which he had a controversial summit at Trump Tower with the then-president to discuss “multicultural issues,” much to the horror of many of his peers, including longtime collaborator John Legend. It was a brutal end to a once-triumphant year. \n\n The rest of the decade was a rocky period for Kanye. He released two more albums, 2018’s introspective, seven-track Ye – part of a five-album “Wymoning Sessions” series all produced by Kanye, which also included his Kids See Ghosts teamup with longtime collaborator Kid Cudi – and 2019’s gospel-themed Jesus Is King, and again topped the Billboard 200 with both. But both sets drew mixed reviews, and as became increasingly the case with Kanye post-Pablo, got more attention for their bumpy releases and listening party premiere events than for most of the music actually contained therein. Meanwhile, he made further public appearances in support of then-President Trump, began to speak out against abortion and the Black Lives Matter movement, and most infamously, said to TMZ about Black slavery that “when you hear about slavery for 400 years … for 400 years? That sounds like a choice” – comments that earned swift, massive backlash from both fans and the media. (Later that year, he apologized for “how that slave comment made people feel.”) Even the Taylor Swift feud flipped back on Kanye, as 2020 saw the leak of a longer version of the infamous “Famous” approval conversation between the two stars, seemingly adding more context and validity to Swift’s claims that she never gave full approval to the “b–ch” lyric. \n\n Still, no matter how severe the fallout from any of his controversies, at the turn of the 2020s Kanye still clearly held the public’s interest whenever he released an album, or debuted a new shoe line, or held a high-profile concert – or engaged in a high-profile beef, as he did with 2010s rap kingpin Drake in the lead-up to his 2021 album Donda. After Ye held what was essentially a promotional residency at Atlanta’s Mercedes-Benz Stadium, literally living in the stadium between promotional events as he attempted to finalize the set, the 27-track collection was belatedly released in June, and again entered at No. 1, with 309,000 units moved, the highest mark of the year to that point. The occasionally inspired but wildly overstuffed album had its supporters, and earned an album of the year Grammy nomination – but as Drake’s Certified Lover Boy album was released the next week to an even bigger first-week bow, and then the two rappers made up months later for the Free Larry Hoover concert, it was hard not to feel like the entire era was more sound than fury.\n\n The next year would bring about new lows for Kanye, as Oct. 22 kicked off with him wearing an inflammatory “WHITE LIVES MATTER” t-shirt at a Yeezy SZN Paris fashion show, then making a post to Instagram calling Black Lives Matter “a scam.” Later in the month, West had his accounts locked on both Instagram and Twitter for comments perceived as anti-semitic, particularly a tweet that threatened to go “death con 3 on JEWISH PEOPLE.” The rapper’s rhetoric continued, and eventually his business partners began to sever ties with him – including his CAA agency, his UMG parent label, and even his Adidas shoe partners, about whom Kanye had recently boasted, “I can say anti-semitic things and Adidas can’t drop me.” (In Dec. 2023, Kanye would apologize for his comments in an Instagram statement: “I sincerely apologize to the Jewish community for any unintended outburst caused by my words or actions.”)\n\n And yet, even with seemingly all of his industry backing lost, Kanye remains majorly impactful in present day. His Instagram apology was followed in early 2024 with the independent release of his Ty Dolla $ign teamup Vultures 1 – again, after plenty of false starts, delays and listening-event hype, and again, with a No. 1 debut on the Billboard 200. This time, the set was also able to do something no Kanye album had done since before Yeezus: spawn a major, long-lasting Hot 100 hit, with the soccer-chanting, No. 1-peaking “Carnival,” also featuring Playboi Carti and Rich the Kid. The song carried some of the red-eyed, goblin-mode spark of Ye’s best early-2010s work – though in calling back to some of those songs rather explicitly (including a mid-song sample of Fantasy’s “Hell of a Life”), it missed both the ingenuity and the shock of the new that made them so special. \n\n When you tell the story of Kanye West’s career, you realize how few of the larger narratives about 21st century popular music could be related without him. The mixtape hip-hop era of the early 2000s, rap’s mainstream takeover in the mid-’00s and the blog era in the late deacde, the EDM breakthrough and pop star megaboom of the turn of the 2010s, the complete reinvention of music consumption throughout the social media and streaming ages of the ‘10s, the event-ification of pop music in the late ‘10s, and the outsized role of identity politics and post-#MeToo questions of cancelation (or at least accountability) within the industry that have hung over all of entertainment for the past eight years… Nearly every important sonic, cultural or technological trend in the last 25 years of popular music has been touched by Kanye, and none of these chapters of pop history could be written without extensive mention of him. Sometimes on the first page. Sometimes in the first sentence.\n\n It’s impossible to deny Kanye’s impact, or his greatness. But it’s equally impossible to deny the impact that his hurtful comments and bad behavior (allegations of which have continued in 2024) have had on his overall legacy. He’s hardly the only one: Rock, rap and even pop history are all full of critical figures whose problematic conduct threatens to overshadow or at least taint their seismic contributions to the genre. How much it impacts our own personal enjoyment or listening habits when it comes to their music – either going forward or looking back – is something every fan must figure out for themselves. But clearly, even with Kanye’s recent chart comeback, he’s been ostracized from too many corners of pop music and pop culture to ever be as central to either as he was at his near-decade-and-a-half peak – and now, for many, even memories from that peak have been regrettably shaded to the point where they will never quite feel the same again. \n\n Still, it’s a testament to just how singular that peak run was, and how impactful it was on popular music and culture – in countless ways we can still feel the reverberations of today, and others we might not properly understand for decades yet to come – that so many still bother with Kanye at all. Perhaps no other artist since Prince has better matched the Purple One’s combination of mold-breaking creativity with record-breaking commercial success, of studio perfectionism and prolificity with spellbinding performance abilities and iconic visuals, of cultural innovation and technological wizardry with personal artistry and deep soulfulness. And like Prince, he can change his name to whatever he wants, but the world will still never, ever forget the name Kanye. \n\n Read more about the Greatest Pop Stars of the 21st Century here — and be sure to check back Tuesday as we reveal our No. 6 artist!\n\n THE LIST SO FAR: \n\n Honorable Mentions\n\n 25. Katy Perry24. Ed Sheeran23. Bad Bunny22. One Direction21. Lil Wayne20. Bruno Mars19. BTS18. The Weeknd17. Shakira16. Jay-Z15. Miley Cyrus14. Justin Timberlake13. Nicki Minaj12. Eminem11. Usher10. Adele9. Ariana Grande8. Justin Bieber",
            "summary": "Ye has been responsible for some of the greatest highs of this century in popular music, and for some lows that most artists would never be able to recover from.",
            "url": "https://www.billboard.com/music/pop/kanye-west-greatest-pop-stars-21st-century-1235810642/",
            "image": "https://www.billboard.com/wp-content/uploads/2024/10/7-greatest-pop-star-kanye-west-2024-billboard-1548.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:07:51",
            "author": "Andrew Unterberger",
            "authors": [
                "Andrew Unterberger"
            ],
            "language": "en",
            "source_country": "US",
            "sentiment": 0.302
        },
        {
            "id": 260987920,
            "title": "When it comes to climate, Labor is keeping an eye on Washington before it looks to Paris",
            "text": "If Donald Trump wins the US presidency on November 5, his victory will have profound implications for other countries on many fronts. Not least of them will be climate change policy.\n\nPerhaps the uncertainty now hanging over US politics was on the mind of Climate Change and Energy Minister Chris Bowen, who shillyshallied this week over when he'll announce Australia's 2035 emissions reduction target under the Paris climate agreement. \n\nBowen refused to be pinned down at the Australian Financial Review's energy and climate summit on whether the target would be public before next year's election. Neither his office nor that of the prime minister would be more specific later.\n\nAustralia, like other countries, is required under the Paris agreement to put forward its target in February. But, also like other countries, Australia is focused on what's happening in the US.\n\nTrump wants to take the US out of the Paris agreement for the second time. The first exit took effect immediately after his 2020 defeat and incoming President Joe Biden was able to reverse it at once. This time, there'd be no such quick turnaround.\n\nThe Biden administration has been strongly committed on climate issues. If the US exited, the Paris agreement would likely be transformed.\n\nThere may be other reasons Bowen is being cagey about the 2035 target. Climate change and energy will be harder issues for Labor in this election, as it struggles with the realities of the transition, than in the 2022 one.\n\nIn the run-up to that election, a desperate Scott Morrison pulled out all stops to win support within the Coalition to sign up to the 2050 net-zero emissions target.\n\nLabor was on the front foot, with a policy for a 43 per cent reduction in emissions (on 2005 levels) by 2030, underpinned by a target of 82 per cent renewable electricity by then. The election promise for consumers was a $275 cut in household power bills by 2025.\n\nCrafting a policy is often easier than implementing it. The journey to a clean energy economy is arduous.\n\nThe $275 promise was quickly seen as unrealisable. The government has had to provide rebates to keep prices in check. The rollout of renewables is complicated by local resistance to some projects, including wind farms and transmission lines. At present, more than 40 per cent of electricity comes from renewables.\n\nThe cost-of-living crisis has increasingly dominated everything. Climate change remains a significant issue with people, but over time it tends to go up and down their scale of concerns, depending on changing circumstances.\n\nThe Ipsos Climate Change Report, done annually, found in 2024 \"strong notional support for the energy transition\", but low understanding of what progress had been made.\n\n\"Concerns about the negative impacts of the transition on cost of living and energy reliability have increased, particularly in the current high-inflation environment,\" it said. \n\n\"The perceived economic benefits of the transition are less clear, with many unsure about the impact on jobs and the broader economy.\n\n\"The emphasis on cost of living is influencing priorities for the energy transition, with Australians wanting to see energy prices and reliability prioritised. There is a growing sentiment that Australia should only take action if other countries are also contributing fairly to climate change efforts.\"\n\nOf course a summer of bad bushfires can change people's priorities suddenly. Barring that, Labor is looking at a 2025 election in which it will be more on the defensive than the offensive on climate and energy issues.\n\nThe opposition has already acted to sharpen the difference with Labor over the medium term targets. Peter Dutton will have no 2035 target before the election, and has questioned the 2030 target to which Australia is signed up, although he says a Coalition government would not leave the Paris agreement. He is also running hard on his controversial policy for nuclear energy.\n\nWhile Bowen is not clarifying whether he'll announce the government's target ahead of the election, it would be awkward for Australia not to meet the February deadline.\n\nThere would not be a penalty, but it would be a bad look, especially given we are vying with Turkey to host, together with Pacific countries, COP31 in 2026. One unknown, incidentally, is whether a Coalition government would continue this bid, which the opposition has described as a \"vanity project\".\n\nIf the government does announce the 2035 target before the election, the big question is how ambitious it will make it.\n\nBowen will receive advice on this from the Climate Change Authority, to which the government has appointed, as head, former New South Wales Liberal treasurer Matt Kean.\n\nIn an earlier discussion paper, the authority said the evidence suggested, \"A 2035 target in the range of 65-75 per cent […] could be achievable and sustainable if additional action is taken by governments, business, investors and households […]. However, attempting to go much faster could risk significant levels of economic and social disruption and put progress at risk.\"\n\nA bold target would make the government more vulnerable, just when Labor would want the attention on the Coalition’s problematic nuclear policy. On the other hand, if the target were modest, that would be exploited by the Greens.\n\nNext month, Bowen will attend COP29 in Azerbaijan, where the central issue will be a financial goal, replacing the 2015 goal, for developed and major economies to help fund developing countries’ emission reduction efforts. Bowen, with Egyptian Environment Minister Yasmine Fouad, is leading the consultations on this, and so has a significant role at the conference.\n\nAt the COP meeting, Bowen will get a better idea of where other countries are on their expected 2035 targets. He indicated this week he has already started taking soundings. “Obviously […] of course you think about international context.”\n\nBy the time of COP, which runs November 11-22, America will have chosen its next president. The COP meeting will either be business-as-usual, looking to an incoming Kamala Harris presidency, or trying to anticipate the implications of a Trump administration that could be a major disruptor of international climate policy.\n\nMichelle Grattan is a professorial fellow at the University of Canberra and chief political correspondent at The Conversation, where this article first appeared.",
            "summary": "If Donald Trump wins the US presidency on November 5, his victory will have profound implications for other countries on many fronts. Not least of them will be climate change policy.",
            "url": "https://www.abc.net.au/news/2024-10-25/trump-making-albanese-cagey-on-climate/104515024",
            "image": "https://live-production.wcms.abc-cdn.net.au/607a3b3deb736a09783ac6aa7adc4a94?impolicy=wcms_crop_resize&cropH=844&cropW=1500&xPos=0&yPos=32&width=862&height=485",
            "video": null,
            "publish_date": "2024-10-24 20:04:25",
            "author": "Michelle Grattan",
            "authors": [
                "Michelle Grattan"
            ],
            "language": "en",
            "source_country": "AU",
            "sentiment": 0.092
        },
        {
            "id": 260987686,
            "title": "NYU family weekend: Will there be anyone for Barron Trump?",
            "text": "The New York University is hosting its alumni and family weekend from Thursday to Sunday at Washington Square Park. The event is open to freshman students who enrolled in NYU's Stern School of Business, the Gallatin School, Steinhardt Schools and the Tisch School of Arts. Barron Trump is the latest addition to the long list of celebrity kids attending NYU. The family weekend is likely to become a star-studded affair but it is highly unlikely that Barron Trump's parents will be attending the event. Barron was seen attending the college in heavy security as Secret Service officers were always there with him. With only two weeks left for the election, Donald Trump's schedule is jam-packed. Barron's mother Melania too is busy promoting her memoir, Melania. She was not seen much at Donald Trump's campaigning either. Barron Trump has not moved to the NYU campus for staying as his house is not far from Trump Tower in Manhattan where Barron Trump spent much of his childhood and lived before he moved to the White House with his parents where he stayed until 2019. Barron is the only Trump kid who ditched the University of Pennsylvania and opted for NYU's Stern Business School. There was a lot of speculation over his choice of college as it coincided with his father's second bid for the White House.During this election campaign, Donald Trump spoke extensively about Barron, how tall he is, how good a student he is, how he advised Trump on which podcasts to go to for an interview etc. He even spoke about Barron Trump's love life and said he does not think Barron ever has any girlfriend yet. Barron attended one Trump rally where he got a standing ovation. Melania's book too has a lot on Barron -- making him the star of the family this election season. Donald Trump and Melania attended Barron Trump's high school graduation at Oxbridge Academy in West Palm Beach.",
            "summary": "New York University is hosting its alumni and family weekend at Washington Square Park, where the family members of the freshman students are likely to turn up. As many celebrity kids attend NYU, the event is likely to become a star-studded affair but it is highly unlikely that Barron Trump's parents will attend the event and Trump is busy in election preparation and Melania with her book events.",
            "url": "https://timesofindia.indiatimes.com/world/us/nyu-family-weekend-will-there-be-anyone-for-barron-trump/articleshow/114559613.cms",
            "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114559629/114559629.jpg",
            "video": null,
            "publish_date": "2024-10-24 20:03:30",
            "author": "Toi World Desk",
            "authors": [
                "Toi World Desk"
            ],
            "language": "en",
            "category": "politics",
            "source_country": "in",
            "sentiment": 0.099
        },
        {
            "id": 260987010,
            "title": "Trump to Arizona, Nevada as immigration remains top issue for voters",
            "text": "Trump to Arizona, Nevada as immigration remains top issue for voters\n Former President Donald Trump is hoping voter concerns about immigration will gain him enough support to win battleground states Nevada and Arizona. CBS News' Camilo Montoya-Galvez has more.",
            "summary": "Former President Donald Trump is hoping voter concerns about immigration will gain him enough support to win battleground states Nevada and Arizona. CBS News' Camilo Montoya-Galvez has more.",
            "url": "https://www.cbsnews.com/video/trump-to-arizona-nevada-as-immigration-remains-top-issue-for-voters/",
            "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/24/7a389fe0-d7b2-4fc0-9aea-8b531ea50662/thumbnail/1200x630/e627c089fa6ced98a6f733f193f1a210/cbsn-fusion-trump-to-arizona-nevada-as-immigration-remains-top-issue-for-voters-thumbnail.jpg?v=385d1369b2f0aca0a",
            "video": null,
            "publish_date": "2024-10-24 20:02:00",
            "author": null,
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": 0.302
        },
        {
            "id": 260987010,
            "title": "Trump to Arizona, Nevada as immigration remains top issue for voters",
            "text": "Trump to Arizona, Nevada as immigration remains top issue for voters\n Former President Donald Trump is hoping voter concerns about immigration will gain him enough support to win battleground states Nevada and Arizona. CBS News' Camilo Montoya-Galvez has more.",
            "summary": "Former President Donald Trump is hoping voter concerns about immigration will gain him enough support to win battleground states Nevada and Arizona. CBS News' Camilo Montoya-Galvez has more.",
            "url": "https://www.cbsnews.com/video/trump-to-arizona-nevada-as-immigration-remains-top-issue-for-voters/",
            "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/24/7a389fe0-d7b2-4fc0-9aea-8b531ea50662/thumbnail/1200x630/e627c089fa6ced98a6f733f193f1a210/cbsn-fusion-trump-to-arizona-nevada-as-immigration-remains-top-issue-for-voters-thumbnail.jpg?v=385d1369b2f0aca0a",
            "video": null,
            "publish_date": "2024-10-24 20:02:00",
            "author": null,
            "language": "en",
            "category": "politics",
            "source_country": "US",
            "sentiment": 0.302
        }
    ]
}