{"offset":0,"number":50,"available":9794,"news":[{"id":377380886,"title":"“Get that clown off my football screen”: NFL fans react to Donald Trump calling Lions vs. Commanders game","text":"President of the United States Donald Trump attended the Detroit Lions vs. Washington Commanders game on Sunday. Trump had a busy day watching these two teams play a rematch from the 2024 divisional round. At some point, Trump called the game on Fox. The decision turned a lot of heads and fans shared their opinions on social media. Some joked about the surprise of listening to the sitting president calling the game. \"why do we need a commentary from trump about the similarities of football strategy and combat,\" one fan asked. sam ◡̈ @samonedoyle13LINKwhy do we need a commentary from donald trump about the similarities of football strategy and combat\"donald trump calling the commanders game was not on my bingo card,\" another fan said. Lukas @LukasIsHere__LINKdonald trump calling the commanders game was not on my bingo card\"We got Donald Trump calling a touchdown live from the booth before GTA 6,\" another fan said. Luke @lukedupont02LINKWe got Donald Trump calling a touchdown live from the booth before GTA 6Other comments were more hostile, demanding that Fox remove Trump from the booth.\"I did not sign up to hear Donald Trump commentate a NFL game,\" one fan said.\"Hey Fox / NFL RedZone please mute Donald Trump I don't want to listen to him for f**k's sake,\" another fan said. \"get that clown the f**k off my football screen,\" another fan said. Trump became the first sitting president since 1978 to attempt a regular-season NFL game. There were boos from some spectators when Trump was shown on the videoboard. He read an oath for members of the military as part of the \"Salute to Service\" festivities.Lions wide receiver Amon-Ra St. Brown starred in a fun moment when he scored a touchdown to extend the Lions' lead to 13-3.The Lions star pointed at Trump's suite in Northwest Stadium before doing Trump's viral dance.Donald Trump wants Commanders' new stadium named after himOn Saturday, ESPN reported Trump's desire to have the Washington Commanders' new stadium named after him.\"That would be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible,\" White House press secretary Karoline Leavitt told ESPN on Friday.However, the decision won't depend on the team. The District of Columbia Council, which will lease the stadium to the team, and the National Park Service, which manages the federal government land on the old RFK Stadium (where the new stadium is being built), will have the final say on the name.\"The team doesn't have the authority. They can't name the stadium ... on their own,\" the source said. \"The city would be involved in that decision, and the Park Service would be involved.\"","summary":"President of the United States Donald Trump attended the Detroit Lions vs. Washington Commanders game on Sunday.","url":"https://www.sportskeeda.com/nfl/news-get-clown-football-screen-nfl-fans-react-donald-trump-calling-lions-vs-commanders-game","image":"https://staticg.sportskeeda.com/editor/2025/11/27548092-1762731673.jpeg","video":null,"publish_date":"2025-11-10 01:13:02","author":"Orlando Silva","authors":["Orlando Silva"],"language":"en","category":"politics","source_country":"in","sentiment":0.229},{"id":377378868,"title":"US shutdown may be nearing end as senators support funding deal","text":"The record-breaking US government shutdown is nearing an end after a group of moderate Senate Democrats agreed to support a deal to reopen the government and fund some departments and agencies for the next year, people familiar with the talks said.\nUnder the agreement, Congress would pass full-year funding for the departments of Agriculture, Veterans Affairs and Congress itself, while funding other agencies through January 30. The bill would provide pay for furloughed government workers, resume withheld federal payments to states and localities and recall agency employees who were laid off during the shutdown.\nThe chamber is set to hold a procedural test vote on Sunday. If that vote succeeds, the Senate will need the consent of all members to end the shutdown, now in its 40th day, quickly. Any one senator can force days of delay and votes. The House would then need to pass the bill for the government to reopen and Speaker Mike Johnson has said he will give lawmakers two days notice to return.\n“It looks like we’re getting closer to the shutdown ending,” President Donald Trump told reporters Sunday evening as he returned to the White House.\nHouse passage is not guaranteed. Democratic leaders have spoken out against any deal that doesn’t include extending expiring Obamacare subsidies, which this bill does not do. Conservative Republican members want a bill that would fund the entire government until next September 30.","summary":"The record-breaking US government shutdown is nearing an end after a group of moderate Senate Democrats agreed to support a deal to reopen the government and fund some departments and agencies for the next year, people familiar with the talks said.\nUnder the agreement, Congress would pass full-year funding for the departments of Agriculture, Veterans Affairs and Congress itself, while funding other agencies through January 30. The bill would provide pay for furloughed government workers, resume...","url":"https://www.scmp.com/news/world/united-states-canada/article/3332129/us-shutdown-may-be-nearing-end-senators-support-funding-deal","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/10/76b6acb4-896d-42b2-910a-9eae4b266f2b_0dcb11b1.jpg","video":null,"publish_date":"2025-11-10 01:07:13","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"cn","sentiment":-0.427},{"id":377379572,"title":"The Papers:  'BBC bosses quit in disgrace' and 'Tears of the crown'","text":"The resignations of BBC director general Tim Davie and his head of news Deborah Turness dominate Monday's papers. \"BBC bosses quit in disgrace\" is the Daily Mail's headline. The broadcaster has been under fire over a Panorama documentary that was accused of misleadingly editing a speech by Donald Trump to make it look like he was urging people to attack the US Capitol. The paper quotes Davie's statement saying \"mistakes have been made and as director general I have to take ultimate responsibility\".","summary":"The resignations of BBC director general Tim Davie and his head of news Deborah Turness dominate Monday's papers.","url":"https://www.bbc.com/news/articles/cyv82ngegdzo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/1acb/live/c35243f0-bdc9-11f0-8456-eff94716b162.jpg","video":null,"publish_date":"2025-11-10 01:03:02","author":null,"language":"en","source_country":"gb","sentiment":-0.346},{"id":377380654,"title":"Donal Trump makes BIG statement, calls people ‘Fools’ who are…","text":"Washington: Amid the ongoing tariff row United States President Donald Trump on Sunday again backed the tariff policy stating that those who are opposing it are ‘fools’. He claimed that the tariffs imposed by his administration have made the country “the richest most respected country in the world with almost no inflation.”","summary":"Donald Trump claimed the United States is taking in trillions of dollars from his tariffs policy.","url":"https://www.india.com/news/world/donal-trump-makes-big-statement-people-that-are-against-tariffs-are-fools-world-news-united-states-tariff-update-8175179/","image":"https://static.india.com/wp-content/uploads/2025/11/trump-6.png","video":null,"publish_date":"2025-11-10 01:02:53","author":"Joy Pillai","authors":["Joy Pillai"],"language":"en","source_country":"in","sentiment":0.026},{"id":377377504,"title":"Deal to END government shutdown breaks major hurdle as Democrats join GOP rivals to reach agreement","text":"The longest shutdown in US history could be finally be coming to an end after Democrats joined Republican rivals to strike a temporary deal to end the chaos.\n\nA breakthrough deal for the 40-day government impasse was being hammered out by lawmakers locked in tense negotiations during a rare session on Sunday in an effort to find a solution. \n\nThe shutdown has left 42 million Americans with no access to their SNAP benefits, forced airlines to cancel thousands of flights and left more than a million federal workers without an income. \n\nBut now there is light at the end of the tunnel after insiders confirmed to CNN and Axios Republicans had secured enough Democrat votes to introduce a stopgap measure which would allow government funding to resume until late January.\n\nThe measure must still be formally voted on in the Senate before returning to the House and eventually to President Donald Trump's desk for his signature. The vote is expected to take place between 8.30pm and 9pm ET.\n\nTrump weighed in on the latest development when he returned to the White House on Sunday, telling reporters: 'It looks like we're getting close to the shutdown ending.'\n\n'We'll never agree to give any substantial money, or any money, to illegals that come into this country, and I think the Democrats understand that.' \n\nThe deal reportedly includes a clause guaranteeing federal emploees who were fired during the shutdown would have their jobs reinstated, as well as an assurance that such measures would not take place in the future.\n\nIt also reportedly ensures food stamp funding through the end of the 2026 fiscal year. \n\nDemocrats had previously voted 14 times against Republican continuing resolutions to reopen the government while negotiations were ongoing.\n\nParty leaders had up until this point refused to work with the GOP to reopen government unless they agreed to an extension of subsidies for health plans offered under the Affordable Care Act. \n\nDespite holding a majority in Congress, Republicans only have 53 seats in the Senate, falling short of the 60 votes needed to pass a funding bill.\n\nBoth parties have been uneasy about the shutdown's escalating consequences. They are eager to get the government running again before the situation worsens. \n\nConcerns range from delayed flights and unpaid federal workers to economic strain and suspension of food assistance for vulnerable families.\n\nThe crisis reached boiling point last week as 42 million Americans who rely on Supplemental Nutrition Assistance Program (SNAP) benefits were informed the money had run dry due to the shutdown for the first time in history.\n\nAlready, upwards of 730,000 government employees are working without pay and a further 600,000 have been furloughed as a result of the crisis.\n\nThen, Transportation Secretary Sean Duffy warned that staffing shortages as a result of the shutdown are worsening, potentially reducing air travel to a trickle right in time for the holiday season. \n\nOn Sunday alone, more than 2,000 flights were canceled into, out of, or within the United States and a further 7,000 delayed.\n\nThe travel chaos will only get worse as airlines are mandated to gradually reduce their schedules further over the next week. \n\nBut not all Democrats are on board with the decision to work with Republicans to end the shutdown. \n\nSenate Minority Leader Chuck Schumer emerged from a closed door meeting on Sunday evening after news broke that Republicans had secured the numbers they needed.\n\n'I'm voting no,' he said, adding that everyday Americans 'need healthcare.'\n\nSenator Elissa Slotkin said: 'I always said, like, it's got to do something concrete on health care, and it's hard to see how that happened.'\n\nAnd Senator Bernie Sanders warned it 'would be a policy and political disaster' to cave to the Republican demands after such a resounding win during state elections last week. \n\n'My own thought is that it would be a horrific mistake to cave in to Trump right now,' he said.\n\n'Essentially, if Democrats cave on this issue, what it will say to Donald Trump is that he has a green light to go forward toward authoritarianism, and I think that would be a tragedy for this country.'\n\nBut Virginia Democrat Tim Kaine revealed he would vote in favor of the proposal after securing a promise to give laid-off federal workers their jobs back, with back pay. \n\n'This legislation will protect federal workers from baseless firings, reinstate those who have been wrongfully terminated during the shutdown, and ensure federal workers receive back pay, as required by a law I got passed in 2019,' Kaine said. \n\n'That's a critical step that will help federal employees and all Americans who rely on government services.'\n\nAnd Independent Maine Senator Angus King was also won over, noting the unprecedented length of the shutdown had forced some to reconsider the initial subsidies they were demanding.\n\n'I think people were saying, ''We're not going to get what we want'',' he said. \n\nTexas Representative Greg Casar, the chairman of the Congressional Progressive Caucus, said a deal that doesn't reduce health care costs is a 'betrayal' of millions of Americans who are counting on Democrats to fight for them.\n\n'Accepting nothing but a pinky promise from Republicans isn´t a compromise - it´s capitulation,' Casar said in a post on X. 'Millions of families would pay the price.'\n\nEarlier on Sunday reports emerged from Washington that a deal to end the stalemate was 'within reach.' \n\nAt least 10 Democrats were reportedly ready to vote for the package of bills, which would have given the Republicans the numbers they needed.\n\nThe deal reportedly would include a vote on extending Obamacare tax credits in December. \n\nIn addition to keeping the government funded through January, the stopgap measure reportedly would provide full-year funding for Congress, the Department of Agriculture, and the Department of Veterans Affairs, including military construction projects, through the next fiscal year.\n\nPublic frustration with the prolonged shutdown is intensifying, increasing pressure on both parties to reach an agreement.\n\nBut amid negotiations, a high-ranking Democrat acknowledged the political leverage hardships caused by the shutdown create for her party.\n\nMassachusetts Congresswoman Katherine Clark, Minority Whip of the United States House of Representatives, admitted families struggling during the shutdown could be used as 'leverage' for her party.\n\n'Shutdowns are terrible. And of course, there will be families that are going to suffer. We take that responsibility very seriously, but it is one of the few leverage times we have,' Clark said.\n\nThe House of Representatives has been in recess since Republicans passed their funding bill, leaving the resolution of the shutdown in the hands of their Senate colleagues.\n\nThe Trump administration was ordered to address food insecurity which had come as a result of the shutdown by fully funding SNAP benefits by tapping agriculture reserves.\n\nSNAP typically costs about $9 billion a month. The Trump administration planned to cover only 65 per cent of November benefits using contingency funds until the order by District Judge Jack McConnell in Rhode Island.\n\nThe administration appealed, arguing courts cannot appropriate funds, and on Friday the Supreme Court temporarily blocked McConnell's order, giving the White House more time to fight the mandate. \n\nAs a result, full benefits remain uncertain, and partial payments promised by the USDA have yet to reach most households.\n\nThe fallout has been immediate. Feeding America, the nation's largest hunger-relief network, reported a sixfold spike in traffic to its food-bank locator, with more than 28,000 daily visitors seeking help. \n\n'This situation is catastrophic,' said Monica Lopez Gonzales, the group's chief marketing and communications officer, told Fortune. 'Right now, 42 million people are having a hard time affording groceries, and their lives are being disrupted because their benefits have been disrupted.'\n\nFood banks across the country are seeing longer lines and empty shelves. 'The lines are getting longer, and the food is running out early,' Gonzales said. 'We see veterans, older adults, moms, and kids - everyone is stressed.","summary":"Lawmakers were locked in tense negotiations during a rare Sunday session in an effort to find a solution to the shutdown","url":"https://www.dailymail.co.uk/news/article-15274999/Deal-END-government-shutdown-breaks-major-hurdle-Democrats-join-GOP-rivals-reach-agreement.html","image":"https://i.dailymail.co.uk/1s/2025/11/10/00/103735967-0-image-a-15_1762736220181.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/08/3021840210261423701/1024x576_MP4_3021840210261423701.mp4","publish_date":"2025-11-10 01:01:06","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.521},{"id":377379830,"title":"US judge steps down to speak out against Trump, ‘threat to democracy’","text":"Philadelphia: A federal judge has warned of an “existential threat to democracy” in a searing first-person essay, saying he had stepped down from the bench to speak out against US President Donald Trump.\n\nHe accused Trump of “using the law for partisan purposes, targeting his adversaries while sparing his friends and donors from investigation, prosecution and possible punishment”.\n\nThe judge, Mark L. Wolf, wrote in The Atlantic magazine on Sunday, US time, that Trump’s actions were “contrary to everything that I have stood for in my more than 50 years in the Department of Justice and on the bench”.\n\nThe publication of the essay by Wolf, 78, came two days after an announcement by the Federal District Court for Massachusetts that he was leaving his post as a senior-status judge.","summary":"Judge Mark L. Wolf accused Trump of “targeting his adversaries while sparing his friends and donors”.","url":"https://www.theage.com.au/world/north-america/us-judge-steps-down-to-speak-out-against-trump-threat-to-democracy-20251110-p5n90m.html","image":"https://static.ffx.io/images/$zoom_0.1416%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_8%2C$y_8/t_crop_custom/q_86%2Cf_auto/07063ff9074942d438ec10d825c1218a2cdbaf87","video":null,"publish_date":"2025-11-10 00:59:00","author":"Mattathias Schwartz","authors":["Mattathias Schwartz"],"language":"en","category":"politics","source_country":"au","sentiment":0.192},{"id":377376638,"title":"US judge steps down to speak out against Trump, ‘threat to democracy’","text":"Philadelphia: A federal judge has warned of an “existential threat to democracy” in a searing first-person essay, saying he had stepped down from the bench to speak out against US President Donald Trump.\n\nHe accused Trump of “using the law for partisan purposes, targeting his adversaries while sparing his friends and donors from investigation, prosecution and possible punishment”.\n\nThe judge, Mark L. Wolf, wrote in The Atlantic magazine on Sunday, US time, that Trump’s actions were “contrary to everything that I have stood for in my more than 50 years in the Department of Justice and on the bench”.\n\nThe publication of the essay by Wolf, 78, came two days after an announcement by the Federal District Court for Massachusetts that he was leaving his post as a senior-status judge.","summary":"Judge Mark L. Wolf accused Trump of “targeting his adversaries while sparing his friends and donors”.","url":"https://www.smh.com.au/world/north-america/us-judge-steps-down-to-speak-out-against-trump-threat-to-democracy-20251110-p5n90m.html","image":"https://static.ffx.io/images/$zoom_0.1416%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_8%2C$y_8/t_crop_custom/q_86%2Cf_auto/07063ff9074942d438ec10d825c1218a2cdbaf87","video":null,"publish_date":"2025-11-10 00:59:00","author":"Mattathias Schwartz","authors":["Mattathias Schwartz"],"language":"en","category":"politics","source_country":"au","sentiment":0.192},{"id":377377506,"title":"Quivering teen boy wipes tears on Nike hoodie as he fears ICE will snatch his US citizen parents: 'They treat us like dogs'","text":"An Oregon teenager has gone viral for sharing his concerns about his parents who are living in the United States legally amid increased US Immigration and Customs Enforcement activity in the area.\n\nManny Chavez, 16, was one of dozens of residents who spoke up at a Hillsboro City Council meeting on Tuesday decrying ICE raids in the Portland suburb, KGW reports. \n\n'I just want to tell you guys that I'm scared for my parents to walk out there, to walk out their house because I might not be able to say goodbye to them if they go to work. I might not ever be able to say \"bye\" or see them again,' he began, his voice breaking as he spoke.\n\n'I'm scared because of it, because they fought so hard to come here and choose a life for their kids,' Chavez continued, his voice breaking as he spoke.\n\n'I'm scared that everyone that I love is not, I'm not going to be able to see them again, because even though they're US citizens, they don't care about us. \n\n'They treat us like dogs, they treat us like animals.'\n\nChavez also shared his concerns that he would one day be held at school by masked ICE agents as his parents were detained, and pleaded with the city council members to take action and help residents in the city fight back against ICE.\n\n'I hope you guys do side with us because we are fighting for our rights and we are getting treated like animals because people judge us by the color of our skin and the way that we talk,' he said, before taking a swipe at President Donald Trump.\n\n'And we have a president that acts like a child and doesn't side with us because of the way he thinks about us,' the teenager said between tears.\n\nHe concluded his nearly three-minute long remarks by saying he really wants 'something to change because I do not want to live like this.\n\n'I'm tired of telling my mom and dad every day after school, \"Have you seen the new video of ICE pulling someone over because of the color of their skin?\" he continued, choking up, pulling on the neck of his Nike sweatshirt.\n\n'As a 16 year old, I shouldn't be scared,' the teenager said. 'I should be focusing on school - and I can't even focus on school.'\n\nOnce he finished speaking, the teenager covered his face with his sweatshirt and collapsed into his arms as he sobbed in front of the city council members, two of whom gave Chavez a standing ovation - along with many in the auditorium, the Oregonian reports.\n\nBut some online argued that the boy's concerns were unfounded.\n\n'If his parents are legal, why is he scared of ICE?' one X user asked. 'Maybe it's time we separate facts from fear.\n\n'Politicians are making kids cry to score votes. Disgusting,' he added.\n\nAnother X user said she does 'feel for the boy' and 'it's not his fault,' but it's really on his parents for making this choice,' while a third argued that the 'blame belongs to the people that let unmitigated illegal crossings occur. Period.\n\n'Correcting that wrong is not the fault of the current administration. Period.' \n\nThe Daily Mail has reached out to ICE for comment. \n\nThe teenager, though, said he was not planning on speaking at the packed city council meeting - and was instead there to show his support for two friends and members of his soccer team whose relatives had been detained by ICE in recent weeks.\n\n'I was just worried about everyone afterwards because ICE is just going for whoever they want at this point, even if they're citizens, they're going for whoever fits the brown description,' Chavez told KOIN.\n\n'Sounds like maybe I should not have put my face out there,' he admitted. 'Maybe I regret getting so big because now I'm a target or something like that.'\n\nStill, his remarks seemed to have the desired effect in the city of Hillsboro, where Latinos make up a quarter of the population.\n\nAt the end of the hearing, Councilor Cristian Salgado announced his plan for the city to create a civil and human rights office, which would be staffed with a coordinator who would work hand-in-hand with legal observers.\n\nThose observers would then respond when they receive reports of possible ICE activity and would rush to document what happens.\n\n'They're trying to hold ICE accountable for their actions,' Salgado said of those who are already filming the ICE raids in the Portland suburb.\n\n'They're recording everything and so we want someone to record those and log them and keep them on record.' \n\nHe added that the city also plans to have a legal resource navigator to help detained migrants and their families, as well as a low-barrier grant manager.\n\nMayor Beach Pace also noted that the city has been designating money to support Latino organizations and businesses.\n\n'I want Manny to know and I want everybody to know that if we can banish ICE like that, we would,' Pace said.\n\n'If a family member or anyone sees somebody that's in the process of being detained by ICE, they can call 911,' the mayor continued. 'Hillsboro police will arrive and they can verify, they can ask to very identification of the ICE agents.'\n\nAdditionally, Washington County commissioners issued an emergency declaration earlier in the week, freeing up $200,000 to go to organizations supporting families with detained members and ensuring that due process is being followed.\n\nYet Chavez wants more to be done, as ICE ramps up its deportation efforts in Oregon, where more than 300 people were detained in the month of October alone as violent protests took place outside of detainment facilities. \n\nUsing his newfound fame, the teenager created an online fundraiser to help those in his community who are detained.\n\nThe funds would be used to provide grocery support and meals for families whose parents have been detained, help them get legal counsel and child care and transportation while the parent is detained, and fund mental health care for children and their parents.\n\n'In Hillsboro, Oregon - a city that prides itself on diversity and community - far too many families are living under a cloud of fear and uncertainty,' Chavez wrote.\n\n'Recent enforcement actions by US Immigration and Customs Enforcement (ICE) and related agencies have rocked our neighborhoods, disrupted lives and left children asking whether they'll ever be able to say goodbye to their parents.'\n\n'Time is critical,' he continued. 'When a wage-earner is detained, the ripple effect is immediate - children may lose meals, families may lose housing, fear shuts down schooling, jobs are left unfilled.'\n\nWhile the county declared an emergency over the increased raids, Chavez said 'government funds move slowly' and his fund is 'about getting help to people right now.'\n\n'Hillsboro has always been at its best when we stand with each other,' he concluded. 'When fear creeps in, community must push back.\n\n'We are not powerless,' Chavez continued. 'By giving by sharing, by standing firm for justice and support, we can provide a lifeline to those who keep our city running - those who pick crops, clean offices, build homes, teach our children, serve our businesses.'\n\n'Join us,' he pleaded. 'Be part of the answer. Because when one family suffers in silence, we all do.'\n\nThe teenager also noted that 'any and all money we raise will go to help people in our community who are being wrongfully affected by this immigration crisis we are in.'\n\nAs of Sunday night, the fundraiser had garnered nearly $19,500.","summary":"Manny Chavez, 16, was one of dozens of residents who spoke up at a city council meeting in Hillsboro, Oregon on Tuesday decrying ICE raids in the Portland suburb.","url":"https://www.dailymail.co.uk/news/article-15274801/Teenager-Oregon-ICE-Manny-Chavez.html","image":"https://i.dailymail.co.uk/1s/2025/11/10/00/103732809-0-image-a-21_1762733988621.jpg","video":null,"publish_date":"2025-11-10 00:57:55","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.233},{"id":377377512,"title":"As her disgraced father is stripped of his titles and booted out of Royal Lodge, Princess Beatrice hosts a tea party for super rich dignitaries in Saudi","text":"Home and Garden\n\nLatest Headlines\n\nUniversity Guide\n\nThe Crime Desk\n\nPrivacy Policy\n\nMonday, Nov 10th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nBBC bosses quit in disgrace after corporation admits doctoring Donald Trump video and is accused of bias on war in Gaza and transgender reports\n\nD-Day hero who said sacrifice of the lost men of his generation 'wasn't worth' what the country has become says UK 'has gone to rack and ruin'\n\nMan, 44, who 'sexually assaulted eight-year-old boy in tent' while youngster was on holiday with his family dies in prison\n\nHas your Mounjaro weight loss slowed down? This is how you can turbo-charge your jab by using our experts' very easy hacks... and exactly which body part you should be injecting\n\nCruel rosacea blighted my life for years. I tried all the solutions, but it was this dermatologist-approved fix that finally cleared my skin for good\n\nGladiator Harry Aikines-Aryeetey is the latest contestant to be booted off Strictly Come Dancing after competing in 'most difficult dance off yet' against La Voix\n\nA world away from Royal duty: Prince Harry seems 'fed up of being paraded' and unable to 'stage rictus grin' as he and poppy-less Meghan visit Kris Jenner's 70th on the eve of Remembrance Sunday\n\n'NYC will become Mumbai', billionaire property magnate rages as his firm plans to leave the city after Zohran Mamdani mayoral win\n\nHair loss expert names the trendy hairstyle causing women to go bald: 'It causes repeated stress and breakage'\n\n'We adored her, her death destroyed us... Christine had no idea what was going on': Why Caroline Flack's friends are so hurt by her mother's latest move - as they reveal star's wayward partying and what happened in her final days\n\nCan't stop clearing your throat? This is the surprising reason why, when you should be worried - and exactly how you can get rid of the irritating problem for good\n\nLIZ JONES: This was the time to put selfishness and petty squabbles aside. Instead, clown Harry partied with the tacky Kardashians... and Meghan's beaming smile reveals the truth\n\nTrump promises $2,000 check for every American thanks to tariff revenue he's collected\n\nBritish motorists face being taxed for driving in FRANCE under Rachel Reeves' upcoming pay-per-mile scheme\n\nEmotional King Charles leads impeccable Remembrance Sunday two-minute silence with Prince William, Kate, Queen Camilla, Edward and teary-eyed Sophie\n\nCeltic supporters boo during minute's silence on Remembrance Day as referee ends tribute after just 10 SECONDS\n\n'He is a bum and a wicked man who brings shame on your country': Inside David Lammy's seven-hour taxi ride from hell as French driver claims he was slapped, abused... and what he says Deputy PM's wife did\n\nSophie, Duchess of Edinburgh's touching reason for wearing three poppies on Remembrance Sunday with Queen Camilla\n\nMoment Duchess of Edinburgh Sophie is moved to tears at Remembrance Day service\n\nMoment enormous wave crashes down on people in Tenerife as wild weather kills three and injures 15\n\nHow waking up in the night is a relic of the 'lost' medieval habit of 'two sleeps' - which could be good for you... and your sex life\n\nThe REAL story of how Meghan lost her best friend: They've not spoken in years... but now insiders reveal 'aggravation' and tensions that go 'deeper than anyone knows'\n\nSchoolboy, 10, in remission after leukaemia treatment is recognised for remarkable charity fundraising as he as he raises £400,000\n\nOrlando Bloom faces ex-fiancée Katy Perry's wrath as he cosies up to actress Rachel Lynn Matthews who mocks singer with Halloween costume\n\nAs her disgraced father is stripped of his titles and booted out of Royal Lodge, Princess Beatrice hosts a tea party for super rich dignitaries in Saudi\n\n Do YOU have a story? Email tips@dailymail.co.uk\nBy NICK CRAVEN, SENIOR REPORTER \n Published:00:55 GMT, 10 November 2025 |Updated:00:56 GMT, 10 November 2025 \n\nThe scene was a five star hotel in the Saudi capital which is as notorious as it is opulent. \nThe reason for the Riyadh Ritz-Carlton’s notoriety is that it was the central to the Arab state’s violent purge of hundreds of its most powerful royals, tycoons and ministers. \nThe 2017 crackdown saw dozens of Saudi’s ‘old guard’ beaten and tortured - with many of the most disturbing scenes unfolding at the Ritz-Carlton. \nBut the hotel’s owners had done everything possible to banish such dark memories as they organised an altogether more genteel event last week, billed as ‘afternoon tea with Princess Beatrice of York’. \nThe Daily Mail has learned that, while her father’s very public fall from grace was entering its final stages, his oldest daughter was in Riyadh, apparently picking up the sort of role the former Prince Andrew had long performed himself. \nBeatrice was the star turn at the prestigious so-called Future Investment Initiative - and this was just the latest occasion at which the Princess has rubbed shoulders with some of the richest men on the planet. \nAnd in some quarters this meeting - and others like it, also involving Beatrice, 37 – has raised the question: is the elder daughter of the man formerly known as the Duke of York unofficially resuming her disgraced father’s old role as UK trade envoy? \nAs Andrew Mountbatten-Windsor, as he is now officially known, withdraws from public life in shame, has Beatrice – closely followed by her younger sister Eugenie - stepped up to fill the gap? \n\nWhile her father’s very public fall from grace was entering its final stages, his oldest daughter Princess Beatrice (pictured) was in Riyadh, hosting 'afternoon tea' \n\nThe afternoon tea invitations billed the event as 'insights and bold ideas for investing in women, wellness, and the next generation of leaders'\n\nTypically courting wealthy envoys had been the role of Beatrice's father, Andrew Mountbatten Windsor, who was UK trade envoy\nEven as far back as 2008, speculation began that the then 19-year-old Beatrice was being prepped for just such a role when Andrew took her on a 14-day tour of Abu Dhabi and Egypt – at the taxpayer’s expense.\nThe bill for the Met Police bodyguard she had in those days alone was estimated at £40,000 since, because of shift patterns, one set of police officers had to be flown out to replace another. She performed no public engagements.\nIn 2011 it was reported that Beatrice was given expensive pieces of jewellery on another trip to Abu Dhabi with Andrew by their royal hosts.\nMany years later and Beatrice is shown in this exclusive photograph in the Ritz-Carlton lobby last week where she was intently studying her phone in the days running up to the momentous announcement that Andrew would be stripped of his Princely title.\nThe mother-of-two, in a long black dress with matching pumps, and black bow in her hair, who is involved in software companies, was leading the event for women business leaders.\nThe invitation cards announced: ‘We cordially invite you to Afternoon Tea hosted by Princess Beatrice of York,’ along with Canadian wellness entrepreneur Ruma Bose, and a US-based organisation called the ‘Lioness Collective’.\nHow she arrived in Saudi – by scheduled airline or private jet – is not known, nor what fee, if any, she was paid for the gig, but she was treated very much as a VIP by the assembled Royals, energy bosses and high-powered bankers, with podcaster Sunil Sharma posing for a selfie with her in the hotel.\nSo what exactly is Beatrice’s role at such conferences? The Mail’s enquiries with her co-hosts at the ‘Lioness Collective’ and Ms Bose drew no response.\nThe Collective’s founder, Scottsdale, Arizona-based Heidi Keele, has a rare talent for punchy rhymes, judging by her website, which asks in typically brash American terms: ‘HAS YOUR HUSTLE LOST ITS MUSCLE?’\nPotential members are told: ‘You’ve been grinding, but your efforts are losing steam. What worked before isn’t cutting it anymore, and progress is crawling.\n‘You’re stuck in a cycle without results. It’s time to recharge, refocus, and get your hustle back on track. Welcome to The Lioness Collective—a space where drive meets action, and hard work turns into real results.’\nMany attendees were curious whether Beatrice would even show up for the Riyadh event, given the tumultuous events occurring back home.\nAndrew and his ex-wife Sarah Ferguson were effectively thrown out on their ears by King Charles after both were exposed as having lied about breaking off contact with billionaire paedophile Jeffrey Epstein in the years following his 2008 conviction and plea deal for organising child prostitution.\n\nAndrew's daughters princesses Beatrice and Eugenie were pictured embracing on Thursday after their father was formally stripped of his titles \n\nThe sisters appeared to share an emotional moment together in London this week\nBeatrice and Eugenie were said to have been ‘absolutely devastated’ by the latest scandal surrounding their father – accused by the late Epstein victim Virginia Giuffre of having sex with her when she was trafficked and underage, which he has denied.\n‘It can’t have been easy fronting the tea party,’ said one conference attendee. ‘No-one would have blamed her if she had pulled out of this high-profile event, but she was determined to grit her teeth and carry on with the show, and I think people respected that.’\nWhat went on behind the closed doors of the women-only tea party in the hotel’s Executive Lounge isn’t known, but judging from a previous outing in Abu Dhabi last year, we can make a fair guess.\nLast November, Beatrice was rubbing shoulders with some of the region’s key power players both in public and behind the scenes.\nShe spoke about artificial intelligence at the Adipec energy conference in the Emirate, where her father is believed to have the exclusive use of a Royal palace at his disposal.\nBeatrice also attended a private conference hosted by the UAE minister of industry, Dr Sultan Ahmed Al Jaber, the day before her public appearance.\nShe was pictured at the event next to Abu Dhabi crown prince Mohamed bin Zayed Al Nahyan, who is also the UAE’s president, and an old friend of her father from schooldays at Gordonstoun.\nReporters were banned from the meeting, which included the CEOs of Shell and EDF, the vice president of Microsoft, and former Bank of England governor Mark Carney, now the UN special envoy for climate action.\n\nSarah Ferguson and Prince Andrew pictured attending the Royal Ascot in 2019. The divorced couple were both stripped of their formal titles last week\n\nPictured (left to right) Princess Beatrice, Sarah Ferguson, Andrew Mountbatten Windsor and Princess Eugenie \nIn a public interview on stage, Beatrice made sure she hit her key points, rattling away pleasantly and fluently about ‘collaboration’, ‘moving the needle’, ‘expanding the conversation’ and ‘asking questions’.\nUS journalist Hadley Gamble, who conducted the interview, told the Mail on Sunday: ‘There was a general feeling that Beatrice was an unofficial ambassador for the UK.’ She added: ‘Beatrice was quite literally in the inner circle at a gathering of global energy CEOs, top finance guys and policy makers.’\nIn the months before, Princess Beatrice – sometimes accompanied by her art gallery executive sister Eugenie, 35 -- has made several visits to the region, but is she flying the flag for Britain, or feathering her own nest?\nIn previous years when Beatrice accompanied her father, the lines were always blurred, and many people couldn’t help but notice that many of Andrew’s official trips, whether as the official UK trade envoy or afterwards, often coincided with the weekends of F1 Grand Prix in Abu Dhabi or Bahrain.\nA few months before he was forced to stand down as Trade Envoy in 2011, the public were given a rare insight into what the diplomats called on to help arrange Andrew’s trips really thought of him.\nA bombshell letter from former UK Ambassador to Qatar and Tunisia, Stephen Day, an ex-head of the Foreign Office’s Middle East section, was leaked.\nHe told government ministers that Andrew should be sacked ‘as soon as possible’ because he was doing ‘serious damage’ to the Royal Family and Britain.\nMr Day said the Prince was the ‘worst person’ to deploy in countries such as Qatar, where his presence was seen as ‘crass’.\nHe also alleged that Andrew had held a ‘worrying’ private meeting with Col Gaddafi three years earlier at the home of Sakher el–Materi, the son–in-law of the recently ousted Tunisian president, and described by Mr Day as ‘the worst of all the crooks in the presidential family’.\nAndrew’s reign as trade envoy came to an ignominious end three months later, but he then morphed into the host of ‘Pitch@Palace’, helping young entrepreneurs link up with potential investors.\nThis, too, then became an excuse for foreign jaunts, with versions in Africa, China, Australia, the UAE, Latin America and Singapore. While the organisation helped launch several innovative new start-ups, Andrew’s interview with the Sunday Times, in which he described himself as ‘an ideas factory’, didn’t exactly win over his interviewer, John Arlidge.\nHe told Andrew’s biographer Andrew Lownie in his book Entitled: ‘He was, without question, the most arrogant and thoughtless public figure I have ever interviewed.\n‘Everything he should have done, he didn’t do, and everything he shouldn’t have done, he did do.’\nThree years later, the travelling Yorks were still on the road, this time in Abu Dhabi, again at taxpayers’ expense.\nAndrew and Beatrice accompanied by her American boyfriend at the time, Dave Clark, watched Lewis Hamilton claim victory the day after father and daughter unveiled two plaques at a local British school, joined by the British Ambassador and the UAE’s culture minister.\nLast year Eugenie was spotted in Doha, Qatar, where she visited the M7 art centre to see the Ellsworth Kelly exhibition – the first Middle Eastern retrospective of the artist's work.\nThe Princesses’ mother, Sarah Ferguson told the Mail around that time that her daughters were passionately driven by the causes they hold dear.\n‘Beatrice and Eugenie are out there doing the work,’ she said. ‘Eugenie does a lot with The Anti-Slavery Collective, Beatrice does an enormous amount in technology and with dyslexia and really believes in humanity in the workplace, with compassion.’\nTo be fair to Beatrice and Eugenie they also stepped up to help fulfil official Royal engagements during the Princess of Wales’ illness. In May 2024, they both attended a garden party at Buckingham Palace to support William, when Kate could not be present. They were joined by their cousins, Zara Tindall and Peter Philips.\nEarlier this year, Beatrice was appointed as the director of Purpose Economy Intelligence, Ltd., along with Spanish executive Luis Alvarado Martinez. They each obtained a 45 percent share of the company with the remaining 10 percent held by Beatrice’s private secretary, Olivia Horsley.\nBeatrice would serve as the director for the company which focuses on developing software for businesses and homes and offering management consulting services.\nHer own company, BY-EQ, had a very good year, boosting its profits spectacularly between 2023 and last year.\nIn its first year, it reported a modest £39,000 profit, but recent accounts showed that its earnings in 2024 were close to £500,000.\nAfter bills of £214,615, Beatrice retained £274,846 in accumulated profits.\nNot bad for a company with only one director, a three-page website, and no employees at all, according to Companies House.\nBut what exactly does BY-EQ (which stands for Beatrice York – Emotional Quotient) do?\nAt least the website can answer that one: ‘By combining her industry experience with her long standing commitments to philanthropy and a belief that businesses can and should have a positive impact, Beatrice created BY–EQ to bring these sectors together.\n‘BY–EQ works with stakeholders to deliver purpose focused initiatives.’\nThe website offers no clues as to who Beatrice’s stakeholders might be.\nSince June of this year, she has listed herself as strategic advisor at US tech giant Afiniti, rather than the vice-president she previously was.\nAs for her other half, Italian Count Edoardo Mapelli Mozzi his companies, according to the publicity, at least, are renovating in London, New York City, Sydney and Dubai, and the Banda Property website is full of sumptuous videos of swanky minimalist pads decorated in tones of beige and brown.\n\nAndrew (pictured riding at Windsor Castle earlier this year) and his ex-wife Sarah Ferguson were effectively thrown out by their ears by King Charles after both were exposed as having lied about breaking off contact with billionaire paedophile Jeffrey Epstein in the years following his 2008 conviction and plea deal for organising child prostitution \nThey even took on the refurbishment of a Gulfstream 550 private jet recently.\nEdoardo, 41, is director of 11 firms listed at Companies House, with five of them still active and the other six dissolved.\nAccording to records filed at Companies House, only one, Banda Limited, made a profit of £246,849 in 2024 compared to £247,071 the previous year.\nThe others had negative balance sheets. Banda’s number of employees had risen by three in the year to 48.\nAccording to the company’s LinkedIn page, their interior design team ‘Can craft environments for a beautiful and functional life, with a design that extends beyond to encompass every facet of a property's story.’\nThey also offer a private client search team ‘able to access London’s most desirable homes before they come to market’.\nThen there’s the design and build team offering architecture and project management skills. ,\nOr, as the website pithily sums it all up in what could even be a motto for the new generation of the House of York:\n‘Source. Plan. Deliver. Finesse. Globally’.\nPrincess Beatrice was contacted for comment. \n\nShare or comment on this article: \nAs her disgraced father is stripped of his titles and booted out of Royal Lodge, Princess Beatrice hosts a tea party for super rich dignitaries in Saudi\n\nAdd comment\n\n Share what you think\n\nNo comments have so far been submitted. Why not be the first to send us your thoughts,\nor debate this issue live on our message boards.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nGladiator Harry Aikines-Aryeetey is the latest contestant to be booted off Strictly Come Dancing after competing in 'most difficult dance off yet' against La Voix\n\nOrlando Bloom faces ex-fiancée Katy Perry's wrath as he cosies up to actress Rachel Lynn Matthews who mocks singer with Halloween costume\n\nEastEnders star Shona McGarty is the third I'm A Celebrity contestant to arrive in Australia ahead of the ITV show... and she makes a very telling comment after her split from fiancé\n\nNick Knowles, 63, says wife Katie's life-saving emergency surgery after 'brutal' hysterectomy aged 35 was 'really frightening' as he gives health update\n\nTasha Ghouri makes her first public appearance with new CBBC presenter boyfriend Cam Whitnall at the Strictly live show after her bitter split from Andrew Le Page\n\nPitch perfect: Gtech founder Nick Grey on why he's proud to support Brentford FC's Premier League journey\n\nWhy cops came to Kris Jenner's 70th birthday party at Jeff Bezos' $165M mansion MULTIPLE times in one night\n\nBeaming Ruby Wax arrives at London's Heathrow to jet to Australia ahead of I'm A Celebrity stint - as the first stars arrive Down Under for the new series\n\nMo Gilligan breaks his silence on his secret love child and defends his model ex who accused the comedian of being an absent father\n\nIt's about showing up not slowing down: Why midlife is the start of the best part of your life, and how to embrace it\n\nSam Mitchell set to return to EastEnders to face enemy Zoe Slater in explosive Christmas storyline twenty years on from Dirty Den's murder\n\nLove Island's Amy Hart reveals she's pregnant with her second child after suffering two 'heartbreaking' miscarriages in the past year\n\nStrictly's Amber Davies shares gushing tribute to her boyfriend Ben Joyce for going 'above and beyond' to support her amid speculation over her sizzling chemistry with Nikita Kuzmin\n\nHolly Ramsay wows in a £1,450 mini dress as she shares more snaps from her lavish hen weekend at Soho Farmhouse with A-list guest list including Victoria Beckham\n\nDreading the winter fatigue? From simple food swaps to routine tweaks, this is how to support energy to live your life to the full\n\nDynasty and The Paper Chase star Betty Harford dead at 98\n\nJonathan Bailey opens up on the motivating power of 'shame' and his thoughts about having children as he sizzles in shirtless Bridgerton-inspired photoshoot\n\nSydney Sweeney reveals she suffered bloodied nose and concussion on set\n\nEXCLUSIVEMAFS UK star Steven is BLASTED by pals when he reveals the shocking news he's been messaging Julia-Ruth behind bride Nelly's back\n\nFrom a tree that'll make your neighbours jealous, elegant tablescapes, great gifts, and fabulous festive outfits: We have your showstopping Christmas covered\n\nGeorgia Harrison shares snaps from her first week of motherhood after welcoming her daughter with boyfriend Jack Spacey\n\nStrictly star backs Celebrity Traitors' winner Alan Carr to take over from Claudia Winkleman and Tess Daly as host after being hailed a 'national treasure'\n\nStrictly viewers praise 'absolutely beautiful' tribute to Remembrance Sunday - but some confused fans question why Amy Dowden danced\n\nLegendary actress Sally Kirkland, 84, in hospice after devastating health ordeal\n\n'We weren't alone': One family share the unexpected comfort of saying goodbye the right way with the support of Marie Curie\n\nMaura Higgins admits she DOES get Botox after previously denying using the injectables - as she opens up about her beauty regime\n\nKelly Brook and Lisa Riley are the first stars to touch down in Australia ahead of this year's I'm A Celebrity as they arrive at Brisbane Airport\n\nBella Hadid looks effortlessly chic in a Prada co-ord as she's mobbed by fans at beauty event in Dubai\n\nJennifer Aniston's boyfriend Jim Curtis shares dating tips (and the advice he may have followed to land the Friends star!)\n\nYou could save a sleighload in time for Christmas thanks to this app\n\n'Are you f***ing joking me?' Davina McCall recalls rage over breast cancer diagnosis and 'stamping her feet' during conversations with partner Michael\n\nCall Her Daddy host Alex Cooper reveals Taylor Swift was her 'sexual awakening for women'\n\nMiranda Kerr reveals her most stunning look yet as she shows off her cleavage in daring gown alongside husband Evan Spiegel at charity event\n\nHilary Duff breaks silence on 'family drama' after years of feud rumors with sister Haylie\n\nFrom garage workshop to global success: Meet the Brit who reinvented the vacuum cleaner\n\nI'm A Celebrity's Lisa Riley reveals real reason for signing up to the ITV show as she heads to the jungle\n\nKarla Sofía Gascón reveals reason she was absent at Selena Gomez's wedding after Emilia Perez scandal\n\nNo shirt, no problem! Landon Barker shows off tattooed torso as he departs Kris Jenner's birthday bash attended by billionaires Jeff Bezos and Mark Zuckerberg\n\nEXCLUSIVEDuncan James confirms new romance with Alexander Roque as he gushes over 'handsome' stripper and reveals he's gotten seal of approval\n\nTime to ditch your razor: How this at-home IPL device reduces unwanted hair growth in just weeks to save you time and money\n\nSir David Beckham shares a Remembrance Sunday post after receiving his knighthood as he leads tributes alongside Vicky Pattison and Amanda Holden\n\nFriday Night Dinner star Tom Rosenthal reveals he's ENGAGED to his long-term girlfriend Gabrielle Sky just months after the couple welcomed their first child together\n\nBBC bosses face backlash after host Katherine Ryan uses the C-word in references to Sir David Beckham's investiture and his wife Victoria\n\nHow Kylie Jenner really feels after boyfriend Timothee Chalamet refused to discuss their romance in Vogue interview\n\nThe Body Shop's advent calendar has landed - packed with impressive treats and still one of the most affordable options this year\n\nRapper Max B is released early from prison after 16 years and shares sweet reunion with pal French Montana\n\nEXCLUSIVEMichelle Heaton reveals how a night out with Katie Price helped her during her alcoholism battle when she hit rock bottom\n\n'And then there were two': Jeremy Clarkson shares moving tribute to former Top Gear co-star Quentin Willson following his death age 68 from lung cancer\n\nStrictly's Nikita Kuzmin mocks speculation over his chemistry with celebrity partner Amber Davies as he kisses her boyfriend Ben Joyce on the forehead\n\nThe sustainable British jewellery brand winning over Florence Pugh and Olivia Dean - here's everything we're loving from the new collection\n\nStrictly Come Dancing elimination leaked hours before the results show as devastated BBC fans fume 'no way'\n\nI competed on TV's most gruelling show ever - the exhaustion was so severe that I started to hallucinate and bosses cut out the worst struggle of all\n\nMolly-Mae Hague's sister Zoe shares a look at new home with husband Danny Rae complete with gym after moving out of star's £4M Cheshire mansion\n\nEXCLUSIVEThe REAL story of how Meghan lost her best friend: They've not spoken in years... but now insiders reveal 'aggravation' \n\nPregnancy-safe skincare, finally simplified: Meet the brand designed for every stage of motherhood\n\nEmotional King Charles leads impeccable Remembrance Sunday two minutes silence\n\nMillie Bobby Brown turns heads in a plunging sequin mesh gown as she leads the stars at Stranger Things Netflix event in Los Angeles\n\nDoting mum Michelle Keegan shares sweet snap with her baby daughter Palma as they sport matching pyjamas\n\nEngland footballer is unrecognisable in Hulk Hogan costume while celebrating daughter's 19th birthday - but can you guess who the sporting legend is?\n\nCountry or coast? New property prize draw could see YOU win a historic dream home worth £2.5million or a Cornwall dream home\n\nDavid Harbour lands huge movie role in true crime thriller with Courteney Cox directing after ex-wife Lily Allen's scathing album\n\nThe celebrities suffering with fibromyalgia - from Lady Gaga's 'head to toe pain' and Morgan Freeman's nerve damage\n\nMeghan Markle and stern Prince Harry lead star parade at Kris Jenner's 70th birthday bash held at Jeff Bezos' $165M mansion in Beverly Hills\n\nCamilla and Kate's united front: Queen shared 'warm' chat with Princess of Wales during Remembrance Sunday service, body language expert claims\n\nDetachable belt, timeless lapels, and four neutral colours - here's why this wrap coat is already becoming an influencer favourite\n\nQueen Camilla's one-word remark to Kate at Remembrance Sunday service revealed by lip reader\n\n'Absolutely disgusting and blasphemic' cartoon returns for second series despite parents begging for it to be BANNED\n\nTheo James reveals what fans can expect from The Gentlemen series 2 ahead of its return to Netflix\n\nKim Kardashian dazzles with sisters Kylie and Kendall Jenner as they celebrate mom Kris' 70th birthday with epic James Bond-themed bash\n\nKate is sophisticated in all-black ensemble as she joins the Royal Family for Remembrance Sunday and pays a heartfelt tribute to her grandfather\n\nShona McGarty is seen without her engagement ring after her 'split' from fiancé David Bracken as she heads to Australia for I'm A Celebrity\n\nWhere are Big Brother's 2010 housemates now? From a long-lasting TV career, marriage and babies to failed businesses after their summer of surveillance 15 years ago\n\nEXCLUSIVEA world away from Royal duty: Prince Harry seems 'fed up of being paraded' and unable to 'stage rictus grin' as he and Meghan visit Kris Kardashian's 70th on the eve of Remembrance Sunday\n\nMoment Duchess of Edinburgh Sophie is moved to tears at Remembrance Day service\n\nPeter Andre reveals how wife Emily copes with his romance scenes after he kickstarted an acting career\n\nEXCLUSIVEMystery behind the axing of Aimee Lou Wood's M&S Christmas campaign deepens as it's revealed TV ad cost 'eye-watering amount' to make\n\nAlice Liveing gives birth! Fitness influencer welcomes a baby girl with husband Patrick Murphy as she reveals name and admits her arrival was 'wild'\n\nAriana Grande 'hires six London hotel suites at £5,000 a NIGHT ahead of £100,000 Wicked: For Good afterparty at swanky venue' amid sequel's UK press tour\n\nAlready missing Celebrity Traitors? Here are six twisted reality shows packed full of backstabbing and betrayal to beat your withdrawal\n\n'My boys!' Penny Lancaster gushes over her husband Rod Stewart and sons Alastair and Aiden as she shares sweet snap from family night out\n\nAmy Dowden returns home from hospital after second mastectomy in time to watch Strictly Come Dancing\n\nPrincess Anne pays tribute to fallen soldiers during special commemorative service in Sydney - as she continues her visit to Australia\n\nHow Adam Peaty was saved by Holly Ramsay: Olympic swimmer was brought back from brink by fiancée who helped him out of 'three years of hell'\n\nGordon Ramsay says there is 'no way' he will offer 'Ozempic tasting menu' saying 'the problem' is with diners for 'eating too much in the first place'\n\nEmily Atack goes wedding dress shopping as she prepares to tie the knot with fiancé Alistair Garner - after welcoming son Barney last year\n\nEXCLUSIVEVanished without a trace: ANDY WEBB reveals the BBC dossier that could prove its cover-up of Bashir's Diana deception went all the way to the top\n\nMyleene Klass reveals some evidence in her stalker trial was deemed 'too traumatic' to show her as she reflects on 'horrific and sobering' ordeal\n\nAs Jennifer Aniston cosies up with hunky Wall Street trader turned New Age healer Jim Curtis, all of Hollywood is asking: Has he finally fixed her broken heart?\n\nKelly Brook 'set to recreate Myleene Klass' iconic I'm A Celeb shower moment in a bid to have her moment and shine'\n\nOlivia Rodrigo and Doja Cat set stage on fire as Chappell Roan inducts Cyndi Lauper into Rock & Roll Hall of Fame\n\nTraitors winner Alan Carr 'saved his close friend's life after fending off thug who attacked her with a knife'\n\nDavid Beckham celebrates knighthood at Cotswolds pub with 'blaring music and £55 bottles of wine' as son Cruz performs specially written song\n\nChappell Roan dons zaniest look yet as Taylor Momsen models X-rated dress at Rock & Roll Hall of Fame induction\n\nKim Kardashian FINALLY reveals if she passed the bar exam as she pursues legal career\n\nStrictly Come Dancing's Vicky Pattison left gobsmacked as she tops the leaderboard with 'immaculate' Tango that leaves judges stunned\n\nJessica Alba sizzles in strapless gown as she joins Demi Lovato and Lizzo at starry Baby2Baby gala in LA\n\nMary Earps opens up on her 'ugly' booze battle during lowpoint of her legendary career - and how she hid her secret from her parents: 'The darkness consumed me'\n\nStrictly could axe Sunday night show because spoilsport mole keeps leaking dance-off result: KATIE HIND \n\nInside Taylor Swift's date night with Travis Kelce at one of NYC's most exclusive clubs... and the strict rule that guarantees them 'privacy'\n\nRaye sets pulses racing in a black sequin dress as she attends the Rock 'n' Roll Hall Of Fame Induction in LA\n\nElizabeth Olsen stuns in a tiny bralette and blazer at the screening of her romantic comedy Eternity in New York\n\nDavina McCall spots breast cancer thanks to a poster in the ladies at ITV - as she tells other women 'The message here is know your boobs and don't ignore a niggle': KATIE HIND\n\nMartine McCutcheon reunites with Love Actually co-star Thomas Brodie-Sangster to film festive Google ad... and she doesn't seem seized by the Christmas spirit\n\nVictoria Beckham lets her hair down at Holly Ramsay's hen do at Soho Farmhouse - ahead of her lavish Christmas wedding to Adam Peaty\n\n'It's a cruel twist of fate. He doesn't know how to live without her': Living in a tiny apartment, fragile and with failing eyesight...why friends fear for Buzz Aldrin after tragic and swift cancer death of his younger wife\n\nEva Longoria, 50, exudes old Hollywood glamour in a dazzling silver gown at the Global Gift Gala in Paris\n\nFrom Jim Bowen's bumbling brilliance to the serial killer contestant: The secrets of Bullseye's success as Freddie Flintoff revives show with Luke Littler\n\nJennifer Lawrence calls out 'annoying' Kourtney Kardashian: 'She drives me nuts'\n\nEXCLUSIVEStrictly Come Dancing pro Katya Jones reveals who she thinks should be the next host and take over from Tess Daly and Claudia Winkleman\n\nCharles appears moved by heartfelt rendition of God Save The King at Festival of Remembrance - as Princess of Wales and Prince George join solemn tributes to the fallen\n\nLori Loughlin's ex Mossimo Giannulli, 62, enjoys cozy date with stunning stylist, 32, as romance rumors heat up after shock split\n\nTrailer Park Boys star charged with sexual assault\n\nStrictly's Balvinder Sopal breaks down in tears as she dedicates Bollywood couple's choice dance to her late mum\n\nAlison Hammond 'set for huge I'm A Celebrity return on show's spin-off series Unpacked' - 15 years after jungle stint\n\nTravis Scott and daughter Stormi steal the show in Tokyo with adorable duet following Kanye West's shock appearance\n\nTALK OF THE TOWN: Noel Gallagher's new oasis... star splashes his tour millions on a new mansion\n\nKim Kardashian drops racy snaps minutes before bar exam results... then suddenly goes silent, fueling whispers she didn't pass\n\nPoster that saved Davina McCall from devastating fate: How star found cancer lump thanks to sign in toilet\n\nStrictly's Tess Daly stuns in a fitted halterneck dress while Claudia Winkleman dazzles in sequins on BBC show after announcing their shock exit\n\nKylie Jenner flaunts cleavage in tiny bra as she breaks social media silence after Timothee Chalamet's Grammy nod\n\nTerrifying moment Ariana Grande is almost hit by a car outside of Wicked event in Paris\n\nLoose Women's Gloria Hunniford, 85, shares insight into her 'painful' grief and the prospect of finding love again - 15 months after the tragic death of her husband\n\nRapper arrested on gun and drug charges the very day he earns first Grammy nomination\n\nStrictly's Balvinder Sopal continues to land in the dreaded dance-off despite her impressive routines: Here are FIVE reasons why the EastEnders star is failing to land viewers votes\n\nSuccession star Sarah Snook's new thriller is the best show of the year - it brings every parent's worst nightmare to life in spectacular fashion and I binged all eight episodes in one sitting\n\nMcBee Dynasty star gets engaged with massive 3-carat ring... two weeks after father jailed for fraud\n\nChloe Ferry reveals sweet tribute to her new boyfriend as she gets a tattoo just months into romance\n\nPrince George joins the King and Princess of Wales at Festival of Remembrance as Royal Family put Andrew scandal behind them to pay tribute to the fallen\n\nWhen the star becomes the scandal: Actors who have been forced out of their TV shows after allegations of sexual misconduct, racist tweets and reputation ruin\n\nEXCLUSIVESoap icon turned ordained minister who flirted with Andy Warhol steps out in LA... can you guess who?\n\nEXCLUSIVEMission Possible! Moment Tom Cruise defies demo to chopper in to UK Scientology's annual fundraiser\n\nMolly-Mae Hague admits she should have 'waited a few years' before starting a family and feels 'pressure' to give daughter Bambi a sibling\n\nSelling Sunset star offers blistering response to Chrishell Stause's shock departure from show\n\nI'm Celeb's Seann Walsh jets off down under as he returns to the jungle for show's spin-off series - three years after appearing in camp and lifting the lid on THAT Strictly kiss\n\nTop Gear and Fifth Gear star Quentin Wilson dies at 68 after battle with lung cancer as family pay tribute to a 'true national treasure'\n\nWicked tatts, Ariana! Singer Grande shows off her 40 hand 'prison' tattoos at Wicked: For Good premiere in Paris\n\n'About time too!': Joy for Alan Shearer as his daughter gets engaged to rugby star boyfriend - almost a year to the day since sister said yes to her fiancé!\n\nOre Oduba cuts a low-key figure as he's seen for the first time since revealing devastating porn addiction that has 'destroyed his life' since the age of nine\n\nJeremy Renner FIRES BACK back at Chinese filmmaker after she claimed he sent sexual messages and threatened to call ICE\n\nDavina McCall is supported by celebrity pals including Amanda Holden and Penny Lancaster after announcing cancer diagnosis\n\nRuth Langsford, 65, admits 'senior moments' leave her feeling 'really frightened' after she lost her father to Alzheimer's\n\nEXCLUSIVEHow Andrew's playing hardball: Staff continue to tug the forelock, Fergie waiting for a lump sum and why he won't pack his 72 teddies - as Beatrice and Eugenie battle 'Sarah problem'\n\nThis Morning star Nick Ferrari 'throws I'm A Celeb into chaos after pulling out of talks at the last minute' following 'intervention' from bosses\n\nFrom Albert Square... to nowhere? As EastEnders star Shona McGarty launches an ambitious pop career, a look back at soap's conveyor belt of questionable singers\n\nDavina McCall reveals cancer diagnosis: Star, 58, finds lump in breast while filming The Masked Singer and undergoes surgery\n\nEXCLUSIVEInsiders blow lid on top secret actor 'blacklist' at Paramount that's tearing Hollywood apart... and start naming names\n\nCelebrity Traitors' Joe Marler breaks his silence after 'heartbreaking' show loss and pal Nick Mohammed's 'betrayal' during nail-biting finale\n\nEXCLUSIVEInside Gordon Ramsay's restaurant nightmare as insiders reveal his 'shocking' multi-million pound losses, debt burden and job cuts - and the embarrassing ad that's raised eyebrows\n\nMake-up free Brooks Nader looks effortlessly stylish in a $5,000 Balenciaga tracksuit while gabbing a coffee in NYC\n\nKelsey Parker admits she is 'not ok' and is trying to 'find herself again' after losing her third child\n\nKelly Brook flashes a huge smile as she jets off Australia ahead of her I'm A Celeb stint as model joins comedy legend and soap star in the 2025 line-up\n\nI'm an EastEnders superfan and have met LOADS of the cast - they showed their true colours on the BBC set and I've ranked them all from nice to nasty\n\nGisele Bundchen, 45, gives rare look at romance with boyfriend Joaquim Valente, 38, after welcoming baby\n\nStrictly's Amber Davies shares 'tearful' selfie as she begs for votes just hours ahead of live show after vowing to 'block out' the backlash against her previous dance experience\n\nMichael McIntyre shows off his slimmer physique after taking Mounjaro as he is stopped by a fan outside lavish London restaurant\n\nEXCLUSIVEI was on ITV's Popstars and the fat-shaming and trolling I received was brutal, says Liberty X's Michelle Heaton \n\nEXCLUSIVEPeter Andre's killer getaway: Inside star's luxury holiday with Princess and Junior as he returns to Cypriot hotel where he filmed detective drama The Sunshine Murders\n\nAs Kim Kardashian's All's Fair BOMBS with 0% Rotten Tomatoes score, the other series that flopped with the lowest score for their small screen debuts\n\nDavid Tennant's wife Georgia forced to call police after receiving more vile death threats - just weeks after stalker offered reward for her murder\n\nIbiza Weekender's Ellie Young shows off her incredible weight loss transformation eight years after reality TV debut\n\n'Going back to acting was never Meghan's plan'... Has Duchess of Sussex resumed her on-screen career because she and Harry fear running out of money? asks ALISON BOSHOFF\n\nEastEnders' Shona McGarty shares cryptic post about 'not dimming her light for others' following 'split' from fiancé David Bracken \n\nHere comes the bride! Holly Ramsay stuns in white as she begins her hen do in style at Soho Farmhouse - ahead of her lavish Christmas wedding to Adam Peaty\n\nNetflix fans rave over 'most amazing documentary they've seen in years' about 'heartbreaking' struggles of veterans returning home from war\n\nEXCLUSIVECoronation Street star Catherine Tyldesley breaks her silence on recasting 'super iconic' Michelle Collins as her onscreen mum \n\nLisa Snowdon, 53, reveals how early menopause at 42 'killed her sex life' and gave her 'uncontrollable bouts of rage'\n\nStrictly Come Dancing's Vicky Pattison reveals it was a toss-up between having a baby with husband Ercan Ramadan or joining the ballroom show\n\nCheryl's careful comeback! Star is tip-toeing back into the spotlight with fashion outings, big brand deals and boujee nights out with her bandmates\n\nTom Daley is cashing in with DIY crochet kits while Paddy McGuinness flogs yoghurts - who are the stars making prestige deals?\n\nLeggy Taylor Swift towers over Sabrina Carpenter as they coordinate autumn looks on girls' night out in New York\n\nHappy Mondays and X Factor star Rowetta rushed to hospital for surgery as she tells fans she is 'morphined up' in health update\n\nWho are the Strictly bosses' dream team to replace Tess and Claudia? All the celebrity manoeuvring and inside gossip in the race to fill TV's hottest presenters' ticket: KATIE HIND\n\nJohn Lewis Xmas ad features the most famous woman on TV you've never heard of... but can you guess who it is?\n\nAriana Grande stuns in a floral gown as she joins Michelle Yeoh and their Wicked co-stars at the Paris Opera ahead of sequel release\n\nWinona Ryder makes rare sighting with silver fox beau of 14 years but still no signs of engagement\n\nPsychic Sally on her wildest ever predictions from foreseeing 9/11 to the death of Princess Diana\n\nThe moment Miss Universe boss breaks down in a tearful apology after branding Miss Mexico a 'dummy' sparking a walkout protest\n\nKourtney Kardashian is unrecognizable in Halloween costume with husband Travis Barker as baby Rocky dresses up too\n\nBritney Spears makes bold return to Instagram in lingerie after deleting her account amid Kevin Federline war\n\nIs Kris Jenner getting married? Wild claim surfaces about momager, 70, and longtime toyboy Corey Gamble, 44\n\nChrishell Stause QUITS Selling Sunset after nine seasons as star reveals show 'is not good for my mental health'\n\nJennifer Lawrence drops hints as to why she has been so emotional lately... after bizarre CRYING on talk show\n\nKristen Bell cozies up to co-star Adam Brody as they find out the fate of their Netflix show after Dax Shepard marriage drama\n\nEmma Barnett opens up about feeling 'robbed' of her identity after perimenopause at 38: 'I'm still waiting to come back to who I was before'\n\nBig Brother's Nancy and Caroline are the latest housemates to be evicted in another double exit\n\nSofia Vergara, 53, makes rare move of posing with mini-me sister Sandra, 37, who stars on Selling Sunset\n\nThe aristocratic couple who trashed their home with wild cocaine-fuelled christening for their son - as butler reveals what they did to him when he quit: RICHARD EDEN'S DIARY\n\nPaloma Faith showcases her baby bump in a racy lace catsuit for hysterical skit following pal Alan Carr's Celebrity Traitors win\n\nReal Housewives star's son, 10, to undergo brain procedure after being diagnosed with rare condition\n\nHalsey fans are outraged as pop star is groped onstage by sick fan during Washington DC concert in shock moment\n\nOlivia Rodrigo lashes out at Trump admin for using her song in 'racist' ICE video... and DHS responds\n\nEXCLUSIVERarely-seen country icon Tim McGraw steps out after multiple back surgeries to support nepo-baby daughter\n\nMel C, 51, flaunts her incredibly toned abs in skimpy workout gear as she films steamy new music video\n\nChris Brown 'splashes out an eye-watering £160K during wild night out in London' ahead of his trial in the capital over alleged bottle attack\n\nEXCLUSIVEFor William, it is an open wound that will not heal: After 20-year investigation ANDY WEBB exposes cover-up and secret documents that blow open BBC lies - and how Diana's brother and therapist blame Bashir for her death\n\nDavid Geffen's boytoy ex claims billionaire used to spend '$3m a month' amid messy spousal support battle\n\nStrictly's Amber Davies says she's 'blocking out' the backlash against her dance experience and keeping 'in a bubble' with partner Nikita Kuzmin\n\nGeorge Clooney, 64, names the 2 actors he thinks will become megastars... 30 years after he found fame\n\nKate Hudson and Naomi Watts enjoy a reunion 22 years after they costarred in Le Divorce\n\nI'm A Celebrity... Get Me Out Of Here! full line-up CONFIRMED - with soap, music and comedy legends facing off in 2025 cast\n\nMeghan has always been a terrible actress... but watch the moment she catches Harry completely off guard. It tells you everything about what's next: MAUREEN CALLAHAN\n\nWelcome to sunny Sydney! Princess Anne officially touches down in Australia as her royal visit kicks off - here's where you can meet her\n\nHilary Duff reflects on age-gap relationship after sparking outrage by dating Joel Madden when she was 16\n\nKylie Jenner poses in skimpy bikinis while in the Caribbean with no sign of beau Timothee Chalamet\n\nThe Alan Carr-naissance: How Celebrity Traitors star won over nation after moving on from marriage, Justin Lee Collins friendship, and 'awful' past comments\n\nAMANDA PLATELL: Ruthless Kate has now conquered Meghan, Harry, Andrew and Fergie - and I believe she's not finished\n\nSpanish singer Rosalia turns heads in a quirky feathered ensemble as she arrives at the LOS40 Music Awards 2025 ceremony in Valencia\n\nGemma Collins is laughing all the way to the bank as she rakes in seven-figure sum ahead of her I'm A Celeb All Stars comeback and Dubai move\n\nKim Kardashian fans are alarmed by 'dangerous' detail in new glamorous photos... hours before bar results\n\nGrammy nominations 2026: Sabrina Carpenter, Billie Eilish and Lady Gaga make the cut\n\nChristina Applegate sparks bizarre feud with Real Housewives stars as she calls out 'super gross' behavior\n\nRobert De Niro's meeting with 'anti-Trump' Pope Leo sparks outrage at leader 'fawning over Hollywood stars'\n\nDwayne 'The Rock' Johnson FINALLY reveals how he knew Osama Bin Laden had been killed before the public did\n\nEXCLUSIVE'It would be weird to have a marriage where things don't go up and down, but we're very happy': Keeley Hawes on 21 years of marital bliss with Matthew Macfadyen and the 'privilege of approaching 50'\n\nEXCLUSIVEJames May on partner's accusation, why Jeremy Clarkson and Richard Hammond aren't friends - and why mental health has gone too far\n\nBindi Irwin teases return to US Dancing With The Stars with brother Robert ten years after being crowned Mirrorball champion\n\nModern Family vet Ariel Winter shares heartbreak as beloved dog dies\n\nDenise Richards wins five-year restraining order against estranged husband Aaron Phypers amid abuse claims in bitter divorce battle\n\nEurovision's Sam Ryder to make his West End debut as Jesus in Andrew Lloyd Webber musical - after Cynthia Erivo's casting in the role divided fans\n\nDiddy 'caught drinking moonshine in prison' after telling judge he is sober\n\nTom Ford, 64, reveals the heartbreaking moment he discovered his husband Richard Buckley had died aged 73\n\nCelebrity Traitors winner Alan Carr's Chatty Man talk show 'set for a reboot' as comedian is also tipped to become new Strictly host after surprise victory\n\nDebra Messing's gay fans turn on Will & Grace star after she branded Zohran Mamdani a 'jihadist' in shock attack\n\nDenise Richards' ex Aaron Phypers hits back after actress wins five-year restraining order against him\n\nAliens star Sigourney Weaver, 76, reveals unconventional physical trait that could have hindered her career\n\nBeatrice lands major charity role amid scandal engulfing her family: Princess is named deputy patron of Outward Bound - six years after Andrew quit charity in wake of Newsnight interview\n\nHailey Bieber celebrates Justin's surprise Grammy nominations with sweet clip of son Jack Blues\n\nTaylor misses out on Grammy nominations despite having biggest album of the year\n\nClare Balding says the pack mentality of The Celebrity Traitors was 'cruel' as she insists sports stars were held in a lower regard during roundtables\n\nJames Bond film director Lee Tamahori dies at 75 after long illness\n\nThe Osbournes pay an emotional tribute to late Ozzy as they announce 2026 Grammy nominees in 'categories close to their hearts' after his death\n\nBizarre 'cultural appropriation' row breaks out over new Tom Daley knitting show's 'misrepresentation' of tiny island with just 44 inhabitants\n\nLove Island's Samie Elishi flashes her toned abs in a brown tracksuit as she poses for playful snaps - amid talks for All Stars return\n\nJennifer Lawrence leaves Jimmy Fallon squirming as she repeatedly bursts into tears and WAILS during car crash Tonight Show interview\n\nWhat's REALLY behind return of £1m YouTubers Jonathan Joly and Anna Saccone. They've crept back online after child exploitation and marriage whispers. Now there's a troubling new question, reveals RONAN O'REILLY\n\nWhy Sydney Sweeney can't stop dating MUCH older men... amid Scooter Braun fling\n\nBiggest Grammy snubs and surprises: Lorde and Weeknd shut out as Kylie Jenner's boyfriend scores nod\n\nSugababes star Keisha Buchanan shows off her incredible figure in barely-there plunging tie-up swimsuit in Dubai\n\nKatie Price 'will earn a five figure sum to perform at UK Glamour Awards' after clawing her way back from bankruptcy\n\nClaire Sweeney is set to divide fans as she puts her Christmas tree up a month early\n\nMillie Bobby Brown says she and David Harbour are 'lucky to have each other' after bullying claims\n\nJon Bon Jovi reads Paul McCartney's Hey Grandude! as he is the latest star to take on CBeebies Bedtime Stories\n\nGreg Shepherd reveals his father Gary has died as he pays tribute on social media: 'I will miss you more than you will ever know'\n\nEXCLUSIVEPrincesses Beatrice and Eugenie share an emotional hug after intense conversation on a Mayfair street as disgraced father Andrew was officially stripped of his royal titles\n\nPrince William ends whirlwind tour of Brazil by meeting indigenous leaders at historic Amazon museum in Belém\n\nThe King and the Prince and Princess of Wales pay heartfelt tribute after death of Holocaust survivor Manfred Goldberg aged 95 - hailing his 'extraordinary' courage and 'tireless work' educating young people\n\nCameron Diaz's husband Benji makes rare comments about their daughter as he shares she's a Taylor Swift fan\n\nEXCLUSIVEMillie Bobby Brown and David Harbour are accused of performing an 'OTT comedy double act for the cameras' by body language expert \n\nHow James Corden's thirst for fame 'separated' him and Ruth Jones: Candid emails reveal how Gavin and Stacey creators 'broke-up' after he went to LA to pursue celebrity life\n\nHeir we go again: Harry is accused of 'copying' William after taking part in VERY similar photo opportunity \n\nBBC Breakfast guest pays moving tribute to late co-star Pauline Collins for 'changing his life' - gushing over her 'phenomenal and incandescent' performances\n\nEXCLUSIVEIs All's Fair an own goal for Kim Kardashian? Star risks wrath of industry as aspiring lawyer's new legal drama is blasted for 'perpetuating damaging myths'\n\nMortifying moment Kate Garraway is caught whispering to co-star live on Good Morning Britain - and her microphone picks up EVERYTHING\n\nHunted winner reveals they STILL haven't received prize money from Channel 4 - and got a huge shock behind the scenes\n\nBeloved TV series is BACK after being dropped by Channel 4 despite loyal fanbase - and is just days away from hitting screens\n\nMORE DON'T MISS\n\nCat Burns reveals the 'real reason' she was banished during Celebrity Traitors' dramatic final roundtable \n\nEXCLUSIVEHarry and Meghan were invited to LA Dodgers game by owner who faces backlash 'over links to ICE detention centres'\n\nClaudia Winkleman just wore a very expensive Bella Freud coat for the Celebrity Traitors final - and we've found an M&S version\n\nRoyal expert scathingly likens Meghan Markle to Sarah Ferguson after sparking shock with her new career move\n\nLady Beckham's big blunder: Victoria accidentally reveals glaring error in the suit she designed for David's knighthood\n\n'Disturbing yet delightful' drama with perfect 100% Rotten Tomatoes score wows Netflix viewers with 'awesome lead star and great twists'\n\nKim Kardashian casts Tradwife Nara Smith and her hunky husband Lucky Blue Smith in loved-up SKIMS campaign\n\nRihanna looks stylish in draped brown coat as she and A$AP Rocky leave their Paris hotel - after rapper was hit with $1m lawsuit \n\nSydney Sweeney reveals what 'terrified' her so much she had to get 'drunk' to deal with it\n\nNot such a Chatty Man! Traitors winner Alan Carr looks all partied out as he steps out without his trademark specs after celebrating show finale\n\nTori Spelling looks downcast as she seen for first time since finalizing divorce from Dean McDermott\n\nRussell Howard recalls moment he tried to make Stephen Hawking laugh at party but was 'drowned out' by Jimmy Carr\n\nDavid Harbour avoids being pictured alone with co-star Winona Ryder at Stranger Things final season premiere in LA\n\nLove Island's Antigoni Buxton reveals she is 'so honoured' to be representing Cyprus at Eurovision as she becomes first artist confirmed for 2026\n\nJessie J joins star-studded line-up for Capital's Jingle Bell Ball following cancer diagnosis\n\nFans turn on Raven-Symone after Bill Cosby comments go viral\n\nKaia Gerber shows off her model legs in a short red mini dress and killer heels as she takes to the stage at the Beverly Hilton\n\nWW2 veteran leaves Adil Ray 'mortified' declaring winning the war 'wasn't worth it' because of the nation's sorry state live on Good Morning Britain\n\nAlan Carr's most legendary Celebrity Traitors moments: From murders in plain sight to withering swipes and roundtable trickery\n\nMillie Bobby Brown and David Harbour put on a bizarrely overly affectionate show at Stranger Things party after bullying and harassment claims\n\nNetflix drops first five minutes of Stranger Things' final season - and fans are already in floods of tears\n\n'This is why I pay my TV license!': Celebrity Traitors fans call for Alan Carr to receive a knighthood as 10 million tune in for his surprise victory\n\nDevastating truth about why EastEnders' Letitia Dean has vanished from our screens: JENNIFER RUBY reveals why\n\nStrictly Come Dancing's Balvinder Sopal stuns EastEnders fans as she shares 'massive spoiler' in selfie from BBC set \n\nHelen Flanagan wows in a purple sequin backless gown at awards ceremony in Manchester after taking swipe at ex Scott Sinclair\n\nCoronation Street star shooting final scenes after a whopping 12 years on soap - and has already started a new job worlds away from Weatherfield\n\nReal Housewives star Tanya Bardsley's horrified daughter 'locked on train' after bomb squad called & homes evacuated\n\nNatalia Dyer wows in a sultry red draped dress as she joins her boyfriend Charlie Heaton at the Stranger Things final season premiere\n\nIs Meghan wearing ANOTHER of Diana's watches? Duchess' 'new' very expensive Cartier piece bares striking resemblance to gift 'Dodi brought for late Princess of Wales'\n\nGlen Powell spills all on his awkward naked scene in latest film The Running Man and how he was left red-faced after receiving Tom Cruise's expert advice\n\nMoment Prince William refuses to be drawn on Andrew scandal and Harry and Meghan rift: 'I want to surround myself with people who want to do good'\n\nHyrule Warriors: Age Of Imprisonment is a Zelda spin-off that pits princess against monsters. It's carnage, says our critic\n\nSadie Sink looks incredible in an ab-flashing white bra top and satin skirt as she attends Stranger Things final season premiere in Los Angeles\n\nCelebrity Traitors' David Olusoga shares the REAL reason the 'terrible' Faithful were doomed from the start after 'devilishly difficult' finale\n\nCelebrity Traitors viewers fume 'biggest fix ever!' as they claim 'producers intervened' to ensure Alan Carr's victory\n\nCast of legendary sitcom fuel reboot rumours as they reunite for dinner seven years on from TV axe - and fans roar 'this why we need you back NOW!'\n\nStrictly's Amy Dowden shares health update after second mastectomy as she tunes into Celebrity Traitors from her hospital bed\n\nVogue Williams and Spencer Matthews get in the festive spirit with their three children at Christmas party\n\nMillie Bobby Brown, 21, looks loved-up with husband Jake Bongiovi, 23, at Stranger Things premiere after she praised him as a new dad\n\nBraless footballer Chloe Kelly swaps sheer bejewelled gown for chocolate brown tracksuit as she heads home from Harper's Bazaar Women Of The Year Awards\n\nJonathan Ross reveals the 'horrible' moment that 'took a toll' on Celebrity Traitors champ Alan Carr and left him 'with his head in his hands' - but never made it to screens\n\nPeter Andre, 56, and his wife Emily, 36, cosy up to one another as they lead stars at the Glide Ice Skating launch at Battersea Power Station\n\nEXCLUSIVESo why isn't M&S unwrapping Aimee Lou Wood as the star of its Christmas TV ad? White Lotus actress is dropped\n\nBBC Celebrity Traitors poppy scandal as Charlotte Church and Ruth Codd appear on Uncloaked version of the show without traditional symbol of remembrance\n\nTaylor Swift puts on leggy display in miniskirt and boots for ANOTHER date night with Travis Kelce in New York City\n\nMeghan's Hollywood career comprised seconds-long cameos and bit parts before meeting Prince Harry - as she's set to return to acting after eight years\n\nEXCLUSIVEFrail Bruce Willis, 70, holds carer's hand on very rare public outing amid heartbreaking dementia battle\n\nCheryl steals spotlight in a chic gown as she dazzles alongside Chloe Kelly, Aimee Lou Wood and Gillian Anderson at Harper's Bazaar Women Of The Year Awards\n\nFrom underdog to champion: KATIE HIND on how Alan Carr found his competitive edge and what comes next\n\nEXCLUSIVEBody language expert reveals the truth behind Millie Bobby Brown and David Harbour's 'cheery' reunion amid bullying claim bombshell\n\nAlex Scott stuns in a glitzy 1920s-inspired look as girlfriend Jess Glynne picks her up at midnight from Harper's Bazaar Women of the Year Awards\n\nGillian Anderson stuns in a yellow flowing gown as she joins Jade Thirlwall and America Ferrera leaving the Harper's Bazaar Women Of The Year Awards\n\nKATIE HIND: How 'a bit of a giggle' turned into a Traitors triumph for the Chatty Man... so will presenting Strictly Come Dancing be Alan Carr's REAL prize?\n\nYou look Kate, Letizia! Queen of Spain takes a leaf out of the Princess of Wales's book as she debuts ultra-glamorous glow-up at state banquet in Madrid\n\nDisco Queen! Kate Middleton looks unrecognisable in yellow shorts and rollerblades as she lets her hair down at fundraiser before marrying Prince William\n\nCelebrity Traitors' winner Alan Carr reveals why he broke down in tears after scooping the prize pot and admits he wants to return to the show next year\n\nBlake Lively claims she lost staggering nine-figure amount in damages due to Justin Baldoni drama\n\nThe personal tragedy that still shakes Cristiano Ronaldo: How funeral of the alcoholic father he 'didn't really know' led him to skip Diogo Jota's goodbye for yacht holiday\n\nMillie Bobby Brown reunites with David Harbour atStranger Things premiere... after bullying and harassment claims\n\nGwyneth Paltrow suffers rare beauty FAIL as she snaps filter-free selfie before big event\n\nMillie Bobby Brown and Sadie Sink dazzle as they lead stars at Stranger Things final season premiere in LA\n\nHilary Duff reveals why she never offered to mentor fellow Disney stars Selena Gomez and Demi Lovato\n\nPrince Harry dines with veterans on his pseudo-royal tour - after apologising to Canada for LA Dodgers baseball hat gaffe saying it covered his 'bald spot'\n\nThe Traitors' return date 'REVEALED' as celebrity spin-off comes to an end - and it's sooner than you think\n\nKaty Perry shares the powerful motivation that got her through Orlando Bloom split in new music video\n\nThe curse of Gossip Girl: The biggest scandals involving the stars of the hit series including THAT bitter legal battle, rape charges and drug arrest\n\nHarper's Bazaar Women Of The Year winners: Aimee Lou Wood accepts TV gong as Cheryl makes rare appearance to present to Jade Thirlwall\n\nKourtney Kardashian posts never-before-seen delivery room photo with son Rocky on his 2nd birthday\n\nCelebrity Traitors fans praise final challenge as 'absolute cinema' and 'the campest action sequence in history' as stars race to win\n\nCelebrity Traitors winner Alan Carr apologises publicly to best pal Paloma Faith and insists he 'felt sick inside' for 'murdering' her\n\nGeorge Clooney reveals which Golden Girls star 'made me laugh harder than anybody' during sitcom guest spot\n\nNaomi Watts' daughter Kai Schreiber, 16, is every inch the rebellious teen as she shows off tongue piercing\n\nJennifer Lawrence stuns in clinging black number as she reveals next project takes aim at cancel culture\n\nAll of the highlights from the nail-biting Celebrity Traitors final as treacherous champion is crowned\n\nPauline Collins dies aged 85: Shirley Valentine star passes away 'peacefully' after battle with Parkinson's disease\n\nMade In Chelsea star Frankie Gaff announces arrival of her baby girl - three months after the tragic death of her beloved sister\n\nCelebrity Traitors winner revealed! Epic finale hailed as the 'greatest of all time' after twists and betrayals sees one contestant scoop£87,500 prize\n\nCelebrity Traitors surprise twist as Nick Mohammed turns on 'true Faithful' Joe Marler in the final moments of the series\n\nGeorgia Toffolo pokes fun at husband James Watt's appearance as couple enjoy glamorous date night in Scotland\n\nSofia Richie and husband Elliot Grainge share a steamy kiss as she celebrates his 31st birthday\n\nAnne Heche's son Homer Laffoon, 23, reaches 'agreement' with his late mom's creditors three years after actress' tragic death\n\nCelebrity Traitors star Kate Garraway sells home for £1.7 million - making at least £1M profit - as she fights debts of £800k after death of husband Derek\n\nCelebrity Traitors fans joke Claudia Winkleman's finale outfit is 'Strictly ready' as star rocks dramatic tulle skirt\n\nToday's headlines\n\nBBC bosses quit in disgrace after corporation admits doctoring Donald Trump video and is accused of bias on...\n\nD-Day hero who said sacrifice of the lost men of his generation 'wasn't worth' what the country has become...\n\nMan, 44, who 'sexually assaulted eight-year-old boy in tent' while youngster was on holiday with his family...\n\nHas your Mounjaro weight loss slowed down? This is how you can turbo-charge your jab by using our experts'...\n\nCruel rosacea blighted my life for years. I tried all the solutions, but it was this dermatologist-approved...\n\nGladiator Harry Aikines-Aryeetey is the latest contestant to be booted off Strictly Come Dancing after...\n\nA world away from Royal duty: Prince Harry seems 'fed up of being paraded' and unable to 'stage rictus grin'...\n\n'NYC will become Mumbai', billionaire property magnate rages as his firm plans to leave the city after...\n\nHair loss expert names the trendy hairstyle causing women to go bald: 'It causes repeated stress and...\n\n'We adored her, her death destroyed us... Christine had no idea what was going on': Why Caroline Flack's...\n\nCan't stop clearing your throat? This is the surprising reason why, when you should be worried - and exactly...\n\nLIZ JONES: This was the time to put selfishness and petty squabbles aside. Instead, clown Harry partied with...\n\nTrump promises $2,000 check for every American thanks to tariff revenue he's collected\n\nBritish motorists face being taxed for driving in FRANCE under Rachel Reeves' upcoming pay-per-mile scheme\n\nEmotional King Charles leads impeccable Remembrance Sunday two-minute silence with Prince William, Kate,...\n\nCeltic supporters boo during minute's silence on Remembrance Day as referee ends tribute after just 10...\n\n'He is a bum and a wicked man who brings shame on your country': Inside David Lammy's seven-hour taxi ride...\n\nSophie, Duchess of Edinburgh's touching reason for wearing three poppies on Remembrance Sunday with Queen...\n\nMoment Duchess of Edinburgh Sophie is moved to tears at Remembrance Day service\n\nMoment enormous wave crashes down on ","summary":"The scene was a five star hotel in the Saudi capital which is as notorious as it is opulent.","url":"https://www.dailymail.co.uk/news/article-15270279/titles-Royal-Lodge-Princess-Beatrice-rich-Saudi.html","image":"https://i.dailymail.co.uk/1s/2025/11/07/21/103697777-0-image-m-52_1762549748637.jpg","video":null,"publish_date":"2025-11-10 00:56:25","author":"Editor,Nick Craven","authors":["Editor","Nick Craven"],"language":"en","source_country":"gb","sentiment":-0.16},{"id":377375068,"title":"Trump booed by crowd at NFL game in Washington","text":"Donald Trump has become the first sitting US president in nearly half a century to attend a regular-season NFL game, appearing at the Washington Commanders' contest against the Detroit Lions.\n\nThere were loud boos from some spectators in the stands on Sunday when Mr Trump was shown on the video board late in the first half — standing in a suite with House Speaker Mike Johnson — and again when the president was introduced by the stadium announcer at half-time.\n\nThe jeering continued while Mr Trump read an oath for members of the military to recite as part of an on-field enlistment ceremony during the break in the game.\n\n\"I'm a little bit late,\" Mr Trump told reporters earlier when he got off Air Force One after landing at Joint Base Andrews, following a flyover of Northwest Stadium during the game. \n\nHe then got in his armoured car for the drive to the arena.\n\n\"We're gonna have a good game. Things are going along very well. The country's doing well. The Democrats have to open it up,\" he said — a reference to the government shutdown.\n\nIn the first quarter, before the president arrived, Lions receiver Amon-Ra St. Brown celebrated a touchdown catch by pointing into the stands and moving his arms a la the \"Trump dance\" that several athletes began doing last year.\n\nDuring the third quarter, Mr Trump joined Fox broadcasters Kenny Albert and Jonathan Vilma for about eight minutes of lighthearted chat. Albert opened by asking Mr Trump about his time playing high school football at New York Military Academy.\n\n\"I played tight end, but it was not quite football like this. It was a little bit easier. It wasn't so tough,\" Mr Trump said.\n\nOnly two other times did a president go to an NFL game during the regular season while in office, according to the league: Richard Nixon in 1969 and Jimmy Carter in 1978. \n\nMr Trump became the first president to attend a Super Bowl while residing in the White House when he watched the Philadelphia Eagles beat the Kansas City Chiefs 40-22 in February.\n\nAccording to a report by ESPN on Saturday, an intermediary for the White House told the Commanders' ownership group that Mr Trump wanted the club's new stadium — part of a nearly $4 billion project in the nation's capital at the site of what was known as RFK Stadium — to bear his name.\n\nMr Trump has, from the 80s onwards, sought to become an owner of an NFL team, though he has never succeeded.\n\nHe did, however, become the team owner of the New Jersey Generals in the rival United States Football League (USFL), and led the league in a lawsuit against the NFL to attempt to force a merger, which the USFL nominally won before disbanding soon after.\n\nIn Sunday's TV appearance, Mr Trump spoke about the team's plans to return to Washington.\n\n\"They're going to build a beautiful stadium. That's what I'm involved in, we're getting all the approvals and everything else,\" he said.\n\n\"And you have a wonderful owner, Josh [Harris] and his group, and you're going to see some very good things.\"\n\nSunday's visit was the latest in a series of high-profile appearances at sporting events by Mr Trump, including at golf's Ryder Cup, auto racing's Daytona 500 and tennis' US Open.\n\n\"I just love it. It's a microcosm of life,\" Mr Trump said about sports during Sunday's broadcast.\n\n\"It's sort of like life — the good, the bad and the ugly.\"\n\nBefore the game, Defence Secretary Pete Hegseth chatted with Mr Harris — the leader of the group that purchased the Commanders from Daniel Snyder for about $6 billion in 2023 — and took part in an on-field ceremony with members of the military.\n\nMr Hegseth was among those watching the game with Mr Trump, along with White House chief of staff Susie Wiles, Education Secretary Linda McMahon and Republican Senator Steve Daines of Montana.\n\nThere was friction between Mr Trump and the NFL during his first presidential term, when he objected to players kneeling during the national anthem to protest social or racial injustice. That movement began in 2016 with then-49ers quarterback Colin Kaepernick.\n\nVia social media and other public comments, Mr Trump insisted that players should stand for the national anthem and called on team owners to fire anyone taking a knee.","summary":"Donald Trump is booed by sections of the crowd as he becomes the first sitting US president to attend a regular-season NFL game in nearly half a century.","url":"https://www.abc.net.au/news/2025-11-10/us-president-donald-trump-booed-at-commanders-lions-nfl-game/105991162","image":"https://live-production.wcms.abc-cdn.net.au/a6b342d4720d3ac1da52be873ffc5ace?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-11-10 00:51:27","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"au","sentiment":0.037},{"id":377378920,"title":"BBC chairman expected to apologise for Trump speech edit after Davie resignation","text":"BBC chairman Samir Shah is expected to apologise for the way a speech by Donald Trump was edited for Panorama after several days of pressure on the broadcaster prompted the resignation of director-general Tim Davie.\n\nThe chief executive of BBC News, Deborah Turness, also announced her resignation on Sunday after the corporation was accused of misleading the public following claims that the speech had been selectively edited in the documentary, Trump: A Second Chance?\n\nA memo by Michael Prescott, a former external adviser to the BBC’s editorial standards committee, raised concerns in the summer about the way clips of the US president’s speech on January 6 2021 were spliced together in Trump: A Second Chance? to make it appear he had told supporters he was going to walk to the US Capitol with them to “fight like hell”.\n\nCritics said the documentary, broadcast by the BBC the week before last year’s US election, was misleading and removed a section where the US president said he wanted supporters to demonstrate peacefully.\n\nMr Shah is expected to apologise and provide further details on the Panorama episode on Monday in his response to the Culture Media and Sport Committee which asked how he would address the concerns.\n\nMr Shah said Sunday was a “sad day” for the BBC while committee chairwoman Dame Caroline Dinenage said Mr Davie’s resignation was “regrettable” but “restoring trust in the corporation must come first”.\n\nMr Davie said his departure will not be immediate and that he is “working through” timings to ensure an “orderly transition” over the coming months, while Ms Turness said controversy around the Panorama edit had “reached a stage where it is causing damage to the BBC – an institution that I love”.\n\nIn a statement sent to staff, Mr Davie said his resignation was “entirely” his decision and he was “thankful” to the chairman and board for their “unswerving and unanimous support” during his tenure.\n\nHe said: “Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable.”\n\nThe Culture Secretary Lisa Nandy thanked Mr Davie for his “service to public service broadcasting” and for leading the BBC through a period of “significant change”.\n\nShe said the Government will support the BBC board through the transition and the upcoming charter review will help the corporation to adapt to a new era that “secures its role at the heart of national life for decades to come”.\n\nThe BBC’s Royal Charter, which expires at the end of 2027, sets out the corporation’s mission, public purposes and funding.\n\nMs Nandy said in November last year that the Government would use the review of the charter to consider alternative ways of funding the corporation but ruled out the licence fee being replaced by general taxation.\n\nMs Turness, who has been in the role since 2022, said that she had offered her resignation to Mr Davie on Saturday night adding that, despite mistakes being made, the “recent allegations that BBC News is institutionally biased are wrong”.\n\nIn a message sent to staff, she said she was “proud” of the work they had done adding: “The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC – an institution that I love.\n\n“In public life leaders need to be fully accountable, and that is why I am stepping down.”\n\nThe BBC has been criticised for a number of failings in recent months which include breaching its own accuracy editorial guidelines, livestreaming the controversial Bob Vylan Glastonbury set, as well as misconduct allegations surrounding former MasterChef presenter Gregg Wallace.\n\nLeading politicians have said the BBC must change to rebuild its reputation.\n\nLiberal Democrat leader Sir Ed Davey said the corporation needs “to turn a new leaf” while Conservative Party leader Kemi Badenoch called for “top-to-bottom” reform.\n\nReform UK leader Nigel Farage said it was the BBC’s “last chance”, adding: “I don’t want to abolish the BBC, I make that very clear, but we cannot have the BBC being seen to be our main national news broadcaster if it cannot perform in a straightforward, simple, unbiased way.”","summary":"Culture Secretary Lisa Nandy said she was ‘confident’ BBC bosses would treat allegations of bias seriously.","url":"https://www.standard.co.uk/news/uk/bbc-lisa-nandy-trump-liberal-democrat-government-b1257345.html","image":"https://static.standard.co.uk/2025/11/10/00/1d0c2116e2380f6e47e036e88df1fbadY29udGVudHNlYXJjaGFwaSwxNzYyNzk2ODU5-2.78104220.jpg?width=1200","video":null,"publish_date":"2025-11-10 00:50:22","author":"Lauren Del Fabbro","authors":["Lauren Del Fabbro"],"language":"en","source_country":"gb","sentiment":-0.307},{"id":377373770,"title":"Donald Trump makes stunning flyover for first NFL visit of the season... hours after it emerged he wants $3.7bn new stadium named after him","text":"Donald Trump stunned NFL fans by flying over Northwest Stadium near DC before attending Detroit Lions vs Washington Commanders on Sunday, where he joined Kenny Albert and Jonathan Vilma in the Fox broadcast booth for the third quarter.\n\nTrump became the first sitting president to attend a regular-season NFL game since 1978 and marked his arrival in some style, with Air Force One swooping low over the stadium.\n\nHis attendance, which was met with booing from some of the fans near his suite, came as senators gathered in DC to vote on potentially ending the now 40-day governement shutdown.\n\nTrump was at the game as part of the Washington team's 'Salute to Service' day, a league-wide initiative from the NFL ahead of Veterans Day on November 11. He swore in military members during a halftime service but as he addressed the crowd, looked momentarily taken aback by a feisty reaction from some parts of the 67,000-seater stadium.\n\nTrump seemed in a triumphant mood when he stepped off his plane in DC moments after Air Force One touched down, saying: 'Was that the greatest flyover ever? Nobody’s ever done a flyover like that! They say whoever flies Air Force One, they’re the best pilots. And we just saw that.'\n\nUnfortunately for the President, he wasn't arriving to a close game on Sunday. The Lions bulldozed their way into a 25-10 lead by the halftime interval, with the Commanders missing their star quarterback Jayden Daniels, who dislocated his elbow last week.\n\n'The backup quarterback (Marcus Mariota) is a good quarterback and he has some very good games,' Trump said in the broadcast booth. 'The first string quarterback (Daniels) has potential to be a great quarterback, he has got to stop the injuries somehow.'\n\nTrump discussed his own football career in the military academy, joking that by admitting he never scored a touchdown, he is proving that he doesn't tell lies.\n\n'I played tight end, I loved playing football,' he said. 'I loved the Jets and I loved the Giants. We had a couple of Super Bowls with the Giants, with the Jets it is taking a little bit of time.'\n\nAsked about his love of sports, Trump said: 'It's a microcosm of life, it's sort of like life. The good, the bad and the ugly. \n\n'But you can equate sports with life, you have the triumph and you have the problems and you have to get through the problems to hit the triumphs and you can never quit, you can never give up.'\n\nTrump then discussed the improvements he has overseen in hist first year as President, moments before Commanders quarterback Mariota threw a touchdown pass to Deebo Samuel. It meant the Commanders were now trailing by 16, in a 32-16 scoreline.\n\nWe're doing great, just like they have to do great right now. Let's see what happens' Trump said, moments before Mariota picked out Samuel. 'There you go, see! That was very important. A little ways to go yet but that was very important.'\n\nBut while it was Detroit bringing the action on the field, there were plenty of football fans who thought the best moment came from the sky in the first half. \n\n'People have no idea how huge Air Force One is, this must have been incredible,' one fan wrote in response to the footage on social media.\n\nAnother wrote: 'Epic display of patriotism and a reminder of what true leadership looks like. Flyover was a perfect tribute to the brave folks serving our country.'\n\nTrump took his seat for the game with Secretary of Commerce Howard Lutnick, Speaker of the House Mike Johnson, White House Chief of Staff Susie Wiles and Secretary of Education Linda McMahon.\n\nAccording to a report by ESPN on Saturday, an intermediary for the White House has told the Commanders´ ownership group that Trump wants the club's new stadium to bear his name.\n\nUnder a deal announced in April between the team and the District of Columbia, the team will return to the nation's capital in a new stadium expected to cost nearly $4bn. \n\nIt will be built on the site of the RFK Stadium, where the team played for more than three decades when it won three Super Bowls in the 1980s and 1990s. \n\n'That would surely be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible,' said Karoline Leavitt, press secretary for the Republican president. \n\nIn July, Trump threatened to hold up the deal by insisting that the team change its name from the Commanders back to the Redskins, a name that was considered offensive to Native Americans.\n\nTrump has long enjoyed having his name appear on things from his career as a real estate developer, from high-rise buildings, hotels and golf courses to his branding deals that have seen Trump-emblazoned Bibles, watches and cologne.\n\nAs Trump boarded Air Force One in West Palm Beach on Sunday afternoon after a morning golfing in Florida, extra security measures were put in place hours before kick off at Northwest Stadium.\n\nOfficers in black secret uniforms identifying them as members of the Secret Service joined military, police and other guards inside and outside Northwest Stadium. There were more fences than usual blocking sidewalks and some pathways were restricted.\n\nOnly two other times did a president go to an NFL game during the regular season while in office, according to the league: Richard Nixon in 1969 and Jimmy Carter in 1978.\n\nTrump became the first president to go to a Super Bowl while in the White House when he watched the Philadelphia Eagles beat the Kansas City Chiefs 40-22 in February.\n\nSunday's visit to Northwest Stadium in Landover, Maryland, would be the latest in a series of high-profile appearances at sporting events by Trump, including golf's Ryder Cup, auto racing's Daytona 500 and tennis' US Open.\n\n'We are honored to welcome President Trump to the game as we celebrate those who have served and continue to serve our country,' Commanders club president Mark Clouse said.\n\n'The entire Commanders organization is proud to participate in the NFL's league-wide Salute to Service initiative, recognizing the dedication and sacrifice of our nation's veterans, active-duty service members, and their families this Sunday.'\n\nThere was friction between Trump and the NFL during his first presidential term, when he objected to players kneeling during the national anthem to protest social or racial injustice. That movement began in 2016 with then-49ers quarterback Colin Kaepernick.\n\nVia social media and other public comments, Trump insisted that players should stand for the national anthem and called on team owners to fire anyone taking a knee.","summary":"Trump was seen arriving at the Commanders' showdown with the Lions just hours after it emerged he wants the Washington team to name their new $3.7billion stadium after him.","url":"https://www.dailymail.co.uk/sport/nfl/article-15274267/donald-trump-commanders-stadium-washington-nfl.html","image":"https://i.dailymail.co.uk/1s/2025/11/09/22/103733117-0-image-m-14_1762728012785.jpg","video":null,"publish_date":"2025-11-10 00:49:16","author":"Editor,Jack Bezants,Max Winters","authors":["Editor","Jack Bezants","Max Winters"],"language":"en","source_country":"gb","sentiment":0.037},{"id":377379954,"title":"Jimmy Kimmel's wife Molly reveals strain with family: 'It hurts me so much'","text":"Jimmy Kimmel's wife Molly McNearney opened up on the family strain she is currently experiencing during an episode of the We Can Do Hard Things podcast. The executive producer says her husband's feud with Donald Trump has made it hard to deal with her conservative Trump supporting relatives. \"It's definitely been challenging,\" she admitted. \n\n \"It hurts me so much because of the personal relationship I now have where my husband is out there fighting this man,\" she added. \"And to me, them voting for Trump is them not voting for my husband and me and our family,\" she continued. \n\nShe went on to reveal that \"unfortunately,\" she has \"lost relationships with people in my family because of it.\"\n\n\"This is not just Republican versus Democrat for me anymore,\" she added. \"It is, to me, it's family values and it's really hard for me because I grew up believing in these Christian ideals of taking care of the sick and taking care of the poor and I don't see that happening with this Republican party.\"\n\n\"I feel like I'm kind of in constant conflict and I'm angry all the time, which isn't healthy at all,\" she continued. \"But I personalize everything now. When I see these terrible stories every day, I'm immediately mad at certain aunts, uncles, cousins who put him in power. And it's really hard.\"\n\nDuring the podcast, Jimmy also took the time to address Jimmy Kimmel Live!'s suspension in September, saying that while he was faced with the very real possibility of his show never returning, he still wanted to end things \"on my terms.\"\n\n\"If I'd not been allowed back on the air, I'd be a martyr,\" he said. \"It's not a terrible position to be in as a comedian, [but] it's not the position I wanted to be in. And it's also not the way I wanted the show.\" He revealed having extensive discussions with Molly, also the co-head writer and executive producer of his show, about how they'd handle things if that was to be their curtain call.\n\n\"I want to end it in a graceful way. I want to have a farewell party with our staff. I want to do all those things,\" he continued, adding that he wanted to \"say the things that I want to say to people,\" but the idea of having it all shut down \"abruptly, and unjustly, would have been awful. It's just not how you want it to go.\" Reflecting on his tenure with the show, he continued: \"I've been doing this show for almost 23 years, it'll be 23 years in January.\"","summary":"Jimmy Kimmel's wife Molly McNearney opened up on the family strain she is currently experiencing during an episode of the We Can Do Hard Things podcast. See details.","url":"https://www.hellomagazine.com/celebrities/866585/jimmy-kimmels-wife-molly-reveals-strain-with-family-it-hurts-me-so-much/","image":"https://58v76y8z87lo.hellomagazine.com/horizon/landscape/7bcdaeca0675-gettyimages-2235449929.jpg","video":null,"publish_date":"2025-11-10 00:45:32","author":"Faye James","authors":["Faye James"],"language":"en","source_country":"gb","sentiment":-0.511},{"id":377380418,"title":"Strategically evolving economic interests","text":"In recent months, Pakistan has entered a renewed phase of engagement with the United States, characterised by expanding bilateral economic cooperation and commitments of investment in the country’s mining and energy sectors.\n\nIslamabad’s participation in the Gaza peace accord brokered by Washington has also strengthened political and diplomatic collaboration between the two nations.\n\nPakistan’s renewed outreach to the US is hardly surprising given its trade dynamics. The US remains its single largest export market after Europe, where Pakistan maintains a consistent trade surplus; for a long time, it also was a major source of foreign direct investment in the country alongside the European Union and the United Kingdom until China replaced it with large investments in energy, port and transport infrastructure under the China Pakistan Economic Corridor (CPEC) during the last decade.\n\nNot just that, analysts say, Wash-ington’s support has traditionally been considered crucial, given Islamabad’s continued reliance on financial support from multilateral institutions like the International Monetary Fund (IMF) and the World Bank, controlled by the western powers, for repeated bailouts for its external sector stability.\n\n Islamabad’s new balancing act is being closely monitored in Beijing, where Pakistan’s apparent tilt towards Washington has raised questions, if not caused unease\n\nThe goodwill of the country’s present military and political leadership with the current US administration of President Donald Trump has helped Islamabad secure a slightly better tariff deal compared to regional competitors, enabling Pakistan to retain and expand its export share in the world’s single largest market of consumer goods.\n\nWhile analysts view Pakistan’s renewed economic and diplomatic engagement with the US after more than a decade as a positive development, they also caution that it could pose a new foreign policy challenge for Islamabad given its deepening strategic alliance with China. They note that the reset in ties with Washington will be tested by Pakistan’s close relations with Beijing, which could pull the country in conflicting directions and require a careful diplomatic balancing act.\n\nBesides direct investment in infrastructure, Pakistan’s dependence on China for finished goods as well as raw and intermediary materials has increased manifold over time. Today, China stands as Pakistan’s largest trading partner and principal source of imports — excluding energy and edible oil — of around $20 billion or more.\n\nIt is the country’s single largest investor and bilateral creditor, extending critical balance-of-payments support through currency swap arrangements, deposits kept with the central bank and debt rollovers. More than half of Pakistan’s bilateral external debt, nearly $24bn, is owed to China. Beijing also remains indispensable for Pakistan in technology transfer and as the primary supplier of military hardware and support.\n\nThough the country’s civil and military leadership has pledged not to “sacrifice one friend for another”, analysts argue that it is easier said than done. Some China watchers, including Dr Mahmood-ul-Hassan Khan, President of the Centre for Knowledge and Public Policy, say Islamabad’s new balancing act is being closely monitored in Beijing, where Pakistan’s apparent tilt towards Washington has raised questions, if not caused unease.\n\nDr Khan maintains that Pakistan’s alleged offer to the US to build a new deep-sea port at Pasni, barely a hundred kilometres from the Gwadar Port developed by China under the CPEC initiative, and Islamabad’s silence on the matter have fuelled speculation in Beijing. He further points out that the expanding Pakistan-US cooperation in rare earth minerals and China’s growing concerns over the security of its workers in Pakistan have raised serious doubts about the future development of Gwadar and the next phase of CPEC.\n\nThis became evident from the outcome of last month’s meeting of the CPEC Joint Cooperation Committee (JCC) in Beijing, which ended without resolving key issues related to the security of Chinese personnel and payments to Chinese Independent Power Producers (IPPs), two major irritants hampering fresh Chinese investment in the country.\n\nCommitments for major projects such as the ML-1 railway upgrade also remain pending. The dispute over payments to Chinese IPPs persists, as Islamabad has sought to extend the repayment schedule. On the ML-1 project, Beijing has demanded a firm financial commitment from Pakistan before moving ahead with any agreement, particularly in light of the ongoing IMF programme.\n\nEven so, the meeting was hailed as a milestone for marking the formal start of CPEC Phase II. Yet, attracting fresh Chinese investment will remain difficult unless these long-standing concerns are addressed, Dr Khan cautions.\n\nPlanning Minister Ahsan Iqbal’s proposal to hold JCC meetings every six months and convene Joint Working Groups quarterly during the first three years of CPEC Phase II underscores the delays and bottlenecks that continue to impede the corridor’s progress. Analysts argue that institutional strengthening, the resolution of pending issues, and enhanced security for Chinese personnel remain essential to sustain momentum and move Phase II forward.\n\nDr Khan advises that Pakistan must take the Chinese policymakers into confidence to urgently dispel growing concerns that Islamabad is warming up to Washington at the expense of its strategic partnership with its time-tested friend.\n\n“Pakistan has to navigate its foreign policy challenges in a global geopolitical environment that is marked by growing multipolarity but weakening multilateralism and increasing US-China competition. The durability of this China-Pakistan partnership hinges on Islamabad’s ability to address these pressing concerns.”\n\nAnalysts say Pak-US ties have been transactional and cyclical in nature, often fluctuating between estrangement and benign engagement. Washington has viewed Islamabad through a transactional lens, one largely shaped by its interests in the region, and has not hesitated to impose sanctions whenever those interests diverged.\n\nThe most consequential factor today is America’s policy of containing China and its strategy to rally countries behind efforts to counterbalance Beijing’s growing global influence, analysts observe.\n\n“Pakistan’s relationship with China, by contrast, is strategic, historic, trouble-free and remains pivotal to the country’s foreign policy. While Islamabad may seek to strike a balance between the two powers, it cannot afford to be part of any anti-China strategy. This constraint limits the scope for expanding relations with Washington beyond a certain threshold,” concludes Dr Khan. \n\nPublished in Dawn, The Business and Finance Weekly, November 10th, 2025","summary":"In recent months, Pakistan has entered a renewed phase of engagement with the United States, characterised by expanding bilateral economic cooperation and commitments of investment in the country’s mining and energy sectors.\n\n\n\nIslamabad’s participation in the Gaza peace accord brokered by Washington has also strengthened political and diplomatic collaboration between the two nations.\n\n\n\nPakistan’s renewed outreach to the US is hardly surprising given its trade dynamics. The US remains its single largest export market after Europe, where Pakistan maintains a consistent trade surplus; for a long time, it also was a major source of foreign direct investment in the country alongside the European Union and the United Kingdom until China replaced it with large investments in energy, port and transport infrastructure under the China Pakistan Economic Corridor (CPEC) during the last decade.\n\n\n\nNot just that, analysts say, Wash­ington’s support has traditionally been considered crucial, given Islamabad’s continued re","url":"https://www.dawn.com/news/1954099/strategically-evolving-economic-interests","image":"https://i.dawn.com/large/2025/11/69109f5138b4f.jpg","video":null,"publish_date":"2025-11-10 00:43:22","author":"Nasir Jamal","authors":["Nasir Jamal"],"language":"en","category":"business","source_country":"pk","sentiment":0.237},{"id":377375690,"title":"Is America's Longest Shutdown Finally Ending? Senate Reaches Deal to Reopen Government","text":"A bipartisan group of US senators has reached an agreement to fund the government through January 30, potentially bringing an end to the 40-day shutdown — the longest in American history. According to a source familiar with the matter, quoted by CNN, there are enough members of the Senate Democratic Caucus prepared to advance the plan and reopen the government. The agreement — negotiated in part by Senators Angus King, Jeanne Shaheen and Maggie Hassan, alongside several Republican senators — has \"more than enough\" members of the Senate Democratic Caucus to advance, according to two people familiar with the matter who spoke on condition of anonymity. The US Senate is preparing to vote on the Bill on Sunday night. Also Read: 'People Are Really Hurting' - How the Longest Government Shutdown in History Hit Americans If passed, the vote will advance a House-approved stopgap funding measure. The broader deal would fund key departments — including the Department of Agriculture, the Food and Drug Administration, the Department of Veterans Affairs, and military construction projects — for the remainder of the fiscal year. It would also cover the operations of Congress. All other federal agencies would remain funded through January 30, under the text of the continuing resolution released on Sunday. As part of the agreement, Senate Majority Leader John Thune has pledged to give Democrats a vote in December on extending Affordable Care Act subsidies set to expire at the end of the year, with Democrats determining the version of the extension bill that will go before the chamber. The deal also ensures that federal employees furloughed during the shutdown will be re-hired and receive back pay once government operations resume. Reacting to the development, President Donald Trump told reporters that it looked like the government shutdown was \"getting close\" to ending. \"It looks like we're getting close to the shutdown ending,\" the President said upon arriving back to the White House on Sunday evening. \"You'll know very soon.\" The vote marks the most significant step yet toward resolving the longest government shutdown in US history. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Under the agreement, previously fired federal employees would be reinstated, and new provisions would be introduced to prevent similar dismissals in the future","url":"https://www.timesnownews.com/world/us/us-news/us-government-shutdown-update-senate-vote-deal-democrats-republicans-article-153125697","image":"https://images.timesnownews.com/thumb/msid-153125700,thumbsize-85884,width-1280,height-720,resizemode-75/153125700.jpg","video":null,"publish_date":"2025-11-10 00:36:39","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.046},{"id":377375714,"title":"Was Trump Booed at the Commanders Game? What Really Happened at the Stadium | WATCH VIDEO","text":"President Donald Trump attended the Washington Commanders' home game against the Detroit Lions on Sunday at Northwest Stadium in Landover, Maryland, as part of the NFL's Salute to Service initiative honoring military veterans. Trump began his day golfing in Florida before flying to Washington to join the event. He was expected to sit with Commanders principal owner Josh Harris, who has been working with D.C. officials and the White House to secure approval for a new stadium at the old RFK Stadium site in the capital. Speaking to reporters before his departure, Trump praised the pregame ceremony. \"I just want to say, was that the greatest flyover ever? Nobody's ever done a flyover like that,\" he said. Commanders club president Mark Clouse said earlier in the week: \"We are honored to welcome President Trump to the game as we celebrate those who have served and continue to serve our country. The entire Commanders organization is proud to participate in the NFL's league-wide Salute to Service initiative, recognizing the dedication and sacrifice of our nation's veterans, active-duty service members, and their families this Sunday.\" Trump became the first sitting president to attend an NFL regular-season game since Jimmy Carter in 1978. He had previously attended Super Bowl LIX between the Philadelphia Eagles and the Kansas City Chiefs. Was Trump Booed at the Stadium? Reports suggest the president received a mixed reaction from the crowd. The Associated Press said boos were heard when a video of Trump was shown at the stadium, while Fox News reported he was \"booed heavily\" as he arrived. Amon-Ra St. Brown Hits the Trump Dance Detroit Lions star Amon-Ra St. Brown added a lighter moment to the evening. After a touchdown, he and his teammates were seen mimicking Trump's signature dance, drawing laughter from fans. Despite the controversy, the atmosphere in the stadium remained lively as the NFL's tribute to service members continued. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Trump became the first sitting president to attend an NFL regular-season game since Jimmy Carter in 1978","url":"https://www.timesnownews.com/world/us/us-news/trump-booed-washington-commanders-game-watch-videos-article-153125657","image":"https://images.timesnownews.com/thumb/msid-153125658,thumbsize-44762,width-1280,height-720,resizemode-75/153125658.jpg","video":null,"publish_date":"2025-11-10 00:34:51","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":0.482},{"id":377376476,"title":"US Senate to vote on bill that would end federal shutdown","text":"Sunday marked day 40 of the shutdown, disrupting federal operations, food aid, travel and potentially Thanksgiving air travel. (EPA Images pic)\nWASHINGTON: The US Senate on Sunday moved toward a vote on reopening the federal government amid optimism that an end to the historic shutdown, now in its 40th day, is within reach.\nSenators expect a Sunday night vote on advancing a House-passed bill that will be amended to combine the short-term funding measure, which would fund the government through January 2026, with a package of three full-year appropriations bills, Senate Majority leader John Thune said.\nThe amended package would still have to be passed by the House of Representatives and sent to President Donald Trump for his signature, a process that could take several days.\nSenate Democrats so far have resisted efforts to pass a funding measure, aiming to pressure Republicans to agree to healthcare fixes that would include extending expiring subsidies under the Affordable Care Act. Under the deal being discussed, the Senate would agree to hold a separate vote later on the subsidies.\nUS senator Richard Blumenthal, a Democrat, told reporters that he would vote against the funding measure but suggested there could be enough Democratic support to pass it.\n\"I am unwilling to accept a vague promise of a vote at some indeterminate time, on some undefined measure that extends the healthcare tax credits,\" Blumenthal said.\nSunday marked the 40th day of the shutdown, which has sidelined federal workers and affected food aid, parks and travel, while air traffic control staffing shortages threaten to derail travel during the busy Thanksgiving holiday season late this month.\nSenator Thom Tillis, a Republican from North Carolina, said the mounting effects of the shutdown have pushed the chamber toward an agreement.\nHe said the final piece, a new resolution that would fund government operations into late January, would also reverse at least some of the Trump administration's mass layoffs of federal workers.\n\"Temperatures cool, the atmospheric pressure increases outside and all of a sudden it looks like things will come together,\" Tillis told reporters.\nShould the government remain closed for much longer, economic growth could turn negative in the fourth quarter, especially if air travel does not return to normal levels by Thanksgiving, White House economic adviser Kevin Hassett warned on the CBS \"Face the Nation\" show. Thanksgiving falls on Nov 27 this year.\nTrump takes aim at healthcare subsidies\nThe wrangling on Capitol Hill came as Trump on Sunday again pushed to replace subsidies for the Affordable Care Act's health insurance marketplaces with direct payments to individuals.\nThe subsidies, which helped double ACA enrolment to 24 million since they were put in place in 2021, are at the heart of the shutdown. Republicans have maintained they are open to addressing the issue only after government funding is restored.\nTrump took to his Truth Social platform on Sunday to blast the subsidies as a \"windfall for Health Insurance Companies, and a DISASTER for the American people\", while demanding the funds be sent directly to individuals to buy coverage on their own.\n\"I stand ready to work with both Parties to solve this problem once the Government is open,\" Trump wrote.\nUS treasury secretary Scott Bessent and Senator Lindsey Graham, a staunch Trump ally, said in separate TV interviews that Trump's healthcare idea would not be introduced before lawmakers pass a federal funding measure.\n\"We're not proposing it to the Senate right now,\" Bessent said in an interview with ABC's \"This Week\" programme. \"We are not going to negotiate with the Democrats until they reopen the government.\"\nAmericans shopping for 2026 Obamacare health insurance plans are facing a more than doubling of monthly premiums on average, health experts estimate, with the pandemic-era subsidies due to expire at the end of the year.\nRepublicans rejected a proposal on Friday by Senate Minority Leader Chuck Schumer, a Democrat from New York, to vote to reopen the government in exchange for a one-year extension of tax credits that lower costs for plans under the Affordable Care Act, often referred to as Obamacare.\nDemocratic Senator Adam Schiff said on Sunday he believed Trump's healthcare proposal was aimed at gutting the ACA and allowing insurance companies to deny coverage to people with pre-existing conditions.\n\"So the same insurance companies he's railing against in those tweets, he is saying, 'I'm going to give you more power to cancel people's policies and not cover them if they have a pre-existing condition,'\" Schiff said on ABC's \"This Week\" programme.","summary":"The House bill will be amended to merge short-term government funding through January 2026 with three full-year appropriations bills.","url":"https://www.freemalaysiatoday.com/category/business/2025/11/10/us-senate-to-vote-on-bill-that-would-end-federal-shutdown","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/49d6ec49-us-capitol-05112025.webp","video":null,"publish_date":"2025-11-10 00:34:43","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.394},{"id":377380822,"title":"Senate Democrats reach bipartisan deal that could end government shutdown","text":"A bipartisan deal has been reached that could end the government shutdown, according to a source familiar with the negotiations. The source tells Scripps News that the deal was led by Senators Angus King, Jeanne Shaheen and Maggie Hassan — all of whom previously served as governors — and there are now enough Democratic caucus members in support of the plan to move it forward.The agreement would fund the government through Jan. 30, setting up another deadline early next year. It also guarantees a December vote on an Affordable Care Act bill chosen by Democrats, and advances a bipartisan minibus to reverse shutdown-related workforce cuts, restore back pay and protect against similar actions in the future.The proposal also includes full SNAP funding through fiscal year 2026, after the program was put at risk during the shutdown.A vote is expected to take place Sunday night. It would need 60 votes in the Senate to pass before going back to the House for approval. It would then need President Donald Trump's signature. Scripps News has reached out to House Speaker Mike Johnson's office to find out if he supports the new framework. The government shutdown began on Oct. 1 and is now the longest on record. The Senate has voted more than a dozen times to end it, but most Democrats have held out over concerns that Affordable Care Act subsidies will expire at the end of the year. Democrats want to extend the tax credits, while Republicans say they are open to negotiating health care policy — but only after the government is reopened.","summary":"A bipartisan deal has been reached to the the government shutdown, according to a source familiar with the negotiations.","url":"https://www.scrippsnews.com/politics/congress/senate-democrats-reach-bipartisan-deal-to-end-government-shutdown","image":"https://ewscripps.brightspotcdn.com/dims4/default/932805f/2147483647/strip/true/crop/1024x538+0+71/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F94%2F60%2F0c2065fe4ce7a341fe4584f4afaa%2Fap25265647180434.jpg","video":null,"publish_date":"2025-11-10 00:34:02","author":"Joe St. George,Nathaniel Reed","authors":["Joe St. George","Nathaniel Reed"],"language":"en","category":"politics","source_country":"us","sentiment":-0.32},{"id":377371970,"title":"The talk of the town...","text":"Back in 2012 a colleague and I went to see a central minister. He had been one for a decade. We asked him what was happening. He said nothing is happening, we are in ‘relax’ mode.\n\nHe told us that life now was like the last 90 minutes on a long flight. You are tired and can’t engage even with a movie. All you want is to go home and relax. He said his plan was to sit on his verandah and watch the river flow by. It was a perfectly reasonable feeling after two general elections and ten years in office.\n\nThe question now is: have three general elections and eleven plus years in office put the Modi government in ‘relax’ mode? And although members of the government deny it, it’s certainly beginning to look like it.\n\nThe ‘been there, done that’ sort of boredom appears to have set in. Ministers now are better informed than their officials. That shows how long they have been at it.\n\nThe result is policy inaction — what the BJP used to call policy paralysis during 2011-14 — of increasingly noticeable proportions. The third Modi government has been in office for 18 months and people are starting to ask what it has to show for it.\n\nThe rationalisation of the GST rates a couple of months ago could be seen as a big deal. And it was. But other than that it’s hard to point to something with any great conviction or confidence.\n\nThe government seems content to be treading water. One wonders why.\n\nWhy the pause?\n\nPeople, as is their wont, come up with many explanations, none of them mutually exclusive. The most common one is exhaustion. It’s hard to keep up the tempo, it’s said. They say even Indira Gandhi in her 1980-84 innings did almost nothing.\n\nAnother popular explanation is that Modi has lost interest because he knows he may have to step down as prime minister. The timing of this momentous event is not known but anyone who’s about to retire seldom exerts him or herself too much. Better to just remain in maintenance mode than to try new things, the credit for which will anyway go to the successor.\n\nA third explanation is the prevailing uncertainty caused by Donald Trump’s trade policies. This theory says Modi is as shell-shocked now as he was for a few months after the results of the last general election were announced. The BJP had lost its absolute majority then.\n\nA fourth explanation is related to this that the allies of the BJP in the NDA prefer a “don’t-rock-the-boat” approach because they don’t have much skin in the national game.\n\nA fifth explanation has to do with the Bihar assembly elections, after which the government will unleash a wave of reforms. But then, within a few months, we have the Assam, Kerala Tamil Nadu and West Bengal elections. So if assembly elections are the reason we can forget about reform forever.\n\nA sixth explanation has to do with the RSS which is opposed to major economic reforms, especially to labour laws.\n\nThere are probably many more reasons that I have not heard. Regardless, everyone seems to agree that the government is in a ‘relax’ mode.\n\nThe risks of ‘relax’ mode\n\nA famous cricketer once said a captain has to keep doing things on the field even when the game is fully under control because if he leaves it be, the game can very quickly slip away. Countless captains have discovered this too late.\n\nThe UPA also discovered it in 2012. It had won nicely in 2009. It had conducted the Commonwealth Games admirably in 2010. And it brought in a lot of growth.\n\nBut in late 2011, the Congress leaders went into ‘relax’ mode. By the middle of 2013 they were on the skids and in 2014 they managed to win just 44 seats, down from 207.\n\nEveryone knows that the single biggest problem facing the country today is the reluctance of the private sector to invest in factories. This is what the government has to tackle between now and 2029 and there are three things it must do.\n\nFirst, it must free up the labour market by completely overhauling the laws that currently govern it. They are out of date.\n\nSecond, it must make land acquisition easier and cheaper by amending the relevant acts. These are huge impediments to investment.\n\nThird, it must reform the bureaucracy by overhauling the constitutional protections it enjoys. These are out of date and counterproductive.\n\nIt’s up to the prime minister now to take the initiative. The alternative is unthinkable now. But it’s there waiting in the wings with the hundreds of millions of unemployed youngsters.\n\nPublished on November 10, 2025","summary":"...18 months into its third term, the government seems bored. The rationalisation of GST rates apart, it’s hard to point out any major reforms","url":"https://www.thehindubusinessline.com/opinion/the-talk-of-the-town/article70260156.ece","image":"https://bl-i.thgim.com/public/incoming/yz4stu/article70260160.ece/alternates/LANDSCAPE_1200/Construction02.JPG","video":null,"publish_date":"2025-11-10 00:30:00","author":"Tca Srinivasa Raghavan","authors":["Tca Srinivasa Raghavan"],"language":"en","source_country":"in","sentiment":-0.034},{"id":377379428,"title":"Trump Takes Over Broadcast Booth For Sunday NFL Matchup","text":"President Donald Trump took over the broadcast booth while attending a Sunday night football game between the Washington Commanders (formally Redskins) and the Detroit Lions.\n\nAhead of Veterans Day, Trump attended the Salute to Service game on Sunday. The president appeared in the Fox Sports broadcast booth where he did some play-by-play and recounted his football career. (RELATED: Trump Says There’s ‘Big Clamoring’ For Washington Commanders To Change Name ‘IMMEDIATELY’)\n\n“I will say that your second string, your backup quarterback, is a good quarterback, and he’s had some very good games for you, and your first string quarterback has the potential, I think, to be a great quarterback, he’s got to stop the injuries somehow,” Trump said, as he made his NFL primetime play-by-play debut. “And let’s see, we have a very important, I think this is a very important couple of plays. Here we go.”\n\nAt the time Trump was doing play-by-play, the Commanders were in the Red Zone, with the ball inside the Lion’s ten yard line.\n\n“This is a very big play, don’t you think?” the president continued. “I think they have to get a touchdown. Let’s put it differently. They have to get a touchdown.”\n\n .@POTUS does a little on-air play-by-play during the @Commanders–@Lions game 🤣 pic.twitter.com/P9LLeLQNLZ — Rapid Response 47 (@RapidResponse47) November 9, 2025\n\n .@POTUS: “I played tight end, but I mean it was not quite football like this… we had a quarterback who didn’t have a very strong arm. I would say 10 yards was a long pass.” 🤣pic.twitter.com/FHVroAAhPI — Trump War Room (@TrumpWarRoom) November 9, 2025\n\nThe Fox Sports hosts informed Trump that they had looked up his high school football stats, causing the president to recount his career.\n\n“You go way back with the sport of football. You played at New York Military Academy,” Kenny Albert said to the president.\n\n“How old were you when you started playing football, and what were some of the life lessons you took out of it?” Albert asked.\n\n“We had a quarterback who didn’t have a very strong arm, I would say 10 yards was a long pass,” Trump said.\n\n“We had a good time, and I loved it. I actually loved playing football. We had a good time with it,” he continued, as the Fox Sports broadcast displayed a team photo from Trump’s childhood and highlighted the president.\n\nESPN reported that there has been backchannel talk between the White House and the Washington Commanders to name their stadium after Trump. The president has previously expressed interest in getting the team to change their name back to the Redskins.\n\n“That would surely be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible,” White House press secretary Karoline Leavitt told CNN in a statement about the discussions.","summary":"'I think this is a very important couple of plays'","url":"https://dailycaller.com/2025/11/09/donald-trump-national-football-league-detroit-lions-washington-commanders/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F11%2FScreenshot-2025-11-09-at-6.53.12%E2%80%AFPM-e1762732429973.png","video":null,"publish_date":"2025-11-10 00:28:07","author":"Reagan Reese","authors":["Reagan Reese"],"language":"en","source_country":"us","sentiment":0.034},{"id":377379854,"title":"President Attends Commanders Game, But It Was the Lions Doing the Trump Dance","text":"There was no Jayden Daniels for the Washington Commanders on Sunday. Instead, fans at Northwest Stadium got President Donald Trump saluting them and the team during Veterans Day ceremonies. Trump became the first sitting president since 1978 to attend an NFL regular-season game. It came a year after becoming the first sitting president to attend a Super Bowl (LIX in New Orleans). Trump: Setting Recruitment Records After halftime ceremonies in which Trump swore in new United States service members, he talked to Fox Sports. \"We just swore in a tremendous group of young people, and that was an honor, and they are just fantastic, and they love them. You know, our recruitment's been record-setting since a year ago was a disaster for the country, and now it's record-setting,\" Trump said. \"So this was an honor to be here.\" Trump addressed no significant policy issues, but he did talk about sports. Because he loves sports. He mentioned his days as a high school tight end and his ability (or inability) back then to score touchdowns. \"I'm not sure I had any, I'm sure. It's a long time ago.\" Trump said, jokingly adding, \"At least you realized that I never tell a lie, right?\" Trump Rooted For Jets, Giants Trump, a lifelong New Yorker, said he rooted for both the Jets and Giants. \"I love the Jets, and I love the Giants,\" he said. \"I had a lot of friends, Bob Tish, and some people that owned the Giants at the time, as we're going along and progressing. And, you know, look, we had a couple of Super Bowls with the Giants. The Jets have been having a little bit of a hard time. [Club owner] Woody [Johnson} is a great guy. \"He's a great friend of mine, they'll get it together.\" In the second quarter, Lions receiver Amon-Ra St. Brown scored on a 9-yard pass from quarterback Jared Goff. Although he plays for the visiting team, St. Brown pointed to the fans and seemingly encouraged them to join in his TD celebration. The receiver broke out the Trump Dance, which was quite popular around the NFL and college football in 2024. The St. Brown celebration was a sight to see. Trump: 'Never Give Up' Trump spoke about the importance of sports. \"I just love it,\" the President said. \"It's a microcosm of life. It's sort of like life, you know, the good, the bad, and the ugly, right? You can equate sports with life, you know. You have the triumphs and you have the problems. And you have to get through the problems to get the triumphs. \"And you can never quite and never give up.\" Trump, as he often does, spent much of the weekend in Florida. And he left for the game from West Palm Beach on Sunday afternoon even as players and coaches were already on site warming up and preparing for the game. (He doesn't have to worry about going through TSA and dealing with rough game day traffic, folks). FOX Sports showed Air Force One flying over the stadium in the first quarter. And when a big 747 conducts a flyover below 2,000 feet, well, it's something. It seemed to dip its wings in salute. \"I just want to say … was that the greatest flyover ever?\" Trump asked reporters rhetorically when Air Force One landed. \"Nobody's done a flyover like that.\" Vilma Promotes Talk With Trump FOX analyst and former NFL linebacker Jonathan Vilma promised there would be an \"exciting conversation\" with the President in the third quarter. \"Looking forward to that conversation,\" Vilma said. Makes sense. Vilma is from Florida. Florida has voted for Trump in three Presidential elections. And, just as importantly, Vilma attended the University of Miami and Coral Gables High in Miami-Dade County, which went red for Trump in the 2024 election. Vilma has seen Trump at Dana White's UFC events in Miami. Trump noted how great Vilma's quarterback was in New Orleans – Drew Brees – without failing to mention his friend Tom Brady as well. The crew asked Trump to call a couple of plays, and he was a better analyst than a play-by-play man. But, well, let's just agree he should stick to being President. Trump conducted the swearing-in ceremony of the new troops, which was broadcast on the stadium's big screen. And during that ceremony the crowd cheered. And booed. There was no consensus from a crowd representing the mostly democratic District of Columbia and mostly democratic Maryland and mostly democratic Virginia. It must be said: Booing as new troops are being sworn in is terrible. And I get it, they were booing Trump. But the fact remains, after the ceremony was over, Trump was still the President of the United States. \"We're doing great, and recruitment is doing phenomenally,\" Trump said when asked about the state of the nation. \"People have a spirit, our stock market hit an all-time high. Prices are coming down, we inherited a mess, prices are coming way down, and I'll tell you, our country has over 17 trillion dollars being invested in it, which is a record, so we're doing great.\"","summary":"","url":"https://www.outkick.com/sports/president-attends-commanders-game-lions-doing-trump-dance","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/11/stbrown-trump-lions-commanders-scaled.jpg","video":null,"publish_date":"2025-11-10 00:23:13","author":"Mandel Ngan","authors":["Mandel Ngan"],"language":"en","category":"politics","source_country":"us","sentiment":0.182},{"id":377378852,"title":"Al-Sharaa to become the first Syrian president to visit the White House after an unlikely rise","text":"EIRUT (AP) — Two decades ago, Ahmad al-Sharaa was held in a U.S.-run detention center in Iraq after joining al-Qaida militants fighting against American forces there.\n\nFew would have predicted that he would go on to become the first Syrian president to visit Washington since the country’s independence in 1946.\n\nSince rebel forces he led ousted former Syrian President Bashar Assad last December, al-Sharaa — who cut ties with al-Qaida years earlier — has gone on a largely successful charm offensive to establish new ties with countries that had shunned Assad’s government after its brutal crackdown on protesters in 2011 spiraled into a 14-year civil war.\n\nAl-Sharaa met with U.S. President Donald Trump in Saudi Arabia in May, where Trump announced that he would lift decades of sanctions.\n\nThe two men will meet again on Monday in Washington, where Syria is widely expected to officially join the U.S.-led coalition against the Islamic State group. Al-Sharaa arrived in the U.S. on Saturday ahead of the meeting, according to Syrian state media.\n\nApart from that agreement, al-Sharaa will use the visit to push for a full repeal of the Caesar Act, which imposed sweeping sanctions over human rights abuses by Assad’s government and security forces.\n\nThe Caesar sanctions are currently waived by presidential order, but a permanent repeal will require a congressional vote.\n\nSyria’s Ministry of Information said in a statement Sunday that al-Sharaa will “emphasize the importance of lifting economic sanctions, particularly the Caesar Act, to allow for Syria’s economic recovery and investment growth” and will also “reaffirm (Syria’s) commitment to continuing the fight against terrorism and promoting regional security.”\n\nA push to lift the last sanctions\n\nDays ahead of al-Sharaa’s visit, Trump told reporters that he had moved to lift sanctions from Syria “to give them a fighting shot, and I think (al-Sharaa’s) doing a very good job so far.”\n\n“It’s a tough neighborhood and he’s a tough guy, but I got along with him very well, and a lot of progress has been made with Syria,” he said.\n\nOn Thursday, the U.N. Security Council voted to lift sanctions from al-Sharaa and his interior minister, and the U.S. then removed them from its “specially designated global terrorist” list.\n\nMeanwhile, senators have advanced a repeal of the Caesar Act through an annual defense authorization bill, but the final legislation is being negotiated with the House, where some top Republicans want to put conditions on it.\n\nRep. Brian Mast, the Republican chair of the House Foreign Affairs Committee, has expressed reservations about a full repeal. Sen. Lindsey Graham, a South Carolina Republican who is close to Trump, has also pushed for conditions on the repeal, including security and representation for religious and ethnic minorities, “maintaining peaceful relations with other states in the region, including the State of Israel,” and removing foreign fighters from government and security institutions.\n\nSkeptics of al-Sharaa point to eruptions of sectarian violence over the past year during which pro-government Sunni gunmen killed hundreds of civilians from the Alawite and Druze religious minorities. Al-Sharaa has promised to hold perpetrators accountable, but minority communities remain wary.\n\nThe advocacy group Save the Persecuted Christians sent a letter signed by 100 U.S. religious leaders calling on Trump to address the “massacre” of minorities in Syria and to push al-Sharaa to open a humanitarian corridor from the Israeli-controlled Golan Heights to the Druze enclave of Sweida in southern Syria.\n\nSince Assad’s fall, Israel has seized a formerly U.N.-patrolled buffer zone in southern Syria and pushed for a demilitarized zone south of Damascus. The two countries, which do not have diplomatic relations, have been negotiating a potential security agreement.\n\nMeanwhile, the top Democrat on the Senate Foreign Relations Committee, Sen. Jeanne Shaheen, has led the effort for a full Caesar repeal. Shaheen said that “we have a real opportunity in the Middle East right now that we haven’t had in my lifetime.”\n\nAdvocates say it is unfair to keep sanctions that were specifically imposed on Assad’s government as leverage over the new authorities and that the threat of a Caesar snapback would prevent international companies from investing in rebuilding the war-battered country.\n\nMouaz Moustafa, executive director of the Syrian Emergency Task Force, which lobbied for the imposition of the Caesar sanctions but is now trying to get them removed, said the U.S. government can impose new targeted sanctions if warranted.\n\n“But to use Caesar for that is like using a sledgehammer instead of a scalpel — you’re going to kill the person you’re operating on,” Moustafa said.\n\nA strengthened military alliance\n\nU.S. envoy Tom Barrack said last week that Syria will “hopefully” soon join the coalition of some 80 countries working to prevent a resurgence of IS.\n\nA Trump administration official said Al-Sharaa is expected to sign an agreement to join the coalition during his visit. White House press secretary Karoline Leavitt declined to comment when asked about the possibility.\n\nAnother U.S. official with knowledge of the situation said that while Syrian forces had already been fighting IS, their formal entry into the coalition will be a “milestone” and will enable U.S. forces to work more closely with the Syrians.\n\nBoth officials were not authorized to comment publicly and spoke on condition of anonymity.\n\nSyrian officials declined to comment on the discussions about joining the coalition.\n\nWhile the Islamic State group lost hold of all of the territory it once held in Syria and Iraq years ago, cells of the extremist group have continued to carry out attacks in both countries and abroad.\n\nLt. Cmdr. Emily Pumphrey, a spokesperson for U.S. Central Command, said there have been 311 IS attacks in Syria and 64 in Iraq so far this year, down from 878 in Syria and 160 in Iraq in 2024.\n\nBefore Assad’s fall, al-Sharaa — then known by the nom de guerre Abu Mohammed al-Golani — led Hayat Tahrir al-Sham, an Islamic insurgent group controlling much of northwestern Syria. It was formerly an offshoot of al-Qaida but later split from it. HTS and IS were rivals, and al-Sharaa cracked down on Islamic State cells in the area he controlled.\n\nThe main U.S. partner in the fight against IS at the time was the Kurdish-led Syrian Democratic Forces in the country’s northeast.\n\nSince al-Sharaa took power, the U.S. military has expanded its cooperation with Damascus and Washington has pushed for a deal to merge the SDF and the new Syrian army.\n\nWhile Damascus and the SDF have agreed in principle to do so, implementation has stalled amid tensions that have sometimes escalated into clashes between the two sides.","summary":"EIRUT (AP) — Two decades ago, Ahmad al-Sharaa was held in a U.S.-run detention center in Iraq after joining al-Qaida militants fighting against American forces there. Few would have predicted that...","url":"https://wsvn.com/news/us-world/al-sharaa-to-become-the-first-syrian-president-to-visit-the-white-house-after-an-unlikely-rise/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/11/110225-Syrian-Syria-President-Ahmad-al-Sharaa.png","video":null,"publish_date":"2025-11-10 00:22:43","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":0.127},{"id":377376474,"title":"UN says refugees stuck in vicious cycle of conflict and climate","text":"UNHCR said that by mid-2025, 117 million people had been displaced by war, violence and persecution. (EPA Images pic)\nGENEVA: Millions of refugees are trapped in a vicious cycle of conflict and climate extremes, the UN said Monday, urging the COP30 summit to provide financing for the most vulnerable.\nUNHCR, the UN refugee agency, said that within 15 years the places currently hosting nearly half the world's refugees could be facing extreme exposure to climate-related shocks.\n\"Climate change is not only amplifying existing vulnerabilities – it is also fuelling displacement trends, creating complex and compounding risks for refugees... leaving many with no escape from its impacts,\" it said in a report.\nIt said climate shocks were increasing humanitarian needs and amplifying the risks of repeated displacement.\nUNHCR said that by mid-2025, 117 million people had been displaced by war, violence and persecution.\nOf those, three in four are living in countries facing high-to-extreme exposure to climate-related hazards, it said.\nIt added that over the past 10 years, weather-related disasters had caused around 250 million internal displacements within countries.\nHardship and devastation\n\"Extreme weather is... destroying homes and livelihoods and forcing families – many who have already fled violence – to flee once more,\" UN refugees chief Filippo Grandi said in a statement.\n\"These are people who have already endured immense loss, and now they face the same hardships and devastation again. They are among the hardest hit by severe droughts, deadly floods and record-breaking heatwaves, yet they have the fewest resources to recover,\" he said.\nThe UNHCR said that by 2050, the hottest 15 refugee camps in the world – in The Gambia, Eritrea, Ethiopia, Senegal and Mali – are projected to experience nearly 200 days of hazardous heat stress per year.\n\"Many of these locations are likely to become uninhabitable due to the deadly combination of extreme heat and high humidity,\" it said.\nThe report said the number of countries facing extreme exposure to climate-related hazards is projected to rise from three to 65 by 2040.\nThose 65 countries host over 45% of all people currently displaced by conflict.\nFunding slashed\nUnder President Donald Trump, the US, traditionally the world's top donor, has slashed foreign aid.\nWashington previously accounted for more than 40% of the UNHCR's budget, and other major donor countries have also been tightening their belts.\n\"Funding cuts are severely limiting our ability to protect refugees and displaced families from the effects of extreme weather,\" Grandi said.\n\"To prevent further displacement, climate financing needs to reach the communities already living on the edge,\" he said. \"This COP must deliver real action, not empty promises.\"\nThe UNHCR report saw an \"opportunity\" in refugee-hosting places where ecosystems are deteriorating, saying sustainable financing for environmental restoration could create jobs and build local climate resilience.","summary":"UNHCR warned that within 15 years, regions hosting nearly half of the world’s refugees may face extreme climate-related shocks.","url":"https://www.freemalaysiatoday.com/category/world/2025/11/10/un-says-refugees-stuck-in-vicious-cycle-of-conflict-and-climate","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/d46618f0-world-food-programme-1.jpg","video":null,"publish_date":"2025-11-10 00:18:53","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.03},{"id":377378404,"title":"Some fast-food chains are making a quiet change to bills as the penny disappears","text":"Fast-food chains are bidding farewell to the penny.Retailers like McDonald&apos;s and Wendy&apos;s are making subtle pricing changes as the US phases out the one-cent coins&comma; rounding the bill up or down if customers do not have exact change.A McDonald&apos;s representative told Business Insider in a statement that locations in certain parts of the country are experiencing a shortage of pennies. Restaurants may round up or down to the nearest five cents if customers do not have exact change.\"This is an issue affecting all retailers across the country&comma; and we will continue to work with the federal government to obtain guidance on this matter going forward&comma;\" McDonald&apos;s statement added.Wendy&apos;s told Business Insider that&comma; until the government sets an industry standard&comma; it has recommended that its franchisees round down cash transactions to the nearest nickel.\"Franchisees ultimately set their own prices&comma; so rounding may vary by restaurant&comma;\" Wendy&apos;s said.Go To Foods&comma; the parent company of Auntie Anne&apos;s&comma; Cinnabon&comma; and Jamba&comma; echoed Wendy&apos;s guidance.\"At this time&comma; when pennies aren&apos;t available&comma; we&apos;re recommending that franchisees round cash transactions in the guest&apos;s favor&comma;\" Go To Foods told Business Insider in a statement. \"This ensures trust and consistency while minimizing disruption.\"The three companies added that pricing for cashless transactions would not be affected.President Donald Trump&comma; citing the high cost of producing low-value coins&comma; announced in February that the US Treasury would stop minting new pennies in 2026. Each $0.01 coin costs $0.03 to make&comma; according to the US Mint&apos;s 2024 report&comma; which also found that production costs had risen by over 20% that year.A spokesperson for the Treasury previously told Business Insider that it would continue producing the coin until it runs out of blanks&comma; so the currency will eventually fall out of circulation. Phasing out the coin will save the US Mint $56 million annually in materials costs&comma; the spokesperson said.Dylan Jeon&comma; a senior director of government relations at the National Retail Federation&comma; said in an October 29 statement that the government should provide clear guidance to retailers on how to deal with the lack of pennies.\"Without preemptive federal guidance&comma; retailers and other cash-accepting businesses are exposed to legal risks simply for implementing necessary practices in response to the nationwide penny shortage&comma;\" Jeon said.The US isn&apos;t the only country to have phased out the penny. Canada and Sweden have both stopped production of their one-cent coins&comma; and American politicians across the aisle have long advocated for the US to follow suit.","summary":"Fast-food chains like McDonald's and Wendy's are tweaking some bills in the absence of pennies, rounding them up or down to the nearest nickel.","url":"https://www.businessinsider.com/fast-food-mcdonalds-wendys-change-prices-penny-production-rounding-stopped-2025-11","image":"https://i.insider.com/690ec8a021c3f142ebfc61d7?width=1200&format=jpeg","video":null,"publish_date":"2025-11-10 00:18:36","author":"Aditi Bharade,Katherine Tangalakis-Lippert","authors":["Aditi Bharade","Katherine Tangalakis-Lippert"],"language":"en","source_country":"US","sentiment":-0.36},{"id":377377918,"title":"Senate Republican leader states deal with Democrats on shutdown is near","text":"WASHINGTON, November 10. /TASS/. Republicans in the Senate are close to reaching agreements with Democrats regarding measures to resume the partially suspended operations of the federal government, Senate Majority Leader John Thune, (Republican - South Dakota), has stated.\n\n\"A deal is coming together,\" Thune noted, as quoted by the Associated Press. He emphasized that a final agreement has not yet been reached. \"We’ll see where the votes are,\" he added, referring to the possibility of a Senate vote on a package of bills aimed at resuming government operations. According to The Hill newspaper, the vote could take place on the evening of November 10 or on November 11.\n\nThe Axios portal earlier reported, citing sources, that at least 10 Democrats in the Senate are prepared to vote together with Republicans for the mentioned bills. This will likely be sufficient for their approval. Previously, Democrats had refused to support Republican initiatives aimed at this.\n\nThe mentioned package of bills provides funding for the operation of the federal government until January 30, 2026. Some agencies will receive funds to operate throughout the entire 2026 fiscal year.\n\nThe US federal government partially suspended work at midnight on October 1 due to a lack of funding after the ruling Republican party failed to reach agreement with the Democrats in the US Congress on some expenditure items, including healthcare. The parties accuse each other of provoking the shutdown and prolonging it for political purposes.\n\nSince 1977, funding for the federal government has been interrupted more than 20 times due to disagreements between the administration and Congress. The current US government shutdown has become the longest in the country’s history, breaking the record set in 2018-2019 during Donald Trump’s first term as president (2017-2021).","summary":"Senate Majority Leader John Thune emphasized that a final agreement has not yet been reached","url":"https://tass.com/world/2041159","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-11-10 00:17:01","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.331},{"id":377377012,"title":"Worried About the Pullback in AI Stocks? Here's How to Protect Your Portfolio.","text":"Artificial intelligence (AI) stocks have been almost a sure path to gains over the past two years, but in recent days, investors and analysts have worried about the prices of these players. They've become more expensive, and some market experts have expressed concern about a possible bubble forming -- bubbles generally burst, resulting in significant declines, and this idea has weighed on AI stocks in recent days.\n\nPalantir Technologies saw its shares fall 11% this past week, even after the AI-driven software company reported fantastic earnings growth. And AI bellwether and chip company Nvidia declined 7%, even as other tech players spoke of high demand for AI products and services. This pushed the Nasdaq to its worst week since April, a time when investors sold tech stocks amid concerns about President Donald Trump's import tariff plans.\n\nThough stocks as a whole have become expensive -- the S&P 500 Shiller CAPE (cyclically adjusted price-to-earnings) ratio has reached one of its highest levels ever -- this doesn't necessarily mean AI stocks are heading for a crash. Tech giants from Amazon to Alphabet have wowed investors with their recent earnings reports, and much of their growth has come from strong AI demand. This offers us visibility into earnings potential ahead, and things are looking bright.\n\nStill, if you're worried about the recent pullback in AI stocks and whether declines may deepen, there are a few steps you can take to protect your portfolio and promote strength in any market environment. Let's check them out.\n\n1. Favor diversification\n\nNow is a fantastic time to review the contents of your portfolio and ensure that you are well diversified. This means that you're invested in a variety of industries and companies and haven't just gone all in on one company or investing theme. If you find your portfolio is too heavily weighted toward one area -- AI or any other industry -- now is a good time to broaden your investments.\n\nYou may, for example, reduce a position in a stock that's already delivered significant gains and reallocate your winnings to an area known for safety, such as pharmaceutical stocks, or add a dividend stock or two to your portfolio. (Pharma companies are considered safe because people need their medicines, resulting in a certain earnings stability regardless of the economic environment.)\n\n2. Go for established players with clear future prospects\n\nThe information we have right now points to more revenue growth within the AI industry. As mentioned, cloud service providers such as Amazon and Alphabet are seeing demand from customers aiming to run AI workloads. This supports analysts' predictions that the AI market may grow from billions of dollars today to more than $2 trillion in a few years. We haven't seen a slowdown in spending or interest in AI.\n\nBut to protect your portfolio through any turbulence, it's a good idea to go for AI players with a track record of growth and that have what it takes to benefit from the next phases of the AI boom. Potential buys include Nvidia, the dominant AI chip designer that's ensuring its leadership through innovation, and leading cloud provider Amazon (the cloud unit is Amazon Web Services).\n\nEven if these companies experience a decline in their share prices, they have what it takes to recover and grow over the long term.\n\n3. Focus on the long term\n\nThat brings me to my third point. When investing, always focus on the long term, and this will help you manage difficult times. With this in mind, amid AI stock declines, don't panic. Instead, remember that you haven't lost on an investment unless you actually sell it. History shows us that the indexes have always rebounded from tough moments and gone on to gain. The same is true for quality companies.\n\n^IXIC data by YCharts.\n\nSo, evaluate the strength of each of your AI stocks, and if a company's long-term story remains positive, hold on to it, as this player may deliver more growth over the long haul. Of course, if you've already gained a lot from a certain position, it may be to your advantage to lock in some profits and, as mentioned above, further diversify your holdings.\n\nMeanwhile, declines in AI stocks offer you a chance to get in on certain quality players at a good price. So, if you're bullish on AI over the long term, seize this opportunity.\n\nBy taking these steps and focusing on companies' potential over the coming five to 10 years, you can protect your portfolio and increase your peace of mind.","summary":"The first rule of thumb: Don't panic.","url":"https://www.fool.com/investing/2025/11/09/pullback-in-ai-stocks-how-to-protect-portfolio/","image":"https://g.foolcdn.com/editorial/images/841857/gettyimages-1059661940.jpg","video":null,"publish_date":"2025-11-10 00:10:00","author":"Adria Cimino","authors":["Adria Cimino"],"language":"en","source_country":"us","sentiment":-0.204},{"id":377373464,"title":"Trump says Commanders 'have to get a touchdown' while in FOX booth; Washington's QB finds receiver for score","text":"President Donald Trump stepped into the FOX booth in between legendary play-by-play man Kenny Albert and analyst Jonathan Vilma during the Washington Commanders’ game against the Detroit Lions. Commanders quarterback Marcus Mariota drove down the field to get Washington in the red zone. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I think this is a very important couple of plays,\" Trump said as Mariota took the snap on 2nd-and-7 from the Lions’ 9-yard line. \"… They have to get a touchdown. Let’s put it differently. They just have to get a touchdown. Forget about the play.\" Washington scored two plays later when Mariota threw a 4-yard touchdown pass to Deebo Samuel. The Commanders failed to make the 2-point conversion and were down 16 points to the Lions. Trump was at Northwest Stadium for the NFL’s \"Salute to Service\" festivities. He read off names of enlistees into the U.S. military. He was the first sitting president to attend a regular-season game since President Jimmy Carter did it in 1978. LIONS' AMON-RA ST BROWN DOES TRUMP'S SIGNATURE DANCE TO CELEBRATE TOUCHDOWN VS COMMANDERS Albert mentioned to Trump that Carter’s attendance came on the same day Bucky Dent etched his name into the annals of history between the New York Yankees and Boston Red Sox. Trump has been at a few major sporting events since he was inaugurated for his second term, including the Super Bowl, Daytona 500, the U.S. Open and the Ryder Cup. \"I just love it. It’s a microcosm of life,\" he said of sports. \"It’s sort of like life. The good the bad and the ugly.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP Air Force One flew over Northwest Stadium before landing at Joint Base Andrews. Trump arrived just before halftime of the game. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"President Donald Trump was in the broadcast booth to call the Washington Commanders&apos; touchdown against the Detroit Lions on Sunday night.","url":"https://www.foxnews.com/sports/trump-calls-commanders-touchdown-drive-against-lions","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/nfl-trump-110925-7.jpg","video":null,"publish_date":"2025-11-10 00:02:22","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.039},{"id":377375310,"title":"UN climate talks start with nations pushing for action despite broken consensus","text":"The latest UN climate talks kick off this week with countries hoping to drive forward action in the face of a major breakdown in global consensus.\n\nWorld leaders, including Prime Minister Sir Keir Starmer, gathered in Brazil ahead of the opening of Cop30 negotiations on Monday in the city of Belem in the Amazon.\n\nWith the shift towards clean energy progressing at different rates across the world, negotiators will focus on how to accelerate the transition, deliver on commitments to cut planet-warming emissions and boost adaptation to the changing climate.\n\nBy hosting the summit at the mouth of the Amazon River, Brazil also hopes to put nature at the heart of talks so that its role in scaling up climate resilience and solutions is meaningfully recognised in the final agreement.\n\nBut many countries, including the UK, are bracing to defend multilateralism itself as geopolitical divisions continue to deepen, especially over commitments to phase out fossil fuels.\n\nThis year, negotiators are grappling with the fallout from the election of US President Donald Trump, who began his second term this year by backing fossil fuels and ditching green policies.\n\nMr Trump is also pulling America out of the 2015 UN Paris Agreement for the second time, marking a significant setback for the global framework that committed countries to pursue efforts to limit dangerous warming to the key threshold of 1.5C above pre-industrial levels.\n\nThe US president snubbed the leaders’ summit last week, as did leaders from China and India, and his administration is not expected to send any high-level representatives to Cop30.\n\nConcerns remain that the US will still seek to frustrate the talks after it helped to derail a landmark deal to cut global shipping emissions in London last month.\n\nAt the same time, Cop30 begins in the wake of deadly weather events which experts say were intensified by global warming.\n\nThis includes Hurricane Melissa, which devastated Jamaica last month, wildfires in Los Angeles which destroyed entire neighbourhoods, widespread droughts across South America and floods in Pakistan which left millions homeless.\n\nLast year was the warmest on record globally as climate change was compounded by the El Nino weather phenomenon and UN scientists recently warned that 2025 is on track to be the second or third warmest.\n\nThe World Meteorological Organisation (WMO) said it was “virtually impossible” to curb global warming to 1.5C in the next few years without temporarily overshooting the threshold, beyond which extreme weather events as well as threats to ecosystems, human health and food security significantly increase.\n\nHowever, it is “still entirely possible and essential” to bring temperatures down to the goal by the end of the century, the WMO said.\n\nUnder current policies in place, the world is facing long-term global warming of 2.8C, according to the UN Environment Programme (UNEP).\n\nIn a speech in Brazil on Friday, the Prime Minister admitted that “consensus is gone” in the UK and conceded that global unity in the face of “unequivocal” science has splintered since the Paris Accord a decade ago.\n\nYet the UK was “doubling down on the fight against climate change”, Sir Keir said as he staunchly defended his Government’s clean energy policies despite pressure from Mr Trump, who has repeatedly criticised Britain’s green agenda.\n\nFollowing his speech, the Prime Minister’s efforts to show leadership on climate action were somewhat dampened by backlash to the Government’s decision not to invest in a Brazilian-led rainforest fund, which the UK played a key role in establishing.\n\nThe British delegation is understood to be going into the talks with a strategy focused on accelerating the implementation of climate action as well as defending multilateralism and the Paris Agreement from the direct attacks it now faces.\n\nUnder the accord, governments set out country-level action plans, known as nationally determined contributions (NDCs), to meet the agreed targets through actions such as reducing emissions from activities such as burning fossil fuels and creating or restoring habitats such as forests to capture carbon.\n\nCountries were supposed to submit updated NDCs covering emissions cuts for the 2025-2035 period by September 30.\n\nOnly a third have put forward their updated plans so far, with the majority of countries missing the deadline, which had already been extended from February.\n\nUNEP last week warned that countries are off-track even for their older 2030 NDCs, let alone new 2035 targets.\n\nWith more NDCs expected to be unveiled in Belem, the world will be waiting to scrutinise the plans as negotiators discuss how to accelerate the rollout of measures they outline.\n\nElsewhere, Cop30 could bring a package of announcements on nature initiatives, carbon markets, nature finance and a set of initiatives around different parts of the energy mix, with the Brazilian hosts very focused on biofuels.\n\nTalks will also focus on measures to tackle nitrogen emissions and cut down on methane as a “handbrake” to warming in the near-term, as well as the viability of the £300 billion that wealthy countries pledged in finance for developing economies at Cop29 last year.","summary":"The UK will be focused on discussing how to accelerate climate action as well as defending multilaterialism itself.","url":"https://www.standard.co.uk/news/politics/donald-trump-keir-starmer-brazil-world-meteorological-organisation-world-b1257340.html","image":"https://static.standard.co.uk/2025/11/10/00/1ef3f966a956d61be2974d14327df9e3Y29udGVudHNlYXJjaGFwaSwxNzYyNjIyNDk0-2.82311860.jpg?width=1200","video":null,"publish_date":"2025-11-10 00:01:00","author":"Rebecca Speare-Cole","authors":["Rebecca Speare-Cole"],"language":"en","source_country":"gb","sentiment":-0.006},{"id":377375294,"title":"Evidence ‘does not show clear link between paracetamol, autism and ADHD’","text":"Existing evidence does not show a clear link between taking paracetamol in pregnancy and autism and ADHD in children, an in-depth review has concluded.\n\nResearchers trawled all studies on the issue and concluded they were low quality, with “low to critically low” confidence in any findings suggesting a link.\n\nUS President Donald Trump said in September there has been a “meteoric rise” in cases of autism and that Tylenol – which is called paracetamol in the UK – was a potential cause.\n\nHe said the painkiller should not be taken during pregnancy, suggesting pregnant women should “tough it out”.\n\nHis comments were criticised by autism campaigners and scientists in the UK and around the world.\n\nNow in a new study, published in the British Medical Journal (BMJ), experts including from the universities of Liverpool and Birmingham concluded that women should continue to be advised to take paracetamol when needed to treat pain and fever in pregnancy.\n\nThey said there was a “lack of robust evidence linking paracetamol use in pregnancy and autism and ADHD in offspring”.\n\nFurthermore, untreated fever, particularly in the first trimester, has been linked to an increased risk of miscarriage, birth defects and premature birth – underlining the need for women to be able to take paracetamol.\n\nThe team also suggested that any apparent link between paracetamol and autism and ADHD in previous studies may be driven by shared genetic and environmental factors within families.\n\nFor the latest study, researchers examined nine systematic reviews that included a total of 40 observational studies reporting on paracetamol use during pregnancy and the risk of autism, ADHD, or other neurodevelopmental outcomes.\n\nAll reviews reported a possible to strong association between a mother’s paracetamol intake and autism or ADHD, or both, in children, but seven of the nine reviews advised caution when interpreting the findings.\n\nOverall, experts in the BMJ concluded that confidence in the findings of these reviews was low (for two reviews) to critically low (for seven reviews).\n\nThey added: “Existing evidence does not show a clear link between in utero exposure to paracetamol and autism and ADHD in offspring.\n\n“Any apparent effect observed after in utero exposure to paracetamol on autism and ADHD in childhood might be driven by familial genetic and environmental factors and unmeasured confounders.”\n\nDimitrios Siassakos, professor in obstetrics and gynaecology from University College London, said: “The high-quality methodology used in this new umbrella review confirms what experts around the globe have been saying.\n\n“The evidence that links paracetamol use in pregnancy to autism is tenuous and those studies which do report an association are confounded by the association of autism or ADHD with factors shared by families such as genetics and lifestyle.”","summary":"US President Donald Trump said in September there has been a ‘meteoric rise’ in cases of autism.","url":"https://www.standard.co.uk/news/health/adhd-donald-trump-liverpool-birmingham-university-college-london-b1257336.html","image":"https://static.standard.co.uk/2025/11/10/00/213a163561ba78a70431c83a344c5fe8Y29udGVudHNlYXJjaGFwaSwxNzYyNjA2NTY1-2.81732410.jpg?width=1200","video":null,"publish_date":"2025-11-10 00:01:00","author":"Jane Kirby","authors":["Jane Kirby"],"language":"en","source_country":"gb","sentiment":-0.189},{"id":377369978,"title":"In-depth review finds no clear link between paracetamol, autism and ADHD","text":"A comprehensive review has found no clear link between taking paracetamol in pregnancy and autism and ADHD in children.\n\nResearchers examined all studies on the issue and concluded they were of low quality, with “low to critically low” confidence in any findings suggesting a link.\n\nIn September, US President Donald Trump suggested Tylenol, which is called paracetamol in the UK, could be behind a “meteoric rise” in cases of autism.\n\nHe said the painkiller should not be taken during pregnancy, and made comments suggesting pregnant women should “tough it out”, which were criticised by autism campaigners and scientists in the UK and around the world.\n\nA new study, published in the British Medical Journal (BMJ), experts from the universities of Liverpool and Birmingham concluded that women should continue to be advised to take paracetamol when needed to treat pain and fever in pregnancy.\n\nThey said there was a “lack of robust evidence linking paracetamol use in pregnancy and autism and ADHD in offspring”.\n\nFurthermore, untreated fever, particularly in the first trimester, has been linked to an increased risk of miscarriage, birth defects and premature birth – underlining the need for women to be able to take paracetamol.\n\nThe team also suggested that any apparent link between paracetamol and autism and ADHD in previous studies may be driven by shared genetic and environmental factors within families.\n\nFor the latest study, researchers examined nine systematic reviews that included a total of 40 observational studies reporting on paracetamol use during pregnancy and the risk of autism, ADHD, or other neurodevelopmental outcomes.\n\nAll reviews reported a possible to strong association between a mother’s paracetamol intake and autism or ADHD, or both, in children, but seven of the nine reviews advised caution when interpreting the findings.\n\nOverall, experts in the BMJ concluded that confidence in the findings of these reviews was low (for two reviews) to critically low (for seven reviews).\n\nThey added: “Existing evidence does not show a clear link between in utero exposure to paracetamol and autism and ADHD in offspring.\n\n“Any apparent effect observed after in utero exposure to paracetamol on autism and ADHD in childhood might be driven by familial genetic and environmental factors and unmeasured confounders.”\n\nDimitrios Siassakos, professor in obstetrics and gynaecology from University College London, said: “The high-quality methodology used in this new umbrella review confirms what experts around the globe have been saying.\n\n“The evidence that links paracetamol use in pregnancy to autism is tenuous and those studies which do report an association are confounded by the association of autism or ADHD with factors shared by families, such as genetics and lifestyle.”","summary":"In September, US President Donald Trump said the painkiller should not be taken during pregnancy","url":"https://www.independent.co.uk/news/health/paracetamol-adhd-autism-link-trump-tylenol-b2861709.html","image":"https://static.independent.co.uk/2021/09/24/09/iStock-1197693392.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/v8qdatk0-4VHSaSK0.mp4","publish_date":"2025-11-10 00:01:00","author":"Jane Kirby","authors":["Jane Kirby"],"language":"en","source_country":"gb","sentiment":-0.112},{"id":377369586,"title":"Researchers say their work is hurt by political battle over campus culture","text":"For generations, federal research funding to universities has fueled breakthroughs in medicine, technology, and national defense.Now, the White House is using that support as leverage — pressuring a dozen elite universities to align with President Trump's political agenda or risk losing funding.The government has used the power of the purse before to shape higher education, but President Trump's effort is unprecedented in scale. He's accused universities of antisemitism and liberal bias, demanding they do more to safeguard conservative voices.Some universities have cut deals to protect their funding. But Harvard - the nation's oldest university and the president's most prominent target – has refused, citing academic freedom.The threat has disrupted hundreds of Harvard research labs, forcing scientists to halt projects, lose staff, and fear their work is becoming collateral damage in a political fight that could jeopardize the future of American discovery itself.Bill Whitaker: If you were talking to the American public, what would your research do for them?Joan Brugge: My research has the potential to prevent their daughters, and their wives, and their cousins from developing breast cancer, and I don't think any taxpayer would want to interfere with progress on a project like that.Joan Brugge is director of the Ludwig Cancer Center at Harvard Medical School. For 50 years, she has applied for and won competitive federal grants that helped uncover how tumors form and resist treatment and discovered innovative therapies. When her million dollar annual funding was cancelled last spring, she was leading a team that had identified the earliest precursors of breast cancer.Joan Brugge: The ultimate goal is to find a treatment that will eliminate those cells that carry the mutations.Bill Whitaker: And in effect prevent the cancer?Joan Brugge: Yes, prevent the cancer. Bill Whitaker: Last spring you got an email. What did it say? Joan Brugge: It listed two grants from the National Institute of Health and said that they were terminated. Bill Whitaker: Terminated?Joan Brugge: Terminated. Bill Whitaker: What went through your mind?Joan Brugge: It was just like a gut punch. My knees buckled and I had to sit down, because I-- I just never imagined that research focused on a disease like cancer would be canceled for a reason that was unrelated to the quality of the research, or the progress of the research, but this was across the board for issues relating to diversity and antisemitism at Harvard.Accusations of antisemitism at Harvard stem from student protests over the Gaza war that often were hostile to Israel. Harvard tightened rules around protests and commissioned reports on antisemitism and Islamophobia. A survey on campus found that 40% of Jewish staff, faculty and students who responded said they felt discriminated against because of their views; 71% of muslim respondents said the same.President Trump has focused on antisemitism at Harvard.The president broadened his criticism and called for dismantling DEI and for audits on hiring, admissions and academic programs.When Harvard refused federal oversight, the Trump administration froze more than $2 billion in grants, mostly for scientific and medical research.Bill Whitaker: So has your progress been stalled? Joan Brugge: So our progress has been significantly affected. Now, I'm spending most of my time ringing doorbells to find alternate funding so that we can keep the lab going.This past April, Harvard sued the government to regain its funding.And in September, a federal judge sided with Harvard and ruled the funding freeze unlawful, saying the Trump administration \"used antisemitism as a smokescreen for a targeted, ideologically-motivated assault\" and ordered all the money restored. The funds have started to flow again — at least for now — but researchers say much damage has been done and the Trump administration has vowed to appeal the judge's ruling and block Harvard from receiving future grants.Joan Brugge: There's now this existential threat that this could happen again. Bill Whitaker: What does that mean for science, that uncertainty?Joan Brugge: It will eventually draw people away from the United States to carry out research, where that kind of threat and that kind of insecurity doesn't exist.Bioengineer Don Ingber is founding director of the Wyss Institute at Harvard. Like the university's medical and public health schools, it is not on Harvard's main campus in Cambridge where protests erupted. It's in Boston, three miles away across the Charles River.Don Ingber: Did things get out of control at all these universities? Yes, I think they did. Have universities including Harvard made amends and made things better? The answer is, yes. Bill Whitaker: The Trump administration has accused Harvard of discrimination and says the federal government doesn't have to give money to the university. What do you say to that?Don Ingber: Money that's given to the university for scientific research and medical research is not just given. We have to compete for it. And we are doing a service for the United States because they've identified needs that need to be met.Ingber relies largely on federal funding for his work identifying new therapies using what he calls \"organs-on-chips.\" This breakthrough technology, tiny tissue-lined devices, can replace animal testing.Bill Whitaker: So what does that allow you to do? Don Ingber: We can study how the body normally works. We study response to drugs, response to toxins, drug delivery systems.Federal grants have made up almost half the university's research funding. Ingber and other scientists told us government support of university research — now under threat — is what has powered America's scientific supremacy in the world.Don Ingber: We are truly putting the brakes on scientific innovation in this country at a time where our ostensible adversary, China, is just going faster and faster and faster.Bill Whitaker: You have said that we are handing our future to China.Don Ingber: On a silver platter, absolutely. If we can't be the leader, we're gonna be the follower.Harvard and the federal government have been in settlement talks for months, and in a statement, the Department of Education told us the Trump administration is \"actively working toward a deal with Harvard that holds them accountable for egregious civil rights violations and discrimination on campus\" \"while restoring generous taxpayer dollar support to the institution.\"Harvard, in turn, says it's working to improve existing programs promoting ideological diversity.Steven Pinker: Harvard has not done enough to ensure a wide range of opinions being represented on campus.Harvard psychology professor Steven Pinker has been a member of the faculty for 22 years and has been outspoken about what he says is liberal bias on campus.Bill Whitaker: In your estimation, where has Harvard gone wrong?Steven Pinker: I think there have been too many incidents in which someone has expressed a controversial opinion and has been shamed or cancelled. He points to biology lecturer Carole Hoven who says she felt ostracized on campus after her remarks on Fox News in 2021 sparked controversy. She has said the criticism and pushback on campus drove her to resign.Bill Whitaker: President Trump has described Harvard as a liberal mess, that it has been hiring almost all woke, radical left idiots and bird brains--Steven Pinker: Yes.Bill Whitaker: The language is a bit harsh, but does he have a point here?Steven Pinker: Not there, no. I do not agree with that. You know, I-- I think there is a grain of a truth in that I think there-Bill Whitaker: What's the grain of truth? Steven Pinker: I think there should be more voices on the right at Harvard. I don't want Donald Trump to decide who those people are gonna be or how many we should have.Bill Whitaker: You do have the president, and you have lots of supporters of the president, who say, \"We don't like what they're doing there at Harvard. So why should my tax dollars go to support its research?\"Steven Pinker: Do you want Alzheimer's to be cured? Do you want cancer treatments for kids? Do you want treatments for people with paralysis? Consider Harvard chemist and molecular biologist David Liu, a winner of this year's Breakthrough Prize, often called the Oscars of science.He says the instability of federal funding is making it difficult for him to retain and attract researchers.Bill Whitaker: The funding is restored, does that fix the problem?David Liu: Science research, at the cutting edge especially, is a slow-moving process. When you disrupt that process, it can take years to-- you have to hire those people back. You have to generate those samples, many of which are perishable. David Liu and his team invented gene editing tools that can correct and rewrite defective genes.David Liu: Here's a small segment of the human genome. You have 6 billion of these letters. This sequence causes brain disease. It's caused by these four extra letters. So a prime editor finds that sequence and then replaces it, and you get to type in the sequence that you want to replace it with.Bill Whitaker: Just fix it.David Liu: Fix it at the root cause.Gene editing technologies invented in David Liu's labs at Harvard and here at the nonprofit Broad Institute could one day help hundreds of millions worldwide with genetic diseases like sickle cell and muscular dystrophy.David Liu: This is a tube of the DNA instructions that finds a DNA sequence of our choosing. Bill Whitaker: Just that unassuming, clear liquid—David Liu: That's right. We can fix the mutation, fix the disease, and hopefully never have to treat the patient again.Alyssa Tapley: It was this tiny little syringe.Bill Whitaker: And it was just one injection of this little vial?Alyssa Tapley: Just one injection of this tiny little vial, and that was it.Alyssa Tapley, who lives outside London, was diagnosed with a rare form of leukemia.She endured a year of failed treatments — chemotherapy, a bone marrow transplant — and her doctors ran out of options.Alyssa Tapley: I was 13 when I was told that I was going to die.Bill Whitaker: And they're talking about end-of-life care?Alyssa Tapley: Yeah, and I said \"please don't give up on me\" because I haven't done anything with my life. I'm just gonna be this kid who died because of cancer.Her doctor read about professor Liu's novel gene editing research and thought it might — just might — help Alyssa.She became the first human to try the experimental treatment made possible by the U.S. federal funding.Alyssa Tapley: I knew if I did it, even if it didn't end up working, it would end up making a difference to somebody else's life. Now 16, she vividly remembers the day her doctor told her the experimental treatment had worked.Alyssa Tapley: After thinking for so long that this was it and, you know, there was nothing left, and I would never be able to grow up, I finally had this future again that no one could take away from me.Bill Whitaker: Cancer-free.Alyssa Tapley: Yep.Bill Whitaker: All from that little vial.Alyssa Tapley: It's astounding what research can do and what people can do with the resources that they're given.Steven Pinker: Research works. If you want to freeze society where it is, then cripple the research enterprise.Bill Whitaker: Is that whole idea being lost in the harsh rhetoric by the administration?Steven Pinker: The attack on universities is a-- is-- is a tragic blunder. For all the foibles of universities, and there are many, and I've pointed them out, universities' research makes life better - massively so. Why would you want to cripple it? It's something that the United States does really, really well.Produced by Sarah Koch. Associate producer, Amanda Winograd-Schnur. Broadcast associate, Mariah Johnson. Edited by Joe Schanzer.","summary":"Federal research funding to universities has fueled breakthroughs for years. The White House is pressuring universities to align with the president's political agenda, or risk losing their funding.","url":"https://www.cbsnews.com/news/researchers-say-their-work-hurt-by-political-battle-over-campus-culture-60-minutes-transcript/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/11/07/c7e67c6c-a9ff-48e3-8c99-fd14227c51b2/thumbnail/1200x630/be22da36a3d2cd7ccb5daf0e67d93810/research-funding-whitaker-video.jpg","video":null,"publish_date":"2025-11-10 00:00:25","author":"Bill Whitaker","authors":["Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.09},{"id":377377824,"title":"Who wins the trade war? Maersk’s Malaysia mega-bet backs Southeast Asia","text":"Next to a bustling expressway funnelling Malaysia’s exports to the world, Danish shipping giant Maersk has placed a US$118 million bet that Southeast Asia will not only withstand the new tariff era, but find a way to prosper.\nMaersk’s largest Asia-Pacific distribution centre opened in Shah Alam, Selangor state, on Wednesday. Seven years in the planning, it was conceived well before Donald Trump’s tariff-wielding return to the White House disrupted supply chains and slashed corporate margins.\nBut when the dust from his trade hostilities finally settles, Maersk believes it will be Southeast Asia that emerges as a net beneficiary of the reshuffle.\n“Regardless of industry, everyone is looking for a cheaper, better way to source products. And I think we will follow wherever the customer goes,” Elaine Low, Maersk’s area managing director for Southeast Asia, told This Week in Asia.\n\nAt the company’s sprawling 180,000 square-metre facility, everything from chocolates and shoes to surgical equipment is delivered by container lorries and sorted by robots into automated trays stacked tens of metres high, awaiting the next shipment out.\nMaersk, the world’s second-largest shipping firm, saw its revenues tumble by US$827 million in the first nine months of the year, down to US$26.7 billion.\nOcean freight earnings suffered the most in the third quarter as tariffs took their toll, plummeting by more than half to US$1.5 billion – a blow the company attributed in its quarterly report released on Thursday to a “volatile geopolitical environment”.\nYet at Shah Alam, the talk is not of retreat, but renewal. “We are going where our customers are shifting,” said Low, citing new opportunities in Asia. “Definitely, there are disruptions to the supply chain because of what is happening in the world.”\nWe are going where our customers are shifting\nElaine Low, Maersk’s Southeast Asia managing director\nMaersk’s confidence is not unfounded. In the third quarter of this year, it said global container demand had grown between 3 and 5 per cent year on year, driven primarily by exports from Far East Asia – especially China.\nThis surge of shipments, known as front-loading, occurred as companies raced to beat tariff deadlines, with some Southeast Asian nations posting record exports as manufacturers scrambled to source goods from outside China. Average US tariffs on Chinese goods currently stand at around 50 per cent.\nVietnam, for example, reported a US$16.8 billion trade surplus in the first nine months of the year, despite a punitive 20 per cent US levy on many of its exports since August. While the tariffs trimmed its surplus by nearly a fifth compared to the same period last year, demand from other markets has remained robust.\n\nThailand also saw exports surge – shipping nearly US$31 billion in goods in September alone, marking a 19 per cent annual increase and the country’s best monthly performance in almost four years.\nMaersk is no stranger to Malaysia’s logistics landscape. The company already holds a 30 per cent stake in the Port of Tanjung Pelepas in southern Johor state, its global transshipment hub for shuttling goods between East and West.\nThe port, currently ranked as the 15th busiest worldwide, became the first in Malaysia to handle more than 12 million twenty-foot equivalent units (TEU) – the size of a standard shipping container – in a single year in 2024.\nSlow-release toxin\nBut analysts caution against making too much of Southeast Asia’s recent gains, warning that Trump’s tariffs may turn out to be a slow-release toxin for the region’s economies.\nLast year, the United States was the top export destination for member states of the Association of Southeast Asian Nations, who shipped a combined US$123.5 billion worth of goods to the world’s largest consumer market, according to the Office of the US Trade Representative.\nChina, meanwhile, has been Asean’s top trading partner for the past 16 years, with total trade between the two sides valued at US$982 billion in 2024, driven largely by Southeast Asian imports of machinery, auto parts, animal feed and other Chinese products.\n\nUS-China trade tensions have see-sawed throughout the first year of Trump’s second term and any further thaw could see manufacturers hesitate to relocate supply chains to Southeast Asia, according to Adib Zalkapli, managing director of Viewfinder Global Affairs, a Malaysia-based geopolitical risk consultancy.\n“US-China trade tensions are very unpredictable. It may further de-escalate … so businesses and manufacturers may still not want to put all their eggs in one Southeast Asia basket,” he said.\n“Southeast Asia doesn’t really benefit when its largest trading partner is weakened.”\nComplicating matters further, new trade agreements with the US have come with strings attached.\nCritics accuse Malaysia’s Prime Minister Anwar Ibrahim of giving too much away in exchange for the 19 per cent tariff deal he signed with Trump in Kuala Lumpur last month. Concessions included agreeing to buy costly American aircraft and giving US companies priority over the country’s rare earths reserves, as well as opening up its domestic market to more US imports.\n\nTrump’s trade deals also empower Washington to penalise Malaysia, Cambodia or Vietnam if any of the three facilitate transshipments that undermine US “economic and national interests” – a veiled reference to the rerouting of Chinese exports through Southeast Asia to bypass tariffs.\nAt the same time, buyers in the world’s largest consumer market are becoming less and less willing to part with their cash. In a recent earnings call, US logistics giant United Parcel Service reported a more than 20 per cent drop in activity along the China-US trade corridor in the third quarter of this year, with CEO Carol Tome warning that the full impact of tariffs would only be felt in 2026.\nIn Malaysia, factory floors are already feeling the chill. Terence Teo, CEO of furniture maker Master Sofa Group, told This Week in Asia that American buyers were “holding up placing new orders due to tariffs and the slowdown of consumers’ buying power”\n\nTo survive, the company had pivoted to Europe, Teo said, slashing shipments to the US from 40 per cent of output to just 5 per cent.\nStill, as the cost of Chinese exports to the US climbs because of Trump’s tariffs, global manufacturers are increasingly eyeing Southeast Asia for alternative sourcing, particularly in consumer goods, agriculture, semiconductors and rare earths.\n“Rising demand for non-Chinese suppliers offers a critical window for the region to strengthen its manufacturing base, particularly in advanced electronics, automation, and resource-based processing,” economist Doris Liew told This Week in Asia.\n“The key challenge is sustaining competitiveness through productivity gains,” she said, urging the region to accelerate adoption of automation, robotics and artificial intelligence if it wanted to come close to China’s manufacturing prowess.","summary":"Next to a bustling expressway funnelling Malaysia’s exports to the world, Danish shipping giant Maersk has placed a US$118 million bet that Southeast Asia will not only withstand the new tariff era, but find a way to prosper.\nMaersk’s largest Asia-Pacific distribution centre opened in Shah Alam, Selangor state, on Wednesday. Seven years in the planning, it was conceived well before Donald Trump’s tariff-wielding return to the White House disrupted supply chains and slashed corporate margins.\nBut...","url":"https://www.scmp.com/week-asia/economics/article/3331978/who-wins-us-china-trade-war-maersks-malaysia-mega-bet-backs-southeast-asia","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/07/2c8591c6-bafc-4be1-aec8-b6fab66bdf08_4fdc6f06.jpg","video":null,"publish_date":"2025-11-10 00:00:11","author":"Iman Muttaqin Yusof,Joseph Sipalan","authors":["Iman Muttaqin Yusof","Joseph Sipalan"],"language":"en","source_country":"cn","sentiment":-0.336},{"id":377370914,"title":"Huw Edwards, Gaza and the Lineker anti-Semitism scandal: A full timeline of the BBC scandals that occurred on former director-general Tim Davie's watch","text":"Less than a year into his role, BBC director-general Tim Davie was forced to apologise after an inquiry found that Martin Bashir, a former interviewer for the BBC programme Panorama, had lied to gain his 1995 interview with Princess Diana. \n\nHer sons Prince William and Prince Harry called Bashir’s practices unethical. \n\nMr Davie acknowledged there had been ‘multiple serious failings’ around the interview. \n\nHuw Edwards, the corporation’s highest-paid newsreader, was suspended from the BBC on full pay after allegations that he had been inappropriately communicating with young men on social media. He was later prosecuted for possessing indecent images of children. \n\nA spokesman for the BBC said the corporation was ‘appalled’ by Edwards’ crimes and that he had ‘betrayed not just the BBC, but audiences who put their trust in him’. Mr Davie later commissioned a workplace culture review following the scandal. \n\nJanuary 2025 \n\nThe Mail on Sunday revealed that the opera singer and BBC presenter Wynne Evans made a sexualised remark, using the term ‘spit roast’ in a comment directed at Strictly Come Dancing pro Janette Manrara. \n\nHe was later axed from the Strictly tour and dropped from his BBC Radio Wales show. \n\nFebruary 2025 \n\nThe BBC broadcast Gaza: How to Survive A Warzone, narrated by a Palestinian boy named Abdullah Al-Yazouri. It was later revealed that his father was a Hamas official. \n\nMr Davie apologised, saying there had been ‘a significant failing in relation to accuracy’, and the BBC received a sanction from Ofcom. \n\nGary Lineker left Match Of The Day. \n\nHe was suspended from presenting the show after tweets criticised the government’s asylum policy in 2023, with Mr Davie then overseeing a new stance on BBC talent using social media. \n\nThen, in May this year, Lineker shared an Instagram post about Zionism that included an illustration of a rat – an image historically used as an anti-Semitic insult. \n\nAlthough he apologised, he later stepped down from BBC duties altogether. \n\nBob Vylan’s performance at Glastonbury including the lead singer’s chant of ‘death, death to the IDF’ and f***ing Zionists’ caused outrage. \n\nMr Davie apologised for the broadcast of ‘offensive and deplorable behaviour’. \n\nThe BBC called the decision not to pull the livestream an ‘error of judgment’ and removed the set from on-demand viewing. \n\nThe BBC’s Executive Complaints Unit found that the broadcast had breached editorial guidelines. \n\nAn independent report found that 45 of 83 claims of misconduct against MasterChef present Gregg Wallace were upheld, as well as an allegation that co-host John Torode had used ‘an extremely offensive racist term’. \n\nBoth presenters were dropped but the latest series was still broadcast, with Mr Davie arguing that the show was ‘much bigger than individuals’. \n\nNovember 2025 \n\nAn internal report last week revealed that a Panorama programme, broadcast a week before the US election in 2024, ‘completely misled’ viewers by splicing together two clips of a speech by Donald Trump to make it seem like he encouraged the Capitol Hill riots. \n\nHis son, Donald Trump Jr, this week accused the BBC of dishonesty and ‘fake news’.","summary":"Less than a year into his role, BBC director-general Tim Davie was forced to apologise.","url":"https://www.dailymail.co.uk/news/article-15275023/Huw-Edwards-Gaza-Lineker-anti-Semitism-BBC-scandals-Tim-Davies.html","image":"https://i.dailymail.co.uk/1s/2025/11/09/23/103733407-0-image-m-36_1762730114320.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/09/6349298585562363842/1024x576_MP4_6349298585562363842.mp4","publish_date":"2025-11-09 23:59:35","author":"Editor,Grant Tucker,Sam Merriman","authors":["Editor","Grant Tucker","Sam Merriman"],"language":"en","source_country":"gb","sentiment":0.074},{"id":377373008,"title":"President Donald Trump joins Kenny Albert and Jonathan Vilma in the broadcast booth in Washington","text":"FOX SPORTS™, SPEED™, SPEED.COM™ & © 2025 Fox Media LLC\n and Fox Sports Interactive Media, LLC. All rights reserved. Use of this\n website (including any and all parts and components) constitutes your\n acceptance of these\n\n Updated Terms of Use and Privacy Policy | Advertising Choices | Your Privacy Choices | Closed Captioning HelpPressAdvertise with UsJobsFOX CincyRSSSitemap FS1FOXFOX NewsFox CorporationFOX Sports SupportsFOX Deportes","summary":"President Donald Trump joined Kenny Albert and Jonathan Vilma in the broadcast booth in Washington.","url":"https://www.foxsports.com/watch/fmc-hecsmxekjqwyke4g","image":"https://a57.foxsports.com/static-media.fox.com/fmc/prod/sports/VX-14645087/1280/1280/uxyx770tnl5gh7m5.jpg?ve=1&tl=1","video":null,"publish_date":"2025-11-09 23:53:00","author":"Fox Sports","authors":["Fox Sports"],"language":"en","category":"politics","source_country":"us","sentiment":0.192},{"id":377375410,"title":"BBC director-general Tim Davie to step down following Trump speech edit","text":"Tim Davie has announced he will step down as director-general of the BBC after five years in the role, saying there have “been some mistakes made” and that he had to “take ultimate responsibility”.\n\nThe chief executive of BBC News, Deborah Turness, also announced her resignation following a newspaper report earlier in the week which accused the corporation of selectively editing a speech by Donald Trump on the day of the US Capitol attack.\n\nMr Davie said his departure will not be immediate and that he is “working through” timings to ensure an “orderly transition” over the coming months, while Ms Turness said in her statement that the controversy around the Panorama edit had “reached a stage where it is causing damage to the BBC – an institution that I love”.\n\nThe controversy relates to a memo by Michael Prescott, a former external adviser to the BBC’s editorial standards committee, who raised concerns in the summer about the way clips of the US president’s speech on January 6 2021 were spliced together in Trump: A Second Chance? to make it appear he had told supporters he was going to walk to the US Capitol with them to “fight like hell”.\n\nThe documentary was broadcast by the BBC the week before last year’s US election, which critics have said was misleading and removed a section where the US president said he wanted supporters to demonstrate peacefully.\n\nThe US president posted on his Truth Social platform to welcome the resignations and to thank the Telegraph for reporting Mr Prescott’s memo.\n\nMr Trump claimed there had been an attempt to “step on the scales of a presidential election”, adding: “What a terrible thing for Democracy!”.\n\nThe BBC is expected to apologise on Monday after the Culture, Media and Sport Committee asked chairman Samir Shah what actions he would take to address the concerns.\n\nCommittee chairwoman Dame Caroline Dinenage said Mr Davie’s resignation was “regrettable”, adding “but restoring trust in the corporation must come first”.\n\nMr Shah said it was a “sad day” for the BBC.\n\nIn a statement sent to staff, Mr Davie said his resignation was “entirely” his decision and that he is “thankful” to the chairman and board for their “unswerving and unanimous support” during his tenure.\n\nHe said: “Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable.\n\n“While not being the only reason, the current debate around BBC News has understandably contributed to my decision.\n\n“Overall the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.”\n\nMs Turness, who has been in the role since 2022, said that she had offered her resignation to Mr Davie on Saturday night, adding that despite mistakes being made, the allegations that BBC News is “institutionally biased are wrong”.\n\nIn a message sent to staff, she said: “The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC – an institution that I love.\n\nMs Turness also thanked staff and said she “could not be prouder” of the work they have done, saying that together they helped to grow trust in BBC News.\n\nThe BBC has been criticised for a number of failings in recent months which include breaching its own accuracy editorial guidelines, livestreaming the controversial Bob Vylan Glastonbury set, as well as misconduct allegations surrounding former MasterChef presenter Gregg Wallace.\n\nCulture Secretary Lisa Nandy thanked Mr Davie for his “service to public service broadcasting” and for leading the BBC through a period of “significant change”.\n\nShe also stated the Government will support the board through the transition and that the upcoming charter review will help the corporation adapt to a new era that “secures its role at the heart of national life for decades to come”.\n\nMs Nandy said the BBC was “one of our most important national institutions” which told the story of “who we are – the people, places and communities that make up life across the UK”.\n\n“Now more than ever, the need for trusted news and high quality programming is essential to our democratic and cultural life, and our place in the world,” she added.\n\nEarlier on Sunday, Ms Nandy told the BBC’s Sunday With Laura Kuenssberg programme she was “confident” BBC bosses are treating allegations of bias with “the seriousness that this demands”.\n\nThe PA news agency understands the BBC will provide further details on the Panorama episode in its letter to the Culture Media and Sport Committee on Monday.\n\nDame Caroline said: “The BBC board must now begin the long process of rebuilding the corporation’s reputation both at home and abroad, after the damage caused by what has become a seemingly constant stream of crises and missteps. The committee will be meeting on Tuesday to consider the BBC chair’s response to our letter and next steps.\n\n“At the same time the Government should bring forward the Charter Review process so the public and Parliament can help shape the future direction of the BBC.”\n\nBBC chairman Samir Shah said it was a “sad day” for the BBC, adding that Mr Davie had been an “outstanding director-general” who had “propelled the BBC forward with determination, single-mindedness and foresight”.\n\nMr Shah continued: “He is a devoted and inspirational leader and an absolute believer in the BBC and public service broadcasting.\n\n“He has achieved a great deal. Foremost, under his tenure, the transformation of the BBC to meet the challenges in a world of unprecedented change and competition is well under way.”\n\nThe BBC’s Royal Charter, which expires at the end of 2027, sets out the corporation’s mission, public purposes and funding.\n\nMs Nandy said in November last year that the Government would use the review of the charter to consider alternative ways of funding the corporation but ruled out the licence fee being replaced by general taxation.","summary":"The chief executive of BBC News, Deborah Turness, also announced her resignation following a week of controversy.","url":"https://www.standard.co.uk/news/uk/tim-davie-bbc-lisa-nandy-trump-government-b1257316.html","image":"https://static.standard.co.uk/2025/11/09/18/fe44b0040806643aee1398310803d2f0Y29udGVudHNlYXJjaGFwaSwxNzYyNzk4MTAw-2.81540983.jpg?width=1200","video":null,"publish_date":"2025-11-09 23:51:47","author":"Lauren Del Fabbro","authors":["Lauren Del Fabbro"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.152},{"id":377370688,"title":"BBC director-general Tim Davie to step down following Trump speech edit","text":"Tim Davie has announced he will step down as director-general of the BBC after five years in the role, saying there have “been some mistakes made” and that he had to “take ultimate responsibility”.\n\nThe chief executive of BBC News, Deborah Turness, also announced her resignation following a newspaper report earlier in the week which accused the corporation of selectively editing a speech by Donald Trump on the day of the US Capitol attack.\n\nMr Davie said his departure will not be immediate and that he is “working through” timings to ensure an “orderly transition” over the coming months, while Ms Turness said in her statement that the controversy around the Panorama edit had “reached a stage where it is causing damage to the BBC – an institution that I love”.\n\nThe controversy relates to a memo by Michael Prescott, a former external adviser to the BBC’s editorial standards committee, who raised concerns in the summer about the way clips of the US president’s speech on January 6 2021 were spliced together in Trump: A Second Chance? to make it appear he had told supporters he was going to walk to the US Capitol with them to “fight like hell”.\n\nThe documentary was broadcast by the BBC the week before last year’s US election, which critics have said was misleading and removed a section where the US president said he wanted supporters to demonstrate peacefully.\n\nThe US president posted on his Truth Social platform to welcome the resignations and to thank the Telegraph for reporting Mr Prescott’s memo.\n\nMr Trump claimed there had been an attempt to “step on the scales of a presidential election”, adding: “What a terrible thing for Democracy!”.\n\nThe BBC is expected to apologise on Monday after the Culture, Media and Sport Committee asked chairman Samir Shah what actions he would take to address the concerns.\n\nCommittee chairwoman Dame Caroline Dinenage said Mr Davie’s resignation was “regrettable”, adding “but restoring trust in the corporation must come first”.\n\nMr Shah said it was a “sad day” for the BBC.\n\nIn a statement sent to staff, Mr Davie said his resignation was “entirely” his decision and that he is “thankful” to the chairman and board for their “unswerving and unanimous support” during his tenure.\n\nHe said: “Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable.\n\n“While not being the only reason, the current debate around BBC News has understandably contributed to my decision.\n\n“Overall the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.”\n\nMs Turness, who has been in the role since 2022, said that she had offered her resignation to Mr Davie on Saturday night, adding that despite mistakes being made, the allegations that BBC News is “institutionally biased are wrong”.\n\nIn a message sent to staff, she said: “The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC – an institution that I love.\n\nMs Turness also thanked staff and said she “could not be prouder” of the work they have done, saying that together they helped to grow trust in BBC News.\n\nThe BBC has been criticised for a number of failings in recent months which include breaching its own accuracy editorial guidelines, livestreaming the controversial Bob Vylan Glastonbury set, as well as misconduct allegations surrounding former MasterChef presenter Gregg Wallace.\n\nCulture Secretary Lisa Nandy thanked Mr Davie for his “service to public service broadcasting” and for leading the BBC through a period of “significant change”.\n\nShe also stated the Government will support the board through the transition and that the upcoming charter review will help the corporation adapt to a new era that “secures its role at the heart of national life for decades to come”.\n\nMs Nandy said the BBC was “one of our most important national institutions” which told the story of “who we are – the people, places and communities that make up life across the UK”.\n\n“Now more than ever, the need for trusted news and high quality programming is essential to our democratic and cultural life, and our place in the world,” she added.\n\nEarlier on Sunday, Ms Nandy told the BBC’s Sunday With Laura Kuenssberg programme she was “confident” BBC bosses are treating allegations of bias with “the seriousness that this demands”.\n\nThe PA news agency understands the BBC will provide further details on the Panorama episode in its letter to the Culture Media and Sport Committee on Monday.\n\nDame Caroline said: “The BBC board must now begin the long process of rebuilding the corporation’s reputation both at home and abroad, after the damage caused by what has become a seemingly constant stream of crises and missteps. The committee will be meeting on Tuesday to consider the BBC chair’s response to our letter and next steps.\n\n“At the same time the Government should bring forward the Charter Review process so the public and Parliament can help shape the future direction of the BBC.”\n\nBBC chairman Samir Shah said it was a “sad day” for the BBC, adding that Mr Davie had been an “outstanding director-general” who had “propelled the BBC forward with determination, single-mindedness and foresight”.\n\nMr Shah continued: “He is a devoted and inspirational leader and an absolute believer in the BBC and public service broadcasting.\n\n“He has achieved a great deal. Foremost, under his tenure, the transformation of the BBC to meet the challenges in a world of unprecedented change and competition is well under way.”\n\nThe BBC’s Royal Charter, which expires at the end of 2027, sets out the corporation’s mission, public purposes and funding.\n\nMs Nandy said in November last year that the Government would use the review of the charter to consider alternative ways of funding the corporation but ruled out the licence fee being replaced by general taxation.","url":"https://uk.news.yahoo.com/bbc-director-general-tim-davie-182154692.html","image":"https://s.yimg.com/ny/api/res/1.2/wZ0TEXmag.38rSerINOEAA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjI7Y2Y9d2VicA--/https://media.zenfs.com/en/pa_viral_news_uk_120/e7a822fe30190481df393f872876e47c","video":"","publish_date":"2025-11-09 23:51:47","author":"Lauren Del Fabbro And Kerri-Ann Roper, Pa Reporters","authors":["Lauren Del Fabbro And Kerri-Ann Roper, Pa Reporters"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.152},{"id":377369984,"title":"Mexico to send more troops and money to Michoacan after mayor's killing","text":"Mexico President Claudia Sheinbaum and her security Cabinet said Sunday that the government is sending more troops to the western state of Michoacan and will invest more than $3 billion to try to quell the state’s persistent violence.\n\nThe announcement came a week after a 17-year-old gunman shot and killed a popular mayor during Day of the Dead festivities, spurring protests in towns across the state and demands that the federal government take action.\n\nSheinbaum recognized the pain and indignation expressed after the assassination of Uruapan Mayor Carlos Alberto Manzo. \n\n“His cowardly murder hurts, not only his family and his community, but all of Michoacan and the country,” the president said at the National Palace Sunday.\n\nNearly 1,000 additional troops were scheduled to arrive in Michoacan Monday, bringing the total of federal forces in the state to more than 10,000, Defense Secretary Ricardo Trevilla Trejo said. Nearly half of those will be charged with a containment strategy aimed at keeping criminals from crossing state lines, a tall order in a state with multiple criminal organizations operating fluidly within and from neighboring states like Jalisco.\n\nSheinbaum’s security chief Omar García Harfuch said the federal government will send additional intelligence gathering resources to the state to help develop investigations against organized crime groups. Mexico’s inability to carry out effective investigations that lead to prosecutions of its drug cartels has been a longstanding problem.\n\n“Those who generate violence, those who commit crimes, those who harm Michoacan families and the Mexican people will be investigated, arrested and taken before the law,” García Harfuch said.\n\nSheinbaum’s administration has shown a greater willingness to pursue the country’s powerful drug cartels than her predecessor ex-President Andrés Manuel López Obrador. The Trump administration has applied pressure in the form of tariffs on Mexican imports since shortly after taking office in what it said was an effort to make Mexico stop the flow of drugs into the United States.\n\nPresident Donald Trump has offered U.S. help in the pursuing the cartels, but Sheinbaum has said Mexico will only accept intelligence assistance and never direct by U.S. forces on Mexican soil.\n\nBut much of the funding for Michoacan will go to a bevy of existing government social programs aimed at addressing what the administration says are the root causes of violence like unemployment, poverty and healthcare. The administration will expand scholarships aimed at keeping kids in school so that organized crime appears a less attractive option.\n\nSheinbaum, like López Obrador, said security problems cannot be addressed only with force, and Gov. Alfredo Ramírez Bedolla, present for Sunday's announcement, is from her Morena party. He noted that his own father, a lawyer and rancher, was killed in Uruapan nearly 40 years ago.\n\nMichoacan has long posed a security challenge for Mexican presidents. Multiple organized crime groups fight for territorial control to move drugs along highways and chemical precursors for making fentanyl and methamphetamines through the critical Pacific port of Lazaro Cardenas. But they also extract a severe price from local communities by extorting avocado and lime growers and in some places nearly anyone else with a business.\n\nOn Sunday, Sheinbaum said she will keep the state’s progress on the national agenda by committing to addressing it every two weeks in her daily morning press briefings.\n\n“To all Michoacan (residents) we say: you are not alone, your president and the entire Mexican government support you,” she said.","summary":"Mexico President Claudia Sheinbaum has announced the deployment of more troops to Michoacan to address ongoing violence","url":"https://www.independent.co.uk/news/claudia-sheinbaum-michoacan-mexico-mexico-city-cabinet-b2861840.html","image":"https://static.independent.co.uk/2025/11/09/23/Mexico_Claudia_Sheinbaum_82814.jpg?width=1200","video":null,"publish_date":"2025-11-09 23:50:38","author":"Claudia Rosel","authors":["Claudia Rosel"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.173},{"id":377379834,"title":"Trump Reacts to Air Force One Flyover at Commanders-Lions Game: 'Greatest Flyover'","text":"President Donald Trump reacted to Air Force One flying over Northwest Stadium in Landover, Maryland, for the NFL’s game between the Washington Commanders and the Detroit Lions, describing it as the “greatest flyover.”\n\n“I just want to say, was that the greatest flyover ever?” Trump said. “Nobody’s ever done a flyover like that!”\n\nTrump went on to praise the pilots of Air Force One as being “the best pilots in the world,” adding that “whoever flies Air Force One” is the best pilot.\n\nAir Force One was reported to have flown “low over the stadium as thousands cheered it on from the stands below,” according to the New York Post.\n\nTrump’s presence at Sunday’s game between the Commanders and the Lions comes after Washington Commanders President Mark Clouse issued a statement saying he was “honored” to welcome Trump to the game, which will honor U.S. military veterans.\n\n“We are honored to welcome President Trump to the game as we celebrate those who have served and continue to serve our country,” Clouse said in his statement. “The entire Commanders organization is proud to participate in the NFL’s league-wide Salute to Service initiative, recognizing the dedication and sacrifice of our nation’s veterans, active-duty service members, and their families this Sunday.”\n\nTrump, who has suggested that the Washington Commanders return to their former name, the Washington Redskins, also reportedly wants the team to name their “3.7 billion stadium after him,” several sources told ESPN. The stadium is reported to open in 2030.\n\nIn a statement to the outlet, White House press secretary Karoline Leavitt said if the stadium were named after Trump, it “would be a beautiful name.”","summary":"President Donald Trump reacted to Air Force One flying over Northwest Stadium in Landover, Maryland, for the NFL&#8217;s game between the Washington Commanders and the Detroit Lions, describing it as the &#8220;greatest flyover.&#8221; &#8220;I just want to say, was that\n\n\nThe post Trump Reacts to Air Force One Flyover at Commanders-Lions Game: &#8216;Greatest Flyover&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/sports/2025/11/09/trump-reacts-to-air-force-one-flyover-at-commanders-lions-game-greatest-flyover/","image":"https://media.breitbart.com/media/2025/11/GettyImages2245383954final-640x335.jpg","video":null,"publish_date":"2025-11-09 23:46:34","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","source_country":"US","sentiment":0.343},{"id":377378430,"title":"The Week in Breakingviews: Doing battle over drugs - Reuters","text":"CompaniesAnglo American PLCItv PlcMetsera Inc\n\nLONDON, Nov 9 (Reuters Breakingviews) - Welcome back! For the first time in a while, the U.S. stock market is falling. The S&P 500 Index has shed 4% from its peak on October 29, while the tech-heavy Nasdaq Composite Index is down 6%. Is this a temporary blip, or the beginning of a bigger correction? Email me, opens new tab with your thoughts. If someone forwarded you this newsletter, sign up here to receive it every Saturday.\n\nOPENING LINE\n\n“It’s the question that just won’t go away among mining bankers and investors: could Rio Tinto (RIO.L), opens new tab gatecrash Anglo American’s (AAL.L), opens new tab nil-premium offer for $21 billion Canadian miner Teck Resources (TECKb.TO), opens new tab?”\n\nAdvertisement · Scroll to continue\n\nRead more: Rio can dig up trouble for Anglo’s Teck deal.\n\nFIVE THINGS I LEARNED FROM BREAKINGVIEWS THIS WEEK\n\nChinese carmakers’ sales in Europe increased 94% in the year to August. (Read on Reuters.com)The number of countries adopting fiscal rules doubled to 122 between 2000 and 2024. (Read on Reuters.com)Sales at U.S. Pizza Hut stores that have been open at least a year dropped 6% in the third quarter.Sky and ITV combined could have roughly 70% of UK television advertising.The iShares Global Clean Energy ETF is up 50% this year.\n\nThere’s nothing quite like a transatlantic takeover battle to get investment bankers’ blood pumping. Last weekend I urged Week in Breakingviews readers to watch this space after Denmark’s Novo Nordisk (NOVOb.CO), opens new tab launched an aggressive offer for U.S. biotech Metsera (MTSR.O), opens new tab, trouncing a $7 billion bid from pharma giant Pfizer (PFE.N), opens new tab. In the following seven days, the fight escalated. It offers clues about how cross-border M&A deals are contested in today’s exuberant and highly politicised markets.\n\nFirst, a quick recap. Metsera is developing promising obesity treatments but will not generate an operating profit until 2030, according to analysts’ forecasts collated by Visible Alpha. That’s why Pfizer offered $47.50 per share in cash but also threw in a so-called contingent value right (CVR) worth $22.50 per share, which pays out if Metsera’s drugs reach certain development milestones.\n\nAdvertisement · Scroll to continue\n\nEnter Novo, which crashed the party by offering up to $9 billion with an unusual twist: the Danish company promised to pay, opens new tab $56.50 per share in cash immediately after signing the deal, and a CVR similar to Pfizer’s if the deal goes ahead. If Novo fails to win approval from shareholders or competition regulators, it ends up with a 50% non-voting stake in Metsera. Pfizer responded by suing both Metsera, opens new tab and Novo, opens new tab, while tweaking its offer to increase the cash component. Novo then upped its bid to almost $10 billion, Pfizer matched that figure, and Novo hiked again, Reuters reported. Late on Friday, Metsera accepted, opens new tab Pfizer’s offer of $65.60 per share in cash, plus a CVR worth up to $20.65 per share.\n\nThere are three takeaways from this week-long slugfest. The first is that financial discipline is often the earliest casualty when two big companies go head-to-head. Pfizer’s most recent offer implies it will earn a return on its investment of just 6.4% in 2030. Novo, already one of two dominant suppliers of obesity treatments, may have extracted more benefits. But it could equally have ended up as a forced seller of non-voting stock in a company it was not allowed to own.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV2146273620 \nAbout ConnatixV2146273620 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nThe second lesson is that courts are unlikely to help. Pfizer sued to stop Metsera’s board from accepting the Novo offer and triggering the cash payout. But Delaware’s Court of Chancery refused. Though Pfizer said it would fight on, opens new tab, its decision to counterbid suggested it was not entirely confident about its legal approach.\n\nThe final point is that U.S. competition authorities made what looks like a decisive intervention in Pfizer’s favour. The Federal Trade Commission quickly waved through, opens new tab the American company’s offer. It also questioned whether Novo’s approach was circumventing the U.S. antitrust process, Bloomberg reported, opens new tab. That raised the unpalatable prospect of Metsera accepting Novo’s cash payout but then being forced to return it. The Danish company on Thursday struck a deal with President Donald Trump to lower U.S. prices for obesity treatments. Yet that agreement does not appear to have helped Novo secure more favourable treatment from American competition cops.\n\nThe only clear winners right now are Metsera shareholders, whose investment is worth 2.5 times more than it was two months ago.\n\nCHART OF THE WEEK\n\nWall Street titans descended on Hong Kong this week for the Asian financial hub’s annual summit of financial leaders. When I attended the confab two years ago, the attending CEOs did their utmost to avoid talking about China’s moribund stock market and troubled property sector. This time the mood was more optimistic. However, the U.S. banks are feeling the pinch: most of the benefits of the pickup in activity have flowed to Chinese deal advisers, rather than big American firms.\n\nTHE WEEK IN PODCASTS\n\nHow is China faring in the artificial intelligence race? Many executives think the U.S. is still ahead. But others, like Nvidia’s (NVDA.O), opens new tab Jensen Huang, reckon the People’s Republic is winning, even though it lacks the U.S. tech giants’ raw spending power and advanced chips. That was the topic of debate on the Viewsroom, opens new tab this week, as Robyn Mak and Karen Kwok joined Aimee Donnellan and Una Galani to compare the two rivals.\n\nOn The Big View, opens new tab, I talked to John Studzinski, the veteran financier and philanthropist who is vice chairman of the fund management giant PIMCO. We talked about his career in finance, and how to motivate people to share their wealth.\n\nPARTING SHOT\n\nAs climate negotiators convene in Brazil this weekend for the annual United Nations climate summit, it’s easy to be pessimistic. Trump is winding back green policies in the United States, while U.N. Secretary-General António Guterres has effectively declared dead the goal of limiting global warming to 1.5 degrees centigrade above pre-industrial levels. Yet there are points of light amid the gloom – even if it takes longer than climate activists had hoped.\n\nWant to receive The Week in Breakingviews in your inbox every Saturday? Sign up for the newsletter here.\n\nFollow Peter Thal Larsen on Bluesky, opens new tab and LinkedIn, opens new tab.\n\nEditing by Liam Proud; Production by Oliver Taslic\n\nBreakingviewsReuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.Sign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com. All opinions expressed are those of the authors.\n\nPurchase Licensing Rights\n\nPeter Thal LarsenThomson ReutersPeter is Global Editor of Reuters Breakingviews, based in London. He was previously EMEA editor, and before that spent four years in Hong Kong as Asia Editor, where he oversaw the launch of Breakingviews’ Asian edition. Prior to joining Reuters in 2009, Peter spent 10 years at the Financial Times, including five years as the paper’s banking editor, leading its award-winning coverage of the credit crunch. Between 2000 and 2004 Peter reported for the FT from New York, where he covered a range of stories including the 9/11 attacks and their aftermath. A Dutch national, Peter has degrees from Bristol University and the London School of Economics.Email","summary":"The Week in Breakingviews: Doing battle over drugs  Reuters","url":"https://www.reuters.com/commentary/breakingviews/global-markets-breakingviews-2025-11-09/","image":"https://www.reuters.com/resizer/v2/25JS6TYRJNMNFEO2MXTY3ZOMXQ.jpg?auth=a652423592b612cf62312f2335faa471d9498328eb289c033100e1225da04f56&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-11-09 23:45:00","author":"Peter Thal Larsen","authors":["Peter Thal Larsen"],"language":"en","source_country":"gb","sentiment":0.053},{"id":377367464,"title":"'People Against Tariffs Are FOOLS!': Trump Defends Tariffs, Promises $2000 Dividend Amid Supreme Court Scrutiny","text":"Washington: President Donald Trump on Sunday defended his tariff policy, calling opponents of the measure \"fools,\" and claimed that tariffs have made the United States \"the richest, most respected country in the world, with almost no inflation.\"He also said that a \"dividend of at least $2,000 a person (not including high-income people!) will be paid to everyone\" from tariff revenues.\"People that are against Tariffs are FOOLS!\" Trump wrote in a post on Truth Social, asserting that the United States has become \"the richest, most respected country in the world, with almost no inflation, and a record stock market price. 401k's are highest ever.\"He claimed that the US is \"taking in trillions of dollars\" from tariffs, which he said would allow the US to \"soon begin paying down our enormous debt, $37 trillion.\"Trump added that record investments were flowing into the country, with \"plants and factories going up all over the place,\" and further mentioned that a \"dividend of at least $2,000 a person (not including high-income people!) will be paid to everyone,\" though no further details about the proposed payout were provided.These comments come days after the US Supreme Court began arguments on November 6 over the global tariffs imposed during Trump's presidency, highlighting ongoing legal scrutiny of the policies he is defending.CNN reported that the case is being seen as one of the most significant economic cases to reach the Supreme Court in years, with justices weighing whether the US President acted lawfully when imposing sweeping tariffs on major global trading partners.During the hearing, Trump's attorney faced deep skepticism from several justices, including Amy Coney Barrett, Neil Gorsuch, and Brett Kavanaugh.Justice Barrett questioned the administration's use of a federal law to impose higher tariffs and challenged why all countries were subjected to \"reciprocal\" tariffs.Treasury Secretary Scott Bessent was also present, emphasising that the administration views the situation as an economic emergency.Earlier this week, White House Press Secretary Karoline Leavitt said the administration was prepared for all outcomes but remained confident in its legal position.\"We are 100% in the President and his team's legal arguments and the merits of the law in this case. We remain optimistic that the Supreme Court is going to do the right thing,\" she said, adding that the case extends beyond Trump's presidency and concerns the use of emergency tariff powers for future administrations.","summary":"Trump defends tariffs, calling opponents &quot;fools&quot; and promising a $2,000 dividend to Americans, amid Supreme Court review.","url":"https://www.republicworld.com/world-news/people-against-tariffs-are-fools-trump-defends-tariffs-promises-2000-dividend-amid-supreme-court-scrutiny","image":"https://img.republicworld.com/all_images/trump-s-tariff-i-us-supreme-court-1762141320540-16_9.webp","video":null,"publish_date":"2025-11-09 23:37:33","author":"Asian News International","authors":["Asian News International"],"language":"en","category":"politics","source_country":"in","sentiment":-0.1},{"id":377376012,"title":"Trump Makes Historic NFL Appearance, Draws Boos From Crowd","text":"President Donald Trump attended a regular-season National Football League (NFL) game Sunday between the Washington Commanders and Detroit Lions, making him the first sitting president in nearly 50 years to attend such an event.\n\nTrump arrived at Northwest Stadium in a suite with House Speaker Mike Johnson and was introduced by the stadium announcer at halftime. However, portions of the crowd booed when Trump appeared on the videoboard late in the first half and again during his halftime military oath recitation, according to the Associated Press and video footage from the game.\n\nWhy It Matters\n\nOnly two other sitting presidents have attended regular-season NFL games while in office: Richard Nixon in 1969 and Jimmy Carter in 1978. Trump previously made history by attending a Super Bowl while serving as president in February, when he watched the Philadelphia Eagles defeat the Kansas City Chiefs 40-22. \n\nTrump has embraced sports during his second administration, using them as a showcase of patriotism heading into the nation’s 250th anniversary. He has attended several Ultimate Fighting Championship (UFC) matches, the NCAA Men’s Wrestling Championship, and he plans to host a series of sporting events next year to celebrate the nation’s birth.\n\nThis is brutal. Trump just got LOUDLY booed at the Commanders game. Americans hate him. So humiliating for Trump. pic.twitter.com/swcYL50kpg— Harry Sisson (@harryjsisson) November 9, 2025\n\nWhat To Know\n\nThe visit comes amid new developments regarding Trump’s interest in naming the Commanders’ future stadium after himself. \n\nAccording to ESPN, Trump reportedly wants the new $3.7 billion stadium—set to be constructed on the site of the former Robert F. Kennedy Memorial Stadium and completed in 2030—to bear his name. White House Press Secretary Karoline Leavitt confirmed the interest in an emailed statement to Newsweek on Saturday, stating, “That would surely be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible.” \n\nTrump has a history with the Commanders organization regarding naming. He previously threatened to block stadium construction unless the team reverted to its former name, the Washington Redskins, threatening to “put a restriction on them.” Some groups have regarded the Redskins name as offensive to Native Americans, leading to the team’s rebranding as the Commanders in 2022.\n\nDefense Secretary Pete Hegseth also attended the game, chatting with Commanders principal owner Josh Harris and participating in an on-field ceremony with members of the military. During his remarks before arriving at the stadium, Trump referenced the government shutdown, saying “The Democrats have to open it up.”\n\nSenate Democrats have signaled openness to voting to end the shutdown if they receive certain concessions from the White House, according to a report from Axios. Senate Majority Leader John Thune indicated the chamber plans to hold an initial vote on a working proposal that would extend government funding into late January, suggesting negotiations between the White House and Congress remain active on potential resolution pathways.\n\nSunday’s game also featured several notable elements: Lions receiver Amon-Ra St. Brown celebrated a touchdown catch using the “Trump dance,” a gesture several athletes began performing last year.\n\nLANDOVER, MARYLAND – NOVEMBER 09: United States Secretary of Defense Pete Hegseth claps while U.S. President Donald Trump holds up his fist during a game between the Detroit Lions and the Washington Commanders at Northwest Stadium on November 09, 2025 in Landover, Maryland. (Photo by Greg Fiume/Getty Images)\n\nWhat People Are Saying\n\nNY Post National Politics Editor Marisa Shultz on X: “Trump and Hegseth presided over an enlistment event for new military members on the field during Commanders-Lions game. Crowd was quite loud with some in this section trying to drown him out.”\n\nDemocratic political commentator Harry Sisson on X: “This is brutal. Trump just got LOUDLY booed at the Commanders game. Americans hate him. So humiliating for Trump.”\n\nTech influencer Brian Krassenstein on X: “Trump was just viciously BOOED at the Washington Commanders Detroit Lions game. I’ve never heard a president booed this loudly in my life. Holy cow!”\n\nPodcast host Brian Tyler Cohen on X: “Trump just got massively booed and flipped off by the crowd at the Commanders game.”\n\nCommanders Team President Mark Clouse in a statement posted on social media: “We are honored to welcome President Trump to the game as we celebrate those who have served and continue to serve our country. The entire Commanders organization is proud to participate in the NFL’s league-Salute to Service initiative, recognizing the dedication and sacrifice of our nation’s veterans, ac...","summary":"Trump arrived at Northwest Stadium in a suite with House Speaker Mike Johnson.","url":"https://www.newsweek.com/trump-makes-historic-nfl-appearance-draws-boos-from-crowd-11019092","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-2245395253.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-09 23:36:15","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","source_country":"US","sentiment":0.024},{"id":377373470,"title":"Maryland Gov Wes Moore brushes off top state Democrat's warning on redistricting possibly backfiring","text":"Gov. Wes Moore, D-Md., dismissed concerns from Maryland Senate President Bill Ferguson, a fellow Democrat, over his new push to redraw the state’s congressional map on Sunday. In a letter last month, Ferguson urged his party to avoid pursuing mid-cycle redistricting measures to redraw Maryland's congressional lines, fearing that the process could backfire. \"I believe that mid-cycle redistricting in Maryland twists rules for potential short-term advantage while undermining trust in institutions and ultimately, democracy, but that is not the reason we should not pursue it,\" Ferguson wrote. \"Simply put, it is too risky and jeopardizes Maryland’s ability to fight against the radical Trump Administration.\" NEWSOM-STYLE REDISTRICTING EFFORTS CRITIQUED BY CALIFORNIA DEMOCRATS AS RECENTLY AS JULY, STATEMENTS SHOW Moore told CBS' \"Face the Nation\" host Margaret Brennan that \"fighting for democracy is never risky\" and stood by his order to form a redistricting commission despite Ferguson's objections. \"My job is to make sure that I'm protecting the democratic process,\" Moore said. \"The Senate President and I, we agree on the crisis that Donald Trump has put us in. He agrees on the fact that we have watched an administration that's using the Constitution like it's a suggestion box.\" \"Where we differ is the urgency that this moment requires, the fight that this moment requires,\" he continued. \"And I personally am someone who is not going to allow Donald Trump to determine whether or not Maryland follows this idea of saying, are we going to do everything we can to make sure we're preserving our democracy.\" FORMER DEMOCRATIC ADVISOR SAYS PARTY'S RHETORIC ON REDISTRICTING IS GETTING 'A LITTLE OUT OF CONTROL' Brennan pressed Moore over whether he considered redistricting efforts in Maryland to be \"fair,\" noting that Maryland has only one Republican representative. Moore insisted that he would not be drawing the maps and only wants a bipartisan commission to balance out redistricting efforts in other states. \"I want this bipartisan commission to be able to actually speak with the people and to be able to go through their process and just simply say that if other states are going to go through this process, that we're not just going to sit on our hands because Donald Trump tells us to,\" Moore said. \"That's not the way this process is going to work.\" Fox News Digital reached out to Ferguson for comment. LONE MARYLAND GOP CONGRESSMAN WARNS REDISTRICTING COULD CUT WHITE HOUSE TIES FOR ENTIRE STATE Moore is not the only blue state leader attempting to redraw congressional districts. On Tuesday, voters passed California Gov. Gavin Newsom's Proposition 50, which returns power to redraw congressional lines from a nonpartisan redistricting commission to the California legislature. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Newsom's ballot measure came after Texas Republicans successfully passed a new congressional map, which added five new Republican-leaning districts in the state.","summary":"Gov. Wes Moore defended his push to redraw Maryland&apos;s congressional map despite objections from state Senate President Bill Ferguson over mid-cycle redistricting.","url":"https://www.foxnews.com/media/maryland-gov-wes-moore-brushes-off-top-state-democrats-warning-redistricting-possibly-backfiring","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/09/WesMoore1.jpg","video":null,"publish_date":"2025-11-09 23:35:57","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":-0.675},{"id":377373772,"title":"NFL star Amon-Ra St. Brown welcomes Donald Trump to DC by copying his dance after scoring TD for Lions","text":"With President Donald Trump in attendance at this afternoon's Washington Commanders-Detroit Lions game, Lions wideout Amon-Ra St. Brown marked the occasion with Trump's signature dance.\n\nSt. Brown scored a touchdown early on in the contest to take a 14-3 lead over the Commanders at the game played in Landover, Maryland.\n\nAfter taking a 14-3 lead, St. Brown appeared to point directly up to Trump and did the President's signature 'twist' dance alongside his teammates - including fellow wideout Jameson Williams.\n\nIt's not clear if that was an homage to the President, or a way to mock him - considering St. Brown plays for the road team.\n\nTrump is at the stadium during the week of Veteran's Day - with the Commanders set to celebrate the occasion.\n\nTrump sat in a luxury box at the game alongside Commanders owner Josh Harris after arriving in Landover by helicopter - shortly after Air Force One flew over Northwest Stadium.\n\nHe was later shown on the jumbotron. According to Washington Post Commanders beat writer Tom Schad, there were 'lots of boos' when the President was projected on screen.\n\nAt the half, Trump read off an Oath of Enlistment to a group of citizens signing up to join the American military. That too was met with resounding boos from the audience.\n\nTrump's attendance at the game comes after reports indicated that he has requested the football team to name their upcoming $3billion+ stadium project after him.\n\nPress secretary Karoline Leavitt told ESPN: 'That would be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible'.\n\nThe outlet claim that Leavitt did not answer further questions but did say: 'It's what the president wants, and it will probably happen.'\n\nThe Commanders anticipate discussing the move with the President, according to ESPN, but nothing formal has taken place.\n\nBut sources told the outlet, 'He [Trump] has cards to play. \n\n'He can make it very difficult, through government environmental approvals, to make sure everyone who wants this stadium to be built will join to put his name on it'.\n\nAfter years of searching, the Commanders are set to begin work on building a new stadium on the site of their former DC home - RFK Stadium. The team left that building in 1996.\n\nCongress passed a bill transferring the RFK Stadium land to the city that was signed by then-President Joe Biden in early January.\n\nThat paved the way for making it possible to replace the old stadium with a mixed-use development, including the new venue for the Commanders.\n\n'I don't think there is a better site anywhere in the world than that site,' Trump said back in May, while taking some credit for the plan.\n\n'It sat there for years and people were talking about stadiums and 25 different sites. I said they're not talking about the best site. That's the best site there is.","summary":"With President Donald Trump in attendance at this afternoon's Washington Commanders-Detroit Lions game, Lions wideout Amon-Ra St. Brown marked the occasion.","url":"https://www.dailymail.co.uk/sport/nfl/article-15274995/amon-ra-st-brown-trump-dance-maryland.html","image":"https://i.dailymail.co.uk/1s/2025/11/09/22/103733137-0-image-m-9_1762727805078.jpg","video":null,"publish_date":"2025-11-09 23:34:23","author":"Editor,Jake Fenner","authors":["Editor","Jake Fenner"],"language":"en","category":"politics","source_country":"gb","sentiment":0.156},{"id":377376488,"title":"USDA tells states to undo efforts to issue full food aid benefits","text":"Some states had previously said they would fund November Supplemental Nutrition Assistance Programme benefits using state funds. (EPA Images pic)\nWASHINGTON: The US department of agriculture (USDA) directed states to roll back any steps taken to issue full food aid benefits to low-income Americans or risk financial penalties.\nThe new guidance issued late Saturday follows a US Supreme Court order on Friday that allowed the Trump administration to continue withholding US$4 billion to fully fund the aid for nearly 42 million recipients, pending a lower court ruling.\nSupplemental Nutrition Assistance Programme (SNAP) benefits, also known as food stamps, lapsed at the start of the month for the first time in the programme's 60-year history due to the federal government shutdown, which is now in its 40th day.\nHours before the Supreme Court order, the USDA had informed states in a memo that it was working to comply with a federal judge's order to fully fund SNAP, even as the administration moved to appeal the ruling.\nAfter receiving that Friday memo, several states said they were beginning the process of issuing full benefits.\nHowever, those state actions are now unauthorised because of the Supreme Court order, the USDA wrote in guidance released on Saturday.\n\"State governments should instead issue only partial benefits,\" the USDA said.\n\"States must immediately undo any steps taken to issue full SNAP benefits for November 2025,\" the memo issued by the USDA late Saturday said.\n\"Failure to comply with this memorandum may result in USDA taking various actions, including cancellation of the Federal share of state administrative costs and holding states liable for any over issuances that result from the noncompliance,\" the USDA said.\nSome states had previously said they would fund November SNAP benefits using state funds.\nIt was not immediately clear whether the memo applied to actions taken by those states.\nThe USDA did not respond to a request for additional comment.\nMassachusetts and New Jersey, which were among the states that said on Friday they were moving to issue full benefits to SNAP recipients, criticised the guidance by the USDA.\n\"If President Trump wants to penalise states for preventing Americans from going hungry, we will see him in court,\" Massachusetts governor Maura Healey said in a written statement.\n\"We will continue to work with (Massachusetts) Attorney General (Andrea) Campbell to make sure everyone gets the full benefits they are owed,\" Healey added.\nA spokesman for New Jersey's office of the governor said in a statement that the state is closely monitoring developments.\n\"Washington Republicans’ determination to starve American citizens during this government shutdown is shameful.\n\"We hope that a fair resolution to this unnecessary, unprecedented problem is reached soon and federal funding for SNAP and other lapsed programmes is backfilled,\" the spokesman said.\nLegal fight\nStates, cities and nonprofit organisations have sued the administration of President Donald Trump to issue full SNAP benefits after it said in October that the programme would lapse on Nov 1.\nTwo federal judges ruled on Oct 31 that the administration needed to at least partially fund the benefits using an agency contingency fund of about US$5 billion.\nSNAP benefits cost about US$8 billion to US$9 billion per month.\nThe administration said it would comply with the order, but warned of weeks or months of delay due to technical hurdles.\nCities and nonprofits represented by the liberal legal group Democracy Forward argued those actions were inadequate and pressed US District Judge John McConnell in Rhode Island to order the administration to issue full benefits.\nOn Nov 6, McConnell ordered the administration to fully fund November SNAP benefits by the following day, which was quickly appealed by the Department of Justice.\nThe Supreme Court's Friday order gave the Boston-based First US Circuit Court of Appeals additional time to consider the administration's formal request to only partially fund the benefits.\nAs the legal fight plays out, SNAP recipients have turned to already strained food pantries and made sacrifices like forgoing medications to stretch tight budgets.","summary":"Massachusetts and New Jersey, which planned to issue full Supplemental Nutrition Assistance Programme benefits, criticised the US department of agriculture’s guidance.","url":"https://www.freemalaysiatoday.com/category/world/2025/11/10/usda-tells-states-to-undo-efforts-to-issue-full-food-aid-benefits","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/32d0b4dc-13458454_cropped_1.webp","video":null,"publish_date":"2025-11-09 23:34:07","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.337},{"id":377374634,"title":"Baby boomers lead shift away from U.S. visits; younger people go ‘quiet travelling’ (Business)","text":"Nathalie Morisseau leapt at the chance for a last-minute sun vacation with her 23-year-old daughter — as long as it wasn’t in America.\n\n“With my father being Haitian, there’s a certain fear around being able to go to the United States,” she said, citing concerns around immigration enforcement and attitudes toward perceived outsiders.\n\n“It’s not attractive,” Morisseau said at the Montreal airport ahead of a flight to the Dominican Republic late last month.\n\n“And it’s scary.”\n\nShe’s not alone. Hundreds of thousands of Canadians continue to steer clear of the United States roughly 10 months after President Donald Trump took office, with baby boomers leading the flight — even as younger people, along with those feeling the pull of warm weather and community south of the border, remain more willing to go.\n\nThe number of Canadians returning from the U.S. by car and plane combined fell by roughly a third in September compared with the same month last year, according to preliminary data from Statistics Canada. It marked the ninth straight month of year-over-year declines for return trips by car.\n\n“Canadians are really choosing destinations other than the U.S. to travel,” said Will McAleer, executive director of the Travel Health Insurance Association of Canada. “We saw that particularly amongst the boomer crowd.”\n\nThe number of baby boomers likely to head stateside this winter fell by two-thirds to 10 per cent, according to an association survey. However, Gen Z respondents saw only an 18 per cent drop to 44 per cent. The lower the age, the higher the appetite to visit — though it remains depressed across the spectrum.\n\nGrowing aversion to America can be chalked up to political tensions over Trump’s tariffs and 51st-state rhetoric as well as rising costs and exchange rates — the loonie is worth about 71 cents US — the survey found.\n\nTo accommodate changing travel patterns, Air Canada is ramping up flight volumes to the Caribbean, Latin America and Europe while cutting capacity to the U.S. Other airlines have made similar moves.\n\nAnd Americans are noticing. Multiple states have rolled out tourism campaigns designed to win Canadians back to their resorts and restaurants.\n\nIn California, Canadian visitors are expected to spend US$3 billion this year versus US$3.7 billion in 2024, said Ryan Becker, a senior vice-president at Visit California, a non-profit corporation that launched the “California Loves Canada” campaign with Gov. Gavin Newsom earlier this year.\n\n“That’s a gut punch to the industry,” Becker said last week from Toronto, where he accompanied a delegation of more than a dozen Golden State tourism executives on a tour that included Calgary and Vancouver. “This is not something that we are taking lightly.”\n\nStill, border traffic is far from a trickle. Nearly 1.8 million Canadians returned by land or air from the U.S. in September, the StatCan data shows.\n\nMany find themselves conflicted.\n\nAlanni Duenas took his one-year-old son to Chicago for a friend’s wedding this month despite serious concerns over a crackdown by U.S. Immigration and Customs Enforcement.\n\n“The neighbourhood I’m going to, where my family’s from, is hit hard by ICE,” said the dual citizen. “ICE just coming out of nowhere, taking them, they don’t hear from them.”\n\nTwo of his uncles who are naturalized citizens were temporarily detained, he said.\n\nHis partner Giuliana Biancardi said she was “very nervous, especially with my son — bringing kids across the border.\n\n“There’s no way we’re going back just for funsies,” she said.\n\nFor others, considerations ranging from cheaper travel to friends and kinship ties keep them coming back.\n\n“Younger people ... don’t necessarily have the budget to travel to farther places,” said Barry Choi, who runs the Money We Have personal finance and travel website.\n\n“Going to Orlando Disney is probably cheaper than going to Tokyo Disney.”\n\nThose who still want to see Broadway, Beale Street or Sunset Boulevard may take up what McAleer calls “quiet travelling” — an under-the-radar approach to tourism that’s light on social media posts, shared with others only in hushed tones or with a pinch of guilt.\n\n“It’ll be, ‘Well, yeah, I’m going to go down there.’ But they’re not going to promote it in the same manner,” he said.\n\nMeanwhile, corporate travel to big U.S. cities continues to hum along, according to Flight Centre Canada.\n\n“Business is business. We don’t have a choice,” said Catherine Paquin, who works as a boat dealer with her husband. She flew to Washington, D.C., from Montreal to pick up a vessel in Maryland and haul it to Fort Lauderdale, Fla., last week.\n\n“The boat market is in Florida,” she said, while acknowledging others’ reservations. “There are a lot of my friends who don’t want to go to the United States right now, for political reasons.”\n\nCanadians with property on the far side of the 49th parallel will likely keep coming back as well.\n\nBetween 30 and 40 per cent of snowbirds own a home in the U.S., said Stephen Fine, founder of Snowbird Advisor Insurance. About 70 per cent come by car.\n\n“They’re unlikely to leave their condo or their house empty for the winter,” Fine said. “And for those who want to have their vehicle with them over the winter, the U.S. is really their only option.”\n\nThen there’s the social element.\n\n“They have communities and friends that they go and see every year. That’s important to them,” he said.\n\nFor those resistant to the idea of embracing America in the age of Trump, the weather may yet win over some hearts and minds.\n\n“We haven’t even had the first snowstorm yet,” said Jill Wykes, editor of Snowbird Advisor, an online resource for Canadians wintering outside the country.\n\n“That normally makes people want to go.”\n\nThis report by The Canadian Press was first published Nov. 9, 2025.","summary":"Nathalie Morisseau leapt at the chance for a last-minute sun vacation with her 23-year-old daughter &mdash; as long as it wasn&rsquo;t in America.\n\n&ldquo;With my father being Haitian, there&rsquo;s a certain fear around being able to go to the United States,&rdquo; she said, citing concerns aroun...","url":"https://www.castanet.net/news/Business/583077/Baby-boomers-lead-shift-away-from-U-S-visits-younger-people-go-quiet-travelling-","image":"https://www.castanet.net/content/2025/11/466dfe5defde7b8e6ff3032e7b9c46ae8eb3c818b0d646424c67dc625f70119c.jpg","video":null,"publish_date":"2025-11-09 23:31:00","author":"Christopher Reynolds","authors":["Christopher Reynolds"],"language":"en","source_country":"ca","sentiment":-0.277},{"id":377368492,"title":"Trump accuses BBC of election meddling","text":"US President Donald Trump has accused the BBC of interfering in the 2024 presidential election, claiming the British state-funded broadcaster attempted to manipulate public perception by editing coverage of his January 6, 2021 speech.\n\nBBC Director General Tim Davie and Head of News Deborah Turness announced their resignations on Sunday, amid a scandal over an hour-long documentary, Trump: A Second Chance?, which first aired just a week ahead of last year’s US presidential election.\n\n“The TOP people in the BBC, including TIM DAVIE, the BOSS, are all quitting/FIRED, because they were caught ‘doctoring’ my very good (PERFECT!) speech of January 6th,” Trump wrote on Truth Social.\n\nThe controversial documentary featured a spliced video of Trump’s speech, combining remarks made nearly an hour apart and juxtaposing them with footage of protesters that was actually filmed before Trump began speaking.\n\nThe scandal was triggered by a whistleblower memo from former BBC standards adviser Michael Prescott, which was exposed by The Telegraph last week. The report alleged that senior executives ignored complaints raised by the corporation’s own standards watchdog.\n\n“Thank you to The Telegraph for exposing these Corrupt ‘Journalists.’ These are very dishonest people who tried to step on the scales of a Presidential Election,” Trump said.\n\n“What a terrible thing for Democracy!” the US president added, noting that the alleged election meddling came “from a Foreign Country, one that many consider our Number One Ally.”\n\nThe BBC is funded through a compulsory licence fee of £174.50 ($229), with the UK government also subsidising a third of its World Service programming. The White House had previously criticised the broadcaster as a “Leftist propaganda machine” and “100 percent fake news,” accusing it of being “purposefully dishonest” in its portrayal of Trump.\n\nThe incident is not the first time Trump has alleged British interference in the 2024 election. Last October, his campaign filed a complaint with the Federal Election Commission accusing the UK’s Labour Party of aiding the Democrats by sending party operatives to work in key swing states. British officials denied wrongdoing, insisting that the work was legal and unpaid.","summary":"US President Donald Trump has accused the British state-funded broadcaster of manipulating public perception ahead of the 2024 election \nRead Full Article at RT.com","url":"https://www.rt.com/news/627549-trump-bbc-election-meddling/","image":"https://mf.b37mrtl.ru/files/2025.11/article/6911238b85f5400e7f0e586a.jpg","video":null,"publish_date":"2025-11-09 23:30:31","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.107},{"id":377378270,"title":"Top BBC bosses resign after criticism of the broadcaster’s editing of a Trump speech (Entertainment)","text":"The head of the BBC and the British broadcaster's top news executive both resigned Sunday after criticism of the way the organization edited a speech by U.S. President Donald Trump.\n\nThe BBC said Director-General Tim Davie and news CEO Deborah Turness had both decided to leave the corporation.\n\nBritain’s publicly funded national broadcaster has been criticized for editing a speech Trump made on Jan. 6, 2021, before protesters attacked the Capitol in Washington.\n\nCritics said that the way the speech was edited for a BBC documentary last year was misleading and cut out a section where Trump said that he wanted supporters to demonstrate peacefully.\n\nIn a letter to staff, Davie said quitting the job after five years “is entirely my decision.”\n\n“Overall the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility,” Davie said.\n\nHe said that he was “working through exact timings with the Board to allow for an orderly transition to a successor over the coming months.”\n\nTurness said that the controversy about the Trump documentary “has reached a stage where it is causing damage to the BBC — an institution that I love. As the CEO of BBC News and Current Affairs, the buck stops with me.”\n\n“In public life leaders need to be fully accountable, and that is why I am stepping down,” she said in a note to staff. “While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.”\n\nTrump posted a link to a Daily Telegraph story about the speech-editing on his Truth Social network, thanking the newspaper “for exposing these Corrupt 'Journalists.' These are very dishonest people who tried to step on the scales of a Presidential Election.” He called that \"a terrible thing for Democracy!\"\n\nWhite House press secretary Karoline Leavitt reacted on X, posting a screen grab of an article headlined “Trump goes to war with ‘fake news’ BBC” beside another about Davie's resignation, with the words “shot” and “chaser.”\n\nPressure on the broadcaster’s top executives has been growing since the right-leaning Telegraph published parts of a dossier compiled by Michael Prescott, who had been hired to advise the BBC on standards and guidelines.\n\nAs well as the Trump edit, it criticized the BBC’s coverage of transgender issues and raised concerns of anti-Israel bias in the BBC’s Arabic service.\n\nThe 103-year-old BBC faces greater scrutiny than other broadcasters — and criticism from its commercial rivals — because of its status as a national institution funded through an annual license fee of 174.50 pounds ($230) paid by all households with a television.\n\nThe BBC airs vast reams of entertainment and sports programming across multiple television and radio stations and online platforms — but it's the BBC's news output that is most often under scrutiny.\n\nThe broadcaster is bound by the terms of its charter to be impartial in its output, and critics are quick to point out when they think it has failed. It's frequently a political football, with conservatives seeing a leftist slant in its news output and some liberals accusing it of having a conservative bias.\n\nIt has also been criticized from all angles over its coverage of the Israel-Hamas war in Gaza. In February, the BBC removed a documentary about Gaza from its streaming service after it emerged that the child narrator was the son of an official in the Hamas-led government.\n\nKemi Badenoch, leader of the opposition Conservative Party, said that the BBC was full of “institutional bias,” and “the new leadership must now deliver genuine reform of the culture of the BBC, top to bottom.”\n\nLisa Nandy, the minister in charge of media in Britain’s center-left Labour government, thanked Davie for his work and said that the government would help the BBC secure “its role at the heart of national life for decades to come.\n\n“Now more than ever, the need for trusted news and high quality programming is essential to our democratic and cultural life, and our place in the world,” Nandy said.","summary":"The head of the BBC and the British broadcaster's top news executive both resigned Sunday after criticism of the way the organization edited a speech by U.S. President Donald Trump. The BBC said Director-General Tim Davie and news CEO Deborah Turness had both decided to leave the corporation. Britai...","url":"https://www.castanet.net/news/Entertainment/583075/Top-BBC-bosses-resign-after-criticism-of-the-broadcaster-s-editing-of-a-Trump-speech","image":"https://www.castanet.net/content/2025/11/56a7ce60883dc228f086dacb112c4ac8ad2b2d66b82a4b7b990e3055b8b94062.jpg","video":null,"publish_date":"2025-11-09 23:28:00","author":"Jill Lawless,The Canadian Press","authors":["Jill Lawless","The Canadian Press"],"language":"en","source_country":"ca","sentiment":0.138},{"id":377375548,"title":"Al-Sharaa meets Syrian diaspora in Washington ahead of talks with Trump (Video)","text":"Syria's interim President Ahmad al-Sharaa met on Sunday with a delegation representing the Syrian community in Washington ahead of official talks with U.S. President Donald Trump.\n\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home","summary":"Syria's interim President Ahmad al-Sharaa met on Sunday with a delegation representing the Syrian community in Washington ahead of official talks with U.S. President Donald Trump. Subscribe: http://smarturl.it/AssociatedPress Read more: https://apnews.com This video may be...\n\n\nThe post Al-Sharaa meets Syrian diaspora in Washington ahead of talks with Trump (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/11/09/al-sharaa-meets-syrian-diaspora-in-washington-ahead-of-talks-with-trump-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/11/09/maxresdefault-42.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1762732263","video":null,"publish_date":"2025-11-09 23:21:03","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":0.59},{"id":377364892,"title":"WATCH: Donald Trump steals spotlight with dramatic Air Force One flyover at Lions vs. Commanders Week 10 game","text":"Donald Trump made headlines on Sunday when he was spotted attending the Washington Commanders' game against the Detroit Lions. And there was one particular moment that captured its magnitude.At some point, Air Force One, the Presidential plane, flew over Northwest Stadium. After it happened, the President told the media:\"Was that the greatest flyover ever? Nobody has ever done a flyover like that… Country is doing well.\"The spectacle comes a day after he was reported to have demanded that the Commanders name their new stadium, which is expected to open in 2030, after him. A source told ESPN:\"He has cards to play. He can make it very difficult, through government environmental approvals and other things, to make sure everyone who wants this stadium to be built will join to put his name on it. Trump has plenty of cards to play to get his way.\"And while neither Trump nor the Commanders have confirmed the report, White House press secretary Karoline Leavitt has supported the idea:\"That would be a beautiful name, as it was President Trump who made the rebuilding of the new stadium possible.\"Donald Trump had unsavory remarks about Bad Bunny’s upcoming Super Bowl LX appearanceIn October, Donald Trump had this to say about the announcement that Puerto Rican rapper/singer Bad Bunny would perform at the Super Bowl halftime show:“This guy does not seem like a unifying entertainer and a lot of folks don’t even know who he is. I never heard of him. … I don’t know why they’re doing it, it’s crazy… I think it’s absolutely ridiculous.”Corey Lewandowski, a top adviser in his presidential campaigns, decried it as “shameful”, even warning that ICE agents would attend.However, NFL commissioner Roger Goodell defended Bad Bunny, saying later that month:“He’s one of the leading and most popular entertainers in the world. That’s what we try to achieve. ... We’re confident it’s going to be a great show and that he understands the platform that he’s on. I think it’s going to be exciting and a united moment.”Super Bowl LX will be held on February 8, 2026. Primary media coverage will be on NBC.","summary":"Donald Trump made headlines on Sunday when he was spotted attending the Washington Commanders' game against the Detroit Lions. And there was one particular moment that captured its magnitude.","url":"https://www.sportskeeda.com/nfl/news-watch-donald-trump-steals-spotlight-dramatic-air-force-one-flyover-lions-vs-commanders-week-10-game","image":"https://staticg.sportskeeda.com/editor/2025/11/9c630-17627270664770-1920.jpg","video":null,"publish_date":"2025-11-09 23:20:28","author":"Andre Castillo","authors":["Andre Castillo"],"language":"en","category":"politics","source_country":"in","sentiment":-0.241},{"id":377369026,"title":"Why have Tim Davie and Deborah Turness resigned from the BBC?","text":"BBC director-general Tim Davie and CEO of BBC News Deborah Turness have resigned, as the broadcaster looks to close the door on a scandal-hit period of its recent history. \n\nA tumultuous week for the BBC saw it accused of institutional bias, as criticism flooded in over an edited clip of a Donald Trump speech in a Panorama documentary. \n\nBut this was only the latest in a series of controversies and scandals which have scarred the broadcaster in recent years, with accusations of institutional bias levelled at the broadcaster from both sides of the political spectrum.\n\nFollow The Independent’s live coverage of Tim Davie’s resignation here.\n\nIn his resignation statement, Mr Davie accepted that “there have been some mistakes” during his time in the role and emphasised that his choice to leave was “entirely my decision”.\n\nHe also paid tribute to the organisation, which he said is of “unique value and speaks to the very best of us” - but accepted the broadcaster is “not perfect and must always be open, transparent and accountable”.\n\nMs Turness also accepted mistakes had been made, but said she is “absolutely clear [that] recent allegations that BBC News is institutionally biased are wrong”. \n\nThe Independent looks at the full story of Mr Davie’s and Ms Turness’ time at the BBC - and where it all went wrong. \n\nTim Davie, 58, was appointed as BBC director-general in September 2020.\n\nA former Conservative Party candidate for council elections in the 1990s, Mr Davie first joined the BBC as a marketing director in April 2005. \n\nHe became Director of Audio & Music in 2008, sitting on the BBC’s Executive Board, before he took over as acting director-general in November 2012. He held this position until April 2013, when Tony Hall was appointed. \n\nHe served as chief executive of BBC Studios before becoming director-general in a permanent capacity. \n\nDeborah Turness had been CEO of BBC News since 2022, where she oversaw the broadcaster’s news and current affairs output. \n\nShe was responsible for a team of around 6,000 people, broadcasting to almost half a billion people worldwide in more than 40 languages. \n\nMs Turness previously served as president of NBC News and CEO of ITN. \n\nRecent months and years have seen the BBC embroiled in repeated controversies over a number of different issues. \n\nOne key criticism was directed at the BBC from all sides of the political spectrum: impartiality. \n\nThis came to a head in the past week, when the BBC was accused of bias against Donald Trump amid controversy around a BBC panorama episode called Trump: A Second Chance?\n\nA clip in the programme, broadcast the week before last year’s US election, spliced clips together from sections of the US president’s speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to “fight like hell”.\n\nIn the original speech, Trump said: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"\n\nBut the edit put the first part of that speech with another section from 50 minutes later, so he was shown saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"\n\nIt drew fierce criticism from The White House, with press secretary Karoline Leavitt telling The Telegraph it “purposefully dishonestly, selectively edited clip by the BBC is further evidence that they are total, 100 per cent fake news that should no longer be worth the time on the television screens of the great people of the United Kingdom”.\n\nMr Davie said in his resignation statement that while it was not the only reason, the “current debate around BBC News has understandably contributed to my decision”.\n\nHe added: “Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable.”\n\nIn her statement, Ms Turness said: \"The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC – an institution that I love.\n\n\"As the CEO of BBC News and Current Affairs, the buck stops with me - and I took the decision to offer my resignation to the director general last night.\"\n\nMr Davie’s resignation has been welcomed enthusiastically by some parts of the political spectrum and less so by others.\n\nFigures on the right wing have responded on both sides of the Atlantic. \n\n“The TOP people in the BBC, including TIM DAVIE, the BOSS, are all quitting/FIRED, because they were caught ‘doctoring’ my very good (PERFECT!) speech of January 6th,” Trump wrote on Truth Social on Sunday evening.\n\n“Thank you to The Telegraph for exposing these Corrupt ‘Journalists.’ These are very dishonest people who tried to step on the scales of a Presidential Election,” he said. \n\nKemi Badenoch said Tim Davie and Deborah Turness had “finally taken responsibility” but that a “catalogue of serious failures” at the BBC “runs far deeper”.\n\nNigel Farage, meanwhile, said the resignation of Tim Davie and Deborah Turness must be “the start of wholesale change”.\n\nIn contrast culture secretary Lisa Nandy thanked Mr Davie for his “service to public broadcasting over many years” and recognising that he had led the BBC through a “period of significant change and helped the organisation to grip the challenges it has faced in recent years”.\n\nLiberal Democrat leader Sir Ed Davey called on the BBC to “turn a new leaf, rebuild trust and not give in to the likes of Nigel Farage who want to destroy it”.\n\nThe director-general will be appointed by the BBC Board, led by chair Samir Shah who is one of 10 non-executive members plus four executive members - including the director-general. \n\nFour of the non-executive members are appointed as members for each of the UK nations. \n\nThe process will be led by the BBC Board’s nominations committee, and it will be made under the terms of the BBC’s Charter, which is drawn up by the government. \n\nMr Davie’s successor will be the 18th director-general in 103 years of the BBC’s existence.","summary":"Davie stepped down following intense pressure after a series of scandals","url":"https://www.independent.co.uk/news/uk/home-news/tim-davie-deborah-turness-bbc-resignations-trump-panorama-edit-b2861830.html","image":"https://static.independent.co.uk/2025/11/09/22/3b4c5a6a1f74f729431b8c21f5e9eac5Y29udGVudHNlYXJjaGFwaSwxNzYyODExOTgw-2.55264944.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/fcFvztj1-OhrQWqOm.mp4","publish_date":"2025-11-09 23:16:00","author":"Alex Croft","authors":["Alex Croft"],"language":"en","source_country":"gb","sentiment":0.003}]}