{"offset":0,"number":50,"available":20485,"news":[{"id":381634536,"title":"COP30 Climate Summit Reaches Deal That Leaves Many Nations Unhappy","text":"(Bloomberg) -- Almost 200 nations gathered in Brazil for the United Nations’ annual climate summit capped two weeks of fraught negotiations with an agreement Saturday on new efforts to help guide their transition away from the fossil fuels driving global warming.However, the accord dodged an explicit mention of the oil, gas and coal responsible for driving the bulk of climate change, and it didn’t detail plans for shifting away from them, leaving some countries unhappy with the outcome.The eight-page declaration forged at the COP30 summit on the edge of the Amazon rain forest won grudging acceptance. Many nations argued more must be done to counter climate change, while also conceding that an imperfect package was better than none at all.“With an increasingly fractured geopolitical backdrop, COP30 gave us some baby steps in the right direction,” said Mohamed Adow, director of the Power Shift Africa advocacy group. “But considering the scale of the climate crisis, it has failed to rise to the occasion.”Leaders at the summit in Belém, Brazil, had encouraged countries to accept a final deal even if it didn’t have everything they wanted. They insisted it was necessary to show nations were linking arms to fight climate change at a time when other multilateral diplomacy is fraying.“This deal isn’t perfect and is far from what science requires,” said Mary Robinson, the former president of Ireland. “But at a time when multilateralism is being tested, it is significant that countries continue to move forward together.”The agreement from the COP30 summit responds to a looming gap between what’s necessary to limit global warming to 1.5C above pre-industrial levels and what countries are actually doing or committed to pursuing. Under the decision adopted Saturday, the COP presidency would run a new voluntary initiative meant to “accelerate implementation” of action needed to limit global warming to 1.5C above pre-industrial levels — a key threshold identified in the 2015 Paris Agreement. A separate “Belém Mission to 1.5” is aimed at enabling implementation of national emission-cutting pledges. A group of about 80 countries and the European Union had pressed for a more explicit road map to guide the transition away from oil, gas and coal toward a cleaner economy but met resistance from key oil and gas producing states from the Middle East as well as Russia. Supporters of the final decision said it keeps an opening for further guidelines and collaboration on how countries can fulfill their two-year-old commitment to transition the world’s energy systems away from fossil fuels. That agreement was a crucial aspect of COP28 in Dubai. The Global Mutirão decision, named after a Brazilian term for collective action, lacks an explicit, word-by-word reiteration of the commitment to an energy transition some delegates said was important to bolster business and investment decisions. “Staying silent on fossil fuels” isn’t sufficient, said Harjeet Singh, a founding director of the Satat Sampada Climate Foundation.COP30 President André Corrêa do Lago separately pledged to create two separate “road map” initiatives, one focused on an orderly, just transition away from fossil fuels and one focused on deforestation. Those initiatives would continue during his presidency over the next year.“They will be led by science, and they will be inclusive,” Corrêa do Lago vowed. The announcement drew applause in the packed COP30 closing plenary room on Saturday.The declaration itself omits any significant references to combating deforestation, even though the issue was prioritized by Brazil’s President Luiz Inácio Lula da Silva. The only real mention comes in the document’s preamble, with an acknowledgment of the importance of “enhanced efforts towards halting and reversing deforestation and forest degradation by 2030.”Several countries raised concerns Saturday, complaining that their views had been overlooked inside negotiating rooms and the final session. A representative from Panama said the nation was “extremely disappointed” with the final outcome, saying it pretends to measure work on adaptation while refusing to offer meaningful resources to fund it. Colombia raised an objection to a text addressing how to limit warming because it was silent on the fossil fuels responsible for the majority of climate change.A Colombia representative said the country had no choice but to object to the mitigation measure unless the summit agreed to add a reference to discussion of “industry and the pathways for implementing the transition away from fossil fuels” at 2026 dialogues.“There is no mitigation if we cannot discuss transitioning away from fossil fuels,” she told the plenary. “Today, we’re not even allowed to discuss it.”Corrêa do Lago suspended the closing plenary after the objection, as negotiators gathered in small groups to consider a response.US President Donald Trump, who has derided climate change as a “scam,” and is pulling his country out of the Paris Agreement, shunned the summit, creating a power vacuum that empowered other nations during the two weeks of talks. Energy and environment ministers from around the globe wrestled with difficult questions about how trade policy impacts climate change as well as how to boost the amount of finance available to help countries adapt to the warming world’s rising seas, intensifying storms and punishing droughts.The declaration adopted Saturday calls for the tripling of adaptation finance by 2035 compared to 2025 levels, equivalent to around $120 billion. That fell short of poor nations’ push for the commitment to be met five years earlier.The measure also takes a swipe at so-called unilateral trade actions such as tariffs and carbon levies, reaffirming that measures taken to combat climate change “should not constitute a means of arbitrary or unjustifiable discrimination or a disguised restriction on international trade.” It also sets up a dialogue and a high-level event in 2028 to consider the role of trade policy. The trade language responds to developing nations concerned about the EU’s Carbon Border Adjustment Mechanism, which imposes an extra fee on imports of covered goods coming from countries whose price on carbon dioxide is below that of the bloc.More stories like this are available on bloomberg.com©2025 Bloomberg L.P.","url":"https://www.livemint.com/news/world/cop30-climate-summit-reaches-deal-that-leaves-many-nations-unhappy-11763837750476.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/news4_1733464472752_1733464484649.jpg","video":null,"publish_date":"2025-11-23 18:55:50","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":0.079},{"id":381634526,"title":"Trump says Ukraine peace proposal not final offer — ‘One way or the other, we have to get it ended’","text":"As Ukrainian President Volodymyr Zelensky is ‘geared up for clear and honest work’ with the US on Trump backed 28-point plan for ending the Ukraine war with Russia, US President Donald Trump said that the peace proposal was not a final offer.When a reporter asked if his 28-point proposal was a final offer, Trump replied, ‘no’.\"I would like to get to PEACE... We're trying to get it ended. One way or the other, we have to get it ended,\" said the President.When another reporter asked if Zelensky rejects the plan, Trump said, “then he can continue to fight his little heart out.” Trump-backed 28-point plan demands that Kyiv give up land, cut its army and hold snap elections.According to a draft reviewed by AFP, the plan backed by Donald Trump says that Ukraine will receive a reliable security guarantee, Ukraine will hold elections in 100 days, and Russia will enshrine in law its policy of non-aggression towards Europe and Ukraine, among other things.“Once all parties agree to this memorandum, the ceasefire will take effect immediately after both sides retreat to agreed points to begin implementation of the agreement,” says the draft plan.Meanwhile, Ukrainian and US envoys will meet in Switzerland on Sunday along with European security chiefs, reported AFP quoting officials.\"We will have an informal pre-meeting tonight for dinner\" with Ukrainian delegates, the US official said.Meanwhile, in a post on X, EU Commission President Ursula von der Leyen said that they will continue to coordinate closely with Ukraine and the US over the coming days.“We welcome the continued US efforts to bring peace to Ukraine. The initial draft of the 28-point plan includes important elements that will be essential for a just and lasting peace. We believe therefore that the draft is a basis which will require additional work,” she said.Ursula further added that they are ready to engage in order to ensure that a future peace is sustainable.“We are clear on the principle that borders must not be changed by force. We are also concerned by the proposed limitations on Ukraine’s armed forces, which would leave Ukraine vulnerable to future attack. We reiterate that the implementation of elements relating to the European Union and relating to NATO would need the consent of EU and NATO members respectively.”","url":"https://www.livemint.com/news/us-news/trump-says-ukraine-peace-proposal-not-final-offer-one-way-or-the-other-we-have-to-get-it-ended-zelensky-kyiv-russia-11763836345893.html","image":"https://www.livemint.com/lm-img/img/2025/11/22/1600x900/logo/TRUMP-DEPART-WH-10_1763836885341_1763836896396.jpg","video":null,"publish_date":"2025-11-23 18:46:29","author":"Livemint","authors":["Livemint"],"language":"en","category":"politics","source_country":"in","sentiment":0.191},{"id":381641172,"title":"Gunmen seize 315 in latest Nigerian mass school kidnapping","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis handout photo taken by Reverend Bulus Dauwa Yohanna, Chairman of the Christian Association of Nigeria (CAN) of Niger state chapter and Catholic Bishop of Kontagora Diocese on November 21, 2025 and distributed on November 22, 2025 shows open lockers and scattered personal belongings inside a dormitory at St. Marys Catholic School in Papiri town in Agwarra local government, Niger state. A Christian group on November 22, 2025 said 315 students and teachers were seized a day earlier in Nigeria's second mass school abduction in a week, as security fears mounted in Africa's most populous nation.\nThe early November 21, 2025 raid on St Mary's co-education school in Niger state in central Nigeria came after gunmen on November 17, 2025 stormed a secondary school in neighbouring Kebbi state, abducting 25 girls. (Photo by Bulus Dauwa Yohanna / Christian Association of Nigeria (CAN) / AFP) \n\n International News, Latest News \n\nNovember 22, 2025\n\n\n\n\n Gunmen seize 315 in latest Nigerian mass school kidnapping \n\n\n\n\n\n\n\nLagos, Nigeria (AFP)—Gunmen have kidnapped more than 300 students and teachers in one of the largest mass kidnappings in Nigeria, a Christian group said Saturday, as security fears mounted in Africa’s most populous nation.\n\nThe early Friday raid on St Mary’s co-education school in Niger state in central Nigeria came after gunmen on Monday stormed a secondary school in neighbouring Kebbi state, abducting 25 girls.\n\nThe Christian Association of Nigeria (CAN) had earlier reported 227 people seized, but the new number came “after a verification exercise” following the early Friday mass kidnapping, and added that “The total number of victims abducted … is now 303 students and 12 teachers”.\n\nThe number of boys and girls kidnapped from St Mary’s is almost half of the school’s student population of 629.\n\nThe Nigerian government has not commented on the number of students and teachers abducted.\n\nNiger state governor Mohammed Umar Bago told reporters on Saturday said the intelligence department and police were “doing the head count”.\n\nBago, whose government had ordered some schools shut, also announced the closure of all schools in his state. Nearby states have also shuttered all theirs as a precautionary measure.\n\nThe national education ministry has also ordered 47 boarding secondary schools across the country be shut.\n\nPresident Bola Tinubu has cancelled international engagements, including attending the G20 summit in Johannesburg, to handle the crisis.\n\nThe two abduction operations and an attack on a church in the west of the country, in which two people were killed and dozens abducted, have happened since US President Donald Trump threatened military action over what he called the killing of Christians by radical Islamists in Nigeria.\n\nNigeria is still scarred by the kidnapping of nearly 300 girls by Boko Haram jihadists at Chibok in northeastern Borno state more than a decade ago. Some of those girls are still missing.\n\nOn Saturday Stella Shaibu, a 40-year-old nurse, collected her daughter from a government school in Bwari, an hour drive from Abuja following the directive to shut schools.\n\nQuestioning how it cannot even be safe on the outskirts of the capital, she concludes “government is not doing anything” to curb insecurity.\n\n“How can 300 students be taken away at the same time? How can, within three-four days, children have been abducted?”\n\n“If there is something that the American government can do to salvage this situation, I’m totally in support,” she told AFP.\n\n\n\n\n\n\n\n\nTags: deaths gunmen Nigeria students teachers \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Liverpool stunned by Forest, Newcastle damage Man City title push \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n LONDON, United Kingdom (AFP)—Troubled Liverpool's woeful season hit a new low with a shocking 3-0 home defeat against Nottingham Forest, while Newcast... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n US records second human bird flu death of year \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n WASHINGTON, United States (AFP)—A resident of Washington state has died after contracting a rare strain of bird flu previously only reported in animal... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Reggae Girlz to start 2027 World Cup campaign next week \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n KINGSTON, Jamaica — The Jamaica Football Federation (JFF) is urging Jamaicans to throw their support behind the Reggae Girlz as they prepare to kick o... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n After Melissa, egg farmers put GCT removal back on table \n\n\n\n\n BY DANA MALCOLM Observer online reporter malcolmd@jamaicaobserver.com \n\n\n\nNovember 22, 2025 \n\n\n Following severe damage to local poultry farms during Hurricane Melissa, egg farmers are reiterating their call for the removal of the General Consump... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n United States warns against flying over Venezuelan airspace \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n WASHINGTON, United States (CMC) — The United States Federal Aviation Administration (FAA) late Friday issued a security notice to airmen (NOTAM) cauti... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n ‘Tap into the happy’ \n\n\n Psychiatrist says power of play an important therapy tool for traumatised children post-Melissa \n\n\n DANA MALCOLM, Observer Online reporter, malcolmd@jamaicaobserver.com \n\n\n\nNovember 22, 2025 \n\n\n Rain, as little as a light drizzle, has become an unpleasant experience for Mae Allen’s two-year-old grandson, so much so that the mere sound of raind... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n NEPA says tadpole surge after Hurricane Melissa ‘no cause for concern’ \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n KINGSTON, Jamaica — The National Environment and Planning Agency (NEPA) says it is aware of a recent video currently circulating on social media which... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/22/gunmen-seize-315-latest-nigerian-mass-school-kidnapping/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/000_84TP9MX.jpg","video":null,"publish_date":"2025-11-23 01:16:50","author":null,"language":"en","source_country":"jm","sentiment":0.035},{"id":381641500,"title":"After Marjorie Taylor Greene, Netanyahu Amplifies Epstein–Mossad Claim; Shares Story On Barak’s Role","text":"Israel has been left deeply rattled after U.S. President Donald Trump approved a major defence deal to supply F-35 stealth fighter jets to Saudi Arabia — a move that experts say could radically alter the balance of air power in the Middle East. Saudi Arabia is expected to receive up to two squadrons of F-35 jets, though with downgraded capabilities compared to Israel’s more advanced F-35I “Adir” fleet. Israel, currently the only country in the region operating F-35s, fears that Riyadh acquiring even a restricted version of the jets could erode its strategic military advantage guaranteed under U.S. law. Watch this video to know more.\n\n 426 views | 2 days ago","url":"https://timesofindia.indiatimes.com/videos/international/after-marjorie-taylor-greene-netanyahu-amplifies-epsteinmossad-claim-shares-story-on-baraks-role/videoshow/125510909.cms","image":"https://timesofindia.indiatimes.com/photo/msid-125510909/125510909.jpg?resizemode=4","video":null,"publish_date":"2025-11-23 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":0.045},{"id":381629390,"title":"BREAKING: Trump Calls MTG ‘Nice Person’ He ‘Won’t Forgive’, Says 28-point Ukraine Plan Not Final","text":"1 views | Nov 23, 2025, 12:00:00 AM | TOI.in\n\nU.S. President Donald Trump held a wide-ranging press conference, addressing questions on Ukraine, internal GOP disputes, and security concerns in New York City. When pressed about his feud with Marjorie Taylor Greene, Trump dismissed any talk of forgiveness, saying she is a “nice person” and asking reporters, “What’s there to forgive?” He said their disagreements began only when Greene aligned herself with Thomas Massie — whom Trump blasted as “stupid and the worst Republican Congressman in the history of the United States.” Trump said he would deploy the National Guard to New York City only “if the city requires them,” signalling no immediate intervention. He also doubled down on his 28-point peace proposal for Ukraine, stressing that the plan is not his final offer. Trump said President Volodymyr Zelensky could “continue to fight” if he refuses to accept the terms. Watch his full news conference here.","url":"https://timesofindia.indiatimes.com/videos/international/breaking-trump-calls-mtg-nice-person-he-wont-forgive-says-28-point-ukraine-plan-not-final/videoshow/125510162.cms","image":"https://timesofindia.indiatimes.com/photo/msid-125510162/125510162.jpg?resizemode=4","video":null,"publish_date":"2025-11-23 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":-0.576},{"id":381614994,"title":"Vamsi Gadiraju-Netra Mantena wedding: From Donald Trump Jr's dance with Ranveer Singh, to Janhvi, Shahid's performances, a look at billionaire's sangeet","text":"Netra Mantena, daughter of US pharma billionaire Rama Raju Mantena, is marrying tech innovator Vamsi Gadiraju on November 23, 2025, at Udaipur’s Jagmandir Island Palace. The star-studded pre-wedding bash, attended by Jennifer Lopez, Donald Trump Jr., Shah Rukh Khan, Salman Khan, and Ranveer Singh, is one of India’s biggest events of 2025. Ahead of their wedding, videos and photos from their sangeet ceremony are going viral on the internet.","url":"https://www.dnaindia.com/india/photo-gallery-vamsi-gadiraju-netra-mantena-wedding-from-donald-trump-jr-dance-with-ranveer-singh-to-janhvi-shahid-s-performances-a-look-at-billionaire-s-sangeet-3190017","image":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2025/11/22/2731976-vamsi-wedding.jpg","video":null,"publish_date":"2025-11-22 22:38:00","author":"Jennifer Lopez","authors":["Jennifer Lopez"],"language":"en","source_country":"in","sentiment":0.234},{"id":381656824,"title":"US to launch new phase of Venezuela operations, sources say","text":"WASHINGTON, D.C. - The United States is poised to launch a new phase of Venezuela-related operations in the coming days, four U.S. officials told Reuters, as the Trump administration escalates pressure on President Nicolas Maduro's government.\n\nReuters was not able to establish the exact timing or scope of the new operations, nor whether U.S. President Donald Trump had made a final decision to act. Reports of looming action have proliferated in recent weeks as the U.S. military has deployed forces to the Caribbean amid worsening relations with Venezuela.\n\nTwo of the U.S. officials said covert operations would likely be the first part of the new action against Maduro. All four officials quoted in this article spoke on the condition of anonymity because of the sensitivity of impending action by the United States.\n\nThe Pentagon referred questions to the White House. The CIA declined to comment.\n\nA senior administration official on Saturday did not rule anything out regarding Venezuela.\n\n\"President Trump is prepared to use every element of American power to stop drugs from flooding into our country and to bring those responsible to justice,\" said the official, speaking on the condition of anonymity.\n\nThe Venezuelan Communications Ministry did not immediately respond to a request for comment.\n\nThe Trump administration has been weighing Venezuela-related options to combat what it has portrayed as Maduro’s role in supplying illegal drugs that have killed Americans. He has denied having any links to the illegal drug trade.\n\nTwo U.S. officials told Reuters the options under consideration included attempting to overthrow Maduro.\n\nMaduro, in power since 2013, has contended that Trump seeks to oust him and that Venezuelan citizens and the military will resist any such attempt. He also has characterized U.S. actions as an effort to take control of Venezuela's oil.\n\nA military buildup in the Caribbean has been underway for months, and Trump has authorized covert CIA operations in Venezuela. The U.S. Federal Aviation Administration on Friday warned major airlines of a \"potentially hazardous situation\" when flying over Venezuela and urged them to exercise caution.\n\nThree international airlines cancelled flights departing from Venezuela on Saturday after the FAA warning. \n\nThe United States plans on Monday to designate the Cartel de los Soles a foreign terrorist organization for its alleged role in importing illegal drugs into the United States, officials said. The Trump administration has accused Maduro of leading Cartel de los Soles, which he denies.\n\nHEGSETH: NEW OPTIONS AFTER TERRORIST DESIGNATION\n\nWashington in August doubled its reward for information leading to Maduro's arrest to $50 million. But U.S. Defense Secretary Pete Hegseth said last week that the terrorist designation \"brings a whole bunch of new options to the United States.\"\n\nTrump has said the upcoming designation would allow the United States to strike Maduro's assets and infrastructure in Venezuela, but he also has indicated a willingness to potentially pursue talks in hopes of a diplomatic solution.\n\nMaduro said earlier this week that the countries' differences should be resolved through diplomacy and that he is willing to hold face-to-face talks with anyone interested.\n\nTwo U.S. officials acknowledged conversations between Caracas and Washington. It was unclear whether those conversations could impact the timing or scale of potential U.S. operations.\n\nThe U.S. Navy's largest aircraft carrier, the Gerald R. Ford, arrived in the Caribbean on November 16 with its strike group, joining at least seven other warships, a nuclear submarine and F-35 aircraft.\n\nU.S. forces in the region so far have focused on counter-narcotics operations, even though the assembled firepower far outweighs anything needed for them. U.S. troops since September have carried out at least 21 strikes on alleged drug boats, killing at least 83 people, mostly in the Caribbean, although vessels in the Pacific Ocean also have been targeted.\n\nHuman rights groups have condemned the strikes as illegal extrajudicial killings of civilians, and some U.S. allies have expressed growing concerns that Washington may be violating international law.\n\nThe Trump administration has said for months that the attacks on boats are meant to curb trafficking of drugs it says kill millions of Americans. However, most drug overdose deaths in the United States are caused by fentanyl, which is largely manufactured in Mexico.\n\nDrug traffickers move some cocaine through the Caribbean, according to international organizations, but much of the supply for North America moves on the Pacific.\n\nThe U.S. military dwarfs Venezuela's, which is debilitated by a lack of training, low wages and deteriorating equipment.\n\nThat reality has led Maduro's government to consider alternative strategies in the event of a U.S. invasion, including possibly a guerrilla-style response, which the government has termed \"prolonged resistance\" and mentioned in broadcasts on state television.\n\nThis approach would involve small military units at more than 280 locations carrying out acts of sabotage and other guerrilla tactics, Reuters has reported, citing sources and years-old planning documents. REUTERS","url":"https://www.straitstimes.com/world/europe/us-to-launch-new-phase-of-venezuela-operations-sources-say","image":"https://cassette.sphdigital.com.sg/image/straitstimes/4e2aac6dae63126399f1406fa38f10be023a1c840643d72f86719d3d08d52feb","video":null,"publish_date":"2025-11-22 22:22:32","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.2},{"id":381657234,"title":"Donald Trump ally shares heartwarming Cristiano Ronaldo story after failing to recognize him at the White House","text":"Brooke Rollins, Donald Trump's Secretary of Agriculture, has revealed how impressed she was by Cristiano Ronaldo after meeting the soccer great at the White House earlier this week - even though she wasn't sure at first who he was.\n\nRonaldo, 40, was in Washington DC as part of a visiting delegation from Saudi Arabia, led by the Crown Prince Mohammed bin Salman. It was the first time Ronaldo had been seen publicly in the United States since a 2017 rape accusation from an American teacher, which he has always strongly denied.\n\nThe Manchester United and Real Madrid great was welcomed to the White House by President Trump and for a glitzy dinner that the President hosted for his guests, Ronaldo and fiancee Georgina Rodriguez was sat alongside Rollins.\n\nReflecting on the night Rollins shared with her husband, she revealed on Instagram that she didn't immediately know who the soccer star was.\n\n'Still processing this one…Mark and I were so honored to attend and welcome so many wonderful friends from across the globe,' Rollins wrote.\n\n'When I sat down at my seat, I noticed the name card right next to me said Mr. Ronaldo. I wondered who in the world could that be.\n\n'A few minutes later a tall man with a huge smile, literally beaming joy, took the seat. To my kids extreme embarrassment, I didn’t immediately recognize him (“GEEZ MOM HE HAS MORE INSTA FOLLOWERS THAN ANYONE IN THE WORLD!!”). But within seconds we were FAST friends and for sure won the prize for the most fun table!'\n\nRollins continued: 'Cristiano and Georgina, THANK YOU for the laughs, shared love and patriotism for our home countries, and for making a beautiful night even more perfect. \n\n'Their kindness, humility, and light filled the room. Nothing better than making new friends. What a blessing! (But I stand by my assertion that American “football” is still the best!!)\n\n'So grateful to be part of this game changing team at this moment in history. God bless America!!!'\n\nRonaldo's ongoing absence from the United States had coincided with the rape allegations. Since the claims were made by American teacher Kathryn Mayorga, Ronaldo had not been involved in any exhibition games held in the US involving the teams he has played for - Real Madrid, Juventues, Manchester United and his current one, the Saudi club Al Nassr.\n\nThe matter was thrown back into the spotlight last Sunday when Portugal clinched qualification for next summer's World Cup, where the majority of the tournament is held in the United States. Ronaldo and his Portugal team are also scheduled to play the United States in Atlanta next March in a friendly. \n\nRevealing details of the alleged sexual assault in a 2017 interview with German newspaper Der Spiegel, Mayorga claimed Ronaldo raped her at a Las Vegas hotel in 2009.\n\nThe American woman had reportedly reached an out-of-court settlement with Ronaldo in 2010, but spoke out with her accusations seven years later in an effort to seek millions more than the $375,000 (£304,000) sum she had received.\n\nThe lawsuit against Ronaldo, who has consistently and strongly denied the allegations, was dismissed by a US judge in 2022 because the accuser's lawyer relied on leaked and stolen records.\n\nTrump thanked Ronaldo for meeting his teenage soccer-obsessed son Barron on the visit, saying during his speech: 'My son is a big fan of Ronaldo... Barron got to meet him and I think he respects his father a little bit more now - just the fact that I introduced you. So I just want to thank you both for being here.'\n\nAfter his visit, Ronaldo thanked Trump for hosting him with a message on Instagram: 'Thank you Mr. President for your invitation and for the warm welcome you and the First Lady gave me and my future wife. \n\n'Each of us has something meaningful to give, and I stand ready to do my part as we inspire new generations to build a future defined by courage, responsibility and lasting peace.'\n\nTrump also gifted Ronaldo a gold key to the White House, something reserved for special guests. Previous recipients include Bibi Netanyahu, the Israeli PM, and Elon Musk.","summary":"Ronaldo, 40, was in Washington DC this week as part of a visiting delegation from Saudi Arabia, led by the Crown Prince Mohammed bin Salman.","url":"https://www.dailymail.co.uk/sport/football/article-15317173/Donald-Trump-trusted-Cristiano-Ronaldo-White-House-trip.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/22/104111267-0-image-m-14_1763849058958.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/19/1132651323082098283/1024x576_MP4_1132651323082098283.mp4","publish_date":"2025-11-22 22:19:45","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","category":"politics","source_country":"gb","sentiment":0.565},{"id":381657458,"title":"Trump unveils ‘president’s golf course’ revamp at Joint Base Andrews","text":"US President Donald Trump said on Saturday that he was enlisting the help of legendary golfer Jack Nicklaus to spruce up the courses at Joint Base Andrews – adding a site long known as the “president’s golf course” to his long list of construction projects.\nThe president took an aerial tour of the Courses at Andrews aboard Marine One and promised, “We’re going to do some work” there, as well as to other parts of the base.\n“We’re doing some fix-up of the base, which it needs. We’re gonna try and reinstitute the golf courses. I’m meeting with the greatest Jack Nicklaus,” Trump told reporters outside the White House before boarding Marine One to head to Andrews.\n“He’s involved in trying to bring their recreational facility back.”\nLocated in Maryland, about 24km (15 miles) from the White House, Andrews houses Air Force One. Gerald R. Ford was the first president to golf there in 1974, but the facility was most recently a favourite of Barack Obama.\nAn 11th Force Support Squadron asset, the facilities include three 18-hole golf courses, three practice putting greens, two private practice areas and a driving range, according to the Andrews website. Trump said at least two of the courses could get facelifts.\n\nTrump has infrequently golfed at Andrews, but prefers to spend most weekends playing at or near one of his own properties. Those are Bedminster in New Jersey, or Mar-a-Lago in Palm Beach, Florida.\nOn those weekends he remains at the White House, Trump often golfs at his course in Sterling, Virginia, near Dulles International Airport.\nNicklaus won 18 professional majors and 73 times on the PGA Tour. The Nicklaus Design firm features a team that has completed more than 425 courses in 40 states and more than 45 countries.\nTrump said Saturday that the base at Andrews “was a great place that’s been destroyed over the years through lack of maintenance”.\n“So we’ll fix that up, and Jack will be the architect and he’ll design it,” the president said.\nHe also referenced, “Two existing courses that are in very bad shape” saying, “we can – for very little money – fix it up”.\n“And we’re looking at other things over at Andrews,’ Trump added.\n\nTrump’s comments immediately raised questions about who is paying Nicklaus, and how much such design services might cost. Also, given that Andrews is military property, who pays for improvements to its golf courses or other parts of its grounds was also unclear.\nAndrews deferred queries on the matter to the White House, which did not respond to a request for more details.\nThe potential Andrews redesign follows construction crews already having demolished the East Wing of the White House to make room for a US$300 million ballroom that Trump commissioned.\nHe has promised that it is being paid for by himself and private donors – including 37 individuals, firms and charitable organisations that have publicly disclosed contributing to the project.\nWork on the ballroom follows Trump having replaced the lawn in the Rose Garden with a patio area reminiscent of Mar-a-Lago, and redecorated the Lincoln Bathroom and Palm Room in the White House’s interior.\nThe president also installed a Walk of Fame featuring portraits of past presidents along the Colonnade, massive flagpoles on the north and south lawns and substantially overhauled the Oval Office through the addition of golden flourishes, cherubs and other, flashy items.\nThe work at Andrews may eventually join another off-White House site project Trump has announced publicly: his plan to erect a Paris-style arch just west of the Lincoln Memorial.\nTrump ceded control of his family business to his children when he returned to the White House, but it controls other courses designed by Nicklaus – including the Trump Golf Links at Ferry Point in the New York borough of the Bronx and Trump National Juniper in Florida.","url":"https://www.scmp.com/news/world/united-states-canada/article/3333822/trump-unveils-presidents-golf-course-revamp-joint-base-andrews?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/23/fc259a69-18fb-4788-ba4c-f3d8cab6c8a8_3b631545.jpg","video":null,"publish_date":"2025-11-22 22:14:31","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"hk","sentiment":0.08},{"id":381654434,"title":"“She has my QB doing drugs now”: NFL fans react as Justin Herbert and Madison Beer get spotted at waste reduction company","text":"Justin Herbert and Madison Beer were spotted at Marley's Monsters, an eco-friendly, zero-waste retail store in Eugene, Oregon, on Friday. It is a company helping people reduce their environmental footprint. They create handmade, reusable alternatives to single-use disposable products.Marley's Monsters posted a picture of the couple on their Instagram story.\"@justinherbert and @madisonbeer supporting Marley's Monsters,\" the text read.Fans flocked to the comment section to share their reaction to the Los Angeles Chargers quarterback and his partner's latest picture.\"She has my QB doing drugs now &#129769;. She has to go,\" a fan said.Donny P @DonnyP45LINK@emilyetaylor23 She has my QB doing drugs now &#129769;. She has to go\"My QB smoking a little reefer on the bye week? MVP,\" one fan said.\"That boy faded out his mind &#128557;,\" another fan said.\"Is my guy baked? Good for him,\" a fan said.More joined in to share their take on the matter.\"I wonder if they’ll be at the game tomorrow,\" a fan said.\"That boy Herbo off the zoinks &#128514;,\" another fan said.Justin Herbert wore a dark, long-sleeve shirt paired with black pants and topped it off with a gray beanie. Beer donned an oversized light pink hoodie with long sleeves and paired it with light gray sweatpants. She also had sunglasses resting on her head.Maddison Beer pulls off the Donald Trump dance while cheering for Justin HerbertJustin Herbert’s girlfriend, Madison Beer, did the “Donald Trump dance,” raising both fists and moving her hips during the Chargers’ Week 10 Sunday Night Football win over the Steelers at SoFi Stadium.The couple reportedly began dating earlier this year. Their relationship first surfaced after Herbert appeared on the set of one of her music videos in August. Since then, she’s frequently been spotted cheering him on at Chargers games.Beer was recently spotted dressed in a fitted SKIMS sweater from Kim Kardashian’s brand during a breakfast outing. She paired it with a Chanel flap bag valued at $6,007. She completed the outfit with Celine Dion sunglasses, UGG Chestnut Coquette slippers and a necklace featuring her last name.The “Bittersweet” singer showed support for Herbert’s alma mater, the University of Oregon, by wearing an Oregon Ducks sweatshirt while buying a Beatles poster in Sherman Oaks on November 8.Justin Herbert and Co. have a bye this week following a humiliating 35-6 loss to the Jacksonville Jaguars on November 16. They will host the Las Vegas Raiders in the Week 13 matchup on Sunday, November 30.","summary":"Justin Herbert and Madison Beer were spotted at Marley's Monsters, an eco-friendly, zero-waste retail store in Eugene, Oregon, on Friday.","url":"https://www.sportskeeda.com/nfl/news-she-qb-drugs-now-nfl-fans-react-justin-herbert-madison-beer-get-spotted-waste-reduction-company","image":"https://staticg.sportskeeda.com/editor/2025/11/27414596-1763836093.jpeg","video":null,"publish_date":"2025-11-22 22:00:51","author":"Nishant","authors":["Nishant"],"language":"en","source_country":"in","sentiment":0.336},{"id":381654378,"title":"US senators slam Trump's Russia-Ukraine peace plan as rewarding aggression","text":"Halifax (Canada), Nov 23 (AP) US senators critical of President Donald Trump’s approach to ending the Russia-Ukraine war said Saturday that the peace plan he is pushing Kyiv to accept would only reward Moscow for its aggression and send a message to other leaders who have threatened their neighbours.\n The 28-point peace plan was crafted by the Trump administration and the Kremlin without Ukraine’s involvement. It acquiesces to many Russian demands that Ukrainian President Volodymyr Zelenskyy has categorically rejected on dozens of occasions, including giving up large pieces of territory. Trump says he wants Ukraine to accept the plan by late next week.\n The senators’ opposition to the plan follows criticism from other US lawmakers, including some Republicans, none of whom have the power to block it. The senators, who spoke at an international security conference in Canada, included a Democrat, an Independent and a Republican who does not plan to seek reelection next year.\n “It rewards aggression. This is pure and simple. There’s no ethical, legal, moral, political justification for Russia claiming eastern Ukraine,” Independent Maine Sen. Angus King said during a panel discussion at the Halifax International Security Forum in Canada.\n King, a member of the Senate Foreign Relations Committee, compared the proposal to British Prime Minister Neville Chamberlain’s Munich Pact with Adolf Hitler in 1938, a historic failed act of appeasement.\n Republican Sen. Thom Tillis of North Carolina said Sen. Mitch McConnell, a former Republican Senate party leader, didn’t go far enough in his criticism of it. McConnell said in a statement Friday that “if Administration officials are more concerned with appeasing Putin than securing real peace, then the President ought to find new advisers.” “We should not do anything that makes (Putin) feel like he has a win here. Honestly, I think what Mitch said was short of what should be said,” said Tillis. Tillis announced earlier this year that he would not seek reelection shortly after he clashed with the Trump administration over its tax and spending package.\n Democratic Sen. Jeanne Shaheen of New Hampshire, the ranking Member of the Senate Foreign Relations Committee, called it an “outrage.” Putin welcomed the proposal late Friday, saying it “could form the basis of a final peace settlement” if the US can get Ukraine and its European allies to agree.\n Zelenskyy, in an address, did not reject the plan outright, but insisted on fair treatment while pledging to “work calmly” with Washington and other partners in what he called “truly one of the most difficult moments in our history.” In its 17th year, about 300 people gather annually at the Halifax International Security Forum held at Halifax’s Westin hotel. The forum attracts military officials, US senators, diplomats and scholars but this year the Trump administration suspended participation of US defence officials in events by think tanks, including the Halifax International Security Forum.\n A large number of US senators made the trip this year in part because of strained relations between Canada and the US Trump has alienated America’s neighbour with his trade war and insistence that Canada should become the 51st US state.\n Many Canadians now refuse to travel to the US and border states like Shaheen’s New Hampshire are seeing a dramatic drop in tourism.\n “There’s real concern about that strain. That’s one reason why there’s such a big delegation is here,” Shaheen said. “I will continue to object to what the president is doing in terms about tariffs and his comments because they are not only detrimental to Canada and our relationship, but I think they are detrimental globally. They show a lack of respect of sovereign nations.” (AP) GRS GRS","summary":"","url":"https://www.news18.com/agency-feeds/us-senators-slam-trumps-russia-ukraine-peace-plan-as-rewarding-aggression-9725780.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-11-22 22:00:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.212},{"id":381655024,"title":"G20’s Africa Engagement Framework seeks to cut cost of capital","text":"Norwegian Ambassador to South Africa, Gjermund Saether, says the G20 hosts should be congratulated for adopting the Africa Engagement Framework.\n\nThe framework prioritises African fiscal and macroeconomic challenges, improving institutional governance, reducing the continent’s high cost of capital, and enhancing private sector finance.\n\nSaether adds that considering what South Africa has achieved since taking over the G20 presidency in December 2024, Oslo has even more reason to increase its investment in Pretoria and across the African continent.\n\nThe two G20 Leaders Summit ends later on Sunday, with a formal handover to the US not likely to happen.\n\nThe G20 leaders broke with tradition and adopted a declaration at the start of their summit on Saturday, not at the end as expected. This is despite opposition from the United States.\n\nPolitical analyst Dr Thelela Ngcetane-Vika says the European Union’s presence and support at the G20 Summit is significant, especially following US President Donald Trump’s decision not to attend.\n\nShe adds that the joint statement issued by President Cyril Ramaphosa, German Chancellor Friedrich Merz, and French President Emmanuel Macron lends credibility to the G20.\n\nNgcetane-Vika adds that China’s absence should not be a concern, as the country has sent high-level delegations and continues to show support for South Africa.\n\nThe Declaration sets out actions to address climate-related disasters and sovereign debt levels, among other issues.","summary":"The G20 leaders broke with tradition and adopted a declaration at the start of their summit","url":"https://www.sabcnews.com/sabcnews/1084742-2/","image":"https://www.sabcnews.com/sabcnews/wp-content/uploads/2025/11/SABC-News-G20-Nasrec-GCIS.jpg","video":null,"publish_date":"2025-11-22 21:56:21","author":"Sabc","authors":["Sabc"],"language":"en","category":"politics","source_country":"za","sentiment":0.31},{"id":381657492,"title":"The Girls of Chibok, Maga, Papiri and our Frankenstein -By Festus Adedayo","text":"On the night of April 14, 2014, rumour took over the Nigerian space. On that night, as Islamic jihadists’ trucks and buses forcibly conveying abducted 276 girls from Chibok, Borno State, disappeared into the Sambisa forest, a scary rumour whooshed in the Nigerian air. The girls were aged 16 to 18 and students of Government Girls Secondary School, Chibok. It brings the question, what is the place of rumour in our everyday society? Nicholas DiFonzo and Prashant Bordia, in their “Rumor, gossip and urban legends” Diogenes (2007) say rumour is an “unverified and instrumentally relevant information statement in circulation”. Simply put, you can dismiss rumour at your peril. Because, as the agò (costume) shawls the masquerade from view, the egúngún could emerge from the agò as human after all. As such, even with power, majesty and Intel reports at his disposal, as the Jihadists ferried the girls into Sambisa, President Goodluck Jonathan chose to queue behind “rumour” as an instrumentally relevant information. Rumour then assumed the place of fact.\n\nBut, what was the rumour of Chibok? That the abducted schoolgirls, mostly Christians and a sprinkle Muslims, were instruments in the hands of Nigerian politicians. But, how? When? Why?\n\nWhile the All Progressives Congress (APC) was seeking to meander its way into Aso Rock in 2014, it was caught in the web of that rumour. Before anyone could stand in its way, the rumour had spiraled in like a typhoon. Even the maishai hawking hot tea by the sidewalks was sold the hot rumour. It was retailed on every outlet. Deft politicians of the APC were said to have woven the plot like a spider weaves its gossamer. Having brilliantly pelted the sour grape of “lacklustre” and “clueless” on Jonathan, “ineptitude” would finally ram in the last nail on his government’s coffin. America would buy it and APC would coast home to power. The rumour goes thus: enlisting local militants to siphon the girls out of Chibok was a top-notch political masterplan to tar-brush Jonathan. It has been said that the global outrage the Chibok abduction courted, with Barack Obama and his wife becoming willing recruits of the agenda, incinerated Jonathan. Its effect was so massive that, when he got to the polls in 2015, Jonathan was as worthless as a roll of tissue paper. For a very long time, a Big Man in the APC, said to have been handed the job of ferrying those girls out of Chibok, was never in good terms with Jonathan. Now, pay-day is here.\n\nFast-forward to last week. When their projection hits the bull’s eye, Yoruba say, the Babalawo had hardly unpacked his Ifa divination tablet, also known as an Ọpón Ifá, than physical affirmation of his prophecy came to pass. DiFonzo and Bordia’s rumour definition again perched on us like a recalcitrant vulture on carcass. Events of last week earned the epaulette to be saluted as Nigeria’s most harrowing week. Gory occurrences happened in less than 24 hours span from one another. They were followed by high-quality rumours which traveled at the speed of light, bearing cadences of truth. Nigeria’s recent insecurity nightmares, the rumours say, are pay-day for persons in this government who, eleven years ago, gathered to cook a broth of lies with faggots of untruth.\n\nTime is a scatterer. Yoruba, chanting the unflattering cognomen of Time, say it scatters while evil ones build an anthill of lies. They thus nickname it “atúwon ká níbi wón gbé ñdá’ná iró.” Last week, years of gathering to cook a broth of untruth with institutional and establishment lies burst and scattered like the dry fruits of àgbáàrín, the velvet bean. That bean is also known as cowhage. During dry season, unceremoniously, the àgbáàrín splinters into numberless pieces. So, the hidden evil broth whose cooking became springboard for the burning of a whole house, would seem to have become public knowledge.\n\nIf you saw last week’s viral video of worshipers at a branch of the Christ Apostolic Church, (CAC) Eruku in Kwara State, the picture you would get is a prostrate Nigeria, on its knees. When you add that sobering picture to last Tuesday’s story of armed Islamic terrorists’ killing of a vic principal, abducting at least 25 students of Government Girls’ Comprehensive Secondary School, Maga, Kebbi State, as well as the killing of a Nigerian Brigadier-General by ISWAP terrorists, the picture becomes complete. The week was almost ending when another horror occurred. Three hundred and fifteen students of St. Mary’s Catholic Secondary and Primary School, Papiri, Niger State were abducted. So huge is the terror that, in panic, government shut all the 47 unity colleges.\n\nWhen you dig a trench to bury your enemy, folk wisdom counsels that you dig it as shallow as possible. The nugget of the counsel is that, that same trench may well be your sepulcher. In the wake of the week of palpable agony that was unleashed on Nigeria last week, the Jonathan narrative returned to Nigerian public discourse. It is the narrative of a Nigeria being run by a government that is clueless in taming the shrew of insecurity, but heavy in propaganda. The Obamas have now been replaced by Donald Trump, Ted Cruz and co. as taunters of those who dug Jonathan’s grave. Evil has turned full circle.\n\nThe Eruku church invasion has preyed on the subconscious of the world ever since. Its preying comes with terrifying and terrorizing images. We saw a pastor, with an interpreter by his side, holding forte. With a rapturous congregation, they prayed against existential calamities. How were they to know that the devil, who they daggered with their religious swords, was at an arms’ length, ready for retaliation? All of a sudden, the melancholic rat-a-tat of automatic gun rifles ricocheted through the church premises. The pastor and his interpreter at first resisted the instinct to flee. Children wailed. Adults groaned. They ran hither thither. The ricochet would not cease. The image that has refused to leave my mind is that of the elderly woman. Frail, senescent and helpless, age couldn’t allow Grandma sprint off danger. The old woman’s back bent by age, the traditional church women scarf firmly plastered on her head, she tottered snailishly, seemingly oblivious of death that lurked by the corner. Grandma epitomizes the plight of helplessness of average Nigerians in the hands of those who lead them. Grandma must have painfully walked, with a combination of all muscles in her veins, in strides that appeared leisurely, all in the bid to beat the manic gaits of the rampaging bandits. It reminds me of the saying that, in the innermost recess of the cripple lies dance steps. He is however restrained by an inner force. The force, in the case of Grandma, was age. Yet, the gun would not cease. It boomed frighteningly.\n\nAnd then, the bandits stormed the church of God. Sporadic gunshots exploded. It was as if Eruku was Kyiv. Even before the invaders eventually stepped their infidel feet into the House of God, its premises were bleeding blood from fear of guns. When they eventually stepped their blood-stained feet on God’s sacred groove, the mainstreaming cameras caught the innermost recess of their hearts. It was thirsty for the blood of worshipers. Their physiognomy was unmistakable. It was that of our national tormentors, the Fula ethnic group, otherwise called Fulani. Dispersed across the Sahara, Sahel, West Africa and northern parts of Central Africa, South Sudan, Darfur and regions near the Red Sea coast in Sudan, this ethnic group has a sacred bonding that goes beyond the surreal.\n\nThey are a large and widely dispersed Muslim ethnic group renowned as the world’s largest nomadic group. They are monolithic, with estimates putting their population figure between 25 and 40 million people worldwide. Though native to countries like Senegal and Ethiopia, their concentration is dense principally in Nigeria, Mali, Guinea, Senegal, and Niger. They are as cohesive as ants. The glue that binds the Fula, in spite of their widespreadness, is their language, history and culture. They are like the biblical Hebrew tribe whose main features were their patrilineal descent from Jacob (Israel), their ancestral division into twelve distinct tribes, as well as their unique characteristics and destinies.\n\nAs Hebrews are a unified nation developed into a nation with a common language and religion, so are the Fula. Though they lack an ancestral figure like the Hebrews do in Jacob, Fulani possess key characteristics of tribal structure and are almost completely of the Islamic faith, with a sprinkling minority of Christians or animists. In Nigeria, they are at the pinnacle of power. One of their topmost bloodlines in government today is Nigeria’s National Security Adviser, Nuhu Ribadu. So also was Muhammadu Buhari, who was once quoted to have said in 2013 that “the military offensive against Boko Haram is anti-North”. Former Kaduna State governor, Nasir El-Rufai, was also openly supportive of Fulani terror. In a viral video which had him crying and asking for retaliation, Isa Pantami, Nigeria’s erstwhile Minister of Communications, cried that there were retaliatory attacks against insurgents. In another sermon, Pantami called Boko Haram Islamic Jihadists “our Muslim brothers” who were being massacred “like pigs” rather than being accorded the privileges of Niger Delta militants. Under the Muhammadu Buhari presidency, a top official of that government shocked Nigerians when he said the Fula of countries in Africa had the “inalienable rights” to ingress into and egress out of Nigeria. They didn’t need Visas.\n\nLast Tuesday, the Fula tormentors, cuddling menacing rifles like a mother cuddles her newborn, stormed Eruku. They stomped in like an army of occupation. Inhabitants said they got prior Intel of their invasion which they shared with security agencies. The question is, would Fula top chiefs manning Nigerian security hurt their bloodline to appease Eruku ‘infidels’?\n\nSo, they struck. Viral videos of their clinical operation showed about five armed bandits. They meticulously ransacked the place of worship and carted away belongings of church members. Their faces were menacing, heads plastered with caps of blood, and hands bearing weapons of bloodshed. It was a terrifying sight. Children wailed. Adults cried. None of them could stop the blood-thirsty gun-wielders. As congregants scampered hither and thither, they encountered their Fula killers right inside the church. At the end of the raid, press reports claimed the attackers killed three worshipers. They must have muttered “Allahu akbar” as they did this. Kwara State has confirmed that 38 worshipers, which included the pastor and congregants, were equally rounded up and marched into the forest. But, judging by its contiguity to the southwest, does Tinubu know that the next place to walk into for the Fulani terrorists of Eruku is Yorubaland?\n\nTwenty four hours before, the terrorists found encore in Maga. Around 4a.m. on Monday, they struck this sleepy town in Kebbi State. It was the Government Girls’ Comprehensive Secondary School, Maga, in Danko/Wasagu Local Government Area that they chose. Maga brings fond memories of Kebbi State to me.Thirty two years ago, I saw caravans of traders, travelling on their mules galloping across the deserts through Yelwa-Yauri, Koko-Besse, Zuru, Suru, Jega, down to Argungu. Maga existed for us in conversations. Carrion-hungry ravens would seem to have polluted the unvarnished peace of Kebbi. When they concluded their pre-dawn raid of terror, 25 students were matched into the bush while the vice principal and a security guard were said to have been shot dead. In an interview, Malama Amina, wife of the slain vice principal, said the Jihadists, who dressed in army camouflage, spoke fluent Fulfude.\n\nIf you follow the unleashing of terror on the Nigerian space this past week, its abnormality would strike you firsthand. Was there a choreographed attempt to foist the narrative of an inept leadership? Or Christian persecution? The incongruities are manifest. One is that, kidnap of school students, since Chibok, would seem to have receded. Why its resurgence now? Second is that, the inundation of the country with about four terrorist attacks in one week cannot be a happenstance. Piling the horrors into one single week raises a red flag of suspicion. At a time when America is firing its tempers at Tinubu from all cylinders, even an incompetent military analyst would confirm that this fusillade of attacks is not organic. In the manner of a recent lingo curated in Ibadan, Oyo State, that went viral, it looks like some persons, sitting somewhere, have chosen to cure past madness or even recent ones, with madness.\n\nThe upsurge of violence in Nigeria by Islamic fundamentalists looks like what Yoruba would refer to as egbìnrìn òtè. It is a complex and endless web of plots, intrigues and conspiracies. In this roller-coaster of intrigues, any attempt to find solution to one plot leads to more plots surfacing. It is comparable to a recurring infestation of disease.\n\nTo douse the fire of egbìnrìn òtè requires tact. Nigeria must do three things to wean this repeated violent blood-let off it. First, we must find out what the ideology of Boko Haram and other Islamists is. It is only when we know what makes them tick that we can find solutions to the insurgents’ irritancy. It is apparent that the “book is Haram” philosophy credited to the insurgents’ spiritual leader, Mohammed Yusuff, is no longer the Jihadists’ current ideology. Is the ideology a Fulanization agenda? Is it Islamic? Is it ethnic? These questions become necessary because there is so much Fulanization wrapped round the Boko Haram insurgency which makes prising them apart difficult. Second, in trying to tame this Frankenstein’s monster of insurgency and banditry, the Tinubu government must come clean with itself, just as it must be ready to clean the Augean stable.\n\nFor so long, Nigeria has accommodated seeds of destruction within itself like the proverbial foetuses within the gaboon viper, (Ọka) which my people believe will eventually kill the snake. In Nigeria’s week of terror, security forces were fingered as enabling the insurgents. Government must clearly identify military barons and their civilian accomplices who see insurgency as business, religion or tribe. Upon identification, it must go after them with the venom of the western taipan, a species of extremely venomous snake of central east Australia origin. Saboteurs are a legion at the apex of power and are agents of the multiplication of the seeds of insurgency in Nigeria. It was this crack that Donald Trump entered in performing his “disgraceful country” showmanship. If Tinubu will, this hour, de-emphasize the politics of 2027 and embrace country, we will not have to repeat this orgy of bloodshed and kidnapping of our children.","url":"https://www.opinionnigeria.com/the-girls-of-chibok-maga-papiri-and-our-frankenstein-by-festus-adedayo/","image":"https://www.opinionnigeria.com/wp-content/uploads/2019/06/senate-president-lawan-withdraws-appointment-of-festus-adedayo-as-media-aide-1.jpg","video":null,"publish_date":"2025-11-22 21:53:16","author":"Opinion Nigeria","authors":["Opinion Nigeria"],"language":"en","source_country":"ng","sentiment":-0.391},{"id":381658152,"title":"Report: Regime change not ruled out as U.S. mulls escalation against Venezuela","text":"The United States is poised to launch a new phase of Venezuela-related operations in the coming days, as the U.S. administration of President Donald Trump ratchets up pressure on President Nicolas Maduro's government, Reuters reported Saturday citing four officials familiar with the matter. An escalation that would go so far as overthrowing Maduro's dictatorial regime could not be ruled out, it is understood. \n\nThe report could not provide the exact timing or scope of the new operations, nor confirm that Trump had made a final decision to act. Reports of looming action have proliferated in recent weeks as the U.S. military has deployed forces to the Caribbean amid worsening relations with Venezuela.\n\nTwo of the U.S. officials said covert operations would likely be the first part of the new action against Maduro. Another \"senior administration official\" said he did not rule anything out regarding Venezuela.\n\n\"President Trump is prepared to use every element of American power to stop drugs from flooding into our country and to bring those responsible to justice,\" the official was quoted as saying. \n\nAlso on Saturday, three international airlines canceled their flights departing from Venezuela, the day after the U.S. Federal Aviation Administration warned major airlines of a \"potentially hazardous situation\" when flying over the country.\n\nBrazil's Gol, Colombia's Avianca and TAP Air Portugal canceled their flights departing from Caracas on Saturday, according to Flightradar24 and the official website of Simon Bolivar Maiquetia International Airport.","url":"https://www.i24news.tv/en/news/international/latin-america/artc-report-regime-change-not-ruled-out-as-u-s-mulls-escalation-against-venezuela","image":"https://cdn.i24news.tv/uploads/b7/ae/92/a8/14/5e/86/61/74/65/16/87/ba/38/36/2d/b7ae92a8145e866174651687ba38362d.jpg","video":null,"publish_date":"2025-11-22 21:51:38","author":null,"language":"en","category":"politics","source_country":"il","sentiment":-0.296},{"id":381657782,"title":"Businesses braced for Budget tax bloodbath","text":"Businesses are braced for a battering this week as the Chancellor lines up a string of tax rises for firms in her Budget.\n\nOn November 25 last year, after her first Budget whacked up taxes on firms, Rachel Reeves told bosses at the Confederation of British Industry that she was 'not coming back with more borrowing and more taxes'.\n\nBut firms look set to be squeezed again as the Chancellor struggles to fill a £30 billion hole in the nation's finances.\n\nRises in the minimum wage and greater rights for workers have put employers, particularly in retail and hospitality, in a vice.\n\nNow a raid on workplace pension contributions by capping tax-free salary sacrifice is set to push up costs further.\n\nCompanies that run large properties such as warehouses, shops and bars also stand to be hit with higher business rates.\n\nGambling firms face a new betting tax and last week banks found themselves in the Chancellor's crosshairs as she mulls a windfall tax on their profits.\n\nBosses have called for leniency from Reeves ahead of Wednesday's expected tax barrage. Shevaun Haviland, head of the British Chambers of Commerce, said: 'Another rise in the tax burden on firms is the wrong choice.'\n\nShe noted the rise in employer National Insurance Contributions in last year's Budget had hit confidence when firms were dealing with other broadsides such as Donald Trump's tariffs.\n\n'Firms' backs are against the wall,' she said. 'The answer to Reeves' problem is to use the Budget to support them to grow.'\n\nEmma McClarkin at the British Beer and Pub Association said a repeat of last year's tax-raising would 'bury' the sector, adding: 'Reeves has a choice – undo devastating and unsustainable tax burdens or oversee more job losses and closures.'\n\nUKHospitality chair Kate Nicholls said the Budget would be 'make or break' for high streets, adding: 'If the Government wants to get people back to work and revitalise high streets, it needs hospitality firing on all cylinders, not being taxed out.'\n\nOthers warned the tax burden was discouraging entrepreneurs from setting up businesses.\n\nJesse Wilson, head of beer brand Jubel, said: 'The juice is not worth the squeeze any more.'\n\n'You run a huge risk starting a business and the potential rewards aren't there. The cost of employing people is really hard. It feels like a never-ending loop.'\n\nFamily-owned firms called on the Chancellor to rethink capping inheritance tax relief on passing down firms. From April, there will be a £1 million limit on tax relief for business property.\n\nNick Showering, whose 180-year-old family cider mill in Somerset is behind brands such as Babycham, said: 'Many families will have to sell or break up their companies often to the benefit of private equity or foreign buyers, who won't face this tax.\n\nMeanwhile Steve Hare, boss of FTSE 100 software giant Sage, told The Mail on Sunday businesses had voiced their frustrations to Prime Minister Keir Starmer about the incessant leaking of policy ideas, arguing 'it creates uncertainty'.\n\nHe said: 'If politicians need to do things that balance the books they must stick to those choices.","summary":"Bosses have called for leniency from Rachel Reeves ahead of Wednesday's expected tax barrage.","url":"https://www.dailymail.co.uk/money/markets/article-15316485/Businesses-braced-Budget-tax-bloodbath.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/16/104105591-0-image-m-31_1763829149132.jpg","video":null,"publish_date":"2025-11-22 21:50:16","author":"Calum Muirhead,Editor","authors":["Calum Muirhead","Editor"],"language":"en","source_country":"gb","sentiment":-0.194},{"id":381654376,"title":"Ukraine, US head for talks on Trump’s plan to end war","text":"Ukraine’s President Volodymyr Zelensky (right) and presidential chief of staff Andriy Yermak (left) at the Zarzuela Palace in Madrid. (AFP pic)\nGENEVA: Ukrainian and US envoys will meet in Switzerland today along with European security chiefs to discuss Washington's plan for ending the war with Russia, officials said, after Kyiv pushed back on proposals seen as favourable to Moscow.\nUS President Donald Trump has given Ukraine until Nov 27 to approve the plan to end the nearly four-year conflict, but Kyiv is seeking changes to a draft that accepts some of Moscow's hardline demands.\nTrump's 28-point plan would require the invaded country to cede territory, cut its army, and pledge never to join Nato.\nHe told reporters yesterday that it was not his final offer and he hoped to stop the fighting \"one way or the other\".\nUkraine's European allies, who were not included in drafting the agreement, said the plan requires \"additional work\" as they scrambled at the G20 summit in South Africa to come up with a counter-offer to strengthen Kyiv's positions.\nA US official told AFP that US secretary of state Marco Rubio and diplomatic envoy Steve Witkoff were scheduled to arrive in Geneva on Sunday for the talks, and that US Army Secretary Daniel Driscoll had already arrived there after meeting with Zelensky in Kyiv.\n\"We will have an informal pre-meeting tonight for dinner\" with Ukrainian delegates, the US official said on Saturday.\nZelensky's decree said the negotiations would include \"representatives of the Russian Federation\" but there was no immediate confirmation from Russia whether it would join the talks.\nRussian 'representatives' expected\nUkraine's President Volodymyr Zelensky said \"consultations will take place with partners regarding the steps needed to end the war,\" after issuing a decree naming Ukraine's delegation for the talks, led by his top aide Andriy Yermak.\n\"Our representatives know how to defend Ukraine's national interests and what is necessary to prevent Russia from launching a third invasion\", having annexed Crimea in 2014 and mounted a full-scale offensive in 2022, he said.\nBritain's Prime Minister Keir Starmer said the senior officials would meet in Geneva \"to take things further forward\", stressing the importance of solid \"security guarantees\" for Ukraine under any settlement.\n\"The focus very much now is on Geneva tomorrow and whether we can make progress tomorrow morning,\" he told the media on the sidelines of the G20 summit in Johannesburg.\nStarmer said his national security adviser Jonathan Powell would be in Geneva on Sunday. Italian diplomatic sources said their country was sending the prime minister's national security advisor Fabrizio Saggio.\nSecurity officials from the EU, France and Germany will also attend, French President Emmanuel Macron told a news conference at the G20.\nWest says plan needs more 'work'\nWestern leaders at the G20 summit said Saturday that the US plan was \"a basis which will require additional work\".\n\"We are clear on the principle that borders must not be changed by force. We are also concerned by the proposed limitations on Ukraine's armed forces, which would leave Ukraine vulnerable to future attack,\" the leaders of key European countries as well as Canada and Japan said in a joint statement.\nMacron said the plan contained points that had to be more broadly discussed as they concerned European allies, such as Ukraine's Nato ties and Russian frozen assets held in the EU.\n\"We all want peace and we are agreed. We want the peace to be strong and lasting,\" he said, insisting a settlement must \"take into account the security of all Europeans\".\nThe European delegates in Geneva would aim \"to put substance into the discussions and to reconcile all viewpoints\", he said.\nZelensky said Friday in an address to the nation that Ukraine faces one of the most challenging moments in its history, adding that he would propose \"alternatives\" to Trump's proposal.\n\"The pressure on Ukraine is one of the hardest. Ukraine may face a very difficult choice: either the loss of dignity or the risk of losing a key partner,\" Zelensky said, referring to a possible break with Washington.\nRussian President Vladimir Putin said the blueprint could \"lay the foundation\" for a final peace settlement, but threatened more land seizures if Ukraine walked away from negotiations.","summary":"US President Donald Trump has given Ukraine until Nov 27 to approve the plan to end the nearly four-year conflict.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/11/23/ukraine-us-head-for-talks-on-trumps-plan-to-end-war","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/dd39ba13-afp__20251122__84u29zq__v1__midres__spainukraineusrussiapoliticsdipl","video":null,"publish_date":"2025-11-22 21:50:02","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.267},{"id":381656464,"title":"Former UK Soldier Detained in Ukraine Criticizes Trump’s Peace Proposal","text":"Shaun Pinner, a former British soldier who took up arms against Russian forces in Mariupol, has strongly criticized Donald Trump’s proposed peace plan, branding it as “surrender disguised as diplomacy.”\n\nIn an interview with the Mail on Sunday, Pinner, who once served in the Royal Anglian Regiment and was later captured by Russian forces, expressed his outrage. “It’s appalling. I’m filled with anger,” he remarked.\n\nPinner argued that the so-called 28-point peace proposal seems less like a pathway to a fair and lasting resolution and more like an effort to placate Putin. “It appears to be a scheme to undermine Ukraine’s right to self-defense and to reward an aggressor who shows no signs of halting,” he asserted.\n\n“A genuine peace plan should not protect the aggressor while penalizing the victim,” Pinner emphasized. “What we’re seeing is not peace; it’s surrender masked as diplomacy.”\n\nNow 51, Pinner joined the British military at 17 and relocated to Ukraine in 2018 with the aim of aiding in the country’s military rebuilding efforts following Russia’s annexation of Crimea and the invasion of Donbas in 2014.\n\nHe valiantly defended Mariupol during the large-scale invasion by Russian forces in February 2022, eventually being captured two months later after a courageous stand.\n\nPinner was starved, tortured and sentenced to death before Roman Abramovich helped secure his freedom that September.\n\nHe has stayed in Ukraine with wife Laryssa, whom he met out there, and says Kyiv can still defeat Putin if the West stands firm.\n\n‘We’re not just giving them a bloody nose, we’ve got them on the ropes,’ he said. ‘We’re giving them a few right uppercuts.’\n\nReferring to the daring operation to send lorries laden with drones deep into Russian territory that took out some of Putin’s most valuable bombers, Pinner said: ‘They’ve had a standing count with things like Operation Spiderweb.\n\n‘They aren’t dominant at the Black Sea anymore. And now we’re looking at Russia being bombed pretty much daily now.’\n\nOn Ukrainian morale, he said: ‘There is a fight. There is a will to fight. Ukrainians have not given up. People are tired. Things like the corruption scandal are not helping.\n\n‘But again, I tell people that’s a working democracy. However, I do have reservations about the number of troops we have.’\n\nWhile Russia has claimed to take Pokrovsk in recent weeks, a key city in the Donbas, Pinner doubts the claim but said even if they have it is not the major victory Moscow claims.\n\nHe said Putin’s forces outnumbered Ukraine ‘eight to one’ on the city and defending it is part of the ‘strategic plan’ to ‘exhaust the enemy’s ability to push on’.\n\n‘You’ve got to keep the motivation to keep going with the goal, which is to drain the enemy of its resources so that Kyiv might live,’ he said.\n\n‘I was there a year ago in November, one year ago, and the Russians were eight kilometres out. And if you just take the bare facts of the last year, they have just got eight kilometres into the city, at an incredibly detrimental cost.\n\n‘And if they do take Pokrovsk, it’s going to be extremely hard for them to move on. They’re going to be completely exhausted, completely depleted. And you’ve got winter coming.’\n\nWhile much of the media has focused on Ukraine’s morale being low with winter coming amid the corruption scandal that has rocked Volodymyr Zelensky’s government, Pinner is insistent Moscow is suffering more.\n\n‘Putin wants that trophy,’ he said. ‘He needs that trophy to show it to the Russians. I think it’s totally under-reported, the pressure Putin is under.\n\n‘You look at the pressure his economy is under. He needs Pokrovsk, he needs a victory, because otherwise he’s going to go into the winter where it all slows down.\n\n‘You’re going to have the bitter winter, and all he’s going to go away with this year is body bags, coffins, not really any gains.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nShaun Pinner, a former British soldier who took up arms against Russian&#8230;\n\n\nThis Post: Former UK Soldier Detained in Ukraine Criticizes Trump&#8217;s Peace Proposal first appeared on Internewscast Journal","url":"https://internewscast.com/news/former-uk-soldier-detained-in-ukraine-criticizes-trumps-peace-proposal/","image":"https://internewscast.com/wp-content/uploads/2025/11/UK-ex-soldier-captured-by-Russia-in-Ukraine-blasts-Trumps-peace.jpg","video":null,"publish_date":"2025-11-22 21:44:23","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.29},{"id":381652718,"title":"Fern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight loss","text":"Home and Garden\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nPrivacy Policy\n\nSaturday, Nov 22nd 2025\n\n5-Day Forecast\n\nAdvertisement\n\nStarmer piles pressure on Andrew to testify in the US over his 'ties' to Jeffrey Epstein after disgraced royal ignored calls to give evidence to Congress\n\nTrump says his humiliating Ukraine peace plan is NOT a 'final offer' but the war must end now - as he holds crisis talks with Starmer after European leaders expressed 'concern' with deal\n\nSiobhan's family all used a trusted bathroom product for decades... now she's one of thousands left with terminal cancer\n\nThe Ultimate Christmas Gift Guide: starting at just £3.90, the ONLY list you need for him, for her, for kids and for teens - from fashion to food and tech to interiors... all picked by YOU magazine's experts\n\n'My mouth ulcers keep coming back - what can I do?' DR ELLIE reveals the triggers, from three common foods to an item in everyone's bathroom - and the serious, lifelong disease they can be a symptom of\n\nGirl, 13, is arrested for murder after woman in her 50s is found dead in house following reports of bust-up\n\nStrictly Come Dancing's La Voix is forced to pull out of the competition before Tess Daly and Claudia Winkleman's last ever Blackpool Tower Week\n\nI fear for Katie Price. I overdosed twice on cocaine. Now I'm an OnlyFans millionaire, my children go to private school: KERRY KATONA tells everything in the most jaw-dropping interview you'll ever read\n\nI thought I had dementia but it turned out to be LIVER DISEASE. Jackie couldn't recognise her husband - now she reveals the niggling symptoms that forced her to have a transplant at just 53...\n\nAmy Dowden wraps up warm as she arrives in Blackpool for Strictly after undergoing second mastectomy\n\nMajor European airport halts flights after multiple drone sightings amid fears of Russian incursions\n\nTracked down by the Daily Mail, the man who owns land in Oxfordshire that a stinking river of rubbish has been dumped on. GUY ADAMS exposes exactly how criminal gang operated, eye-watering cost... and the twist NO ONE saw coming\n\nMan wrongly jailed for murder for 38 years struggles with smartphones, apps and self-checkouts since his release - but soon may be a millionaire\n\nREVEALED: Humiliated HSTikkyTokky's father is an English rugby legend: Daily Mail investigation exposes astonishing truth about sordid sexual behaviour, money and mum's house lies... and the missing father that explains so much\n\nThe girl who gave birth aged FIVE: Incredible mystery of the child who became the world's youngest ever mother\n\nFern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight loss\n\nMeet the man who bought a doomed house on Norfolk's collapsing coastline for £125k… because he 'didn't know' it was feet from disaster\n\nFamily's heartache as 'super fit' mother-of-five, 42, and her dog are mowed down and killed by Land Rover driver while on their morning run\n\nWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends ring KATIE HIND, spill the gossip he'll hate... and drip venom over what's REALLY going on with Jungle no-show\n\nMarks & Spencer eyes up 500 sites for new food stores across Britain - so will there be one near you?\n\nI died twice and was 'propelled' into a journey of death where 'otherworldly beings' revealed the secrets of life\n\nBillie Piper dazzles in a sheer minidress as she is joined by celebrity friends including Jenna Coleman and David Tennant for her joint 43rd birthday party with a pal\n\nThis little boy became one of the most influential people in the world - can you guess who he is?\n\nPETER HITCHENS: The real lasting lesson of the Great Covid Panic is that most of us don't want to be free\n\nFern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight loss\n\nHave YOU got a story? Email tips@dailymail.co.uk \nBy LYDIA BURNS \n Published:20:16 GMT, 22 November 2025 |Updated:21:44 GMT, 22 November 2025 \n\nFern Britton looked effortlessly chic as she continued to show off her five stone weight loss in a stylish Instagram snap on Saturday.\nThe former This Morning presenter, 68, previously admitted she has struggled with her weight throughout her life and has fluctuated from a size 22 to a size 12. \nThe TV star cut a glamorous figure in a green velvet blazer with matching trousers, gifted from Busby & Fox.\nBeneath the blazer, Fern wore a white ruffled blouse neatly tucked into the high waisted trousers.\nEarlier this year, Fern shared her weight loss secrets amid rumours of Ozempic usage.\nShe told Woman&Home magazine: 'People often wonder when you've lost lots of weight whether you've done it naturally.\n\nFern Britton, 68, looked effortlessly chic as she continued to show off her five stone weight loss in a stylish Instagram snap on Saturday \n\nThe former This Morning presenter previously admitted she has struggled with her weight throughout her life and has fluctuated from a size 22 to a size 12 (pictured left in 2022) \n'And I can look at you and say, \"Yes, I have.\"'\nAfter a shoulder surgery a couple of years ago Fern reflected on her journey and decided to take control of her health.\n'I thought, \"I need to get my life back on track. I need to stop smoking, stop drinking, get eating under control and stop lying in bed feeling sorry for myself.\"' \nSo, she decided to start Couch To 5k and also removed 80 per cent of sugar out of her diet, and admitted that she had never really thought about what she was eating before. \nIn October, Fern shared snaps from her trip to Italy for a cycling holiday. \nFern couldn't wipe the smile off her face as she posed for a photo with a friend.\nShe captioned her post: 'A glorious week in Italy with the Bike Buddies! Friendships spanning 20 years. Love you ladies.'\nDozens of fans commented on Fern's weight loss transformation and age-defying appearance, writing: 'Looking fire Fern.'\n\nFern recently shared snaps from her trip to Italy for a cycling holiday. She captioned her post: 'A glorious week in Italy with the Bike Buddies! Friendships spanning 20 years. Love you ladies'\n\nIn another snap, Fern couldn't wipe the smile off her face as she posed for a photo with a friend\nFive years ago, the presenter moved permanently into her Cornish holiday home before renovating it 'bit by bit'. \nA Cornish Legacy, which is Fern’s 11th novel, took the star two years to write – twice longer than normal.\nFern has long enjoyed storytelling, releasing her first novel New Beginnings in 2011, two years after leaving This Morning.\nBut since Covid she has been prolific in her writing, penning Daughters Of Cornwall in 2020, The Good Servant two years later and A Cornish Legacy earlier this year. \nOzempicWeight LossFern Britton\n\nShare or comment on this article: \nFern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight loss\n\nAdd comment\n\nComments 21\n\n Share what you think\n\nWorst rated\n\nThe comments below have not been moderated.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nStrictly Come Dancing's La Voix is forced to pull out of the competition before Tess Daly and Claudia Winkleman's last ever Blackpool Tower Week\n\nHe almost hit the Dec! I'm A Celebrity fans left in hysterics as Ant McPartlin slips over and lobs his broken umbrella off screen just minutes into the show\n\nFern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight loss\n\nHow Prince Harry was 'slumped' alongside Meghan Markle during their engagement interview - suggesting the Duchess' desire to 'control' and 'take over the narrative'\n\nStrictly celebs scream in shock as Tess Daly reveals no one will be eliminated this week - after La Voix was forced to pull out of the competition due to injury\n\nFrom £7 an hour to millionaire inventor: The British success story making cleaning a pleasure, and how it began\n\nAmy Dowden wraps up warm as she arrives in Blackpool for Strictly after undergoing second mastectomy\n\nGemma Collins reveals she stopped Mounjaro amid fears the weight loss jab left her with agonising gall bladder attack - but she will now start 'microdosing'\n\nMyleene Klass looks chic in a leopard print mini dress as she departs her Smooth radio show - after Katie Price issued star a grovelling apology\n\nEXCLUSIVEDreading the winter fatigue? From simple food swaps to routine tweaks, this is how to support energy to live your life to the full\n\nDame Joan Collins, 92, displays her age-defying looks as she joins her husband Percy Gibson, 60, at The Shooting Star Ball in London\n\n'Giddy' Timothee Chalamet flashes sly smile after dumping Kylie Jenner as he steps out solo in NYC\n\nDavina McCall reveals she is feeling 'super positive' as she returns to running for the first time after her cancer treatment\n\nRuby Wax's 'secret feud' with a huge presenter is revealed after I'm A Celebrity star accused of them 'stealing' her career\n\nSeason of festive spending: How to stay in control of your spending during the run-up to Christmas \n\nBoris Becker, 58, welcomes a daughter with his wife Lilian de Carvalho Monteiro, 34, as he reveals sweet name\n\nRyan Reynolds reveals how he roped Gwyneth Paltrow into THAT ad after Coldplay kiss cam scandal\n\nStrictly's Karen Hauer shares rare snaps with her boyfriend Simon Davidson as she celebrates their anniversary\n\nKelly Brook's husband Jeremy Parisi weighs in on I'm A Celeb feud with Jack Osbourne and admits he is a 'lucky man' after THAT bikini shower scene\n\nFrom trending toys and tech to beauty must-haves: Unwrap the ultimate Christmas gift guide... with picks that will fill them with sparkle and joy!\n\nVogue Williams screams in terror as she's covered with snakes while locked in a cage in first look at horrifying I'm A Celebrity trial\n\nStrictly's La Voix shares her sadness ahead of Blackpool show after Drag Race star was forced to pull out due to injury\n\nSherrie Hewson reveals she was once kicked under the table by Loose Women co-star Coleen Nolan after making an 'outrageous' comment on the ITV show\n\nKristen Stewart cuts a casual figure in a burnt orange jacket as she joins Imogen Poots at the screening of their movie The Chronology Of Water\n\nFrom a tree that'll make your neighbours jealous, elegant tablescapes, great gifts, and fabulous festive outfits: We have your showstopping Christmas covered\n\nI'm A Celebrity's Kemi Rodgers accidentally flashes live on air as comedian Seann Walsh leaves her blushing with very X-rated joke\n\nEXCLUSIVEI fear for Katie Price. I overdosed twice on cocaine. Now I'm an OnlyFans millionaire, my children go to private school: KERRY KATONA tells everything in the most jaw-dropping interview you'll ever read\n\nEXCLUSIVE90s fitness icon Susan Powter reveals how her secret life of Uber driving and cardboard furniture was exposed after losing her fortune\n\nDevastated Joey Essex announces the death of his uncle in a heartbreaking tribute on social media to fans\n\nFrom TikTok to RED HOT! Sarel reveals she's dyed her hair for the very first time - and it cost her less than £10\n\nEXCLUSIVEMachine Gun Kelly makes eyebrow-raising sex confession amid Megan Fox reconciliation rumors\n\nTaylor Swift and Travis Kelce splurge on her Rhode Island mansion renovations for fairytale wedding... as shocking price tag exposed\n\nMeghan has revealed the alarming depths of her delusion - and exposed herself as insecure, empty and kind of a jerk: MAUREEN CALLAHAN\n\nThe tragic story of Princess Beatrice's first heartbreak - after late Queen 'ordered' her split from much older American playboy with a dark past\n\nEXCLUSIVEFrom garage workshop to global success: Meet the Brit who reinvented the vacuum cleaner\n\nItalian music icon whose biggest hit was immortalized in Ocean's Twelve dies at 91\n\nBest and WORST dressed celebrities at the Las Vegas Formula One Grand Prix\n\nPrince's legendary drummer dead at 69\n\nThey live glamorous lives as chart-topping musicians, actors and businesswomen - but can YOU recognise these celebrities from their childhood photos?\n\nFrom legendary après-ski to snow-sure resorts and incredible all-inclusive packages: THIS is how to plan the ultimate ski holiday in the French Alps\n\nClaudia Winkleman's television earnings revealed ahead of Strictly exit as BBC bosses 'fast-track' her chat show\n\nHow actress Meg Ryan would REALLY look if she never had any rumored cosmetic treatments\n\nYouTube star, 30, gives gut-wrenching update after being rushed to ICU for organ failure\n\nPop star rushed to hospital after slicing knee open on stage as he shares shocking bloody video\n\nStormzy reveals his beloved Rottweiler Enzo who he shared with ex-girlfriend Maya Jama has died\n\nStrictly's George Clarke and Alexis Warr enjoy a day at the arcades while Amber Davies and Nikita Kuzmin explore Blackpool ahead of special\n\nBen Affleck cuts a somber figure at Las Vegas Grand Prix while preparing for F1 documentary\n\nI'm A Celebrity's most controversial signings revealed... from stars who prompted major political backlash to those who failed double stints\n\nEXCLUSIVEJessica Lange, 76, was a Hollywood siren who starred in King Kong and Tootsie... see her now\n\nGordon Ramsay and his wife Tana step out at the Las Vegas Grand Prix with Hollywood legend Michael Douglas and Catherine Zeta-Jones\n\nEamonn Holmes, 65, looks loved up with girlfriend Katie Alexander, 43, as couple attend glamorous charity event after star issued health update\n\nPrincess Diana's personal designer Paul Costelloe dies aged 80 after leading his fashion label's design team until his death\n\nCelebs Go Dating is 'looking to sign MAFS star Lucinda Light' as its first star for their 2026 series\n\nEDEN CONFIDENTIAL: Cheryl Cole's name stripped from royal youth centre she raised £1million for\n\nBeauty lovers, take note - Elizabeth Arden is quietly offering double discounts on its most luxurious gift sets\n\nKelly Brook's former housekeeper breaks her silence on the Jack Osbourne feud on I'm A Celeb\n\nAlan Carr reveals how best friend Amanda Holden was left shocked at 'intimate' dating app questions after she tried to aid the comedian's love life\n\nParis Hilton's traumatic childhood: How star was groomed by her teacher at 14 and force-fed medications while institutionalised before being 'recruited' by Ghislaine Maxwell\n\nRevealed: The woman giving Harry and Meghan the royal life they can no longer afford - complete with lavish homes and a private jet\n\nTesco shoppers discover 'delicious' award-winning Irish cream liqueur ahead of Christmas - and it's even beaten Baileys\n\nGeorge Clooney looks classically handsome in a grey suit as he joins co-star Adam Sandler for night out in London ahead of Jay Kelly release\n\nOlivia Dean hits out at 'disgusting' ticketing companies amid reselling scandal as she warns fans of scams - as Labour crack down on rip-off prices\n\nA spoonful of sugar? How about five! How Dick Van Dyke stays sprightlyahead of his 100th birthday - including a VERY sweet morning coffee and 3 gym sessions a week\n\nI'm A Celeb's Vogue Williams makes her jungle bikini debut as fans accuse her of 'fishing for compliments' after admitting she feels 'ugly'\n\nEXCLUSIVEWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends ring KATIE HIND, spill the gossip he'll hate... and drip venom over what's REALLY going on with Jungle no-show\n\nBillie Piper dazzles in a sheer minidress as she is joined by celebrity friends including Jenna Coleman and David Tennant for her joint 43rd birthday party with a pal\n\nAli Larter stuns in a plunging red leather dress as she puts on a loved up display with her husband at the Drive-By F1 party in Las Vegas\n\nAs new rape allegation rocks Strictly Come Dancing, why this could be the show's last dance...\n\nI sparked a huge bullying row on I'm A Celebrity - Ant and Dec showed their true colours in a moment that never made it to screens\n\nNYC's hottest it-girl actress breaks silence on scandal that got her axed from Hollywood movie... as insiders spill on sickening whispers\n\nFreakier Friday's Easter eggs: From sweet nods to the original to Mean Girls and The Parent Trap references - as the sequel is made available to stream, did you spot them?\n\nI'm A Celebrity fans accuse Jack Osbourne of 'rage-baiting' the camp amid tense feud with Kelly Brook\n\nAriana Grande's boyfriend Ethan Slater reignites breakup rumors by awkwardly dodging question about her\n\nGladiators star The Giant 'SPLITS from wife Katie and reveals why their relationship ended'\n\nPolice thriller dubbed 'the best show on television bar none' starring Game Of Thrones legend is finally free to stream on ITV \n\nMattthew McConaughey details bizarre 'wet dream' that resulted in marriage to Camila Alves\n\nCharley Webb reveals life-changing health diagnosis which helps explain her 'cold' personality as she opens up about neurodiversity\n\n'What's with the propaganda?': I'm A Celebrity faces 'showmance' accusations from fans as Aitch confesses he has a 'soft spot' for Shona McGarty\n\nAdam Peaty's sister Bethany survives family fallout as she joins team Ramsay 'after having her head turned by glitz and glamour'\n\nKeith Urban super fan claims singer dropped MAJOR hint about Nicole Kidman split weeks beforedivorce bombshell\n\nAlex Kingston, 62, reveals Strictly has made her fearless after cancer battle - and she has her 25 year old body back\n\nMaya Jama turns heads in a racy sheer lace gown as she attends lavish fashion gala dinner at Soho Farmhouse\n\nKathy Hilton and husband Rick break silence on home invasion as they flee Los Angeles\n\nRuby Wax brings back the mean as she deals withering putdown to Tom Read Wilson - just days after I'm A Celeb viewers called for her to be AXED \n\nJess Glynne wows in a plunging black jumpsuit as she joins leggy Jade Thirlwall at Hits Radio Live - after I'm A Celeb star girlfriend Alex Scott shared very personal update on their romance\n\nI'm A Celebrity's Vogue Williams reveals the truth behind her age-defying looks as she complains about feeling 'so ugly' in jungle\n\nEXCLUSIVEStaying Alive icon makes rare public outing 42 years after starring with John Travolta... see her now\n\nWhy Strictly's going to be cancelled: It's not just shocking rape, cocaine and vile on-set behaviour allegations, says AMANDA PLATELL. The judges and contestants represent the new kind of rot... why's it being silenced\n\nHelen Skelton and Gethin Jones make their second cosy red carpet appearance together at the RTS Awards after months of romance rumours\n\nDua Lipa shows off her washboard abs in a skimpy bikini as she poses with lookalike sister Rina during a trip to Brazil\n\nRHOA star Kandi Burruss announces DIVORCE from husband Todd Tucker after 11 years together\n\nJAN MOIR: My trip to Meghan Markle's pop up shop where even the Montecito set baulk at £24 for a jar of honey!\n\nCoronation Street star poses beside 'sex slave' speech hate preacher who was banned from the UK\n\nI'm A Celeb's Shona McGarty left red-faced as she is caught up in awkward innuendo with Martin Kemp during dunny trial\n\nLady Gaga oozes sophistication in a green satin suit as she enjoys dinner in Paris ahead of the final European date of the Mayhem Ball\n\nMeet the man Lisa Riley calls her 'soulmate'! I'm A Celeb star's rarely seen musician fiancé Al has won her heart - but there's a heartbreaking reason they'll never marry\n\nSarah Ferguson 'is considering six-figure offers' to give tell-all interview after being stripped of Duchess of York title as palace aides fear she could go 'rogue'\n\nAll you need is love - and £95 - to get yourself a copy of The Beatles' 191-track Anthology Collection: a deluxe reissue of a deluxe retrospective. Adrian Thrills reviews...\n\nWWE star Alexa Bliss hits back after being trolled for 'looking old' at just 34\n\nTravis Kelce speaks out on his future as he casts doubt on widely expected retirement plan\n\nTraitors star Jonny Holloway addresses speculation the 'dates don't add up' as he reveals new details in Charlotte Chilton-Conor Maynard baby row\n\nHilary Duff poses in stockings after debuting new taut face for music comeback\n\nDemi Lovato models a tiny bikini to show off her newly slender figure as she dances on a yacht\n\nBreaking Dad! Bryan Cranston put through the wringer in this tale of family despair: PATRICK MARMION reviews\n\nEXCLUSIVEAaron Paul reveals he and wife Lauren relocated to Paris after disastrous California fires: 'We just knew we were done with LA'\n\nAlex Jones reveals she was a bikini-clad contestant on raunchy Magaluf dating show where 'everyone was having sex' \n\nElizabeth Hurley's nepo baby son Damian defends Billy Ray Cyrus amid pair's unlikely romance\n\nVanderpump Rules alum Charli Burnett marries boyfriend Corey Loftus in Mexico... two years after quitting Bravo show\n\nDenise Richards' ex 'begging friends for money' as he claims to be 'broke and almost homeless' amid nasty split\n\nKate Hudson and Hugh Jackman can't stop laughing as they pose together on the red carpet at Song Sung Blue premiere in London\n\nPaloma Faith posts cheeky pregnancy thirst trap as she shows off her blossoming bump in racy lace catsuit\n\nShe has won an Oscar, worked with Johnny Depp and was married to Nicolas Cage, who is she?\n\nGogglebox star Scarlett Moffatt is the first celebrity confirmed for this year's Strictly Come Dancing Christmas Special - despite dance experience\n\nThe Stone Roses' Gary 'Mani' Mounfield's unexpected death comes following the second anniversary of his wife's passing - leaving 12-year-old twins orphaned\n\nAmanda Bynes breaks silence on wild claim Nickelodeon producer Dan Schneider impregnated her at 13\n\nKanye West, 48, says he 'regrets life' during rare interview as he debuts grey hair in his beard\n\nKelly Brook and Jack Osbourne were ALWAYS going to clash on I'm A Celebrity for a simple reason - and it has nothing to do with the cooking\n\nEthan Hawke reveals why he never talks about ex-wife Uma Thurman even though they have been divorced for 20 years\n\nAlex Jones admits she felt like a 'failure' amid her husband Charlie Thomson's debilitating depression battle\n\nJessica Alba, 44, flashes her toned bikini body in Australia... after hot date with beau Danny Ramirez\n\nVictoria Beckham's sibling you've never heard of! Posh's brother Christian appears in rare snap after shunning the limelight for a private life with his family\n\nLizzie Cundy looks smitten with new love interest American DJ Donald Frieze in cosy snaps at swanky Hollywood restaurant\n\nReal Housewives of New York fan favorite QUITS show... as series preps for season 16\n\nEXCLUSIVEKelly Brook's family furiously hit back at I'm A Celebrity bullying accusations - insisting Jack Osbourne feud is 'a load of rubbish'\n\nKim Kardashian flashes her cleavage in bizarre dress that has over 100 safety pins hanging from the edges\n\nAriana Grande bids farewell to Glinda as she battles COVID days after fan ambush amid Wicked press tour\n\nMeghan Markle teases 'something big is coming' as she boasts about Harper's Bazaar cover being a 'mic drop' moment\n\nLila Moss, 23, looks effortlessly chic in black and white as she heads to the Swiss Alps to launch H&M & Perfect Moment's après-ski collection\n\nBrian Austin Green REUNITES with ex and Beverly Hills, 90210 co-star Tiffani Thiessen 30 years after breakup\n\nEXCLUSIVEFamily panic as Britney Spears takes 'disturbing' measures... after world was shocked by her unrecognisable new look\n\nTrainspotting star sells sprawling US home for millions after moving back to homeland\n\nSydney Sweeney confesses being alone forever is her 'biggest fear' - as Scooter Braun romance heats up\n\nRace faker Rachel Dolezal resurfaces with BOMBSHELL makeover on 48th birthday... as fans say she's twinning a very unlikely celebrity\n\nThe unassuming Scots star of a beloved children's TV show who left MILLIONS behind in her will\n\nEXCLUSIVETruth about Ariana Grande and Cynthia Erivo's 'secret marriage'... and the reason their friendship could soon be OVER\n\nStrictly's La Voix breaks silence on conspiracy theory about why she REALLY dropped out of show and shares injury update on It Takes Two\n\nBrad Pitt faces new scrutiny over past 'gross' on-screen kiss with underage costar\n\nJennifer Aniston's 'love guru' boyfriend Jim Curtis shares astrology forecast on relationship as he says 'emotions run deep'\n\nEXCLUSIVEAmy Tapper, 26, reveals she's having surgery to remove loose skin following incredible 8st weight loss after using Mounjaro\n\nKelly Brook turned to me for help with her cheating ex-boyfriend - but showed her true colours later with brutal snub, says former I'm A Celebrity star\n\nAna de Armas, 37, channels iconic meme of Nicole Kidman leaving her lawyer's office after Tom Cruise divorce was finalised following her own split from the Hollywood actor\n\nZach Bryan's ex Brianna Chickenfry reveals how she's doing one year after split left her in a 'dark place'\n\nAlan Carr shares the REAL reason he broke down in tears during Celebrity Traitors' finale reveal - and the 'abuse' he has received since winning show\n\nJelly Roll's wife Bunnie Xo reveals she has to check herself into jail... after sharing 7th mug shots\n\nAngellica Bell shows off her incredible curves in a floral multi-print bikini as she enjoys a sunshine break on a cruise in St Lucia\n\nRonnie Wood, 78, and Bryan Adams, 66, stun guests at Texas wedding of multi-millionaire CEO Rob Steele with epic all-star performance\n\nBrooklyn Beckham appears to share poignant message about being 'lonely' after his family post gushing tributes celebrating brother Cruz's music gig\n\nKris Jenner's sign of support for Meghan as she shares trailer for the Duchess's Netflix show after 'photogate' row\n\nTess Daly arrives in Blackpool with Claudia Winkleman for final Strictly show at iconic ballroom as she reflects on all the 'wonderful times'\n\nSimone Biles follows in Kylie Jenner's footsteps as she reveals all the details about her 'perfect' boob job\n\nLiev Schreiber, 58, is seen for the first time since he was rushed to the hospital for severe pain\n\nMeghan Markle fans spot uncanny resemblances in Harper's Bazaar photoshoot to Princess Diana\n\nBeloved detective series with whopping 97% Rotten Tomatoes score AXED after lead star quits in blow to fans\n\nKhloe Kardashian, 41, reveals if she ever hooks up with ex Tristan Thompson, 34, when he drops by for visits\n\nPrincess Andre stuns in black catsuit as she joins brother Junior at their PR agency's Christmas party - after she brushed off feud rumours with her mother Katie Price\n\nHailey Bieber rings in 29th birthday with lavish cake and martinis at exclusive Rhode bash\n\nBBC drama hailed as 'an absolute triumph' confirms return to screens after string of glowing reviews - with David Tennant joining in lead role\n\nJen Shah granted early prison release as departure date is unveiled... three years after wire fraud conviction\n\nThe 'insane' moment OJ Simpson 'pretended to kill' Ruby Wax in 1998 BBC interview after she recalled the bizarre ordeal on I'm A Celebrity\n\nTikTok star Ben Bader, 25, cause of death revealed after he was found unresponsive at a private Palm Beach club\n\nAlex Rodriguez makes rare remark about ex Cameron Diaz with glimpse into relationship\n\nScreaming Shona McGarty stuns Ant and Dec with VERY strange reaction to being showered with bugs in revolting first look at Dreaded Dunnies trial\n\nIs Ariana Grande and Cynthia Erivo's friendship codependency or one we could learn from?\n\nKate Beckinsale unveils sweet tattoo tribute to her late mother Judy Loe following her death aged 78\n\nDiane Kruger wows in a plunging gown as she poses for Defined Magazine and admits 'motherhood can be isolating' as she opens up about welcoming her daughter in her 40s\n\nJeff Goldblum makes hilarious confession as he reveals the one thing he has in common with Kim Kardashian\n\nEXCLUSIVEPhantom Of The Opera icon Sarah Brightman, 65, will be spending Christmas with her 'incredible' boyfriend after her holiday tour\n\nWhat Meghan's announcements in her pseudo-Royal court get wrong and why they 'speak volumes', revealed by experts\n\nJumanji 3 FIRST LOOK: Karen Gillan flaunts her toned abs in a crop top and hot pants for filming as she joins Jack Black, The Rock and Kevin Hart\n\nEXCLUSIVECurtis Pritchard signs up to Ex on the Beach as furious ex plans to confront him over last-minute dumping before Love Island: All Stars\n\nRita Ora bizarrely reveals she is a WITCH in new interview before sharing her weekly ritual and claiming 'astrology should be a religion'\n\nKimberley Garner stuns in a backless bodysuit and white jeans as she joins stylish Lottie Moss at the Harry's Covent Garden launch party\n\nStrictly's Katya Jones and Lewis Cope lead the stars stepping out for rehearsals ahead of the Blackpool special - after getting cosy on fish and chip date\n\nRochelle Humes breaks down in tears live on This Morning as young Wicked fans discusses cancer battle - with heart-wrenching twist\n\nAxed Gino D'Acampo hit with fresh 'bullying' allegations and claims ITV ignored complaints about the chef's 'humiliating and intimating' behaviour\n\nHugh Jackman, 57, backtracks on never playing Wolverine again - after his most recent appearance as the iconic superhero made £1B at the box office\n\nLeigh-Anne Pinnock wears sheer black bra and tiny top after vowing to shed her 'Miss Nice Girl' image as she announces another new release\n\nEXCLUSIVELove Island bosses back Whitney Adebayo as she's lined up for All Stars amid her legal battle with ex Lochan Nowacki\n\nWicked: For Good viewers have a BIG complaint about blockbuster sequel as it hits cinemas - despite string of glowing reviews\n\nVick Hope shares rare pictures of her baby son Micah with husband Calvin Harris as she balances work and motherhood\n\nGlenn Close forced to defend Kim Kardashian's 'stiff' acting in her new TV show All's Fair after it was SAVAGED by critics and branded 'the worst drama ever'\n\nRosie Huntington-Whiteley poses topless as she shows off her incredible figure during trip to Brazil\n\nLeonardo DiCaprio and pal Tobey Maguire attend star-studded party in Mayfair after celebrating One Battle After Another in London\n\nGal Gadot looks sensational in a figure-hugging sequinned gown as she attends Beverly Hills charity bash \n\nThe One Show's Alex Jones reflects on her co-host Jermaine Jenas' sexting scandal as she says: 'We were good friends and I was the last to know'\n\nGogglebox star Amy Tapper details her 7st medicated weight loss journey in 'empowering' post as she hits out at 'bullying and unsolicited advice'\n\nLouis Theroux cosies up to fashionable wife Nancy Strang as the couple make rare public appearance at Choose Love's 10th anniversary bash\n\nJosie Gibson shows off her impressive 5st weight-loss in a plunging pink dress before slipping into a bikini to go snorkelling during lavish Caribbean cruise\n\nI'm A Celebrity's Lisa Riley sparks concern among viewers as they notice a surprising change in her appearance\n\nEXCLUSIVESian Welby admits she's put her relationship with fiancé Jake Beckett 'on the back-burner' and says she doesn't have 'capacity' to plan her wedding\n\nDua Lipa is mobbed by fans in Brazil as she poses for selfies and signs autographs outside her hotel\n\nHolly Ramsay shares brand campaign snaps with Emporio Armani as she posts online for the first time since breaking her silence over wedding feud\n\nKelly Brook and Jack Osbourne's I'm A Celebrity feud deepens as new arrivals Vogue Williams and Tom Read Wilson wade into row\n\nMick Jagger, 82, wraps up in a colourful scarf as he and leggy fiancée Melanie Hamrick, 38, leave star-studded Mayfair bash hand-in-hand\n\nEXCLUSIVECharlotte Crosby admits she suffered a relationship crisis with fiancé Jake Ankers after welcoming her second child \n\nHotter than ever at 80! How Goldie Hawn is defying the laws of ageing with her youthful features and figure as she hits her milestone\n\nJameela Jamil holds hands with boyfriend James Blake in rare PDA as couple attend Choose Love 10th Birthday Gala\n\n'It's on Adam to build bridges': SARAH VINE weighs in on rift between Adam Peaty and his family overshadowing his upcoming marriage to Holly Ramsay\n\nEXCLUSIVEALISON BOSHOFF: Victoria's secret: Posh 'planning to sell' $100m beauty and fashion brand\n\nOn the market \n\nEverybody Loves Raymond stars now unrecognisable as they reunite for sitcom's 30th anniversary\n\nAlan Carr reveals the saddest moment of Celebrity Traitors - and it ISN'T the murder of his dear friend Paloma Faith\n\nStrictly star is arrested on suspicion of raping a woman after a BBC event\n\nThe man cannot be named for legal reasons\n\nKelly Brook sends fans into meltdown as she trades her swimsuit for a TINY bikini during first jungle shower on I'm A Celeb\n\nThe subtle sign of King Charles's 'devotion' to Queen Camilla during 'episode three' of their affair\n\nMeghan Trainor reveals illness during pregnancy led her to dropping 60lbs before turning to weight loss drug after giving birth\n\nMORE DON'T MISS\n\nJessie J puts on a daring display as she joins Louise Redknapp and Ashley Roberts at the ZYN Rolling Stone UK Awards 2025\n\nGrammy-winning artist from famed hip-hop group jailed for 14 years for funneling millions to Obama\n\nTimothee Chalamet makes VERY bizarre entrance at NYC event for his new film amid Kylie Jenner 'split'\n\n'I can't believe you're a rockstar!' Harper Beckham tells brother Cruz she was moved to tears watching him perform on stage\n\nBen Affleck relaxes with cigarette before hitting stage at Beverly Hills bash for Michael B. Jordan\n\nGlenn Close looks VERY different thanks to movie magic in trailer for Hunger Games prequel\n\nKaty Perry's whirlwind romance with Justin Trudeau gets even more serious as the holidays approach\n\nSofia Richie marks five months of second pregnancy as she shows off baby bump inside her VERY spacious bathroom\n\nBrooklyn Beckham whips up a fried chicken sandwich in his latest cooking video - but people all have the same criticism\n\nBruce Willis' daughter Rumer makes heartbreaking confession about her famous father's dementia battle\n\nBrendan Fraser breaks silence on The Mummy 4 as he's set to reunite with Rachel Weisz\n\nLeonardo DiCaprio rubs shoulders with Sir Mick Jagger as they join Pierce Brosnan and his son Dylan at London celebration for his latest filmOne Battle After Another\n\nShelley Duvall fans left shocked at her forgotten 1970s romance with music icon\n\nHailey Bieber enjoys girls' night out with Zoe Kravitz at celebrity hotspot ahead of her 29th birthday\n\nJeff Goldblum poses with ultra-lifelike Madame Tussauds wax figure... so can YOU tell which one is real?\n\nThe Stone Roses bassist Gary 'Mani' Mounfield dies aged 63: 'Devastated' band pay an emotional tribute to their 'wonderful brother'\n\nReunited at last! Elsa Pataky and Chris Hemsworth turn heads as they pose together at A Road to Remember special screening\n\nLouis Tomlinson donates huge four-figure sum towards life-saving surgery for former One Direction bodyguard\n\nCraig Revel Horwood details 'awful' childhood with his 'terrible alcoholic' father who tried to SHOOT his mother \n\nLIZ JONES: The real barb in Meghan's interview everyone's missed. Yes it's laughable... but the message is so clear\n\n'Missing him is now part of breathing': Liam Payne's sister Ruth Gibbins shares devastating tribute to her brother \n\nBridgerton star Genevieve Chenneour breaks down in tears as she reveals she was attacked in central London AGAIN\n\nCelebrity Masterchef fans are 'surprisingly loving' Grace Dent as they praise the new judge - just days after hitting out at the BBC\n\nJoseph Quinn 'is dating Australian singer Grace Stephenson as loved-up couple pack on the PDA at London gig' after his split from Doja Cat\n\nEDEN CONFIDENTIAL: Let me host Strictly, says oldest ever contestant Angela Rippon, 81\n\nShe dazzled viewers with her high kick on Strictly\n\nI'm A Celebrity stars Angry Ginge and Kelly Brook's 'secret codenames revealed' after bosses kept their identities under wraps\n\nEXCLUSIVERICHARD EDEN: Ouch! Ahead of Harry's bizarre lecture to estate agents, school friend's VERY cutting comment to me about Prince\n\nNatalie Portman and director Rebecca Zlotowski look extremely close on the red carpet at Vie Privée premiere in Paris\n\nVogue Williams and Tom Read Wilson finally enter the I'm A Celeb camp as Aitch is left with tears in his eyes as he fails to secure any stars\n\nBridget Fonda, 61, continues to flaunt thinner-than-ever frame on rare outing after losing 75lbs\n\nQuite a difference \n\nHollywood legend Dame Helen Mirren makes an unlikely visit to The Repair Shop this Christmas as she stars in festive special\n\nKessler twins who worked with Frank Sinatra and wowed Elvis Presley 'paid a lot of money' to die together at 89\n\n'Everyone does it!' I'm A Celebrity's Kelly Brook divides fans after admitting she wees in the jungle shower\n\nTend it like Beckham: Sir David to create garden for Chelsea Flower Show as part of The King's Foundation\n\nNew venture \n\nBobby Brazier shares a look at his spiritual journey after leaving showbiz as he joins worshippers in India for Hare Krishna dance \n\nBRIAN VINER reviews Sisu: Road to revenge... it's violent but exhilaratingly bonkers\n\nDavid and Victoria Beckham book out Notting Hill venue to watch son Cruz's gig - despite former hotspot being closed for years\n\nDwayne Johnson honors late Robin Williams with memento on Jumanji set in LA\n\nThe 53-year-old superstar took to social media\n\nROLAND WHITE reviews Play for Today: Big Winners - Will a £14million lottery win fix this unhappy marriage? Not a chance...\n\nCardi B divides fans as she reveals $1,000 glam accessory made from her umbilical cord\n\nUnconventional \n\nWilliam's secret gesture to Kate captured on camera before couple entered Royal Variety Performance - and it leaves fans swooning\n\nHeather Graham, 55, flaunts age-defying looks in sheer lace dress ahead of event celebrating 'female Viagra' documentary\n\nEXCLUSIVEWhat happens next now that D4vd is a suspect in the killing of a teen found in his Tesla?\n\nHe's a person of interest\n\nKelly Osbourne blasts 'bully' Kelly Brook over her 'performative' screen clash with I'm A Celeb star brother Jack in blistering attack\n\nVERONICA LEE reviews Sherlock Holmes and The 12 Days of Christmas: Oh, yes they did! Rice and Lloyd Webber reunite\n\nMachine Gun Kelly sings tribute to Megan Fox at concert amid claim they're 'closer than ever' after split\n\nStill smitten \n\nLouise Redknapp and her boyfriend Drew Michael enjoy a date night at the ZYN Rolling Stone UK Awards 2025\n\nCelebrity Big Brother 'set to be wiped from ITV's Spring schedule' in further blow just days after spin-off was axed\n\nPop star who rose to fame in the 90s wishes her lookalike daughter a happy 27th birthday - but can YOU guess who her mother is?\n\nChadwick Boseman's Hollywood A-list friends sob as tragic actor gets posthumous star... five years after cancer death\n\nTragic loss\n\nEXCLUSIVEAngryGinge's relationship status revealed as images of the I'm A Celeb star with mystery blonde surface\n\nProfessor Green's son Slimane, 4, is rushed to hospital after horror accident abroad left him needing stitches\n\nHow Martha Stewart, 84, would REALLY look if she never had any cosmetic tweakments\n\nShe has made headlines for her youthful looks\n\nLindsay Lohan's rarely-seen brother Dakota fuels concern with cryptic post about his 'behavior and bad habits'\n\nAriana Grande reveals she has COVID in latest setback... days after Wicked star was ambushed by deranged fan\n\nAshley James wows in a gold structured corset as she joins the glamorous Nathalie Emmanuel on the red carpet at Choose Love's 10th anniversary bash\n\nEXCLUSIVEFrail Kathleen Turner, 71, seen in wheelchair as she reveals debilitating health battle in rare public outing\n\nQueen Camilla reunites with Geri Halliwell-Horner as pair celebrate young winners of Queen's Commonwealth essay competition\n\nJane Fonda, 87, admits she did so many drugs in her 20s she thought she would die\n\nSpeaking on Michelle Obama's The Look\n\nSex And The City star is trolled for having 'so much Botox' before an Oscar winner jumps in to support her\n\nHailey Bieber sizzles in a thong bikini for sultry beach photo shoot ahead of 29th birthday\n\nPosed up a storm for latest snaps \n\nDani Dyer puts on a glamorous display in a glitzy black sheer gown as she joins dad Danny at the ZYN Rolling Stone UK Awards 2025\n\nSara Cox leaves Children In Need viewers sobbing as she breaks down in tears sharing heartbreaking truth behind her challenge\n\nEXCLUSIVEDance Moms divided! Multiple cast members speak to Daily Mail and hurl ugly allegations at each other\n\nZoe Saldana, 47, flashes thigh-high stockings for Vogue as she says she's 'embracing wrinkles'\n\nLooking good\n\nEXCLUSIVEGhost Adventures star's ongoing secret heartache after his wife took out hit on him\n\nStill weighing on him.\n\nKhloe Kardashian jokes about O.J. Simpson being her real father in front of mom Kris Jenner after affair rumours\n\nSteven Knight breaks his silence on the James Bond script and jokingly teases who Daniel Craig's replacement could be\n\nLiam Gallagher and Shaun Ryder lead celebrity tributes to The Stone Roses bassist Gary 'Mani' Mounfield after his death aged 63\n\nMeghan Markle risks alienating fans by showcasing $200,000 worth of clothes and jewels in Thanksgiving promo\n\nKim Kardashian is left speechless by sister Kourtney's callous responses after suggesting she put law school on pause\n\nRumer Willis cries over being a single mom and teases 'shady' new song I'd Rather Be Lonely\n\nConfirmed the end of her two-year relationship\n\nSpencer Lofranco dead at 33: Gotti actor who played John Travolta's son passes away as tributes pour in\n\nEmotional Sara Cox, 50, reveals she has raised £11.5MILLION for Children In Need as donations continue to soar\n\nCruz Beckham, 20, shares a very passionate kiss with girlfriend Jackie Apostel, 30, before hugging proud dad Sir David\n\nJack White's Thanksgiving NFL show risks Donald Trump fury after rock star branded President 'low-life fascist'\n\nKate Ferdinand reveals her thoughts on living in Dubai long term following her move to UAE with husband Rio and their family \n\nTina Knowles claims white couple was allowed to cut her in line at 'racially-charged' Kentucky Derby event\n\nKelsea Ballerini and Chase Stokes appear to call off romance AGAIN as actor shares cryptic posts about being 'blocked'\n\nMeghan King's former co-star Kelly Dodd defends RHOC alum after embattled mother lost custody of her three kids\n\nSimone Biles reveals she 'couldn't move' after her boob job and was 'freaked out' by the results\n\nRichard Dreyfuss' son claims he and his siblings are broke and 'estranged' from Oscar-winning Jaws star\n\nNot in touch \n\nJoJo Siwa reveals major next step in her relationship with Chris Hughes as she shares loved up festive snaps\n\nHappy couple \n\nEmotional Holly Hagan fights back tears as she explains how her 'world has stopped' in the 'toughest four weeks' of her life since sister Darci's death aged 19\n\nStrictly's Lewis Cope and partner Katya Jones put on a cosy display as they carb up on fish and chips ahead of the Blackpool special\n\nCountry music legend behind iconic hits dies aged 70 following battle with mystery illness\n\nLily Allen's ex husband David Harbour laughs as she admits 'everyone abandons me' in resurfaced clip\n\nDad is on Landman and mum was a '60s pinup who worked with Robert Redford, do you know who this beauty is?\n\nSienna Miller sports a brightly coloured fur-look coat as she steps out in London\n\nKim Kardashian shares health update after brain aneurysm diagnosis\n\nI'm A Celebrity... Get Me Out Of Here! fans demand that 'hard-to-watch' spin-off show is AXED as they bombard ITV with complaints\n\nJay Leno reveals the horrifying loss his dementia-stricken wife mourned 'every day' for three years\n\nDevastating \n\nRobert De Niro 'proud' to visit Manchester as work begins on his £360m skyscraper that will be UK's tallest outside London\n\nKatie Price, 47, reveals she is taking HRT medication for menopause symptoms - after being hospitalised for mystery weight loss\n\nJustin Bieber stops to help stranded driver in heartwarming moment caught on camera\n\nIs this Meghan's most bizarre 'moment' yet? Duchess crows over how 'boldly' Harry loves her and is 'announced' like royalty into room (containing two people)\n\nLeonardo DiCaprio attends an in-conversation at BFI Southbank to promote One Battle After Another\n\nCandace Cameron Bure reveals struggles in marriage of 30 years\n\nAshley Tisdale stuns fans with unexpected new name 11 years after marriage\n\nHas officially embraced a new chapter of her life\n\nIt Ends with Us author Colleen Hoover breaks silence on explosive Blake Lively and Justin Baldoni lawsuit\n\nSpeaking out \n\nRHOC star Meghan King loses custody of kids to ex Jim Edmonds after child protective services investigation\n\nCaprice, 54, slips into a sexy Santa costume as she promotes her new festive movie A Scottish Christmas Secret in her lavish London home\n\nPrince William tells Rob Burrow's widow and children they should be 'so proud' of 'incredibly brave and special' rugby star - as they open Motor Neurone Disease centre in his honour\n\nAriana Grande reveals her late Italian Nonna's hilarious reaction when her brother Frankie came out as gay\n\nNew Girl actress Olivia Munn who is battling breast cancer reveals how Kate gave her 'comfort' by speaking about her own journey \n\nJacob Elordi ridiculed over his 'horrific' handwriting: 'Was he holding the pen with his toes?'\n\nSusannah Constantine brands Andrew Mountbatten-Windsor 'ignorant and entitled'- and says scandal must be 'horrendous' for Beatrice and Eugenie\n\nBrittany Cartwright flaunts new chest while bra-free in plunging gown... one month after plastic surgery\n\nLeft little to the imagination\n\nEXCLUSIVECharlotte Crosby shares heartbreaking health update on her mother Letitia, 56, amid cancer battle\n\nJennifer Aniston, 56, has been wearing the SAME piece of jewelry for the past 25 years, can you guess what it is?\n\nKim Kardashian reveals doctors warn her brain aneurysm could 'RUPTURE' at any time from her high-pressure lifestyle\n\nEXCLUSIVESian Welby opens up on 'pressure' she felt to return to TV work just three months after giving birth as the 'breadwinner' in her relationship \n\nJessie J reveals reason behind her emotional 'mum-to-mum' embrace with Princess of Wales at Royal Variety Performance\n\nLily Collins shares rare insight into motherhood and admits she is 'still learning how to manage everything' as a parent as she flashes her bra in striking ELLE shoot\n\nProud parents David and Victoria Beckham break down in 'tears of joy and pride' as son Cruz, 20, performs for friends and family\n\nEXCLUSIVEGwyneth Paltrow and Jennifer Lopez are now friends after the stars, who BOTH romanced Ben Affleck, were frosty in the '90s\n\nHarper Beckham, 14, supports big brother Cruz, 20, as they share a sweet hug following his intimate gig for friends and family\n\nHow I'm A Celeb star Kelly Brook remains the ultimate swimsuit model three decades on from her Page 3 days - and she still gets to enjoy pasta and wine!\n\nKhloe Kardashian 'DESERVED' to be traumatized after overhearing her having sex, says mom Kris Jenner\n\nJennifer Aniston makes rare comment about the Me Too movement - revealing why she 'can't avoid' addressing it any longer\n\nEXCLUSIVEDame Judi Dench, 90, regifts a sheer thong to a red-faced Dame Imelda Staunton, 69, who quips it's 'a bit big' in hilarious festive ad\n\nGeorgia Harrison and boyfriend Jack Stacey enjoy their first post-baby date night three weeks after welcoming their daughter\n\n6ft 7\" Stephen Merchant towers over his stunning girlfriend Mircea Monroe at a surprise party to celebrate John Cleese's 60 years in showbiz\n\nThis Morning fans gasp 'he needs serious help!' as Britain's most tattooed man shows off inked EYEBALLS - complaining they've 'had to switch off'\n\nTom Hardy strips down to his underwear as he films Guy Ritchie's MobLand season 2 in East London\n\nLily James poses in swimwear as she shares a series of sun-soaked beach snaps from Australia and says she's 'never been better'\n\nSquirming Lorraine Kelly drowned out as Piers Morgan and Dr Amir furiously clash over trans rights and women's spaces\n\nKelly Brook's husband Jeremy Parisi responds to 'very tough' moment she broke down in tears on I'm A Celebrity - admitting that being without her is 'so much harder' than he expected\n\nWayne Rooney reveals the astonishing details behind his biggest Man United contract - leaving former teammates Gary Neville and Roy Keane in stunned silence\n\nJohn Cleese, 86, is supported by Hugh Grant, Ronnie Wood and Alison Steadman at a luvvy-filled surprise party to celebrate 60 years in showbiz\n\nMichelle Keegan desperately attempts to keep warm while filming The Blame in Hertfordshire during Met Office snow warning and -12C Arctic blast\n\nLily Allen announces her biggest EVER headline tour amid the success of David Harbour revenge album West End Girl - after selling out intimate shows in just minutes\n\nScreaming AngryGinge silences Ant and Dec as he struggles to stand facing his ultimate fear of spiders in first look at Camp Fright trial\n\nChanelle Hayes shows off her nine stone weight-loss in a bikini 'after quitting her job as a nurse to launch OnlyFans career'\n\n'Proud of how far I've come': Strictly dancer Amy Dowden shares a health update as she marks two weeks since her second mastectomy\n\nAaron Chalmers' ex Talia Oatway fears their son Oakley, three, could die after devastating new diagnosis\n\nThe hidden message Kate Middleton sent to her supporters with her dress at Royal Variety Performance\n\nI'm A Celeb's Vogue Williams jokes her biggest jungle fear is 'losing the ass that took so long to build'\n\nKate's great heir day! Princess of Wales reveals secret to her new lighter locks during chat with Su Pollard at the Royal Variety Performance \n\nKatie Price breaks her silence on her decade-long feud with Kelly Brook as she hits out at their shared ex Danny Cipriani \n\nJessie J reveals the poignant reason behind her Royal Variety tracksuit after sharing an emotional embrace with the Princess of Wales\n\nCoronation Street star breaks silence on quitting soap after character's sudden disappearance - and reveals new job worlds away from ITV soap\n\nKate Middleton stuns in green velvet dress at Royal Variety Performance - and we've found it on the high street\n\nKaty Perry 'did not expect to fall for someone so soon' as unlikely romance with ex-PM Justin Trudeau flourishes - months after Orlando Bloom split\n\nArchie and Lilibet have 'been good' this year! Meghan reveals her children's sweet letter to Santa in blink-and-you'll-miss-it moment in her new Netflix trailer\n\nAlison Hammond breaks down in tears as she meets a single mum who has been homeless with her son for six years\n\nWatch Victoria Beckham's rare performances from over the years after Spice Girl fans left in awe following acoustic track performance with Cruz\n\nThe biggest threat to Vogue Williams on I'm A Celebrity REVEALED - and it has nothing to do with the brutal Bushtucker Trials\n\nKatie Price issues a grovelling apology to Myleene Klass for calling her a 'clone' in scathing dig after the pianist was awarded an MBE\n\nSir Cliff Richard, 85, spends a 'gorgeous' intimate evening wining and dining Priscilla Presley, 80\n\nElizabeth Hurley and Billy Ray Cyrus can't keep their hands off each other as they make a PDA-filled appearance at the Country Music Awards\n\nThis Morning star calls in police to hunt down man who SPAT at his wife in explosive road rage row that left his eight-year-old daughter 'in pieces on the floor'\n\nBehind the scenes of Meghan's bizarre Bazaar interview! Duchess reclines barefoot on an armchair - as it's revealed the shoot was 5 YEARS in the making\n\nLoose Women star Brenda Edwards reveals secret boyfriend as she 'soft launches' their relationship with anniversary tribute\n\nJennifer Aniston's 'love guru' boyfriend Jim Curtis warns people 'not to settle' as he explains how 'relationships are the most...\n\nKim Kardashian reveals SHE was the secret bidder that paid $80k at auction for Bible her late dad Robert gave to O.J. Simpson\n\nGogglebox's Amy Tapper reveals the secret struggle behind her eight stone weight loss in emotional Good Morning Britain interview\n\nI'm a body language expert and there's A LOT more to Kelly Brook and Jack Osbourne's I'm A Celeb clash than meets the eye - here's what's going to happen next\n\nLily Allen says she feels 'validated' by overwhelming response to writing about her 'messed up' life on West End Girl\n\nMonty Panesar's infamous Celebrity Mastermind appearance goes viral after Steve Smith brutally mocked cricket hero for scoring ONE point in general knowledge round - so, how many can YOU get right?\n\nToday's headlines\n\nStarmer piles pressure on Andrew to testify in the US over his 'ties' to Jeffrey Epstein after disgraced...\n\nTrump says his humiliating Ukraine peace plan is NOT a 'final offer' but the war must end now - as he holds...\n\nSiobhan's family all used a trusted bathroom product for decades... now she's one of thousands left with...\n\nThe Ultimate Christmas Gift Guide: starting at just £3.90, the ONLY list you need for him, for her, for kids...\n\n'My mouth ulcers keep coming back - what can I do?' DR ELLIE reveals the triggers, from three common foods...\n\nGirl, 13, is arrested for murder after woman in her 50s is found dead in house following reports of bust-up\n\nStrictly Come Dancing's La Voix is forced to pull out of the competition before Tess Daly and Claudia...\n\nI fear for Katie Price. I overdosed twice on cocaine. Now I'm an OnlyFans millionaire, my children go to...\n\nI thought I had dementia but it turned out to be LIVER DISEASE. Jackie couldn't recognise her husband - now...\n\nAmy Dowden wraps up warm as she arrives in Blackpool for Strictly after undergoing second mastectomy\n\nMajor European airport halts flights after multiple drone sightings amid fears of Russian incursions\n\nTracked down by the Daily Mail, the man who owns land in Oxfordshire that a stinking river of rubbish has...\n\nMan wrongly jailed for murder for 38 years struggles with smartphones, apps and self-checkouts since his...\n\nREVEALED: Humiliated HSTikkyTokky's father is an English rugby legend: Daily Mail investigation exposes...\n\nThe girl who gave birth aged FIVE: Incredible mystery of the child who became the world's youngest ever...\n\nFern Britton, 68, looks chic in a velvet khaki blazer as she continues to show off her incredible weight...\n\nMeet the man who bought a doomed house on Norfolk's collapsing coastline for £125k… because he 'didn't know'...\n\nFamily's heartache as 'super fit' mother-of-five, 42, and her dog are mowed down and killed by Land Rover...\n\nWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends...\n\nMarks & Spencer eyes up 500 sites for new food stores across Britain - so will there be one near you?\n\nI died twice and was 'propelled' into a journey of death where 'otherworldly beings' revealed the secrets of...\n\nBillie Piper dazzles in a sheer minidress as she is joined by celebrity friends including Jenna Coleman and...\n\nThis little boy became one of the most influential people in the world - can you guess who he is?\n\nPETER HITCHENS: The real lasting lesson of the Great Covid Panic is that most of us don't want to be free\n\nTrump now says he wants Marjorie Taylor Greene to RETURN to politics as their love-hate relationship takes...\n\nThe full list of military bases that could house asylum seekers revealed: As the Home Office scrambles to...\n\nThe VERY humble roots of the little girl from London who's made £300M by keeping up with the Kardashians\n\nAlex Murdaugh's housekeeper reveals explosive theory about what REALLY happened on night of double murder\n\nThe tragic story of Princess Beatrice's first heartbreak - after late Queen 'ordered' her split from much...\n\nBest and WORST dressed celebrities at the Las Vegas Formula One Grand Prix\n\nDid YOU get married on the most popular day of the year? Latest figures reveal likeliest date for Brits to...\n\nHow Prince Harry was 'slumped' alongside Meghan Markle during their engagement interview - suggesting the...\n\nGemma Collins reveals she stopped Mounjaro amid fears the weight loss jab left her with agonising gall...\n\nThe mother stabbed to death at her teenage son's grave by ex-husband who blamed HER for their tragic loss......\n\nEd Miliband insists COP30 deal is a 'step forward' after 'sweaty, frustrating and nightmarish' talks in...\n\nREVEALED: Inside Labour plot to destroy Starmer. 'It's all anyone talks about,' hears DAN HODGES - as he...\n\n'It's a tragedy that should have been avoided': Survivors of Patagonia blizzard disaster that killed British...\n\nPOLL OF THE DAY: Should the BBC be allowed to continue charging a compulsory licence fee?\n\nKelly Brook's husband Jeremy Parisi weighs in on I'm A Celeb feud with Jack Osbourne and admits he is a...\n\nAndrew would 'humiliate' women around him with 'ghastly' jokes and 'juvenile' pranks - from unzipping a...\n\nRuby Wax's 'secret feud' with huge presenter is revealed after I'm A Celebrity star accused them of...\n\n'Neighbour from hell' attacked man with a pair of garden scissors after row over her BINS outside £400k...\n\nFive young people killed in road crash will now be forever together, mourners hear at funeral for teacher,...\n\nIncredible life of adored Kessler twins, 89, who died on the same day in 'joint suicide': Sisters performed...\n\nLast surviving member of elite WWII regiment, 103, reveals incredible exploits battling the Nazis in...\n\nInside grim 'house of horrors' where obese family feasted as they filmed girl, 14, nearly starve to death\n\nJeremy Clarkson installs 100,000 sq ft metal car park surface at his Farmer's Dog pub - and it's so big you...\n\nThey live glamorous lives as chart-topping musicians, actors and businesswomen - but can YOU recognise these...\n\n'Shed' for sale for £225,000: Estate agents say one-bed property at bottom of garden is 'stylish detached...\n\nSix Chinese car that are cheaper 'Temu' alternatives to luxury favourites from the likes of Porsche and...\n\nMORE HEADLINES\n\nThe mother stabbed to death at her teenage son's grave by ex-husband who blamed HER for their tragic loss... before he uttered sickening confession on phone\n\nMeet the man who bought a doomed house on Norfolk's collapsing coastline for £125k… because he 'didn't know' it was feet from disaster\n\nMarried British soldier accused of stabbing young mother to death in Kenya breaks his silence from behind bars as he fights extradition to Africa\n\nThe girl who gave birth aged FIVE: Incredible mystery of the child who became the world's youngest ever mother\n\nThis little boy became one of the most influential people in the world - can you guess who he is?\n\nTracked down by the Daily Mail, the man who owns land in Oxfordshire that a stinking river of rubbish has been dumped on. GUY ADAMS exposes exactly how criminal gang operated, eye-watering cost... and the twist NO ONE saw coming\n\nLabour councillor's Lamborghini is found parked twice in council car park's disabled bays without a blue badge\n\nForget something, Usha? Whispers about Vance marriage grow louder as Second Lady ditches her wedding band\n\nThe full list of military bases that could house asylum seekers revealed: As the Home Office scrambles to move away from hotels by taking over army camps instead, we map all the 2,000 possible sites\n\nStarmer joins European leaders expressing 'concern' over Trump's peace plan: Ukraine and US to meet as Zelensky faces humiliating ultimatum to end war with Russia\n\nJAN MOIR: My trip to Meghan Markle's pop up shop where even the Montecito set baulk at £24 for a jar of honey!\n\nThe tragic story of Princess Beatrice's first heartbreak - after late Queen 'ordered' her split from much older American playboy with a dark past\n\nMarjorie Taylor Greene resigns from Congress\n\nHow stubborn homeowners in the Cotswolds' strictest villages are embracing draconian planning laws\n\nMan wrongly jailed for murder for 38 years struggles with smartphones, apps and self-checkouts since his release - but soon may be a millionaire\n\nJeremy Clarkson installs 100,000 sq ft metal car park surface at his Farmer's Dog pub - and it's so big you can see it from space\n\nTrump says his humiliating Ukraine peace plan is NOT a 'final offer' but the war must end now - as he holds crisis talks with Starmer after European leaders expressed 'concern' with deal\n\nAndrew Mountbatten-Windsor is condemned for 'silence' in Jeffrey Epstein probe by US investigators - as disgraced ex-prince faces being stripped of final honour\n\nGirl, 13, is arrested for murder after woman in her 50s is found dead in house following reports of bust-up\n\nHow Prince Harry was 'slumped' alongside Meghan Markle during their engagement interview - suggesting the Duchess' desire to 'control' and 'take over the narrative'\n\nIn less than 20 years none of us will be working at all thanks to artificial intelligence, says Elon Musk\n\nMarks & Spencer eyes up 500 sites for new food stores across Britain - so will there be one near you?\n\nKennedy curse strikes again as JFK's granddaughter, 35, reveals devastating terminal cancer diagnosis\n\nSarah Ferguson 'is considering six-figure offers' to give tell-all interview after being stripped of Duchess of York title as palace aides fear she could go 'rogue'\n\nTrump turns the screw: Zelensky's agonising choice as President demands he accept humiliating peace deal by Thursday - or lose US support\n\nCoronation Street star poses beside 'sex slave' speech hate preacher who was banned from the UK\n\nConservatives are set to plunge to just 14 seats at next general election, according to new poll - with Reform on target for comfortable victory\n\nInside grim 'house of horrors' where obese family feasted as they filmed girl, 14, nearly starve to death\n\nWas this child shot dead in the Balkans War by a tourist sniper? Claims foreign 'safari' hunters paid to shoot civilians in Sarajevo have sparked revulsion. Now DAVID JONES reveals the growing evidence it DID really happen\n\nFamily's heartache as 'super fit' mother-of-five, 42, and her dog are mowed down and killed by Land Rover driver while on their morning run\n\nDid YOU get married on the most popular day of the year? Latest figures reveal likeliest date for Brits to have their wedding\n\nAndrew would 'humiliate' women around him with 'ghastly' jokes and 'juvenile' pranks - from unzipping a celebrity's dress to shoving a guest's face into a plate of food\n\nHarrowing moment dad screams 'My kid is dead' after his 11-year-old son was killed in road rage shooting on way to school\n\nMOST READ IN DETAIL\n\nADVERTORIAL FEATURES\n\nHurtigruten is one of the world's great journeys, sailing and caring for the Norwegian coast since 1893.\n\nLEARN MORE >\n\nNEW ARTICLESHomeTop\n\nFollow us on: \n\nBack to top\n\nLeadership Team\nThis is Money\n\nMail Travel\nAbout Daily Mail\n\nTerms of Use\n\nWebsite Terms\nPrivacy Settings\nPrivacy Policy\nSubscription Terms & Conditions\nDo not sell or share my personal information\nContributors\nAdditional Cookie Information\n\nGet in Touch\n\nHow to complain\nWork with us\nAdvertise with us\nDaily Mail Subscriptions Help & FAQs\n\nVideo Archive\n\nTopics Index\nText-Based Site\nMobile Site\n© 2025 Associated Newspapers Limited\n\nAdvertisement\n\nAdvertisement","summary":"Fern Britton looked effortlessly chic as she continued to show off her five stone weight loss in a stylish Instagram snap on Saturday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15316901/Fern-Britton-trendy-velvet-ensemble-weight-loss.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/19/104108719-0-image-m-32_1763839473819.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/10/737776673412657416/1024x576_MP4_737776673412657416.mp4","publish_date":"2025-11-22 21:44:06","author":"Editor,Lydia Burns","authors":["Editor","Lydia Burns"],"language":"en","source_country":"gb","sentiment":-0.018},{"id":381655992,"title":"JFK’s granddaughter reveals she has terminal cancer and ‘a year to live maybe’","text":"It turned out to be acute myeloid leukaemia with a rare mutation, mostly seen in older people, she wrote.\n\nMs Schlossberg, an environmental journalist, wrote she has undergone rounds of chemotherapy and two stem cell transplants, the first using cells from her sister and the next from an unrelated donor, and participated in clinical trials.\n\nDuring the latest trial, she wrote that her doctor told her “he could keep me alive for a year, maybe”.\n\nMs Schlossberg noted that her cousin, Robert F Kennedy Jr, was on the national stage, first running for president and later becoming President Donald Trump’s health and human services secretary, as she has been treated and that his policies could hurt cancer patients like her.\n\n“As I spent more and more of my life under the care of doctors, nurses, and researchers striving to improve the lives of others, I watched as Bobby cut nearly a half billion dollars for research into mRNA vaccines, technology that could be used against certain cancers,” she wrote in the essay, published on the 62nd anniversary of JFK’s assassination.\n\nMs Schlossberg wrote about her fears that her daughter and son will not remember her and feeling cheated and sad that she will not get to keep living “the wonderful life” she had with her husband, George Moran.\n\nWhile her parents and siblings try to hide their pain from her, she said she feels it every day.\n\n“For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry.\n\n“Now I have added a new tragedy to her life, to our family’s life, and there’s nothing I can do to stop it,” she wrote.","summary":"John F Kennedy’s granddaughter disclosed on Saturday that she has terminal cancer, writing in an essay in The New Yorker that one of her doctors said ...","url":"https://www.irishexaminer.com/world/arid-41747394.html","image":"https://www.irishexaminer.com/cms_media/module_img/9741/4870542_1_seoimage1x1_bf7022f4de484c02be8d96b704efdbd7.jpg.jpg","video":null,"publish_date":"2025-11-22 21:43:00","author":"Associated Press Reporters,Irishexaminer.com","authors":["Associated Press Reporters","Irishexaminer.com"],"language":"en","source_country":"ie","sentiment":-0.332},{"id":381652236,"title":"Trump assassin Thomas Crooks' was obsessed with muscle-bound women as his unusual search habits are revealed and FBI dismisses key theory","text":"Would-be assassin Thomas Matthew Crooks appeared to have an obsession with 'animated female muscle-building erotica,' according to the FBI.\n\nIt emerged last week that Crooks, who opened fire on Donald Trump at a Pennsylvania rally in July 2024, frequented the website DeviantArt - a site often linked to pornographic animated content often associated with the furry community.\n\nThat led to speculation he was interested in furry content — but the FBI claims that based on Crooks' internet activity, he was more interested in muscle-bound women.\n\n'Crooks was on that website and looked at images related to women who work out ... a lot,' FBI Director Kash Patel told Fox News Digital.\n\nAnimated female muscle-building erotica is a niche online subculture tied to themes of domination and emasculation, often overlapping with submissive and cuckold fantasies.\n\nThe revelation adds a disturbing layer to what's known about Crooks's, who left no manifesto and gave no clear motive for his attempt to assassinate Trump.\n\nFBI officials said a broader investigation of his digital footprint revealed searches for rally logistics and historical assassination details in the days leading up to the attack.\n\nThe bureau has now released an extensive account of its investigation, claiming Crooks acted alone — debunking a key theory.\n\nThe FBI was forced into revealing the information after a bombshell Tucker Carlson investigation last week.\n\nPatel, along with FBI Deputy Director Dan Bongino and a senior official, has now told the Fox News Digital as one of the largest mobilizations of resources in FBI history. \n\nNearly 500 employees were involved, conducting more than 1,000 interviews worldwide and reviewing 2,000 tips. \n\nInvestigators executed search warrants, issued subpoenas, and analyzed Crooks's digital footprint in painstaking detail, including 13 electronic devices and 35 online accounts.\n\nPatel said the investigation was a 'Day One priority,' emphasizing that Trump was treated as a victim under federal victims' rights laws and was fully briefed on the findings. \n\n'Dan and I have been on this since we got here eight months ago,' Patel told Fox News. 'We not only had to maintain the chain of command to President Trump, but we had to remind the world that President Trump was the victim - one of the four victims - on that day.'\n\nOfficials stressed there is no evidence Crooks was directed, inspired, or assisted by any foreign government or organization. \n\nHis foreign-based email accounts in Germany and Belgium were accessed within days of the attack, and all content was reviewed with help from international partners. \n\nThe FBI also dismissed theories of a second shooter, confirming that every round was accounted for and that the person seen near the water tower was a Pennsylvania State Police officer.\n\nCrooks used a .223 rifle to fire eight rounds, injuring Trump and killing Corey Comperatore, a firefighter and father.\n\nInvestigators found 22 unfired rounds and extra magazines in his vehicle, along with a ballistic vest. \n\nAn undetonated explosive device was also discovered in the car. The device had a receiver for remote detonation but was in the off position, preventing activation. \n\n'It seems so unlikely you would build a device and forget to turn it on - but he did,' Bongino said.\n\nPatel defended the FBI against criticism for failing to prevent the attack, noting that the bureau can only investigate based on a lawful predicate and does not monitor every American's social media activity. \n\n'No one in law enforcement knew who he was. No one referred him to law enforcement,' Patel said.\n\nThe FBI controlled the crime scene from July 14 to July 18, cleaned the roof after collecting all evidence, and oversaw Crooks's autopsy. \n\nDNA, fingernails, hair, and blood samples remain in FBI evidence. Officials clarified that the family chose cremation, not the FBI.\n\nPatel rejected claims that the bureau withheld documents from Congress, stating that the FBI has provided more than 40,000 documents in eight months, including 2,750 pages related to this case.\n\nLawmakers were invited to Quantico for a full walkthrough of investigative steps, video evidence, and explosive simulations. \n\n'There isn't some trove of documents we haven't sent over,' Patel said. Bongino added, 'No one is interested in guilt or innocence, they're interested in someone to blame.'\n\nTrump told Fox News he has confidence in Patel and contrasted the current leadership with former FBI Director Christopher Wray. 'I wasn't confident with Wray, but this group is different,' Trump said.\n\nThe case remains in a 'pending, inactive' status, but officials said they will reopen the investigation if a credible lead surfaces. \n\nBongino summed up the bureau's position bluntly: 'The public is pissed off. We get it. We sympathize with you. It couldn't have just been this guy - it couldn't have just been this guy - it is. There is no reason I would tell you otherwise.","summary":"FBI has revealed Trump shooter Thomas Crooks's had an obsession with watching 'animated female muscle-building erotica' on a site known for hosting adult animated content.","url":"https://www.dailymail.co.uk/news/article-15316371/trump-assassin-thomas-crooks-search-habits-fbi-dismisses-theoryy.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/18/104107427-0-image-a-14_1763837125308.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/08/20/4670091652233870558/1024x576_MP4_4670091652233870558.mp4","publish_date":"2025-11-22 21:39:09","author":"Alexa Cimino,Editor","authors":["Alexa Cimino","Editor"],"language":"en","source_country":"gb","sentiment":-0.16},{"id":381656480,"title":"South Africa says President will not hand G20 to U.S. embassy official","text":"South African President Cyril Ramaphosa will not hand the next presidency of the G20 to a U.S. embassy representative after U.S. President Donald Trumprefused to attend this weekend’s summit, the South African government said Saturday (November 22, 2025).\n\nAlso read: G20 Summit in Johannesburg highlights\n\nThe Trump administration has boycotted the Johannesburg meeting that wraps up on Sunday (November 23, 2025) and said it would send the chargé d'affaires of its U.S. embassy in South Africa for the handover, with Washington assuming the 2026 presidency of the group of leading economies.\n\nMr. Ramaphosa “will not be handing over to the charge d'affaires from the U.S.,” Foreign Minister Ronald Lamola told journalists.\n\n“The United States is a member of the G20, and if they want to be represented, they can still send anyone at the right level,” he said. \n\nThis would be the head of state, Minister or a “special envoy appointed by the President”, Mr. Lamola said.\n\nOtherwise, a handover could take place at government offices between officials of the same ranking, he said.\n\nMr. Trump’s absence from the Johannesburg summit follows his withdrawal of the United States from other multilateral events and his feud with Pretoria over a range of international and domestic issues, including claims that white South Africans are persecuted.\n\nThe U.S. embassy told South Africa ahead of the summit that its priorities “run counter” to U.S. policy views and no joint declaration could be issued after the meeting because of its absence and objections.\n\nThe meeting, which brought together nearly two dozen world leaders, adopted on Saturday (November 22, 2025) a leaders’ declaration that called for peace in Ukraine, Sudan, the Democratic Republic of Congo and the “Occupied Palestinian Territory”, as well as safeguards on the global supply of critical minerals.\n\n“We cannot be held back by one country,” presidential spokesman Vincent Magwenya told reporters.","url":"https://www.thehindu.com/news/international/south-africa-says-president-will-not-hand-g20-to-us-embassy-official/article70312454.ece","image":"https://th-i.thgim.com/public/incoming/edl838/article70312455.ece/alternates/LANDSCAPE_1200/2025-11-22T134710Z_2075718391_RC2N1IA8HPY3_RTRMADP_3_G20-SUMMIT.JPG","video":null,"publish_date":"2025-11-22 21:37:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.195},{"id":381653000,"title":"Ukraine is likely to reject Trump&#8217;s peace plan. No one knows what happens next.","text":"Halifax, Canada — Sen.Roger Wicker, a Mississippi Republican who rarely criticizes Donald Trump, called the president’s new 28-point proposal to end the war in Ukraine a “so-called ‘peace plan’” that rewards “one of the world’s most flagrant war criminals.” \n\nSen. Mitch McConnell, R-Ky., called the plan “a capitulation” to Vladimir Putin and said the Russian leader “has spent the entire year trying to play President Trump for a fool.” And Sen. Tom Tillis, R-N.C., called the proposal a win for Putin that should be reversed.\n\n “Vladmir Putin is a murderer, a rapist and an assassin,” Tillis said. “There is no quarter for a human being like that.”\n\nThe Republican criticism of Trump’s latest peace plan in the long-running conflict between Russia and Ukraine is one sign that the White House overture is on politically shaky ground. The plan essentially demands that Ukraine cede territory, substantially reduce its army and eliminate some of its arms.\n\n“Vladmir Putin is a murderer, a rapist and an assassin,” said Sen. Thom Tillis, R-N.C. “There is no quarter for a human being like that.”\n\nAnd it opens the door to questions about what Trump will do if Ukrainian President Volodymyr Zelensky, as widely expected, fails to accept the peace plan by Thanksgiving Day as the U.S president has demanded.\n\nAsked by a reporter as he left the White House on Saturday if the plan was his final offer, Trump replied, “No, not my final offer.”\n\nAsked if he would end U.S. military and intelligence support for Ukraine if Zelensky failed to agree, Trump mocked the Ukrainian leader, “Then he can continue to fight his little heart out.”\n\nThe White House did not respond to a request for comment.\n\nAs U.S., Ukrainian, Canadian and European officials and experts met on Saturday at the Halifax International Security Forum , there was widespread confusion about what Trump might do if Zelensky rejects the plan. \n\nCritics called the proposal a rushed effort by Trump to continue his drive to win the Nobel Peace Prize. But there was uniform agreement that it would be foolish for Zelensky to reject the plan outright and risk angering Trump. The United States has been Ukraine’s primary benefactor as it defends itself from Russia’s invasion four years ago.\n\nWhat Trump’s proposal actually entails remains unclear. The exact text of the plan, which presidential envoy Steve Witkoff brokered with Russian envoy Kirill Dmitriev in Miami and without Ukrainian involvement remains secret. American senators and European officials alike said they have only heard about the contents of the plan, which was first leaked to Axios, from press reports.\n\nOfficials and foreign policy experts, who spoke on condition of anonymity citing fear of retaliation from Trump, said they had given up trying to predict what the president might do if Thursday ends without a peace deal. One U.S. senator, asked if he had any sense, replied, “None, none whatsoever.”\n\nTrump has toggled between threatening Ukraine and warning Russia about imminent sanctions and other punishment if the warring leaders don’t agree on a path to ending hostilities. The U.S. president is known for issuing dramatic ultimatums on a range of issues and then standing down. But finding a means to end the war has frustrated Trump, who over the summer said he was “very angry” with Putin.\n\nOfficials and experts said that Trump’s most powerful leverage against Ukraine’s government would be to stop providing U.S. intelligence that helps Ukrainian forces conduct long-range missiles and drone strikes against Russian facilities and forces.\n\nUkrainian officials said such a move would not impact Ukrainian forces on the front line who have learned to use drones to detect Russian attacks or troop movements. Drones now account for 80% of Ukrainian attacks on Russian forces, compared to long-range artillery and rockets.\n\nTrump could also halt a program he started where American weapons are sold to European countries, which are then provided to Ukraine. But analysts said that was unlikely since Trump supports the weapons sales, which aid U.S. defense firms and allow U.S. forces to purchase newer weapons.\n\nThe dynamic that could drive Trump, some observers predicted, is domestic politics. If a large number of Republicans criticize the president, he could temper his stance toward Zelensky.\n\nDespite some vocal criticism, other Republicans appeared hesitant to defy Trump. Sen. John Hoeven R-N.D., said at the Halifax conference that he didn’t expect Ukraine to accept the current plan.\n\nHe declined, though, to criticize Trump.","url":"https://www.ms.now/news/trump-ukraine-peace-plan-thanksgiving-deadline","image":"https://res.cloudinary.com/msnow/images/t_nbcnews-fp-1200-630/f_auto,q_auto/v1763841336/251122-trump-zelenskyy-wh-mbs/251122-trump-zelenskyy-wh-mbs.jpg?_i=AA","video":null,"publish_date":"2025-11-22 21:35:36","author":"David Rohde","authors":["David Rohde"],"language":"en","category":"politics","source_country":"us","sentiment":-0.602},{"id":381652232,"title":"Furious British ex-soldier who was captured by Russia while fighting for Ukraine blasts Trump's 'repugnant' peace plan","text":"Furious British ex-soldier who was captured by Russia while fighting for Ukraine blasts Trump's 'repugnant' peace plan\n\nREAD MORE: Trump says Ukraine peace plan is NOT a 'final offer' but war must end \n\nBy ANDREW JEHRING, CHIEF FOREIGN CORRESPONDENT\n\nPublished: 21:33 GMT, 22 November 2025 | Updated: 21:34 GMT, 22 November 2025\n\nBritish hero Shaun Pinner who fought Russia at Mariupol has slammed Donald Trump's peace plan as 'surrender dressed up as diplomacy'.\n\nThe former Royal Anglian soldier who was captured by Moscow told the Mail on Sunday: 'It's repugnant. I'm sick with anger.\n\n'This so-called 28-point 'peace plan' reads less like a strategy for a just, durable settlement and more like an attempt to appease Putin, a blueprint to tie Ukraine's hands, strip away its right to defend itself, and reward an aggressor with no intention of stopping.\n\n'A peace plan that protects the perpetrator and punishes the victim isn't peace. It's surrender dressed up as diplomacy.'\n\nPinner, 51, served in the British military from 17 and moved to Ukraine in 2018 to help rebuild its military after Russia annexed Crimea and invaded the Donbas in 2014.\n\nHe defended Mariupol following Vladimir Putin's full-scale invasion in February 2022 and was finally captured two months later after a heroic defence.\n\nPinner was starved, tortured and sentenced to death before Roman Abramovich helped secure his freedom that September.\n\nHe has stayed in Ukraine with wife Laryssa, whom he met out there, and says Kyiv can still defeat Putin if the West stands firm.\n\n'We're not just giving them a bloody nose, we've got them on the ropes,' he said. 'We're giving them a few right uppercuts.'\n\nShaun Pinner (pictured) was captured by Russian forces during the siege of Mariupol in April 2022\n\nHe has since branded Donald Trump's 28-point peace plan for Ukraine as 'surrender dressed up as diplomacy'\n\nReferring to the daring operation to send lorries laden with drones deep into Russian territory that took out some of Putin's most valuable bombers, Pinner said: 'They've had a standing count with things like Operation Spiderweb.\n\n'They aren't dominant at the Black Sea anymore. And now we're looking at Russia being bombed pretty much daily now.'\n\nOn Ukrainian morale, he said: 'There is a fight. There is a will to fight. Ukrainians have not given up. People are tired. Things like the corruption scandal are not helping.\n\n'But again, I tell people that's a working democracy. However, I do have reservations about the number of troops we have.'\n\nWhile Russia has claimed to take Pokrovsk in recent weeks, a key city in the Donbas, Pinner doubts the claim but said even if they have it is not the major victory Moscow claims.\n\nHe said Putin's forces outnumbered Ukraine 'eight to one' on the city and defending it is part of the 'strategic plan' to 'exhaust the enemy's ability to push on'.\n\n'You've got to keep the motivation to keep going with the goal, which is to drain the enemy of its resources so that Kyiv might live,' he said.\n\n'I was there a year ago in November, one year ago, and the Russians were eight kilometres out. And if you just take the bare facts of the last year, they have just got eight kilometres into the city, at an incredibly detrimental cost.\n\nShaun Pinner stayed in Ukraine with his wife Laryssa (pictured) who he met in the eastern European country \n\n'There is a fight. There is a will to fight. Ukrainians have not given up,' Pinner (pictured behind bars on June 8, 2022) said of the Ukrainian will \n\nFreed British hostage Shaun Pinner tells Good Morning Britain how he was stunned with an electric CATTLE PROD for being a West Ham fan while he was held captive by Russian forces in Ukraine\n\n'And if they do take Pokrovsk, it's going to be extremely hard for them to move on. They're going to be completely exhausted, completely depleted. And you've got winter coming.'\n\nWhile much of the media has focused on Ukraine's morale being low with winter coming amid the corruption scandal that has rocked Volodymyr Zelensky's government, Pinner is insistent Moscow is suffering more.\n\n'Putin wants that trophy,' he said. 'He needs that trophy to show it to the Russians. I think it's totally under-reported, the pressure Putin is under.\n\n'You look at the pressure his economy is under. He needs Pokrovsk, he needs a victory, because otherwise he's going to go into the winter where it all slows down.\n\n'You're going to have the bitter winter, and all he's going to go away with this year is body bags, coffins, not really any gains.'\n\nMariupolRussiaUkraineMoscow\n\nShare or comment on this article:\nFurious British ex-soldier who was captured by Russia while fighting for Ukraine blasts Trump's 'repugnant' peace plan\n\nAdd comment","summary":"British hero Shaun Pinner who fought Russia at Mariupol has slammed Donald Trump's peace plan as 'surrender dressed up as diplomacy'.","url":"https://www.dailymail.co.uk/news/article-15317163/British-ex-soldier-captured-Russia-Ukraine-blasts-Trumps-peace-plan.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/21/76076203-0-image-m-47_1763846786989.jpg","video":"https://videos.dailymail.co.uk/video/mol/2022/09/26/5310294809449970520/1024x576_MP4_5310294809449970520.mp4","publish_date":"2025-11-22 21:34:59","author":"Andy Jehring,Editor","authors":["Andy Jehring","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.153},{"id":381655154,"title":"Major MAGA figure Greene resigns from US Congress","text":"US lawmaker Marjorie Taylor Greene, an influential right-wing figure and MAGA acolyte who recently broke with President Donald Trump, announced she is quitting her seat in Congress, prompting him to double down on Saturday on accusations she is a “traitor.”\n\nIn a video posted online, the 51-year-old Republican congresswoman from Georgia, who was elected in 2020, said on Friday she had “always been despised in Washington DC and never fit in.”\n\nGreene said she did not want her supporters and family to endure “a hurtful and hateful primary against me by the President we all fought for, only to fight and win my election while Republicans will likely lose the midterms.”\n\n“I will be resigning from office with my last day being January 5, 2026,” she said.\n\nTrump responded on his Truth Social platform by referring to the lawmaker as Marjorie “Traitor” Brown, a label she had singled out as unacceptable in an explanation of her decision to step away.\n\n“For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD,” he said in the post early on Saturday morning.\n\nThe shock move by Greene was the clearest sign yet of a growing split in MAGA world, still churning over strong Democratic victories in this month’s off-year elections, including the win for leftist New York mayor-elect Zohran Mamdani — who had a chummy meeting with Trump Friday.\n\nThe movement has been particularly riven over Trump’s flip-flop on releasing emails related to the case of convicted sex offender Jeffrey Epstein.\n\nEpstein, a wealthy financier, moved in elite circles for years, cultivating close ties with business tycoons, politicians, academics and celebrities to whom he was accused of trafficking girls and young women for sex.\n\nThe Epstein affair appeared to have forced the break between Trump and Greene — something she referenced in her resignation speech.\n\n“Standing up for American women who were raped at 14, trafficked and used by rich powerful men should not result in me being called a traitor and threatened by the President of the United States, whom I fought for,” Greene said.\n\nTrump ended his Truth Social post by saying: “Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country!”\n\nJust this week, Congress passed and the president signed a law requiring government records on the millionaire sex predator to be made public, after months of Trump trying to keep a lid on the material.\n\nBut before his about-face on the issue, the president announced he was withdrawing all support for “‘Wacky’ Marjorie,” a vocal proponent of the release of the so-called Epstein files.\n\nHe followed up the following morning with multiple posts on his Truth Social platform attacking Greene as a “lightweight” and even a “traitor” to the Republican Party.\n\nThe former key political ally to Trump subsequently said she was being targeted by a wave of threats.\n\nGreene had previously been a standard-bearer of Trump’s Make America Great Again (MAGA) movement, a proponent of immigrant deportation, champion of gun rights and a vaccine skeptic.\n\nThe high-profile rupture came after Greene distanced herself from the president, who has faced growing criticism over US cost of living concerns and the Epstein scandal.\n\nTrump himself had campaigned on releasing the Epstein files, delighting a political base fervent about throwing a spotlight on the scandal and convinced that doing so would expose many powerful figures.\n\nGreene’s sudden shift away from Trump prompted speculation that she is lining up for her own presidential bid in 2028, although she dismissed it as “baseless gossip.”","url":"https://dailytimes.com.pk/1405480/major-maga-figure-greene-resigns-from-us-congress/","image":"https://dailytimes.com.pk/assets/uploads/2025/11/Major-Maga-copy.jpg","video":null,"publish_date":"2025-11-22 21:33:47","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.151},{"id":381651066,"title":"Ukraine's allies push back on a US peace plan seen as favouring Moscow","text":"Ukraine’s Western allies rallied around the war-torn country on Saturday as they pushed to revise a United States peace plan seen as favouring Moscow despite its all-out invasion of its neighbour.\n\nPresident Volodymyr Zelenskyy has vowed Ukrainians “will always defend” their home.\n\nA Ukrainian delegation, bolstered by representatives from France, Germany and the UK, is preparing for direct talks with Washington in Switzerland on Sunday (Geneva time).\n\nLIVE UPDATES: Cyclone Fina could reach category 4 as storm batters Darwin\n\nThe 28-point blueprint drawn up by the US to end the nearly four-year war sparked alarm in Kyiv and European capitals, with Zelenskyy saying his country could face a stark choice between standing up for its sovereign rights and preserving the American support it needs.\n\nSpeaking to reporters outside the White House on Saturday, President Donald Trump said the US proposal was not his “final offer.”\n\n“I would like to get to peace. It should have happened a long time ago. The Ukraine war with Russia should have never happened,” Trump said.\n\n“One way or the other, we have to get it ended.”\n\nThe US plan foresees Ukraine handing over territory to Russia, something Kyiv has repeatedly ruled out, while reducing the size of its army and blocking its coveted path to NATO membership. It contains many of Moscow’s long-standing demands, while offering limited security guarantees to Kyiv.\n\nREAD MORE: Fantasy author Darryl King isn't too concerned about AI. Writers who use a pen name may need to worry\n\nOn Saturday, leaders of the European Union, Canada and Japan issued a joint statement welcoming US peace efforts, but pushed back against key tenets of the plan.\n\n“We are ready to engage in order to ensure that a future peace is sustainable. We are clear on the principle that borders must not be changed by force. We are also concerned by the proposed limitations on Ukraine’s armed forces, which would leave Ukraine vulnerable to future attack,” the statement said.\n\nIt added that any decisions regarding NATO and the EU would require the consent of member states.\n\nREAD MORE: ﻿Show goes on after comedian dies on stage\n\nThe leaders of France, Germany and the UK met during the day on the sidelines of a Group of 20 summit in Johannesburg, South Africa, to discuss ways to support Kyiv, according to a person with knowledge of the matter who spoke on condition of anonymity because they were not authorized to speak publicly.\n\nGerman Chancellor Friedrich Merz told reporters at the summit that “wars cannot be ended by major powers over the heads of the countries affected,” and insisted Kyiv needed robust guarantees.\n\nFrench President Emmanuel Macron said the US peace plan for Ukraine “requires broader consultation” because “it stipulates many things involving Europeans,” like Russia's frozen assets and Ukraine’s accession to the European Union. Europe's security issues must also be taken into account, Macron said, adding: “We want a robust and lasting peace.\"\n\nMerz and Macron said that envoys from Germany, France, the UK and the EU will join Ukrainian negotiators as they meet a US delegation in Geneva on Sunday to discuss Washington’s proposal.\n\nZelenskyy confirmed the meeting on Saturday, after Trump set a deadline for Kyiv to respond to the plan by next Thursday.\n\nAmong those expected to represent Washington are Trump’s Army secretary, Dan Driscoll, and Marco Rubio, who serves as both national security adviser and secretary of state, according to a US official who was not authorised to publicly discuss the American participants before the meeting and spoke on condition of anonymity.\n\nDriscoll presented the US plan to Ukrainian officials this week.\n\nEuropean leaders have long warned against rushing a peace deal, seeing their own future at stake in Ukraine’s fight to beat back Russia, and insist on being consulted in peace efforts.\n\n‘Quite a way from a good outcome’\n\nKyiv's key allies in Europe reiterated their reservations about the Kremlin's readiness to end the war.\n\n“Time and again, Russia pretends to be serious about peace, but their actions never live up to their words,” UK Prime Minister Keir Starmer told reporters ahead of the G20 summit, days after a Russian strike on western Ukraine killed over two dozen civilians.\n\nEuropean leaders have long accused Russia of stalling diplomatic efforts in the hope of overwhelming Ukraine's much smaller forces on the battlefield.\n\nKyiv has repeatedly accepted US ceasefire proposals this year, while Moscow has held out for more favourable terms.\n\nREAD MORE: ﻿Brazil's judge orders Bolsonaro's arrest for allegedly plotting escape ahead of prison term\n\n“An end to the war can only be achieved with the unconditional consent of Ukraine,” Merz said during G20 summit briefing, adding that he had told Trump in a long phone call on Friday that Europe needed to be a part of any peace process, and that Russia had previously failed to keep its promises to respect Ukraine's territorial integrity.\n\n\"From my perspective, there is currently a chance to end this war,” Merz added. “But we are still quite a way from a good outcome for everyone.”\n\nEU Commission President Ursula von der Leyen said that a key principle for Kyiv's European allies was “nothing about Ukraine without Ukraine.”\n\nZelenskyy defiant as Ukraine remembers Soviet-era famine\n\nZelenskyy, in a video address published on Saturday, said Ukrainian representatives at the Geneva talks “know how to protect Ukrainian national interests and exactly what is needed to prevent Russia from carrying out” another invasion. “Real peace is always based on security and justice,” he added.\n\nNine officials are to take part in the talks, including Zelenskyy’s chief of staff Andrii Yermak and top envoy Rustem Umerov, according to a statement posted on the Ukrainian presidency’s website, which also stated that the negotiators are empowered to deal directly with Russia.\n\nREAD MORE: ﻿The world's biggest company just told everyone to chill out\n\nOn Saturday, Ukraine commemorated the “great famine” that Soviet leader Josef Stalin imposed in the early 1930s, which led to millions of deaths.\n\n“We all know how and why millions of our people died, starved to death, and millions were never born. And we are once again defending ourselves against Russia, which has not changed and is once again bringing death,” Zelenskyy said in a post on Telegram marking Holodomor Memorial Day.\n\n“We defended, defend, and will always defend Ukraine. Because only here is our home. And in our home, Russia will definitely not be the master,” he added.\n\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.","url":"https://www.9news.com.au/world/ukraines-allies-push-back-on-a-us-peace-plan-seen-as-favoring-moscow/ff150687-56ba-4263-b523-bb9c89876264","image":"https://imageresizer.static9.net.au/H-iz1vyWidILO4X5KomZLR5mCpE=/0x281:5402x3319/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F0b1add54-7856-4e13-9013-43b8785eb9f6","video":null,"publish_date":"2025-11-22 21:30:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"au","sentiment":-0.212},{"id":381653602,"title":"CNN Host Grills MAGA Guest Over Trump Threats: 'It Is A Yes Or No Question!'","text":"CNN host Abby Phillip on Saturday demanded a “yes or no” answer from conservative activist Terry Schilling, who defended President Donald Trump, despite the president’s suggestion that Democratic veterans in Congress have engaged in sedition against the U.S. and endorsing a post calling for their execution.\n\n“Trump thinks that there is a problem of political violence in this country,” said Phillip during a “CNN Saturday Morning Table for Five” discussion with Schilling. “Why on Earth are comments like these acceptable to you?”\n\nSchilling said sedition is “a lawful process,” and that anyone accused of it has to be “tried and convicted” in court. He also said Trump is “not encouraging people” to commit political violence, despite his egregious social media spree to the contrary on Thursday.\n\nTrump decried “SEDITIOUS BEHAVIOR” coming from Democratic Sens. Elissa Slotkin (Mich.) and Mark Kelly (Ariz.), as well as Reps. Chris Deluzio (Pa.), Maggie Goodlander (N.H.), Chrissy Houlahan (Pa.) and Jason Crow (D-Colo.), and said it’s “punishable by DEATH!”\n\nThose Democrats, all of whom have backgrounds in the military or intelligence community, published a video on Tuesday reminding military members that they can “refuse illegal orders,” as “no one has to carry out orders that violate the law.”\n\nSchilling told Phillip on Saturday, “These people are fascists.”\n\nWhen Phillip asked Schilling if he actually believes that the lawmakers committed sedition, he replied, “I think it was terrible.”\n\nPhillip reiterated once again, “Do you think that’s sedition?”\n\n“Look, we’ve already seen Democrats weaponize the government,” said Schilling.\n\nPhillip, who had already confronted another MAGA guest about this subject on Thursday, asked Schilling again, “Terry, let me ask you a question. Do you think that Democrats, putting out a video saying, ’Follow the law, don’t follow illegal orders … is sedition?”\n\nHe responded with another question, “Why do you need to tell people to follow the laws?” and added that “everyone in the military knows we need to follow the law.”\n\n“It is a yes or no question!” Phillip exclaimed.\n\nSchilling, once again, responded with anything but those words, saying, “I think—” before Phillip cut him off.\n\n“Is it sedition to tell the people to follow the law?” Phillip asked. “I’m just saying you’re not willing to say ‘yes’ or ‘no,’ because it’s very obvious that the answer is no. Because if that were the case, then I think that … we would be executing people left, right and center.”\n\nSchilling — who heads the conservative political advocacy group American Principles Project — remained unwavering in his indirectness, instead complaning, “But they’re calling for the military to undermine the commander in chief.”","url":"https://www.huffpost.com/entry/cnn-abby-phillip-grills-terry-schilling-trump-threats-yes-or-no_n_6922020ae4b0d31c0a7aa99a?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/692220581700005275a9106f.jpeg?cache=6XNIl4LQsN&ops=1778_1000","video":null,"publish_date":"2025-11-22 21:29:13","author":"Marco Margaritoff","authors":["Marco Margaritoff"],"language":"en","category":"politics","source_country":"in","sentiment":-0.56},{"id":381650380,"title":"CNN Host Grills MAGA Guest Over Trump Threats: 'It Is A Yes Or No Question!'","text":"CNN host Abby Phillip on Saturday demanded a “yes or no” answer from conservative activist Terry Schilling, who defended President Donald Trump, despite the president’s suggestion that Democratic veterans in Congress have engaged in sedition against the U.S. and endorsing a post calling for their execution.\n\n“Trump thinks that there is a problem of political violence in this country,” said Phillip during a “CNN Saturday Morning Table for Five” discussion with Schilling. “Why on Earth are comments like these acceptable to you?”\n\nSchilling said sedition is “a lawful process,” and that anyone accused of it has to be “tried and convicted” in court. He also said Trump is “not encouraging people” to commit political violence, despite his egregious social media spree to the contrary on Thursday.\n\nTrump decried “SEDITIOUS BEHAVIOR” coming from Democratic Sens. Elissa Slotkin (Mich.) and Mark Kelly (Ariz.), as well as Reps. Chris Deluzio (Pa.), Maggie Goodlander (N.H.), Chrissy Houlahan (Pa.) and Jason Crow (D-Colo.), and said it’s “punishable by DEATH!”\n\nThose Democrats, all of whom have backgrounds in the military or intelligence community, published a video on Tuesday reminding military members that they can “refuse illegal orders,” as “no one has to carry out orders that violate the law.”\n\nSchilling told Phillip on Saturday, “These people are fascists.”\n\nWhen Phillip asked Schilling if he actually believes that the lawmakers committed sedition, he replied, “I think it was terrible.”\n\nPhillip reiterated once again, “Do you think that’s sedition?”\n\n“Look, we’ve already seen Democrats weaponize the government,” said Schilling.\n\nPhillip, who had already confronted another MAGA guest about this subject on Thursday, asked Schilling again, “Terry, let me ask you a question. Do you think that Democrats, putting out a video saying, ’Follow the law, don’t follow illegal orders … is sedition?”\n\nHe responded with another question, “Why do you need to tell people to follow the laws?” and added that “everyone in the military knows we need to follow the law.”\n\n“It is a yes or no question!” Phillip exclaimed.\n\nSchilling, once again, responded with anything but those words, saying, “I think—” before Phillip cut him off.\n\n“Is it sedition to tell the people to follow the law?” Phillip asked. “I’m just saying you’re not willing to say ‘yes’ or ‘no,’ because it’s very obvious that the answer is no. Because if that were the case, then I think that … we would be executing people left, right and center.”\n\nSchilling — who heads the conservative political advocacy group American Principles Project — remained unwavering in his indirectness, instead complaning, “But they’re calling for the military to undermine the commander in chief.”","url":"https://www.huffpost.com/entry/cnn-abby-phillip-grills-terry-schilling-trump-threats-yes-or-no_n_6922020ae4b0d31c0a7aa99a?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/692220581700005275a9106f.jpeg?cache=6XNIl4LQsN&ops=1778_1000","video":null,"publish_date":"2025-11-22 21:29:13","author":"Marco Margaritoff","authors":["Marco Margaritoff"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.56},{"id":381656482,"title":"Trump’s Ukraine gambit | 28-point peace plan - Premium","text":"“Ukraine may find itself facing a very difficult choice,” President Volodymyr Zelenskyy said on Friday. “Either loss of dignity, or the risk of losing a key partner,” he added, referring to the 28-point peace plan presented to Kyiv by the Trump administration. U.S. President Donald Trump, whose team drafted the proposal in consultation with Russian officials, says he expects a response from Ukraine by Thanksgiving (Nov. 26). Mr. Zelenskyy remains cautious, at least publicly, saying that he would continue to work “calmly” with the U.S.\n\nThe Trump plan addresses both Russia’s security concerns and Ukraine’s demand for security guarantees, but it also acknowledges the facts on the ground which favour Moscow. Russia now controls more than 20% of Ukraine’s pre-2014 territory. Besides Crimea, the Black Sea peninsula which Russia annexed through a referendum in February 2014, Moscow has annexed four more Ukrainian oblasts — Donetsk, Luhansk (which make up the Donbas region), Zaporizhzhia and Kherson. Of these four, Russia currently controls more than 80% of Donbas, and more than half of Zaporizhzhia and Kherson. Ukraine had recently agreed to freeze the war along the current frontline, but Russia always insisted that peace should come with a comprehensive agreement addressing “the root causes” of the conflict. Russia wanted recognition for the territories it has captured, sanctions to be removed and commitment from Ukraine and the West that Kyiv would not join the North Atlantic Treaty Organisation (NATO).\n\nAccording to Mr. Trump’s draft plan, which was leaked to the media, Crimea, Luhansk and Donetsk will be recognised “as de facto Russian”. , including by the U.S. Ukraine will have to withdraw troops from the part of Donetsk that it currently controls, which will then be used as a buffer between Russia and Ukraine. The line of contact in Kherson and Zaporizhzhia will be frozen—which means Russia will keep the territories of these two oblasts that it has captured. Russia will relinquish the territories it has seized other than the five oblasts (in Kharkiv and Ddnipropetrovsk). Ukraine will also have to limit the size of its armed forces to 600,000 personnel (according to some estimates, Ukraine now has some 900,000 active duty personnel).\n\nThe most contentious point besides territory was the role of NATO. As of now, Ukraine doesn’t have a pragmatic path towards NATO membership. The Trump administration has already stated, on a number of occasions, that Ukraine was unlikely to be a NATO member. But Ukraine has not officially given up its desire to join the trans-Atlantic security alliance. According to the Trump plan, however, Ukraine should enshrine in its Constitution that it will not join NATO, and the bloc should include in its statutes a provision that Ukraine will not be admitted in the future (but Ukraine can join the EU). “It is expected that Russia will not invade neighbouring countries and NATO will not expand further,” reads another point in the plan. Russia and NATO will also initiate dialogue, under the mediation of the U.S., to resolve “all security issues”.\n\nSecurity guarantees\n\nIf peace prevails, the U.S. promises to reintegrate Russia into the global economy. Sanctions on Russia could be lifted and the country could rejoin the G8 grouping (Russia was expelled from the grouping after the annexation of Crimea), and enter a long-term economic cooperation agreement with the U.S. Moscow will have to enshrine in law its policy of non-aggression towards Europe and Ukraine. “If Russia invades Ukraine, in addition to a decisive coordinated military response, all global sanctions will be reinstated, recognition of the new territory and all other benefits of this deal will be revoked,” reads the document.\n\nWhile the 28-point proposal says Ukraine will receive “reliable security guarantees”, it doesn’t offer details about the promise. But the Trump administration has circulated another draft agreement dealing only with the security part. The three-point plan, which needs the approval of Ukraine, Russia, the U.S., the EU and NATO, promises NATO-style security assurances to Ukraine for up to 10 years, which can be renewed by mutual agreement. A significant and sustained armed attack by Russia on Ukraine “shall be regarded as an attack threatening the peace and security of the transatlantic community,” reads the document. Countermeasures “may include armed force, intelligence and logistical assistance, economic and diplomatic actions, and other steps judged appropriate”.\n\nThe Kremlin has responded positively to the proposal. Mr. Trump says Ukraine “must accept” it as it offers a chance for peace. An agreement could quickly bring the war to an end and offer the much needed security guarantees for Ukraine against potential future conflicts. But for that, Kyiv will have to cede territories, recognise the Russian control of its eastern region and relinquish its bid for NATO. Is Mr. Zelenskyy ready for it yet?","url":"https://www.thehindu.com/news/international/trumps-ukraine-gambit-28-point-peace-plan/article70312222.ece","image":"https://th-i.thgim.com/public/news/national/tw14ty/article70312231.ece/alternates/LANDSCAPE_1200/GetImageContent.jpg","video":null,"publish_date":"2025-11-22 21:26:00","author":"Stanly Johny","authors":["Stanly Johny"],"language":"en","category":"politics","source_country":"in","sentiment":0.002},{"id":381652234,"title":"Trump now says he wants Marjorie Taylor Greene to RETURN to politics as their love-hate relationship takes new twist","text":"President Donald Trump revealed he would 'love' to see Rep. Marjorie Taylor Greene make a political comeback just hours after labeling her a 'traitor.' \n\nDuring a brief NBC News interview on Saturday, the president was asked about the Republican lawmaker's future after she abruptly announced she would resign from Congress in early 2026 following their public split. \n\nTrump admitted that 'it's not going to be easy for her' to claw her way back into politics, but said, 'I'd love to see it,' noting that for now, 'she's got to take some rest.' \n\nWhen pressed on whether the relationship between the once-inseparable pair could ever be mended, the commander in chief said: 'I can patch up differences with anyone.'\n\nJust yesterday, Greene released a 10-minute video in which she announced her impending departure from Congress - a decision that neither Trump nor House Speaker Mike Johnson knew about beforehand, according to NBC. \n\n'Everyone in the world found out at the same time,' a source close to Greene told the outlet.\n\nGreene used Friday's lengthy video to brand the president 'hateful' for revoking his endorsement, a move that quickly saw him fire back and label her a 'raging lunatic.' \n\nShe admitted that her mounting frustration with Washington's political establishment, along with her fight to release the so-called Epstein files, became central to the feud with her once-close ally. \n\nThe Georgia Representative raged against the 'political industrial complex' which she claimed uses Americans as 'pawns in an endless game of division.'\n\nShe said that it would be unfair for her 'sweet little district' to 'endure a hurtful and hateful primary against me by the President we all fought for' and even added that 'Republicans will likely lose the midterms.'\n\nShe went on to say that she has 'always been despised in Washington, DC, and just never fit in.'\n\nA source close to the lawmaker told NBC that Greene was confident she could win re-election if she chose to run.\n\nThe individual familiar with the matter said that it wasn't the possibility of a public battle that pushed Greene out of politics, but rather the string of death threats she and her children have endured in recent weeks.\n\nIn a post on X last week, Greene said that private security firms were reaching out to her with warnings for her own safety.\n\nShe wrote: 'A hot bed of threats against me are being fueled and egged on by the most powerful man in the world. The man I supported and helped get elected.'\n\n'Aggressive rhetoric attacking me has historically led to death threats and multiple convictions of men who were radicalized by the same type rhetoric being directed at me right now,' she added.\n\n'This time by the President of the United States. As a woman I take threats from men seriously. I now have a small understanding of the fear and pressure the women, who are victims of Jeffrey Epstein and his cabal, must feel.'\n\nGreene added that Trump's 'aggression' against her was fueling 'the venomous nature of his radical internet trolls,' claiming that many of them are actually paid.\n\nShe continued: 'The Political Industrial Complex and the toxic violent nature of American politics must end. Our country is worth saving and it can only be done if we pull together and save ourselves.'\n\nAt the end of Friday's bombshell video, Greene ultimately reiterated that her last day would be January 5, 2026 - two days after congressional pension becomes fully vested.\n\n'She very much looks forward to one day go out in public and not be harassed in restaurants and airports and be on the face of every TV channel,' the anonymous source told NBC.\n\n'It's safe to say she'll probably take a step back and be a private, normal person again,' the insider added.\n\nTrump's Saturday comment about 'loving' to see his ex–best friend return to politics marked a dramatic shift from hours earlier, when he had attacked the renegade Republican in a scathing Truth Social post after her resignation news.\n\nHe branded Greene a 'traitor' who only turned on him because he 'refused to return her never ending barrage of phone calls.' \n\nFloating a new nickname of 'Marjorie \"Traitor\" Brown', Trump said Greene's decision to leave Congress was because she faced 'PLUMMETING Poll Numbers.'\n\nThe president added that he believed Greene didn't want to compete for re-election against a 'Primary Challenger with a strong Trump Endorsement', claiming that 'she would have no chance of winning!' \n\n'For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD,' he wrote.\n\n'Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country! President DJT.'\n\nGreene also publicly broke with Trump earlier this year over the White House's bungled release of the 'Epstein files,' joining other rebel Republicans including Rep. Thomas Massie in crossing party lines.\n\nTrump cited Greene's partnership with Massie in his Truth Social post, branding him 'the WORST Republican Congressman in decades' and saying their relationship 'did not help her.'\n\nShortly after Greene's resignation video went live, the president called into ABC News to celebrate her decision to leave office.\n\n'I think it’s great news for the country,' Trump said in his brief phone call. 'It's great.'\n\nIn response to Trump's fiery comments, the private source told NBC: 'She was one of his biggest allies in Congress and she never really turned her back on him.'\n\n'She stood up for him when no one else in the House would,' they added. 'It was disappointing to her to see that, but she's not someone who, when she sees things she disagrees with, would turn a blind eye to that.'\n\nEven amid the icy feud, Greene’s supporters don’t appear to be swayed by the president. Many have applauded her for standing firm in defense of her beliefs.\n\n'She has a lot of courage and tells it like it is,' Debbie Dyer, 60, who works at a carpet company, told NBC News.\n\nFor months, Greene maintained that she was still a devoted Trump supporter, even after their dramatic falling out over the Epstein files. \n\nShe also expressed profound frustration with her own party's inability to get anything done despite controlling the presidency and both houses of Congress in 2025.\n\n'Almost one year into our majority, the legislature has been mostly sidelined, we endured an eight week shutdown wrongly resulting in the House not working for the entire time, and we are entering campaign season which means all courage leaves and only safe campaign re-election mode is turned on,' she said.","summary":"During an interview on Saturday, Trump was asked about the Republican lawmaker's future after she announced she would resign from Congress in early 2026 following their public split.","url":"https://www.dailymail.co.uk/news/article-15316849/Trump-wants-Marjorie-Taylor-Greene-RETURN-politics.html","image":"https://i.dailymail.co.uk/1s/2025/11/22/20/104109917-0-After_Greene_s_resignation_video_went_live_Trump_claimed_she_onl-a-76_1763844494575.jpg","video":null,"publish_date":"2025-11-22 21:25:26","author":"Editor,Kelly Garino","authors":["Editor","Kelly Garino"],"language":"en","source_country":"gb","sentiment":-0.153},{"id":381655146,"title":"Western leaders say US plan for Ukraine peace needs work","text":"European and other Western leaders said on Saturday a US peace plan was a basis for talks to end Russia’s war in Ukraine but needed “additional work”, part of Western efforts to eke out a better deal for Kyiv before a Thursday deadline.\n\nMeeting on the sidelines of a G20 summit, European and other Western leaders scrambled to come up with a coordinated response to US President Donald Trump’s demand for Ukraine to accept his 28-point peace plan with Russia by Thursday.\n\nThey agreed national security advisers from the E3 – France, Britain and Germany – would meet European Union, US and Ukrainian officials in Geneva on Sunday for further discussions. Italy would also send an official, diplomatic sources said.\n\nThe US plan, which endorses key Russian demands, was met with measured criticism in many European capitals, with leaders trying to balance praise for Trump for trying to end the fighting with recognition that some of the terms in his proposal are unpalatable for Kyiv.\n\n“The initial draft of the 28-point plan includes important elements that will be essential for a just and lasting peace,” said the leaders of the EU, Germany, France, Britain, Canada, the Netherlands, Spain, Finland, Italy, Japan and Norway.\n\n“We believe therefore that the draft is a basis which will require additional work,” they said in a statement.\n\nThe leaders met after President Volodymyr Zelenskiy said on Friday that Ukraine faced a choice of either losing its dignity and freedom or Washington’s backing over the plan. He appealed to Ukrainians for unity, promising never to betray Ukraine.\n\nThat signal prompted European leaders to rally.\n\nA German government source said they had met in a room in Johannesburg called “lion” and that the leaders had adopted the animal’s “spirit” in talks to agree a way to try to secure a better deal for Ukraine.\n\nGerman Chancellor Friedrich Merz underlined the importance to Europe of supporting Ukraine.\n\n“If Ukraine loses this war and possibly collapses, it will have an impact on European politics as a whole, on the entire European continent. And that is why we are so committed to this issue,” Merz said on the sidelines of the G20 summit.\n\n“There is currently an opportunity to end this war, but we are still quite a long way from a good outcome for everyone.”\n\nZelenskiy appealed to his country for unity.\n\n“Now, Ukraine can face a very difficult choice – either losing dignity or risk losing a major partner,” he said in a speech to the nation on Friday. “I will fight 24/7 to ensure that at least two points in the plan are not overlooked – the dignity and freedom of Ukrainians.”\n\nOn Saturday, he signalled that security guarantees were imperative for any deal to “ensure that nowhere in Europe or the world does the principle prevail that crimes against people and humanity, against states and nations, can be rewarded and forgiven”.\n\nOn the frontline, one Ukrainian soldier, 33-year-old Vitalii Traikalo, questioned why Ukraine should be forced to give up territory after three years of gruelling fighting to fend off Russian assaults.\n\n“Are we defending our borders here just to give them away? What’s the point of all this, of all these sacrifices?” he asked, while manning an artillery position near the eastern Ukrainian city of Pokrovsk.\n\nTRUMP GIVES UKRAINE A TIGHT DEADLINE\n\nOn Friday, Trump threw down the gauntlet to Ukraine, saying Zelenskiy had until Thursday to approve his 28-point plan, which calls on Ukraine to cede territory, accept limits on its military and renounce ambitions to join NATO.\n\n“He’ll have to like it, and if he doesn’t like it, then you know, they should just keep fighting, I guess,” he said. “At some point he’s going to have to accept something he hasn’t accepted.”\n\nRecalling their fractious February meeting with Zelenskiy, Trump added: “You remember right in the Oval Office, not so long ago, I said, ‘You don’t have the cards.'”\n\nIn their statement, Western leaders said they were “concerned by the proposed limitations on Ukraine’s armed forces, which would leave Ukraine vulnerable to future attack”.\n\n“We reiterate that the implementation of elements relating to the European Union and relating to NATO would need the consent of EU and NATO members respectively.”\n\nSunday’s meeting in Geneva now comes into focus, with European nations keen to suggest changes to Trump’s plan, which Russian President Vladimir Putin described as the basis of a resolution to the conflict.","url":"https://dailytimes.com.pk/1405475/western-leaders-say-us-plan-for-ukraine-peace-needs-work/","image":"https://dailytimes.com.pk/assets/uploads/2025/07/app-icon-192x192-1-192x180-1.png","video":null,"publish_date":"2025-11-22 21:25:25","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":0.083},{"id":381650692,"title":"Visa finds even $200B can’t resolve battle with merchants","text":"Nine years ago, the $5.7 billion sticker price to settle one of the biggest class-action lawsuits ever was rejected. Last year, it climbed to $30 billion, just to be thrown out again. Now, it’s north of $200 billion, and there’s growing doubt even that will be enough to end two decades of fighting.\n\nVisa and Mastercard this month took yet another swing at a deal that seeks to end a battle with thousands of retailers — and reshape the fees underpinning the credit-card industry in the process. Yet opposition is already pouring in from merchants and lawmakers.\n\nMaking the call will be U.S. District Court Judge Brian Cogan, who took over the long-running case after Judge Margo Brodie last year struck down the earlier settlement, saying that finance firms could afford to take a bigger hit.\n\nAt issue are the fees merchants must pay to accept credit cards from consumers, tiny individual amounts that add up to giant costs each year. Should the settlement survive, consumers will have to be on guard for retailers potentially denying premium cards.\n\n“Merchants across the nation oppose this settlement and did not agree to it,” said Doug Kantor, an executive committee member of the Merchants Payments Coalition, which opposes the fees on behalf of a group of retailers. “A similar bad deal was rejected by the courts just last year and merchants are looking to the court to reject this one too.”\n\nWalmart, the world’s largest retailer, indicated via a filing last week that it will likely take court action against the pact.\n\n“Among other things, Chief Judge Brodie previously denied preliminary approval to an earlier settlement proposed by injunctive relief class counsel and Defendants, in large part for reasons outlined in Walmart’s opposition to that proposed settlement,” the big-box retailer said.\n\nWalmart isn’t alone. Other big retailers, via their National Retail Federation trade group, said after the settlement was announced that the card industry “just doesn’t get it or just doesn’t care.” Another collection of merchant trade groups, including NRF, said in a filing last week that they first learned of the settlement when it was filed and are concerned the agreement may alter “the industry in harmful ways that cannot easily be undone.”\n\nThe National Restaurant Association also criticized the proposed settlement.\n\n“Restaurants epitomize small business — they have the lowest profit margin of any business on Main Street and have the least amount of negotiating power when it comes to an entrenched duopoly,” said Sean Kennedy, the group’s executive vice president for public affairs.\n\nVisa and Mastercard declined to comment on the latest opposition, but said at the time the latest settlement was announced that it would “provide meaningful relief” to retailers of all sizes along with “more flexibility and options to control how they accept payments from their customers.”\n\nSenator Dick Durbin, a Democrat from Illinois and longtime critic of Visa and Mastercard, attacked the latest settlement, accusing the firms and the banks they work with of “lining their pockets” with fees while Americans struggle financially. Durbin successfully capped the amount the firms and the banks can charge to accept debit cards in a provision added to the Dodd-Frank Act in the wake of the 2008 financial crisis.\n\n“Reducing the cost of swipe fees and allowing merchants more choice in which cards they accept should be welcome news,” he said in a statement Monday. “However, I believe this settlement falls short.”\n\nCogan, a former civil litigator and partner at Stroock & Stroock & Lavan LLP, is now the latest federal judge to preside over the suit, first filed in 2005. He took over the case in early September.\n\nOne previous high-profile case Cogan presided over was the 2019 trial of Joaquín “El Chapo” Guzmán, who was convicted of leading the deadly Sinaloa drug cartel. Cogan later sentenced Guzman to life in prison. The judge also oversaw the 2022 trial of Tom Barrack, who was acquitted of charges that he tried to influence the campaign and presidential administration of his longtime friend Donald Trump as an agent of the United Arab Emirates. Barrack later praised the judge, jury and U.S. legal system.\n\nAny hints from Cogan about whether he may accept the latest credit-card settlement are unlikely before the end of the year, with the deadline for objections set for Dec. 12.\n\nAny grievances from large retailers could again thwart the settlement process, said Justin Teresi, antitrust litigation and policy analyst at Bloomberg Intelligence.\n\n“Since this relief involves a mandatory class and there aren’t opt-out rights like in a monetary settlement, the court will likely be concerned with whether all merchants’ concerns are adequately addressed,” he said.","summary":"Visa and Mastercard took yet another swing at a deal that seeks to end a battle with thousands of retailers — and reshape the fees underpinning the credit-card industry in the process.","url":"https://www.bostonherald.com/2025/11/22/visa-finds-even-200b-cant-resolve-battle-with-merchants/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/BIZ-VISA-MASTERCARD-MERCHANTS-DMT.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-22 21:24:33","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"us","sentiment":-0.029},{"id":381650706,"title":"Senadores de EEUU califican plan de paz de Trump para Ucrania como una recompensa a la agresión","text":"Por ROB GILLIES\n\nHALIFAX, Canadá (AP) — Senadores de Estados Unidos que han criticado el enfoque del presidente Donald Trump para poner fin a la guerra entre Rusia y Ucrania aseguraron el sábado que el plan de paz que quiere que Kiev acepte sería como recompensar a Moscú por su agresión y enviaría un mensaje a otros gobiernos que han amenazado a sus vecinos.\n\nEl plan de 28 puntos fue elaborado por la Casa Blanca y el Kremlin sin la participación de Ucrania. Concede muchas de las demandas rusas que el presidente ucraniano Volodymyr Zelenskyy ha rechazado categóricamente en decenas de ocasiones, incluyendo ceder grandes porciones de territorio. Trump asegura que quiere que Kiev acepte el plan para finales de la próxima semana.\n\nLa oposición de los senadores al plan se produce después de que otros legisladores estadounidenses han expresado su rechazo, incluidos algunos republicanos, ninguno de los cuales tiene el poder para bloquearlo. Entre los senadores, que hablaron durante una conferencia internacional de seguridad en Canadá, están un demócrata, un independiente y un republicano que no planea buscar la reelección el próximo año.\n\n“Recompensa la agresión. Así de simple y claro. No hay justificación ética, legal, moral o política para que Rusia reclame el este de Ucrania”, señaló el senador independiente por Maine, Angus King, durante una discusión en el Foro Internacional de Seguridad de Halifax en Canadá.\n\nKing, miembro de la Comisión de Relaciones Exteriores del Senado, comparó la propuesta con el Pacto de Múnich del primer ministro británico Neville Chamberlain con Adolf Hitler en 1938, un histórico acto fallido de apaciguamiento.\n\nEl senador republicano Thom Tillis, por Carolina del Norte, afirmó que el senador Mitch McConnell, un exlíder del partido republicano en el Senado, no fue lo suficientemente crítico. McConnell señaló el viernes en un comunicado que “si los funcionarios del gobierno están más preocupados por apaciguar a (el presidente ruso Vladímir) Putin que por obtener una verdadera paz, entonces el presidente debería encontrar nuevos asesores”.\n\n“No deberíamos hacer nada que haga sentir (a Putin) que ha ganado. Sinceramente, creo que lo que dijo Mitch no fue suficiente”, expresó Tillis, quien a principios de año anunció que no buscaría la reelección, poco después de tener diferencias con el gobierno de Trump por su paquete de impuestos y gastos.\n\nLa senadora por Nueva Hampshire Jeanne Shaheen, la demócrata de mayor rango en la Comisión de Relaciones Exteriores del Senado, calificó el plan de “indignante”.\n\nPutin acogió la propuesta el viernes por la noche, diciendo que “podría formar la base de un acuerdo de paz final” si Estados Unidos obtiene la aprobación de Ucrania y sus aliados europeos.\n\nZelenskyy, en un discurso, no rechazó tajantemente el plan, pero insistió en un trato justo mientras se comprometía a “trabajar con calma” con Washington y otros socios en lo que llamó “en verdad uno de los momentos más difíciles de nuestra historia”.\n\nEn su 17º año, alrededor de 300 personas se reúnen anualmente en el Foro Internacional de Seguridad de Halifax. El foro atrae a oficiales militares, senadores de Estados Unidos, diplomáticos y académicos, pero este año la Casa Blanca suspendió la participación de funcionarios de Defensa en eventos de grupos de expertos, incluido el Foro Internacional de Seguridad de Halifax.\n\nUn gran número de senadores federales hizo el viaje este año, en parte debido a las tensas relaciones entre Canadá y Estados Unidos. Trump ha alienado a su vecino con una guerra comercial y su insistencia en que Canadá debería convertirse en el estado 51 de Estados Unidos. Muchos canadienses ahora se niegan a viajar a territorio estadounidense y estados fronterizos como Nueva Hampshire están registrando una drástica caída en el turismo.\n\n“Hay una preocupación real por esa tensión. Esa es una de las razones por las que hay una delegación tan grande aquí”, declaró Shaheen. “Continuaré objetando lo que el presidente está haciendo en términos de aranceles y sus comentarios porque no sólo son perjudiciales para Canadá y nuestra relación, sino que creo que son perjudiciales a nivel global. Muestran una falta de respeto por las naciones soberanas”.\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.","summary":"Por ROB GILLIES HALIFAX, Canad&#225; (AP) &#8212; Senadores de Estados Unidos que han criticado el enfoque del presidente Donald Trump para poner fin a la guerra entre Rusia y Ucrania aseguraron el s&#225;bado que el plan de paz que quiere que Kiev acepte ser&#237;a como recompensar a Mosc&#250; por su agresi&#243;n y enviar&#237;a un mensaje [&#8230;]","url":"https://www.bostonherald.com/2025/11/22/senadores-de-eeuu-califican-plan-de-paz-de-trump-para-ucrania-como-una-recompensa-a-la-agresin/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/UCRANIA-GUERRA-EEUU_97807.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-22 21:16:46","author":"Associated Press Spanish","authors":["Associated Press Spanish"],"language":"en","category":"politics","source_country":"us","sentiment":0.926},{"id":381651572,"title":"US senators slam Trump’s Russia-Ukraine peace plan as rewarding aggression","text":"HALIFAX, Nova Scotia -- U.S. senators critical of President Donald Trump’s approach to ending the Russia-Ukraine war said Saturday that the peace plan he is pushing Kyiv to accept would only reward Moscow for its aggression and send a message to other leaders who have threatened their neighbors.\n\nThe 28-point peace plan was crafted by the Trump administration and the Kremlin without Ukraine’s involvement. It acquiesces to many Russian demands that Ukrainian President Volodymyr Zelenskyy has categorically rejected on dozens of occasions, including giving up large pieces of territory. Trump says he wants Ukraine to accept the plan by late next week.\n\nThe senators' opposition to the plan follows criticism from other U.S. lawmakers, including some Republicans, none of whom have the power to block it. The senators, who spoke at an international security conference in Canada, included a Democrat, an Independent and a Republican who does not plan to seek reelection next year.\n\n“It rewards aggression. This is pure and simple. There’s no ethical, legal, moral, political justification for Russia claiming eastern Ukraine,” Independent Maine Sen. Angus King said during a panel discussion at the Halifax International Security Forum in Canada. \n\nKing, a member of the Senate Foreign Relations Committee, compared the proposal to British Prime Minister Neville Chamberlain’s Munich Pact with Adolf Hitler in 1938, a historic failed act of appeasement.\n\nRepublican Sen. Thom Tillis of North Carolina said Sen. Mitch McConnell, a former Republican Senate party leader, didn’t go far enough in his criticism of it. McConnell said in a statement Friday that “if Administration officials are more concerned with appeasing Putin than securing real peace, then the President ought to find new advisers.”\n\n“We should not do anything that makes (Putin) feel like he has a win here. Honestly, I think what Mitch said was short of what should be said,” said Tillis. Tillis announced earlier this year that he would not seek reelection shortly after he clashed with the Trump administration over its tax and spending package.\n\nDemocratic Sen. Jeanne Shaheen of New Hampshire, the ranking Member of the Senate Foreign Relations Committee, called it an “outrage.”\n\nPutin welcomed the proposal late Friday, saying it “could form the basis of a final peace settlement” if the U.S. can get Ukraine and its European allies to agree.\n\nZelenskyy, in an address, did not reject the plan outright, but insisted on fair treatment while pledging to “work calmly” with Washington and other partners in what he called “truly one of the most difficult moments in our history.”\n\nIn its 17th year, about 300 people gather annually at the Halifax International Security Forum held at Halifax’s Westin hotel. The forum attracts military officials, U.S. senators, diplomats and scholars but this year the Trump administration suspended participation of U.S. defense officials in events by think tanks, including the Halifax International Security Forum. \n\nA large number of U.S. senators made the trip this year in part because of strained relations between Canada and the U.S. Trump has alienated America’s neighbor with his trade war and insistence that Canada should become the 51st U.S. state. Many Canadians now refuse to travel to the U.S. and border states like Shaheen’s New Hampshire are seeing a dramatic drop in tourism.\n\n“There’s real concern about that strain. That’s one reason why there’s such a big delegation is here,” Shaheen said. “I will continue to object to what the president is doing in terms about tariffs and his comments because they are not only detrimental to Canada and our relationship, but I think they are detrimental globally. They show a lack of respect of sovereign nations.”\n\nThis version corrects to refer to Mitch McConnell as a former Republican Senate leader.","summary":"A group of American senators critical of President Donald Trump panned a U.S. peace proposal on Ukraine at an international security conference in Canada","url":"https://abcnews.go.com/International/wireStory/american-senators-rip-trumps-ukraine-peace-proposal-international-127785276","image":"https://i.abcnewsfe.com/a/b82be4be-a494-4e5e-aff5-45d1a8256bcc/wirestory_6041a181cbe0de6498e1043d9a982f4b_16x9.jpg?w=1600","video":null,"publish_date":"2025-11-22 21:12:37","author":"Rob Gillies Associated Press","authors":["Rob Gillies Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.284},{"id":381657182,"title":"Trump says Zelensky can agree to peace plan or ‘fight his little heart out’","text":"Accessibility statementSkip to main content\n\nDemocracy Dies in Darkness\nSubscribeSign in\n\nDemocracy Dies in Darkness\n\nWar in UkraineKursk IncursionCease-Fire EffortsU.S. ElectionRussian Airstrikes\n\nWar in UkraineKursk IncursionCease-Fire EffortsU.S. ElectionRussian Airstrikes\n\nTrump says Zelensky can agree to peace plan or ‘fight his little heart out’\nPresident Trump on Saturday heaped pressure on Volodymyr Zelensky, as he pushed Ukraine’s leaders to agree to a 28-point plan to help bring an end to the war.\n\nNovember 22, 2025 at 4:10 p.m. ESTToday at 4:10 p.m. EST\n\nPresident Donald Trump departs the White House South Lawn on Saturday. (Jose Luis Magana/AP)\n\nByTobi Raji\n\nPresident Donald Trump on Saturday heaped pressure on Ukrainian President Volodymyr Zelensky, saying he can either agree to the White House’s peace proposal by Thursday, or “continue to fight his little heart out.”\n\nGet concise answers to your questions. Try Ask The Post AI.\n\nWhat readers are saying\n\nThe comments overwhelmingly criticize President Trump's peace proposal for Ukraine, suggesting it heavily favors Moscow and is a capitulation to Russian interests. Many commenters express the belief that Trump is acting under the influence of Putin, with some suggesting that the... Show moreThis summary is AI-generated. AI can make mistakes and this summary is not a replacement for reading the comments.\n\nComments 299\n\nKyle SwensonA hulking home addition is dividing neighbors and stumping officials\n\nEarlier today\n\nEllen Nakashima, \nWarren Strobel and \nAlex HortonWhite House blew past legal concerns in deadly strikes on drug boats\n\nEarlier today\n\nSalvador RizzoJustice Dept. attacks judge after prosecutors’ stumbles in Comey case\n\nEarlier today\n\nNewsletterAs news breaks\nWorld News Alerts\nBreaking news email alerts for major happenings around the world.\n\nPaid Promoted Stories\n\nWindows Users Didn't Know This Simple Trick To Block All Ads (Do It Now)\nSafe Tech Tips\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\nWhat are the Benefits of a Family Trust in 2025?\nsmartasset.com\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\nIf You Have Brain Fog After 40, Read This Immediately\nhealth-headline.com\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\nThis AI \"Brain\" Called a 406% Stock Surge Before Anyone Else Noticed\nVantagePoint\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\nThis Lifelike Toy Dog Is Quickly Becoming a US Family Favourite – Only $34\nConsumer World\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\n56-Year-Old Replaced $21,500 Facelift With This $38 Drugstore Item\nThe Skincare Magazine\n\nAd is Hidden\n\nPlease tell us why you hid this ad?\n\nInappropriate\n\nMisinformation\n\nDistracting\n\nAbout The Post \nNewsroom Policies & Standards \nWP Creative Group \nDiversity & Inclusion \n\nMedia & Community Relations \nAccessibility Statement \n\nWell+Being \nD.C., Md., & Va. \nObituaries \n\nArts & Entertainment \n\nGet The Post\n\nWP Intelligence \nEnterprise Subscriptions \nManage Your Subscription \nBecome a Subscriber \nGift Subscriptions \nMobile & Apps \nNewsletters & Alerts \nWashington Post Live \nReprints & Permissions \nPost Store \nBooks & E-Books \nPrint Special Editions Store \nPrint Archives (Subscribers Only) \nToday’s Paper \nPublic Notices \n\nContact the Newsroom \nContact Customer Care \nContact the Opinions Team \n\nLicensing & Syndication \nRequest a Correction \nSend a News Tip \nReport a Vulnerability \n\nTerms of Use\n\nDigital Products Terms of Sale \nPrint Products Terms of Sale \nTerms of Service \nPrivacy Policy \nCookie Settings \nSubmissions & Discussion Policy \nRSS Terms of Service \n\nAd Choices \nwashingtonpost.com© 1996-2025 The Washington Post\n\nCompanyChevron Icon\n\nWP Intelligence \nAsk The Post AI \nWP Creative Group \nDiversity & Inclusion \n\nMedia & Community Relations \nAccessibility Statement \n\nSectionsChevron Icon\n\nWell+Being \nD.C., Md., & Va. \nObituaries \n\nArts & Entertainment \n\nGet The PostChevron Icon\n\nWP Intelligence \nEnterprise Subscriptions \nManage Your Subscription \nBecome a Subscriber \nGift Subscriptions \nMobile & Apps \nNewsletters & Alerts \nWashington Post Live \nReprints & Permissions \nPost Store \nBooks & E-Books \nPrint Special Editions Store \nPrint Archives (Subscribers Only) \nToday’s Paper \nPublic Notices \n\nContact UsChevron Icon\n\nContact the Newsroom \nContact Customer Care \nContact the Opinions Team \n\nLicensing & Syndication \nRequest a Correction \nSend a News Tip \nReport a Vulnerability \nDownload the Washington Post App \n\nAbout The Post \nPolicies & Standards \nDigital Products Terms of Sale \nPrint Products Terms of Sale \nTerms of Service \nPrivacy Policy \nCookie Settings \nSubmissions & Discussion Policy \nRSS Terms of Service \n\nAd Choices \n\nwashingtonpost.com \n© 1996-2025 The Washington Post\n\nAlready a subscriber? Sign in\nBLACK FRIDAY SALE\nBig news, great dealGet unlimited access to unmatched reporting \nfor just 99¢ every four weeks.\n\nUnlimited access on the web and in our apps\n24/7 live news updates\n\none-time payment\n\nevery four weeks\n\nfor the first yearMonthly billed as 99¢ every 4 weeks for first year. Cancel anytime.\n\nAdd your email address\n\nBy creating your account, you agree to The Washington Post's Terms of Service and Privacy Policy.\n\nCardView more offers","summary":"President Trump on Saturday heaped pressure on Volodymyr Zelensky, as he pushed Ukraine’s leaders to agree to a 28-point plan to help bring an end to the war.","url":"https://www.washingtonpost.com/world/2025/11/22/trump-zelensky-russia-plan/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QJZHA4WISEKXK4EHEEQINMZD5E_size-normalized.jpg&w=1600&h=900","video":null,"publish_date":"2025-11-22 21:10:44","author":"Tobi Raji","authors":["Tobi Raji"],"language":"en","category":"politics","source_country":"us","sentiment":-0.347},{"id":381655454,"title":"Andrew should give 'relevant information' to Epstein inquiry, Starmer says","text":"Sir Keir Starmer has urged Andrew Mountbatten-Windsor to testify to the US Congress over his links to the late paedophile financier Jeffrey Epstein.\n\nLast week, the former prince missed a deadline to respond to an official summons from US officials to appear before the House Oversight Committee, which is looking into how investigations into Epstein were handled.\n\nOn 6 November, the committee asked Mountbatten-Windsor to sit for a “transcribed interview” over his “long-standing friendship” with Epstein, who killed himself in 2019. \n\nDemocrat Suhas Subramanyam, who sits on the committee, said Andrew “has been hiding from us, and I think he will continue to try to hide from people doing meaningful investigations of this matter”.\n\nAsked whether the royal should appear before Congress, the Prime Minister told reporters travelling with him to the G-20 summit in Johannesburg that, “in the end that will be a decision for him.”\n\nBut he also piled pressure on the former Duke of York, adding: “But my general position is If you have relevant information, you should be prepared to share it.”\n\n“As a general principle I’ve held for a very long time is that anybody who has got relevant information in relation to these kind of cases should give that evidence to those that need it,” Starmer added.\n\nAlthough the US committee is powerful, it does not have the authority to force testimony from individuals who are not US citizens and reside abroad. Mountbatten-Windsor is under no legal requirement to cooperate.\n\nBut Starmer’s intervention will reignite the row about whether Mountbatten-Windsor should face further interrogation over his links to Epstein.\n\nIn 2022, the former prince made an out-of-court settlement with Virginia Giuffre – an Epstein survivor who had accused him of sexual assault and rape – without admitting any wrongdoing.\n\nGiuffre died by suicide earlier this year. Mountbatten-Windsor, who was stripped of his prince and Duke of York titles earlier this month, has always maintained that the allegations are false.\n\nEarlier this week, Donald Trump signed a bill to release the remaining Epstein files. A cache of evidence accumulated during two investigations into Epstein will be made public within 30 days, with some exemptions.","url":"https://inews.co.uk/news/andrew-should-give-relevant-information-to-epstein-inquiry-starmer-says-4060761","image":"https://inews.co.uk/wp-content/uploads/2025/11/SEI_272500001.jpg?crop=0px%2C0px%2C1200px%2C677px&resize=1200%2C675","video":null,"publish_date":"2025-11-22 21:08:48","author":"Kitty Donaldson","authors":["Kitty Donaldson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.242},{"id":381647814,"title":"Marjorie Taylor Greene | Faith against mountain - Premium","text":"Donald J. Trump has thrived on attacks from his opponents, who have called him a racist, an anti-Semite, a misogynist, anti-Muslim, and someone who ruined America’s global reputation by abandoning its military alliances and questioning wars. These charges fired up crowds that rallied behind him under the banner of Make America Great Again (MAGA). But now he is being attacked for betraying the very causes he championed for MAGA. Being accused of promoting global wars and protecting the vested interests of U.S. corporations is new for Mr. Trump, and these are issues that bond Left-leaning Democrats and Right-leaning Republicans.\n\nMarjorie Taylor Greene, Representative from Georgia, has emerged as a central figure in U.S. politics more for whom she opposes — Mr. Trump — than for what she stands for. She has always stood by Mr. Trump from the early days of MAGA, and for the causes that defined that populist revolt. A decade on, she now opposes Mr. Trump and accuses him of betraying the trust of his voters. It was Mr. Trump’s efforts to prevent transparency in the investigation of dead sex trafficker Jeffrey Epstein that led him into head-on conflict with the loyalist. \n\nMs Greene stood her ground and insisted on the release of the Epstein files that link the trafficker to leading figures in American public life. Mr. Trump was forced to eat humble pie and agree to the demand for transparency. Along the way, he called Ms. Greene a “traitor”, a “lightweight”, and “whacky”. The split between the leader and the loyalist was completed on November 21, when she announced she would be quitting the House of Representatives and would not be contesting the 2026 election. \n\nThe MAGA split is wide open. She said she expected a primary challenger supported by the President, and did not want to fight it out. “I refuse to be a ‘battered wife’ hoping it all goes away and gets better,” she said. Mr. Trump said it was “good news for the country.” Ms. Greene has framed her confrontation with Mr. Trump as a populist revolt — a revolt against, and beyond, a failed revolt that she now seeks to pin on her former leader. “If I am cast aside by MAGA Inc and replaced by Neocons, Big Pharma, Big Tech, the Military Industrial War Complex, foreign leaders, and the elite donor class that can’t even relate to real Americans, then many common Americans have been cast aside and replaced as well,” she said while announcing her resignation.\n\n‘Genocide in Gaza’\n\nPro-Israel segments in the Republican and Democratic parties call her an anti-Semite for her opposition to American support for Israel, but Ms. Greene’s positions have found support from members of both parties. She has questioned Mr. Trump’s claim that inflation is under control and has been vocal in her criticism of colleagues in both parties for skyrocketing health insurance costs. She was the first Republican to term the Israeli war on Gaza a “genocide”. In July 2025, Ms. Greene said that while the October 7 attack by Hamas in Israel was horrific, so too was the “genocide, humanitarian crisis, and starvation happening in Gaza”. She has urged the U.S. to stop funding Israel’s military campaign, arguing that “we no longer have to fund and fight nuclear-armed secular Israel’s wars, especially when it leads to starving children and killing innocent people”.\n\nShe has been a supporter of gun rights, and even suggested a 2017 mass shooting in Las Vegas was a conspiracy to bring in gun control. In 2018, she reportedly suggested that the September 11, 2001 terror strikes were orchestrated by the deep state; and in 2019 suggested that Ilhan Omar and Rashida Tlaib, Muslim women members of Congress, were not officially members because they used Quran rather than Bible in their swearing-in ceremonies.\n\nMs. Greene says all her politics and public service are guided by her Christian faith, but her advocacy for the American working class is what makes her acceptable to many people. Josh McKoon of the Georgia GOP described her as “a tireless fighter for America First principles”; Thomas Massie (R-KY) said she “embodies what a true representative should be”; House Minority Leader, Democrat Hakeem Jeffries, complimented her for “enlightened weeks” in recent times. Jamie Raskin, another Democratic Representative, said his party should have space for her. Democrat Ro Khanna, speaking of his agreement with her, said: “she is genuinely moved by the Epstein survivors, believes in AI regulation, and is anti-war.” He also previewed what may be brewing. “I’ll tell you this. She has more populist instincts than (Vice President) J.D. Vance.” \n\nShe has left that open. “When the common American people finally realise that The People possess the real power over Washington, then I’ll be here by their side to rebuild it.”","url":"https://www.thehindu.com/news/international/marjorie-taylor-greene-faith-against-mountain/article70312226.ece","image":"https://th-i.thgim.com/public/news/national/8i4llb/article70312234.ece/alternates/LANDSCAPE_1200/GetImageContent.jpg","video":null,"publish_date":"2025-11-22 21:08:00","author":"Varghese K. George","authors":["Varghese K. George"],"language":"en","source_country":"in","sentiment":-0.27},{"id":381650972,"title":"Trump says Ukraine peace plan isn't his 'final offer'","text":"President Donald Trump on Saturday said that his administration’s peace proposal for Ukraine and Russia is “not my final offer,” telling reporters after a question from NBC News, “One way or the other, we have to get it ended.” Trump added that if Ukrainian President Volodymyr Zelenskyy doesn’t agree to the peace plan, “then he can continue to fight his little heart out.” Earlier this week, Trump said that he wants Zelenskyy — who has hesitations about the proposal — to accept the peace plan by Thanksgiving. Key points of the proposal include allowing Russia to keep more Ukrainian territory than it currently holds, forcing Ukraine to limit the size of its army and agreeing that Ukraine will never join NATO. Ukrainian lawmakers have criticized the plan as conceding too much to Russia’s demands, though the Trump administration has said that the plan, which has 28 points, was drafted with input from both sides of the conflict. “Ukraine may now face a very difficult choice, either losing its dignity or the risk of losing a key partner, either the difficult 28 points, or a very difficult winter,” Zelenskyy said in a video about the plan earlier this week. Several U.S. lawmakers, including in Trump’s own party, have also expressed concerns about the plan. “While there are many good ideas in the proposed Russia-Ukraine peace plan, there are several areas that are very problematic and can be made better. The goal of any peace deal is to end the war honorably and justly — and not create new conflict,” Sen. Lindsey Graham, R-S.C., wrote in a post on X Saturday morning. Later, the South Carolina senator posted that he was confident Trump would garner a peace deal by pushing both countries and would ensure Ukraine remains free and able to defend itself from future aggression. Sen. Roger Wicker, R-Miss., wrote in his own X post on Friday that “this so-called ‘peace plan’ has real problems, and I am highly skeptical it will achieve peace.” He added, “Ukraine should not be forced to give up its lands to one of the world’s most flagrant war criminals in Vladimir Putin. The size and disposition of Ukraine’s armed forces is a sovereign choice for its government and people. And any assurances provided to Putin should not reward his malign behavior or undermine the security of the United States or allies.” The proposal includes a security guarantee with a commitment that U.S. and European allies to Ukraine would treat any future attack on Ukraine as an attack on the broader trans-Atlantic community, a U.S. official told NBC News, with few additional details about what the commitment would entail. Ukrainian leaders aren’t the only ones voicing concerns about the plan. On the sidelines of the G20 summit in South Africa, European leaders have said the proposal, if agreed to, could “leave Ukraine vulnerable to future attack.” That was a key point in a statement signed by the leaders of Britain, France, Germany, Italy, Finland, Ireland, the Netherlands, Spain and Norway. Secretary of State Marco Rubio and special envoy Steve Witkoff will travel to Geneva on Sunday to meet with a Ukrainian delegation to move peace talks forward with an eye to ending the war in Ukraine, according to two U.S. officials. A separate meeting with a Russian delegation in another location in coming days is under consideration, according to those officials. Rubio and Witkoff will join Army Secretary Dan Driscoll, who arrived earlier Saturday along with the top U.S. diplomat to Ukraine, Ambassador Julie Davis. Driscoll this past week traveled to Kyiv to meet with Zelenskyy. “Secretary Driscoll and team just landed in Geneva to work on the next steps toward achieving peace in Ukraine,” a U.S. official said. Zelenskyy confirmed the details of the meeting in a post on X, saying he’d spoken to U.K. Prime Minister Keir Starmer on Saturday. “Tomorrow, our advisers will work in Switzerland — representatives from Ukraine, the United States, and the E3 format, namely the UK, France, and Germany. The vast majority of European leaders are ready to assist and get involved. Consultations are ongoing at various levels, and the efforts of everyone who seeks a genuine and lasting peace matter,” Zelenskyy wrote. Trump made quickly ending the ongoing war in Ukraine a key promise of his 2024 campaign. So far this year, he’s met with Zelenskyy multiple times and hosted Russian President Vladimir Putin for a summit in Alaska. Russian leaders, including Putin, have praised the peace proposal, with Putin saying that if Ukraine doesn’t sign the agreement, Russia would end the war “through military means, through armed struggle.”","url":"https://www.nbcnews.com/politics/trump-administration/trump-ukraine-peace-plan-isnt-final-offer-russia-rcna245340","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-10/251017-donald-trump-volodymyr-zelensky-ew-148p-d83457.jpg","video":null,"publish_date":"2025-11-22 21:06:45","author":"Alexandra Marquez,Gordon Lubold,Julie Tsirkin,Megan Shannon","authors":["Alexandra Marquez","Gordon Lubold","Julie Tsirkin","Megan Shannon"],"language":"en","category":"politics","source_country":"us","sentiment":0.059},{"id":381648144,"title":"Russia ready to work with US as part of Washington’s G20 presidency — chief delegate","text":"JOHANNESBURG, November 22. /TASS/. Russia is ready to work with the United States as part of Washington’s upcoming presidency in the Group of Twenty (G20), Deputy Chief of Staff of the Presidential Executive Office Maxim Oreshkin, who heads the Russian delegation to the summit in Johannesburg, said.\n\n\"We will work with the US as part of their presidency in G20,\" he said, answering to a question from TASS. \"Russia has always worked actively in the G20 format, regardless of who holds the presidency. First of all, we are trying to make our contribution into the positive agenda of development. Today, I said that moving forward, removing barriers, reforming institutions, amending the development model and reducing economic risks are the areas where we are ready to work actively.\"\n\nSpeaking about the summit’s work, Oreshkin said that its agenda, discussions and documents reflect Russia’s interests.\n\n\"The G20 is a very important platform, where numerous problems are being discussed,\" he said.\n\nThe United States will assume the group’s rotating presidency on December 1. US President Donald Trump announced that the next G20 summit will be held in Florida in 2026.","summary":"Speaking about the summit’s work, Maxim Oreshkin emphasized that its agenda, discussions and documents reflect Russia’s interests","url":"https://tass.com/politics/2047401","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-11-22 21:02:42","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.058},{"id":381653436,"title":"Bill Maher hits back at Larry David's 'dumb' NYT op-ed criticizing his dinner with Trump","text":"Bill Maher is firing back against fellow liberal comedian Larry David. The HBO host slammed David's April op-ed in The New York Times titled \"My Dinner with Adolf,\" calling it \"dumb\" and \"unhelpful.\" The \"Seinfeld\" co-creator's op-ed satirized Maher's cordial dinner with President Donald Trump in March, depicting a fictional dinner between himself and Adolf Hitler in 1939 and reflecting that \"if only the world could see this side of him, people might have a completely different opinion.\" While discussing what he saw as some of the more \"nuts\" aspects of both the Democratic and Republican parties, Maher noted that while he'll \"never stop pointing out\" what he finds wrong about the Trump administration, it's illogical to completely cut certain people out of the conversation. MAHER CALLS OUT KIMMEL FOR NOT THANKING HIM FOR SUPPORT AMID SUSPENSION, ACCUSES KIMMEL OF LIBERAL BIAS \"But I'm an adult and in the real world, there's some people you just can't stop talking to, like your spouse or partner after a bad fight. Tempting as that is. Like your d--k of a boss, like your family, and like the President of the United States. This is so childish, so purely emotional,\" he said. Maher continued, moving his focus to those who criticized him for meeting with Trump, adding, \"The people who got all butthurt because I had dinner with [Trump], you know, because he's Hitler. Except he's not. So unhelpful and dumb.\" As he spoke, a graphic appeared on-screen showing the Times op-ed headline: \"Larry David: My Dinner With Adolf.\" The \"Real Time\" host argued that Trump has been \"the most supportive president Israel and the Jews ever had,\" before escalating his criticism of David personally. \"You know, every year I used to ask Larry David to do ‘Real Time,’ and he'd always say, 'Bill, I can't. I'm not smart enough about politics to do your show.' Yeah, I get that now,\" he quipped. \"Because there is no argument here. There's just the sugar rush that the no contact people get from never coming in second in an ‘I hate Trump the most contest.’\" BILL MAHER ADMITS MORE 'PERSPECTIVE' ON GEORGE W BUSH DURING INTERVIEW WITH COUSIN BILLY, WANTS HIM ON PODCAST Wrapping up his criticisms of David, Maher questioned whether the left's strategy was to \"go full high school\" and \"tell the guy with all the power he can't sit with you at the lunch table.\" This was not the first time Maher addressed David's \"My Dinner with Adolf\" op-ed. In April, Maher appeared on \"Piers Morgan Uncensored,\" where he was asked about David's satirical piece roasting his positive exchange with Trump. \"This wasn't, you know, my favorite moment of our friendship,\" Maher said of David. \"But I think the minute you play the Hitler card, you've lost the argument,\" Maher told host Piers Morgan. \"And also, I must say, you know, come on, man. Hitler? Nazis? Nobody has been harder about and on and more prescient, I must say, about Donald Trump than me. I don't need to be lectured on who Donald Trump is. Just the fact that I met him in person didn't change that, and the fact that I reported honestly is not a sin either.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Maher continued, \"To use the Hitler thing, first of all, I just think it's kind of insulting to six-million dead Jews, you know. Like, that should kind of be in its own place in history. And, you know, I know people can say, 'Well, we're just comparing it in this way.' Well, it's an argument you kind of lost just to start it.\" \"Hitler has really kind of got to stay in his own place. He is the GOAT of evil, and we're just going to have to, I think, leave it like that,\" he added. A representative for David did not immediately respond to Fox News Digital's request for comment. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fox News' Joseph A. Wulfsohn and Lindsay Kornick contributed to this report.","summary":"On Friday&apos;s episode of &quot;Real Time,&quot; host Bill Maher slammed comedian Larry David&apos;s &quot;dumb&quot; New York Times op-ed from earlier this year, titled &quot;My Dinner with Adolf.&quot;","url":"https://www.foxnews.com/media/bill-maher-hits-back-larry-davids-dumb-nyt-op-ed-criticizing-his-dinner-trump","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/bill-maher-larry-david-real-time.jpg","video":null,"publish_date":"2025-11-22 21:02:00","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.146},{"id":381656180,"title":"ABC Considering Marjorie Taylor Greene for 'The View' in Stunning Fallout to Her Sensational Resignation From Congress","text":"Marjorie Taylor Greene's recent appearance on ABC's The View has triggered intense internal discussion at the network, after executives and staffers were caught off guard by what they describe as a remarkably disciplined on-air performance, RadarOnline.com can report.\n\nAccording to multiple insiders, Greene's demeanor challenged long-held assumptions about how the controversial former congresswoman would fare in front of a daytime television audience.MTG on 'The View'According to Rob Shuter on his substack, ShuterScoop, one senior producer said the moment landed with surprising force inside the control room: \"She was steady and surprisingly controlled. None of us expected that.\"\n\nAnother daytime executive reportedly echoed the sentiment, noting that real-time audience reaction shifted expectations across the network: \"When the audience didn't boo, that changed the entire conversation about her.\"\n\nBehind the scenes, some ABC insiders now believe Greene may have used the appearance to test whether she could transition into television. One staffer described the segment as unusually strategic: \"It felt like she came in with a plan. It was the closest thing to an audition we've ever seen from her.\" However, the same insiders caution that Greene's ambitions may lie elsewhere. \n\nA high-level source said, \"She's looking at 2028. That ambition is real.\" At present, ABC executives are reviewing the segment, but no formal discussions about a role have begun. One insider summed up the mood: \"She surprised everyone, and that alone changes things.\"Greene Resigns from CongressHer appearance also deepened tensions with President Donald Trump, who had once been her closest political ally. After Greene repeatedly clashed with congressional Republicans during Trump's first year back in office, their relationship began to sour. \n\nTrump publicly rebuked her decision to go on ABC program, posting on Truth Social: \"She has gone Far Left, even doing The View.\"\n\nDays later, Greene announced she would resign from Congress at the end of her term. \"I'm going back to the people I love, to live life to the fullest as I always have, and look forward to a new path ahead,\" she wrote on X. \"I will be resigning from office with my last day being Jan. 5, 2026.\"Greene's Political JourneyGreene's path to national prominence began north of Atlanta, where she grew up as the heiress to her family's construction company. \n\nAfter graduating from South Forsyth High School and the University of Georgia, she married Perry Greene in 1995. The couple helped run the family business and raised three children before she became a local fitness figure, opening the gym CrossFit Passion in 2013. \n\nBefore entering politics, Greene worked as a blogger on American Truth Seekers, a site widely characterized as a conspiracy outlet, publishing headlines such as \"MUST READ – Democratic Party Involved With Child Sex, Satanism, and The Occult.\" \n\nShe launched her political career during Trump's 2019 reelection campaign, ultimately winning Georgia's 14th District after former Rep. Tom Graves retired.","summary":"Marjorie Taylor Greene's recent appearance on ABC's 'The View' has triggered intense internal discussion at the network.","url":"https://radaronline.com/p/abc-considering-marjorie-taylor-greene-view-resignation-congress/","image":"https://media.radaronline.com/brand-img/gsAszMFpn/0x0/abc-considering-major-taylor-greene-view-resignation-congress-1763834671368.jpg","video":null,"publish_date":"2025-11-22 21:00:00","author":"Joshua Wilburn","authors":["Joshua Wilburn"],"language":"en","category":"politics","source_country":"us","sentiment":0.016},{"id":381648132,"title":"Amid GOP grumbling, White House makes course corrections","text":"“The closer you get to the election cycle, the more cognizant you are about how certain policy decisions are at odds with your constituency,” Sen. Thom Tillis (R-N.C.) said Thursday.\n\nTillis, who is not seeking reelection, has been critical of the administration’s proposal to use tariff revenue to send Americans’ stimulus checks, a move, he’s argued, that would exacerbate inflation and run counter to the president’s original plan of using the additional dollars to pay down the national debt.\n\nAnd several Republicans, including Trump’s close ally Sen. Lindsey Graham (R-S.C.), and prominent and typically supportive allies like former House Speaker Newt Gingrich have voiced concerns about the president’s 28-point plan to end the war in Ukraine, warning that allowing Russia to dictate the terms of a peace deal, drawn up without input from NATO allies or Ukraine, is a mistake.\n\nGraham, in a post on X, said he had “no knowledge” of a new proposal but warned that a just outcome to the war “can only be achieved with negotiations involving both parties - particularly Ukraine, the victim of Russia’s aggression - along with our European allies.”\n\nFormer Senate Republican Leader Mitch McConnell of Kentucky, certainly no close ally of the president, went further: “Putin has spent the entire year trying to play President Trump for a fool,” he said. “Rewarding Russian butchery would be disastrous to America’s interests. And a capitulation like Biden’s abandonment of Afghanistan would be catastrophic to a legacy of peace through strength.”\n\nThe simmering intra-party disagreements were notable enough that Vice President JD Vance was asked to weigh in Thursday during a live interview with Breitbart’s Matthew Boyle.\n\n“We have to remember that we have a lot more in common than we do not in common,” Vance said. “The disagreements that animate the Republican Party, while they matter and are important ... My attitude is, let these debates play out, but don’t let the debates that you’re — that we’re having internally blind us to the fact that we are up against a radical leftist movement.”\n\nStill, Vance made a noticeable outreach to people who feel as though cost of living is unaffordable — and voted for Democrats in this month’s off-year elections because of it.\n\n“Look, we get it and we hear you and we know there’s a lot of work to do,” he said, before casting blame on his and Trump’s predecessors. “There’s a lot with the job because the Biden administration put us in such a very very tough spot.”\n\nTrump, said former longtime GOP House aide Brendan Buck, “is still the dominant figure in the party, and the person who every single one of them needs if they want to advance any type of legislative agenda, win a primary, or have a long term future in the party. I don’t think anybody is going to be running away from him at all.”\n\nGreene underscored that point on Friday when she announced her resignation from the House. After splitting with Trump on the release of the Epstein files, the president severed ties with Greene a week ago.\n\nThat’s not to say, of course, that some Republicans don’t harbor concerns about how the president’s policies could impact their electoral fortunes.\n\n“At some point, the longer the economy is a weight on [Trump], the aura of invincibility could dim a little bit,” said Buck. “You have to really have your head in the sand to not be worried about the midterms at this point. Everybody understands the historical trend, the economic environment, the energy on the Democratic side, and the ballot without Trump on it are all deeply in Democrats’ favor — and their hopes largely rest on Donald Trump’s popularity. So in that way, they have every incentive to try to help him.”","url":"https://www.politico.com/news/2025/11/22/trump-gop-affordability-epstein-mtg-00665988","image":"https://www.politico.com/dims4/default/c31e2c5/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F5a%2Fe5%2Fdaf6b3f54cc6a69ce6f105c4e252%2Ftrump-86866.jpg","video":null,"publish_date":"2025-11-22 21:00:00","author":"Alex Gangitano,Diana Nerozzi,Eli Stokols","authors":["Alex Gangitano","Diana Nerozzi","Eli Stokols"],"language":"en","category":"politics","source_country":"us","sentiment":-0.204},{"id":381652462,"title":"S.Africa G20 declaration highlights: minerals, debt, climate","text":"Leaders from the G20 group of top economies endorsed Saturday a declaration at a summit in South Africa that highlights issues related to access to critical minerals and measures to cope with climate change.\n\nSouth Africa chose \"Solidarity, Equality, Sustainability\" as the theme of its presidency of the G20, which comprises 19 countries and two regional bodies, the European Union and the African Union and accounts for 85 percent of global GDP.\n\nHere are some highlights from the declaration from the first G20 summit on the African continent which was boycotted by the United States.\n\n Critical minerals \n\nLeaders said they would seek to protect the global value chain of critical minerals from \"disruption\", whether due to geopolitical tensions, unilateral trade measures inconsistent with World Trade Organization (WTO) rules, pandemics, or natural disasters.\n\nMany countries are intensifying efforts to secure access to these minerals, which are abundant in African and essential to the transition to green energy, used in electronics from phones to solar panels and electric cars.\n\nChina's dominance of critical mineral supply chains has emerged as growing area of concern for the world's industrialised democracies.\n\nThe declaration also supported \"increased exploration of critical minerals, particularly in developing countries\" for which they said the resource should be a driver of development and value-addition \"rather than just raw material exports\".\n\n Just, lasting peace \n\nThe declaration addressed major global conflicts underway by calling for a \"just, comprehensive, and lasting peace\" in Ukraine, Sudan, the Democratic Republic of Congo and the \"Occupied Palestinian Territory\" on the basis of the UN Charter.\n\nIt called on countries to \"refrain from the threat or use of force ... against the territorial integrity and sovereignty or political independence of any state\".\n\nWhile Ukraine was only mentioned once in the 30-page document, Western leaders attending the summit also scrambled on the sidelines to respond to a unilateral plan pushed by US President Donald Trump to end the war in Ukraine on terms favouring Russia.\n\n Inequality \n\nSouth Africa placed the fight against inequality as one its main G20 priorities, with President Cyril Ramaphosa commissioning an expert report on the problem and supporting a call to establish an international panel on wealth disparities.\n\nWhile the declaration did not specifically mention the report's recommendation, it underlined the \"imperative\" to address \"disparities in wealth and development both within and between countries\".\n\nThe leaders also called for efforts to reform international financial systems to help low-income countries cope with their debt, which was hindering development and eating into investments into infrastructure, disaster resilience, healthcare and education.\n\nThey called for more transparency from lenders, including in the private sector, and backed a review of the International Monetary Fund as well as work to establish global minimum taxes.\n\nThe declaration's language on taxation of the super-rich was less robust than in the previous G20 declaration in Rio de Janeiro where leaders agreed to ensure the world's billionaires \"are effectively taxed\".\n\nEndorsed on the same day that the COP30 UN climate talks concluded in Brazil, the declaration recognised the need to \"rapidly and substantially\" scale up climate finance \"from billions to trillions globally from all sources\".\n\nIt highlighted inequalities in access to energy, particularly in Africa, and called for increasing, de-risking and diversifying investments for sustainable energy transitions.\n\nThe leaders said they would promote the development of early warning systems for people at risk of climate-linked disasters, recognising that some of those most impacted were from least developed countries.\n\nThe text, however, fell short of mentioning a phaseout from fossil fuels.","url":"https://www.modernghana.com/news/1450588/safrica-g20-declaration-highlights-minerals.html","image":"https://cdn.modernghana.com/images/content/afp_south_africas_g20_summit_endorsed_a_declaration_the_touched_.jpg","video":null,"publish_date":"2025-11-22 20:57:00","author":"Julie Bourdin - Afp","authors":["Julie Bourdin - Afp"],"language":"en","source_country":"gh","sentiment":0.194},{"id":381652452,"title":"Gunmen seize 315 pupils and teachers in latest Nigerian mass school kidnapping","text":"Gunmen have kidnapped more than 300 schoochildren and teachers in one of the largest mass kidnappings in Nigeria, a Christian group said Saturday. No group has yet claimed responsibility for what is the second abduction in a week in Africa's most populous nation.\n\nA total of 303 schoolchildren and 12 teachers were abducted by gunmen during Friday morning's raid on St Mary's co-education school in Nigeria's Niger State, in the central western part of the country.\n\nThe attack came after gunmen on Monday stormed a secondary school in neighbouring Kebbi state, abducting 25 girls.\n\nThe students from St Mary's, which has a total student population of 629, were both male and female and ranged in age from 10 to 18. \n\nLocal police said they have deployed a team to rescue them.\n\nResidents described scenes of panic as families searched for their missing children.\n\nThe Christian Association of Nigeria (CAN) had earlier reported 227 people had been abducted, but the figure was changed \"after a verification exercise and a final census was carried out\", according to a statement issued by the Most Reverend Bulus Dauwa Yohanna, chairman of the Niger State chapter of CAN, and who visited the school on Friday.\n\nThe revised number surpasses the 276 abducted during the Chibok mass abduction of 2014. \n\nSchools shut\n\nNiger State governor Mohammed Umar Bago, whose government had ordered some schools shut, also ordered the closure of all schools in his state, a day after authorities in the nearby states of Katsina and Plateau shuttered all theirs as a precautionary measure.\n\nThe national education ministry has also ordered 47 boarding secondary schools across the country be shut.\n\nPresident Bola Tinubu has cancelled international engagements, including attending the G20 summit in Johannesburg, to handle the crisis. He has yet to comment publicly.\n\nThe attack comes just days after armed men on Monday stormed a secondary school in the Kebbi State, northwestern Nigeria, which is majority Muslim. Of the 25 schoolgirls abducted, one girl has escaped but the other 24 are still missing.\n\nThe two kidnapping operations and an attack on a church in the west of the country, in which two people were killed, have happened since US President Donald Trump threatened military action over what he called targeted killings of Nigerian Christians by radical Islamists in Nigeria.\n\nNigeria's government says Trump's claims that Christians face persecution in Nigeria are a misrepresentation of the country's complex security challenges and that Muslims are the majority of victims of attacks by armed groups.\n\nNo group has claimed the latest attacks but bandit gangs seeking ransom payments often target schools in rural areas where security is weak.\n\nThe Kebbi school attack was the 12th mass abduction of schoolchildren in Nigeria that has led to the kidnapping of over 1,600 students in 12 different incidents, lawyer and security analyst Bulama Bukarti told Nigeria's Channels Television.\n\nThe latest attack brings the total to 13.The country is still scarred by the kidnapping of nearly 300 girls by Boko Haram jihadists at Chibok in northeastern Borno state. Some of those girls are still missing. \n\n(with newswires)","url":"https://www.modernghana.com/news/1450562/gunmen-seize-315-pupils-and-teachers-in-latest.html","image":"https://cdn.modernghana.com/images/content/1122202543607-wbreuihtto-000-84tp9n6.jpg","video":null,"publish_date":"2025-11-22 20:57:00","author":null,"language":"en","source_country":"gh","sentiment":-0.033},{"id":381652564,"title":"Donald Trump’s New Bill Doesn't Classify Nursing as a ‘Professional’ Degree for College Students, Sparking Outrage","text":"Nursing is no longer considered a “professional” degree under the Trump administration. The change, along with the elimination of a longstanding loan program for graduate and professional students, has sparked outrage from several nursing organizations.\n\n As part of the U.S. Department of Education’s new federal student loan-related changes under President Donald Trump’s “One Big Beautiful Bill Act,\" nursing has been excluded from the group of programs that are considered “professional” degrees, and a loan program for graduate students has been marked for elimination.\n\n The changes have created new fears about how students, and particularly students seeking post-baccalaureate nursing degrees, will finance their education — and several organizations have already voiced their disapproval and concern at the updates.\n\n In early November, the department made several alterations that impact federal student loans, according to a news release from the U.S. Department of Education. “In total, negotiators reviewed and agreed to 17 regulatory provisions,\" per the release, including a \"new and simplified\" Repayment Assistance Plan and \"the definition of a professional student.\"\n\n The department also shared plans to eliminate Grad PLUS loans, which help graduate and professional students pay for education-related expenses not covered by other financial aid, and cap Parent PLUS Loans, which are specifically given to parents of undergraduate students. In the release, the department explained the decision to end the Grad PLUS program, which was first introduced in 2006, by stating that it \"has fueled unsustainable student loan borrowing.\"\n\n The Department of Education has also changed the definition of “professional” degrees. The umbrella will no longer include nursing post-bacc programs, which means those seeking the degree will have to follow new borrowing limits, according to USA Today and Wisconsin Public Radio (WPR). (The changes will go into effect next summer.)\n\n “Beginning in July 2026, the OBBBA caps annual loans for new borrowers at $20,500 for graduate students ($100,000 aggregate limit), and $50,000 for professional students ($200,000 aggregate limit) – a term the committee defined consistent with existing regulatory text,” the Department of Education said in the news release. “Previously, graduate students could borrow up to the cost of attendance, which led institutions to offer expensive graduate programs with a negative return on investment.”\n\n The umbrella of “professional” degrees redefined under the newly instated changes stems from a 1965 federal law, per USA Today. According to the outlet, the decades-old legislation defines a \"professional degree\" as one that \"signifies both completion of the academic requirements for beginning practice in a given profession and a level of professional skill beyond that normally required for a bachelor's degree.\" \n\n Though it clarifies that the list is not exhaustive, the 1965 law also lists several examples, including pharmacy, dentistry, veterinary medicine, chiropractic and law, per USA Today. \n\n With nursing — and degrees required to become a physician assistant, nurse practitioner and physical therapy, per WPR — now excluded from this definition, and Grad PLUS loans eliminated altogether, students seeking careers in these fields will see drastic changes to the amount of federal loans they can borrow.\n\n Reacting to the news, Jennifer Mensik Kennedy, president of the American Nurses Association, spoke with NewsNation about how the changes will affect the already “looming nursing shortage” in the U.S.\n\n “I don’t know why we would take this away,” Kennedy told the outlet. “So we have a looming nursing shortage even greater than before. So this is going to stop nurses from going to school to be teachers for other nurses.”\n\n The American Association of Colleges of Nursing (AACN) has also released a statement about the changes and urged Education Secretary Linda McMahon and Under Secretary of Education Nicholas Kent to reconsider adding nursing under the umbrella of professional degrees in a letter.\n\n “AACN is deeply concerned by the Department of Education’s decision to move forward with a proposed definition of professional degree programs that excludes nursing and significantly limits student loan access,” the organization wrote in a statement. “Should this proposal be finalized, the impact on our already-challenged nursing workforce would be devastating.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.\n\n After backlash to the changes made headlines, Ellen Keast, the Department of Education’s press secretary for higher education, called reporting on the situation “fake news” in a statement shared with Newsweek.\n\n \"This is fake news at its finest. The Department has had a consistent definition of what constitutes a professional degree for decades and the consensus-based language aligns with this historical precedent,” Keast said. “The committee, which included institutions of higher education, agreed on the definition that we will put forward in a proposed rule. We’re not surprised that some institutions are crying wolf over regulations that never existed because their unlimited tuition ride on the taxpayer dime is over.”","summary":"“I don’t know why we would take this away,” said the president of one of several organizations to speak out about the change","url":"https://people.com/nursing-is-not-a-professional-degree-under-president-donald-trumps-new-bill-11855209","image":"https://people.com/thmb/eDXdFSuaxvTLJpUpZq9qUMoOKok=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x351:781x353)/Donald-Trump-Oval-Office-112225-628a71774f2646dc8009c35c12c67318.jpg","video":null,"publish_date":"2025-11-22 20:56:20","author":"Bailey Richards","authors":["Bailey Richards"],"language":"en","category":"politics","source_country":"US","sentiment":0.013},{"id":381652250,"title":"FBI Insists Donald Trump's Would-Be Assassin Acted Alone","text":"Donald Trump assassination conspiracy theorists may not believe it, but Thomas Matthew Crooks worked alone when he tried to kill the prez -- this according to the FBI.\n\nFox News conducted an interview with FBI Director Kash Patel, FBI Deputy Director Dan Bongino, and an unnamed senior involved in the Butler shooting investigation ... and the three told the outlet the assassination wasn't part of a great cover-up.\n\nBognino told Fox, \"We have reviewed this case over and over -- looked into every nugget. We have spoken to the families, the president -- there is no cover-up here. There is no motive for it, there is no reason for it.\"\n\nDirector Patel said President Trump has been thoroughly briefed on the investigation as well ... and he is \"satisfied with the results and where we left it.\"\n\nPatel and Bongino also dove into the details of the investigation ... which accessed \"foreign\" email accounts from Germany and Belgium days after the account to see if he had any connection with bad actors overseas.\n\nThe anonymous official told Fox there is no foreign connection to the case ... and there was \"no individual that is outside U.S. borders or inside U.S. borders that had any role in directing him, inspiring him, or assisting him in any way.\"\n\nThe FBI conducted more than 1,000 interviews, looked into 2,000 public tips, executed 10 search warrants and issued 100 subpoenas, according to the officials. And, they say 485 FBI employees worked on the case in total.\n\nAs you know ... Crooks was shot to death by snipers shortly after firing multiple shots at a Trump rally in July 2024 -- months before DJT was elected as president for the second time. He clipped the president in the ear with a bullet and shot three others, including 50-year-old Corey Comperatore, who died.\n\nThe shooting has become a conservative talking point over the past year ... with many commentators -- and even Trump's son Eric -- popping off about how the American public seemingly knows nothing about Crooks or his motivations.\n\nPatel and Bongino say there's no more to know about Thomas Matthew Crooks ... though we doubt it'll stop people online from speculating.","summary":"Donald Trump assassination conspiracy theorists may not believe it, but Thomas Matthew Crooks worked alone when he tried to kill the prez -- this according to the FBI. Fox News conducted an interview with FBI Director Kash Patel, FBI Deputy&hellip;","url":"https://www.tmz.com/2025/11/22/fbi-claims-trump-would-be-assassin-worked-solo/","image":"https://imagez.tmz.com/image/b9/4by3/2025/11/22/b961db10b09d45a8bd5c64e69d5ea2e5_xl.jpg","video":null,"publish_date":"2025-11-22 20:55:29","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.362},{"id":381597496,"title":"Tracks &#038; Records conducting damage assessment following fire at MoBay location","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe damaged Tracks and Records restaurant in Montego Bay, St James after a fire on Saturday, November 22, 2025. \n\n Latest News, News \n\nNovember 22, 2025\n\n\n\n\n Tracks & Records conducting damage assessment following fire at MoBay location \n\n\n\n\n\n\n\nKINGSTON, Jamaica — The management of Usain Bolt’s Tracks & Records restaurant says it is now conducting a comprehensive damage assessment at its Montego Bay location following an early morning fire on Saturday.\n\nThe company, in a media release, said the site has been without electricity since the passage of Hurricane Melissa and has been using generator power to support World Central Kitchen, which has been utilising its facilities to prepare meals daily for storm-affected communities.\n\n“At approximately 1:47 am, members of the meal-preparation team arrived on-site and discovered the fire. The Jamaica Fire Brigade (JFB) was contacted immediately. Upon their arrival, the upper level of the building was already engulfed, but the fire has since been fully contained,” the company said.\n\nThe restaurant had not yet reopened to the public.\n\nTracks & Records said the JFB continues its formal investigation into the cause of the incident.\n\n“Our focus at this time is on ensuring safety, stabilising operations where feasible, particularly in support of World Central Kitchen’s meal-preparation efforts, and continuing to contribute to the wider recovery efforts across the country,” the company added.\n\nREAD: Tracks and Records damaged by fire in Montego Bay\n\n\n\n\n\n\n\n\nTags: Fire Monetgo Bay Tracks & Records \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Irish fashion designer Paul Costelloe dies aged 80 \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n LONDON, United Kingdom (AFP)—Irish-American fashion titan Paul Costelloe, who was the late Princess Diana's personal designer for over a decade, has d... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley lauds efforts of security forces and policymakers as murders fall 42% \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n KINGSTON, Jamaica — The current 42 per cent decline in murders this year, when compared to 2024, has drawn commendation from State Minister in the Off... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n US revokes visa of NGO official critical of US presence in Caribbean \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n PORT OF SPAIN, Trinidad (CMC) — The Trinidad and Tobago Government has sought to distance itself from a decision taken by the United States (US) to re... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Tracks and Records damaged by fire in Montego Bay \n\n\n\n\n\n\n\nNovember 22, 2025 \n\n\n ST JAMES, Jamaica — The building which houses the popular Tracks and Records restaurant on Jimmy Cliff Boulevard in Montego Bay was damaged by fire Sa... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n NWC says reports of sewage overflow near Coronation Market are incorrect \n\n\n\n\n\n\n\nNovember 21, 2025 \n\n\n KINGSTON, Jamaica — The National Water Commission (NWC) is refuting recent media claims of sewage overflows in the vicinity of Coronation Market, stat... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man fatally shot during police confrontation in St Thomas \n\n\n\n\n\n\n\nNovember 21, 2025 \n\n\n ST THOMAS, Jamaica — A man was fatally shot during an alleged confrontation with the police early Friday morning in the Gutter Head district of St Th... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Fake AI Trump audio clip on ‘Epstein files’ gains traction \n\n\n\n\n\n\n\nNovember 21, 2025 \n\n\n WASHINGTON, United States (AFP) — Left-leaning social media users have amplified an AI-generated audio clip purporting to show President Donald Trump ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/22/tracks-records-conducting-damage-assessment-following-fire-mobay-location/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/tracks-and-records-fire-nov22.jpeg","video":null,"publish_date":"2025-11-22 20:54:18","author":null,"language":"en","source_country":"jm","sentiment":0.005},{"id":381647830,"title":"Are nurses 'professionals'? The government's answer impacts students.","text":"Backlash and confusion have swirled after the Department of Education under President Donald Trump left nursing and other professions off a list of \"professional\" degrees in a proposed rule over loans, which could impact how students finance their education in the future.\n\nThe news involves a loose list of graduate-level career paths that could qualify for bigger federal student loans. This list of \"professional\" programs has a newfound importance as the administration winds down a program that allowed careers off the list to qualify for larger loans.\n\nLeaving nursing off the list has been perceived by some as a slight against a vital field. Besides nurses, other degree programs not explicitly included on the select list of \"professional\" degrees could see lower loan caps than before.\n\nJust about 20% of the nation's nursing workforce has a master's- or doctorate-level degree, according to the American Association of Colleges of Nursing.\n\nWho is considered a professional student? The list includes programs like pharmacy, dentistry, medicine, veterinary medicine and law, among others. The list may not be all-inclusive, but advocates and professional organizations sounded the alarm that it leaves off many important programs.\n\nPreviously, graduate students could borrow up to the cost of attendance, the department said.\n\nMore: Next generation of nurses at risk with proposed student loan caps\n\nHere's what it could mean for future students:\n\nHow much will graduate-level nursing students be able to get in federal loans?\n\nThe new limits for graduate programs would be $20,500 per year and $100,000 in total. The limits for professional degrees would be $50,000 annually and capped at $200,000.\n\nThe proposal eliminates the Grad PLUS loan program, which has historically helped students pursue careers in medicine, law and other training-intensive careers. The Department of Education said Grad PLUS \"has fueled unsustainable student loan borrowing.\" It also places caps on the Parent PLUS program, limiting them to $20,000 per year per student, with a $65,000 total limit.\n\nThis means students in programs not defined as a \"professional\" degree could face a lower loan cap when pursuing those programs.\n\nWhen will the new loan rules go into effect?\n\nThe proposed rule impacts future student loan borrowing, the Department of Education said.\n\nThe loan changes – and overall adjustments to higher education finances and funding – are slated to take effect on July 1, 2026.\n\nWhat other degrees are impacted?\n\nBesides nurses, other degree programs not explicitly included on the select list of \"professional\" degrees could see lower loan caps than before. The National Association of Independent Colleges and Universities noted, though, that some of these professions could still meet the regulatory requirements to be considered \"professional\" despite not being listed as examples.\n\nThey include speech-language pathology, physical therapy, physician's assistants and a slew of others.\n\nNurses, advocates express frustration with change\n\nNurses and advocates across the country have called for the decision to be reconsidered.\n\n\"Nurses make up the largest segment of the healthcare workforce and the backbone of our nation’s health system,” said Jennifer Mensik Kennedy, president of the American Nurses Association. “At a time when healthcare in our country faces a historic nurse shortage and rising demands, limiting nurses’ access to funding for graduate education threatens the very foundation of patient care.\"\n\nContributing: Zachary Schermele and Kate Perez, USA TODAY","url":"https://eu.usatoday.com/story/news/nation/2025/11/22/professional-degrees-could-impact-nursing-students/87417161007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/11/22/USAT/87417910007-nurse.jpg?auto=webp&crop=8191,4609,x0,y427&format=pjpg&width=1200","video":null,"publish_date":"2025-11-22 20:53:39","author":"Usa Today","authors":["Usa Today"],"language":"en","category":"politics","source_country":"us","sentiment":-0.151},{"id":381650980,"title":"Indian-origin Congressman flags possible 'tampering' in Epstein files, writes to FBI's Kash Patel: 'Trump using...'","text":"Indian American Congressman Suhas Subramanyam has written to FBI Director Kash Patel, urging the bureau to ensure the security of released Jeffrey Epstein files and investigate potential political interference or tampering. Subramanyam is a member of the House Oversight Committee. He, along with many other Democrats, is concerned about President Trump’s influence in handling the documents.'Tampering, destroying, or selectively releasing files'In the letter, Subramanyam wrote, “The American people understandably have concerns about the President using his political influence over the files’ release and either tampering, destroying, or selectively releasing and withholding files, particularly in light of the Department of Justice’s announcement to start investigating Democrats who were associated with Epstein.”The Congressman’s request follows “concerning anecdotal reports” suggesting possible tampering, including claims that an acting deputy chief at the Department of Justice indicated all Republican names were being redacted, according to New India Abroad. He also cited statements by Epstein’s brother, Mark Epstein on NewsNation alleging that Trump administration officials were “scrubbing the files to take Republican names out” and that the Justice Department’s shift in approach was linked to sabotage of the original files.“These reports do nothing to inspire confidence of a complete release of all of the Epstein files, no matter the political affiliation of the people named,” Subramanyam wrote, adding that victims and their families “deserve full justice and accountability.”Subramanyam asked the FBI to clarify by the weekend that who will be responsible for redacting and approving changes to the files, whether Attorney General Bondi had physical possession of the documents earlier this year, and what security measures are in place at the FBI’s Central Records Complex. He also requested an in-person visit to Winchester or any other facility where relevant files are stored. Additionally, he enquired whether any Epstein-related records have been accessed, altered, or tampered with since January 20, the day Trump assumed office for his second term.The Congressman spoke last week after the House passed the bill mandating the Department of Justice to release all unclassified Epstein-related documents within 30 days. The legislation passed the Senate by unanimous consent and was signed into law by President Donald Trump on November 19. The Justice Department has said it will comply “with maximum transparency.\"Previous statementSubramanyam also discussed the need for accountability and transparency in a statement last week after voting for the release of Epstein files. “I just voted YES to release the Epstein files to the public, but we didn’t need this vote. The Oversight Committee subpoenaed these files months ago, and the President could have just released them. While we already have the files released by the Epstein Estate, the FBI and DOJ are sitting on tens of thousands more.\"“The brave survivors, and the American people, deserve the truth. For too long, powerful and rich people have evaded accountability for their association with Jeffrey Epstein. As a member of the House Oversight Committee, I will continue to work with my colleagues to conduct a full, thorough investigation, and finally hold those who committed heinous crimes against girls accountable.”","url":"https://timesofindia.indiatimes.com/world/us/indian-origin-congressman-flags-possible-tampering-in-epstein-files-writes-to-fbis-kash-patel-trump-using-/articleshow/125511654.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-125511654/125511654.jpg","video":null,"publish_date":"2025-11-22 20:52:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.43},{"id":381652600,"title":"Ukraine, US head for talks on Trump&#8217;s plan to end war","text":"Ukrainian and US envoys will meet in Switzerland on Sunday along with European security chiefs to discuss Washington’s plan for ending the war with Russia, officials said, after Kyiv pushed back on proposals seen as favourable to Moscow.\n\nRead Also: ‘I’m really angry over killings in Nigeria’ – Trump\n\nUS President Donald Trump has given Ukraine until November 27 to approve the plan to end the nearly four-year conflict, but Kyiv is seeking changes to a draft that accepts some of Moscow’s hardline demands.\n\nTrump’s 28-point plan would require the invaded country to cede territory, cut its army, and pledge never to join NATO. He told reporters on Saturday it was not his final offer and he hoped to stop the fighting “one way or the other”.\n\nUkraine’s European allies, who were not included in drafting the agreement, said the plan requires “additional work” as they scrambled at the G20 summit in South Africa to come up with a counter-offer to strengthen Kyiv’s positions.\n\nA US official told AFP that US Secretary of State Marco Rubio and diplomatic envoy Steve Witkoff were scheduled to arrive in Geneva on Sunday for the talks, and that US Army Secretary Daniel Driscoll had already arrived there after meeting with Zelensky in Kyiv.\n\n“We will have an informal pre-meeting tonight for dinner” with Ukrainian delegates, the US official said on Saturday.\n\nZelensky’s decree said the negotiations would include “representatives of the Russian Federation” but there was no immediate confirmation from Russia whether it would join the talks.\n\nRussian ‘representatives’ expected\n\nUkraine’s President Volodymyr Zelensky said “consultations will take place with partners regarding the steps needed to end the war,” after issuing a decree naming Ukraine’s delegation for the talks, led by his top aide Andriy Yermak.\n\n“Our representatives know how to defend Ukraine’s national interests and what is necessary to prevent Russia from launching a third invasion”, having annexed Crimea in 2014 and mounted a full-scale offensive in 2022, he said.\n\nBritain’s Prime Minister Keir Starmer said the senior officials would meet in Geneva “to take things further forward”, stressing the importance of solid “security guarantees” for Ukraine under any settlement.\n\n“The focus very much now is on Geneva tomorrow and whether we can make progress tomorrow morning,” he told the media on the sidelines of the G20 summit in Johannesburg.\n\nStarmer said his national security adviser Jonathan Powell would be in Geneva on Sunday. Italian diplomatic sources said their country was sending the prime minister’s national security advisor Fabrizio Saggio.\n\nSecurity officials from the EU, France and Germany will also attend, French President Emmanuel Macron told a news conference at the G20.\n\nWest says plan needs more ‘work’ \n\nWestern leaders at the G20 summit said Saturday that the US plan was “a basis which will require additional work”.\n\n“We are clear on the principle that borders must not be changed by force. We are also concerned by the proposed limitations on Ukraine’s armed forces, which would leave Ukraine vulnerable to future attack,” the leaders of key European countries as well as Canada and Japan said in a joint statement.\n\nMacron said the plan contained points that had to be more broadly discussed as they concerned European allies, such as Ukraine’s NATO ties and Russian frozen assets held in the EU.\n\n“We all want peace and we are agreed. We want the peace to be strong and lasting,” he said, insisting a settlement must “take into account the security of all Europeans”.\n\nThe European delegates in Geneva would aim “to put substance into the discussions and to reconcile all viewpoints”, he said.\n\nZelensky said Friday in an address to the nation that Ukraine faces one of the most challenging moments in its history, adding that he would propose “alternatives” to Trump’s proposal.\n\n“The pressure on Ukraine is one of the hardest. Ukraine may face a very difficult choice: either the loss of dignity or the risk of losing a key partner,” Zelensky said, referring to a possible break with Washington.\n\nRussian President Vladimir Putin said the blueprint could “lay the foundation” for a final peace settlement, but threatened more land seizures if Ukraine walked away from negotiations.","url":"https://www.vanguardngr.com/2025/11/ukraine-us-head-for-talks-on-trumps-plan-to-end-war/","image":"https://cdn.vanguardngr.com/wp-content/uploads/2025/10/AFP__20251018__798T363__v1__MidRes__UsUkraineRussiaDiplomacyConflictWar.jpg","video":null,"publish_date":"2025-11-22 20:47:39","author":"Oboh","authors":["Oboh"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.312},{"id":381646726,"title":"Ukraine war: European leaders seek to alter Trump's peace plan amid threats to cut US support","text":"WorldEuropeRussia-Ukraine war\n\nLondon | European leaders have united in a desperate last-ditch bid to convince US President Donald Trump to water down his peace plan skewed towards Russia and secure less harsh terms for Ukraine.While Trump has imposed a deadline of Thursday for Ukraine to accept the deal or risk losing US military and intelligence support, the President said on Saturday that it was not his final offer.Loading...Andrew Tillett is The Australian Financial Review’s correspondent for Europe, based in London. He was formerly foreign affairs and defence correspondent based in Canberra. Connect with Andrew on Facebook and Twitter. Email Andrew at andrew.tillett@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreRussia-Ukraine warTrump's White HousePutin's RussiaKeir StarmerEmmanuel MacronVolodymyr Zelensky\n\nFetching latest articlesThis lawyer has collected more than 600 broochesHannah TattersallPrices for this under-the-radar watch brand are surgingWhy your mascara and skincare should be in a time capsuleAustralia’s 50 highest-paid CEOs in 2025 revealedPatrick DurkinWhy more company directors need to speak outWhy this CEO insists on 2 referee checks, and often does them herselfAn MJ Bale shorts-suit and a new IWC watch to ring in summerEugenie KellyWhy Mount Gambier’s rock-star grapes are worth travelling forForget the typical Euro hustle – Bordeaux is a place to pauseInside Australia’s most expensive country estateGreg BearupThe moment that led to a $750m coal fortune and a Ferrari obsessionLaundys sell pub on NSW’s Central Coast for $18.5 million","url":"https://www.afr.com/world/europe/europe-s-rearguard-battle-to-save-ukraine-from-trump-s-peace-plan-20251123-p5nhmp","image":"https://static.ffx.io/images/$zoom_1.0342%2C$multiply_1%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_13/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/3093798f7e4c8c2f030aea0a0d9ee77f5deaa4b5154231faa25f798328e268c2","video":null,"publish_date":"2025-11-22 20:47:06","author":"Andrew Tillett","authors":["Andrew Tillett"],"language":"en","category":"politics","source_country":"au","sentiment":0.244}]}