{"offset":0,"number":50,"available":5469,"news":[{"id":253539566,"title":"With Walz beside her, Harris says strengthened middle class to be 'defining goal'","text":"Aug. 6 (UPI) -- Appearing with her vice presidential running mate for the first time in the campaign, Vice President Kamala Harris addressed her first political rally as the official Democratic Party nominee for president Tuesday at Temple University in Philadelphia. \"Delegates to the Democratic Party national convention finished voting last night,\" Harris told the receptive audience. \"I am now officially the Democratic Party nominee for president of the United States.\" The enthusiastic crowd cheered loudly upon learning of Harris's new status as the party's nominee as her newly announced running mate, Minnesota Gov. Tim Walz, stood at her side. Later during the event, he blasted former President Donald Trump, saying the GOP nominee for president \"sows chaos and division.\" Before Walz spoke for the first time as Harris' Democratic vice president running mate, though, the current vice president laid out the stakes ahead for her campaign for the White House. \"Now, we have some work to do,\" Harris said. \"We are the underdogs in this race, but we have the momentum and I know exactly what we are up against.\" In what has become a common refrain on her recent campaign stops, Harris referenced her prior positions as a prosecutor, district attorney and attorney general for California and the types of criminals she prosecuted. \"I know Donald Trump's type,\" she said to loud applause. Harris said her campaign is a \"fight for the future\" and said she will work to ensure affordable housing, affordable health care, affordable child care and paid leave. \"Strengthening the middle class will be my defining goal,\" Harris announced. \"Ours is a fight for the middle class and a fight for freedom.\" She promised to \"bring down prices that are still too high and lower the cost of living for America's families. Freedoms and the threat of Trump When it comes to the aspect of freedom in her campaign, Harris said, they include the \"freedom to vote, be safe from gun violence, love who you love openly and with pride, and the freedom of a woman to make decisions for her own body and not have a government tell her what to do.\" \"If Donald Trump gets a chance, he will end the Affordable Care Act and take us back to a time when insurance companies could deny coverage for people with pre-existing conditions,\" she said. \"Gov. Walz and I will not let that happen.\" \"Health care should be a right and not just a privilege for those who can afford it,\" she said. If Democrats win majorities in the House and Senate, Harris said she will make sure Congress passes a bill to restore reproductive freedom and sign it into law. She said Congress also would pass the John Lewis Voting Rights Act and the Freedom to Vote Act, expand background checks for firearms purchases and increase penalties for illegal gun sales. Harris also promised to ban military-style rifles commonly referred to as \"assault weapons.\" Harris introduces her new running mate She then spent much of her remaining time introducing Walz, whom she announced as her running mate earlier in the day and likened to the \"varsity team\" and referred to Trump's running mate Sen. JD Vance of Ohio as the \"JV squad.\" \"We each face a question,\" Harris told the crowd. \"What kind of country do we want to live in?\" The options are a \"country of freedom, compassion and the rule of law or a country of chaos, fear and hate,\" she said. \"We each have the power to answer that question,\" Harris said. \"The power is with the people.\" \"We are running on behalf of all Americans and when elected will govern on behalf of all Americans,\" she said. Harris then turned the mic over to Walz, who told the audience about how he was raised on a family farm in a small town in Nebraska, joined the National Guard and attended college on the GI Bill. He recounted his years as a teacher and assistant football coach and his \"commitment for the common good.\" Walz said Trump \"doesn't know the first thing about service\" because he's \"too busy serving himself\" and \"sows chaos and division.\" \"He froze in the face of the COVID crisis,\" Walz said of Trump, and said Republicans want the government to be free to \"invade your doctor's office.\" Walz said he \"can't wait\" to debate Vance and claimed Trump and Vance are \"creepy\" and \"weird as hell.\" Trump and Vance have a \"dangerous and backward\" vision for the nation, Walz said. \"We aren't going back!\" The crowd then chanted \"We're not going back\" several times, which has become a campaign slogan for Harris and Walz.","summary":"Appearing with her vice presidential running mate for the first time in the campaign, Vice President Kamala Harris addressed her first rally as the official Democratic Party nominee for president Tuesday in Philadelphia.","url":"https://www.upi.com/Top_News/US/2024/08/06/harris-walz-pennsylvania-rally-first-time-together/6181722987846/","image":"https://cdnph.upi.com/ph/st/th/6181722987846/2024/upi/2fde1cacebaeb51d1c29107637062ec2/v1.2/With-Walz-beside-her-Harris-says-strengthened-middle-class-to-be-defining-goal.jpg","video":null,"publish_date":"2024-08-07 00:41:40","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"US","sentiment":0.022},{"id":253539538,"title":"Harris taps Gov. Tim Walz to join ticket after he labels Republicans ‘weird’","text":"After what must have been one of the shortest running-mate vetting processes in U.S. history, Vice President Kamala Harris announced Tuesday she that Minnesota Gov. Tim Walz would join her on the Democratic ticket. The announcement came just 16 days after Harris took the party reins from President Joe Biden, after the latter chose to step aside from electoral consideration in favor of his vice president. “When I called (Walz) this morning to ask him to join our campaign, I shared my deep level of respect for him and the work we’ve done together. We’re going to unify this country and we’re going to win. Let’s go get this done,” Harris said via social media. “He really does shine a light on a better future that we can build together,” Harris said at an evening rally in Philadelphia. “Tim Walz will be ready on day one.” Walz said that it’s the “honor of a lifetime” to join the campaign. “I’m all in. Vice President Harris is showing us the politics of what’s possible. It reminds me a bit of the first day of school. So, let’s get this done, folks,” he wrote. “I couldn’t be prouder to be on this ticket,” he said later in Philadelphia. Walz, 60, joined the U.S. Army National Guard at 17 years old and retired after serving 24 years as an artillery officer and rising to the rank of Command Sergeant Major. He’s a former high school social studies teacher and football coach who took his team to their first state championship. Raised in Nebraska by a military family, Walz entered politics after moving to his wife Gwen’s native Minnesota in the 90s. He used his folksy charm and natural ability to connect with regular people to run for and win the North Star State’s conservative-leaning First Congressional District in 2006, and went on to win reelection five times. He won the governor’s office in 2018 and was reelected to that position in 2022. The governor, a father of two, has never lost an election. Walz is also seen as the first to come up with an insult capable of sticking to the famously Teflon-coated Donald Trump, labeling the 45th President and his running mate “weird.” During his time in office, according to the Harris-Walz campaign, Walz “lowered the cost of insulin to $35 per month for many Minnesotans. He eliminated junk fees. And, he signed paid leave into law so that parents can take care of sick family without losing their job.” “Governor Walz stood up for fundamental freedoms and made Minnesota the first state to pass a law codifying abortion rights after the Supreme Court overturned Roe. He funded Minnesota police departments, putting more cops on the street and investing in body cameras, and established universal background checks for gun purchases. And, he worked across the aisle to pass a bipartisan infrastructure package,” the campaign wrote. Walz is also a gun owner and “avid pheasant hunter” that’s pro-Second Amendment but in favor of legislation to tackle gun violence. According to Bay State Gov. Maura Healey, Harris has made a fantastic choice in Walz, and the pair make the “ideal team to defeat Donald Trump and JD Vance and move this country forward.” “I’m a proud colleague of Governor Walz,” she said, noting his military and teaching service. “He is a person of deep integrity and empathy.” House Minority Whip Katherine Clark said Walz “is a joyful, battle-tested public servant who has made it his life’s work to help others — from the National Guard to the classroom to the governor’s mansion.” “While Donald Trump and JD Vance work to rig our economy for the rich and tear away women’s rights, Kamala Harris and Tim Walz have a vision for our country that includes everyone. They will lead with compassion, safeguard our freedom, and ensure working families can get ahead,” she said in a statement. UMass Lowell Professor John Cluverius, an expert in presidential politics, said that Walz is just bland enough to be a good choice for Harris. “In a vice president, you want to pick someone as unifying and boring as possible. It’s smart for Harris to pick someone who isn’t going to offend and Walz is brilliantly dull,” he said. Trump responded to Harris’ announcement that Walz would join her campaign by seemingly inventing a movement to reestablish Biden’s candidacy, despite the fact that Harris officially clinched the party nomination Monday night. “This is the most Radical Left duo in American history. There has never been anything like it, and there never will be again. Crazy Kamabla is, indeed, CRAZY. I HEAR THERE IS A BIG MOVEMENT TO ‘BRING BACK CROOKED JOE,’” he wrote, capitalization and misspelling his. Walz has received criticism from some Republicans over his leadership during protests and riots that occurred in his state in 2020, following the murder of George Floyd by a Minneapolis police officer, and for his use of executive power during the height of the COVID-19 pandemic. Walz was arrested in 1995 and accused of driving under the influence. He later pled guilty to a reduced charge of reckless driving. A spokesperson for the Republican National Committee said the Command Sgt. Maj. is “weak, failed, and dangerously liberal” and that he “transformed Minnesota into a third-world refuge for the Radical Left’s most deranged lunacy — and now he’s joining forces with Kamala to do it to the rest of the country.”","summary":"Walz said that it’s the “honor of a lifetime\" to join the campaign.","url":"https://www.bostonherald.com/2024/08/06/harris-taps-gov-tim-walz-to-join-ticket-after-he-labels-republicans-weird/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/GettyImages-2165602399.jpg?w=1024","video":null,"publish_date":"2024-08-07 00:38:58","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.208},{"id":253539274,"title":"US Election: Why Kamala Harris Picked Tim Walz As Running Mate","text":"US Vice President Kamala Harris, who officially became the Democratic Presidential Nominee yesterday, has picked Minnesota Governor and former high school teacher Tim Walz as her running mate ahead of the November 5 Presidential election. Analysts in the US believe that Harris and Walz’s combination is good enough to upstage Republican candidate Donald Trump and his running mate JD Vance. Still, many Republicans believe Walz is a weak pick. Several Republican lawmakers and leaders describe Walz as a “far-left” governor. Walz was probably selected for being plainspoken, and his stature in a Midwestern town could appeal to independent and conservative voters. Walz came to the national limelight when he called Trump and JD Vance “weird,” a phrase Harris has often copied when talking about her primary opponent. Walz will be officially unveiled as Harris’s running mate at a rally in Philadelphia, and then they will tour key battleground states. Democratic National Convention had announced that 99% of Democratic delegates officially crowned Kamala Harris as the Democratic Party presidential nominee after a five-day online ballot. Before this, however, she had secured the 1,976 delegate votes she needed to become the Democratic Party Nominee within 32 hours of President Joe Biden’s withdrawal. However, the party had to wait to conclude the process, stipulating that an online vote must be completed to make it official. Analysts said that one of the main reasons Tim Walz was chosen is his ability to woo white, working-class Americans. This key demographic has helped fuel and maintain Donald Trump’s political fortunes in this country. A former school teacher, football coach and long-time member of the Army National Guard, Walz started running for office in his 40s. In his first race, he successfully ran against a Republican in Minnesota’s rural, traditionally conservative 1st Congressional District. He was re-elected five times before he left Capitol Hill. While Republicans are already attacking him as “too liberal”, some of the policies he implemented as Minnesota’s governor proved broadly popular among the state’s Democrats and Republicans. In 2023, Walz signed an executive order removing the college degree requirement for 75% of Minnesota’s state jobs. Several other states later copied the initiative. Walz is also said to be a gun owner and hunter, although his support among gun rights groups slipped after he backed tighter restrictions on firearms ownership. However, in his characteristic manner, the Trump-Vance campaign team has issued a statement in which they condemned Walz, calling him a “dangerously liberal extremist” who was put on the Democratic ticket to aid Harris’ progressive agenda. In a video posted on X, the Trump campaign team said Harris “doubled down on her radical vision for America by tapping another left-wing extremist as her nominee”, calling their platform “dangerously liberal”.","summary":"US Vice President Kamala Harris, who officially became the Democratic Presidential Nominee yesterday, has picked Minnesota Governor and former high school teacher Tim Walz as her running mate ahead of the November 5 Presidential election. Analysts in the US believe that Harris and Walz&#8217;s combination is good enough to upstage Republican candidate Donald Trump and [&#8230;]","url":"https://leadership.ng/us-election-why-kamala-harris-picked-tim-walz-as-running-mate/","image":"https://leadership.ng/wp-content/uploads/2024/08/IMG-20240805-WA0006.jpg","video":null,"publish_date":"2024-08-07 00:33:02","author":"Innocent Odoh","authors":["Innocent Odoh"],"language":"en","catgory":"politics","source_country":"ng","sentiment":-0.145},{"id":253539324,"title":"It’s a vibes election - and Harris has picked the perfect running mate for the job","text":"They’re calling it a vibes election. Yet vibes are notoriously hard to spot, and they don’t always show up in polls, but as Kamala Harris took to the stage in a cavernous auditorium at Temple University in Philadelphia on Tuesday with her new running mate, they were measurable in the screams and shouts of 12,000 people. The replacement of Joe Biden at the top of the Democratic ticket by Harris has changed the energy in the room. And Harris’s choice of Minnesota governor Tim Walz as her vice presidential candidate is a sign that she is banking on that energy taking her to the White House. It’s a strategy based on the idea that campaigns are not won on fear alone, but on feeling. Where Biden spoke sternly and in hushed tones of Donald Trump and the threat he posed to democracy, Harris and her running mate are here to provoke, mock and laugh at their opponents. Walz set the tone with his first words on stage as the official vice presidential nominee. “Thank you for bringing back the joy,” he said to Harris. Walz is not the most practical pick for the electoral map math — that would have been Josh Shapiro, the popular governor of the must-win Pennsylvania. But he brings a Midwest Dad energy to the ticket that stands in stark contrast to the 4Chan ramblings of JD Vance and the disjointed string of thinly-veiled racism that emanates from Donald Trump. He was able to land dad jokes and piercing attacks on Trump and Vance with ease. One of the biggest cheers of the night — and there were a lot — came when he combined the two. \"Make no mistake, violent crime was up under Donald Trump — and that’s not even counting the crimes he committed,” Walz said. He then turned his attention to his opponent on the vice presidential ticket. \"Like all regular people I grew up with in the heartland, JD studied at Yale, had his career funded by Silicon Valley billionaires, and then wrote a best seller trashing that community. “Come on. That’s not what Middle America is. And I got to tell you. I can’t wait to debate the guy ... That is, if he’s willing to get off the couch and show up,\" he added, in an apparent reference to unverified internet rumors that Vance had intimate relations with a sofa. Harris has been basking in this vibe shift since accepting the Democratic nomination. Here in Philadelphia, her stump speech elicited crowd participation — they knew the words; they knew how to respond. “So hear me when I say,” Harris said, with a long pause for the crowd to cheer. “I know Donald Trump’s type.” With the addition of Walz, the Democrats now have two happy warriors on the ticket. It’s a gamble but Republicans are clearly struggling to land an effective response. As the crowd was waiting for Walz and Harris on stage, Trump seemed to be pining for his former opponent. “What are the chances that Crooked Joe Biden, the WORST President in the history of the U.S., whose Presidency was Unconstitutionally STOLEN from him by Kamabla, Barrack HUSSEIN Obama, Crazy Nancy Pelosi, Shifty Adam Schiff, Cryin’ Chuck Schumer, and others on the Lunatic Left, CRASHES the Democrat National Convention and tries to take back the Nomination, beginning with challenging me to another DEBATE” he wrote on Truth Social. Harris supporters at the event have noticed the difference, too. “I think it’s a renewed energy. The city feels different,” said Bridget McKeogh, a Philadelphia resident, as she waited for the rain to pass outside the event. “I love Biden. I think he’s a great president. But things felt kind of old and there wasn’t really an excitement around it. And that’s completely changed. I see young black people registering people to vote, as well as people that look like me,” she added. Harris will be counting on this new energy to translate into practical advantages — whether that means donations or more volunteer boots on the ground. Some are already seeing it. “Oh, the vibe shift was immediate,” said Marscha Levell. “Within 2 or 3 hours I got a text message from one of my cousins telling me about the Zoom call for black women for Kamala, and they got 44,000 women, and they raised over $1 million in 24 hours. So that was like a major culture shift.” There was a message in the jibes, too. Harris and Walz pitched their ticket not just as joyful versus weird, but as a living representation of what it means to be American. “The promise of America is what makes it possible for two middle-class kids, one a daughter of Oakland, California, who was raised by a working mother, the other a son of the Nebraska planes who grew up working on a farm.. it’s the promise of America, because only in America, only in America, is it possible for them together to make it all the way to the White House,” Harris said.","summary":"The replacement of Joe Biden at the top of the ticket has changed the energy in the room","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-tim-walz-rally-b2592327.html","image":"https://static.independent.co.uk/2024/08/07/01/Election_2024_Harris_73040.jpg?width=1200","video":null,"publish_date":"2024-08-07 00:30:15","author":"Richard Hall","authors":["Richard Hall"],"language":"en","source_country":"gb","sentiment":-0.104},{"id":253539642,"title":"Pakistani Man with Ties to Iran is Charged in Plot to Carry Out Political Assassinations on US Soil","text":"WASHINGTON — A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out political assassinations on U.S. soil, including potentially of former President Donald Trump. The case disclosed by the Justice Department on Tuesday is the latest murder-for-hire plot originating from abroad to target American public figures, coming two years after officials disrupted a separate scheme that they said was aimed at former Trump administration national security adviser John Bolton. Asif Merchant traveled to New York in June for the purpose of meeting with men he thought he was recruiting to carry out the killings, even paying a $5,000 advance to two would-be assassins who were actually undercover law enforcement officers, federal officials said. He was arrested last month as he prepared to leave the U.S. and after having told the men that he would provide further instructions, including the names of the intended targets, in August or September after he returned to Pakistan. Court documents do not identify any of the potential targets. But U.S. officials acknowledged last month that a threat on Donald Trump’s life from Iran prompted additional security in the days before a Pennsylvania rally in which Trump was injured by a gunman’s bullet. That July 13 shooting, carried out by a 20-year-old Pennsylvania man, was unrelated to the Iran threat and Merchant’s arrest has no connection to the Trump assassination attempt, a law enforcement official said. But an FBI agent’s affidavit suggests Merchant had current or former high-level officials like Trump in mind. He told an associate who was secretly cooperating with law enforcement that he wanted a “political person” to be killed, the complaint said, mapping out on a napkin the different scenarios in which the target could be assassinated and warning that there would be security “all around.” U.S. officials have warned for years about Iran’s desire to avenge the 2020 killing of Qassem Soleimani, who led the Iranian Islamic Revolutionary Guard Corps’ Quds Force. That strike was ordered by Trump when he was president. The U.S. government since then has paid for security for multiple Trump administration officials, and in 2022, the Justice Department charged an Iranian operative in a foiled plot to kill Bolton. FBI Director Christopher Wray said at a House hearing last month that the Iranian government had been “extremely aggressive and brazen” in recent years, and Attorney General Merrick Garland said Tuesday that “we expect that these threats will continue and that these cases will not be the last. “The Justice Department will spare no resource to disrupt and hold accountable those who would carry out Iran’s lethal plotting against Americans,” he said. White House press secretary Karine Jean-Pierre told reporters Tuesday during an afternoon press briefing that the U.S. had been “tracking Iranian threats against former politicians.” “We consider this a national and homeland security matter of the highest priority. We have repeatedly met at the highest levels of our government to develop and implement a comprehensive response,” she said. Federal officials identified Merchant, 46, as a Pakistani citizen who has said he has a wife and children in Iran and who traveled frequently to Iran, Syria and Iraq. A lawyer for Merchant declined to comment Tuesday when reached by The Associated Press. After Merchant’s arrest, Justice Department prosecutors urged a judge to keep him locked up, writing in a detention memo that before flying from Pakistan to the U.S., “the defendant had spent two approximately two weeks in Iran. Given the seriousness of the murder for hire charges, the defendant has every incentive to flee to either Pakistan or Iran, significantly reducing the likelihood of his appearance in this case should he flee.” He was ordered detained following a court appearance. Court documents trace the foiled plot to this past April, when Merchant flew to the U.S. to recruit participants in the murder-for-hire scheme. He contacted a person he thought would help him but who instead alerted law enforcement. That person became a confidential source for investigators, including by introducing Merchant to the purported hitmen, officials said. After meeting the two undercover officers posing as hitmen, the affidavit says, Merchant told them the work would be long-term. He instructed them that in addition to the killings, he would expect them to arrange protests at political rallies, steal documents and launder money for him. He told them he would return to Pakistan before giving them additional instructions. Officials say Merchant paid a $5,000 advance for the planned killings. “Now we know we’re going forward. We’re doing this,” one of the purported hitmen said, according to the affidavit. “Yes, absolutely,” Merchant replied. Merchant was arrested July 12, the same day he planned to leave the U.S. Prosecutors say a search of his wallet found a handwritten note that included code words he had used to communicate with the individuals he thought were hitmen.","summary":"WASHINGTON  — A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out&#8230; Continue reading Pakistani Man with Ties to Iran is Charged in Plot to Carry Out Political Assassinations on US Soil\n\n\nThe post Pakistani Man with Ties to Iran is Charged in Plot to Carry Out Political Assassinations on US Soil appeared first on The National Herald.","url":"https://www.thenationalherald.com/pakistani-man-with-ties-to-iran-is-charged-in-plot-to-carry-out-political-assassinations-on-us-soil/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/08/pakisani-merchant.jpg","video":null,"publish_date":"2024-08-07 00:28:59","author":"Antonis","authors":["Antonis"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.344},{"id":253539220,"title":"Kyodo News Digest: Aug. 7, 2024","text":"The following is the latest list of selected news summaries by Kyodo News. ---------- PARIS - Japan's Kenichiro Fumita won the men's Greco-Roman 60-kilogram wrestling gold medal at the Paris Olympics on Tuesday, going one better than his silver in Tokyo three years ago. Fumita defeated China's Cao Liguo 4-1 in the final at Champ-de-Mars Arena, after fellow Japanese Nao Kusaka advanced to the men's Greco-Roman 77-kg final. ---------- HIROSHIMA - A group of activists gathered in Hiroshima on Tuesday to denounce Israel being invited to the annual peace ceremony in the city commemorating the 79th anniversary of its atomic bombing by the United States and called for the freedom of Gaza in the Palestinian territory. The event, held at the Hiroshima Peace Memorial Park, the venue of the ceremony earlier in the day, was joined by crowds of people and remotely by Waleed Siam, representative of the Permanent General Mission of Palestine in Japan. ---------- PARIS - Japan's Cocona Hiraki won her second straight Olympic silver medal Tuesday as 14-year-old Australian Arisa Trew was crowned the Paris Games women's park skateboarding champion. The 15-year-old Hiraki scored 92.63 points with her third and final run at the eye-catching La Concorde urban sports complex to finish 0.55 back from Trew, while Britain's Sky Brown repeated as bronze medalist with a best score of 92.31. ---------- Japan raises travel alert for Israel amid heightened tensions TOKYO - The Japanese Foreign Ministry on Tuesday raised its travel alert for parts of Israel amid heightened tensions in the Middle East, telling its citizens to avoid all travel to the country or evacuate it. The move follows the recent assassination in Iran of Ismail Haniyeh, the political leader of the Palestinian Islamist group Hamas. The development has raised concerns of an escalation of the conflict in the region where Israel continues its war on the Gaza Strip in response to an attack by Hamas in October 2023. ---------- Harris picks Minnesota Gov. Tim Walz as running mate for White House WASHINGTON - U.S. Vice President Kamala Harris said Tuesday that she has chosen Minnesota Gov. Tim Walz, who has a proven record of connecting with rural Americans, to be her running mate for the November presidential election, voicing hope that he can appeal to working-class voters. Walz, a second-term governor with a folksy demeanor, raised his profile recently by calling Republican nominee Donald Trump and his running mate JD Vance \"just weird.\" ---------- Japan to provide Vietnam with 2 transporter vehicles TOKYO - Japan agreed Tuesday with Vietnam to provide two transporter vehicles, the Defense Ministry said, as part of efforts to strengthen bilateral security cooperation to counter a growingly assertive China in the region. At their meeting in Hanoi, Japanese Defense Minister Minoru Kihara and his Vietnamese counterpart Phan Van Giang confirmed the provision of the used tracked vehicles, marking the first equipment transfer between the two countries under their defense pact, the ministry said. ---------- TOKYO - A Japanese court on Tuesday ordered an archer bound for the upcoming Paris Paralympics to pay damages of around 1.24 million yen ($8,600) to a fellow athlete for posting defamatory comments on her blog during qualification for the 2021 Tokyo Games. According to the ruling handed down by the Tokyo District Court, Chika Shigesada, 41, anonymously posted comments on plaintiff Asako Onodera's blog such as \"Don't struggle too much in vain,\" and \"Aren't you breaking the rules?\" in January 2021 while both were taking part in qualification for the games that year. ---------- PARIS - Japanese wrestler Yui Susaki on Tuesday joined her judoka countrywoman Uta Abe as a favorite who took a shock early-round loss at the Paris Games, demonstrating that not even the most dominant athletes can take anything for granted at the Olympics. After going undefeated in 94 matches against opponents from other countries since her international debut in 2014, Susaki lost to India's Vinesh Vinesh in the women's 50-kilogram first round. Video: Sendai Tanabata Festival in northeastern Japan","summary":"People walk under colorful streamers at a shopping arcade in Sendai in Miyagi Prefecture, ...","url":"https://english.kyodonews.net/news/2024/08/596b9e4ff8b3-kyodo-news-digest-aug-7-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/c1a833a5a08926fe360738873a21fb7f/photo_l.jpg","video":null,"publish_date":"2024-08-07 00:28:09","author":null,"language":"en","source_country":"jp","sentiment":0.374},{"id":253539136,"title":"Kamala Harris Passes Joe Biden's Peak Election Odds as She Lands a VP","text":"Vice President Kamala Harris' chances of winning in November have surpassed President Joe Biden's peak betting odds on the platform Polymarket.As of Tuesday evening, Harris was predicted to have 46 percent chance of beating former President Donald Trump. Shares of a Harris victory are being sold for 45.6 cents, while shares for a Harris loss are going for 54.5 cents.In comparison, Biden's odds against Trump peaked on Poylmarket in April, when the president was given a 45 percent chance of winning his reelection bid. On the morning of July 21, the day that Biden dropped out of the race, the president's odds sat at 7 percent.According to Polymarket's website, the betting platform is the world's largest prediction market. Users are able to buy shares representing the outcome of events ranging from the political sphere to the sporting world. After an event, the correct outcome can be redeemed for $1 per share.Trump was still predicted to win the election over Harris as of Monday, with a 52 percent chance. Shares of his victory were going for 52 cents, while shares for his loss were being sold on Polymarket for 49 cents.Newsweek reached out to Trump and Harris' campaigns via email for comment on Tuesday.Harris is just two weeks into her presidential campaign, and made her first major decision as the presumptive Democratic nominee on Tuesday: selecting Minnesota Governor Tim Walz as her running mate.Walz addressed a crowd of roaring supporters in Philadelphia on Tuesday in his first speech as the vice presidential candidate, and wasted no time taking jabs at Trump and his running mate, Ohio Senator JD Vance.\"Minnesota's strength comes from our values—our commitment to working together, to seeing past our differences, to lending a helping hand,\" said Walz, a Nebraska native who has lived in Minnesota for nearly 30 years and has served as his state's governor since 2018. The governor also served in the Army National Guard and was a high school teacher and football coach before launching his political career.\"Donald Trump sees the world a little differently than us,\" he continued. \"First of all, he doesn't know the first thing about service. He doesn't have time for it, because he's too busy serving himself.\"Harris addressed supporters before Walz took the microphone, and described her vice president pick as a role model for his former students and a governor who stands for freedom.The vice president also made a joke about Walz's background in high school athletics by comparing him to Vance.\"Some might say it's like a matchup between the varsity team and the JV squad,\" Harris quipped.","summary":"Harris announced her pick for vice president Tuesday morning. By that evening, her odds of beating Trump in November reached their peak on one betting platform.","url":"https://www.newsweek.com/kamala-harris-passes-joe-bidens-peak-election-odds-she-lands-vp-1935579","image":"https://d.newsweek.com/en/full/2444591/harris-passes-joe-bidens-peak-election-odds.jpg","video":null,"publish_date":"2024-08-07 00:21:14","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","source_country":"US","sentiment":0.12},{"id":253538898,"title":"Harris chooses Minnesota governor as vice presidential running mate","text":"US Vice President Kamala Harris on Tuesday announced the governor of Minnesota as her running mate for the Nov. 5 general election, capping a dayslong high-stakes selection process ahead of her tour through seven battleground states this week. Harris named Gov. Tim Walz, a former six-term lawmaker, social studies teacher and American football coach, as her vice presidential pick hours before they made their first joint appearance at a rally in Pennsylvania, the first leg of her five-day tour, amid a tight race against former President Donald Trump. \"I am proud to announce that I've asked @Tim_Walz to be my running mate,\" she wrote on X, formerly Twitter. \"As a governor, a coach, a teacher, and a veteran, he's delivered for working families like his. It's great to have him on the team. Now let's get to work,\" she added. The Midwestern governor said that he is \"all in\" for the campaign. \"It is the honor of a lifetime to join @kamalaharris in this campaign,\" he wrote on X. \"I'm all in. Vice President Harris is showing us the politics of what's possible. It reminds me a bit of the first day of school.\" The announcement ended days of grueling considerations over finalists' impact on her campaign and the electoral map, as well as their chemistry with Harris. The finalists included Pennsylvania Gov. Josh Shapiro and Sen. Mark Kelly of Arizona. Though other finalists had a stronger competitive edge, like a battleground advantage, Walz is known to be a loyalist to the Biden-Harris administration, with his folksy demeanor, progressive policy records and other records expected to help Harris' campaign. Walz, a plain-spoken politician, got into the spotlight when he described Trump and other Republicans as \"weird\" in recent media appearances. That expression has been popularized in political discourse both online and offline during this election cycle. At the rally in Philadelphia, Harris said that with Walz, she will \"fight for the future.\" \"Our campaign is not just a fight against Donald Trump. Our campaign ... this campaign is a fight for the future.\" Walz was first elected the state's governor in 2018 and won reelection in 2022. He served as a congressman representing Minnesota's first district from 2007 through 2019. He previously served in the Army National Guard and worked as a public school teacher and football coach. During his time as governor, he made a range of achievements, including providing universal free school meals for students, protecting reproductive freedom, cutting taxes for the middle class and expanding paid leave for Minnesota workers, according to his office's website. Trump's campaign criticized Walz as a \"dangerously liberal extremist,\" reports said. Harris' veepstakes had raised concerns about fissures within the party as donors, different wings of the party and others called for their preferred candidates to be on the national ticket at a time when Harris sought unity to rally her party ranks and supporters behind her. In a virtual five-day roll call vote that ended Monday, Harris received 99 percent of delegate votes to officially clinch the Democratic presidential nomination. The vote was arranged ahead of the Democratic National Convention, set for Aug. 19-22, because of Ohio's Aug. 7 deadline for parties to submit the names of their candidates. (Yonhap)","summary":"US Vice President Kamala Harris on Tuesday announced the governor of Minnesota as her running mate for the Nov. 5 general election, capping a dayslong high-stakes selection process ahead of her tour through seven battleground states this week. Harris named Gov. Tim Walz, a former six-term lawmaker, social studies teacher and American football coach, as her vice presidential pick hours before they made their first joint appearance at a rally in Pennsylvania, the first leg of her five-day tour, am","url":"https://www.koreaherald.com/view.php?ud=20240807050104","image":"https://res.heraldm.com/content/image/2024/08/07/20240807050114_0.jpg","video":null,"publish_date":"2024-08-07 00:20:09","author":"Yonhap","authors":["Yonhap"],"language":"en","catgory":"politics","source_country":"kr","sentiment":0.509},{"id":253539448,"title":"Tim Walz says he'll debate JD Vance 'if he's willing to get off the couch'","text":"When Minnesota Gov. Tim Walz took the stage on Tuesday to announce his candidacy for vice president alongside Democratic nominee Vice President Kamala Harris, he wasted no time taking aim at his new political rival: Sen. JD Vance.Walz lambasted Vance several times in his debut speech, saying the senator from Ohio and running mate of former President Donald Trump doesn't represent Middle America as he does.\"Like all regular people I grew up with in the heartland, JD studied at Yale, had his career funded by Silicon Valley billionaires, and then wrote a best seller trashing that community,\" Walz said. \"Come on —that's not what Middle America is!\"He added: \"And I got to tell you: I can't wait to debate the guy. That is, if he's willing to get off the couch and show up.\"Gov. Walz: I can't wait to debate JD Vance. That is, if he's willing to get off the couch and show up pic.twitter.com/YijZfjca0ORepresentatives for Walz and Vance did not immediately respond to requests for comment from Business Insider.Walz's quip could have been a reference to a viral joke on social media that baselessly suggested Vance, in his 2016 New York Times bestselling novel \"Hillbilly Elegy\" admitted \"to fucking an Inside-out latex glove shoved between two couch cushions.\"Vance's novel did not include such an admission, and there is no evidence to suggest he has ever been inappropriate with any piece of furniture. The joke's author previously told Business Insider he knew he was rolling \"in the mud\" when he made the post but believes it is an example of an \"ecstatic truth.\" Regardless, the suggestion took off online and has dogged the GOP vice presidential nominee ever since.In classic Midwestern dad fashion, Walz laughed at his own joke, adding: \"You see what I did there?\"","summary":"In his debut speech, Minnesota Gov. Tim Walz joked that he can't wait to debate Trump's VP pick, JD Vance, \"if he's willing to get off the couch.\"","url":"https://www.businessinsider.com/tim-walz-couch-joke-jd-vance-debate-2024-8","image":"https://i.insider.com/66b2b005b4912df3ae197d23?width=1136&format=jpeg","video":null,"publish_date":"2024-08-07 00:19:13","author":"Katherine Tangalakis-Lippert","authors":["Katherine Tangalakis-Lippert"],"language":"en","source_country":"US","sentiment":0.005},{"id":253539238,"title":"Trump’s smear job climaxed prematurely — now he’s stuck","text":"A question occurred to me last week as I was watching a clip from the former president’s rally in suburban Minnesota: Why was the former president campaigning in suburban Minnesota? No Republican nominee has won that state since Richard Nixon in 1972, yet Donald Trump has campaigned there numerous times over the summer. I’m told Trump's been campaigning in a solidly blue state, because he believes he could win it. At that time, polls suggested he was on course to defeating Joe Biden. He believed he could expand the electoral map. But Biden dropped out on July 21. Trump’s latest rally was last week. Why? I’m told it’s because he hasn’t adjusted to Kamala Harris yet. Perhaps, but perhaps this, too: Trump didn’t adjust, because he never adjusts. He can’t. He does not learn from successes (the 2016 election) or failures (2020). Trump is running the same campaign he ran the last two times. The chief difference is the degree of horror. While he wasn’t openly dictatorial eight years ago, he’s now telling voters to vote this time like it’s their last time. After that, they won’t have to vote again. I don’t have hard evidence to back up this statement. (Yes, I do pay attention to politics, but not to everything political.) I just think it’s plainly obvious. I do concede it didn’t look that way as long as Joe Biden was in the race, and it didn’t look that way, because the Washington press corps had made a fetish of the president’s age. Little else could break through The Narrative, not even the plainly obvious observation that Doald Trump is running the same old campaign. I expect things to change now that Kamala Harris is the Democratic nominee. (It was made official this weekend when she secured enough delegates to no longer be the presumptive nominee.) As voters notice he’s running the same old campaign, I hope they’ll notice something else that was hard to see as long as the president was in the running. The Republican presidential nominee is also an old man. It wouldn’t be unreasonable to expect voters to wake up, as they often do in the fall, to a new understanding: Oh yes, of course! Donald Trump is running the same old campaign, because he’s also an old man! (As I’m writing this, Morning Consult, the polling firm, released the results of its latest survey, showing that 51 percent of respondents said Trump is too old to be president while 12 percent (!) said Harris is. We can expect that 51 percent to climb higher as long as the question is asked.) The Harris campaign is encouraging that view, without being obvious about it, by using normal liberal rhetoric about a “conservative” opposition that wants to take us back to a time when women and racial and sexual minorities had few legal rights. With broader awareness of Trump’s age, there’s no need to mention his authoritarian tendencies. Of course he wants to take us back. He’s an old man! Her campaign encourages that view also by framing the election as a choice, for voters, between “freedom and chaos,” with the subliminal understanding that a campaign like Harris’ can adjust to changing circumstances for the purpose of securing greater freedoms for all while a campaign like Trump’s only flounders. It bumbles around the country, as it has for eight straight years. Of course Trump can’t let go of a blue state he has no hope of taking from Harris. He’s an old man! We tend to forget that Trump has been campaigning against Joe Biden since 2019 when, as president, he extorted the leader of a foreign country into a conspiracy to defraud the American people. He wanted Ukrainian President Volodymyr Zelensky to say – not do, just say – his government was investigating Biden for corrupt acts while vice president. Trump wanted to smear Biden before his campaign started. It didn’t work, but since then, Trump hasn’t really bothered trying to win elections. He hasn’t bothered trying to expand his base of support to include highly coveted swing voters who determine the outcomes of presidential elections. For 2020, instead of increasing his share of the 2016 electorate (about 46 percent), he doubled down on it, growing his stake by less than a point. Instead of trying to win, he just declared himself the winner, thus paving the way for a failed J6 insurrection. Instead of trying in 2024, Trump did the same old same old. With the help of the GOP, rightwing media allies and, lest we forget, Russian operatives, he built an international apparatus by which to sabotage Joe Biden’s public image. Over four years, rightwing discourse became totalizing in its orientation toward smearing Biden as too old, too weak, too feeble. Trump did what he has always done, and thanks to the Washington press corps and Democrats who are vulnerable to what the press corps thinks of them, it finally worked. Biden’s public image, after June’s Disaster Debate, was so irreparable he dropped out. But it worked too soon. You could say Trump’s smear job against the president climaxed prematurely, and now that the vice president has taken over, Trump doesn’t know what to do after so many years of doing the same old same old. There’s not enough time to establish a new context of bullshit to which the press corps can give the benefit of the doubt, and, in effect, erode Harris’ support among those highly coveted swing voters as well as from inside the Democratic Party. Trump can’t adjust, won’t adjust. He’s running the same campaign he ran the first two times. And if you need more proof, consider this: his greatest accomplishment has been knocking Biden out of the running by mounting a massive, yearslong effort to smear him for being too old to be president. And now that the same charges are backfiring against him, what does Trump do? Nothing, except more of the same.","summary":"A question occurred to me last week as I was watching a clip from the former president’s rally in suburban Minnesota: Why was the former president campaigning in suburban Minnesota? No Republican nominee has won that state since Richard Nixon in 1972, yet Donald Trump has campaigned there numerous times over the summer. \n\nI’m told Trump's been campaigning in a solidly blue state, because he believes he could win it. At that time, polls suggested he was on course to defeating Joe Biden. He believed he could expand the electoral map. But Biden dropped out on July 21. Trump’s latest rally was last week. Why? I’m told it’s because he hasn’t adjusted to Kamala Harris yet.\n\nPerhaps, but perhaps this, too: Trump didn’t adjust, because he never adjusts. He can’t. He does not learn from successes (the 2016 election) or failures (2020). Trump is running the same campaign he ran the last two times. The chief difference is the degree of horror. While he wasn’t openly dictatorial eight years ago, he’s now telling voters t","url":"https://www.alternet.org/alternet-exclusives/trump/","image":"https://www.alternet.org/media-library/image.jpg?id=53127668&width=1200&height=600&coordinates=0%2C95%2C0%2C76","video":null,"publish_date":"2024-08-07 00:15:01","author":"John Stoehr","authors":["John Stoehr"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.31},{"id":253538792,"title":"‘Can’t Wait To Debate’: Walz Says He’s Eager To Face 'Creepy' And 'Weird' Vance","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Minnesota Gov. Tim Walz said Sen. JD Vance, R-Ohio, and former President Donald Trump are “creepy” and “weird as hell” in his first campaign appearance as Vice President Kamala Harris’ running mate Tuesday—leaning into Democrats’ new attack line against the GOP that Walz helped popularize. US Vice President and 2024 Democratic presidential candidate Kamala Harris applauds as her running ... [+] mate Minnesota Gorvernor Tim Walz speak at Temple University's Liacouras Center in Philadelphia, Pennsylvania, August 6, 2024, on the first day of their \"Battleground State Tour\". (Photo by MATTHEW HATCHER/AFP via Getty Images) AFP via Getty Images Key Facts Walz, referring to Trump and his running mate, said “these guys are creepy and yes, just weird as hell,” in his first speech as the Democratic vice presidential nominee at a rally Tuesday in Philadelphia. Walz said he “can’t wait to debate” Vance “if he’s willing to get off the couch and show up,” an apparent quip about the false claim that went viral on social media that Vance wrote about a sex act involving a couch in his book “Hillbilly Elegy.” Walz also attacked Vance for having grown up “in the heartland” then going on to Yale and having a “career funded by Silicon Valley billionaires” before writing a “bestseller trashing that community . . . come on, that’s not what Middle America is,” Walz said. Democrats have repeatedly used the term “weird” to refer to Republicans in recent weeks, and Walz has been widely credited with helping spread the messaging, after his viral MSNBC appearance in which he described Vance and Trump as “weird” for what he called their attacks on “freedom: freedom to be in your bedroom, freedom to be in your exam room, freedom to tell your kids what they can read.” Walz later explained to The New York Times the characterization is specific to Trump and Vance, not Republicans generally. Tangent Walz appeared alongside Harris as Democrats are experiencing a honeymoon of sorts following President Joe Biden’s July 21 exit from the race, marking an end to weeks of intraparty turmoil and sagging polls. Harris has since surpassed Trump in most polling averages after Trump led Biden for months. Recognizing the renewed enthusiasm, Walz thanked Harris for “bringing back the joy” on Tuesday. Harris, prior to Walz taking the stage, touted his background as a high school teacher, football coach and National Guardsman before his entrance into politics, casting him as a product of working-class middle America with solid family values. “Tim is more than a governor,” she said. “To his former high school students, he was Mr. Walz. To his football players, he was Coach, and in 91 days, the nation will know Coach Walz by another name: vice president of the United States.” Key Background Harris announced Walz as her running mate earlier Tuesday, ending weeks of speculation and a vetting process that reportedly involved nearly a dozen contenders, including Pennsylvania Gov. Josh Shapiro, who introduced Walz and Harris in his home state Tuesday. Walz, who was born in Nebraska and grew up working on his family farm, is widely viewed among Democrats as a candidate who can help build support among the working-class and in crucial battleground states, such as Michigan, Wisconsin and Pennsylvania. Walz served 12 years in Congress, representing a conservative district in southern Minnesota, prior to his election as governor in 2018. Further Reading GOP Attacks Tim Walz For Calling Rural Minnesota ‘Mostly Rocks And Cows’—Here’s What He Really Said (Forbes) Here’s What Polls Say About Tim Walz, Harris’ VP Pick (Forbes) Kamala Harris Picks Tim Walz As Running Mate: Here’s What To Know About Him (Forbes) Follow me on Twitter. Send me a secure tip. Sara Dorn Following Editorial Standards Print Reprints & Permissions","summary":"Walz appeared alongside Harris for the first time as running mate at a Philadelphia campaign rally hours after she announced him as her pick for vice president.","url":"https://www.forbes.com/sites/saradorn/2024/08/06/cant-wait-to-debate-walz-says-hes-eager-to-face-creepy-and-weird-vance/","image":"https://imageio.forbes.com/specials-images/imageserve/66b2babf89482ed7b47df7d1/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-07 00:13:29","author":"Forbes Staff,Sara Dorn","authors":["Forbes Staff","Sara Dorn"],"language":"en","source_country":"US","sentiment":0.187},{"id":253538820,"title":"The View star Alyssa Farah Griffin criticizes Kamala Harris’ VP pick Tim Walz","text":"The View co-host Alyssa Farah Griffin has criticized Kamala Harris’s choice of running mate for the 2024 presidential election. On Tuesday (August 6), Vice President Harris, 59, announced that Minnesota Governor Tim Walz, 60, would join her on the Democratic ticket. Walz beat out a crowded field of rivals to be the Democratic pick for VP, including Pennsylvania Governor Josh Shapiro. “An extraordinary missed opportunity,” Griffin, 35, who has previously praised Governor Shapiro, wrote on X/Twitter. In a since-deleted tweet, Griffin also suggested that Walz’s left-wing politics would be “radioactive with swing voters.” She went on to list Walz’s pros and cons. Under “pros” she wrote: “Strong midwestern messenger; executive experience as a governor; likely an effective surrogate in critical swing states of MI & WI; flipped a swing seat in Congress.” Under “cons” she wrote: “Seen as very progressive on guns & Gaza; not viewed as a moderating force on the ticket.” Harris and Walz made their debut as running mates on Tuesday, kicking off a campaign against Republican nominees Donald Trump and JD Vance in front of an electrified crowd in Philadelphia. Harris told the estimated 12,000 people in attendance that she had “set out to find a partner who can build this brighter future” during her weeks-old campaign for the presidency. She added that her search for a running-mate led her to look for a “leader who can unite this nation and move us forward,” someone who was “a fighter for the middle class” and “a patriot who believes as I do the extraordinary promise of America, a promise of freedom, opportunity and justice not just for some but for all.” Walz is a former high school teacher who enlisted in the US Army National Guard at 17 years old and served for 24 years, then spent more than two decades teaching and coaching football before entering politics. Meanwhile, Griffin describes herself as a “Republican in exile.” After several years of working in various roles within the Trump administration, she assumed the role of the White House spokesperson and assistant to the president in April 2020. Eight months later, she resigned from the role before joining The View permanently in 2022. Days after Biden abandoned his re-election campaign and endorsed Harris, Griffin praised the VP’s campaign, saying: “I am blown away by her digital operation. “[She] had 24 hours to stand this up. She is all over TikTok, she has turned things that seem cringy into making her seem cool. This feels Obama-level energy and Trump world is not ready for it.” Griffin has previously argued that Trump is “not as sharp as he was in 2016.” “[He’s] not even as sharp as he was in 2020,” she said in March. “For some reason, that doesn’t necessarily come across to voters the same way.” Back in 2020, when Griffin announced she was departing Trump’s administration, she called the role an “honor of a lifetime.” She said that she was “deeply proud of the incredible things we were able to accomplish to make our country stronger, safer, and more secure.”","summary":"Griffin appeared to show support instead for Pennsylvania Governor Josh Shapiro","url":"https://www.independent.co.uk/arts-entertainment/tv/news/the-view-tim-walz-kamala-harris-b2592325.html","image":"https://static.independent.co.uk/2024/08/07/00/MixCollage-06-Aug-2024-04-38-PM-7255.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/uHUVtHuZ-4VHSaSK0.mp4","publish_date":"2024-08-07 00:13:25","author":"Tom Murray","authors":["Tom Murray"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.108},{"id":253538864,"title":"Some Democratic backers of Josh Shapiro see a missed chance for a Jewish vice president","text":"PHILADELPHIA — Vice President Kamala Harris’ choice of Minnesota Gov. Tim Walz as her running mate disappointed fans of Pennsylvania Gov. Josh Shapiro, who was one of Harris’ finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president. With his history of winning three statewide elections in Pennsylvania, Shapiro was seen as someone with particular appeal to moderate voters. His state’s 19 votes in the Electoral College have long been critical for candidates trying to reach the necessary 270 to win. But the same things about Shapiro that appealed to moderates angered some on the left in his party: his support for a private school voucher program and natural gas infrastructure as well as particularly his support for Israel’s war in Gaza after Hamas’ Oct. 7 attack. Some Democrats lamented what they said was a missed opportunity by bypassing Shapiro. Republicans, meanwhile, tried to paint Harris’ choice as a snub to Jewish voters, a traditionally Democratic constituency that former President Donald Trump has tried to court in this year’s race. “Not only is he exceptionally smart and capable, but, in my opinion, he brought the math to the path of 270,” said Ryan Bizzarro, 38-year-old Democratic state lawmaker from Erie, Pennsylvania, said of Shapiro. Shapiro spoke at a rally in Philadelphia Tuesday night before the new Democratic ticket took the stage, with the Pennsylvania governor receiving big applause from thousands of attendees. “I love you Philly. You know what else I love, I love being your governor,” Shapiro said. He added, “I am going to continue pouring my heart and soul into continuing to serve you every single day as your governor.” Shapiro also praised Walz as a great man with strong midwestern values, calling him a friend he said he couldn’t wait for Pennsylvanians to get to know. Walz returned the compliment when he took the stage later with Harris in Philadelphia. “My God, what a treasure you have in Josh Shapiro,” he said. “Holy hell, can this guy bring the fire.” Philadelphia Mayor Cherelle Parker, who advocated fiercely but unsuccessfully for Shapiro, also spoke at the event and said Democrats should not let Republicans and detractors divide them over the pick. “Our Democratic nominee has spoken and that’s it. Period. End of story,” Parker said. Republicans try to take advantage of Shapiro not being picked A number of high-profile Republicans sought to seize on the liberal pushback Shapiro faced over his stance on Israel, suggesting that Shapiro was not picked as Harris’ running mate because of antisemitic attitudes in the Democratic Party. Ohio Sen. JD Vance, the Republican vice-presidential candidate, told reporters in Philadelphia on Tuesday that it seemed Harris didn’t pick Shapiro because Democrats feared “grassroots activists in their party wouldn’t take a Jewish nominee.”","summary":"Vice President Kamala Harris' choice of Minnesota Gov. Tim Walz as her running mate disappointed fans of Pennsylvania Gov. Josh Shapiro, who was one of Harris' finalists for the job and seen as someone who could help Democrats win a key swing state and make history by electing the first Jewish vice president.","url":"https://www.bostonherald.com/2024/08/06/some-democratic-backers-of-josh-shapiro-see-a-missed-chance-for-a-jewish-vice-president/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/AP24219786424177.jpg?w=1024","video":null,"publish_date":"2024-08-07 00:11:42","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.014},{"id":253539254,"title":"Harris introduces new running mate Minnesota Gov. Tim Walz as the ‘vice president America deserves’","text":"PHILADELPHIA (AP) — Kamala Harris introduced Minnesota Gov. Tim Walz to the nation at a raucous rally Tuesday in battleground Pennsylvania that was aimed at building momentum for the newly minted Democratic presidential ticket in the sprint toward Election Day. “He’s the kind of person who makes people feel like they belong and then inspires them to dream big. … That’s the kind of vice president America deserves,” Harris said while standing with Walz in Philadelphia. Taking the microphone after Harris, Walz revved up the crowd for the rigorous campaign to come. “We’ve got 91 days. My God, that’s easy. We’ll sleep when we’re dead,” he said. The remarks reflected the urgency of the moment, with Harris tapping Walz for the ticket during one of the most turbulent periods in modern American politics. Republicans have rallied around former President Donald Trump after he was targeted in an attempted assassination in July. Just days later, President Joe Biden ended his reelection campaign, forcing Harris to scramble to unify Democrats and decide on a running mate over a breakneck two-week stretch. In choosing the 60-year-old Walz, Harris is elevating a Midwestern governor, military veteran and union supporter who helped enact an ambitious Democratic agenda for his state, including sweeping protections for abortion rights and generous aid to families. It was her biggest decision yet as the Democratic nominee and she went with a broadly palatable choice — someone who says politics should have more joy and who deflects dark and foreboding rhetoric from Republicans with a lighter touch, a strategy that the campaign has been increasingly turning to since Harris took over the top spot. Harris hopes Walz will help her shore up her campaign’s standing across the upper Midwest, a critical region in presidential politics that often serves as a buffer for Democrats seeking the White House. The party remains haunted by Trump’s wins in Michigan and Wisconsin in 2016. Trump lost those states in 2020 but has zeroed in on them as he aims to return to the presidency this year and is expanding his focus to Minnesota. Since Walz was announced, the team raised more than $20 million from grassroots donations, the campaign said. Walz is far from a household name. An ABC News/Ipsos survey conducted before he was selected but after vetting began showed that nearly 9 in 10 U.S. adults did not know enough to have an opinion about him. Harris devoted much of her speech to telling the audience about Walz’s life and work, which included stints as a social studies teacher and a football coach. “To those who know him best, Tim is more than a governor,” she said. “We both believe in lifting people up, not knocking them down,” she said. “We both know that the vast majority of us have so much more in common than what separates us. And we see in our fellow Americans neighbors, never enemies.” Harris, the first Black woman and person of South Asian descent to lead a major party ticket, initially considered nearly a dozen candidates before zeroing in on a handful of serious contenders. Trump has focused much of his campaign on appealing to men, emphasizing a need for strength in national leadership and even featuring the wrestler Hulk Hogan on the final night of the Republican National Convention. Harris’ finalists — all white men — marked an acknowledgement of the Democrat’s need to at least try to win over some of that demographic. She personally interviewed three finalists: Pennsylvania Gov. Josh Shapiro, Arizona Sen. Mark Kelly and Walz. Harris wanted someone with executive experience who could be a governing partner, and Walz also offered appeal to the widest swath of the diverse coalition. His selection drew praise from lawmakers as ideologically diverse as progressive leader Rep. Alexandria Ocasio-Cortez, D-N.Y., and independent Sen. Joe Manchin of West Virginia, a moderate who left the Democratic Party earlier this year. A team of lawyers and political operatives led by former Attorney General Eric Holder pored over documents and conducted interviews with potential selections. Harris mulled the decision over on Monday with top aides and finalized it Tuesday morning, according to three people familiar with Harris’ decision who spoke on condition of anonymity to describe private deliberations. Shapiro, an ambitious politician in his own right, struggled with the idea of being No. 2 at the White House and said he felt he had more to do in Pennsylvania, according to one of the people familiar with Harris’ decision. There was also public pushback to Shapiro for his stance on Israel from Arab American groups and younger voters angry over the administration’s response to the Israel-Hamas war. The other contenders threw their support behind the ticket Tuesday, and Shapiro was one of the speakers at Tuesday’s Philadelphia rally. Biden described the Harris and Walz ticket as “a powerful voice for working people and America’s great middle class.” Walz coined one of Democrats’ buzziest campaign bits to date, calling Trump and his running mate Ohio Sen. JD Vance “just weird,” a label that the Democratic Governors Association — of which Walz is chairman — amplified in a post on X and Democrats more broadly have echoed. On Tuesday, Walz said: “Just an observation of mind, I just have to say it. These guys are creepy and, yes, just weird as hell.” Harris, second gentleman Doug Emhoff and Walz will spend the next five days touring critical battleground states, visiting Wisconsin and Michigan on Wednesday and Arizona and Nevada later in the week. Vance, for his part, planned stops in some of the same areas. He said Tuesday that he called Walz earlier in the day and left a voice message. The Trump campaign on Tuesday immediately tried to tag Walz as a far-left liberal. “It’s no surprise that San Francisco Liberal Kamala Harris wants West Coast wannabe Tim Walz as her running-mate – Walz has spent his governorship trying to reshape Minnesota in the image of the Golden State,” said Karoline Leavitt, Trump’s campaign press secretary. Trump, who often weighs in on the news on his social media network, posted simply, “THANK YOU!” after the news of Walz’s selection was public. He followed up with another post a few hours later, proclaiming “This is the most Radical Left duo in American history” and suggested Biden “feels that he made a historically tragic mistake” and would try to get back in the race again. Walz, who grew up in the small town of West Point, Nebraska, was a teacher, coach and union member at Mankato West High School in Minnesota before entering politics. He won the first of six terms in Congress in 2006 from a mostly rural southern Minnesota district and used the office to champion veterans issues. Walz served 24 years in the Army National Guard, rising to command sergeant major, one of the highest enlisted ranks in the military, although he didn’t complete all the training before he retired so his rank for benefits purposes was set at master sergeant. He ran for governor in 2018 on the theme of “One Minnesota” and won by more than 11 points. David Ivory, a 46-year-old St. Paul resident, rode over to Walz’s residence on his bike with his kids shortly after the announcement to deliver their congratulations. “He’s just down to earth. He gets it. He can talk to anybody,” Ivory said. “He doesn’t seem like he’s above anybody.” As governor, Walz had to find ways to work in his first term with a legislature split between a Democratic-controlled House and a Republican-led Senate. Minnesota has a history of divided government, though, and the arrangement was surprisingly productive in his first year. Walz easily won reelection in 2022, and Democrats flipped the Senate to win full control of both chambers and the governor’s office for the first time in eight years. A big reason was the Dobbs decision from the conservative-majority Supreme Court that overturned a federal right to an abortion. Walz currently serves as co-chair of the bipartisan Council of Governors, advising the president and the Cabinet on homeland security and national defense issues. He was first appointed to the position by Trump, then later reappointed by Biden. Miller, Long and Kim reported from Washington. Karnowski reported from Minneapolis. Associated Press writers Michael Balsamo and Michelle L. Price in New York and Michael Goldberg in Minneapolis contributed to this report.","summary":"“We’ve got 91 days. My God, that’s easy. We’ll sleep when we’re dead,\" Walz said.\n\n\nThe post Harris introduces new running mate Minnesota Gov. Tim Walz as the &#8216;vice president America deserves&#8217; appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2024/08/06/harris-introduces-new-running-mate-minnesota-gov-tim-walz-as-the-vice-president-america-deserves/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/08/Election_2024_Harris_15484-66b2ba9faed21-768x432.jpg","video":null,"publish_date":"2024-08-07 00:11:29","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.224},{"id":253539194,"title":"Tim Walz Tears Into GOP Ticket at Raucous Philadelphia Rally","text":"PHILADELPHIA — Democrats packed a Philadelphia basketball arena to the gills on Tuesday, with more than 10,000 raucous supporters cheering on Kamala Harris and her newly-named running mate Tim Walz. In his first speech since becoming the presumptive vice presidential candidate, Walz roasted Donald Trump and J.D. Vance, as he declared that the next 91 days would not just be about winning the election, but to doing it “with a sense of joy.” The mood inside Temple University’s basketball arena was certainly joyful — ebullient even, bordering on orgiastic. Crowded together under enormous “Harris and Walz” signs and sporting light-up wristbands like the kind Taylor Swift gives out at the Eras Tour, Philadelphians helped Harris and Walz kick off a tour of their own: a five-day blitz through seven battleground states, starting with the most important one on the map for Democrats this November: Pennsylvania. The pair walked out on stage together early Tuesday evening, just hours after a fleet of black SUVs converged on the Minnesota governor’s St. Paul residence early Tuesday morning and plunged him directly into the center of the 2024 election vortex, and one day after Harris clinched the top spot on the Democratic ticket. Addressing the throngs of screaming supporters, Harris introduced the world to Walz: a teacher, national guardsman, congressman, governor, and coach that helped take a high school football team from a winless season to state championship. When it was Walz’ turn to speak, he told the crowd that it was his students who inspired him to get into politics. “They encouraged me to run for office. They saw in me what I was hoping to instill in them: a commitment of common good, a belief that one person can make a difference,” Walz said. “And because high school teachers are super optimistic, I was running in a district that had one Democrat since 1892.” Walz went on to draw a contrast between the work he did when he arrived in Congress — on the Veterans Affairs committee and on behalf of rural communities — with Trump’s priorities as president, and the Republican Party at large. “Some of us are old enough to remember … when the Republicans were the party of freedom,” Walz said. “It turns out now what they meant was the government should be free to invade your doctor’s office. In Minnesota, we respect our neighbors and their personal choices that they make — even if we want to make the same choice for ourselves. There’s a golden rule: mind your own damn business.” He also, as he has done in the weeks leading up Harris tapping him as her running mate on Tuesday, went after Trump and Vance. “These guys are creepy and, yes, just weird as hell,” he said to huge applause. “That’s what you see. That’s what you see.” Walz even joked about an unfounded rumor that Vance had sex with a couch. “I can’t wait to the debate the guy,” he said before waiting several seconds for the applause to subside. “That is if he’s willing to get off the couch and show up.” If the crowd’s reaction was any indication, they approved of Harris’s choice in a running mate. The vice president had a historically truncated window to consider a decision after she emerged as the party’s choice to take on Trump when President Joe Biden decided to leave the race last month. She chose Walz over Pennsylvania Gov. Josh Shapiro, who who was also on hand on Tuesday. Shapiro took the stage to thunderous applause, taking several beats to soak it up before telling the crowd, as if to preempt any accusations of hard feelings, “I love you Philadelphia — and you know what else I love? I love being your governor.” Harris’ choice has been widely praised online, and certainly in Philadelphia on Tuesday, but even as Walz has received a warm welcome, some attendees at Tuesday’s rally admitted they weren’t well acquainted with Walz before his name began circulating in the veepstakes. Tameka Bates, a SIEU union member, was thrilled to see Harris. But as for Walz? “I don’t know much about him, I’ve just heard about him this morning,” she said. Jan Ostroff said she had only learned of Walz in the last few weeks as his profile rose as he appeared on TV auditioning for the role of amiable attack dog. “I would have been happy with any of her choices for vice president, but I’m really happy with him, because this way we get to keep Josh Shapiro for ourselves for a little while longer,” Ostroff said. The near-universal praise of Walz — from figures as far apart ideologically as Alexandria Ocasio-Cortez and Joe Manchin — stood in stark contrast to the Republican party’s reception of J.D. Vance just a few weeks before. Vance, who had a favorability of -5 percent when Trump asked him to join the ticket has only seen his standing tank to -14 percent as more Americans have gotten to know him, earning him the distinction of being the least-liked vice presidential pick in history. (It’s hardly surprising considering Vance’s three biggest media moments have revolved around a false rumor that he fucked a couch, ongoing damage control about his 2021 attacking “childless cat ladies,” and a charming anecdote in which he told his son to “shut the hell up” while he was on the phone with Trump. Ahead of the love-fest at Temple University, Vance held his own appearance in Philadelphia, attended by a comparatively small smattering of supporters. The Trump campaign made the questionable decision of sending Vance on the road to hold an event in every city that Harris and Walz are set to hold events in this week. The split screen in Philadelphia was stark. Vance struggled to fill a room with a one-tenth of the capacity of the arena the Democratic ticket was appearing. He spoke in front of a banner that read “Kamala Chaos,” but it was hung too low, so event attendees blocked out “Chaos” and at first glance it looked like Vance was at a Harris event. Trump, meanwhile, is spending the week at Mar-a-Lago, where, yesterday, he met with a seat-sniffing Kick streamer, who may have violated FEC rules by gifting Trump both a Rolex and Cyber Truck emblazoned with his image. He has just one appearance planned this week, in Montana.","summary":"The Minnesota governor announced himself as Kamala Harris’ running mate in front of a massive crowd in the swing state","url":"https://www.rollingstone.com/politics/politics-features/tim-walz-trump-vance-philadelphia-rally-1235074871/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/walz-and-harris-attack-dog.jpg","video":null,"publish_date":"2024-08-07 00:07:22","author":"Tessa Stuart,Tessa Suart","authors":["Tessa Stuart","Tessa Suart"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.373},{"id":253538712,"title":"Walz attacks Trump, Vance in first appearance as Harris’s running mate: 'They are creepy, weird'","text":"Tim Walz made a strong debut as Vice President Kamala Harris’s running mate, launching sharp attacks against former President Donald Trump and Republican vice-presidential nominee Sen. JD Vance (Ohio) at a rally in Philadelphia.In a spirited speech, Walz took aim at Trump and Vance, echoing a viral new characterization of the Trump campaign. “I just have to say it. You know it. You feel it. These guys are creepy and, yes, just weird as hell. That’s what you see,” Walz told the energized crowd, drawing loud applause.Walz warned that a second Trump presidency would be even more damaging than the first, predicting a rollback of key social programs and a nationwide abortion ban. “If Trump gets a chance to return, he’s going to pick up exactly where he left off four years ago. Only this time, it will be much, much worse,” Walz said, highlighting the stakes of the upcoming election.The Minnesota governor contrasted his working-class background with Trump’s wealth and privilege. “He never sat at that kitchen table, like the one I grew up at, wondering how we were going to pay the bills. He sat at his country club in Mar-a-Lago, wondering how he can cut taxes for his rich friends,” Walz said.— KamalaHQ (@KamalaHQ) Turning his attention to Vance, Walz accused his vice-presidential rival of sharing Trump’s “dangerous and backward agenda.” Walz sarcastically noted Vance’s privileged path to prominence, “Like all regular people I grew up with in the heartland, JD studied at Yale, had his career funded by Silicon Valley billionaires, and then wrote a bestseller trashing that community. Come on! That’s not what middle America is,” Walz said, expressing eagerness for the upcoming debate.Walz’s selection as Harris’s running mate came after a competitive “veepstakes” following President Biden’s unexpected decision to exit the 2024 race. Pennsylvania Gov. Josh Shapiro and Arizona Sen. Mark Kelly were also considered top contenders for the vice-presidential slot.The Harris-Walz ticket is set to challenge the Trump-Vance ticket this fall, with Walz’s rise fueled by his recent viral branding of Republicans as “weird,” a term now being embraced by other leading Democrats.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/walz-attacks-trump-and-vance-in-first-appearance-as-harriss-running-mate-they-are-creepy-weird-as-hell/articleshow/112331495.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112331626/112331626.jpg","video":null,"publish_date":"2024-08-07 00:06:50","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"IN","sentiment":0.073},{"id":253538412,"title":"Running mate: Obama, Clinton hail Harris on Minnesota gov choice","text":"Kamala Harris said Tuesday she was “proud” to pick Tim Walz as her running mate, opting for the Minnesota governor with blue-collar credentials as the partner most likely to boost her historic White House bid. Walz had been on a vice-presidential shortlist with a string of other Democratic figures seen as broadening Harris’s appeal as she sprints into the contest against Donald Trump. Aiming to make history as the first woman United States president, Harris – already a trailblazer as the first female and first Black and South Asian vice president – has little time before Election Day on November 5, AFP reports. “I am proud to announce that I’ve asked Tim Walz to be my running mate,” she posted on X. “As a governor, a coach, a teacher, and a veteran, he’s delivered for working families like his. It’s great to have him on the team.” President Joe Biden quickly expressed support for his deputy’s “great decision” to choose Walz, saying the duo “will be a powerful voice for working people and America’s great middle class.” In a statement shared on his X handle on Tuesday, former US President Barack Obama, and his wife, Michelle, also commended the Harris-Walz ticket. Obama said, “Like Vice President Harris, Governor #Tim_Walz believes that government works to serve us. Not just some of us, but all of us. That’s what makes him an outstanding governor, and that’s what will make him an even better Vice President. Michelle and I couldn’t be happier for Tim and Gwen, their family, and our country,” he wrote. Ex-President Bill Clinton also said on X that Walz had walked the walk, “and he’ll be a great vice president.” Expectations had always been that Harris would pick a white man to balance the ticket and help win over working-class, white, male voters, a demographic that propelled Trump to victory in 2016. Walz fits that description as a 60-year-old Midwesterner with a folksy manner, decades of military experience and a rural perspective. He dismisses the “nonsense” of Trump and Republican running mate J.D. Vance, and he is also a gun owner who tweets about hunting, goes ice-fishing and rides rollercoasters with his daughter. The onetime teacher and school sports coach flipped a Republican district in 2006 to win a seat in the House of Representatives in a state seen as light years from the coastal elites of California, Harris’s home turf, or the East Coast. At the same time, Walz will appeal to the left to champion cannabis legalization, worker protections, abortion rights, and tighter firearm restrictions. Trump’s campaign branded the Minnesotan as a “dangerously liberal extremist” seeking to impose California values on the nation. Democratic grandee Nancy Pelosi swatted such criticism aside, telling MSNBC that Walz “is right down the middle. He’s a heartland of America Democrat.” Walz earned enthusiastic endorsements from Democratic liberals as well as centrists like Senator Joe Manchin, who called him “the real deal.” After being named by Harris, he said it was the “honour of a lifetime” and quipped it felt like “the first day of school.” The pair will hit the campaign trail immediately, launching a five-day swing through battleground states starting Tuesday in the biggest prize, Pennsylvania.","summary":"Kamala Harris said Tuesday she was “proud” to pick Tim Walz as her running mate, opting for the Minnesota governor with blue-collar credentials as the partner most likely to boost her historic White House bid. Walz had been on a vice-presidential shortlist with a string of other Democratic figures seen as broadening Harris’s appeal as \n\n\n \n Read More","url":"https://punchng.com/running-mate-obama-clinton-hail-harris-on-minnesota-gov-choice/","image":"https://cdn.punchng.com/wp-content/uploads/2024/08/06142645/Governor-Tim-Walz.jpg","video":null,"publish_date":"2024-08-07 00:05:09","author":"Our Reporters","authors":["Our Reporters"],"language":"en","source_country":"ng","sentiment":0.295},{"id":253539052,"title":"Kamala Harris and Tim Walz fire up crowd in first rally as running mates – live","text":"In her first appearance with her newly minted running mate, Harris sought to define him foremost as a teacher and football coach. He was, she said, “the kind of teacher and mentor that every child in America dreams of having”. She told a story about him agreeing to be faculty adviser to his school’s gay-straight alliance, knowing “the signal it would send to have a football coach get involved”. He was, “the kind of coach, because he’s the kind of person, who inspires people to dream big”. Harris also spoke about Walz’s skills as a marksman, and his views on the second amendment: he is in favour, but with caveats for background checks and red flags. Walz was the highest ranking enlisted man to ever serve in US congress and the top Democrat on the veterans’ committee, she said. He was also known as one of Capitol Hill’s best marksmen. She also used football references, comparing him and Vance to “a matchup between the varsity team and the [junior varsity] squad”. Walz, who like Harris is known for his smile, started his speech by saying: “Thank you for the trust you put in me, but more so, thank you for bringing back the joy. “If Donald Trump and JD Vance are irritated that Kamala Harris smiles and laughs, they’re really going to be irritated by Tim Walz,” Melissa Hortman, the Democratic speaker of Minnesota’s house of representatives, told the Guardian on Tuesday. He also said: “Don’t ever underestimate teachers.” Walz’s wife, Gwen, is a teacher, too. When Walz talked about Trump, he pivoted quickly, and effectively, from talking about Republicans interfering with healthcare, to his own daughter being born thanks to IVF, to children fearing that they will be shot at school. “In Minnesota we respect our neighbours for the personal choices they make,” he said. “That includes IVF.” He talked about his daughter Hope, who often appears in videos and photographs with her father, being born through IVF. Abortion opponents have been increasingly pushing for broader measures that would give rights and protections to embryos and fetuses, which could have huge implications for fertility treatments and other areas of healthcare. Walz said “It wasn’t by chance that, when we welcomed our daughter into the world, we named her Hope.” Then he said that when he and Harris talk about freedom, they mean the freedom to make your own choice about your body, and the freedom for children to go to school and not worry about being shot. He called on people to “settle our political differences not with violence, but with votes” and said of Trump: “Don’t believe him when he plays dumb. He knows exactly what Project 2025 will to do restrict our freedoms.” He added of a second Trump term: “Only this time it will be much, much worse.” Walz seasoned his remarks with midwestern dialect, adding a “damn well” here and a “come on” there. “Say it with me! We are not going back,” he said, starting a chant from the audience. “We’ve got 91 days. My God, that’s easy,” he said. “We’ll sleep when we’re dead.” Walz made a couch reference. Walz said his GOP rival and Trump “are creepy and yes, they’re weird as hell”. He added that he “can’t wait to debate the guy”. Then, to sustained cheers and laughter, he made a reference to the baseless, but much-shared, claim that JD Vance admitted to having sex with a couch in his memoir. “That is if he’s willing to get off the couch and show up.” Stumping earlier today in Pennsylvania, Vance said, “I absolutely want to debate Tim Walz,” but not until after the Democratic convention.","summary":"Democrats lay out vision for America and attack Trump and Vance at Philadelphia event\n\n\nWho is Tim Walz?\nHow could Walz’s political record help and hurt Harris?As we await Kamala Harris’s running mate announcement, Americans in some states are heading to the polls today.\n\nVoters in Kansas, Michigan, Missouri and Washington state will cast ballots in their congressional primaries today. Results in Michigan will be especially scrutinized, as the battleground state will play a key role in the presidential election.\n\nThe American Israel Public Affairs Committee (Aipac) pumped more than $8.5m into the race in Missouri’s first congressional district in support of Bush’s rival, St Louis prosecutor Wesley Bell, through its campaign funding arm, the United Democracy Project (UDP). …\n\nThe UDP accounts for more than half of all the money spent on the race outside of the campaigns themselves. Much of it comes from billionaires who fund hardline pro-Israel causes and Republicans in other races, including some who have giv","url":"https://www.theguardian.com/us-news/live/2024/aug/06/kamala-harris-vp-running-mate-election-update","image":"https://i.guim.co.uk/img/media/00d57b3a72a89008df1d90928851cb0e8e6eae65/0_237_3558_2135/master/3558.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl","video":null,"publish_date":"2024-08-07 00:03:10","author":"Helen Sullivan,Lili Bayer,Maanvi Singh","authors":["Helen Sullivan","Lili Bayer","Maanvi Singh"],"language":"en","source_country":"us","sentiment":0.29},{"id":253539814,"title":"How 'weird.' One word put Kamala Harris on the path to selecting Tim Walz to be her running mate","text":"Minnesota Gov. Tim Walz, tapped by Democratic presidential nominee Kamala Harris to be her running mate Tuesday, catapulted from being a relative unknown on the national stage to a vice president contender in a matter of days — largely on the basis of a single word gone viral in various iterations. The word? “Weird.” Walz used it to describe former President Donald Trump, the Republican nominee and his vice president pick, Ohio Sen. JD Vance. In a July 23 MSNBC “Morning Joe” segment, Walz said, “These guys are just weird.” The one-word framing caught fire. It spoke to people. And it caught on. Democrats used it. Vice President Harris embraced it. At a rally last week in Atlanta, she said the GOP ticket was “just plain weird.” In this 2024 election, where people have an overload of choices of how to receive political information, it turns out that one word spoke volumes across generations. “Weird” struck the right tone. More punch, in its own way, than the school boy insults Trump uses to taunt Harris, like calling her “low IQ.” And “weird” pushed Walz to the front of the line and in a position to prevail over very capable rivals. Observations: ‘Hi, this is Tim’ The campaign put out a video of Harris calling Walz on Tuesday morning to give him the news. It was evocative of the video Joe Biden’s campaign produced when he called Harris in 2000 to offer her a spot on his ticket. Walz picked up on one ring. “Hi, this is Tim,” he said, as if he did not have a clue who was phoning. Said Harris, “Listen, I want you to do this with me. Lets, lets do this together. Would you be my running mate and let’s get this thing on the road?” He accepted. What Walz was wearing — whether planned or not — showed the image the newly minted Harris-Walz ticket hopes to convey to middle class folks in the crucial swing states. The former Army National Guard reservist was wearing what appeared to be a camouflage cap, black T-shirt, khaki pants and white sports shoes. Every day since Biden announced on July 21 he would not seek another term has been head-spinning. The underestimated Harris locked up the nomination in a day. And something remarkable happened, perhaps grist for political history books. Depressed Democrats saw sunlight. They contributed stunning amounts money, signed up to be volunteers, joined thousands on Zoom calls and recaptured that intangible political exuberance not experienced in years, even before Biden’s decline. The Harris-Walz ticket debuted Tuesday night in Philadelphia. The road to the White House — to 270 electoral votes — goes through swing states Pennsylvania, Michigan and Wisconsin. The folks in the packed Philadelphia hall affirmed her choice. As for others, they were applauding and validating the Walz selection with their pocketbooks. On Tuesday evening, the campaign reported more than $20 million had been raised since the morning Walz announcement. In Philadelphia, the message was: ‘It’s a fight for the future’ On Monday night, with the virtual roll call complete, Harris became the official Democratic nominee. There will be a symbolic roll call on the second evening of the Democratic National Convention in Chicago, running Aug. 19-22. Harris understands what she wants her campaign to be, since fighting over the past Trump seems mired in is not the best formula for winning the White House. “Our campaign is not just against Donald Trump,” she said. The campaign “is a fight for the future.” You’ll be hearing that a lot. At least for now. Harris, by necessity moving fast, did not have the luxury of using months to road-test lines. In talking about Walz, Harris summarized his bio by running through his many titles in easy to remember ways.That’s important, because Walz needs to be introduced to voters. There’s no need, by the way, to be embarrassed if you never heard of Walz before today. A tell on me: In 2008, when Sen. John McCain, the GOP presidential nominee, announced his running mate — then Alaska Gov. Sarah Palin — I had never heard her name. Harris told the story about what you should know about Walz. He’s a governor. A husband. To his kids, Hope and Gus, “he’s a dad.” He is Sgt. Major Walz. For those in his old House district in southern Minnesota, he was Congressman Walz. To his former high school students he was Mr. Walz. To his ex-football players he was Coach. Said Harris, “And in 91 days he’ll be known by another name. Vice President.”","url":"https://chicago.suntimes.com/columnists/2024/08/06/kamala-harris-tim-walz-democratic-vice-president-nominee-trump-vance-weird","image":"https://cst.brightspotcdn.com/dims4/default/3dee8ce/2147483647/strip/true/crop/5033x2873+0+243/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fdf%2F52%2Fa959d6f1435fb198afc3c02c474a%2Fap24","video":null,"publish_date":"2024-08-07 00:02:33","author":"Lynn Sweet","authors":["Lynn Sweet"],"language":"en","source_country":"us","sentiment":-0.233},{"id":253538382,"title":"AOC Accused of Hypocrisy for Criticizing JD Vance on ‘Manspreading’ Despite Similar Behavior Caught on Camera","text":"Alexandria Ocasio-Cortez was slammed for her apparent hypocrisy after putting JD Vance on blast for ‘manspreading’ – then quickly being caught in the same sitting position. The New York congresswoman reacted with distaste to a clip of Vance sitting comfortably in a cushy, wide chair – with his legs spread in a relaxed manner. ‘Why are you sitting like that,’ she wrote on Tuesday, in an apparent jab at Vance’s spread eagle stance. But AOC’s mockery was deconstructed within minutes. Clown World, an account on X known for criticizing liberals, took a screenshot of AOC’s post and placed it side-by-side with her own wide sitting posture from less than two years ago. ‘AOC,’ the account wrote over her criticism of Vance. ‘Also AOC,’ the labeled the image of her wide stance. Many other people replied with the same image of AOC’s wide sitting stance. Another user posted a picture of AOC sitting at a table at a restaurant with her boyfriend Riley Roberts, who was sitting with his legs crossed. ‘Why is he sitting like that,’ the user asked. Vance, former President Donald Trump’s running mate, had been skewered by other liberal accounts on X for how he was sitting during his appearance on the Full Send Podcast last Friday. But with her enormous following, AOC brought new attention to the clip and now, some internet backlash for doing the same thing. The photograph of AOC sitting on stage comes from a campaign event she held in October 2022 ahead of the contentious midterms – a contest where the Republicans captured a majority in the House of Representatives and the Democrats maintained control of the Senate. The event was being held in a small auditorium in her district and several protestors were recorded by X user Danny De Urbina chanting ‘AOC has got to go.’ One man was banging a drum to punctuate the shouts from his allies. The camera then pans back to AOC who was sitting on stage with her legs spread and dancing to the drum beat, trying to appear unbothered by the interruption. One woman could also be heard repeatedly calling AOC a ‘sellout.’ A spokesperson for the liberal congresswoman provided a statement to Newsweek following the event calling the people shouting her down disruptors that were ‘part of a far-right wing group that regularly protests at vaccine clinics, against LGBTQ rights, etc.’ ‘They were not constituents,’ the spokesperson added. ‘We do thank the numerous constituents from Astoria who turned out last night to engage in the civic process. We’re grateful that we were still able to have a meaningful dialogue, in spite of that group of outsiders.’ Vance also has a history of attacking AOC. Back when he was running for his Ohio Senate seat in 2021, he spoke to a Catholic group about her ‘sociopathic’ attitude toward families and children, the Guardian reported. ‘Maybe AOC hasn’t found the right person, whatever the case may be. AOC has said basically – if you look at her public remarks on this – that it’s immoral to have children because of climate change concerns. Right? This is, let’s just be direct, a sociopathic attitude towards family,’ Vance said. AOC did in fact question the ethics of having kids in a world that’s being affected by climate change back shortly after she was elected in 2018. ‘Basically, there’s a scientific consensus that the lives of children are going to be very difficult. And it does lead, I think, young people to have a legitimate question: Is it okay to still have children?’ she said in an Instagram live from March 2019. Vance’s attacks on AOC regarding her views on family was around the time he made his infamous comments about the US being run by ‘a bunch of childless cat ladies,’ remarks that have resurfaced since his VP appointment. He specifically name-dropped Vice President Kamala Harris, AOC and Pete Buttigieg.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAlexandria Ocasio-Cortez was slammed for her apparent hypocrisy after putting JD Vance on blast for&#8230;\n\n\nThis Post: AOC Accused of Hypocrisy for Criticizing JD Vance on &#8216;Manspreading&#8217; Despite Similar Behavior Caught on Camera first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/aoc-accused-of-hypocrisy-for-criticizing-jd-vance-on-manspreading-despite-similar-behavior-caught-on-camera/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-AOC-is-accused-of-hypocrisy-after-she.jpg","video":null,"publish_date":"2024-08-07 00:00:45","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.165},{"id":253539880,"title":"When Trump Slammed Prince Harry for His 'Royal Betrayal': \"That's Unforgivable\"","text":"In April, Prince Harry formally declared himself a citizen of the United States. According to NBC News, a travel agency under his ownership submitted documentation to British officials stating that he had since relocated to the States and is now \"usually resident.\" As per a recent U.K. regulatory filing, the Duke of Sussex created Travalyst Ltd., which demonstrated that he will be using his current address as his primary residence for business purposes. However, former president Donald Trump has vowed that he wouldn't extend Harry's visa if reelected. \"I wouldn't protect him. He betrayed the queen. That's unforgivable,\" Trump said in an exclusive with Daily Express. \"He would be on his own if it was down to me.\" In the middle of a legal dispute over the legality of the royal's immigration status, Trump further charged that the Biden administration was \"protecting Harry\". The Republican leader's remarks were made 24 hours after Prince Harry had his court appearance on allegations that he had lied about using drugs, a habit he had acknowledged in his bombshell memoir Spare. The Heritage Foundation is pursuing the legal case against Biden's Department of Homeland Security claiming that evidence of previous drug usage may be used to deny a visa application under US immigration laws. In an attempt to cope with the loss of his mother, Prince Harry confessed in the book to having experimented with cocaine and psychedelic mushrooms as well as using marijuana with friends in his early years. The foundation asserted that because prior drug usage may disqualify applicants, these statements cast doubt on the legality of his visa. As reported by The List, Trump further criticized the Duke without elaborating on how he had deceived the late Queen Elizabeth II. But the former president who reacted deeply to the queen's passing probably alluded to Harry's general distancing from the royal family. Meanwhile, royal biographer Robert Hardman claimed in his book Charles III: New King. New Court The Inside Story that the couple's comments on the name of their daughter, Princess Lilibet, was one of the many reasons that offended the late queen. The name was taken from Her Majesty's childhood moniker, which the queen was said to have approved of, but Hardman revealed that this was untrue. \"The root of the issue was not Harry and Meghan naming their daughter Lilibet,\" he told Us Weekly. \"It was when they said that this had all been done with [the queen's] blessing.\" According to Newsweek, touching on the subject of royal deportation, Eric Trump recently echoed his father's words and described the Sussexes as \"spoiled apples.\" \"What I can tell you is my father had so much respect for the queen, as did I,\" he said. \"My mom [the late Ivana Trump] knew so many of them for years, I think you probably know that, had a great relationship with Diana and everyone else,\" he told in an exclusive to GB News. Eric further stated, \"You know, that's a very sacred institution and you can happily have those two back. We'll happily send them back from America, you can have them back over here, but I'm not sure you guys want them any more than we might not want them anymore. They feel like they're on a little bit of an island of their own. But listen, you can always have bad actors in anything, you can always have spoiled apples in every orchard, but the institution of the royal family is beautiful and it's something that is actually admired by a lot of Americans.\"","summary":"Eric Trump recently echoed his father&#39;s words and described the Sussexes as &#34;spoiled apples.&#34; &#34;We&#39;ll happily send them back from America,&#34; he added.","url":"https://www.inquisitr.com/when-trump-slammed-prince-harry-for-his-royal-betrayal-thats-unforgivable","image":"https://dab57h0r8ahff.cloudfront.net/709262/uploads/91b1e390-53c2-11ef-8000-41f6986904a4_1200_630.jpeg","video":null,"publish_date":"2024-08-07 00:00:01","author":"INQUISITR,Mary Anthony","authors":["INQUISITR","Mary Anthony"],"language":"en","source_country":"US","sentiment":-0.142},{"id":253538340,"title":"Harris taps ‘down the middle’ midwestern running mate to foil GOP’s ‘San Francisco liberal’ jabs","text":"When Kamala Harris picked Minnesota Gov. Tim Walz as her running mate Tuesday, former House Speaker Nancy Pelosi praised him as a “heartland of American Democrat” and a “down the middle” Midwesterner who will appeal to working class families and rural Americans. In other words, a perfect balance to Oakland-born and Berkeley-raised Harris, the daughter of 1960s Berkeley civil rights activists. Ninety days to the presidential election, Harris and Walz appeared at their first rally together Tuesday afternoon at Temple University in Philadelphia. The indoor arena was bursting with a capacity crowd of about 10,000 people, a stark contrast to a joint Philadelphia rally with Biden and Harris in late May when they filled one-third of a school gym. In front of the deafening crowd, Walz talked about Harris’s career as a prosecutor and attorney general in California and how she “fought on the side of the American people.” Then he launched into his own Midwest upbringing, how he spent summers working on the family farm in Nebraska. “These same values I learned on the family farm and tried to instill in my students, I took to Congress and the state capital, and now, Vice President Harris and I are running to take them to the White House,” he said. He also took a shot at Trump. “Donald Trump — he sees the world differently,” Walz said. “He doesn’t know the first thing about service — because he’s too busy serving himself.” The GOP messaging against Walz started almost immediately: Walz is a “West Coast wannabe,” the Trump campaign said in a statement, who is “obsessed with spreading California’s dangerously liberal agenda far and wide.” Trump’s running mate J.D. Vance quickly portrayed Walz as a “San Francisco-style liberal.” As each side scrambled Tuesday to define the largely unknown Minnesota governor in an ever-tightening presidential race, California and the Bay Area have, once again, become the bogeyman of presidential election politics, would-be examples of progressivism run amok. “Republicans have clearly discovered that California is a bad brand in the Midwest for Midwest voters,” said UC San Diego political science professor Thad Kousser. “So they’re trying to do everything they can to tie someone to this brand, as if Kamala Harris chose (Gov.) Gavin Newsom as her running mate.” (Newsom, for his part, sent out a press release Tuesday, describing Walz as “a brilliant choice” and seeking donations to their campaigns.) Among the finalists Harris considered for the vice president role — including Gov. Josh Shapiro of Pennsylvania and U.S. Sen. Mark Kelly of Arizona — Walz can be seen as the most liberal. He championed a free lunch program for all Minnesota students, was an early supporter of gay rights, and has championed tighter gun controls. Harris’ choice is a risk, said Dan Schnur who teaches political communications at UC Berkeley and USC. “Generally, when you have a more progressive candidate, you want to balance the ticket with someone more centrist,” Schnur said. “Harris has benefited over the last few weeks from this tremendous, tremendous enthusiasm and excitement from the Democratic base. They may be calculating that keeping that excitement going is their best bet.” California became a foil to Donald Trump in 2015, when he was running for president the first time and an undocumented immigrant killed a young San Francisco woman with a stolen gun. Trump assailed San Francisco’s “sanctuary city” policies. The city, as well as Pelosi, have become favorite GOP targets ever since. Some believe that Pelosi, who still represents San Francisco in Congress and recently published “The Art of Power,” may well have exerted her legendary influence over Harris’s selection. “Pelosi clearly has been a driver of this,” said Sonoma State Political Science Professor David McCuan. “She is someone who clearly is the political godmother of the vice president in a positive way, in a mature way, because she gives her the running room to make her own decisions.” Despite Trump’s characterization of Walz as spending his governorship “trying to reshape Minnesota in the image of the Golden State,” Walz brings personal assets that tend to appeal to more moderate voters — the ones the Harris-Walz campaign will be taking to the swing states in the three months running up to the Nov. 5 election. Walz is the highest non-commissioned officer ever to serve in the U.S. House, he is an avid hunter and fisherman, a former history teacher and football coach. And ay 60, he’s a white middle-aged man. As U.S. Rep. Dean Phillips, the Minnesota Democrat who ran against Biden in the Democratic primaries, put it: “Tim Walz can fix a lawnmower, fire a cannon, and fiercely protect women’s freedoms. All in one day.” Lyndsey Schlax, a Democrat and history teacher from the East Bay city of Alameda, says that while she doesn’t agree with everything about Walz — or Harris for that matter — she is looking for a little levity in the presidential campaign that the ticket can bring. She’s been watching memes her friends sent her all morning. “There’s a lot of laughter. There’s a lot of jokes. There’s silliness. There’s all these pictures, like Walz holding a piglet and laughing his head off, or posting a picture of his cat being upset that the cat didn’t get Taylor Swift tickets,” Schlax, 43, said. “That so just taps into this kind of feeling of joy and hope.” But will any of it matter on election day in November? Vice presidential candidates rarely move the needle much, although there’s potential to lose voters if they mess up, like some suggest Vance has by denigrating women without children who love cats. “Really, what Kamala Harris did is a safe pick that she hopes solidifies her support in Minnesota and extends to places like Michigan and Wisconsin,” said Kousser from UC San Diego. “And if it just does that and doesn’t get her in trouble, that’ll be a successful VP pick.”","summary":"\"What Kamala Harris did is a safe pick,\" said political science professor Thad Kousser from UC San Diego.","url":"https://www.mercurynews.com/2024/08/06/harris-taps-down-the-middle-midwestern-running-mate-to-foil-gops-san-francisco-liberal-jabs/","image":"https://www.mercurynews.com/wp-content/uploads/2021/08/mn-logo-sm.png","video":null,"publish_date":"2024-08-06 23:59:11","author":"Julia Prodis Sulek","authors":["Julia Prodis Sulek"],"language":"en","source_country":"us","sentiment":0.163},{"id":253538314,"title":"Tim Walz Says He Looks Forward to Debating JD Vance If He’ll ‘Get Off the Couch’","text":"Making his debut as a vice presidential candidate on Tuesday, Tim Walz staked his claim to Middle American values and argued that former President Donald Trump and his running mate, JD Vance, are “weird” and “creepy as hell.” Walz, the governor of Minnesota, also got the packed arena laughing with a reference to a meme […]","summary":"Making his debut as a vice presidential candidate on Tuesday, Tim Walz staked his claim to Middle American values and argued that former President Donald Trump and his running mate, JD Vance, are &#8220;weird&#8221; and &#8220;creepy as hell.&#8221; Walz, the governor of Minnesota, also got the packed arena laughing with a reference to a meme [&#8230;]","url":"https://variety.com/2024/politics/news/tim-walz-jd-vance-couch-joke-vice-president-kamala-harris-1236097988/","image":"https://variety.com/wp-content/uploads/2024/08/GettyImages-2165604133-1.jpg","video":null,"publish_date":"2024-08-06 23:56:32","author":"Gene Maddaus,Gmaddaus","authors":["Gene Maddaus","Gmaddaus"],"language":"en","source_country":"US","sentiment":0.372},{"id":253538324,"title":"Adin Ross May Be in Trouble After Donald Trump Stream","text":"Adin Ross has possibly violated campaign finance laws by giving Donald Trump several lavish gifts. The Kick star presented the presents to the former president during a recent livestream. Adin Ross's Kick livestream with Donald Trump took place on August 5. The 90-minute broadcast saw the pair discuss a variety of topics, with Ross also using it as an opportunity to gift a Rolex watch and a custom Tesla Cybertruck to the Republican presidential nominee. FEC Limits Individuals' Campaign Contributions to $3,300 Per Candidate But doing so was possibly a violation of campaign finance laws. That's according to Daniel Weiner, a doctor of law and the current director of the elections and government program at the Brennan Center for Justice nonprofit. In a recent statement provided to The Washington Post, Weiner explained that Trump's status as a presidential candidate makes him subject to federal contribution limits. For the 2023/24 federal elections, those limits amount to $3,300 worth of contributions that any given individual is allowed to make to a single election campaign, according to the Federal Election Commission (FEC). The restrictions don't just apply to money but anything of value, Weiner explained. Adin Ross's Gifts to Trump Possibly Exceed $120,000 in Value Adin Ross's gifts to Trump have likely exceeded that amount by several orders of magnitude. The watch that he gave to the former U.S. president appears to have been a yellow gold Rolex Day-Date with a green dial. The cheapest brand-new timepiece fitting that description currently retails at approximately $40,000. Meanwhile, the 2024 stateside price of Tesla's Cybertruck ranges from $81,895 to $101,985, depending on the exact configuration. Since the vehicle that Ross gifted features a custom paint job depicting the July 13 Trump assassination attempt, its value is ostensibly closer to the upper end of that range. Trump Campaign to Seek Federal Guidance on 'How to Handle' Ross's Lavish Gifts Weiner conceded that Ross might have presented the gifts on behalf of his company or another legal entity. And while that would make the point about contribution limits moot, as corporations aren't limited in how much they can spend on electoral advocacy, it would still be illegal because companies are barred from contributing directly to election campaigns, Weiner concluded. In a statement provided to The Washington Post, Trump campaign spokesperson Karoline Leavitt said that the campaign will ask the FEC for \"guidance on how to handle the gifts.\" Although Adin Ross's gifts to Trump could hence constitute a violation of campaign finance laws, it is currently unclear whether the Kick streamer is facing any legal trouble for them. The FEC, which would be in charge of sanctioning any violations of this sort, declined to comment on the matter for The Washington Post. Source: FEC","summary":"Kick star Adin Ross might be facing some trouble over his recent 90-minute livestream featuring former U.S. President Donald Trump.","url":"https://gamerant.com/adin-ross-donald-trump-stream-gifts-donations-campaign-regulations/","image":"https://static0.gamerantimages.com/wordpress/wp-content/uploads/2024/08/adin-ross-donald-trump-stream-from-inside-custom-tesla-cybertruck.jpg","video":null,"publish_date":"2024-08-06 23:55:14","author":"Dominik Bonjak,Dominik Bošnjak","authors":["Dominik Bonjak","Dominik Bošnjak"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.079},{"id":253538294,"title":"He came up with the Democrats' favourite new insult against Trump. Now Walz is Harris's running mate","text":"Kamala Harris passed over senior Democrats from crucial battleground states to tap Minnesota Governor Tim Walz as her running mate. A process that usually requires months of careful vetting, Harris had just a few weeks to choose her vice-presidential nominee. Walz, 60, is not exactly a national figure in US politics. But he caught everyone's attention two weeks ago when he levelled a devastating, but simple, insult against Republican nominee Donald Trump – one that has since become a key campaign message for Democrats. Now he has just 90 days to convince American voters to put him and Harris in the White House. So who is Tim Walz? Here are nine fast facts about the governor. He's a Nebraska native who worked on the family farm Though Walz is the governor of the northern US state of Minnesota, he hails from Nebraska, further south. He grew up in the tiny town of Butte, which had a population of just a few hundred, and spent summers working on the family farm. At 17, he joined the military, following in his veteran father's footsteps. He then spent 24 years in the Army National Guard – the main combat reserve of the US Army. Helped by \"GI Bill\" benefits, which cover higher education costs for American service members, he studied to become a teacher. He taught social studies in high school before entering politics. While teaching in his native Nebraska, he met his wife, a fellow teacher from Minnesota. Soon after, they moved to Mankato, a Minnesota city of about 45,000 people, to be closer to her family. It's something of an unusual resume for a Democratic VP pick. The Washington Post reports he's the first one who didn't go to law school since 1964. But Democrats hope his rural and military background will help them win over moderate, middle-ground voters. They've already produced a campaign ad highlighting his country credentials. One of his first teaching stints was in China After graduating with a degree in social science education, Walz moved to China in 1989 – the year of its brutal Tiananmen Square massacre. According to a congressional biography, he was part of the \"first government-sanctioned groups of American educators to teach in China through a program at Harvard University\". In a 2016 interview with an agriculture publication, he said he'd been to China about 30 times. \"I don't fall into the category that China necessarily needs to be an adversarial relationship,\" he said in the interview. \"I totally disagree, and I think we need to stand firm on, what they're doing in the South China Sea, but there's many areas of cooperation that we can work on.\" An edited clip of that clip is now being shared on social media by some of Trump's supporters, but without mention of the year it was shot, and cut to remove his comment on the South China Sea. As a high school football coach, he championed gay rights While working as a teacher in Mankato in the 90s, Walz was a coach for the school's American football team. He helped to lead it to its first state championship. At the same time, he became the faculty adviser for the school's new gay-straight alliance. \"The fact that he took on that role while also being the football coach was so important,\" the school's first openly gay student told the Washington Post last week. \"He set an example not just for LGTBQ students but for football players in the locker room at a time when gay people were not well understood.\" He defied the odds to win a conservative-leaning Congressional district Before he was elected Minnesota governor, Walz was a member of the national Congress, representing the state's first congressional district. He defeated the Republican incumbent, who had held the district for 12 years, in 2007. But when he quit Congress to become governor in 2019, the Republicans won it back. It's a mostly rural district with a mostly Republican history, and Walz's success in winning it – and holding onto it for so long – is seen as evidence of his appeal to more conservative country voters. He's a gun owner and pheasant hunter once favoured by the NRA Walz has sought to portray himself as both pro-gun and pro-gun control. In an interview with CNN last week, for example, he compared his shooting credentials with those of his now-opponent in the VP race. \"JD Vance's schtick is talking about guns,\" he said. \"I guarantee you he can't shoot pheasants like I can.\" The powerful National Rifle Association (NRA), one of America's most influential lobby groups, endorsed him while he was in Congress. In 2016, he featured in the top 20 politicians for gun owners in popular shooters' magazine Guns & Ammo. But he fell out of favour with the gun lobby while campaigning to be Minnesota governor in 2018. After a mass shooting at a Florida school that year, he came out in support of a ban on assault weapons. More recently, he's signed gun control measures into state law. They include compulsory background checks for gun owners, and \"red flag laws\" that allow authorities to seize guns from people deemed to be a threat to themselves or others. \"As a veteran, gun owner, hunter and dad, I know basic gun safety isn't a threat to the Second Amendment – it’s about keeping our kids safe,\" he said last year. He was criticised over his handling of the George Floyd protests The murder of George Floyd by a police officer in 2020 led to protests in Minneapolis, the largest city in Minnesota. Some turned into violent riots. According to a state senate report, more than 1,500 businesses and buildings were vandalised and burned, causing $US500 million ($766 million) in property damage. As governor, Walz has been criticised for not acting sooner to bring rioting in the city centre under control. Critics say his decision to wait several days before activating the Minnesota National Guard was a grave error. The report, published by the Republican-controlled state senate, said Walz and the local mayor \"failed to realise the seriousness of the riots and the danger to Minnesotans if rioters were not confronted and stopped\". It also says they \"failed to act in a timely manner to confront rioters with necessary force due to an ill-conceived philosophical belief that such an action would exacerbate the rioting\". After Harris chose Walz as her VP running mate, his Republican opponent JD Vance said: \"They make an interesting tag team, because of course Tim Walz allowed rioters to burn down Minneapolis in the summer of 2020, and then the few who got caught, Kamala Harris helped bail them out of jail.\" (Harris tweeted a link to the 'Minnesota Freedom Fund' to raise money for protesters in Minnesota at the time.) Walz told a recent press conference: \"Decisions were made in a situation, that is what it is, and I said we believed we tried to do the best that we can in each of those.\" He came up with what quickly became the Democrats' favourite insult Walz is not a household name outside of Minnesota. But he won some fame when he began describing some Republicans as \"weird\" during recent media interviews. \"These guys are just weird,\" he told MSNBC. \"They're running for He-Man Woman-Haters Club or something.\" It was seen as a shift from the Democrats' usual attack lines, which tend to focus on Trump as a convicted criminal and a threat to democracy. But it's been widely shared on social media, and it has since stuck. In the past couple of weeks, many Democrats have been hammering the \"weirdness\" of their Republican opponents. And Walz is sticking with it too. \"These guys are creepy and, yes, just weird as hell,\" he told his first campaign rally with Harris. Republicans call him a 'radical leftist' and 'West Coast wannabe' In announcing Walz as her pick, Harris pointed to his record on hot-button issues like gun control and abortion rights. The Trump campaign is pointing to his progressive record too. \"It’s no surprise that San Francisco liberal Kamala Harris wants West Coast wannabe Tim Walz as her running-mate,\" the campaign said. \"Walz has spent his governorship trying to reshape Minnesota in the image of the Golden State. \"From proposing his own carbon-free agenda to suggesting stricter emission standards for gas-powered cars, and embracing policies to allow convicted felons to vote, Walz is obsessed with spreading California’s dangerously liberal agenda far and wide.\" Trump himself later posted to social media: \"This is the most Radical Left duo in American history. There has never been anything like it, and there never will be again.\" He beat out VP contenders from more crucial battlegrounds Harris reportedly started with a shortlist of about a dozen potential running mates. In recent days, it appeared to have narrowed to three. The other two were from critical swing states: senator Mark Kelly from Arizona, and Pennsylvania Governor Josh Shapiro. Both are popular locally and could have given Harris an edge in their respective states, which are likely to come down to the wire. But Harris chose Walz, despite the fact Minnesota is already a relatively reliably Democratic-voting state in national elections. Citing \"three people familiar with the vice-president's thinking\", the New York Times reports that Walz \"leapfrogged better-known contenders in part because Ms Harris viewed him as an Everyman figure from Minnesota whose Midwestern-dad-vibe balanced out her Bay Area background\". Harris and Walz are now embarking on a tour of the swing states, starting in Pennsylvania, where they've appeared together at their first rally. \"Thank you, Madam Vice-President, for the trust you put in me,\" Walz said to Harris on stage. \"But maybe more so, thank you for bringing back the joy.\" Loading...","summary":"Only a few weeks ago, many Americans outside Minnesota had never heard of Tim Walz. Now, he might be the country's next vice-president. Here's what to know about him. ","url":"https://www.abc.net.au/news/2024-08-07/tim-walz-kamala-harris-vice-president-running-mate/104187318","image":"https://live-production.wcms.abc-cdn.net.au/931a0fbb62d6e72cdee90f9b778a0f58?impolicy=wcms_crop_resize&cropH=608&cropW=1080&xPos=0&yPos=91&width=862&height=485","video":null,"publish_date":"2024-08-06 23:50:36","author":"Brad Ryan","authors":["Brad Ryan"],"language":"en","catgory":"politics","source_country":"AU","sentiment":0.114},{"id":253538202,"title":"Tim Walz makes lighthearted remark about J.D. Vance and his ‘couch’ during his first appearance as Kamala Harris’ VP selection: Vice President nominee refers to Republicans as ‘strange’ while audience shouts ‘lock him up’ for Trump","text":"Minnesota Governor Tim Walz made his debut as Kamala Harris running mate where he gave a first introduction of himself to the American people but also went after Donald Trump as a criminal, made a dig about J.D. Vance on a couch and called the GOP ticket weird. The 60-year-old’s first campaign remarks came at a massive first rally in Philadelphia just hours after he was dramatically revealed as the Democratic vice presidential pick. Thousands of people packed the Liacouras Center at Temple University for the boisterous event. The crowd went wild as Harris and Walz entered the arena together. ‘I couldn’t be prouder to be on this ticket, and to help make Kamala Harris the next President of the United States!’ Walz said. The announcement Tuesday ended weeks of speculation over who Harris would pick after President Biden exited the race on July 21 launching a massive shake-up at the top of the Democratic ticket. Walz is just introducing himself on the national stage. The Minnesota governor was elected in 2019 after serving on Congress since 2007. He also served 24 years in the National Guard and was a social studies teacher and football coach before running for Congress. ‘Minnesota’s strength comes from our values – our commitment to working together, to seeing past our differences, to lending a helping hand,’ Walz said. Walz also gave a preview of how he will go after Republicans on the campaign trail. He said Trump ‘doesn’t know the first thing about service because he’s too busy serving himself’ and claimed violent crimes were up under Trump stating that ‘doesn’t count the crimes he’s committed.’ Walz also slammed Vance saying he can’t wait to debate the Republican vice presidential nominee ‘if he’s willing to get off the couch and just show up.’ Walz called the Republican ticket ‘creepy’ and ‘just weird as hell.’ Harris spoke first after they took the stage and gave Walz a lengthy introduction. She touted his background as an educator. She said they come from different corners of the country but their values are the same. ‘He really shines a light on a brighter future that we can build together,’ Harris said. ‘In his state he has been a model chief executive and with his experience I am telling you Tim Walz will be ready on day one.’ It was also Harris’ first campaign rally and visit to the battleground state since becoming the official Democratic presidential nominee. ‘I’m now officially the democratic nominee’ she noted. ‘And so now that I have work to do, we need to move to the general election and win that.’ Another top contender for Harris’ running mate was Pennsylvania’s own Governor Josh Shapiro who was in attendance for the rally where he received a thunderous hero’s welcome from the crowd as he entered. Shapiro vowed to work his ‘tail off’ to elect Harris and Walz and said he loved being governor. He said he was focused on ‘GSD’ or ‘getting s**t done’ and heaped praise on Harris while blasting Trump and Vance. As the state’s governor went after the ex-president, the crowd started chanting ‘he’s a weirdo.’ Shapiro gave the credit to Walz. ‘Tim Walz is a great man,’ Shapiro said as the crowd went wild. ‘Tim Walz is a great patriot, and I’ll tell you what else, Tim Walz is a dear friend.’ Walz responded in kind with his own praise on Shapiro as a visionary leader. He mentioned they once attended a Bruce Springsteen concert together. Shapiro told the crowd he leans on his family and his faith and is ‘very proud’ of his faith. It came after some in the progressive wing of the Democratic party pushed back on Shapiro, who is Jewish, as a running mate over his strong support for Israel. As the progressive governor made his debut, multiple Democrats in attendance told DailyMail.com they admittedly knew very little if anything about him before the announcement was made but were excited. Several who had heard of Walz before said they only recently became aware of him as the governor known for calling Republicans ‘just weird.’ It has become a frequent line used by Democrats on the campaign trail. Democrats also claim his addition to the ticket helps with midwestern voters. Walz grew up in rural America and could help the party as rural America has become increasingly red over the years. ‘I was born in West Point, Nebraska and lived in Butte, a small town of 400 where community was a way of life,’ Walz said in Philadelphia. ‘Growing up, I spent summers working on the family farm. My mom and dad taught us to show generosity toward your neighbors and to work for the common good.’ The pick has been praised by Democratic lawmakers across the political spectrum from squad member New York Congresswoman Alexandria Ocasio-Cortez to West Virginia Senator Joe Manchin, who is a registered Independent but still caucuses with the party. At the same time, Republicans have rushed to paint Walz as a ‘radical liberal’ who supports granting undocumented immigrants amnesty and supports sanctuary cities. The crowd for the rally began lining up early in the day as attendees decked out in Harris gear waited to get through security. People were handed bracelets that had lights flashing red, white and blue, making the event feel like a concert at times rather than a campaign rally. While Harris waited until late Tuesday morning to announce her running mate, the campaign came prepared with options. Throughout the arena were massive blue signs with ‘Harris Walz’ on them. Lanyards also included Walz’s name in addition to Harris. Those DailyMail.com spoke to said it was a historic occasion to be at her first event with her running mate, but others said they simply wanted to get a glimpse of the candidate they believe could become the first woman President of the United States. ‘We are just ecstatic about her candidacy and she’s going to win. There’s no question in my mind,’ said Betty Blue. ‘There’s been 46 presidents. Why not a woman? It’s time. With what’s going on in the country right now, we need a woman to bring the country together.’ ‘My generation, I see how much we tend to support her,’ said 14-year-old Addison Avat who was there with her mom. ‘She thinks about the future in a good way, and she wants to lift the future up.’ From Philadelphia, Harris and Walz are headed out on a battleground state tour across the country ending in Nevada on Saturday.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMinnesota Governor Tim Walz made his debut as Kamala Harris running mate&#8230;\n\n\nThis Post: Tim Walz makes lighthearted remark about J.D. Vance and his &#8216;couch&#8217; during his first appearance as Kamala Harris&#8217; VP selection: Vice President nominee refers to Republicans as &#8216;strange&#8217; while audience shouts &#8216;lock him up&#8217; for Trump first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/tim-walz-makes-lighthearted-remark-about-j-d-vance-and-his-couch-during-his-first-appearance-as-kamala-harris-vp-selection-vice-president-nominee-refers-to-republicans-as-strange-while-aud/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Tim-Walz-jokes-about-JD-Vance-and.jpg","video":null,"publish_date":"2024-08-06 23:46:50","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.178},{"id":253538082,"title":"How Tim Walz became beloved by young voters with a message that the GOP is ‘weird’","text":"WASHINGTON — Even before he was on the shortlist for vice president, Minnesota Gov. Tim Walz was working to portray Donald Trump and Republicans to the American public as “just weird.” “These are weird people on the other side. They want to take books away. They want to be in your exam room,” Walz said in a TV interview last month. The message started with news interviews and eventually spread like wildfire across social media with the help of young Americans. The simple terminology of labeling the other side as “weird” or “odd” is not revolutionary or sophisticated in American politics but represents a new framing for Democrats who have spent the last eight years trying to defeat Trump and Trumpism by personifying him as the greatest threat to democracy. Walz went back to the reference at his first rally Tuesday with Vice President Kamala Harris, saying of Republicans: “These guys are creepy and yes, just weird as hell.” “The opposite of normalizing authoritarianism is to make it weird, to call it out and to sort of mock it,” Jennifer Mercieca, a historian at Texas A&M University, who wrote a book on Trump’s rhetoric, said. “To say, ‘Hey, that’s a weird thing you’re doing, calling your opposition enemies instead of saying that they’re good people who have different policy preferences.'” Now the party is turning the page with a new generation of candidates trying to appeal not just to Americans’ fears about what a second Trump presidency would mean, but to plainly label the policies and actions of the Republican party as abnormal. And Democrats see no more effective messenger to deliver this new attack than Walz, the 60-year-old Midwestern dad, who on Tuesday was chosen to become their vice presidential nominee. “Gov. Walz can do the job, and helps reinforce that we’re team normal,” freshman Democratic Rep. Greg Landsman of Ohio said in a statement Tuesday. “We’re pragmatic, reliable and bipartisan.” Walz’s ability to speak in layman’s terms about policy and politics coupled with his knowledge of the internet zeitgeist has helped propel the little-known politician to the national stage and on the “For You” social media pages of millions of Gen Z voters whose support will be crucial for Democrats come November. Labeled “the cool dad” online, news that Walz would be the Democratic running mate ignited a stream of online memes, including one with the caption, “To the window to the Walz,” a reference to the hit 2003 rap song “Get Low” by Lil Jon and the East Side Boyz. On TikTok, users created 60-second montages of Walz talking about the phenomenon of the new Charli XCX album Brat, which he says his young daughter helped explain to him, mixed with footage of him lambasting GOP vice presidential nominee Sen. JD Vance for his comments on “childless cat ladies.” “Go ahead and continue to denigrate people. Go ahead. My God, they went after cat people. Good luck with that,” Walz says in a MSNBC clip that has more than 150,000 likes on TikTok. “Turn on the internet. See what cat people do when you go after them.” But the same qualities that led Walz to the Democratic ticket are already being used against him by Republicans who have just in the last few hours labeled him as “weird” and “radical.” Trump sent a fundraising email Tuesday calling Walz “Dangerously Liberal” and saying he would “unleash HELL ON EARTH.” But Walz’s legislative record on issues like protecting abortion rights, legalizing recreational marijuana and restricting gun access have helped him gain popularity with young voters beyond his own solidly blue state to communities across the country. Voters of Tomorrow, a Gen Z-led organization that represents young political activists and voters, threw its full support behind Walz after weeks of campaigning on his behalf, saying that he has “dedicated his life to educating and empowering young people as a teacher and public servant.” “Governor Walz gets bonus points for articulating exactly how young Americans feel about Donald Trump and JD Vance: They are weird,” Santiago Mayer, the group’s executive director, said in a statement. “Trump and Vance are weirdly fixated on taking away freedoms from Americans and weirdly obsessed with culture wars.”","summary":"Now the party is turning the page with a new generation of candidates trying to appeal not just to Americans' fears about what a second Trump presidency would mean, but to plainly label the policies and actions of the Republican party as abnormal.","url":"https://www.twincities.com/2024/08/06/how-tim-walz-became-beloved-by-young-voters-with-a-message-that-the-gop-is-weird/","image":"https://www.twincities.com/wp-content/uploads/2020/08/TCFallback.jpg","video":null,"publish_date":"2024-08-06 23:45:52","author":"Farnoush Amiri","authors":["Farnoush Amiri"],"language":"en","source_country":"us","sentiment":0.025},{"id":253538330,"title":"‘Bachelorette’ Alum James Taylor Arrested for Assault and Unlawful Restraint","text":"Former Bachelorette contestant James Taylor was arrested and subsequently released this week on charges of assault and unlawful restraint. The reality star turned country musician was arrested on Aug. 4 by the College Station Police Department in connection with warrants from the Bryan Police Department regarding charges for assault causing bodily injury and unlawful restraint. Both pertained to an alleged incident on April 24. He was released on the same day on two $4,000 bonds, one for each charge. Taylor had previously been detained in College Station for driving while intoxicated and unlawfully carrying a weapon charges in 2022, per People. The reality TV alum told the outlet this week that there was “not so much as a scratch on me (as I showed to police via pictures of my whole body which was awkward to say the least)” following the alleged incident. “I’m a pretty big guy but I was trying to ‘unlawfully restrain’ a girl and she just … got away?… and walked right to her Uber right outside my house? With NO injuries? Trust me, if there were ANY injuries they’d be all over the internet.” Though the details of the incident were not made public, Taylor’s statement mentioned a daughter. “I don’t know the daughter’s name because we didn’t spend much time together but I feel like she wouldn’t want all this to have gotten here either if she could go back,” he said. “And I don’t hate you either. I just wish I knew where you were coming from and where this came from.” He added, “To people reading this: If you want fame, it never ends up like that. If you want money, it never ends up like that. If you want to ruin my life, it always ends up like that… keep it up. I would never hurt anybody. I’m nice to EVERY person I meet.” Taylor competed on 2016’s season 12 of The Bachelorette led by JoJo Fletcher. Years later, show creator Mike Fleiss promounced him “officially exiled” from Bachelor Nation after Taylor, an outspoken advocate for Donald Trump, encouraged his social media followers to attend the Jan. 6 insurrections. Taylor’s Instagram bio now includes the line, “exiled from bachelor nation.”","summary":"Former Bachelorette contestant James Taylor was arrested and subsequently released this week on charges of assault and unlawful restraint. The reality star turned country musician was arrested on Aug. 4 by the College Station Police Department in connection with warrants from the Bryan Police Department regarding charges for assault causing bodily injury and unlawful restraint. [&#8230;]","url":"https://www.hollywoodreporter.com/tv/tv-news/bachelorette-james-taylor-arrested-assault-unlawful-restraint-1235967576/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/JamesTaylorGettyImages-663892268.jpg","video":null,"publish_date":"2024-08-06 23:45:48","author":"Zoe G Phillips,Zoe G. Phillips","authors":["Zoe G Phillips","Zoe G. Phillips"],"language":"en","source_country":"US","sentiment":-0.521},{"id":253537972,"title":"Steve Martin already name-dropped to play Kamala Harris’ VP choice Tim Walz on ‘SNL’","text":"Democracy has spoken. Steve Martin has been deemed the perfect person to portray Kamala Harris’ recently-announced VP pick, Minnesota Gov. Tim Walz, on “Saturday Night Live” this fall. On Tuesday, Walz, 60, was revealed as Harris’ running mate, and social media instantly buzzed over Martin and Walz’s physical resemblances. Fans said on X (formerly Twitter) that they want to see Martin, 78, portray the Democratic politician on the upcoming 50th season of “SNL,” which will be in production through the 2024 presidential election. “SNL get Steve Martin on the phone NOW,” read one tweet with over 9,000 retweets. “So Steve Martin is definitely gonna play Walz on SNL right,” said another fan. Someone else wrote, “He’s the only logical choice for this, can we get him to do it?” A fourth fan joked, “Am I missing something or did Kamala Harris not choose comedian Steve Martin to be her running mate?” Another fan pointed out that the similarities between Walz’s home in Minnesota and the house from Martin’s 1991 movie “Father of the Bride.” “Not only does Tim Walz look like Steve Martin, his house looks like the Father of the Bride House,” the fan tweeted with pictures of the two houses. The Post has reached out to reps for Martin and “SNL” for comment. Martin has hosted “SNL” 16 times — just one short of Alec Baldwin’s record of 17 hosting appearances. The last time Martin hosted the show was in December 2022 during Season 48. He co-hosted the episode with his “Only Murders in the Building” co-star Martin Short. Brandi Carlile was the musical guest. Martin’s first appearance as host was during Season 2 in 1976. It’s already been announced that Maya Rudolph will return as Harris, 59, for “SNL” Season 50. Rudolph, 52, first played Harris, the presumptive Democratic nominee for president, on the Dec. 21, 2019, episode of “SNL” hosted by Eddie Murphy. She won the Emmy Award for Outstanding Guest Actress in a Comedy Series for the role. Deadline reported that pre-production on Season 3 of Rudolph’s Apple TV+ series “Loot” was paused due to scheduling reasons — likely because of Rudolph’s commitment to “SNL.” The upcoming milestone season of the NBC sketch comedy series premieres on Sept. 28. Harris picked Walz as her running mate on Tuesday, setting the stage for their showdown with Donald Trump and his VP pick JD Vance in November. “I am proud to announce that I’ve asked Tim Walz to be my running mate. As a governor, a coach, a teacher, and a veteran, he’s delivered for working families like his,” the vice president posted on X. Walz called it the “honor of a lifetime” to join the Harris campaign — declaring, “I’m all in.” “Vice President Harris is showing us the politics of what’s possible. It reminds me a bit of the first day of school. So, let’s get this done, folks!” Walz said in a statement. Walz spent 24 years in the Army National Guard and then a decade in the US House of Representatives, serving a largely rural district in southern Minnesota, before running for governor in 2018.","summary":"The \"Only Murders in the Building\" star is social media's top choice to play Kamala Harris' running mate on Season 50 of \"SNL.\"","url":"https://nypost.com/2024/08/06/entertainment/steve-martin-top-pick-to-play-kamala-harris-vp-tim-walz-on-snl/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/2024-g-democratic-governors-offered-87152243.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/bi8A1Z3g-RyIcpnTz.mp4","publish_date":"2024-08-06 23:44:44","author":"Eric Todisco","authors":["Eric Todisco"],"language":"en","source_country":"us","sentiment":0.055},{"id":253537852,"title":"Trump Posts Fan Fiction About Biden Stealing Nomination Back From Harris","text":"Donald Trump has taken his obsession with crafting falsehoods about Democratic nominee Kamala Harris to the the next level, penning his own fan fiction on Tuesday about the vice president. In a rant rife with misspellings and baseless conspiracy, Trump wrote: “What are the chances that Crooked Joe Biden, the WORST President in the history of the U.S., whose Presidency was Unconstitutionally STOLEN from him by Kamabla, Barrack HUSSEIN Obama, Crazy Nancy Pelosi, Shifty Adam Schiff, Cryin’ Chuck Schumer, and others on the Lunatic Left, CRASHES the Democrat National Convention and tries to take back the Nomination.” The ex-president continued, “He feels that he made a historically tragic mistake by handing over the U.S. Presidency, a COUP, to the people in the World he most hates, and he wants it back, NOW!!!” Despite Trump’s attempt to sow doubt (and boost morale within the GOP), President Joe Biden has publicly and fully endorsed Harris, and has urged the Democratic party to “come together and beat Trump.” Following the president’s decision to no longer run for reelection, the Democratic party swiftly rallied behind the vice president — from lawmakers to celebrities pledging their support for her presidential ticket in the 2024 election. Trump, on the other hand, has responded by having a verifiable meltdown over the prospect of facing her instead of Biden — backing out of a scheduled Sept. 10 debate, and proposing a televised face-off against the vice president, but on on his preferred network, Fox News, instead. Since then, Trump and his allies have struggled to find a line of attack against Harris, and have thrown a variety of sexist and racist insults at the vice president, from claiming she’s a “DEI hire” to slamming her for not having biological children. Meanwhile, Trump and his vice presidential pick, J.D. Vance, have been blasted as “weird” and “creepy” — part of the Democrats’ rhetorical strategy of lambasting the duo over their attempts to take away reproductive health care, and civil and LGBTQ+ rights. Of course, the former president’s recent fantasy scenario about the vice president only makes things weirder. As Harris’ running mate, Minnesota Gov. Tim Walz, summed it up during their debut as the Democratic ticket during a fired-up rally in Philadelphia Tuesday, Trump and his allies are “creepy and weird, yes, weird as hell.”","summary":"The former president posted a bizarre fantasy scenario on Truth Social","url":"https://www.rollingstone.com/politics/politics-news/trump-posts-fan-fiction-biden-harris-nomination-1235075162/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/trump-biden-harris-nomination.jpg","video":null,"publish_date":"2024-08-06 23:44:29","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.449},{"id":253538522,"title":"Georgia election board says counties can do more to investigate election results","text":"ATLANTA (AP) — Georgia’s State Election Board voted Tuesday to require county election officials to make a “reasonable inquiry” before certifying election results to the state, signaling that fights about approving election results could intensify this November in the South’s premier battleground state. Supporters say the measure is needed because members of county election boards must swear statements that results are accurate and need to be able to adequately assure themselves that the totals are correct before doing so. “Why one would not want to assume there is some oversight?” asked State Election Board member Janice Johnston, who was appointed the panel by the state Republican Party. “It’s the duty of the board to provide some oversight, in a fair way, in a reasonable way.” But opponents of the rule say it’s an invitation to create post-election chaos and that the board is defying state law that says that county officials “shall certify” results, as well as more than a century of court precedent finding county officials have little wiggle room on the issue. ”The proposed rule changes will give authority to local election officials to halt the counting of votes and slow down, or even outright refuse certification if they contend there are any irregularities, essentially making the certification of election results discretionary,” said House Minority Whip Sam Park, a Democrat from Lawrenceville. “The key word there is discretionary. This would essentially give partisan county board of elections personal control over Georgia’s election results, allowing them to uphold certifying the election if they disagree with the results.” The rule will take effect after 20 days, although it could be challenged in court. It’s yet another battle over what had long been an administrative afterthought, state and local boards certifying the results. With 90 days left in the presidential campaign, there could be more fighting in narrowly divided swing states. Former President Donald Trump and his allies have tried to block certification to stop election results from being made final if they lose. In 2020, two Republicans on Michigan’s state board of canvassers, which must certify ballot totals before state officials can declare a winner, briefly balked at signing off before one relented and became the decisive vote. Trump had cheered the delay as part of his push to overturn his loss that ultimately culminated in the Jan. 6, 2021, attack on the U.S. Capitol. During the 2022 midterms, some conservative, rural counties tried to hold up their state election results, citing the same debunked claims of voter fraud that Trump has made. In Georgia, state officials had to order rural Coffee County to certify in 2020. In May Republican-appointed Fulton County election board member Julie Adams refused to certify primary election results after she filed a lawsuit backed by the Trump-aligned America First Policy Institute that argues county election board members have the discretion to reject certification. The rule the board adopted Tuesday was proposed by Michael Heekin, the other Republican-appointed member of the Fulton County board. Heekin on Tuesday rebutted claims that reasonable is a subjective term, saying it has an established legal meaning. “It’s guardrails to make the point that what we are doing is very important and it’s not to be taken lightly,” Heekin told the state board. But Democrats and voting rights groups fear that Republicans on the board are laying the groundwork for Trump to dispute a Kamala Harris victory in Georgia. “I’m saying that adopting a rule that’s inconsistent with the statute and over 100 years of Georgia Supreme Court precedent is outside the authority of the board,” said Nikhel Sus, a lawyer for Citizens for Responsibility and Ethics in Washington, a liberal-leaning group that focuses on government ethics and accountability. Tuesday’s action comes after a trio of Republican partisans aligned with Trump took control of the five-member regulatory board. It has no direct role in determining election results, but writes rules to ensure that elections run smoothly and hears complaints about violations. Trump himself praised those members during a rally in Atlanta on Saturday, saying the three “are all pit bulls fighting for honesty, transparency and victory,” but criticizing the Democrat on the board and the nonpartisan chairman appointed by Gov. Brian Kemp, saying they “aren’t so good.” Trump in particular singled out Johnston, a retired obstetrician and frequent critic of elections in deeply Democratic Fulton County, who was in the second row at Saturday’s rally and stood to acknowledge Trump’s praise. “My courage was contagious?” Trump said after Johnston stood. “Well, your courage is contagious, too.” Critics of the board’s entanglement with Trump and Republican Party politics argue that it’s not just unseemly, but may be violating the board’s own code of conduct, which says members of the board “shall be honest, fair, and avoid any appearance of conflict and/or impropriety.” Board member Janelle King, whose appointment cemented control to the Trump-aligned faction, denied that she’s unduly influenced by her party. State Republican Party Chairman Josh McKoon recently emailed proposed rules and talking points to the third member of the faction, former state Sen. Rick Jeffares. “I don’t make decisions based on what side of the aisle wants me to do something,” King told reporters. “I look at the facts, I look at the evidence, I look at what’s in front of me, and I see if this is a good rule.” Jeff Amy, The Associated Press","summary":"ATLANTA (AP) — Georgia&#8217;s State Election Board voted Tuesday to require county election officials to make a “reasonable inquiry” before certifying election results to the state, signaling that fights about approving election results could intensify this November in the South&#8217;s premier battleground state. Supporters say the measure is needed because members of county election boards [&#8230;]","url":"https://toronto.citynews.ca/2024/08/06/georgia-election-board-says-counties-can-do-more-to-investigate-election-results/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/e88dde91e328f22cc9cc015861bbab47c037bf206322c23b49e6a6f343dc90a1.jpg","video":null,"publish_date":"2024-08-06 23:40:12","author":"Jeff Amy,News Staff","authors":["Jeff Amy","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.11},{"id":253538190,"title":"Watch live updates on the election outcomes for Kansas, Michigan, Missouri, and Washington","text":"In Michigan, the race to replace the retiring Debbie Stabenow (D) in the Senate features Rep. Elissa Slotkin as the Democrat favorite, with former Rep. Mike Rogers as the Republican favorite, although former Rep. Justin Amash is challenging him. In Washington, Rep. Dan Newhouse, one of the 10 House Republicans who voted to impeach former President Donald Trump, is seeking reelection. There are seven other contenders vying to replace him. In Missouri, the race for the 1st Congressional District features St. Louis County Prosecutor Wesley Bell challenging Squad member Cori Bush for the Democrats. The polling (and fundraising advantage) favor Bell for the upset. Will Bush be the second Squad member sent packing? Missouri also features a tight three-way gubernatorial race among Republicans, featuring current Secretary of State Jay Ashcroft, current Lieutenant Governor Mike Kehoe, and state Senator Bill Eigel, as well as an Attorney General race between sitting AG Andrew Bailey and Trump appellate attorney Will Scharf.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAnother Tuesday, another set of primaries. Today&#8217;s races include Kansas, Michigan, Missouri,&#8230;\n\n\nThis Post: Watch live updates on the election outcomes for Kansas, Michigan, Missouri, and Washington first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/watch-live-updates-on-the-election-outcomes-for-kansas-michigan-missouri-and-washington/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-LIVE-Election-Results-Kansas-Michigan-Missouri.png","video":null,"publish_date":"2024-08-06 23:39:15","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.036},{"id":253538666,"title":"What Minnesota Voters Think of Tim Walz","text":"If Gov. Tim Walz has achieved anything after 18 years in public office, it has been to convince many of his fellow Minnesotans that he is decidedly not weird. On Tuesday, Annakeiko Reichel-Frink, a teacher from Mankato, Minn., called Mr. Walz “a very normal human being.” Maria Bevacqua, a college professor from the same small city, where Mr. Walz once taught at the high school, described him as “somebody you would bump into at the grocery store.” Adam Lueth, a college student who is leaning toward the Republican ticket, said that Mr. Walz, a Democrat, comes across as “a genuine guy.” Mr. Walz was thrust into the national spotlight on Tuesday when Kamala Harris, the Democratic presidential nominee, announced that he would be her running mate. The second-term governor seemed to rocket to the top of the list after he used one word quite effectively against Donald Trump, the Republican candidate: He was simply being “weird.” Mr. Walz has succeeded in projecting an avuncular, affable, relentlessly normcore image to Minnesotans. But on Tuesday, in interviews across the state, voters also seemed less than convinced that Governor Walz had succeeded in rising above partisanship, or in uniting the state as “One Minnesota,” as his 2018 campaign slogan put it.","summary":"The governor succeeded in projecting an avuncular image. But not all voters are convinced that he rose above partisanship or united the state.","url":"https://www.nytimes.com/2024/08/06/us/tim-walz-minnesota-voters-reactions.html","image":"https://static01.nyt.com/images/2024/08/06/multimedia/06nat-backyard-reax-fqzv/06nat-backyard-reax-fqzv-facebookJumbo.jpg","video":null,"publish_date":"2024-08-06 23:34:19","author":"Jeff Ernst,Richard Fausset","authors":["Jeff Ernst","Richard Fausset"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.099},{"id":253537838,"title":"Kamala Harris’ VP pick disappoints some who hoped for a new milestone: the first Jewish vice president","text":"With his history of winning three statewide elections in Pennsylvania, Shapiro was seen as someone with particular appeal to moderate voters. His state’s 19 votes in the Electoral College have long been critical for candidates trying to reach the necessary 270 to win. But the same things about Shapiro that appealed to moderates angered some on the left in his party: his support for a private school voucher program and natural gas infrastructure as well as particularly his support for Israel’s war in Gaza after Hamas’ Oct. 7 attack. Some Democrats lamented what they said was a missed opportunity by bypassing Shapiro. Republicans, meanwhile, tried to paint Harris’ choice as a snub to Jewish voters, a traditionally Democratic constituency that former President Donald Trump has tried to court in this year’s race. “Not only is he exceptionally smart and capable, but, in my opinion, he brought the math to the path of 270,” said Ryan Bizzarro, 38-year-old Democratic state lawmaker from Erie, Pennsylvania, said of Shapiro. Shapiro spoke at a rally in Philadelphia Tuesday night before the new Democratic ticket took the stage, with the Pennsylvania governor receiving big applause from thousands of attendees. “I love you Philly. You know what else I love, I love being your governor,” Shapiro said. He added, “I am going to continue pouring my heart and soul into continuing to serve you every single day as your governor.” Shapiro also praised Walz as a great man with strong midwestern values, calling him a friend he said he couldn’t wait for Pennsylvanians to get to know. Walz returned the compliment when he took the stage later with Harris in Philadelphia. “My God, what a treasure you have in Josh Shapiro,” he said. “Holy hell, can this guy bring the fire.” Philadelphia Mayor Cherelle Parker, who advocated fiercely but unsuccessfully for Shapiro, also spoke at the event and said Democrats should not let Republicans and detractors divide them over the pick. “Our Democratic nominee has spoken and that’s it. Period. End of story,” Parker said. Republicans try to take advantage of Shapiro not being picked A number of high-profile Republicans sought to seize on the liberal pushback Shapiro faced over his stance on Israel, suggesting Tuesday that Shapiro was not picked as Harris’ running mate because of antisemitic attitudes in the Democratic Party. Trump, the Republican nominee, has been sharply criticized for his record on antisemitism, notably his suggestion that there were “fine people on both sides” of an antisemitic march in Charlottesville, Virginia, and his dinner with white nationalist Nick Fuentes at his Mar-a-Lago residence in 2022. The former president recently suggested Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish, and seemed to agree with a radio host who called Emhoff “a crappy Jew.” Ohio Sen. JD Vance, the Republican vice-presidential candidate, told reporters in Philadelphia on Tuesday that it seemed Harris didn’t pick Shapiro because Democrats feared “grassroots activists in their party wouldn’t take a Jewish nominee.” Michigan state Sen. Jeremy Moss, who is Jewish and was excited at the prospect of a Jewish vice president, praised Walz and criticized Republicans for framing her decision as a slight against Jewish Democrats. “I’ve seen the discourse on the right saying that there’s clearly no room for Jews in Democratic politics,” said Moss. “I defy any one of them to name a single Jewish Republican governor or a single Jewish Republican U.S. senator. They can’t, because there are none.” The last Jewish Republican senator was former Sen. Norm Coleman of Minnesota, who left office in 2009. Missouri’s former Republican Gov. Eric Greitens is Jewish, but he resigned in 2018. Arab American leaders who had publicly cautioned against picking Shapiro countered claims that the opposition was based on the governor’s Jewish background and said his positions on Israel and statements on campus protests went further than other candidates, particularly Walz. Abdullah Hammoud, the mayor of Dearborn, Michigan, noted that the Arab American community overwhelmingly voted for Jewish politicians in the past, backing former Democratic Rep. Andy Levin and twice supporting former presidential candidate Bernie Sanders, the independent Vermont senator. “It’s certainly not antisemitic to critique somebody’s position on Israeli policy,” Hammoud said. “That’s just called stewardship and accountability.” Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro. Only 30% of Jewish voters supported Trump in 2020, while 69% supported Biden, according to AP VoteCast, a sweeping survey of the electorate. That made Jewish voters one of the religious groups where support for Biden was strongest. The Jewish Democratic Council of America, which held an online rally for Harris last week, issued a statement in support of Walz on Tuesday, calling him “an exceptional choice” and noting he and Harris “align with the vast majority of Jewish voters on every key issue, including Israel and antisemitism.” Shapiro remains a key Democratic asset for this year’s campaign Shapiro is a popular first-term governor who two years ago was elected in a battleground state that is seen as critical to Democrats’ path to win the White House. The 51-year-old emerged in recent days as a finalist on Harris’ speedy search for a running mate, winning fans in the party for his speaking style that evoked former President Barack Obama. With his background as a former state attorney general, like Harris, he also stood out for his forceful defenses of the White House and critiques of Trump. He is a staunch proponent of abortion rights but is also seen as a moderate on energy policy, a significant issue in his natural gas producing state. Shapiro has professed solidarity with Israel in its campaign to eliminate Hamas and has aggressively confronted what he saw as antisemitism appearing at pro-Palestinian demonstrations. In recent days, the Philadelphia Inquirer reported on a column he wrote for his college newspaper saying Palestinians were “too battle-minded” to coexist with Israel. Jonathan Sarna, professor of American Jewish history at Brandeis University in Waltham, Massachusetts, said that as the opposition to Shapiro over his position on Israel became more vocal, “suddenly this decision took on new significance.” Nathan Diament, the executive director of public policy for the Orthodox Union, an umbrella group of Orthodox Jews in the U.S., said “It’s a bit disappointing” a Jewish candidate won’t be on the ticket. “Certainly, it would have been exciting if that had happened for a second time,” he said, referencing Joseph Lieberman’s run with Al Gore in 2000. Amy Spitalnick, the CEO of the Jewish Council for Public Affairs, said in a post on X that it was “ridiculous” for people to claim Harris, whom she noted was married to a Jewish man, second gentleman Doug Emhoff, didn’t pick Shapiro because of antisemitism. “There are two crowds using Jews as political footballs here: The far-left that singled out Shapiro (despite Israel policies largely aligned with Walz and others) AND the swarm of right-wingers now claiming Harris/Dems are antisemitic,” she wrote. “Neither is credible.” State Sen. Sharif Street of Philadelphia said that Walz’s values, including on abortion and gun control, align more with Philadelphians than those of Vance or Trump. And he believes his retail political skills will help carry the state, even without Shapiro on the ticket. “Look, Gov. Shapiro’s a rockstar in this state. People love him,” said Street, Pennsylvania’s Democratic Party chair and the son of former Mayor John Street. “But he will still be out there campaigning for this ticket. They haven’t lost Josh Shapiro.” ___ Associated Press reporters Tiffany Stanley in Washington, Peter Smith in Pittsburgh, Meg Kinnard and Will Weissert in Philadelphia and Joey Cappelletti in Lansing, Michigan, contributed to this report.","summary":"Most Jewish Americans vote Democratic and are still poised to rally around the Democratic ticket, even without Shapiro.","url":"https://fortune.com/2024/08/06/kamala-harris-vp-walz-shapiro-jewish/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/GettyImages-2163853221-e1722986999542.jpg","video":null,"publish_date":"2024-08-06 23:31:37","author":"Maryclaire Dale,Michelle L. Price,The Associated Press","authors":["Maryclaire Dale","Michelle L. Price","The Associated Press"],"language":"en","source_country":"US","sentiment":0.018},{"id":253537566,"title":"Letters: Unattainable dream | Opponents unite | Out of touch | Organ harvesting | Project 2025 | Netanyahu’s war","text":"American dream is unattainable for most Re: “Wealthy buyers dominate market” (Page A1, July 30). If, as suggested in your article, “only the wealthiest” in the Bay Area can buy a home, what exactly does that mean? Left unsaid is the unfortunate truth: Regular people with regular jobs cannot afford to buy a home in the Bay Area. Your article notes that a person buying a house today at the median price would have a mortgage of $7,287. According to standard home-buying metrics, that person should have a monthly income of about $25,000. Most I know are closer to making $25,000 a year than $25,000 a month. Is it now acceptable that the American dream is unattainable — if only by the vast majority? Philip Rapier Oakland Political opponents must find way to unite No matter who wins in November, the future of this nation depends on Americans respecting each other and working together, despite our differences. The challenge today is that our differences are greater than ever in our most basic beliefs about the nature of humanity, the universe and God; and, because of this, on most issues. But for freedom and democracy to survive we must not succumb to the temptation to hate those on the other side from us on the issues and to want our side to have complete domination. History shows that single-party domination always leads to corruption and oppression. Braver Angels is a civic organization that for the past 20 years has been successfully bringing Democrats, Republicans and Independents together for constructive engagement and cooperation. If you want to be part of the solution to our polarization rather than part of the problem, check it out. Christopher Andrus Dublin Trump comments on Harris’ race out of touch Re: “Trump suggests VP Harris misled voters about her race” (Page A3, Aug. 1). Donald Trump is sounding more and more like the crazy uncle who says ridiculous things after drinking too much. Of course, he has a history of making outrageous statements and making false statement. It is surely time to take away his car keys. Ed Green Oakland Support bills to stop organ harvesting On June 25, the U.S. House unanimously passed HR 4132, the Falun Gong Protection Act. This bill marks the first U.S. legislative initiative to combat the forced organ harvesting of Falun Gong practitioners in China. Falun Gong is a traditional Chinese practice grounded in the principles of truthfulness, compassion and forbearance. In 1999, the Chinese Communist Party (CCP) began a brutal persecution of Falun Gong practitioners, which later escalated to the forcible removal of their organs for profit. Members of Congress, including Rep. Mark DeSaulnier, deserve gratitude for unanimously passing HR 4132. We urge Sens. Laphonza Butler and Alex Padilla of California to co-sponsor the Senate companion bill (S. 4914). This legislation aims to help end forced organ harvesting in China and prevent American medical centers and patients, including those in the East Bay, from becoming unwitting accomplices to these crimes. Jinchi Lu Walnut Creek Project 2025 should guide your vote Every citizen must read the contents of Project 2025 before voting in November. The Republican vice presidential candidate, JD Vance, wrote the foreword to a new book by Project 2025 leader Kevin Roberts. Vance states, “We are going to circle the wagons and load the muskets.” This is the MAGA-nominated vice presidential candidate speaking. I want to know who he plans on shooting with his muskets, don’t you? Please read the entire Project 2025, or visit Hungary to live the life Project 2025 outlines for you. Then go vote. Robert Celeste Fremont Netanyahu’s war is real act of terrorism . Meanwhile, Benjamin Netanyahu lectures us about the triumph of civilized vs. uncivilized people. He is committing this genocide. He is the terrorist. Jon Harwayne Walnut Creek","summary":"East Bay Times Letters to the Editor for Aug. 7, 2024","url":"https://www.mercurynews.com/2024/08/06/letters-1822/","image":"https://www.mercurynews.com/wp-content/uploads/2024/06/GettyImages-1661191757.jpg?w=1024","video":null,"publish_date":"2024-08-06 23:30:08","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.089},{"id":253538204,"title":"Tim Walz presents himself as a vice-presidential candidate who embraces small-town principles and is ready to criticize both the unconventional views of Donald Trump and J.D. Vance.","text":"Minnesota Governor Tim Walz made his debut on the national stage as a vice presidential candidate, in a speech in which he emphasized his small town background and values and contrasted them to a “weird” and “creepy” Donald Trump and J.D. Vance. “I just have to say it, you know if and you feel it, these guys are creepy and just weird as hell,” Vance said, repeating words that went viral over the past two weeks and helped vault him to the top of the vice presidential sweepstakes. His speech in Philadelphia, coming hours after Vice President Kamala Harris announced him as her running mate, was a prime opportunity for him to introduce himself, with the major cable news networks all carrying the address, along with that of Harris and Governor Josh Shapiro, who was passed over as a running mate option. Much of the attention throughout the day, and in Harris’ remarks, focused on Walz’s biography: growing up in a small town, serving in the National Guard, working as a high school social studies teacher and serving as a Friday Night Lights-style football coach who took his team all the way to a state championship. “Minnesota’s strength comes from our values, our commitment to working together, to see past our differences, to always be willing to lend a helping hand,” Walz said. “Those are the same values I learned on the family farm and tried to instill in my students. I took it to Congress, and to the state Capitol, and now Vice President Harris and I are running to take those very values to the White House.” Seeking to draw on Walz’s appeal to working class and rural voters, a segment where Democrats have struggled, Harris pointed not just to his experience as a football coach, but to his military service and to his skill as a marksman, “winning a bipartisan sharp-shooting contest year after year.” Walz himself turned the tables, attacking his Republican counterpart, J.D. Vance, as an Ivy League elitist, even making a couch joke, and insisting that “I can’t wait to debate” him. He also signaled that his role on the ticket will be that of attack dog, as he hammered Trump on an issue where Republicans have long believed they have the upper hand: crime. “Make no mistake, violent crime was up under Donald Trump. That is not even counting the crimes he committed,” Walz said, drawing one of his biggest cheers of the rally.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMinnesota Governor Tim Walz made his debut on the national stage as&#8230;\n\n\nThis Post: Tim Walz presents himself as a vice-presidential candidate who embraces small-town principles and is ready to criticize both the unconventional views of Donald Trump and J.D. Vance. first appeared on Internewscast Journal","url":"https://internewscast.com/news/tim-walz-presents-himself-as-a-vice-presidential-candidate-who-embraces-small-town-principles-and-is-ready-to-criticize-both-the-unconventional-views-of-donald-trump-and-j-d-vance/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Tim-Walz-Introduces-Himself-As-A-Running.jpg","video":null,"publish_date":"2024-08-06 23:30:05","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.194},{"id":253537724,"title":"In Bid for Ads, Elon Musk’s X Declares Legal War on … Advertisers","text":"Escalating hostility with major advertisers, X has sued a coalition representing big-money brands for allegedly coordinating a boycott of the platform in violation of antitrust laws. The proposed class action, filed in federal court in Texas on Tuesday, accuses the World Federation of Advertisers of conspiring with companies to withhold advertising on X due to relaxed safety standards since Elon Musk assumed control of platform in 2022. In the wake of the takeover, 18 firms stopped ad campaigns with the platform and dozens more slashed spending, in several cases by over 70 percent, in a bid to coerce X into implementing favored policies, according to the complaint. “The illegal behavior of these organizations and their executives cost X billions of dollars,” wrote X chief executive Linda Yaccarino in an open letter to advertisers. “People are hurt when the marketplace of ideas is undermined and some viewpoints are not funded over others as part of an illegal boycott.” In a post on X, Musk urged others to join the lawsuit. “We tried being nice for 2 years and got nothing but empty words,” he wrote. “Now, it is war.” The companies named in the lawsuit, which include CVS, Unilever and Mars, are members of the World Federation of Advertisers. In 2019, the group established an initiative called the Global Alliance for Responsible for Media to pursue safety guardrails on social media platforms. It’s largely concerned over advertisements appearing next to illegal or harmful content, such as child pornography or hate speech. Following Musk’s acquisition of X, the lawsuit claims the group organized an advertiser boycott by issuing public statements of its concerns, with the goal of strongarming the platform into complying with certain safety standards. That year, WFA issued a public letter to Musk to “uphold existing commitments on brand safety and deepen future collaboration.” After he purchased the site, Musk immediately moved to steer the company toward his free speech ideals. This included reinstating banned accounts, such as those from Kanye West and Donald Trump, and launching a new paid verification system that allowed some users to impersonate brands. A high-profile incident in November 2022 saw an account using the name and logo of Eli Lilly state, “We are excited to announce insulin is free now.” The post was a fake, sparking a panic at the pharmaceutical giant that led to the halting of all ad campaigns with the platform. In the complaint, X alleges GARM’s advertising agency members recommended to their clients that they suspend advertising, with some saying that they considered it “high risk.” Following the alleged boycott, X fell 80 percent below revenue forecasts, the lawsuit says. “Mars, Ørsted, Unilever U.S., CVS Health, and the other GARM-member advertisers discontinued or curtailed their purchases of advertising knowing as a result of communications facilitated by and through WFA that other GARM-member advertisers and advertising agencies would do the same,” states the complaint, which notes that candy company hasn’t purchased domestic ads on X since October 2022. X maintains that its safety standards exceed industry norms. It says that GARM refuses to rescind recommendations not to refrain from advertising on the platform despite more than 99 percent of its ad placements over the past two years appeared next to content that the group finds satisfactory. This, in turn, had forced the company to decrease ad prices “well below those charged by X’s closest competitors in the social media advertising market,” the lawsuit claims. The complaint brings a claim for a violation for section one of the Sherman Act, which bars restraint on trade. The filing of the lawsuit follows spats between Musk and some of X’s major advertisers. Last year, he accused brands of trying to blackmail him after they pulled their advertising following his endorsements of an antisemitic conspiracy theory. He named Disney chief executive Bob Iger, who said “the association with that position, and Elon Musk, and X was not necessarily a positive one for us.” In July, the House Judiciary Committee issued a report accusing GARM of “attempting to influence what content appears online by starving disfavored” platforms of advertising dollars.","summary":"Escalating hostility with major advertisers, X has sued a coalition representing big-money brands for allegedly coordinating a boycott of the platform in violation of antitrust laws. The proposed class action, filed in federal court in Texas on Tuesday, accuses the World Federation of Advertisers of conspiring with companies to withhold advertising on X due to [&#8230;]","url":"https://www.hollywoodreporter.com/business/business-news/elon-musk-x-lawsuit-advertisers-1235967615/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/GettyImages-18211233811.jpg","video":null,"publish_date":"2024-08-06 23:30:03","author":"Winston Cho","authors":["Winston Cho"],"language":"en","source_country":"US","sentiment":-0.364},{"id":253538028,"title":"Kamala Harris and ‘Coach’ Tim Walz team up against ‘JV’ GOP ticket at Philadelphia rally","text":"PHILADELPHIA — In the city of brotherly love, Vice President Kamala Harris and her recently announced running mate, Gov. Tim Walz (D-MN), held their first campaign rally together Tuesday evening in Philadelphia where they championed unity as they prepare for a brutal campaign cycle against former President Donald Trump. “We are the underdogs in this race, but we have the momentum, and I know exactly what we are up against,” said Harris to a raucous crowd eager to cheer the campaign on. “Our campaign is not just a fight against Donald Trump. Our campaign, this campaign, is a fight for the future,” she continued after the crowd chanted “Lock him up!” As Harris introduced Walz, she praised him as a leader, fighter, teacher, and coach who has defended reproductive access, provided free meals to Minnesota school children, as well as championed a high-school Gay Straight Alliance. “And in 91 days, the nation will now coach Walz by another name: Vice President of the United States,” Harris told a cheering audience. “Coach Walz and I may hail from different corners of our great country. But our values are the same,” said Harris. “We both believe in lifting people up, not knocking them down. He and I, we both know that the vast majority of us have so much more in common than what separates us.” “I couldn’t be prouder to be on this ticket and to help Vice President Harris become what we all know is very, very good for us to think about: next president of the United States of America,” Walz declared. After lambasting Trump as an ineffective leader, the Minnesota governor claimed he was prepared for a vice presidential debate against Sen. J.D. Vance (R-OH), Trump’s running mate. “I got to tell you, his running mate shares his dangerous and backward agenda for this country,” Walz said. “J.D. Vance literally, literally wrote the foreword for the architect of the Project 2025 agenda.” Democrats have sought to link Trump and Vance to Project 2025, a more than 900-page conservative guidebook for a possible second Trump presidency with ties to the Heritage Foundation. The former president has tried to distance himself from the project. “Like all regular people I grew up with in the heartland, J.D. studied at Yale, had his career funded by Silicon Valley billionaires, and then wrote a bestseller trashing that community,” Walz said, drawing laughs from the crowd. “Come on, that’s not what Middle America is. And I gotta tell you, I can’t wait to debate the guy. That is, if he’s willing to get off the couch and show up.” The quip is about a false claim that caught fire over the internet that Vance wrote about having sex with a couch in his memoir, Hillbilly Elegy. The crowd burst into laughter at the sofa reference, which Walz emphasized by adding, “These guys are creepy, and yes, just weird as hell.” The rally in Pennsylvania, possibly the most crucial state needed to win the presidency, launches a battleground state tour that will see the pair stumping in seven states that will decide the next president. Democrats remain largely enthused over Walz joining Harris’s campaign and quickly raised $20 million in grassroots donations following the announcement. Progressives such as Reps. Ilhan Omar (D-MN), Alexandria Ocasio-Cortez (D-NY), and Jamaal Bowman (D-NY) have all voiced support for Walz, as have other big names affiliated with the party, such as former Democratic nominee Hillary Clinton, former President Barack Obama, and Sen. Joe Manchin (I-WV). Even Maryland Republican Senate nominee Larry Hogan congratulated Walz, a notable moment given his muted response when Vance was announced as Trump’s running mate last month. Walz was selected over Gov. Josh Shapiro (D-PA), a fact that Republicans have denounced as antisemitic. Vance suggested Shapiro had to downplay his Jewish heritage under attacks from the anti-Israel wing of the Democratic Party. “I think that’s scandalous and disgraceful,” Vance said. Shapiro, who received loud applause as he spoke to the Philadelphia rally, praised Walz and claimed he would do all he could to unite Pennsylvania behind the Democratic ticket. “I’m going to be working my tail off to make sure we make Kamala Harris and Tim Walz the next leaders of the United States of America,” Shapiro said. The GOP slammed Walz as another “radical extremist” who was destroying the nation in a signal of how they are trying to brand the Democratic ticket. Republican National Committee Chairman Michael Whatley slammed Harris and Walz as “the most dangerously liberal ticket in history” in a statement. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “By selecting tyrannical Tim Walz, Harris doubled down on her radical agenda to bring four years of soft on crime policies, an invasion at our southern border, and the elimination of the oil and gas industry across the country,” Whatlety continued. “Pennsylvanians don’t want a radical extremist duo in the White House – they want to make America wealthy, strong, safe, and great again with President Trump.” Harris, however, claimed at the rally that the public would choose Walz’s record over a Republican ticket. “When you compare his resume — shall we? — to Trump’s running mate, well, well, some might say, it’s like a matchup between the varsity team and the JV squad,” she said.","summary":"PHILADELPHIA— In the city of brotherly love, Vice President Kamala Harris and her recently announced running mate Gov. Tim Walz (D-MN) held their first campaign rally together Tuesday evening in Philadelphia where they championed unity as they prepare for a brutal campaign cycle against former President Donald Trump. &#8220;We are the underdogs in this race, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3111738/harris-walz-rally-philadelphia/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Harris_Walz_Rally_11.webp","video":null,"publish_date":"2024-08-06 23:22:49","author":"David Sivak And Mabinty Quarshie","authors":["David Sivak And Mabinty Quarshie"],"language":"en","source_country":"US","sentiment":0.192},{"id":253537148,"title":"Harris, Walz Debut White House Ticket, Vowing 'Fight For Future'","text":"Kamala Harris made her debut Tuesday with new White House running mate Tim Walz, who unleashed a stinging rebuke of their Republican rival Donald Trump, questioning his commitment to the country and skewering his record in office.Hours after being announced on the Democratic ticket, the Minnesota governor took the stage with Vice President Harris in the crucial swing state of Pennsylvania, and signaled his intent to press the case aggressively against Trump.\"Donald Trump -- he sees the world differently. He doesn't know the first thing about service because he's too busy serving himself,\" Walz told a crowd of around 10,000 wildly cheering supporters in Philadelphia. He accused Trump of deliberately weakening the economy for his own ends, mocking law and order, and sowing \"chaos and division\" \"He drove our economy into the ground, and make no mistake: violent crime was up under Donald Trump. That's not even counting the crimes he committed,\" Walz added, earning roars of laughter and boisterous applause.With less than three months to go until election day, most Americans don't know who Walz is -- and he gave voters a glimpse of his personal story, describing his military service, his experiences as a public school teacher and his record in politics.He spoke of his upbringing in the small town of Butte, Nebraska where he worked on the family farm and where community was a \"way of life\" with neighbors striving together \"for the common good.\"In their first campaign appearance together, Harris and Walz offered a glimpse of how they might appeal to voters as a duo -- one a trailblazing Black and South Asian former senator from California, the other a white ex-congressman from the blue-collar US heartland.Harris, 59, described Walz as \"a leader who will help unite our nation and move us forward, a fighter for the middle class, a patriot who believes, as I do, in the extraordinary promise of America.\"A former attorney general of California, Harris has sought to draw a contrast between her past as a prosecutor and Trump's criminal record, which extends to 34 felonies, with over a dozen more charges pending. But she told the crowd: \"This campaign -- our campaign -- is not just a fight against Donald Trump. Our campaign -- this campaign -- is a fight for the future.\"Walz's role as Harris's top cheerleader also started coming into focus as he lauded her work and career.\"She took on the predators and the fraudsters, she took down transnational gangs, stood up against powerful corporate interests,\" Walz said.\"And she never hesitated to reach across the aisle if it meant improving people's lives... And she does it all with a sense of joy.\"Walz's recent viral success in distilling Democrats' attack lines against Republicans into the one-word characterization -- \"weird\" -- propelled him up Harris's shortlist, and he got cheers for reprising it in Philadelphia.Pennsylvania Governor Josh Shapiro, who was part of the undercard in Philadelphia and spoke glowingly of Walz, had been a favorite but Walz, 60, was said to have connected more deeply with Harris during interviews.The vice president's first joint appearance with her new running mate comes before the Democratic Party convention in Chicago, starting August 19. The rollout of his candidacy in Pennsylvania was no accident.The state is a key battleground, and part of the \"blue wall,\" along with Michigan and Wisconsin, that powered President Joe Biden to victory in 2020.The noisy rally provided a striking reminder of how different the race looked just a month ago, before 81-year-old Biden bowed to mounting concerns over his age and exited the race, endorsing Harris.She has since obliterated fundraising records on her way to erasing Trump's lead in polls over Biden.Philadelphia was the start of a multi-day tour for Harris and Walz through the swing states where the race is likely to be decided, taking in Wisconsin, Michigan, Arizona and Nevada. Republicans are scrambling to craft a narrative around Walz as a \"dangerously liberal extremist\" while Trump's vice presidential pick J.D. Vance suggested that Harris -- who is married to a Jewish man -- passed over Shapiro because of anti-Semitism.","summary":"Kamala Harris made her debut Tuesday with new White House running mate Tim Walz, who unleashed a stinging rebuke of their Republican rival Donald Trump, questioning his commitment to the country and skewering his record in office.","url":"https://www.ibtimes.com/harris-walz-debut-white-house-ticket-vowing-fight-future-3739108","image":"https://d.ibtimes.com/en/full/4540357/us-vice-president-2024-democratic-presidential-candidate-kamala-harris-introduces-her-running-mate.jpg","video":null,"publish_date":"2024-08-06 23:21:19","author":"Greg Walton With Frankie Taggart In Washington","authors":["Greg Walton With Frankie Taggart In Washington"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.222},{"id":253537084,"title":"Kamala Harris touts her official democratic nomination in US election","text":"WASHINGTON, August 7. /TASS/. US Vice President Kamala Harris has announced that now she is officially the Democratic Party’s presidential candidate. \"I stand before you today to proudly announce I am now, officially, the Democratic nominee for president of the United States,\" Harris said at a rally in Philadelphia. She made the announcement together with her running mate, Minnesota Governor Tim Walz. \"We are the underdogs in this race, but we have the momentum, and I know exactly what we are up against,\" she said. Earlier, she secured the Democratic nomination for president after receiving support from 99% of delegates inside her party in an online vote. According to Democratic National Committee Chairman Jaime Harrison, a total of 4,567 party delegates supported Harris. The US presidential election will be held on November 5. The Democratic Party was supposed to be represented by incumbent President Joe Biden, but after his failed performance in his June debate with Republican candidate Donald Trump, calls for the incumbent head of state to pull out grew louder among Democrats. On July 21, he decided to withdraw from the race and endorse Harris for the country’s top office.","summary":"She made the announcement together with her running mate, Minnesota Governor Tim Walz","url":"https://tass.com/world/1826019","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20240807/1425501.jpg","video":null,"publish_date":"2024-08-06 23:18:22","author":"Tass","authors":["Tass"],"language":"en","catgory":"politics","source_country":"RU","sentiment":-0.147},{"id":253537484,"title":"Trump says Tim Walz would be \"worst VP in history\"","text":"Trump says Tim Walz would be \"worst VP in history\" Donald Trump is not mincing his words when it comes to Minnesota Gov. Tim Walz joining the 2024 Democratic presidential ticket. In a campaign fundraising email circulated Tuesday, the former president said Walz would be \"the worst VP in history.\" Danielle Alvarez, senior adviser to the Trump campaign, joins \"America Decides\" to discuss.","summary":"Donald Trump is not mincing his words when it comes to Minnesota Gov. Tim Walz joining the 2024 Democratic presidential ticket. In a campaign fundraising email circulated Tuesday, the former president said Walz would be \"the worst VP in history.\" Danielle Alvarez, senior adviser to the Trump campaign, joins \"America Decides\" to discuss.","url":"https://www.cbsnews.com/video/trump-says-tim-walz-would-be-worst-vp-in-history/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/06/23a32852-daae-4752-9065-7e7a5e6f88ce/thumbnail/1200x630/69a2dc35b727a0f615ff69c2f4e789e6/cbsn-fusion-trump-says-tim-walz-would-be-worst-vp-in-history-thumbnail.jpg?v=33116e4d892fab6878b5c06299369826","video":null,"publish_date":"2024-08-06 23:16:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.686},{"id":253537728,"title":"'Not even counting the crimes he committed!' Tim Walz shreds Trump in debut speech","text":"Minnesota Gov. Tim Walz used his first speech as Vice President Kamala Harris' running mate at Monday's rally in Philadelphia to tear into former President Donald Trump, and everything he stands for. \"Minnesota's strength comes from our values, our commitment to working together to seeing past our differences, to always being willing to lend a helping hand,\" said Walz. \"Those are the same values I learned on the family farm and tried to instill in my students. I took it to Congress and to the state Capitol. And now Vice President Harris and I are running to take those very values to the White House.\" \"Now, Donald Trump sees the world a little differently than us,\" said Walz, as the crowd began to boo his name. \"First of all, he doesn't know the first thing about service. He doesn't have time for it because he's too busy serving himself, again and again ... Trump weakens our economy to strengthen his own hand. He mocks our laws. He sows chaos and division.\" \"And that's to say nothing of his record as president,\" said Walz. \"He froze in the face of the COVID crisis, drove our economy into the ground, and make no mistake: violent crime was up under Donald Trump.\" As the crowd roared, Walz added, \"That's not even counting the crimes he committed!\" Watch the video below or at the link here.","summary":"Minnesota Gov. Tim Walz used his first speech as Vice President Kamala Harris' running mate at Monday's rally in Philadelphia to tear into former President Donald Trump, and everything he stands for.\n\n\"Minnesota's strength comes from our values, our commitment to working together to seeing past our differences, to always being willing to lend a helping hand,\" said Walz. \"Those are the same values I learned on the family farm and tried to instill in my students. I took it to Congress and to the state Capitol. And now Vice President Harris and I are running to take those very values to the White House.\"\n\n\"Now, Donald Trump sees the world a little differently than us,\" said Walz, as the crowd began to boo his name. \"First of all, he doesn't know the first thing about service. He doesn't have time for it because he's too busy serving himself, again and again ... Trump weakens our economy to strengthen his own hand. He mocks our laws. He sows chaos and division.\"\n\n\"And that's to say nothing of his record as presid","url":"https://www.alternet.org/tim-walz-trump-crimes/","image":"https://www.alternet.org/media-library/image.jpg?id=53127720&width=1200&height=600&coordinates=0%2C0%2C0%2C197","video":null,"publish_date":"2024-08-06 23:15:05","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.058},{"id":253536758,"title":"Tim Walz Takes 'Crime' Jab at Donald Trump in First Campaign Rally","text":"Minnesota Governor Tim Walz, the new running mate of Vice President Kamala Harris, brutally mocked former President Donald Trump's criminal record during his first campaign rally with Harris.Trump was convicted in May of 34 felony counts of attempting to illegally influence the 2016 presidential election, which he won, by falsifying business records to conceal potentially damaging \"hush money\" paid to porn star Stormy Daniels. He also faces two other pending criminal cases.During a packed event alongside Harris in Philadelphia on Tuesday, Walz accused Trump of being \"too busy serving himself\" to serve as president, before turning to the ex-president's record on crime while in office. He then prompted extended cheers from the crowd and chants of \"lock him up\" by mentioning Trump's personal criminal record.\"Donald Trump sees the world a little differently from us,\" Walz said. \"He doesn't know the first thing about service. He doesn't have time for it, because he's too busy serving himself. Again and again and again, Trump weakens our economy to strengthen his own hand. He mocks our laws, he stokes chaos and division.\"\"And make no mistake, violent crime was up under Donald Trump,\" Walz continued. \"That's not even counting the crimes he committed!\"Newsweek reached out for comment to the Trump campaign via email on Tuesday night.This is a developing story and will be updated as more information becomes available.","summary":"Walz appeared at a joint rally after being selected as Vice President Kamala Harris' running mate on Tuesday.","url":"https://www.newsweek.com/tim-walz-takes-crime-jab-donald-trump-first-campaign-rally-1935566","image":"https://d.newsweek.com/en/full/2444581/tim-walz-donald-trump-crime-harris-rally.jpg","video":null,"publish_date":"2024-08-06 23:11:59","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.053},{"id":253536912,"title":"Comparison of Tim Walz and JD Vance’s stances on abortion, immigration, and gun rights for the Vice Presidential selection","text":"OHIO Senator and Donald Trump’s running mate JD Vance and newly announced Democratic VP pick, Minnesota Governor Tim Walz have drastically different views on pressing controversial topics. Walz was picked as the Democratic vice presidential candidate by Kamala Harris on Tuesday. The Minnesota governor has received endorsements from Dems including President Joe Biden and former president Barack Obama, but Republicans are skeptical of what he’ll bring to the White House. After Harris’ announcement, Trump’s VP pick JD Vance was stopped by Fox News while he boarded his plane. Vance told reporters he left Walz a voicemail congratulating his nomination and looked forward to a “robust conversation,” per Fox News. “Maybe he’ll call me back, maybe he won’t,” Vance said. This comes as… When asked to comment on Walz, the senator quickly shifted gears and called him a “San Francisco liberal”. He also said the governor’s record was a “joke.” Reporters also asked if Vance and the new VP pick had any similarities to which he responded, “Well, look, I mean, yeah, we’re white guys from the Midwest. I guess there are similarities there,” per the New York Times. Vance also agreed to debate Walz once he secured the official nomination. ABORTION While Vance has equated abortion with murder, Walz has gone out of his way to make sure abortion is an option for women in his state. In 2023, the governor signed a bill codifying the right to abortion in Minnesota, per Politico. Walz then joined Harris in March at a Planned Parenthood health center, marking it as the first visit by a sitting vice president to an abortion clinic. During the same month, he confirmed his stance saying, “Abortion is health care. I think old white men need to learn how to talk about this a little more,” he said on CNN. “And I think the biggest thing is, listen to women, listen to what they’re saying.” The dad of two has also been open about his wife’s, Gwen, experiences using in vitro fertilization to have their children. “It’s not by chance that we named our daughter Hope,” he told the Star Tribune about his daughter, Hope, 16. Vance, however, does not share the same views on the controversial subject. Trump’s running mate has previously stressed how important he views abortion. “Abortion was the first political issue I can ever remember caring about, and even after 20 years, it still shocks me that progressives just ignore there’s an innocent life involved,” he wrote on X in 2021. Vance scored an A+ with the Susan B. Anthony List, an anti-abortion group, because of his record as a Senate, per its website. He also said he has “voted consistently to defend the lives of the unborn and infants,” per the Washington Post. In 2023, Vance opposed Issue 1 on the ballot which would enshrine reproductive rights into Ohio’s constitution, per the Washington Post. The bill passed in the state with 56 percent of votes. IMMIGRATION Vance and Walz share a polarizing view on immigration — Walz hopes to provide undocumented immigrants citizenship while Vance believes in deportation. When Walz was a member of Congress, he was on board for a sticker screening of refugees, however, he shifted his views when he became governor. In 2023, he signed a bill that allowed undocumented immigrants to be eligible for Minnesota driver’s licenses. He argued the bill would make roads safer by reducing unlicensed drivers, per the press release. Walz doesn’t have a clear public record for his views on border policies, per the New York Times. Vance however, has made his views very clear. He introduced a bill in 2023 that was intended to crack down on illegal visa overstays, per the Washington Post. Vance has also blamed migration through the southern border for the reason why housing costs have gone up and wages have plummeted in the United States. On Monday, Vance said he believes the US should deport the about 11 million undocumented immigrants in the country, he told Fox News. “You start with the most violent people, the people who have criminal records,” he added that to do this was by making it harder for migrants to get work in the US. GUN RIGHTS Similar to his shift in beliefs about immigration, Walz also changed his mind about gun control. The governor of Minnesota previously held an “A” rating from the NRA, according to the Washington Post. However, after the 2018 school shooting in Parkland, Florida, and the push from his daughter, Hope, to change As governor, Walz signed a bill that included universal background checks and a red flag law that makes sure no dangerous person possesses a gun or has to surrender the ones they own. Vance, however, rejected tougher gun laws and has been praised by the National Rifle Association for his views. In 2022, he wanted to abolish the Bureau of Alcohol, Tobacco, Firearms and Explosives which enforces federal gun laws. “Joe Biden’s ATF is illegally collecting information on the gun transactions of millions of law-abiding citizens & putting them into a digital database,” he posted to X. “As Senator, I’ll not only lead the fight against Biden’s unconstitutional gun database, I’ll fight to ABOLISH the ATF.” Vance himself owns a rife and passed the routine background check to purchase it, per ABC affiliate WLWT.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOHIO Senator and Donald Trump&#8217;s running mate JD Vance and newly announced&#8230;\n\n\nThis Post: Comparison of Tim Walz and JD Vance&#8217;s stances on abortion, immigration, and gun rights for the Vice Presidential selection first appeared on Internewscast Journal","url":"https://internewscast.com/news/comparison-of-tim-walz-and-jd-vances-stances-on-abortion-immigration-and-gun-rights-for-the-vice-presidential-selection/","image":"https://internewscast.com/wp-content/uploads/2024/08/Tim-Walz-vs-JD-Vance-Where-the-Vice-Presidential-picks.jpg","video":null,"publish_date":"2024-08-06 23:10:43","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.143},{"id":253536866,"title":"Takeaways from a Harris-Walz ticket now that the stage is set for a reimagined presidential race","text":"WASHINGTON — The stage is set for an election that was unimaginable mere weeks ago when President Joe Biden was atop the Democratic ticket. Now Vice President Kamala Harrishas tapped Minnesota Gov. Tim Walz as her running mate to take on Republican Donald Trump and his No. 2, Ohio Sen. JD Vance. As different as they are, Walz and Vance both qualify as picks meant to reassure their party’s loyal base voters rather than adding homegrown heft in a critical battleground state. The two No. 2s will also get a chance to square off in almost real time as Walz is traveling this week with Harris to Pennsylvania, Wisconsin, Michigan, Arizona and Nevada, while Vance will follow an overlapping itinerary to offer his own counterprograming in some places. Some takeaways on the race now that Harris has settled on Walz: How Walz might help — or hurt — Harris’ chances Opting for the Minnesota governor immediately calms the Democratic Party’s left wing, which was worried that another contender, Pennsylvania Gov. Josh Shapiro, might have pushed the party closer to Israel and disheartened Arab American and younger voters. Some in Harris’ inner circle saw Walz as a do-no-harm choice who can keep the party unified heading into the Democratic National Convention opening in Chicago on Aug. 19. Progressives are already celebrating Walz’s ability to deliver an unapologetically populist message in the style of a Midwestern dad who recalls the social studies teacher and football coach he once was. Activists who for months have followed Biden around the country to protest his full-throated support for Israel in its war with Hamas in Gaza are hopeful that Walz will help Harris take a more nuanced approach than someone like Shapiro. But some critics will point to 2016, when the only other woman to be nominated for president, Hillary Clinton, picked a mild-mannered dad with centrist views and a modest national profile: Sen. Tim Kaine of Virginia. That ticket lost to Trump. Exciting each side’s most loyal supporters Neither vice presidential pick seems to do much to build out his party’s coalition — a sign that both campaigns view this election as about boosting turnout from their existing bases. Just as Walz hails from the solidly Democratic state of Minnesota, Vance comes from the safely Republican state of Ohio. There is a bet that each choice can radiate Midwestern appeal to the key “blue wall” states of Michigan, Pennsylvania and Wisconsin simply by dint of geographical proximity. Harris allies have stressed Walz’s ability to appeal to rural voters, although his 2022 reelection as governor roughly matched the margins of Joe Biden’s 2020 presidential win in Minnesota. Trump won 6 in 10 rural and small town voters nationwide in 2020, according to AP VoteCast. The Trump campaign was quick to try to connect Walz to its characterizations of Harris as a California liberal, saying his support for gun control and teachers unions make him a “West Coast wannabe.” Vance, for his part, comes from a state that has twice backed Trump by 8 percentage points. Just like the former president with his book “Trump: The Art of the Deal,” Vance achieved national recognition with his memoir, “Hillbilly Elegy.” Vance has mainly played to cultural and policy issues favored by strict adherents of Trump’s “Make America Great Again” movement such as cutting military support for Ukraine. Vance offering battleground counterprograming to Walz Vance is set to follow an overlapping itinerary to Harris and Walz over the next two days, including stops in the battleground states of Pennsylvania, Michigan and Wisconsin. His role is to attack the Biden administration’s policies and tear down Harris’ record on the economy, public safety and immigration. Vance got out ahead of the Democrats in Philadelphia on Tuesday, holding an event hours before Harris was to formally introduce her new running mate at a rally. He said during his Philadelphia stop that “I absolutely want to debate Tim Walz,” but not until after the Democratic convention. Harris’ team seemed to be happy to have Vance making the contrast with the Democrats. “We appreciate JD Vance providing voters in battleground states exactly the split-screen that defines the choice this November,” said Harris campaign spokesman Charles Lutvak. Plenty of drama still to come Walz’s selection settled one big question mark among Democrats, but plenty of major challenges remain for the final months of a race already defined by its unexpected twists and turns. There is the prospect of a wider war in the Middle East, the possibility of a rate cut by the Federal Reserve that might calm global financial markets and questions about whether Trump and Harris will actually square off in a September debate that was set before Biden bowed out of the race. No matter what happens, the conventional narratives of a presidential campaign have already had seemingly brief shelf lives. Voters over the past few weeks have dealt with Biden’s disastrous performance in the June 27 debate against Trump, a brazen assassination attempt on Trump, Biden’s exit from the race and Harris’ quick ascendance among Democrats. Now that both tickets are settled, a reckoning will take place over positions, and small differences can matter to voters who on the margin could decide a narrow election. Global events can upend talking points in ways that are hard to predict. The 2008 campaign intensified with that year’s financial crisis, while the persistence of the coronavirus shaped 2020. If there are any lessons from this year, it’s that election year surprises are no longer reserved for October. ___ Associated Press writer Hannah Fingerhut contributed to this report.","summary":"WASHINGTON — The stage is set for an election that was unimaginable mere weeks ago when President Joe Biden was atop the Democratic ticket. Now Vice President Kamala Harrishas tapped Minnesota Gov. Tim Walz as her running mate to take on Republican Donald Trump and his No. 2, Ohio Sen. JD Vance. As different as [&#8230;]","url":"https://www.twincities.com/2024/08/06/takeaways-from-a-harris-walz-ticket-now-that-the-stage-is-set-for-a-reimagined-presidential-race/","image":"https://www.twincities.com/wp-content/uploads/2024/08/AP24219822327833.jpg?w=1024","video":null,"publish_date":"2024-08-06 23:08:05","author":"Adriana Gomez Licon,Josh Boak,Will Weissert","authors":["Adriana Gomez Licon","Josh Boak","Will Weissert"],"language":"en","source_country":"us","sentiment":0.193},{"id":253537770,"title":"Harris Introduces New Running Mate Minnesota Gov. Tim Walz as the ‘Vice President America Deserves’ (Video)","text":"PHILADELPHIA — Kamala Harris introduced Minnesota Gov. Tim Walz to the nation as “the vice president America deserves” at a raucous rally Tuesday in Philadelphia aimed at building momentum for the newly minted Democratic presidential ticket in the sprint toward Election Day. “I set out to find a partner who can help build this brighter future,” Harris said, joking that the past two weeks since she stepped into the race have been “something of a whirlwind.” “I’m here today because I’ve found such a leader.” Walz soaked up the adulation of Harris and then turned it right around as he took the microphone, declaring to the vice president: “Thank you for bringing back the joy.” From there, he laid out his biography and took on their Republican opponents, former President Donald Trump and Ohio Sen. JD Vance, for their “backward agenda.” Revving up the crowd for the rigorous campaign to come, Walz told the roaring crowd, “We’ve got 91 days. My God, that’s easy. We’ll sleep when we’re dead.” In choosing the 60-year-old Walz, Harris is elevating a Midwestern governor, military veteran and union supporter who helped enact an ambitious Democratic agenda for his state, including sweeping protections for abortion rights and generous aid to families. It was her biggest decision yet as the Democratic nominee and she went with a broadly palatable choice — someone who says politics should have more joy and who deflects dark and foreboding rhetoric from Republicans with a lighter touch, a strategy that the campaign has been increasingly turning to since Harris took over the top spot. “He’s the kind of person who makes people feel like they belong and then inspires them to dream big … that’s the kind of vice president America deserves,” Harris said. Walz is joining Harris on the ticket during one of the most turbulent periods in modern American politics. Republicans have rallied around former President Donald Trump after he was targeted in an attempted assassination in July. Just days later, President Joe Biden ended his reelection campaign, forcing Harris to scramble to unify Democrats and decide on a running mate over a breakneck two-week stretch. Harris hopes Walz will help her shore up her campaign’s standing across the upper Midwest, a critical region in presidential politics that often serves as a buffer for Democrats seeking the White House. The party remains haunted by Trump’s wins in Michigan and Wisconsin in 2016. Trump lost those states in 2020 but has zeroed in on them as he aims to return to the presidency this year and is expanding his focus to Minnesota. Since Walz was announced, the team raised more than $10 million from grassroots donations, the campaign said. Walz is far from a household name; an ABC News/Ipsos survey conducted before he was selected but after vetting began showed that nearly 9 in 10 U.S. adults did not know enough to have an opinion about him. Harris devoted much of her speech to telling the audience about Walz life and work. “To those who know him best, Tim is more than a governor,” she said. Harris, the first Black woman and person of South Asian descent to lead a major party ticket, initially considered nearly a dozen candidates before zeroing in on a handful of serious contenders. Trump has focused much of his campaign on appealing to men, emphasizing a need for strength in national leadership and even featuring the wrestler Hulk Hogan on the final night of the Republican National Convention. Harris’ finalists — all white men — marked an acknowledgement of the Democrat’s need to at least try to win over some of that demographic. She personally interviewed three finalists: Pennsylvania Gov. Josh Shapiro, Arizona Sen. Mark Kelly and Walz. Harris wanted someone with executive experience who could be a governing partner, and Walz also offered appeal to the widest swath of the diverse coalition. His selection drew praise from lawmakers as ideologically diverse as progressive leader Rep. Alexandria Ocasio-Cortez, D-N.Y., and independent Sen. Joe Manchin of West Virginia, a moderate who left the Democratic Party earlier this year. A team of lawyers and political operatives led by former Attorney General Eric Holder pored over documents and conducted interviews with potential selections. Harris mulled the decision over on Monday with top aides and finalized it Tuesday morning, according to three people familiar with Harris’ decision who spoke on condition of anonymity to describe private deliberations. Shapiro, an ambitious politician in his own right, struggled with the idea of being No. 2 at the White House and said he felt he had more to do in Pennsylvania, according to one of the people familiar with Harris’ decision. There was also public pushback to Shapiro for his stance on Israel from Arab American groups and younger voters angry over the administration’s response to the Israel-Hamas war. The other contenders threw their support behind the ticket Tuesday, and Shapiro was one of the speakers at Tuesday’s Philadelphia rally. Biden described the Harris and Walz ticket as “a powerful voice for working people and America’s great middle class.” Walz coined one of Democrats’ buzziest campaign bits to date, calling Trump and his running mate Ohio Sen. JD Vance “just weird,” a label that the Democratic Governors Association — of which Walz is chairman — amplified in a post on X and Democrats more broadly have echoed. During a fundraiser for Harris on Monday in Minneapolis, Walz said: “It wasn’t a slur to call these guys weird. It was an observation.” Harris, second gentleman Doug Emhoff and Walz will spend the next five days touring critical battleground states, visiting Wisconsin and Michigan on Wednesday and Arizona and Nevada later in the week. Vance, for his part, planned stops in some of the same areas. He said Tuesday that he called Walz earlier in the day and left a voice message. The Trump campaign on Tuesday immediately tried to tag Walz as a far-left liberal. “It’s no surprise that San Francisco Liberal Kamala Harris wants West Coast wannabe Tim Walz as her running-mate – Walz has spent his governorship trying to reshape Minnesota in the image of the Golden State,” said Karoline Leavitt, Trump’s campaign press secretary. “Walz is obsessed with spreading California’s dangerously liberal agenda far and wide.” Walz, who grew up in the small town of West Point, Nebraska, was a social studies teacher, football coach and union member at Mankato West High School in Minnesota before entering politics. He won the first of six terms in Congress in 2006 from a mostly rural southern Minnesota district and used the office to champion veterans issues. Walz served 24 years in the Army National Guard, rising to command sergeant major, one of the highest enlisted ranks in the military, although he didn’t complete all the training before he retired so his rank for benefits purposes was set at master sergeant. He ran for governor in 2018 on the theme of “One Minnesota” and won by more than 11 points. David Ivory, a 46-year-old St. Paul resident, rode over to Walz’s residence on his bike with his kids shortly after the announcement to deliver their congratulations. “He’s just down to earth. He gets it. He can talk to anybody,” Ivory said. “He doesn’t seem like he’s above anybody.” As governor, Walz had to find ways to work in his first term with a legislature split between a Democratic-controlled House and a Republican-led Senate. Minnesota has a history of divided government, though, and the arrangement was surprisingly productive in his first year. Walz easily won reelection in 2022, and Democrats flipped the Senate to win full control of both chambers and the governor’s office for the first time in eight years. A big reason was the Dobbs decision from the conservative-majority Supreme Court that overturned a federal right to an abortion. Walz currently serves as co-chair of the bipartisan Council of Governors, advising the president and the Cabinet on homeland security and national defense issues. He was first appointed to the position by Trump, then later reappointed by Biden. ___ Miller, Long and Kim reported from Washington. Karnowski reported from Minneapolis. Associated Press writers Michael Balsamo and Michelle L. Price in New York and Michael Goldberg in Minneapolis contributed to this report.","summary":"PHILADELPHIA  — Kamala Harris introduced Minnesota Gov. Tim Walz to the nation as “the vice president America deserves” at a&#8230; Continue reading Harris Introduces New Running Mate Minnesota Gov. Tim Walz as the &#8216;Vice President America Deserves&#8217; (Video)\n\n\nThe post Harris Introduces New Running Mate Minnesota Gov. Tim Walz as the &#8216;Vice President America Deserves&#8217; (Video) appeared first on The National Herald.","url":"https://www.thenationalherald.com/harris-introduces-new-running-mate-minnesota-gov-tim-walz-as-the-vice-president-america-deserves/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/08/walz-harris.jpg","video":null,"publish_date":"2024-08-06 23:06:59","author":"Antonis","authors":["Antonis"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.132},{"id":253536636,"title":"Defending dignity","text":"PARIS (AP) – Olympic boxer Imane Khelif said the wave of hateful scrutiny she has faced over misconceptions about her gender “harms human dignity”, and she called for an end to bullying athletes after being greatly affected by the international backlash against her. The Algerian athlete spoke about her tumultuous Olympic experience in an interview with SNTV, a sports video partner of The Associated Press. “I send a message to all the people of the world to uphold the Olympic principles and the Olympic Charter, to refrain from bullying all athletes, because this has effects, massive effects,” Khelif said in Arabic. “It can destroy people, it can kill people’s thoughts, spirit and mind. It can divide people. And because of that, I ask them to refrain from bullying.” The victories of Khelif and fellow boxer Lin Yu-ting of Taiwan in the ring in Paris have become one of the biggest stories of the Paris Games. Both women have clinched their first Olympic medals even as they have faced online abuse based on unsubstantiated claims about their gender, drawing them into a wider divide over changing attitudes toward gender identity and regulations in sports. The 25-year-old Khelif acknowledged the pressure and pain of enduring this ordeal while competing far from home in the most important event of her athletic career. “I am in contact with my family two days a week. I hope that they weren’t affected deeply,” she said. “They are worried about me. This crisis will culminate in a gold medal, and that would be the best response.” The vitriol stems from claims by the International Boxing Association (IBA), which has been permanently banned from the Olympics, that both Khelif and Lin failed unspecified eligibility tests for the women’s competition at last year’s world championships. Khelif declined to answer when asked whether she had undergone tests other than doping tests, saying she didn’t want to talk about it. She expressed gratitude to the International Olympic Committee (IOC) and its president, Thomas Bach, for standing resolutely behind her while the banned former governing body of Olympic boxing stoked a furor around her participation in Paris. “I know that the Olympic Committee has done me justice, and I am happy with this remedy because it shows the truth,” she said. She also has seen massive support at her bouts, drawing cheers when she enters the arena and crowds waving Algerian flags chanting her first name. Khelif repeatedly made clear she won’t allow chatter or accusations to deter her from attempting to claim Algeria’s first Olympic gold medal in women’s boxing. “I don’t care about anyone’s opinion,” Khelif said a day after beating Anna Luca Hamori of Hungary. “I came here for a medal, and to compete for a medal. I will certainly be competing to improve (and) be better, I will improve, like every other athlete.” Although she is aware of the worldwide discussion about her, Khelif said she has been somewhat removed. “Honestly, I don’t follow social media,” she said. “There is a mental health team that doesn’t let us follow social media, especially in the Olympic Games, whether me or other athletes. I’m here to compete and get a good result.” Khelif started her Olympic run with a victory over Angela Carini of Italy, who abandoned the bout after just 46 seconds. Carini later said she regretted her decision and wished to apologise to Khelif. That unusual ending raised the chatter around Khelif into a roar, drawing comments from the likes of former United States President Donald Trump, Harry Potter writer JK Rowling and others. The IOC repeatedly declared her and Lin qualified to participate in the Olympics, and it has decried the murky testing standards and untransparent governance of the IBA, which was banished entirely from the Olympics last year in an unprecedented punishment for a governing body. Khelif clearly felt the weight of the worldwide scrutiny upon her, and her victory over Hamori on Saturday appeared to be cathartic. After the referee raised Khelif’s hand with the win, she went to the centre of the ring, waved to her fans, knelt and slammed her palm on the canvas, her smile turning to tears. “I couldn’t control my nerves,” Khelif said in the interview. “Because after the media frenzy and after the victory, there was a mix of joy and at the same time, I was greatly affected, because honestly, it wasn’t an easy thing to go through at all. It was something that harms human dignity.” She had competed in IBA events for several years without problems until she was abruptly suspended from last year’s world championships. The Russian-dominated body – which has faced years of clashes with the IOC – has refused to provide any information about the tests. Algeria’s national boxing federation is still an IBA member. Khelif is from rural northwestern Algeria, and she grew up playing soccer until she fell in love with boxing. Overcoming her father’s initial objections, she travelled 10 kilometres by bus to train for fights in a neighbouring town. After reaching the sport’s top level in her late teens, she struggled early in her career before reaching an elite level. Khelif has been a solid, if unspectacular, international competitor for six years, and she lost to eventual gold medallist Kellie Harrington of Ireland at the Tokyo Olympics. Khelif’s next bout in Paris is against Janjaem Suwannapheng of Thailand. If Khelif wins again, she will fight for a gold medal on Friday. “Yes, this issue involves the dignity and honour of every woman and female,” she told an Algerian broadcaster in brief remarks on Sunday after beating Hamori.","summary":"","url":"https://borneobulletin.com.bn/defending-dignity/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/08/page-a-AP_07082024.jpg","video":null,"publish_date":"2024-08-06 23:03:58","author":null,"language":"en","catgory":"politics","source_country":"bn","sentiment":-0.009},{"id":253538246,"title":"Former Trump Supporter Involved in Capitol Riots Says She Was 'Brainwashed' Into a 'Cult'","text":"Cancer survivor and former MAGA Pam Hemphill called former president Donald Trump a 'master manipulator' and 'king of gaslighting' during an exclusive with CNN. The January 6 rioter who completed her prison term for her involvement termed MAGA a 'cult' that 'brainwashed' her. Hemphill was taken into custody on several counts following the signing of a guilty plea to unlawful entry into the Capitol. She received a term of two months in a California federal prison. \"He's just a master manipulator. He doesn't believe anything. He just thinks he's smart enough to pull the wool over you. But there's people like me waking up and do you feel the former president's responsible for that? Absolutely. He's the king of that gaslighting. It's a cult,\" she said. Hemphill warned Trump not to use her name in the riot narrative in the future, \"Don't be using me for anything. I'm not a victim of January 6th. I pleaded guilty because I was guilty. I am not a victim of the government. The Justice Department was not weaponized against me I was a participant. We broke the law and she talks about the Capitol Police in her speech in the crowd. I was pushed down. My head was trampled on. My shoulder pulled out. The Capitol Police saved my life that day. I want them to know how truly grateful, I am to them and how deeply sorry I am. For what happened and how they continue to be treated to this day.\" According to NPR, Hemphill blamed Trump for what happened to her after hearing about his indictment news in 2023, \"I want the world to know that I followed a cult leader, and I'm really sorry that I did because I'm really ashamed of it. But it's something I got to forgive myself. But I can't blame me 100% because I was lied to by Trump.\" Hemphill said that she had fallen victim to what she refers to as \"the Trump cult.\" Her brother bought her a plane ticket to Washington, D.C., so she decided to go to the Jan. 6 demonstration as a self-appointed “citizen journalist” and videographer. He was attempting to cheer her up while she battled breast cancer. “My brother calls, says, ‘Hey, you, since you’re going to start chemotherapy, why don’t you go see Trump and video-record that?’” she told The Daily Beast. “I said I couldn’t afford it. But he said, ‘I’ll give it to you for a Christmas present.’” Hemphill later regretted her decision. “You don’t see it as a cult when you’re in it,” she said. “You don’t recognize it.” She claims that during the mad dash into the Capitol building, she still had 40 sutures in her breast from her operation. She feels that she was spared major harm by one of the officers and remains grateful to this day for having her life saved.","summary":"Pam Hemphill decided to go to the Jan. 6 insurrection as a self-appointed “citizen journalist” and videographer.","url":"https://www.inquisitr.com/former-trump-supporter-involved-in-capitol-riots-says-she-was-brainwashed-into-a-cult","image":"https://dab57h0r8ahff.cloudfront.net/709141/uploads/02b9c120-5328-11ef-af5d-8b8e01469605_1200_630.jpeg","video":null,"publish_date":"2024-08-06 23:02:10","author":"INQUISITR,Mary Anthony","authors":["INQUISITR","Mary Anthony"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.607},{"id":253536314,"title":"Letters: 49ers’ intent | International diplomacy | Source of pride  | Child marriage | Shelter mandate | Going high","text":"City officials should have seen 49ers’ intent Re: “49ers are major players in area’s political landscape” (Page A1, July 29). When living in Santa Clara, my husband and I went door-to-door with Suds Jain and others in 2010, urging a no vote on Measure J. At the same time, City Councilwoman Lisa Gillmor was helping the 49ers get their stadium. She should have seen the power of the 49ers’ influence then. Suds knows our campaign finance system is broken. Indeed, he’s a victim of the 49ers’ campaign spending. The 49ers’s money spent on ads supporting Suds was an independent expenditure that Suds didn’t solicit or know about in advance. Suds was taken aback when ads appeared on TV. He has gotten no money from the Yorks or the 49ers and has had no say in how they spend money. He could see through Measure J in 2010; too bad Lisa Gillmor couldn’t. I’ve observed Suds’ dedication to Santa Clara and our broader community. He is the most honorable and civic-minded person I know. Anna Koster San Jose Trump lacks ability for international diplomacy Re: “Biggest prisoner swap complete” (Page A1, Aug. 2). What the Biden-Harris administration just did in a prisoner exchange Donald Trump could not do. Biden-Harris got the cooperation of many European nations in a credible effort of diplomacy. Trump’s intent to weaken NATO and not defend NATO nations who have not paid into NATO alienates and undermines all of Europe. This is where Joe Biden’s experience surely was an asset and critical to the exchange. Trump would further alienate our allies. The difference between the two leaders is plain to see and supports how important it is that we give careful consideration to who we select in November. Mark Grzan Morgan Hill Netanyahu’s speech is a source of pride Re: “Congress embraces Israel’s brutal war“ (Page A6, July 30). After listening to the opening of Benjamin Netanyahu’s address, Larry Dorshkind bases disgust on erroneous speculation about what was subsequently said. Israel deplores loss of life while Hamas relishes each death as a propaganda victory. The ICC prosecution is biased ideology, ignoring the responsibility of Hamas, Hezbollah and Iran. Netanyahu expressed dubious optimism of Hamas accepting a long-standing peace proposal that is in accord with U.S. guidelines. Dorshkind and pro-Palestinian protesters are entitled to their disgust, but Jews and like-minded freedom lovers can take great pride in the Zionist state. Fred Gutmann Cupertino Child marriage robs women of independence Re: “How young is too young?” (Page A1, July 28). The weaker position of the young woman who is deprived of a full education, thus of a competitive career and economic independence, demands later marriage. Raymond R. White Mountain View State shelter mandate could draw homeless Re: “Mayor pushes to create shelter mandates” (Page A1, Aug. 2). Mayor Mahan and Gov. Newsom are on the right track regarding California’s homeless population — uprooting homeless people without providing alternatives for shelter will not work. So let’s say, miracle of miracles, California develops a viable solution: What’s to stop other states from busing their homeless people here? Steve Hubbell Mountain View Harris, Dems should not stoop to Trump’s level I’m hoping Vice President Kamala Harris and her campaign folks have more to say about Donald Trump and his supporters than just calling them “weird.” It reminds me too much of candidate Hillary Clinton throwing around the word “deplorables” — and we all remember how that campaign turned out. I want a higher campaign standard set. Don’t get into third-grade name-calling like Trump. Stick to the issues … and show footage of Ron DeSantis, Marco Rubio, Ted Cruz and Nikki Haley calling Trump out as a dictator, sexist, racist and vulgar convicted felon. These are all major truths and his own “supporters” said them. Michelle Obama said, “When they go low, we go high.” Let’s stick with that. Lynda Martinez San Jose","summary":"Mercury News Letters to the Editor for Aug. 7, 2024","url":"https://www.mercurynews.com/2024/08/06/letters-1821/","image":"https://www.mercurynews.com/wp-content/uploads/2024/04/BNG-L-PURDY-0416-9.jpg?w=1024","video":null,"publish_date":"2024-08-06 23:00:56","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.096},{"id":253536660,"title":"The Latest: Harris and Walz debut at Philadelphia rally","text":"Vice President Kamala Harris has chosen Minnesota Gov. Tim Walz as her running mate, looking to strengthen the Democratic ticket in Midwestern states. She introduced Walz at a rally Tuesday evening in Philadelphia. Harris was the only candidate eligible to receive votes after no other candidate qualified by a deadline last week. She officially claimed the nomination Monday night when the DNC released final results. Follow the AP’s Election-2024 coverage at: https://apnews.com/hub/election-2024. Here’s the Latest: Walz wraps his remarks Saying “God bless America,” Walz pivoted amid the applause to wrap his arms around Harris in a bear hug. The two clasped hands as Harris grinned and, with her other hand, pointed at Walz to the cheering audience. Their spouses joined them on stage for waves and applause before the new Democratic ticket stepped off the stage and to the edge of the crowd for photographs and handshakes with voters in the Temple University auditorium. Walz once again labels Vance, his now VP competition, as ‘weird’ Walz is reprising the “weird” phraseology to describe Republicans that has become a hallmark of his stump appearances and garnered the governor plaudits from younger Americans. Taking swipes at Vance, Walz said his GOP rival and Trump “are creepy and yes, they’re weird as hell.” “I can’t wait to debate the guy,” Walz added. Stumping earlier today in Pennsylvania, Vance said, “I absolutely want to debate Tim Walz,” but not until after the Democratic convention. He rouses the crowd with a smile on his face Walz, the former Army sergeant and football coach, is speaking in an old-school, rousing, populist style. In a feisty tone, dropping “damn well” and “come on” into his remarks, with a Midwestern dialect, Walz is delivering a strong indictment of Trump with a bit of laughter. “Say it with me! We are not going back,” he belted, starting a chant from the audience. “We’ve got 91 days. My god, that’s easy,” he said. “We’ll sleep when we’re dead.” Walz shares his family’s personal history with IVF Walz has made a personal connection with one of the marquee issues in this year’s election: in vitro fertilization. Walz said talking about IVF “gets personal for me and my family.” “It wasn’t by chance that, when we welcomed our daughter into the world, we named her Hope,” he told the crowd. Abortion opponents have been increasingly pushing for broader measures that would give rights and protections to embryos and fetuses, which could have massive implications for fertility treatments and other areas of health care. Democrats routinely cite IVF concerns as part of a larger problem where women in some states are getting worse medical care since the fall of Roe vs. Wade, linking delayed IVF care to cases in states with abortion restrictions, where women must wait until they are very sick in order to get care. He may be Minnesota’s governor, but he’s still a Nebraska native Walz sometimes talks about his native state of Nebraska more than the one he leads. He spoke about West Point, Nebraska, the “small town of 400” where he was born, and where he spent “the summers working on the family farm.” “My mom and dad taught us to show generosity towards our neighbors and work for a common good,” he added. Walz takes the stage Walz began his remarks by thanking Harris for selecting him. The campaigner known as being upbeat said, “Thank you for bringing back the joy!” Following a shoutout to Gov. Josh Shapiro, Walz praised his wife, a 29-year public school teacher, wryly plugging a key constituency, “Don’t ever underestimate teachers.” Different backgrounds Harris noted her and Walz’s different backgrounds: She’s from Oakland and he’s from Nebraska, but they have common ideals. “After all, the promise of America is what makes it possible for two middle-class kids,” Harris said, “to make it all the way to the White House.” “Coach Walz and I may come from different corners of our country,” she said, “but we believe in picking people up not knocking them down.” And without naming Vance, Harris argued for the superiority of her running mate’s experience over his GOP rival, using a sports analogy as the former football coach stood by. Saying Walz would be “ready on day one,” Harris characterized the race between her running mate and Vance as “a matchup between the varsity team and the JV squad.” Harris campaign rakes in over $20 million Harris’ selection of Walz as her running mate has been another fundraising boon for the Democratic presidential ticket. Her campaign announced shortly before 6:30 p.m. that it has raised more than $20 million since the vice president unveiled the Minnesota governor as her running mate. The Harris campaign has seen a surge in fundraising since she took over the top of the ticket, raising more than $310 million in July. Well over $200 million of that total came after Harris took over top billing from President Joe Biden on July 21. Walz is certified by the DNC As Walz took the stage with Harris in Philadelphia, his status as Democrat’s No. 2 for the general election was announced as official. Democratic National Committee Chairman Jaime Harrison and Minyon Moore, chair of Democrats’ upcoming convention, said in a statement that Harris and Walz had been certified as their party’s nominees. Late Monday night, Harris officially secured the delegates needed to become her party’s presidential nominee. Hours later, she named Walz as her running mate. Harris highlights Walz’s political record Harris ticked through Walz’s record as Minnesota governor, saying he supports her goal of fighting for the middle class. Walz was the first governor in the country to sign a law enshrining abortion as a right, she said. She noted paid leave for women and voting rights. But the biggest applause of the list came when Harris noted Walz’s move to provide meals to all public school students. “He refused to let students go hungry,” she said. “So, he made school breakfast and lunch free for every child.” Harris also pointed out that her new running mate “is a hunter and a gun owner too,” then immediately noting that as governor Walz “expanded background checks and increased penalties for illegal firearm sales.” Harris highlights Walz’s teaching credentials “Under those Friday night lights Coach Walz motivated his players,” Harris said referring to his time as high school football coach, “Going from a winless record to the school’s first-ever state championship.” She went on to note how as football coach he helped start the school’s gay-straight alliance “because he’s the kind of person who makes them feel like they belong,” she said. “That’s the kind of vice president he’s going to be and that’s the kind of vice president America deserves.” Sergeant major, congressman, coach Harris introduced Walz as “more than a governor” by running through the titles he’s held over the years. Beyond that of husband and father, Harris said he was “Sergeant Major Walz” to his fellow veterans, “Congressman” to voters of southern Minnesota, “Mr. Walz” to the high school students he used to teach and “Coach” to the football players he coached. “And in 91 days, the nation will know Coach Walz by another name: vice president of the United States,” Harris said to cheers. Harris frames Walz as the partner she's been looking for Harris took the stage in Philadelphia for the first time as the Democratic presidential nominee Tuesday, amid raucous cheers in an auditorium on the campus of Temple University. But her intro was serious. “We need to move to the general election and win that,” she said. “We also need to level set. We are the underdogs in this race, but we have the momentum and I know exactly what we’re up against.” In preparing to hand off to Walz, Harris is building him up as the partner she had been looking for during her quick search for a running mate. “I set out to find a partner who can help build this brighter future, a leader that will help unite our nation and move us forward,” she said. “Pennsylvania, I’m here today because I found such a leader, Gov. Tim Walz of the great state of Minnesota.” Harris and Walz take the stage Vice President Kamala Harris has made her first appearance with her newly chosen running mate, Minnesota Gov. Tim Walz. Harris and Walz have taken the stage together at a packed rally in Philadelphia. The pair ignited sustained cheers as they appeared before thousands at Temple University’s Liacouras Center. Walz, the 60-year-old governor and former U.S. House member from rural south central Minnesota, put his hands together and bowed to the crowd. He stood alongside Harris as she waved to the audience and put her hand over her heart, wrapping the other around Walz. According to excerpts provided by the campaign, Walz plans to use his speech to say that Minnesota values are American values. Biden learned about Walz from Harris, not the news “He heard it first from the vice president,” White House press secretary Karine Jean-Pierre told reporters at her regular briefing. She said she couldn’t “pinpoint” exactly where the president was when Harris called on Tuesday morning, but that he was somewhere in the executive mansion. “She called him to let him know of her pick,” Jean-Pierre said. Harris had sought Biden’s advice during her search for a running mate, but Jean-Pierre left it there and declined to get into any specifics. Biden also spoke with Walz and congratulated him on his selection. Philadelphia mayor calls for unity among Democrats Philadelphia Mayor Cherelle Parker, who advocated fiercely but unsuccessfully for her state’s governor, Josh Shapiro, to be Harris’ running mate now says, “Our Democratic nominee has spoken and that’s it. Period. End of story.” At a rally in her city on Tuesday, Parker urged Pennsylvania Democrats to rally behind Harris’ choice. Noting that Republicans and detractors would attempt to divide Democrats over the pick Parker says that the party can’t let them. Parker made headlines last week for posting a video praising Harris and Shapiro, which some thought suggested Harris had already picked Shapiro as her running mate. Instead, Harris chose Walz and the pair will appear together for the first time at the Philadelphia rally. The last politician to face off against Tim Walz has some advice for JD Vance Dr. Scott Jensen, a physician and former Republican Minnesota state senator, was the last political candidate to run against Walz in a general election but lost by nearly 8 points. Jensen says Republican vice presidential nominee JD Vance should be prepared for Walz’s fast-talking debate style. He also thinks Walz’s appeal in rural areas has been overstated. “Tim Walz can talk around a topic extremely effectively. He will give people the impression that he is the candidate of the common, everyday person,” Jensen said. “But if you look at the results of the 2022 election, Tim Walz really won the election because of the Twin Cities, Duluth and Rochester.” He also pointed out that in the 2022 governor’s race, Walz lost many of the counties in the district he previously represented in Congress. “Tim Walz lost the district in which the people who knew him best were offered the opportunity to make a decision about his candidacy,” Jensen said. “I think that’s telling.” Trump will sit for an interview with Elon Musk Trump says that he will do an interview with billionaire Tesla CEO Elon Musk next week. Musk endorsed the Republican for president after Trump survived an assassination attempt. “ON MONDAY NIGHT I’LL BE DOING A MAJOR INTERVIEW WITH ELON MUSK — Details to follow!” Trump posted on his social media network. His campaign did not immediately have more details to share. Trump, a longtime opponent of electric cars, said over the weekend at his rally in Atlanta that he favors electric cars “for a small slice” of the population, saying, “I have to be, you know, because Elon endorsed me very strongly.” He added: “So I have no choice.” Expect Walz to extol Harris during his first running mate appearance Ahead of a rally in Philadelphia, the Harris campaign has released experts of Walz’s prepared remarks where he’ll introduce himself to the nation, highlight his support for Harris and emphasize stopping Trump at the ballot. Walz will say that the vice president “has fought on the side of the American people” and “brings joy to everything she does.” “Minnesota’s strength comes from our values — our commitment to working together, to seeing past our differences, to lending a helping hand,” Walz plans to tell the rally. “Donald Trump — he sees the world differently. He doesn’t know the first thing about service — because he’s too busy serving himself.” The phone call that sealed the deal Wearing khakis and a camouflage baseball cap, Minnesota Gov. Tim Walz accepted a phone call from Vice President Kamala Harris. The Harris campaign has posted a video of the call on social media. “Hi, this is Tim,” Walz said into his phone. “It’s Kamala Harris. Good morning, governor,” the Democratic nominee said with a big smile. “Listen, I want you to do this with me. Let’s do this together. Would you be my running mate?” “I would be honored, madame vice president,” Walz said. The two exchanged pleasantries over the roughly minute-long video and Harris ended the call with an, “All right, buddy. I’ll see you soon. Take care.” The campaign said it has raised more than $10 million from “grassroots supporters alone” since Walz became her running mate. Voter Voices: ‘I was open for whoever she picked’ Marnie Fowler, a 44-year-old Philadelphia who works in concert touring, wore a blue T-shirt she recently purchased online that said: “Childless Cat Lady,” a reference to remarks by GOP vice presidential candidate JD Vance. Farlow said she wanted Walz all along. “He’s America’s dad,” Farlow said. “Everything he’s done in Minnesota aligns with my values.” Cheryl Pitts, a 77-year-old retired state worker from Sicklerville, New Jersey, said she was “a little bit” disappointed that Pennsylvania Gov. Josh Shapiro wasn’t picked, “but it won’t stop us from voting; it didn’t diminish my excitement.” She called Walz “a regular kind of guy that I can believe what he says.” Bernie Strain, 66, wore a shirt he made himself for the rally that said: “OLD WHITE MEN FOR HARRIS & FREEDOM.” Strain said he’d met Shapiro through politics but was ready to support whoever Harris selected. “I was open for whoever she picked,” he said. “I was going to support them with both feet.” A Republican strategist actually praising Harris’ VP pick Mark Campbell is a rare Republican who’s publicly praising Harris’ choice of Walz, calling it “a home run.” Campbell, a veteran GOP strategist who managed Glenn Youngkin’s winning 2021 Virginia governor’s campaign, ticked through a number of areas he suggests Walz reinforces Harris, first as an authentic surrogate in the northern battleground states of Michigan, Pennsylvania and Wisconsin. An enlisted Army veteran, “not officer class,” Walz is “plainspoken, folksy in a way that will play well in the burbs and rural areas,” Cambell said. He’s “progressive, but not too far from center,” he said, and will align with “Harris on policy 90% of the time.” Campbell called the selection “rock steady.” Kentucky Gov. Andy Beshear says Walz is a good pick for Harris’ running mate Beshear said it was “a true honor of a lifetime” to be considered for Vice President Kamala Harris’ running mate and that Minnesota Gov. Tim Walz was a good pick. “He is a great friend,” Beshear told reporters outside his office in the Kentucky Capitol on Tuesday afternoon. “He’d be an amazing vice president. I am 100% onboard with doing everything I can to elect the Harris-Walz ticket this November.” Beshear declined to comment on the process -- when he was interviewed for the job and if he heard from Harris or her team Tuesday morning. Man who owned rights to HarrisWalz.com says he’s sold the domain; declined to name the buyer Jeremy Green Eche, the trademark lawyer who purchased HarrisWalz.com for $8.99 in 2020, sold the domain - and a slate of others linked to Democratic presidential nominee Kamala Harris - on Tuesday for $15,000, he told The Associated Press shortly after the order was made. Eche declined to say who bought the domains, but said they have “no obvious connection to either campaign or anything political.” Harris selected Minnesota Gov. Tim Walz to be her running mate Tuesday. Eche bought the rights to the site and others in 2020 when the would-be vice president was in the midst of a primary campaign for president. When he learned Walz was the pick, Eche was particularly excited, both because the Harris supporter liked Walz best out of the men the vice president was considering, and because it meant someone paying his $15,000 asking price was more likely. Now that the site was sold, however, Eche says he feels glad but odd. “I feel strange,” he said, “like it happened too soon.” The domains were sold on the website for Eche’s start-up, Communer, a forum that allows people to buy and sell domains and trademarks online. Eche said the website will now draw up a domain transfer contract between himself and the buyer. Group founded by Republican women opposed to Trump support Walz A group founded in June by current and former Republican women who oppose Donald Trump for president came out in favor of Walz as Harris’ pick, in part for Walz’s fiscal measures and policy accomplishments aimed at women. “As Governor, he’s cut taxes for the middle class while balancing the budget, supported paid family leave so new mothers can be home to care for their children, expanded access to pre-kindergarten, and make sure that no Minnesotan child goes hungry at school,” a release from Women4U.S. states. The group is a federal superPAC whose honorary advisers include former New Jersey Gov. Christine Todd Whitman, former New Hampshire Republican Chair Jennifer Horn and founding editor of The Weekly Standard, Bill Kristol. Former House Speaker Nancy Pelosi welcomes Walz to the race Speaker Emerita Nancy Pelosi welcomed the Minnesotan to what she called the Harris-Walz “freedom ticket.” “In the Congress, I saw firsthand Tim Walz’s leadership, collaborative spirit and effectiveness in bringing people together and getting the job done,” Pelosi said in a statement. The former Democratic House speaker was pivotal in reshaping the presidential race as President Joe Biden stepped aside and she said the field of potential VP candidates “demonstrated the strength and vitality of the next generation of Democratic leadership.” Wisconsin Sen. Tammy Baldwin: ‘We’re thrilled to see a fellow Midwesterner at the top of the ticket’ It didn’t take Wisconsin Sen. Tammy Baldwin long to seize on Harris’ selection of Walz as a fundraising tool for her competitive reelection campaign. “We’re thrilled to see a fellow Midwesterner at the top of the ticket,” Baldwin said in a fundraising email sent late Tuesday morning. Baldwin, seeking a third term, is among several incumbent Democratic senators seeking reelection in states viewed as pivotal to the presidential campaign, and where an uptick in enthusiasm since Harris’ takeover of Joe Biden’s campaign has lifted the party’s hope of holding the seat. Baldwin spoke at Harris’ first campaign stop as a candidate last month, an upbeat rally in suburban Milwaukee. “Wisconsin has emerged as the tipping point state that will determine who wins the White House and which party controls the Senate,” Baldwin’s email said. Biden carried Wisconsin in 2020 by fewer than 21,000 votes. Voto Latino co-founder says Walz as running mate will help energize Latino voters Voto Latino co-founder and President Maria Teresa Kumar said Walz’s selection to the ticket would help energize Latino voters who want a more inclusive democracy. Kumar said in a statement that Walz’s “strong record of defending democracy, protecting voting rights, and standing up for working families in Minnesota aligns perfectly with the values our organization and the Latino community hold dear.” She added that she knows the vice president and governor personally and knows they’ll represent a powerful voice for “progress, equality and opportunity for Latino communities and all Americans.” Sen. Mark Kelly urges supporters to contribute to the Harris-Walz ticket Arizona Sen. Mark Kelly said he and his wife, former U.S. Rep. Gabby Giffords, will do everything they can to elect Harris and Walz after Kelly was passed over for the Democratic ticket. Kelly sent an email to supporters urging them to contribute to the Harris-Walz ticket. “Tim has years of experience representing Minnesota both in the House of Representatives, where he served with Gabby, and as Minnesota’s governor,” Kelly wrote. “In that time, he has shown up time and time again for working families and I know he’ll continue that work in the White House.” Meanwhile, the head of GIFFORDS, a gun-control advocacy group founded by Kelly and Giffords, called Walz “a strong gun safety champion.” “Gun violence is a top concern for Americans this election cycle and we know the Harris-Walz ticket is the only one that will stand up to the gun lobby and save lives,” said GIFFORDS Executive Director Emma Brown, who managed Kelly’s 2022 Senate campaign and was his deputy campaign manager when in his first race two years earlier 2020. Vance blames Harris’ policies for drug addiction deaths Vance is aiming to tie what he portrays as Harris’ failures along the U.S.-Mexico border to deaths from drug addiction. Vance told several hundred supporters gathered in a South Philadelphia event space that, “thanks to the policies of Kamala Harris, you’ve got children who’ve been orphaned” when their parents die from drugs. Several Pennsylvanians shared personal stories of how addiction issues have impacted their families. As he has over several speeches and interviews in recent weeks, Vance told his own story related to drug addition, noting that his mother has been drug-free for a decade but, as a child, he was “desperately hoping and praying, Jesus, please let her wake up from this.” U.S. government data undercuts the claim that people seeking asylum and other border crossers are responsible for drug trafficking. At a hearing last year, James Mandryck, a U.S. Customs and Border Protection deputy assistant commissioner, said 73% of fentanyl seizures at the border since the previous October were smuggling attempts carried out by U.S. citizens, with the rest being done by Mexican citizens. Barack and Michelle Obama say Harris ‘has chosen an ideal partner’ “Governor Walz doesn’t just have the experience to be vice president, he has the values and the integrity to make us proud,” the former president and first lady said in a statement. They said Walz enacted progressive priorities as Minnesota governor including paid family leave, abortion rights and gun safety measures. “But Tim’s signature is his ability to talk like a human being and treat everyone with decency and respect,” the Obamas said. Vance says he tried to get Walz on the phone The Republican told reporters aboard his campaign plane Tuesday that he called Walz earlier in the day but “I left him a voicemail, I didn’t get him.” It’s not clear if there will be a debate between Vance and Walz. Last week, Trump said he wouldn’t take part in an ABC News debate that had been on the books for September because he made that agreement with Biden before the president exited the campaign. Instead, Trump said he would debate Harris on Sept. 4 on Fox News, but the vice president hasn’t agreed to that time or network yet. President Joe Biden calls Harris-Walz ticket ‘a powerful voice for working people’ and middle class Biden called on Democrats and all Americans to rally behind them. “They will be the strongest defenders of our personal freedoms and our democracy,” Biden said in a social media post. “And they will ensure that America continues to lead the world and play its role as the indispensable nation.” Biden said choosing a running mate is a party nominee’s first major decision and praised Harris’ choice. He said he’s known Walz for nearly two decades, praising his background as a teacher, football coach and National Guard soldier. “Every generation of Americans faces a moment where they are asked to defend American democracy,” Biden said. “That moment is now.” White House Senior Deputy Press Secretary Emilie Simons says Biden and Harris spoke on the phone Tuesday morning ahead of the official announcement that she selected Walz and that Biden spoke with Walz to congratulate him. Vance says Walz pick as running mate ‘highlights how radical’ Harris is In his first public comments since his general election foe was set, JD Vance on Tuesday called Walz a choice that “highlights how radical Kamala Harris is.” In a gaggle with reporters aboard his campaign plane upon landing in Philadelphia, Vance said Walz “is a person who listens to the Hamas wing” of the Democratic Party and “who wants to make the American people more reliant on garbage energy instead of good American energy.” Vance is speaking more to reporters in Philadelphia on Tuesday ahead of campaign events across Midwestern battleground states on Wednesday, in a path that somewhat mirrors Harris and Walz’s planned trajectory. Former colleagues on Capitol Hill appear thrilled with Walz as the VP pick “Great choice,” said Senate Majority Leader Chuck Schumer. “Having served for years with Tim in the House of Representatives, I can say without reservation: there’s no better person Vice President Harris could have picked to run and then govern alongside her,” said Sen. Chris Van Hollen, D-Md. Walz “has always put our country first,” Van Hollen said, and he’s excited to campaign for the Harris-Walz ticket for “a brighter future for all Americans.” Rep. Mark Takano of California recalled how after Walz beat him during an internal House caucus vote to become the top Democrat on the Veterans Affairs Committee, his colleague “immediately brought me into the fold because that’s the type of leader he is: a collaborative bridge builder.” And Vermont Sen. Peter Welch, who entered Congress with Walz in 2007, said he “has always had this very straightforward, direct, open approach to things.” Welch described Walz as “one of these guys in the gym who wouldn’t undo his tie” because it would be faster for him to get back to work. Polling shows the appeal of Tim Walz’s biography Tim Walz’s biography as a military veteran and former high school teacher – two broadly trusted professions – may also help him appeal to Americans as he campaigns with Vice President Kamala Harris. About 9 in 10 U.S. adults say they have a favorable opinion of military veterans, generally, according to an Ipsos poll conducted in 2024. About 8 in 10 say that about school teachers. Both measures are much higher than for government employees or elected officials. Republicans are slightly more likely than Democrats to have a positive view of veterans, while Democrats are a bit more likely to have a favorable opinion of those in a teaching career. Gallup polling from 2022 found that high school teachers are generally held in high regard among Americans for their honesty and ethical standards. About half, 53%, gave them at least a high rating on ethics. AP VoteCast shows Tim Walz’s electoral strengths and weakness in Minnesota Democratic nominee Kamala Harris is hoping her VP choice, Tim Walz, will strengthen the Democratic ticket in Midwestern states and among working class voters. AP VoteCast shows that when Walz was elected Minnesota governor in 2022, he won young voters in the state. He also did well in Minnesota’s union households, winning nearly 6 in 10 voters in that group. About half of Minnesota voters, 52%, had a favorable view of Walz, and about 4 in 10 had a negative one. And while Walz lost white voters without a college education in the state, he outperformed Democrats nationwide with this group. He also struggled among white men, a demographic Democrats have sought to win back from President Donald Trump, but did a little better among this group than Democrats nationwide. However, Walz lost among military veteran households in Minnesota in 2022, according to VoteCast. Tim Walz will need to introduce himself to America Minnesota Gov. Tim Walz will need to introduce himself to the vast majority of Americans. An ABC News/Ipsos survey conducted before Walz was selected as Vice President Kamala Harris’ running mate, but after vetting began, showed that nearly 9 in 10 U.S. adults did not know enough to have an opinion about him. Among Americans with a view, opinions were split between positive and negative: 6% had a favorable view, and 7% had an unfavorable one. Walz’s lack of a national profile as he joins Harris on the campaign trail extends to his own party. Nearly 9 in 10 Democrats also didn’t know enough to have an opinion of Walz in the ABC News/Ipsos poll. One in 10 had a favorable view of him, and just 4% had a negative opinion. He was an unknown figure among most Democrats across the party: those older and younger were similarly likely to not know Walz, as well as white Democrats and non-white Democrats. Fellow Minnesotan Sen. Amy Klobuchar says Walz is ‘just unendingly optimistic and joyous’ U.S. Sen. Amy Klobuchar says Walz is someone who is “just unendingly optimistic and joyous, and that is very, very important right now in our politics.” The fellow Minnesotan who served with Walz in Congress told The Associated Press “he’s blunt, but he’s also positive” in a way she believes will provide an upbeat message in contrast to the Trump-Vance Republican ticket. “I always think of him in his plaid shirt because he was always making the point it’s ‘One Minnesota,’” said Klobuchar, a Democrat. “And I think that’s a point you’re going hear him talk about with our nation.” She said his background as a hunter and someone who fishes “just brings a different perspective to the White House.” Several black and white SUVs have left the Governor’s residence in St. Paul The SUVs left amid cheers from residents lined up on the sidewalk. Harris’ running mate pick is good news for man who owns rights to HarrisWalz.com Jeremy Green Eche was in the middle of getting his toddler dressed the moment news broke that Democratic presidential nominee Kamala Harris had selected Minnesota Gov. Tim Walz to be her running mate. And he was amped. Eche was uniquely invested in Harris’ pick. He currently owns the rights to HarrisWalz.com, a site he bought in 2020 — along with a slate of other Harris sites — when the would-be vice president was in the midst of a primary campaign for president. Four years and one vice presidential pick later, Eche is willing to sell the slate of Harris websites, including the one featuring Walz, for $15,000. “I was constantly refreshing four different news sites on my phone,” he told The Associated Press on Tuesday. “I was very excited.” He said he “almost immediately” began getting calls from both journalists and “friends I hadn’t heard from in a while.” This is not a new scenario for the 36-year-old trademark lawyer in Brooklyn, New York. Eche is a cyber squatter, someone who buys a domain with someone else’s name or brand in it for very little money, hoping to sell it to that person or brand for a large profit in the subsequent months or years. In 2011, when it looked likely that Secretary of State Hillary Clinton would be the Democratic nominee in 2016, then Jeremy Peter Green – he took his wife’s last name – purchased ClintonKaine.com. After the former secretary of state picked Virginia Sen. Tim Kaine, the squatter offered it to the campaign for a hefty return. They declined, so he sold it for $15,000 to a digital marketing company that turned out to be the Trump campaign. The website pushed anti-Clinton news with “Paid for by Donald J. Trump for President, Inc” emblazoned at the bottom. Eche supported Clinton in 2016 and supports Harris today. The prospect of something like that happening again doesn’t give Eche pause, however. “The Harris campaign has hundreds of millions of dollars, so if they don’t buy their own domain, that is kind of on them,” he said Monday. But he isn’t convinced they will buy the domain. “I don’t want to be too confident that somebody will reach out,” he said after Walz was selected. “I would say there’s a 75% chance that one of the campaigns, or a PAC, will buy it from me.” Walz says he’s ‘all in’ In a Tuesday morning post on X, Walz said joining the ticket with Harris is “the honor of a lifetime.” His profile details on X are now “Running to win this thing with @kamalaharris.” Pennsylvania Gov. Josh Shapiro on Walz Shapiro called Walz “an exceptionally strong addition to the ticket” who’ll help Harris become the 47th president. Shapiro, who met with Harris on Sunday about the job, said he was grateful to talk about “her vision for the role and the campaign ahead.” “As I’ve said repeatedly over the past several weeks, the running mate decision was a deeply personal decision for the vice president – and it was also a deeply personal decision for me. Pennsylvanians elected me to a four-year term as their governor, and my work here is far from finished – there is a lot more stuff I want to get done for the good people of this commonwealth,” Shapiro said in a statement. He said he considers Walz a good friend and pledged to travel the state over the next three months to help Democrats defeat former President Donald Trump “and build a better future for our country.” “Vice President Kamala Harris has my enthusiastic support – and I know that Governor Tim Walz is an exceptionally strong addition to the ticket who will help Kamala move our country forward,” Shapiro said. At the Governor’s mansion, a Minnesota resident says why he likes Walz David Ivory, 46, stood outside the Governor’s mansion with his two children. Ivory found out Walz was selected after his wife texted him “OMG” from work. He and his kids immediately hopped on their bikes and rode to the Governor’s residence in St. Paul. Ivory and his family are longtime admirers of Walz for his liberal record and amiable political persona. “He’s just down to earth. He gets it. He can talk to anybody,” Ivory said. “He doesn’t seem like he’s above anybody. He was a teacher. He understands kids, which is very important.” Harris says her new running mate Minnesota Gov. Tim Walz has ‘delivered for working families’ “It’s great to have him on the team,” Harris said. Harris posted on X that she was proud to announce she asked Walz to join her on the 2024 ticket. Voter Coalition Pushes Issue-Based Outreach Strategy to Increase Registration, Shifting from Top of Ticket Politics State Voices launched a $3 million nationwide campaign Tuesday to encourage voters of color to vote based on the issues that affect their day-to-day lives, like grocery price spikes or growing rent and mortgage payments. Under the Vote for Something campaign, the coalition aims to register 800,000 voters, make more than 250 million voter contacts, and encourage 100,000 people to make a plan to vote on or ahead of the 2024 election for themselves and others. They’ve registered more than 400,000 voters so far. State Voices, like many voting rights advocates, hopes for messaging that transcends the top of the ticket — a looming match between Vice President Kamala Harris and former president Donald Trump in the 2024 presidential election. “Whatever the issue is that matters to you, vote for something. Get out this November and bring a friend and a family member with you,” said Mishara Davis, the group’s director of issue and electoral organizing. The key has been reaching voters who may be tired of the political space altogether or who are eligible to vote but aren’t registered and therefore may not receive voting information — especially in presidential swing states, Georgia, Michigan, and Pennsylvania, which are primary areas under the campaign. This comes as Harris, who is in Pennsylvania this week, has chosen Minnesota Gov. Tim Walz as her running mate, sources say. The pair will continue the campaign tour to Wisconsin, Michigan, North Carolina, Arizona and Nevada starting Wednesday. Environmental group cheers selection of Walz as the Democratic vice presidential candidate Manish Bapna, president and CEO of the NRDC Action Fund, the political arm of the Natural Resources Defense Council, called Harris and Walz “the winning ticket on climate. The Harris-Walz administration will be ready, on day one, to build on the strongest climate action ever and lead by example in the global fight against the existential challenge of our time.\" Walz has made Minnesota a national climate leader, Bapna said. Under his leadership, the state committed to 100% clean energy by 2040, and Minnesota was the first Midwestern state to adopt California’s strict tailpipe emissions standards. Walz also signed a bill last year directing $240 million to replace lead service water lines statewide. “The stakes in this election couldn’t be higher nor the choice more clear. Trump would bow to billionaire oil and gas donors, slam climate progress into reverse and leave our kids to pay the price. Harris is a proven climate and justice leader with two decades of public service on the front lines of needed progress and change. She’s shown us what leadership looks like, and she’s earned the chance to lead,” Bapna said. The National LGBTQ Task Force Action Fund praises Walz’s selection “The National LGBTQ Action Fund expected a strategic and bold choice as a strong addition to the ticket as a Vice-Presidential candidate,” Sayre E. Reece, vice president of the National LGBTQ Task Force Action Fund, said Tuesday in a statement. “In Governor Walz we have gotten both.” Reece continued: “Governor Walz has been a steadfast ally and advocate for the LGBTQ community, including support for trans affirming care, bodily autonomy and reproductive freedom and gun control. As Governor, Walz signed a ban on so-called ‘conversion therapy’ into law, ending the harmful and cruel practice that has cost LGBTQ people their dignity and their lives. Under Walz’s leadership, Minnesota is both a ‘trans sanctuary’ and immigration sanctuary state.” The National LGBTQ Task Force Action Fund describes itself as lobbying for legislation and ballot initiatives that “achieve justice” for LGBTQ people. At Walz’s residence in Minnesota A growing crowd of residents and news reporters gathered outside Walz’s residence in St. Paul, Minnesota, on Tuesday morning. Black and white SUVs periodically pulled into the driveway as onlookers waited to catch a glimpse of Walz leaving the 20-room governor’s mansion near the Mississippi River. No immediate comment from Vance on Harris picking Walz as her running mate Boarding his campaign plane Tuesday morning in Cincinnati for a swing through battleground states this week, Ohio Sen. JD Vance did not answer shouted questions about Harris picking Walz as her running mate. On Tuesday, Vance was heading to Pennsylvania, where Harris planned to debut with her new running mate later in the day. Trump attacks Walz in a fundraising email Donald Trump sent a fundraising email calling Walz “Dangerously Liberal” and saying he would “unleash HELL ON EARTH.” Moments after Harris’ VP pick became public, the former president and Republican nominee said Walz would be the worst vice president in history, claiming the Minnesota governor would “light TRILLIONS of dollars on fire” and open U.S. borders to criminals. “HE’S THAT BAD,” the email says. The selection process that led Harris to pick Walz as her running mate A team of lawyers and political operatives led by former attorney general Eric Holder pored over documents and conducted interviews with potential vice presidential selections. And Harris herself met with her three finalists on Sunday. She mulled the decision over Monday with top aides at the vice president’s residence in Washington and finalized it Tuesday morning. Walz emerged as the choice. A Minnesota Democratic strategist praises Walz’s ability to connect with voters Minnesota Democratic strategist Abu Amara says Walz will be a good surrogate for Harris across the upper Midwest, because he represented a rural U.S. House district but won statewide in a state with large metropolitan and suburban areas. “He’s not trying to speak in poetry. He speaks in practicality,” Amara said. “That’s a level of accessibility for so many voters.” “He has the ability to connect with rural, suburban and urban voters,” he said. Some Republicans are already reacting to the selection of Minnesota Gov. Tim Walz as Harris’ VP pick Florida Gov. Ron DeSantis called it the “most left-wing ticket in American history” and accused Walz of not doing enough to protect Minnesota during the 2020 protests over the killing of George Floyd. He said “Walz sat by and let Minneapolis burn.” Tropical Storm Debby continues to upend Harris’ travel plans this week The campaign had already pulled down a planned stop in Savannah, Georgia, because of the weather. But the Democratic presidential nominee will now no longer travel to Raleigh, North Carolina, either, according to the campaign. She was set to travel to Raleigh on Thursday. Harris is launching a tour of battleground states on Tuesday evening, starting in Philadelphia. Harris picks Minnesota Gov. Tim Walz as running mate, AP sources say Vice President Kamala Harris picked Minnesota Gov. Tim Walz to be her running mate on Tuesday. That’s according to three people who spoke to The Associated Press. In choosing Walz, she’s turning to a Midwestern governor, military veteran and union supporter who helped enact an ambitious Democratic agenda for his state, including sweeping protections for abortion rights and generous aid to families. The people were not authorized to speak publicly about the choice and spoke to AP on condition of anonymity. — Seung Min Kim, Zeke Miller and Colleen Long Sources say Harris has decided on a running mate Vice President Kamala Harris has decided on a running mate and an announcement is expected in the coming hours before the two appear together at a Philadelphia rally, according to three people familiar with her decision. In recent days, she has zeroed in on a trio of potential finalists: Pennsylvania Gov. Josh Shapiro, Arizona Sen. Mark Kelly and Minnesota Gov. Tim Walz. It wasn’t clear yet who she picked. The people were familiar with her plans but spoke to The Associated Press on condition of anonymity to discuss a decision that had not been publicly announced. Harris’ campaign planned to make the announcement via video message before the rally, though the exact timing remained unclear, according to a person involved in the planning who spoke on the condition of anonymity to detail discussions occurring behind closed doors. — Seung Min Kim, Zeke Miller and Colleen Long Harris formally secures the Democratic presidential nomination Vice President Kamala Harris formally secured the Democratic presidential nomination late Monday — becoming the first woman of color to lead a major party ticket. Harris’ nomination became official after a five-day round of online balloting by Democratic National Convention delegates ended Monday night, with the party saying in a statement released just before midnight that 99% of delegates casting ballots had done so for Harris. It said it would next formally certify the vote before holding a celebratory roll call at the party’s convention later this month in Chicago. Harris’ coronation as her party’s standard-bearer caps a tumultuous and frenetic period for Democrats prompted by President Joe Biden’s disastrous June debate performance. As soon as Biden abruptly ended his candidacy, Harris and her team worked rapidly to secure backing from the 1,976 party delegates needed to clinch the nomination in a formal roll call vote. She reached that marker at warp speed, with an Associated Press survey of delegates nationwide showing she locked down the necessary commitments a mere 32 hours after Biden’s announcement.","summary":"Vice President Kamala Harris has chosen Minnesota Gov. Tim Walz as her running mate, looking to strengthen the Democratic ticket in Midwestern states","url":"https://www.independent.co.uk/news/world/americas/ap-minnesota-joe-biden-democratic-vice-president-b2592317.html","image":"https://static.independent.co.uk/2024/08/07/00/Election_2024_Harris_03171.jpg?width=1200","video":null,"publish_date":"2024-08-06 23:00:21","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"gb","sentiment":0.064}]}