{"offset":0,"number":50,"available":11826,"news":[{"id":364084584,"title":"Donald Trump Sends Military Forces to Portland, Oregon","text":"United States President Donald Trump on Saturday said he was directing the US military to deploy to Portland, Oregon, and to protect federal immigration facilities against “domestic terrorists”, saying he was authorising them to use “full force, if necessary”. \n\nOrdering the latest crackdown on a Democrat-led city, Trump said in a social media post that he was directing defence secretary Pete Hegseth “to provide all necessary Troops to protect war-ravaged Portland, and any of our ICE (Immigration and Customs Enforcement) facilities under siege from attack by Antifa, and other domestic terrorists.”\n\nPortland Mayor Keith Wilson, responding to Trump’s order, said: “The number of necessary troops is zero, in Portland and any other American city. The president will not find lawlessness or violence here unless he plans to perpetrate it.”\n\nViolent crime in Portland has dropped in the first six months of 2025, data show. Homicides fell by 51 per cent compared to the same period a year earlier, according to data released by the Major Cities Chiefs Association’s Midyear Violent Crime Report. \n\nIn a press conference on Saturday, Oregon Governor Tina Kotek, a Democrat, rejected the need for troops and said she had spoken with Trump and homeland security secretary Kristi Noem.\n\n“There is no insurrection, there is no threat to national security, and there is no need for military troops in our major city,” Kotek said.\n\nUS Senator Ron Wyden, a Democrat from Oregon, wrote on X that Trump “may be replaying the 2020 playbook and surging into Portland with the goal of provoking conflict and violence.”\n\nIn 2020, protests erupted in downtown Portland, the Pacific Northwest enclave with a reputation as a liberal city, following the killing in Minneapolis of George Floyd. \n\nIt was unclear whether Trump’s warning that US troops could use “full force” on the streets of Portland meant he was somehow authorising lethal force and, if so, under what conditions. US troops are able to use force in self-defence on domestic US deployments.\n\n“We stand ready to mobilise US military personnel in support of DHS operations in Portland at the President’s direction. The Department will provide information and updates as they become available,” said Sean Parnell, a Pentagon spokesperson.\n\nAsked about the Portland decision on Saturday, Department of Homeland Security spokesperson Tricia McLaughlin said ICE agents needed to be protected amid protests against immigration raids.\n\nThere have been growing tensions in major US cities over Trump’s aggressive immigration crackdown, days after a shooting targeting an ICE facility in Dallas left one detainee dead and two others seriously wounded.\n\nOn Thursday, Trump told reporters that “crazy people” were trying to burn buildings in Portland.\n\n“They’re professional agitators and anarchists,” he said, without providing evidence.\n\nThe most notorious episode involving the movement occurred in Portland in August 2020, when Michael Reinoehl, a self-identified antifa supporter, shot and killed Aaron “Jay” Danielson, a member of the far-right group Patriot Prayer. \n\nReinoehl was killed by federal and local law enforcement officers during an attempt to arrest him.\n\nThe Trump administration’s goal of deporting record numbers of immigrants living in the US illegally has framed the push around criminals, but it has arrested many people without criminal records. \n\nIn the Chicago suburb of Broadview on Friday, ICE used tear gas, less-lethal rounds and pepper balls to quell protests outside an immigration detention centre. \n\nProtests have also occurred outside other detention centres around the country, including in Portland.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUnited States President Donald Trump on Saturday said he was directing the&#8230;\n\n\nThis Post: Donald Trump Sends Military Forces to Portland, Oregon first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/donald-trump-sends-military-forces-to-portland-oregon/","image":"https://images.sbs.com.au/dims4/default/c9b4e89/2147483647/strip/true/crop/1800x1013+0+94/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fc9%2Fa5%2F3b4d4af64d7093b7713a3dc70d50%2Fa-man-is-detained-by-ice-agents-after-lea","video":null,"publish_date":"2025-09-28 00:47:46","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.401},{"id":364084582,"title":"Kilmar Abrego Garcia Moved to Pennsylvania Detention Center","text":"In Nashville, Tennessee, Kilmar Abrego Garcia, previously deported from the U.S. to El Salvador amid the controversy surrounding President Donald Trump’s immigration enforcement, has been relocated from a detention center in Virginia to another facility in Pennsylvania.\n\nLegal documents reveal that Immigration and Customs Enforcement informed Abrego Garcia’s legal team on Friday about his transfer to the Moshannon Valley Processing Center in Phillipsburg. The agency stated this new location would provide easier access for his lawyers.\n\nNevertheless, his attorneys have voiced concerns about the conditions at Moshannon, citing recent allegations of “assaults, inadequate medical care, and insufficient food,” as mentioned in a federal court filing.\n\nThe Trump administration accused Abrego Garcia of being affiliated with the MS-13 gang, a claim that he refutes and for which no charges were filed.\n\nIn June, the administration allowed Abrego Garcia back into the U.S., but only to face charges related to human smuggling. His attorneys have criticized the charges as both absurd and retaliatory.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn Nashville, Tennessee, Kilmar Abrego Garcia, previously deported from the U.S. to&#8230;\n\n\nThis Post: Kilmar Abrego Garcia Moved to Pennsylvania Detention Center first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kilmar-abrego-garcia-moved-to-pennsylvania-detention-center/","image":"https://internewscast.com/wp-content/uploads/2025/09/Kilmar-Abrego-Garcia-transferred-to-Pennsylvania-detention-facility.jpeg","video":null,"publish_date":"2025-09-28 00:41:37","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.364},{"id":364083000,"title":"Portlanders mock Trump by posting pics of peaceful weekend activities in ‘War ravaged’  city","text":"Residents of Portland, Oregon, have mocked Donald Trump’s description of the city as “War ravaged,” by posting pictures online of their wholesome and peaceful weekends.\n\n“Live look at the war-torn streets of Portland, Oregon,” wrote one user, sharing a vista of the Steel Bridge, with blooming cherry blossom trees lining the walkways.\n\n“Marauding hoards wind their way through rows of roses in #WarRavagedPortland - oh the demise of humanity!” wrote another, alongside a snap of people enjoying a rose garden in the sunshine.\n\nPosting more pictures of a peaceful and largely deserted city center, a third user added: “Look at this bombed-out destruction zone, please stay away from #Portland because you just won’t be able to survive here.”\n\nIt comes after the president announced Saturday that he had directed Secretary of War Pete Hegseth to provide “all necessary Troops to protect War ravaged Portland, and any of our ICE Facilities under siege from attack by Antifa, and other domestic terrorists.”\n\n“I am also authorizing Full Force, if necessary. Thank you for your attention to this matter!” the president wrote on Truth Social.\n\nIn response, Portland Mayor Keith Wilson wrote in a statement: \"President Trump has directed 'all necessary Troops' to Portland, Oregon. The number of necessary troops is zero, in Portland and any other American city.”\n\nHis sentiment was shared with Oregon Governor Tina Kotek, who said she had been “abundantly clear” with both Trump and Homeland Security boss Kristi Noem that the city and state could handle its own security.\n\n“There is no insurrection. There is no threat to national security,” she wrote.\n\nOther political figures joined the online trend of sharing pictures of their communities: “Scenes from ‘war ravaged’ Portland today,” wrote Maxine Dexter, who represents Oregon’s 3rd Congressional district.\n\n“My message to Trump’s troops: You are not needed. You are not wanted. Go home.”\n\nOthers took a swipe straight back at the president, posting pictures of the January 6 riots at the Capitol in Washington, D.C. “Is this #WarRavagedPortland? I forget,” wrote one user.","summary":"‘Live look at the war-torn streets of Portland, Oregon,’ wrote one user, sharing a vista of the Steel Bridge bridge, with blooming cherry blossom trees lining the walkways","url":"https://www.independent.co.uk/news/world/americas/us-politics/portland-oregon-war-ravaged-trump-mocked-b2835092.html","image":"https://static.independent.co.uk/2025/09/28/0/40/SEI267935795-(1).jpeg?crop=2877,1918,x0,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/cR7gKpKq-4VHSaSK0.mp4","publish_date":"2025-09-28 00:23:59","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":0.214},{"id":364084578,"title":"Trump to hold talks with leading Congress members amid potential government shutdown","text":"WASHINGTON — President Donald Trump plans to meet with the leading four congressional figures at the White House on Monday as the deadline for a potential government shutdown approaches, according to one White House official and four congressional officials who spoke with NBC News.\n\nThe meeting is expected to include Senate Minority Leader Chuck Schumer, D-N.Y., House Minority Leader Hakeem Jeffries, D-N.Y., House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D.\n\nPunchbowl first reported the news.\n\nThis development follows Trump’s sudden cancellation of a scheduled meeting with Democratic leaders on Thursday, a move encouraged by Johnson and Thune. At the time, Trump labeled Democratic demands as “unserious and ridiculous.”\n\nSince that incident, Jeffries and Schumer have been publicly exchanging criticisms with Trump regarding the looming government shutdown and Democratic calls to include health care policies in the temporary funding bill.\n\nTensions heightened when the White House Office of Management and Budget instructed agencies to prepare layoff plans in anticipation of a shutdown.\n\nWith government funding due to expire on Sept. 30, the livelihoods of millions of federal employees are at risk. To avoid a shutdown, Congress must approve or extend a spending bill by that date.\n\nJeffries insisted earlier Saturday that the OMB memo won’t prompt Democrats to cede their demands.\n\n“Understand that the Trump administration has already been engaging in mass firings all throughout the year,” he said on MSNBC. “And so a government shutdown has nothing to do with what they’ve already shown they are willing to do, which is why we just have to continue to hold the line and make it clear our position: cancel the cuts, lower the cost, save health care.”\n\nSenate Democrats are also planning to hold a conference call on Sunday afternoon ahead of the chamber’s return to D.C.\n\nRepublicans have insisted that they won’t make concessions to pass a short-term funding bill for seven weeks, and that any negotiations can occur during the appropriations process.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON — President Donald Trump plans to meet with the leading four&#8230;\n\n\nThis Post: Trump to hold talks with leading Congress members amid potential government shutdown first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-to-hold-talks-with-leading-congress-members-amid-potential-government-shutdown/","image":"https://internewscast.com/wp-content/uploads/2025/09/Trump-to-meet-with-top-congressional-leaders-as-a-government.jpg","video":null,"publish_date":"2025-09-28 00:17:33","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.761},{"id":364082984,"title":"Trump's targeting of Soros Foundations sparks fear and defiance on left","text":"NYT News ServicePresident Donald Trump speaks at a memorial service for the conservative activist Charlie Kirk at State Farm Stadium in Glendale, Ariz., on Sunday, Sept. 21, 2025. During a panel discussion featuring world leaders and philanthropists in Manhattan on Thursday afternoon, Alex Soros said the $23 billion philanthropic organization he leads would not cave to pressure from President Donald Trump.(Adriana Zehbrauskas/The New York Times)\n\nDuring a panel discussion featuring world leaders and philanthropists in New York on Thursday afternoon, Alex Soros said the $23 billion philanthropic organization he leads would not cave to pressure from President Donald Trump. Soros, the son of billionaire investor and Democratic megadonor George Soros, defiantly told attendees that the organization had done nothing wrong and would back away from its human rights work \"over my dead body,\" according to two people who attended the panel who spoke on the condition of anonymity because it was an invitation-only event. The remarks came in response to a question about a report in The New York Times revealing that a senior Justice Department official had instructed more than a half dozen U.S. attorney's offices to draft plans to investigate the Open Society Foundations, which was started by George Soros. The nascent investigation comes as Trump is increasingly seeking to deploy federal law enforcement against his perceived enemies, including former FBI Director James Comey, who was indicted Thursday over the objection of career prosecutors. The targeting of Open Society, a pillar of the philanthropy and progressive worlds, is part of a broader effort by the Trump administration to cripple the financial and organizational infrastructure supporting Democrat-aligned causes and candidates. The effort has intensified since the assassination of conservative activist Charlie Kirk. Trump and his administration have asserted without evidence that liberal groups are stoking a violent conspiracy against conservative values and the American way of life. He signed a presidential memorandum Thursday ordering his administration to investigate what he claimed were rich people and organizations funding left-wing political violence around the country.Live Events The cumulative effect has left philanthropic and progressive donor communities on edge. \"This moment is dangerous for all of us because organizations are being targeted because of what and who they fund and because it is perceived that they are funding things that don't align with the political preferences of a particular administration, of this administration, and that is wrong,\" said Akilah Watkins, the president and CEO of Independent Sector, the national membership organization representing nonprofits and philanthropic foundations. A skittishness has taken over the Ford Foundation, according to three people in touch with it, which owns the building where Alex Soros spoke on the panel Thursday. The Ford Foundation was called out by Vice President JD Vance alongside Open Society after the assassination. Even before this week, the $16 billion foundation had been scrutinizing its distributed grants that officials there fear could be criticized for violating prohibitions on partisan political activity, according to a person close to the foundation. \"We are following our standard due diligence practices across our grant making,\" the foundation said in a statement. The foundation's board has been concerned about recent doxxing attempts against its directors, according to two people close to the foundation, both of whom requested anonymity because they were not authorized to discuss internal foundation matters. Faced with daunting choices, some in progressive finance circles have moved into a defensive crouch. Some have stopped sending emails out of concern that they could be subpoenaed in legal cases that the Trump administration could bring. One donor recently expressed concern that even donations made to groups anonymously could be unmasked by the government in a federal inquiry. And foundations are fearful about investigations from Immigration and Customs Enforcement into the immigration status of their employees. Even before news of the Justice Department's move to investigate Open Society, some major philanthropies declined to sign a letter last week pushing back on Trump's attacks on the sector. They feared that it would be seen as too oppositional to a powerful administration and that a bipartisan approach would be better, according to two people familiar with the conversations. Ford and Open Society signed the letter. Reid Hoffman, a co-founder of LinkedIn and one of the country's biggest Democratic donors who was named by Trump on Thursday as another potential target, has largely vanished from political giving in 2025 and is much less publicly voluble about his disagreements with Trump, people close to him say. Still, in the pantheon of megadonors vilified by political opponents, George Soros and the Open Society Foundations stand alone. George Soros has personally been among the top donors to Democratic candidates and groups for more than two decades. And his philanthropic organization, established decades ago, has donated more than $24 billion to groups in the United States and around the world for what it calls democracy-building efforts. In recent years, Soros, who turned 95 last month, has stepped back from day-to-day involvement at the organization and largely receded from the public eye. He did not attend the main festivities for his son Alex's lavish wedding in the Hamptons in June or an event last fall in Washington honoring him that was hosted by the Democracy Alliance donor club he helped establish. The board of Open Society is now chaired by Alex Soros, 39, who has taken a more hands-on role in Democratic politics and at the organization. He has been confrontational toward Trump on social media. And people close to him say he is privately determined to fight back, believing that the nation is on the brink of a deep crisis. In big-money circles across the political spectrum, there is a sense that picking on the Soroses and their philanthropy could backfire. On the right, there is concern that the offensive could set a precedent that might be used to target conservative nonprofits and donors the next time Democrats control the White House. And on the left, some are cheered that Open Society's resources and history make it better positioned to fight back than other smaller or newer groups. Yet a mood of dark humor has emerged in the Soros orbit -- and the larger philanthropic sector. On Wednesday night, at a cocktail reception in New York hosted by Open Society, a foundation official joked to the crowd -- which included Alex Soros and the foundation president, Binaifer Nowrojee -- that they should enjoy the party because it might be their last night of freedom before they were imprisoned.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onsorostrumpopen societytrump sorostrump soros foundation\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onsorostrumpopen societytrump sorostrump soros foundation(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"During a panel discussion with world leaders and philanthropists in New York on Thursday afternoon, Alex Soros stated that the $23 billion philanthropic organization he leads would not yield to pressure from President Donald Trump.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trumps-targeting-of-soros-foundations-sparks-fear-and-defiance-on-left/articleshow/124187015.cms","image":"https://img.etimg.com/thumb/msid-124187023,width-1200,height-630,imgsize-252988,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-09-28 00:00:00","author":"Kate Kelly","authors":["Kate Kelly"],"language":"en","category":"politics","source_country":"in","sentiment":-0.092},{"id":364083258,"title":"COMMENT | Inviting Trump is a dreadful recipe","text":"COMMENT | It is a given that Malaysia has long positioned itself as a vociferous advocate of Palestinian rights, condemning Israel’s barbarity and savagery against Palestinians, including women and children.As Prime Minister Anwar Ibrahim has repeatedly denounced Israel’s atrocities in Gaza, it seems that Malaysia’s policy on Israel vis-à-vis the protection of basic human rights of Palestinians will never change.Despite being a small nation, Malaysia is invariably seen to be ready and willing to take a firm moral stance on Israeli brutality. And that is absolutely admirable.In fact, at the recent Arab-Islamic Extraordinary Summit held in Doha, Anwar not only harshly condemned the recent illegal Israeli airstrike in Doha, but he also highlighted the ongoing humanitarian plight and suffering in Gaza.Under such circumstances, Anwar’s readiness to invite US President Donald Trump to attend the 47th Asean Summit in Kuala Lumpur in late October is rather startling.","summary":"Its political cost may outweigh any economic benefit to be gained from the US.","url":"https://www.malaysiakini.com/columns/756377","image":"https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2025/09/f3ebe38073e5624032a1e98bcb59c90a.jpg","video":null,"publish_date":"2025-09-28 00:00:00","author":"Mohamed Hanipa Maidin","authors":["Mohamed Hanipa Maidin"],"language":"en","category":"politics","source_country":"my","sentiment":0.132},{"id":364083842,"title":"Kate Garraway discusses dating and finding love again after the death of husband Derek Draper","text":"Home and Garden\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nSunday, Sep 28th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nSelena Gomez and Benny Blanco pose for romantic wedding photos as they share first look inside weekend extravaganza\n\nTories demand Commons sleaze investigation after leaked texts suggested secret slush fund to propel Starmer to Labour leadership\n\nDAN HODGES: Labour's lies are unravelling: Insiders have now admitted slush fund run by PM's top adviser WAS secretly used to install Starmer as leader\n\nRoss King, 63, leaves Strictly fans speechless as his glamorous new girlfriend is seen for the first time cheering him on during his dance debut on the BBC show\n\nWhy I can't wait for my son to divorce Bonnie Blue. She controlled, manipulated and humiliated him. How dare she refuse to give him any of her £34m fortune: OnlyFans star's mother-in-law's explosive interview - read it only here\n\nFury after woke NHS supports first-cousin marriages despite risk of birth defects - and oppression against women\n\nRyder Cup gets ugly as Team USA fans are kicked out and extra security races to protect Rory McIlroy from hecklers\n\nPETER HITCHENS: Nothing to hide? Innocent have plenty to fear from Sir Keir's stone-faced digital Stasi\n\nALEXANDRA SHULMAN: I had no symptoms but the doctor said I was at high risk of a heart attack. It was only luck that saved my life… Was my time at Vogue to blame?\n\nLiam Gallagher dedicates song to 'rape' charge brother Paul at penultimate Oasis UK tour show - then suggests Britpop band could return next year\n\nDozens killed including children in stampede at actor and politician's rally - as India's PM offers condolences and investigation is ordered\n\nMy year from hell: RICHARD HAMMOND breaks his silence on the 'devastating' collapse of his marriage - as he reveals terrible impact of his father's death and how his new car business has lost half a million pounds\n\nPoll puts arch leadership rival Andy Burnham 50 points ahead of Keir Starmer as PM faces Labour Party conference from hell\n\nHow people are being hanged from cranes and strangled to death over 45 minutes while crowds of excited families watch as part of Iran's mass execution campaign that's killed more than 1,000. And the death penalty for girls starts at just 9...\n\nPetition saying no to Keir Starmer's digital ID card plan hits 2MILLION - as Farage brands scheme 'un-British'\n\nThey set the hounds on me. I was pretty damn scared, says whistleblower author at centre of unfolding McSweeneygate scandal\n\nTrump orders troops to takeover 'war ravaged' Democrat-led city to handle 'domestic terrorists'\n\nHow Meghan crafted her public persona after Princess Diana - even BEFORE she married Harry\n\nThomas Skinner 'is being protected by Tom Holland's ex-bodyguard after receiving death threats' amid cheating scandal as controversial star divides fans with Strictly performance\n\nYou're too good! BBC chiefs twice rejected Amber Davies for Strictly because she'd starred in musicals - before her controversial last-minute replacement of fellow Love Island star Dani Dyer\n\nTrendy pea protein loved by celebs and influencers is blamed for increase in 'deadly' allergy\n\nTALK OF THE TOWN: Lily Allen's surprising dating app confession: I'm an addict\n\nRachel Reeves is accused of 'desperate stuff' after claiming plan to allow European youths to live and work in Britain would boost growth and stop tax rises\n\nRACHEL STEVENS: I swap beauty secrets with other showbiz mums on WhatsApp - these are the make-up bag staples, costing from just £3.99, that give me my glow\n\nKate Garraway discusses dating and finding love again after the death of husband Derek Draper\n\nHave YOU got a story? Email tips@dailymail.co.uk \nBy LILY JOBSON, SHOWBUSINESS REPORTER \n Published:00:56 BST, 28 September 2025 |Updated:00:57 BST, 28 September 2025 \n\nKate Garraway has opened up on whether she will consider finding love again, following the death of her husband Derek Draper.\nDerek fought a brave four-year battle against Covid before tragically passing away in January last year.\nAlmost two years since his passing, the TV presenter discussed getting back into the dating game.\nKate, 58, told The Sun: 'I don’t feel as if I can. It’s a weird one, because I wouldn’t like to think I’d spend the rest of my life without love, but also it feels preposterous at the moment to think of being with anyone else.\n'What Derek and I loved was our home life and just pottering around, and we had 21 years of that, so mentally I am still in that zone.\n'However, I do realise that, when the time is right, I am not going to meet someone in my living room, so I’m going to have to think about the future at some point.'\n\nKate Garraway, 58, has opened up on whether she will consider finding love again, following the death of her husband Derek Draper\n\nDerek fought a brave four-year battle against Covid before tragically passing away in January last year\nKate was hit by yet another financial blow in August, as her media company has been revealed to be almost £300,000 in the red, compounding her debt struggles.\nThe GMB star was left in £800,000 debt after caring for her late husband.\nKate has since been forced to sell her second home in order to pay off the debts, but it appears that her money woes are not yet over.\nThe company she set up in 2021 to handle her media earnings has reported losses of £288,122 in 2024.\nAccounts filed to Companies House for Praespero 100 Ltd show that it has fallen significantly in the past two years, after reporting £165,011 in losses in 2023 and a £36,888 surplus in 2022.\nThe firm, of which Kate is the sole director, is listed as being in the business of 'radio broadcasting, television programming and broadcasting activities and management consultancy activities other than financial management'.\nDaily Mail contacted representatives for Kate for comment.\nIt is the latest in a number of financial hits for the Good Morning Britain star, who is also battling company debts after Derek’s psychotherapy firm Astra Aspera Ltd went bust owing hundreds of thousands to creditors including a huge sum to HMRC.\n\nAlmost two years since his passing, the TV presenter discussed getting back into the dating game (pictured together in 2023)\n\n'I do realise that, when the time is right, I am not going to meet someone in my living room, so I’m going to have to think about the future at some point', Kate emotionally admitted \n\nThe most recent liquidator’s report for Astra Aspera Ltd shows that Kate has been trying to repay some of the debt she owes - and HMRCS have dramatically decreased their tax demand.\nThe directors' loan account was overdrawn by £139,849, but the liquidator, Greenfield Recovery, hired solicitors, The Wilkes Partnership, 'to assist in the recovery… and the sum of £21,000 has been received in this report period’.\nAccording to the latest liquidator's report, HMRC has submitted a new preferential claim of £288,054.\nThis is a third of its previous submission of £716,822. It’s not known why the HMRC has dropped its demand.\nThere are also creditor claims of £196,548 from four other firms including a £50,000 bank loan. It looks like there’ll be no pay out for creditors.\nIn 2012, two other companies jointly controlled by Kate and Derek were wound up by creditors.\nFulfill Media Ltd had debts totalling £922,807, which included £88,486 owed to HMRC, £90,882 to trade creditors, and £462,808 in 'third party loans’.\nCountrymouse Media Ltd was liquidated owing £189,121, which included £98,944 to the taxman and £48,000 on an overdrawn directors loan account. \nDerek and Kate were both personally owed £24k each by the business.\n\nShare or comment on this article: \nKate Garraway discusses dating and finding love again after the death of husband Derek Draper\n\nAdd comment\n\n Share what you think\n\nWorst rated\n\nThe comments below have been moderated in advance.\n\nThe views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nSelena Gomez is married! Pop star and Benny Blanco pose for romantic wedding photos as they share first look inside weekend extravaganza\n\nRoss King, 63, leaves Strictly fans speechless as his glamorous new girlfriend is seen for the first time cheering him on during his dance debut on the BBC show\n\nCat Deeley 'fears how estranged husband Patrick Kielty is dealing with split as she moves out of their London home'\n\nKate Garraway discusses dating and finding love again after the death of husband Derek Draper\n\nJustin Bieber's mum shares concerning post days before ex Selena Gomez's wedding... sparking wild theories from fans\n\nChampion heptathlete Dame Jessica Ennis-Hill on the SEVEN things YOU can do to achieve your goals...\n\nStrictly Come Dancing's Alexis Warr pokes fun at celebrity partner George Clarke's nepo baby status - and fans can't get over who his famous dad is\n\nGabby Logan says she hasn't heard from Gary Lineker since he quit Match Of The Day and reveals her secret for keeping warm on the touchline in her first interview since becoming one of the BBC football show's main presenters\n\nThomas Skinner 'is being protected by Tom Holland's ex-bodyguard after receiving death threats' amid cheating scandal\n\nOwn your Autumn: From your wardrobe to your home, here is how to make sure this autumn is your best yet\n\nTom Holland breaks his silence as he gives a health update after suffering a head injury while filming Spider-Man stunt\n\nYou're too good! BBC chiefs twice rejected Amber Davies for Strictly because she'd starred in musicals - before her controversial last-minute replacement of Dani\n\nStrictly Come Dancing announces HUGE shake-up revealing a major switch-up in their results show\n\nStrictly Come Dancing 2025: Dani Dyer's replacement Amber Davies graces the stage after Love Island star was forced to pull out due to ankle injury \n\nThe tights shake-up: How castor oil is transforming comfort, style and sustainability... thanks to one trailblazing brand!\n\nHow Prince Harry collapses 'like a souffle' as Meghan Markle interrupts him multiple times during an interview, body language expert reveals\n\nJackie hits the jackpot: Cruz Beckham's girlfriend goes from little-known singer to securing deals with luxury brands Dior and Burberry \n\nKanye West's wife Bianca Censori's new fashion line could 'rival' Kim Kardashian's SKIMS\n\nLily Collins looks unrecognisable for her latest role as she films drug scene in rundown street\n\nPopular money app launches new feature that could help you save £2,000* a year\n\nTALK OF THE TOWN: Lily Allen's surprising dating app confession: I'm an addict\n\nWhy Michelle Ryan returned to her 'boring' EastEnders job after her dreams of Hollywood stardom were blighted by industry strikes and turning down HUGE role\n\nTyson Fury's daughter Venezuela gets engaged to boxer boyfriend Noah Price at her 16th birthday party\n\nSelena Gomez and Benny Blanco's wedding preparations pictured as palatial oceanfront venue anticipates A-list guests\n\nA tale of two Floridas: How to split your next stateside getaway between theme park thrills in Kissimmee and sugar-soft sands in St. Pete-Clearwater\n\nZoe Sugg 'accused of sabotaging brother Joe Sugg's baby announcement' as she returns to YouTube after four-month break\n\nDiddy's son Justin Combs urgently pleads for dad's prison release ahead of sentencing hearing\n\nPrince Harry's fierce statement at 'sources intent on sabotaging reconciliation' with father as he denies giving king photograph of Meghan \n\nAlana 'Honey Boo Boo' Thompson involved in car wreck in Denver as Mama June rushes to her side\n\nThis autumn it is all about 'Cowboy Chic': How everyone can wear this western-inspired trend in ultimate style and comfort (and on a budget!)\n\nKylie Jenner showcases her figure in VERY sheer lace bodysuit for sexy photos inside her office\n\nAdolescence star Owen Cooper, 15, looks stylish in a brown zip-up jacket as he attends the Bottega Veneta show during Milan Fashion Week\n\nAnother couple swap? MAFS' Awhina Rutene addresses romance rumours with Dave Hand after they're spotted holding hands in Perth\n\nTyson Fury gets a fright as he attends Alton Towers Scarefest with his sons after his daughter Venezuela, 16, got engaged to boxer boyfriend\n\nHow YOU could win your dream home: New 'fairer' competition offers TWO houses a month - and a cap on entries\nAdvertising\n\nHow Meghan crafted her public persona after Princess Diana - even BEFORE she married Harry\n\nBig Brother FIRST LOOK: Diary Room chair gets an eye-popping makeover ahead of the series' return\n\nOscar-nominated actor who played iconic composer before dropping out of the spotlight looks unrecognisable on rare outing\n\nMade In Chelsea's Joshua Patterson opens up about heartbreaking sudden death of his baby godson as he sets new record in charity tribute challenge\n\nYou could win this £700k luxury four-bed and a BMW M3 Touring by the end of the week - here's how...\nAdvertising\n\nChloe Ferry flaunts her assets in a black bikini as she parties in Dubai after revealing she has found her soulmate\n\nStrictly's Ross King and dance partner Jowita Przysta are dealt crushing blow ahead of the first live show\n\nMeryl Streep and co-star Stanley Tucci sit front row at Milan Fashion Week while filming Devil Wears Prada sequel\n\nMAFS UK star Polly Sellman hits back at cruel message from troll after being body-shamed following her four stone weight loss\n\n'It allowed me to grow my income without taking too much risk': The secret behind one business owner's expansion\n\nNever-before-seen trove of Marilyn Monroe pictures... the true story of her most famous (and sexy) photoshoot... and the ugly battle it caused\n\nDoes Hollywood beckon for in-demand Olivia Attwood? Star hints she's 'had offers' from US bosses after her shows found global success on streaming giant Disney+\n\nToday is Selena Gomez's wedding. But a bridezilla decision and weeks of family feuding have left her mother utterly 'shattered'... and now insiders are spilling everything\n\nDani Dyer shares first statement after it was revealed Strictly celebrities are 'furious' injured star has been replaced by West End performer Amber Davies\n\nLooking for a time saver? The Hoover Hydro Pet cordless vacuum AND mop is on sale and proving a hit with busy households\n\nThe Hollywood film stunts that went VERY wrong: From Brendan Fraser passing out to Isla Fisher nearly drowning and Sylvester Stallone spending nine days in intensive care\n\nCheryl 'wants to focus on Bear' ahead of Liam Payne's first anniversary and has been in a 'really bad place' after her killer stalker was jailed again\n\nThe Hollywood murder mystery gripping millions: How superstar D4vd is at the centre of grisly death of schoolgirl found dismembered in his Tesla\n\nHow Prince Harry and King Charles' long-awaited reunion unfolded - from gift exchange to private tea\n\nAbsolutely everything inside ESPA's beauty advent calendar - it's basically a spa retreat in a box\n\n'It was awful. I made a massive mistake': Thomas Skinner FINALLY comes clean on his affair as he reveals exactly how his wife reacted when she found out... and tells KATIE HIND what the fling has done to their marriage\n\nJesy Nelson snubbed by former Little Mix bandmates following engagement to fiancé Zion Foster after revealing she and the girls 'don't speak'\n\nMark Wright cuts a casual figure in a grey tracksuit as he joins Olly Murs and Freddie Flintoff to film Bullseye celebrity special in Manchester\n\nEllen DeGeneres mourns fan with heart condition she called her 'only boyfriend' after his death at 19\n\n10 pieces from JD Williams' new autumn collection that our fashion team has already added to their September wishlist\n\nFlorence Welch reveals she almost died after suffering a devastating ectopic pregnancy on stage that led to emergency surgery\n\nStrictly's Lewis Cope leaves hotel ahead of first live show amid claims celebs are left 'furious' over 'experienced dancer' and West End star Amber Davies joining the series\n\n'Sacha Baron Cohen likes to be seen as classy. He'll have hated these pictures.' Insiders spill truth he's DESPERATE to hide about relationship with OnlyFans star... you'll never believe how his people tried to spin it to me, says KATIE HIND\n\nDick Van Dyke, 99, flexes his muscles as he works out at the gym with an unlikely celebrity pal\n\nGrieving Kelsey Parker reveals sick trolls said her baby son's stillbirth was 'karma' as she believes late husband Tom is 'looking after him in heaven'\n\nPregnant Georgia Harrison displays her growing baby bump as she approaches her due date\n\nStrictly's Stefan Dennis reveals heartbreaking family tragedy that still haunts him: 'I'm more affected today than I was back then'\n\nFans turn on Jennifer Lawrence as she reveals stance on Palestine after praising Amy Schumer's controversial Israel remarks\n\nKristin Scott Thomas reveals why remarrying at 64 has made her the happiest she has ever been in her life \n\nLAURA CRAIK: Kim Kardashian unveils Skims collaboration with Nike at launch event in New York - but is it worth the hype?\n\nQueen Camilla steps out in blue jeans as she attends Braemar Literary Festival\n\nTeri Hatcher, 60, posts bra-less snap in wet white tank top as she splashes around in African lagoon\n\nTambourine-throwing, physical fights, savage slurs and the final straw that made them split: Liam and Noel Gallagher's most explosive feuds \n\nI made it to The Great British Bake Off final - Paul Hollywood showed his true colours when the cameras stopped rolling\n\nEDEN CONFIDENTIAL: Princess Beatrice is bound out of her grandfather Prince Philip's favourite charity after mother Fergie's leaked email scandal\n\nJanice Dickinson blasts 'motherf***ers' ITV as she makes 'explosive new claim' over her I'm A Celebrity injury just days after she launched a lawsuit\n\nPrincess Eugenie puts on a brave face as she releases her first statement since Sarah Ferguson's leaked email to Jeffrey Epstein\n\nSuki Waterhouse showcases her jaw-dropping figure in tiny shorts and crop top as she steps out with fiancé Robert Pattinson\n\nAxed MasterChef host John Torode, 60, brushes off sacking from BBC cooking show in new video hours before show finale airs\n\nRod Stewart reveals the one song he wants to be remembered for - and it's not the hit many would expect\n\nNew Harry Potter HBO series plagued by ticks and horseflies on Windsor set as cast are warned to check for bites\n\nNatalie Dormer 'donates her salary for Sarah Ferguson role in ITV drama to sexual abuse charity' after Duchess' 'inexcusable' apology to paedophile Jeffrey Epstein\n\nNaomi Campbell is the epitome of chic in a black suit and shades as she joins leather clad Poppy Delevingne at swanky bash amid Milan Fashion Week\n\nInside Selena Gomez and Benny Blanco's lavish rehearsal dinner as Taylor Swift arrives in a motorcade\n\nLana Del Rey marks first wedding anniversary with alligator tour guide Jeremy Dufrene by sharing never before seen ceremony photos\n\nVicky Pattison 'petrified and feeling like a pudding' after meeting Strictly's pro dancers who 'look like they've been carved by angels' \n\nLiv Tyler's ex David Gardner is engaged! David Beckham's pal, 49, announces he's popped the question to model girlfriend Jessica Clarke, 32 - four years after split from Hollywood actress\n\nGrace Dent admits she's feeling nervous as she takes on her 'biggest and most important' challenge yet as host of scandal-plagued MasterChef\n\nNetflix fans rave over 'the best cosy autumn show' they can't stop rewatching - and there are three seasons to binge through\n\nLady Gaga flashes her massive $1M engagement ring as she kisses fiance Michael Polansky on his birthday\n\nSir Richard Branson, 75, displays nasty injury after running 'face first' into a window in painful mishap\n\nTom Holland and fiancée Zendaya forced to spend '£1K-a-day' on security after 'fans began turning up at their West London home for selfies'\n\nKim Kardashian is upstaged by tween daughter North West, 12, at her own NikeSKIMS event\n\nWhy hasn't D4vd been arrested? Experts explain after body of Celeste Rivas, 15, was found in his Tesla\n\nStrictly's Amber Davies seen with pro partner Nikita Kuzmin for the first time as fellow celebs left 'furious' over the 'experienced dancer' and West End star replacing Dani Dyer\n\nGogglebox's Amy Tapper hits back at angry follower who branded her a 'cheat' and 'liar' after star revealed she lost 7.5st thanks to drug Mounjaro\n\nCoronation Street legend Barbara Knox reminisces on decades-long friendship with co-star Thelma Barlow as she reveals they never had a 'cross word'\n\nTaylor Swift touches down in Santa Barbara to honor promise to Selena Gomez for star-studdedglamorous wedding\n\nChannel 4's Virgin Island inundated with applications for new series after controversial show becomes a hit\n\nBeloved 90s actress, 78, shocks with apparent bruising over her face in rare sighting\n\nJennifer Lawrence turns heads in a quirky cut-out gown as she accepts award at San Sebastian Film Festival - after fans turn on the star over her stance on Palestine\n\nSteven Gerrard, 45, and wife Alex Curran, 43, are proud grandparents as they pose with baby Lila on holiday after daughter Lilly-Ella, 21, welcomed child with son of jailed Irish gangster\n\nHarper Beckham has joined Instagram two weeks before Victoria's Netflix documentary is set to air\n\nMo Gilligan's fiancée Taia Tulher admits she feels 'suffocated' in candid post after secretly welcoming her first child with the comedian\n\nHow Isla Fisher, 49, is throwing herself into work and is 'not ready' to date yet as her ex-husband Sacha Baron Cohen, 53, cosies up with OnlyFans model, 27\n\nMy year from hell: RICHARD HAMMOND breaks his silence on the 'devastating' collapse of his marriage - and reveals terrible impact of his father's death \n\nBeaming AJ Odudu flashes her HUGE diamond engagement ring as she promotes Big Brother's return - following engagement to fiancé Peter Gibson\n\nStrictly Come Dancing judges transform through the decades as they perform their 'biggest ever' performance for the show's live return\n\nSelena Gomez and Benny Blanco wedding FIRST LOOK: Marquees take over California field ahead of star-studded nuptials\n\nChris Robshaw admits he 'wants fans to think he's been hit by Strictly curse' with dance partner Nadiya Bychkova despite being married\n\nRomeo Beckham cuts a trendy figure in double denim as he steps out alongside a VERY leggy Simone Ashley and Naomi Campbell amid a star-studded Milan Fashion Week\n\nFishmonger Harry Maguire crowned WINNER of MasterChef as judge John Torode praises 'absolute magic' final meal\n\nFellow Love Island winner Amber Davies steps forward to fill Dani Dyer's dancing shoes on Strictly after star fractured ankle during rehearsals \n\nRosie Huntington-Whiteley shows off her supermodel figure in an array of lace lingerie as she models her latest M&S underwear collection\n\nAshley Roberts puts on a leggy display in a sparkly mini dress as she celebrates her 43rd birthday at London's Mimi Mei Fair\n\nEva Mendes, 51, oozes business chic in a white shirt and thigh high stockings as she poses for sultry new Stella McCartney campaign\n\n'Not fair!': Strictly fans in uproar as West End performer and trained dancer Amber Davies is announced as Dani Dyer's replacement\n\nGeorgia Toffolo incurs wrath of fans who say she's meant to be 'setting an example' after sharing 'concerning' car video\n\nRaye makes a rare appearance with her lookalike sisters on The Graham Norton Show after revealing how they helped her through drug addiction\n\nPrince Andrew 'flew on Jeffrey Epstein's private jet and had massages paid for by paedophile' while Elon Musk 'planned to visit island', according to bombshell documents\n\nStrictly's Ellie Goldstein says she wants to be an inspiration and show what she's 'capable of' after becoming first ever contestant with Down syndrome\n\nLewis Capaldi surprises supermarket shoppers with an impromptu performance in Nottingham\n\nChristine McGuinness recalls the moment she told her children she was getting a divorce from ex Paddy as she admits she was 'blown away' by their reaction\n\nStrictly's Vicky Pattison reveals pal and former contestant Pete Wicks' advice ahead of first live show - after he confirmed romance with pro partner Jowita\n\nJames Van Der Beek shares poignant connection between his daughter and Dawson's Creek amid his cancer battle\n\nRyan Reynolds reveals shocking insult he hurled at Blake Lively over call from A-list celebrity\n\nMarried At First Sight's Leah Marie Tyrer shocks fans with drastically different look in throwback snaps before signing up to dating show\n\nAMANDA PLATELL: It's about to get SO much worse for Prince Andrew and Fergie. Forget Epstein's emails... these explosive details will surely finish him\n\nD4vd's mom goes to a gun shop as world asks why there's still been no arrest over girl's body dumped in his Tesla\n\nMillie Mackintosh reveals she's come off anxiety medication after it caused her to lose her libido\n\nRicky Hatton's long-time manager says 'I firmly believe he didn't intend to do it' as he reveals the horrific moment he found the former boxer dead \n\nSacha Baron Cohen, 53, is pictured with OnlyFans model Hannah Palmer, 27, for the first time as they cosy up at Taika Waititi's birthday after his divorce\n\nFrom Love Island to West End darling: How Amber Davies went from the raunchiest show on TV to a more wholesome image as she prepares for Strictly\n\nOwen Cooper returns to TV after making history: Adolescence star appears in Film Club alongside Aimee Lou Wood after becoming youngest ever male Emmy winner\n\nHelen Flanagan cheekily strips off in the hair salon and goes TOPLESS as she tells her hairdresser 'you could ruin my life with this video!'\n\nMaya Jama WILL present Love Island in 2026 as host confirms her return for All Stars and the summer series\n\nKatie Price reveals her true feelings about ex Gareth Gates as she performs in his hometown during tour with Kerry Katona\n\nHollyoaks star Nikki Sanderson is rushed to hospital after horror treadmill accident rips 'several layers of skin' from her body\n\nTupac Shakur's godmother Assata Shakur dead at 78: Cop killer who escaped jail and fled to Cuba passes away\n\nLegendary numerologist reveals Taylor Swift's lucky number claim doesn't add up to a happily ever after with Travis\n\nMolly-Mae Hague risks yet another fine as she parks her £250,000 G-Wagon on double yellow lines in a tiny Cheshire village\n\nHarlan Coben fans set to go wild as ITV tease 'passion and peril' in new upcoming drama written by Fool Me Once writer\n\nBig Brother FIRST LOOK: ITV share sneak peek of very colourful house ahead of brand new series\n\nBenny Blanco baffles fans with bizarre wedding outfit at friend's nuptials a month before Selena Gomez ceremony\n\nSarah Ferguson sells her £4.2million Belgravia townhouse - and funds 'may keep her and Prince Andrew in the Royal Lodge in Windsor'\n\nLily Allen puts on a leggy display in a mini skirt at Clarkston West End opening - after revealing she's quitting her podcast for 'reflection time'\n\nPoppy Delevingne puts on a leggy display in Milan as she joins Naomi Watts and Kaya Scodelario for catwalk show during Fashion Week\n\nEmily Blunt reveals husband John Krasinski has been so secretive about A Quiet Place 3 that she doesn't even know if she's in the film!\n\nJennifer Lawrence cuts an elegant figure in a caped co-ord at Die My Love photocall ahead of receiving Donostia Lifetime Achievement award\n\nStrictly's Lauren Oakley quits social media and begs fans 'don't be mean' after they criticise bosses for recruiting trained dancer Amber Davies\n\nHeartbroken Lewis Hamilton delivers bleak health update on his beloved dog Roscoe: 'He's in a coma... and we don't know if he will wake up'\n\nDele Alli is chased for £6,000 debt by Instagram jeweller in new public spat after former England star had contract cancelled by Como\n\nPregnant Perrie Edwards wows in racy bralette as she releases her debut solo album - on the same day Jesy Nelson announces engagement\n\n'We know who's in charge!' Alison Hammond jokes with Rishi Sunak's wife Akshata Murty as she reveals it's 'exhausting' having him home all the time after he left politics\n\nCoronation Street's Sally Dynevor reveals co-stars could find out if they will be AXED from the soap next month\n\nLoose Women pulled for the day in ITV schedule shake-up as fans left confused and ask 'why isn't it on?'\n\nOlder brother of Oasis stars Noel and Liam Gallagher denies rape and sex attack charges as he appears in court\n\nSacha Baron Cohen's friends claims that he is NOT dating the American OnlyFans model he dined with\n\nRita Ora sneaks a cigarette outside her lavish hotel after attending the Prada show during Milan Fashion Week\n\nGlen Powell shocks fans after appearing to allude to Charlie Kirk assassination in new interview\n\nIconic 90s sitcom actor who had Emmy nomination controversially revoked seen on rare public outing... can you guess the star?\n\nHezbollah flag-waving Kneecap rapper has terror charge thrown out thanks to blundering error by Attorney General's CPS staff \n\nNoel Clarke is pictured for first time the day after he was arrested by police during five-hour raid on his home \n\nRicky Hatton's funeral: Family confirm plans and date for boxer's Manchester Cathedral service\n\nDwayne Johnson says playing Mark Kerr in The Smashing Machine has 'changed his life' and he had 'to rip himself open' - amid Oscars buzz\n\nAmber Davies joins Strictly Come Dancing! West End performer and fellow Love Island star announced as Dani Dyer's replacement\n\nHow Sarah Ferguson made and squandered millions in eclectic money-making schemes in her never-ending bid to live like royalty\n\nJesy Nelson is engaged! Former Little Mix star shows off sparkling diamond ring after romantic sunset proposal from boyfriend Zion Foster\n\nFull House star reveals why she left Los Angeles amid mass celebrity exodus from liberal city\n\nSpencer Matthews to front new documentary Am I a Psychopath where he discovers if he fits the label after admitting he 'lacks empathy'\n\nCheryl stuns in a black leather shirt and figure-hugging pencil skirt as she models three stylish looks in new Nivea campaign\n\nThe Office stars left STUNNED as they take home top prize on Who Wants To Be A Millionaire\n\nHilaria Baldwin slammed for encouraging viewers to mock her fellow Dancing With The Stars contestants\n\nGigi and Bella Hadid bid goodbye to lavish 'safe haven' as mom Yolanda lists cherished family farm for $10.995M\n\nPregnant Cardi B shows off her curves in tiny denim hotpants and platform stiletto knee high boots as she steps out in Los Angeles after BBL reduction surgery\n\nJustin Bieber shows off his basketball skills as he takes to The League court in Los Angeles after selling out Coachella 2026\n\nAnnie Lennox, 70, reveals she is neurodivergent after being tested for ADHD and calls it her 'superpower'\n\nAlison Hammond, 50, reveals the 'sexiest thing' a man can do to impress her as she makes rare comment about her boyfriend David Putman, 28\n\nDavina McCall reveals son has been found after 45 years on Long Lost Family as emotional mum breaks down in tears\n\nHugh Bonneville and vegan influencer girlfriend Heidi Kadlecová put on loved-up display as they make rare public appearance together\n\n'Gripping and twisted' new thriller starring Adolescence writer Stephen Graham 'steals the show' with positive early reviews\n\nLivia Firth calls out cruel troll for branding her a 'cretinous menopausal hag' after she handed back her MBE over Trump visit\n\nThe Chase viewers fume 'what is wrong with you?!' as players forgoes 'once in a lifetime chance' by bungling 'easy' question\n\nChristie Brinkley, 71, looks incredible in a figure-hugging dress she poses with lookalike daughter Sailor, 27\n\nWayne Rooney teams up with rapper Giggs for unlikely collab days after insisting he'd be DEAD if Coleen hadn't saved him from battle with alcoholism\n\nKarren Brady's daughter Sophia Peschisolido gives birth! Influencer welcomes her second child with fiance Frankie Makin\n\nSo long, Gen Z! Kim Kardashian weighs in on mysterious Gen Alpha term '6, 7' and vows to bring back the 'dab' and 'no cap'\n\nMyleene Klass commands attention in fiery red outfit as she arrives at Royal Academy of Music after making a dig at her ex husband\n\nAJ Odudu teases something 'never been done before on the show' as she hints at 'twists and turns' on anniversary series of Big Brother\n\nDua Lipa shares sizzling snaps as she flashes sideboob in white strappy dress while preparing for her latest shows in Miami\n\nDoctor Who star David Tennant wows in new ITV drama The Hack - as fans 'utterly gripped' by 'amazing performance'\n\nThe heartbreaking moment Bad Boyfriends star breaks down in tears after Oliva Attwood exposes her boyfriend's true intentions - as she sobs 'I can't do this'\n\nEpic historical drama to return after 12 years as first look images tease 'intense battles' and 'dramatic rivalries'\n\nEDEN CONFIDENTIAL: Either David Cameron has lost 4st... or someone is telling porkies\n\nOlivia Attwood admits she 'breathed a sigh of relief' after winning over 'tough' This Morning audience with 'surreal' hosting debut \n\nIs this the end of the House of York? Royal experts weigh in on Sarah Ferguson's bombshell email to Jeffrey Epstein on PALACE CONFIDENTIAL\n\nMORE DON'T MISS\n\nNetflix's House Of Guinness seriously divides critics: scathing reviews brand it 'exhausting' and 'wildly unfaithful'\n\nStrictly Come Dancing week one songs and dances REVEALED as Thomas Skinner will tackle the paso dable and Vicky Pattison will perform 'spicy' cha cha \n\nGemma Collins channels Kate Middleton as she debuts her new 'bronde' locks in a glamorous snap\n\nVanessa Feltz, 63, dresses to impress in a sexy leather midi as she joins chic Trinny Woodall, 61, at Elizabeth Day's book launch\n\nHouse of Guinness show faces backlash in Ireland over British actors' Irish accents, characters who sound like 'feral leprechauns' and an 'invented' gay storyline\n\nFrauds star Suranne Jones admits that she was left 'in tears' after meeting her co-star Jodie Whittaker on the set of ITV drama\n\nMeghan Markle and Prince Harry are heading to New York City next month after being awarded a Humanitarians of the Year Award\n\nWallace and Gromit creator fears rise of AI: Animator Nick Park worries the 'human touch' could be replaced by 'a bit of a mush' amid popularity of ChatGPT\n\nSacha Baron Cohen, 53, moves on from £120M Isla Fisher divorce 'by striking up romance with OnlyFans model, 27\n\nMaureen Lipman brands Miriam Margolyes a 'self-publicist' and 'shock jock' over her comments on Gaza \n\nSydney Sweeney puts on a leggy display for latest brand campaign after risking being cancelled for controversial American Eagle denim ad\n\nPop singer Lulu admits for the first time that she had sex with legendary rock star David Bowie\n\nPrince William says 2024 was 'the hardest year of my life' after Kate's cancer diagnosis in rare TV appearance\n\nBad hair day? Tammy Hembrow wrestles with an unruly 'do' as she leaves a salon on the Gold Coast\n\nOzzy Osbourne's extended documentary trailer reveals farewell concert was wife Sharon's final gift after his six-year health battle \n\nBrooklyn Beckham fans say 'you look just like your dad' with his rugged beard amid family feud as he posts more snaps from the Ryder Cup \n\nMAFS UK fans are convinced show bosses 'stepped in' behind the scenes after couple's explosive row - as bride issues heartfelt apology\n\nWhy King Charles can't cut off Prince Andrew - even if he wanted to, according to royal experts\n\nSelena Gomez and Benny Blanco's FULL wedding plans leaked: Top secret details, location, surprise celeb host and a MAJOR A-list drop out... ahead of ceremony this weekend\n\nLouis Theroux set to 'front new Adolescence-inspired documentary for Netflix' after 27 years at BBC\n\nThe touching twist of fate that secured Jamie Laing and Sophie Habboo their dream home - as couple unveil £12M London property 'just in time' for the birth of their first child\n\nI've seen for myself how women prey on Wayne Rooney's alcohol problem. Coleen's been dealing with it for 20 years... Now the truth's out: KATIE HIND\n\nBraless Dakota Johnson shows off her curves in a risqué lace gown as she continues 'naked dress' trend at the 21st Zurich Film Festival - and WINS Golden Eye award\n\nMeghan McCain launches blistering attack on Ben Affleck and Jennifer Garner's woke daughter over 'absurd' UN mask speech\n\nSarah Ferguson should be stripped of her royal title says Virginia Giuffre's family after she called Jeffrey Epstein her 'supreme friend'\n\nRita Ora turns heads in a blue collared dress as she joins leggy Maya Hawke and Emma Chamberlain at the Prada show during Milan Fashion Week\n\nTiger Lily Hutchence is every inch the doting mother during a park outing with her new baby and friends\n\nWaterloo Road star Tillie Amartey admits she would 'never say no to Strictly' as she parties at SHEIN event amid rumours she is replacing Dani Dyer\n\nBBC Doctor Who star Noel Clarke is arrested as police carry out five-hour raid - days after being hit with £3m legal bill for lost libel case\n\nWhy Prince Andrew was accused of 'lacking self-awareness' and living on 'Planet Windsor', according to royal author\n\nWhoops! Naomi Watts' model daughter Kai Schreiber suffers an unfortunate wardrobe malfunction on the runway\n\nRobert Irwin's staggering salary for Dancing With The Stars US is revealed - as the meagre amount he inherited from late father Steve comes to light\n\nFormer Baywatch babe Carmen Electra, 53, is as red hot as ever in kinky DOG COLLAR with fishnets and leather corset\n\nThe transformation of Joffrey after he shunned the spotlight when playing Game of Thrones' boy king made him a star\n\nIt's the Crown but with Beer! Sex scandals, drugs, rioting and war with the Catholic church... James Norton stars in Netflix's epic drama about the Irish brewing dynasty\n\nMiley Cyrus reveals why she won't get rid of the dress she wore on her first date with ex-husband Liam Hemsworth\n\nJimmy Kimmel's rarely seen dad makes surprise appearance after viral AI video claimed the Kimmel patriarch was DEAD\n\nMartha Stewart parties with Kim Kardashian and her famous family at NikeSKIMS launch\n\nAna de Armas flashes abs in sports bra after workout... as she has not been seen with boyfriend Tom Cruise in two months\n\nMariah Carey finally breaks silence on THAT viral diva reaction to 'pitchy' We Belong Together cover by Muni Long\n\nClaudia Winkleman, the queen of the Traitors, now gets her own castle in the Cotswolds \n\n'Pioneering' child actress who shared role with her twin as the mischievous little sister in iconic family drama seen out in LA... guess who?\n\nLiam Hemsworth says fan outcry over him replacing Henry Cavill in The Witcher forced him to take a social media hiatus: 'It started to become a distraction'\n\nWife of Weezer bassist escapes jail time after opening fire on LAPD cops\n\nWhat would her mother think? Naomi Watts' daughter Kai Schreiber, 16, puffs on a cigarette after Milan Fashion Week runway show\n\nAlabama Barker, 19, is seen for the first time since announcing devastating pregnancy loss as she steps out in LA\n\nSister Wives star Kody Brown SLAMMED for 'sexist' comments on Special Forces competition\n\nCLARKSTON review: Heartstopper's Joe Locke has nailed this coming of age part says PATRICK MARMION\n\nCardi B confesses she underwent butt reduction surgery that left her bedridden for MONTHS\n\nKeira Knightley exudes elegance in floral gown with a quirky lace ruff as she gleefully greets her glam co-star Hannah Waddingham at the premiere of their film The Woman In Cabin 10\n\nMadonna's daughter Lourdes Leon flaunts her curves in a black cut-out gown with daring thigh-high split at the Roberto Cavalli show during Milan Fashion Week\n\nRobert Irwin reveals shock relationship status - but his search for true love could leave him 'single forever'\n\nCourtney Stodden goes under the knife AGAIN as unrecognizable star leaves plastic surgeon's office in LA\n\nAmanda Bynes debuts new romance as she shares first look at business owner 'boyfriend' two years after splitting from ex-fiancé Paul Michael\n\nKatie Price's eyebrow-raising antics with Conor McGregor - while his fiancée was away - revealed. Her boyfriend was 'deeply unimpressed' and that's not the end of the gossip people just can't stop telling me, says JENNIFER RUBY\n\nChappell Roan debuts wild new hairdo as she gets RID of trademark red locks after revealing rear end onstage\n\nMichael Douglas, 81, called out over 'weird' nickname for wife Catherine Zeta-Jones, 56\n\nJustin Bieber's father Jeremy reveals secret to his superstar son 'making his best music' amid Coachella sellouts\n\nNadia Sawalha fights back tears as she opens up about her husband's addiction issues - admitting they are 'co-dependent' and she is 'a rescuer'\n\nAmelia Gray Hamlin and Romeo Beckham fuel romance rumours as he confirms arrival at Milan Fashion Week while she walks in BOSS runway show with David sat in the front row\n\nBrave Bella Hadid returns to the gym days after sharing troubling hospital photos amid Lyme disease battle\n\nJoe Swash lands solo BBC show away from family reality series with wife Stacey Solomon\n\nMartine McCutcheon shows off her revenge body in racy TOPLESS snap - following split from husband Jack McManus \n\nKendall Jenner's ex Bad Bunny received 'credible death threat' during Puerto Rican residency\n\nThe clear sign that Harry Styles is serious about Zoe Kravitz revealed after she supported him at Berlin Marathon\n\nPriscilla Presley claims Elvis wanted to hire HITMAN to eliminate her karate instructor boyfriend in memoir bombshell\n\nAntiques Roadshow guest left speechless after discovering their treasured family jewels are worth life-changing sum\n\nKim Kardashian flashes painful-looking tattoo she got inside her lip to celebrate a milestone\n\nLiam Payne says he 'always wanted to protect Cheryl' and knew 'she was ALWAYS there for me' as fans re-share sweet video of late star talking about her after their split\n\nJennifer Lopez's $21M mansion being renovated 'to perfection'... after dropping price on Ben Affleck love nest\n\nCoronation Street couple SPLIT after seven years together after a secret affair and heartbreaking cancer battle\n\nDeath In Paradise star Ben Miller confesses 'hopefully I won't get cancelled' as he shares a career update on Good Morning Britain\n\nMaya Jama reveals she keeps romantic snaps with boyfriend Ruben Dias by her bedside as she 'considers moving to Manchester' to be closer to him\n\nVictoria Beckham treats her mum and David's mum to bespoke fittings at her store - and even her dad approves\n\nJamie Oliver recalls how he was 'dragged' out of school lessons to go to a 'special needs class' while being mocked by his friends\n\nImogen Poots says 'no one on the outside sees what you share' as she finally breaks her silence on split from ex-fiancé James Norton\n\nMAFS bride tells her wife 'you've asked for effort, I'm giving you effort' as she 'romantically' spoon feeds her on their honeymoon \n\n'My younger self would be horrified by my mum life': Binky Felstead pokes fun at her Made In Chelsea party girl days\n\nChilling horror series to land on Netflix after 'massive bidding war' - and it's been dubbed 'horrifying'\n\nGwyneth Paltrow's husband Brad Falchuk proves he's a gentleman as he carries her shopping bags in Milan\n\nANOTHER Strictly professional breaks ranks and two other dancers reignite backstage feud as the show is plunged into more turmoil \n\nHarry's birthday present to Meghan? She shows off huge new 'Queen' ring with gem 'associated with the goddess Diana'\n\nFelicity Jones cuts a chic figure in a navy blue shirt dress as she joins stylish Carey Mulligan heading to the Prada show in Milan\n\nRichard Osman makes subtle dig at Thursday Murder Club film adaptation following fan outrage at 'unforgivable' plot change\n\nModel Brooks Nader issues scathing response to Dancing with the Stars' new season\n\nThe awkward moment Brooklyn Beckham loses his golf ball in front of mystified fans and gets repeatedly stuck in a bunker at Ryder Cup\n\nSerena Williams shows off 31lb weight loss after becoming a spokesperson for a GLP-1 medication\n\nStrictly Come Dancing professionals' pay revealed as row breaks out among the cast over celebrity partners\n\nHeather Locklear makes rare sighting as she celebrates her 64th birthday... 40 years after starring on Dynasty\n\nMichael Douglas, 81, shares sweet message for 'love of my life' Catherine Zeta-Jones, 56, as couple celebrate their birthday at the Ryder Cup\n\nKing Charles and Prince William spend 'father and son' time together in Balmoral for third year in a row\n\nFull House co-stars Lori Loughlin and Candace Cameron Bure reveal their mini-me daughters are close friends\n\nAlfie Boe's ex-wife Sarah moves on with handsome realtor after relocating to the States with their children in wake of opera star's 'cheating scandal'\n\nFootage of Sarah Ferguson storming out of a TV interview when asked about cash-for-access scandal is shared online amid fall out over Jeffrey Epstein \n\nAlex Scott and girlfriend Jess Glynne mingle with A-listers Meghann Fahy and Ashley Graham at star-studded BOSS Milan Fashion Week show\n\nLauren Goodger undergoes surgery to have three moles removed as she gives health update from hospital\n\nBranded like Beckham: David and Brooklyn look identical with their rugged beards as the footballer attends BOSS show in Milan after his estranged son was humiliated at Ryder Cup \n\n'Brilliant' crime drama dubbed by fans as 'one of the best shows I have ever seen' takes watchers by storm after landing on huge streamer\n\nSchooled by Diddy: Pimps, killers and thieves sing praises of disgraced mogul's prison business class as he leans on their acclaim to push for release\n\nBlackpink star's VERY risqué outfit on stage sparks outrage: 'It's disgusting'\n\nThe singer recently hit the stage \n\nFuming Carla Bruni rips off reporter's microphone after Nicolas Sarkozy rants at journalists following five-year jail sentence\n\n'I've worked for this body!' Dame Denise Lewis, 53, reveals she feels 'sexier than ever' as she poses for her first lingerie shoot\n\nJoanna Page says 'everything happens for a reason' as reveals the exact moment that she found out about Gavin and Stacey role \n\nMichelle Keegan shares behind the scenes snaps from filming of final ever series of Brassic ahead of its return to screens TONIGHT\n\nHouse of Guinness review: A fast-moving opener with an arson attack and simmering family tensions\n\nSpice Girls' Mel C joins forces with Rebel Wilson for 'ultimate girl power movie' after the director became embroiled in a legal war\n\nGogglebox star Amy Tapper reveals that she wants to be on weight loss injections FOR LIFE after losing an impressive 7.5 stone \n\nMeghan mark two! American actress Madelyn Cline sparks rumours of romance with a royal as they appear to share a kiss in New York\n\nSky Sports presenter Natalie Pinkham admits she and TV executive husband Owain Walbyoff fight over how much cleavage she should show\n\nBBC Breakfast fans question where Naga Munchetty and Charlie Stayt are as the show undergoes fresh presenter shake-up in recent episode\n\nThis Morning viewers left baffled after woman teaches Ben Shephard how to walk like a dog - as they fume: 'what is the world coming to?'\n\nKatie Price is criticised by fans for using a sun bed amid new cancer fears after she was taken to hospital over her worrying weight-loss\n\nColeen Rooney is seen for the first time since her husband Wayne admitted he'd 'be dead without her' while detailing alcoholism battle \n\nLove Island star lands iconic lead role in upcoming Legally Blonde revival as she brings Elle Woods to UK stages\n\nStrictly's Vicky Pattison jokes its the 'first time she's danced sober' with dance partner Kai Widdrington as opens up on training for 'spicy' Cha Cha Cha\n\nMAFS fans convinced Channel 4 bosses are deliberately mismatching couples - as one pair leaves them fuming 'it's all for the ratings!'\n\nMore in love than ever! Kate and William share sweet moment together during visit to Southport as royal fans label them 'true soulmates' \n\nGavin and Stacey star Joanna Page reveals she was kidnapped by taxi driver who held her hostage in his car and threatened to 'strip her naked'\n\nBBC star flooded with support from fans after revealing secret health battle which has taken her off-air for months\n\nHailey Bieber shows off her assets in a low-cut figure-hugging dress as she leaves swanky restaurant in LA\n\nSarah Ferguson is seen for first time since she was dropped by children's charities over humiliating apology email to Jeffrey Epstein\n\nTicketmaster changes ticket sale rules after furore over Oasis reunion tour 'rip-off' sparks probe by watchdog\n\nStrictly's Dianne Buswell heads to training after hitting back at troll who said it's 'uncomfortable and inappropriate' for her to compete while pregnant\n\nWayne Rooney enjoys a Highland getaway with his wife Coleen in Scotland after crediting her for saving his life during battle with alcoholism\n\n'Masterpiece' crime drama with perfect 100 per cent Rotten Tomatoes score now available to stream for free - as fans gush 'it's British TV at its best'\n\nColin Firth's ex-wife Livia hands back her MBE and tears up the prestigious certificate as she accuses UK of 'appeasing' President Trump\n\nStrictly star Thomas Skinner's firm still owes £50k Covid loan to taxpayer despite boasting about turning over millions of pounds in the pandemic\n\nThe Chase fans stunned as Bradley Walsh snaps at contestant and issues a 'yellow card' - as viewers insist they have 'never seen him so heated'\n\nLeonardo DiCaprio, 50, enjoys rare PDA with girlfriend Vittoria Ceretti, 27, as they hold hands while enjoying a spot of shopping in NYC\n\nMeghan brushes off rumours of ex-friend Jessica Mulroney's 'tell-all book' as she shares snap of her 'sweetest moments'\n\nBrooklyn Beckham's Ryder Cup celebrity match doesn't get off to a tee-riffic start as he loses his golf ball and gets repeatedly stuck in a bunker\n\nWicked: For Good's final trailer sees Ariana Grande and Cynthia Erivo's characters face off in dramatic showdown\n\nMel B plants a cheeky kiss on Simon Cowell as they join fellow American's Got Talent judge Sofia Vergara for the show's final in California\n\nBoris Becker's ex-wife Lilly reveals she has quit Britain for Germany after becoming so poor in London her teenage son went hungry\n\nSpencer Matthews and Lottie Moss 'incident' at Jamie Laing's wedding the Chelsea set can't stop whispering about\n\nThe enduring curse of Baywatch: How show's genetically blessed stars have battled cancer, drug abuse, sexual harassment claims and mental health issues\n\nJodie Turner-Smith turns heads in silver dress covered in electronics as she poses alongside Jared Leto at Tron: Ares photocall in Paris\n\nWill Young reveals his struggles with crippling anxiety left him 'unable to leave the house for five days' \n\nLewis Hamilton calls for fans' prayers after rushing his beloved dog Roscoe to a veterinary hospital following 'scary' pneumonia diagnosis\n\nStar Trek legend William Shatner, 94, rushed to hospital in ambulance after medical emergency\n\nSteve Coogan says 'part of me wants to kill off Alan Partridge' after playing him for 34 years \n\nKim Kardashian SNAPS at mom Kris Jenner as she nearly reveals identity of Emmy-winner she had an awkward blind date with\n\nScarlett Johansson makes a rare appearance with her husband Colin Jost at screening of her directorial debut Eleanor the Great\n\nJimmy Kimmel delivers scathing response after Trump threatened to sue ABC for letting him back on air as host explains why he will continue to mock president\n\nShould Prince Andrew and Sarah Ferguson be forced out of Royal Lodge? Have your say in the Palace Confidential poll\n\nRihanna gives birth: Star welcomes third child with A$AP Rocky and reveals newborn's name\n\nStrictly Come Dancing's Nikita Kuzmin breaks his silence after Dani Dyer's shock exit from BBC show\n\nTruth behind Robert Irwin's rumoured 'romance' with his Dancing With The Stars partner Witney Carson - following their 'hot' tango together\n\nKim Kardashian stuns onlookers in bizarre see-through catsuit as she arrives at NikeSKIMS launch event in NYC\n\nSudden death of music icon who wrote Australia's catchiest songs - but he never once made it into the Top 40 pop charts\n\nMo Gilligan 'welcomes baby with fiancée Taia Tulher' after his 'secret love child' with model ex was revealed\n\nKelly Brook steps out after admitting she'd be 'heartbroken' if husband Jeremy Parisi had kids with someone else if their relationship 'didn't work out'\n\nInside Prince Andrew's affair with ex-model and gangster's moll Vicki Hodge\n\nMadonna's daughter Lourdes Leon shows off her figure in a plunging grey top and skirt as she attends the KNWLS show during Milan Fashion Week\n\n'I've got a very supportive WIFE... we just do our own thing': Brooklyn Beckham's barbed comments as he speaks out amid feud with parents \n\nHarry Potter star Emma Watson admits she still 'treasures' J.K. Rowling as actress makes U-turn despite clashing over their different views on trans rights\n\nZara McDermott cuts final ties with ex Sam Thompson as she wipes him from her social media after moving in with boyfriend Louis Tomlinson\n\nEthan Hawke CRASHES Jimmy Kimmel's opening monologue following late night host's controversial return\n\nAlyssa Milano REMOVES breast implants as she 'lets go' of 'body that was sexualized and abused'\n\nKeanu Reeves' longtime love Alexandra Grant, 52, weighs in on marriage rumors after actor, 61, denied the claim\n\nStrictly bosses are struggling to rein in Thomas Skinner as show nears breaking point - after an unhappy pro breaks ranks and two celebs quit\n\nToday's headlines\n\nSelena Gomez and Benny Blanco pose for romantic wedding photos as they share first look inside weekend...\n\nTories demand Commons sleaze investigation after leaked texts suggested secret slush fund to propel Starmer...\n\nDAN HODGES: Labour's lies are unravelling: Insiders have now admitted slush fund run by PM's top adviser WAS...\n\nRoss King, 63, leaves Strictly fans speechless as his glamorous new girlfriend is seen for the first time...\n\nWhy I can't wait for my son to divorce Bonnie Blue. She controlled, manipulated and humiliated him. How dare...\n\nFury after woke NHS supports first-cousin marriages despite risk of birth defects - and oppression against...\n\nRyder Cup gets ugly as Team USA fans are kicked out and extra security races to protect Rory McIlroy from...\n\nPETER HITCHENS: Nothing to hide? Innocent have plenty to fear from Sir Keir's stone-faced digital Stasi\n\nALEXANDRA SHULMAN: I had no symptoms but the doctor said I was at high risk of a heart attack. It was only...\n\nLiam Gallagher dedicates song to 'rape' charge brother Paul at penultimate Oasis UK tour show - then...\n\nDozens killed including children in stampede at actor and politician's rally - as India's PM offers...\n\nMy year from hell: RICHARD HAMMOND breaks his silence on the 'devastating' collapse of his marriage - as he...\n\nPoll puts arch leadership rival Andy Burnham 50 points ahead of Keir Starmer as PM faces Labour Party...\n\nHow people are being hanged from cranes and strangled to death over 45 minutes while crowds of excited...\n\nPetition saying no to Keir Starmer's digital ID card plan hits 2MILLION - as Farage brands scheme...\n\nThey set the hounds on me. I was pretty damn scared, says whistleblower author at centre of unfolding...\n\nTrump orders troops to takeover 'war ravaged' Democrat-led city to handle 'domestic terrorists'\n\nHow Meghan crafted her public persona after Princess Diana - even BEFORE she married Harry\n\nThomas Skinner 'is being protected by Tom Holland's ex-bodyguard after receiving death threats' amid...\n\nYou're too good! BBC chiefs twice rejected Amber Davies for Strictly because she'd starred in musicals -...\n\nTrendy pea protein loved by celebs and influencers is blamed for increase in 'deadly' allergy\n\nTALK OF THE TOWN: Lily Allen's surprising dating app confession: I'm an addict\n\nRachel Reeves is accused of 'desperate stuff' after claiming plan to allow European youths to live and work...\n\nRACHEL STEVENS: I swap beauty secrets with other showbiz mums on WhatsApp - these are the make-up bag...\n\nHuge £1.5billion lifeline for firms hit by crisis at Jaguar Land Rover in bid to save thousands of jobs\n\nAntiques Roadshow star recalls staff outrage after BBC bosses revealed they want to appoint new presenters...\n\nTom Cruise's latest mission is to snap up a Cotswolds mega-mansion - but the locals are FAR from happy\n\nIs the tech giant who gave Blair £257m in line for huge ID card contract? Government embroiled in cronyism...\n\nMy hair's been falling out in clumps - how can I stop it? DR ELLIE says sudden hair loss CAN be reversed,...\n\nDonald Trump's plan for ceasefire in Gaza appears to stall despite deal claims - after Hamas said it did not...\n\nLily Collins looks unrecognisable for her latest role as she films drug scene in rundown street\n\nThe grieving widow who exhumed her husband's body... because he was buried next to the man who ruined his...\n\nRory McIlroy and wife Erica put on a united front after Ryder Cup fans throw toxic taunts at star over...\n\nIn fifty years as a City writer, I've never felt so worried a terrible financial crash is coming. The...\n\nParents CAN prevent social media addiction if rules are set before children turn 12, research shows\n\nGeorge Galloway and wife stopped by counter-terrorism police after landing at Gatwick airport\n\nWhy Michelle Ryan returned to 'boring' EastEnders job after her bid to crack Hollywood was blighted by...\n\nPrincess Beatrice 'loses all hope' of becoming a working Royal after mother Sarah Ferguson's apology to...\n\nLily Cole's Impossible dream in ruins as business on brink of collapse - 12 years after backlash for taking...\n\nTwo female migrants die while attempting to cross the Channel after dinghy carrying 100 people sinks\n\nMr Big is set for his big screen return four years after sex assault claims - and role is nothing like his...\n\nJackie hits the jackpot: Cruz Beckham's girlfriend goes from little-known singer to securing deals with...\n\nLIZ JONES: I knew I didn't like Colin Firth's ex-wife Livia the day we met. Now, her petulant Trump protest...\n\nRyder Cup ticket prices PLUMMET as fans abandon ship while sputtering Team USA is on the brink of disaster\n\nHeroic bomber heroes' last resting place to be 'desecrated' by giant Miliband solar farm\n\nKate Garraway discusses dating and finding love again after the death of husband Derek Draper\n\nThe best (and worst!) places to live in England REVEALED... according to data on crime, house prices,...\n\nWe live in the only bungalow on millionaire's row: Couple's house is worth less than their neighbour's CAR...\n\nEngland win Women's Rugby World Cup on home turf - after backing from cowboy hat-clad Princess of Wales as...\n\nI've seen for myself just how ruinous this practice can be, writes KHADIJA KHAN on cousin marriages\n\nMORE HEADLINES\n\nHow Prince Harry collapses 'like a souffle' as Meghan Markle interrupts him multiple times during an interview, body language expert reveals\n\nPrince Harry's fierce statement at 'sources intent on sabotaging reconciliation' with father as he denies giving king photograph of Meghan during meeting\n\n'Sorry about this, but Susan wants to come with me': Heartbreaking final note left by childless elderly cancer sufferer and his wife before they went on one last walk together and jumped off a cliff, holding hands\n\nThe best (and worst!) places to live in England REVEALED... according to data on crime, house prices, transport links and even broadband speeds\n\nThe rapper and the tragic schoolgirl: How millionaire superstar D4vd is at the centre of grisly death of teen found dismembered in his Tesla\n\nWe live in the only bungalow on millionaire's row: Couple's house is worth less than their neighbour's CAR collection... but they would never dream of moving out\n\nTruth about 'next deputy Labour leader' Bridget Phillipson's poverty-stricken childhood: Mum bought council house in Thatcher's right to buy scheme...and sold it for 1,000% profit over 30 years later\n\nHow much has immigration grown YOUR town? Use our interactive tool to discover how local populations have changed across the UK\n\nSchoolgirl, 15, 'is raped in public park' as police arrest 27-year-old man who had travelled 120 miles from his home\n\nKristin Scott Thomas reveals why remarrying at 64 has made her the happiest she has ever been in her life - and how her new husband was key to her show-stopping Slow Horses role\n\nHolocaust survivor, 96, was coerced into Swiss clinic suicide by 'dominant' husband who she was 'totally reliant' on, friend says\n\nNotorious traveller family once booted out of New Zealand for terrorising tourists have been ordered to pack up AGAIN after losing war with villagers\n\nBritish woman held in Iranian jail on 'spy charges' is put on drip in her cell as family fears for her health\n\nTrump orders troops to takeover 'war ravaged' Democrat-led city to handle 'domestic terrorists'\n\nTories demand Commons sleaze investigation after leaked texts suggested secret slush fund to propel Starmer to Labour leadership\n\nEngland win Women's Rugby World Cup on home turf - after backing from cowboy hat-clad Princess of Wales as she and William lead congratulations\n\nThree members of Michigan family of 25 who starred in reality show killed in car crash\n\nHow Meghan crafted her public persona after Princess Diana - even BEFORE she married Harry\n\nPOLL OF THE DAY: Can Keir Starmer regain lead for Labour over Reform?\n\nGeorge Galloway and wife stopped by counter-terrorism police after landing at Gatwick airport\n\nPensioner spends £40k waging bitter war with neighbour over SIX INCH gap between their gardens\n\nMy mum was raped by a grooming gangs predator when she was just a schoolgirl - and police have failed us again\n\nEllen DeGeneres show star Tayt Andersen dies after battle with cancer\n\nBritain's biggest knotweed jungle: Explosion of destructive weed stretches THREE MILES along river bank as families warned it could leave their homes unsellable\n\nRevealed: The scathing nickname diplomats coined for Prince Andrew thanks to his 'childish obsessions'\n\nMontessori nursery worker would have gone on to kill babies, parents say as chilling video shows her 'bored' reaction when asked about sickening assaults on tots that have seen her jailed for eight years\n\nBrazen supermarket thieves caught on camera loading bottles of alcohol into Deliveroo bag - as Waitrose staff insist they are 'told not to intervene'\n\nNHS doctor is allowed to keep her job after being accused of denying the Holocaust and branding Israelis 'worse than Nazis' - as Health Secretary Wes Streeting condemns ruling\n\nRussian nuclear weapons submarine declares 'explosive hazard' alert after fuel leak in the Mediterranean\n\nVladimir Putin's attack dog threatens 'decisive response' to any action against unauthorised Russian raids into Nato airspace\n\nMOST READ IN DETAIL\n\nADVERTORIAL FEATURES\n\nHurtigruten is one of the world's great journeys, sailing and caring for the Norwegian coast since 1893.\n\nLEARN MORE >\n\nNEW ARTICLESHomeTop\n\nBack to top\n\nVideo Archive\n\nTopics Index\n\nText-based site\nReader Prints\nTop of page\n\nPublished by Associated Newspapers Ltd\n\nHow to complain\nLeadership Team\nAdvertise with us\nWork with Us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout Daily Mail\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Kate Garraway has opened up on whether she will consider finding love again, following the death of her husband Derek Draper.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15140829/Kate-Garraway-dating-finding-love-death-husband-Derek-Draper.html","image":"https://i.dailymail.co.uk/1s/2025/09/28/00/102511147-0-image-m-111_1759016716926.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/03/26/2003683657618702372/1024x576_MP4_2003683657618702372.mp4","publish_date":"2025-09-27 23:57:14","author":"Editor,Lily Jobson","authors":["Editor","Lily Jobson"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.015},{"id":364083006,"title":"How many points do Europe need to retain Ryder Cup?","text":"Europe took a commanding Ryder Cup lead over the USA by dropping just two points on Saturday to stand on the brink of a demolition job with a 11.5-4.5 lead.\n\nUSA captain Keegan Bradley will analyse the damage from a brutal beatdown over two days at Bethpage Black.\n\nThe visitors are now 2.5 points away from retaining their title, with only 28 points available over the duration of three days. \n\nEurope can win the match by claiming three more points, with Luke Donald’s side only the second team in the 28-point system the first four sessions at one Ryder Cup since the 2006 European team and the first to lead by more than 11 points heading into singles.\n\n\"I didn't really imagine this,\" said captain Luke Donald. \"The job is never done till it's done. So I'm not going to sit here and be complacent.\"\n\nThe United States, hoping to avenge their dreadful 2023 defeat in Rome, were instead left clinging to only shreds of hope as they would need 10 points from Sunday's 12 singles matches to win, it means Keegan Bradley’s team can only lose two matches on Sunday.\n\n\"I'm seeing what looks like to be historical putting. They're making everything,\" said Bradley. \"They're a tough team to beat.\"\n\nHard-hitting fan favourite Bryson DeChambeau tried to light a spark for the home team as he teed off first for the Americans and secured a point alongside Cameron Young in the first match of the day.\n\nBut nearly everything went Europe's way from there, as the visitors won the remainder of the morning foursomes and kept the momentum going in the afternoon.\n\nEnglish duo Tommy Fleetwood and Justin Rose opened the scoring for Europe in the afternoon fourballs as they put on a putting clinic to beat DeChambeau and top-ranked Scottie Scheffler 3&2.\n\nThe match fell into conflict briefly as the two sides got into a heated exchange after Rose directed DeChambeau's caddie off the 15th green, as tensions between fans and players escalated across the pastoral venue.\n\nWith the defeat, Scheffler became the first American to lose a match in each of the first four sessions of a Ryder Cup, a surprise collapse after a terrific year in which he claimed six titles, including two majors.\n\nRory McIlroy, the most experienced golfer on either side in his eighth Ryder Cup, seemed to thrive off the U.S. fans' ire as he and Ireland's Shane Lowry put in five straight birdies to finish 2UP on Justin Thomas and Cameron Young.\n\nTwice major winner Xander Schauffele and rookie J.J. Spaun barely cracked a smile as they birdied the final two holes to get the demoralised U.S. a point in the day's penultimate match, finishing 1UP on Spain's Jon Rahm and Austrian Sepp Straka.\n\nTyrrell Hatton, standing in for injured Norwegian Viktor Hovland, won the final match of the day with a birdie putt on the 18th hole, as he and Matt Fitzpatrick finished 1UP on Sam Burns and Patrick Cantlay.\n\nThe home team historically has a big advantage in the biennial matchplay competition but the holders got the hot start to lead 5-1/2 to 2-1/2 on Friday, spoiling U.S. President Donald Trump's visit to the biennial competition.\n\nAsked how he would motivate his team ahead of Sunday, Bradley invoked his beloved New England Patriots, who overcame a 28-3 deficit against the Atlanta Falcons for the biggest Super Bowl comeback in history in 2017.\n\n\"I was at that Super Bowl. I watched it. What a cool thing to have witnessed live in person,\" he said.\n\nReuters contributed to this report","summary":"Luke Donald’s Europe are on the brink of retaining the Ryder Cup at Bethpage Black, with a commanding lead against the USA","url":"https://www.independent.co.uk/sport/golf/ryder-cup-2025-europe-points-win-retain-usa-bethpage-b2835033.html","image":"https://static.independent.co.uk/2025/09/27/23/18/Matt-Fitzpatrick-of-Team-Europe-celebrates-ul80jytl.jpeg?crop=3922.8,2615.2,x62.5,y0&trim=0,601,441,62&width=1200","video":"https://cdn.jwplayer.com/videos/c3i48JYV-OhrQWqOm.mp4","publish_date":"2025-09-27 23:53:47","author":"Jack Rathborn","authors":["Jack Rathborn"],"language":"en","category":"sports","source_country":"gb","sentiment":-0.32},{"id":364081714,"title":"‘Full force’: Trump orders troops to ‘war-ravaged’ Portland","text":"Portland, Oregon: US President Donald Trump said he would send troops to Portland, “authorising Full Force, if necessary” to handle “domestic terrorists” as he expands his deployments to more American cities.\n\nOregon Democratic Governor Tina Kotek responded by saying Trump was abusing his authority by ordering troops into a city that she said is doing “just fine” on its own. She was joined by other government, police and business leaders who all said soldiers were not needed and Trump was presenting a patently false picture of the city.\n\nTrump made his announcement on social media, writing that he was directing the Department of Defence to “provide all necessary Troops to protect War ravaged Portland”. Trump said the decision was necessary to protect US Immigration and Customs Enforcement facilities, which he alleged are “under siege from attack by Antifa, and other domestic terrorists”.\n\nThe White House did not immediately respond to a request for details on Trump’s announcement, such as a timeline for the deployment or what troops would be involved.","summary":"The US president claims the decision is necessary to protect “under siege” ICE facilities, but other government, police and business leaders say he is presenting a patently false picture of the city.","url":"https://www.theage.com.au/world/north-america/full-force-trump-orders-troops-to-war-ravaged-portland-20250928-p5myfp.html","image":"https://static.ffx.io/images/$zoom_0.2214%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_133%2C$y_192/t_crop_custom/q_86%2Cf_auto/47d2ccf918904c2514724e8686a4c131908a8457","video":null,"publish_date":"2025-09-27 23:50:44","author":"Chris Megerian,Claire Rush","authors":["Chris Megerian","Claire Rush"],"language":"en","category":"politics","source_country":"au","sentiment":-0.189},{"id":364084724,"title":"‘Full force’: Trump orders troops to ‘war-ravaged’ Portland","text":"Portland, Oregon: US President Donald Trump said he would send troops to Portland, “authorising Full Force, if necessary” to handle “domestic terrorists” as he expands his deployments to more American cities.\n\nOregon Democratic Governor Tina Kotek responded by saying Trump was abusing his authority by ordering troops into a city that she said is doing “just fine” on its own. She was joined by other government, police and business leaders who all said soldiers were not needed and Trump was presenting a patently false picture of the city.\n\nTrump made his announcement on social media, writing that he was directing the Department of Defence to “provide all necessary Troops to protect War ravaged Portland”. Trump said the decision was necessary to protect US Immigration and Customs Enforcement facilities, which he alleged are “under siege from attack by Antifa, and other domestic terrorists”.\n\nThe White House did not immediately respond to a request for details on Trump’s announcement, such as a timeline for the deployment or what troops would be involved.","summary":"The US president claims the decision is necessary to protect “under-siege” ICE facilities, but other government, police and business leaders say he is presenting a patently false picture of the city.","url":"https://www.smh.com.au/world/north-america/full-force-trump-orders-troops-to-war-ravaged-portland-20250928-p5myfp.html","image":"https://static.ffx.io/images/$zoom_0.2214%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_133%2C$y_192/t_crop_custom/q_86%2Cf_auto/47d2ccf918904c2514724e8686a4c131908a8457","video":null,"publish_date":"2025-09-27 23:50:44","author":"Chris Megerian,Claire Rush","authors":["Chris Megerian","Claire Rush"],"language":"en","category":"politics","source_country":"au","sentiment":-0.189},{"id":364080328,"title":"Donald Trump's plan for ceasefire in Gaza appears to stall despite deal claims - after Hamas said it did not receive proposals from US President","text":"Donald Trump's plan to end the war in Palestine seemed to stall yesterday – after the terrorist ruling group Hamas said it had not received any ceasefire proposals from the US President.\n\nOn Friday, Mr Trump told reporters while departing the White House: 'It's looking like we have a deal on Gaza, and we'll let you know. I think it's a deal that will get the hostages back.\n\n'It's going to be a deal that will end the war.'\n\nBut as Israeli forces expanded their assault on Gaza City yesterday, a Hamas official insisted: 'Hamas has not been presented with any plan.'\n\nThe conflict began on October 7, 2023, with an attack by Hamas which killed 1,200 Israelis and saw 251 taken hostage.\n\nA hopeful Mr Trump added on Friday: 'It's going to be peace. I think we have a deal.'\n\nAnd the Israeli newspaper Haaretz reported that, under Mr Trump's plan, Hamas had agreed in principle to release all the Israeli hostages it still holds in return for hundreds of Palestinian prisoners, and the gradual withdrawal of Israeli troops.\n\nAlso included in the proposal was the end of Hamas rule in Gaza, and Israel agreeing not to annex the territory and drive out Palestinians living there, according to the newspaper.\n\nMr Trump is due to meet Israeli prime minister Benjamin Netanyahu tomorrow, whose hard-right governing coalition is bitterly opposed to ending the conflict before Hamas has been destroyed.\n\nIn Gaza, meanwhile, the military action continued.\n\nIsrael said its aircraft struck 120 targets across the region over the past day as its troops pressed deeper into Gaza City.\n\nThe Palestinian Health Ministry claimed that 74 people had been killed in Gaza in the past 24 hours.\n\nThe international humanitarian organisation Doctors Without Borders announced late on Friday that it had been forced to suspend its medical activities in Gaza City because its clinics were encircled by Israeli forces, adding the move was the 'last thing' it wanted.\n\nSince the war started, Israeli forces have killed more than 65,000 Palestinians in the enclave and displaced the entire population, according to Gaza's Hamas-run health authorities.","summary":"On Friday, Donald Trump told reporters at the White House: 'It's looking like we have a deal on Gaza, and we'll let you know. I think it's a deal that will get the hostages back.","url":"https://www.dailymail.co.uk/news/article-15140963/Donald-Trump-ceasefire-Gaza-stall-deal-Hamas.html","image":"https://i.dailymail.co.uk/1s/2025/09/28/00/102465753-0-image-m-35_1759016000843.jpg","video":null,"publish_date":"2025-09-27 23:49:57","author":"Editor,Padraic Flanagan","authors":["Editor","Padraic Flanagan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.283},{"id":364083688,"title":"Trump's push to free the hostages at one time, the clause that worries Netanyahu and his choices","text":"New details have emerged about U.S. President Donald Trump’s 21‑point peace plan, which Israeli officials assess is highly likely to be implemented. The U.S. president seeks to advance a comprehensive deal to release all hostages “in one fell swoop” at the start of a cease‑fire. Under current indications, the release would stretch over several days — possibly around 72 hours. In Israel there is growing concern that the clause in Trump’s plan calling for Hamas’ exit from Gaza and the dismantling of its weapons is “too rhetorical.” The assessment is that Hamas will not actually dismantle its weapons systems. In light of this, Netanyahu faces two options: reject the plan on the grounds that it is insufficient, or accept it, secure the release of the hostages — and if Phase 2 does not materialize and Hamas remains in the Strip, justify the continuation of fighting. Senior officials in Israel say that the plan lacks an explicit agreement by Hamas to exit the Strip. Israel is prepared in return to grant immunity to Hamas leaders — both those who depart to Turkey or Qatar and senior figures already outside Gaza. The officials believe that Netanyahu is likely to tell Trump that he must first hear Hamas' response to the plan. Another point of contention is the U.S. aid fund to Gaza. In Israel there is fear Trump may decide to shut it down and hand over aid distribution to U.N. agencies — a move unacceptable in Jerusalem given past attempts in which aid convoys were looted by Hamas. Behind the scenes, the fund is suffering from a serious budget crisis and in the Trump administration there is currently no one willing to sign off on the aid budgets at the State Department — largely due to opposition among Republican backers to overseas spending on conflict zones. Meanwhile, just prior to the meeting with Trump at the White House on Monday, pressure on Netanyahu is also coming from within the coalition. National Security Minister Itamar Ben-Gvir wrote Saturday night on his X account: “Mr. Prime Minister, you do not have a mandate to end the war without Hamas’ total defeat.” On the other hand, Foreign Minister Gideon Sa’ar expressed confidence in Netanyahu: “I trust the prime minister to represent Israel’s interests as required in talks with President Trump. After two years of war Israel’s clear national interest is to end the war and achieve its goals.” Knesset Member Moshe Gafni of United Torah Judaism also voiced support: “Our position is for ending the war and returning the hostages.” Opposition Leader Yair Lapid also addressed Trump’s initiative, again promising a “safety net” from him for a hostage deal. “I informed the U.S. government today that Netanyahu has from me a safety net for a hostage deal and ending the war. There is a majority in the Knesset and in the country, there is no need to be excited about empty threats from Ben-Gvir and Smotrich,” Lapid wrote on X. At the same time, Defense Minister Israel Katz said in a strong statement Saturday night: “If Hamas does not release all the hostages and dismantle its weapons Gaza will be destroyed and Hamas will be annihilated. We will not stop until all war goals are achieved.” He added that the Israel Defense Forces are increasing the intensity of operations, deploying autonomous explosive armored vehicles ahead of troops, and taking control over additional neighborhoods and territory in the Strip. Katz’s statement angered the Hostages and Missing Families Forum, which published a sharp response: “The defense minister is again blowing up yet another chance for a deal to return the hostages and end the war. This is the path to abandoning hostages, abandoning the soldiers, and destroying the basic values of security and national resilience. The defense minister bears personal direct responsibility for every hostage harmed, killed or lost forever.” Criticism of Qatar is also rising in Israel. Sources in Jerusalem accuse it of orchestrating the wave of threats of sanctions, including pressure in UEFA to expel Israeli soccer clubs from European competitions. In Israel, a counter‑plan is being formed, and surprises are being prepared for Qatar so that it does not emerge “unscathed” from its behind‑the-scenes activity. Qatar approached Spain and sought to increase pressure on Israel following the strike in Doha, in exchange for advancing Qatari investments in the country. Indeed, in recent weeks clear steps by Spain against Israel have been observed. Also in Morocco, a change of tone is evident: Foreign Minister Nasser Bourita has sounded harsher, and two critical articles about Israel were published on semi‑official news sites after a long period of media silence. A source familiar with the matter says this is not purely a pro‑Palestinian sentiment or internal pressure, but a coordinated Qatari diplomatic move, relying on economic leverage and regional influence.","summary":"The US president's plan includes the release of all the hostages within 72 hours, but lacks an explicit agreement by Hamas to exit the Strip;  Opposition promises government a safety net in exchange for a hostage deal while Ben-Gvir warns the PM: 'You have no mandate to end the war without Hamas’ total defeat' ","url":"https://www.ynetnews.com/article/ry29lgi2eg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/07/19/HJmFVut8xe/HJmFVut8xe_0_0_850_479_0_large.jpg","video":null,"publish_date":"2025-09-27 23:49:38","author":"Itamar Eichner In New York","authors":["Itamar Eichner In New York"],"language":"en","category":"politics","source_country":"il","sentiment":-0.296},{"id":364081192,"title":"FBI's Patel clarifies role of hundreds of agents on Jan 6, says Wray lied to Congress","text":"EXCLUSIVE: The FBI responded on Saturday to a report that 274 plainclothes agents were at the U.S. Capitol riot on Jan. 6, 2021, clarifying the role of bureau personnel while still blasting former Director Christopher Wray. While the agents were on hand, they were sent in after the riot had begun to try to control the unruly crowd, officials told Fox News Digital. That is not the proper role of FBI agents, and Wray was not forthcoming about what happened when he testified numerous times on Capitol Hill, Director Kash Patel said. \"Agents were sent into a crowd control mission after the riot was declared by Metro Police – something that goes against FBI standards,\" Patel told Fox News Digital. \"This was the failure of a corrupt leadership that lied to Congress and to the American people about what really happened.\" He added, \"Thanks to agents coming forward, we are now uncovering the truth. We are fully committed to transparency, and justice and accountability continues with this FBI.\" There’s no indication any FBI agents were involved in any events related to Trump’s speech on the morning of Jan. 6 at the Ellipse, an FBI official told Fox News Digital, adding that Wray should have disclosed that agents were there when he was asked by congressional leaders. FBI’S KASH PATEL VOWS ‘DEFINITIVE ANSWER’ ON TOP JAN 6 QUESTION IS ‘COMING’ President Donald Trump, citing a report that the agents were in the crowd which did not make clear their mission, said earlier that Wray, \"has some major explaining to do.\" \"It was just revealed that the FBI had secretly placed, against all Rules, Regulations, Protocols, and Standards, 274 FBI Agents into the Crowd just prior to, and during, the January 6th Hoax,\" Trump wrote in a Truth Social post on Saturday afternoon following a report from The Blaze, revealing the number of agents that were there. Trump added, \"This is different from what Director Christopher Wray stated, over and over again! That’s right, as it now turns out, FBI Agents were at, and in, the January 6th Protest, probably acting as Agitators and Insurrectionists, but certainly not as ‘Law Enforcement Officials.’\" The president said he wanted to know each officer’s identity and what they were doing at the U.S. Capitol. \"Many Great American Patriots were made to pay a very big price only for the love of their Country,\" he said, referring to Trump supporters who faced charges for their involvement on Jan. 6. Trump pardoned or commuted the sentences of every person charged for involvement on Jan. 6 after he took office this year. DOJ INSPECTOR GENERAL DOES NOT DENY FBI INFORMANTS WERE AMONG JAN. 6 CROWD He concluded, \"I owe this investigation of ‘Dirty Cops and Crooked Politicians' to them! Christopher Wray, the then Director of the FBI, has some major explaining to do. That’s two in a row, Comey and Wray, who got caught LYING, with our Great Country at stake. WE CAN NEVER LET THIS HAPPEN TO AMERICA AGAIN!\" Citing a senior congressional source, the Blaze report said that the number of agents wasn’t \"necessarily a surprise\" because the FBI often \"embeds countersurveillance personnel at large events.\" Wray told a House Committee on Nov. 15, 2023, \"If you are asking if the violence at the Capitol was part of some operation orchestrated by FBI sources or agents, the answer is no,\" but he wouldn’t disclose if any agents or sources were embedded within the crowd. The 274 agents also includes those who were responding to the pipe bombs placed near the Democratic National Committee and Republican National Committee headquarters the night before Jan. 6, according to Politico. Trump nominated Wray as FBI director in 2017 after he fired former FBI director James Comey, who was just indicted by a grand jury this week for allegedly making false statements to Congress. FBI AGENTS ACROSS THE COUNTRY ARE TOLD TO RESIGN, RETIRE OR BE FIRED A report released last December by Justice Department Inspector General Michael E. Horowitz said: \"We found no evidence in the materials we reviewed or the testimony we received showing or suggesting that the FBI had undercover employees in the various protest crowds, or at the Capitol, on January 6,\" although he acknowledged there were 26 paid informants, but only three of them were assigned by the FBI to be there. The report also said that FBI personnel were sent to the Capitol at the request of overwhelmed Capitol Police to help with crowd control. Horowitz said that none of the informants were allowed to incite the crowd, break the law or enter the U.S. Capitol. In its reporting, Blaze noted that there may have been confusion regarding \"plainclothes\" and \"undercover,\" meaning both the inspector general and the FBI could be telling the truth. Many of the agents weren't happy to have been sent to the Capitol to do crowd control, another official told Fox News Digital. It was a chaotic scene with no pre-planning that contradicted the agency's original plan to not get involved in the event. The official said that agents are not trained to do crowd control. The first agents arrived at the Capitol around 2:30 p.m. — there's no evidence there were any there before a riot was declared — and agents continued to arrive after that, the official added. CLICK HERE TO GET THE FOX NEWS APP Wray had testified before Congress prior to the inspector general's report being released in December, but Patel called out Wray for deflecting and giving a \"D.C. answer\" when pressed by lawmakers. \"Why it took a ton of time and questioning in Congress for the director to get that point is what I'm trying to eliminate from the FBI,\" Patel said. \"If Congress asks you a question under oath, whether or not there were sources in [or] around Jan. 6th at the Capitol, you as the director of the FBI need to know that and not deflect and give a D.C. answer. You have to be prepared for that.\" Fox News' Brooke Singman contributed to this report.","summary":"FBI Director Kash Patel said that agents were sent into crowd control missions on Jan. 6 after a riot was declared, adding that that goes against FBI standards.","url":"https://www.foxnews.com/politics/fbis-patel-clarifies-role-hundreds-agents-jan-6-says-wray-lied-congress","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/jan-6.jpg","video":"https://www.foxnews.com/video/6368320200112","publish_date":"2025-09-27 23:29:19","author":"Brie Stimson","authors":["Brie Stimson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.546},{"id":364084122,"title":"Democrats Reportedly Quietly Planning Luxury Getaway Escape To 5-Star Resort Despite Looming Government Shutdown","text":"A Senate Democrats’ campaign arm is planning a two-day getaway at a five-star resort in the heart of California’s wine country in early October — at the same time the country may be in the midst of a government shutdown — according to an invitation obtained by Politico’s “Playbook.”\n\nThe Democratic Senatorial Campaign Committee (DSCC) is hosting its Napa Retreat from Oct. 13-14 at Hotel Yountville in Napa County, Politico reported Saturday. Democratic New York Sen. Kirsten Gillibrand, who has chaired the DSCC since January, circulated an invitation to the event which lists her, Democratic Maryland Sen. Angela Alsobrooks and other unidentified “[m]embers of the Democratic Caucus” as attendees, according to the outlet.\n\nDemocratic Michigan Rep. Haley Stevens — who is running in a hotly-contested 2026 primary for Michigan’s open Senate seat — is also expected to make an appearance at the Napa retreat, Politico reported, citing an anonymous Democrat who was briefed on the gathering. The DSCC has yet to publicly endorse a candidate in the highly competitive race between Stevens, Democratic Michigan Sen. Mallory McMorrow, and former public health official Abdul El-Sayed.\n\nThe event will potentially coincide with a government shutdown, which multiple Democratic senators in recent months have threatened to back in opposition to President Donald Trump. A shutdown will occur if Congress does not pass an agreement to fund the government by the end of Sept. 30.\n\n Sen. Kirsten Gillibrand (D-N.Y.) has circulated an invitation obtained by Playbook for a “Napa Retreat” for the DSCC on Oct. 13 and 14. Should the government shut down next week, the retreat could fall on what might be day 12 of a shutdown. @playbookdc — Senator John Cornyn (@JohnCornyn) September 27, 2025 \n\nThe majority of the retreat is slated to take place at the hotel, with the noted exceptions of an Oct. 13 wine tour and dinner at the certified organic Staglin Family Vineyards, according to the circulated invitation.\n\nHotel Yountville’s website describes the luxury resort and spa as a “vineyard estate-inspired retreat” which “extends a Tuscan-European vibe.”\n\n“Sleep deeply always, in our luxurious accommodations. Soak in one of our oversized sunken tubs and find warmth by your private fieldstone fireplace,” the hotel’s website states. “Savor a meal at Heritage Oak Café, immerse yourself in our pool, or find repose at our distinguished spa. Hotel Yountville offers more than a Wine Country trip—it’s the luxury escape you didn’t know you needed…until now.” (RELATED: Democrats Enjoyed Luxury Resort’s Comforts While Protesting Deportation Of Alleged MS-13 Gangbanger)\n\nThe Daily Caller News Foundation asked the DSCC to name the retreat’s objective, cost, and other requirements for attendance. The DCNF also asked the Senate Democrats’ campaign arm if the gathering would still proceed as planned in the event of a shutdown and whether the retreat was created with foreknowledge it may coincide with it. Furthermore, the DCNF asked the DSCC if either of Stevens’s primary opponents or any other 2026 Senate candidates were invited to attend the retreat.\n\nThe DSCC did not respond to any of the DCNF’s questions.\n\n“Not only is Haley Stevens threatening to freeze paychecks for tens of thousands of Michiganders in order to give illegal aliens taxpayer-funded healthcare — she’s running off to wine and dine in California while they pay the price,” Alyssa Brouillet, campaign spokesperson for Trump-endorsed Republican Michigan Senate candidate Mike Rogers, said in a statement to the DCNF. “This is a complete slap in the face to working Michigan families.”\n\nStevens on Sept. 2 falsely claimed on X her campaign was endorsed by Berrien County Commissioner Chokwe Pitchford. Pitchford ended up endorsing Stevens’s primary opponent, Sen. McMorrow, less than a week later.\n\nMcMorrow is a prominent critic of Senate Minority Leader Chuck Schumer and was one of the first 2026 Democratic Senate candidates to publicly call for him to step down as leader of the upper chamber’s Democratic Caucus. El-Sayed, meanwhile, is a left-wing candidate endorsed by Independent Vermont Sen. Bernie Sanders. (RELATED: Poll Shows Dem Primary Slugfest Brewing For Senate Seat GOP Seeks To Flip)\n\nSpokespersons for Gillibrand, Alsobrooks, and Stevens did not respond to requests for comment from the DCNF.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'This is a complete slap in the face'","url":"https://dailycaller.com/2025/09/27/senate-democrats-campaign-committee-napa-california-retreat-government-shutdown-kirsten-gillibrand-haley-stevens-angela-alsobrooks/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2227553533-scaled-e1758996895253.jpg","video":null,"publish_date":"2025-09-27 23:24:32","author":"Anthony Iafrate","authors":["Anthony Iafrate"],"language":"en","category":"politics","source_country":"us","sentiment":-0.112},{"id":364074964,"title":"\"You don’t need 107 days\" - Bill Maher reacts to Kamala Harris' extended book tour, saying people like her less the more they know her","text":"American comedian and actor Bill Maher recently commented on Kamala Harris' extended book tour. For the unversed, the former US Vice President is currently on her 107 Days book tour to promote what the project's website describes as \"the story of one of the wildest and most consequential presidential campaigns in American history.\"On September 27, 2025, X page @VigilantFox posted a clip of Maher criticizing Harris' book and the tour, stating that listening to the former Vice President every day for years is more than what he can take. He put forth his view, saying how the more the public got to know Harris, \"the less they liked her.\"Commenting on the book and its concept, Bill Maher said, “You don’t need 107 days. You tell people your plan. ‘This is what I am for. This is my thing.’ You’re selling something. You’re selling a vacuum cleaner. If I’m selling a vacuum cleaner, I’ll tell you why I think it’s best. I’m not going to tell you every goddamn day for two years. Did I tell you about the attachment that gets under the, yeah, you did. You told me a thousand times!”Moreover, during a recent episode of his Club Random Podcast dated September 22, 2025, Bill Maher revealed who he voted for in the 2024 election. Despite criticizing her book tour, Maher admitted to having voted for Kamala Harris, stating, “I always say to my woke friends, we voted for the same person. You’re just why she lost. That’s my line to them and I will stand by that.\"Bill Maher proceeded to comment on Harris' opponent and the current President of the US, Donald Trump, stating that he is straightening out the things that required mending, dubbing some of his approach as \"colossally wrong.\"More details about Kamala Harris' 107 Days memoir explored in the wake of Bill Maher's comments on the projectKamala Harris' 107 Days is a \"candid, personal account of the shortest presidential campaign in modern history\", as described by the former US Vice President via an Instagram post dated September 10, 2025.According to NBC's report dated September 23, 2025, which includes excerpts from Harris' memoir, the former US Vice President expressed her feelings toward former US President Joe Biden. Recalling the time she spoke to her campaign staff for the first time in July at the Wilmington, Delaware, headquarters, Harris wrote: “My feelings for him were grounded in warmth and loyalty, but they had become complicated, over time, with hurt and disappointment.\"Moreover, Harris mentioned the conversation she had with Biden when he dropped out of the presidential race, recalling how the Bidens wanted to wait for a few days before endorsing her. However, the former Vice President talked Joe Biden out of the plan as it would hurt her chances of securing delegates to ensure a place in the party's nomination.Kamala Harris also wrote about when Joe Biden spoke to the nation to explain his decision to drop out of the presidential race, \"it was almost nine minutes into the eleven-minute address before he mentioned me.\"Additionally, Kamala Harris mentioned another instance of the same, citing Joe Biden's speech at the Democratic National Convention in August 2024, stating: \"He spoke for nearly an hour, detailing the accomplishments of our administration. It was a legacy speech for him, not an argument for me, and he was entitled to it. But if we waited for some personal stories about working with me and what qualities he had seen that led him to endorse me, they weren't there.\"Kamala Harris' election campaign memoir, 107 Days, was released on September 23, 2025. In addition to expressing her feelings about Joe Biden's endorsement of her, the former Vice President has also opened up about her decision not to appear on Joe Rogan's podcast, among other instances.","summary":"American comedian and actor Bill Maher recently commented on Kamala Harris' extended book tour.","url":"https://www.sportskeeda.com/pop-culture/you-don-t-need-107-days-bill-maher-reacts-kamala-harris-extended-book-tour-saying-people-like-less-know","image":"https://staticg.sportskeeda.com/editor/2025/09/fb165-17589845890593-1920.jpg","video":null,"publish_date":"2025-09-27 23:21:28","author":"Divya Singh Rana","authors":["Divya Singh Rana"],"language":"en","source_country":"in","sentiment":-0.085},{"id":364078708,"title":"THE GRAPEVINE","text":"I Can Talk English\n\nShehzad Roy’s Zindagi Trust must be commended for making short educational and motivational videos for children and not just children. In one of the recently released pieces, a young girl, Khadija, wearing a school uniform, is conversing with Shehzad R, who is trying to correct her English pronunciation. During the chat, the girl tells off Shehzad R for his snootiness and brings the discussion round to the concept of ‘world Englishes’, which means the diversity in English pronunciations and that ‘English belongs to everyone’. She also points out that English is her third language and she dreams in Punjabi. It is such a heartwarming video. The singer and his trust must feel proud of it. More of this, please.\n\nBear With Me\n\nA couple of weeks after a bear attacked singer Quratulain Balouch while camping with friends in Deosai National Park up in Skardu, the story became a bit confusing. We say this because the disaster response service that was hosting her in the region, apparently to help with flood relief efforts, claims that Gilgit-Baltistan authorities are to blame for the mishap, whereas the latter say the vocalist and her team didn’t pay heed to their advice, resulting in the unfortunate incident. Whatever the case maybe, the good thing is that QB, as she is known by friends and admirers, is safe and recovering from her wounds. Sometimes, full stories take some time to be bared. \n\nMedia Curbs\n\nTwo months after comedian Stephen Colbert’s show was cancelled for talking about something that the American political administration didn’t like, ABC suspended its late night show Jimmy Kimmel Live because the host, comedian Jimmy Kimmel, had said on his show that the MAGA gang was trying to deflect that the kid who murdered rightwing political activist Charlie Kirk was probably one of them. US President Donald Trump then chimed in, calling the ABC decision “great news for America.” Infuriatingly for him, ABC’s parent company, Disney, reversed the decision after a week, so Kimmel is back on air. By the way, MAGA stands for ‘Make America Great Again.’ We don’t think it’s going to happen by gagging the media.\n\nThe Coachella Call\n\nThe list of artists taking part in Coachella 2026, the largest North American annual music festival, has been announced. It includes the likes of Iggy Pop, Sabrina Carpenter, Justin Bieber, The XX, The Strokes, Young Thug, Sexy Redd, Teddy Swims, Moby and the girl group KATSEYE. Now that’s a stellar line-up that one would like to see and listen to from April 10 to 12 next year. But there’s no Pakistani or Indian artist — such as Ali Sethi and Diljit Dosanjh — this time? What the heck! It’s still a foot-tapping, finger-snapping line-up though. \n\nThe Keanu Knot\n\nKeanu Reeves is one of the most unassuming and down-to-earth Hollywood celebs. Who would have thought that he’d do something quite celebrity-like? It has been reported that, this past summer, the actor married his longtime girlfriend, the visual artist Alexandra Grant, in Europe. Of course, it was a hush-hush event. The two have been seeing each other since 2019 and were first acquainted in 2009. We congratulate the couple and hope in the matrix of the world they choose the right pill for a happily married life.\n\nDirector’s Gone Vision\n\nMost movie lovers must have watched the 2012 super-hit Gone Girl, based on the novel by Gillian Flynn, starring Rosamund Pike and directed by David Fincher. Thirteen years later, Oscar-winner Reese Witherspoon has revealed that she had the novelist’s nod for the role, but the director turned her down. “David [Fincher] sat me down — and this is not on David — but David’s like, ‘You’re totally wrong for this part. I’m not putting you in it’.” While she felt bad at the time, now she believes that it was an ego check for her and he was totally right. Hmmm… What about Gillian F’s ego, though?\n\nPublished in Dawn, September 28th, 2025","summary":"I Can Talk English\n\n\n\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\n\n\nShehzad Roy’s Zindagi Trust must be commended for making short educational and motivational videos for children and not just children. In one of the recently released pieces, a young girl, Khadija, wearing a school uniform, is conversing with Shehzad R, who is trying to correct her English pronunciation. During the chat, the girl tells off Shehzad R for his snootiness and brings the discussion round to  the concept of ‘world Englishes’, which means the diversity in English pronunciations and that ‘English belongs to everyone’. She also points out that English is her third language and she dreams in Punjabi. It is such a heartwarming video. The singer and his trust must feel proud of it. More of this, please.\n\n\n\nBear With Me\n\n\n\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\n\n\nA couple of weeks after a bear attacked singer Quratulain Balouch while camping with friends in Deosai National Park up in Skardu, the story became a bit confusing. We say this because the disaster response service that w","url":"https://www.dawn.com/news/1945058/the-grapevine","image":"https://i.dawn.com/large/2025/09/68d85bb17798a.gif","video":null,"publish_date":"2025-09-27 23:21:19","author":"PYT","authors":["PYT"],"language":"en","category":"entertainment","source_country":"pk","sentiment":0.098},{"id":364078722,"title":"SMOKERS’ CORNER: WHEN SECULARISM BECOMES SACRED","text":"The 18th century French philosopher Jean-Jacques Rousseau argued that religion is necessary for a stable state. His writings greatly inspired the makings of the French Revolution which, ironically, was largely anti-religion. But Rousseau mostly spoke about a ‘civil religion’, and not a traditional, revealed faith. Civil religion functions like a belief system by ‘sacralising’ ideas that are secular. \n\nRousseau was writing during a period when pre-modern Christianity was receding. It had begun to be viewed by most European thinkers as exploitative, myopic and a hindrance to the advancement of ‘new knowledge’ derived from empiricism and rationalism. \n\nThis critique was not only coming from staunch secularists alone, but also from Christian reformists. Yet, even the most secular thinkers agreed that faith was important to keep societies from spiralling into spiritual anxiety and chaos. Rousseau’s idea of civil religion, therefore, became increasingly influential across the 19th and 20th centuries. Concepts like the nation and the state began being given a sacred status and rituals. \n\nThese rituals borrowed symbolic elements from traditional religions but reframed and reinterpreted them. For example, sacralisation in this regard often constitutes national holidays, flag-raising ceremonies, pledges of allegiance, remembrance days and memorial services for historical events or figures etc. These are ritualised in a way to evoke emotions as rituals of traditional faiths do. \n\n Secular ideas, when imbued with sacred meaning, turn politics into a ‘moral mission’ and reshape democracy’s character in the process\n\nCivic religion eventually gave birth to the ‘sacralisation of politics.’ Politics is inherently amoral. It is largely invested in the interest of the self or the nation, and is often unconstrained by moral judgement when pursuing these interests. But the gradual sacralisation of the body politic sacralised the amorality of politics as well. \n\nAccording to the researcher Bilge Yabanc, many political parties have transformed politics into a religious-like mission by infusing secular entities — such as the nation, the state and the leader — with sacred meaning. Some of the first major consequences of this process were rather drastic. They produced political forces that wanted to be the only ones in the picture. \n\nEarly examples in this regard include the Russian Communist Party (Bolsheviks), the National Fascist Party in Italy, the Nazi Party in Germany, the Movimiento Nacional in Spain and, later, Mao Zedong’s Communist Party of China. \n\nAccording to the British historian Paul Jackson, these created new symbols and rituals to evoke belief in a higher cause (related to the state). This was to be navigated by a ‘visionary’ leader shaped by a ‘cult of personality.’ In 1952, the German-American political scientist Waldemar Gurian wrote that the totalitarian movements which rose after World War I “were fundamentally religious movements, based on a new conception of faith.” Political scientists began to refer to this conception as “political religion” (not to be confused with religious politics). \n\nJackson wrote that a utopian vision is at the core of a political religion. It is treated as a messianic mission, binding leaders and followers together in a shared project. It develops new rituals that make a charismatic individual the personification of the mission. He/she also personifies a wider mythology that allows societies to engage in activities that express their collective belief in the sacred cause espoused by the new ‘faith’. But sacralisation of politics doesn’t always produce totalitarian outcomes. It is very much present in democracies as well. \n\nIn developed as well as developing democracies, too, the nation-state continues to be treated as a sacred entity, and serving it is viewed as a sacred purpose. Ever since the 2000s, populist leaders have been the main outcomes of the sacralisation of politics. According to Yabanc, they present themselves as saviours, and their pronouncements are given a quasi-religious significance, demanding uncritical devotion from followers. \n\nThis is quite apparent in Narendra Modi’s India, Recep Tayyip Erdogan’s Turkey, Donald Trump’s America and Benjamin Netanyahu’s Israel, as it was in Jair Bolsonaro’s Brazil and Imran Khan’s Pakistan. Their political agendas were framed as being of utmost moral importance. To Yabanc, politics has increasingly become an expression of a ‘spiritual’ mission.\n\nTwentieth century totalitarian ideas — Stalinism, Nazism, Fascism and Maoism — were extreme outcomes of the sacralisation of politics. Less monolithic versions of the same were already present in almost every country. Initially, sacralisation sought to replace traditional beliefs with more modern and pluralistic identity markers. It tried to formulate beliefs and rituals to fill the gaps left behind by the receding traditional beliefs. Interestingly, during this process, the idea of democracy too was sacralised.\n\nAfter the Second World War, when ‘political religions’ such as German Nazism and Italian Fascism collapsed, democracy was presented by the West as a more sober and rational idea. But the fact is, it was already in the process of being sacralised. As far back as 1934, the American philosopher John Dewey was trying to find “a moral and spiritual motivation for democracy.”\n\nDuring the Cold War (1945-91), the tendency to treat democracy with great reverence intensified. It was elevated to having superior moral authority, especially in opposition to Soviet communism. As long as there was a ‘totalitarian’ Soviet Union, the sacralised idea of democracy continued to gain traction as an ideal system that guaranteed the construction of free and ethically and morally sound societies.\n\nThis sacralised perception of democracy reached its peak after the collapse of the Soviet Union in 1991. But, according to the British-American sociologist Michael Mann, in the absence of a communist ‘other’, democracy turned on itself, especially when its sacralised sides became entry points for populists to storm the corridors of mainstream power. \n\nThey began shaping a “moral majoritarianism” that undermines institutions, creates polarisation, justifies authoritarian behaviour, and cultivates a following that is encouraged to undermine critical thinking for a greater cause — causes such as the establishment of a white Anglo-Saxon Christian state in the US, or a ‘kingdom of God’ in Brazil, a ‘Riyasat-i-Madina’ in Pakistan and an entirely white Europe etc. \n\nIn the early 2000s, many political scholars began to speak about a “post-secular world” and the “return of religion.” But the fact is, secularism began to erode when secularists themselves began to sacralise secular entities. As the American political scientist Anna Grzymala-Busse correctly posits, it was the sacralisation of politics that “buttressed popular religiosity and attitudes and empowered religious organisations in influencing policy across a wide range of domains.” \n\nThe so-called return of religion was the outcome of the sacralisation of multiple secular ideas. This ploy eventually ate up what it was trying to make more widely accepted: secularism.\n\nPublished in Dawn, EOS, September 28th, 2025","summary":"The 18th century French philosopher Jean-Jacques Rousseau argued that religion is necessary for a stable state.  His writings greatly inspired the makings of the French Revolution which, ironically, was largely anti-religion. But Rousseau mostly spoke about a ‘civil religion’, and not a traditional, revealed faith. Civil religion functions like a belief system by ‘sacralising’ ideas that are secular. \n\n\n\nRousseau was writing during a period when pre-modern Christianity was receding. It had begun to be viewed by most European thinkers as exploitative, myopic and a hindrance to the advancement of ‘new knowledge’ derived from empiricism and rationalism. \n\n\n\nThis critique was not only coming from staunch secularists alone, but also from Christian reformists. Yet, even the most secular thinkers agreed that faith was important to keep societies from spiralling into spiritual anxiety and chaos. Rousseau’s idea of civil religion, therefore, became increasingly influential across the 19th and 20th centuries. Concepts ","url":"https://www.dawn.com/news/1944992/smokers-corner-when-secularism-becomes-sacred","image":"https://i.dawn.com/large/2025/09/68d7fa73e34d9.jpg","video":null,"publish_date":"2025-09-27 23:21:08","author":"Nadeem F. Paracha","authors":["Nadeem F. Paracha"],"language":"en","source_country":"pk","sentiment":0.287},{"id":364079762,"title":"Europe resist US fightback bid to take control of Ryder Cup","text":"FARMINGDALE: Europe extended their commanding lead over the United States in the Ryder Cup to 8.5 to 3.5 after recovering from a shaky start to win the morning foursomes session 3-1 at Bethpage Black on Saturday.\n\nThe visitors turned down the volume on the home fans on Long Island as they became the first team to win each of the first three sessions of a Ryder Cup on foreign soil.\n\nEngland’s Tommy Fleetwood and Northern Irishman Rory McIlroy outclassed Collin Morikawa and Harris English 3&2 to get Europe’s first point, as the duo dubbed “Fleetwood Mac” improved their career foursomes record to 4-0-0.\n\nSpaniard Jon Rahm made a sensational chip in from an awkward position for birdie on the eighth hole to move ahead alongside England’s Tyrrell Hatton en route to a 3&2 win over Xander Schauffele and Patrick Cantlay. The pair extended their unblemished career record to 4-0-0 in foursomes.\n\nUS fan favourite Bryson DeChambeau teed off first for the Americans again and, alongside New Yorker Cameron Young, helped the home team avoid a shutout as they beat Matt Fitzpatrick and Ludvig Aberg 4&2.\n\nIt was sweet redemption for DeChambeau, who failed to win a point on Friday.\n\nAnother surprise flop on the opening day, world number one Scottie Scheffler, was unable to turn his fortunes around alongside Russell Henley.\n\nHe lost his third straight match, against Scotland’s Robert MacIntyre and Norwegian Viktor Hovland, by one shot, as the latter safeguarded the win with a phenomenal putt from the fringes of the green on the 17th hole.\n\nThe home team historically have a big advantage in the biennial matchplay competition but the holders got the hot start to lead 5.5 to 2.5 on Friday, spoiling US President Donald Trump’s visit to the Long Island venue.\n\nPublished in Dawn, September 28th, 2025","summary":"FARMINGDALE: Europe extended their commanding lead over the United States in the Ryder Cup to 8.5 to 3.5 after recovering from a shaky start to win the morning foursomes session 3-1 at Bethpage Black on Saturday.\n\n\n\nThe visitors turned down the volume on the home fans on Long Island as they became the first team to win each of the first three sessions of a Ryder Cup on foreign soil.\n\n\n\nEngland’s Tommy Fleetwood and Northern Irishman Rory McIlroy outclassed Collin Morikawa and Harris English 3&amp;2 to get Europe’s first point, as the duo dubbed  “Fleetwood Mac” improved their career foursomes record to 4-0-0.\n\n\n\nSpaniard Jon Rahm made a sensational chip in from an awkward position for birdie on the eighth hole to move ahead alongside England’s Tyrrell Hatton en route to a 3&amp;2 win over Xander Schauffele and Patrick Cantlay. The pair extended their unblemished career record to 4-0-0 in foursomes.\n\n\n\nUS fan favourite Bryson DeChambeau teed off first for the Americans again and, alongside New Yorker Cameron Y","url":"https://www.dawn.com/news/1945086/europe-resist-us-fightback-bid-to-take-control-of-ryder-cup","image":"https://i.dawn.com/large/2025/09/68d86b73a1eed.gif","video":null,"publish_date":"2025-09-27 23:20:25","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.15},{"id":364079732,"title":"President summons NA, Senate sessions next week","text":"ISLAMABAD: Presid-ent Asif Ali Zardari has summoned sessions of the National Assembly and Senate next week, where the government is expected to brief legislators on Prime Min-ister Shehbaz Sharif and Field Marshal Syed Asim Munir’s recent visit to the United States and the newly signed defence agreement with Saudi Arabia. \n\nAccording to a notification, in exercise of powers conferred by clause (1) of Article 54 of the Constitution, the president has summoned the National Assem-bly to meet at the Parliament Ho--u---se on Sept 29 (Monday) at 5pm. \n\nThe upcoming sitting will be a regular session; earlier, a session had been called to discuss issues related to floods. \n\nIt is worth mentioning that PM Shehbaz addressed the 80th session of the United Nations General Assembly during his visit to the United States. On the occasion, he, along with Field Marshal Asim Munir, held meetings with US President Donald Trump and other key figures. \n\nThese meetings are being closely analysed in India, where there is a debate about the potential benefits for Pakistan and possible implications for India. Legislators are expected to be taken into confidence about the visit and the discussions held in the US. \n\nSimilarly, lawmakers may be briefed about the recently sig-n--ed defence agreement between Pakistan and Saudi Arabia, which has drawn international attention. \n\nMeanwhile, National Assem-bly Speaker Sardar Ayaz Sadiq has convened a meeting of parliamentary leaders at the Par-li-ament House on Monday at 4pm to discuss and finalise the agen--da for the NA session. All parliamentary leaders have been notified about the meeting, which will be chaired by the speaker.\n\nIn another development, exercising his powers under clause (1) of Article 54 of the Constitution, President Zardari has summoned the Senate to meet at the Parliament House Sept 30 (Tuesday) at 4pm. \n\nOn the other hand, the main opposition party, Pakistan Tehreek-i-Insaf, has already announced a boycott of the parliamentary sessions and is therefore unlikely to attend. \n\nPTI leader Asad Qaiser told Dawn his party would not atte--nd the meeting of parlia-men-t-a--ry parties called by the NA spe-a-ker. He said the party would deliberate on attending the NA session only if it was confirmed that there would be a debate on the US visit and agreement with the Saudi Arabia. \n\n“At the moment we have decided to hold session outside the assembly hall because we are not allowed to speak and a person who has nothing to do with parliament expunging our speeches ,” he said.\n\nPublished in Dawn, September 28th, 2025","summary":"ISLAMABAD: Presid­ent Asif Ali Zardari has summoned sessions of the National Assembly and Senate next week, where the government is expected to brief legislators on Prime Min­ister Shehbaz Sharif and Field Marshal Syed Asim Munir’s recent visit to the United States and the newly signed defence agreement with Saudi Arabia. \n\n\n\nAccording to a notification, in exercise of powers conferred by clause (1) of Article 54 of the Constitution, the president has summoned the National Assem­bly to meet at the Parliament Ho­­u­­­se on Sept 29 (Monday) at 5pm. \n\n\n\nThe upcoming sitting will be a regular session; earlier, a session had been called to discuss issues related to floods. \n\n\n\nIt is worth mentioning that PM Shehbaz addressed the 80th session of the United Nations General Assembly during his visit to the United States. On the occasion, he, along with Field Marshal Asim Munir, held meetings with US President Donald Trump and other key figures. \n\n\n\nThese meetings are being closely analysed in India, where there is a ","url":"https://www.dawn.com/news/1945115/president-summons-na-senate-sessions-next-week","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-09-27 23:20:17","author":"Ikram Junaidi","authors":["Ikram Junaidi"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.34},{"id":364079724,"title":"PM Shehbaz arrives in London after US visit","text":"NEW YORK: Prime Minister Shehbaz Sharif reached London after concluding a week-long trip to the United States, where he headed a delegation to the 80th session of the UN General Assembly and met US President Donald Trump, describing their discussion as “very encouraging”. \n\nThe formal bilateral interaction between the two leaders was held at the Oval Office and was closed to the press. According to a statement issued from Pakistan, the leaders discussed regional security and cooperation on counter-terrorism, among other matters. \n\n Calls Trump talks ‘very encouraging’\n\nDuring an interaction with the media in New Jersey, aired on Saturday, the prime minister said the US was ready to share “techniques” with Pakistan in the areas of artificial intelligence, information technology and agriculture. He added that the US was also open to investment opportunities in the country. \n\nAt the airport, the PM along with the foreign minister and others was seen off by UN and US ambassados. \n\nPublished in Dawn, September 28th, 2025","summary":"NEW YORK: Prime Minister Shehbaz Sharif reached London after concluding a week-long trip to the United States, where he headed a delegation to the 80th session of the UN General Assembly and met US President Donald Trump, describing their discussion as “very encouraging”. \n\n\n\nThe formal bilateral interaction between the two leaders was held at the Oval Office and was closed to the press. According to a statement issued from Pakistan, the leaders discussed regional security and cooperation on counter-terrorism, among other matters. \n\n\n\n\n  Calls Trump talks ‘very encouraging’\n\n\n\n\nDuring an interaction with the media in New Jersey, aired on Saturday, the prime minister said the US was ready to share “techniques” with Pakistan in the areas of artificial intelligence, information technology and agriculture. He added that the US was also open to investment opportunities in the country. \n\n\n\nAt the airport, the PM along with the foreign minister and others was seen off by UN and US ambassados. \n\n\n\nPublished in Dawn, ","url":"https://www.dawn.com/news/1945116/pm-shehbaz-arrives-in-london-after-us-visit","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-09-27 23:20:17","author":"APP","authors":["APP"],"language":"en","source_country":"pk","sentiment":0.248},{"id":364078656,"title":"No word on Donald Trump's Israel-Gaza ceasefire plan, says Hamas","text":"Israeli strikes and gunfire have killed at least 59 people across Gaza in the past day, according to health officials.\n\nIt comes a day after US President Donald Trump told reporters on Friday, local time, \"it's looking like we have a deal on Gaza\".\n\nHe did not give details, but is due to meet Israeli Prime Minister Benjamin Netanyahu on Monday.\n\nMr Trump also said talks on Gaza with Middle Eastern nations were intense and would continue as long as required.\n\nHis special envoy, Steve Witkoff, said the US president had presented proposals to the leaders of multiple Muslim-majority countries this week that included a 21-point Middle East peace plan.\n\nMr Trump told reporters he believed the US was close to achieving a deal that \"will get the hostages back\" and \"end the war\".\n\nIn Gaza, meanwhile, the fighting continued.\n\nMr Netanyahu is opposed to ending the war until Hamas is destroyed.\n\nHamas said it had not seen Mr Trump's ceasefire plan.\n\nThe comments came after Israeli newspaper Haaretz cited sources saying Hamas had agreed in principle to release all the Israeli hostages it holds in return for hundreds of Palestinian prisoners and the gradual withdrawal of Israeli troops under Mr Trump's plan.\n\nAlso included in the proposal were the end of Hamas rule in Gaza, and Israel agreeing not to annex the territory and drive out Palestinians living there, Haaretz reported.\n\n\"Hamas has not been presented with any plan,\" a Hamas official, who asked not to be named, told Reuters.\n\nIsrael expands Gaza assault\n\nAmong the 59 people killed on Saturday were those hit by two strikes in the Nuseirat refugee camp — nine from the same family in a house and, later, 15 in the same camp, including women and children, according to staff at Al Awda Hospital, where the bodies were brought.\n\nFive others were killed when a strike hit a tent for the displaced, according to Nasser Hospital, which received the dead.\n\nStrikes also demolished a house in Gaza City's Tufah neighbourhood, killing at least 11 people, more than half of them women and children, according to Al-Ahly Hospital, where the bodies were brought.\n\nFour other people were killed when an air strike hit their homes in the Shati refugee camp, according to Shifa Hospital.\n\nSix other Palestinians were killed by Israeli gunfire while seeking aid in southern and central Gaza, according to the Nasser and Al Awda hospitals.\n\nIsrael's army said it was not aware of anyone being killed by gunfire on Saturday in southern Gaza, nor of a strike in the Nuseirat area during the time and at the location provided by the hospital.\n\nThe director of Shifa Hospital in Gaza City told The Associated Press that medical teams there were concerned about Israeli \"tanks approaching the vicinity of the hospital,\" restricting access to the facility where 159 patients are being treated.\n\n\"The bombardment has not stopped for a single moment,\" Dr Mohamed Abu Selmiya said.\n\nHe added that 14 premature babies were treated in incubators in Helou Hospital, though the head of neonatal intensive care there, Nasser Bulbul, has said that the facility's main gate was closed because of drones flying over the building.\n\nMore than 300,000 people have fled Gaza City, which is experiencing famine, but up to 700,000 remain, many because they can't afford to relocate.\n\nPressure grows on Netanyahu to end the war\n\nThe attacks came after a defiant Mr Netanyahu told fellow world leaders at the UN General Assembly on Friday that his nation \"must finish the job\" against Hamas in Gaza. Forty-eight hostages are still held captive there, around 20 of them believed by Israel to be alive.\n\nMr Netanyahu's words began after dozens of delegates from multiple nations walked out of the UN General Assembly Hall en masse on Friday morning.\n\n\"You were like the last of the lepers. Netanyahu, we promise you that if you don't bring a comprehensive agreement and end the war, you will forever be a leper,\" said Itzik Horn, the father of Eitan Horn, one of the hostages held in Gaza since the Hamas attack that started the war. He was referencing the UN speech and Israel's isolation.\n\n\"My son Eitan sleeps sick and starving on the floor of a tunnel in Gaza or, worse, is used as a human shield against IDF fighters. What will you save him with?\" Mr Horn added Saturday evening.\n\nInternational pressure on Israel to end the war is increasing, with a growing list of countries deciding recently to recognise Palestinian statehood, which Israel rejects.\n\nCountries have been lobbying Mr Trump to press Israel for a ceasefire.\n\nHospitals are short on supplies and targeted by air strikes\n\nHospitals and health clinics in Gaza City are on the brink of collapse. Nearly two weeks into the latest offensive, two clinics have been destroyed by air strikes, two hospitals shut down after being damaged, and others are struggling with medicine, equipment, food and fuel in short supply, according to the Gaza Health Ministry.\n\nOn Friday, aid group Doctors Without Borders said it was forced to suspend activities in Gaza City. The group said Israeli tanks were less than a kilometre from its facilities, creating an \"unacceptable level of risk\" for its staff.\n\nIsrael has also halted aid deliveries through its crossing into northern Gaza since September 12, and has increasingly rejected UN requests to bring supplies from southern Gaza into the north, the UN Office for the Coordination of Humanitarian Affairs said.\n\nCOGAT, the Israeli military agency in charge of transferring aid to the territory, said on Saturday that humanitarian aid to the northern Gaza Strip \"continues on an ongoing basis,\" and that it has increased significantly over recent weeks at a crossing into central Gaza.\n\nIsrael's campaign in Gaza has killed more than 65,900 people and wounded more than 167,000 others, Gaza's Health Ministry said. It did not distinguish between civilians and combatants, but said women and children make up around half the fatalities. The ministry is part of the Hamas-run government, but UN agencies and many independent experts consider its figures to be the most reliable estimate of wartime casualties.\n\nIsrael's campaign was triggered when Hamas-led militants stormed into Israel on October 7, 2023, killing around 1,200 people and taking 251 hostage.","summary":"Israeli strikes and gunfire have killed at least 59 people across Gaza in the past day, according to health officials.","url":"https://www.abc.net.au/news/2025-09-28/no-word-on-donald-trump-s-israel-gaza-ceasefire-plan-says-hamas/105825646","image":"https://live-production.wcms.abc-cdn.net.au/eef323eaf8bf112b74b3c290cf73ad9c?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=460&width=862&height=485","video":null,"publish_date":"2025-09-27 23:18:44","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.264},{"id":364083690,"title":"Netanyahus wined and dined in New York","text":"Israeli Prime Minister Benjamin Netanyahu and his wife, Sara, attended a dinner in their honor on Saturday night hosted by Jewish-American businessman Simon Falic at the upscale kosher steakhouse Reserve Cut in Manhattan. Falic, a longtime associate of the Netanyahus who often hosts them at his home in Jerusalem, reportedly reserved the entire restaurant for the event, which was closed to the public. In addition to the prime minister and his wife, several Jewish donors from Miami were also invited. Netanyahu’s son Yair was seen leaving the hotel with his Shin Bet security escort. Sources familiar with the event said Yair Netanyahu was involved in various decisions surrounding the trip, including the cancellation of a press briefing at the United Nations that was scheduled to follow the prime minister’s address to the General Assembly. Journalists had been waiting, but the briefing was called off. Yair also reportedly was heard saying that “Channel 14 should be the only one spoken to,” referring to a right-leaning Israeli TV station. Alongside the canceled briefing, supporters who had cheered Netanyahu’s speech from the gallery were left waiting in vain to shake his hand. Later, the Prime Minister’s Office announced that a press briefing would be held after Netanyahu’s upcoming meeting with U.S. President Donald Trump on Monday. However, the office also declined to allow journalists to accompany him on the Wing of Zion government jet from New York to Washington. This casts doubt on previous claims that reporters were excluded from the flight from Israel to the U.S. due to an extended flight path designed to avoid countries where Netanyahu might risk arrest in an emergency landing—an explanation that would not apply within the United States. The Prime Minister’s Office did not respond to a request for comment. Exactly one year ago, the Netanyahus also attended a festive dinner in New York at the Regency Hotel, where they are staying again this year. That event was also hosted by Falic’s family. At the time, reports indicated their return to Israel was delayed despite the execution of a daring operation to assassinate then-Hezbollah Secretary-General Hassan Nasrallah. Netanyahu’s delegation did not leave for JFK Airport until roughly 10 hours after the strike in Beirut’s Dahiyeh neighborhood.","summary":"Jewish businessman Simon Falic booked a luxury restaurant for the prime minister and his wife, along with other donors who were invited; Sources familiar with the details said that their son, Yair, pushed for the cancellation of the PM's press briefing after his speech at the UN; Journalists again barred from flying on PM's Wing of Zion plane to DC","url":"https://www.ynetnews.com/article/h1jpiyunge","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/09/27/B1o5116H2xe/B1o5116H2xe_243_301_980_551_0_large.jpg","video":null,"publish_date":"2025-09-27 23:12:25","author":"Itamar Eichner","authors":["Itamar Eichner"],"language":"en","category":"politics","source_country":"il","sentiment":-0.303},{"id":364077808,"title":"Russia tells West any aggression will be met with ‘decisive response’","text":"Russian Foreign Minister Sergey Lavrov told the West on Saturday that any aggression against Moscow would face a “decisive response”, warning against attempts to down aircraft in Russian airspace and accusing Germany of militaristic rhetoric.\nAs Russia’s war rages in Ukraine, tensions have mounted along Nato’s eastern flank in recent weeks as Estonia said Moscow sent three fighter aircraft into its airspace and Nato warplanes shot down Russian drones over Poland.\n“Any aggression against my country will be met with a decisive response. There should be no doubt about this among those in Nato and the EU who … are telling their voters that war with Russia is inevitable,” he told the United Nations General Assembly.\nThe spate of airspace incursions linked to Russia has unnerved countries in Eastern Europe where Russia is seen as the biggest threat since the end of the Cold War. Hopes have dimmed of any imminent end to Moscow’s war in Ukraine.\nUS President Donald Trump said this week that he endorsed the idea of shooting down Russian planes that violate Nato airspace, part of a rhetorical shift that saw him mock Russia’s military performance in Ukraine and call it a paper tiger.\n\nLavrov brushed off Trump’s most recent remarks during a press conference that followed his General Assembly speech, but issued a warning about any moves against aircraft inside Russia.\n“If there are attempts to down any flying object, any object … in our airspace, then I think people will very much regret undertaking such an egregious violation of our territorial integrity and sovereignty,” he said.\nHe said that only the “politically blind” would expect Ukraine to one day return to the borders it had before Russia invaded in February 2022, an indirect response to Trump’s assertion that Kyiv could retake all its occupied land from Russia.\nLavrov also singled out German Chancellor Friedrich Merz, referring to what he said was “militaristic rhetoric” and said Moscow was alarmed by remarks by politicians in EU and Nato capitals of a looming World War III as a “likely scenario”.\nDespite taking aim at Nato and the European Union, Lavrov made clear Moscow remained hopeful of “frank dialogue” with the United States under Trump despite the US president’s recent shifting stance.\nThe US and Russia, he said, will hold a third round of talks in the coming months aimed at improving each other’s embassy operations, which have been severely curtailed by a decade of tit-for-tat diplomatic expulsions and other curbs.\nLavrov met US Secretary of State Marco Rubio on Wednesday on the sidelines of the annual gathering of world leaders at the UN General Assembly.\nLavrov said he did not see economic relations between Russia and India as under threat, as Trump has placed tariffs on products from India, calling on it – and China – to stop purchasing Russian oil.","summary":"Russian Foreign Minister Sergey Lavrov told the West on Saturday that any aggression against Moscow would face a “decisive response”, warning against attempts to down aircraft in Russian airspace and accusing Germany of militaristic rhetoric.\nAs Russia’s war rages in Ukraine, tensions have mounted along Nato’s eastern flank in recent weeks as Estonia said Moscow sent three fighter aircraft into its airspace and Nato warplanes shot down Russian drones over Poland.\n“Any aggression against my...","url":"https://www.scmp.com/news/world/russia-central-asia/article/3327122/russia-tells-west-any-aggression-will-be-met-decisive-response","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/09/28/82e81c1b-a620-42a6-b92b-f608034aa712_2786de55.jpg","video":null,"publish_date":"2025-09-27 23:05:46","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.078},{"id":364074694,"title":"Anthony Albanese downplays concerns ahead of White House meet with Donald Trump","text":"Anthony Albanese has played down concerns chasmic differences between himself and Donald Trump will make for an uncomfortable meeting with the US President next month.\n\nThe Prime Minister will return to the US in later October for a face-to-face with Mr Trump at the White House.\n\nThe highly anticipated meet will take place nearly a year after Mr Trump’s historic presidential come back, with Mr Albanese under fire for not having secured a meeting earlier.\n\nAmid criticism from the Coalition he has jeopardised the Australia-US relationship by not visiting sooner, Mr Albanese was asked on Sunday (AEST) if he had any “trepidation” about the meeting.\n\n“No, not at all,” he told Sky News.\n\n“The discussions we’ve had have been very positive and constructive, and Australia and United States are great friends.\n\n“We pull our weight and … it’s not a relationship of unequals.”\n\nHe went on to say the US “is obviously the largest economy in the world, the most powerful country in the world, but Australia always we punch way above our weight”.\n\nHe also said he has “had a number of discussions with people in the administration”, including Treasury Secretary Scott Bessent.\n\nMr Bessent is key to rolling out Mr Trump’s “America First” vision.\n\nThe two leaders briefly met earlier this week at a reception Mr Trump hosted in New York.\n\nMr Albanese even snapped a selfie with him.\n\nMore to come.","summary":"Anthony Albanese has been asked if he has any “trepidation” ahead of his long awaited face to face meeting with Donald Trump.","url":"https://thewest.com.au/news/anthony-albanese-downplays-concerns-ahead-of-white-house-meet-with-donald-trump-c-20166008","image":"https://images.thewest.com.au/publication/C-20166008/ca65616daa08bcb8d2ffc16c014f9b173c583868-16x9-x0y15w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-09-27 23:05:13","author":"Joseph Olbrycht-Palmer,President Donald Trump,South Korea says it is unable to pay $US350 billion upfront to the United States under a tariff deal,which would cut US tariffs on South Korean goods to 15 per cent from the 25 per cent imposed origina,who said the country is now seeking an alternative solution. The two allies agreed on a deal in July","authors":["Joseph Olbrycht-Palmer","President Donald Trump","South Korea says it is unable to pay $US350 billion upfront to the United States under a tariff deal","which would cut US tariffs on South Korean goods to 15 per cent from the 25 per cent imposed origina","who said the country is now seeking an alternative solution. The two allies agreed on a deal in July"],"language":"en","category":"politics","source_country":"au","sentiment":0.305},{"id":364077682,"title":"Buzzy €350k Galtees sanctuary a retreat  from a world of woes","text":"HALF a century before the current wave of US citizens fleeing the US for quieter lives amid the whirling Trump tornados, a couple of American journalists, Donald and Mary Grant, wrote an account of their move to a simpler, bucolic life in 1970s south-west Ireland in a book called White Goats and Black Bees.\n\nWell, 50 years on, here’s a custom-made 2025 retreat for anyone considering same, a safe and steadying sanctuary.\n\nHeck, it’s even got bees and hives, pygmy goats, and hens roaming the unsullied land, with a charmer of a restored cottage with architectural adroit add-on. It’s on 3.5 acres, near Limerick’s Ballylanders and North Cork’s Mitchelstown, with the gentle Galtees rolling down to meet and greet any and all arrivals.\n\nHaving been a rustic hideaway for a woman with Mitchelstown family heritage, this ‘pretty in pale pink’ compact heritage stone cottage with half door, inglenook fireplace, and simple interior has been extended to the side: it’s joined now at a respectful distance with a linked larch and standing seam flat/low pitch roofed side wing with clerestory, corner, and glazed wall of windows, all ready for new occupants and caretakers now; it is listed with Tipperary agent Natasha Quirke of Clonmel-based PH Quirke & Co with a €350,000 AMV.\n\nIt’s all aesthetically done: what’s old is old and what’s new is new, with a ground floor bedroom plus a lofted bedroom via a ladder (so traditional) in the original pink washed vernacular cottage which has a stove in the vast chimney ope; underfloor heating, with free-standing old and painted pine furniture and workmanlike kitchen with cherry red range cooker.\n\nThe modern add-on with large floor tiles is to the side, down a few steps, and has a utility with garden access to banks of ferns, a bathroom with shower, long bath, and decorated ceramic hand basin.\n\nThe main bedroom is set within a timber-planked cocoon by a bright linking living area facing mountain and garden views through a long wall of glazing, a complete contrast to the sash originals in the cottage section.\n\nThere’s over 1,100 sq ft now, with a respectable C3 BER, and the three-plus acres ringed by old pines is private, in the midst of fields of pasture, approached by a long drive/avenue with natural hedgerows for foragers, whilst the ground is grazed by a few goats, and buzzed about by busy bees.\n\nNearby is Ballylanders for shops, cafes, and services, Mitchelstown is only 10km to the south, and the wider area is replete with walks, hikes, and cycle trails.\n\nVERDICT: Carefully curated ‘old’ meets easy living ‘new’ at this extended Galtees refuge from the woes of the world.","summary":"Rustic lifestyle,  with no  hardships,  at this cleverly extended period stone cottage","url":"https://www.irishexaminer.com/property/residential/arid-41712452.html","image":"https://www.irishexaminer.com/cms_media/module_img/9593/4796597_3_seoimage1x1_Curraturk1_1_.jpg","video":null,"publish_date":"2025-09-27 23:00:00","author":"Irishexaminer.com,Property Editor Tommy Barker Reports","authors":["Irishexaminer.com","Property Editor Tommy Barker Reports"],"language":"en","source_country":"ie","sentiment":0.658},{"id":364073302,"title":"Restored US visas nothing special to celebrate","text":"The President of IMANI Africa, Franklin Cudjoe, has criticised the government for celebrating the restoration of five-year multiple-entry US visas, arguing that Ghana could have pushed for more substantial trade concessions instead.\n\nIn a post on his official Facebook page, Mr. Cudjoe took issue with the Minister of Foreign Affairs, Samuel Okudzeto Ablakwa, for presenting the development as a major diplomatic achievement without using the opportunity to negotiate for reductions in US tariffs on Ghanaian exports.\n\n“Frankly, my brother Honourable Okudzeto, I wish this had not been posted and celebrated. We had this already. Yes, I know the Trump administration threatened visa restrictions, but we could have negotiated for more, perhaps a good reduction of the 15% tariff imposed on Ghana,” he said.\n\nHe further argued that Ghana could have taken advantage of President Mahama’s bold speech on Gaza at the UN General Assembly to secure better trade or economic deals, pointing out that US President Donald Trump was more inclined toward negotiations than symbolic gestures.\n\n“Knowing that Trump is a deal maker on almost everything and given our President’s daring, audaciously great speech on Gaza, we should not be settling for this visa pittance,” he added.\n\nMr. Cudjoe also linked the visa restoration to Ghana’s controversial memorandum of understanding (MoU) with the United States to accept West African deportees, suggesting the move may have come at a hidden cost.\n\n“Is this all we got from taking in our deportee West African neighbours? Anyways,” he quipped.\n\nHis comments came after Foreign Minister Ablakwa announced that Washington had lifted restrictions imposed in July, which had limited Ghanaian travellers to three-month single-entry visas.\n\nThe US government had introduced those restrictions earlier in the year, citing persistent cases of overstays, particularly among Ghanaian students.","summary":"The President of IMANI Africa, Franklin Cudjoe, has criticised the government for celebrating the restoration of five-year multiple-entry US visas, arguing that Ghana could have pushed for more substantial trade concessions instead. In a post on his official Facebook page, Mr. Cudjoe took issue with the Minister of Foreign Affairs, Samuel Okudzeto Ablakwa, for presenting [&#8230;]\n\n\nThe post Restored US visas nothing special to celebrate appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/09/27/restored-us-visas-nothing-special-to-celebrate/","image":"https://www.ghanamma.com/wp-content/uploads/2025/08/VL-970x250-1.png","video":null,"publish_date":"2025-09-27 22:59:19","author":"Ghana News","authors":["Ghana News"],"language":"en","source_country":"gh","sentiment":-0.088},{"id":364083692,"title":"Trump sends troops to Portland, ICE facilities 'under siege from attack by Antifa, and other domestic terrorists'","text":"U.S. President Donald Trump on Saturday said he was directing the U.S. military to deploy to Portland, Oregon and to protect federal immigration facilities against \"domestic terrorists,\" saying he was authorizing them to use \"full force, if necessary.\" Ordering the latest crackdown on a Democrat-led city, Trump said in a social media post that he was directing Defense Secretary Pete Hegseth \"to provide all necessary Troops to protect War ravaged Portland, and any of our ICE Facilities under siege from attack by Antifa, and other domestic terrorists.\" Portland Mayor Keith Wilson, responding to Trump's order, said: \"The number of necessary troops is zero, in Portland and any other American city. The president will not find lawlessness or violence here unless he plans to perpetrate it.\" In a press conference on Friday, Wilson and other local leaders urged calm in the face of an apparent influx of federal officers that the mayor said did not come at the request of the city. \"This may be a show of force, but that's all it is. It's just a big show,\" he said. U.S. Senator Ron Wyden, a Democrat from Oregon, wrote on X that Trump \"may be replaying the 2020 playbook and surging into Portland with the goal of provoking conflict and violence.\" In 2020, protests erupted in downtown Portland, the Pacific Northwest enclave with a reputation as a liberal city, following the killing in Minneapolis of George Floyd. The protests dragged on for months and some civic leaders at the time said they were spurred rather than quelled by Trump’s deployment of federal troops. Oregon Governor Tina Kotek, a Democrat, said her office was asking the White House for more information. \"There is no national security threat in Portland. Our communities are safe and calm,\" Kotek said on X. Growing tensions in major cities It was unclear whether Trump's warning that U.S. troops could use \"full force\" on the streets of Portland meant he was somehow authorizing lethal force and, if so, under what conditions. U.S. troops are able to use force in self-defense on domestic U.S. deployments. The Pentagon did not offer any clarification about whether Trump was deploying National Guard, active duty troops or perhaps a mix of the two, as was the case in Los Angeles earlier this year. \"We stand ready to mobilize U.S. military personnel in support of DHS operations in Portland at the President’s direction. The Department will provide information and updates as they become available,\" said Sean Parnell, a Pentagon spokesperson. Asked about the Portland decision on Saturday, Department of Homeland Security spokesperson Tricia McLaughlin said ICE agents needed to be protected amid protests against immigration raids. \"We're not going to put up with it. This administration is not playing games,\" she said in an interview on Fox News. There have been growing tensions in major U.S. cities over Trump's aggressive immigration crackdown days after a shooting targeting an Immigration and Customs Enforcement facility in Dallas left one detainee dead and two others seriously wounded. Trump focus on crime, 'Antifa' On Thursday, Trump told reporters that \"crazy people\" were trying to burn buildings in Portland. \"They're professional agitators and anarchists,\" he said, without providing evidence. Trump last week signed an executive order that declares the anti-fascist antifa movement a domestic \"terrorist organization\" as part of a crackdown on what he claims is left-wing sponsored political violence. According to U.S. law enforcement, there has never been a terrorist incident in the United States connected to antifa. Trump first sought to designate the movement as a domestic terror organization during the nationwide George Floyd protests. The most notorious episode involving the movement occurred in Portland in August 2020, when Michael Reinoehl, a self-identified antifa supporter, shot and killed Aaron “Jay” Danielson, a member of the far-right group Patriot Prayer. Reinoehl was killed by federal and local law enforcement officers during an attempt to arrest him. Trump has made crime a major focus of his administration even as violent crime rates have fallen in many U.S. cities. His crackdown on municipalities led by Democrats including Los Angeles and Washington has spurred legal challenges and protests. The Trump administration's goal of deporting record numbers of immigrants living in the U.S. illegally has framed the push around criminals, but it has arrested many people without criminal records. Residents in New York, Chicago, Washington and other Democrat-leaning metro areas have pushed back in recent months. In the Chicago suburb of Broadview on Friday, ICE used tear gas, less-lethal rounds and pepper balls to quell protests outside an immigration detention center. Protests have also occurred outside other detention centers around the country, including in Portland. The 'success' of immigration policy, and the criticism The Department of Homeland Security revealed this week that since the start of Trump's second term as president - and his actions to fulfill his promise to deport hundreds of thousands of illegal immigrants - more than 400,000 have already been deported, while 1.6 million illegal residents have \"voluntarily left.\" At the same time, the department was criticized and even ridiculed last week after its official X account posted a video that was humorously edited to the original opening theme song of the Japanese animated series \"Pokemon,\" which incorporated footage of Immigration and Customs Enforcement activities. The video, which is a play on words on the popular franchise's catchphrase, \"Gotta catch 'em all!,\" opens with a house door being blown open and armed agents entering. Alongside the character of the series' protagonist Ash from the opening of the original series, arrests of illegal immigrants are documented, alongside heroic footage of ICE agents, with the caption \"Department of Homeland Security\" appearing instead of the series title. The video concluded with a series of \"Pokemon cards\" - depicting arrested illegal immigrants, instead of cartoon pocket monsters. Each card listed the crimes committed by the illegals, including \"Carlos Mendoza-Martinez - a Mexican gang member convicted of manslaughter,\" \"Hussain Sharifi - sentenced to 10 years in prison for aggravated rape of a child,\" and \"Herman Vazquez-Padilla - convicted of human trafficking.\" Nintendo, the franchise owner, was forced to issue a clarification stating that \"we are aware of the video published by the Department of Homeland Security, which includes imagery and language associated with our brand. The company was not involved in the creation or distribution of the video, and no permission was given to use our intellectual property.\" Fans of the series have called on Nintendo to sue the Trump administration, but Don McGowan, a former executive at the company responsible for the brand, told the news website IGN that \"I don't think they'll do anything, for a number of reasons,\" including the desire to avoid bad publicity. However, McGowan noted that \"most of Nintendo's executives in the US work here with green cards - even if I were still part of the company, I wouldn't touch it. The story will die down in a matter of days, and they'll be happy to let it happen.\"","summary":"Following wave of violent protests against immigration agents, US president announces he is deploying  troops to Oregon, 'and I authorize the use of full force, if necessary';  Along with criticism of the administration's heavy-handed approach to illegal immigrants, it was revealed this week that about 2 million have already been deported or left voluntarily","url":"https://www.ynetnews.com/article/h10yzy83ee","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/09/26/r111QOomN3eg/r111QOomN3eg_0_182_3000_1688_0_large.jpg","video":null,"publish_date":"2025-09-27 22:49:41","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":-0.344},{"id":364079148,"title":"Europe three points away from winning Ryder Cup outright after fiery day two","text":"Advertisement\n\nLeague of Ireland\n\nHorse Racing\n\nTV Listings\n\nGAA Fixtures\nThe Video Review\n\nSport meets news, current affairs, society & pop culture\n\nRugby Weekly Extra\n\nDive into all the news and analysis 3 times a week\n\nThe Football Family\n\nWeekly insights from the week’s big talking points\n\nAdvertisement\n\nMore Stories\n\nShane Lowry and Rory McIlroy celebrate.Alamy Stock Photo\n\nFreeRecord Lead\n\nEurope three points away from winning Ryder Cup outright after fiery day two\n\nIt was a day of high drama and tension, as Europe moved into a seven-point lead.\n\n11.34pm, 27 Sep 2025\n\nShare options\n\nEurope 11.5\n\n(After Saturday’s Fourballs)\n\nEUROPE PUT ONE hand on the Ryder Cup with a stunning performance on an ill-tempered second day of competition at Bethpage Black.\n\nThe defending champions won six of the eight points available on Saturday to open up a commanding 11.5-4.5 lead over the United States and move within three points of outright victory.\n\nIt was a day of high drama and tension, with players arguing and the action being paused at times due to the boorish behaviour of a raucous home crowd.\n\nYet Luke Donald’s side rose above the distractions to deliver a near knockout blow to the shellshocked hosts.\n\nEurope tightened their grip with a 3-1 victory in the morning Foursomes and for some time a Fourball clean sweep looked possible until the hosts clawed the second session back to 3-1.\n\nAdvertisement\n\nEmotions boiled over as Tommy Fleetwood and Justin Rose thrashed Bryson DeChambeau and Scottie Scheffler, while Rory McIlroy defied taunts to deliver another telling point.\n\nWorld number two McIlroy was heckled throughout the day and shouted at one fan to “shut the f*** up” as he prepared to take a shot during his morning foursomes win.\n\nHe remained a target in the afternoon and both he and partner Shane Lowry needed to pause on numerous occasions as comments were aimed at them as they addressed the ball in their match against Justin Thomas and Cameron Young.\n\nThomas appealed for calm on their behalf at times and extra police were also needed to keep order.\n\nDespite the frenzied atmosphere, the Irishmen pulled through to win a tense, tight encounter by two holes.\n\nUltimately a birdie two by McIlroy on the 14th proved crucial but it took some nerveless putting down the stretch to hang on to the lead before victory was secured on the last.\n\nTemperatures were also high as Rose and Fleetwood claimed a 3&2 win over world number one Scheffler – suffering a remarkable fourth defeat from four – and the fiery DeChambeau.\n\nRose was the key figure, winning four holes thanks to some clinical putting, but an argument broke out between Fleetwood and DeChambeau after the 15th was halved.\n\nThe incident was sparked by Rose asking DeChambeau’s caddie to move out of his eyeline as he putted and the pair needed to be separated as they walked to the next tee.\n\nYet there was no way back for the American pair and the match ended – with handshakes all round – after halving the 16th.\n\nIt was Fleetwood’s second win of the day, having successfully combined with McIlroy in the morning, and it looked like Jon Rahm could follow suit.\n\nThe Spaniard and Sepp Straka led by one after 16 against JJ Spaun and Xander Schauffele but late errors saw them surrender the last two holes to lose by one.\n\nYet while that took some gloss off the day for Europe, it was immediately countered by Tyrrell Hatton and Matt Fitzpatrick snatching victory on the 18th.\n\nThe final match of the day had been tame by comparison until exploding into life as Fitzpatrick played a brilliant bunker shot to within inches of final hole.\n\nHatton, summoned only at the last minute after Viktor Hovland pulled out with a neck injury, then pitched to a similar distance and the Europeans took a one-hole win.\n\nView 6 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Europe three points away from winning Ryder Cup outright after fiery day two”.\n\nRecipient's Email\n\nFeedback on “Europe three points away from winning Ryder Cup outright after fiery day two”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nRecord Lead\n\ninside the ropes\nLowry and McIlroy exhibit true greatness to win Ryder Cup epic in the Bethpage circus \n\nGavin Cooney\n\nreports from Bethpage Black, New York\n\n13 mins ago\n\nFreeFootball Association of Ireland\nSports Minister 'disappointed' he had to intervene for FAI to attend Oireachtas Committee\n\nIreland's Jude McAtamney earns big opportunity with New York Giants\n\n'Drained' Rory McIlroy defies the hecklers to keep Europe’s Ryder Cup bid on track\n\nFreeThriller\nAtletico thrash Liga leaders Real Madrid in gripping derby\n\nFreeLate Late Show\nTottenham rescued by Joao Palhinha’s stoppage-time equaliser against Wolves\n\nConnacht's Stuart Lancaster era opens with brilliant bonus-point win against Benetton\n\nAll Blacks hold off Wallabies to extend remarkable Eden Park record\n\nFreeUp and Running\nMunster off to winning start under new boss McMillan\n\nEurope stand tall after a day of drama, Trump antics, and grim crowd abuse \n\nGavin Cooney\n\nreports from Bethpage Black, New York\n\nbees buzzing\nAmorim under pressure as Brentford beat Man Utd\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe 42 supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online\n\nSign in or create\na free account\n\nTo continue reading create a free account\n\nOr sign into an existing account","summary":"It was a day of high drama and tension, as Europe moved into a seven-point lead.","url":"https://www.the42.ie/europe-usa-ryder-cup-6829431-Sep2025/","image":"https://img2.thejournal.ie/article/6829431/river/?height=400&version=6829461","video":null,"publish_date":"2025-09-27 22:34:05","author":null,"language":"en","category":"sports","source_country":"ie","sentiment":0.149},{"id":364069138,"title":"Russian FM Affirms Readiness to Hold Negotiations to Address Root Causes of Conflict with Ukraine","text":"New York, September 28 (QNA) - Russia is ready to hold negotiations to address the root causes of the conflict with Ukraine, said Russian Foreign Minister Sergey Lavrov on Saturday.\n\nLavrov stressed the importance of safeguarding Russia's security and vital interests and restoring the rights of the Russian people and Russian-speaking populations in Ukraine.\n\nSpeaking on behalf of his country during the general debate of the 80th session of UNGA, he stated that Russia is open to discussing security guarantees for Ukraine, provided such negotiations are based on reliable respect for Moscow's rights and interests.\n\nThe grave violations of the principle of equality in sovereignty among nations undermine belief in justice and engender crises and conflicts, Lavrov stressed.\n\nHe called for upholding this principle fully to ensure a fair status of all nations in the international system, regardless of the military might, population size, or economic status of those nations.\n\nLavrov affirmed that the West has flagrantly violated the principle of refraining from the use or threat of force multiple times, thereby undermining stability across the Middle East.\n\nAt the same time, the unlawful use of force by the Israeli entity against the Palestinians, alongside aggressive measures targeting Iran, Qatar, Yemen, Lebanon, Syria, and Iraq, poses a real threat of igniting the entire region, he underlined.\n\nLavrov further indicated that the strikes on Iranian facilities that were under the safeguards of the International Atomic Energy Agency (IAEA), along with the strike on the Qatari capital Doha at a time when negotiations with the Hamas Movement were underway there with the engagement of US mediators, also deserve condemnation.\n\nThere is no apologetics for killing Palestinian civilians or collective punishment in the Gaza enclave, where children are coming under bombardment and grappling with starvation, hospitals and schools are decimated, and hundreds of thousands of residents are fleeing the enclave, Lavrov stressed.\n\nWith regard to the Russia-US relationship, Lavrov underlined that Russia's hopes are pinned on the continuation of dialogue between Moscow and Washington, particularly following the Alaska summit between Presidents Vladimir Putin and Donald Trump, in a bid to forge practical solutions to the Ukrainian crisis and cultivate actionable cooperation, far removed from rigid ideological posturing.\n\nRussia and the US shoulder a special responsibility toward the global situation and the imperative to avoid risks that could lead to a new war, he said.\n\nOn UN reform, Lavrov underscored that the global balance of power today is radically different from what it was 80 years ago.\n\nHe stressed the urgent need to broaden representation of Asia, Africa, and Latin America in the Security Council, and to operate with full transparency while safeguarding the interests of all member states, far from the West's attempts to impose its own rules-based order on international institutions. (QNA)","summary":"New York, September 28 (QNA) - Russia is ready to hold negotiations to address the root causes of the conflict with Ukraine, said Russian Foreign Minister Sergey Lavrov on Saturday.","url":"https://qna.org.qa/en/news/news-details?id=russian-fm-affirms-readiness-to-hold-negotiations-to-address-root-causes-of-conflict-with-ukraine&date=28/09/2025","image":"https://cdn.qna.org.qa/media/xlxjzmkr/qna_lavrof_fm0270902025.jpg?width=1200&height=900&v=1dc3008597650b0","video":null,"publish_date":"2025-09-27 22:29:50","author":null,"language":"en","source_country":"qa","sentiment":-0.044},{"id":364075196,"title":"Mikie Sherrill remains silent on issue of trans athletes in women's sports as Trump calls her out for it","text":"New Jersey Democrat candidate for governor Mikie Sherrill has not addressed her congressional voting record on bills related to transgender athletes in women's sports. President Donald Trump called out Sherrill for her stance on the issue in a Truth Social post on Thursday. \"Sherrill wants Open Borders (again!), men playing in Women’s Sports, Transgender for everyone, and all of the things that almost DESTROYED America,\" Trump wrote. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Fox News Digital has reached out to Sherrill's campaign multiple times for clarification on her stance on the issue of trans athletes in women's sports, but has not received a response. Sherrill has been the subject of criticism on social media for her congressional voting record on the issue. She voted against the Protection of Women and Girls in Sports Act, twice, when the bill was first proposed in 2023, and again this past February when it was re-introduced. Sherrill has also co-sponsored the Equality Act, but also co-sponsored the Transgender Bill of Rights, which more explicitly \"guarantees certain rights for transgender and nonbinary people with respect to public services and accommodations.\" Sherrill is a self-proclaimed \"advocate for women’s athletics.\" She previously proposed the Women in NCAA Sports Act in the U.S. House of Representatives alongside Rep. Maria Salazar D-Fla., and led a resolution to honor Billie Jean King with the Congressional Gold Medal. However, she has recently been the subject of criticism on social media for her congressional voting record on the issue of trans athletes in women's sports. Former University of Pennsylvania women's swimmer and women's sports activist Paula Scanlan, the first UPenn swimmer to speak up about the school's Lia Thomas controversy in 2022, called out Sherrill on X over the issue this week. The New Jersey GOP attacked Sherrill for this record directly in a campaign graphic last week. Sherrill's opponent, Republican Jack Ciattarelli, mentioned this issue for Sherrill in a post back in July. New Jersey is the original home state of well-known transgender track and field athlete Sadie Schreiner, who previously competed for Rochester Institute for Technology and went viral multiple times for posting videos sharing the athlete's first-hand experience as a biological male trans athlete competing against, and often dominating, females. Schreiner is from Hillsborough, according to the athlete's RIT Athletics page. Schreiner has filed a lawsuit against Princeton University for an alleged incident at a May 3 women's race. Schreiner's lawsuit claimed the athlete attempted to participate in the women's 200-meter sprint at the Larry Ellis Invitational as one of the 141 participants unattached to a university or club. The suit alleges officials told Schreiner the athlete could not participate 15 minutes before the race began. Schreiner alleged the university violated the New Jersey Law Against Discrimination, which designates \"gender identity or expression\" as a protected status. Schreiner has since filed a second lawsuit against SUNY Genesco for being banned from a women's race in March, per multiple reports. INSIDE GAVIN NEWSOM'S TRANSGENDER VOLLEYBALL CRISIS Back in January, a New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people who participated, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said transgender athletes should not be allowed to compete with women. Among 1,022 Republicans, that number was 94%. The 81 independents who were interviewed represented the group with the most reluctance to say transgender athletes shouldn't be allowed to compete. Just 64% said they were against it, while 26% refused to answer. Just 3% of the Democrats and 1% of the Republicans refused to answer. Nearly 70% of Americans say biological men should not be permitted to compete in women's sports, according to a Gallup poll last year. Additional data suggests the issue impacted the 2024 election. A national exit poll conducted by the Concerned Women for America (CWA) legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. And 6% said it was the most important issue of all, while 44% said it was \"very important.\" CLICK HERE TO GET THE FOX NEWS APP Meanwhile, prominent Democratic figures have backpedaled on their party's support for males in women's sports, including Pete Buttigieg, Gavin Newsom and even Kamala Harris. In her recent book \"107 Days,\" Harris wrote that she \"agrees\" with the concerns of parents and athletes who oppose letting males compete with females. \"I agree with the concerns expressed by parents and players that we have to take into account biological factors such as muscle mass and unfair student athletic advantage when we determine who plays on which teams, especially in contact sports,\" Harris wrote. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Mikie Sherrill, New Jersey&apos;s Democrat candidate for governor, voted against the Protection of Women and Girls in Sports Act twice and co-sponsored the Transgender Bill of Rights.","url":"https://www.foxnews.com/sports/mikie-sherrill-remains-silent-past-voting-keep-trans-athletes-womens-sports-trump-calls-her-out","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/mike-sherrill-trans-athlete.jpg","video":"https://www.foxnews.com/video/6379929796112","publish_date":"2025-09-27 22:29:48","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.194},{"id":364072058,"title":"Warning all-out war with Putin's Russia may be 'inevitable' unless NATO shows resolve","text":"Armed confrontation with Russia appears unavoidable unless NATO shows resolve and solidarity against Moscow's mounting aggression, security analysts have cautioned. This comes after a separate alert from Estonian defence minister Hanno Pevkur that Moscow's recent wave of hybrid assaults aims to compel NATO nations to focus on their own protection rather than backing Ukraine. Keir Giles from Chatham House stated: \"I fear a kinetic war with Russia is looking inevitable, because the measures to prevent such a war are still not being taken. Russia today has little to deter it from taking on the West should the US be neutralised as a factor.\" Mr Giles, who penned Who Will Defend Europe?,continued: \"Despite all the rhetoric and promises, we see little concretely achieved, as was shown when Poland experienced just a tiny fraction of the drone waves suffered by Ukraine every night. It would have no way of dealing with that scale of Russian drone attack.\" Former Estonian deputy defence minister Lauri Almann warned that full-scale warfare could only be prevented \"if we can show resolve and strength\". He continued: \"Russia respects strength, and that's the only message that more or less has worked.\" Prof Mark Galeotti, who wrote Putin's Wars, also cautioned that Moscow's reckless decision-making increases the likelihood of conflict, reports the Express . He said: \"Russia does not actually want war, but the more aggressive and reckless they are, the greater the risks. Putin didn't intend to be involved in this war in Ukraine. All kinds of calculations can be made that seem perfectly sensible but just happen to be deeply stupid.\" He emphasised the necessity for believable deterrence and continued: \"Putin is pretty risk-averse. He likes to play daring and threatening, but actually he operates cautiously. When they do get pushback, the Russians have a tendency to pull back. The thing is to actually have the capacity to be able to offer pushback.\" The alert emerges as Estonian defence minister Hanno Pevkur revealed Moscow's latest wave of hybrid assaults - from drone breaches and airspace violations to cyber strikes and election interference - are crafted to compel NATO members to concentrate on their own defences at the cost of backing for Ukraine. \"Russia is deliberately pushing all of us, the NATO allies, to deal with our own matters,\" he told the Sunday Express. \"There have been air incidents and airspace violations, we have had drone incidents, cyberattacks and even the Moldovan elections. They conduct different hybrid operations and disinformation campaigns so that we take focus off Ukraine. This is one of the strategic goals of Russia - they want to operate freely in Ukraine.\" Estonia, which shares a 210-mile frontier with Russia, has felt the pressure first-hand. Last week three MiG-31 fighter jets breached its airspace. \"This is unprecedented. We have not seen a manned aircraft in NATO airspace for such a long time,\" the minister declared. \"Russia is claiming that they were not in our airspace, but we have the radar pictures and were monitoring them long before they entered. The Italian aircraft gave very clear signals and we contacted them many times via radio frequencies. They ignored us.\" Col Gaetano Farina, commander of the Italian Baltic Eagle III mission in Estonia, chimed in: \"Not only could the pilots see each other's faces, but the Russians actually waved.\" The pattern is clear, Mr Pevkur stated. \"Russia is testing how far they can go to destabilise society. Is it okay to kill someone? Is it okay to disrupt the air traffic? Is it okay to disrupt the undersea cables?\". \"We have been living next to Russia for centuries. We know how they operate. We know what they do.\" A call by US president Donald Trump for any Russian plane violating NATO airspace to be shot down was echoed by Estonian foreign minister Margus Tsahkna, who asserted: \"The message must be unequivocal: future violations will meet a response - including, if necessary, the interception and downing of intruding aircraft.\" Mr Pevkur confirmed Estonia was prepared. \"We value the society we have built and will not allow Russia to take it away from us,\" he affirmed. \"When there is an intention to start a war from Russia, then there will be a response, a very heavy response, a very quick response.\" However, for this to be effective, NATO must take lessons from Ukraine, he stated, adding: \"We must be more precise, increase our speed, and hit them from a much greater distance than they can hit us.\" Britain continues to play a key role in the response, with around 900 British soldiers stationed in Estonia as part of Operation Cabrit, the UK's contribution to NATO's enhanced forward land forces in the Baltic, Poland and Finland. Some are merely 35 miles from the Russian border. \"The UK understands the value of being here, not only in terms of efforts, but also in terms of aspirations,\" the minister expressed. \"The cooperation is very good, and Estonia values the UK presence highly.\" However, he cautioned against falling into the trap of responding to Russian provocation. \"This is exactly the moment we have to stay calm. We cannot overreact and start a war ourselves. This is what Russia wants.\" Estonia is set to join NATO allies in delivering several hundred tactical reconnaissance drones for Ukraine's armed forces in a £20million project. Britain has committed £22billion in military and non-military support for Ukraine, and was the first nation to offer the war-torn country long-range missiles in the form of Storm Shadows, with a range of 155 miles, and main battle tanks. Last week, a Memorandum of Understanding was signed between Estonian defence titan Defsecintel Solutions and Latvian firm Origin Robotics. This new partnership aims to create Europe's first operational \"Drone Wall\" - a mobile barrier made up of counter-UAS missile carriers designed to protect the Baltics and Poland from Russian drone attacks. \"Politicians have called for a Drone Wall. We are ready to build it,\" declared Jaanus Tamm, chief executive of Defsecintel Solutions. \"We just need the green light.\"","summary":"Defence experts have warned that a conflict with Russia is &quot;inevitable&quot; unless NATO demonstrates strength and unity in the face of Moscow's escalating provocations","url":"https://www.dailyrecord.co.uk/news/uk-world-news/warning-out-war-putins-russia-35977731","image":"https://i2-prod.dailyrecord.co.uk/article35977728.ece/ALTERNATES/s1200b/0_Three-Russian-MiG-31-fighters-violated-Estonian-airspace-over-the-Gulf-of-Finland.jpg","video":null,"publish_date":"2025-09-27 22:29:26","author":"Marco Giannangeli in Tallinn Estonia,Phoebe Tonks","authors":["Marco Giannangeli in Tallinn Estonia","Phoebe Tonks"],"language":"en","category":"politics","source_country":"gb","sentiment":0.029},{"id":364072012,"title":"Nearly half of Gaza war deaths reported in areas Israel called ‘safe’","text":"At least 91 Palestinian people were killed on Saturday in relentless Israeli attacks throughout the Gaza Strip, including at least 45 in Gaza City, as the military intensified its widely criticised ground invasion.\n\nGaza’s Government Media Office slammed Israel for misleading the Palestinian people with threats to evacuate to the central and southern governorates by portraying them as “safe humanitarian zones”, while continuing to strike those same areas.\n\nAccording to a statement issued on Saturday, 1,903 people have been killed in 133 attacks on central and southern Gaza since the forced displacement from Gaza City began on August 11, some 46 percent of all reported deaths across the enclave during that period.\n\nThe office said that this shows civilians are being directly targeted, despite being told to move south, and called on the international community to intervene, warning that continued global inaction amounts to a “green light” for further massacres.\n\nReporting from central Gaza, Al Jazeera’s Hani Mahmoud said that since the early hours of Saturday, Israeli attacks have increased in Gaza City and more casualties have been arriving at al-Shifa Hospital.\n\n“Just in the past few minutes, we had confirmation of a family evacuating on a road inside a vehicle when it was struck by a drone missile. Four people were reported killed on the spot,” he said.\n\n“Hundreds of others have been on the move as Israeli drones and fighter jets chase them from one place to another,” he added.\n\nHospitals attacked\n\nSome hospitals in Gaza City have shut down as Israeli attacks escalate, with plans to seize the city and displace more people each day.\n\nEarlier on Saturday, people in one of the city’s main hospitals, the Jordan Field Hospital, were forced to evacuate all 107 patients and their entire staff after facing heavy bombardment.\n\nHospitals in Gaza have long been on the brink of collapse amid relentless Israeli strikes. Most are operating in horrific conditions, unable to provide even basic medical supplies, such as anaesthesia and antibiotics, while the doctors, who are going hungry themselves, struggle to treat starving patients.\n\nThe few hospitals still partially functioning in central Gaza have become overwhelmed with wounded and sick people fleeing bombardment in the north. Many arrive in need of urgent medical care that cannot be provided.\n\n“Displacement has worsened the situation inside hospitals in the south,” a displaced Palestinian told Al Jazeera. “Now you can see that instead of one patient in one bed, medical staff tried to fit two patients in one bed.”\n\nDr Khalil Digran, who works at Al-Aqsa Hospital, said that Israeli forces deliberately attacked al-Rantisi Paediatric Hospital in Gaza City, the Strip’s only specialised medical facility for children.\n\n“Gaza City and the north are left with just two health facilities that are barely functioning: al-Shifa and al-Ahli Hospital,” Digran told Al Jazeera.\n\n“As for the remaining health facilities in central and southern Gaza, Israeli actions are already adding more pressure on these facilities and threatening to bring their service to a total halt.”\n\nMohammad Khoudary, a displaced Palestinian, told Al Jazeera: “Ever since we became displaced, my father has been impacted and has become very sad.\n\n“This has affected his health; he has become dehydrated. I am hoping they will be able to transfer him to Al-Aqsa Hospital.”\n\nHamas says has not seen ceasefire plan\n\nMeanwhile, on the global stage, protests calling for a ceasefire took place Saturday in Berlin, Germany, Liverpool in the United Kingdom, and elsewhere.\n\nHamas has said that it has not received United States President Donald Trump’s Gaza ceasefire plan, even as Trump this week repeatedly expressed optimism that a deal is close.\n\nIn comments to reporters on Friday, Trump said, “It’s looking like we have a deal on Gaza.” He offered no details and gave no timetable. Israel has not yet made any public response to Trump’s comments.\n\nA Hamas official who spoke to Al Jazeera on condition of anonymity said the Palestinian group “has not been presented with any plan”.\n\nTrump is due to meet Israeli Prime Minister Benjamin Netanyahu on Monday, whose hard-right governing coalition is opposed to ending the Gaza war until Hamas is destroyed.","summary":"Hospitals have also shut down in Gaza City as Israeli attacks escalate. ","url":"https://www.aljazeera.com/news/2025/9/27/nearly-half-of-gaza-war-deaths-reported-in-areas-israel-called-safe?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/09/AP25262816109895-1758894282.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-09-27 22:19:17","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","source_country":"QA","sentiment":-0.557},{"id":364081370,"title":"Experts Urge ECOWAS Parliament To Tackle AI-generated Misinformation, Disinformation","text":"Experts in information technology have called on the ECOWAS Parliament to set up a strategic agency to address the fast-rising cases of misinformation and disinformation characterized by fake news in the era of Artificial Intelligence (AI) in order to curb the dangers of these trends on social media.\n\nThis was part of the elaborate efforts to sensitize and enlighten the people of West Africa at the just concluded 2025 Second Parliamentary Seminar organized by the regional legislature with the theme “Disinformation and Misinformation in the era of AI: Challenges for Governance in the ECOWAS region” in Port Harcourt, Rivers State aimed at countering digital information manipulation and hate message.\n\nAccording to the Center for Countering Digital Hate (CCDH), “Misinformation refers to false or inaccurate information that is spread with or without the intention to deceive. This can happen when someone shares information that they believe to be true but is not supported by facts.\n\n“Disinformation, on the other hand, is false or inaccurate information that is spread intentionally. This can happen when someone creates and shares fake news with the intent to mislead others. For example, a person might create a fake news article that claims a politician, individual, or group of people based on their identity is involved in a scandal, or other conspiracies. They might then share this article on social media to influence people’s opinions.”\n\nDuring a panel discussion, the experts expressed concerns that some unscrupulous people have invaded the social media space to distort news items or deliberately fabricate falsehood to deceive and cause harm to individuals and the society in West Africa giving numerous examples.\n\nOne of the panelists Kierimagha Obomanu , a deputy director of Rivers state Broadcasting Corporation, said the “confusion and destabilization” caused by these trends can lead to social upheaval and threaten social cohesion, especially in diverse societies, which if not properly handled can make governance difficult.\n\nHe said “I will advise for a strategic agency to monitor disinformation that come through AI because if the proper thing is done governance process will move very fast and deliver development goals.”\n\nHe also advocated for a “guided regulation” but not imposing restrictions that will deny the people basic rights to information in the name of regulation, which he said will be counterproductive.\n\nHe lamented that the ECOWAS region lacks adequate structure for fast checking information even as he urged the regional body to invest in fact checking and continuous training of journalists and media practitioners to be at a vantage position to know when and how misinformation and disinformation are dished out.\n\nMr. Christian Odo, an ICT expert, in his submission said the region needs to sensitize people of all segments of the society about the dangers of information manipulation. He added that the people at the grassroots must be given proper education to tackle disinformation and misinformation, especially in West Africa, where people appeal to divisive issues of ethnicity and religion.\n\nHe gave example of the spread of disinformation in a recent circulation of an AI-generated fake image depicting presidential candidate of the Labour Party during the 2023 election, Peter Obi in a picture with US president Donald Trump, which was false. This intentional deception, he said was aimed at manipulating public opinion by presenting false events as real.\n\nIn the same vein, another expert, Suleiman Abubakar Gumi, said the rise in malicious content induced by AI has been weaponised in the region by individuals who want to use it to serve their social, political and economic agenda even as he advocated for government’s intervention to impose sanctions on people who perpetrate such harm to the society.\n\nIT expert, Grace Abiante said that sensitization is key and exposure to AI as a tool for manipulation can be curbed by a properly regulated framework. She added that fact-checking such as going to ChatGPT will assist in checking AI-induced fake news in order to mitigate the negative consequences for both individuals and society at large.","summary":"Experts in information technology have called on the ECOWAS Parliament to set up a strategic agency to address the fast-rising cases of misinformation and disinformation characterized by fake news in&#8230;","url":"https://independent.ng/experts-urge-ecowas-parliament-to-tackle-ai-generated-misinformation-disinformation/","image":"https://independent.ng/wp-content/uploads/WhatsApp-Image-2025-09-27-at-20.57.54.jpeg","video":null,"publish_date":"2025-09-27 22:17:08","author":"Stella Omona","authors":["Stella Omona"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.048},{"id":364080466,"title":"If You'd Invested $50,000 in CoreWeave on its First Day of Trading, Here's How Much You'd Have Now","text":"CoreWeave (CRWV -4.96%) has become one of investors' favorite stocks to watch. It debuted on the market with an initial public offering back in March, and it operates in the hot space of artificial intelligence (AI). On top of this, GPU giant Nvidia is one of its backers, both owning a stake in the company and working closely with it.\n\nThis up-and-coming cloud computing company has had its share of ups and downs this year, but overall, it has been a winning bet for its early investors. And considering the already high levels of demand for AI capacity and the forecasts for further growth on that front, CoreWeave may have an extremely bright future. Analysts predict the value of the AI market will reach beyond $2 trillion in a few years.\n\nLet's consider how much you would have now if you'd invested $50,000 in CoreWeave at its market launch -- and if the stock still is a buy today.\n\nAccess to Nvidia AI chips\n\nSo, first, a quick catch-up on the CoreWeave story. The company offers customers the ability to rent access to Nvidia's top graphics processing units (GPUs) for their AI tasks. Customers can rent by the hour, which offers them enormous flexibility, and CoreWeave's focus on building a hardware backbone suitable for AI workloads means its customers are getting high performance and efficiency.\n\nCoreWeave works closely with Nvidia, and has been the first cloud infrastructure provider able to make the AI chip giant's latest wares -- such as GPUs based on its Blackwell architecture and the even newer Blackwell Ultra -- available to customers. That has been a big plus for CoreWeave, as demand for these chips has been high, and customers want access to them as soon as possible.\n\nAs mentioned, Nvidia owns a stake in CoreWeave -- 24,277,573 shares to be exact, as of the end of the second quarter. That holding represents 91% of Nvidia's investment portfolio. So, it's clear the chipmaker is optimistic about the business. Reinforcing that premise, Nvidia recently signed an agreement to take on any extra capacity that CoreWeave can't rent out to other customers all the way through 2032. Considering Nvidia's expertise in the world of AI, all of these elements offer good reasons to be bullish on CoreWeave.\n\nYour potential winnings\n\nNow, let's consider where you'd stand if you'd invested $50,000 in CoreWeave on its first day of trading, back in March. It's important to note that the stock didn't immediately take off. It slipped in April along with the rest of the market on concerns about President Donald Trump's tariffs on imports. But the shares later rebounded and have marched higher. Today, that position's value would top $166,000.\n\nThat's a fantastic return in such a short period of time. The next question is: Is this stock still a buy at these levels -- or has it reached its full potential for the foreseeable future?\n\nCoreWeave has seen tremendous demand for its computing capacity, and its revenue tripled in its most recently reported quarter. Considering the need for GPUs to drive the next phases of the AI trend, this momentum could continue. Though CoreWeave isn't yet profitable, that isn't surprising at this stage of its story -- and it will have to continue investing in GPUs to provide its customers with what they need. This wouldn't stop me from buying the stock at this point, though it may not be the best choice for cautious or value-oriented investors at the moment.\n\nYes, this Nvidia-backed player's shares have taken off, but it's offering something that's in high demand now and should remain in high demand in the years to come -- processing capacity for AI workloads -- so it's likely that its revenue growth will continue at a fast pace. And Nvidia's involvement suggests CoreWeave will continue to have early access to the chipmaker's most advanced products. \n\nCoreWeave may not soar by more than 200% over the course of just a few months again, but the company has what it takes to climb further in the quarters and years to come. If you're a growth investor, it would be a great idea to buy and hold shares of this potential AI winner.","summary":"The company held its initial public offering in March.","url":"https://www.fool.com/investing/2025/09/27/if-youd-invested-50000-in-coreweave-on-its-first-d/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F835052%2Fgettyimages-1279395367.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-09-27 22:10:00","author":"Adria Cimino","authors":["Adria Cimino"],"language":"en","source_country":"us","sentiment":0.14},{"id":364073056,"title":"World War 3 'now inevitable' as Russia 'has little to deter it from taking on the West'","text":"Defence experts have issued a stark warning that conflict with Russia is inevitable unless NATO shows strength and unity in response to Moscow's escalating provocations. This follows a separate caution from Estonian defence minister Hanno Pevkur, who suggested that Moscow's recent wave of hybrid attacks is designed to force NATO members to focus on their own defence rather than supporting Ukraine. Keir Giles, a representative from Chatham House, expressed his concerns: \"I fear a kinetic war with Russia is looking inevitable, because the measures to prevent such a war are still not being taken. Russia today has little to deter it from taking on the West should the US be neutralised as a factor.\" Mr Giles, who penned Who Will Defend Europe?, further commented: \"Despite all the rhetoric and promises, we see little concretely achieved, as was shown when Poland experienced just a tiny fraction of the drone waves suffered by Ukraine every night. It would have no way of dealing with that scale of Russian drone attack.\" Lauri Almann, former Estonian deputy defence minister, stated that an all-out conflict could only be avoided \"if we can show resolve and strength\". He continued: \"Russia respects strength, and that's the only message that more or less has worked.\" Professor Mark Galeotti, author of Putin's Wars, also cautioned that Moscow's reckless decision-making increases the likelihood of conflict , reports the Express . He stated: \"Russia does not actually want war, but the more aggressive and reckless they are, the greater the risks. Putin didn't intend to be involved in this war in Ukraine. All kinds of calculations can be made that seem perfectly sensible but just happen to be deeply stupid.\" He emphasised the importance of credible deterrence, adding: \"Putin is pretty risk-averse. He likes to play daring and threatening, but actually he operates cautiously. When they do get pushback, the Russians have a tendency to pull back. The thing is to actually have the capacity to be able to offer pushback.\" This warning comes as Estonia's Defence Minister Hanno Pevkur highlighted Moscow's recent series of hybrid attacks - ranging from drone incursions and airspace violations to cyber strikes and election interference - are intended to divert NATO members' attention towards their own defences, thereby reducing support for Ukraine. \"Russia is deliberately pushing all of us, the NATO allies, to deal with our own matters,\" he informed the Sunday Express. \"There have been air incidents and airspace violations, we have had drone incidents, cyberattacks and even the Moldovan elections. They conduct different hybrid operations and disinformation campaigns so that we take focus off Ukraine. This is one of the strategic goals of Russia - they want to operate freely in Ukraine.\" Estonia, which has a 210-mile border with Russia, has directly felt this pressure. Just last week, three MiG-31 fighter jets entered its airspace. \"This is unprecedented. We have not seen a manned aircraft in NATO airspace for such a long time,\" the minister declared. \"Russia is claiming that they were not in our airspace, but we have the radar pictures and were monitoring them long before they entered. The Italian aircraft gave very clear signals and we contacted them many times via radio frequencies. They ignored us.\" Col Gaetano Farina, commander of the Italian Baltic Eagle III mission in Estonia, added: \"Not only could the pilots see each other's faces, but the Russians actually waved.\" Mr Pevkur made it clear that \"Russia is testing how far they can go to destabilise society. Is it okay to kill someone? Is it okay to disrupt the air traffic? Is it okay to disrupt the undersea cables?\". \"We have been living next to Russia for centuries. We know how they operate. We know what they do.\" A call by US president Donald Trump for any Russian plane violating NATO airspace to be shot down was echoed by Estonian foreign minister Margus Tsahkna, who said: \"The message must be unequivocal: future violations will meet a response - including, if necessary, the interception and downing of intruding aircraft.\" Mr Pevkur confirmed that Estonia was prepared. \"We value the society we have built and will not allow Russia to take it away from us,\" he stated. \"When there is an intention to start a war from Russia, then there will be a response, a very heavy response, a very quick response.\" However, for this to be effective, NATO must take lessons from Ukraine, he stated, adding: \"We must be more precise, increase our speed, and hit them from a much greater distance than they can hit us.\" Britain continues to play a central role in this response, with approximately 900 British soldiers stationed in Estonia as part of Operation Cabrit, the UK's contribution to NATO's enhanced forward land forces in the Baltic, Poland and Finland. Some are located just 35 miles from the Russian border. \"The UK understands the value of being here, not only in terms of efforts, but also in terms of aspirations,\" the minister expressed. \"The cooperation is very good, and Estonia values the UK presence highly.\" However, he cautioned against falling for Russian provocation. \"This is exactly the moment we have to stay calm. We cannot overreact and start a war ourselves. This is what Russia wants.\" Estonia is set to join NATO allies in delivering several hundred tactical reconnaissance drones for Ukraine's armed forces in a £20million project. Britain has committed £22billion in military and non-military support for Ukraine, and was the first nation to offer the war-torn country long-range missiles in the form of Storm Shadows, with a range of 155 miles, and main battle tanks. Last week, a Memorandum of Understanding was signed between Estonian defence titan Defsecintel Solutions and Latvian firm Origin Robotics, marking the start of a partnership aiming to create Europe's first operational \"Drone Wall\". This mobile counter-UAS missile carrier system is designed to protect the Baltics and Poland from potential Russian drone attacks. \"Politicians have called for a Drone Wall. We are ready to build it,\" stated Jaanus Tamm, the chief executive of Defsecintel Solutions. \"We just need the green light.\"","summary":"Estonia's defence minister has issued a stark warning that Moscow's latest hybrid attacks are designed to force NATO to drop support for Ukraine","url":"https://www.manchestereveningnews.co.uk/news/world-news/world-war-3-now-inevitable-32566013","image":"https://i2-prod.manchestereveningnews.co.uk/article32566011.ece/ALTERNATES/s1200b/0_British-Challenger-2-main-battle-tanks-are-seen-here-deployed-on-exercise-Hedgehog-in-Estonia.jpg","video":null,"publish_date":"2025-09-27 22:06:09","author":"Marco Giannangeli in Tallinn Estonia,Phoebe Tonks","authors":["Marco Giannangeli in Tallinn Estonia","Phoebe Tonks"],"language":"en","source_country":"gb","sentiment":-0.099},{"id":364077772,"title":"Trump asks Supreme Court to uphold ban on birthright citizenship","text":"WASHINGTON >> The Trump administration on Friday asked the Supreme Court to uphold President Donald Trump’s executive order ending birthright citizenship, the long-held principle that children born on American soil are automatically citizens.\n\nTrump issued the order on his first day in office, but it has been blocked by the courts ever since.\n\nIn a pair of petitions, government lawyers argued that the Constitution’s promise of citizenship was conferred on “freed slaves and their children, not on the children of aliens temporarily visiting the United States or of illegal aliens.”\n\nThe common understanding of the 14th Amendment for more than a century, upheld by the Supreme Court, has guaranteed citizenship to children born in the United States. But D. John Sauer, the solicitor general, argued that such a view was “mistaken,” according to the filings, which were reviewed by The New York Times but have not yet appeared in the court’s public case-tracking system.\n\nIf the justices were to take the case, the court could hear arguments on the matter during its upcoming term, which is set to begin in early October. Decisions are typically announced by late June or early July.\n\nThe Justice Department did not immediately respond to a request for comment.\n\nThe administration’s request set up a key test for the Supreme Court, which has repeatedly allowed central pieces of Trump’s agenda to proceed on a temporary emergency basis, even as their legality is tested by the courts. If the justices accept the birthright citizenship cases, they would offer a final verdict as to whether Trump’s order was constitutional, a case that could define what it means to be an American.\n\n“If and when the court takes up birthright citizenship, the president will be going against the U.S. Constitution, a 127-year-old Supreme Court precedent and an act of Congress, and he will lose,” said Cecillia Wang, the national legal director of the American Civil Liberties Union, which is among the groups challenging the executive order.\n\nThe Trump administration appeals stem from lower court litigation over an executive order signed by Trump when he returned to office in January. The order, which would end birthright citizenship for the children of immigrants without permanent legal status and temporary foreign residents, faced immediate legal challenges.\n\nTrump’s order appeared to collide with the common understanding of the 14th Amendment, which was ratified after the Civil War to guarantee citizenship for all and reversed a now-notorious court decision that had deprived Black people born in the United States of that right.\n\nThe amendment states that “all persons born or naturalized in the United States, and subject to the jurisdiction thereof” are Americans.\n\nAfter a number of federal judges issued temporary pauses on the policy as the court cases made their way through the system, the Trump administration asked the justices to unfreeze the policy, arguing that lower court judges had exceeded their power by issuing the nationwide blocks.\n\nThe justices, in a rare move, heard oral arguments in May on the narrow question of whether lower court judges had exceeded their authority. In late June, in a 6-3 decision that split along ideological lines, the justices sided with the Trump administration, cutting off one mechanism for lower-court judges to block executive branch policies.\n\nMore legal challenges swiftly followed in response to the Supreme Court ruling, including a nationwide class-action lawsuit filed in federal court in New Hampshire on behalf of a proposed class of people, including babies subject to the executive order and their parents.\n\nIn July, Judge Joseph N. Laplante of the U.S. District Court for the District of New Hampshire agreed to allow the lawsuit to proceed, freezing the policy for the babies and their parents. He announced that his decision applied nationwide.\n\nThat same month, in a splintered decision, a panel of judges on the San Francisco-based 9th U.S. Circuit Court of Appeals ruled in an ongoing Washington state case that the president’s executive order violated the Constitution.\n\nIn that opinion, the judges concluded that the order “contradicts the plain language of the 14th Amendment’s grant of citizenship to ‘all persons born in the United States and subject to the jurisdiction thereof.’”\n\nIn his new filings, Sauer argued that the lower-court decisions had invalidated policies necessary to secure the border and conferred citizenship on hundreds of thousands of “unqualified people.”\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"WASHINGTON >> The Trump administration on Friday asked the Supreme Court to uphold President Donald Trump&#8217;s executive order ending birthright citizenship, the long-held principle that children born on American soil are automatically citizens.","url":"https://www.staradvertiser.com/2025/09/27/breaking-news/trump-asks-supreme-court-to-uphold-ban-on-birthright-citizenship/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_US-NEWS-SCOTUS-MEDICAID-PLANNED-PARENTHOOD-GET.jpg","video":null,"publish_date":"2025-09-27 22:03:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":-0.424},{"id":364083198,"title":"Newsom Attacks Stephen Miller, Calls Him 'A Fascist'","text":"California Gov. Gavin Newsom (D) launched an attack on White House Deputy Chief of Staff Stephen Miller, labeling him “a fascist,” in a social media post.\n\n“STEPHEN MILLER IS A FASCIST!” the Governor Newsom Press Office account on X wrote in a post.\n\nBreitbart News Senior Editor-at-Large Joel Pollak reported that in an X post from Monday, Newsom “launched an antisemitic attack” on Miller, who is Jewish. In Newsom’s post, he “referred to Miller as ‘SS,’ using an acronym for the Schutzstaffel, the elite Nazi corps:”\n\nThe epithet came in a post on X by the “GovPressOffice” account, the official public account of the governor’s press office, which alternates between serious information and attempts to troll President Donald Trump.\nThe all-caps posting referred to Miller as “SS,” using an acronym for the Schutzstaffel, the elite Nazi corps that was primarily responsible for the murder of millions of Jews in the Holocaust. Miller is Jewish.\n\nSeveral people responded to Newsom’s post, calling Miller a “fascist” and for Newsom to “stop.” Others criticized Newsom for “inciting violence.”\n\n“You’ve got to stop this,” Andrew Kolvet, the executive producer of The Charlie Kirk Show wrote in a post.\n\n“They know exactly what they’re doing,” Human Events Senior Editor Jack Posobiec wrote in a post.\n\n“California Governor Gavin Newsom is inciting violence against White House senior staffer Stephen Miller,” another person wrote. “This comes a week after Governor Gavin Newsom called for doxing ICE agents even as Antifa terrorists were shooting at ICE agents.”","summary":"California Gov. Gavin Newsom (D) launched an attack on White House Deputy Chief of Staff Stephen Miller, labeling him \"a fascist,\" in a social media post.\n\n\nThe post Newsom Attacks Stephen Miller, Calls Him &#8216;A Fascist&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/27/newsom-attacks-stephen-miller-calls-him-a-fascist/","image":"https://media.breitbart.com/media/2025/09/Gavin-Newsom-Calls-Steven-Miller-Fascist-640x335.jpeg","video":null,"publish_date":"2025-09-27 22:02:14","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"US","sentiment":-0.505},{"id":364078204,"title":"Zelenskyy Sounds Alarm, Says Putin Preparing to Attack Another European Country","text":"Ukraine's President Volodymyr Zelenskyy has warned that Russian President Vladimir Putin could expand the war beyond Ukraine, accusing Moscow of recent drone incursions into European airspace as an attempt to test Nato's defences. Speaking in Kyiv after meeting former US President Donald Trump on the sidelines of the UN General Assembly in New York, Zelenskyy said: \"Putin will not wait to finish his war in Ukraine. He will open up some other direction. Nobody knows where. He wants that.\" The Ukrainian president claimed that the Kremlin was deliberately probing Europe's capacity to protect its skies. Recent incidents included drone sightings in Denmark, Poland, and Romania, as well as Russian fighter jets violating Estonian airspace. More drones were reportedly seen over a Danish military base on Friday night and a Norwegian base on Saturday. Russia vs NATO Earlier this month, Ukraine reported spotting 92 drones flying towards Poland in a \"choreographed\" formation. Ukrainian forces intercepted most, but 19 crossed into Polish territory, where four were shot down. Zelenskyy suggested that European governments were struggling to address this evolving threat. He added that representatives from several unnamed countries would travel to Ukraine for practical training on repelling Russian aerial attacks, saying: \"We are ready to share our experience.\" Also Read: 'Will Respond with Full Force' - Why NATO Issued an Ultimatum to Russia He stressed that Ukraine's military was at war, unlike some European countries, saying: \"I am not comparing our forces. We are at war and they [Poland] are not.\" Meeting with Donald Trump Zelenskyy described his discussions with Trump as \"very nice\" and said he had briefed the former US president on the realities on the battlefield. Following the meeting, Trump said he believed Ukraine could regain all territory lost since 2022 with the support of Europe and Nato. He also described Russia's economy as struggling and its military as a \"paper tiger.\" \"It's not success. It's temporary presence,\" Zelenskyy said, referring to Russia's advances on the battlefield. Zelenskyy declined to comment on reports that he had requested US Tomahawk cruise missiles capable of striking Moscow, calling it \"a sensitive issue.\" Kyiv has recently carried out a series of successful strikes on Russian oil refineries using domestically produced long-range drones. Zelenskyy warned that if Moscow attempted to destroy Ukraine's energy infrastructure again this winter, its own capital could face retaliatory blackouts.","summary":"​​Earlier this month, Ukraine reported spotting 92 drones flying towards Poland in a \"choreographed\" formation","url":"https://www.timesnownews.com/world/europe/zelenskyy-putin-preparing-to-attack-another-european-country-russia-ukraine-war-article-152905792","image":"https://images.timesnownews.com/thumb/msid-152905793,thumbsize-27508,width-1280,height-720,resizemode-75/152905793.jpg","video":null,"publish_date":"2025-09-27 21:58:07","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":0.125},{"id":364067828,"title":"Conflict with Vladimir Putin's Russia 'is inevitable' as experts sound WW3 alarm","text":"Russian provocations are making a war \"inevitable\" with western Europe unless measures to deter Vladimir Putin are taken, say experts. Estonian defence minister Hanno Pevkur said Moscow's recent spate of hybrid attacks are aimed at forcing NATO members to prioritise their own defence over support for Ukraine . And now Keir Giles of Chatham House claims European countries need to prepare themselves better as a unified group for a conflict with Russia. “I fear a kinetic war with Russia is looking inevitable, because the measures to prevent such a war are still not being taken. Russia today has little to deter it from taking on the West should the US be neutralised as a factor,\" he told the Express . Mr Giles, author of Who Will Defend Europe?, added: “Despite all the rhetoric and promises, we see little concretely achieved, as was shown when Poland experienced just a tiny fraction of the drone waves suffered by Ukraine every night. It would have no way of dealing with that scale of Russian drone attack.” Former Estonian deputy defence minister Lauri Almann said all-out conflict could only be avoided “if we can show resolve and strength\". He added: “Russia respects strength, and that’s the only message that more or less has worked.” Prof Mark Galeotti, author of Putin’s Wars, warned that Moscow’s reckless decision-making makes conflict more likely. He said: “Russia does not actually want war, but the more aggressive and reckless they are, the greater the risks. Putin didn’t intend to be involved in this war in Ukraine. All kinds of calculations can be made that seem perfectly sensible but just happen to be deeply stupid.” He stressed the need for credible deterrence and added: “Putin is pretty risk-averse. He likes to play daring and threatening, but actually he operates cautiously. When they do get pushback, the Russians have a tendency to pull back. The thing is to actually have the capacity to be able to offer pushback.” The warnings come as the Estonian defence minister said Moscow’s recent spate of hybrid attacks – from drone incursions and airspace violations to cyber strikes and election interference – are designed to force NATO members to focus on their own defences at the expense of support for Ukraine. “Russia is deliberately pushing all of us, the NATO allies, to deal with our own matters,” Pevkur said. “There have been air incidents and airspace violations, we have had drone incidents, cyberattacks and even the Moldovan elections. \"They conduct different hybrid operations and disinformation campaigns so that we take focus off Ukraine. This is one of the strategic goals of Russia – they want to operate freely in Ukraine.” Estonia, which shares a 210-mile border with Russia, has experienced the pressure directly. Last week three MiG-31 fighter jets entered its airspace. “This is unprecedented. We have not seen a manned aircraft in NATO airspace for such a long time,” said Pevkur. “Russia is claiming that they were not in our airspace, but we have the radar pictures and were monitoring them long before they entered. The Italian aircraft gave very clear signals and we contacted them many times via radio frequencies. They ignored us.” The pattern is clear, Mr Pevkur said. He continued: “Russia is testing how far they can go to destabilise society. Is it okay to kill someone? Is it okay to disrupt the air traffic? Is it okay to disrupt the undersea cables? We have been living next to Russia for centuries. We know how they operate. We know what they do.” A call by US president Donald Trump for any Russian plane violating NATO airspace to be shot down was echoed by Estonian foreign minister Margus Tsahkna, who said: “The message must be unequivocal: future violations will meet a response – including, if necessary, the interception and downing of intruding aircraft.” And Pevkur said Estonia was ready, stating: “We value the society we have built and will not allow Russia to take it away from us. When there is an intention to start a war from Russia, then there will be a response, a very heavy response, a very quick response.” For that to be effective, however, NATO must learn from Ukraine, he said, adding: “We must be more precise, increase our speed, and hit them from a much greater distance than they can hit us.”","summary":"Vladimir Putin will not see any reason to be deterred from a war with the West were the US not involved, an expert has warned, with war against Russia branded 'inevitable'","url":"https://www.mirror.co.uk/news/world-news/conflict-vladimir-putins-russia-is-35977562","image":"https://i2-prod.mirror.co.uk/article35934604.ece/ALTERNATES/s1200b/5_RUSSIA-POLITICS-PARLIAMENT.jpg","video":null,"publish_date":"2025-09-27 21:56:02","author":"Marco Giannangeli,Tim Hanlon","authors":["Marco Giannangeli","Tim Hanlon"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.138},{"id":364072010,"title":"Native Americans condemn Pentagon move to preserve Wounded Knee medals","text":"The National Congress of American Indians has strongly condemned a Pentagon review that decided against revoking medals awarded to US soldiers at the 1890 Battle of Wounded Knee, an event which many historians consider a massacre.\n\n“Celebrating war crimes is not patriotic. This decision undermines truth-telling, reconciliation, and the healing that Indian Country and the United States still need,” Larry Wright Jr, the Congress’s executive director, said in a statement issued on Saturday.\n\nUS President Donald Trump’s secretary of defense, Pete Hegseth, said in a video posted on X late Thursday that a review panel had recommended allowing the soldiers to keep their medals, in a study completed last year, and that he followed that recommendation.\n\n“We’re making it clear that they deserve those medals. This decision is now final, and their place in our nation’s history is no longer up for debate,” Hegseth said.\n\nThe defence secretary criticised his predecessor for not making the same decision, saying that the former Pentagon chief was more interested in being “politically correct than historically correct”.\n\nThe Wounded Knee Massacre\n\nThe Battle of Wounded Knee, also known as the Wounded Knee Massacre, took place on December 29, 1890, in South Dakota, when US soldiers killed and wounded more than 300 Lakota Sioux men, women, and children.\n\nThe events at Wounded Knee marked the end of the Indian Wars, during which Native Americans were coerced into ceding their lands and then forced onto reservations.\n\nLloyd Austin, who was defence secretary in the administration of US President Joe Biden, had ordered a review of the military honours, but had not made a final decision before leaving office in January.\n\nIn 1990, Congress passed a resolution expressed “deep regret” for the conflict.\n\n“It is proper and timely for the Congress of the United States of America to acknowledge … the historic significance of the Massacre at Wounded Knee Creek, to express its deep regret to the Sioux people and in particular to the descendants of the victims and survivors for this terrible tragedy,” the resolution said.\n\nHegseth has taken aim at diversity, equity and inclusion efforts at the Pentagon since he took office.\n\nThe Pentagon has ended commemorations of identity month celebrations, like Native American History Month and Black History Month.\n\nThe Pentagon drew fire earlier this year for briefly erasing online references to the Navajo Code Talkers, who developed an unbreakable code that helped Allied forces win World War II.","summary":"The Battle of Wounded Knee, also known as the Wounded Knee Massacre, took place in South Dakota in 1890.","url":"https://www.aljazeera.com/news/2025/9/27/native-americans-condemn-pentagon-move-to-preserve-wounded-knee-medals?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/09/2025-09-04T233608Z_630460014_RC2CLGAOI2QD_RTRMADP_3_USA-TRUMP-DEPARTMENT-OF-WAR-1757048314.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-09-27 21:53:18","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.197},{"id":364074698,"title":"Hamas says it has not received US peace proposal","text":"Hamas has not received US President Donald Trump’s Gaza Strip ceasefire plan, the Palestinian militant group which runs the enclave says as Israeli forces expand their assault on Gaza City.\n\nThe comments came after Israeli newspaper Haaretz cited sources saying Hamas had agreed in principle to release all the Israeli hostages it holds in return for hundreds of Palestinian prisoners and the gradual withdrawal of Israeli troops under Mr Trump’s plan.\n\nAlso included in the proposal were the end of Hamas rule in the Gaza Strip and Israel agreeing not to annex the territory and drive out Palestinians living there, Haaretz reported.\n\n“Hamas has not been presented with any plan,” a Hamas official who asked not to be named told Reuters.\n\nIn his comments to reporters on Friday in which he said “it’s looking like we have a deal on Gaza,” Trump offered no details of its contents and gave no timetable.\n\nIsrael has not yet made any public response to Mr Trump’s comments.\n\nMr Trump is due on Monday to meet Israeli Prime Minister Benjamin Netanyahu, who heads a governing coalition opposed to ending the Gaza Strip war until Hamas is destroyed.\n\nMr Trump also said on Friday talks on the conflict with Middle Eastern countries were intense and would continue as long as required.\n\nHis special envoy Steve Witkoff said the US president had presented proposals to the leaders of multiple Muslim-majority countries this week that included a 21-point Middle East peace plan.\n\nIn the Gaza Strip meanwhile, the fighting continued.\n\nThe Israeli military said its aircraft struck 120 targets across the strip over the past day as troops pressed deeper into Gaza City.\n\nThe Palestinian Health Ministry said 74 people were killed in the enclave in the last 24 hours.\n\nIn a post on social media platform X, the Israeli military’s Arabic spokesman repeated calls for Gaza City residents to leave.\n\nThe United Nations World Food Programme estimates that 350,000-400,000 Palestinians have left since Israel began its expanded ground offensive in Gaza City a couple of weeks ago but hundreds of thousands remain.\n\nDoctors Without Borders/Medecins Sans Frontieres said late on Friday it had been forced to suspend its medical activities in Gaza City because its clinics were encircled by Israeli forces.\n\nThe group said the move was the “last thing” it wanted, saying that vulnerable people such as infants in neonatal care and people with life-threatening illnesses are unable to move and are in grave danger.\n\nFour health facilities in Gaza City have shut down so far this month, according to the World Health Organisation, and the UN says some malnutrition centres have also closed.\n\nIsrael began its assault on the Gaza Strip nearly two years ago after an attack led by Hamas killed about 1200 people, with 251 taken hostage, according to Israeli tallies.\n\nSince then, Israeli forces have killed more than 65,000 Palestinians in the enclave, according to Gazan health authorities, displaced the entire population and crippled the territory’s health system.","summary":"Media reports say Hamas has agreed to free its hostages in return for a gradual withdrawal of Israeli troops but the group says it has not seen a US proposal.","url":"https://thewest.com.au/news/world/hamas-says-it-has-not-received-us-peace-proposal-c-20165285","image":"https://images.thewest.com.au/publication/C-20165285/97949e0df5c5873f0f6ade269b392c5f2d229db4-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-09-27 21:53:12","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.185},{"id":364078196,"title":"UN Sanctions Set To Return: How Will Iran Be Affected By This Move","text":"United Nations sanctions are set to be reimposed on Iran on Saturday over accusations that Tehran violated the 2015 nuclear deal with world powers. Britain, France, and Germany, known as the E3, triggered a “snapback” process 30 days ago, claiming Iran failed to comply with the agreement designed to prevent it from developing nuclear weapons, as per Reuters report. Iran denies pursuing nuclear arms. Iran Warns of Harsh Response Tehran has warned that the sanctions will be met with a strong response. Iranian President Masoud Pezeshkian, however, tried to downplay the situation, saying, “It is not like the sky is falling.” Iran is recalling its ambassadors to Britain, France, and Germany for consultations. Economic Impact Already Felt Iran’s economy is already suffering from sanctions reinstated by the US in 2018 after US President Donald Trump withdrew from the deal. The country’s currency, the rial, fell to a record low of 1,123,000 per US dollar on Saturday amid fears of new restrictions. The renewed UN sanctions will include an arms embargo, a ban on uranium enrichment and reprocessing, restrictions on ballistic missile activities, travel bans for dozens of Iranian individuals, and asset freezes. Countries worldwide are authorized to seize any items banned under these sanctions. Iran will also be prohibited from engaging in commercial activities involving nuclear materials and technology in other nations. Diplomatic Efforts Falter European powers had offered to delay the sanctions for up to six months to allow space for negotiations if Iran allowed UN nuclear inspectors access and addressed concerns about its enriched uranium. Iranian Foreign Minister Abbas Araqchi accused the E3 of failing to reciprocate Iran’s proposals to keep diplomacy open. Regional Tensions Rise The reimposition of sanctions comes amid heightened tensions in the Middle East, just months after Israel and the US struck Iranian nuclear sites. Russian Foreign Minister Sergei Lavrov criticized the sanctions as “unlawful” and warned the UN Secretary-General against recognizing them.","summary":"The UN will reimpose sanctions on Iran on Saturday over alleged violations of the 2015 nuclear deal, prompting Tehran to warn of a harsh response. The measures include an arms embargo, uranium restrictions, travel bans, and asset freezes, while Iran recalls ambassadors from Britain, France, and Germany.","url":"https://www.timesnownews.com/world/middle-east/un-sanctions-set-to-return-how-will-iran-be-affected-by-this-move-article-152905790","image":"https://images.timesnownews.com/thumb/msid-152905791,thumbsize-1096751,width-1280,height-720,resizemode-75/152905791.jpg","video":null,"publish_date":"2025-09-27 21:52:57","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","source_country":"in","sentiment":-0.223},{"id":364077848,"title":"International community ‘on brink’ of Gaza peace deal, says Yvette Cooper","text":"The international community is on the verge of a peace deal for Gaza as it faces an unprecedented humanitarian crisis, the UK’s Foreign Secretary Yvette Cooper has revealed. \n\nMs Cooper’s comments follow her address at the UN General Assembly in New York earlier this week, where she accused Israeli Prime Minister Benjamin Netanyahu of allowing children in Gaza to die of starvation. \n\nMr Netanyahu faced a mass walkout at the meeting of world leaders and diplomats as he insisted Israel must “finish the job” trying to eliminate Hamas. \n\nThe British foreign secretary has now warned that the “Israeli government urgently needs to change its course” as the world “wants to end this war”.\n\n“I feel like there is a consensus, a real, huge consensus building, and there was real energy and determination [at the UN] around peace. I think we’ve reached a moment where the world wants to end this war,” she told The Guardian. \n\n“There is no military solution to this that works, there is no way that the security of Israel is remotely strengthened by this further Gaza City offensive,” she continued. \n\n“For security for Israelis, as well as security for Palestinians and as well as dealing with this devastating humanitarian crisis, I think the Israeli government urgently needs to change course.”\n\nIt follows US President Donald Trump’s statement on Friday, when he told reporters it was “looking like we have a deal on Gaza”.\n\nSpeaking about the ongoing humanitarian crisis, she admitted that words “feel hollow” in the face of the suffering endured by Palestinians. \n\n“Every time we talk about whether it’s humanitarian crisis or whatever words that we use actually feel hollow, because what it’s really about is the screams and pain of a toddler, and that’s what’s really at the heart of this, and that’s what has to end. The war has to be brought to an end,” she said. \n\n“I think the reason that there is just such a sense of distress is because everybody can see the horror of what has happened and the fact that it feels like nothing’s being done. It feels like nothing is changing. It feels like everything is just getting worse. \n\n“The challenge for us now is that there is a moment, and we have to make sure that that moment, through international action, is turned into a peace process.”\n\nEarlier this week, reports emerged that former prime minister Tony Blair could helm a Gaza transitional body to oversee the reconstruction and governance of the Strip, with support from the US. The move to take a leadership role in the Middle East would prove controversial after the invasion of Iraq in 2003, which took place under his leadership. \n\n“Tony Blair has been one of the people adding proposals to this process, and that’s been really important, but there have been lots of other processes as well,” Ms Cooper said. \n\n “There’s still a huge amount of work to do. At this stage, there’s a sense of consensus building but we’ve got to keep that on track.”\n\nShe added: “We can’t pretend this isn’t incredibly hard, and how long the crisis has been going on makes it challenging. But there was no doubt that there is a real sense of determination and energy behind trying to get an end to the war and to try and get not just an immediate ceasefire, but a proper plan for the future.”\n\nThe Independent has contacted Ms Cooper for comment. \n\nOver 68,000 people have been killed, mostly civilians including over 20,000 children since Israel’s military campaign in the Strip. Israel has faced condemnation from rights groups and the international community with the United Nations concluding it is committing a genocide after a two-year investigation. Israel has called the claims “false” and “distorted”. \n\nAlmost 1,200 people were killed when Hamas attacked Israel on 7 October and took 251 people hostage.","summary":"UK foreign secretary said there is ‘a real consensus’ among the international community","url":"https://www.independent.co.uk/news/world/middle-east/gaza-israel-peace-deal-trump-uk-b2835074.html","image":"https://static.independent.co.uk/2025/09/27/20/49/GettyImages-2235184231.jpg?crop=1930.8,1287.2,x69.5,y274.9&trim=274,163,1438,69&width=1200","video":"https://cdn.jwplayer.com/videos/oz9jPVjH-OhrQWqOm.mp4","publish_date":"2025-09-27 21:50:20","author":"Maira Butt","authors":["Maira Butt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.247},{"id":364072404,"title":"International community ‘on brink’ of Gaza peace deal, says Yvette Cooper","text":"The international community is on the verge of a peace deal for Gaza as it faces an unprecedented humanitarian crisis, the UK’s Foreign Secretary Yvette Cooper has revealed.\n\nMs Cooper’s comments follow her address at the UN General Assembly in New York earlier this week, where she accused Israeli Prime Minister Benjamin Netanyahu of allowing children in Gaza to die of starvation.\n\nMr Netanyahu faced a mass walkout at the meeting of world leaders and diplomats as he insisted Israel must “finish the job” trying to eliminate Hamas.\n\nThe British foreign secretary has now warned that the “Israeli government urgently needs to change its course” as the world “wants to end this war”.\n\n“I feel like there is a consensus, a real, huge consensus building, and there was real energy and determination [at the UN] around peace. I think we’ve reached a moment where the world wants to end this war,” she told The Guardian.\n\n“There is no military solution to this that works, there is no way that the security of Israel is remotely strengthened by this further Gaza City offensive,” she continued.\n\n“For security for Israelis, as well as security for Palestinians and as well as dealing with this devastating humanitarian crisis, I think the Israeli government urgently needs to change course.”\n\nIt follows US President Donald Trump’s statement on Friday, when he told reporters it was “looking like we have a deal on Gaza”.\n\nSpeaking about the ongoing humanitarian crisis, she admitted that words “feel hollow” in the face of the suffering endured by Palestinians.\n\n“Every time we talk about whether it’s humanitarian crisis or whatever words that we use actually feel hollow, because what it’s really about is the screams and pain of a toddler, and that’s what’s really at the heart of this, and that’s what has to end. The war has to be brought to an end,” she said.\n\n“I think the reason that there is just such a sense of distress is because everybody can see the horror of what has happened and the fact that it feels like nothing’s being done. It feels like nothing is changing. It feels like everything is just getting worse.\n\n“The challenge for us now is that there is a moment, and we have to make sure that that moment, through international action, is turned into a peace process.”\n\nEarlier this week, reports emerged that former prime minister Tony Blair could helm a Gaza transitional body to oversee the reconstruction and governance of the Strip, with support from the US. The move to take a leadership role in the Middle East would prove controversial after the invasion of Iraq in 2003, which took place under his leadership.\n\n“Tony Blair has been one of the people adding proposals to this process, and that’s been really important, but there have been lots of other processes as well,” Ms Cooper said.\n\n“There’s still a huge amount of work to do. At this stage, there’s a sense of consensus building but we’ve got to keep that on track.”\n\nShe added: “We can’t pretend this isn’t incredibly hard, and how long the crisis has been going on makes it challenging. But there was no doubt that there is a real sense of determination and energy behind trying to get an end to the war and to try and get not just an immediate ceasefire, but a proper plan for the future.”\n\nThe Independent has contacted Ms Cooper for comment.\n\nOver 68,000 people have been killed, mostly civilians including over 20,000 children since Israel’s military campaign in the Strip. Israel has faced condemnation from rights groups and the international community with the United Nations concluding it is committing a genocide after a two-year investigation. Israel has called the claims “false” and “distorted”.\n\nAlmost 1,200 people were killed when Hamas attacked Israel on 7 October and took 251 people hostage.","url":"https://uk.news.yahoo.com/international-community-brink-gaza-peace-215020976.html","image":"https://s.yimg.com/ny/api/res/1.2/lTPchXRntyT66LGQSZEhCw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/6dbaaa907c801a7737787d843478385d","video":null,"publish_date":"2025-09-27 21:50:20","author":"Maira Butt","authors":["Maira Butt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.247},{"id":364070850,"title":"George Hardy, decorated Tuskegee Airman who served in 3 wars, dies at 100","text":"Lt. Col. George Hardy, one of the last surviving members of the famed Tuskegee Airmen, has died at age 100. Hardy served in World War II as part of the unit of America's first Black military pilots. At age 19, he became the youngest Red Tail fighter pilot to fly his first combat sortie over Europe, according to the Tuskegee Airmen, Inc. National Office. \"His legacy is one of courage, resilience, tremendous skill and dogged perseverance against racism, prejudice and other evils,\" the Tuskegee Airmen, Inc. national office said in a statement Friday. \"We are forever grateful for his sacrifice and will hold dear to his memory.\" WWII NURSE, AGE 106, DONATES BULLET FROM HUSBAND'S HEART TO PEARL HARBOR MUSEUM Stationed at Ramitelli Air Field in Italy during WWII, Hardy completed 21 missions over Germany and occupied Europe in P-51 Mustang aircraft. His death leaves only 13 Documented Original Tuskegee Airmen alive today, the organization noted. Hardy, who was born in Philadelphia in 1925 and was the second of seven children, was upstairs doing homework on Dec. 7, 1941, when he was interrupted with news of the Pearl Harbor attack, according to the National WWII Museum. TRUMP VOWS TO ORDER DECLASSIFICATION OF ALL AMELIA EARHART FILES AFTER NEARLY 90-YEAR AVIATION MYSTERY In 1944, he entered the U.S. Army Air Forces, trained at Tuskegee Army Air Field and was commissioned as a Second Lieutenant. By early 1945, Hardy deployed to Italy with the African American 99th Fighter Squadron, 332nd Fighter Group, the National WWII Museum noted. Hardy’s service extended beyond World War II, flying 45 missions in the Korean War and 70 in the Vietnam War. AMERICA'S LAST SURVIVING WWII ACE NAVY FIGHTER PILOT DONALD MCPHERSON DIES AT 103 YEARS OLD He later earned degrees at the Air Force Institute of Technology and helped develop the Department of Defense's first global military telephone system before retiring as a lieutenant colonel in 1971, according to the National WWII Museum. Following his retirement, Hardy became an advocate for keeping the Tuskegee Airmen’s story alive, speaking to students nationwide. The Tuskegee Airmen received the Congressional Gold Medal in 2007 and, in 2024, the National WWII Museum’s American Spirit Award. CLICK HERE TO GET THE FOX NEWS APP \"When I think about the fellas who flew before me and with me at Tuskegee, and the fact that we did prove that we could do anything that anyone else could do, and it’s paid off today ... it’s hard to believe that I’m here receiving this award — with them,\" Hardy said when accepting the American Spirit Award on behalf of the Tuskegee Airmen.","summary":"Lt. Col. George Hardy, one of the last surviving Tuskegee Airmen, has died at age 100 after serving in World War II, the Korean War and the Vietnam War.","url":"https://www.foxnews.com/us/george-hardy-decorated-tuskegee-airman-served-3-wars-dies-100","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/u.s.-air-force-lt.-col.-george-e.-hardy-.jpg","video":"https://www.foxnews.com/video/6373384116112","publish_date":"2025-09-27 21:49:38","author":"Sophia Compton","authors":["Sophia Compton"],"language":"en","source_country":"us","sentiment":0.187},{"id":364070856,"title":"Russia's Sergey Lavrov warns NATO countries in UNGA speech after Trump shifts tone on Ukraine","text":"Russian Foreign Minister Sergey Lavrov used his address to the United Nations General Assembly (UGNA) on Saturday to deliver one of Moscow’s starkest warnings yet to the West, accusing NATO and the European Union of waging a \"real war\" against Russia. Lavrov opened with sweeping historical references to World War II, positioning Russia as the heir to the Soviet Union’s role in defeating Nazism and defending global sovereignty. He accused the U.S. of dismantling those postwar principles through interventions in Yugoslavia, Iraq and Libya, and warned that the same was happening today in the Middle East. While condemning Hamas’s Oct. 7, 2023, attack, Lavrov said Israel’s campaign in Gaza amounted to \"collective punishment\" of civilians, linking the conflict to what he portrayed as decades of unchecked Western use of force. Lavrov accused NATO of ignoring decades of security commitments. He insisted Russia has \"never had and does not have\" plans to attack NATO countries, calling Western warnings of a Russian offensive \"provocations.\" UN SECURITY COUNCIL REJECTS CHINA-RUSSIA RESOLUTION EXTENDING IRAN NUCLEAR SANCTIONS RELIEF BEFORE DEADLINE He singled out claims by European leaders as \"false portrayals\" of Moscow’s intentions, echoing President Vladimir Putin’s denials that Russia plans to strike NATO or EU territory. At the same time, Lavrov issued a direct threat: \"Any aggression against my country will be met with a decisive response. There should be no doubt about this among those in NATO and the EU.\" The warning comes amid heightened tension along NATO’s eastern flank. Estonia recently accused Russian jets of violating its airspace, and NATO forces shot down drones over Poland. The U.S. responded by telling the U.N. Security Council it would \"defend every inch of NATO territory.\" Against this backdrop, Lavrov’s speech underscored Moscow’s effort to frame any clash with NATO as an existential threat to Russia itself. The timing also intersects with a shift in U.S. rhetoric. President Donald Trump, who met with Ukrainian President Volodymyr Zelenskyy earlier this week, has hardened his tone on the war – telling reporters that Ukraine can and should reclaim all its territory. That marks a departure from earlier signals of openness to negotiation, more than a month after U.S. and Russian officials held rare talks in Alaska. Lavrov’s UN address seemed calibrated to counter Trump’s new line, reminding Washington that Moscow sees the war not as a distant conflict but as a direct confrontation involving the United States. Ukrainian President Zelenskyy, in his own address to the General Assembly, warned that failing to stop Russia now would unleash \"the most destructive arms race ever.\" Lavrov reinforced his message at a press conference after the speech, responding to a question about Western calls to shoot down Russian aircraft that might violate European airspace. He dismissed Trump’s earlier remark that Russia was a \"paper tiger,\" noting that the president had already walked it back. He then issued a stark warning: \"If there are attempts to down any flying object … over our territory, in our airspace, then I think people will very much regret it, undertaking such an egregious violation of our territorial integrity and sovereignty.\" WORLD LEADERS LAUGH, SQUIRM AS TRUMP BLASTS UN ON CLIMATE, UKRAINE, GAZA AT GENERAL ASSEMBLY Lavrov also took aim at U.S. sanctions on Iran, blasting Western efforts to restore or tighten restrictions as \"illegal\" and evidence of what he described as Washington’s strategy of \"blackmail and pressure.\" He said the West had sabotaged diplomatic options to revive the 2015 nuclear deal and rejected what he called manipulations at the U.N. Security Council to isolate Tehran. CLICK HERE TO GET THE FOX NEWS APP Beyond Europe, Lavrov portrayed Russia as aligned with a rising \"global majority\" against Western dominance, pointing to BRICS, the Shanghai Cooperation Organization, and African and Latin American calls for greater representation at the U.N. Security Council. He accused Washington of using sanctions and military blocs to preserve hegemony, while claiming Russia was defending sovereignty for nations across the Global South.","summary":"At UNGA, Lavrov warns NATO and U.S. of a “decisive response,&quot; slams Iran sanctions, and challenges Trump’s shift on Ukraine in a fiery address.","url":"https://www.foxnews.com/world/russias-sergey-lavrov-warns-nato-countries-unga-speech-after-trump-shifts-tone-ukraine","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/10/AP23292194992962.jpg","video":"https://www.foxnews.com/video/6380192894112","publish_date":"2025-09-27 21:40:28","author":"Efrat Lachter","authors":["Efrat Lachter"],"language":"en","category":"politics","source_country":"us","sentiment":-0.197},{"id":364083200,"title":"Trump Learns FBI Had 274 Plainclothes Agents at U.S. Capitol on January 6th, Asks Who? and Why?","text":"President Donald Trump reacted to a report that found there had allegedly been 274 Federal Bureau of Investigation (FBI) agents in the crowd during the January 6, 2021, riot at the U.S. Capitol. He wants “to know who each and every one” of the agents in the crowd were and “What they were up to.”\n\nIn a post on Truth Social, Trump noted that the reports findings were “different from what” former FBI Director Christopher Wray had “stated, over and over again!” Trump’s post came after a report by the Blaze found that the “FBI has acknowledged it had 274 plainclothes agents” in the crowd that day, after the agent had refused to “disclose the level of its presence at the Capitol.”\n\n“It was just revealed that the FBI had secretly placed, against all Rules, Regulations, Protocols, and Standards, 274 FBI Agents into the Crowd just prior to, and during, the January 6th Hoax,” Trump said. “This is different from what Director Christopher Wray stated, over and over again! That’s right, as it now turns out, FBI Agents were at, and in, the January 6th Protest, probably acting as Agitators and Insurrectionists, but certainly not as ‘Law Enforcement Officials.'”\n\n“I want to know who each and every one of these so-called ‘Agents’ are, and what they were up to on that now ‘Historic’ Day,” Trump added. “Many Great American Patriots were made to pay a very big price only for the love of their Country. I owe this investigation of ‘Dirty Cops and Crooked Politicians’ to them!”\n\nTrump continued to say that Wray “has some major explaining to do.”\n\n“That’s two in a row, Comey and Wray, who got caught LYING, with our Great Country at stake,” Trump added. “WE CAN NEVER LET THIS HAPPEN TO AMERICA AGAIN!”\n\nPer the Blaze, a “senior congressional source said the number is not necessarily a surprise, since the FBI often embeds countersurveillance personnel at large events.”\n\nAccording to a “report obtained” by Just the News, the FBI “secretly deployed” more than 200 plainclothes agents into the crowd that day:\n\nScores of FBI agents and personnel — many from the bureau’s premier Washington field office (WFO) — sent anonymous complaints to the after-action team detailing how agents were sent into an unsafe scenario without proper safety equipment or the ability to identify themselves readily as armed officers to other police agencies the report obtained by Just the News shows.\n\nBreitbart News reported in December 2024, then-Department of Justice Inspector General Michael Horowitz revealed that “more than two dozen confidential human sources (CHSs)” had been outside of the U.S. Capitol building during the riot.","summary":"President Donald Trump reacted to a report that found there had allegedly been 274 Federal Bureau of Investigation (FBI) agents in the crowd during the January 6, 2021, riot at the U.S. Capitol. He wants \"to know who each and every one\" of the agents in the crowd were and \"What they were up to.\"\n\n\nThe post Trump Learns FBI Had 274 Plainclothes Agents at U.S. Capitol on January 6th, Asks Who? and Why? appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/27/trump-slams-report-fbi-had-274-plainclothes-agents-at-u-s-capitol-on-january-6th/","image":"https://media.breitbart.com/media/2025/09/January-6-Riot-Inset-Angry-Trump-640x335.jpeg","video":null,"publish_date":"2025-09-27 21:39:05","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"US","sentiment":-0.442},{"id":364073648,"title":"Trump finds new trade targets — pharmaceuticals, kitchen cabinets and heavy trucks","text":"Naturepedic, a mattress and furniture company based outside Cleveland, has been planning to introduce an upscale upholstered headboard late this year or early in 2026.\n\nBut President Donald Trump has thrown those plans into disarray. On Thursday night, the president announced on social media that he was slapping a 30% tax on imported upholstered furniture. Naturepedic ships its headboards in from India and Vietnam.\n\nSo what is the company to do?\n\n“Do we continue forth … and hope for the best?’’ asked Arin Schultz, Naturepedic’s chief growth officer. “Or do we feel like we’re priced out and drop it altogether?’’ And if Naturepedic decides to continue with the rollout, “do we eat the cost or pass it on’’ to customers?\n\nAcross the United States, lots of executives were asking themselves similar questions as they came to work Friday morning.\n\nUpholstered furniture, after all, wasn’t the only import in Trump’s crosshairs Thursday night. In addition, the president posted on his Truth Social platform, he’s plastering import taxes – tariffs – of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities and 25% on heavy trucks.\n\nAnd he’s not waiting around to do it. The tariffs, he said, would take effect Wednesday.\n\nTrump also raised eyebrows by justifying the levy on vanities and sofas as necessary for national security. “It’s hard to see how a kitchen cabinet industry is essential to winning the next war,’’ said Mary Lovely, senior fellow at the Peterson Institute for International Economics.\n\nThursday’s social media barrage was just the latest in Trump’s push to upend American trade policy, which for decades pushed for lower trade barriers around the world.\n\nIn place of an open market, Trump has built a tariff wall around the U.S. economy, slapping double-digit taxes on imports from almost every country on earth and targeting products (steel, aluminum, autos) with specific taxes of their own.\n\nTrump says the tariffs will protect U.S. industries from foreign competition, encourage companies to bring production to the United States and raise money for the U.S. Treasury.\n\nThey certainly have become a moneymaker for the federal government. Since fiscal year 2025 began last Oct. 1, the U.S. Treasury has collected $172 billion in customs duties, up by $96 billion (or 126%) from the same period in fiscal 2024. Still, tariffs account for less than 4% of federal revenue.\n\nBusinesses, lawyers and trade analysts are still wondering what to make of Trump’s Thursday night tariffs. “We’ve only seen the President’s Truth Social posts,” said Dan McCarthy, principal in McCarthy Consulting and a former official with the Office of the U.S. Trade Representative in the Biden administration. “We need to see the details.’’\n\nFor example, Naturepedic isn’t sure whether the 30% levy on upholstered furniture will be stacked atop a separate and earlier 50% tariff on goods from India.\n\nHere’s what we know so far:\n\nLuring drug production back to the U.S.\n\nThe president has been threatening tariffs of 200% or more on pharmaceuticals. “It’s to force Big Pharma to move jobs and put new factories into the U.S,’’ said Barry Appleton, a senior fellow at the Center for International Law at New York Law School. “So it’s industrial policy.”\n\nIn recent decades, drugmakers have moved many operations overseas – to take advantage of lower costs in China and India and tax breaks in Ireland and Switzerland.\n\nThe COVID-19 experience – when countries were desperate to hang onto their own medicine and medical supplies — underscored the dangers of relying on foreign countries in a crisis, especially when a key supplier is America’s geopolitical rival China.\n\nThe stock prices of pharmaceutical companies actually rose after Trump’s announcement Thursday night. The 100% tariff was lower than it might have been. And Trump said the tariffs would not apply to companies “breaking ground” or being “under construction.”\n\nSeveral big drugmakers like Merck & Co. Inc., Eli Lilly and Co. and Johnson & Johnson have already announced U.S. expansion plans.\n\nIn his tariff announcement, Trump did not mention generic drugs, which account for the vast majority of U.S. prescriptions.\n\nStill, analysts warn, the tariffs are likely to mean higher prices. “The people who are punished the most are Americans who need the drugs so badly, especially those who don’t have full health care plans,” Appleton said. He called the tariff is a “simplistic but drastic” approach to a complicated problem. “We don’t know how it’s going to go, but it doesn’t look like it’s going to do well for consumers,” he said.\n\nA blow to homeowners and the housing market\n\nThe tariffs on kitchen cabinets, bathroom vanities and upholstered furniture come as the White House is investigating whether imports of lumber and other wood products pose a threat to U.S. national security. A report on that investigation is due Nov. 26 and could mean more and broader tariffs.\n\nThe levies are likely to hurt big furniture exporters China and Vietnam.\n\nBut they’re also likely to drive up the cost of new homes and apartments and of do-it-yourself redecorating projects.\n\nHomeowners are already scaling back due to high costs and a shaky economy. According to the Labor Department, the price of living room, kitchen and dining room furniture has risen nearly 10% over the past year.\n\n“Adding significant costs to furniture, cabinets, vanities and building materials will make the American dream of owning a home significantly more expensive,” said Jonathan Gold, the National Retail Federation’s vice president of supply chain and customs policy. “The speed at which these tariff announcements are made and implemented continues to wreak havoc on retail supply chains. The uncertainty makes it difficult for retailers to properly plan and mitigate the impact of tariffs.”\n\nA message to Mexico?\n\nCharles Clevenger, a supply chain specialist at the consultancy UHY, said tariffs on pharmaceuticals make sense because so much production has shifted away from the United States to Europe and Asia. Likewise, North Carolina and other states in the American South have also lost furniture factories to cheaper competitors in the China.\n\nBut he was surprised by the tariffs on heavy trucks because “we do have a rather robust industry’’ – with manufacturers like Paccar (parent company of Peterbilt and Kenworth).\n\nBut Appleton at New York Law School suspects the tariff is aimed at Mexico, where many heavy trucks are made. The U.S.-Mexico-Canada Agreement, a trade deal negotiated in Trump’s first term, is coming up for negotiation. “I don’t think that (the tariff) was done by accident, Appleton said. “They wanted to put some more pressure onto the Mexicans” to make concessions in the talks.\n\nUsing Section 232 of the Trade Expansion Act of 1962, Trump had launched investigations into whether imports of pharmaceuticals, lumber and heavy trucks posed a threat to U.S. national security.\n\nHe’d justified his broader tariffs another way: by declaring national emergencies under a 1977 law. But two courts have ruled that Trump overstepped his authority by invoking the International Emergency Economic Powers Act (IEEPA) to impose import taxes. The Supreme Court is hearing the case on appeal.\n\nRobert Lawrence, a professor of International trade and investment at Harvard University, said that using Section 232 gives the president a Plan B if the courts strike down his IEEPA tariffs. “He now has insurance and shows that he’s going to be able to get away with raising tariffs, even if he loses that case.”\n\nBut Ted Murphy, co-leader of the trade practice at the Sidley Austin law firm, said: “It’s hard to discern much of a plan … What the administration does is they identify a problem and then the solution is a big tariff. The question is whether that’s really as nuanced or strategic as it could be. There could be a strategy but it’s hard to discern from a tweet.’’","summary":"Naturepedic, a mattress and furniture company based outside Cleveland, has been planning to introduce an upscale upholstered headboard late this year or early in 2026. But President Donald Trump has thrown those plans into disarray. On Thursday night, the president announced on social media that he was slapping a 30% tax on imported upholstered furniture. [&#8230;]","url":"https://www.bostonherald.com/2025/09/27/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-and-heavy-trucks/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/volvo-trucks.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-27 21:37:33","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.068},{"id":364069538,"title":"Dominion, Giuliani reach confidential settlement in $1.3bn defamation lawsuit","text":"Dominion Voting Systems has reached a confidential settlement with Rudy Giuliani, the former personal attorney to United States President Donald Trump, in a $1.3 billion defamation lawsuit tied to false claims about the 2020 presidential election.\n\nThe case, filed in January 2021, accused Giuliani of spreading “defamatory falsehoods” alleging Dominion rigged the election in favour of Joe Biden. The company said Giuliani’s remarks, which were amplified through media appearances and his podcast, damaged its reputation while enriching him financially.\n\nIn a court filing on Friday, both parties requested a voluntary dismissal of the case. The settlement terms remain undisclosed, with each side agreeing to bear its own legal costs and expenses.\n\nALSO READ:USAID funding withdrawal left huge gap in humanitarian response — Yobe agency boss \n\nThe deal comes just days after Dominion reached a similar confidential settlement with Sidney Powell, another former Trump lawyer who was also sued for $1.3 billion over her role in promoting baseless election conspiracy theories.\n\nDominion has pursued multiple legal actions since 2021, including its high-profile settlement with Fox News, which paid $787.5 million earlier this year to resolve claims over its coverage of election-related misinformation.\n\nGiuliani’s attorney did not immediately respond to requests for comment.\n\nALSO READ TOP STORIES FROM NIGERIAN TRIBUNE","summary":"Tribune Online\n\nDominion, Giuliani reach confidential settlement in $1.3bn defamation lawsuit\n\n\nThe deal comes just days after Dominion reached a similar confidential settlement with Sidney Powell, another former Trump lawyer who was also sued for $1.3 billion...\n\n\nDominion, Giuliani reach confidential settlement in $1.3bn defamation lawsuit\n\nTribune Online","url":"https://tribuneonlineng.com/dominion-giuliani-reach-confidential-settlement-in-1-3bn-defamation-lawsuit/","image":"https://tribuneonlineng.com/wp-content/uploads/2025/09/Rudy-Giuliani-the-former-personal-attorney-to-United-States-President-Donald-Trump.jpg","video":null,"publish_date":"2025-09-27 21:33:25","author":"Esther Amao","authors":["Esther Amao"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.453},{"id":364078648,"title":"Russian minister warns NATO any aggression will be met with a 'decisive response'","text":"As new tensions rise between Russia and NATO powers, Moscow's top diplomat says his nation doesn't intend to attack Europe but will mount a \"decisive response\" to any aggression.\n\nRussian Foreign Minister Sergey Lavrov spoke at the UN General Assembly following a spate of incursions into NATO's airspace — intrusions the alliance blames on Russia — that have raised alarm around Europe. After which NATO jets downed drones over Poland, and Estonia said Russian fighter jets flew into its territory and lingered for 12 minutes.\n\nRussia has denied that its planes entered Estonian airspace and has said the drones didn't target Poland, with Moscow's ally Belarus maintaining that Ukrainian signal-jamming sent the devices off course.\n\nBut European leaders see the incidents as intentional, provocative moves meant to rattle NATO and to suss how the alliance will respond. The alliance warned Russia last week that NATO would use all means to defend against any further breaches of its airspace.\n\nAt the UN, Mr Lavrov maintained that Russia was facing threats.\n\n\"Russia has never had and does not have any such intentions\" of attacking European or NATO countries, he said.\n\n\"However, any aggression against my country will be met with a decisive response. There should be no doubt about this among those in NATO and the EU.\"\n\nSpeaking three years into the Ukraine war\n\nMr Lavrov spoke three years into Russia's invasion of Ukraine, a war that the international community has broadly deplored.\n\nUS President Donald Trump said this week that he believed Ukraine could win back all the territory it has lost to Russia. It was a notable shift in tone from a US leader who had previously suggested Ukraine would need to make some concessions and could never reclaim all the areas Russia has occupied since seizing the Crimean Peninsula in 2014, and launching a full-scale invasion in 2022.\n\nJust three weeks earlier, Russian President Vladimir Putin said his country and the US had a \"mutual understanding\" and that Mr Trump's administration \"is listening to us\". Mr Trump and Mr Putin held a summit in Alaska in early August, but left without a deal to end the war.\n\nSounding a notably open note from a country that has often lambasted the West, Mr Lavrov noted the summit and said Russia had \"some hopes\" to keep talking with the US.\n\n\"In the approaches of the current US administration, we see a desire not only to contribute to ways to realistically resolve the Ukrainian crisis, but also a desire to develop pragmatic cooperation without adopting an ideological stance,\" the diplomat said.\n\nPortraying the powers as counterparts of sorts, he said: \"Russia and the US bear a special responsibility for the state of affairs in the world, and for avoiding risks that could plunge humanity into a new war.\"\n\nTo be sure, Mr Lavrov still had sharp words for NATO, an alliance that includes the US, and for the West in general and the European Union.\n\nTrump's emerging view of Ukraine is part of the equation\n\nMr Trump's new view of Ukraine's prospects came after he met with its president, Volodymyr Zelenskyy, on the sidelines of the General Assembly on Tuesday — seven months after a televised blow-up between the two in the Oval Office. This time, the doors were closed, and the tenor was evidently different — \"a good meeting,\" as Mr Zelenskyy described it in his assembly speech the next day.\n\nFor the fourth year in a row, Mr Zelenskyy appealed to the gathering of presidents, prime ministers and other top officials to get Russia out of his country — and warned that inaction would put other countries at risk.\n\n\"Ukraine is only the first,\" he said.\n\nRussia has offered various explanations for the Ukraine war, among them ensuring Russia's own security after NATO expanded eastward over the years and drew closer to Ukraine after Russia's move into Crimea. Russia has also said its offensive was meant to protect Russian speakers in eastern Ukraine.\n\nUkraine and the West have denounced Russia's invasion as an unprovoked act of aggression.\n\nRussia condemns Israel's attack on Gaza\n\nAddressing the devastating war in Gaza, Mr Lavrov condemned Hamas militants' surprise attack in southern Israel on October 7, 2023, but said \"there is no justification\" for Israel's killing of Palestinian civilians, including children.\n\nThe Hamas attack killed about 1,200 people in Israel; 251 were taken hostage. Israel's sweeping offensive has killed more than 65,000 Palestinians in Gaza, according to the Gaza Health Ministry. It does not give a breakdown of civilian and combatant deaths but says around half of those killed were women and children.\n\nMr Lavrov also said there was no basis for any potential Israeli annexation of the West Bank, which Palestinians consider a key part of their future state, along with Gaza and east Jerusalem.\n\nIsrael hasn't announced such a move, but several leading members in Benjamin Netanyahu's government have advocated doing so. Officials recently approved a controversial settlement project that would effectively cut the West Bank in two, a move critics say could doom chances for a Palestinian state.\n\nBetween the war in Gaza and the situation in the West Bank, \"we are essentially dealing with an attempt at a kind of coup d'etat aimed at burying UN decisions on the creation of a Palestinian state,\" Mr Lavrov said.\n\nThe international community has long embraced a \"two-state solution\" to the Israeli-Palestinian conflict.\n\nBut Mr Netanyahu rejects the idea of a Palestinian state, saying it would reward Hamas — a position he reiterated on Friday at the General Assembly.","summary":"While Russia does not intend to attack Europe, its Foreign Minister Sergey Lavrov has not ruled out action against NATO aggression.","url":"https://www.abc.net.au/news/2025-09-28/russian-foreign-minister-sergey-lavrov-warns-nato-europe-at-unga/105825572","image":"https://live-production.wcms.abc-cdn.net.au/a73e4f67c8401f0f2cebc8ae3323c66f?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-09-27 21:30:42","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.098}]}