{"offset":0,"number":50,"available":14628,"news":[{"id":285554560,"title":"Trump Criticizes DEI After DC Plane Crash, Despite It Not Applying To Air Traffic Controllers","text":"President Donald Trump claimed on Thursday, without citing evidence, that diversity, equity, and inclusion (DEI) initiatives for air traffic controllers at the Federal Aviation Administration (FAA) under Democratic presidents were partly to blame for the tragic plane and helicopter collision in Washington, DC, on Wednesday night. The collision involved an American Airlines passenger jet and a U.S. Army Black Hawk helicopter, resulting in the deaths of all 67 people aboard both aircraft. This marks the first major commercial airline crash in the United States since 2009.\nDuring a White House briefing, Trump stated, \"I put safety first, Obama, Biden, and the Democrats put policy first, and they put politics at a level that nobody's ever seen,\" even as the investigation into the crash is just beginning. He cited a story about a group within the FAA that had \"determined that the [FAA] workforce was too white\" and made concerted efforts to change that during the Obama administration.\nLater that day, Trump signed an executive order appointing Christopher Rocheleau, a 22-year veteran of the FAA, as acting commissioner of the agency. He also signed a second executive order aimed at undoing the \"damage\" caused by the \"Biden administration's DEI and woke policies.\" Trump emphasized, \"We want the most competent people. We don't care what race they are.\"\nWhen asked whether he was saying the crash was the result of diversity hiring, Trump responded, \"we don't know\" what caused the crash, adding that investigators are still looking into it. Despite his claims, DEI and similar programs do not apply to air traffic control hiring. Applicants must pass a medical exam, an aptitude test, and a psychological test that is more stringent than that required of a pilot, according to Chris Wilbanks, FAA deputy vice president of safety and technical training.\nIn 2022, 57,000 people applied for an air traffic control (ATC) position, and 2,400 qualified to attend the academy. Of those, only 1,000 made it to the first day of training. Wilbanks stated that 72% make it through the academy, and roughly 60% of those will finish training. The training process lasts about three to four years from the hire date, and applicants must be younger than 31 and retire by age 55.\nNo determination of fault in the crash has been made, and the National Transportation Safety Board (NTSB) is conducting an investigation. NTSB Chairwoman Jennifer Homendy stated, \"As part of any investigation, we look at the human, the machine, and the environment.\"\nSeveral Cabinet officials spoke after Trump to address the crash. Transportation Secretary Sean Duffy emphasized, \"What happened yesterday shouldn't have happened,\" and stressed the importance of reforms to prevent future mistakes. Defense Secretary Pete Hegseth noted that the Department of Defense must be \"colorblind and merit-based.\"\nVice President JD Vance also alluded to DEI having a part in the crash, stating, \"We want the best people at air traffic control.\" However, when pressed by a reporter, Trump claimed that similar language on DEI policies existed on the FAA's website during his first term and blamed the Biden administration for changes.\nFormer Transportation Secretary Pete Buttigieg responded to Trump's comments, stating, \"Despicable. As families grieve, Trump should be leading, not lying.\" He emphasized that safety was a priority during his tenure and criticized Trump's actions and words as \"dangerous, racist, and ignorant.\"\nIllinois Rep. Robin Kelly also condemned Trump's comments, calling them \"dangerous, racist, and ignorant.\" She stressed the need for an investigation to provide closure to grieving families and prevent future crashes.\nAs the investigation into the tragic collision continues, the focus remains on understanding the factors that led to the incident and ensuring that such accidents do not happen again. The debate over DEI policies and their impact on aviation safety highlights the complexities of balancing diversity initiatives with maintaining high standards in critical sectors.\nALSO READ: Reagan Airport's Old Tech Could Have Contributed To DC Collision, Says Captain Sully Sullenberger","summary":"Trump blames DEI policies for DC air collision, despite lack of evidence. Investigation into the tragic crash continues.","url":"https://www.newsx.com/world/trump-criticizes-dei-after-dc-plane-crash-despite-it-not-applying-to-air-traffic-controllers/","image":"https://www.newsx.com/wp-content/uploads/2025/01/student-loan-federal-freeze-trump-financial-aid-federal-grant-freeze-federal-funding-are-food-stamps-paused-pell-grant-trump-trump-snap-benefits-federal-student-aid.webp","video":null,"publish_date":"2025-01-31 01:07:13","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":-0.575},{"id":285553978,"title":"Highlights from a significant day of confirmation hearings: Political Desk coverage","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail.\n\nIn today’s edition, Sahil Kapur breaks down everything you need to know from a trio of key Senate confirmation hearings. Plus, Matt Dixon examines how President Donald Trump’s response to the tragic plane crash in D.C. quickly took a political turn. \n\nSign up to receive this newsletter in your inbox every weekday here.\n\n— Adam Wollner\n\nTakeaways from a big day of confirmation hearings\n\nBy Sahil Kapur\n\nIn a crucial day for President Donald Trump’s nominees, Robert F. Kennedy Jr., Tulsi Gabbard and Kash Patel descended on Capitol Hill for confirmation hearings.\n\nThe nominees for health and human services secretary, director of national intelligence and FBI director have all generated controversy for a similar reason: Each has launched searing criticisms of the entities they’ve been chosen to lead.\n\nAnd they all sought to clarify or downplay past stances or remarks that have landed them in hot water to senators who will decide whether to confirm them.\n\nHere are the key takeaways: \n\nKennedy faces skepticism from a key GOP senator: After he repeatedly challenged Kennedy’s views on vaccines, Sen. Bill Cassidy, the chair of the Health, Education, Labor and Pensions Committee, which held Thursday’s hearing, said he was “struggling” with Kennedy’s nomination.\n\nThe Louisiana Republican made clear he hasn’t made up his mind about his vote and has more questions for Kennedy — a rarity for a Republican chair when dealing with a Trump nominee. Cassidy, a doctor, also sits on the Senate Finance Committee, which held a hearing for Kennedy on Wednesday and will vote on whether to report his nomination to the full Senate. \n\nPatel breaks with Trump on Jan. 6 pardons: Under pointed questioning, Patel made a break with Trump on his decision to issue pardons or commutations for 1,500 Jan. 6 criminal defendants, including those who confessed to assaulting police officers. Patel argued that certain violent offenders didn’t deserve leniency.\n\n“I have always rejected any violence against law enforcement, and I have, including in that group, specifically addressed any violence against law enforcement on Jan. 6,” he said. “And I do not agree with the commutation of any sentence of any individual who committed violence against law enforcement.”\n\nGabbard grilled about Edward Snowden: The former Democratic congresswoman from Hawaii was peppered with questions from multiple Republican senators about her past praise of Edward Snowden — the former intelligence contractor who leaked a trove of classified information before he fled to Russia — as a “brave whistleblower.” \n\nGabbard stopped short of disowning her previous remarks or calling him a “traitor” as multiple members of the committee have, saying only that he “broke the law” and revealed important information in doing so.\n\nOf all the nominees who faced hearings Thursday, Gabbard likely has the toughest task in preventing GOP defections. \n\nTrump turns a moment of national mourning into a push for his political agenda\n\nBy Matt Dixon\n\nJust 11 days into his presidency, Donald Trump has been confronted with a national tragedy that claimed dozens of lives after a passenger jet carrying 64 people collided midair with an Army helicopter in the Washington, D.C., region Wednesday night.\n\nHis response bypassed the usual playbook that presidents typically follow after a tragedy, just as his campaign broke from political norms time and again.\n\nWithout waiting for a full investigation — or a list of the victims — the president began pointing fingers and going on the attack. Rather than using it as a moment to forgo political combat and focus on the victims, he took the opportunity to push his agenda against diversity, equity and inclusion (DEI) efforts.\n\nHis approach moved attention away from recovery efforts, victims and the investigation into the crash to a debate over one of his biggest political targets. And while Trump faced criticism for his handling of the moment, it was in line with how he has eschewed the way traditional politicians operate. \n\nTrump quickly put out a social media post casting blame for the accident Wednesday night, before many facts were known.\n\nAt a White House press briefing Thursday, he read through a more traditional speech expressing condolences, but then launched into remarks that felt more like something from a campaign rally, calling a Democratic official “a disaster,” castigating his predecessors and going after DEI — despite any evidence so far that these policies contributed to the midair collision.\n\n“I’ve been an investigator for 35 years, investigating aircraft accidents, and when you talk about standards, what we just saw does not meet the published international standards of providing information in the wake of an accident,” Jeff Guzzetti, a former investigator for the Federal Aviation Administration and the National Transportation Safety Board, told MSNBC.\n\nNew hire: During the press conference, Trump also appointed Christopher Rocheleau as acting FAA commissioner, a position that had been vacant. \n\nFollow live coverage here →\n\nThat’s all From the Politics Desk for now. Today’s newsletter was compiled by Adam Wollner and Faith Wardwell.\n\nIf you have feedback — likes or dislikes — email us at [email protected]","summary":"Internewscast Journal\n\nInternewscast\n\n\nWelcome to the online version of From the Politics Desk, an evening newsletter&#8230;\n\n\nThis Post: Highlights from a significant day of confirmation hearings: Political Desk coverage first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/highlights-from-a-significant-day-of-confirmation-hearings-political-desk-coverage/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-The-key-moments-from-a-big-day.jpg","video":null,"publish_date":"2025-01-31 00:57:33","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.069},{"id":285554218,"title":"‘Scared’ travelers back at Ronald Reagan airport hours after crash killed 67 as AA staff say they’ve been ‘kept in dark’","text":"TRAVELERS are terrified to fly and airport workers are left without answers at the Washington DC airport near where a midair collision between a military helicopter and a passenger jet killed 67 people.\n\nRonald Reagan Washington National Airport is up and running again after a Black Hawk chopper crashed into an American Airlines flight preparing for arrival just before 9 pm on Wednesday.\n\nThe American Airlines plane, carrying young families and elite figure skaters, was en route to the DC airport when it was smashed into three pieces that plunged into the frigid waters of the Potomac River.\n\nNo one on either aircraft survived, making it the deadliest US air crash in nearly a quarter century.\n\nOfficials still haven't identified the reason behind the sudden crash, despite American Airlines CEO Robert Isom throwing blame on the helicopter and Donald Trump pointing the finger at unqualified workers due to diversity and inclusion efforts.\n\nAfter closing for 14 hours following the collision, DCA reopened at 11 am on Thursday.\n\nIt comes as...\n\nAll 64 passengers are feared dead with at least 28 bodies pulled from riverCCTV captures moment of the crashChilling audio reveals the final moments of flightWorld champion figure skaters confirmed to be on boardFigure skater shared final, tragic picture from inside the plane before takeoffHusband reveals wife's final text from doomed jetRescue efforts hindered by freezing & dark conditions with 12 hours before severe weather comesAmerican Airlines CEO blames Black Hawk pilotsTrump blames Obama and Biden's DEI polices at FAA for crashAmerican Airlines pilots and crew namedPassenger names beginning to be released, including teens, parents, and coaches\n\nThe airport was a somber scene as displays showed canceled flights and travelers were visibly on edge.\n\n\"I'm flying out, it’s pretty tragic,\" Abhi, a 25-year-old traveler told The U.S. Sun at the airport.\n\n\"I fly regularly and so it does make me feel a little bit more aware than I usually do when I’m flying.\n\n\"So, definitely I feel a little bit more aware and scared, but you got to keep going and got to move on you know.”\n\nA Maryland resident named Carlos Estrada told The U.S. Sun he was waiting for his sister's flight to arrive from Arkansas after it was rerouted to New York.\n\n\"She’s very concerned, she’s been texting me the whole time,\" Estrada said.\n\n\"It makes me uneasy. We’re all here hurting in some way.”\n\nAs the investigation into the tragedy continues, American Airlines workers have been left scrambling for answers.\n\n\"They've kept us in the dark,\" an American Airlines worker who asked to remain anonymous told The U.S. Sun.\n\n\"We don’t know much about who was onboard.\"\n\nThe 33-year-old employee said airport workers are trying to carry on with their usual tasks despite the airline not officially identifying the employees on board.\n\n\"We’ve been going about our business, helping passengers check in their bags and stuff like that, but as far as names we haven’t been told [anything].”\n\nAmerican Airlines hasn't returned The U.S. Sun's request for comment.\n\nThe airline worker said the collision was \"tragic,\" adding, \"It’s something you wish wasn’t true.\"\n\n\"We all came in this morning shocked, just in disbelief. You feel for the victims and their families.”\n\nHe noted the airport's eerie emptiness when he arrived for his morning shift.\n\n“I’ve never seen the airport this deserted before,\" the worker said.\n\n\"Now more people are starting to arrive to catch their flights, but this morning there was barely anybody here except the airport workers. \n\n\"It was scary.”\n\nAt least 38 flights were delayed going in and out of DCA on Thursday, while over 500 were canceled, according to FlightAware.\n\nINVESTIGATION CONTINUES\n\nHundreds of emergency workers continue to search the wreckage from the water to recover the bodies of the crash victims.\n\nThere were 64 American Airlines passengers onboard the flight from Wichita, Kansas, to Washington DC when disaster struck.\n\nThree soldiers on the Black Hawk died when the military helicopter smashed into the passenger jet at a low elevation.\n\nHorrifying footage showed the moment the twin-engine Bombardier CRJ700 jet collided with the US Army helicopter, causing a bright flash to light up the sky.\n\nThe official reason for the crash remains a mystery as the black box data from both aircraft have yet to be recovered.\n\nThe Federal Aviation Administration revealed the airport's air traffic controller tower was reportedly short-staffed at the time of the crash, according to the The New York Times.\n\nA preliminary report said the tower was operating with a third of its recommended staff for years.\n\nDuring the crash, the controller guiding the plane to land was doing two jobs at once, according to the FAA.\n\nChilling audio recordings captured the tower's final attempts at communicating with the military helicopter. \n\nSKATERS AND THEIR COACHES MOURNED\n\nWhile officials have not formally identified any victims yet, tributes and condolences have been posted across social media.\n\nOne of the first tributes to emerge was in memory of US figure skater Spencer Lane, 16.\n\nLane posted what turned out to be a final Instagram photo showing he was on the ill-fated flight.\n\nIt was then revealed the plane was full of skaters, coaches, and their families all returning from a training camp in Wichita.\n\nAmong the group was a husband-wife duo Evgenia Shishkova, 52, and Vadim Naumov, 55, who coached up-and-coming skaters.\n\nThe pair garnered international acclaim as the 1994 ice skating world champions.\n\nAlso on board were a pair of sister figure skaters and their parents.\n\nEverly Livingston, 14, and her younger sister Alydia, 11, posted a photo on their joint Instagram account from US Figure Skating Championships in Wichita just days before the crash.\n\nIt would turn out to be their last public post.\n\nEXPERIENCED PILOTS AT THE HELM\n\nTributes also poured in for the captain and first officer flying American Airlines flight 5342.\n\nCaptain Jonathan Campos, 34, and First Officer Sam Lilley, 28, had over eight years of flying experience between them.\n\nCampos was remembered as a \"skilled and dedicated pilot with an undeniable passion for flying\" by Epic Flight Academy, where he was a flight instructor.\n\n\"Our deepest condolences go out to Jonathan’s family, friends, and all those who lost their lives or were impacted by this devastating tragedy. Our thoughts and prayers are with you during this incredibly difficult time,\" the statement obtained by local NBC affiliate WFLA concluded.\n\nLilley was recently engaged and getting ready for a wedding this fall, his father Timothy shared in a Facebook tribute.\n\n“I was so proud when Sam became a pilot,” Timothy Lilley wrote.\n\n“Now it hurts so bad I can’t even cry myself to sleep. I know I’ll see him again but my heart is breaking.”","summary":"","url":"https://www.thescottishsun.co.uk/news/14258038/washington-dc-crash-american-airlines-airport-victims/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/01/SC-Travelers-Scared-Off-Plat-copy.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-01-31 00:44:35","author":"Carsen Holaday,Israel Salas-Rodriguez","authors":["Carsen Holaday","Israel Salas-Rodriguez"],"language":"en","source_country":"gb","sentiment":-0.269},{"id":285551188,"title":"Q&A: OpenAI on rival DeepSeek and partnering with the government","text":"The first few days of the Trump administration have brought big changes in a number of areas — including the business of artificial intelligence.\n\nFirst, there was the announcement of Stargate, a $500 billion artificial intelligence infrastructure project. It's a private venture — though President Donald Trump unveiled it at the White House, and he's throwing his support behind it.\n\nThen there was the Chinese startup DeepSeek, whose chatbot shocked investors when it became the most downloaded free app in the U.S. App Store.\n\nAnd now OpenAI — the company behind ChatGPT and a big part of Stargate — has announced it's partnering with the U.S. National Laboratories to supply the government with advanced models for things like cybersecurity, energy infrastructure and nuclear security.\n\nNPR's Mary Louise Kelly spoke with OpenAI's Chief Global Affairs Officer Chris LeHane about the announcement.\n\nThis interview has been edited for length and clarity.\n\nInterview highlights\n\nMary Louise Kelly: Start with this new partnership with the National Labs. In a few sentences, why is this a big deal? And what is the time frame for it bearing fruit?\n\nChris LeHane: In short form, it is OpenAI bringing its leading edge innovation and AI technology into the United States National Labs. It will be critical as those labs move forward in research and development that will support national security imperatives. But at the end of the day, what it's really bringing is our leading edge tech, the innovation that we're building and making sure that we're doing it in collaboration and in partnership with the U.S. government.\n\nKelly: Returning to Stargate, this huge new $500 billion joint venture that has just been announced. OpenAI is a key player in Stargate. What is Stargate and why do we need it?\n\nLeHane: Stargate is infrastructure. At the end of the day, the U.S. and the People's Republic of China are in a race, a competition to see who ultimately leads in AI. Right now, the U.S. has a lead. It's not a huge lead, but we do have a lead. The stakes could not be bigger: Are we going to build the world on democratic, free AI, or is it going to be authoritarian, autocratic AI? And what will decide that is something called compute. And compute is, if you add up the following pieces: chips, data, talent and energy. And if you put that full stack together, that represents 21st century AI infrastructure. And so what we announced last week with President Trump, with our partners at Oracle and SoftBank, is a $500 billion investment in U.S. AI infrastructure to generate that compute, which will help ensure that the U.S. maintains its lead in AI.\n\nKelly: It sounds lofty. Will Stargate create something useful to the average American?\n\nLeHane: First of all, there are going to be hundreds of thousands of jobs created just by the construction of this. But what this also means is that the technology that's being generated by AI will be accessible in a much broader way to many Americans. Think about education – bringing AI into schools to give teachers tools to help educate kids even better. Think about health care, the ability to make sure people have access to health care and the ability to diagnose ailments, challenges, diseases at a much earlier stage.\n\nKelly: Does it need to be this expensive? $500 billion is a lot of money, and DeepSeek, the Chinese AI startup, has prompted a conversation about whether foreign rivals are doing things a lot cheaper than American companies.\n\nLeHane: The big takeaway for us is that it's absolutely critical that the U.S. does have the infrastructure to be able to maintain its lead. And so when you talk about the $500 billion, this is not U.S. taxpayer money. This is private sector money, because there's an understanding that as AI continues to move forward, there's going to be more and more of a demand for the AI, which then requires more and more compute.\n\nKelly: DeepSeek dethroned ChatGPT, your AI app, this week as the most downloaded free app in the U.S. App Store. Your company says it is investigating whether DeepSeek inappropriately used OpenAI data. Where does that stand?\n\nLeHane: We're in the process of reviewing what may or may not have occurred. There is something that happens in the AI world called distillation. And distillation is a complex idea. But effectively, can people send a lot of stuff at your models and be able to take information out of it, and then use that information to replicate something else?\n\nKelly: I did want to ask what is the difference between a rival company like DeepSeek possibly accessing your data, and you training your own products like ChatGPT on other people's work without their permission?\n\nLeHane: Maybe a way to think about it is: I go to the library, borrow a book, I can read that book and return the book. I have certain information. If you go to the library, take the book, never return the book, put the book out under your name – those are two different ways to potentially think about this. But I think that the big point – the North Star that I would just really emphasize – is that there is a real competition between the U.S. and China. And the consequences and stakes of that competition are enormous.","summary":"OpenAI — the company behind ChatGPT and a big part of Stargate — is partnering with the U.S. National Laboratories. NPR's Mary Louise Kelly spoke with OpenAI's Chris LeHane, here are the highlights.","url":"https://www.npr.org/2025/01/30/g-s1-45672/trump-ai-chatgpt-deepseek-china-stargate","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5936x3958+0+0/resize/5936x3958!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fb9%2Fc93799a34eadbe3cc824e42bec98%2Fap25021809430824.jpg","video":null,"publish_date":"2025-01-31 00:37:11","author":"Mary Louise Kelly","authors":["Mary Louise Kelly"],"language":"en","category":"politics","source_country":"US","sentiment":-0.166},{"id":285551200,"title":"Commonwealth Bank and Westpac issue good mortgage news for Australians","text":"Commonwealth Bank and Westpac issue good mortgage news for Australians\n\nBig Four banks all expecting February rate cut\n\nREAD MORE: Jim Chalmers says worst 'behind us' \n\nPODCAST: The biggest takeaways from RFK Jr’s confirmation hearing – on Welcome to MAGAland\n\nBy STEPHEN JOHNSON, ECONOMICS REPORTER FOR DAILY MAIL AUSTRALIA\n\nPublished: 00:05 GMT, 31 January 2025 | Updated: 00:36 GMT, 31 January 2025\n\nAustralia's big banks are telling borrowers to expect rate cuts next month - but mortgage holders overseas have been getting generous relief since last year.\n\nNAB on Thursday became the last of the Big Four banks to expect the Reserve Bank of Australia to deliver the first rate cut since 2020 in three weeks' time, following surprisingly low inflation.\n\nA quarter of a percentage point rate cut on February 18 would see a borrower with an average $600,000 mortgage save $92 on monthly repayments. \n\nThe announcement was made as the Bank of Canada announced its sixth rate cut since June 2024.\n\nCanada's latest policy rate of 3 per cent is significantly lower than Australia's equivalent cash rate of 4.35 per cent. \n\nNew Zealand's cash rate is slightly lower at 4.25 per cent, following three rate cuts in 2024 to fight a recession.\n\nLike Australia, Canada has relied on high immigration to ward off a technical recession.\n\nBut unlike Australia, Canada is more reliant on exporting goods to the United States and is preparing for President Donald Trump's 25 per cent import tariffs.\n\nAustralia's big banks are telling borrowers to expect rate cuts next month - but mortgage holders overseas have been getting generous relief since last year (pictured are swimmers at Sydney's Bondi Beach)\n\nThe Bank of Canada released a new monetary policy report on Thursday warning of 'more-than-usual uncertainty because of the rapidly evolving policy landscape, particularly the threat of trade tariffs by the new administration in the United States'.\n\nBREAKING NEWS\n\nMajor bank's huge move good news for every Aussie with a mortgage\n\n'If broad-based and significant tariffs were imposed, the resilience of Canada's economy would be tested,' it said.\n\n'We will be following developments closely and assessing the implications for economic activity, inflation and monetary policy in Canada.'\n\nWhen it comes to the cost-of-living crisis, Canada's headline inflation rate of 1.8 per cent in December was lower than Australia's equivalent consumer price index of 2.4 per cent, which was the lowest since March 2021. \n\nCanada's underlying inflation rate, stripping out volatile items, was also lower than Australia's equivalent level during the December quarter.\n\nThe Canadian trimmed mean measure of inflation was at 2.5 per cent compared with Australia's 3.2 per cent level, which was only slightly above the Reserve Bank's 2 to 3 per cent target. \n\nThe announcement was made as the Bank of Canada announced its sixth rate cut since June 2024 (pictured is Vancouver in Canada)\n\nIn Australia, the Commonwealth Bank and Westpac have the most generous relief predictions, expecting four cuts in 2025 that would take the cash rate from 4.35 per cent to 3.35 per cent. \n\nFor a borrower with an average mortgage of $642,121, these cuts would reduce monthly repayments from $4,055 to $3,642 - a saving of $413 per month. \n\nBut even in this scenario, Australia would still have a higher cash rate than Canada and even more unaffordable property prices compared with incomes.\n\nAustralians missed out in 2024 as borrowers also received rate cuts in the United States, UK and across Europe.\n\nCommonwealth BankWestpacDonald TrumpNAB\n\nShare or comment on this article:\nCommonwealth Bank and Westpac issue good mortgage news for Australians\n\nAdd comment","summary":"Aussie borrowers have been missing out on relief as interest rates have been plunging overseas.","url":"https://www.dailymail.co.uk/news/money/article-14344055/Commonwealth-Bank-Westpac-issue-good-mortgage-news-Australians.html","image":"https://i.dailymail.co.uk/1s/2025/01/30/22/94705009-0-image-a-22_1738276176678.jpg","video":null,"publish_date":"2025-01-31 00:36:11","author":"Editor,Stephen Johnson","authors":["Editor","Stephen Johnson"],"language":"en","source_country":"gb","sentiment":-0.3},{"id":285552812,"title":"Alberta Premier Smith pitching joint Canada-U.S. Norad military base in Arctic","text":"In a Thursday statement, Smith said she pitched the idea at a meeting on Wednesday with fellow premiers and Prime Minister Justin Trudeau.\n\n“To further bolster Canada-U.S. Arctic security, I asked my provincial and federal counterparts in the first ministers’ meeting to consider establishing a joint Canada-U.S. Norad region base in Northern Canada, similar to the Canadian Norad Region (CANR) headquarters in Winnipeg, Manitoba,” she wrote.\n\nSmith has been urging more collaboration with the U.S., as President Donald Trump has threatened to impose 25 per cent tariffs on Canadian goods starting Saturday.\n\n“The U.S. has emphasized the need for immediate measures on border security, and l stressed the importance of Canada taking that demand seriously,” said Smith of Wednesday’s meeting.\n\nShe has called for Ottawa to immediately appoint a Canadian border czar to work with the U.S. on securing the shared border.\n\nWhile Ottawa has pledged $1.3 billion for its border security plan, Smith’s provincial government is putting $29 million into beefing up surveillance of its shared border with Montana.\n\nHoward Lutnick, Trump’s pick to lead the U.S. Department of Commerce, told the U.S. Senate on Wednesday that he sees the tariffs as a way to get Canada to take action on border security, but they could be followed by other tariffs.","summary":"EDMONTON &#8212; Alberta Premier Danielle Smith is calling for a joint Canada-U.S. Norad military base in Northern Canada, expanding the organization&#8217;s aerospace and maritime defence efforts. In a Thursday statement, Smith said she pitched the idea at a meeting on Wednesday with fellow premiers and Prime Minister Justin Trudeau. &#8220;To further bolster Canada-U.S. Arctic security, [&#8230;]","url":"https://torontosun.com/news/national/alberta-premier-smith-pitching-joint-canada-u-s-norad-military-base-in-arctic","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/01/alta-smith-norad-20250130.jpg","video":null,"publish_date":"2025-01-31 00:32:50","author":"Canadian Press","authors":["Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.054},{"id":285550658,"title":"New Mexico Man Indicted for Allegedly Making Death Threats Against Trump","text":"A New Mexico man has been charged for allegedly making death threats against President Donald Trump and others on social media.\n\nThe first post in question, made on Jan. 3 on social media platform X, tagged Trump’s profile and stated, “I got my eyes you sir!” adding “you and your rich friends are dead,” and declaring “no threat a promise.” The post also referenced a Trump rally scheduled for Jan. 19th, the day before his inauguration.\n\nAnother post on the same day tagged both Trump and his head of the Department of Government Efficiency (DOGE), tech billionaire Elon Musk, saying, “see you on the 19th for war.” A third post, a response to a post by Trump, simply said, “die.”\n\nAccording to court documents, officers from the Secret Service, FBI, and Albuquerque Police Department interviewed Leveque on Jan. 6. During the interview, Leveque admitted to making the threatening posts, saying that he was “frustrated with the government.”\n\nLeveque also confirmed a Facebook post from Jan. 4, in which he stated he had just purchased his first gun. He allegedly wrote, “Hey world hey America hey trump hey [CEOs] get rich we are hunting you down! Hahaha I’m getting ready myself! Here we come it ends now.”\n\nLeveque is currently in custody awaiting trial. A trial date has not yet been set.\n\nThe indictment was issued amid a leadership change in the Secret Service following two confirmed attempts on Trump’s life in the months leading to his nonconsecutive return to the White House.\n\nOn July 13, 2024, during a campaign rally in Butler, Pennsylvania, a man opened fire from the roof of a nearby building, killing one spectator, injuring two others, and grazing Trump’s right ear. The Secret Service faced intense scrutiny over how the man was able to reach a rooftop so close to the stage where Trump was speaking.\n\nAnother incident occurred on Sept. 13, 2024, when 58-year-old Ryan Wesley Routh was spotted at the International Golf Club in West Palm Beach, Florida. Routh, carrying a rifle, was seen in the bushes by the golf course before Trump arrived. A note found in Routh’s home later confirmed his intent to harm Trump.\n\nCurran takes over from Ronald Rowe, who has served as acting director since July, when Kimberly Cheatle resigned amid widespread criticism over the Secret Service’s failure to prevent the deadly shooting at the Pennsylvania rally.\n\nAppointment to lead the Secret Service doesn’t require Senate confirmation.","summary":"The 37-year-old man is accused of making social media posts threatening to harm Trump and others at a Jan. 19 rally.","url":"https://www.theepochtimes.com/us/new-mexico-man-indicted-for-allegedly-making-death-threats-against-trump-5801654","image":"https://img.theepochtimes.com/assets/uploads/2025/01/19/id5795111-BP6A0486-sb-wp_1-300x180.jpg","video":null,"publish_date":"2025-01-31 00:32:20","author":"Bill Pan","authors":["Bill Pan"],"language":"en","source_country":"us","sentiment":-0.143},{"id":285554930,"title":"US aid freeze leads to suspension of health care to Myanmar refugees in Thailand","text":"By CHALIDA EKVITTHAYAVECHNUKUL and GRANT PECK\nAssociated Press\n\nBANGKOK (AP) — A 90-day freeze on foreign assistance programs announced by U.S. President Donald Trump has led to cuts in services to refugees from war-torn Myanmar, including the shutdown of hospital care in camps in Thailand where more than 100,000 are living, activists and Thai officials said Wednesday.\n\nAbout 106,000 long-term refugees live in nine camps along Thailand’s western border with Myanmar, according to the Border Consortium, which coordinates and supplies food, shelter and other support to most of them. The consortium’s mid-year report last year said the U.S. State Department’s Bureau of Population, Refugees, and Migration was its largest donor, contributing 69% of its funding.\n\nAround 80% of the camps’ residents are from the Karen ethnic minority, whose homeland in eastern Myanmar in [sic] embroiled in combat. The Karen have been battling for greater autonomy from Myanmar’s central government for more than seven decades. Intermittent fighting escalated sharply after Myanmar’s army seized power from the elected government of Aung San Suu Kyi in 2021, causing more to flee across the border.\n\nKaren News, an online news site serving the Karen community, reported Wednesday that several charity groups and NGOs providing assistance for refugees from Myanmar suspended operations after U.S. Secretary of State Marco Rubio last Friday issued an order halting nearly all existing and new foreign aid.\n\nOn Tuesday, Rubio agreed to at least temporarily keep spending money on humanitarian programs that provide life-saving medicine, medical services, food, shelter and subsistence assistance, but it was not immediately clear which programs if any affecting refugees from Myanmar would be included.\n\n“All organizations relying on U.S. humanitarian assistance in the region have been affected. Some operations providing education, health care, and support for war-displaced communities have now been suspended,” Karen News cited an unidentified worker at an NGO based in Mae Sot, in Thailand’s Tak province, as saying.\n\nIt said the groups included the New York-headquartered International Rescue Committee, or IRC, which provide hospital services at the border camps, had suspended their operations on Monday. IRC did not immediately comment on the situation.\n\nThai officials said they were aware of the crisis and would ensure that seriously ill patients in the camps would be cared for in provincial Thai hospitals.\n\nChucheep Pongchai, the governor of Tak province, where three of the refugee camps are located, said 14 patients in a critical condition would be transferred to the province’s Tha Song Yang hospital.\n\nInterior Minister Anutin Charnvirakul said the government’s National Health Security Office has set aside the budget to assist those foreigners who cannot survive on their own.\n\n“No matter how U.S. policy has changed, we won’t let anyone die in our land as long as we can support them,” he said.\n\nThe Jesuit Refugee Service, a charity organization registered in Italy, said that as of Saturday it had suspended its Urban Refugee Program, which serves refugees outside the camps, including in the Thai capital Bangkok.\n\n“This is due to the suspension of funding from our main donor, the U.S. State Department’s Bureau of Population, Refugees, and Migration,” the Jesuit Refugee Service said on its Facebook page. It said it could neither make nor take referrals or register new clients, and services to existing clients were also suspended.","summary":"A 90-day freeze on foreign assistance programs announced by U.S. President Donald Trump has led to cuts in services to refugees from war-torn Myanmar, including the shutdown of hospital care in camps in Thailand where more than 100,000 are living, activists and Thai officials said Wednesday.","url":"https://nwasianweekly.com/2025/01/us-aid-freeze-leads-to-suspension-of-health-care-to-myanmar-refugees-in-thailand/","image":"https://nwasianweekly.com/wp-content/uploads/2025/01/US-aid-freeze-leads-to-suspension-of-health-care-to-Myanmar-refugees-in-Thailand-_F.jpg","video":null,"publish_date":"2025-01-31 00:30:35","author":"Admin,Chalida Ekvitthayav","authors":["Admin","Chalida Ekvitthayav"],"language":"en","category":"politics","source_country":"us","sentiment":0.214},{"id":285551406,"title":"Letters: RFK Jr. nomination should raise alarms for all Americans","text":"RFK Jr. nomination\nshould raise alarms\n\nRe: “Caroline Kennedy warns senators that RFK Jr. is a ‘predator’” (Page A2, Jan. 29).\n\nOf all of the grossly unqualified Cabinet nominees of Donald Trump, the one that is the most dangerous is Robert F. Kennedy Jr., who Trump wants to make the secretary of Health & Human Services, which includes the CDC and FDA.\n\nRFK Jr.’s cousin, Caroline Kennedy, just publicly stated that he has had his children all vaccinated while spreading disinformation that virtually no vaccinations are safe. His debunked conspiracy theories are not limited to health misinformation. He also says, without evidence, that the CIA murdered his uncle, President Kennedy; Sirhan Sirhan did not assassinate his father, Bobby Kennedy; mass shootings are linked to prescription drugs; AIDS is not caused by HIV; and the list goes on.\n\nWhen RFK Jr. was running for president, his siblings published a letter saying, not just that he was unqualified, but that, if elected, he would be “dangerous” for the country.\n\nArthur Straus\nWalnut Creek\n\nWill fires be precursor\nto Prop. 13 reform\n\nRe: “Fire departments lament low staffing” (Page A1, Jan. 27).\n\nAs wildfires are burning through Los Angeles stretching our fire departments to their limits, we must ask why we aren’t investing in public safety. Back in 2020, Proposition 15, the “Schools and Communities First Funding Act,” could have closed corporate loopholes in Prop.13 thus bringing in $12 billion annually for public services, including $1.5 billion for fire departments starting in 2022. Instead of that happening, that money stays with corporations like Chevron and Disney.\n\nWe are facing wildfires, floods and other natural disasters that are continuing to worsen. If leaders refuse to act on combating climate change, then the least they can do is fund emergency responders. Next time Prop. 13 reform is on the ballot, let’s put public safety over corporate greed because our survival depends on it.\n\nJules Pizano\n\nEnding foreign aid\nthreatens U.S. standing\n\nThe Trump administration has made a horrendous decision that puts lives at risk and undermines U.S. credibility around the world. The administration issued a stop-work order on almost all foreign assistance programs around the world.\n\nForeign assistance dollars provide essential services for health care, nutrition, education and more. These programs strengthen U.S. alliances around the world.\n\nThe stop-work order undermines U.S. credibility while putting countless lives at risk. It is also an unconstitutional obstruction of the will of Congress.\n\nSusan Oehser\n\nTrump is no friend\nin the White House\n\nRe: “America finally has a friend in the White House” (Page A8, Jan. 26).\n\nThe letter from Michael Erickson about Donald Trump being a friend in the White House misses the mark by a lot.\n\nThis is a president who promised to lower gasoline and grocery prices, knowing that he had no way to do that. This is a guy who is, so far, acting more like a king than a president.\n\nAnd we are supposed to consider him a “friend in the White House”? I think not.\n\nGeorge Fulmore\n\nTrump keeps promises\nthat benefit himself\n\nRe: “America finally has a friend in the White House” (Page A8, Jan. 26).\n\nI got a little chuckle out of Michael Ericson’s letter about Trump being a “friend in the White House” when he said Trump is “enacting promises made with promises kept.”\n\nSo let’s review his first term:\n\n• Trump was going to build a big, beautiful wall and make Mexico pay for it. Did he? No.\n\n• Trump was going to repeal and replace Obamacare. Did he? No.\n\n• Trump was going to give everyone a big tax cut. Did he? Yes, if you are a millionaire and don’t live in a “blue” state.\n\n• Trump was going to get Roe v. Wade overturned. Did he? Yes, to the detriment of women’s health.\n\nHe’s now promised more tax cuts for the billionaires. I’m sure he’ll follow through on that.\n\nTrump has followed through on one major promise. He released over 1,500 convicted criminals.\n\nOne common theme: The promises he kept are those that serve his own needs.\n\nBob Wheeler\nWalnut Creek","summary":"Also: Prop. 13 reform &#124; U.S. standing &#124; No friend &#124; Benefitting Trump. East Bay Times reader letters to the editor for Jan. 31, 2025.","url":"https://www.mercurynews.com/2025/01/30/letters-rfk-jr-nomination-raise-alarms-americans/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/Trump_Cabinet_Kennedy_55525.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-31 00:30:32","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.019},{"id":285549996,"title":"‘Despicable’: Trump pins crash on diversity","text":"When asked to clarify if he was really blaming the crash on diversity, equity and inclusion (DEI) initiatives, the US President said it “could have been,” but provided no evidence. \n\nThere is as yet no information to suggest diversity programs or so-called “diversity hires” were in any way to blame for the horror crash. \n\nPresident Trump himself said the cause is as yet “unknown” with most theories centring on the crew of the helicopter failing to see the oncoming plane.\n\nA former Biden official has called the President’s comments “despicable” and claimed the new Trump administration’s fired senior staff who “help keep our skies safe”.\n\nHe was asked if he had any plans to go visit the site, as rescue workers scour the Potomac River for bodies and collect debris at the start of a lengthy investigation about the crash. \n\n“I have a plan to visit – not the site. Because what – you tell me. What’s the site? Water. We’re going to go swimming?” he joked.\n\nDisaster unfolded on Wednesday, local time, when American eagle flight AA5342 from Wichita, Kansas, was coming in to land at Ronald Reagan Washington National Airport at about 9pm (1pm Thursday AEDT).\n\nSeconds before touchdown, the Bombardier CRJ700 regional jet with 64 passengers and crew on-board made contact with a US Army Black Hawk (H-60) helicopter. \n\nBoth plummeted into the icy waters of the Potomac River. No survivors have been found. \n\nOn Thursday morning, Mr Trump held a briefing at the White House on the incident. \n\nHe began by saying it was an “hour of anguish,” for the US. \n\n“It’s in moments like this that the differences between Americans fade to nothing compared to the bonds that bind us all.\n\n“We are one family and today we are all heartbroken”.\n\nDEI singled out\n\nHe then went on an anti-DEI tirade, hitting out at diversity programs in the US and claiming people with mental disabilities were being hired for key aviation safety roles. \n\nMr Trump has made curtailing DEI in the federal government a key policy and has signed several executive orders to that effect since he assumed the presidency. \n\nCritics of DEI claim it places race, gender or disability, for instance, above merit for jobs. While DEI proponents have said it encourages unrepresented groups to apply for roles and recognises discrimination exists.\n\nAt the press briefing, Mr Trump claimed former presidents Obama and Biden had lowered standards for air traffic controllers in order to get more diverse staff. \n\n“I put safety first; Obama, Biden and the Democrats put policy first, and they put politics at a level that nobody’s ever seen, because this was the lowest level.\n\n“You have to be talented, naturally talented — geniuses — you can’t have regular people doing that, won’t be able to do it, but I will restore faith in American air travel.”\n\nHe claimed that the Federal Aviation Administration (FAA) had a “diversity push” that “included focusing on hiring people with severe intellectual and psychiatric disabilities” including for air traffic control roles.\n\n“That’s amazing,” he added. \n\nResponding last year, the FAA said it hired people for a “wide range of roles” and anyone employed had to meet, “rigorous qualifications that of course will vary by position”.\n\nTrump: ‘Could have been’ DEI\n\nWhen Mr Trump was challenged by reporters as to why he was focusing on diversity, when there was no information to suggest that was the cause of the crash, he replied: “It could have been, we don’t know, but it shouldn’t have happened”.\n\nAnother reporter asked how Mr Trump had come to the conclusion “diversity was to blame”.\n\n“Because I have common sense and unfortunately a lot of people don’t”.\n\nThe American Association of People with Disabilities slammed Mr Trump. \n\n“FAA employees with disabilities did not cause last night’s tragic plane crash,” it said in a statement.\n\n“The investigation into the crash is still ongoing. It is extremely inappropriate for the President to use this tragedy to push an anti-diversity hiring agenda. Doing so makes all Americans less safe.”\n\nVice President JD Vance, who joined Mr Trump at the briefing, said if you “don’t have the best standards … you’re not getting the best people”.\n\n“Over the past 10 years, you have many hundreds of people suing the government because they would like to be air traffic controllers, but they were turned away because of the colour of their skin.\n\n“That policy ends on Donald Trump’s leadership, because safety is the first priority of our aviation industry.”\n\nMr Vance was referencing long-running allegations that, since 2013, the FAA had lowered standards and rejected qualified applicants as part of various diversity initiatives.\n\nIn 2015, Mountain States Legal Foundation (MSLF) filed a class action lawsuit on behalf of more than rejected 3000 applicants who alleged they were racially discriminated against.\n\n“We are deeply saddened by the tragic airline crash in the Potomac River yesterday evening, and our thoughts are with the victims and their families during this incredibly difficult time,” MSLF general counsel William Trachman said in a statement on Thursday.\n\n“While we mourn this loss, it also serves as a stark reminder of the vital importance of competency and merit in all safety-critical professions. The safety of the American public must always be the foremost priority, and only the most capable individuals should be entrusted with such a critical role.”\n\n‘Despicable’: Trump slammed\n\nTalking to US broadcaster NBC, pilot and aviation analyst John Cox said there was “no foundation” for Mr Trump’s accusations. \n\n“There are standards for everyone in aviation, notably in a safety critical position, be it pilots, be it flight attendants, be it dispatchers, be it air traffic controllers,” he said.\n\nAt the briefing, Mr Trump then pointedly criticised the former transportation secretary Pete Buttigeig.\n\nHe sarcastically called him a “real winner” with a “good line of bulls***”.\n\n“He’s run (the transportation department) right into the ground with his diversity.”\n\nHitting back on social media, Mr Buttigeig said Mr Trump was “despicable”. \n\n“As families grieve, Trump should be leading, not lying.\n\n“We put safety first, drove down close calls, grew Air Traffic Control, and had zero commercial airline crash fatalities out of millions of flights on our watch.\n\n“President Trump now oversees the military and the FAA. \n\n“One of his first acts was to fire and suspend some of the key personnel who helped keep our skies safe.\n\n“Time for the President to show actual leadership and explain what he will do to prevent this from happening again”.\n\nUS aviation regulator was without a leader\n\nThe previous FAA head Michael Whittaker wasn’t fired, but he did resign as Mr Trump was sworn in.\n\nElon Musk, who runs the new Department of Government Efficiency (DOGE) had called for Mr Whittaker to go. That followed run ins betwenen the FFA and Mr Musk’s SpaceX company. \n\nDuring his year-long tenure, Mr Whittaker had focused on the issue of the short fall in air traffic controllers. \n\nHis resignation meant that at the time of the crash there was no chief at the FAA. \n\nMr Trump has announced Chris Rocheleau as a deputy administrator of the FAA until a permanent replacement is sworn in. \n\nAfter spending a large amount of his press conference suggesting the US’ skies were being looked after by people who had only got the job due to “diversity,” which compromised safety, Mr Trump then said it was perfectly safe to fly.\n\n“Should people be hesitant to fly right now?” Trump is asked.\n\n“No, not at all.”","summary":"The US President went on an anti-diversity tirade following the deadly air crash and said it “could have been” caused by DEI.","url":"https://www.news.com.au/travel/travel-updates/incidents/donald-trump-says-washington-air-crash-could-have-been-caused-by-diversity-equity-and-inclusion/news-story/50f7185552e43fbb71cccdbf79e91caa?from=rss-basic","image":"https://content.api.news/v3/images/bin/11dd96b2764c2e666af5feb6158b4ac5","video":null,"publish_date":"2025-01-31 00:30:09","author":"Benedict Brook In The Us","authors":["Benedict Brook In The Us"],"language":"en","source_country":"au","sentiment":-0.327},{"id":285551056,"title":"CNN Dragged into MORE Scandal as Commentator Issues Groveling Apology for Blaming Trump For American Airlines-Black Hawk Crash over D.C.— As President Points Finger at DEI Policies in Shock Rant","text":"The hits keep coming for CNN. \n\nWeeks after being found liable for defamation against a U.S. Navy veteran over on-air reporting, a CNN commentator was forced to issue a groveling apology online after blaming President Donald Trump for the fatal mid-air plane crash outside of Washington D.C., RadarOnline.com can reveal. \n\nAs news of the tragic American Airlines-Black Hawk helicopter crash unfolded, commentator Bakari Sellers shared a screenshot of a recent release from the House Committee on Transport and Infrastructure announcing a hiring freeze of air traffic controllers by the Trump administration.The release included a statement from Ranking Member Rick Larsen, who warned the hiring freeze could threaten aviation safety. \n\nSellers captioned the X post: \"Eight days ago.\" \n\nSocial media users wasted no time slamming Sellers for making the comment in the immediate aftermath of the fatal collision in the replies.One user wrote: \"Americans are currently being fished out of the Potomac, and rather than have reverence for the victims, you chose to dishonestly (and despicably) blame.\"\n\nAnother called out Sellers and CNN, writing: \"The freeze has not affected any ATC command centers ANYWHERE after January 20th. There is no bottom low enough for @CNN.\"\n\nSellers then took down the post and issued an apology, explaining he deleted the previous post because \"timing matters.\"He wrote: \"I deleted the post because timing matters. Politics at this point does not. I f---ed up, I own that. I am very prayerful but I’m also very frustrated upset and disturbed with where we are as a country. I recognize, and I will do better.\n\n\"The only thing that matters is rescuing the survivors, and ensuring this never happens again.\" \n\nStill, Sellers' remorse fell flat for online critics. \n\nOne X user responded: \"You said what you said with a clear intention of politicizing it. You 'owning' it is a cop out. Mask off moment.\"Another echoed: \"Nah. You tried to politicize a horrific tragedy that is still under investigation. You’re an absolute clown. Shame on you.\"\n\nA third simply commented, \"Screenshots are forever,\" while a fourth suggested Sellers \"should quit\" his post at the network. \n\nSome attempted to come to Sellers' defense, arguing conservative critics would have \"blamed\" former President Joe Biden had the tragedy occurred after his administration enacted a similar hiring freeze. \n\nOne wrote: \"What? What do you think they’d be saying if Biden were at the helm?! We can and should be sorry for the lives impacted but do not take your foot off the gas of the truth. Please.\"While critics were slamming Sellers for making the tragedy \"political,\" President Trump baselessly blamed the incident on DEI hires during the Obama and Biden administrations at a White House press briefing. \n\nHe told reporters: \"Their policy was horrible and their politics was even worse.\n\n\"A group within the FAA determined that the workforce was too white, then they had concerted efforts to get the administration to change that and to change it immediately. This was in the Obama administration.\n\n\"We must have only the highest standards for those who work in our aviation system.\"","summary":"Bakari Sellers highlighted an air traffic control hiring freeze enacted by the Trump administration eight days before the fatal mid-air collision.","url":"https://radaronline.com/p/american-airlines-crash-cnn-bakari-sellers-blames-donald-trump-apology/","image":"https://media.radaronline.com/brand-img/z0angJalM/0x0/american-airlines-crash-cnn-bakari-sellers-blames-donald-trump-apology-pp-1738280215160.jpg","video":null,"publish_date":"2025-01-31 00:30:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.706},{"id":285550932,"title":"US lawmakers urge Trump to consider new curbs on Nvidia chips used by China's Deepseek","text":"WASHINGTON: Two US Congress members are calling on President Donald Trump's administration to consider restricting the export of artificial intelligence chips made by Nvidia, alleging Chinese AI firm DeepSeek has relied on them.\n\nRepublican John Moolenaar and Democrat Raja Krishnamoorthi, who lead the House Select Committee on China, asked for the move as part of a Commerce and State Department-led review ordered by Trump to scrutinise the US export control system in light of \"developments involving strategic adversaries\".\n\n\"We ask that as part of this review, you consider the potential national security benefits of placing an export control on Nvidia’s H20 and chips of similar sophistication,\" they wrote in a letter dated Wednesday (Jan 29) and addressed to National Security Advisor Michael Waltz.\n\nIn the letter, released on Thursday, they alleged that a sophisticated AI model recently released by DeepSeek made \"extensive use\" of Nvidia’s H20 chip, which is currently outside the scope of US export controls.\n\nThe letter is a sign of growing concern in Washington about China's rapid advances in AI after DeepSeek said its free AI assistant launched last week uses less data at a fraction of the cost of incumbent players' models, possibly marking a turning point in the level of investment needed for AI.","summary":"","url":"https://www.channelnewsasia.com/business/us-lawmakers-trump-consider-new-curbs-nvidia-chips-china-deepseek-4907111","image":"https://dam.mediacorp.sg/image/upload/s--vgibclYF--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-30t203329z_1_lynxnpel0t0za_rtroptp_3_deepseek-distillation.jpg?i","video":null,"publish_date":"2025-01-31 00:28:07","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.388},{"id":285550656,"title":"Senate Confirms Burgum to Serve as Trump’s Interior Secretary","text":"Former North Dakota Gov. Doug Burgum has been confirmed by the Senate to lead the Department of the Interior (DOI) where he will manage 500 million acres of public lands and 1.7 billion offshore acres in orchestrating President Donald Trump’s “unleash American energy” agenda.\n\nAs DOI secretary, Burgum will set policy for 11 agencies and 14 offices, including the Bureau of Land Management, National Park Service, U.S. Fish & Wildlife Service, U.S. Geological Survey, Bureau of Ocean Energy Management, and Office of Surface Mining Reclamation and Enforcement.\n\n“We live in a time of tremendous abundance, and we can access that abundance by prioritizing innovation over regulation,” he said at the confirmation hearing.\n\nIn naming him his DOI nominee during a Nov. 14 America First Policy Institute gala at Mar-a-Lago, Trump said Burgum is “going to be fantastic” in spearheading his administration’s drive “to do things with energy and land … that [are] incredible.”\n\n“As a governor, I have a front-row seat,” he said, going on to list initiatives from the U.S. Fish and Wildlife Service and the Bureau of Land Management. Both entities sit under the interior secretary.\n\nAs governor of a natural gas-rich state that boomed with the “shale revolution,” Burgum supported a variety of energy sources and pledged to make North Dakota carbon neutral by 2030 through hydrogen cell development, biofuels, and carbon-capture, a technology that has not yet proven commercially viable.\n\n“The thing we’re short of most right now is base load. We need more [energy]. We need an all-of-the-above strategy, but it has to be a balance,” he said.\n\nThe new secretary said an estimated $1 trillion in tax credits, low-interest loans, and grant programs subsidizing renewable energy development over the next decade through the 2022 Inflation Reduction Act (IRA) “may have been too successful in that we now have significant investment in projects … that are intermittent and not consistent” in achieving base load “affordability and reliability” needed to power a 21st century economy.\n\n“If you don’t have base load reliability, you can’t have intermittent” renewable energy development drawing public and private resources away from sustaining the energy infrastructure most needed, like natural gas pipelines, Burgum said.\n\nHe advanced to the full Senate confirmation after an 18–2 Senate Energy and Natural Resources Committee vote of approval on Jan. 23.\n\nRanking member Sen. Martin Heinrich (D-N.M.) said while he has reservations, Burgum is qualified for the post, knowledgeable about energy development and policy, and has demonstrated a willingness to garner consensus in making difficult decisions.\n\n“We also heard him share his love of the outdoors and his shared commitment with Teddy Roosevelt to protect public lands,” he said during the Jan. 16 nomination hearing.\n\nHowever, Heinrich added, Burgum’s “belief that wind and solar energy represent unreliable energy sources that are not cost-competitive with thermal generation, and that battery technology is not ready for commercial deployment,” are not only untrue, but alarming because investments in nascent, emerging energy technologies are now beginning to bear fruit for commercial application.","summary":"The former two-term North Dakota governor will be chief orchestrator of president's energy agenda.","url":"https://www.theepochtimes.com/us/senate-confirms-burgum-to-serve-as-trumps-interior-secretary-5800294","image":"https://img.theepochtimes.com/assets/uploads/2025/01/16/id5793472-01162025-DSC05523-Doug-Burgum-300x180.jpg","video":null,"publish_date":"2025-01-31 00:28:04","author":"John Haughey","authors":["John Haughey"],"language":"en","category":"politics","source_country":"us","sentiment":0.022},{"id":285550654,"title":"Chicago mayor lambasts Trump, claims US being run like 'had the Confederacy won'","text":"Chicago Mayor Brandon Johnson continued his attack on President Donald Trump on Wednesday, saying anyone questioning what the U.S. would look like had the Confederacy won, should have no question at this point under his administration. A reporter asked Johnson during a press conference on Wednesday if he planned to go to Washington, D.C. to testify about sanctuary cities as the Trump administration continues to conduct operations targeting criminal illegal aliens. House Republicans, including U.S. Rep. James Comer, R-Tenn., chair of the GOP-controlled House Committee on Oversight and Reform, called on sanctuary city mayors to testify next month about the policy’s impact on public safety and the refusal to cooperate with federal immigration enforcement. This oversight committee, of all the things that they want to have sight over, they should look at the White House right now,\" Johnson said. \"That White House is being ran in one of the most raggedy forms of government that I've ever seen. If anybody is questioning whether or not what our country would look like had the Confederacy won, there should be no question now. They want us to be afraid. Do not be afraid, Chicago.\" CHICAGO MAYOR RIPS ICE OPERATIONS, SAYS TRUMP ‘IS ATTEMPTING TO GET US TO SURRENDER OUR HUMANITY’ CHICAGO MAYOR IMPROPERLY ACCEPTING DESIGNER GIFST LIKE HUGO BOSS CUFF LINKS, GUCCI BAGS AND MORE: OIG REPORT The mayor said he will not be intimidated by an individual who refuses to stand up to another individual who believes \"he’s a supreme being.\" Johnson also accused Trump of rejecting the U.S. Constitution by carrying out his responsibilities. \"If they want to have a real discussion about undocumented individuals who are criminals, they should look at the very individuals who enslaved my people and colonized this land,\" Johnson said. Earlier in the press conference, another reporter asked the mayor if he had toned down rhetoric about relitigating the civil war. COMER LAUNCHES INVESTIGATION INTO SANCTUARY CITIES, ASKS MAYORS TO TESTIFY \"I still believe that there are people who have not accepted the results of the Civil War, and here’s the thing: I said that before this administration took office,\" Johnson said. \"Unfortunately, I’m right. I mean, you have an entire administration that is looking to take away federal protections for the people who are most vulnerable. \"So, no, my position has not changed,\" he added. The mayor’s statement comes more than a week after he doubled down on a vow to oppose Trump’s sweeping reform aimed at removing dangerous illegal immigrants accused of crimes from the U.S. once he returns to the Oval Office. TRUMP'S ICE NABS CHILD SEX OFFENDERS AMONG 530+ ILLEGAL IMMIGRANTS CAUGHT IN SINGLE DAY On day one of his second term, Trump issued ten executive orders aimed at overhauling U.S. immigration law and policy, and since then, armed federal immigration agents have swept cities in the first deportation raids. In a letter, Comer, Johnson and other mayors of sanctuary cities, to provide documents and information related to the sanctuary policies of each city. Sanctuary cities limit cooperation between local law enforcement and federal immigration authorities. Supporters argue that enforcement of immigration is the job of the federal government. CLICK HERE TO GET THE FOX NEWS APP Opponents say sanctuary policies harbor criminals, as well as those in the country illegally, and put the public, including legal and illegal immigrants, at risk. Fox News Digital’s Louis Casiano contributed to this report.","summary":"Chicago Mayor Brandon Johnson said anyone wondering what the country would look like had the Confederacy won, should have no question under the current adminsitration.","url":"https://www.foxnews.com/politics/chicago-mayor-lambasts-trump-claims-us-being-run-like-confederacy-won","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/05/931/523/GettyImages-1255116687.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-31 00:27:55","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.303},{"id":285554152,"title":"Anthony Mackie Says ‘Chill the F— Out’ Over Comparing Red Hulk to Donald Trump, Responds to Fan Who Called Him the ‘Rudest Celebrity’","text":"Anthony Mackie told Esquire magazine during a new cover story that playing Captain America “is my Oscar because I’ve been overlooked so many times in my career.” The actor says there are least four performances of his that deserved award nominations (“Brother to Brother,” “Half Nelson, “The Banker” and “The Hurt Locker”), and yet he […]","summary":"Anthony Mackie told Esquire magazine in a new cover story that playing Captain America &#8220;is my Oscar because I’ve been overlooked so many times in my career.” The actor says there are least four performances of his that deserved award nominations (&#8220;Brother to Brother,&#8221; &#8220;Half Nelson, &#8220;The Banker&#8221; and &#8220;The Hurt Locker&#8221;), and yet he [&#8230;]","url":"https://variety.com/2025/film/news/anthony-mackie-slams-red-hulk-trump-comparisons-rudest-actor-1236291042/","image":"https://variety.com/wp-content/uploads/2025/01/anthony-mackie.png","video":null,"publish_date":"2025-01-31 00:24:59","author":"Zack Sharf","authors":["Zack Sharf"],"language":"en","category":"politics","source_country":"US","sentiment":0.497},{"id":285549146,"title":"Senate confirms former ND Gov. Doug Burgum as secretary of the Interior","text":"The Senate has voted to confirm former North Dakota Gov. Doug Burgum to serve as Interior Secretary in President Donald Trump's administration.The final vote was 79-18.Burgum will head the department responsible for managing federal lands and offshore resources. Its sub-agencies include the National Park Service, the U.S. Fish and Wildlife Service, the Bureau of Indian Affairs and the Bureau of Land Management.Burgum, a Republican and a software entrepreneur with a net worth believed to be more than a billion dollars, was governor of North Dakota for two terms. In 2023 he briefly campaigned for the 2024 presidential nomination, but he ended his campaign in December of that year to work with the Trump campaign as an energy policy advisor.Burgum is expected to work to deliver on President Trump's goals of extracting more fossil fuels.At his confirmation hearing, Burgum repeated promotion of the development of oil and gas industry on U.S. lands. He advocated for more baseline power generation from coal and nuclear sources and cast doubt on the reliability of renewable energy sources. He has promoted carbon capture and storage as a method to counter greenhouse gas emissions from fossil fuels. The nascent technology currently captures less than 1% of carbon dioxide emissions nationwide.RELATED STORY | Kash Patel faces questions of loyalty and retribution in fiery confirmation hearingPresident Trump says Burgum will also serve as chairman of a newly formed National Energy Council, which will bring together all the government agencies that regulate energy production and distribution.\"This council will oversee the path to U.S. energy dominance by cutting red tape, enhancing private sector investments across all sectors of the economy, and by focusing on innovation over longstanding, but totally unnecessary, regulation,\" Trump said.","summary":"The Senate has voted 79-18 to confirm former North Dakota Gov. Doug Burgum to serve as Interior Secretary in President Donald Trump's administration.","url":"https://www.scrippsnews.com/politics/president-trumps-first-100-days/senate-confirms-former-nd-gov-doug-burgum-as-secretary-of-the-interior","image":"https://ewscripps.brightspotcdn.com/dims4/default/4d60db6/2147483647/strip/true/crop/5648x2965+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F48%2F27%2F15def694439bacc36a608afb4a9c%2Fap25016571271276.jpg","video":null,"publish_date":"2025-01-31 00:21:54","author":"Scripps News Staff","authors":["Scripps News Staff"],"language":"en","source_country":"us","sentiment":0.296},{"id":285551282,"title":"MSNBC’s Nicole Wallace Shades Trump for ‘Turning to Politics’ and Unfoundedly Blaming DEI for DC Plane Crash | Video","text":"MSNBC’s Nicole Wallace threw shade at President Donald Trump’s argument – without evidence – that DEI initiatives were somehow responsible for Wednesday night’s plane crash in Washington D.C.\n\n“Donald Trump, citing zero evidence or facts, placed blame squarely at the feet of previous presidential administrations and programs having to do with diversity, equity and inclusion – DEI,” Wallace said. “We’ll let our viewers decide who’s turning to politics today.”\n\nShe added, “Again, those comments were made without providing any evidence for them and in the midst of a horrific tragedy. The worst aviation disaster in decades and in an ongoing search for answers. That answer from Donald Trump standing in stark contrast to responses from investigators.”\n\nAt a press conference Wednesday morning addressing the crash, Trump was quick to bring up DEI and point the finger at both the Biden and Obama administrations and Pete Buttigieg – the outgoing head for the Department of Trasnportation.\n\n“I put safety first,” he said. “Obama, Biden and the Democrats put policy first, and they put politics at a level that nobody’s ever seen, because this was the lowest level.”\n\nHis shots at Buttigieg during the press conference included calling him a “real winner” sarcastically followed by a “disaster.”\n\n“He’s a disaster. He was a disaster as a mayor. He ran his city into the ground, and he’s a disaster. Now he’s just got a good line of bulls–t,” Trump said. “The Department of Transportation is [the] government agency charged with regulating civil aviation. Well, he runs it, 45,000 people, and he’s run it right into the ground with his diversity. So I had to say that it’s terrible.”\n\nPresident Trump did find time amid all the mudslinging to offer condolences to the families of the 67 people lost in the collision of the American Airlines flight and a helicopter. \n\n“We’re all overcome with the grief for many who have so tragically perished, will no longer be with us together,” Trump said. “We take solace in the knowledge that their journey ended, not in the cold waters of the Potomac but in the warm embrace of a loving God.”","summary":"Trump said in his press conference he put \"safety first\" while Biden and Obama put \"policy first\"\n\n\nThe post MSNBC&#8217;s Nicole Wallace Shades Trump for &#8216;Turning to Politics&#8217; and Unfoundedly Blaming DEI for DC Plane Crash | Video appeared first on TheWrap.","url":"https://www.thewrap.com/nicolle-wallace-responds-plane-crash-trump-dei-blame-msnbc/","image":"https://www.thewrap.com/wp-content/uploads/2025/01/MSNBC.jpg","video":null,"publish_date":"2025-01-31 00:21:51","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.687},{"id":285553540,"title":"What Trump’s Nominees Revealed","text":"Americans keeping close track of political news may have been toggling their screens today between Senate confirmation hearings: the second day of Robert F. Kennedy Jr.’s for secretary of Health and Human Services, and the first for Tulsi Gabbard’s for director of national intelligence and Kash Patel’s for FBI director. But each of those three hearings deserves the public’s full attention: Donald Trump’s nominees offered new glimpses into their approaches to policy, truth, and loyalty to the president.\n\nRobert F. Kennedy Jr., Day Two\n\nAhead of Kennedy’s first day of hearings, our colleague Nicholas Florko noted that the HHS nominee is no stranger to conspiracist statements: “RFK Jr. has insinuated that an attempt to assassinate members of Congress via anthrax-laced mail in 2001 may have been a ‘false flag’ attack orchestrated by ‘someone in our government’ to gin up interest in the government preparing for potential biological weapon threats. He has claimed that COVID was ‘targeted to attack Caucasians and Black people,’ and that 5G is being used to ‘harvest our data and control our behavior.’ He has suggested that the use of antidepressants might be linked to mass shootings.”\n\n“If Republican senators skirt around [Kennedy’s] falsehoods during today’s confirmation hearings,” Nicholas wrote, “it will be evidence of their prevailing capitulation to Trump. And it also may be a function of Kennedy’s rhetorical sleights … He’s capable of rattling off vaccine studies with the fluency of a virologist, which boosts his credibility, even though he’s freely misrepresenting reality.” But Kennedy’s sleights didn’t serve him quite as well today as he might have hoped.\n\nAt several points, senators encouraged Kennedy to acknowledge that vaccines are not the cause of autism, but instead of confirming what numerous studies have shown to be true, Kennedy insisted that he would need to “look at all the data” before coming to any conclusions. “The room went silent today during Senator [Bill] Cassidy’s closing questions,” Nicholas noted when we spoke this afternoon. “Cassidy was practically begging Kennedy to recant his previous statements on vaccines. Kennedy, like everyone else in the room, had to know this was a make-or-break moment for his confirmation. But despite the potential fallout, Kennedy refused, promising only that he would look at any studies presented to him disproving a link between vaccines and autism.”\n\nThe nominee for HHS secretary also showed, for the second day in a row, his lack of understanding about basics of the Medicare system, fumbling his answers to a series of rapid-fire questions from Senator Maggie Hassan, a Democrat from New Hampshire. Hassan also shared that she is the mother of a 36-year-old with cerebral palsy, and accused Kennedy of relitigating settled science on the fact that vaccines do not cause autism. “It’s the relitigating and rehashing and continuing to sow doubt so we can’t move forward, and it freezes us in place,” she argued.\n\nCassidy, whose vote could prove key to whether RFK Jr. is confirmed, said after today’s hearing that he is “struggling” over whether to confirm Kennedy.\n\nTulsi Gabbard\n\nGabbard came into her confirmation process with a history that raises questions about her commitment to national security (she has, among other things, met with former Syrian President Bashar al-Assad and expressed sympathetic views toward Russian President Vladimir Putin). As our colleague Tom Nichols wrote in November, “Gabbard has every right to her personal views, however inscrutable they may be. As a private citizen, she can apologize for Assad and Putin to her heart’s content. But as a security risk, Gabbard is a walking Christmas tree of warning lights. If she is nominated to be America’s top intelligence officer, that’s everyone’s business.”\n\nThe topic that ultimately received much attention in her confirmation hearing today was her refusal to say whether Edward Snowden is a traitor. Despite pressure from Democratic and Republican senators, Gabbard refused to answer the question, repeating that Snowden had broken the law and that she would take steps to make sure whistleblowers know how to properly make a complaint. Gabbard also revealed that she was unable to extract any concessions in her 2017 meeting with Assad. “I didn’t expect to,” she said.\n\nGabbard’s potential confirmation will depend on how her somewhat incoherent set of policy views sits with Republican senators. Last week, our colleague Elaine Godfrey explored the one through line—besides ambition—that has guided Gabbard’s otherwise inconsistent political career.\n\nDonald Trump is not always clear about what he means when he refers to “DEI,” but presumably it involves how someone’s identity is taken into consideration during the hiring process. In this morning’s press conference addressing the tragic plane crash last night, Trump asserted, without evidence but crediting his “common sense,” that DEI hiring at the Federal Aviation Administration was at fault.\n\nIt was odd, then, that a few hours later, Republican senators used Patel’s confirmation hearing to highlight his identity: Senator Lindsey Graham of South Carolina asked about examples of racism Patel has experienced, and Senator Mike Lee of Utah acknowledged the struggles Patel and his father must have faced as racial minorities in the United States and Uganda, respectively. Senator Thom Tillis of North Carolina, as if he were reading from a book report about the Gujarati people, lauded the religious diversity in Gujarat, India, where Patel’s family is originally from, omitting the state’s extreme tensions and violent history. Patel opened his own remarks by acknowledging his family’s journey from abroad. He invoked the phrase Jai Shri Krishna, a standard greeting for a sect of Hindus seeking blessings. Patel was calm and still—he became riled up only when questioned by Senator Amy Klobuchar about his past suggestion that he would “shut down the FBI Hoover Building on day one and reopen it the next day as a museum of the ‘deep state.’” But he was walking a tightrope. Today’s hearing may be the rare instance when Patel has publicly broken with Trump, to whom he has otherwise been unequivocally loyal. He refused to explicitly state that Trump lost the 2020 election, but he also said, “I do not agree with the commutation of any sentence of any individual who committed violence against law enforcement.”\n\nOverall, Patel seemed to be trying to carefully toe a line, answering questions about the culture-war issues that Trump and congressional Republicans care about—Senator Marsha Blackburn, for example, asserted during the hearing that the FBI prioritizes DEI and “counting Swiftie bracelets” over conducting investigations—while attempting not to alienate the employees he hopes to lead. Pressed by Blackburn, Patel made a vague statement about the “high standards” FBI employees must meet.\n\nHere are four new stories from The Atlantic:\n\nToday’s News\n\nExplore all of our newsletters here.\n\nMore From The Atlantic\n\nEvening Read\n\nYour FOMO Is Trying to Tell You Something\n\nBy Faith Hill\n\nCulture Break\n\nListen. In the latest episode of Radio Atlantic, the MSNBC host Chris Hayes speaks with Hanna Rosin about how bad the war for your attention has really gotten.\n\nRead. The Stranger Things effect is coming for the novel, Mark Athitakis writes.\n\nStephanie Bai contributed to this newsletter.\n\nWhen you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","summary":"Takeaways from three Senate confirmation hearings","url":"https://www.theatlantic.com/newsletters/archive/2025/01/rfk-jr-patel-gabbard-hearings/681523/","image":"https://cdn.theatlantic.com/thumbor/bEPnY1E8JfBB9AkpTsKqgREvOAM=/0x424:5387x3230/1200x625/media/img/mt/2025/01/GettyImages_2196801930/original.jpg","video":null,"publish_date":"2025-01-31 00:15:00","author":"Bhumika Tharoor,Isabel Fattal","authors":["Bhumika Tharoor","Isabel Fattal"],"language":"en","category":"politics","source_country":"US","sentiment":-0.456},{"id":285553702,"title":"Intel has already received $2.2B in federal grants for chip production","text":"Semiconductor giant Intel Corporation has already received $2.2 billion in federal grants from the U.S. Department of Commerce through the U.S. CHIPS and Science Act, the company shared during its Thursday earnings call.\n\nDave Zinsner, Intel’s co-interim CEO, executive vice president, and CFO, said the Silicon Valley-based company received the first tranche of $1.1 billion in federal grants at the end of 2024 and an additional $1.1 billion in January 2025.\n\nThese grants are based on reaching certain milestones, Zinsner added. Another $5.66 billion has yet to be dispersed.\n\nThe company was awarded a total of $7.86 billion in federal grants to build semiconductors in the U.S. in November as part of the U.S. Department of Commerce’s U.S. CHIPS and Science Act. While a sizable sum, this total was less than the original $8.5 billion estimate.\n\nWhen Intel was awarded its grant money in November, the company said it was planning to put the funds toward manufacturing and advanced packaging, or toward techniques to assemble and integrate multiple semiconductor chips into one package. This will be carried out at Intel facilities across Arizona, New Mexico, Ohio, and Oregon.\n\nThe U.S. CHIPS and Science Act was signed into federal law by former president Joe Biden in 2022 in an effort to increase domestic semiconductor manufacturing. The act set aside $52 billion in subsidies for domestic chip manufacturers.\n\nWhile already two years old, the CHIPS Act faces some uncertainty under the Trump administration. If President Donald Trump’s federal funding freeze, which is currently being blocked by a federal judge, does go into effect, it would affect the Commerce Department employees focused on the CHIPS Act, according to Bloomberg reporting.\n\nZinsner had a rosier outlook, though. When asked by an analyst, he said that Intel has already been in communication with the Trump administration and “feels really good” about the administration’s outlook on bringing semiconductor manufacturing back to the United States.\n\n“We look forward to continued engagement with the Trump administration as we advance this work and support their efforts to strengthen U.S. technology and manufacturing leadership,” Zinsner said earlier on the call.","summary":"Semiconductor giant Intel Corporation has already received $2.2 billion in federal grants from the U.S. Department of Commerce through the U.S. CHIPS and Science Act, the company shared during its Thursday earnings call. Dave Zinsner, Intel&#8217;s co-interim CEO, executive vice president, and CFO, said the Silicon Valley-based company received the first tranche of $1.1 billion [&#8230;]\n\n\n© 2024 TechCrunch. All rights reserved. For personal use only.","url":"https://techcrunch.com/2025/01/30/intel-has-already-received-2-2b-in-federal-grants-for-chip-production/","image":"https://techcrunch.com/wp-content/uploads/2023/08/newsroom-robert-noyce-bldg-2.jpg.rendition.intel_.web_.1920.1080.jpg?resize=1200,675","video":null,"publish_date":"2025-01-31 00:12:32","author":"Rebecca Szkutak","authors":["Rebecca Szkutak"],"language":"en","category":"politics","source_country":"us","sentiment":-0.32},{"id":285549628,"title":"Flight data recorders yet to be recovered from Potomac River — authorities","text":"WASHNGTON, January 31. /TASS/. Flight data recorders are yet to be lifted from the bottom of the Potomac River following the latest of the plane crash in Washington, Chair of the National Transportation Safety Board (NTSB) Jennifer Homendy has told reporters.\n\n\"We have not recovered the flight data recorders yet. We know they're there. They are underwater. This is not unusual for the NTSB, we have many times recovered flight data recorders in water,\" she said. \"Once we get those, we'll be able to get those read and information from them.\"\n\nNTSB Member Todd Inman said, in turn, that \"we'll be able to get\" the black boxes and read information from them.\n\n\"We will probably have more than one black box,\" he said, adding that the helicopter that collided with a passenger jet above Washington was \"equipped with some form of recording devices.\"\n\n\"Those will be read either by the DoD [Department of Defense] or by us,\" he added.\n\nAn American Airlines passenger jet and a US Army Black Hawk helicopter collided near Ronald Reagan Washington National Airport. The American Airlines flight, en route from Wichita, Kansas, was carrying 60 passengers and four crew members. There were at least three service members aboard the helicopter. Upon the collision, both aircraft crashed into the Potomac River. The bodies of 28 people have been plucked out of the water so far. US authorities said there are no survivors.\n\nAccording to the Wichita Eagle newspaper, members of the US junior figure skating team were aboard the plane. A source told TASS that Yevgenia Shishkova and Vadim Naumov, who won the world championships in pairs figure skating for Russia in 1994, were also among the passengers, as well as Inna Volyanskaya, Soviet bronze medalist in pairs figure skating.\n\nUS President Donald Trump confirmed that Russian citizens were killed in the plane crash. The US has already been in contact with Russia about transferring of their remains.","url":"https://tass.com/emergencies/1906741","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-31 00:12:27","author":"Tass","authors":["Tass"],"language":"en","source_country":"ru","sentiment":-0.194},{"id":285549630,"title":"Still no Putin-Trump talk yet, Kremlin spokesman tells TASS in wake of Washington crash","text":"MOSCOW, January 31. /TASS/. There have been no contacts between the leaders of Russia and the United States, Russian Presidential Spokesman Dmitry Peskov said, commenting on US President Donald Trump’s remarks that he has not discussed the recent deadly air crash in Washington with his Russian counterpart Vladimir Putin.\n\n\"There was none,\" Peskov said briefly, when asked whether the two leaders had a phone conversation recently.\n\nPreviously, Trump was asked whether he contacted Putin on the subject of the crash, because Russian citizens were among the victims, Trump replied: \"I have not, no, not about this.\" The media interpreted this phrase as a possible hint to the fact that a conversation has taken place, but on a different subject.\n\nAn American Airlines passenger jet and a US Army Black Hawk helicopter collided near Ronald Reagan Washington National Airport. The American Airlines flight, en route from Wichita, Kansas, was carrying 60 passengers and four crew members. There were at least three service members aboard the helicopter. Upon the collision, both aircraft crashed into the Potomac River. The bodies of 28 people have been plucked out of the water so far. US authorities said there are no survivors.\n\nAccording to the Wichita Eagle newspaper, members of the US junior figure skating team were aboard the plane. A source told TASS that Yevgenia Shishkova and Vadim Naumov, who won the world championships in pairs figure skating for Russia in 1994, were also among the passengers, as well as Inna Volyanskaya, Soviet bronze medalist in pairs figure skating.\n\nUS President Donald Trump confirmed that Russian citizens were killed in the plane crash. The US has already been in contact with Russia about transferring of their remains.","summary":"The Russian Presidential Spokesman Dmitry Peskov commented on the words of the American leader that he did not discuss the plane crash in Washington with the head of the Russian Federation","url":"https://tass.com/politics/1906739","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-31 00:10:58","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.192},{"id":285554020,"title":"Washington Air Disaster Kills 67, Officials Say Crash Cause Unclear","text":"TEMPO.CO, Jakarta - U.S. authorities said on Thursday, January 30, 2025, that it was not yet clear why a regional jet crashed into a U.S. Army helicopter at a Washington airport, killing 67 people in the deadliest U.S. air disaster in more than 20 years.President Donald Trump said, without providing evidence, that federal diversity efforts could have been a factor, reiterating a theme that has become a focus of his presidency. Rights groups and Democrats accused him of politicizing the disaster.The investigation into the crash in the nation's capital has just begun. The American Airlines Bombardier carrying 60 passengers and four crew members collided with the Army Black Hawk helicopter and crashed into the Potomac River as it prepared to land at Reagan Washington National Airport on Wednesday.The names of all the victims have not yet been released, but they included a number of promising young figure skaters and people from Kansas, where the flight originated.U.S. Transportation Secretary Sean Duffy said both aircraft had been flying standard flight patterns and there had been no breakdown in communication.\"Everything was routine up to the point of the accident,\" Virginia Governor Glenn Youngkin told Reuters. Washington's primary airport is located just across the river in Virginia.National Transportation Safety Board investigators said they were just beginning their work and would have a preliminary report within 30 days. They said they had not yet recovered the \"black boxes\" on the aircraft that record flight data.\"This is an all hands on deck event,\" chair Jennifer Homendy told a press conference.At the White House, Trump criticized the helicopter pilots and suggested air traffic controllers were to blame.\"We do not know what led to this crash, but we have some very strong opinions and ideas,\" he said.Radio communications show that air traffic controllers alerted the helicopter about the approach jet and ordered it to change course.However, a shortage of air traffic controllers in the United States in recent years has spurred safety concerns. At several facilities, controllers work mandatory overtime and six-day work weeks to cover shortages. The Federal Aviation Administration has about 3,000 fewer controllers than it says it needs.The New York Times reported that a preliminary FAA review found that a controller at the airport was handling both helicopter and plane traffic at the time of the crash, though those jobs typically are split up.CROWDED FLIGHT CORRIDORAirspace is frequently crowded in the U.S. capital region, home to three commercial airports and several major military facilities, and officials have raised concerns about busy runways at Reagan National Airport. There have been several near-miss incidents at the airport that have sparked alarm, including a near-collision in May 2024.Trump accused his Democratic predecessor Joe Biden of lowering hiring standards and suggested the Federal Aviation Administration's diversity push could have weakened its capabilities.Asked if the crash was caused by diversity hiring, he said: \"It just could have been.\"The Trump administration has not provided any proof to back these assertions, and there is no evidence that efforts to make the federal workforce more diverse have compromised air safety.Trump cited FAA policies stating that physical and mental disabilities would not on their own disqualify applicants from a controller's position. Those policies were in place throughout Trump's initial 2017-2021 White House term, according to aides to Biden's transportation secretary, Pete Buttigieg.Buttigieg called Trump's remarks despicable. \"As families grieve, Trump should be leading, not lying,\" he said on social media.CRASH CAUSE UNCLEARTrump's remarks contrasted sharply with those of other officials, who said there was no immediate indication why the crash took place.American Airlines (AAL.O) CEO Robert Isom said the pilot of the American Eagle Flight 5342 had about six years of flying experience. The Bombardier CRJ-700 jet was operated by PSA Airlines, a regional subsidiary.Defense Secretary Pete Hegseth said the helicopter was flown by a \"fairly experienced crew\" of three soldiers who were wearing night-vision goggles on an annual training flight. Officials said they were grounding other flights from the Army unit involved in the crash and would reevaluate training exercises in the region.Webcam video of the crash showed the collision and an explosion lighting up the night sky.It was the deadliest U.S. air disaster since November 2001, when an American Airlines jet crashed after departing from John F. Kennedy International Airport in New York, killing all 260 people on board and five people on the ground.Reagan National's main runway is the busiest in the United States, with over 800 daily takeoffs and landings. The National Transportation Safety Board has investigated nine accidents or incidents at the airport this century, including two that were fatal, records show.U.S. Senator Tim Kaine of Virginia said he had long been concerned about the busy airspace, where civilian and military aircraft must navigate the unique security concerns of the U.S. capital.\"I’ve been praying that there wouldn’t be something like last night but kind of dreading in my heart that there would be,\" he told reporters.REUTERS | David Shepardson, Steve Holland, Jeff Mason, and Trevor HunnicuttEditor’s Choice: Passenger Jet Collides with Military Black Hawk Mid-air in WashingtonClick here to get the latest news updates from Tempo on Google News","summary":"The crash between American Airlines jet and Black Hawk helicopter was the deadliest U.S. air disaster since November 2001.","url":"https://en.tempo.co/read/1969871/washington-air-disaster-kills-67-officials-say-crash-cause-unclear","image":"https://statik.tempo.co/data/2025/01/30/id_1373460/1373460_720.jpg","video":null,"publish_date":"2025-01-31 00:10:30","author":"Tempo.co","authors":["Tempo.co"],"language":"en","category":"politics","source_country":"id","sentiment":-0.312},{"id":285550660,"title":"Key Takeaways From Tulsi Gabbard’s Confirmation Hearing for Director of National Intelligence","text":"Former Congresswoman Tulsi Gabbard appeared before the Senate Select Committee on Intelligence today to earn her confirmation as the next director of national intelligence.\n\nGabbard previously served in the House as a Democratic representative for Hawaii from 2013 to 2021 and was a member of the House Committees on Foreign Affairs, Homeland Security, and Armed Services, including its Subcommittee on Intelligence and Special Operations.\n\nShe joined the Hawaii Army National Guard in 2003, transferred to the Army Reserve in 2020, and currently holds the rank of lieutenant colonel.\n\nPresident-elect Donald Trump nominated Gabbard in November, saying she would help to defend the security and constitutional freedoms of all Americans.\n\nGabbard’s fitness for the role has been questioned by both sides of the aisle because of her often unorthodox stances on intelligence collection and U.S. interventionism.\n\nThat statute allows U.S. intelligence agencies to conduct surveillance of foreign targets on a massive scale in a process that sometimes inadvertently collects the sensitive private data of U.S. citizens.\n\nDuring her time in Congress, Gabbard attempted to repeal FISA 702 and the Patriot Act, which granted the authority to wiretap Americans’ communications.\n\n“702 provides a unique tool and capability that is essential for our national security.” Gabbard said during the hearing, adding that “significant FISA reforms have been enacted since my time in Congress.”\n\nFormer Director of National Intelligence Avril Haines likewise testified last year that 702 provided intelligence agencies with “unique insights” and that too much regulation would hurt the “agility” required to respond to emergent threats.\n\nMany at Thursday’s hearing took Gabbard’s new-found embrace of 702 with a grain of salt, with Sen. Mark Warner (D-Va.) questioning Gabbard’s “confirmation conversion” on the issue.\n\n“You actually said you wanted to repeal it,” Warner said.\n\nGabbard condemned actions taken by the FBI to undermine President Donald Trump’s first term in office, which included using FISA authorities to spy on Trump campaign adviser Carter Page.\n\nShe also condemned the role of 51 former intelligence officials who used their credentials within the intelligence community to falsely suggest that a story about a laptop belonging to Joe Biden’s son Hunter was Russian disinformation.\n\nTo that end, Gabbard said her priority would be providing “unbiased, timely, and accurate intelligence” to secure freedom and safety for the American people.\n\nThe remarks come at a time when partisanship and distrust in institutions continue to grow in the United States.\n\nDuring the same timeframe, Americans who believed the intelligence community presented a threat to civil liberties nearly doubled in number.\n\nThose opinions were often held in highly partisan terms, with trust in U.S. intelligence now fluctuating rapidly based on whether the president in office is of the same party as the person taking part in the survey.\n\n“I’ll work to rebuild trust through transparency and accountability. This is a national security imperative,” Gabbard said.\n\nSnowden was a technical assistant for the CIA and worked at the National Security Agency (NSA), which gathers intelligence through electronic means, and Booz Allen Hamilton before stealing more than one million files from government servers in 2013 and leaking much of the information to the press. He ultimately fled to Russia.\n\nThose actions earned him a reputation among some as a traitor who put American service members’ lives at risk, while others viewed him as a hero for exposing widespread surveillance and civil rights abuses by the U.S. government.\n\nNotably, the leaks disclosed the existence of Prism, an NSA program that obtained Americans’ audio and video chats, emails, texts, photographs, and other documents from Microsoft, Google, and Apple.\n\nEver since, the United States has wanted Snowden on espionage charges. In 2022, Snowden was granted Russian citizenship by President Vladimir Putin.\n\nBefore the committee on Thursday, however, her appraisal of Snowden was more muted.\n\n“Edward Snowden broke the law, and he released this information in a way that he should not have. He also acknowledged and exposed information that was unconstitutional, which drove a lot of the reforms that this body has made over the years,” Gabbard said.\n\n“My statements in the past have been reflective of the egregious and illegal programs that were exposed in that leak.”\n\nSeveral lawmakers, including Warner and James Lankford (R-Okla.), said Snowden endangered the lives of U.S. agents and revealed intelligence processes to the nation’s enemies.\n\nThe lawmakers described Snowden as a “traitor” and pressed Gabbard repeatedly to do the same, which she refused to do.\n\nGabbard did say that she would not seek a pardon for Snowden if she was confirmed to the DNI position.\n\nNumerous lawmakers took issue with Gabbard’s claims that the invasion of Ukraine was merely a proxy war between Russia and NATO, as well as her questioning of the existence of widely documented chemical weapons attacks in Syria.\n\nOn international conflict, Gabbard turned the focus toward the intelligence community itself, accusing it of engaging in “bureaucratic mission-creep and empire-building.”\n\nFaulty U.S. intelligence and overzealous interventionism, she said, led to the United States’ invasion of Iraq and its creation of power vacuums in Syria, Libya, Egypt, and elsewhere.\n\n“The fact is what truly unsettles my political opponents is I refuse to be their puppet,” Gabbard said.\n\n“For too long, faulty, inadequate, or weaponized intelligence have led to costly failures and the undermining of our national security and God-given freedoms enshrined in the Constitution.”\n\nGabbard earned agreement with some on the committee who questioned the wisdom of using military force to alter the political systems of other nations.\n\n“I opposed the disastrous interventions in Egypt and Libya as well,” said Sen. Tom Cotton (R-Ark.).\n\n“The vast number of governments throughout history and still today are not democratic. We may wish it were different, and we can work to improve it, but that’s the way the world is. If we only befriended nations that shared our system of government and our social and cultural sensibilities, we wouldn’t have many friends.”","summary":"Gabbard's hearing was a bumpy affair, with the former congresswoman defending past statements on FISA, Snowden, Russia, and surveillance abuses.","url":"https://www.theepochtimes.com/us/key-takeaways-from-tulsi-gabbards-confirmation-hearing-for-director-of-national-intelligence-5801708","image":"https://img.theepochtimes.com/assets/uploads/2025/01/30/id5801540-Tulsi-Gabbard-Tulsi-Gabbard-300x180.jpg","video":null,"publish_date":"2025-01-31 00:09:54","author":"Andrew Thornebrooke","authors":["Andrew Thornebrooke"],"language":"en","source_country":"us","sentiment":0.137},{"id":285549606,"title":"Senate advances Trump's energy secretary nominee to final confirmation vote","text":"The Senate Thursday evening advanced President Donald Trump's nominee to head the Department of Energy to a final confirmation vote. The vote was 62-35. Chris Wright, the CEO and founder of Liberty Energy Inc., an energy industry service provider based in Colorado, was tapped by the 47th president to head the Department of Energy under his administration. The Trump nominee has received bipartisan support for his nomination, being introduced by a Democrat, Sen. John Hickenlooper of Colorado, during his confirmation hearing with the Senate Energy and Natural Resources Committee this month. The Senate held a late-night cloture vote for Wright, to end discussion over his nomination. FIRST ON FOX: TRUMP CABINET NOMINEE LEOFFLER PLEDGES TO DONATE SALARY TO CHARITY IF CONFIRMED The cloture vote passed with bipartisan support, meaning Wright will advance to a final Senate vote, likely to take place on Friday. CLICK HERE TO GET THE FOX NEWS APP Wright, during his confirmation hearing, said he had identified three \"immediate tasks\" where he would focus his attention: unleashing American energy, leading the world in innovation and technology breakthroughs and increasing production in America.","summary":"President Donald Trump&apos;s pick to head the Department of Energy, Chris Wright, has advanced to a final confirmation vote in the Senate.","url":"https://www.foxnews.com/politics/senate-advances-trumps-energy-secretary-nominee-final-confirmation-vote","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/chris-wright-hearing.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-31 00:09:27","author":"Aubrie Spady","authors":["Aubrie Spady"],"language":"en","category":"politics","source_country":"US","sentiment":0.207},{"id":285551292,"title":"Amazon Cranks Up Ad Spending on X After Cutting Investments Over Hate Speech Concerns | Report","text":"Amazon has cranked up its ad spending on X after previously cutting its investments in advertising on the social media platform over hate speech concerns, per media reports. \n\nThe company, which has also discussed testing ads on the platform, previously pulled its dollars from the site in 2023, The Wall Street Journal reports, noting that Amazon Chief Executive, Andy Jassy, was involved in the move. The switch-up comes as Amazon and X owners, Jeff Bezos and Elon Musk, appear to scooch in closer to one another in business, as two the tech CEOs continue their support of President Donald Trump.\n\nBack in December, it was reported that Bezos’ Amazon planned to donate $1 million to Trump’s inaugural fund. Musk, who Trump named as the co-lead of his Department of Government Efficiency (D.O.G.E.) with Vivek Ramaswamym donated more than a quarter of a billion dollars to Trump’s presidential campaign. Mark Zuckerberg, CEO of Meta, also contributed $1 million to Trump’s campaign. The trio, who boasts a combined net worth of $855 billion, attended Trump’s inauguration on Jan. 20. \n\nWith Amazon putting its cards back in the deck, their dollars will help boost X’s finances, as the investment banks Musk borrowed from to acquire X have hit a wall in their efforts to dump the debt from their books, per WSJ. \n\n “Our user growth is stagnant, revenue is unimpressive, and we’re barely breaking even,” Musk said in an email, and has since denied saying, WSJ reports. \n\nIn 2023, the Center for Countering Digital Hate released research from a study that showed that X had took no action against 99% of the 100 Twitter Blue accounts that were tweeting what could be considered hate speech. In August 2023, Musk sued the company over alleged lost ad dollars, claiming CCDH made “a series of troubling and baseless claims that appear calculated to harm Twitter generally and its digital advertising business specifically.” \n\nIn November 2023, CCDH published a subsequent report stating 98% of 200 tweets that it flagged to the social media platform are still up for users to see after two weeks. All the posts in the sample breached some form of X platform rules against hateful content, dehumanization, and hateful imagery. On Nov. 18, 2023, several tech and media companies, including Disney, Apple, Paramount Global and more pulled their ads from X over antisemitism following a report by Media Matters that found several major companies, including Apple, Amazon and NBCUniversal’s Bravo had advertisements showing up next to posts that included white nationalist rhetoric.","summary":"The company pulled ad dollars in 2023 in response to a rise in antisemitic posts after Elon Musk bought the site\n\n\nThe post Amazon Cranks Up Ad Spending on X After Cutting Investments Over Hate Speech Concerns | Report appeared first on TheWrap.","url":"https://www.thewrap.com/amazon-ad-spending-x-hate-speech-elon-musk-jeff-bezos/","image":"https://www.thewrap.com/wp-content/uploads/2025/01/Outside-Amazon-office-building.jpg","video":null,"publish_date":"2025-01-31 00:07:19","author":"Raquel 'rocky' Harris","authors":["Raquel 'rocky' Harris"],"language":"en","source_country":"US","sentiment":-0.357},{"id":285546828,"title":"New puzzle unfolds with the call sign of the doomed Black Hawk helicopter after the plane crash in DC.","text":"The call sign for the doomed Black Hawk helicopter that crashed into an American Airlines plane and killed more than 60 passengers has sparked mystery as the public struggles to make sense of the tragic incident. \n\nThe Black Hawk was marked as a PAT 25, which stands for priority air transport and is usually reserved for when the Army is conducting VIP missions, such as having officials onboard. \n\nThe Army has confirmed no officials were onboard the aircraft, which was carrying three soldiers, a standard sized crew, according to Fox News Journalist Jennifer Griffin. \n\nThe military aircraft was conducting a training flight, according to Joint Task Force-National Capitol Region Media Chief Heather Chairez. It belonged to B Company, 12th Aviation Battalion out of Fort Belvoir in Virginia. \n\nHowever, some aren’t buying those claims, and question what the crew was carrying onboard for it be designated as a PAT 25. \n\nJacq Cerra, who is in the Army, is one of the people questioning it, saying on TikTok: ‘I’m telling you right now – and they can kill me for saying it – under no circumstances is a military helicopter, especially a f**king Black Hawk, accidentally crashing into a commercial plane. \n\n‘There’s no way,’ she continued before bringing up the call sign. ‘What’s on that helicopter, you know?’ \n\nA TikTok commenter named Uche, who claimed to be a Marine veteran, also thought the crash was weird, writing under Cerra’s video: ‘You’re 100 percent correct, those Black Hawks move damn near omni-directionally and the pilots are top-tier, a lot of questions.’ \n\nA few minutes before the jet was to land, air traffic controllers asked American Airlines Flight 5342 if it could do so on a shorter runway, and the pilots agreed. \n\nControllers cleared the jet to land and flight tracking sites showed the plane adjust its approach to the new runway.\n\nLess than 30 seconds before the crash, an air traffic controller asked a helicopter if it had the arriving plane in sight. \n\nThe controller made another radio call to the helicopter moments later, saying ‘PAT 25 pass behind the CRJ’ – apparently telling the chopper to wait for the Bombardier CRJ-701 twin-engine jet to pass. \n\nThere was no reply. Seconds after that, the aircraft collided.\n\nThe plane’s radio transponder stopped transmitting about 2,400 feet short of the runway, roughly over the middle of the Potomac.\n\nEerie radar footage showed the Black Hawk helicopter cut through the airspace from the opposite direction under cover of darkness, with both aircrafts seemingly unaware of the other’s presence.\n\nThey slammed into one another just 400ft above ground, erupting in a violent explosion before plunging into the freezing Potomac River below.\n\nThe body of the plane was found upside-down in three sections in waist-deep water, officials said. The helicopter’s wreckage was also found. \n\nNew Secretary of Defense Pete Hegseth announced on X that an investigation by the Army and Department of Defense has begun. \n\nHegseth also said the helicopter crew was ‘fairly experienced’ and was performing an ‘annual proficiency training flight.’ \n\n‘They did have night vision goggles,’ Hegseth said in a video posted to X. \n\nMore than 60 people were killed on the American Airlines flight, including figure skaters Spencer Lane and Jinna Han, who both skate in Boston. \n\nSpencer Lane uploaded the photo around 7pm ET Wednesday, which appeared to show the jet taxiing on the runway at Wichita Airport in Kansas before it took off for its final flight.\n\nHe captioned it ICT – DCA – the codes for Wichita Dwight D. Eisenhower National Airport and Ronald Reagan Washington National Airport.\n\nHis mother, Christine Lane, was confirmed dead. Evgenia Shishkova, 53, and Vadim Naumov, 56, Jinna Han’s mother Jin are also dead. \n\nThe three soldiers are also presumed dead. Hegseth did not announce their identities, as their families are still being notified. \n\nPresident Donald Trump has blamed diversity and inclusion for one of the deadliest plane crashes in US history.\n\nSpeaking at the White House, Trump said the tragedy was entirely preventable as he slammed Diversity, Equity and Inclusion (DEI) recruiting practices in federal agencies.\n\nHe added that he had some ‘pretty good ideas’ of how the disaster occurred and vowed to make sure it would never happen again.\n\nTrump then said he put ‘safety’ first while Presidents Barack Obama and Joe Biden prioritized politics and called former Transportation Secretary Pete Buttigieg a ‘disaster’ in an extraordinary attack on previous administrations.\n\n‘He was a disaster as a mayor. He ran his city into the ground and he’s a disaster now. He’s just got a good line of bulls**t,’ Trump said of Buttigieg.\n\nThen he insisted that federal agencies need to be hiring based on intelligence rather than on diversity. He added that Air Traffic Controllers need to be ‘geniuses.’ \n\nHe was also asked about Hegseth’s statement that the Black Hawk was doing an ‘annual retraining, night flights on a standard corridor for a continuity of government mission.’\n\nTrump did not appear to immediately know about continuity of government – which refers to how the government functions during a disaster – when asked about it.\n\n‘I don’t know what that refers to, but they were practicing. They were – they do that. They call it practicing, and that’s something that should be done. It’s only continuity in the sense that we want to have very good people, and that has to be in continuity, and that’s what they referred to,’ Trump said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe call sign for the doomed Black Hawk helicopter that crashed into&#8230;\n\n\nThis Post: New puzzle unfolds with the call sign of the doomed Black Hawk helicopter after the plane crash in DC. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/new-puzzle-unfolds-with-the-call-sign-of-the-doomed-black-hawk-helicopter-after-the-plane-crash-in-dc/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Doomed-Black-Hawk-helicopters-call-sign-sparks.jpg","video":null,"publish_date":"2025-01-31 00:07:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.256},{"id":285552560,"title":"The ‘Trump is a Tyrant’ critics defended Biden’s EOs","text":"There must be a stronger word than hypocrisy to describe the media/Democrat reaction to President Donald Trump’s legitimate and common-sense interpretation of the 14th Amendment and “birthright citizenship.” Section 1 reads: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.”\n\nTrump rejects the widely accepted interpretation that the 14th Amendment grants immediate citizenship to any child born on American soil, even if the child’s parents are in the country illegally. Trump believes the 14th Amendment, ratified in 1868, was designed to confer citizenship on newly freed slaves. \n\nIn fact, Sen. Jacob Howard of Michigan, who introduced the amendment, said, “[The 14th amendment] will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the government of the United States, but will include every other class of person.”\n\nTrump’s opponents cry, “How dare Trump ‘unilaterally’ and by ‘executive order’ reinterpret the 14th Amendment?” Trump, they say, thinks he’s a king. He is “acting like a tyrant.” The Supreme Court will have the final say and will almost certainly interpret the 14th Amendment in Trump’s favor.\n\nWhere were the “Trump is not a king” critics during the Obama and Biden presidencies? \n\nIn October 2010, President Barack Obama said he lacked the power to grant protected status to illegal aliens. “I am president. I am not king,” Obama said. “I can’t do these things just by myself.” \n\nTwo years later, during his 2012 reelection campaign, he proceeded to act like a king. He issued the Deferred Action for Childhood Arrivals (DACA) program to protect some 1 million illegal immigrants from deportation. Obama then protected another 5 million illegal immigrants from deportation under the Deferred Action for Parents of Americans and Lawful Permanent Residents (DAPA) program. \n\nDays ago, the 5th Circuit Court of Appeals ruled against DACA. Eventually, the Supreme Court will likely definitively decide that these programs exceed presidential power as Obama, who taught constitutional law, used to believe.\n\nThis brings us to President Joe Biden and his student debt relief programs. In July 2021, House Speaker Nancy Pelosi said, “People think that the president of the United States has the power for debt forgiveness. He does not. He can postpone. He can delay. But he does not have that power.” \n\nLater that year, Biden provided student debt relief to hundreds of thousands of borrowers. Eventually, Biden forgave some $180 billion of student loans in total. In 2023, the Supreme Court ruled against Biden’s student debt relief. Biden simply crafted another debt relief program recently blocked by a federal court. \n\nThis brings us to DEI – diversity, equity and inclusion. In 2023, the Supreme Court ruled against the use of race as a criterion in admission to colleges and universities, even if the goal is to achieve diversity. The court held racial preferences violate the Equal Protection Clause of the Constitution, as well as Title VI of the Civil Rights Act of 1964. Yet, Biden made DEI a goal of every part of the federal government, as did Obama. \n\nBiden went even further. On his first day in office, he issued an executive order called “Advancing Racial Equity and Support for Underserved Communities Through the Federal Government.” Months later, Biden issued another DEI executive order that said, “As the nation’s largest employer, the federal government must be a model for diversity, equity, inclusion, and accessibility, where all employees are treated with dignity and respect.” \n\nTrump in the first days of his second presidency nullified Biden’s DEI executive orders. Trump’s executive order revoked the “illegal DEI and ‘diversity, equity, inclusion, and accessibility’ (DEIA) mandates, policies, programs, preferences, and activities in the Federal Government, under whatever name they appear.”\n\nHypocrites in the media and Democrats denounce Trump’s “dictatorial” interpretation of 14th Amendment on birthright citizenship, but cheered Biden’s blatantly illegal and unilateral measures to protect illegal immigrants from deportation, to grant student debt relief and to inject race into virtually every aspect of the federal government. \n\nIt’s going to be a long four years.","summary":"President's DEI executive order was just canceling his predecessor's executive order","url":"https://www.wnd.com/2025/01/the-trump-is-a-tyrant-critics-defended-bidens-eos/","image":"https://www.wnd.com/wp-content/uploads/2022/12/joe-biden-big-brother-is-watching-you-red-background-tyranny.jpg","video":null,"publish_date":"2025-01-31 00:06:20","author":"Larry Elder","authors":["Larry Elder"],"language":"en","category":"politics","source_country":"us","sentiment":-0.282},{"id":285546840,"title":"Report Shows Warning of ‘Catastrophic Crash Risk’ Years Before DC Tragedy Due to Alleged Short Staffing in Control Tower","text":"For years, overworked air traffic controllers had been issuing unsettling warnings about the high risk of a “catastrophic” crash. Tragically, these warnings came true when an American Airlines aircraft collided with a Black Hawk helicopter in Washington DC, resulting in the loss of 67 lives.\n\nThe Federal Aviation Administration (FAA) employees had been reporting numerous near misses and consistently cautioning that a deadly accident was inevitable. These concerns were tragically validated during the recent incident.\n\nAccording to Defense Secretary Pete Hegseth, the collision occurred due to an “elevation mistake” which led to the US Army helicopter entering the flight path of the passenger plane while conducting a training maneuver.\n\nThe plane, which was coming from Wichita, Kansas, shattered into three pieces and sank under the ice-cold river waters before 9 pm. No one survived the tragedy.\n\nThis is the deadliest US air crash since November 2001, when 260 people died after an American Airlines plane plunged into a Queens neighborhood.\n\nSome of the victims include teenage ice skaters, world-class athletes, and a crew of seven outdoor-loving family men who were traveling for a hunting trip.\n\nHours after the crash, a damning report surfaced that lifted the lid on the chaos inside Reagan Airport’s control tower.\n\nAccording to the internal report, staffing was “not normal” at the time of the crash, as the controller was doing the jobs of two people, The New York Times reported.\n\nThe controller was responsible for navigating helicopters in the area while also directing planes that were landing and departing from the Washington DC runways – duties normally performed by separate controllers because helicopters and planes use different radio frequencies.\n\nReagan Airport hasn’t had a full staff of air traffic controllers for years, employing only 19 instead of the 30-person target as of September 2023, according to the most recent Air Traffic Controller Workforce Plan.\n\nThis isn’t a unique issue, either. Most airports across the country have struggled to fulfill their quotas.\n\nAir traffic controllers have been overworked for years. Many have been pushed to the brink with grueling hours, only to be punished for finally breaking under the pressure.\n\n‘IS IT GOING TO TAKE PEOPLE DYING?’\n\nIn 2023, it was revealed that several controllers had been fired for being drunk, asleep, or high in the tower as the Federal Aviation Association struggled to find suitable talent to fill the empty slots.\n\nAt the time, desperate controllers wrote the FAA for help and warned of imminent danger looming on the horizon.\n\n“Controllers are making mistakes left and right. Fatigue is extreme,” one person wrote in a report seen by The New York Times.\n\n“The margin for safety has eroded tenfold. Morale is rock bottom. I catch myself taking risks and shortcuts I normally would never take.”\n\nIn a now-disturbing comment, another person wrote, “Is it going to take people dying for something to move forward?”\n\nWhen asked about the details of the crash, National Transporation Safety Board Chairwoman Jennifer Homendy said they are looking at every possible element.\n\n“As part of any investigation, we look at the human, the machine, and the environment,” she said in a briefing.\n\n“So we will look at all the humans that were involved in this accident. We will look at the helicopter.\n\n“We will look at the environment in which they were operating in. That is standard in any part of our investigation.”\n\nTRUMP’S FURY\n\nFurious President Donald Trump blamed diversity, equity, and inclusion policies for causing air traffic control issues in a fiery press conference.\n\nHe pointed to another grim report highlighting how the FAA was looking to hire people with disabilities, including “vision, severe intellectual disability, and complete paralysis.”\n\n“This was a dark and excruciating night in our nation’s capital and in our nation’s history, and a tragedy of terrible proportions,” he said.\n\n“The FAA is actively recruiting workers who suffer severe intellectual disabilities, psychiatric problems, and other mental and physical conditions under a diversity and inclusion hiring initiative spelled out on the agency’s website.\n\n“We have to have our smartest people […] They have to be naturally talented geniuses.”\n\nVICTIMS NAMED\n\nIce skaters Spencer Lane, 16, and Jinna Han, 13, died in the crash alongside their mothers after traveling to Wichita for the US National Championships.\n\nLane’s coaches, Russian natives Evgenia Shishkova and Vadim Naumov, were also on the plane when it plummeted into the waters.\n\nThe skating pros, who were married, won a world championship in 1994. They had a son, Makim, who wasn’t on the flight.\n\nA crew of seven outdoor-loving friends who traveled to Kansas for a hunting trip were also on the plane.\n\nAnd a woman who was flying to meet her husband died minutes after sending a now-tragic text message.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFor years, overworked air traffic controllers had been issuing unsettling warnings about&#8230;\n\n\nThis Post: Report Shows Warning of &#8216;Catastrophic Crash Risk&#8217; Years Before DC Tragedy Due to Alleged Short Staffing in Control Tower first appeared on Internewscast Journal","url":"https://internewscast.com/news/report-shows-warning-of-catastrophic-crash-risk-years-before-dc-tragedy-due-to-alleged-short-staffing-in-control-tower/","image":"https://www.the-sun.com/wp-content/uploads/sites/6/2025/01/Alamy_Live_Dozens_Dead_As_Army_Helicopter_and_Passenger_Jet_2SANJ6Fjpg-JS967901432.jpg?strip=all&w=960","video":null,"publish_date":"2025-01-31 00:06:10","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.375},{"id":285548426,"title":"New Trump memo claims DEI, Obama and Biden 'decisions' linked to fatal aviation disaster","text":"President Donald Trump continued his attacks on his Democratic predecessors and diversity programs late Thursday afternoon, signing a presidential memo that linked “decisions” made by Presidents Barack Obama and Joe Biden’s administrations, and DEI initiatives, to Wednesday’s mid-air collision between an Army helicopter and a regional commercial airplane. The President’s memo offers no practical evidence they played a role. Sixty-seven people are believed to have died, and no one is believed to have survived.\n\nTrump’s memo orders “a systematic assessment of any deterioration in hiring standards and aviation safety standards and protocols during the Biden Administration.”\n\nAxios reports that the “order shows Trump is doubling down on his claim, without evidence, that DEI policies were a factor in the crash. His memo explicitly mentions ‘diversity equity and inclusion,’ and reflects how anti-DEI efforts are a centerpiece of his second administration’s policy.”\n\nREAD MORE: ‘That Is So Dangerous’: RFK Jr. Blasted for Claim on Black Immunity and Vaccines\n\nCritics, including U.S. Senator Chris Murphy (D-CT), say the incident took place on Trump’s watch, after he allowed the head of the FAA to reportedly resign under pressure, and gutted a critical aviation safety group Trump also just fired the head of the TSA, and placed a hiring freeze on nearly all government positions.\n\nOne Federal Aviation Administration traffic controller was assigned to both helicopters and planes when the deadly collision occurred, the FAA stated in a report.\n\n“The report, reviewed by The New York Times, said that one controller was communicating with both helicopters and planes. Those jobs are typically assigned to two people, not one,” The Times reported. “Staffing at the air traffic control tower at Ronald Reagan National Airport was ‘not normal for the time of day and volume of traffic,’ according to an internal preliminary Federal Aviation Administration safety report about the collision that was reviewed by The New York Times.”\n\nStaffing at Ronald Reagan Washington National Airport “has been understaffed for years,” and “nearly a third below targeted staff levels,” The Times reports, citing “years of employee turnover and tight budgets.”\n\nRELATED: Trump’s Claim Diversity and Democrats ‘Could Have’ Caused Deadly Collision Draws Backlash\n\nCalling the deadly collision a “shocking event” Trump’s memo says it “follows problematic and likely illegal decisions during the Obama and Biden Administrations that minimized merit and competence in the Federal Aviation Administration (FAA).”\n\nA CNN fact check found that a congressional law from 1973 “aimed to increase federal hiring of qualified people with disabilities.”\n\n“The Obama Administration implemented a biographical questionnaire at the FAA to shift the hiring focus away from objective aptitude,” Trump’s memo alleges. He claimed “the Biden Administration egregiously rejected merit-based hiring, requiring all executive departments and agencies to implement dangerous ‘diversity equity and inclusion’ tactics, and specifically recruiting individuals with ‘severe intellectual’ disabilities in the FAA.”\n\nThe memo claims, “During my first term, my Administration raised standards to achieve the highest standards of safety and excellence,” but a CNN fact check reveals that “Trump’s FAA used the same language about hiring people with disabilities [that] he’s now blasting.”\n\n“During his Thursday press conference,” CNN reported, “President Donald Trump repeatedly suggested there was a link between the tragedy and diversity hiring policies at the Federal Aviation Administration.”\n\n“It’s most important to note that Trump provided no evidence whatsoever that there was any such connection. But it’s also worth noting that some of Trump’s specific assertions about the FAA’s push to hire people with disabilities were either inaccurate or missing critical context about what happened during Trump’s own first presidency.”\n\nPolitical strategist Donna Brazile noted, “Without an investigation or the recovery of all of the souls that have fallen, Trump inflicts partisan damage without proof or evidence.”\n\nWatch the videos above or at this link.\n\nREAD MORE: ‘This Is His Responsibility’: Trump’s Response to Deadly Mid-Air Collision Stuns Critics","summary":"President Donald Trump continued his attacks on his Democratic predecessors and diversity programs late Thursday afternoon, signing a presidential memo that linked “decisions” made by Presidents Barack Obama and Joe Biden’s administrations, and DEI initiatives, to Wednesday’s mid-air collision between an Army helicopter and a regional commercial airplane. The President’s memo offers no practical evidence they played a role. Sixty-seven people are believed to have died, and no one is believed to have survived.\n\nTrump’s memo orders “a systematic assessment of any deterioration in hiring standards and aviation safety standards and protocols during the Biden Administration.”\n\nAxios reports that the “order shows Trump is doubling down on his claim, without evidence, that DEI policies were a factor in the crash. His memo explicitly mentions ‘diversity equity and inclusion,’ and reflects how anti-DEI efforts are a centerpiece of his second administration’s policy.”\n\nREAD MORE: ‘That Is So Dangerous’: RFK Jr. Blasted","url":"https://www.alternet.org/trump-obama-biden-dei/","image":"https://www.alternet.org/media-library/image.jpg?id=56123151&width=1200&height=600&coordinates=0%2C76%2C0%2C76","video":null,"publish_date":"2025-01-31 00:05:58","author":"David Badash","authors":["David Badash"],"language":"en","category":"politics","source_country":"us","sentiment":-0.442},{"id":285549608,"title":"Illegals get more than they bargained for as FBI joins Trump DHS' criminal alien crackdown: photos","text":"EXCLUSIVE: The FBI is on the ground working alongside agents from the Department of Homeland Security (DHS) and other law enforcement bodies conducting a nationwide crackdown on criminal aliens ordered by President Donald Trump, photos obtained by Fox News Digital reveal. \"I've talked to every single one of our special agents in charge of all 55 of our divisions,\" acting FBI Director Brian Driscoll told Fox News Digital Thursday. \"I know that every single one of them has reached out to their DHS counterparts to offer assistance and support. So we here at the FBI are really leaning forward to assist DHS the best that we can, to stand shoulder-to-shoulder.\" The FBI's presence bolsters Immigration and Customs Enforcement, Border Patrol and other partner agencies with the bureau's vast resources, including tactical teams and its intelligence network. VP VANCE DOUBLES DOWN ON WHITE HOUSE GOAL TO GET CRIMINAL MIGRANTS OFF THE STREETS Those resources worked alongside DHS agents in New York City earlier this week, helping identify and capture dozens of \"the worst of the worst\" suspects, including a 25-year-old suspected Tren de Aragua gang member. He is believed to have been involved in a violent incident in Colorado before police found him Monday in a Bronx apartment across the street from a school. MIGRANT TDA GANG MEMBER BREAKS OFFICER'S ARM AS 10 INDICTED IN MASSIVE GUNS, DRUG RUNNING OPERATION: POLICE And they extend across the country. In El Paso, Texas, the FBI, Homeland Security Investigations, ICE and agents from its Enforcement Removal Operations wing were seen on the ground as part of a mission that led to the capture of a suspect accused of running a stash house for human smugglers. CHINESE MIGRANTS FLOOD SOUTH FLORIDA VIA BOAT AS AUTHORITIES SEEK HELP WITH CUBAN SMUGGLERS \"Our best chance to protect Americans, whether it's from the threats posed by groups like ISIS or in our efforts to dismantle groups like Tren de Aragua, the best way to do that is to put our heads together, our tools together, our efforts together with DHS, but also with all of our United States intelligence community and law enforcement partners around the country,\" Driscoll said. In a series of targeted raids in Chicago, the FBI provided not just intelligence and tactical SWAT team members, but also legal experts to help round up illegal immigrants with suspected criminal ties. In New York, they provided \"advanced tactical support\" and helped set up a crisis management coordination center covering the whole city. CLICK HERE TO GET THE FOX NEWS APP \"We are and will remain postured to support DHS the best that we can over here at the FBI,\" Driscoll said. Operations across the country over the past seven days have netted roughly 5,500 suspected criminal aliens, according to numbers released by ICE.","summary":"Exclusive new photos show the FBI has joined Homeland Security in President Donald Trump&apos;s nationwide crackdown on criminal aliens and migrant crime.","url":"https://www.foxnews.com/us/illegals-get-more-than-bargained-fbi-joins-trump-dhs-criminal-alien-crackdown-photos","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/fbi-immigration-enforcement_03.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-31 00:05:20","author":"Michael Ruiz","authors":["Michael Ruiz"],"language":"en","category":"politics","source_country":"US","sentiment":0.325},{"id":285549342,"title":"Here’s Where California Democrats Are Pointing the Finger of Blame for Wildfires","text":"You knew this was coming. California’s Democrat legislators presented a bill Monday to allow insurers and homeowners impacted by the Los Angeles fires to sue oil companies for their losses. Senate Bill 222 aims to blame the fires on climate change caused by fossil fuels and make the oil companies bankroll the state’s underfunded insurance plan.\n\nThe move is a predictable response by the one-party state’s leaders seeking to deflect from their own gross mismanagement of the city and state, which is the real cause of the disaster. They destroyed the home insurance market by driving out insurance companies through onerous price controls. As a result, the state is on the hook for billions in damages covered by its “FAIR Plan” insurance, established as coverage of last resort for homeowners. The bill proposes that the oil companies serve as the backstop for the FAIR Plan.\n\nLeaders bowing to environmentalists also created the conditions for huge wildfires by failing to properly manage the forests through basic brush clearance and controlled fires that are standard in other states.\n\nAdditionally, through shear gross negligence, firefighters ran out of water because city officials allowed the Pacific Palisades’ 117-million-gallon reservoir, built to fight fires, to sit empty for almost a year awaiting a minor, $130,000 repair.\n\nAnd they cut the LA Fire Department budget, leaving the city with the same number of firefighters and fire stations it had in 1960. Quite incredible, since it is these same leaders who are constantly warning us that alleged “climate change” will cause a lot more fires.\n\nThe assertion that oil companies are responsible for the damage caused by the fires and thus should pay for the damage is absurd, but it is in line with similar efforts by state Democrats. For example, before the LA fires, California Attorney General Rob Bonta recently sued the oil companies for huge damages based on the alleged effects of climate change in general. The money is to go into an “abatement fund” to be used to advance the goals of climate activists. \n\nThe new proposed SB 222 would allow insurance companies and their customers to sue under the same theory, although the merits of such cases are wildly dubious.\n\nThe state’s case, People v. Exxon, was filed in California state court in San Francisco in September. Instead, it should be in federal court. Alleged pollutants rising to the skies and supposedly changing the world’s weather is clearly a federal concern and preempted by numerous federal laws, including the Clean Air Act. \n\nIn addition to Exxon, Bonta sued Shell, Chevron, ConocoPhillips, and Phillips 66. The Complaint asks that the industry create “an abatement fund to pay the costs of such abatement.” To abate the effects of climate change, one must stop the climate from changing, which only God has been able to accomplish. The cost is unknown, unknowable, and infinite.\n\nThe first sentence of the complaint reveals its absurdity. It reads, “In 2023 alone, the State of California has endured both extreme drought and widespread flooding, sprawling wildfires and historic storms, and an unusually cold spring and a record-hot summer.” \n\nClimate change, if it is to be believed, is a worldwide phenomenon occurring over about a 100-year period. Thus, pointing to weather events in a single year in a tiny corner of the world makes no sense and proves nothing. \n\nFurther, the allegations are absurdly broad. The state asserts the weather has been both too hot and too cold. It says there has been drought yet also storms and flooding.\n\nThe truth is, as President Donald Trump has been highlighting, California’s leaders have been negligent in managing the state’s natural resources. California has severe droughts because its environmentalists refuse to allow the building of sufficient reservoirs to hold water from wet years to get us through the dry years. Instead, our leaders let the majority of water drain into the Pacific Ocean.\n\nThe severe wildfires take hold because of forest mismanagement. Environmentalists block the proper care for our forests, such as managing brush, leaving the land susceptible to bigger fires. The forests in Arizona are much warmer than in California, yet Arizona does not have California’s wildfire problem.\n\nThe legal complaint states, “These extremes are the products of climate change, and climate change is the product of widespread combustion of fossil fuels.” Not only are these weather events not evidence of climate change, but Bonta, and insurance companies under the new legislation, will not be able to prove fossil fuels are the cause. They would have to prove both that these weather events were caused by increased carbon dioxide emissions in the state and that the increase was caused by these five oil companies.\n\nClimate change, whatever that is and to the extent it exists, does not come from California or from five companies. It is a global phenomenon. The truth is, thanks in part to these companies, the U.S. has been producing less air pollution in recent years. \n\nNotably, however, smog levels are still rising in the West due to pollution from China and India drifting over the Pacific Ocean. “Scientists found Asian air pollution contributed as much as 65% of an increase in Western ozone in recent years,” said one NPR report. \n\nBonta and state legislators hope these cases will bury the U.S. oil industry, yet they do nothing to prevent China from continuing to pollute our state at will with the fossil fuels of their choice.\n\nIf anyone should act as a backstop to the FAIR Plan, it is the electric company Southern California Edison, not oil companies. “Residents are chronically underinsured under the FAIR Plan policies,” said Alina Landver, an LA wildfire and insurance attorney. “[Southern California] Edison disputes the claim that its equipment started the fire, … but federal investigators now believe Edison suppressed evidence of its role in the 2017 Creek Fire.” Los Angeles’ Creek Fire burned over 15,000 acres and destroyed over 120 structures in 2017.\n\nCommon sense is required to return California to good governance, not novel, far-fetched lawsuits.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"You knew this was coming. California’s Democrat legislators presented a bill Monday to allow insurers and homeowners impacted by the Los Angeles fires to sue... Read More\n\n\nThe post Here’s Where California Democrats Are Pointing the Finger of Blame for Wildfires appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/01/30/heres-where-california-democrats-are-pointing-finger-blame-wildfires/","image":"https://www.dailysignal.com/wp-content/uploads/2025/01/bonta.jpg","video":null,"publish_date":"2025-01-31 00:04:16","author":"James Breslo","authors":["James Breslo"],"language":"en","source_country":"us","sentiment":-0.568},{"id":285552578,"title":"1 of many reasons we need RFK Jr. at HHS","text":"It is reported between 400 and 17,000 doctors are calling on the Senate to reject President Donald Trump’s pick to lead the Department of Health and Human Services, Robert F. Kennedy Jr. Remember that many of these same doctors were jabbing people with the COVID-19 RNA-changing vaccine, causing blood clots and being part of the largest “gene therapy” research project in history, according to the head of Bayer. Of course, fact checkers said the Bayer executive’s comments were “misinterpreted,” and a Bayer spokesperson stated this comment was an “obvious slip of the tongue.” Would that be like a Freudian slip, when the mouth reveals truth from the subconscious?\n\nRecall that the FDA gave the COVID vaccine Emergency Use Authorization, meaning it did not follow the normal vaccine protocols. So, would I suggest listening to these doctors about anything? You decide, but you also might want to consider the fact that Breitbart also recently reported that the doctors’ “committee” opposing Robert F. Kennedy Jr. is an organization accepting fake signatures. Breitbart News added to the list the name, Dr. Donald Duck, OG, of Disney World, FL, specializing in podiatry. Also, remember that it took five years for the CIA to “reveal” that the virus came from Wuhan, China.\n\nNext, consider the Senate to which these supposed doctors are writing. According to Statista Research Department’s report of Sept. 17, 2024, the latest approval rating for Congress went up – to 19% approval, with a 76% disapproval rate, implying 76% of Americans would fire Congress.\n\nConcerning “the way the U.S. is run,” a a Fox News voter-analysis shows that 27% of Americans want “total upheaval” and 56% want a “substantial change.” That means 83% of America think we at least need a “substantial change” in the way the U.S. is run.\n\nWe need to keep track of any “Republican” not supporting Trump’s voter-given mandate, for they need to be voted out in the next primary elections and replaced with real Republicans who listen to people they represent.\n\nNow let’s look at just one of the major issues RFK Jr. plans to address: high fructose corn syrup (HFCS). Why would RFK Jr. want to remove HFCS from foods in America? Does he just not want us to satisfy our sweet tooth? No, not at all.\n\nDon’t miss WND’s latest Whistleblower edition, a comprehensive report on the poor health of the average American and the need to “Make America Healthy Again.”\n\nI first read of the problem with HFCS in the 1990s. After that, my family and I have strived to exclude HFCS products from the items we purchase. Back then, I went back to find the papers I had read on the internet, and they had been removed. It was weird, but I never forgot what I read. Now I have found references again.\n\nWhat evil could possibly be hiding in the cheap sweetener found in a huge variety of foods, some of which you wouldn’t even think contained something sweet and may not even have a sweet taste? HFCS is at least 55% fructose. Fructose blocks the receptors in your brain that tell your body that it is full. It also releases dopamine, producing a pleasure response, which can lead to food addiction and binge eating.\n\nSo, when you think that eating that cookie with HFCS is going to satisfy your craving, it’s not. Instead, it’s going to increase your craving so you will eat that whole box of cookies. Think about how happy this makes the cookie makers, because they want to sell you another box of cookies. The problem is that this is not just in cookies, but HFCS is in soft drinks, baked goods, cereals, canned fruits, jellies, dairy desserts, pickles, flavored yogurts and even chowders and processed meats such as sausage and ham, and the list goes on. It’s hard to find products that don’t contain HFCS. Think about it. You purchase those French fries and obtain a packet of ketchup. You eat the fries, but boy, you could still eat some more. Well, that little packet of ketchup contained HFCS. It is a wickedly brilliant sales plan.\n\nIn one of numerous studies, scientists used MRI scans to track the blood flow in the brain of 20 young, normal-weight people. These people were given drinks with either glucose or fructose. Scans showed that drinking glucose “turns off or suppresses the activity of areas of the brain that are critical for reward and desire for food,” according to Yale University endocrinologist Dr. Robert Sherwin. With fructose, “we don’t see those changes. … As a result, the desire to eat continues – it isn’t turned off.”\n\nAccording to Dr. Richard Johnson, author of “The Fat Switch,” when glucose is metabolized, cells remain healthy and sugar is burned to produce energy. When fructose is metabolized, it takes more energy, thus there is actually a decrease in the net energy provided to the body. Dr. Johnson states that fructose stimulates appetite and fat accumulation not found with the metabolism of other sugars. He states that HFCS creates metabolic chaos in every aspect of appetite and weight management, leading to leptin resistance, desensitizing leptin receptors. Leptin is a hormone very important for weight control and regulating the balance between energy expenditure and food intake. Leptin tells the body how much fat to store. With leptin receptors desensitized, the person has no desire to stop eating, finds it difficult to control cravings and thus gains weight.\n\nIt is going to take guts to stand up to nearly every cookie company, most pickle companies, most ketchup companies, soft drink makers and a world of others. Robert F. Kennedy Jr. is such a man, for he went against the Democratic Party and the long-time Democrats of his family to endorse Donald Trump for president and then accepted a nomination under a Republican president. We need a man like RFK Jr. to Make America Healthy Again.","summary":"Kennedy wants to remove high fructose corn syrup from our food ... good riddance!","url":"https://www.wnd.com/2025/01/1-of-many-reasons-we-need-rfk-jr-at-hhs/","image":"https://www.wnd.com/wp-content/uploads/2025/01/rfk-jr-robert-f-kennedy-senate-confirmation-hearing-20250129-jpg.jpg","video":null,"publish_date":"2025-01-31 00:04:10","author":"Richard Blakley","authors":["Richard Blakley"],"language":"en","source_country":"us","sentiment":-0.411},{"id":285551336,"title":"Trump blasts Buttigieg after DC aircraft collision: ‘He’s a disaster’","text":"to top close Video This video is playing in picture-in-picture.\n\nSpecial Report January 30, 2025 03:25 \n\n Trump blasts Buttigieg after DC aircraft collision: ‘He’s a disaster’ \n Fox News senior White House correspondent Jacqui Heinrich has the latest on President Donald Trump’s response to the aircraft collision near Washington, D.C. on ‘Special Report.’\n Facebook Twitter Email Copy to clipboard Copy to clipboard Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRSPECIAL REPORTPOLITICSDONALD TRUMPTRANSPORTATIONAFTERMATH","summary":"Fox News senior White House correspondent Jacqui Heinrich has the latest on President Donald Trump’s response to the aircraft collision near Washington, D.C. on ‘Special Report.’","url":"https://www.foxnews.com/video/6368021583112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a76ea052-3829-4fa3-a8f9-a5dd924e5ff9/860f1d35-9029-4c86-aefe-72c8c48c809f/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-31 00:03:12","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.654},{"id":285552586,"title":"Insulation vs. Installation: A tale of 2 presidents","text":"In 1985, my first year as a doctoral student studying Hebrew/Semitic literature at the University of Michigan in Ann Arbor, I was hired as an administrator at First United Methodist Church on State Street. Looking out my new office window across our parking lot to First Baptist Church, I was told the story of our local newspaper’s embarrassing snafu upon that church’s hiring of Dr. Jitsuo Morikawa. Instead of announcing the new pastor’s “installation,” the headline read, “The Insulation of Dr. Morikawa.” \n\nHuge difference! The Christian Century laughingly categorized the mistake as a Freudian slip, since we naturally prefer insulation to installation. \n\nWith those two words, I offer a tale of two American presidents – the insulated Joe Biden followed by, thankfully, a president truly installed into that office, Donald Trump.\n\nCloistered from voters during the 2020 campaign, Biden’s cognitive impairment remained shielded right up until his debate with Trump last June. Stupidly challenging Trump to “make my day” (when he might conceivably have weaseled out on the premise that his opponent was a “convicted felon”), Biden’s disastrous performance sent Pelosi, Schumer and Obama into the fetid White House attic to vacuum out the rotting insulation that had long sheltered Biden from exposure. \n\nAmerica needs a real president, and on Jan. 20, Donald Trump was genuinely installed into the office. True to the word’s etymology, we now have a president “in the stall,” taking upon himself the yoke of leadership and going to work in fulfilling his campaign pledges by pulling the sharp plow of responsible government across the long-neglected ground of the American body politic.\n\nPlowing is an apt metaphor, Trump’s blade churning up the hard-baked soil of the Deep State, loosening the dirt for the planting of new seed with hopes of a golden harvest on the horizon.\n\nAs a pastor, I recall a child in the pew who, during the sermon, laid her head in her father’s lap. Seeing her daughter gently cushioned, mom whispered, “There, Henry, how sweet. You always did want to be a pillar of the church.” \n\nThe word play between “pillow” and “pillar” tells precisely the same tale of these two American presidents. After four years of Biden pillowed and insulated, Trump is now installed as the key pillar of the executive branch. \n\nHe can’t do it alone, though. Like oxen “in the stall” being yoked together to accomplish plowing, a single pillar cannot be enough. That grandest MAGA hope for Trump 2.0 is that his picks for key government positions will be better than Trump 1.0.\n\nIt’s looking good. Those lesser, yet nevertheless vital, pillars chosen by Trump to hold up the infrastructure of government are determined to restore our once proud institutions to respect, after having been weakened by open border and DEI policies, rampant wokeism leading to trans-craziness, blatant lawfare against Trump and others, from J6 participants to parents at school boards or praying pro-life advocates.\n\nIf Joe Biden has been the pillar of anything, it is of his own family’s corrupt involvement in influence peddling, he claiming Hunter’s infamous title for his father: the Big Guy.\n\nBack to Ann Arbor. Later in the same year of 1985, Oct. 14 to be exact, I left my State Street office to walk only a few blocks through campus toward the Michigan Union. Vice President Bush had been sent by President Reagan to speak, and I wanted to hear him. \n\nWhy then? Why there? Oct. 14 was the 25th anniversary of John F. Kennedy’s first mention, during the 1960 presidential race with Richard Nixon, of what would become the Peace Corps. Bush was to stand on the steps of the Michigan Union, at the very spot recognized as the birth of the Peace Corps, and I wanted to be there to hear the story.\n\nAfter the third of four televised debates with Nixon in New York, JFK flew to Ann Arbor to campaign in the swing state of Michigan. It was an unannounced visit, the intent being to sneak the senator in, allowing his head to hit the pillow for a precious few hours of sleep. \n\nWord of his arrival leaked, though, so that when he stepped out of the car at the Michigan Union at 2 a.m., he saw over 5,000 students and faculty gathered, awaiting his arrival. \n\nHe felt he had to speak, and did for a spontaneous three minutes in which he invited students to yoke their energies together for the good of America and the world. \n\nKennedy opened, “I want to express my thanks to you, as a graduate of the Michigan of the East, Harvard University.”\n\nThen, growing serious, he continued, “How many of you who are going to be doctors are willing to spend your days in Ghana? Technicians or engineers, how many of you are willing to work in the Foreign Service and spend your lives traveling around the world? On your willingness … to contribute part of your life to this country, I think will depend the answer whether a free society can compete. I think it can! And I think Americans are willing to contribute. … So, I come here tonight … to go to bed!” \n\nThat joke line was followed by the inspirational words of a leader calling, not for his people to seek insulation, but to be installed as pillars: “But I also come here tonight to ask you join in the effort. This is the longest short speech I’ve ever made; therefore, I’ll finish it! Let me say in conclusion, this university is not maintained by its alumni or by the state merely to help its graduates have an economic advantage in the life struggle. There is certainly a greater purpose.”\n\nSen. Kennedy had come to Ann Arbor for a few hours of pillowed insulation. Instead, he challenged the students to be installed as pillars of service.\n\nRemembering JFK’s words, I think of Donald Trump, one with abundant resources to have surrounded himself with pillows, insulating himself from the hard work of plowing the neglected field with competent and visionary policies. \n\nLike JFK, Trump chose installation over insulation, and America will be better for it.","summary":"Trump is pulling the sharp plow of responsible government across long-neglected ground","url":"https://www.wnd.com/2025/01/insulation-vs-installation-a-tale-of-2-presidents/","image":"https://www.wnd.com/wp-content/uploads/2022/05/amish-farmers-plowing-horses-ohio-pixabay.jpg","video":null,"publish_date":"2025-01-31 00:02:01","author":"Siegfried Johnson","authors":["Siegfried Johnson"],"language":"en","source_country":"us","sentiment":-0.143},{"id":285547526,"title":"Letters: Donald Trump leads the return of the good-old-boy network","text":"Trump ushers in return\nof good-old-boy network\n\nIf you’re curious what the country will look like after the dismantling of DEI, look no further than Donald Trump’s Cabinet.\n\nOf Trump’s 30 or so nominations only one is a Black American and he is tabbed to manage HUD, the one post that every Republican president cedes to a Black person. Trump has chosen just two Hispanics and one, Lori Chavez-DeRemer for Labor, is a nomination that Rand Paul says is already dead on arrival.\n\nWithout DEI most bosses like Trump will again revert to staffing their leadership positions with members of their family, long-time friends and other White people who, despite a lack of experience or expertise, will be chosen because of their pledge of absolute fealty.\n\nWith the return of the good-old-boy network, I can hardly wait to hear how the GOP will try to convince us that this system is actually fairer or more productive.\n\nReform Prop. 13 to\nboost first-responders\n\nRe: “Fire departments lament low staffing” (Page A1, Jan. 27).\n\nCalifornia is woefully underprepared for the growing threat of fires throughout the state. The fires ravaging Southern California prove this, and data surrounding firefighter staffing and fire department funding shows that the Bay Area is underprepared as well. Despite this, there are proposals to close fire stations in Oakland, which would further hinder fire preparedness. So, in areas facing budget deficits like Oakland, where can we get the money to properly fund fire preparedness efforts? The answer is reforming Proposition 13.\n\nProp. 13 has robbed our local governments and communities of billions of dollars over the past 46 years. If corporations simply paid their fair share in property taxes, we would have the money to fund our fire departments and be prepared for further climate disasters. California’s public services and public schools have been underfunded for decades, but it’s never too late to invest in our future.\n\nRhys Hedges\nSan Francisco\n\nSupervisors should look\nagain at artificial turf ban\n\nRe: “Artificial turf ban fails to take root” (Page B1, Jan. 30).\n\nOn Tuesday, the Santa Clara County Board of Supervisors considered an ordinance to prohibit new artificial turf installations. Although the ordinance was limited to county-owned property and despite strong evidence that people are now at risk from plastic contamination, only two supervisors voted in favor of the ordinance.\n\nThe evidence shows that most of us already have traces of plastic residue in our bodies and that includes the heart, brain and blood of newborns. The artificial turf industry has refused to fully disclose the chemical composition of its product and is relentlessly promoting artificial turf and lawns.\n\nWe should thank Otto Lee, the sponsor of the ordinance, and Margaret Abe-Koga, the other yes vote, for putting the health of the residents first. Hopefully, as more evidence comes out proving the health risks of plastic grass, the other three supervisors will be open to looking at this issue again.\n\nSave firehouse and\nsave town’s charm\n\nOn Jan. 21 the Los Gatos Town Council voted for disposal of the historic fire station property (built in 1926) at 4 Tait Ave., removing it from the Broadway Historical District. We are already seeing about a dozen SB 330 high-rise building proposals throughout town and this could be another such site. Revenue from such a sale is not worth the damage in the neighborhood. If they keep it, preserving not just this site but the character of this neighborhood, then this community resource could serve several local volunteer service organizations as a site for meetings and storage and as a display area for historical items in town.\n\nWhile the building needs some upgrades and maintenance, local groups — such as Los Gatos Veterans Memorial and Support Foundation, Kiwanis, Rotary and the American Legion — with other local townsfolk could be volunteer workers for these tasks. Let’s preserve our heritage and town charm.\n\nMove toward theocracy\nis move toward disaster\n\nFreedom of religion is a wonderful gift protected by the Constitution. That means we can believe whatever we want as long as we don’t try to force-feed our beliefs to anyone else.\n\nOf course, freedom of religion also can mean freedom from religion. Lately, though, there has been some chatter about a “Christian nation.” Now we are not a Christian nation, our founders did not intend for us to be a Christian nation, and I’m not sure it is even possible to have a true Christian nation. We would certainly have to treat people differently than we do now. Check out the New Testament and see what Christ has to say about immigrants or the poor.\n\nNow here’s the scary part: Look at those political systems around the world where theology and autocracy have become entangled. They are among the worst on Earth. I’ll take the Constitution any day.","summary":"Also: Reform Prop. 13 &#124; Artificial turf &#124; Save firehouse &#124; Theocracy disaster. Mercury News reader letters to the editor for Jan. 31, 2025.","url":"https://www.mercurynews.com/2025/01/30/letters-trump-return-good-old-boy-network/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/AP25014566678124.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-31 00:00:33","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.127},{"id":285550430,"title":"US ‘in contact’ with Russia – Trump","text":"The US government has reached out to Moscow regarding the Russian nationals killed in the crash of a civilian airliner and a military helicopter at Washington National Airport, President Donald Trump has said.\n\nAll 64 passengers and crew members aboard Flight 5342 died when their Bombardier CRJ700 collided with an H-60 Black Hawk helicopter while attempting to land in the US capital on Wednesday evening. Three members of the US military on board the helicopter were also killed.\n\n“We had a Russian contingent – some very talented people – unfortunately on that plane,” Trump told reporters at a White House briefing on Thursday. “Very, very sorry about that.”\n\n“We’ve already been in contact with Russia,” Trump said in response to a question from the press. He also stated that the US “will facilitate” the transfer of the remains of any Russian nationals killed in the crash, regardless of the sanctions and flight bans currently in effect.\n\nThe Kremlin later clarified that the “contact” Trump mentioned did not involve direct communication between him and Russian President Vladimir Putin.\n\nThe Russian embassy in Washington expressed its condolences to the American people over the tragedy, adding, “We were especially saddened to learn from the White House that there were Russian citizens on board the airliner.”\n\n“We are grateful to the American authorities, with whom we are in constant contact, for the words of support expressed to the families of the victims and their readiness to help with the transfer of the remains to their homeland,” the embassy said in a statement on Thursday. It added that it was still awaiting information from the State Department about the Russian nationals who died in the crash.\n\nAmerican Airlines, whose subsidiary PSA operated Flight 5342, has not yet released the names of the crew or passengers. However, some victims have been identified through social media posts and interviews with family members and friends.\n\nMany of the passengers were athletes, coaches, and family members returning from the US Figure Skating Championships in Wichita, Kansas. Among them were Vadim Naumov and Evgenia Shishkova, the 1994 world champion figure skaters and former Russian Olympians who moved to the US in 1998 and worked as coaches.\n\nFormer Soviet professional skater Inna Volyanskaya was also confirmed to have been on board by Congressman Suhas Subramanyam, a Virginia Democrat, in whose district she lived.\n\nThe Trump administration has pledged to conduct a swift and thorough investigation into the causes of Wednesday’s tragedy. The US president has suggested possible errors by the helicopter crew or air traffic control at Ronald Reagan National Airport, citing videos that captured the crash.","summary":"Washington is working with Moscow to repatriate the remains of Russian nationals who died when a US airliner collided with a helicopter \nRead Full Article at RT.com","url":"https://www.rt.com/news/611954-trump-russia-contact-plane-crash/","image":"https://mf.b37mrtl.ru/files/2025.01/article/679c125c85f54043ec14c7bb.jpg","video":null,"publish_date":"2025-01-31 00:00:25","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.13},{"id":285550762,"title":"Trump jokingly asks reporter if he should swim to visit Washington DC plane crash site","text":"Donald Trump jokingly asked a reporter if he should swim to visit the Washington DC plane crash site.\n\nThe president was asked if he had any plans to visit the site of the American Airlines and military helicopter collision, as rescue workers scoured the Potomac River.\n\nHe replied: “I have a plan to visit, not the site. Because what, you tell me. What's the site? Water. We're going to go swimming?”\n\nTrump said he would be meeting with family members of some of the 67 victims of the deadly crash.","summary":"Donald Trump jokingly asked a reporter if he should swim to visit the Washington DC plane crash site.","url":"https://www.independent.co.uk/tv/news/trump-dei-plane-crash-cause-swim-joke-b2689557.html","image":"https://static.independent.co.uk/2025/01/30/22/10/SEI237987086.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/nkYN1nN5-4VHSaSK0.mp4","publish_date":"2025-01-31 00:00:22","author":"Lucy Leeson","authors":["Lucy Leeson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.512},{"id":285554588,"title":"Trump’s Paris Agreement exit could push Indonesia towards China for climate funding","text":"US President Donald Trump’s decision to exit the Paris Climate Agreement has cast doubt over Washington’s commitment to a key clean energy partnership with Indonesia, raising the possibility that Jakarta may turn to China for climate funding.\nOn Tuesday, the United Nations confirmed the US formally sent a notification of its withdrawal from the climate accord effective January 27, 2026, UN spokesman Stephane Dujarric said.\nThe Paris Agreement, signed in 2015 by nearly 200 countries, aims to reduce greenhouse gas emissions and limit global warming to no more than 1.5 degrees Celsius above pre-industrial levels, or those recorded in the late 19th century.\nClimate scientists warn that exceeding this threshold would make it challenging for humanity to adapt to climate change.\nDujarric noted that the US withdrew from the climate pact in 2017, during Trump’s first term; however, it took three years to finalise the exit. Former US President Joe Biden brought the US back into the deal in 2021, at the start of his administration.\nWhile Trump’s decision to withdraw again was not unexpected, analysts said this time it has created major uncertainty over climate finance for developing nations.\nAmong those in doubt is Indonesia’s Just Energy Transition Partnership (JETP), a US-led initiative announced at the G20 Summit in Bali in 2022.\n\nThe JETP was set up to help Indonesia achieve net-zero emissions in its power sector by 2050 – 10 years earlier than initially pledged – and cap power sector emissions in 2030.\nThe partnership initially secured US$20 billion from public and private lenders in the US and other developed nations including Japan, members of the G7, Norway, Denmark and the European Union. That figure rose to US$21.6 billion last year, according to officials.\n“When there is a strong signal that the US will no longer focus on climate finance, this puts [the future of] JETP at risk, because the majority of its funds come from the commercial sector, not public funds,” said Ardhi Rasy Wardhana, an economic researcher at the Centre for Strategic and International Studies (CSIS) Indonesia.\nAccording to a JETP statement, US$11.6 billion allocated for Indonesia came from public funds, while US$10 billion was sourced from international banks in the Net-Zero Banking Alliance, formed during COP26 in Glasgow in 2021.\nHowever, Ardhi noted that major Wall Street institutions such as Goldman Sachs, Wells Fargo and Morgan Stanley have now left that alliance, which could slow money flows not only to Indonesia but also Vietnam, which has received a pledge of US$15 billion from JETP.\nIn Jakarta, officials were “reviewing” the impact of Trump’s decision to pull out of the Paris Agreement, deputy minister of energy and mineral resources Yuliot Tanjung told reporters on January 23.\n\nCan China fill the gap?\nAlthough concerns exist that the US withdrawal could reduce its climate financing commitments, Katherine Hasan, a Jakarta-based analyst with the Center for Research on Energy and Clean Air (CREA), said it is “premature” to conclude that Washington will end its climate funding in Indonesia.\nShe argued Trump’s reversal on climate change and clean energy “sends a signal for all investors to start investing in the Global South” to fill Washington’s shoes.\n“Besides the US, China has large investments in our country. Although many of the investments are coal power plant related, there is potential for [climate funding]. China can also invest in green technology,” Hasan said.\n“China has [rolled out] a lot of renewable [projects], while Indonesia needs international support for this,” she said. “Maybe we can [strengthen] bilateral cooperation with partners who have done this, and have succeeded, although it is not that easy to apply in Indonesia.”\nIt is very possible that Indonesia will seek new funding from China\nArdhi Rasy Wardhana, economic researcher\nDuring president Prabowo Subianto’s visit to Beijing in November, officials from both nations signed a memorandum of understanding to deepen collaboration on the “blue economy”, which develops coastal renewable energy by utilising wind power, tidal energy, ocean currents, and solar cells.\n“It is very possible that Indonesia will seek new funding from China. We know that under the Belt and Road Initiative, there is a Green Investment Principles programme,” Ardhi of CSIS Indonesia said.\nBoth Hasan and Ardhi said that Jakarta could also seek financing from other international partners within JETP, including the EU, Britain, and other G7 nations.\nFrancois Villeroy de Galhau, an official with the European Central Bank, said during the World Economic Forum in Davos last week that the group “is more committed and active than ever” to climate financing for poorer countries, despite the US exit.\n\nThe problem with JETP\nArdhi argued that Jakarta should maintain communication with Washington, particularly through US Climate Alliance, a bipartisan climate action coalition of 24 US states “who are sticking to their decarbonisation and climate commitments” despite the Trump administration’s stance.\nJETP’s implementation in Indonesia has not been without problems, including delays in fund disbursement and lack of a road map on energy transition and early retirement of fossil-fuel plants in Indonesia, Hasan said.\nIn July, JETP marked its first equity investment in the country, with the Norwegian Climate Investment Fund and British International Investment pledging US$30 million to the Indonesian rooftop solar start-up Xurya.\nDuring the G20 Summit in Brazil in November, Prabowo announced a goal of providing 75 Gigawatts (GW) of renewable energy by 2040, but CREA urge the president to set a “more ambitious” target.\n“The 75GW target is also much lower than what is stated in the Comprehensive Investment and Policy Plan document of the JETP, which aims for an additional 210GW of non-fossil power generation by 2040,” CREA said in a statement in November.\nAs of 2024, renewable energy accounted for only 14 per cent of Indonesia’s power capacity, making the government’s 23 per cent target for this year unlikely. The archipelago is abundant in renewable resources such as solar, wind, biomass, and geothermal, whose total capacity is estimated at 3,700GW.","summary":"The US exit from the climate accord raises concerns about Indonesia’s ability to achieve its net-zero emissions goals.","url":"https://www.scmp.com/week-asia/politics/article/3296780/trumps-paris-agreement-exit-could-push-indonesia-towards-china-climate-funding","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/30/e0f456a8-d4e7-4c68-ad34-68e8a8a45a3f_200155ec.jpg","video":null,"publish_date":"2025-01-31 00:00:12","author":"Resty Woro Yuniar","authors":["Resty Woro Yuniar"],"language":"en","category":"politics","source_country":"cn","sentiment":0.078},{"id":285546906,"title":"DC crash: Donald Trump's crude joke about carnage of plane tragedy site after disaster","text":"Donald Trump made an awkward joke about the site of the Washington DC plane crash.\n\nThe US President shrugged off suggestions he will visit the site of the carnage, near Ronald Reagan National Airport, where an American Airlines plane and a military helicopter collided. Both aircraft plunged into the icy Potomac River, which has been at the heart of a search and rescue operation today. \n\nSpeaking at a press conference, Mr Trump, 78, said: \"I have a plan to visit – not the site. Because what – you tell me. What's the site? Water. We're going to go swimming?\"\n\nThe sick joke came as the world leader baselessly blamed diversity initiatives for undermining air safety and questioned the actions of a US Army helicopter pilot involved in the midair collision. Trump also complained the commercial aircraft and Black Hawk helicopter were both at the \"same height\" in the moments before the smash, which happened on Wednesday night.\n\nFor live updates on the crash, follow our blog\n\nSixty-seven people are believed to have died in the crash, which occurred while a flight from Wichita, Kansas, was landing at the busy airport. First responders continue to recover bodies from the Potomac River. \n\nOfficials have not yet to formally establish the causes of the collision, and Mr Trump himself acknowledged that it was too soon to draw conclusions as he encouraged the country to pray for the victims. However, he quickly moved to engage in speculation and political attacks, at a moment when Americans traditionally look to the presidency for comfort, assurance and facts.\n\nSpeaking in the same press conference at the White House, the politician said he blamed diversity initiatives \"because I have common sense, and unfortunately a lot of people don’t.\" He continued: \"We want the most competent people. We don’t care what race they are.\"\n\nPete Buttigieg, who served as the US secretary of transportation from 2021 to 2025 under the previous government, blasted the President's comments. Describing the remarks as \"despicable\", he said on X: \"As families grieve, Trump should be leading, not lying.\"\n\nThe deadly plane crash was the first major disaster of Mr Trump's new term. Yet his handling of it so far has rawn further criticism from other politicians, notably Democrats. Senate Democratic Leader Chuck Schumer of New York said: \"It’s one thing for internet pundits to spew off conspiracy theories, it’s another for the president of the United States.\"","summary":"Donald Trump spoke in the wake of the midair American Airlines plane crash, which happened in Washington DC on Wednesday night and saw more than 60 people killed","url":"https://www.mirror.co.uk/news/us-news/dc-crash-donald-trumps-crude-34587269","image":"https://i2-prod.mirror.co.uk/incoming/article34587303.ece/ALTERNATES/s1200/1_President-Trump-Holds-Press-Briefing-On-Crash-Of-American-Eagle-Flight-5342-And-Army-Helicopter.jpg","video":null,"publish_date":"2025-01-30 23:59:52","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.336},{"id":285552570,"title":"Trump is emphatically correct about birthright citizenship","text":"Less than two weeks into this second Trump presidency, the fearmongering has already reached fever pitch. “He can’t do it!” the critics have invariably howled in decrying President Donald Trump’s landmark day-one executive order upending the status quo on birthright citizenship for the children of illegal aliens, “Protecting the Meaning and Value of American Citizenship.” The usual suspects in the punditocracy say Trump’s order is “blatantly unconstitutional” and that it “violates settled law.” Perhaps it’s even “nativist” or “racist,” to boot!\n\nLike the Bourbons of old, pearl-clutching American elites have learned nothing and forgotten nothing. Because when it comes to birthright citizenship, the virtue signaling and armchair excoriation is not just silly – it’s dead wrong on the law. Trump’s Jan. 20 executive order on birthright citizenship is legally sound and fundamentally just. The maestro of Mar-a-Lago deserves credit, not condemnation, for implementing such a bold order as one of his very first second-term acts.\n\nThe citizenship clause of the 14th Amendment, ratified in 1868, reads: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.” The clause’s purpose was to overturn the infamous 1857 Supreme Court case, Dred Scott v. Sandford, and thereby ensure that blacks were, and would forever be, full-fledged citizens.\n\nBut blacks were here from America’s beginning. The ruinous slavery debate aside, in 1868 blacks were thus universally viewed – unlike, for example, American Indians – as “subject to the jurisdiction” of the United States. (Congress did not pass the Indian Citizenship Act, which finally granted birthright citizenship to American Indians, until 1924.) Our debate today thus depends on whether, in 1868, aliens – legal or illegal – were considered “subject to the jurisdiction” of the United States.\n\nThey weren’t.\n\nIn the post-Civil War Republican-dominated Congress, the 14th Amendment was intended to constitutionalize the Civil Rights Act of 1866, which had passed two years prior. Rep. James Wilson, R-Iowa, then House Judiciary Committee chairman and a leading 14th Amendment drafter, emphasized that the amendment was “establishing no new right, declaring no new principle.” Similarly, Sen. Jacob Howard, R-Mich., the principal author of the 14th Amendment’s citizenship clause, described it as “simply declaratory of what I regard as the law of the land already.”\n\nIn other words, the 14th Amendment formalized the Civil Rights Act of 1866. And the citizenship clause of that law reads: “All persons born in the United States and not subject to any foreign power, excluding Indians not taxed, are hereby declared to be citizens of the United States.” In other words, “subject to the jurisdiction thereof” necessarily excludes those “subject to any foreign power.” As then-Senate Judiciary Committee Chairman Sen. Lyman Trumbull, R-Ill., said during the 14th Amendment ratification debate, “subject to the jurisdiction” means subject to the United States’ “complete” jurisdiction – that is, “not owing allegiance to anybody else.”\n\nThe 14th Amendment thus constitutionally requires that neither legal nor illegal aliens be afforded birthright citizenship. (Whether Congress passes additional rights-bestowing laws of its own volition is a separate matter.)\n\nThis understanding was unchallenged for decades. In the 1873 Slaughter-House Cases, Justice Samuel Miller interpreted the citizenship clause as “intended to exclude from its operation children of … citizens or subjects of foreign States born within the United States.” And in the 1884 case of Elk v. Wilkins, Justice Horace Gray held that “subject to the jurisdiction” means “not merely subject in some respect or degree to the jurisdiction of the United States, but completely subject to their political jurisdiction, and owing them direct and immediate allegiance.”\n\nIt’s true that Gray inexplicably reversed course in an oft-cited 1898 case, United States v. Wong Kim Ark. Over a powerful and compelling dissenting opinion joined by Justice John Marshall Harlan, the sole dissenter in Plessy v. Ferguson, Gray held that there is some level of birthright citizenship for the children of aliens. But even in that wrongfully decided case, the court emphasized that its holding was limited to children of “resident aliens” who were under “the allegiance” of the United States. The court repeatedly emphasized that its holding only applied to those legitimately “domiciled” here.\n\nIn no world whatsoever does Gray’s pro-birthright citizenship opinion in Wong Kim Ark apply to children of illegal aliens. Eighty-four years later, in Plyler v. Doe, the court dropped a superfluous footnote indicating that Wong Kim Ark applies to the children of illegal aliens too. But this nonbinding footnote from Justice William J. Brennan Jr., a leading liberal, does not the “law of the land” make.\n\nFourteenth Amendment-mandated birthright citizenship for children of illegal aliens is, at best, a live and unsettled legal debate. But the original meaning is quite clear: The amendment’s draftsmen would have been aghast at the notion that people who broke our laws and entered our soil illegally could then be afforded birthright citizenship for their children. The drafters likely foresaw, as so many today do not, the tremendous perverse incentives induced by such an ill-conceived policy.\n\nThe so-called legal eagles are wrong. And Trump, yet again, is right.","summary":"The 14th Amendment's draftsmen would be aghast","url":"https://www.wnd.com/2025/01/trump-is-emphatically-correct-about-birthright-citizenship/","image":"https://www.wnd.com/wp-content/uploads/2022/04/baby-girl-babies-children-brown-eyes-wide-awake-abortion-shocked-surprised-hispanics-cute-adorable-abortion-planned-parenthood-unsplash.jpg","video":null,"publish_date":"2025-01-30 23:59:13","author":"Josh Hammer","authors":["Josh Hammer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.313},{"id":285545760,"title":"Top US Trading Allies Gear Up For Standoff With Trump’s Tariff Policies","text":"America’s biggest trading partners are preparing for the possibility of sweeping tariffs on their exports after US President Donald Trump reiterated his threat to impose new duties on Canada and Mexico. Officials in Ottawa and Mexico City have drawn up plans to retaliate against Washington with tariffs of their own, raising the prospect of a damaging trade war. Businesses inside the US and across the world have warned of widespread disruption if the Trump administration pushes ahead.\nTrump's Tariff Strategy\nTrump repeatedly pledged on the campaign trail to use tariffs to revive the US economy, disregarding many economists’ concerns that imposing higher duties on goods from overseas would exacerbate inflation rather than rapidly bring down prices, as the president has promised. While the Trump campaign mooted a universal tariff on all foreign goods, the Trump administration has so far opted to target specific US trading partners. The president has made clear that China and the European Union are in his sights, but has so far focused on America’s closest neighbors.\nWeeks after his election victory last November, Trump announced on his own social network that upon his return to office he would “sign all necessary documents” to impose a 25% tariff on Mexico and Canada. Mexico must stop “illegal aliens” from crossing its border with the US, he said, and Canada must halt the flow of drugs like fentanyl. “Until such time that they do, it is time for them to pay a very big price!”\nTrump did not, in fact, sign these documents following his inauguration. Instead, he introduced a deadline – 1 February – by which both countries are supposed to resolve his concerns. Asked about the deadline on Thursday, he said: “We may or may not. We’re going to make that determination probably tonight.”\nResponses from Canada and Mexico\nClaudia Sheinbaum, the Mexican president, has already taken Trump through the various migration initiatives her government has undertaken. Experts have raised questions over Trump’s demand from Canada, with so little fentanyl entering the US through its northern border that the US Drug Enforcement Administration (DEA) omitted to even mention Canada in a 2020 report.\nUnswayed by such details, in recent weeks Trump has claimed his administration will raise “hundreds of billions of dollars, and even trillions of dollars” through tariffs that would boost the US economy. He has spoken of establishing an “external revenue service” to collect the money.\nWhile he and his allies continue to talk up tariffs as a viable financial revenue stream for the US, Trump – who as both politician and reality TV star has spoken highly of his dealmaking prowess – has previously raised them as a negotiating tactic, only to withdraw the threat. This strategy played out less than a week after his inauguration, when the White House threatened Colombia with tariffs and sanctions as punishment for its refusal to accept military flights carrying deportees. Colombia later agreed, and the threat was withdrawn.\nIn Canada, ministers have expressed optimism that a resolution by Saturday remains possible. “I remain hopeful we’re going to be able to solve this. We’ve been doing it for 150 years together,” David McGuinty, the public safety minister, told reporters. “I don’t see why we can’t do it now.” Since Trump’s initial social media post about the Canadian border, officials in Ottawa have pledged to spend C$1.3bn for new measures, including the use of two Black Hawk helicopters and 60 drones.\nBut Canada stands ready to hit back. A first round of retaliatory tariffs would cause minimal damage to the US, covering C$37bn of its exports to Canada, and if needed, Canada’s federal government plans to escalate by imposing tariffs on C$110bn worth of goods. “The reality is that a large, uncontrolled bully is using his position as the most powerful political leader in the world, to put pressure on a whole range of allies,” said Lawrence Herman, an international trade lawyer and senior fellow at the CD Howe Institute. “We have to, in Canada and the rest of the world, recognize that we’ve entered a new era. With the Trump administration, there are no rules. There is no respect for international treaties or agreements. There is no longer value to the US signature on international documents.”\nIn Mexico, meanwhile, the government has sent signals it is prepared to do more on migration and fentanyl trafficking – even notching up a record seizure soon after Trump’s threats began – but it has also sought to play down the prospects of a trade war. “We don’t think (the tariffs) will happen. And if they do, we have our plan,” Sheinbaum said on Wednesday.\n“People are worried here, and there is a sense of uncertainty – which is what Donald Trump seeks to create,” said Kenneth Smith Ramos, Mexico’s former chief negotiator during talks over the USMCA free trade deal, struck between the US, Mexico, and Canada during the first Trump administration. “It’s a bit like a game of chicken: the two cars are hurtling towards each other at top speed,” he said. “Mexico has to send the signal that its car is not a little one but a big one that could also hurt the United States.”\nExports account for roughly 40% of Mexico’s gross domestic product (GDP), and more than 80% of them go to the US. While the country would try to diversify its export markets in the event of an economic dispute with the US, “you’re never going to be able to replace the US market with any other country,” said Smith Ramos.\nMinisters have stressed that “cool heads” are required in the face of Trump’s public threats and declined to disclose their plan of action if tariffs are imposed. “But you can be sure we have studied it a great deal,” Marcelo Ebrard, the Mexican economic secretary, said recently. “There will be no surprises, nor untimely reactions.”\nALSO READ: Woman Charged With Espionage Believed She Was Aiding Police","summary":"US trading partners brace for potential trade war as Trump threatens tariffs on Canada and Mexico, raising concerns of widespread disruption.","url":"https://www.newsx.com/world/top-us-trading-allies-gear-up-for-standoff-with-trumps-tariff-policies/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Top-US-Trading-Allies-Gear-Up-For-Standoff-With-Trumps-Tariff-Policies.webp","video":null,"publish_date":"2025-01-30 23:59:10","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":-0.051},{"id":285545756,"title":"67 Dead In Deadliest US Air Disaster In A Quarter Century After Helicopter And Jetliner Collision","text":"A tragic midair collision between an Army helicopter and an American Airlines flight resulted in the deaths of all 67 people aboard the two aircraft, making it the deadliest aviation disaster in the United States in nearly 25 years. Officials have been scrutinizing the actions of the military pilot and reported that control tower staffing was “not normal” at the time of the collision.\nDetails of the Collision\nThe incident occurred late Wednesday as the helicopter apparently flew into the path of the jet while it was landing at Ronald Reagan National Airport, located just across the Potomac River from Washington, D.C. The plane carried 60 passengers and four crew members, while three soldiers were aboard the helicopter.\nAt least 28 bodies were recovered from the icy waters of the Potomac River. The wreckage of the plane was found upside down in three sections in waist-deep water, and first responders were searching an area of the river as far south as the Woodrow Wilson Bridge. The helicopter wreckage was also located, with images showing boats around the partly submerged wing and the mangled fuselage of the plane.\nInvestigations and Causes\nA report by the Federal Aviation Administration (FAA) indicated that one air traffic controller was performing tasks normally assigned to two people in the tower. “The position configuration was not normal for the time of day and volume of traffic,” the report said.\nPresident Donald Trump announced at a White House news conference that no one survived the collision. \"We are now at the point where we are switching from a rescue operation to a recovery operation,” said John Donnelly, the fire chief in the nation’s capital.\nOfficials stated that flight conditions were clear as the jet arrived from Wichita, Kansas. \"On final approach into Reagan National, it collided with a military aircraft on an otherwise normal approach,\" said American Airlines CEO Robert Isom.\nA top Army aviation official, Jonathan Koziol, chief of staff for Army aviation, described the Black Hawk crew as “very experienced” and familiar with the congested flying around Washington. He noted that both pilots had flown the specific route before, at night, and emphasized the need to analyze flight data before making conclusions about altitude.\nReactions and Responses\nThe collision occurred in some of the most tightly controlled and monitored airspace in the world, just over three miles south of the White House and the Capitol. American Airlines Flight 5342 was inbound to Reagan National at an altitude of about 400 feet and a speed of about 140 mph when it rapidly lost altitude over the Potomac.\nThe mood inside Reagan National Airport was somber as stranded passengers waited for flights to resume. Aster Andemicael, who was at the airport with her elderly father, expressed her devastation, saying, “I’ve been crying since yesterday. This is devastating.”\nThe Deadliest Crash Since 2001\nWednesday’s crash was the deadliest in the U.S. since November 12, 2001, when an American Airlines flight crashed into a residential area of Belle Harbor, New York, killing all 260 people aboard. The last major fatal crash involving a U.S. commercial airline occurred in 2009 near Buffalo, New York, killing everyone aboard the plane and one person on the ground.\nPassengers on the ill-fated flight included a group of figure skaters, their coaches, and family members who were returning from a development camp that followed the U.S. Figure Skating Championships in Wichita. Among them were Russian figure skaters Evgenia Shishkova and Vadim Naumov, who had won the pairs title at the 1994 world championships and competed in the Olympics.\nThe crash also devastated Wichita, Kansas, a major hub for the aircraft industry. Several hundred people gathered for a prayer vigil led by Mayor Lily Wu and religious leaders.\nThe midair collision between the Army helicopter and the American Airlines jetliner has left a profound impact on the affected communities and highlighted the inherent risks of air travel. As investigations continue, authorities seek to understand the factors leading to this tragic incident and prevent similar occurrences in the future.\nALSO READ: American Airlines Plane Crash: Who Were The Pilots Flying The Doomed Plane?","summary":"A midair collision between an Army helicopter and an American Airlines flight kills 67, making it the deadliest US air disaster in nearly 25 years.","url":"https://www.newsx.com/world/67-dead-in-deadliest-us-air-disaster-in-a-quarter-century-after-helicopter-and-jetliner-collision/","image":"https://www.newsx.com/wp-content/uploads/2025/01/american-airlines-plane-crash.webp","video":null,"publish_date":"2025-01-30 23:59:10","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","source_country":"in","sentiment":-0.236},{"id":285547662,"title":"What Ontario parties are promising ahead of Feb. 27 provincial election","text":"Progressive Conservatives\n\nJan. 30 on electric vehicles: Commit to deals with Stellantis and Volkswagen for their battery plants regardless of what happens with U.S. President Donald Trump’s threats to impose tariffs and rip up electric vehicle tax credits.\n\nJan. 30 on response to tariff threats: Invest $1 billion in a skills development fund for autoworkers to transition to a different trade and another $100 million for an employment fund to help workers who are vulnerable to trade disputes transition to “in-demand” jobs.\n\nJan. 27 on affordability: Get rid of tolls for all drivers on Hwy. 407, on both the government-owned portion and the privately owned part named the 407 ETR. The party also pledged to buy that part back.\n\nJan. 30 on electric vehicles: Bring back consumer rebates for electric-vehicle purchases in an effort to help slumping sales.\n\nJan. 29 on health care: Give all Ontarians access to a family doctor within four years by significantly expanding the health team network and recruiting thousands of new domestically and internationally trained family doctors.\n\nRECOMMENDED VIDEO","summary":"A running list of election promises announced by the Progressive Conservatives, NDP, Liberals and Greens in Ontario since the official start of the province&#8217;s snap election campaign. The vote is set for Feb. 27. Progressive Conservatives Jan. 30 on electric vehicles: Commit to deals with Stellantis and Volkswagen for their battery plants regardless of what [&#8230;]","url":"https://torontosun.com/news/provincial/what-ontario-parties-are-promising-ahead-of-feb-27-provincial-election","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/01/elxn-ont-promises-20250130.jpg","video":null,"publish_date":"2025-01-30 23:58:15","author":"Canadian Press","authors":["Canadian Press"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.274},{"id":285552580,"title":"Trump 2.0: Powered by Americans’ intolerance of absurdity","text":"The anti-Trump media seems partially paralyzed following President Donald Trump’s reelection last November and particularly since his inauguration on Jan. 20. The president has been moving at lightning speed to implement the policies on which he and Vice President J.D. Vance ran and won not only a victory within the Electoral College but also in the so-called popular vote – the first time a Republican has done so since 2004.\n\nBut election vote tallies don’t tell the whole story. Trump 2.0 is a manifestation of monumental changes in American political alliances. Like his second campaign, Trump’s Cabinet – currently taking shape as his nominees move through the confirmation process – demonstrates the bipartisan appeal of his policy positions.\n\nFormer Democratic Rep. Tulsi Gabbard supported Trump’s 2024 campaign, ultimately changed parties and is now his nominee for director of national intelligence. Robert F. Kennedy Jr. – a scion of one the best-known Democratic families in the country – dropped his own presidential campaign (running as an independent) to support Trump and has been nominated to serve as secretary of Health and Human Services.\n\nSilicon Valley tycoons like Elon Musk and Marc Andreessen as well as power brokers and megadonors like Bill Ackman and Nicole Shanahan (RFK Jr.’s running mate in 2024) have also severed ties with Democrats and thrown their support behind the MAGA agenda. Musk’s has certainly been the most visible Silicon Valley about-face, as he joined Trump on the campaign trail and will be serving in the new administration. But Shanahan isn’t far behind. Just yesterday, she dropped a video in which she promised to fund primary challengers against any Democrat senators who vote against Kennedy for HHS chief.\n\nOn issue after issue, Trump and his team have tapped into a well stream of widespread public support that upends the traditional narrative about party politics.\n\nOpposition to U.S. involvement in foreign wars – a consistent plank in the Democratic Party platform since the Vietnam War – has become a position shared by a broad cross-section of the American public. Democrats and Republicans alike can tally the lives of U.S. servicemen and women lost: more than 720,000 since World War I. It’s a statistic made even more painful in wars that were either not “won” or in which America seems to have had no vital interest. This includes the current war between Russia and Ukraine, into which the Biden administration pumped more than $65 billion in what looks like a massive money-laundering operation and boondoggle for multinational defense contractors.\n\nThe same cross-party support can be seen with respect to Trump’s determination to end illegal entry of foreign nationals into this country, the scope of which has exceeded all reasonable definitions of “compassion” or “asylum.” Americans deeply resent the hypocrisy and betrayal of politicians who have blocked efforts to curb illegal entry. Democrats Hillary Clinton and Barack Obama were both critical of illegal immigration just a few years ago. But during the four years of the Biden administration’s “open borders” policies, at least 10 million people entered this country illegally.\n\nLeft-leaning and conservative Americans were horrified to learn that criminals who crossed the border – some after multiple deportations – murdered innocent Americans like Laken Riley, Lizbeth Medina, Mollie Tibbetts, Rachel Morin and Jocelyn Nungaray. Drugs like fentanyl flowed freely across the border, killing thousands of Americans a year. Our citizens were aghast at the billions of dollars being spent on illegal aliens, and at the billions given by the federal government to nongovernmental organizations that facilitated what can only be described as an invasion.\n\nFor the past week, Trump’s Department of Homeland Security and Immigration and Customs Enforcement, led by “border czar” Tom Homan, have been arresting and deporting aliens who have been engaging in criminal conduct, including the notorious MS-13 and Tren de Aragua gang members who have been acting with impunity and terrorizing Americans. An Axios/Ipsos poll from last week shows that 66% of Americans support the deportation of illegal aliens.\n\nThis week, Trump signed an executive order preventing federal funds from going to the use of puberty blockers in children or the surgical mutilation of their healthy body parts, another issue that has generated widespread public consternation.\n\nTrump also traveled to California and demanded that water be sent to central California and to the greater Los Angeles area. As a rule, Americans support efforts to preserve clean water and air, and the habitats of animals, but not at the expense of agriculture, private homes and businesses, or public safety. California’s water and forestry policies have caused unfathomable damage, and residents there are devastated and fed up.\n\nAnd then there is poor western North Carolina, whose residents have been suffering without homes or adequate shelter since Hurricane Helene ravaged the area in late September of last year. The Federal Emergency Management Agency’s response has been inadequate. Trump and Vance have both visited that portion of the state in the past week and promised immediate assistance. Trump has even suggested that FEMA might need to be scrapped or overhauled. Other than professional whiners like CBS’s Margaret Brennan, it’s unlikely that such a decision would meet with much public pushback.\n\nTrump has also signed orders protecting freedom of speech and reinstating (with back pay) members of the U.S. military who lost their positions when they refused to take the experimental mRNA COVID-19 vaccines.\n\nDespite the media’s efforts to cast Trump’s policies as extremist, CNN statistician Harry Enten shocked his colleagues last Friday with data showing that Trump’s popularity is at an all-time high. Four years of policies that were absurd, grotesque and frankly destructive to the nation, its institutions and its citizens has prompted huge numbers of Americans – regardless of political affiliation – to say, “Enough!”\n\nThe times, they are a-changin’.","summary":"The new Cabinet demonstrates the bipartisan appeal of president's policy positions","url":"https://www.wnd.com/2025/01/trump-2-0-powered-by-americans-intolerance-of-absurdity/","image":"https://www.wnd.com/wp-content/uploads/2025/01/donald-trump-47-joe-biden-letter-resolute-desk-jpg.jpg","video":null,"publish_date":"2025-01-30 23:57:06","author":"Laura Hollis","authors":["Laura Hollis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.055},{"id":285546844,"title":"The GOP physician who might block RFK Jr.’s approval","text":"WASHINGTON — Sen. Bill Cassidy, R-La., cast doubt Thursday over whether Robert F. Kennedy Jr. is qualified to be the next leader of the government’s largest and most powerful health agency. \n\nCassidy, a doctor, has emerged as a key swing vote in Kennedy’s bid to be the secretary of health and human services. Cassidy chairs the Health, Education, Labor, and Pensions Committee and sits on the Finance Committee, the two panels Kennedy testified before this week.\n\nCassidy had been tight-lipped about his views on Kennedy, who has a long history of anti-vaccine activism, in the weeks since President Donald Trump announced his intention to nominate him.\n\nAt the end of Thursday’s hearing, Cassidy said he was “struggling” with Kennedy’s nomination.\n\n“Your past of undermining confidence in vaccines with unfounded or misleading arguments concerns me,” Cassidy said. “Can I trust that that is now in the past? Can data and information change your opinion, or will you only look for data supporting a predetermined conclusion?”\n\nThe inquiries came one day after Kennedy tripped up over a line of questioning from Cassidy about Medicaid.\n\nCassidy’s reservations are a potential complication for Kennedy. As the chair of the committee, Cassidy carried the tone of the Thursday’s hearing, repeatedly questioning Kennedy’s past stances, particularly concerning vaccines. He homed in at times on Kennedy’s statements linking vaccines to autism and repeatedly gave him opportunities to state that vaccines don’t cause the complicated neurological and developmental condition. \n\n“I can say that I’ve approached it using the preponderance of evidence to reassure and you’ve approached using selected evidence to cast doubt,” Cassidy said. \n\nThe underlying question, Cassidy said, is whether Kennedy could, as a 71-year-old man “who spent decades criticizing vaccines and is financially vested in finding fault with vaccines,” change his ways “now that he’ll have the most important position influencing vaccine policy in the United States.” \n\nIt was a question Kennedy wouldn’t answer directly. He grew emphatic at times with regard to autism, asking why the Centers for Disease Control and Prevention hadn’t done more to look at what was causing the condition. \n\n“Why don’t we know what’s causing this epidemic? Why hasn’t the CDC been looking at other hypotheses to determine … why we’ve had this dramatic, 1,000% increase in this disease that is destroying our kids? It is probably the biggest issue,” Kennedy said. “Why don’t we know the answer after 30 years of a steady rise in the autism rate? Why don’t we know the answer to that? We should know the answer.”\n\nScientists and advocates agree there should be more research into the cause of autism, but they have signaled that Kennedy’s dwelling on a debunked link to vaccines only risks steering precious research dollars into the only theory that has been ruled out. \n\nDoctors have long known that genes play a large role in autism. Research suggests that the increased incidence of autism is due in part to the changing definition over time, which today encompasses a vast range of abilities. There are also increased awareness of and earlier screening for the condition.\n\nAfter Thursday’s hearing, Kennedy wouldn’t respond to an NBC News reporter’s questions about whether he had seen enough science to refrain from saying vaccines cause autism. At the hearing’s conclusion, Kennedy walked over to Cassidy, quietly conveyed something to him and shook his hand.\n\n“You may be hearing from me over the weekend,” Cassidy told him.\n\nCassidy’s caution about Kennedy is significant. As a member of the Finance Committee, he will vote on whether to advance the nomination to the full Senate.\n\nKennedy can afford to lose the support of only three Senate Republicans on the floor if all Democrats are united against him. So far, no GOP senators have publicly opposed his nomination.\n\nCassidy, who was among the few Senate Republicans to vote to convict Trump in the impeachment trial in the aftermath of the Jan. 6, 2021, riot at the U.S. Capitol, has already drawn a potential primary challenger if he decides to seek re-election in 2026.\n\nVaccines have been a central part of Cassidy’s political work. In the 1990s, he helped establish a partnership in Baton Rouge, Louisiana, that boasted providing 36,000 children with free vaccines against hepatitis B.\n\nAs a senator, he introduced bipartisan bills to improve vaccination rates among pregnant women. He has supported vaccination requirements in public schools.\n\nCassidy opened Thursday’s hearing with a story about the “worst day of my medical career,” recounting his experience treating a young woman with hepatitis B on her way to a liver transplant. As he was loading her into an ambulance, Cassidy said, he was struck. \n\n“I thought $50 of vaccines could have prevented this all. And that was an inflection point in my career, and since then, I’ve tried to do everything I can to make sure I never have to speak to another parent about their child dying due to a vaccine-preventable disease.”\n\nWhen Cassidy asked Kennedy whether he would unequivocally reassure mothers that measles and hepatitis B vaccines don’t cause autism, Kennedy said that, on the condition that he saw supporting data, he would go beyond reassurance. \n\n“Not only will I do that, but I will apologize for any statements that misled people otherwise,” Kennedy said. “I just want to pledge to you that I will never stick on a point if somebody shows me data that says I’m wrong.”\n\nKennedy at one point countered that he saw recent research undermining the notion that there was no link between autism and vaccines. \n\nCassidy paused his questioning and seemed to look up the study while Sen. Bernie Sanders, I-Vt., took over questioning.\n\n“I looked into the article,” Cassidy said upon his return. “It seems to have some issues.”\n\nCassidy closed Thursday’s hearing by imploring Kennedy to further distance himself from his past comments on vaccines.\n\n“Man, if you come out unequivocally vaccines are safe, it does not cause autism, that would have an incredible impact,” Cassidy said. “That’s your power. So what’s it going to be? Will it be using the credibility to support lots of articles, or will it be using the credibility to undermine?” \n\n“I got to figure that out for my vote,” Cassidy said. He said he wants to promote Trump’s agenda but has real concerns that Kennedy’s false vaccine claims will cast a troublesome shadow over Trump’s second-term legacy.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON — Sen. Bill Cassidy, R-La., cast doubt Thursday over whether Robert&#8230;\n\n\nThis Post: The GOP physician who might block RFK Jr.&#8217;s approval first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/the-gop-physician-who-might-block-rfk-jr-s-approval/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-The-Republican-doctor-who-could-be-a.jpg","video":null,"publish_date":"2025-01-30 23:56:37","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.025},{"id":285547550,"title":"FBI committed 'thuggish,' 'gangster-style' behavior to Trump, says Ned Ryun","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit January 30, 2025 06:35 \n\n FBI committed 'thuggish,' 'gangster-style' behavior to Trump, says Ned Ryun \n American Majority CEO Ned Ryun discusses an FBI agent allegedly opening a January 6 probe against President Donald Trump on 'The Evening Edit.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSWHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITV-VIDEOS","summary":"American Majority CEO Ned Ryun discusses an FBI agent allegedly opening a January 6 probe against President Donald Trump on &apos;The Evening Edit.&apos;","url":"https://www.foxbusiness.com/video/6368022040112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/1f8fd55c-7f43-4226-bbcd-895f5fa4af11/65398891-929c-4d70-9d2b-9965ae397dc1/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-30 23:54:13","author":null,"language":"en","source_country":"us","sentiment":-0.355},{"id":285548312,"title":"Senate confirms Doug Burgum as interior secretary after Trump tasked him to boost drilling","text":"By MATTHEW BROWN\n\nWASHINGTON (AP) — The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.\n\nBurgum, 68, is an ultra-wealthy software industry entrepreneur who came from a small North Dakota farming community, where he worked at his family’s grain elevator.\n\nHe served two terms as governor of the oil-rich state and launched a presidential campaign in 2023, but dropped out months later and quickly endorsed Trump.\n\nTrump also picked Burgum to chair a new National Energy Council that’s tasked with achieving American “energy dominance.” He would have a seat on the National Security Council — a first for the interior secretary.\n\nHis directive from Trump is to make it even easier for energy companies to tap fossil fuel resources, including from public lands. That raised alarms among environmentalists and some Democrats as greenhouse gas emissions from fossil fuels bake the planet.\n\nBurgum eagerly assisted the energy industry during his time as governor, when he was also profiting from the lease of family land to oil companies, according to records obtained by The Associated Press.\n\nDuring his confirmation hearing, Burgum said the U.S. can use energy development as leverage to promote peace and to lower consumer costs.\n\nHe raised concerns about the reliability of renewable power sources promoted under former President Joe Biden, and said the U.S. needs to generate more electricity from sources such as coal and nuclear that can run constantly.\n\nDemocrats in response accused the Trump administration of abandoning an “all of the above” energy policy to favor fossil fuels.\n\n“They said wind is dead on the offshore. They are trying to do as much of this as possible to create demand for coal, for fossil gas,” Hawaii Democratic Sen. Brian Schatz said during a Thursday floor speech.\n\nWyoming Sen. John Barrasso, the second-ranking Republican in the Senate, said Burgum would rightfully prioritize energy innovation over regulation.\n\n“He’s going to take the common-sense action of unlocking our lands for oil and for gas production,” Barrasso said. He added that more than 600,000 acres of land in Wyoming have been approved for energy production but were not offered for development by the Biden administration.\n\nThe U.S. currently produces more crude oil than any nation in history, according to the Energy Information Administration. More cost-effective technology in recent decades drove drilling booms in states including New Mexico, Texas and North Dakota, where vast expanses of rural farmland have been industrialized by oil and gas companies.\n\nThe booms brought billions of dollars in tax revenue to state and federal governments. But burning those fuels is also unleashing immense volumes of carbon dioxide that scientists say is warming the planet.\n\nThe Interior Department has jurisdiction over a half-billion acres of federal land and vast areas offshore. Those areas produce about one-quarter of U.S. oil annually.\n\nThe interior secretary also oversees the National Park Service, U.S. Fish and Wildlife Service, Bureau of Indian Affairs, Bureau of Land Management and other subagencies.\n\nBurgum succeeds Deb Haaland, who under Biden sharply scaled back oil and gas sales and promoted solar and wind projects on federal lands.\n\nTrump made energy development a centerpiece of his first term and is again vowing to abolish restrictions on the industry that are intended to protect the environment and public health.\n\nBurgum, during his hearing earlier this month before the Senate Energy and Natural Resources committee, suggested to lawmakers that carbon dioxide from fossil fuels could be captured to neutralize their contribution to global warming.\n\nCarbon-capture skeptics say the technology is untested at scale and allows the fossil-fuel industry to continue largely unchanged even as climate change becomes increasingly urgent.\n\nDuring Haaland’s tenure at the Interior Department, officials also reversed actions taken during Trump’s first term that weakened protections for imperiled species while making it easier for private developers to pursue projects on public lands.\n\nRepublicans in Congress have said they plan to again seek changes to rules on endangered species and they want Burgum to help.\n\nBurgum says federal lands can be used for many purposes including recreation, logging and oil and gas production that can lift local economies.\n\n“Not every acre of federal land is a national park or a wilderness area,” he told lawmakers.","summary":"The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.","url":"https://www.ocregister.com/2025/01/30/doug-burgum-confirmed-interior-secretary/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/Trump_Cabinet_Burgum_71276_77fb5c.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-30 23:53:46","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.094},{"id":285548050,"title":"Senate confirms Doug Burgum as interior secretary after Trump tasked him to boost drilling","text":"By MATTHEW BROWN\n\nWASHINGTON (AP) — The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.\n\nBurgum, 68, is an ultra-wealthy software industry entrepreneur who came from a small North Dakota farming community, where he worked at his family’s grain elevator.\n\nHe served two terms as governor of the oil-rich state and launched a presidential campaign in 2023, but dropped out months later and quickly endorsed Trump.\n\nTrump also picked Burgum to chair a new National Energy Council that’s tasked with achieving American “energy dominance.” He would have a seat on the National Security Council — a first for the interior secretary.\n\nHis directive from Trump is to make it even easier for energy companies to tap fossil fuel resources, including from public lands. That raised alarms among environmentalists and some Democrats as greenhouse gas emissions from fossil fuels bake the planet.\n\nBurgum eagerly assisted the energy industry during his time as governor, when he was also profiting from the lease of family land to oil companies, according to records obtained by The Associated Press.\n\nDuring his confirmation hearing, Burgum said the U.S. can use energy development as leverage to promote peace and to lower consumer costs.\n\nHe raised concerns about the reliability of renewable power sources promoted under former President Joe Biden, and said the U.S. needs to generate more electricity from sources such as coal and nuclear that can run constantly.\n\nDemocrats in response accused the Trump administration of abandoning an “all of the above” energy policy to favor fossil fuels.\n\n“They said wind is dead on the offshore. They are trying to do as much of this as possible to create demand for coal, for fossil gas,” Hawaii Democratic Sen. Brian Schatz said during a Thursday floor speech.\n\nWyoming Sen. John Barrasso, the second-ranking Republican in the Senate, said Burgum would rightfully prioritize energy innovation over regulation.\n\n“He’s going to take the common-sense action of unlocking our lands for oil and for gas production,” Barrasso said. He added that more than 600,000 acres of land in Wyoming have been approved for energy production but were not offered for development by the Biden administration.\n\nThe U.S. currently produces more crude oil than any nation in history, according to the Energy Information Administration. More cost-effective technology in recent decades drove drilling booms in states including New Mexico, Texas and North Dakota, where vast expanses of rural farmland have been industrialized by oil and gas companies.\n\nThe booms brought billions of dollars in tax revenue to state and federal governments. But burning those fuels is also unleashing immense volumes of carbon dioxide that scientists say is warming the planet.\n\nThe Interior Department has jurisdiction over a half-billion acres of federal land and vast areas offshore. Those areas produce about one-quarter of U.S. oil annually.\n\nThe interior secretary also oversees the National Park Service, U.S. Fish and Wildlife Service, Bureau of Indian Affairs, Bureau of Land Management and other subagencies.\n\nBurgum succeeds Deb Haaland, who under Biden sharply scaled back oil and gas sales and promoted solar and wind projects on federal lands.\n\nTrump made energy development a centerpiece of his first term and is again vowing to abolish restrictions on the industry that are intended to protect the environment and public health.\n\nBurgum, during his hearing earlier this month before the Senate Energy and Natural Resources committee, suggested to lawmakers that carbon dioxide from fossil fuels could be captured to neutralize their contribution to global warming.\n\nCarbon-capture skeptics say the technology is untested at scale and allows the fossil-fuel industry to continue largely unchanged even as climate change becomes increasingly urgent.\n\nDuring Haaland’s tenure at the Interior Department, officials also reversed actions taken during Trump’s first term that weakened protections for imperiled species while making it easier for private developers to pursue projects on public lands.\n\nRepublicans in Congress have said they plan to again seek changes to rules on endangered species and they want Burgum to help.\n\nBurgum says federal lands can be used for many purposes including recreation, logging and oil and gas production that can lift local economies.\n\n“Not every acre of federal land is a national park or a wilderness area,” he told lawmakers.","summary":"The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.","url":"https://www.twincities.com/2025/01/30/doug-burgum-confirmed-interior-secretary/","image":"https://www.twincities.com/wp-content/uploads/2025/01/Trump_Cabinet_Burgum_71276_77fb5c.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-30 23:53:46","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.094},{"id":285552154,"title":"Senate confirms Doug Burgum as interior secretary after Trump tasked him to boost drilling","text":"By MATTHEW BROWN\n\nWASHINGTON (AP) — The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.\n\nBurgum, 68, is an ultra-wealthy software industry entrepreneur who came from a small North Dakota farming community, where he worked at his family’s grain elevator.\n\nHe served two terms as governor of the oil-rich state and launched a presidential campaign in 2023, but dropped out months later and quickly endorsed Trump.\n\nTrump also picked Burgum to chair a new National Energy Council that’s tasked with achieving American “energy dominance.” He would have a seat on the National Security Council — a first for the interior secretary.\n\nHis directive from Trump is to make it even easier for energy companies to tap fossil fuel resources, including from public lands. That raised alarms among environmentalists and some Democrats as greenhouse gas emissions from fossil fuels bake the planet.\n\nBurgum eagerly assisted the energy industry during his time as governor, when he was also profiting from the lease of family land to oil companies, according to records obtained by The Associated Press.\n\nDuring his confirmation hearing, Burgum said the U.S. can use energy development as leverage to promote peace and to lower consumer costs.\n\nHe raised concerns about the reliability of renewable power sources promoted under former President Joe Biden, and said the U.S. needs to generate more electricity from sources such as coal and nuclear that can run constantly.\n\nDemocrats in response accused the Trump administration of abandoning an “all of the above” energy policy to favor fossil fuels.\n\n“They said wind is dead on the offshore. They are trying to do as much of this as possible to create demand for coal, for fossil gas,” Hawaii Democratic Sen. Brian Schatz said during a Thursday floor speech.\n\nWyoming Sen. John Barrasso, the second-ranking Republican in the Senate, said Burgum would rightfully prioritize energy innovation over regulation.\n\n“He’s going to take the common-sense action of unlocking our lands for oil and for gas production,” Barrasso said. He added that more than 600,000 acres of land in Wyoming have been approved for energy production but were not offered for development by the Biden administration.\n\nThe U.S. currently produces more crude oil than any nation in history, according to the Energy Information Administration. More cost-effective technology in recent decades drove drilling booms in states including New Mexico, Texas and North Dakota, where vast expanses of rural farmland have been industrialized by oil and gas companies.\n\nThe booms brought billions of dollars in tax revenue to state and federal governments. But burning those fuels is also unleashing immense volumes of carbon dioxide that scientists say is warming the planet.\n\nThe Interior Department has jurisdiction over a half-billion acres of federal land and vast areas offshore. Those areas produce about one-quarter of U.S. oil annually.\n\nThe interior secretary also oversees the National Park Service, U.S. Fish and Wildlife Service, Bureau of Indian Affairs, Bureau of Land Management and other subagencies.\n\nBurgum succeeds Deb Haaland, who under Biden sharply scaled back oil and gas sales and promoted solar and wind projects on federal lands.\n\nTrump made energy development a centerpiece of his first term and is again vowing to abolish restrictions on the industry that are intended to protect the environment and public health.\n\nBurgum, during his hearing earlier this month before the Senate Energy and Natural Resources committee, suggested to lawmakers that carbon dioxide from fossil fuels could be captured to neutralize their contribution to global warming.\n\nCarbon-capture skeptics say the technology is untested at scale and allows the fossil-fuel industry to continue largely unchanged even as climate change becomes increasingly urgent.\n\nDuring Haaland’s tenure at the Interior Department, officials also reversed actions taken during Trump’s first term that weakened protections for imperiled species while making it easier for private developers to pursue projects on public lands.\n\nRepublicans in Congress have said they plan to again seek changes to rules on endangered species and they want Burgum to help.\n\nBurgum says federal lands can be used for many purposes including recreation, logging and oil and gas production that can lift local economies.\n\n“Not every acre of federal land is a national park or a wilderness area,” he told lawmakers.","summary":"The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.","url":"https://www.bostonherald.com/2025/01/30/doug-burgum-confirmed-interior-secretary/","image":"https://www.bostonherald.com/wp-content/uploads/2025/01/Trump_Cabinet_Burgum_71276_77fb5c.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-30 23:53:46","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.094},{"id":285554266,"title":"Senate confirms Doug Burgum as interior secretary after Trump tasked him to boost drilling","text":"By MATTHEW BROWN\n\nWASHINGTON (AP) — The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.\n\nBurgum, 68, is an ultra-wealthy software industry entrepreneur who came from a small North Dakota farming community, where he worked at his family’s grain elevator.\n\nHe served two terms as governor of the oil-rich state and launched a presidential campaign in 2023, but dropped out months later and quickly endorsed Trump.\n\nTrump also picked Burgum to chair a new National Energy Council that’s tasked with achieving American “energy dominance.” He would have a seat on the National Security Council — a first for the interior secretary.\n\nHis directive from Trump is to make it even easier for energy companies to tap fossil fuel resources, including from public lands. That raised alarms among environmentalists and some Democrats as greenhouse gas emissions from fossil fuels bake the planet.\n\nBurgum eagerly assisted the energy industry during his time as governor, when he was also profiting from the lease of family land to oil companies, according to records obtained by The Associated Press.\n\nDuring his confirmation hearing, Burgum said the U.S. can use energy development as leverage to promote peace and to lower consumer costs.\n\nHe raised concerns about the reliability of renewable power sources promoted under former President Joe Biden, and said the U.S. needs to generate more electricity from sources such as coal and nuclear that can run constantly.\n\nDemocrats in response accused the Trump administration of abandoning an “all of the above” energy policy to favor fossil fuels.\n\n“They said wind is dead on the offshore. They are trying to do as much of this as possible to create demand for coal, for fossil gas,” Hawaii Democratic Sen. Brian Schatz said during a Thursday floor speech.\n\nWyoming Sen. John Barrasso, the second-ranking Republican in the Senate, said Burgum would rightfully prioritize energy innovation over regulation.\n\n“He’s going to take the common-sense action of unlocking our lands for oil and for gas production,” Barrasso said. He added that more than 600,000 acres of land in Wyoming have been approved for energy production but were not offered for development by the Biden administration.\n\nThe U.S. currently produces more crude oil than any nation in history, according to the Energy Information Administration. More cost-effective technology in recent decades drove drilling booms in states including New Mexico, Texas and North Dakota, where vast expanses of rural farmland have been industrialized by oil and gas companies.\n\nThe booms brought billions of dollars in tax revenue to state and federal governments. But burning those fuels is also unleashing immense volumes of carbon dioxide that scientists say is warming the planet.\n\nThe Interior Department has jurisdiction over a half-billion acres of federal land and vast areas offshore. Those areas produce about one-quarter of U.S. oil annually.\n\nThe interior secretary also oversees the National Park Service, U.S. Fish and Wildlife Service, Bureau of Indian Affairs, Bureau of Land Management and other subagencies.\n\nBurgum succeeds Deb Haaland, who under Biden sharply scaled back oil and gas sales and promoted solar and wind projects on federal lands.\n\nTrump made energy development a centerpiece of his first term and is again vowing to abolish restrictions on the industry that are intended to protect the environment and public health.\n\nBurgum, during his hearing earlier this month before the Senate Energy and Natural Resources committee, suggested to lawmakers that carbon dioxide from fossil fuels could be captured to neutralize their contribution to global warming.\n\nCarbon-capture skeptics say the technology is untested at scale and allows the fossil-fuel industry to continue largely unchanged even as climate change becomes increasingly urgent.\n\nDuring Haaland’s tenure at the Interior Department, officials also reversed actions taken during Trump’s first term that weakened protections for imperiled species while making it easier for private developers to pursue projects on public lands.\n\nRepublicans in Congress have said they plan to again seek changes to rules on endangered species and they want Burgum to help.\n\nBurgum says federal lands can be used for many purposes including recreation, logging and oil and gas production that can lift local economies.\n\n“Not every acre of federal land is a national park or a wilderness area,” he told lawmakers.","summary":"The Senate confirmed Doug Burgum as interior secretary late Thursday after President Donald Trump tapped the North Dakota billionaire to spearhead the Republican administration’s ambitions to boost fossil fuel production.","url":"https://www.sandiegouniontribune.com/2025/01/30/doug-burgum-confirmed-interior-secretary/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/01/Trump_Cabinet_Burgum_71276_77fb5c.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-30 23:53:46","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.094}]}