{"offset":0,"number":50,"available":7622,"news":[{"id":277635960,"title":"Cybertruck-u i Elon Musk shpërthen përpara kullës 'Trump'. Një i vdekur, 7 të plagosur","text":"Një shpërthim i fuqishëm është regjistruar sot në Las Vegas, përballë hotelit të famshëm \"Trump\".\n\nSipas informacioneve nga mediat amerikane, përpara derës së hotelit është parkuar një makinë model \"Cybertruck\" e Teslas, kompanisë së Elon Musk, dhe pak çaste më pas ka shpërthyer.\n\nRaportohet se shoferi ka humbur jetën, ndërsa rreth 7 persona të tjerë kanë marrë lëndime nga shpërthimi.\n\nHetuesit nuk e dinë ende se çfarë e shkaktoi shpërthimin, nëse diçka nuk shkonte me automjetin elektrik apo nëse ishte diçka jashtme. Përcaktimi i shkakut të shpërthimit është objektivi kryesor i hetimeve.\n\nHoteli është subjekt i kërcënimeve të shpeshta dhe sigurisë së shtuar duke pasur parasysh lidhjen me Presidentin e zgjedhur Donald Trump.\n\nEric Trump, djali i tij, ka postuar në rrjetet sociale për incidentin.\n\n“Më herët sot, një zjarr i raportuar në automjetin elektrik në derën e hotelit të Trump Las Vegas. Siguria dhe mirëqenia e mysafirëve dhe stafit tonë mbeten prioriteti ynë kryesor. Ne i shprehim mirënjohjen tonë të përzemërt Departamentit të Zjarrfikësve të Las Vegasit dhe zbatimit të ligjit vendas për reagimin dhe profesionalizmin e tyre të shpejtë\", shkroi ai.\n\nHoteli lëshoi ??gjithashtu një deklaratë në X duke sugjeruar se makina e përfshirë ishte elektrike.\n\n“Më herët sot një zjarr i raportuar në automjetin elektrik ka ndodhur në hyrje të hotelit Trump në Las Vegas. Siguria dhe mirëqenia e mysafirëve dhe stafit tonë mbeten prioriteti ynë kryesor. Ne i shprehim mirënjohjen tonë Departamentit të Zjarrfikësve të Las Vegasit dhe zbatimit të ligjit vendas për reagimin e tyre të shpejtë\", shkroi hoteli.\n\nUhh – watch this video of the Cybertruck explosion outside Trump Tower in Vegas.\nDoesn't look like a simple battery explosion. Why do I see fireworks?pic.twitter.com/squAcWlgpe\n— Eric Daugherty (@EricLDaugh) January 1, 2025","url":"https://noa.al/lajmi/2025/01/2480672.html","image":"https://noa.al//newsImages/2025/01/cybert.png","video":null,"publish_date":"2025-01-02 01:00:51","author":null,"language":"en","source_country":"al","sentiment":-0.494},{"id":277635416,"title":"Cybertruck explodes outside Trump’s Las Vegas hotel, killing 1","text":"One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump’s Las Vegas hotel, authorities said.\n\nLas Vegas Metropolitan Police and Clark County Fire Department officials told a news conference that a person died inside the futuristic-looking pickup truck and they were working to get the body out. Seven people nearby had minor injuries and several were taken to a hospital.\n\nThe fire in the valet area of the Trump International Hotel Las Vegas was reported at 8:40 a.m., a county spokesperson said in a statement.\n\nAccording to a law enforcement official, the truck was rented via the Turo app and appeared to have a load of fireworks. The official spoke on condition of anonymity because they were not authorized to speak publicly.\n\nA Turo spokesperson did not immediately respond to an emailed request for comment.\n\nTesla CEO Elon Musk said Wednesday afternoon on X that “we have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself. All vehicle telemetry was positive at the time of the explosion.”\n\n“The whole Tesla senior team is investigating this matter right now,” Musk said in an earlier post on the platform after attending a New Year’s Eve party at Trump’s Mar-a-Lago resort. “We’ve never seen anything like this.”\n\nLaw enforcement officials have not ruled out terrorism as a possible motive, a person familiar with the matter said. The person spoke on condition of anonymity because they were not authorized to publicly discuss details of the investigation.\n\n“I know you have a lot of questions,” Jeremy Schwartz, acting special agent in charge for the FBI’s Las Vegas office, told reporters. “We don’t have a lot of answers.”\n\nPresident Joe Biden was briefed on the explosion. The truck explosion came hours after a driver rammed a truck into a crowd in New Orleans’ famed French Quarter early on New Year’s Day, killing at least 15 people before being shot to death by police. That crash was being investigated as a terrorist attack and police believe the driver was not acting alone.\n\nIn Las Vegas, witness Ana Bruce, visiting from Brazil, said she heard three explosions.\n\n“The first one where we saw the fire, the second one, I guess, was the battery or something like that, and the third was the big one that smoked the entire area and was the moment when everyone was told to evacuate and stay away,” Bruce said.\n\nHer travel companion, Alcides Antunes, showed video he took of flames lapping the sides of the silver-colored vehicle.\n\nThe 64-story hotel is just off the Las Vegas Strip and across the street from the Fashion Show Las Vegas shopping mall.\n\nEric Trump, a son of the president-elect and executive vice president of the Trump Organization, posted about the fire on the social media platform X. He praised the fire department and local law enforcement “for their swift response and professionalism.”","summary":"One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.","url":"https://www.bostonherald.com/2025/01/01/cybertruck-explodes-outside-trumps-las-vegas-hotel-killing-1/","image":"https://www.bostonherald.com/wp-content/uploads/2025/01/cybertruck.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-02 00:56:44","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.56},{"id":277635340,"title":"1 person dies after Tesla Cybertruck catches fire and explodes outside Trump's Las Vegas hotel","text":"One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.\n\nLas Vegas Metropolitan Police and Clark County Fire Department officials told a news conference that a person died inside the futuristic-looking pickup truck and they were working to get the body out. Seven people nearby had minor injuries and several were taken to a hospital.\n\nThe fire in the valet area of the Trump International Hotel Las Vegas was reported at 8:40 a.m., a county spokesperson said in a statement.\n\nAccording to a law enforcement official, the truck was rented via the Turo app and appeared to have a load of fireworks. The official spoke on condition of anonymity because they were not authorized to speak publicly.\n\nA Turo spokesperson did not immediately respond to an emailed request for comment.\n\nTesla CEO Elon Musk said Wednesday afternoon on X that \"we have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself. All vehicle telemetry was positive at the time of the explosion.”\n\n\"The whole Tesla senior team is investigating this matter right now,” Musk said in an earlier post on the platform after attending a New Year's Eve party at Trump's Mar-a-Lago resort. “We’ve never seen anything like this.”\n\nLaw enforcement officials have not ruled out terrorism as a possible motive, a person familiar with the matter said. The person spoke on condition of anonymity because they were not authorized to publicly discuss details of the investigation.\n\n“I know you have a lot of questions,” Jeremy Schwartz, acting special agent in charge for the FBI’s Las Vegas office, told reporters. “We don’t have a lot of answers.”\n\nPresident Joe Biden was briefed on the explosion. The truck explosion came hours after a driver rammed a truck into a crowd in New Orleans’ famed French Quarter early on New Year’s Day, killing at least 10 people before being shot to death by police.\n\nIn Las Vegas, witness Ana Bruce, visiting from Brazil, said she heard three explosions.\n\n“The first one where we saw the fire, the second one, I guess, was the battery or something like that, and the third was the big one that smoked the entire area and was the moment when everyone was told to evacuate and stay away,” Bruce said.\n\nHer travel companion, Alcides Antunes, showed video he took of flames lapping the sides of the silver-colored vehicle.\n\nThe 64-story hotel is just off the Las Vegas Strip and across the street from the Fashion Show Las Vegas shopping mall.\n\nEric Trump, a son of the president-elect and executive vice president of the Trump Organization, posted about the fire on the social media platform X. He praised the fire department and local law enforcement “for their swift response and professionalism.”\n\nAssociated Press writers Colleen Long and Zeke Miller in Washington contributed to this report.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las…","url":"https://japantoday.com/category/world/a-vehicle-catches-fire-and-explodes-outside-the-lobby-of-trump%27s-hotel-in-las-vegas","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/b1/85/0a1c721412cb066418342870c45f13ad1ef7/download/_w1700.jpg","video":null,"publish_date":"2025-01-02 00:55:41","author":"Japan Today Editor,Ty O","authors":["Japan Today Editor","Ty O"],"language":"en","source_country":"jp","sentiment":-0.383},{"id":277636366,"title":"Trump advocates for tax as key to America's wealth: 'Tariffs will pay off our debt'","text":"US President-elect Donald Trump on Thursday said that tariffs alone were responsible for creating vast wealth in the nation during the Second Industrial Revolution, stressing that tariffs can pay off debt and make America wealthy again. Trump made the statement while referring to a chart shared by American businessman Marc Andreessen on the Truth Social platform, which shows tariffs as a percentage of total federal revenue from 1798 to 2023.Marc Andreessen, sharing the chart, said that the Second Industrial Revolution was perhaps the most fertile era for technology development and deployment in human history. The chart shows data on tariff revenue as a share of total federal receipts from 1798 to 2023. In the chart, the graph shows the highest growth rate between 1870 and 1914, followed by a decline in the subsequent years.\"This is a really remarkable chart of tariffs as % of total federal revenue. The Second Industrial Revolution, perhaps the most fertile era for technology development and deployment in human history, was 1870–1914,\" Andreessen wrote in his Truth Social post.— TrumpDailyPosts (@TrumpDailyPosts) Reacting to the chart, Trump said tariffs were responsible for creating wealth for the US during the peak of tariff revenue as a share of federal receipts. He added that the US then shifted to income tax. According to Trump, tariffs can pay off the nation's debt and make America wealthy again.\"The Tariffs, and Tariffs alone, created this vast wealth for our Country. Then we switched over to Income Tax. We were never so wealthy as during this period. Tariffs will pay off our debt and MAKE AMERICA WEALTHY AGAIN!\" Trump said in his Truth Social post.Trump's threat to impose tariffs on countriesTrump previously pledged to reinstate broad tariffs on Canada, Mexico, and China as one of his initial executive actions upon taking office on January 26. In a post on his Truth Social platform, he detailed plans for a 25% tariff on all imports from Canada and Mexico and an additional 10% levy on goods from China. He described these measures as essential for addressing illegal immigration and combating the drug trade.— TrumpDailyPosts (@TrumpDailyPosts) The President-elect had also issued threats to BRICS countries regarding tariffs, writing, \"The idea that the BRICS Countries are trying to move away from the Dollar, while we standby and watch is OVER. We require a commitment from these Countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US Dollar or, they will face 100% tariffs, and should expect to say goodbye to selling into the wonderful US Economy.\"— TrumpDailyPosts (@TrumpDailyPosts)","summary":"President-elect Donald Trump argued that tariffs alone created significant wealth for the US during the Second Industrial Revolution and could do so again. He plans to reinstate tariffs on Canada, Mexico, and China to address illegal immigration and the drug trade, and warned BRICS countries against moving away from the US Dollar, threatening 100% tariffs.","url":"https://timesofindia.indiatimes.com/world/us/trump-advocates-for-tax-as-key-to-americas-wealth-tariffs-will-pay-off-our-debt/articleshow/116867493.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116867743/116867743.jpg","video":null,"publish_date":"2025-01-02 00:42:24","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.06},{"id":277635950,"title":"Bank of Korea governor says monetary easing this year will be flexible","text":"SEOUL : South Korea's central bank governor said on Thursday the pace of monetary policy easing would need to be flexible this year due to heightened political and economic uncertainty.\n\n\"This year, conditions surrounding our economy will be more difficult than ever before,\" Bank of Korea Governor Rhee Chang-yong said in a New Year's address. \n\n\"Monetary policy needs to be operated with flexibility and agility, as political and economic uncertainty is unprecedentedly high,\" Rhee said. \n\nThe pace of interest rate cuts ahead will be flexible, as trade-offs on growth, inflation, foreign exchange and household debt are expected to widen, Rhee added. \n\nAt its final policy meeting of 2024, the BOK delivered the first back-to-back rate cut since 2009, as policymakers turned wary on trade risks from the incoming U.S. administration of President-elect Donald Trump. \n\nRhee said downside risks to the central bank's economic growth forecast of 1.9 per cent for this year have risen, citing uncertainty over U.S. trade policy and domestic politics.\n\nOn the won, which weakened more than 12 per cent in 2024 to record the worst year since 2008, Rhee said volatility could persist for a considerable period of time.","summary":"","url":"https://www.channelnewsasia.com/business/bank-korea-governor-says-monetary-easing-year-will-be-flexible-4834436","image":"https://dam.mediacorp.sg/image/upload/s--AYQOgYCO--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-02t003910z_1_lynxmpel01009_rtroptp_3_imf-worldbank.jpg?itok=6Lt7","video":null,"publish_date":"2025-01-02 00:39:10","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.326},{"id":277632822,"title":"One dead after Tesla truck catches fire outside of Trump hotel in Las Vegas","text":"One person has been killed and seven injured after a Tesla Cybertruck caught fire and exploded outside of a Las Vegas hotel partly owned by United States President-elect Donald Trump.\n\nThe fire began on Wednesday at about 8:40am local time (14:40 GMT) in the valet area of the Trump International Hotel Las Vegas, according to the Las Vegas Metropolitan Police Department and Clark County officials.\n\n“We were told that a 2024 Cybertruck pulled up to the front of the hotel. And in fact, I can tell you, it pulled right up to the glass entrance doors to the hotel,” Sheriff Kevin McMahill said at a news conference. “We saw that smoke start showing from the vehicle, and then a large explosion from the truck occurs.”\n\nDetails are still emerging, and the cause of the explosion has yet to be confirmed by officials.\n\n“I know you have a lot of questions,” Jeremy Schwartz, the acting special agent in charge of the Las Vegas office for the Federal Bureau of Investigation (FBI), told reporters. “We don’t have a lot of answers.”\n\nAuthorities said that the truck appeared to have been carrying fireworks, and a person was found dead inside the vehicle. Several people in the vicinity of the explosion were treated for minor injuries.\n\nOne witness, Ana Bruce, told The Associated Press news agency that she heard three explosions resulting from the fire.\n\n“The first one [happened] where we saw the fire,” Bruce said. “The second one, I guess, was the battery or something like that, and the third was the big one that smoked the entire area and was the moment when everyone was told to evacuate and stay away.”\n\nThe incident occurred hours after a car-ramming attack in the Louisiana city of New Orleans that killed at least 10 people, in what authorities are investigating as a possible terrorist act.\n\nThe suspect in that case is believed to have been carrying improvised explosive devices, or IEDs, in his truck at the time of the car-ramming.\n\nSheriff McMahill acknowledged that his officers were “very well aware of what happened in New Orleans” and that the incident may inform their investigation. But he stopped short of linking the two.\n\n“As you can imagine, with an explosion here on iconic Las Vegas Boulevard, we are taking all the precautions that we need to take to keep our community safe. We’re looking for secondary devices,” McMahill said at the news conference, adding that there did not appear to be any further threat to the community.\n\nThe Cybertruck explosion comes as Trump prepares to take office for a second term on January 20.\n\nPart of his incoming administration includes close advisers, like tech billionaire and Tesla CEO Elon Musk, whom Trump has tapped to co-lead a yet-to-be-founded, nongovernmental body called the Department of Government Efficiency.\n\nTrump has pitched the new entity as an advisory panel to help streamline the federal government.\n\nIn a social media post, Musk said that Tesla, the electric vehicle company he founded, was looking into Wednesday’s incident.\n\n“The whole Tesla senior team is investigating this matter right now,” Musk wrote, adding: “We’ve never seen anything like this.”","url":"https://barbadosgazette.com/one-dead-after-tesla-truck-catches-fire-outside-of-trump-hotel-in-las-vegas/","image":"https://barbadosgazette.com/app/uploads/2024/12/2024-12-24T050938Z_1189193151_RC2GVBAI2MW2_RTRMADP_3_HONGKONG-SECURITY-1-1735027221-3590XO.jpeg","video":null,"publish_date":"2025-01-02 00:37:51","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.73},{"id":277632848,"title":"One dead after Tesla truck catches fire outside of Trump hotel in Las Vegas","text":"One person has been killed and seven injured after a Tesla Cybertruck caught fire and exploded outside of a Las Vegas hotel partly owned by United States President-elect Donald Trump.\n\nThe fire began on Wednesday at about 8:40am local time (14:40 GMT) in the valet area of the Trump International Hotel Las Vegas, according to the Las Vegas Metropolitan Police Department and Clark County officials.\n\n“We were told that a 2024 Cybertruck pulled up to the front of the hotel. And in fact, I can tell you, it pulled right up to the glass entrance doors to the hotel,” Sheriff Kevin McMahill said at a news conference. “We saw that smoke start showing from the vehicle, and then a large explosion from the truck occurs.”\n\nDetails are still emerging, and the cause of the explosion has yet to be confirmed by officials.\n\n“I know you have a lot of questions,” Jeremy Schwartz, the acting special agent in charge of the Las Vegas office for the Federal Bureau of Investigation (FBI), told reporters. “We don’t have a lot of answers.”\n\nAuthorities said that the truck appeared to have been carrying fireworks, and a person was found dead inside the vehicle. Several people in the vicinity of the explosion were treated for minor injuries.\n\nOne witness, Ana Bruce, told The Associated Press news agency that she heard three explosions resulting from the fire.\n\n“The first one [happened] where we saw the fire,” Bruce said. “The second one, I guess, was the battery or something like that, and the third was the big one that smoked the entire area and was the moment when everyone was told to evacuate and stay away.”\n\nThe incident occurred hours after a car-ramming attack in the Louisiana city of New Orleans that killed at least 10 people, in what authorities are investigating as a possible terrorist act.\n\nThe suspect in that case is believed to have been carrying improvised explosive devices, or IEDs, in his truck at the time of the car-ramming.\n\nSheriff McMahill acknowledged that his officers were “very well aware of what happened in New Orleans” and that the incident may inform their investigation. But he stopped short of linking the two.\n\n“As you can imagine, with an explosion here on iconic Las Vegas Boulevard, we are taking all the precautions that we need to take to keep our community safe. We’re looking for secondary devices,” McMahill said at the news conference, adding that there did not appear to be any further threat to the community.\n\nThe Cybertruck explosion comes as Trump prepares to take office for a second term on January 20.\n\nPart of his incoming administration includes close advisers, like tech billionaire and Tesla CEO Elon Musk, whom Trump has tapped to co-lead a yet-to-be-founded, nongovernmental body called the Department of Government Efficiency.\n\nTrump has pitched the new entity as an advisory panel to help streamline the federal government.\n\nIn a social media post, Musk said that Tesla, the electric vehicle company he founded, was looking into Wednesday’s incident.\n\n“The whole Tesla senior team is investigating this matter right now,” Musk wrote, adding: “We’ve never seen anything like this.”","url":"https://stkittsgazette.com/one-dead-after-tesla-truck-catches-fire-outside-of-trump-hotel-in-las-vegas/","image":"https://stkittsgazette.com/app/uploads/2025/01/AP25001693080680-1735770017-UWzar1.jpeg","video":null,"publish_date":"2025-01-02 00:37:51","author":"United States President","authors":["United States President"],"language":"en","category":"politics","source_country":"kn","sentiment":-0.73},{"id":277632516,"title":"Our Risible Year: News Nonsense, Media Mirth, and Political Peculiarities From the Second Half of 2024","text":"Here is the second entry of looking back over 2024 and cataloguing the craziness we experienced in this distinctly obtuse year. As things progressed, we did not see a calming mood come across the country. Instead, things just continued to unravel, and many in the American population almost became resigned to the fact we are living in an era of craziness.\n\nSo strap in, and we will now look at the second half of the calendar as we experienced it.\n\nThis was the month when everything changed. \n\nThe first assassination attempt on Donald Trump took place in Butler, Pennsylvania, and the press - recognizing his miraculous survival was a potential windfall - did the only rational thing; they told Republicans to tone down their rhetoric. It was only a matter of days before the press reverted to calling Trump a Nazi/fascist/tyrannical authoritarian, etc.\n\nAs the Democratic Party was melting down like Joe’s brainpan, the president remained obstinate against stepping down as the presumed presidential nominee. Then suddenly he stepped down, and did so with just a posted letter. Then as the party was contemplating how to choose the successor, Biden announced that it would be Kamala Harris. \n\nActor George Clooney looked like a befuddled useful tool as he went from totally backing Biden with a Hollywood fundraiser, then calling for him to step down in a NY Times op-ed, and then later, saying he was manipulated into pushing him out – by Barack Obama. Yes, we need to keep listening to these wise celebrities…\n\nThe Republican National Convention (RNC) was held, and the journalists in attendance were very bothered by the fact it was an upbeat and happy affair. Among the most critical comments was that Hulk Hogan was a speaker.\n\nThe Supreme Court ruled U.S. presidents should be granted immunity and could not be prosecuted for what are official acts, and panicked journalists said this meant Trump could kill political opponents because we suppose murder is an official act.\n\nBefore stepping aside, Biden helped hasten some people losing their employment... by accepting interviews on black radio stations; one DJ was fired for asking only the approved questions she had been fed by the White House. \n\nIn a perfect metaphor for the Biden presidency, after building a floating pier in order to deliver relief aid into Gaza, most of the supplies were being stolen by Hamas, and then the pier began breaking down and large sections actually floated out to sea. \n\nAfter years spent calling Trump immoral for the way they claimed he treated minor illegal immigrants, the same press sounded unbothered as tens of thousands of those same children were declared missing by the administration.\n\nIn her bid to get a VP running mate position, Democrat Michigan Governor Gretchen Whitmer released a memoir, and given it listed off her accomplishments, it weighed in at a slender 175 pages.\n\nIn an amusing dose of a self-own, Washington Post columnist Max Boot was caught in a scandal. After years of accusing Trump and other officials of violations for not registering as a foreign agent, it was learned that not only was his wife indicted for not registering as a foreign agent on behalf of South Korea, but Boot had printed a number of columns that supported her lobbying efforts on behalf of her clients. (We checked, and “프로젝션” is the Korean translation of “projection.”)\n\nWe caught an early glimpse of the entirely fabricated support for Kamala Harris – a woman some pundits suggested be dropped from the ticket to give Biden a better chance of winning – when the group White Dudes For Harris was formed.\n\nTalk about playing the long game! Across the Middle East, reports of widespread injuries and deaths came out when it was learned that Mossad had intercepted a shipment of pagers some years ago and loaded them with an explosive to go off when members of the terror networks were given notice. Then days later, more injuries and casualties occurred as those terrorists resorted to old school walkie talkies, and THOSE TOO were infiltrated. Carrier pigeons as double-agents have to be the next level of infiltration.\n\nDuring the presidential debate, Trump said Joe Biden would not be able to get Wall Street Journal reporter Evan Gershovich - who had just been sentenced to prison in Russia - released without paying a king’s ransom. By August, Biden proved him correct, releasing a number of Russian hardened criminals in exchange for Americans detained on questionable charges. Then, when asked to comment about Trump stating he would have released them for far less, Biden thought he had a damning response: \"Why didn't he do it when he was president?\" Problem for Joe: those released had been detained during the Biden administration.\n\nThe Democratic ticket was formed when goofball governor Tim Walz was the choice for Kamala’s running mate. Many had speculated that Pennsylvania Governor Josh Shapiro was a likely candidate, but the press noted that would have caused a rift in the party’s voting base, amid all of the antisemitic protests. The same press then declared any conservatives pointing out this reality were being antisemitic.\n\nThe Democrats held their convention and after weeks of avoiding the press, Kamala Harris gave her convention speech. Then, as the candidate slipped the press once again, NBC's Kelly O’Donnell surprised her in the steam tunnels of the arena and got the exclusive interview – where the cagey reporter asked, “How are you feeling?”\n\nIn a deeply contradictory move, some leftists on social media tried to shame GOP Rep. Anna Paulina Luna for having photos from years ago in bathing attire. In response, the people claiming conservatives want women adorned in red robes were the ones turning prudish; meanwhile, conservative women were doing the opposite and showing support with pics of themselves in bikinis.\n\nIn a dose of closure to a story that rocked the Big Apple, Robert F. Kennedy Jr. stated he was responsible for the disposing of a dead bear in Central Park a decade ago. The story is completely bat-crap crazy, and it is a testament to the condition of this bizarre year that it was completely dismissed in a matter of days. \n\nThe press showed outrage when Trump met with family members of the troops who were killed during the Afghanistan withdrawal. Recognizing how this reflected horribly on Biden, the media had to attack Trump, along with the Gold Star families. Not only are there images shown of Joe Biden having done exactly that for his campaign, but the press claiming Arlington National Cemetery is sacred and forbids any photographer who turns a profit by selling images from Arlington.\n\nThe second presidential debate took place, with the second Democratic nominee, hosted by ABC News, and most people came away with the same impression – that Trump was debating David Muir and not Kamala.\n\nFull Disclosure: We are not formally trained as network marketing executives. Still, we are rather perplexed that CNN felt the best way to reverse its sliding fortunes was to…bring back fired employees, some of whom helped lead the slide in the ratings.\n\nWe learned that some members of Tim Walz's extended family were ardent Trump supporters. The press had no interest in exploring this family feud.\n\nA telenovela-level of intrigue erupted when it was exposed that journalist Olivia Nuzzi had some kind of inappropriate relationship with RFK Jr. It was believed this had been exposed by her former fiance, Ryan Lizza; she filed a protective order against Lizza, and eventually the dust-up led to both getting fired by their respective news outlets.\n\nIt was a month of cultural bombs. Francis Ford Coppola mortgaged his winery to get the budget for his film “Megalopolis,” which needed to gross about $200 million to break even. Globally, it has earned $13 million. After eight years and $400 million invested, Sony’s woke video game “Concord ”was released, to horrible reviews and user rejection. After a brief rollout the company was refunding purchases and shutting down its servers.\n\nDick Cheney joined his daughter, former Rep. Liz Cheney R-WY), in backing Kamala Harris, leaving the Dems and the press flailing to explain how support from figures they previously called “demonic” is a positive for the campaign. \n\nIllegal immigrant gangs were reported to take over apartment buildings in Colorado, and the press says it is not a problem because only a handful of locations are involved.\n\nThe press were so desperate to find something about Kamala to sell to the public, that we were told how novel it was that she likes food and takes walks with her husband.\n\nAfter the disputed stories of residents in Springfield, Ohio, having their pets eaten by illegal immigrants, Eric Swalwell had a mental break over all of the memes involving Trump and cats.\n\nTaylor Swift came out to endorse Kamala Harris and the press exploded in excitement, despite the reality that a large segment of her fan base is not old enough to vote.\n\nAt a memorial event in Pennsylvania, Joe Biden perplexed everyone when he happily put on a TRUMP 2024 hat.\n\nIn San Francisco, the police formed a task force to curtail motorists who violate the law on yielding to pedestrians in crosswalks. It involved dressing in inflatable chicken costumes.\n\nDonald Trump trolled the Kamala Harris campaign, and the press, over her allegedly having once worked at McDonald's--by working in the drive-thru at one restaurant. This unraveled the media, to the extent they challenged that he worked a full shift and had to interview employees about his technique being improper.\n\nWe saw cover-ups and excuses made, when FEMA was exposed as avoiding the homes of hurricane victims that were flying Trump flags or yard signs - after the press claimed it was a cheap-fakes level of conspiracy.\n\nTrump stunned many by holding a rally in Madison Square Garden and packed the facility. After pathetic comparisons to Hitler having a rally there (apparently the New York Rangers are Nazis for playing 41 games there every season), the big controversy was that a comedian told a joke about Puerto Rico being a garbage dump. This created enough outrage that Tony Hinchcliffe was not elected to office.\n\nBath and Body Works was targeted for outrage because some reactionaries said one of its holiday candles depicted Ku Klux Klan hoods.\n\nGretchen Whitmer had many wondering about…many things concerning her mental state, when she posted a social media video of feeding an assistant Doritios, like she was delivering the Eucharist. She was ratioed to a level where she might have needed to go to confession.\n\nBiden caused a stir when he responded to the MSG rally by calling Trump supporters “garbage.” The press defended him in a hilariously desperate fashion, as they insisted that he spoke with an apostrophe.\n\nAfter Trump completely won the garbage narrative by making an appearance in a garbage truck, the press was angered their attempt to take him down was turned into a hilarious political effort.\n\nThe staff at the Washington Post rebelled when Jeff Bezos demanded there would be no formal presidential endorsement. Their outrage was so extensive that readers cancelled accounts, including the mother of one reporter.\n\nKamala Harris, after being too busy to do a Joe Rogan interview, managed to squeeze in a visit to “Saturday Night Live,” where the candidate who had stolen Trump policies also stole his skit from an earlier appearance. The network was forced by the FCC to provide Trump with airtime for commercials.\n\nA sign of the popularity of Trump was seen by the support for a signature song he played at his rallies. While numerous musical acts went public with complaints about him playing their songs at events, The Village People were not so bothered, and their hit song “Y.M.C.A.” shot up to the top of the charts, decades after it was initially popular. \n\nThe election mercifully took place and the press was reduced once again in 2024, as they had to come to terms with their diminished influence over the country. In the days following Trump’s win, both MSNBC and CNN experienced audience flight; They cannot chalk it up to post-election lulls, as Fox News has seen significant audience growth.\n\nComcast-Universal announced it was moving forward with the hinted-at plan to spin off its cable channels into a separate entity, which would include MSNBC.\n\nMany are left to wonder if the entire election had been tilted by the story of rampant government oversight and oppressive policies that shook a nation – the confiscation and euthanizing of the celebrity, Peanut The Squirrel.\n\nIn the aftermath of the election, the financials of the Harris campaign were exposed, and her spending was at a jarring level – $1.5 billion, with at least a $20 million shortfall. She outspent Trump at a level of at least three times, and was trounced soundly. Among the expenses was shoveling millions for celebrity appearances, and when she could not make it to a podcast appearance, they built a completely new set for the hostess inside a hotel suite.\n\nMany members of the press were angered that Elon Musk was crucial in Trump winning the election, and then claimed Xitter became a conservative echo chamber to justify moving en masse to Bluesky. That site has become a platform where blocking and suspensions are rampant, creating a liberal echo-chamber.\n\nIn his waning days in office, Joe Biden has embarked on a vacation spree. One stop was in Brazil; one day, he gave comments and then, after refusing to take any questions, he wandered aimlessly into the Amazon rainforest.\n\nWhoopi Goldberg was ridiculed when she went on the air to claim that a local bakery, which experienced major mechanical problems preventing them from baking the usual selections, had denied her service over political and racial reasons.\n\nJaguar came out with a bizarre commercial that was notable for two things: It was a hyper-woke display of artistic nonsense, and it never showed any visuals of the car. (Once the model was revealed, the supposedly \"copy nothing\" style was identical to a plain looking car from 10 years ago.)\n\nJoe Biden seems intent on leaving office as a bitter, resentful leader. He began by making blanket pardons for thousands, then went further and commuted sentences of most death row inmates, including rapists and child murderers. The capper, of course, was when he pardoned his own son, Hunter. That clearance involved over a decade of activities, including those he “may” still be found to have committed. When campaigning in 2020, he insisted Hunter did nothing wrong, and four years later, he said Hunter cannot be accountable for anything he may have done wrong.\n\nThe CEO of UnitedHealthcare was killed on the sidewalks of New York. The press and Democrats not only withheld their usual gun-control narratives but made comments supporting the killing due to the policies of health insurance companies. Only some of them walked back comments, once it was pointed out they were condoning vigilante murders.\n\nElon Musk and Vivek Ramaswamy have become the dark lords of The Swamp, as they pledge to cut wasteful spending and close ineffective government agencies. That the press is angered by this speaks volumes. The best is how the media claim Musk is the unelected president, which means that Vlad Putin is not actually running the country--and that could show Trump is not the monomaniacal dictator the press has been promising him to be for a year. Which means the press cannot keep their dystopian fantasies straight regarding Trump.\n\nIn another sign of the tectonic shift in the press, ABC News settled a deflation lawsuit with Trump. This angered many in the press, who are now apparently bothered by the fact that they may be held accountable for their unhinged coverage of Trump.\n\nJust as the press were speculating that Rep. Alexandria Ocasio-Cortez might run for the presidency in 2028, her own party could not even see fit to vote for her to take a committee position in Congress. But suuurrrrre, she is an unstoppable political force…\n\nThere was yet another budget battle, and it nearly led to a government shutdown. The amazement was that what was supposed to be an emergency stop-gap measure led to Congress delivering a monolithic, 1,500-page spending bill. When they were called out for this, the anger towards the likes of Musk and conservatives was completely laughed off for the desperation involved.\n\nCNN boldly touted a story of their reporter who freed an oppressed prisoner from a Syrian jail. It was later learned they managed to free a criminal operative from the deposed regime--who had been tormenting locals. The whistling sound you heard was the Pulitzer Prize nomination shooting away.\n\nAnd we will close with this dose of confounding content–\n\nTim Walz, and his odd spouse, appeared in a video they shot in their home, about their possible inability and/or New Year’s resolution to throw away a box. That is the entirety of their message, and it shows just what has been robbed from us; we will be denied four years of this level of galaxy brain thinking.\n\n[Editor's Note: This article was edited for clarity after publication.]","url":"https://redstate.com/bradslager/2025/01/01/our-risible-year-news-nonsense-media-mirth-and-political-peculiarities-from-the-second-half-of-2024-n2183825","image":"https://media.townhall.com/cdn/hodl/2024/276/e60ae068-ba64-4178-a2b7-6907860baef4.png","video":null,"publish_date":"2025-01-02 00:33:51","author":"Brad Slager","authors":["Brad Slager"],"language":"en","category":"politics","source_country":"us","sentiment":-0.186},{"id":277632500,"title":"Senior DOJ Officials Accused of Leaking Non-Public Information to Media 'Days Before' Election: IG Report","text":"Three former senior Department of Justice officials breached confidentiality policies by leaking non-public investigative details to reporters before an election, an investigative summary from the Office of the Inspector General (OIG) reads. \n\nOne of the three individuals is also accused of violating social media policy by sharing reports resulting from the leaked information through a DOJ social media account.\n\nThe \"misconduct findings\" alleged in the brief summary have been forwarded to relevant authorities for potential further action.\n\nThe bulk of those findings can be found in the following paragraph:\n\nThe OIG investigation found that three then Senior DOJ Officials violated DOJ’s Confidentiality and Media Contacts Policy by leaking to select reporters, days before an election, non-public DOJ investigative information regarding ongoing DOJ investigative matters, resulting in the publication of two news articles that included the non-public DOJ investigative information. The OIG investigation also found that one of these three then Senior DOJ Officials violated the Confidentiality and Media Contacts Policy and DOJ’s Social Media Policy by reposting through a DOJ social media account links to the news articles. \n\nThe OIG indicates they were handcuffed in how far they could act in speaking with those accused due to their status of being former DOJ employees. They only have the authority to compel testimony from current employees.\n\nThe summary states that the investigation was conducted due to allegations that individuals within the DOJ engaged in actions that \"were politically motivated and violated DOJ policies regarding disclosing information about ongoing matters.\"\n\nDetails about the rank of these individuals and the information leaked are scarce. The memo does not indicate which election is being referenced or who the target may have been.\n\nThat said, the New York Post points to a letter from Sen. Chuck Grassley (R-IA) addressed to Attorney General Merrick Garland and FBI Director Christopher Wray in September, which accused the DOJ and FBI of “leaking material and information to the media.”\n\nGrassley noted a Washington Post report from a month earlier regarding a \"secret probe\" into whether or not Donald Trump's 2016 campaign had accepted a $10 million payment from Egyptian president Abdel Fateh el-Sisi. The probe was shut down due to a “lack of sufficient evidence.”\n\nThe story was somehow revived by the Post leading up to the months prior to the 2024 presidential election.\n\nGrassley, in his letter, demanded an investigation as to whether or not \"the Biden-Harris Justice Department and FBI intentionally leaked this information, to include potentially classified information, to the media roughly 90 days before the 2024 presidential election.\"\n\nThe letter was forwarded to Inspector General Michael Horowitz.\n\nHis office's investigative summary has now been forwarded to the U.S. Office of Special Counsel for potential violation of the Hatch Act. The Act is a U.S. law that prohibits federal employees from engaging in partisan political activities while on duty or in the workplace.\n\nA Pew Research Center poll shows the DOJ is one of the least trusted departments in the federal government, being surpassed in net favorability rating only by the IRS.","url":"https://redstate.com/rusty-weiss/2025/01/01/senior-doj-officials-leaked-non-public-information-to-reporters-days-before-election-ig-report-n2183818","image":"https://media.townhall.com/cdn/hodl/2023/12/ef054ea9-a56a-454b-a8ff-143053c1e8e2.png","video":null,"publish_date":"2025-01-02 00:33:51","author":"Rusty Weiss","authors":["Rusty Weiss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.552},{"id":277636492,"title":"What do we know about the Cybertruck explosion outside Trump’s Vegas hotel?","text":"Police are investigating a possible act of terror in Nevada after a Tesla Cybertruck exploded outside of President-elect Donald Trump’s hotel in Las Vegas on New Year’s Day.\n\nOne person has died, and several more were injured during the incident on Wednesday morning.\n\nThe exact cause of the violent explosion is unknown, however, authorities said they were “well aware” of the deadly terrorist attack in New Orleans, and were “taking all precautions.”\n\nJoe Biden said in a Camp David address on Wednesday evening that investigators were trying to establish any links between the New Orleans and Las Vegas incidents.\n\nHere’s what we know so far:\n\nThe explosion occurred around 8:40 a.m. Wednesday morning in the valet area outside of the lobby of Trump International Hotel at Las Vegas Boulevard and Sammy Davis Jr. Drive.\n\nThe 64-story hotel is just off the famed Las Vegas Strip and across the street from the Fashion Show Las Vegas shopping mall.\n\nVideo posted on social media showed different angles of the massive explosion, which appeared to include fireworks. Footage from inside the hotel showed the burning vehicle right outside the entrance, with a series of explosions going off.\n\nGuests staying at the hotel and on surrounding properties told FOX5 that they heard several “booms” which many described as being louder than the New Year’s Eve fireworks.\n\n“It was shaking the glass, it was so loud,” one witness who was staying at the Resorts World on the Las Vegas Strip told KLAS. “I looked out and saw smoke and me and my wife booked it out of there.”\n\nLas Vegas County Sheriff Kevin McMahill said the hotel was evacuated and guests were taken to Resorts World while police investigated.\n\nPolice initially said that the cause of the explosion was unknown, though Tesla boss Elon Musk wrote online that the company’s entire senior team was also assisting with investigations.\n\nIn a later post on X, Musk said that the incident was not due to a fault with the Cybertruck itself.\n\n“We have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself,” he said. “All vehicle telemetry [data collection] was positive at the time of the explosion.”\n\nA police source told ABC that the Cybertruck was carrying a load of fireworks-style mortars.\n\nMcMahill noted during Wednesday’s press conference that officials are “very well aware” of the New Orleans attack in which a man intentionally drove a truck into a crowd of people celebrating New Year’s Eve just hours earlier, killing 10 people.\n\nHe said that officials are “taking all of the precautions that we need to take to keep our community safe” and that they are “looking for secondary devices.”\n\nThe FBI is also involved in the investigation. “I know you have a lot of questions,” Jeremy Schwartz, acting FBI Special Agent in Charge for the Las Vegas office, said at the news conference. “We don’t have a lot of answers.”\n\nDespite authorities’ caution, Musk later posted that the incident “appears likely to be an act of terrorism.” Both this Cybertruck and the F-150 suicide bomb in New Orleans were rented from Turo. Perhaps they are linked in some way,” he suggested.\n\nJoe Biden has directed his team to offer any federal assistance needed, the White House said.\n\nOne person died inside the vehicle, according to McMahill, and efforts were underway to remove the body. It is uncertain whether the individual was male or female.\n\nSeven other people were injured in the explosion.\n\nTwo of the injured were transported to University Medical Center Southern Nevada for treatment. McMahill said all the injuries were minor, and there did not appear to be any further threat to members of the public.\n\nFurther details on the victims are yet to be released.","summary":"One person has died, and several more were injured during the incident on New Year’s Day","url":"https://www.independent.co.uk/news/world/americas/tesla-cybertruck-explosion-vegas-what-happened-b2672565.html","image":"https://static.independent.co.uk/2025/01/01/20/SEI234719624.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/JNGPHvna-OhrQWqOm.mp4","publish_date":"2025-01-02 00:32:20","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":-0.233},{"id":277632232,"title":"'Never seen anything like this': Elon Musk after Cybertruck blast claims life","text":"A Tesla Cybertruck exploded outside the Trump Hotel in Las Vegas on Wednesday, resulting in one fatality and several injuries, with Tesla CEO Elon Musk expressing his shock over the incident, saying he has never seen anything like this before.\n\nLas Vegas Metropolitan Police Department Sheriff Kevin McMahill said at a press conference that a person was found dead inside the 2024 model-year Cybertruck and seven people sustained minor injuries from the explosion.\n\nElon Musk, CEO of Tesla, said the electric car maker was investigating the fire.\n\n\"The whole Tesla senior team is investigating this matter right now,\" he said in a post on X, adding, \"We’ve never seen anything like this.\"\n\nMcMahill said the Cybertruck pulled up to the Trump building at 8:40am. local time. He said police were mindful of the New Orleans attack that had occurred in the early hours of Wednesday. The FBI said a potential explosive device was found in the vehicle used in that attack.\n\n\"As you can imagine with an explosion here on iconic Las Vegas Boulevard, we are taking all the precautions that we need to take to keep our community safe. We're looking for secondary devices,\" McMahill said, adding that there did not appear to be any further threat to the community.\n\nEric Trump, executive vice president of the Trump Organization and a son of president-elect Donald Trump, posted about the incident on X. \"Earlier today, a reported electric vehicle fire occurred in the porte cochère of Trump Las Vegas,\" he wrote.\n\nThe US National Transportation Safety Board in 2024 opened an investigation into a crash and fire involving a Tesla electric semi-truck on a California highway.\n\nAuto experts say electric vehicle fires burn differently than those in cars with internal combustion engines, often lasting longer and being harder to extinguish.","url":"https://www.thenews.com.pk/latest/1267772-never-seen-anything-like-this-elon-musk-after-cybertruck-blast-claims-life","image":"https://www.thenews.com.pk/assets/uploads/updates/2025-01-02/l_1267772_033229_updates.jpg","video":null,"publish_date":"2025-01-02 00:31:51","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.609},{"id":277632428,"title":"WHEN VEHICLES ARE USED AS WEAPONS","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nThe Weaponization of Vehicles\n\nVehicles (cars, buses, trucks, etc.,) are integral to our modern lives, serving as vital tools for mobility, transportation of goods, and even exploration. They facilitate daily commutes, connect remote regions to urban centers, and ensure the timely delivery of food and essential supplies. From cars and trucks to buses and bicycles, these machines (or tools) have revolutionized the way we live and interact. However, the very essence of vehicles as symbols of freedom and convenience has been marred by their malicious use as weapons of terror.\n\nThe French Quarter, near Bourbon Street is blocked off late morning with a heavy police and FBI ... [+] presence after a Terrorist attack early in the morning in New Orleans, Louisiana, on January 1, 2025. At least 10 people were killed and 30 injured Wednesday when a vehicle plowed overnight into a New year's crowd in the heart of the thriving New Orleans tourist district, authorities in the southern US city said. (Photo by Emily KASK / AFP) (Photo by EMILY KASK/AFP via Getty Images)\nAFP via Getty Images\n\nThe transformation of vehicles into instruments of mass violence has instigated fear, trauma, and societal upheaval, impacting communities and fundamentally altering public perception of transportation.\n\nThe juxtaposition of vehicles as facilitators of freedom and as tools of violence creates a paradox that challenges our very understanding of mobility. For most, vehicles represent autonomy, the ability to traverse distances, and the chance to explore new horizons. However, we that this mobility can quickly be weaponized. Over the years, there have been high-profile incidents of vehicles being used deliberately to inflict harm on unsuspecting individuals. From tragic incidents like the 2016 Bastille Day attack in Nice, France, to horrific events in Berlin and Toronto, the haunting reality is that vehicles can be co-opted for nefarious purposes. Most recently New Orleans, often referred to as the “Big Easy” was the site of a heinous vehicular attack on New Year’s Day 2025, resulting in the massacre of at least 15 people and injury to dozens of others.\n\nTOPSHOT - A picture taken on July 15, 2016 shows the truck that was driven by a man through a crowd ... [+] celebrating Bastille Day being towed away by breakdown lorry in the French Riviera city of Nice. (Photo by ANNE-CHRISTINE POUJOULAT / AFP) (Photo by ANNE-CHRISTINE POUJOULAT/AFP via Getty Images)\nAFP via Getty Images\n\nMORE FOR YOU\n\nNew Orleans Truck Attack Suspect Identified As Shamsud-Din Jabbar—Here’s What We Know About Him\n\nNew Orleans Truck Attack: Death Toll Rises To 15, FBI Believes Suspect Didn’t Act Alone (Live Updates)\n\nApple Watch Series 10 Price Slashed To All-Time Low In New Sale\n\nWhen vehicles are used as weapons the reasons vary, ranging from political statements to acts of indiscriminate violence. While the psychological impact of these events is profound, the physical destruction has a long-lasting effect on communities, including economic repercussions. Lives are lost, families are shattered, and neighborhoods that once felt safe become riddled with anxiety and fear. The sudden realization that a quotidian object—a car or truck—can turn lethal can strain public trust in their environments. It leads to a reconsideration of how we perceive mobility, once viewed exclusively as a beneficial aspect of life.\n\nThe surge in such incidents has catalyzed serious discussions around public safety and the need for enhanced regulations around vehicle usage. The conversations focus not only on how to deter potential attackers but also on how to balance the freedoms associated with vehicle ownership and the necessity of collective safety. In many cities, desperate measures have been taken to mitigate risks: increased barriers at public events, expanded use of pedestrian zones, and specialized road barriers designed to thwart vehicle attacks. While these measures can enhance safety, they can also restrict movement and alter the landscape of urban areas and in the New Orleans incident despite a heightened police presence was not enough.\n\nMoreover, such episodes can lead to broader societal consequences, fueling divisions within communities. When a vehicle-based attack occurs, it often provokes a heightened sense of vigilance and fear among citizens toward one another. Distrust can manifest, particularly against specific demographic groups, as fears and misconceptions create a collective sense of vulnerability. This fallout has profound implications on social cohesion and can result in stigmas that hinder community unity. The Tesla cybertruck explosion at a Trump hotel just a few weeks from inauguration appears to create political implications, sowing further distrust among community.\n\nA Tesla Cybertruck is shown after it caught fire and exploded outside the lobby of President-elect ... [+] Donald Trump's hotel, on January 1, 2025, in Las Vegas. At least one person was killed and seven wounded when a Tesla Cybertruck exploded outside a hotel belonging to US President-elect Donald Trump in Las Vegas, police said Wednesday. (Photo by WADE VANDERVORT / AFP) (Photo by WADE VANDERVORT/AFP via Getty Images)\nAFP via Getty Images\n\nFurthermore, the psychological scars inflicted by such acts can linger long after the physical aftermath is cleared. Survivors grappling with trauma find themselves navigating a world painted with shadows of fear and anxiety. Support systems become crucial, but resources are often stretched thin in the aftermath of such incidents, compounding the challenges faced by communities.\n\nAs we navigate this complex landscape, it is essential to instill vigilance without succumbing to paralyzing fear. Communities can rally together to reclaim spaces, emphasizing unity over division, and resilience in the face of adversity. Initiatives aimed at fostering dialogue and understanding can help dispel misconceptions that arise from these heinous acts and shed light on the actual facts, not internet fodder. Engaging with law enforcement and civic leaders regarding the reimagining of public safety strategies can help develop a framework that prioritizes safety without infringing on the freedoms enjoyed by many as long as those officials do not succumb to stereotypical partisan positions.\n\nIn conclusion, while vehicles remain symbols of freedom and connectivity, we must confront the unsettling reality of their misuse as weapons. As we reflect on the balance between protection and freedom, it becomes clear that proactive measures, community engagement, and a commitment to understanding are essential factors in transforming the narrative surrounding vehicles. By focusing on building resilient communities, we can work collectively to ensure that mobility remains a source of liberty and not a tool of oppression. Our overarching goal should be to insure that Transportation is Mobility and Mobility is Freedom ™ will remain true for every community.\n\nFollow me on Twitter or LinkedIn. Check out my website. \n\nSelika Josiah Talbott\n\nEditorial Standards\n\nForbes Accolades","summary":"The transformation of vehicles into instruments of mass violence has instigated fear, trauma, and societal upheaval, impacting communities and fundamentally altering p...","url":"https://www.forbes.com/sites/selikajosiahtalbott/2025/01/01/when-vehicles-are-used-as-weapons/","image":"https://imageio.forbes.com/specials-images/imageserve/6775d6aa145a0052a20e54a9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-02 00:30:52","author":"Contributor,Selika Josiah Talbott","authors":["Contributor","Selika Josiah Talbott"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":277631982,"title":"Capitalising on ‘China Plus One’: Will India step up?","text":"As global trade dynamics shift under Donald Trump’s policies, India stands to gain from the move by multinational companies to diversify supply chains beyond China\n\nReleasing a report the ‘Trade Watch’, on December 25, 2024, NITI Aayog CEO BVR Subrahmanyam has suggested that trade policies under US President-elect Donald Trump could result in a potential economic boom for India, driven by significant trade diversion in global trade. He said ‘Whatever Trump has announced so far, which is likely to come up… there are opportunities. We are the man at first slip. The ball is coming in our direction. Whether we hold the catch or drop it is for us to decide. There will be huge disruption, and if we prepare for it, there will be a massive boom due to trade diversion.’ \n\nThis comes after Trump announced additional tariffs on imports from its biggest trading partners - 25 per cent on Canada and Mexico if they fail to check illegal immigration and drug trade. He also announced a general 10 per cent tariff by the US on all imports and a 60 per cent tariff on imports from China. Meanwhile, the US has also announced restrictions on the export of computer chip-making equipment, software, and high-bandwidth memory chips to China. Trump has also threatened to impose 100 per cent tariffs on BRICS (Brazil, Russia, India, China, and South Africa) countries if they try to undermine the US dollar. The US is the biggest importer in the world with a mammoth import valued at US$ 3200 billion during CY 2022. During that year, its import from China alone was US$536.3 billion which works out to 16.7 percent of total goods imports.\n\nUS goods imports from Canada and Mexico were US$436.6 billion and US$454.8 billion or 13.6 per cent and 14.2 per cent respectively. In sharp contrast, US goods imports from India during 2022 were US$85.5 billion or a meagre 2.6 per cent of its total goods import. Now, if Trump executes his threat of imposing a 60 per cent additional tariff on imports from China, this will lead to an exorbitant increase in the cost of the latter’s goods to American consumers thereby rendering them uncompetitive vis-à-vis similar goods coming from other exporting countries such as India. This should help India capture a big slice of the US import basket currently served by China. This should be possible even if Trump imposes a 10 per cent additional tariff on all its imports including from India. As for Trump’s threat to impose 100 per cent tariffs on BRICS countries (India is one of them) in the event of the latter putting into action their so-called ‘de-dollarization’ plan (De-dollarization is a process of moving away from the world’s reliance on the U.S. dollar as the chief reserve currency), this is theoretical.\n\nAt the 16th summit held on 22–24 October 2024 in Kazan, BRICS leaders, including Russian President Vladimir Putin and Chinese leader Xi Jinping, publicly voiced their commitment to jointly introduce an alternative payment system that wouldn’t be dependent on the U.S. dollar. The feasibility of implementing this idea anytime soon is suspect. Second, the US is also hell-bent on taking measures that will undermine the capabilities of China to boost the production of its goods such as electronics (including smartphones), automobiles etc in which it has a comparative advantage. So, it has imposed restrictions on the export of computer chip-making equipment, software, and high-bandwidth memory chips to China.\n\nAs a result, China not have much surplus to send to the US (and other countries), and India will have more space to boost its export of electronics, automobiles etc.Third, European Union (EU) countries have also imposed tariffs on Chinese EVs (electric vehicles) and solar equipment. Moreover, the multinational companies (MNCs) headquartered in the US and EU countries are shifting their factories away from China, thanks to growing geopolitical uncertainties, the ongoing trade war between the United States and China, cyber-security, and rule-of-law concerns, rising labour costs in China etc. This opens up opportunities as these MNCs can relocate their production bases to India. All of this reinforces a case for ‘China Plus One’, a potent business strategy that involves diversifying manufacturing and sourcing away from China aimed at reducing the risk of over-reliance on China for manufacturing and sourcing.\n\nIs India ready to capitalise?\n\nNone other than NITI Aayog’s ‘Trade Watch’ report says that even as many Asian countries such as Vietnam, Thailand, Cambodia, and Malaysia have emerged as bigger beneficiaries of the ‘China Plus One’ strategy – enabled by factors such as cheaper labour, simplified tax laws, lower tariffs, signing Free Trade Agreements (FTAs) – leading to substantial surge in their exports especially in high-growth sectors, India has lagged. Although India has achieved production gains, they have not significantly contributed to domestic value addition, unlike its peer economies.\n\nIn India’s high-tech sector, while exports surged by 350 per cent between 2017 and 2023, domestic value-added output fell by 18 per cent. In manufacturing, by contrast, during this period, even as domestic value-added grew at 26 per cent, it still trailed behind merchandise export growth of 44 per cent.In electronics, India’s share in US imports has grown from 0.2 per cent in 2017 to 2.1 per cent in 2023, courtesy of, the government’s push toward high-tech exports. However, competitors like Vietnam, Taiwan, Malaysia, and Thailand dominate, with each holding a substantially higher market share in US electronics imports.\n\nAn overarching reason behind India ‘dropping the catch despite the man at first slip and the ball coming in our direction’ is a high-cost domestic environment (this is despite a host of incentives given under the Production Linked Incentive or PLI schemes to industries) which makes our products uncompetitive in the export as well as domestic market. It also explains why our industries demand high protective tariffs and government yields; for instance, it has on the table a proposal for a 25 per cent hike in steel import duties. It is also a major factor behind India’s reluctance to join major multilateral trade agreements, such as the Regional Comprehensive Economic Partnership (RCEP) and Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) etc which help the country to better integrate into the global economy and benefit from expanded trade opportunities by facilitating access to markets of their member countries duty-free or at close to zero tariffs. Micro, Small & Medium Enterprises (MSMEs) contribute nearly 40 per cent of exports. But, India not being a part of such trade alliances, they are denied an opportunity to boost exports. At the same time, they suffer due to high protective tariffs on the import of basic materials such as steel. A 25 per cent hike in import duties on steel products - asked by the Ministry of Steel - will impart a deadly blow to the MSMEs. \n\nThere are four major reasons as to why costs in India are high. First, businesses in basic materials and feedstock such as copper, zinc, aluminium, oil and gas, chemicals, petrochemicals etc are natural monopolies enabling them to set high prices. Second, tax rates are pretty high particularly when it comes to petroleum products which are still taxed under the pre-GST regime. By increasing movement costs, these increase the cost of all goods across the board.\n\nThird, power tariffs are exorbitant thanks to excessive State controls on power distribution companies. Finally, industries operate in highly interest-rate environments. India can catapult itself to the position of fully leveraging the ‘China Plus One’ strategy only if it effectively addresses the present high-cost syndrome.\n\n(The writer is a policy analyst; views are personal)","url":"https://www.dailypioneer.com/2025/columnists/capitalising-on----china-plus-one-----will-india-step-up-.html","image":"https://www.dailypioneer.com/uploads/2025/story/images/big/capitalising-on----china-plus-one-----will-india-step-up--2025-01-01.jpg","video":null,"publish_date":"2025-01-02 00:29:51","author":"Daily Pioneer","authors":["Daily Pioneer"],"language":"en","source_country":"in","sentiment":-0.071},{"id":277631932,"title":"Gold set to extend record run; may hit Rs  90,000 in 2025 on global cues","text":"Gold, a safe-haven bet, is likely to continue its record-smashing journey in the New Year, rising to Rs 85,000 per 10 grams and even Rs 90,000 level in domestic markets if geopolitical tensions and global economic uncertainties continue.\n\nAlso aiding the run is a dovish tilt in monetary policy and buying by central banks, but if the geopolitical crisis eases, the precious metal will turn weak on depreciating rupee.\n\nGold price is hovering at Rs 79,350 per 10 grams in spot markets at present, and Rs 76,600 per 10 grams in futures trade on the Multi Commodity Exchange (MCX).\n\nThe precious metal capped off 2024 on a strong note with its best performance, notching 23 per cent returns in the domestic markets. The yellow metal hit an all-time high of Rs 82,400 per 10 grams on October 30 this year. Silver mirrored this stellar performance with a 30 per cent gain, surpassing the Rs 1 lakh level per kg level.\n\nGlobally, Comex gold futures started the year at around USD 2,062 per ounce and rallied to a peak of USD 2,790 per ounce on October 31, giving returns of up to 28 per cent, reinforcing their appeal amid global uncertainties.\n\nExperts believe that precious metals remain strong performers in 2025 as well, buoyed by geopolitical tensions, central bank purchases, and a pivot towards lower interest rates by major central banks.\n\nThe outlook for gold in 2025 remains positive, though the pace of growth may moderate compared to 2024, LKP Securities VP Research Analyst - Commodity and Currency, Jateen Trivedi told PTI.\n\n\"Domestic gold prices are expected to reach Rs 85,000 as modest targets, with a best-case scenario of Rs 90,000 and silver expected to deliver bit higher gains towards Rs 1.1 lakh on modest and even hit Rs 1.25 lakh, if geopolitical tensions persist or escalate,\" he said.\n\nHe noted that interest rate cycles are also pivotal as a global shift toward lower interest rates would inject liquidity into markets and weaken the US Dollar, bolstering gold prices.\n\nHowever, the US Federal Reserve's cautious approach to rate cuts may temper the pace of price increases. Additionally, sustained gold purchases by central banks, driven by diversification strategies and concerns over currency stability will provide strong support to bullion, Trivedi added.\n\nSeveral factors have shaped the demand demand and supply dynamics of gold in 2024, including a turbulent geopolitical landscape. The ongoing Russia-Ukraine war and tensions in West Asia have spurred safe-haven demand for bullion, thus impacting its prices this year.\n\n\"Gold and silver markets have been directly impacted by a turbulent geopolitical environment. These geopolitical crises have typically caused an immediate 2-3 per cent spike in prices, reaffirming investors' preference for precious metals as a shield against uncertainty,\" Trivedi said.\n\nHowever, Commtrendz Research co-founder and CEO Gnanasekar Thiagarajan told PTI that gold prices are struggling to keep up the momentum as the geopolitical uncertainty and economic uncertainty premium have started fading away. \"Market participants are now taking into consideration US President-elect Donald Trump's tariff era, economic policies and their potential future impact on the Fed's mandate to bring inflation down to 2 per cent. Higher inflationary expectations could undermine the appeal for bullion.\"Furthermore, we would not be surprised to see the Fed opt for a cut from May onwards, as it could allow for a clearer picture to be formed on the new administration's actual economic policies rather than comments made potentially to gain negotiation leverage with foreign counterparts,\" he stated.\n\nThe outlook is bearish for gold in the first half of 2025, with the possibility of testing USD 2,455 (MCX: 73,000-73,500), he said.\n\nThe rupee is expected to depreciate further, which could arrest the fall in local prices relative to international prices in the coming year, he added.\n\nIn the domestic markets, the government's decision in July this year to cut gold import duty by 6 per cent led to a sharp 7 per cent correction in gold prices, equivalent to Rs 5,000 per 10 grams.\n\nThe price drop spurred physical demand for gold during the festive and wedding seasons. The reduction not only made gold more affordable but also boosted increased buying, supporting robust consumption by the jewellers and consumers.\n\n\"Gold jewellery consumption grew by 17 per cent in 2024, primarily driven by volatility in gold prices, along with festive and marriage-related demand. Additionally, the sharp 900 basis points reduction in import duty announced in the Union Budget of July 2024 spurred demand for jewellery, bars, and coins,\" Rahul Kalantri, Vice President of Commodities at Mehta Equities Ltd, said.","url":"https://www.dailypioneer.com/2025/business/gold-set-to-extend-record-run--may-hit-rs---90-000-in-2025-on-global-cues.html","image":"https://www.dailypioneer.com/uploads/2025/story/images/big/gold-set-to-extend-record-run--may-hit-rs---90-000-in-2025-on-global-cues-2025-01-01.jpg","video":null,"publish_date":"2025-01-02 00:29:51","author":"Daily Pioneer","authors":["Daily Pioneer"],"language":"en","source_country":"in","sentiment":0.147},{"id":277631542,"title":"Biden finally addresses the nation on New Orleans terror attack that slaughtered 15 people and reveals killer's shocking social media videos","text":"President Joe Biden finally addressed the New Orleans New Year's Day terror attack Wednesday night from Camp David. \n\nBiden reiterated that the alleged killer was a Texas-born American who served in the armed forces and was inspired by ISIS to mow down and kill at least 15 victims in the early hours of 2025. \n\n'No one should jump to conclusions,' he advised. \n\nThe now deceased subject has been identified as 42-year-old Shamsud Din Jabbar. \n\n'The FBI also reported to me that mere hours before he attacked he posted videos on social media indicating that he was inspired by ISIS - especially the desire to kill, the desire to kill,' Biden said. 'The ISIS flag was found in his vehicle, which he rented to conduct this attack.' \n\nThe president called the situation 'very fluid' and said he was being updated on the Tesla Cybertruck explosion outside President-elect Donald Trump's Las Vegas hotel as well.\n\n'Including whether there's any possible connection with the attack in New Orleans,' Biden said. 'Thus far, there's nothing to report on that score at this time.' \n\nBoth vehicles were rented out on Turo, a car-sharing app, but beyond that there doesn't appear to be a connection. \n\nThe president gave just brief remarks and walked off ignoring shouted questions including whether he had been in touch with Trump, who will be sworn back in as president in just 20 days. \n\nBiden started off his Camp David appearance by consoling those in mourning. \n\n'Our nation grieves with you. We're going to stand with you as you mourn and as you heal in the weeks to come,' the president said.","summary":"President Joe Biden finally addressed the New Orleans New Year's Day terror attack Wednesday night from Camp David.","url":"https://www.dailymail.co.uk/news/article-14242603/joe-biden-addresses-new-orleans-terror-attack-las-vegas-cybertruck.html","image":"https://i.dailymail.co.uk/1s/2025/01/02/00/93660269-0-image-a-55_1735776869854.jpg","video":null,"publish_date":"2025-01-02 00:20:55","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.741},{"id":277630468,"title":"DNC Trolled Epically for Their 'Favorite Moments from 2024' Post","text":"On Tuesday afternoon, to celebrate the end of 2024, the DNC official account put out a collage of four photos of President Joe Biden and Vice President Kamala Harris to commemorate \"Some of our favorite moments from 2024.\" While the DNC may have found some moments to celebrate, the American people still suffered under the Biden-Harris administration for 2024. \n\nAmong the photos included Biden during his February appearance on \"Late Night with Seth Meyers,\" a picture of Harris and Second Gentleman Doug Emhoff, Biden with Olympians, and Harris taking to a stage with the words \"TRUST WOMEN,\" clearly in the background, no doubt a reference to abortion.\n\nSome of our favorite moments from 2024. pic.twitter.com/HWm3CzFDQT— The Democrats (@TheDemocrats) December 31, 2024\n\nIt's particularly fitting that the picture of Harris would be about abortion. She also reminded on Sunday just how obsessed she is with the issue by calling to mind how she visited an abortion clinic in March, becoming the first sitting vice president to do so. \n\nThe year, especially leading up to the election, was also marked by Democrats in disarray. The White House, particularly Press Secretary Karine Jean-Pierre, gaslit the American people with claims that there were no issues with the president's mental faculties, insisting that any evidence showing there were concerns were \"cheap fakes.\" Democratic allies in the mainstream media were all too happy to fall in line. \n\nAfter Biden's disastrous debate performance on June 27 against now President-elect Donald Trump, however, demands came from even fellow Democrats that he should step aside, and he finally withdrew on July 21, with a letter shared to his X account. He was replaced by Harris who was installed as the nominee and still has yet to win a single primary vote.\n\nHope did come in November, though, thanks to Trump being elected once more. He will take office in just under three weeks, so long as all goes well with the Speaker's vote on Friday. He didn't just handily win in the November 5 election, he increased his numbers from 2020 and 2016. He won not just the Electoral Colleges, and with more votes than his win in 2016 against Hillary Clinton, he also won the popular vote, which a Republican has not done since 2004.\n\nIn the approximately 24 hours that the DNC post has been up, there's been hundreds of replies trolling to point out that the best moment was Trump's win over Harris, with Doug P. highlighting some of the best responses for our sister site at Twitchy. \n\nAmong those chiming in with quoted reposts includes the RNC. While the DNC's post so far has 1.5k likes, the RNC's quoted repost put out not long after the original post has 27,000 likes.\n\nOur favorite moment from 2024! 🇺🇸 https://t.co/OB3F5ZRRBa pic.twitter.com/3DrQz0uyJN— GOP (@GOP) December 31, 2024\n\nOne of my favorite moments from 2024: pic.twitter.com/C8dtpZOVOp— Steve Guest (@SteveGuest) December 31, 2024\n\n— The Dank Knight 🦇 (@capeandcowell) December 31, 2024\n\nGOP ratioed The Democrats 😂😂🤣🤣 https://t.co/NrZHhCGoLl— PoliticsPagan | TRUMP2024 (@PoliticsPagan) January 1, 2025\n\nHarris also performed particularly poorly in 2024. Although she did win key blue states, enough so to win 226 electoral votes, she won many of those states by much slimmer margins than Biden did, and she did not improve on his numbers from 2020 in any state. It also appears that Harris achieved a feat not seen since 1932, in that she didn't flip any county that Trump won in 2020. Counties stayed red, stayed blue, or became redder. \n\nThe RNC has been posting plenty of hopeful messages for Tuesday night and Wednesday. Among those included a Happy New Year post that featured an image of the White House, where Trump will soon return to.\n\nWhen it comes to 2025, a CBS News poll from last week, as we covered at the time, shows that Americans said they were far more \"hopeful\" about 2025 than they were about 2024, with Trump being cited as a reason among many. \n\n— GOP (@GOP) January 1, 2025","url":"https://townhall.com/tipsheet/rebeccadowns/2025/01/01/dnc-trolled-epically-for-favorite-moments-from-2024-post-n2649854","image":"https://media.townhall.com/cdn/hodl/2024/311/94d0ec50-a74d-4fa8-adb8-c12d94cd45ac.png","video":null,"publish_date":"2025-01-02 00:20:06","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.014},{"id":277630466,"title":"FBI Finds Largest Homemade Explosives Cache in Agency's History. Here's Where.","text":"A federal prosecutor said the FBI found the largest cache of homemade explosive devices in the agency’s history last month in Virginia. \n\nBrad Spafford was taken into custody on Dec. 17 at his farm outside of Norfolk, Virginia, on a single-count criminal complaint that accused him of failing to register a short barrel rifle. But when investigators searched the 20-acre property, they discovered more than 150 explosive devices. \n\nProsecutors in Federal District Court in Norfolk filed the court papers describing Mr. Spafford’s explosives in an effort to keep him in custody as his case moves toward trial.According to the court papers, which were reported earlier by the website Court Watch, the investigation into Mr. Spafford began last year, after a neighbor reached out to the authorities. Mr. Spafford had lost three fingers on his right hand while working with a homemade explosive device, the neighbor said, and he was stockpiling weapons and homemade ammunition.The neighbor reported that Mr. Spafford had told him that he and his friends were “preparing for something” that he “would not be able to do alone,” the court papers said.The neighbor also told investigators that Mr. Spafford sometimes used photographs of President Biden for target practice at a local shooting range and believed that “political assassinations should be brought back.” After the attempt on President-elect Donald J. Trump’s life in Pennsylvania in July, the papers said, Mr. Spafford told his neighbor that he “hoped the shooter doesn’t miss Kamala,” an apparent reference to Vice President Kamala Harris.Mr. Spafford moved to his farm this fall, and the neighbor went to visit him there in October wearing a secret recording device, the papers said. Mr. Spafford told the neighbor that he had various types of explosives at the property and discussed fortifying it with “a 360-degree turret” in which he planned to mount a 50-caliber rifle, according to the papers. (NYT)\n\nAn attorney for Spafford filed a response to the Department of Justice’s motion to revoke the judge's release order, arguing the 36-year-old has “no criminal record and no history of substance abuse or mental illness.”\n\n“The government argues that Mr. Spafford should be detained because he poses a danger to the community in spite of the fact that the government has been investigating and carefully watching Mr. Spafford for approximately two years through the use of a confidential human source who was a friend and confidant of Mr. Spafford,” the filing continues. “During all of that time, there is no evidence or allegation that Mr. Spafford committed or attempted to commit any act of violence. There was no evidence introduced that Mr. Spafford is a danger to the community and in fact, the evidence showed he had never used any explosive device, never threatened to use one, and never threatened any individual or group. Additionally, there was no evidence that Mr. Spafford had the means or equipment necessary to explode the devices. The evidence was that professionally trained explosive technicians had to rig the devices to explode them.”\n\nThe attorney said Spafford’s “ill-advised comments” about political figures are protected by the First Amendment.","url":"https://townhall.com/tipsheet/leahbarkoukis/2025/01/01/fbi-finds-largest-homemade-explosives-cache-in-agency-history-in-virginia-n2649839","image":"https://media.townhall.com/cdn/hodl/2018/78/5dbf0541-2bc6-4093-a32f-dc2beb938318.jpg","video":null,"publish_date":"2025-01-02 00:20:06","author":"Leah Barkoukis","authors":["Leah Barkoukis"],"language":"en","source_country":"us","sentiment":-0.348},{"id":277629380,"title":"2nd LD Writethru: 1 dead, 7 injured after Tesla Cybertruck explodes outside Trump hotel in Las Vegas","text":"Mega Millions player in California wins $1.3 billion jackpot15 hurt in Florida as train hits fire truckRussia's Gazprom to halt gas supplies to Moldova from January 1New York to fine fossil fuel companies for damage from climate change\n\n 2nd LD Writethru: 1 dead, 7 injured after Tesla Cybertruck explodes outside Trump hotel in Las VegasLOS ANGELES, Jan. 1 (Xinhua) -- One person was killed and seven others were injured on Wednesday after a Tesla Cybertruck explosion outside a Trump hotel in Las Vegas, local media reported, citing the police. One person is dead after a Tesla Cybertruck burst into flames outside the Trump International Hotel near the north end of the Las Vegas Strip Wednesday morning, reported local KSNV television station. A vehicle fire was first reported around 8:40 a.m. local time in the valet area of the hotel. The Cybertruck pulled up to the front to the entrance when smoke started showing and there was an explosion, Clark County Sheriff Kevin McMahill was quoted as saying, adding that one person inside the vehicle was killed. The Las Vegas Metropolitan Police Department said in a post on X that \"We are investigating a vehicle fire at the entrance to Trump Towers. The fire is out. Please avoid the area.\" Officials confirmed to media that seven people suffered minor injuries as a result of the explosion, with two of them taken to a hospital for treatment. Most people staying at Trump International have been moved to a nearby hotel, Resorts World Las Vega, said the report of KSNV television station, citing McMahill. Videos posted on social media showed a Tesla Cybertruck engulfed in flames outside the hotel's lobby entrance. Authorities said they are investigating the explosion. An official who briefed on the probe told ABC News that the Tesla Cybertruck had a load of fireworks-style mortars onboard. Investigators are urgently working to determine a motive and whether the driver intended to set off an explosion and why, said the report, noting that \"Until a motive is determined and other possibilities are ruled out, police are treating the explosion like a possible criminal act and a possible act of terror.\" Elon Musk, the co-founder and CEO of Tesla, said in a post on X that \"The whole Tesla senior team is investigating this matter right now.\" The staunch ally of U.S. President-elect Donald Trump noted that \"We've never seen anything like this.\" He wrote later that \"We have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself.\" \"Earlier today, a reported electric vehicle fire occurred in the porte cochère of Trump Las Vegas,\" Eric Trump, the president-elect's son and a leader of the Trump Organization, said in a post on X. \"The safety and well-being of our guests and staff remain our top priority.\" \"We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their swift response and professionalism,\" he added. \n\n 2nd LD Writethru: 1 dead, 7 injured after Tesla Cybertruck explodes outside Trump hotel in Las Vegas2nd LD Writethru: 1 dead, 7 injured after Tesla Cybertruck explodes outside Trump hotel in Las VegasXinhua 2nd January 2025, 09:45 GMT+11LOS ANGELES, Jan. 1 (Xinhua) -- One person was killed and seven others were injured on Wednesday after a Tesla Cybertruck explosion outside a Trump hotel in Las Vegas, local media reported, citing the police. One person is dead after a Tesla Cybertruck burst into flames outside the Trump International Hotel near the north end of the Las Vegas Strip Wednesday morning, reported local KSNV television station. A vehicle fire was first reported around 8:40 a.m. local time in the valet area of the hotel. The Cybertruck pulled up to the front to the entrance when smoke started showing and there was an explosion, Clark County Sheriff Kevin McMahill was quoted as saying, adding that one person inside the vehicle was killed. The Las Vegas Metropolitan Police Department said in a post on X that \"We are investigating a vehicle fire at the entrance to Trump Towers. The fire is out. Please avoid the area.\" Officials confirmed to media that seven people suffered minor injuries as a result of the explosion, with two of them taken to a hospital for treatment. Most people staying at Trump International have been moved to a nearby hotel, Resorts World Las Vega, said the report of KSNV television station, citing McMahill. Videos posted on social media showed a Tesla Cybertruck engulfed in flames outside the hotel's lobby entrance. Authorities said they are investigating the explosion. An official who briefed on the probe told ABC News that the Tesla Cybertruck had a load of fireworks-style mortars onboard. Investigators are urgently working to determine a motive and whether the driver intended to set off an explosion and why, said the report, noting that \"Until a motive is determined and other possibilities are ruled out, police are treating the explosion like a possible criminal act and a possible act of terror.\" Elon Musk, the co-founder and CEO of Tesla, said in a post on X that \"The whole Tesla senior team is investigating this matter right now.\" The staunch ally of U.S. President-elect Donald Trump noted that \"We've never seen anything like this.\" He wrote later that \"We have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself.\" \"Earlier today, a reported electric vehicle fire occurred in the porte cochère of Trump Las Vegas,\" Eric Trump, the president-elect's son and a leader of the Trump Organization, said in a post on X. \"The safety and well-being of our guests and staff remain our top priority.\" \"We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their swift response and professionalism,\" he added. \n\n Read This Next Japan's factory activity shrinks at a slower pace, PMI showsShell shuts oil processing unit to investigate leak in SingaporeVirginia zoo welcomes newborn pygmy hippopotamus as year endsDow Jones dips 30 points on last trading day of yearFDA proposes new testing rules to ensure cosmetics are asbestos-free \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274906826/2nd-ld-writethru-1-dead-7-injured-after-tesla-cybertruck-explodes-outside-trump-hotel-in-las-vegas","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2025-01-02 00:12:35","author":null,"language":"en","source_country":"us","sentiment":-0.368},{"id":277629544,"title":"China-Africa prospects: 2025 and beyond","text":"The outgoing year of 2024 has been phenomenally significant in relations and cooperation between Africa and China. This is not because it has been less significant in the past but because in a particularly tense period in the world, it stayed stable and entered a new era of high-quality engagement and “elevated to an all-weather community with a shared future”.\n\nPresident Xi Jinping pointed to its historic trajectories when he noted, “The friendship between China and Africa transcends time and space, surmounts mountains and oceans and passes down through generations.”\n\nWhile scholars of International relations and world politics claim the tiresome theory that nations proceed from the cold calculus of strict national interest in interactions with others, giving scope to a zero-sum game in which one must lose for another to gain, China-Africa cooperation has significantly up-ended the audacity of such assumptions, giving concrete expression that international cooperation and partnerships have consequences for win-win outcomes and mutual benefits.\n\nThe outgoing year of 2024 witnessed an escalation of tensions in many parts of the world. The Russia/Ukraine conflict reached a dangerous level amid nuclear threats with obvious ramifications for the rest of the world. The Israeli war in Gaza also threatened to spiral out of control and engulf the whole region with Iran being dragged into the mix and the U.S. presidential election appeared more like a civil war than a political contest with a leading presidential candidate barely escaping two assassination attempts.\n\nDespite that Mr Donald Trump won convincingly and decisively, the American “civil war” is far from over. Major European countries– Germany, France, and Netherlands witness political upsets with ruling parties shaken to their roots. The European Union bureaucracy having betted on the war-enabling U.S Joe Biden presidency and its surrogate, Mrs Kamala Harris look hopelessly hollowed out as Mr Trump looks forward to cutting a deal with Russian leader, Vladimir Putin, to end Europe’s most fratricidal war since the 1940s.\n\nAmid the turbulence, Africa and China strengthened their engagement, which culminated in the summit of the Heads of State and Government of the Forum on China-Africa Cooperation, which was held in Beijing in September. More than 50 heads of state and government, including Nigeria’s President Bola Tinubu showed up in Beijing, except the tiny Estwani, former Swaziland still struggling to come to terms with the African consensus that there is only one China in the world (People’s Republic of China) whose government in Beijing is the sole and legitimate representative of all the Chinese people, including their 22 million compatriots in the Taiwan Island.\n\nThe summit, as widely expected, lived up to expectations. Nigeria’s President Tinubu attending for the first time said, “The African spirit for FOCAC is based upon mutual respect and partnership that promote development, happiness, peace and stability,” and added, “We are in this journey together.” As is usual with the tradition of the FOCAC process, the summit delivered a compelling practical outcome, setting the stage for follow-up engagements.\n\nBefore outlining the 10 partnership action plans for the two sides, President Xi Jinping dropped the iconic words on marble, “China and Africa account for one-third of the world population. Without our modernisation, there will be no global modernization,” describing modernisation as “an inalienable right of all countries”. The 10-action plans to be implemented in the next three years covered areas of mutual learning among civilisations, trade prosperity, industrial chain cooperation, connectivity, health, agriculture and livelihoods, people-to-people and cultural exchanges, green development and common security. All these areas of cooperation were products of vigorous and extensive consultations resulting in consensus on the roadmap for implementation.\n\n2025 will be a pivotal year for the implementation of the outcomes of the summit and so far, activities have demonstrated considerable commitments by relevant parties to dutifully carry out their responsibilities. The Nigeria government whose leader President Tinubu participated both at the summit and paid his first state visit to China on the invitation of President XI Jinping, established a special directorate and appointed a director-general for Nigeria-China strategic partnership who “will lead day-to-day operations, engage continuously with the Chinese counterparts and ensure that all deliverables are met and synchronised with national development goals”.\n\nIn the strategic plan, the director-general, who will report directly to the President, bypassing potential bureaucratic bottlenecks, “will ensure the specific deliverables, timelines and key performance indicators for each area of cooperation, which will include priority projects, projected investments and expected socio-economic outcomes”. \n\nThis is the first time in Nigeria’s international relations that a special directorate has been created to oversee the implementation of the outcomes of the country’s bilateral engagement and a specific multilateral forum. On the other hand, the Chinese Ambassador Mr Yu Dunhai, who arrived at his post in Abuja just barely a month before the summit in Beijing, expressed his total commitment not only to ensure the implementation of the outcomes but also to its translation into concrete benefits for the two sides.\n\nGiven that the stage is set for China and Africa to walk the talk, the year 2025 will be a significant turning point for cooperation that has traditionally aimed to scale new heights and gain new impetus.\n\nTo infuse the African Continent Free Trade Area with the type of vitality that it deserves, foreign direct investment flows, for which China is well known, is vastly needed. On average, China invests about $340m across the world daily and a good slice of it will significantly impact Africa’s foreign investment drive.\n\nAgainst the background of the mounting rhetoric of the U.S. President-elect Mr Donald Trump, who is ideologically addicted to trade tariff hikes, notwithstanding its economic backlash, Chinese enterprises will likely hedge their bets to a more welcoming and less politically volatile economic landscape that Africa can offer.\n\nIt means African countries should take advantage of the traditional political goodwill that exists with Beijing and create the enabling economic conditions with a significant focus on cutting red tape and offering concessional tax incentives for prospective Chinese enterprises. With the right policy mix that combines with the demographic advantage and potential for green development, African active industrial and capacity production cooperation with China can help the region inherit the mantle of the “workshop of the world” and inject the world economy with a fresh dynamism. Europe and America are currently engrossed in the disruptions of the global industrial value chain and obsessed with erecting trade barriers in an unending shadow fight to contain and constrain China, which has an obvious implication to distract and distort Africa’s growth trajectory for which China is making outstanding contributions.\n\nThe prospects of the year 2025 for China and Africa to raise the bar to new levels of their cooperation and engagement under the Belt and Road Initiative for which Africa is the region with the largest number of partnership countries is obviously an important frontier to be further explored. The milestone already reached in Belt and Road constructions, which have provided enormous infrastructure connectivity projects spanning railways, highways, seaports, airports and industrial parks in Africa, naturally speaks to the new phase of investment and trade cooperation for which the infrastructure projects are and could be major enablers.\n\nWithout vigorous economic and social activities, infrastructure projects will translate to dead capital and over time become a liability. And with the Belt and Road Initiative now taking into account small but, people-centred and impactful projects, African policymakers desirous of dealing deadly blows to poverty in the region can engage policy instruments that leverage the cooperation with China in the new stage of the Belt and Road cooperation.\n\nChina’s key global initiatives on development, security and dialogue among civilisations are open and are viable domains for international partnership and cooperation and the year 2025 provides a vital opportunity for African countries to give policy context to these initiatives and instrumentalise them to address specific challenges. Beijing traditionally says what it means and means what it says and, therefore, the room for concrete outcomes in cooperation with China on these initiatives has high prospects.\n\nThe coming of the year 2025 will not hand out prospects and benefits as Santa Claus or Father Christmas but rather every hazard that must be overcome or avoided and the benefits and progress, the new year will afford will be the outcome of a deliberate commitment and steadfast struggle and this is especially for China-Africa cooperation.\n\n Onunaiju is the director of the Centre for China Studies, Abuja","summary":"The outgoing year of 2024 has been phenomenally significant in relations and cooperation between Africa and China. This is not because it has been less significant in the past but because in a particularly tense period in the world, it stayed stable and entered a new era of high-quality engagement and “elevated to an all-weather \n\n\n \n Read More","url":"https://punchng.com/china-africa-prospects-2025-and-beyond/","image":"https://cdn.punchng.com/wp-content/uploads/2023/08/10075158/china-flag.jpg","video":null,"publish_date":"2025-01-02 00:12:06","author":"Opinion","authors":["Opinion"],"language":"en","source_country":"ng","sentiment":-0.147},{"id":277629096,"title":"Elon Musk’s ‘bizarre’ X name change","text":"The world’s richest man, who boasts nearly 210 million followers on the platform he has owned since 2022, also switched up his profile avatar to feature an image of the popular Pepe the Frog character clad in gladiator-like armour, the New York Post reported.\n\nMusk, a confidant of President-elect Donald Trump, has yet to offer a full explanation for his sudden name change.\n\nBut there are a few hints.\n\nMORE: Elon Musk’s bizarre move with ex-partner Grimes exposed\n\nWhat could Kekius Maximus mean?\n\nElon watchers online have suggested that the new moniker is a bizarre combination of Pepe the Frog and Russell Crowe’s character, Maximus Decimus Meridius, in the 2000 blockbuster “Gladiator.”\n\nMusk’s new profile image shows Pepe the Frog clad in golden armour while holding a video game controller.\n\nPepe, which started off as simply a cartoon in the “Boy’s Club” comic series, allegedly became associated online with white supremacists and the alt-right during the 2016 presidential election.\n\nThe Anti-Defamation League dubbed the character a hate symbol and described it as the “Alt Right’s favourite meme.”\n\nHowever, Musk and many others who are chronically online have always rejected those claims.\n\nA link to gaming?\n\nThe Tesla founder teased his handle change in a post on X on Tuesday, writing: “Kekius Maximus will soon reach level 80 in hardcore PoE.”\n\nPoE is an apparent reference to the popular “Path of Exile 2” video game, which Musk is known to play.\n\nConnection to cryptocurrency?\n\nKekius Maximus is also the name of a “memecoin” — a cryptocurrency based on a popular online meme.\n\nMusk has previously caused massive ripple effects in the crypto market with his social media antics — notably with the dogecoin.\n\nIn the wake of Musk’s handle change, the Kekius Maximus crypto’s value soared by more than 900 per cent as of Tuesday afternoon, according to the CoinGecko site.\n\nIt wasn’t immediately clear, though, if Musk — who has previously shown support for memecoins — has anything to do with Kekius Maximus specifically.\n\nSpeculation of a burner account\n\nMany have speculated online, too, that Musk’s motive is rooted in claims that he is running a burner super-fan account.\n\nInternet sleuths have been suggesting that the Space X CEO is behind an account — operating under the name Adrian Dittmann — that heaps praise on him.\n\nMusk has denied being Dittmann — and mocked people who claimed he’s operating the alt account.\n\nDeepening the mystery, Dittmann appears to be a character who operates only on X — there is almost no evidence of a person with that name operating outside the social media platform.\n\nMusk added fuel to the fire by retweeting a post from the Dittmann account on Tuesday that mentioned the Kekius Maximus saga. \n\n“Imagine you’re a journalist writing about Elon on X and it goes: ‘Elon Musk, aka Kekius Maximus, on X…,’” the Dittmann post read.\n\nThis article originally appeared in the New York Post and was reproduced here with permission.","summary":"Elon Musk has confused supporters and critics with his bizarre name change on X, but what does it mean?","url":"https://www.news.com.au/technology/online/heres-why-elon-musk-changed-his-name-on-x-to-kekius-maximus-and-what-it-means/news-story/5154b0e494fc8aa3d4b604563baa22af?from=rss-basic","image":"https://content.api.news/v3/images/bin/074c9fd2f737c6440dd440cc1ac775f4","video":null,"publish_date":"2025-01-02 00:09:54","author":"Emily Crane","authors":["Emily Crane"],"language":"en","source_country":"au","sentiment":-0.066},{"id":277628236,"title":"Mitch McConnell’s legacy: A ‘grim reaper’ for US bipartisanship?","text":"A new United States Congress convenes in Washington, DC, on January 3. But for the first time in 18 years, a key Republican leader will no longer be at the helm: Senator Mitch McConnell.\n\nSince 2007, McConnell has served as head of the Republican Party in the Senate, steering members of his caucus through four different presidencies and countless legislative hurdles.\n\nExperts say his tenure as the Senate’s longest-serving party leader will ultimately be remembered as an inflexion point for Republicans and Congress as a whole.\n\nUnder McConnell, US politics moved away from the back-slappers and consensus-builders of earlier eras. Instead, McConnell helped to usher in a period of norm-breaking, hyper-partisan politics that paved the way for figures like incoming President Donald Trump, the leader of the Make America Great Again (MAGA) movement.\n\n“First and foremost, he extended a trend in minority obstruction in the Senate,” Steven S Smith, professor emeritus of political science at Washington University in St Louis, told Al Jazeera.\n\nSmith pointed out that McConnell led a Republican majority for only six of his 18 years as Senate leader. The rest of his tenure has been spent mobilising a minority in the 100-seat Senate to disrupt the agenda of the rival Democratic Party.\n\n“Second, he will be known for deepening partisan polarisation in the Senate,” Smith said. “While McConnell is not a conservative or MAGA extremist by today’s standards, he was a deeply partisan leader.”\n\nDespite his commitment to the Republican Party, some see McConnell as a potential bulwark to figures like Trump, with whom he has clashed in the past.\n\nThough he is stepping down as party leader, McConnell intends to remain in the Senate for the remainder of his six-year term. But the extent to which McConnell will act as a check on Trump’s ambitious second-term agenda remains to be seen.\n\n“I’d be very surprised to see him be provocative in a public way. His influence is going underground,” Al Cross, a veteran reporter and columnist who covered McConnell’s tenure, told Al Jazeera.\n\n‘I usually play the villain’\n\nMcConnell has led a long and storied career in the Senate. In 1984, he made his first bid for a seat in the chamber, ousting an incumbent Democrat.\n\nHe has remained undefeated ever since. In 2020, he won his seventh straight term.\n\nHis ascent to the top of the Senate came without significant opposition. The 2007 retirement of the previous Senate Republican leader, Bill Frist, left the position vacant.\n\nBut even from his first days as a Senate leader, McConnell cultivated a reputation as a hardliner and obstructionist.\n\nDuring his first year as Republican leader, The New York Times described him as operating with “near-robotic efficiency” to smack down Democratic policies, despite leading a minority in the Senate.\n\n“Mr McConnell and his fellow Republicans are playing such tight defense, blocking nearly every bill proposed by the slim Democratic majority that they are increasingly able to dictate what they want,” reporter David Herszenhorn wrote.\n\nMcConnell quickly embraced his visibility as a partisan warrior, a self-described “grim reaper” for progressive proposals.\n\nOne editorial column nicknamed him “Senator No” for his refusal to work across the aisle. McConnell himself greeted reporters once by saying, “Darth Vader has arrived.”\n\n“Over the three decades I have been a US Senator, I’ve been the subject of many profiles,” McConnell wrote in the opening lines of his 2016 memoir. “I usually play the villain.”\n\nSmith, the Washington University professor, described McConnell as sparking a “transformation” in the Senate as a result of his hardline approach.\n\nBefore McConnell’s leadership, Smith said the Senate only saw “occasional minority obstruction”. But afterwards, the chamber became known in political circles as the “60-vote Senate”.\n\nThat nickname is a reference to the 60 votes required to overcome a minority obstruction, otherwise known as a filibuster.\n\nUnder McConnell, Smith explained, “acting on legislation of any importance would face minority obstruction and require 60 votes for cloture”.\n\nBending norms\n\nOne of McConnell’s most divisive moments came in 2016, with the death of Supreme Court Justice Antonin Scalia.\n\nNormally, when a justice dies, the sitting president is entitled to nominate a replacement. But Scalia’s death came 11 months before a pivotal presidential election. And the president at the time, Democrat Barack Obama, was nearing the end of his final term.\n\nMcConnell made a stunning — and swift — political gamble. Within hours of Scalia’s death, the Republican leader announced he would refuse to call a vote to confirm Obama’s chosen replacement.\n\n“The American people should have a voice in the selection of their next Supreme Court Justice. Therefore, this vacancy should not be filled until we have a new president,” McConnell said in a statement.\n\nLeft-leaning publications like The Nation decried McConnell’s decision as an assault on the US Constitution. “This refusal exploded norms,” journalist Alec MacGillis wrote in the publication ProPublica.\n\nBut McConnell’s gambit shifted the balance of power on the court for generations to come.\n\nThat November, US voters elected Trump — a political newcomer — to his first term in the White House, setting the stage for more shifts in Washington norms.\n\nTrump ultimately nominated three right-wing justices to the Supreme Court, including one to replace Scalia. That cemented a conservative super-majority on the bench, anticipated to mould US law for generations to come.\n\nTrump later credited McConnell as his “ace in the hole” and “partner”.\n\n“Mitch recognized, as did I, that since judges enjoy life tenure, the impact of judicial nominations can be felt for thirty years or more,” Trump wrote in a forward to McConnell’s memoir. “Transforming the federal judiciary is the ultimate long game!”\n\nA Trump rivalry\n\nBut in the lead-up to a new and emboldened Trump administration in 2025, McConnell has increasingly spoken out against the president-elect and his isolationist “America First” platform.\n\nThe two Republican leaders have repeatedly butted heads, and their relationship is notably frosty.\n\nTrump has openly called McConnell an “old crow” and vilified his “China-loving wife” Elaine Chao, a slap at her Asian heritage.\n\nMcConnell, meanwhile, has countered with his own fighting words, implying parallels between Trump and isolationism in the 1930s.\n\n“We’re in a very, very dangerous world right now, reminiscent of before World War II,” McConnell told the Financial Times in December. “Even the slogan is the same. ‘America First.’ That was what they said in the ’30s.”\n\nUpon vacating his leadership post in January, McConnell is expected to take on the role of chairman of the Senate Appropriations Subcommittee on Defense.\n\nIn his new position, he is likely to advocate for strengthening the US military to counter threats from adversaries like Russia, Iran and China.\n\nYet at age 82, with health challenges including a recent fall, experts say McConnell is unlikely to offer much resistance to the incoming Trump administration.\n\n“Since Senator McConnell is out of his leadership position and given his physical frailty, I am not expecting much in the way of sustained opposition from him,” Harvard University political scientist Daniel Ziblatt told Al Jazeera.\n\n“It is possible he may cast a dissenting vote here or there that might make a difference. But his track record doesn’t leave me holding my breath.”\n\nNo greater institutionalist\n\nStill, Herbert Weisberg, a professor of political science at The Ohio State University, anticipates that McConnell may act as an occasional dissenting voice, particularly as the Senate weighs some of Trump’s controversial nominees for high-level government posts.\n\n“He’d normally want to defer to a Republican president on appointees, but he’ll be cautious on the unusual Trump nominees. He might be willing to vote against a few, but not all of them,” Weisberg told Al Jazeera.\n\nAlready, McConnell — a childhood polio survivor — issued a public warning to incoming administration officials to “steer clear of” efforts “to undermine public confidence” in “proven cures”, lest they scuttle their Senate confirmation hearings.\n\nThe statement came immediately after Trump health nominee Robert F Kennedy Jr was linked to an effort to revoke approval for the polio vaccine in The New York Times.\n\nBut a single Republican is unlikely to stall a nomination or piece of legislation, as Steven Okun, an analyst on US politics, government and trade, pointed out.\n\nRepublicans hold a 53-person majority in the incoming Senate. And many in the party are firmly behind Trump’s leadership.\n\nAssuming a united Democratic opposition, “four Republican senators would be needed to stop anything a future President Trump puts forth to the Senate,” Okun explained.\n\nMcConnell, Okun added, is unlikely to take on the role of dissenter — “only when Donald Trump pursues the most aggressive actions which would run counter to the US national interest”.\n\nAfter all, party loyalty has been a key tenet of McConnell’s leadership. And experts like Cross, the journalist, believe McConnell won’t want to miss an opportunity to use the power of the Senate to shape presidential policy.\n\n“I can’t think of any greater institutionalist than Mitch McConnell,” Cross said. “He loves the Senate, it’s what he’s aspired to. He doesn’t want to give up its role in advice and consent.”","url":"https://stvincenttribune.com/mitch-mcconnells-legacy-a-grim-reaper-for-us-bipartisanship/","image":"https://stvincenttribune.com/app/uploads/2025/01/AP24345778352700-1735670870-BayfgN.jpeg","video":null,"publish_date":"2025-01-02 00:01:59","author":null,"language":"en","category":"politics","source_country":"vc","sentiment":0.133},{"id":277628194,"title":"Tesla Cybertruck explodes outside Donald Trump’s Las Vegas hotel killing one person","text":"WorldNorth AmericaElectric vehicles\n\nLas Vegas | One person died and seven more were injured Wednesday when a Tesla truck caught fire and exploded outside President-elect Donald Trump’s Las Vegas hotel, authorities said.Las Vegas Metropolitan Police and Clark County Fire Department officials said at a news conference that a person died inside the vehicle and that they were working to get the body out.Loading...AP or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? Follow the topics, people and companies that matter to you.Find out moreRead MoreElectric vehiclesDonald TrumpTrump diplomacyTrump's White HouseTrump's AmericaTeslaEric TrumpFBI\n\nFetching latest articles","url":"https://www.afr.com/world/north-america/one-killed-in-tesla-cybertruck-explosion-outside-trump-s-las-vegas-hotel-20250102-p5l1mm","image":"https://static.ffx.io/images/$zoom_2.6489%2C$multiply_1%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/4bd55ed5b8668b0302a9e51c19e45bdfe127ce70","video":null,"publish_date":"2025-01-02 00:01:52","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"au","sentiment":-0.548},{"id":277628196,"title":"Climate change: Shadow treasurer Angus Taylor says Coalition will scrap carbon emissions reporting as Donald Trump prepares rollback in US","text":"PolicyEconomyClimate policy\n\nThe Coalition has vowed to repeal new laws requiring businesses to disclose their greenhouse gas emissions if it wins this year’s federal election, amid expectations the Trump administration is poised to scrap similar rules in the United States.New Australian laws came into effect on January 1 requiring some large companies to publish a sustainability report alongside their annual financial disclosures, and will next year require the reporting of “scope 3” emissions generated by a company’s suppliers and customers.Loading...Michael Read is the Financial Review's economics correspondent, reporting from the federal press gallery at Parliament House. He was previously an economist at the Reserve Bank of Australia and at UBS. Connect with Michael on Twitter. Email Michael at michael.read@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreClimate policyDonald TrumpAngus TaylorJim Chalmers\n\nFetching latest articles","url":"https://www.afr.com/policy/economy/coalition-vows-to-scrap-emissions-reporting-as-trump-prepares-rollback-20241231-p5l1d3","image":"https://static.ffx.io/images/$zoom_0.113%2C$multiply_4%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_exclusive_no_age_social_wm/e9e4330bccc29a2d07a3812a10401193f11b46f3","video":null,"publish_date":"2025-01-02 00:01:52","author":"Michael Read","authors":["Michael Read"],"language":"en","category":"politics","source_country":"au","sentiment":0.172},{"id":277628852,"title":"Letters: Jimmy Carter, as president and after, exemplified dignity","text":"As president, and after,\nCarter displayed dignity\n\nRe: “Jimmy Carter, 39th president, Nobel Peace Prize recipient, dies at 100” (Page A1, Dec. 30).\n\nLast May I was in Washington, D.C., on business and stopped by the National Portrait Gallery, where I spent all my time viewing the portraits of all the U.S. presidents.\n\nMuch to my surprise, the one single portrait I was most taken with was that of Jimmy Carter. I recall its being a full-length portrait and what knocked me out was how it radiated selfless character, integrity and dignity. No other portrait came close to having that effect, and so many were the opposite.\n\nHe was one of just a few men truly worthy of that office.\n\nFrom Carter to Trump\nis a remarkable fall\n\nRe: “Jimmy Carter, 39th president, Nobel Peace Prize recipient, dies at 100” (Page A1, Dec. 30).\n\nAs we reflect on the life and legacy of President Jimmy Carter and compare it to the life and legacy of our incoming President Donald Trump, one can only wonder how American society has devolved to such a low level.\n\nThe insights of future historians will provide quite a read.\n\nKirch DeMartini\n\nLegal action is sound\nfor environment, costs\n\nRe: “State air regulator sued over biogas” (Page A1, Dec. 20).\n\nCheers to the coalition of environmental groups and the California Republicans for suing the California Air Resources Board for approving the latest standard for the Low Carbon Fuel Standard Program.\n\nThe program was designed to lower emissions of carbon dioxide from fossil-fuel gasoline by replacing fossil-fuel gasoline with biofuel. Unfortunately, the production of biofuels results in emissions elsewhere. The net effect is likely to be neutral or increased emissions.\n\nThe latest plan could add 47 cents a gallon to the price of gasoline. This is a significant financial impact on the many who live in our farm communities and drive long distances.\n\nElectric vehicles, charged with renewable energy, are the solution. The price of EVs is plummeting to equal fuel-powered vehicles.\n\nGary Latshaw\n\nH-1B visas don’t give\nrelatives path into U.S.\n\nRe: “An online debate over foreign workers in tech shows tensions in Trump political coalition” (Page A4, Dec. 28).\n\nAll the talk about H-1B visas never mentions that family members must have an H-4 EAD visa with an Employment Authorization, and parents require an E-2, B-1/B-2 or O-1 visa..\n\nThe point is, the system is quite complicated, but H-1B status does allow a path for noncitizen relatives to enter and work here. Usually, an H-1B visa holder has extended family members who come here to work as well.\n\nJoanne Hall\n\nTrump sold working poor\nworthless bill of goods\n\nRe: “Low-income areas boosted Trump” (Page A1, Dec. 28).\n\nI found it disheartening to see so many low-income and working-class voters support Donald Trump. Trump will actively work to destroy housing, health care, social services and other programs that improve the lives of the poor and working class.\n\nTrump said that he has eyes on replacing Obamacare with “concepts of a plan.” Elon Musk’s DOGE effort to cut government spending will target low-income programs benefiting the poor and working class. At the same time, Trump has promised to slash taxes once again for his rich friends. When it comes to campaign promises, many working-class Americans bought Trump’s promise to bring down grocery prices. Right after the election, Trump admitted that there wasn’t much he could do to bring grocery prices down.\n\nIn other words low-income and working-class Americans were sold a bill of goods that won’t be honored.\n\nLoren Spiekerman\nFoster City","summary":"Also: Remarkable fall &#124; Sound action &#124; H1B visas &#124; Bill of goods. Mercury News reader letters to the editor for Jan. 2, 2025.","url":"https://www.mercurynews.com/2025/01/01/letters-president-jimmy-carter-exemplified-dignity-1976/","image":"https://www.mercurynews.com/wp-content/uploads/2023/02/SJM-L-CARTER-0227-3.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-02 00:00:19","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.199},{"id":277632192,"title":"German Chancellor Takes Apparent Jab at Elon Musk in New Year’s Address","text":"German Chancellor Olaf Scholz offered a New Year’s address in which he seemed to admonish potential concern about billionaire Elon Musk’s influence on the country’s upcoming elections.\n\nThe future of Germany “will not be decided by the owners of social media channels,” Scholz said in a Dec. 31 address.\n\n“It won’t be the person who yells loudest who will decide where Germany goes from here—rather, that will be up to the vast majority of reasonable and decent people,” he said.\n\nThe Dec. 28 op-ed, which appeared to prompt a resignation from the commentary editor, included Musk criticizing the nation’s mainstream parties for producing economic stagnation, among other things.\n\n“The portrayal of the AfD as right-wing extremist is clearly false, considering that Alice Weidel, the party’s leader, has a same-sex partner from Sri Lanka! Does that sound like Hitler to you? Please!” Musk said in the piece.\n\nThe AfD has been labeled a right-wing extremist political party by domestic intelligence agencies in some German states. Officials in Germany have said that AfD members reject the basic liberal democratic order that prevails in the country.\n\nAfD party leaders reject the extremist label, describing it as a smear meant to discredit their critiques of government policy, which they say are legitimate and based on pragmatic concerns rather than extremist ideology.\n\nIn December, Scholz lost a parliamentary vote of confidence, teeing up an election for February 2025.\n\nGerman Vice Chancellor Robert Habeck also offered a New Year’s address in which he criticized Musk.\n\n“Musk is strengthening those who are weakening Europe,” Habeck said. “A weak Europe is in the interest of those for whom regulation is an inappropriate limitation of their power.”\n\nTheir arguments came as Musk prepares to help President-elect Donald Trump lead part of an advisory commission for the U.S. government called the Department of Government Efficiency (DOGE). Part of his and Trump adviser Vivek Ramaswamy’s goals in leading DOGE is to pursue reasonable deregulation.\n\nAfD positions also include advocacy for strict border security and the expulsion of illegal immigrants. The AfD is currently polling in second place in Germany and could potentially disrupt the formation of either a center-right or center-left majority.","summary":"Musk, billionaire and owner of X, has expressed support for the AfD party.","url":"https://www.theepochtimes.com/world/german-chancellor-takes-apparent-jab-at-elon-musk-in-new-years-address-5784689","image":"https://img.theepochtimes.com/assets/uploads/2024/12/16/id5777488-1.tagreuters.com2024binary_LYNXMPEKA504Q-FILEDIMAGE-LSedit-300x180.jpg","video":null,"publish_date":"2025-01-01 23:57:07","author":"Sam Dorman","authors":["Sam Dorman"],"language":"en","category":"politics","source_country":"us","sentiment":0.321},{"id":277627478,"title":"Triple H and Stephanie McMahon Join Linda McMahon at Donald Trump's Mar-a-Lago","text":"In 2025, Triple H, Linda McMahon, and Stephanie McMahon attended the Mar-A-Lago. Donald Trump declared that he would appoint Linda McMahon as his nominee for Secretary of Education in his incoming administration following his victory in the 2024 US presidential election. Therefore, it should come as no surprise that McMahon was seen ringing in the new year at a Trump-hosted New Year's Eve party at Mar-A-Lago.Mar-a-Lago New Year’s Bash Features WWE Icons Triple H and Stephanie McMahonA picture of the family surfaced on social media, showing WWE Chief Content Officer Triple H and his spouse Stephanie McMahon attending the celebration. There’s no confirmation on whether Vince McMahon was present at Mar-A-Lago, though it seems unlikely given recent developments. Linda McMahon recently confirmed that she and the former WWE Chairman of the Board are officially separated, marking another chapter in the ongoing saga of the McMahon family dynamics.— Andrew_Ravens (@Andrew_Ravens) The news comes amidst a year of significant upheaval for Vince McMahon. Following his announcement of a return to WWE’s Board of Directors in January 2023, his daughter, Stephanie McMahon, resigned from her executive role in the company. Vince later stepped down from all WWE and TKO responsibilities in the aftermath of Janel Grant’s sex trafficking lawsuit filed against him.Since then, Stephanie McMahon has maintained a limited role in the wrestling world. While she has made several high-profile on-screen appearances, she does not hold any official position behind the scenes. Most notably, her return to the spotlight came during SummerSlam 2024, where her appearance generated significant buzz.During the post-show coverage following Stephanie’s SummerSlam segment, her husband, Paul \"Triple H\" Levesque, shared his thoughts. He said, \"She does not have an official role right now, but I can tell you this, she loves this, absolutely loves it. Sometimes harder to love it, sometimes easy to love it. It’s easy to love it again for her. She’s enjoying watching it. She’s enjoying coming to the shows, seeing everybody in the back, she loves it.\" (via SEScoops)ALSO READ: WWE Star Omos Wins GHC Tag Team ChampionshipsWhile her split from Vince McMahon represents a personal turning point for the former WWE Chairman amid a year of controversy and transition, Linda McMahon's continued support of Donald Trump highlights her influence in both the business and political spheres. Even though Stephanie McMahon is stepping back from an active role in WWE operations, Triple H and Stephanie McMahon's attendance at high-profile events like the Mar-a-Lago New Year's Eve bash shows their continued relevance in wrestling and beyond.","url":"https://timesofindia.indiatimes.com/sports/wwe/top-stories/triple-h-and-stephanie-mcmahon-join-linda-mcmahon-at-donald-trump-mar-a-lago/articleshow/116865412.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116866219/116866219.jpg","video":null,"publish_date":"2025-01-01 23:56:51","author":"Pragya Chowdhury","authors":["Pragya Chowdhury"],"language":"en","category":"politics","source_country":"in","sentiment":0.448},{"id":277627318,"title":"Trump’s conviction: Lessons for Nigeria","text":"PRESIDENT-ELECT Donald Trump’s trial, conviction, and ongoing post-conviction legal issues have thrown up interesting and novel developments in that country’s democracy. These issues hold lessons for other democracies: those deliberately building institutions and those, like Nigeria, whose weak institutions sorely undermine representative government and governance.\n\nTrump was tried and convicted in respect of 34 felony counts bordering on “falsifying business records to cover up a hush money payment made to porn star Stormy Daniels before the 2016 election.” Daniels had alleged that she had a sexual relationship with Trump in 2006, but the latter had denied the allegation. Trump was convicted on May 30.\n\nThe reprieve offered by the Supreme Court Presidential Immunity for American Presidents has been removed by a New York judge, Juan Merchan. Merchan upholds Trump’s conviction because the immunity clause granted American presidents only relates to official acts and not “unofficial conduct” as in Trump’s case.\n\nIt was the first time a US President—former or serving—would be convicted of a crime. Trump is, however, yet to be sentenced.\n\nTrump has challenged the ruling in court, asking that the case be thrown out. As a novel case, the different positions taken by Trump’s legal team and the prosecution, and the issues arising from its proximity to the inauguration, will pose difficult but interesting options to Merchan in the ongoing sentencing litigation.\n\nThese include whether or not to sentence him before inauguration; dismissing the trial on account of the inauguration in the public interest as sought by Trump’s legal team; cancelling the conviction but sustaining the conviction toga; delaying sentencing till Trump serves his term as president since he has the right of appeal and will enjoy immunity during his term; and having a felon occupy the Oval Office for the first time in US history. The outcomes will enrich the US democracy and judicial system. Other democracies will learn how to unravel constitutional conundrums for optimum democratic gains.\n\nThe Trump trial and conviction have demonstrated the strength of American institutions and equality before the law. Despite his positions as an ex-president, a presidential candidate and president-elect, the weight of the law and national interest are being thrown behind the case.\n\nThis is unlike Nigeria, where it is practically impossible to win a case against the President or the ruling party. \n\nIn Nigeria, there is a sense that politically exposed persons are only prosecuted when they have issues with the powers that be or are members of the opposition party. Two former governors were inexplicably pardoned by former President Muhammadu Buhari in 2022. The Supreme Court nullified the conviction of a former Abia State Governor, Orji Kalu because he was sentenced by a vacation judge!\n\nUnlike in the US where public outcry is always high in public issues, Nigerians are docile under the same circumstances and often side with their kinsmen when they are being prosecuted for stealing public funds. In the ongoing arraignment of a former governor for allegedly embezzling N110.4bn state funds, several groups in the state staged public protests in his support.\n\nTrump’s conviction case highlights the fair hearing posture of American democracy.\n\nWhile leaders and public officials like Merchan build institutions in the US, Nigerian governors have resorted to buying SUV vehicles for judges to tacitly compromise them for personal and party gains.\n\nThese brazen developments expose the judiciary to corruption and call for the divestment of the appointment of the judges from the executive’s control. \n\nTheir salaries and welfare should be firmly under the first-line charge.\n\nNigeria must strengthen its democracy by building institutions, revitalising its judicial system, instituting true federalism, and enthroning the rule of law to make governance work at good and bad times.","summary":"PRESIDENT-ELECT Donald Trump’s trial, conviction, and ongoing post-conviction legal issues have thrown up interesting and novel developments in that country’s democracy. These issues hold lessons for other democracies: those deliberately building institutions and those, like Nigeria, whose weak institutions sorely undermine representative government and governance. Trump was tried and convicted in respect of 34 felony \n\n\n \n Read More","url":"https://punchng.com/trumps-conviction-lessons-for-nigeria/","image":"https://cdn.punchng.com/wp-content/uploads/2024/11/06144625/Donald-Trump-e1730900783729-1200x630.jpeg","video":null,"publish_date":"2025-01-01 23:55:53","author":"Punch Editorial Board","authors":["Punch Editorial Board"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.32},{"id":277627168,"title":"India Is Shooting Itself in the Foot on Trade — Again","text":"(Bloomberg Opinion) -- President-elect Donald Trump has renewed his threat to impose a tariff wall on Indian imports to the US. One of the few recognizable threads knitting together the tangle that is Trump’s long tenure in public life is a disdain for “unfair” tariffs. India is often singled out for failing to reciprocate America’s generally low import taxes. If India charges us 100 per cent tariffs, Trump asked, do we charge them nothing for the same goods? Trump was, however, barking up the wrong tree. The real problem with India’s trade policy lies in a seemingly innocent administrative procedure that doesn’t sound half as dangerous as tariffs. Most people operating in India today don’t complain about import taxes so much as they do about non-tariff barriers to trade. In particular, companies are flummoxed by a new weapon in the bureaucrats’ arsenal they call “Quality Control Orders.” QCOs are apparently innocuous demands that imports into India satisfy quality standards. In practice, however, they have become over the past two years an instrument to restrict imports and minimize competition. India’s commerce minister said in October that more than 700 have already been issued; he’s aiming for 2,500. They cover multiple goods — shoes, toys, steel, honey, chemicals. In private, officials say that something of the sort is vital to protect consumers from low-quality Chinese imports. In practice, however, the QCOs actually target imports from everyone else as well. And they are completely unpredictable: Companies complain that new varieties and specifications are often arbitrarily added to the list. Nor are the certifying authorities — usually the sleepy Bureau of Indian Standards — in any way ready to deal with a deluge of applications from domestic and foreign companies. They simply don’t have the capacity to keep up. If India actually wanted to protect consumers, then it would — like many other nations — simply exempt goods from this requirement that had cleared regulatory and quality barriers in tightly monitored markets such as the European Union. It would be hard for any official to claim with a straight face that India has higher and more rigorously applied standards than the EU. The absence of exemptions of this sort reveals that the real aim of QCOs is to control imports without doing anything as provocative (to Trump and others) as raising tariffs. Indian officials should know better. This country has had decades of experience with such import restrictions before liberalization took hold three decades ago. The inevitable consequences include inflation, the growth of monopolies, failing small businesses, and a collapse in productivity and competitiveness. Domestic industries are already beginning to point this out. Garment makers, for example, may be forced to use only local sources for their raw yarn or the chemicals with which they treat it. In effect, that would give some companies a monopoly and allow them to raise input prices limitlessly. The costs of complying with a QCO are so high, other sectors worry, that only the largest companies will be able to use imported goods in their value chain. And yet others point out that their supply chain has now been fragmented — engineering goods exporters, for example, no longer know whether the specialty steels they might need will be imported or held at the border for failing to comply with QCOs. “Thousands of containers” of imported steel, some from China, are stuck at Indian ports — each one representing a contract that a local manufacturer has failed to fulfil. QCOs are a classic example of an Indian specialty: self-harming policy, often produced with the best of intentions. The government knows that creating new jobs, particularly in manufacturing, must be its priority. That means nurturing small companies in the sectors that create a lot of jobs for every rupee spent. But the policies it chooses instead hurt labor-intensive sectors like garment and leather to protect big, capital-intensive firms such as steelmakers. Officials state that they know most new Indian jobs are created in petite firms; but they put into place policy that hurt them in order to protect larger ones. And finally, they wind up causing companies to limit their ambitions, and thus the size of their factories, to match the Indian market and not the entire world — after all, who can risk signing an export deal when the imports you need to fulfil that contract might get held up by some officious port administrator? Donald Trump needn’t worry that India’s trade policies are designed to benefit New Delhi at the expense of others. In fact, they’re set up to hurt us most of all. More From Bloomberg Opinion: This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners. Mihir Sharma is a Bloomberg Opinion columnist. A senior fellow at the Observer Research Foundation in New Delhi, he is author of “Restart: The Last Chance for the Indian Economy.” More stories like this are available on bloomberg.com/opinion ©2025 Bloomberg L.P.","url":"https://www.livemint.com/opinion/online-views/india-is-shooting-itself-in-the-foot-on-trade-again-11735769950632.html","image":"https://www.livemint.com/lm-img/img/2024/12/18/1600x900/opinion2_1734536366238_1734536388202.jpg","video":null,"publish_date":"2025-01-01 23:54:53","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.301},{"id":277627112,"title":"Driver in New Orleans 'act of terrorism' not 'solely responsible': FBI","text":"New Orleans [US], January 2 (ANI): The US Federal Bureau of Investigation (FBI) on Wednesday (local time) stated that it does not believe Shamsud Din Jabbar, the car driver who carried out the New Orleans attack, was \"solely responsible\" for the 'act of terrorism'.Jabbar rammed his car into a crowd on Bourbon Street during New Year's celebrations, killing 10 people and injuring 35 others.The suspect was found with an ISIS flag and multiple suspected explosive devices in the car while carrying out the attack, which the FBI has classified as \"an act of terrorism.\"Alethea Duncan, an assistant special agent in charge of the FBI's New Orleans field office, said the investigation is \"aggressively running down every lead, including those concerning Jabbar's known associates.\"\"That's why we need the public's help. We're asking if anybody has any interactions with Shamsud Din Jabbar in the last 72 hours that you contact us,\" she said during a news conference. \"The FBI is asking for the public's help. We're asking anyone who has information, video or pictures to provide it to the FBI,\" she added. Duncan also mentioned that an ISIS flag was found on the trailer hitch of the vehicle used by Jabbar. The FBI is working to determine Jabbar's \"potential associations and affiliations with terrorist organisations,\" she said.The FBI has identified Shamsud Din Jabbar as a US citizen from Texas, and officials confirmed he had previously served in the US Military, according to a CNN report.In a statement on X, the FBI wrote, \"This morning, an individual drove a car into a crowd of people on Bourbon Street in New Orleans, killing a number of people and injuring dozens of others. The subject then engaged with local law enforcement and is now deceased. The FBI is the lead investigative agency, and we are working with our partners to investigate this as an act of terrorism.\"Meanwhile, US President Joe Biden condemned the attack, saying, \"There is no justification for violence of any kind, and we will not tolerate any attack on any of our nation's communities.\"Earlier, President-elect Donald Trump reignited the debate over immigration and crime following the car-ramming incident, blaming Democrats for dismissing his warnings about criminal migration into the US.Democrats for dismissing his warnings about criminal migration into the US.In a post on Truth Social, Trump said, \"When I said that the criminals coming in are far worse than the criminals we have in our country, that statement was constantly refuted by Democrats and the Fake News Media, but it turned out to be true. The crime rate in our country is at a level that nobody has ever seen before. Our hearts are with all of the innocent victims and their loved ones, including the brave officers of the New Orleans Police Department. The Trump Administration will fully support the City of New Orleans as they investigate and recover from this act of pure evil!\" (ANI)","url":"https://aninews.in/news/world/us/driver-in-new-orleans-act-of-terrorism-not-solely-responsible-fbi20250102025525","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20250101205646.jpg","video":null,"publish_date":"2025-01-01 23:53:52","author":null,"language":"en","source_country":"in","sentiment":-0.584},{"id":277627100,"title":"Las Vegas: Electric vehicle explodes outside Trump International Hotel","text":"Las Vegas [US], January 2 (ANI): An electric vehicle caught fire outside the Trump International Hotel in Las Vegas on Wednesday (local time), according to officials and videos on social media. The vehicle appeared to be a Tesla Cybertruck, though local officials had not yet confirmed the car's make or the cause of the fire.The Clark County Fire Department confirmed that it responded to a vehicle fire in the valet area of the Trump International Hotel at approximately 8:40 am local time.Donald Trump's son, Eric Trump, also reported the vehicle fire on X.\n\nEarlier today, a reported electric vehicle fire occurred in the porte cochère of Trump Las Vegas. The safety and well-being of our guests and staff remain our top priority. We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their…— Eric Trump (@EricTrump) January 1, 2025\n\n\"Earlier today, a reported electric vehicle fire occurred in the porte cochere of Trump Las Vegas. The safety and well-being of our guests and staff remain our top priority. We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their swift response and professionlism,\" Eric Trump wrote on X. (ANI)","url":"https://aninews.in/news/world/us/las-vegas-electric-vehicle-explodes-outside-trump-international-hotel20250102033131","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20250101214924.jpg","video":null,"publish_date":"2025-01-01 23:53:52","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.22},{"id":277627430,"title":"Nippon Steel reportedly negotiating directly with White House in quest to purchase US Steel","text":"Nippon Steel continues to push for presidential support of its proposed $14.9 billion purchase of U.S. Steel, despite concerns that such a deal could lower American steel production and create a national security threat.\n\nNippon Steel is now negotiating directly with the White House to save the imperiled takeover as President Joe Biden is due to make a final decision by Tuesday, according to a letter obtained by the Washington Post.\n\nThe Japanese steelmaker offered a 10-year guarantee to not reduce production capacity at U.S. Steel’s mills in Pennsylvania, Indiana, Alabama, Texas, California and Arkansas without approval from the federal agencies that vet foreign transactions for national security — essentially giving the U.S. government veto power over any steelmaking reductions.\n\nThe proposal comes after the Committee on Foreign Investment in the United States left the final decision to Biden last week. The federal panel — created to screen deals for national security risks and deliver a recommendation to the president — deadlocked over its review of the year-old proposed sale after it could not resolve concerns that Nippon’s acquisition could harm domestic production.\n\nRichard Tikey, vice president of the USW local in Clairton, told the Post-Gazette he asked for a 10-year plan in meetings with union chief David McCall and Nippon executive Takahiro Mori, seeking the kind of staggered investment that “gives people light at the end of the table and job security.”\n\nBiden has long opposed the deal, siding with United Steelworkers International President David McCall, even as many union members have come out in support of the deal.\n\nMany experts in Washington believed Nippon could adequately address any national security concerns, but the latest salvo shows the Japanese company’s firmest commitments to date.\n\nBiden’s review of the promises could potentially push a final decision to the Trump administration, the Post reported, citing anonymous sources. Analysts and investors told the Post-Gazette Tuesday it wasn’t immediately clear why the deliberations would need to last that long.\n\nPresident-elect Donald Trump also opposes the deal and has vowed to block it as president.\n\nLocally, though, support is stronger. U.S Steel has warned that thousands of jobs could be lost if the deal falls through, and that the company may move its headquarters out of Pittsburgh.\n\nLast week, a group of 20 local mayors from communities impacted by U.S. Steel’s presence wrote directly to Biden, singling out McCall for “his refusal to negotiate in good faith on this transaction,” according to a copy of the letter shared with the Post-Gazette.\n\n“Each of us believes deeply in the importance of union labor, but USW leadership is currently playing games at a time when they should be listening to and acting on behalf of their members,” the mayors wrote. Signatories included mayors from Braddock, Glassport, Homestead, Clairton, Jefferson Hills, Munhall, Turtle Creek and other Mon Valley municipalities.","summary":"Nippon Steel continues to push for presidential support of its proposed $14.9 billion purchase of U.S. Steel, despite concerns that such a deal could lower American steel production and create a national security threat.","url":"https://www.bostonherald.com/2025/01/01/nippon-steel-reportedly-negotiating-directly-with-white-house-in-quest-to-purchase-us-steel/","image":"https://www.bostonherald.com/wp-content/uploads/2025/01/nippon-steel.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-01 23:42:32","author":"Pittsburgh Post-Gazette","authors":["Pittsburgh Post-Gazette"],"language":"en","category":"politics","source_country":"US","sentiment":-0.065},{"id":277626832,"title":"Tesla Cybertruck explodes outside Trump hotel, Elon Musk blames fireworks","text":"A Tesla Cybertruck has exploded outside the Trump International Hotel Las Vegas, killing at least one occupant and injuring several members of the public.\n\nThe Las Vegas Metropolitan Police Department (LVMPD) first announced it had received reports of a fire at the entrance to the building shortly before 8:40am on January 1, before later confirming the Tesla Cybertruck had exploded.\n\nVision uploaded by https://x.com/kaaaassuu/status/1874506594425381133 (formerly Twitter) user ‘@kaaaassuu’ shows the Cybertruck’s cabin on fire outside the hotel lobby, claiming “it first looked like fireworks”.\n\n100s of new car deals are available through CarExpert right now. Get the experts on your side and score a great deal. Browse now.\n\n Cybertruck blew up in front of Trump hotel in Las Vegas. Those are our luggage by the door and that’s where we were when it happened. pic.twitter.com/KaVZXfGLNK— ayackle (@kaaaassuu) \n January 1, 2025\n\nTesla CEO Elon Musk took to social media platform https://x.com/elonmusk/status/1874558969802547611 (which he owns) to confirm the company was looking into reports that the fire and explosion had been started by fireworks in the electric pickup.\n\nThe executive https://x.com/elonmusk/status/1874579547452269054: “We have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself. All vehicle telemetry was positive at the time of the explosion.”\n\nIn an https://x.com/LVMPD/status/1874572577500516778, Sheriff Kevin McMahill said the LVMPD was investigating “a number of leads” about the identity of the occupant, however “there does not appear to be any further threat to our community (Las Vegas) now.”\n\n UPDATE ON CYBER TRUCK EXPLOSIONSheriff Kevin McMahill provided an initial briefing regarding the explosion of a Cyber Truck in front of Trump Tower in Las Vegas this morning.Key details:– At approximately 8:40 a.m., reports were received of a vehicle explosion.– One person… https://t.co/woCvwR1Qvq pic.twitter.com/BLf5jQsRzm— LVMPD (@LVMPD) \n January 1, 2025\n\nThe explosion comes less than two months after Donald Trump, who part-owns the Trump International Hotel Las Vegas, was reelected as US President. He is due to be inaugurated on January 20.\n\nPresident-elect Trump received the support of Mr Musk in the lead-up to the November election, and the Tesla CEO has been appointed as co-head of the new Department of Government Efficiency.\n\nWhile some have criticised electric vehicles as fire-prone, EV FireSafe, an Australian company which collates global vehicle fire data, has found there have been 511 reported incidents of thermal runaway in EV and plug-in hybrid vehicle (PHEV) batteries worldwide between 2010 and the end of June 2024.","summary":"Tesla CEO Elon Musk says a Cybertruck electric pickup explosion outside the Trump International Hotel Las Vegas was caused by fireworks.","url":"https://thewest.com.au/lifestyle/motoring/tesla-cybertruck-explodes-outside-trump-hotel-elon-musk-blames-fireworks-c-17260842","image":"https://images.thewest.com.au/publication/C-17260842/78431c1b7c503ede5e71d9c1624dc7f78dba10e6-16x9-x0y64w1219h686.png?imwidth=1200","video":null,"publish_date":"2025-01-01 23:42:20","author":"Jordan Mulach,Jordan Mulachcarex","authors":["Jordan Mulach","Jordan Mulachcarex"],"language":"en","source_country":"au","sentiment":-0.571},{"id":277626802,"title":"Musk's 'Kekius Maximus' avatar on X ups memecoin value, sparks online frenzy","text":"WASHINGTON: Elon Musk adopted the moniker \"Kekius Maximus\" on X Tuesday, sparking speculation among his 210 million followers about his mysterious new handle that is a mash-up of an alt-right symbol, a memecoin, and the lead character of the movie \"Gladiator\". Musk, the CEO of Tesla and SpaceX and a confidant of US Prez-elect Donald Trump, also replaced his profile picture with one of \"Pepe the Frog\", a popular cartoon, wearing ancient Roman attire and holding a video game joystick.In typical Musk fashion, the billionaire tech mogul and owner of X offered no explanation about the new username and avatar, but the move triggered immediate ripple effects, sending the value of a memecoin - a digital currency inspired by an internet meme - with the same name skyrocketing. Memecoin Kekius Maximus's value soared by more than 900% as of Tuesday evening. It was not immediately clear if he has any involvement in the memecoin.It also sent internet sleuths hunting for answers: Was it just for the laughs? Or was there a hidden message? His new handle appears to be a blend of \"Maximus Decimus Meridius\" - a Roman general played by Russell Crowe in the 2000 smash hit \"Gladiator\" - and \"kek\", popular among the alt-right trolls that is used as a variation of \"LOL\". \"Kek\" is also a reference to a \"virtual white nationalist god\". Also, \"Pepe the Frog\" became associated with alt-right and white supremacists during Trump's first prez campaign.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/musks-kekius-maximus-avatar-on-x-ups-memecoin-value-sparks-online-frenzy/articleshow/116867453.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116867474/116867474.jpg","video":null,"publish_date":"2025-01-01 23:40:28","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.116},{"id":277630442,"title":"New black box data may reveal cause of South Korea air crash","text":"Grieving relatives of the victims of the South Korea plane crash have gathered at the site to pay respects to their loved ones on New Year's Day, after officials said they had extracted data from one of the retrieved black boxes to find the exact cause of the crash.\n\nAll but two of the 181 passengers and crew on board the Boeing 737-800 operated by Jeju Air died when it crashed at Muan International Airport, in southern South Korea, on Sunday.\n\nVideo showed the aircraft without its landing gear deployed landing on its belly at high speed and then skidding off the end of the runaway into a concrete fence and bursting into flames.\n\nREAD MORE: What we know about the New Orleans vehicle that killed at least 15﻿\n\nThe footage showed the plane was experiencing an apparent engine problem in addition to the landing gear malfunction.\n\nInvestigators say the pilot received a warning from air traffic controllers of possible bird strikes and the plane issued a distress signal before the crash.\n\nThe Transport Ministry said in a statement yesterday that it has completed works to extract data from the cockpit voice recorder — one of the two black boxes recovered from the wreckage.\n\nIt said the data would be converted into audio files. \n\nA damaged flight data recorder will be sent to the United States for an analysis, the ministry added.\n\nREAD MORE: Man arrested after woman dies falling from high-rise unit\n\nAll of the victims were South Korean, except for two Thai nationals, with many returning from Bangkok after Christmas holidays.\n\nThe bereaved families visited the site yesterday for the first time since the crash for an emotional memorial service.\n\nThey were bused to the site where they took turns laying white flowers. \n\nMany knelt and bowed deeply before a memorial table laid with food, including \"ddeokguk,\" a Korean rice cake soup eaten on New Year's Day.\n\nThe Transport Ministry said authorities have completed the complicated process of identifying all 179 victims.\n\nIt said the government has so far handed over 11 bodies to relatives.\n\nREAD MORE: The pastime linking Donald Trump to 16 other US presidents\n\nThe country is observing seven days of national mourning following the deadliest disaster in South Korea's aviation history in decades.\n\nThe government has begun safety inspections of all 101 Boeing 737-800s operated by the country's domestic airlines. \n\nOn Tuesday, a team of US investigators, including representatives from Boeing, examined the crash site.\n\nOfficials have said they will consider whether the airport's localiser — a set of antennas housed in a concrete fence at the end of the runway designed to guide aircraft during landings — should have been constructed with lighter materials that would break more easily upon impact.","summary":"All but two of the 181 people on board the Jeju Air flight died when it crashed on Sunday.","url":"https://www.9news.com.au/world/south-korea-air-crash-investigators-extract-black-box-data-as-grieving-families-mourn-the-victims/9f56403d-c81c-4b12-9899-d7a2dd365be9","image":"https://imageresizer.static9.net.au/bEA8oFwfXjwn0y1y7lzSnm0Yd_Q=/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fdc425d1d-d757-47fa-a6d3-1bcea8c0db15","video":null,"publish_date":"2025-01-01 23:40:09","author":"9News,Associated Press","authors":["9News","Associated Press"],"language":"en","source_country":"au","sentiment":-0.359},{"id":277629430,"title":"Tesla Cybertruck Explosion Outside Trump Hotel Kills One Person","text":"The trucks used in both incidents, however, were rented from the same company.\n\nFollowing the deadly event, Tesla CEO Elon Musk said that the electric car company investigated the situation and that the explosion was not a result of a faulty vehicle.\n\n“We have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck,” he wrote in a post to X, “and is unrelated to the vehicle itself.”\n\nPresident-elect Donald Trump’s son Eric Trump also shared a statement from the Trump Organization, acknowledging the events and thanking law enforcement for their work.\n\n“The safety and well-being of our guests and staff remain our top priority,” the statement posted X read. “We extend our heartfelt gratitude to the Las Vegas Fire Department and local law enforcement for their swift response and professionalism.”\n\n(E! and NBC News are both part of the NBCUniversal family.)","summary":"Authorities in Las Vegas are investigating a deadly incident along the city’s famed Strip.\nThe Jan. 1 event, which killed one and minorly injured seven bystanders, involved an explosion of a Tesla...","url":"https://www.eonline.com/news/1411681/tesla-cybertruck-explosion-outside-trump-hotel-kills-one-person?cmpid=rss-syndicate-genericrss-us-top_stories","image":"https://akns-images.eonline.com/eol_images/Entire_Site/202501/cr_1200x1200-250101151411-GettyImages-2173673829.jpg?fit=around%7C1200:1200&output-quality=90&crop=1200:1200;center,top","video":null,"publish_date":"2025-01-01 23:36:41","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":277624538,"title":"Have a good feeling about 2025': Elon Musk at New Year's Eve gala hosted by Donald Trump","text":"At the New Year's Eve gala hosted by US President-elect Donald Trump and incoming First Lady Melania Trump at Mar-a-Lago in Palm Beach, Florida, Tesla CEO Elon Musk shared an optimistic outlook for the coming year. Taking to X, Musk posted a photo from the event, accompanied by the caption, \"I have a good feeling about 2025.\" I have a good feeling about 2025 pic.twitter.com/LLgTEkpNdP — Kekius Maximus (@elonmusk) January 1, 2025 Meanwhile, the Trump campaign on X shared pictures of the New Year's Eve gala event. HAPPY NEW YEAR! 2025 MARKS THE BEGINNING OF AMERICA’S GOLDEN AGE! pic.twitter.com/u9RnfOLYnW — Team Trump (Text TRUMP to 88022) (@TeamTrump) January 1, 2025 On being asked by the reporter about new year resolutions, Trump said, \"I just want everybody to be happy, healthy, and well.\" In recent times, Trump and Musk have emerged as supporters of each other. A day earlier, Trump had expressed his support to entrepreneur and aide Elon Musk, over his statements on the contributions of immigrants to the United States. Musk had emphasised the value of hard-working individuals from all races, creeds, and nationalities who have contributed to the nation, urging Americans to preserve the country's identity as a land of freedom and opportunity. Musk in a post stated, \"Anyone of any race, creed or nationality - who came to America and worked like hell to contribute to this country will forever have my respect. America is the land of freedom and opportunity. Fight with every fiber of your being to keep it that way!\" Showing his support for Musk, the President-elect reposted the Tesla CEO's post on his social media platform Truth Social.Earlier, Trump had expressed his support for the H-1B visa programme and acknowledged frequently using it for his own properties, calling it a \"great programme,\" according to a report by the New York Post. Calling it a \"great programme,\" the President-elect said he has \"always\" been in its favour.\"I've always liked the visas, I have always been in favour of the visas. That's why we have them,\" Trump said in a telephonic interview with the New York Post. He added, \"I have many H-1B visas on my properties. I've been a believer in H-1B. I have used it many times. It's a great programme.\" Trump's remarks on H-1B visas came after a major divide emerged within his MAGA team in the United States, as Elon Musk and Vivek Ramaswamy who advocated for the expansion of the visa program for 'highly skilled workers' faced heavy backlash from within the President-elect's base. Except for the headline, the story has not been edited by DNA staff and is published from ANI","url":"https://www.dnaindia.com/world/report-have-a-good-feeling-about-2025-elon-musk-at-new-year-s-eve-gala-hosted-by-donald-trump-3125122","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/01/2669635-ani-20250101074804-1.jpg","video":null,"publish_date":"2025-01-01 23:33:53","author":"Meemansa Shekhawat","authors":["Meemansa Shekhawat"],"language":"en","source_country":"in","sentiment":0.331},{"id":277624496,"title":"I didn’t change my mind but...': Donald Trump on supporting Elon Musk's H-1B visa remark","text":"Former U.S. President Donald Trump confirmed his plans to attend the state funeral of Jimmy Carter, the former U.S. president who passed away on Sunday at the age of 100. The funeral is scheduled for January 9 at the National Cathedral in Washington, D.C. Trump announced a New Year’s Eve party held at his Mar-a-Lago estate in Florida. When asked by a reporter if he had spoken to any members of the Carter family since Carter’s death, Trump declined to comment but stated, “We were invited.” The lavish black-tie gala, attended by high-profile figures like billionaire tech CEO Elon Musk and Senator Ted Cruz, also saw Trump addressing other pressing political topics. One of the main issues discussed was the upcoming vote for the Speaker of the House. Trump reiterated his support for House Speaker Mike Johnson, expressing confidence in Johnson’s ability to secure re-election. The vote, set to take place on Friday following the swearing-in of the new Congress, comes amidst uncertainty over Johnson’s standing within the Republican Party. In December, 34 Republicans voted against Johnson’s stopgap funding bill, raising doubts about his re-election prospects. However, Trump remains optimistic, stating, “I think they’ll support Speaker Johnson. He’s the one that can win right now. Almost everybody likes him.” Trump also addressed questions regarding his stance on the H-1B visa program, which allows companies to bring skilled foreign workers to the U.S. Historically critical of the program, Trump recently sided with Elon Musk in defending it. Musk had called the program vital for importing top talent, sparking a public debate. Trump clarified his position, saying, “I didn’t change my mind. We need smart people coming into our country, and we need a lot of people coming in. We are going to have jobs like we’ve never had before.” The event highlighted Trump’s influence in Republican politics as well as his ongoing role in shaping national discussions.","url":"https://www.dnaindia.com/world/report-i-didn-t-change-my-mind-but-donald-trump-on-supporting-elon-musk-s-h-1b-visa-remark-3125128","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2025/01/01/2669642-image-2025-01-01t153640.857.jpg","video":null,"publish_date":"2025-01-01 23:33:53","author":"Pravrajya Suruchi","authors":["Pravrajya Suruchi"],"language":"en","category":"politics","source_country":"in","sentiment":0.049},{"id":277623752,"title":"From Chaos To Clarity: Leadership Strategies For 2025","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nFrom Chaos to Clarity: Leadership Strategies for 2025.\nFreedomz - stock.adobe.com\n\nGreat leaders are born in times of unprecedented change, and 2024 was all about disruption. From President-elect Donald Trump’s return in the U.S. to advances in Africa’s fintech and renewable energy fields, the world experienced tectonic shifts throughout industries, economics, and societies. The fall of the regime of the Syrian president, Bashar al-Assad, the exit of Pat Gelsinger, the chief executive of Intel, health issues in the British royal family, and the rise of artificial intelligence made the task of global leaders even more daunting. Countries across the Asia region were buffeted by economic turbulence shaped by inflation, changes in trade dynamics, and reconfigurations of supply chains, while high interest rates presented major headwinds as leaders in the region steered their way through an increasingly unpredictable global landscape.\n\nIt’s human to wait and see in uncertain times. But great leaders don’t stand on the sidelines—they enter the arena, cut through chaos, and make bold decisions. Their greatest weapon is reflection, allowing them to transform challenges into a sense of purpose and uncertainty into opportunity.\n\nHow will you rise above the noise and plot your path forward in 2025? The 5 Ds framework—Dream, Drive, Dare, Develop, and Deliver—provides a path through complexity and a way to inspire action. Here’s how to use them as your blueprint for success this year.\n\nThe 5Ds Leadership Strategies for 2025_DR Richard Osibanjo\nDr. Richard Osibanjo\n\n#1 Dream: Create a Values-Based Vision\n\nEvery successful leadership strategy begins with a dream—a vision that inspires the head, touches the heart, and moves the hand to action. In today’s polarized world, populist values and societal expectations often clash; leaders must ensure their dreams are rooted in purpose, inclusivity, and shared values.\n\nMORE FOR YOU\n\nNew Orleans Truck Attack Suspect Identified As Shamsud-Din Jabbar—Here’s What We Know About Him\n\nNew Orleans Truck Attack: Sugar Bowl Postponed, FBI Believes Suspect Wasn’t ‘Solely Responsible’ (Live Updates)\n\nApple Watch Series 10 Price Slashed To All-Time Low In New Sale\n\nA compelling dream should express organizational ambition, contributions to society, and employee aspirations. Today’s workforce seeks meaningful work that aligns with their values, and society needs businesses to address issues like equity, sustainability, and climate change.\n\nCrafting a vision that inspires in 2025:\n\nRun on Collective Values: Establish values that reflect the diversity of stakeholders and let them guide decisions during uncertainty.\n\nIntegrate Employee Aspirations: Create opportunities for employees to align their personal goals with organizational objectives, fostering engagement and loyalty.\n\nChampion Societal Impact: Position your organization as a force for good by leading with a dream framed as a solution to global challenges\n\nLeadership Reflection: Think beyond the balance sheet. Does your vision align with your core values and inspire your team and stakeholders?\n\n#2 Drive: Do Only What’s Necessary\n\nWithout action, dreams are nothing more than ideas. Drive is the disciplined determination to manifest your vision into reality. In a world of competing priorities, the key to success is to concentrate on the initiatives that will make the biggest difference. Drive is not about doing more—it's about doing your best work. Smart leaders prioritize purpose-aligned initiatives that balance short- and long-term needs.\n\nHow to channel your energy to what matters most in 2025:\n\nIn his book, “The Four Disciplines of Execution,” Franklin Covey recommends identifying the one initiative you can prioritize that would have the largest impact on your team, organization, and stakeholders.\n\nBreak it into actionable steps and track progress regularly.\n\nHold periodic learning sessions to identify what is working well, what can be optimized, and communicate learnings, next steps, and owners broadly.\n\nLeadership Reflection: What is the high-impact goal you can commit to this year? Align resources and focus on achieving it.\n\n#3 Dare: Inspire Bold Action with Courage\n\nDue to the fear of failure or backlash, many leaders shy away from taking bold actions. This often leads to conservative choices that have minimal transformational effects. It takes courage to lead people who can make independent decisions; thus, it is necessary to find the balance of calculated risk, learn what does and doesn’t work, and foster a culture that encourages interpersonal risk-taking.\n\nHow to Be a More Courageous Leader in 2025:\n\nDecide with Values: Make bold choices that align with organizational values, ensuring clarity and trust.\n\nRedefine Failure: According to Dr. A.P.J. Abdul Kalam, India's 11th President, F.A.I.L. is just “First Attempt In Learning.” Nobody becomes great on their first try. Learn, adapt, and keep going. View failure as a learning opportunity and foster a culture where risks are encouraged.\n\nBe Agile: Run big ideas on a smaller scale to reduce risks and gain confidence.\n\nCultivate a Recognition Culture: Celebrate those who take risks and try new things regardless of the outcome.\n\nBe Transparent: Employees should trust their leaders to prompt action. Establish trust through a high say-do ratio. Say what you know, acknowledge what you don't, and let employees know when you cannot share specific information.\n\nLeadership Reflection: You only become courageous by doing. This quarter, what is one bold action you can take that moves you closer to your vision and aligns with your values?\n\n4. Develop: Invest in Your People and Yourself\n\nYou may not be able to solve the world’s problems, but you can take action closer to home. Leaders often say, “Employees are our greatest assets,” but they rarely walk the talk when it comes to developing them. Cutting development budgets may lead to short-term savings, but the long-term implications — disengagement, high turnover, and stunted innovation — are much more costly. By contrast, when you invest in employee growth, you build loyalty, strengthen performance, and foster innovation. This commitment to growth and development prepares organizations to be agile and flourish in a fast-evolving world.\n\nImportance of Employee Development in 2025:\n\nEngagement and Retention: Employees who see opportunities for growth in your organization will be more inclined to stay and contribute positively towards the organization's mission.\n\nResilience: A well-developed workforce is better equipped to tackle challenges and drive innovation.\n\nTalent Attraction: Companies that invest in their people have the potential to attract top talent, which is a differentiator in competitive markets.\n\nAchieving Development in 2025: 4 Strategies for Leaders:\n\nAlign Growth with Strategy: Work on skills and opportunities that create a win-win for employees and organizational OKRs.\n\nWaterfall Resources: Granted, maybe you are on a budget. So, invest in your next-generation leaders with a level of responsibility on their part so that they develop the next team behind them.\n\nCreate Growth Pathways: Offer stretch assignments, cross-functional roles, and mentorship programs to your employees.\n\nRole Model Learning: Show enthusiasm and pursue your learning to inspire your team to do the same.\n\nLeadership Reflection: Are you creating growth opportunities or focusing solely on short-term gains?\n\n5. Deliver: Leverage Crisis to Deliver Tangible Impact\n\nThe last of the 5 Ds is delivering results. This converges vision, drive, bold action, and development into something substantive. It’s not just about numbers; it is about promises kept, the value created, and the legacy left behind.\n\nFor Leaders: Translating Vision into Impact in 2025:\n\n· Ensure that goals align with business objectives—be aggressive in preventing scope creep.\n\nShare good news promptly, celebrate milestones, and connect the dots with employees to the overall vision\n\nDon’t shoot the messenger; foster a culture where bad news is delivered promptly, not sugar-coated, and is rewarded.\n\nLeadership Reflection: How can success in your organization not just be measured by metrics but by the positive impact created for employees, customers, and society?\n\nLeadership Strategy for 2025\n\nThe 5 Ds: dream, drive, dare, develop, and deliver are a roadmap leaders can follow as they navigate 2025 and beyond, balancing mission with vision, and purpose with performance. A leader’s dream must be more than aspirational; it must be grounded in values that unite employees and stakeholders, inspire societal contributions, and drive meaningful change.\n\nCheers to 2025, where leaders embrace challenges, bring clarity to chaos and shape a future with purpose and impact.\n\nFollow me on Twitter or LinkedIn. Check out my website. \n\nDr. Richard Osibanjo\n\nEditorial Standards\n\nForbes Accolades","summary":"It’s natural to take a wait-and-see approach during uncertainty. Reflection is a great tool for transforming challenges into direction and uncertainty into opportunity.","url":"https://www.forbes.com/sites/richardosibanjo/2025/01/01/from-chaos-to-clarity-leadership-strategies-for-2025/","image":"https://imageio.forbes.com/specials-images/imageserve/677590af02641e08fdda1348/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-01 23:26:40","author":"Contributor,Dr. Richard Osibanjo","authors":["Contributor","Dr. Richard Osibanjo"],"language":"en","category":"politics","source_country":"US","sentiment":0.619},{"id":277623432,"title":"Mitch McConnell’s legacy: A ‘grim reaper’ for US bipartisanship?","text":"A new United States Congress convenes in Washington, DC, on January 3. But for the first time in 18 years, a key Republican leader will no longer be at the helm: Senator Mitch McConnell.\n\nSince 2007, McConnell has served as head of the Republican Party in the Senate, steering members of his caucus through four different presidencies and countless legislative hurdles.\n\nExperts say his tenure as the Senate’s longest-serving party leader will ultimately be remembered as an inflexion point for Republicans and Congress as a whole.\n\nUnder McConnell, US politics moved away from the back-slappers and consensus-builders of earlier eras. Instead, McConnell helped to usher in a period of norm-breaking, hyper-partisan politics that paved the way for figures like incoming President Donald Trump, the leader of the Make America Great Again (MAGA) movement.\n\n“First and foremost, he extended a trend in minority obstruction in the Senate,” Steven S Smith, professor emeritus of political science at Washington University in St Louis, told Al Jazeera.\n\nSmith pointed out that McConnell led a Republican majority for only six of his 18 years as Senate leader. The rest of his tenure has been spent mobilising a minority in the 100-seat Senate to disrupt the agenda of the rival Democratic Party.\n\n“Second, he will be known for deepening partisan polarisation in the Senate,” Smith said. “While McConnell is not a conservative or MAGA extremist by today’s standards, he was a deeply partisan leader.”\n\nDespite his commitment to the Republican Party, some see McConnell as a potential bulwark to figures like Trump, with whom he has clashed in the past.\n\nThough he is stepping down as party leader, McConnell intends to remain in the Senate for the remainder of his six-year term. But the extent to which McConnell will act as a check on Trump’s ambitious second-term agenda remains to be seen.\n\n“I’d be very surprised to see him be provocative in a public way. His influence is going underground,” Al Cross, a veteran reporter and columnist who covered McConnell’s tenure, told Al Jazeera.\n\n‘I usually play the villain’\n\nMcConnell has led a long and storied career in the Senate. In 1984, he made his first bid for a seat in the chamber, ousting an incumbent Democrat.\n\nHe has remained undefeated ever since. In 2020, he won his seventh straight term.\n\nHis ascent to the top of the Senate came without significant opposition. The 2007 retirement of the previous Senate Republican leader, Bill Frist, left the position vacant.\n\nBut even from his first days as a Senate leader, McConnell cultivated a reputation as a hardliner and obstructionist.\n\nDuring his first year as Republican leader, The New York Times described him as operating with “near-robotic efficiency” to smack down Democratic policies, despite leading a minority in the Senate.\n\n“Mr McConnell and his fellow Republicans are playing such tight defense, blocking nearly every bill proposed by the slim Democratic majority that they are increasingly able to dictate what they want,” reporter David Herszenhorn wrote.\n\nMcConnell quickly embraced his visibility as a partisan warrior, a self-described “grim reaper” for progressive proposals.\n\nOne editorial column nicknamed him “Senator No” for his refusal to work across the aisle. McConnell himself greeted reporters once by saying, “Darth Vader has arrived.”\n\n“Over the three decades I have been a US Senator, I’ve been the subject of many profiles,” McConnell wrote in the opening lines of his 2016 memoir. “I usually play the villain.”\n\nSmith, the Washington University professor, described McConnell as sparking a “transformation” in the Senate as a result of his hardline approach.\n\nBefore McConnell’s leadership, Smith said the Senate only saw “occasional minority obstruction”. But afterwards, the chamber became known in political circles as the “60-vote Senate”.\n\nThat nickname is a reference to the 60 votes required to overcome a minority obstruction, otherwise known as a filibuster.\n\nUnder McConnell, Smith explained, “acting on legislation of any importance would face minority obstruction and require 60 votes for cloture”.\n\nBending norms\n\nOne of McConnell’s most divisive moments came in 2016, with the death of Supreme Court Justice Antonin Scalia.\n\nNormally, when a justice dies, the sitting president is entitled to nominate a replacement. But Scalia’s death came 11 months before a pivotal presidential election. And the president at the time, Democrat Barack Obama, was nearing the end of his final term.\n\nMcConnell made a stunning — and swift — political gamble. Within hours of Scalia’s death, the Republican leader announced he would refuse to call a vote to confirm Obama’s chosen replacement.\n\n“The American people should have a voice in the selection of their next Supreme Court Justice. Therefore, this vacancy should not be filled until we have a new president,” McConnell said in a statement.\n\nLeft-leaning publications like The Nation decried McConnell’s decision as an assault on the US Constitution. “This refusal exploded norms,” journalist Alec MacGillis wrote in the publication ProPublica.\n\nBut McConnell’s gambit shifted the balance of power on the court for generations to come.\n\nThat November, US voters elected Trump — a political newcomer — to his first term in the White House, setting the stage for more shifts in Washington norms.\n\nTrump ultimately nominated three right-wing justices to the Supreme Court, including one to replace Scalia. That cemented a conservative super-majority on the bench, anticipated to mould US law for generations to come.\n\nTrump later credited McConnell as his “ace in the hole” and “partner”.\n\n“Mitch recognized, as did I, that since judges enjoy life tenure, the impact of judicial nominations can be felt for thirty years or more,” Trump wrote in a forward to McConnell’s memoir. “Transforming the federal judiciary is the ultimate long game!”\n\nA Trump rivalry\n\nBut in the lead-up to a new and emboldened Trump administration in 2025, McConnell has increasingly spoken out against the president-elect and his isolationist “America First” platform.\n\nThe two Republican leaders have repeatedly butted heads, and their relationship is notably frosty.\n\nTrump has openly called McConnell an “old crow” and vilified his “China-loving wife” Elaine Chao, a slap at her Asian heritage.\n\nMcConnell, meanwhile, has countered with his own fighting words, implying parallels between Trump and isolationism in the 1930s.\n\n“We’re in a very, very dangerous world right now, reminiscent of before World War II,” McConnell told the Financial Times in December. “Even the slogan is the same. ‘America First.’ That was what they said in the ’30s.”\n\nUpon vacating his leadership post in January, McConnell is expected to take on the role of chairman of the Senate Appropriations Subcommittee on Defense.\n\nIn his new position, he is likely to advocate for strengthening the US military to counter threats from adversaries like Russia, Iran and China.\n\nYet at age 82, with health challenges including a recent fall, experts say McConnell is unlikely to offer much resistance to the incoming Trump administration.\n\n“Since Senator McConnell is out of his leadership position and given his physical frailty, I am not expecting much in the way of sustained opposition from him,” Harvard University political scientist Daniel Ziblatt told Al Jazeera.\n\n“It is possible he may cast a dissenting vote here or there that might make a difference. But his track record doesn’t leave me holding my breath.”\n\nNo greater institutionalist\n\nStill, Herbert Weisberg, a professor of political science at The Ohio State University, anticipates that McConnell may act as an occasional dissenting voice, particularly as the Senate weighs some of Trump’s controversial nominees for high-level government posts.\n\n“He’d normally want to defer to a Republican president on appointees, but he’ll be cautious on the unusual Trump nominees. He might be willing to vote against a few, but not all of them,” Weisberg told Al Jazeera.\n\nAlready, McConnell — a childhood polio survivor — issued a public warning to incoming administration officials to “steer clear of” efforts “to undermine public confidence” in “proven cures”, lest they scuttle their Senate confirmation hearings.\n\nThe statement came immediately after Trump health nominee Robert F Kennedy Jr was linked to an effort to revoke approval for the polio vaccine in The New York Times.\n\nBut a single Republican is unlikely to stall a nomination or piece of legislation, as Steven Okun, an analyst on US politics, government and trade, pointed out.\n\nRepublicans hold a 53-person majority in the incoming Senate. And many in the party are firmly behind Trump’s leadership.\n\nAssuming a united Democratic opposition, “four Republican senators would be needed to stop anything a future President Trump puts forth to the Senate,” Okun explained.\n\nMcConnell, Okun added, is unlikely to take on the role of dissenter — “only when Donald Trump pursues the most aggressive actions which would run counter to the US national interest”.\n\nAfter all, party loyalty has been a key tenet of McConnell’s leadership. And experts like Cross, the journalist, believe McConnell won’t want to miss an opportunity to use the power of the Senate to shape presidential policy.\n\n“I can’t think of any greater institutionalist than Mitch McConnell,” Cross said. “He loves the Senate, it’s what he’s aspired to. He doesn’t want to give up its role in advice and consent.”","url":"https://stluciachronicle.com/mitch-mcconnells-legacy-a-grim-reaper-for-us-bipartisanship/","image":"https://stluciachronicle.com/app/uploads/2024/12/AP24352611162273-1734806556-SlfJ0J.jpeg","video":null,"publish_date":"2025-01-01 23:24:51","author":null,"language":"en","category":"politics","source_country":"lu","sentiment":0.133},{"id":277622222,"title":"Terrorist’s $27k email to ex-wife revealed","text":"Shamsud Din Jabbar, a US citizen from Texas and an Army veteran, is accused of carrying out the attack in the French Quarter that killed at least 10 people and wounding more than 35. Officials said an ISIS flag was found in the vehicle and that the 42-year-old might not have been acting alone.\n\nChilling details about suspect emerge\n\nJabbar, who officials confirmed was honourably discharged from the US Army, had converted to Islam at some point, according to Dwayne Marsh, who is married to Mr. Jabbar’s ex-wife Nakedra Charrlle. \n\nJabbar and Ms Charrlle had two daughters, ages 15 and 20, Mr Marsh told theNew York Times, adding that “the girls are a mess” after the attack.\n\nIn recent months, he said, Jabbar had been acting erratically, “being all crazy, cutting his hair” after converting. Mr Marsh and his wife then stopped allowing the daughters to spend time with Jabbar, he said.\n\nA resurfaced video on YouTube from 2020 shows Jabbar spruiking his achievements in the industry.\n\n“I just want to say a bit about me,” he begins. “I was born and raised in Beaumont, Texas and now live in Houston. I’ve been here for all my life with the exception of travelling with the military where I spent 10 years as a human resources specialist.”\n\nCriminal records in Texas show Jabbar had previously been charged with minor infractions — once in 2002 for a misdemeanor theft and once in 2005 for driving with an invalid license.\n\nJabbar claimed in 2022, as he went through his second divorce, that he could not afford his house payments.\n\n“It is past due in excess of $27,000 and in danger of foreclosure if we delay settling the divorce,” he wrote in emails, according to the New York Times.\n\nHe said in the email that the business corporation he had formed, a real estate company, had lost more than $28,000 in the previous year and that he had taken on $16,000 in credit card debt in order to pay for lawyers and for “establishing a second residence.”\n\n‘Very intentional’\n\nJabbar was fatally shot in an exchange of gunfire with police in the Louisiana city’s famed French Quarter. Two homemade bombs were found and made safe, the FBI said.\n\nThe Ford electric vehicle used in the attack was owned by another 42-year-old man from Houston, Texas. It had reportedly been rented out on Turo, and police are in contact with the owner who listed it for rent. \n\n“An ISIS flag was located in the vehicle, and the FBI is working to determine the subject’s potential associations and affiliations with terrorist organisations,” the FBI said in a statement.\n\nFBI agent Alethea Duncan indicated that Jabbar may have had help, saying “we do not believe that Jabbar was solely responsible.”\n\nLocal police said the incident took place at around 3:15am in the heart of the French Quarter, which was packed with people celebrating the start of 2025.\n\n“This man was trying to run over as many people as he possibly could,” Police Superintendent Anne Kirkpatrick told reporters.\n\nDriving at “very high speed” and in a “very intentional” manner, “he was hellbent on creating the carnage and the damage that he did,” Kirkpatrick said.\n\nHe wounded two officers in the subsequent shootout. They were listed in stable condition and Kirkpatrick said they would recover.\n\nThe vehicle used was a white Ford F-150 electric pick-up, an AFP correspondent on the scene said.\n\nThe New Orleans attack came 10 days after a similar car-ramming assault at a Christmas market in the eastern German city of Magdeburg that killed five and wounded more than 200. In that case, police arrested a Saudi man and said he appeared to be mentally disturbed.\n\nPresident Joe Biden said in a statement that “there is no justification for violence of any kind, and we will not tolerate any attack on any of our nation’s communities.” \n\nPresident-elect Donald Trump immediately linked the attack to illegal immigration, giving no evidence and before authorities made clear the suspect was American.\n\n“When I said that the criminals coming in are far worse than the criminals we have in the country … it turned out to be true,” Trump posted on social media.\n\nTrump also claimed that the nation’s crime rate “is at a level that nobody has ever seen.” In fact, violent crime is sharply down across the country, according to the FBI.\n\nCarnage in iconic neighbourhood \n\nIn the small hours of the year’s first day, revellers were celebrating in the French Quarter, a district renowned for its bars, restaurants, jazz history and Mardi Gras parties.\n\nA white truck crashed through a barricade “at a very high rate of speed,” witness Jim Mowrer told CBS News.\n\n“We were in the middle of the road and managed to run off the road onto the sidewalk and into the doorway of a building for cover. We did hear gunfire, saw police running,” he said.\n\n“Once the gunfire stopped, we stayed in the alcove until the gunfire stopped, came out into the street, and came across a lot of — several people who had been hit, (we) wanted to see what we could do to help,” he said.\n\n“People we came across were unfortunately deceased.” \n\nNew Orleans is one of the most heavily visited destinations in the United States and on February 9th will stage the NFL’s Super Bowl game — one of the biggest sporting events of the year.\n\nThe attack came just hours before the city was due to host the Sugar Bowl, a major college football game featuring teams from the University of Georgia and Notre Dame.\n\nThat game was delayed for 24 hours, officials said.\n\nPolicing had already been heavy over the New Year’s holiday, according to the city, as authorities braced for big crowds.\n\nThe city police department had announced staffing at “100 per cent, with an additional 300 officers assisting from partner law enforcement agencies,” including on horseback and using unmarked units.\n\nThe iconic French Quarter listed special deals for New Year’s, including LGBTQ parties and a drag cabaret near where the incident took place.","url":"https://www.news.com.au/world/north-america/new-orleans-terrorist-video-comes-to-light/news-story/3ae6eed47047d661d552045b68a33d6b","image":"https://content.api.news/v3/images/bin/cbbd515995d43de0a77660e1bf8ee9c2","video":null,"publish_date":"2025-01-01 23:12:51","author":"Ben Graham","authors":["Ben Graham"],"language":"en","source_country":"au","sentiment":-0.339},{"id":277622212,"title":"‘Turned out to be true’: Trump’s shock claim","text":"At least 10 people are dead and 35 more are injured after a man drove a pick-up truck into New Year’s revellers in the American city of New Orleans.\n\nThe incident is being treated, by law enforcement, as an act of terrorism.\n\nThe driver, who was reportedly killed in a firefight with police officers, has been identified as 42-year-old Shamsud-Din Jabbar, an American-born citizen and military veteran who grew up in Texas.\n\nMr Trump immediately linked the horrific attack to illegal immigration, giving no evidence — before authorities made clear the suspect was American.\n\n“When I said that the criminals coming in are far worse than the criminals we have in the country … it turned out to be true,” Mr Trump posted on social media.\n\nMr Trump also claimed that the nation’s crime rate “is at a level that nobody has ever seen.” In fact, violent crime is sharply down across the country, according to the FBI.\n\nPresident Joe Biden said in a statement that “there is no justification for violence of any kind, and we will not tolerate any attack on any of our nation’s communities.”\n\nWhat we know so far\n\nWhat happened?\n\nA US citizen drove a white Ford pick-up truck flying an Islamic State flag into throngs of people celebrating the New Year in the French Quarter, the Louisiana city’s most iconic tourist district, around 3:15am, according to the Federal Bureau of Investigation.\n\nHe crashed the vehicle, then opened fire and died in a shootout with police, who said he had driven with the aim of killing as many people as possible.\n\nWhat is the toll?\n\nAt least 10 people were killed and more than 35 were wounded, said New Orleans police Superintendent Anne Kirkpatrick. The assailant shot and wounded two police officers, who were described as being in stable condition.\n\nWhat was the motive? \n\nThis was not immediately clear but the FBI said it was investigating the attack as a possible act of terrorism.\n\nOfficials say the pick-up truck was flying a black flag of the Islamic State group and that they had recovered two improvised explosive devices. The FBI said it believes the suspect may have had accomplices.\n\nWithout providing evidence, US President-elect Donald Trump linked the attack to illegal immigration. The FBI, however, said the suspect was an American citizen from Texas.\n\nWhat is the suspect’s identity?\n\nThe FBI named the suspect as 42-year-old Shamsud-Din Jabbar and said he was a US Army veteran who was honourably discharged.\n\nWhere did the attack take place? \n\nThe car-ramming took place in the heart of the French Quarter, a historic district known for its vibrant night life with many bars, restaurants and a jazz venues.\n\nThe French Quarter and New Orleans in general are well known for the raucous pre-Lenten street party known as mardi gras.\n\nThe city was also hosting tens of thousands of people who came to see a major college football game called the Sugar Bowl, which has now been postponed by 24 hours.\n\nOne of those injured in the truck-ramming was a student at the University of Georgia, one of the teams due to play.\n\nNew Orleans is also scheduled to host the Super Bowl on February 9.","url":"https://www.news.com.au/world/north-america/turned-out-to-be-true-donald-trumps-shock-claim-after-attack/news-story/7070b0879c7fe71b2f9dab38b3fc597d","image":"https://content.api.news/v3/images/bin/495549dfc4a155bc1e1b431901366962","video":null,"publish_date":"2025-01-01 23:12:51","author":"Copy Link","authors":["Copy Link"],"language":"en","source_country":"au","sentiment":-0.397},{"id":277622210,"title":"What does Elon’s bizarre name change mean?","text":"The world’s richest man, who boasts nearly 210 million followers on the platform he has owned since 2022, also switched up his profile avatar to feature an image of the popular Pepe the Frog character clad in gladiator-like armour, the New York Post reported.\n\nMusk, a confidant of President-elect Donald Trump, has yet to offer a full explanation for his sudden name change.\n\nBut there are a few hints.\n\nMORE: Elon Musk’s bizarre move with ex-partner Grimes exposed\n\nWhat could Kekius Maximus mean?\n\nElon watchers online have suggested that the new moniker is a bizarre combination of Pepe the Frog and Russell Crowe’s character, Maximus Decimus Meridius, in the 2000 blockbuster “Gladiator.”\n\nMusk’s new profile image shows Pepe the Frog clad in golden armour while holding a video game controller.\n\nPepe, which started off as simply a cartoon in the “Boy’s Club” comic series, allegedly became associated online with white supremacists and the alt-right during the 2016 presidential election.\n\nThe Anti-Defamation League dubbed the character a hate symbol and described it as the “Alt Right’s favourite meme.”\n\nHowever, Musk and many others who are chronically online have always rejected those claims.\n\nA link to gaming?\n\nThe Tesla founder teased his handle change in a post on X on Tuesday, writing: “Kekius Maximus will soon reach level 80 in hardcore PoE.”\n\nPoE is an apparent reference to the popular “Path of Exile 2” video game, which Musk is known to play.\n\nConnection to cryptocurrency?\n\nKekius Maximus is also the name of a “memecoin” — a cryptocurrency based on a popular online meme.\n\nMusk has previously caused massive ripple effects in the crypto market with his social media antics — notably with the dogecoin.\n\nIn the wake of Musk’s handle change, the Kekius Maximus crypto’s value soared by more than 900 per cent as of Tuesday afternoon, according to the CoinGecko site.\n\nIt wasn’t immediately clear, though, if Musk — who has previously shown support for memecoins — has anything to do with Kekius Maximus specifically.\n\nSpeculation of a burner account\n\nMany have speculated online, too, that Musk’s motive is rooted in claims that he is running a burner super-fan account.\n\nInternet sleuths have been suggesting that the Space X CEO is behind an account — operating under the name Adrian Dittmann — that heaps praise on him.\n\nMusk has denied being Dittmann — and mocked people who claimed he’s operating the alt account.\n\nDeepening the mystery, Dittmann appears to be a character who operates only on X — there is almost no evidence of a person with that name operating outside the social media platform.\n\nMusk added fuel to the fire by retweeting a post from the Dittmann account on Tuesday that mentioned the Kekius Maximus saga. \n\n“Imagine you’re a journalist writing about Elon on X and it goes: ‘Elon Musk, aka Kekius Maximus, on X…,’” the Dittmann post read.\n\nThis article originally appeared in the New York Post and was reproduced here with permission.","url":"https://www.news.com.au/technology/online/heres-why-elon-musk-changed-his-name-on-x-to-kekius-maximus-and-what-it-means/news-story/5154b0e494fc8aa3d4b604563baa22af","image":"https://content.api.news/v3/images/bin/074c9fd2f737c6440dd440cc1ac775f4","video":null,"publish_date":"2025-01-01 23:12:51","author":"Emily Crane","authors":["Emily Crane"],"language":"en","source_country":"au","sentiment":-0.066},{"id":277623854,"title":"One dead after Tesla truck catches fire outside of Trump hotel in Las Vegas","text":"One person has been killed and seven injured after a Tesla Cybertruck caught fire and exploded outside of a Las Vegas hotel partly owned by United States President-elect Donald Trump.\n\nThe fire began on Wednesday at about 8:40am local time (14:40 GMT) in the valet area of the Trump International Hotel Las Vegas, according to the Las Vegas Metropolitan Police Department and Clark County officials.\n\n“We were told that a 2024 Cybertruck pulled up to the front of the hotel. And in fact, I can tell you, it pulled right up to the glass entrance doors to the hotel,” Sheriff Kevin McMahill said at a news conference. “We saw that smoke start showing from the vehicle, and then a large explosion from the truck occurs.”\n\nDetails are still emerging, and the cause of the explosion has yet to be confirmed by officials.\n\n“I know you have a lot of questions,” Jeremy Schwartz, the acting special agent in charge of the Las Vegas office for the Federal Bureau of Investigation (FBI), told reporters. “We don’t have a lot of answers.”\n\nAuthorities said that the truck appeared to have been carrying fireworks, and a person was found dead inside the vehicle. Several people in the vicinity of the explosion were treated for minor injuries.\n\nOne witness, Ana Bruce, told The Associated Press news agency that she heard three explosions resulting from the fire.\n\n“The first one [happened] where we saw the fire,” Bruce said. “The second one, I guess, was the battery or something like that, and the third was the big one that smoked the entire area and was the moment when everyone was told to evacuate and stay away.”\n\nThe incident occurred hours after a car-ramming attack in the Louisiana city of New Orleans that killed at least 10 people, in what authorities are investigating as a possible terrorist act.\n\nThe suspect in that case is believed to have been carrying improvised explosive devices, or IEDs, in his truck at the time of the car-ramming.\n\nSheriff McMahill acknowledged that his officers were “very well aware of what happened in New Orleans” and that the incident may inform their investigation. But he stopped short of linking the two.\n\n“As you can imagine, with an explosion here on iconic Las Vegas Boulevard, we are taking all the precautions that we need to take to keep our community safe. We’re looking for secondary devices,” McMahill said at the news conference, adding that there did not appear to be any further threat to the community.\n\nThe Cybertruck explosion comes as Trump prepares to take office for a second term on January 20.\n\nPart of his incoming administration includes close advisers, like tech billionaire and Tesla CEO Elon Musk, whom Trump has tapped to co-lead a yet-to-be-founded, nongovernmental body called the Department of Government Efficiency.\n\nTrump has pitched the new entity as an advisory panel to help streamline the federal government.\n\nIn a social media post, Musk said that Tesla, the electric vehicle company he founded, was looking into Wednesday’s incident.\n\n“The whole Tesla senior team is investigating this matter right now,” Musk wrote, adding: “We’ve never seen anything like this.”","summary":"Authorities say they are investigating the incident, in which seven people sustained minor injuries.","url":"https://www.aljazeera.com/news/2025/1/1/one-dead-after-tesla-truck-catches-fire-outside-of-trump-hotel-in-las-vegas?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/01/AP25001693080680-1735770017.jpg?resize=1200%2C675","video":null,"publish_date":"2025-01-01 23:05:58","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"qa","sentiment":-0.73},{"id":277631226,"title":"Cybertruck Explodes Outside Trump Las Vegas Hotel; 1 Killed, 7 Injured","text":"At least one person was killed and seven wounded when a Tesla Cybertruck exploded outside a hotel belonging to US President-elect Donald Trump in Las Vegas, police said Wednesday.The electric vehicle pulled up to the Trump International Hotel's glass entrance before a \"large explosion,\" Las Vegas Sheriff Kevin McMahill told reporters.Video footage shows the stainless steel truck parked at the hotel entrance before bursting into flames, followed by smaller explosions that appeared similar to fireworks.McMahill said there was \"one deceased individual inside the Cybertruck\" while seven people received \"minor\" injuries.Tesla chief Elon Musk said that the explosion was \"caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck,\" adding in a post on X that it was \"unrelated to the vehicle itself.\"(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Earlier, he said the \"whole Tesla senior team\" was investigating the blast, adding: \"We've never seen anything like this.\"Police said they are still working to establish the cause of the explosion.Musk, who backed Trump in the November election and was named by the Republican to head up a commission to trim government spending, said he would post more information \"as soon as we learn anything.\"President Joe Biden was briefed on the explosion and directed his team to offer any federal assistance needed, the White House said.He was earlier briefed on a car-ramming attack in New Orleans that left at least 10 people dead on Wednesday.McMahill referenced that attack but did not explicitly link the two incidents, saying that authorities in Las Vegas were \"taking all of the precautions that we need to keep our community safe.\"He said the hotel had been evacuated.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"At least one person was killed and seven wounded when a Tesla Cybertruck exploded outside a hotel belonging to US President-elect Donald Trump in Las Vegas, police said Wednesday.","url":"https://www.ndtv.com/world-news/tesla-cybertruck-explodes-outside-trump-las-vegas-hotel-1-killed-7-injured-7380504","image":"https://c.ndtvimg.com/2024-07/aek4ib5o_us-police-generic_625x300_07_July_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-01-01 23:00:04","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.471},{"id":277621170,"title":"One person killed in Cybertruck explosion outside Trump hotel in Las Vegas — police","text":"NEW YORK, January 1. /TASS/. One person was killed and seven others were injured in the explosion of an electric Cybertruck pickup truck outside the 64-story Trump International Hotel in Las Vegas (Nevada), owned by US President-elect Donald Trump, Las Vegas police chief Kevin McMahill told a televised news conference.\n\n\"A 2024 Cybertruck pulled up to the front of the hotel, and in fact I can tell you it pulled right up to the glass entrance doors of the hotel,\" he said.\n\n\"We saw that smoke starts showing from the vehicle, and then a large explosion from the truck occurs. There is one deceased individual in the cyber truck,\" McMahill said. \"I can tell you that there are seven victims right now that sustained injuries from the explosion,\" he added.\n\nLaw enforcement authorities have not yet identified the deceased person.","url":"https://tass.com/emergencies/1895831","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-01 22:58:16","author":"Tass","authors":["Tass"],"language":"en","source_country":"ru","sentiment":-0.53},{"id":277619856,"title":"1 person dies when Tesla Cybertruck catches fire and explodes outside Trump's Las Vegas hotel","text":"LAS VEGAS — One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.\n\nLas Vegas Metropolitan Police and Clark County Fire Department officials told a news conference that a person died inside the futuristic-looking pickup truck and they were working to get the body out. Seven people nearby had minor injuries and several were taken to a hospital.\n\nThe fire in the valet area of the Trump International Hotel Las Vegas was reported at 8:40 a.m., a county spokesperson said in a statement.\n\nAccording to a law enforcement official, the truck was rented via the Turo app and appeared to have a load of fireworks. The official spoke on condition of anonymity because they were not authorized to speak publicly.\n\nA Turo spokesperson did not immediately respond to an emailed request for comment. \n\nTesla CEO Elon Musk said Wednesday afternoon on X that \"we have now confirmed that the explosion was caused by very large fireworks and/or a bomb carried in the bed of the rented Cybertruck and is unrelated to the vehicle itself. All vehicle telemetry was positive at the time of the explosion.''\n\n\"The whole Tesla senior team is investigating this matter right now,'' Musk said in an earlier post on the platform after attending a New Year's Eve party at Trump's Mar-a-Lago resort. ''We've never seen anything like this.''\n\nLaw enforcement officials have not ruled out terrorism as a possible motive, a person familiar with the matter said. The person spoke on condition of anonymity because they were not authorized to publicly discuss details of the investigation.","summary":"One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.","url":"https://www.startribune.com/a-vehicle-catches-fire-and-explodes-outside-the-lobby-of-trumps-hotel-in-las-vegas/601201024","image":"https://arc.stimg.co/startribunemedia/KN4NGXGU45AENLEOXYYZCBUHB4.jpg?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-01-01 22:49:01","author":"Ty O","authors":["Ty O"],"language":"en","source_country":"US","sentiment":-0.373},{"id":277619026,"title":"FBI Identifies Suspected Terrorist in New Orleans Attack, Says ISIS Flag Found","text":"The FBI has identified the suspect who carried out an attack in New Orleans on New Year’s Day that left at least 10 dead and dozens more injured.\n\nThe individual has been identified as 42-year-old Shamsud-Din Jabbar, a U.S. citizen who lived in Texas, according to the FBI in a statement issued on Wednesday afternoon. Earlier in the day, anonymous law enforcement officials provided his name to multiple news outlets.\n\nAn ISIS flag was discovered in the Ford pickup truck that Jabbar was driving, the FBI said, referring to the Islamist terrorist group that had controlled swaths of Syria and Iraq about a decade ago.\n\nDuring a news briefing on Wednesday afternoon, Alethea Duncan, an assistant special agent in charge of the FBI’s New Orleans field office, said investigators do not believe Jabbar was “solely responsible” for the attack as the investigation continues.\n\n“We are aggressively running down every lead, including those of his known associates,” Duncan told the news conference, while asking for the public’s assistance in the case.\n\nMore than 30 people were injured as Wednesday’s attack turned festive Bourbon Street into a massacre. The FBI and Attorney General Merrick Garland have both confirmed that the incident is being investigated as an act of terrorism.\n\nAlso found in his truck were “weapons and a potential IED,” or improvised explosive device, and “other potential IEDs” were found in New Orleans’ French Quarter district, the FBI said.\n\nThe FBI said its “special agent bomb technicians are working with our law enforcement partners to determine if any of these devices are viable, and they will work to render those devices safe.”\n\nJabbar was killed in a firefight with police following the attack, which occurred at around 3:15 a.m. in an area teeming with New Year’s revelers, officials said.\n\nA photo that was circulating online on Wednesday appeared to show a bearded Jabbar wearing camouflage clothing next to the truck after he was killed by police.\n\nEarlier, New Orleans Mayor LaToya Cantrell described the killings as a “terrorist attack,” while New Orleans Police Superintendent Anne Kirkpatrick said the driver was “hell-bent on creating the carnage and the damage that he did.”\n\n“It was very intentional behavior. This man was trying to run over as many people as he could,” Kirkpatrick told a news conference.\n\nTens of thousands of college football fans were in the city for Wednesday night’s Sugar Bowl playoff quarterfinal between Georgia and Notre Dame at the nearby Superdome. The game is expected to be played as scheduled.\n\nUniversity of Georgia President Jere Morehead said a student was critically injured in the attack and is receiving medical treatment.\n\nIn response to the incident, President Joe Biden said that there is “no justification” for what he called the “horrific” attack on New Year’s Day, saying he has been briefed by top U.S. law enforcement officials.\n\n“I am grateful for the brave and swift response of local law enforcement in preventing even greater death and injury,” Biden said. “I have directed my team to ensure every resource is available as federal, state, and local law enforcement work assiduously to get to the bottom of what happened as quickly as possible and to ensure that there is no remaining threat of any kind.”\n\nAlso on Wednesday, President-elect Donald Trump condemned the violence and said he would “fully support the City of New Orleans as they investigate and recover from this act of pure evil.”\n\n“Please join us in praying for the victims, their families, and the first responders and investigators on the scene.”","url":"https://www.theepochtimes.com/us/fbi-identifies-suspect-in-apparent-terrorist-attack-in-new-orleans-says-isis-flag-found-5784697?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2025/01/01/id5784663-GettyImages-2191462950-300x180.jpg","video":null,"publish_date":"2025-01-01 22:47:51","author":"Jack Phillips","authors":["Jack Phillips"],"language":"en","source_country":"us","sentiment":-0.256},{"id":277619010,"title":"Trudeau Sits Down With ‘This Hour Has 22 Minutes’ Comedian to Reflect on 2024","text":"In a year-end interview with comedian Mark Critch of “this Hour Has 22 Minutes,” Prime Minister Justin Trudeau said he is “not ready to stop fighting” for key policies such as gun control and climate change.\n\nCritch and Trudeau are seen seated in a bar where they talk about the prime minister’s “garbage year,” as Critch calls it.\n\nTrudeau laughed and said: “We’ve done good things together as progressives, and we’re gonna still try to bring them along on the more progressive things we’re doing.”\n\nCritch then asked Trudeau about his visit at the end of November with president-elect Donald Trump and how the food was.\n\n”Actually, it was a really good steak,” Trudeau said.\n\nCritch also asked the prime minister about the U.S. president-elect’s suggestion that Canada become the 51st state and his reference to Trudeau as governor.\n\n“There was a lot discussed during those three hours. That was an offhand, jocular moment. I don’t think it’s serious, even from him,” Trudeau said.\n\nWhen asked about Canada’s “greatest defence” when it comes to threats by Trump to impose a 25 percent tariff on goods exported to the United States, Trudeau replied: “I think our greatest defence is that we do things together across the border, and anything they do that will hurt us will also hurt them and that is something he doesn’t want to do.”\n\nThe interview turned to Trudeau’s future, with Critch saying that 40 years ago, Trudeau’s father, former Prime Minister Pierre Elliot Trudeau, took his famous walk in the snow and decided not to run again. Then he said, “It’s snowing out there now.”\n\n”When my father was my age, he still had a dozen years of prime ministering ahead of him,” Trudeau responded.\n\nCritch said, “Oh my God, another dozen years?”\n\n“God, no,” Trudeau replied, laughing.\n\nCritch pointed out that Conservative Leader Pierre Polievre is ahead in the polls and asked Trudeau, “Do you think you can do this?”\n\n”Right now we’re in a moment where everything is difficult, and Pierre Polievre is trying to convince Canadians not to believe in themselves, not to believe in the CBC, not to believe in climate change, not to believe in gun control, not believe in women’s rights,” Trudeau said.\n\n“In 2024, Canadians did what Canadians do best. We stuck together, supported one another, and got through good times and bad times alongside each other,” Trudeau said.\n\n“I invite Canadians to join me in celebrating all that we have achieved together in 2024 and in looking toward a better and fairer future in the new year.”","url":"https://www.theepochtimes.com/world/trudeau-sits-down-with-this-hour-has-22-minutes-comedian-to-reflect-on-2024-post-5784682?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/23/id5780987-eec633ba-245d-4947-b3c5-af8942e0d7ea-300x180.jpg","video":null,"publish_date":"2025-01-01 22:47:51","author":"Chandra Philip","authors":["Chandra Philip"],"language":"en","source_country":"us","sentiment":-0.05},{"id":277619006,"title":"1 Dead, 7 Injured After Tesla Cybertruck Explodes Into Flames Outside Trump Hotel in Las Vegas","text":"One person was killed and seven others were injured after a Tesla cybertruck exploded into flames outside the Trump International Hotel in Las Vegas on Wednesday morning.\n\nOfficials said that the vehicle was observed completely engulfed in flames in the valet area of the hotel.\n\nGuests of the hotel were immediately evacuated and transferred to the Resorts World Hotel, according to the sheriff.\n\nEric Trump, executive vice president of The Trump Organization and the second son of President-elect Donald Trump, confirmed the vehicle fire on New Year’s Day, and said that the incident happened in the valet area in front of the hotel.\n\nImages of the vehicle fire quickly circulated on social media, showing what appeared to be an explosion as the vehicle caught fire near the entrance to the hotel. Some witnesses reported online that they heard a loud bang and saw clouds of smoke near the hotel.\n\nOne witness and hotel guest posted a video shot from inside the hotel lobby.\n\nThe Trump Hotel is located at 2000 Fashion Drive, which is on the north end of the famous Las Vegas Strip. Many people had traveled to the city to ring in the New Year.\n\nAuthorities confirmed there is no further threat to the public.\n\n“I just want to remind the community that everything is safe now,” the sheriff said.\n\nThe incident happened as authorities were already on high alert after a deadly terrorist attack earlier on Wednesday morning in the iconic French Quarter of New Orleans, which is also considered a popular tourist destination.\n\nPolice are urging the public to avoid the area around the hotel as they investigate the deadly vehicle fire.","url":"https://www.theepochtimes.com/us/trump-hotel-in-las-vegas-evacuated-after-tesla-cybertruck-bursts-into-flames-5784698?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2025/01/01/id5784804-Trump-Hotel-Fire-Las-Vegas-AP25001693072945-300x180.jpg","video":null,"publish_date":"2025-01-01 22:47:51","author":"Rachel Acenas","authors":["Rachel Acenas"],"language":"en","source_country":"us","sentiment":-0.432},{"id":277618448,"title":"Mitch McConnell’s legacy: A ‘grim reaper’ for US bipartisanship?","text":"A new United States Congress convenes in Washington, DC, on January 3. But for the first time in 18 years, a key Republican leader will no longer be at the helm: Senator Mitch McConnell.\n\nSince 2007, McConnell has served as head of the Republican Party in the Senate, steering members of his caucus through four different presidencies and countless legislative hurdles.\n\nExperts say his tenure as the Senate’s longest-serving party leader will ultimately be remembered as an inflexion point for Republicans and Congress as a whole.\n\nUnder McConnell, US politics moved away from the back-slappers and consensus-builders of earlier eras. Instead, McConnell helped to usher in a period of norm-breaking, hyper-partisan politics that paved the way for figures like incoming President Donald Trump, the leader of the Make America Great Again (MAGA) movement.\n\n“First and foremost, he extended a trend in minority obstruction in the Senate,” Steven S Smith, professor emeritus of political science at Washington University in St Louis, told Al Jazeera.\n\nSmith pointed out that McConnell led a Republican majority for only six of his 18 years as Senate leader. The rest of his tenure has been spent mobilising a minority in the 100-seat Senate to disrupt the agenda of the rival Democratic Party.\n\n“Second, he will be known for deepening partisan polarisation in the Senate,” Smith said. “While McConnell is not a conservative or MAGA extremist by today’s standards, he was a deeply partisan leader.”\n\nDespite his commitment to the Republican Party, some see McConnell as a potential bulwark to figures like Trump, with whom he has clashed in the past.\n\nThough he is stepping down as party leader, McConnell intends to remain in the Senate for the remainder of his six-year term. But the extent to which McConnell will act as a check on Trump’s ambitious second-term agenda remains to be seen.\n\n“I’d be very surprised to see him be provocative in a public way. His influence is going underground,” Al Cross, a veteran reporter and columnist who covered McConnell’s tenure, told Al Jazeera.\n\n‘I usually play the villain’\n\nMcConnell has led a long and storied career in the Senate. In 1984, he made his first bid for a seat in the chamber, ousting an incumbent Democrat.\n\nHe has remained undefeated ever since. In 2020, he won his seventh straight term.\n\nHis ascent to the top of the Senate came without significant opposition. The 2007 retirement of the previous Senate Republican leader, Bill Frist, left the position vacant.\n\nBut even from his first days as a Senate leader, McConnell cultivated a reputation as a hardliner and obstructionist.\n\nDuring his first year as Republican leader, The New York Times described him as operating with “near-robotic efficiency” to smack down Democratic policies, despite leading a minority in the Senate.\n\n“Mr McConnell and his fellow Republicans are playing such tight defense, blocking nearly every bill proposed by the slim Democratic majority that they are increasingly able to dictate what they want,” reporter David Herszenhorn wrote.\n\nMcConnell quickly embraced his visibility as a partisan warrior, a self-described “grim reaper” for progressive proposals.\n\nOne editorial column nicknamed him “Senator No” for his refusal to work across the aisle. McConnell himself greeted reporters once by saying, “Darth Vader has arrived.”\n\n“Over the three decades I have been a US Senator, I’ve been the subject of many profiles,” McConnell wrote in the opening lines of his 2016 memoir. “I usually play the villain.”\n\nSmith, the Washington University professor, described McConnell as sparking a “transformation” in the Senate as a result of his hardline approach.\n\nBefore McConnell’s leadership, Smith said the Senate only saw “occasional minority obstruction”. But afterwards, the chamber became known in political circles as the “60-vote Senate”.\n\nThat nickname is a reference to the 60 votes required to overcome a minority obstruction, otherwise known as a filibuster.\n\nUnder McConnell, Smith explained, “acting on legislation of any importance would face minority obstruction and require 60 votes for cloture”.\n\nBending norms\n\nOne of McConnell’s most divisive moments came in 2016, with the death of Supreme Court Justice Antonin Scalia.\n\nNormally, when a justice dies, the sitting president is entitled to nominate a replacement. But Scalia’s death came 11 months before a pivotal presidential election. And the president at the time, Democrat Barack Obama, was nearing the end of his final term.\n\nMcConnell made a stunning — and swift — political gamble. Within hours of Scalia’s death, the Republican leader announced he would refuse to call a vote to confirm Obama’s chosen replacement.\n\n“The American people should have a voice in the selection of their next Supreme Court Justice. Therefore, this vacancy should not be filled until we have a new president,” McConnell said in a statement.\n\nLeft-leaning publications like The Nation decried McConnell’s decision as an assault on the US Constitution. “This refusal exploded norms,” journalist Alec MacGillis wrote in the publication ProPublica.\n\nBut McConnell’s gambit shifted the balance of power on the court for generations to come.\n\nThat November, US voters elected Trump — a political newcomer — to his first term in the White House, setting the stage for more shifts in Washington norms.\n\nTrump ultimately nominated three right-wing justices to the Supreme Court, including one to replace Scalia. That cemented a conservative super-majority on the bench, anticipated to mould US law for generations to come.\n\nTrump later credited McConnell as his “ace in the hole” and “partner”.\n\n“Mitch recognized, as did I, that since judges enjoy life tenure, the impact of judicial nominations can be felt for thirty years or more,” Trump wrote in a forward to McConnell’s memoir. “Transforming the federal judiciary is the ultimate long game!”\n\nA Trump rivalry\n\nBut in the lead-up to a new and emboldened Trump administration in 2025, McConnell has increasingly spoken out against the president-elect and his isolationist “America First” platform.\n\nThe two Republican leaders have repeatedly butted heads, and their relationship is notably frosty.\n\nTrump has openly called McConnell an “old crow” and vilified his “China-loving wife” Elaine Chao, a slap at her Asian heritage.\n\nMcConnell, meanwhile, has countered with his own fighting words, implying parallels between Trump and isolationism in the 1930s.\n\n“We’re in a very, very dangerous world right now, reminiscent of before World War II,” McConnell told the Financial Times in December. “Even the slogan is the same. ‘America First.’ That was what they said in the ’30s.”\n\nUpon vacating his leadership post in January, McConnell is expected to take on the role of chairman of the Senate Appropriations Subcommittee on Defense.\n\nIn his new position, he is likely to advocate for strengthening the US military to counter threats from adversaries like Russia, Iran and China.\n\nYet at age 82, with health challenges including a recent fall, experts say McConnell is unlikely to offer much resistance to the incoming Trump administration.\n\n“Since Senator McConnell is out of his leadership position and given his physical frailty, I am not expecting much in the way of sustained opposition from him,” Harvard University political scientist Daniel Ziblatt told Al Jazeera.\n\n“It is possible he may cast a dissenting vote here or there that might make a difference. But his track record doesn’t leave me holding my breath.”\n\nNo greater institutionalist\n\nStill, Herbert Weisberg, a professor of political science at The Ohio State University, anticipates that McConnell may act as an occasional dissenting voice, particularly as the Senate weighs some of Trump’s controversial nominees for high-level government posts.\n\n“He’d normally want to defer to a Republican president on appointees, but he’ll be cautious on the unusual Trump nominees. He might be willing to vote against a few, but not all of them,” Weisberg told Al Jazeera.\n\nAlready, McConnell — a childhood polio survivor — issued a public warning to incoming administration officials to “steer clear of” efforts “to undermine public confidence” in “proven cures”, lest they scuttle their Senate confirmation hearings.\n\nThe statement came immediately after Trump health nominee Robert F Kennedy Jr was linked to an effort to revoke approval for the polio vaccine in The New York Times.\n\nBut a single Republican is unlikely to stall a nomination or piece of legislation, as Steven Okun, an analyst on US politics, government and trade, pointed out.\n\nRepublicans hold a 53-person majority in the incoming Senate. And many in the party are firmly behind Trump’s leadership.\n\nAssuming a united Democratic opposition, “four Republican senators would be needed to stop anything a future President Trump puts forth to the Senate,” Okun explained.\n\nMcConnell, Okun added, is unlikely to take on the role of dissenter — “only when Donald Trump pursues the most aggressive actions which would run counter to the US national interest”.\n\nAfter all, party loyalty has been a key tenet of McConnell’s leadership. And experts like Cross, the journalist, believe McConnell won’t want to miss an opportunity to use the power of the Senate to shape presidential policy.\n\n“I can’t think of any greater institutionalist than Mitch McConnell,” Cross said. “He loves the Senate, it’s what he’s aspired to. He doesn’t want to give up its role in advice and consent.”","url":"https://guyanainquirer.com/mitch-mcconnells-legacy-a-grim-reaper-for-us-bipartisanship/","image":"https://guyanainquirer.com/app/uploads/2024/12/2024-12-13T151703Z_66226808_RC2FOBA5BBKI_RTRMADP_3_SYRIA-SECURITY-BLINKEN-IRAQ-1734103146-Zxw2Qp.jpeg","video":null,"publish_date":"2025-01-01 22:43:51","author":"Us Treasury Dept","authors":["Us Treasury Dept"],"language":"en","category":"politics","source_country":"gy","sentiment":0.133}]}