{"offset":0,"number":50,"available":24692,"news":[{"id":396336702,"title":"Junk Debt Sales Soar After Trump Tariff Threat Recedes","text":"Junk-debt sales on both sides of the Atlantic surged on Monday as firms took advantage of easing geopolitical tensions after US President Donald Trump abandoned his Greenland-linked tariff threats.Some 30 deals worth about $39 billion swooped on the US leveraged loan market — mainly to reprice existing loans or refinance debt — in the busiest day since July, according to data compiled by Bloomberg. In Europe, nine borrowers turned to the region’s junk-bond market for deals and another four high-yield bonds launched in the US, including United Airlines, which announced the first unsecured junk bond from a high-yield issuer for a local airline since the pandemic.Among the others were Italmatch Chemicals SpA and health care firm Alloheim Senioren-Residenzen SE, which were looking for close to $2 billion-equivalent in euros, according to people familiar with the transactions.“Even with the headlines about Greenland, high yield has barely budged,” said Michael Levitin, a portfolio manager at MidOcean Partners.Indeed, Monday’s frenzy — putting Europe on track for its busiest week ever for leveraged loans according to the Bloomberg data — follows another week of gains in US junk bonds, marking its longest winning streak since September. Risk premiums, at a yield of roughly 6.6% on Monday, have hovered near two-decade lows despite headline risks over tariffs, persistent threats of inflation and multiple wars.Europe’s iTraxx Crossover Index — a key gauge of the continent’s credit risk — has also dropped toward multi-year lows after a brief spike last week. Borrowers are seizing on the lull to tap debt markets after a week dominated by headlines from Trump’s trip to the World Economic Forum in Davos.“Everyone was very nervous around geopolitical risks, so a bit of calm after Davos looks like a good time to come to the market,” said Felicity Juckes, a high-yield debt portfolio manager at TwentyFour Asset Management LLP.At the heart of the matter is the sheer amount of money sitting on the sidelines that needs to be put to work, according to MidOcean’s Levitin.Italmatch’s bond sale, for example, comes as the chemicals’ sector struggles with higher energy prices and heightened competition. But the specialty chemical maker’s February 2028 bond continues to trade above par.In loans, well-known credits from Patriot Rail to convenience store chain EG Group were some of the dozens of companies seeking to reprice or refinance existing debt. CLOs, the biggest buyers of leveraged loans, are typically wary of repricings which compress margins. But record issuance has made bankers confident that demand is deep enough to absorb new leveraged loan supply. “The truth is, if you’re repricing or refinancing, you’re probably a high-quality credit and investors are loathe to lose that paper,” said Mike Best, a high-yield and senior loan portfolio manager at Barings. “Think about the CLO market, there is a lot of bias to be fully invested at all times. Investors have to grapple with the fact there is not a lot of marginal new issue or attractive secondary activity right now.”While investors have been starved of new money for some time, signs are emerging that acquisition financing is ticking up. Loans for buyouts hit $11.7 billion in January, the highest since February 2022, according to JPMorgan Chase & Co. research. With assistance from Hannah Benjamin-Cook and Amedeo Goria.©2026 Bloomberg L.P.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/market/junk-debt-sales-soar-after-trump-tariff-threat-recedes-11769454005783.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/market_4_1733466069237_1733466076549.png","video":null,"publish_date":"2026-01-27 19:00:05","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":0.155},{"id":396336714,"title":"Who is Tom Homan — Trump’s Border Czar sent to Minnesota after two fatal ICE shootings?","text":"US President Donald Trump has dispatched his top border official, Tom Homan, to Minnesota as his administration faces mounting political, legal and public pressure over a hardline immigration crackdown that has triggered mass protests and the fatal shootings of two US citizens by federal agents. The move signals an effort by the White House to regain control over a rapidly escalating crisis that has turned Minneapolis into a flashpoint in the national immigration debate.Who is Tom Homan?Tom Homan (born November 28, 1961) is a veteran American law-enforcement official and one of the most hardline figures in US immigration policy. A former acting director of US Immigration and Customs Enforcement (ICE), Homan rose to national prominence as a fierce advocate of mass deportations and strict border enforcement. In November 2024, President Donald Trump named him “border czar” for his second presidency, placing him at the center of the administration’s immigration crackdown.Early life and educationHoman was born in West Carthage, New York, into a Roman Catholic family with deep law-enforcement roots—both his father and grandfather served as local police officers.He earned:-An associate degree in criminal justice from Jefferson Community College-A bachelor’s degree in criminal justice from SUNY Polytechnic InstituteLaw-enforcement careerHoman began his career as a local police officer in 1983, before joining the U.S. Immigration and Naturalization Service (INS) in 1984. Over a 30-year federal career, he served as:-Border Patrol agent-Criminal investigator-Supervisor and senior enforcement officialHe worked extensively along the US–Mexico border, including postings in Texas, California, and Arizona, and later became a supervisor on the Texas border.Obama administration (2014–2016)Under President Barack Obama, Homan was appointed executive associate director of ICE’s Enforcement and Removal Operations, overseeing deportations nationwide.During this period, Homan became an early and vocal proponent of family separation as a deterrent to illegal immigration—years before the policy was formally adopted under Trump. Journalist Caitlin Dickerson later described him as the “intellectual father” of the policy.In 2015, he received the Presidential Rank Award as a Distinguished Executive.First Trump administration (2017–2018)In January 2017, President Trump appointed Homan acting director of ICE. Under his leadership:-ICE arrests rose sharply, with a 38% increase early in Trump’s term-Homan publicly warned that undocumented immigrants “should be afraid”-He aggressively opposed sanctuary city policies, at times suggesting elected officials should face prosecution-Homan played a key role in advising DHS Secretary Kirstjen Nielsen to implement the zero-tolerance immigration policy, which led to widespread family separations at the border. He consistently defended the policy in media appearances and congressional testimony.-He retired from ICE in June 2018.Second Trump administration (2025–present)Trump formally appointed Homan as “border czar”, giving him sweeping authority over deportation policy. Homan pledged to run “the biggest deportation force this country has ever seen.”As border czar, he has:-Supported use of the Alien Enemies Act of 1798 for deportations-Backed deportations even in defiance of court orders-By April 2025, the administration claimed about 140,000 deportations, though independent estimates suggest a lower figure.Why has Trump sent Homan to Minnesota?Homan has been sent to Minneapolis as the White House confronts intensifying backlash over its immigration operation in the state, known as Operation Metro Surge.The deployment follows:-The fatal shooting of Renee Good, a 37-year-old mother of three, by an ICE officer in early January-The killing of Alex Pretti, a US citizen and ICU nurse, by Border Patrol agents during a protest last weekend-Both incidents were captured on video and sparked nationwide protests, bipartisan criticism and legal action by Minnesota and its largest cities.","url":"https://www.livemint.com/news/who-is-tom-homan-trump-s-border-czar-sent-to-minnesota-after-two-fatal-ice-shootings-11769448036768.html","image":"https://www.livemint.com/lm-img/img/2026/01/26/1600x900/logo/US-POLITICS-TRUMP-25_1736975099368_1769449240442.jpg","video":null,"publish_date":"2026-01-27 18:37:29","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","category":"politics","source_country":"in","sentiment":0.094},{"id":396336708,"title":"US Treasury Department ends contracts with Booz Allen Hamilton after Trump tax leak","text":"WASHINGTON — The U.S. Treasury Department has cut its contracts with Booz Allen Hamilton, after a former contractor who worked for the firm was charged and subsequently imprisoned for leaking tax information to news outlets about thousands of the country’s wealthiest people, including President Donald Trump.The latest move is in line with Trump administration efforts to exact retribution on perceived enemies of the president and his allies.In 2024, former IRS contractor Charles Edward Littlejohn of Washington, D.C. — who worked for Booz Allen Hamilton — was sentenced to five years in prison after pleading guilty to leaking tax information about Trump and others to news outlets.Littlejohn gave data to The New York Times and ProPublica between 2018 and 2020 in leaks that appeared to be “unparalleled in the IRS’s history,” prosecutors said.In court documents, prosecutors said Littlejohn had applied to work as a contractor to get Trump’s tax returns and carefully figured out how to search and extract tax data to avoid triggering suspicions internally.Treasury says the agency has 31 contracts with Booz Allen Hamilton totaling $4.8 million in annual spending and $21 million in total obligations.Treasury Secretary Scott Bessent said in statement that the firm “failed to implement adequate safeguards to protect sensitive data, including the confidential taxpayer information it had access to through its contracts with the Internal Revenue Service.”Brian P. Hale, a Booz Allen spokesperson, said the firm has consistently condemned Littlejohn's actions and has zero tolerance for violations of the law.“Booz Allen fully supported the U.S. government in its investigation, and the government expressed gratitude for our assistance, which led to Littlejohn’s prosecution,” Hale said. \"We look forward to continuing discussions with Treasury on this matter.”Booz Allen says it doesn't store taxpayer data on its systems and has no ability to monitor activity on government networks.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/companies/us-treasury-department-ends-contracts-with-booz-allen-hamilton-after-trump-tax-leak-11769452595272.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/company_3_1733465099406_1733465108677.png","video":null,"publish_date":"2026-01-27 18:36:34","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.36},{"id":396336712,"title":"Ex-World Soccer Boss Joins Chorus Telling Fans to Shun World Cup","text":"(Bloomberg) -- Pleas to consider boycotting the World Cup in the US this summer are rising amid President Donald Trump’s fraying relationship with Europe.Sepp Blatter, the controversial former president of FIFA, advised football fans in a social media post on Monday to “stay away” from America and the World Cup. Elsewhere, Oke Göttlich, president of the Bundesliga club St. Pauli and a vice president of the German Football Association, said that the time had come to “seriously consider and discuss” a boycott, according to an interview in the Hamburger Morgen Post. A spokesperson for FIFA declined to comment.The US is co-hosting the World Cup with Canada and Mexico for about five weeks starting in June. The tournament has already been criticized for exorbitant ticket prices. Now Trump’s policies, including a desire to take control of Greenland from fellow NATO member Denmark, are increasing debate about boycotting the event in response.“What were the justifications for the boycotts of the Olympic Games in the 1980s?” Göttlich told the German newspaper, referring to several countries skipping the Olympics in Moscow after the former USSR invaded Afghanistan.“By my reckoning, the potential threat is greater now than it was then,” Göttlich said. “We need to have this discussion.”Opposition has also come from British politicians and Mark Pieth, who led a committee to oversee reforms at FIFA last decade. He’s said that fans should boycott the World Cup because of America’s increasing authoritarianism.Sign up for Bloomberg’s Business of Sports newsletter for the context you need on the collision of power, money and sports, from the latest deals to the newest stakeholders.More stories like this are available on bloomberg.com©2026 Bloomberg L.P.","url":"https://www.livemint.com/sports/exworld-soccer-boss-joins-chorus-telling-fans-to-shun-world-cup-11769452281894.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/sports1_1733466411301_1733466424470.png","video":null,"publish_date":"2026-01-27 18:31:21","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":0.076},{"id":396405888,"title":"India-EU Summit 2026 LIVE Updates: India, EU Poised To Unveil Landmark Free Trade Deal Today","text":"India EU Free Trade Deal Live Updates: India and the European Union are expected to announce a historic, mega free-trade agreement today, a move that could reshape one of the world’s largest economic partnerships. The agreement, years in the making, will anchor a broader strategic vision as New Delhi and Brussels seek to navigate uncertainty unleashed by US President Donald Trump’s trade and foreign policy choices. Beyond commerce, today’s summit is expected to touch on defence and security cooperation, climate action, critical technologies and a shared commitment to a rules-based global order.\n\nPrime Minister Narendra Modi is hosting European Commission President Ursula von der Leyen and European Council President Antonio Costa. The visit follows strong recent signals from Brussels, with Ursula von der Leyen last week calling the proposed pact a “historic trade agreement” that could create a market of nearly two billion people and account for close to a quarter of global GDP.\n\nNegotiations for the FTA were first launched in 2007, stalled in 2013 over differences in ambition and revived in 2022. The deal would mark a decisive turn in India-EU relations, which have gathered momentum as Europe looks to diversify away from over-reliance on the US and China and India positions itself as a central economic and strategic partner.\n\nCatch key announcements, reactions and what the deal could mean for India, Europe, and the shifting balance of global power in this live blog","summary":"India EU Free Trade Deal Live Updates: PM Modi is hosting European Commission President Ursula von der Leyen and European Council President Antonio Costa.","url":"https://www.news18.com/world/india-european-union-free-trade-agreement-live-updates-16th-eu-india-summit-tariffs-latest-news-liveblog-ws-l-9857699.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/ursula-modi-2025-09-ad7a99f004ef801bce804f1be8f7eb63-16x9.jpg","video":null,"publish_date":"2026-01-27 01:43:25","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.409},{"id":396406462,"title":"'Trump Doesn't Want To See People Getting Killed': White House On Fatal Minnesota Shooting","text":"The White House on Monday said that President Donald Trump opposes violence on American streets, stressing that no one in his administration wants civilians harmed. However, the administration again pointed the finger at Democrats following the killing of two people in Minneapolis by anti-immigration agents.\n“Nobody in the White House, including President Trump, wants to see people getting hurt or killed in America’s streets,” White House Press Secretary Karoline Leavitt told reporters.\nLeavitt referred to Saturday’s shooting of Alex Pretti by federal officers as a “tragedy,” though a Trump aide had quickly and without evidence labeled Pretti a “domestic terrorist.”\n“We mourn for the parents. As a mother myself, of course, I cannot imagine the loss of life,” she said, expressing sympathy for Pretti’s loved ones","summary":"Donald Trump opposes street violence, says Karoline Leavitt, after Alex Pretti was killed by federal officers in Minneapolis. The White House blames Democrats for the tragedy.","url":"https://www.news18.com/world/trump-doesnt-want-to-see-people-getting-killed-white-house-on-fatal-minnesota-shooting-ws-l-9857697.html","image":"https://images.news18.com/ibnlive/uploads/2026/01/1768298379_donald-trump-2026-01-c083b1a700e8ee56e7a097f619b52cfc.jpg","video":null,"publish_date":"2026-01-27 01:43:03","author":"Manisha Roy,News18","authors":["Manisha Roy","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.602},{"id":396405870,"title":"Trump says he is raising tariffs on South Korea to 25%  - Bahamas Spectator – Bahamas &amp; Caribbean News,","text":"United States President Donald Trump has threatened to hike tariffs on South Korean exports over the East Asian country’s failure to ratify a trade deal with Washington fast enough.\n\nIn a post on Truth Social on Monday, Trump said he would raise the tariff rate from 15 percent to 25 percent due to the failure of the South Korean legislature to ratify the trade pact struck between Washington and Seoul earlier this year.\n\n“South Korea’s Legislature is not living up to its Deal with the United States,” Trump said.\n\n“Why hasn’t the Korean Legislature approved it?” he added.\n\nMore to follow…","url":"https://bahamasspectator.com/trump-says-he-is-raising-tariffs-on-south-korea-to-25/","image":"https://bahamasspectator.com/app/uploads/2026/01/AFP__20260123__2257687936__v5__MidRes__PresidentTrumpReturnsToWashingtonDcFromSwitze-1769476537-dOKo2J.jpg","video":null,"publish_date":"2026-01-27 01:38:15","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":-0.311},{"id":396405872,"title":"Hamas disarmament in Gaza comes with ‘some sort of amnesty’: US official  - Bahamas Spectator – Bahamas","text":"Disarmament by Hamas in Gaza will be accompanied by “some sort of amnesty” for the Palestinian group, a United States official has said.\n\nThe US official, speaking to reporters on condition of anonymity on Monday, made the comment after the body of the last Israeli captive in Gaza was recovered, a move that paves the way towards the next phase of the Gaza ceasefire deal agreed upon in October.\n\n“We are listening to many of their people talk about disarming. We think they’re going to. If they don’t disarm, then they’ve breached the deal. We think disarmament comes along with some sort of amnesty, and candidly, we think we have a very, very good programme to disarm,” the official said, according to the Reuters news agency.\n\nAl Jazeera’s Rosiland Jordan, reporting from Washington, DC, said the official made the comment during a background briefing by senior officials from US President Donald Trump’s administration and reporters.\n\n“A senior administration official told reporters that Hamas agreed to disarmament and that it will happen,” Jordan said.\n\n“The same official also alluded to the fact – when the question was raised about whether Hamas could be recognised as a political entity in exchange for [dis]armament – the official said the possibility of amnesty for those Hamas fighters who lay down their weapons was part of the discussion,” Jordan said.\n\n“But the official didn’t get into any more details. Even so, the fact that that was put out there for reporters to discuss publicly is a significant step,” she said.\n\n“How long is it going to take to work out these terms? Well, it certainly depends on what the Israelis, the Americans , their various interlocutors – the Qataris, the Turkish, the Egyptians – what they are all able to bring to the table with Hamas in order to get this figured out. But some sort of amnesty has now been publicly floated,” she added.\n\nOn Monday, Israel confirmed that the remains of the last captive held in Gaza, Ran Gvili, had been positively identified and that all those held in the war-torn Palestinian territory “have now been repatriated”.\n\nHamas said on Monday the return of remains of captives underscored its commitment to phase one of the ceasefire agreement, and that it had “fulfilled all its obligations in a clear and responsible manner”.\n\nIsrael must now hold up its side of the ceasefire deal “without any deduction or delay”.\n\n“Especially the opening of the Rafah crossing in both directions without restrictions, the entry of the Gaza Strip’s needs in the required quantities, the lifting of the ban on any of them, the complete withdrawal from the Gaza Strip, and facilitating the work of the National Committee for the management of the Gaza Strip,” the group said.\n\nTrump’s 20-point Gaza plan states that once all captives are returned, Hamas members who decommission their weapons will be given amnesty. Members of Hamas who wish to leave Gaza will be provided safe passage under the plan. The plan also states that aid must flow “freely” into the enclave, and the Rafah border crossing with Egypt is to be reopened.\n\nTurkish Minister of Foreign Affairs Hakan Fidan met Hamas officials in Ankara on Monday and discussed the second phase of the ceasefire agreement and humanitarian conditions in the enclave, a ministry source told Reuters.\n\nThe minister briefed the Hamas officials about Turkiye’s efforts in international platforms, including Trump’s Board of Peace, to protect the rights of Palestinians in Gaza, the source added.\n\nTurkiye’s official Anadolu news agency reported that Fidan said efforts to deliver much-needed humanitarian aid to Gaza “would continue with determination”.","url":"https://bahamasspectator.com/hamas-disarmament-in-gaza-comes-with-some-sort-of-amnesty-us-official/","image":"https://bahamasspectator.com/app/uploads/2026/01/AFP__20251013__78K46G3__v1__HighRes__PalestinianIsraelConflictGazaHostages-1760347171-2CfEJi.jpg","video":null,"publish_date":"2026-01-27 01:38:13","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":-0.075},{"id":396405388,"title":"Republicans appeal decision that threw out GOP-controlled House district in NYC","text":"Albany, N.Y. — New York’s congressional redistricting battle is headed to the state’s highest court.\n\nRepublicans on Monday appealed a judge’s decision to toss the lines of New York City’s only GOP-controlled House seat, asking the state’s high court to take up a case that could have national reverberations in the fight for control of Congress.\n\nThe appeal came just days after a lower court judge ruled U.S. Rep. Nicole Malliotakis’ Staten Island and Brooklyn district was drawn in a way that dilutes the power of its Black and Hispanic voters. The judge ordered the state’s Independent Redistricting Commission to complete a new map by Feb. 6.\n\nThe case was filed by an election law firm aligned with the Democratic Party. It came as part of a national gerrymandering fight that started after President Donald Trump pushed to craft new congressional districts in Republican-controlled states such as Texas.\n\nIn 2022, the New York’s highest court, the Court of Appeals, rejected congressional maps that had been seen as helping Democrats and directed a court-appointed expert to redraw districts. It then threw out those maps before the 2024 congressional elections. It was not immediately clear when the Court of Appeals would take up the most recent case.\n\nThe state’s current House districts were drawn by Democrats in the state Legislature, after they rejected a proposal from the state’s bipartisan redistricting commission. New York state is currently represented in the House by 19 Democrats and 7 Republicans.","summary":"New York’s congressional redistricting battle is headed to the state’s highest court.","url":"https://www.syracuse.com/politics/2026/01/republicans-appeal-decision-that-threw-out-gop-controlled-house-district-in-nyc.html","image":"https://www.syracuse.com/resizer/v2/G6HBU7BEBZG7PNUYJZTWFTUOAM.jpg?auth=bdb7dde90fe1b4406936d4bc21fb5d4d8b96582f442e15caf5d1feb96f40452b&width=1280&smart=true&quality=90","video":null,"publish_date":"2026-01-27 01:35:37","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.688},{"id":396405768,"title":"White House Blames Minnesota Democrats For 'Tragedy' As Deadly ICE Encounters Spark Nationwide Protests","text":"New Delhi: Political tensions escalated in the United States on Monday after the White House blamed Democratic leaders in Minnesota for recent deadly encounters involving US Immigration and Customs Enforcement (ICE), even as protests spread nationwide following the killing of two civilians earlier this month. White House Press Secretary Karoline Leavitt accused elected Democrats in Minnesota of responsibility for what she described as a \"tragedy,\" naming Governor Tim Walz and Minneapolis Mayor Jacob Frey. Her remarks came shortly after President Donald Trump said on social media that he had a \"very good call\" with Walz and that they were “on a similar wavelength.” Addressing reporters, Leavitt said the incident stemmed from a \"deliberate and hostile resistance by Democrat leaders in Minnesota.\" She added that for weeks, “Gov. Walz and the mayor, Jacob Frey, and other elected Democrats were spreading lies about federal law enforcement officers who are risking their lives daily to remove the worst criminal illegal aliens from our streets.” Trump echoed her comments, urging Walz, Frey and other Democratic governors and mayors to cooperate with federal authorities, arguing that resistance from sanctuary cities had led to “division, chaos, and violence.” Through posts on Truth Social, Trump said, \"Governor Walz and Mayor Frey should turn over all Criminal Illegal Aliens that are currently incarcerated in their State Prisons and Jails to Federal Authorities, for immediate deportation,\" adding that local police must hand over arrested illegal aliens and assist federal agencies in detaining \"Illegal Aliens\" wanted for “Crimes.” He also called on Congress to end sanctuary city policies, describing them as the \"root cause\" of public safety concerns. \"American Cities should be Safe Sanctuaries for law-abiding American Citizens ONLY,\" he said. In another post, Trump alleged that under President Joe Biden, \"Tens of Millions of Illegal Alien Criminals\" entered the country, including \"Hundreds of Thousands of Convicted Murderers, Rapists, Kidnappers, Drug Dealers, and Terrorists.\" He claimed his administration had \"sealed the border\" and launched the largest deportation effort in US history. Trump said ICE arrested \"150,245\" undocumented immigrants with criminal records in Republican-led states over the past year, stating the operations occurred \"peacefully\" due to cooperation between local and federal authorities.He accused Democrats of prioritising undocumented immigrants over \"law-abiding citizens,\" blaming them for creating \"dangerous circumstances\" and for the loss of two American lives. Responding to criticism from Walz, Leavitt later posted on X, accusing him of undermining law and order. She alleged misuse of taxpayer funds in Minnesota and claimed nearly 500 undocumented immigrants with criminal records were released instead of being transferred to federal custody. She also accused Walz of spreading misinformation about federal officers and encouraging interference with immigration operations, referencing the 2020 Minneapolis unrest and blaming state leadership for allowing “violence and arson.” Walz defended Minnesota's position on X, saying the state believes in \"law and order and peace,\" while accusing the Trump administration of deploying “untrained agents.” “Trump needs to pull his 3,000 untrained agents out of Minnesota before they kill another American in the street.” CNN reported that Trump earlier said he is sending Tom Homan to Minnesota following the shooting of ICU nurse Alex Pretti during an encounter with federal agents. Federal officials have declined to provide critical details supporting their claim that an agent shot Pretti in self-defence. CNN also reported that a judge heard arguments on whether to temporarily halt the immigration crackdown, while a separate federal court hearing is scheduled today after a temporary restraining order blocked agencies from destroying or altering evidence linked to Pretti's killing. The political fallout follows two deadly ICE incidents that triggered protests in cities including Minneapolis and New York. Renee Good, 37, a mother of three, was shot on January 7 during protests against the administration's militarised raids. On January 24, Pretti was killed at point-blank range after being restrained by federal officers. Trump defended ICE's actions, suggesting Pretti may have been armed, despite reports noting he was licensed to carry a firearm and had already been disarmed. Minnesota Attorney General Keith Ellison dismissed the president's claims, calling them “flat-out insane.” The incidents have prompted legal challenges over the deployment of heavily armed, masked federal officers in Minnesota, with judges hearing arguments on whether the operations violate state sovereignty. Meanwhile, Congressional Democrats have warned they may block federal funding unless reforms are introduced to immigration enforcement practices. Also Read: 'Mother Of All Deals': India, EU Mega Trade Pact Set for Signing After 18 Years | Here's All You Need To Know","summary":"White House Press Secretary Karoline Leavitt accused elected Democrats in Minnesota of responsibility for what she described as a &quot;tragedy,&quot; naming Governor Tim Walz and Minneapolis Mayor Jacob Frey.","url":"https://www.republicworld.com/world-news/white-house-blames-minnesota-democrats-for-tragedy-as-deadly-ice-encounters-spark-nationwide-protests","image":"https://img.republicworld.com/all_images/ice-out-thousands-rally-against-ice-in-minneapolis-despite-cold-and-business-shutdowns-1769225559094-16_9.webp","video":null,"publish_date":"2026-01-27 01:26:11","author":"Asian News International","authors":["Asian News International"],"language":"en","category":"politics","source_country":"in","sentiment":-0.339},{"id":396395274,"title":"The Blogs: Did Suella Braverman and Her Party Break Britain?: Starmer Is Finishing It Off","text":"On Monday, Suella Braverman stood before a Reform UK rally and declared what she spent years denying while in government: “Britain is indeed broken.” The former Home Secretary’s defection to Nigel Farage’s insurgent party caps one of the more remarkable acts of political shamelessness in recent memory. Having served at the heart of Conservative governance for the better part of a decade, Braverman now presents herself as the cure for a disease she helped spread.\n\nThe timing is exquisite. Braverman resigned from the Conservative Party after thirty years, joining Robert Jenrick and becoming the eighth sitting MP to cross to Reform. Her justification? That immigration is out of control, public services are collapsing, and young people are fleeing the country. All true. All happening while her party held power.\n\nStart with Brexit—the revolution Braverman championed. As chair of the European Research Group, she resigned from Theresa May’s government in protest at a withdrawal agreement she deemed insufficiently pure. She helped architect the policy framework that was supposed to “take back control” of Britain’s borders. The result? Net migration peaked at 944,000 in the year ending March 2023—not under Labour, not under free movement, but under a post-Brexit Conservative government that Braverman served. The gap between rhetoric and reality became a chasm.\n\nBraverman’s own tenure as Home Secretary was marked by inflammatory language about “invasions” and “hurricanes” of migrants, yet actual policy liberalisations—expanding care worker visas, creating the graduate route, uncapping skilled worker numbers—drove record arrivals on her watch. She spoke of immigration threatening Britain’s “national character” while presiding over the largest inflows in British history. Nigel Farage himself said she was “utterly useless” at stopping Channel crossings. Now he welcomes her into his party because she admits her government “got it wrong.” That’s quite the endorsement: join us—we think you failed, but at least you’re willing to blame others.\n\nThe NHS inheritance is equally stark. Between 2010 and 2019, health spending grew by roughly 2% annually in real terms—substantially below the long-term average of nearly 4%. The result: a £13.8 billion maintenance backlog by 2024, up from £6 billion just five years earlier. Waiting lists that were manageable became monstrous. Emergency departments that once processed patients in four hours now regularly see waits measured in days. Staff shortages left Britain with fewer doctors and nurses per capita than most comparable countries. The Conservative manifesto promise to cut 5,500 NHS managers would have made things worse, not better.\n\nThe economic picture is similarly grim. The Centre for Cities calculated that the average Briton is roughly £10,200 poorer than they would have been had the economy grown at pre-2010 rates. Levelling up, that grand promise to reduce regional inequality, delivered just 10% of its promised funding while health inequality deepened. Healthy life expectancy actually fell between 2011-13 and 2020-22—by over nine months for men and fourteen months for women. As one observer noted, nothing captured the final months of Conservative rule quite like the daily headlines about sewage overflowing into Britain’s rivers. Managed decline made literal.\n\nNow Braverman tells us she was “sacked and punished for telling the truth.” The revisionism is breathtaking. This is a politician who resigned from Liz Truss’s cabinet for breaching the ministerial code—sending Cabinet documents via personal email—only to be reinstated by Rishi Sunak six days later. She was then sacked again by Sunak in November 2023 after calling homelessness a “lifestyle choice” and accusing police of being too lenient with “hate marchers.” Her critics blamed her rhetoric for inflaming tensions when far-right protesters clashed with police and tried to confront pro-Palestinian demonstrators. These were not suppressed truths. They were broadcast from the Home Office while her party did nothing to address the underlying failures.\n\nThe ideological journey has been equally tortured. In January 2025, Braverman attended Donald Trump’s inauguration wearing a MAGA cap. Later that month, delivering the Margaret Thatcher lecture at the Heritage Foundation in Washington, she mused about whether Britain could become “the first Islamist nation with nuclear weapons”—a statement she acknowledged was unrealistic but floated anyway. In February 2025, she published an article declaring that despite being born and educated in England, she could never be “truly English” because national identity “must be rooted in ancestry, heritage, and, yes, ethnicity—not just residence or fluency.”\n\nConsider the contradictions embedded in that claim. Braverman is the daughter of immigrants from Mauritius and Kenya who came to Britain in the 1960s. She has described herself as a “child of the British Empire” and defended that empire as “a force for good.” Her parents arrived, she says, “with an admiration and gratitude for what Britain did.” Yet she now argues that their daughter cannot claim English identity because she lacks the requisite bloodline. This is not conservatism. It is an identity politics of despair dressed as philosophy—and it comes from someone seeking leadership of a movement that claims to oppose identity politics.\n\nThe Conservative response to her departure—that it was “always a matter of when, not if”—reveals the hollowness on both sides. They knew she was never loyal to them. She knew they were never capable of delivering what she claimed to want. The marriage was always one of mutual convenience, and now both partners are pretending they were the aggrieved party. The Tory statement even noted that Farage “originally said he didn’t want her in his party.” Both sides are engaging in mutual opportunism, principles be damned.\n\nLabour’s Anna Turley offered the most cutting assessment: Farage is “stuffing his party full of the failed Tories responsible for the chaos and decline that held Britain back for 14 years.” The Liberal Democrats’ Daisy Cooper put it more bluntly: Braverman suffers from “selective amnesia—one who complains about broken Britain while conveniently forgetting they helped break it.”\n\nThis gets to the heart of the matter. Braverman and her fellow defectors are not offering Britain an alternative to Conservative failure. They are offering the same personnel with louder rhetoric. Jenrick served as Immigration Minister. Braverman was Home Secretary and Attorney General. If they couldn’t deliver their vision with the power they held, why should anyone believe they’ll deliver it with Farage? The revolution they promise is simply their own rehabilitation.\n\nThe uncomfortable truth is that Britain’s problems are structural and long-gestating. They required serious investment, strategic patience, and political courage over decades. Instead, Britain got Brexit chaos, five prime ministers in eight years, a 49-day government that crashed the economy, and a governing party more interested in internal warfare than national governance. The Conservatives’ 2024 election result—their worst in nearly 200 years—was not an accident. It was a verdict.\n\nDoes this mean the Conservative Party alone broke Britain? Not entirely. Labour’s pre-2010 governments made their own mistakes. The global financial crisis was not made in Westminster. COVID-19 devastated health systems worldwide. But the Conservatives had fourteen years to address underlying weaknesses. Instead, they exacerbated them while promising transformation. YouGov polling found that half the public believes the Conservatives still don’t understand why they lost. Among Reform voters, that figure rises to 53%. Even 28% of people who voted Conservative aren’t convinced the party grasps the scale of its failure.\n\nBraverman’s defection reveals something important about the current political moment. The right is fragmenting not because it lacks power but because it lacks answers. Reform UK’s promise to “fix our country, reclaim our power, rediscover our strength” is magnificent as rhetoric but empty as policy. Their diagnosis—that Britain is broken—is accurate. Their prescription—that Suella Braverman and her ilk can fix it—is laughable.\n\nBritain does need renewal. It needs investment in healthcare, housing, and infrastructure. It needs an honest conversation about trade-offs in immigration policy. It needs political leaders who level with the public about what government can and cannot achieve. What it does not need is the same politicians who presided over decline now presenting themselves as revolutionary change-makers.\n\nBraverman told the Reform rally, “I feel like I’ve come home.” Perhaps she has. A party built on grievance has found a politician built on the same. But Britain’s problems will not be solved by people whose primary talent is identifying scapegoats. The country needs builders, not arsonists rebranding as firefighters.\n\nBritain may indeed be broken. But if so, the breakage has Braverman’s fingerprints all over it. Her journey from Cabinet minister to Reform UK defector is not a story of principled awakening. It is a story of opportunism seeking new vehicles. The costume has changed. The performance continues.","url":"https://blogs.timesofisrael.com/did-suella-braverman-and-her-party-break-britain-starmer-is-finishing-it-off/","image":"https://static-cdn.toi-media.com/blogs/uploads/users/image-11733199174-400x400.jpg","video":null,"publish_date":"2026-01-27 01:26:00","author":"Vincent James Hooper","authors":["Vincent James Hooper"],"language":"en","source_country":"il","sentiment":-0.188},{"id":396406468,"title":"Trump Hikes Tariffs On South Korean Goods To 25%, Citing Trade Deal Dispute","text":"US President Donald Trump announced that he is raising tariffs on South Korean imports to 25%, up from 15%, blaming Seoul’s legislature for failing to ratify a trade agreement reached last year.\n“Because the Korean Legislature hasn’t enacted our Historic Trade Agreement, which is their prerogative, I am hereby increasing South Korean TARIFFS on Autos, Lumber, Pharma, and all other Reciprocal TARIFFS, from 15% to 25%,” Trump declared in a post on his social media platform Truth Social.\nSouth Korea ranks among America’s top 10 trading partners, with US companies and consumers importing nearly $150 billion worth of Korean goods annually- from automobiles and electronics to pharmaceuticals and lumber.\nWhat Happened To Trade Deal Between US And South Korea?\nTrump first announced a breakthrough trade agreement with South Korea’s president in July but negotiations dragged on for months over disagreements on US-backed investment commitments. The deal was finally sealed in October during Trump’s Asia tour, when he and South Korean President Lee Jae Myung agreed to a framework that included Seoul’s pledge to invest $350 billion in the United States. In November, both governments released a joint fact sheet detailing implementation steps. The agreement had lowered tariffs on both sides, capping US duties on Korean imports at 15%- a reduction from the 25% rate Trump had announced on his self-declared “Liberation Day” in April, which sent global markets into turmoil.\nTrump’s aggressive trade strategy has been marked by numerous tariff threats- many of which never materialized. Recent examples include a proposed 10% duty on Canadian imports following an anti-tariff advertisement in Ontario, threatened tariffs on European nations over Greenland and a 100% tariff on Canada floated just last weekend.\nTrump has openly acknowledged using tariffs as diplomatic weapons as last week, he admitted imposing higher duties on Switzerland simply because its president “rubbed me the wrong way.”\nThe legality of Trump’s sweeping tariff agenda is currently under review by the US Supreme Court.","summary":"Trump first announced a breakthrough trade agreement with South Korea's president in July but negotiations dragged on for months.","url":"https://www.news18.com/world/trump-hikes-tariffs-on-south-korean-goods-to-25-citing-trade-deal-dispute-ws-l-9857693.html","image":"https://images.news18.com/ibnlive/uploads/2026/01/trump-1-2026-01-f77677280938b2f35231310abf0fc6c5.jpg","video":null,"publish_date":"2026-01-27 01:25:08","author":"Mallika Soni,News18","authors":["Mallika Soni","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.28},{"id":396403666,"title":"Comment on Nigeria rejects Trump’s allegations of Christian genocide by the brain song","text":"ABUJA: Nigeria has strongly dismissed U.S. President Donald Trump’s claims of a “genocide” against Christians, calling the accusations unfounded and politically motivated, even as Trump suggested the possibility of U.S. military intervention in the West African country.\n\nIn a statement on Sunday, Trump indicated that he was considering “a range of military options,” including the deployment of troops or air strikes, to stop what he described as the “mass killings of Christians” in Nigeria. “They’re killing Christians and killing them in very large numbers. We’re not going to allow that to happen,” Trump said while speaking to reporters aboard Air Force One. When asked about sending U.S. troops or launching strikes, he responded, “Could be, I mean, a lot of things — I envisage a lot of things.”\n\nNigeria’s government quickly rejected the accusations, asserting that the violence in the country is not based on religion but is part of broader challenges involving terrorism and banditry. Kimiebi Imomotimi Ebienfa, a spokesperson for Nigeria’s Ministry of Foreign Affairs, emphasized in an interview with Al Jazeera, “We are not proud of the security situation that we are passing through, but to go with the narrative that only Christians are targeted — no, it is not true. There is no Christian genocide in Nigeria.”\n\nEbienfa explained that attacks from groups such as Boko Haram and al-Qaeda-linked militants affect people of all faiths, including Muslims and traditional worshippers. “The killings were not restricted to Christians alone. Muslims are being killed. Traditional worshippers are being killed… The majority is not the Christian population,” he said.\n\nWhile Nigeria reaffirmed its commitment to working with international partners, the government also warned that any U.S. intervention should respect the country’s sovereignty. “We are ready to work with partners to fight terrorism, but not any passive action that will undermine the sovereignty of our country,” Ebienfa added.\n\nDaniel Bwala, an adviser to President Bola Tinubu, echoed these sentiments, telling Reuters that Nigeria would welcome U.S. assistance, as long as it recognizes the country’s territorial integrity. Despite Trump’s labeling of Nigeria as a “disgraced country,” Bwala downplayed the comments, noting, “We don’t take it literally, because we know Donald Trump thinks well of Nigeria. I am sure by the time these two leaders meet and sit, there would be better outcomes in our joint resolve to fight terrorism.”\n\nTrump’s remarks came a day after the U.S. reinstated Nigeria on its list of “Countries of Particular Concern” for alleged violations of religious freedom, alongside countries like China, North Korea, Russia, Myanmar, and Pakistan.\n\nNigeria, with a population of over 200 million, is divided between a predominantly Muslim north and a largely Christian south. The country has faced insurgencies from Boko Haram and the Islamic State’s West Africa Province (ISWAP) for more than 15 years, leading to tens of thousands of deaths and widespread displacement.\n\nPresident Tinubu, a Muslim married to a Christian pastor, has rejected claims of religious persecution. He emphasized that his administration supports inclusivity, pointing to the recent appointment of a Christian as Nigeria’s new defence chief as evidence of his commitment to equality and balance.","summary":"I wanted to thank you for this great read!! I definitely enjoying every little bit of it I have you bookmarked to check out new stuff you post…","url":"https://www.pakistantoday.com.pk/2025/11/03/nigeria-rejects-trumps-allegations-of-christian-genocide/","image":"https://www.pakistantoday.com.pk/wp-content/uploads/2025/11/nigeria.jpg","video":null,"publish_date":"2026-01-27 01:24:44","author":"Agencies,the brain song","authors":["Agencies","the brain song"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.258},{"id":396404920,"title":"Trump Takes Personal Revenge on ICE Goon for Minneapolis Disaster","text":"Border Patrol official Gregory Bovino will reportedly be leaving Minneapolis, and the Department of Homeland Security has even suspended his access to his official social media accounts. \n\nBovino and some of his agents, CNN reported on Monday, will return to their sectors a few days after federal immigration agents shot and killed another U.S. citizen in Minneapolis. \n\nThe DHS has also blocked Bovino from his social media accounts, effective immediately, according to the outlet. \n\nEarlier Monday, President Donald Trump announced White House border czar Tom Homan would lead ICE operations in Minneapolis. \n\nThe DHS did not immediately respond to a request for comment from the Daily Beast.","summary":"Stephen Maturen / Getty ImagesBorder Patrol official Gregory Bovino will reportedly be leaving Minneapolis, and the Department of Homeland Security has even suspended his access to his official social media accounts. \n\nBovino and some of his agents, CNN reported on Monday, will return to their sectors a few days after federal immigration agents shot and killed another U.S. citizen in Minneapolis. \n\nBovino’s exit from the state, where immigration enforcement activities have resulted thus far in two deaths and widespread protests, was a “mutual decision,” one official told CNN. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-takes-personal-revenge-on-ice-goon-for-minneapolis-disaster/","image":"https://www.thedailybeast.com/resizer/v2/HCE2XAV76FHKNEG26ENYTRQKQA.jpg?smart=true&auth=ff2239fdcebe3d91e944e0f10463450aab1f28588e352c5dc980652929934c23&width=1440&height=1080","video":null,"publish_date":"2026-01-27 01:23:49","author":"William Vaillancourt","authors":["William Vaillancourt"],"language":"en","category":"politics","source_country":"us","sentiment":0.155},{"id":396403904,"title":"Explained -  Is the India-EU Trade Deal Done and When Will It Come Into Effect?","text":"India and the European Union have formally concluded negotiations on their long-pending Free Trade Agreement, marking a major milestone in bilateral economic relations. The announcement, made by commerce secretary Rajesh Agrawal on Monday, comes on the sidelines of high-level diplomatic engagements during the EU leadership’s visit to New Delhi for India’s 77th Republic Day and the 16th India-EU Summit. ,While the deal will be officially announced on January 27, the negotiations themselves are now complete, setting the stage for one of the world’s largest trade partnerships.,Also Read | At Kartavya Path, A Signal To Washington: Reading EU Chief Ursula von der Leyen's Republic Day Visit,What has been finalised and what happens next,,According to Agrawal, the negotiations have been successfully wrapped up and the text of the agreement has been finalised. “Negotiations have been successfully concluded. The deal has been finalised. It will propel trade and investments in both economies,” he said. Calling the agreement “balanced and forward-looking,” Agrawal added that it would help improve India’s economic integration with the EU.,However, the agreement will not come into force immediately. Agrawal clarified that the legal scrubbing of the text will take about five to six months. This process involves lawyers from both sides reviewing the document to ensure consistency across languages and legal frameworks. “The deal will come into force sometime next year. Legal scrubbing of the text will take 5-6 months; formal signing will be done post that,” he said.,Also Read | ‘Financing War Against Themselves’: As India, EU Seal Trade Pact, US Hits Out at Europe Over Oil From New Delhi,Once the legal process is completed, the agreement will be formally signed and will then require ratification through the respective domestic procedures of India and the EU.,Why the deal was fast-tracked,,The push to conclude the agreement gathered momentum after Prime Minister Narendra Modi and European Commission President Ursula von der Leyen agreed last year to fast-track negotiations. Talks between India and the EU had been relaunched in 2022 after a nine-year pause, but global trade disruptions and geopolitical shifts added urgency to the process.,Also Read | Is Trump Set to Roll Back 25% Tariffs on India? US Treasury Chief Drops Hint,The negotiations also accelerated after US President Donald Trump imposed import tariffs on several trading partners, prompting both India and the EU to diversify trade relationships. An India-US trade deal has since remained unresolved, making the EU partnership strategically important for New Delhi.,During the final stages, both sides were engaged in intense negotiations over sensitive sectors. According to Reuters, the EU pushed for sharp cuts in India’s import duties on cars, which currently exceed 100 percent. India, meanwhile, sought relief from EU trade curbs on its steel exports. Reuters reported that India was planning to slash tariffs on cars imported from the EU to 40 percent from levels as high as 110 percent as part of the agreement. At the same time, some sensitive farm and dairy products were kept out of the deal, with New Delhi stressing the need to protect farmers.,What the EU says about the scale of the agreement,,European Union Trade Commissioner Marcos Sefcovic described the agreement as potentially transformative. In an interview with Euro News ahead of the summit, he referred to it as the “mother of all deals,” echoing Ursula von der Leyen’s words. He said negotiators were “checking their final numbers” as the EU seeks reductions in India’s steep import duties, which can go up to 150 percent in certain sectors.,Also Read | Why The EU Trade Deal Has India’s Auto Stocks On Edge,Sefcovic noted that the agreement would create a free trade area covering nearly 2 billion people and significantly open the Indian market to European companies, while excluding sensitive sectors to ensure a “positive outcome.” “This is the largest trade deal ever,” he said, highlighting that around 6,000 European firms already operate in India and that bilateral trade has grown sharply over the past decade.,Brussels views the pact as a strategic move to diversify trade away from over-dependence on the United States and China. Indian officials, for their part, have signalled openness to foreign investment and imports in key sectors.,(With Inputs from PTI, ANI, Reuters),For the Latest news, India News and breaking stories from around the world, visit Times Now for live coverage and in-depth reporting.","summary":"India and the European Union have concluded negotiations on a landmark Free Trade Agreement that is set to be signed after legal review and come into force next year.","url":"https://www.timesnownews.com/india/explained-india-eu-trade-talks-conclude-signing-today-to-take-effect-next-year-article-153511105","image":"https://images.timesnownews.com/thumb/msid-153511111,thumbsize-83992,width-1280,height-720,resizemode-75/153511111.jpg","video":null,"publish_date":"2026-01-27 01:23:14","author":"Sudhanshu Mishra","authors":["Sudhanshu Mishra"],"language":"en","source_country":"in","sentiment":-0.056},{"id":396404808,"title":"Trump slaps Asian trade partner with 25% tariff","text":"President Donald Trump announced a sudden increase in tariffs on key South Korean imports, including automobiles, lumber and pharmaceuticals, raising duties from 15% to 25%.\n\nThe decision, communicated via his Truth Social platform on Monday, directly accuses the South Korean legislature of failing to ratify a “historic” trade and investment agreement that was finalized with President Lee Jae Myung in October 2025.\n\nTrump stated that while the US had swiftly reduced its tariffs as part of the deal, Seoul had not lived up to its commitment, necessitating the punitive measure.\n\n“President Lee and I reached a Great Deal for both Countries... Why hasn’t the Korean Legislature approved it?” Trump wrote.\n\nSouth Korea’s presidential office said it has yet to receive any official notification from Washington and announced that the trade minister would travel to the United States for urgent discussions.\n\nThe crisis centers on a deal first announced in July 2025, which offered to lower US tariffs from 25% to 15% in exchange for substantial South Korean concessions, including a pledge to invest $350 billion in the United States. However, the deal has been stalled in South Korea’s National Assembly, where it faces significant political and economic scrutiny.\n\nPresident Lee Jae Myung has publicly warned that the investment demand, particularly if fulfilled in cash, could trigger a severe liquidity crisis. He has drawn parallels to the 1997 Asian Financial Crisis, during which South Korea nearly exhausted its foreign currency reserves and required a major International Monetary Fund bailout.\n\nThis move against a major Asian ally is consistent with Trump’s broader “America First” trade strategy, which uses the threat of steep tariffs as leverage to secure investment pledges and favorable terms from trading partners.\n\nSimilar tactics have been employed in negotiations with the European Union, which pledged to invest $600 billion in the US and purchase $750 billion worth of American energy. Last week, the European Parliament halted approval of the deal, citing Trump’s “continued and escalating threats” against the bloc, including his plan to annex Greenland.","summary":"President Donald Trump has announced a sudden increase in tariffs on key South Korean imports from 15% to 25% \nRead Full Article at RT.com","url":"https://www.rt.com/news/631561-trump-south-korea-tariffs/","image":"https://mf.b37mrtl.ru/files/2026.01/article/697812a32030273b27133202.jpg","video":null,"publish_date":"2026-01-27 01:20:50","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.236},{"id":396404800,"title":"Florida Nurse Fired For Wishing Birth Complications On Trump's Press Secretary","text":"A Florida nurse has been fired after posting a viral social media video wishing for President Donald Trump’s press secretary Karoline Leavitt to be seriously injured during childbirth. \n\nThe nurse, identified as Lexie Lawler, was let go from Baptist Health Boca Raton Regional Hospital after recording herself in a TikTok video saying she hopes Leavitt suffers a fourth-degree tear during childbirth with long-term complications. \n\nLeavitt is currently expecting her second baby with husband Nicholas Riccio. \n\n“As a labor and delivery nurse, it gives me great joy to wish Karoline Leavitt a fourth-degree tear,” Lawler said in the since-deleted TikTok, according to multiple outlets. “I hope that you fucking rip from bow to stern and never shit normally again, you cunt.”\n\nA spokesperson for Baptist Health Boca Raton Regional Hospital later confirmed Lawler’s termination in a Jan. 23 statement to local news outlets WPTV and CBS 12. \n\n“The comments made in a social media video by a nurse at one of our facilities do not reflect our values or the standards we expect of health care professionals,” the hospital spokesperson said. “Following a prompt review, the individual is no longer employed by our health system.”\n\nThe spokesperson added that though the hospital respects the right to personal opinions, “There is no place in health care for language or behavior that calls into question a caregiver’s ability to provide compassionate, unbiased care.” \n\nBoca Raton Mayor Scott Singer condemned Lawler’s comments in a post on X on Jan. 22.\n\n“I was in touch with hospital leadership as soon as I learned this afternoon and have been informed that this person is no longer employed there,” the spokesperson wrote alongside a clip of the nurse’s remarks. “These disgusting comments have no place in medicine or in our community.”\n\nThe White House and the Baptist Health Boca Raton Regional Hospital didn’t immediately respond to HuffPost’s request for comment. \n\nFlorida Attorney General James Uthmeier urged the Florida Board of Nursing to revoke Lawler’s license in a statement to Fox News.\n\n“Women shouldn’t have to worry about a politically-driven nurse who wishes them pain and suffering being in the delivery room during childbirth,” Uthmeier told the outlet. \n\nHe added, “It’s evil. The Florida Board of Nursing must take action to keep this person away from patients permanently.”\n\nLawler defended herself against critics in a separate video on Monday after her firing, according to People.\n\n“So they just murdered a man in Minnesota,” she said in reference to ICU nurse Alex Pretti who was fatally shot on Saturday by Border Patrol agents.\n\nLawler added, “They murdered a man in Minnesota, and you motherfuckers are coming after me because I used bad language. Fuck you. I’m on the right side of this. Fuck you.”","url":"https://www.huffpost.com/entry/fired-florida-nurse-wished-childbirth-injury-karoline-leavitt_n_69779da9e4b0f29d0e087712?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6977fd9d1b0000035e6fdf97.jpeg?cache=YCYgrSC0L3&ops=1778_1000","video":null,"publish_date":"2026-01-27 01:18:49","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.154},{"id":396404908,"title":"Threats, tension as massive US warship arrives in Middle East","text":"One of the US's biggest warships has been deployed to the Middle East, prompting threats of a response by local militias.\n\nThe USS Abraham Lincoln is in the region in the Indian Ocean, US Central Command said on social media.\n\n\"The Abraham Lincoln Carrier Strike Group is currently deployed to the Middle East to promote regional security and stability,\" the command said in a post on X.\n\nREAD MORE: Trump appears to back down as crisis hits breaking point﻿\n\nBut it may end up doing the opposite if the response from Iran-backed militias are anything to go by.\n\nThe Abraham Lincoln's strike group, also designated as Carrier Strike Group 3, consists of the aircraft carrier, a guided missile cruiser, and two guided missile destroyers.\n\nUS President Donald Trump said the ships were headed to the Middle East region \"just in case\".\n\nREAD MORE: UN calls on Australia to do better on human rights\n\n﻿\"We have a massive fleet heading in that direction, and maybe we won't have to use it,\" he said.﻿\n\nThere has been no US aircraft carrier presence in the area since the USS Gerald Ford was ordered to rendeszvous to the Caribbean last October, where the US was building a significant military presence to put pressure on the then-regime of Nicolas Maduro in ﻿Venezuela.\n\nTrump had previously threatened Iran with military action over the regime's deadly crackdown on mass protests in the country, triggered by a failing economy itself crippled largely by US sanctions.\n\nREAD MORE: Pair charged after allegedly smuggling heroin worth $32 million from China﻿\n\nTrump appeared mollified by Tehran's notice that no prisoners taken would be executed – a notice the country's top prosecutor has disputed – though there are claims tens of thousands of protesters could have been killed on the streets by government forces.\n\nOn the weekend, the US State Department also revealed it was imposing extra sanctions on eight Iranian entities and nine vessels in the country's \"shadow fleet\", which the department accused of transporting hundreds of millions of dollars worth of petrol to help finance the Iranian regime.﻿\n\nLocal militias vow reprisal\n\nOvernight, Yemen's Iranian-backed Houthi rebels hinted they were ready to resume attacks on shipping in the Red Sea.\n\nThat came just after Iraq's Kataib Hezbollah paramilitary group, long supported by Iran's paramilitary Revolutionary Guard, issued a direct threat late on Sunday toward any attack targeting Iran, warning a \"total war\" in the region would be a result.\n\nThe statements came as the entire region is mired in a tense waiting game to see if Trump will strike.\n\nBoth the Houthis and Kataib Hezbollah sat out from Israel's 12-day war on Iran in June that saw the United States bomb Iranian nuclear sites.\n\nThe hesitancy to get involved shows the disarray still affecting Iran's self-described \"Axis of Resistance\" after facing attacks from Israel during its war on Hamas in the Gaza Strip.﻿\n\nThe Lebanese militant group Hezbollah, one of Iran's staunchest allies, refused to say how it planned to react in the case of a possible attack.\n\n\"During the past two months, several parties have asked me a clear and frank question: If Israel and America go to war against Iran, will Hezbollah intervene or not?\" Hezbollah leader Sheikh Naim Kassem said via a video address to thousands of supporters gathered in Beirut's southern suburbs for a rally backing Iran.\n\nHe said the group is preparing for \"possible aggression and is determined to defend\" against it.\n\nBut as to how it would act, he said, \"these details will be determined by the battle and we will determine them according to the interests that are present\".\n\n– with Associated Press.﻿\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.\n\nDownload the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here","url":"https://www.9news.com.au/world/middle-east-us-iran-tensions-new-aircraft-carrier-in-indian-ocean/c5ec9aae-e09e-4b00-85ec-918f4af2cbe0","image":"https://imageresizer.static9.net.au/iBeb7B7prPUMlLl3Z8YYdND_ayg=/0x182:3500x2150/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Faf40c920-6717-45b1-930c-c62667efcf5b","video":null,"publish_date":"2026-01-27 01:15:21","author":"Adam Vidler","authors":["Adam Vidler"],"language":"en","category":"politics","source_country":"au","sentiment":-0.139},{"id":396402238,"title":"Ilhan Omar accuses Trump of ulterior motive for ICE raids — and JD Vance shuts her down","text":"Democratic Rep. Ilhan Omar of Minnesota claimed that President Donald Trump's true aim with the surge in Minnesota had to do with rigging elections, and Vice President JD Vance issued a brutal rebuke.\n\nOmar said that Trump was trying to gain possession of voter rolls in order to rig the upcoming midterm election that could stall the president's agenda for the rest of his term.\n\n'This was never about immigration or fraud.'\n\n\"'ICE will leave Minnesota if you hand over your voter rolls' tells you everything you need to know. This was never about immigration or fraud. It was always about rigging elections,\" Omar posted on social media.\n\nShe was referring to reports that U.S. Attorney General Pam Bondi had included in her demands from the state the requirement that they hand over voter rolls. Minnesota Secretary of State Steve Simon responded on Sunday with an unequivocal \"no.\"\n\nVance reposted Omar's message and offered a satirical translation of what she really meant, according to his estimation.\n\n\"'We really want illegal aliens to vote in elections and will riot to ensure that it is so,'\" he posted.\n\nTrump said Monday that he had a phone call with Minneapolis Mayor Jacob Frey (D), and the mayor laid out the agreements they made. He said that some of the federal agents would leave Minneapolis and that he would continue to seek for all of them to leave.\n\nThe White House said that border czar Tom Homan would be sent to Minneapolis to look over the operations after Border Patrol Chief Gregory Bovino agreed to leave the city.\n\nRELATED: More UNHINGED anti-ICE extremist footage: 'I am a liberal, leftist, pagan, lesbian, transgender woman, and witch!'\n\nDemocrats have begun publicly voicing a plan to block a bill to fund Immigration and Customs Enforcement in order to oppose the president's mass deportation policies. If they are unable to reach a compromise, it may result in a partial government shutdown. \n\n\"Government funding expires at the end of the week, and Republicans are determined to not have another government shutdown,\" said a Senate Republican spokesperson about the disagreement. \"We will move forward as planned and hope Democrats can find a path forward to join us.\" \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/ilhan-omar-ice-jd-vance","image":"https://www.theblaze.com/media-library/ilhan-omar-accuses-trump-of-ulterior-motive-for-ice-raids-and-jd-vance-shuts-her-down.jpg?id=63305841&width=1200&height=600&coordinates=0%2C125%2C0%2C125","video":null,"publish_date":"2026-01-27 01:15:00","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":-0.194},{"id":396403264,"title":"Gold surges past USD5,100","text":"LONDON: Gold prices marched to record levels above USD5,100 on Monday, as investors sought a safe haven amid international political tension, and silver and platinum also scaled all-time highs.\n\nSpot gold was up 1.9 percent at USD5,076.43 an ounce by 11:37 a.m. ET (1637 GMT) after hitting a record $5,110.50. US gold futures for February delivery gained 1.9 percent to USD5,074.10.\n\n“Gold prices continue to be supported by elevated geopolitical and economic uncertainty. Central banks remain strong buyers as they diversify foreign exchange reserves and reduce reliance on the US dollar,” said Ryan McIntyre, president at Sprott Inc.\n\n“In addition, investor inflows into physically backed exchange-traded funds have resumed, with holdings up approximately 20 percent year over year,” McIntyre added.\n\nTrump’s 100% Tariff Threat On Canada\n\nIn the latest geopolitical flare-up, US President Donald Trump said on Saturday he would impose a 100 percent tariff on Canada if it follows through on a trade deal with China.\n\nFor precious metals this year, the major drivers are going to be “Trump and Trump,” said Adrian Ash, head of research at online marketplace BullionVault.\n\n“A wave of new first-time investing is driving this move in precious metals. It’s led by private investors across Asia and Europe, rushing to build their personal holdings of gold and silver.”\n\nThe possibility that a coordinated currency intervention by US and Japanese authorities could be imminent was another focus of investor attention.\n\nAt the same time, this week’s Federal Reserve meeting, when the central bank is expected to hold rates steady, is overshadowed by a Trump administration criminal investigation of Fed chairman Jerome Powell.\n\nTrump has placed pressure on Powell to lower interest rates.\n\nThat would be supportive for non-yielding gold, which has risen 18 percent so far this year after gaining 64 percent in 2025.\n\nLast year, gold breached major milestones, including USD3,000/oz and USD4,000/oz for the first time.\n\nGold may reach Usd6,000/Oz by year-end, some analysts say\n\nAnalysts at Societe Generale anticipate gold will reach USD6,000/oz by year-end, though they caution this may be a conservative estimate with scope for further gains. Meanwhile, Morgan Stanley said the rally could continue, highlighting a bull-case target of USD5,700.\n\nSpot silver scaled a new record high of USD113.61 an ounce. Prices broke the USD100 mark on Friday as retail investor and momentum-driven buying added to tightness in physical markets for the precious and industrial metal.\n\n“Momentum is strong, with Chinese silver prices at a notable premium to London prices, indicating further gains in the short term are possible. However, such high prices should reduce industrial demand,” said UBS analyst Giovanni Staunovo.\n\nSpot platinum rose by 3 percent to USD2,849.60 an ounce after touching a record USD2,918.80 while spot palladium climbed by 6.2 percent to USD2,135.22, the highest levels since 2022.","summary":"LONDON: Gold prices marched to record levels above USD5,100 on Monday, as investors sought a safe haven amid international political tension, and silver and platinum also scaled all-time highs.\n\n\nSpot gold was up 1.9 percent at USD5,076.43 an ounce by 11:37 a.m. ET (1637 GMT) after hitting a record $5,110.50. US gold futures for February delivery gained 1.9 percent to USD5,074.10.\n\n\n“Gold prices continue to be supported by elevated geopolitical and economic uncertainty. Central banks remain strong buyers as they diversify foreign exchange reserves and reduce reliance on the US dollar,” said Ryan McIntyre, president at Sprott Inc.\n\n\n“In addition, investor inflows into physically backed exchange-traded funds have resumed, with holdings up approximately 20 percent year over year,” McIntyre added.\n\n\nTrump’s 100% Tariff Threat On Canada\n\n\nIn the latest geopolitical flare-up, US President Donald Trump said on Saturday he would impose a 100 percent tariff on Canada if it follows through on a trade deal with China.\n\n","url":"https://www.brecorder.com/news/40404248/gold-surges-past-usd5100","image":"https://i.brecorder.com/large/2026/01/2706123908ade8d.webp","video":null,"publish_date":"2026-01-27 01:13:06","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.029},{"id":396405416,"title":"Former DHS secretary says Trump's choice to send 'border czar' Tom Homan to Minnesota is 'stroke of genius'","text":"Former acting DHS Secretary Chad Wolf praised President Donald Trump's decision to send \"border czar\" Tom Homan to handle unrest in Minneapolis Monday on \"The Story with Martha MacCallum.\" \"Having the president send Tom Homan up there is just a stroke of genius,\" Wolf said. \"I think Tom is exactly the right person. Why? Because he is also in career law enforcement, he’s an operator. He knows exactly what needs to be done there, and where is the give-and-take – where can we get a win for both so that you can bring the violence and the chaos down but that ICE can continue to do their mission.\" Trump announced Monday that he was sending Homan to Minnesota, noting he will report \"directly to me\" and will help lead the Immigration and Customs Enforcement (ICE) operations in Minneapolis and St. Paul. \"I am sending Tom Homan to Minnesota tonight. He has not been involved in that area, but knows and likes many of the people there. Tom is tough but fair, and will report directly to me,\" Trump wrote on his Truth Social platform. White House press secretary Karoline Leavitt, noted during a press briefing Monday that Homan is the point person for coordinating cooperation between state and local authorities. She recalled that Homan was praised by the Washington Post years ago for his work under then-President Barack Obama, who had given him a 2015 Presidential Rank Award for Distinguished Service. BORDER PATROL COMMANDER GREGORY BOVINO TO LEAVE MINNESOTA, AS TOM HOMAN TAKES OVER Some critics see Trump's move as a top-down strategic political shakeup as ICE leadership faces criticism not only for its handling of unrest in Minneapolis, but for how Homeland Security Secretary Kristi Noem has spoken about the fatal shooting of activist Alex Pretti on Saturday. Pretti, a nurse at Minneapolis' Veterans Affairs Medical Center, was shot and killed by a Border Patrol agent during a demonstration against Trump's immigration crackdown. Noem said it appeared Pretti \"arrived at the scene to inflict maximum damage on individuals and to kill law enforcement.\" \"An individual approached U.S. Border Patrol officers with a 9mm semiautomatic handgun. The officers attempted to disarm this individual, but the armed suspect reacted violently. Fearing for his life and for the lives of his fellow officers around him, an agent fired defensive shots,\" she said. Critics have disputed Noem's characterization of the shooting. However, Leavitt said, Trump still believes in his Homeland Security secretary. \"We just heard from Karoline Leavitt that the president has confidence in Kristi Noem, but as someone who was in the former administration, what do you think?\" Fox News anchor Martha MacCallum asked Wolf. \"Do you think we’re going to see changes made in personnel?\" \"We certainly could,\" Wolf replied. \"Look, here’s what I will tell you. Those DHS law enforcement officers at ICE, at CBP, they absolutely love President Trump, and why? Because he has their back. He supports them. That being said, a lot of these officers, obviously, this is their career and what they do and the vast majority of their operations are done out of sight. They are not going on CNN and Fox and elsewhere all day, every day, and so I think they [administration officials] are always concerned. ‘Is this getting out of control? Are we politicizing what they do, which is just enforcing the law?’ It’s not political in their minds. It’s just simply the law is immigration enforcement and this is what we are doing. So, if there are concerns, those are likely it.\" LEAVITT SAYS TRUMP SPOKE TO WALZ, DEMANDS MINNESOTA 'WORK TOGETHER PEACEFULLY' WITH ICE: 'LET COPS BE COPS' Wolf suggested that Homan could bridge the divide between federal authorities and local law enforcement officials. \"I think it’s important to remember, ICE is there to arrest criminal illegal aliens, and it’s much better to do that with local law enforcement,\" he said. \"So if Tom Homan can get local law enforcement involved in assisting ICE, however that looks – whether that’s protecting them while they do the mission, whatever it might be – I think that’s a win.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP","summary":"Former DHS Secretary Chad Wolf calls President Donald Trump&apos;s decision to send &quot;border czar&quot; Tom Homan to Minnesota a &quot;stroke of genius&quot; for deportations.","url":"https://www.foxnews.com/media/former-dhs-secretary-says-trumps-choice-send-border-czar-tom-homan-minnesota-stroke-genius","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/tom-homan-interview.jpg","video":null,"publish_date":"2026-01-27 01:10:37","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"US","sentiment":0.21},{"id":396404016,"title":"US businesses break their silence after latest  Minnesota ICE shooting","text":"NYT News ServiceMinnesota: Demonstrators protest the Trump administration's crackdown on immigration at the Minneapolis-St. Paul International Airport in St. Paul. (Photo: David Guttenfelder/ The New York Times)\n\nNEW YORK: After weeks of silence, corporate executives in the past 24 hours have spoken up about the heavy immigration enforcement ⁠actions in Minnesota after federal agents shot and killed a protester in Minneapolis over the weekend, the second such shooting this month. The comments - including a signed statement from more than 60 Minnesota-based CEOs and a video from Target's incoming chief executive - do not levy criticism at President Donald Trump or U.S. Immigration and Customs Enforcement, but show how the broader public is turning against the administration's actions. Businesses have been reticent to criticize Trump during his second term. Since the ‌outset of \"Operation Metro Surge\" ‌in Minneapolis in December, major Minnesota corporations have been largely silent on the effects of immigration enforcement efforts on the city, a liberal Midwestern stronghold as well as a major corporate hub. The shooting of Alex Pretti on Saturday - and comments from the Trump administration labeling the ‌37-year-old nurse a \"domestic terrorist\" with an intent to harm law enforcement - appeared to mark a sea change. On Sunday, more than 60 CEOs, including the leaders of 3M, UnitedHealth Group and General Mills, released a statement calling for de-escalation.\"Even though I wish the letter was stronger, I think it's an important signal that Operation Metro Surge is losing its social acceptance,\" said Jamie Long, a top-ranked Democratic leader in the Minnesota House of Representatives.Several Minnesota companies have been working with the Washington-based lobbying group the Business Roundtable to defuse the situation, sources familiar with the efforts told Reuters. In a statement, the Business Roundtable ​said it supported the calls by those leaders to \"de-escalate the situation in Minneapolis.\" In signs of a possible thaw, Trump and Minnesota Governor ​Tim Walz spoke Monday about reducing tensions.Trump has argued the militarized operations are necessary to remove criminals from the U.S., but many of those arrested were picked up solely ‌for possible civil immigration violations - ‍the legal equivalent to a traffic violation.CEOs of Minnesota-based companies are planning additional meetings this week with federal officials to discuss what a resolution would look ‍like, said a source familiar with the matter, who was not authorized to speak with media. He said the meetings ‌have taken on more urgency and importance since the killing of Pretti.Live EventsTARGET WEIGHS IN Incoming Target CEO Michael Fiddelke weighed in with a video to employees on Monday \"as a leader of this hometown company\" to acknowledge how the activity was affecting Target and the city. Neither the video nor the CEO letter, which he also signed, mentioned Trump, ICE, Pretti or Renee Good, a 37-year-old mother who was fatally shot by an immigration agent in Minneapolis on January 7.\"The violence and loss of life in our community is incredibly painful. What's happening affects us not just as a company, but as people, as neighbors, friends and family members within Target,\" Fiddelke said in the video, the transcript of which was shared with Reuters. Target has faced protests after an incident at a store in a Minneapolis suburb, where two U.S. citizens were detained, including a 17-year-old employee, and separately for allowing ICE agents to use its parking lots and bathrooms.State ‍lawmakers say they have urged business leaders to speak out. Long said he spoke with representatives from \"at least four or five\" big companies, and said executives told him ICE's actions have hurt sales, but that until now they have been afraid to speak up. That stood in contrast to numerous small businesses displaying \"no ICE\" ‍signs and souring public ⁠mood. Trump's rating on immigration fell to a record low ⁠of 39% in the most recent Reuters poll.\"I think they realized their silence was no longer acceptable. I think they understand the harm this is doing to our state and the public,\" Long said.GOOD FAVOUR Business leaders have cozied up to the White House in hopes of avoiding conflict with Trump, who is not shy about attacking corporate titans from Intel to Walmart to JPMorgan, most recently filing a $5 billion lawsuit against the latter and its chief executive Jamie Dimon. Even with the recent remarks, leading business executives are still trying to stay in good favor with Trump. On the same day of Pretti's shooting, several executives attended a private White House screening of a new film documenting the life of first lady Melania Trump, including Amazon's CEO, Andy Jassy, and General Electric CEO Larry Culp.\"Some business leaders, of course, are showing more courage-but it takes coordinated, collective action to stand up for good government values,\" said Cary Coglianese, professor of law and political science at the University of Pennsylvania. \"We're likely to need to see a rallying or cascading of opposition, so that it lowers the costs of being seen as opposing the administration.\"Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onMinnesota ICE shootingalex pretti killingICEminnesotaUS deportationsUS immigration\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onMinnesota ICE shootingalex pretti killingICEminnesotaUS deportationsUS immigration \n\nExplore More Stories123","summary":"Minnesota shooting: Corporate leaders in Minnesota are breaking their silence on immigration enforcement after federal agents fatally shot a protester. Major CEOs have called for de-escalation, marking a significant shift in public opinion. This comes as businesses previously feared criticising President Trump.","url":"https://economictimes.indiatimes.com/news/international/global-trends/us-businesses-break-their-silence-after-latest-minnesota-ice-shooting/articleshow/127585602.cms","image":"https://img.etimg.com/thumb/msid-127585875,width-1200,height-630,imgsize-287798,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2026-01-27 01:08:47","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","source_country":"in","sentiment":-0.055},{"id":396405062,"title":"Trump says Iran situation is 'in flux' as Middle East officials warn of possible attack in coming days","text":"President Donald Trump said the situation with Iran is “in flux” and confirmed he has sent a “big armada” to the Middle East, hours after the aircraft carrier USS Abraham Lincoln arrived in the region, according to an interview published Monday night by the news site Axios. Trump’s comments came amid growing concern in the region, reported by The New York Times, that the United States could launch a military strike against Iran in the coming days. Regional officials cited by the newspaper warned that such an attack could prompt retaliation against U.S. bases by Iran and its allies. A U.S. official told The New York Times that the Abraham Lincoln is currently operating in the Indian Ocean and could, in theory, carry out military action within a day or two if ordered. The official noted that the United States also has other strike options, including fighter jets already deployed at bases across the Middle East. The aircraft carrier arrived in the region on Sunday accompanied by three destroyers. According to reports, the warships are equipped with Tomahawk cruise missiles with a range of about 1,500 to 2,500 kilometers, allowing strikes on strategic targets deep inside Iran from distant maritime positions. “We have a big armada near Iran, bigger than Venezuela,” Trump told Axios, referring to the naval force he recently assembled in the Caribbean ahead of the capture of Venezuelan leader Nicolás Maduro earlier this month. That force included the aircraft carrier USS Gerald R. Ford, which had been redeployed from the Middle East, leaving the region with limited U.S. naval presence at the height of mass protests in Iran, when Trump publicly told demonstrators that “help is on the way.” Trump declined to discuss specific operational plans presented by his national security team but emphasized that diplomacy remains an option. “They want to talk. I know they want to. They’ve called many times. They want to talk,” he said. Shortly after the interview, a senior U.S. official said Washington remains willing to engage in dialogue with Tehran if Iran is prepared to do so. “We’re open for business, as they say,” the official said. “If they want to reach out and they know the conditions, we’ll have talks. The Iranians know the conditions very well.” The U.S. warships now in the region began moving from the Asia-Pacific earlier this month as tensions escalated between Washington and Tehran following a violent crackdown on protesters opposing Iran’s clerical leadership. Trump repeatedly threatened intervention if Iran continued killing demonstrators and, at the peak of the unrest, vowed that U.S. assistance was imminent. The protests have since subsided, reportedly after the deaths of thousands. Trump said he had been told the killings had stopped and praised Iran’s leaders for what he claimed was a decision to cancel the execution of 800 detained protesters. The U.S. military has previously bolstered its regional presence during periods of heightened tension, often citing defensive needs. However, last year saw a massive buildup ahead of U.S. strikes alongside Israel on Iran’s nuclear program during Operation Rising Lion. The B-2 bombers used in those attacks ultimately flew directly from bases in the United States, crossing the Atlantic en route to Iran. In addition to the carrier strike group now deployed, the Pentagon is also transferring fighter jets and air defense systems to the Middle East. Iranian media on Monday quoted a senior official in Iran’s general staff reiterating threats of a harsh response to any attack. “American aircraft carriers are not a deterrent. They will become targets,” the official said. “Iran will not start any war, but it will not allow any threat, even an initial one. Any scenario based on surprise is a miscalculation of our defensive and offensive capabilities.” A senior Iranian official said last week that Tehran would treat any U.S. strike as an “all-out war.” On Sunday, a large billboard was erected in Tehran’s Revolution Square depicting a U.S. aircraft carrier under attack, leaving behind what appeared as bloody wake trails forming a “bleeding” American flag. Alongside the image was the English-language phrase: “If you sow the wind, you will reap the whirlwind.” Prime Minister Benjamin Netanyahu also issued a warning to Iran amid fears it could retaliate against Israel if Trump follows through on his threats. “Our heroic soldiers are defending the State of Israel with extraordinary courage,” Netanyahu said. “The capabilities of the axis of evil are far from what they were on the eve of the war. Hamas in Gaza will be disarmed. Gaza will be demilitarized. This will happen, as our friend Trump said, the easy way or the hard way, but it will happen.” He added, “We will continue to stand guard against any threat from Iran. Any attempt by Iran to harm us will be met with a decisive response. It would be a very big mistake, one mistake too many.” A similar warning came from Hezbollah leader Naim Qassem, who said the group could respond if the United States attacks Iran, though he stopped short of a firm commitment. Qassem voiced support for Iran’s supreme leader, Ayatollah Ali Khamenei, whom some analysts believe the United States might seek to target. Iranian reports say Khamenei is currently sheltering in a bunker. “When Trump threatens him, he threatens millions, because he threatens their leader,” Qassem said. “This is a responsibility on all of us to confront this threat.” He added that assassinating Khamenei would amount to “an assassination of stability in the region,” warning that “this time, a war on Iran could ignite the entire region.” Threats were also issued by Iranian-backed militias in Iraq. Kataib Hezbollah, the country’s most powerful Shiite militia, called on its fighters to prepare for possible war and warned that if the conflict escalates, its leadership could authorize “martyrdom operations.” A war against Iran, the group said, “will not be easy. You will taste every form of deadly suffering.” In response, Joe Kent, head of the U.S. National Counterterrorism Center, warned Iraqi officials in comments to The New York Times that any attacks by pro-Iranian militias on U.S. forces would be met with American strikes against those groups. Yemen’s Iran-aligned Houthi rebels have also issued threats in recent days, warning of renewed confrontation tied to a potential U.S.-Iran conflict.","url":"https://www.ynetnews.com/article/hyk000fblbe","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/26/HJxYZQPHLbl/HJxYZQPHLbl_0_0_850_479_0_large.jpg","video":null,"publish_date":"2026-01-27 01:08:01","author":null,"language":"en","category":"politics","source_country":"il","sentiment":0.094},{"id":396403446,"title":"AS percaya perlucutan senjata Hamas di Gaza akan diberi pengampunan","text":"WASHINGTON: Amerika Syarikat (AS) percaya pelucutan senjata oleh pejuang Hamas di Gaza akan disertai dengan suatu bentuk pengampunan. \n\nMenurut pegawai AS yang enggan dikenali, Israel dan AS kini meningkatkan tekanan ke atas Hamas supaya melucutkan senjata sebagai sebahagian daripada rancangan pembangunan semula Gaza.\n\n\"Terdapat keyakinan dalam kalangan pegawai AS bahawa Hamas akan melucutkan senjata.\n\n\"Kami mendengar ramai daripada mereka bercakap mengenai pelucutan senjata, tetapi jika mereka tidak melucutkan senjata, maka mereka sudah melanggar perjanjian. \n\n\"Kami percaya pelucutan senjata datang bersama suatu bentuk pengampunan dan secara jujurnya kami mempunyai pelan yang sangat baik untuk melaksanakan pelucutan senjata,\" katanya.\n\nPengampunan itu akan diberikan berikutan pengembalian mayat tebusan Israel terakhir Ran Gvili, yang ditahan oleh Hamas lebih 840 hari dan akan dibawa pulang untuk dikebumikan.\n\nBagaimanapun, kedutaan Israel di Washington enggan mengulas lanjut sama ada Israel akan bersetuju memberikan pengampunan kepada Hamas.\n\nDi bawah pelan Gaza 20 perkara Presiden Donald Trump, selepas semua tebusan dikembalikan, anggota kumpulan Hamas yang berikrar untuk hidup bersama secara aman serta melucutkan senjata akan diberikan pengampunan. \n\nMenurut pelan damai itu juga, anggota Hamas yang ingin meninggalkan Gaza pula akan diberikan laluan selamat ke negara penerima. - REUTERS","summary":"WASHINGTON: Amerika Syarikat (AS) percaya pelucutan senjata oleh pejuang Hamas di Gaza akan disertai dengan suatu bentuk pengampunan.","url":"https://www.bharian.com.my/dunia/asia/2026/01/1501881/percaya-perlucutan-senjata-hamas-di-gaza-akan-diberi-pengampunan","image":"https://assets.bharian.com.my/images/articles/BH27HAMASS-O_BHfield_image_listing_featured.var_1769476043.jpg","video":null,"publish_date":"2026-01-27 01:07:29","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.436},{"id":396403026,"title":"How Trump changed tack in Minnesota after Pretti's death","text":"WASHINGTON (AP) — President Donald Trump shifted toward a more conciliatory approach with Democratic leaders in Minnesota on Monday, a sudden change in tack following an outcry over the second fatal shooting of a protester by federal agents this month during the administration’s nationwide crackdown on undocumented immigrants.\n\nThe about-face comes after Saturday’s shooting death of Alex Pretti by federal agents raised doubts — including from some Republicans — over how the Trump administration has gone about aggressively deporting migrants and confronting protesters opposed to the policy.\n\nBut it’s just the latest in a string of moments where Trump has first taken a maximalist position only to appear to later retreat.\n\nEarlier this month, Trump repeatedly threatened Iran with military action if his administration found the Islamic Republic was using deadly force to squelch recent antigovernment protests. Human rights groups said thousands were killed, but Trump says he’s holding off on acting after he received assurances Tehran was suspending hundreds of planned executions.\n\nLast week, Trump first announced plans to impose new tariffs on European allies that refused to go along with his calls for the U.S. to take control of the Arctic territory of Greenland — only to abruptly cancel the tariffs after saying he’d come to terms of the “framework” of an agreement. The White House offered scant details about the deal, which Trump announced the day after the stock market saw one of its worst days in months in response to his tariff threat.\n\nThen on Monday, Trump’s administration changed up oversight of his immigration operation in Minnesota, and the typically bombastic Trump offered a warmer tone toward Gov. Tim Walz after speaking with the Democrat, saying he and Walz were now on a “similar wavelength.”\n\nSome Republicans took issue with what happened in Minneapolis\n\nIt was a particularly jarring turnabout for Trump, who had promised to be uncompromising on carrying out mass deportations of undocumented migrants during his 2024 campaign — and because Trump has repeatedly scorched Walz and other Minnesota Democrats in personal terms for resisting his policies.\n\nTrump said he had dispatched border czar Tom Homan to take charge. Meanwhile, senior Border Patrol commander Greg Bovino and some agents were expected to leave Minneapolis as early as Tuesday, according to a person familiar with the matter. \n\nTrump declared on social media that Walz “was happy that Tom Homan was going to Minnesota, and so am I!” Later, Minneapolis Mayor Jacob Frey confirmed that some agents would be leaving the city after he spoke with Trump — and suggested that the president seemed to be coming to the conclusion that the current state of federal operations was unsustainable. Homan and Frey were expected to meet Tuesday.\n\nTrump’s change-up in Minnesota came after some Republicans questioned federal agents’ tactics in Saturday’s incident as well as the White House’s response. Some high-ranking administration officials had branded Pretti a domestic terrorist even as videos of the encounter contradicted their narrative.\n\nMinnesota gubernatorial candidate Chris Madel, a Minneapolis attorney, ended his GOP campaign in a surprise video announcement Monday, calling the recent immigration enforcement operation in the Twin Cities an “unmitigated disaster” and saying he no longer wanted to be a member of the party because of it.\n\nMeanwhile, Texas Republican Gov. Greg Abbott, who has been a strong supporter of Trump’s crackdown on immigration, offered measured criticism in an interview with conservative radio host Mark Davis, saying the White House needs to “recalibrate” what it was doing in Minnesota. Vermont’s Republican Gov. Phil Scott called on Trump to reset and de-escalate.\n\n“At best, these federal immigration operations are a complete failure of coordination of acceptable public safety and law enforcement practices training, and leadership,” Scott said. “At worst, it’s a deliberate federal intimidation and incitement of American citizens that’s resulting in the murder of Americans.”\n\nTrump had scorched Walz. Now, they’re on a ‘similar wavelength’\n\nThe president’s approach toward Walz, who served as Democratic presidential nominee Kamala Harris’ running mate in 2024, amounted to a sharp U-turn.\n\nJust a day earlier, Trump’s deputy chief of staff, Stephen Miller, had derided Walz on social media as trying to “incite attacks on” U.S. Immigration and Customs Enforcement agents. The White House social media team in a series of posts called the governor “a truly disturbed, unstable individual” and an “unhinged lunatic” who “rants and raves and lies.”\n\nMiller also referred to Pretti, a nurse who worked at a Veterans Affairs hospital, as a “would-be assassin” while Homeland Security Kristi Noem labeled the ICU nurse as committing an act of domestic terrorism.\n\nThe White House sidestepped whether Trump agreed with his senior aides’ rhetoric or whether the administration would apologize for it.\n\n“This incident remains under investigation,” press secretary Karoline Leavitt told reporters. “And nobody here at the White House, including the president of the United States, wants to see Americans hurt or killed and losing their lives.”\n\nHis response has been muted compared to other recent deaths\n\nTrump’s response to the deaths of the two U.S. citizens protesting in Minneapolis has been much more muted than reactions to political violence that he’s portrayed as targeting his own political movement.\n\nAfter conservative activist Charlie Kirk was assassinated in September, the president spoke to the nation from the Oval Office and called Kirk’s death “a dark moment for America.” \n\nIn November, Trump gave a national address after two National Guard members were shot in Washington, D.C., by an Afghan national, one fatally. The guard members had been deployed to the nation’s capital as part of a federal mission to assist with local policing, and the president called the shooting “an act of evil, an act of hatred and an act of terror.”\n\nBut the president has yet to speak directly to the nation about the deaths in Minneapolis of Pretti and Renee Good, another protester who was killed by federal agents in Minneapolis earlier this month. Trump has so far largely chosen to keep the public informed in the wake of Pretti’s death with social media posts.\n\nEven as his comments Monday appeared to be aimed at turning down the rhetoric, Trump’s chief spokesperson, Leavitt, continued to blame Walz and other Minnesota Democrats for encouraging “left-wing agitators to stop, record, confront and obstruct federal officers who are just trying to lawfully perform their duties.”\n\n“This is precisely what unfolded in Minneapolis on Saturday morning,” Leavitt added.\n\nAP writers Josh Boak and Joey Cappelletti in Washington, Jim Vertuno in Austin, Texas, and Scott Bauer in Madison, Wisconsin, contributed reporting. Karnowski reported from Minneapolis.","url":"https://apnews.com/article/trump-pretti-minnesota-immigration-enforcement-eb9e63a625b624d2ba4ed467cb0f956c","image":"https://dims.apnews.com/dims4/default/3334c33/2147483647/strip/false/crop/3000x2000+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fdc%2Fd45a3a9673b2ef6b136e98ba8aba%2F4578be493a0a4fe3a7ff61341e970dcc","video":null,"publish_date":"2026-01-27 01:05:41","author":"Aamer Madhani,Steve Karnowski","authors":["Aamer Madhani","Steve Karnowski"],"language":"en","category":"politics","source_country":"us","sentiment":-0.564},{"id":396405406,"title":"Charlamagne predicts 'de-MAGA-ification' in future, like how 'Nazi ideology was outlawed' in postwar Germany","text":"Radio host Charlamagne tha God criticized the Trump administration during his Monday broadcast, telling listeners he believes there will come a day when President Donald Trump and his allies are prosecuted. Charlamagne was one of many commentators reacting to the death of 37-year-old activist and nurse Alex Pretti following a confrontation with federal immigration agents. Debate surrounding Pretti’s death centered on the fact that he was carrying a holstered firearm, prompting a national discussion over whether individuals are within their constitutional rights to carry guns at protests, particularly during confrontations with police. \"How many people who serve this regime are going to continue to wipe their a-- with the document that represents the Supreme Law of the United States?\" Charlamagne asked. \"That document is the Constitution. I thought this document quite clearly outlined the structure of the federal government and guaranteed us fundamental rights. But clearly, that changed, and nobody told ‘We the people.’\" FORMER ICE AGENT CALLS POLICE NON-COOPERATION 'FORMULA FOR DISASTER' AFTER SECOND MINNEAPOLIS SHOOTING DEATH Charlamagne objected to Homeland Security Secretary Kristi Noem’s rhetoric about the shooting, particularly how she spoke about Pretti’s possession of a firearm at a protest. \"You ask, ‘Why did he bring a gun to a protest?’ Why do people bring guns to Starbucks?\" Charlamagne asked. \"Now all of a sudden it's wrong to carry any and everywhere, even though we live in a country that lets you carry damn near any and everywhere. Well, that's what happens when you are under an authoritarian government. Okay? They are hellbent on distorting our reality.\" BORDER PATROL COMMANDER SPARS WITH CNN HOST OVER DEADLY MINNESOTA SHOOTING He continued, \"I’m gonna tell y’all something, America, I don’t know how dark or how bad things are gonna get, but I keep hearing people referencing 1940s Germany. But I want y'all to remember something when you are bringing up that history. The Nazis ultimately lost. Nazi ideology was outlawed through de-nazification. One day we will see the de-MAGA-ification of this country. It will come. And you know what else happened? Leaders of the Nazi regime were prosecuted and tried as war criminals.\" The White House and DHS didn't immediately respond to a request for comment. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP","summary":"Charlamagne compared the Trump regime to Nazi Germany, predicting future prosecution of leaders while defending Second Amendment rights after activist Alex Pretti&apos;s shooting death.","url":"https://www.foxnews.com/media/charlamagne-predicts-de-maga-ification-future-like-how-nazi-ideology-outlawed-postwar-germany","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/charlamagne-tha-god-trump.jpg","video":null,"publish_date":"2026-01-27 01:00:58","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"US","sentiment":-0.191},{"id":396406030,"title":"FirstUp: India-EU FTA talks to be finalised and other big headlines","text":"India and the European Union (EU) are expected to announce the conclusion of the negotiations on their free trade agreement (FTA) today. Among the key announcements expected are cuts in tariffs on European cars and wine, as well as on Indian electronics and textiles, it added.\nRead this and more news updates from across the world for today.\nIndia-EU FTA talks to be finalised\nAs Trump's tariff uncertainty looms, India and the EU are set for 'mother of all deals.' Today, (January 27), negotiations for the India-EU Free Trade Agreement (FTA) are expected to conclude. This comes a day after Republic Day (January 26), where European Commission President Ursula von der Leyen and European Council President Antonio Costa were invited as chief guests.\nA report cited Jefferies, saying that India's automotive, chemical, electronics, pharmaceutical, and textile sectors may emerge as major beneficiaries of a potential India–EU FTA.\nAs Trump's tariff uncertainty looms, India and the EU are set for 'mother of all deals.' File Image/Reuters\nAn Indian trade ministry official asserted that some sensitive agricultural items have been omitted from negotiations, the report said, citing the official, according to the Mint.\nEU foreign and security policy chief Kaja Kallas and Defence Minister Rajnath Singh will sign the Security and Defence Partnership, officials said. At the recently concluded World Economic Forum (WEF) in Davos, Switzerland, Leyen spoke about the agreement that some call “the mother of all deals”.\nJapan election campaigns begin\nIn Japan, the election campaign is set to commence today, following Prime Minister Sanae Takaichi's dissolution of the lower house of Parliament on Friday (January 23). Takaichi says the vote is about stability and is staking her premiership on a public verdict. Her campaign promises temporary tax cuts to ease high food prices. Elected as Japan's first female leader in October, Takaichi has been in office for only three months; however, she has seen strong approval ratings of about 70 per cent.\nElection campaign to start in Japan after PM Takaichi dissolves parliament, paving the way for a snap election. File Image/Reuters\nAccording to experts, by opting for an early election, Takaichi is engaging in a classic political strategy: she aims to capitalise on her high approval ratings and the current political environment before it potentially worsens.\nJapan's last two pandas to leave for China\nThe last pandas (the male Xiao Xiao and female Lei Lei) living in Japan are returning to China. Reuters\nTwo days after the public viewing opportunity at Tokyo’s Ueno Zoo, the last pandas (the male Xiao Xiao and female Lei Lei) living in Japan are returning to China. According to the Asahi Shimbun, the pair were born in 2021 at the zoo, and they are technically on loan from Beijing. After their return, this will be the first time that there will be no giant pandas in Japan. The Tokyo metropolitan government announced their return in December last year.\nFinnish PM to meet China's Xi Finnish Prime Minister Petteri Orpo is on a four-day visit (from 25 to 28 January) to China. Orpo will meet Chinese President Xi Jinping and Prime Minister Li Qiang, who is hosting the visit today, as per the Finnish Government Communications Department.\nIn a statement issued ahead of the visit, Orpo said, \"It is important to continue dialogue with China on bilateral cooperation and topical international issues, such as challenges in the rules-based system and trade. China is an important export market for Finnish companies and the EU’s second-largest trading partner.\"\nTrump to return to Iowa for a speech\nUnited States President Donald Trump is set to return to Iowa today to deliver a speech focused on energy and the economy. The news was confirmed by White House Chief of Staff Susie Wiles. Trump last visited Iowa on July 3, 2025. Trump would travel weekly within the country ahead of the midterm elections, said Wiles. More details have not been released.\nBafta nominations to be announced\nThe Bafta Film Awards nominations will be announced today (January 27), with six people in each acting category, the BBC reported. Some of the big names, George Clooney, Dwayne Johnson and Julia Roberts, have been missing out this year.\nThe longlists for every Bafta category have been released, with Paul Thomas Anderson’s One Battle After Another, starring Leonardo DiCaprio, topping the field with 16 mentions. In recent years, Bafta and Oscar results have frequently closely aligned, the report noted.\nFed 2-day policy meeting\nAccording to the majority of economists polled by Reuters, the US Federal Reserve will hold its key interest rate through this quarter and possibly until Federal Reserve Chair Jerome Powell's tenure ends in May. At the Fed policy meeting, which will be held today and tomorrow (January 28), all 100 economists expected in their January 16-21 poll that the Fed would keep rates at 3.50 per cent-3.75 per cent, Reuters reported.\nPresident Trump has repeatedly blasted Federal Reserve Chair Jerome Powell for not lowering rates. The Justice Department has now threatened a criminal investigation against Powell over building renovations on the Fed's new headquarters.\nBank unions to go on nationwide strike in India\nBank employee unions have decided to go on a nationwide strike on January 27 to press for a long-pending demand for a five-day work week. Most of the public sector banks have already informed their customers about the disruption in banking services if the strike materialises.\nThe decision to declare all Saturdays as holidays was agreed between the Indian Banks' Association and UFBU during the wage revision settlement in March 2024. “It is unfortunate that the government is not responding to our genuine demand. There would be no loss of man-hours as we have agreed to work an extra 40 minutes daily from Monday to Friday,” UFBU had said earlier this month.\nWith inputs from agencies","url":"https://www.firstpost.com/explainers/firstup-india-eu-fta-talks-to-be-finalised-and-other-big-headlines-13972165.html","image":"https://images.firstpost.com/uploads/2026/01/Untitled-design-45-2026-01-46793f2c2a589cfe770c6f0dbe7bf122.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2026-01-27 01:00:56","author":"Fp Explainers","authors":["Fp Explainers"],"language":"en","source_country":"in","sentiment":0.421},{"id":396402540,"title":"Top China general removed for ‘leaking’ nuclear-plan to US: Report","text":"Top China general removed for ‘leaking’ nuclear-plan to US: Report World \n 1 hr ago\n\n This is an AI assisted summary.\n\n Top Chinese military general Zhang Youxia has been accused of leaking information about the country's nuclear weapons program and accepting bribes. This is part of a larger purge by President Xi Jinping to remove allegedly corrupt military leaders, with Zhang being the most senior leader targeted so far.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 2 / 50\n Prasoon Joshi once wrote anti-establishment anthems; is now the establishment himself Entertainment \n 21 min ago\n\n This is an AI assisted summary.\n\n Prasoon Joshi's 'Roobaroo Roshni' inspired the youth to rebel and have a purpose, but this is lacking in current cinema. As CBFC chairperson, Prasoon has immense power, but the lack of transparency and authoritarianism suggests a larger issue. It's ironic how the man who wrote songs of revolution is now part of the establishment.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 3 / 50\n Hrithik Roshan’s personal chef Shubham Vishwakarma details the actor’s daily diet Lifestyle \n 47 min ago\n\n This is an AI assisted summary.\n\n Hrithik Roshan, known as the Greek God of Bollywood, recently gave a shoutout to his personal chef, Shubham Vishwakarma, on social media. Vishwakarma, who is trained in culinary arts and specializes in nutrition-focused cooking, sees himself as a \"student of food\". He travels with Hrithik and adapts to new kitchens and tight schedules, creating clean, balanced, and intentional meals for the actor.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 4 / 50\n Age rating to list of don’ts: Draft rules on obscenity online India \n 1 hr ago\n\n This is an AI assisted summary.\n\n The Indian government plans to introduce draft rules to tackle obscenity in online content. The proposed IT (Digital Code) Rules, 2026, suggest age-appropriate classification and guidelines for obscene content. Content curators are worried about arbitrary complaints, as the rules apply to all digital media platforms.\n\n Read Full Article \n\n URL Copied\n\n 5 / 50\n Vance, Navarro & Trump resisting India trade deal: US Senator Ted Cruz India \n 3 hr ago\n\n This is an AI assisted summary.\n\n Senator Cruz accuses Trump, Vance, and Navarro of hindering a trade deal with India despite Trump's warm Republic Day message. Cruz claims to have fought against the White House on this issue and warns of potential impeachment due to Trump's tariffs. Negotiations are ongoing to strengthen ties, with a bipartisan delegation meeting with India's External Affairs minister.\n\n Read Full Article \n\n URL Copied\n\n 6 / 50\n 77th Republic Day: Military might, with a dash of Sindoor India \n 3 hr ago\n\n This is an AI assisted summary.\n\n India celebrated its 77th Republic Day with a grand display of military strength, showcasing fighter jets and missiles used in recent operations. The theme of the parade was '150 years of Vande Mataram' and was attended by the President of the European Council and Commission. The parade also included a contingent from the EU and a tableau of a 5th-century ship.\n\n Read Full Article \n\n URL Copied\n\n 7 / 50\n Why modern life needs a touch of ‘Miyabi’ Lifestyle \n 6 hr ago\n\n This is an AI assisted summary.\n\n Miyabi, a Japanese concept rooted in culture for centuries, represents elegance, refinement, and grace. It emphasizes emotional depth, subtlety, and simplicity in design, manners, and art. In today's busy world, Miyabi reminds us to appreciate the small things and find beauty in restraint. It encourages a life of quiet dignity and cherishing the little things.\n\n Read Full Article \n\n URL Copied\n\n MORE FOR YOU\n\n My Express\n\n Podcast\n\n ePaper\n\n Games\n\n Horoscope\n\n UPSC\n\n 8 / 50\n Nat Sciver-Brunt: Didn’t want to replicate other players by getting out in 90s Sports \n 6 hr ago\n\n This is an AI assisted summary.\n\n Nat Sciver-Brunt becomes the first cricketer in Women's Premier League history to score a century in four editions. Her unbeaten 100 off 57 balls helped Mumbai Indians to a 15-run victory over Royal Challengers Bengaluru. Sciver-Brunt credits her preparations for the milestone and MI captain Harmanpreet Kaur praises the team's camaraderie and off-field bonding.\n\n Read Full Article \n\n URL Copied\n\n 9 / 50\n Lara Dutta reflects on never wanting to depend on any man Lifestyle \n 7 hr ago\n\n This is an AI assisted summary.\n\n Lara Dutta, 47, took her time before marrying Mahesh Bhupathi, prioritizing her career and financial stability. She emphasizes that her husband has never imposed on her and that she chose marriage after achieving a fulfilling life, not due to societal pressure.\n\n Read Full Article \n\n URL Copied\n\n 10 / 50\n Hockey India League: Kalinga Lancers beat Ranchi Royals to be crowned champions Sports \n 7 hr ago\n\n This is an AI assisted summary.\n\n Kalinga Lancers beat Ranchi Royals 3-2 in a thrilling final to win the HIL title in front of a home crowd. Hendrickx and Dilpreet Singh scored the decisive goals for the Lancers. Ranchi Royals fought hard but fell short, with Boon and Hundal scoring for them. Kalinga Lancers dominated the second quarter and held on to win, with goalkeeper Pathak making crucial saves.\n\n Read Full Article \n\n URL Copied\n\n 11 / 50\n India vs Zimbabwe U19 World Cup ​Super 6 Match Live Cricket Streaming Sports \n 8 hr ago\n\n This is an AI assisted summary.\n\n India will face Zimbabwe in the Super 6 match of the U19 World Cup, hoping to continue their winning streak after a dominant performance against New Zealand. The match will be telecast on Star Sports Network and streamed on JioHotstar app. \n\n Read Full Article \n\n URL Copied\n\n 12 / 50\n PCB defers T20 World Cup call amid ICC row, India match boycott looms Sports \n 9 hr ago\n\n This is an AI assisted summary.\n\n The PCB has delayed its decision on joining the T20 World Cup and will decide by Monday. The chairman met with the Prime Minister to discuss options. Basit Ali advises against boycotting India, citing potential consequences. The ICC may impose sanctions if Pakistan withdraws from the tournament.\n\n Read Full Article \n\n URL Copied\n\n 13 / 50\n Alex Honnold climbs ‘Skyscraper’ without any safety gear Entertainment \n 9 hr ago\n\n This is an AI assisted summary.\n\n Alex Honnold, a 40-year-old American free solo climber, made history by scaling a 101-floor skyscraper without any safety gear in Taiwan. The live stream of his ascent on Netflix kept viewers on the edge of their seats as he defied all odds and reached the top in an hour and a half.\n\n Read Full Article \n\n URL Copied\n\n 14 / 50\n ‘Pakistan shouldn’t boycott but play India with black arm band’: Basit Ali’s suggestion Sports \n 9 hr ago\n\n This is an AI assisted summary.\n\n Former Pakistan cricketer Basit Ali has urged Pakistan to play against India in the upcoming T20 World Cup while wearing black armbands as a form of protest, rather than boycotting the match. He warns that previous boycotts have damaged the sport and could have negative consequences, including sanctions from the ICC. He appeals to authorities to make decisions that do not harm cricket.\n\n Read Full Article \n\n URL Copied\n\n 15 / 50\n Nat Sciver-Brunt becomes first player to slam a century in WPL history Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n Nat Sciver-Brunt of Mumbai Indians made history by scoring the first century in the Women's Premier League, with 16 fours and 1 six in her 57-ball innings. RCB's Smriti Mandhana chose to bowl after winning the toss, while MI's Amelia Kerr returned to the playing XI. \n\n Read Full Article \n\n URL Copied\n\n 16 / 50\n IND vs NZ | The Jasprit Bumrah effect: India’s ultimate trump card at T20 World Cup Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n Jasprit Bumrah, a versatile and deceptive bowler, has been compared to Wasim Akram for his magical skills. With his strong bowling unit, he offers complete control in all phases of the game and is considered India's ultimate weapon for winning the T20 World Cup.\n\n Read Full Article \n\n URL Copied\n\n 17 / 50\n Varun Dhawan’s pull-up video inside Metro lands him in trouble, authorities issue warning Entertainment \n 12 hr ago\n\n This is an AI assisted summary.\n\n Varun Dhawan, star of the hit film Border 2, caused controversy when videos of him performing pull-ups inside a Mumbai Metro coach went viral. The actor had taken the metro to avoid traffic and promote his film, but the metro authorities issued a safety advisory and asked him to include a disclaimer in such situations.\n\n Read Full Article \n\n URL Copied\n\n 18 / 50\n ‘I don’t believe he is the man to get them winning league titles’: Keane on Carrick Sports \n 11 hr ago\n\n This is an AI assisted summary.\n\n Michael Carrick, interim manager of Manchester United, has impressed with two wins over top teams in the league. However, former United player Roy Keane doubts his ability to lead the team to league titles and believes he is not the right choice for the permanent job. Despite this, Carrick is enjoying the role and has already beaten the top two teams in just two games.\n\n Read Full Article \n\n URL Copied\n\n 19 / 50\n Darren Cahill reveals how Jannik Sinner survived extreme heat to reach 4th round Sports \n 11 hr ago\n\n This is an AI assisted summary.\n\n Despite facing challenges due to extreme heat, Jannik Sinner managed to advance to the fourth round at the Australian Open. With the help of his coach and self-management skills, he overcame cramps and conserved energy until the roof was closed. Sinner's struggles with heat were addressed and he stuck to his routine to defeat his opponent in straight sets.\n\n Read Full Article \n\n URL Copied\n\n 20 / 50\n WPL 2026 Playoffs qualification scenario for DC, MI, GG & UPW Sports \n 7 hr ago\n\n This is an AI assisted summary.\n\n RCB secures spot in WPL 2026 playoffs, leaving two teams to battle for remaining spot in Eliminator. Delhi Capitals and Gujarat Giants have chance to qualify with two wins, while Mumbai Indians must win both remaining matches to stay in race. UP Warriorz have slim chance of qualifying. RCB only needs one win for direct spot in final.\n\n Read Full Article \n\n URL Copied\n\n 21 / 50\n Can the right environment make animals ‘smarter’? An Expert Explains Explained \n 11 hr ago\n\n This is an AI assisted summary.\n\n Veronika, a 13-year-old cow from Austria, has been observed using a deck brush to scratch herself, demonstrating tool usage. Researchers found that her stimulating environment played a key role in developing her tooling abilities. While tool use is more common in certain animals due to various factors, livestock like Veronika have been overlooked in cognitive studies.\n\n Read Full Article \n\n URL Copied\n\n 22 / 50\n Ishan Kishan effect: How early intent is powering India’s powerplays against New Zealand Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n India's dominance in the ongoing T20I series against New Zealand is being driven by their ability to respond to early setbacks. In the third T20I, Ishan Kishan's aggressive batting in the powerplay, along with Abhishek Sharma's support, helped India break their own record for the fastest-ever team fifty.\n\n Read Full Article \n\n URL Copied\n\n 23 / 50\n Etihad Rail plans to launch passenger train service in UAE soon World \n 12 hr ago\n\n This is an AI assisted summary.\n\n Etihad Rail is launching the first phase of the UAE's passenger train service, connecting 11 cities through strategically located stations. The trains will have modern amenities and operate on a precise schedule, providing a safe and reliable mode of travel. The launch is expected to have a positive impact on tourism, economic and social ties between the Emirates.\n\n Read Full Article \n\n URL Copied\n\n 24 / 50\n Arjun Bijlani, Ankita Lokhande, Nia Sharma return to a ‘revamped’ Laughter Chefs 3 Entertainment \n 12 hr ago\n\n This is an AI assisted summary.\n\n Laughter Chefs Season 3 kicked off in November 2025 with a new concept and fresh faces, including Vivian D'sena, Tejasswi Prakash, Gurmeet Choudhary, Debina Bonnerjee, Eisha Singh, and Isha Malviya. However, the new format and additions failed to impress the audience, resulting in a major revamp and the abrupt end of the team concept.\n\n Read Full Article \n\n URL Copied\n\n 25 / 50\n How Donald Trump is driving de-dollarisation, and contributing to the gold surge Explained \n 11 min ago\n\n This is an AI assisted summary.\n\n Gold prices reach $5,000 per ounce as US dollar drops to four-month low. Central banks, including Reserve Bank of India, buying gold due to Trump's policies. This shift away from USD could impact global economy and security as more countries diversify their forex reserves. Trump's actions have weakened dollar's status and could lead to further diversification.\n\n Read Full Article \n\n URL Copied\n\n 26 / 50\n When Kajol’s son Yug called her out for scolding Nysa Lifestyle \n 13 hr ago\n\n This is an AI assisted summary.\n\n Kajol's son, Yug, showed maturity at a religious gathering, impressing his mother. Psychologist Rasshi Gurnani stresses the need for parents to differentiate between defiance and honest self-expression in children. Building a safe space for children to express themselves without fear of judgement is crucial. Repairing trust and validating a child's honesty can strengthen the parent-child bond.\n\n Read Full Article \n\n URL Copied\n\n 27 / 50\n ‘He is showing that he is a big-match player’: Rohit Sharma on Tilak Varma Sports \n 13 hr ago\n\n This is an AI assisted summary.\n\n Tilak Varma has emerged as a key player in India's T20I team, with Rohit Sharma praising his mindset and attitude. His impressive performance in the Asia Cup final against Pakistan last year showcased his temperament and ability to handle pressure. However, Varma's fitness is a concern and he is expected to join the team for the T20 World Cup warm-up match.\n\n Read Full Article \n\n URL Copied\n\n 28 / 50\n Shark Tank India 5 pitcher, says sales went up 2x, did one month’s revenue in a day Entertainment \n 13 hr ago\n\n This is an AI assisted summary.\n\n Brothers Harshit and Tanay Agarwal's mithai brand, Pistabarfi, was featured on Shark Tank India 5 but left without a deal. Despite receiving praise, they refused to give up their film careers for the brand, resulting in them losing out on funding. Tanay believes standing their ground is more important than getting a deal.\n\n Read Full Article \n\n URL Copied\n\n 29 / 50\n ‘Pakistan intervening in matter without any reason’: Rajeev Shukla on BAN’s T20 WC ouster Sports \n 14 hr ago\n\n This is an AI assisted summary.\n\n BCCI VP accuses Pakistan of interfering in India vs Bangladesh T20 World Cup issue, causing confusion. Bangladesh government and cricket board refused to travel due to security concerns, leading to Scotland's inclusion. Pakistan's participation depends on PM's decision, PCB suggests hybrid model for Bangladesh. Shukla says it is unnecessary for Pakistan to get involved.\n\n Read Full Article \n\n URL Copied\n\n 30 / 50\n ‘Game was over in single over’: R Ashwin on Ishan Kishan’s ‘audacity’ Sports \n 14 hr ago\n\n This is an AI assisted summary.\n\n Ashwin praises Ishan Kishan's confidence and approach in the India vs New Zealand match. Kishan came in at one down after Samson's wicket and immediately took on the Kiwi bowler, impressing Ashwin. Kishan's audacity and skill were on display as he helped India chase down the target of 154 in just 10 overs.\n\n Read Full Article \n\n URL Copied\n\n 31 / 50\n Sunita Williams names her ‘favourite’ dessert during Kerala visit, video wins hearts Trending \n 15 hr ago\n\n This is an AI assisted summary.\n\n In a viral video shared by the official handle of the outlet, Falooda Nation, the former Nasa astronaut can be seen relishing the popular Indian dessert. Williams is seen seated comfortably as she enjoys the falooda and chats with people around her. Text overlaid on the video read, “From zero gravity to full falooda.\"\n\n Read Full Article \n\n URL Copied\n\n 32 / 50\n ‘I don’t drink coffee anymore’: Actor Banita Sandhu on fitness, food, and films Lifestyle \n 15 hr ago\n\n This is an AI assisted summary.\n\n Banita Sandhu, the October actress, shares her secrets on her morning routine, fitness, wellness, food indulgences, and journey with Hindi. She reveals her handbag essentials and upcoming projects. Banita follows a structured morning routine with journaling, a turmeric and ginger concoction, and a French omelette for breakfast.\n\n Read Full Article \n\n URL Copied\n\n 33 / 50\n Vande Bharat Sleeper train: ICF to manufacture 50 rakes of 24-car coaches India \n 15 hr ago\n\n This is an AI assisted summary.\n\n The newly introduced Vande Bharat Sleeper train between Howrah and Kamakhya has reduced travel time and improved regional connectivity. It features 16 coaches, including 11 Third AC, 4 Second AC, and 1 First AC. The Chennai-based Integral Coach Factory (ICF) will manufacture 50 rakes of 24-coach Vande Bharat Sleeper trains.\n\n Read Full Article \n\n URL Copied\n\n 34 / 50\n Month before Xi Jinping’s purge of China’s general, Pentagon flagged ‘uncertainty’ Explained \n 2 hr ago\n\n This is an AI assisted summary.\n\n Chinese General Zhang Youxia is being investigated for allegedly sharing classified information about the country's nuclear weapons program with the US. This follows the removal of other high-ranking officers for corruption, raising concerns about the military's effectiveness. The purge of top leaders shows China's determination to weed out disloyalty, which could hinder the modernization efforts.\n\n Read Full Article \n\n URL Copied\n\n 35 / 50\n Waheeda Rehman reacts to AR Rahman’s Bollywood is ‘communal’ remark: ‘Yeh mulk hamara hai’ Entertainment \n 10 hr ago\n\n This is an AI assisted summary.\n\n AR Rahman has been facing backlash for suggesting that he has lost work in the Hindi film industry due to a communal bias and power shift. While he clarified his intentions, celebs like Javed Akhtar and Kangana Ranaut reacted. In an exclusive interview, Waheeda Rehman said that the reason behind his claims might be time and that such fluctuations are common in the industry.\n\n Read Full Article \n\n URL Copied\n\n 36 / 50\n Tilak Varma ruled out for remaining New Zealand T20Is, Shreyas Iyer to continue Sports \n 16 hr ago\n\n This is an AI assisted summary.\n\n Shreyas Iyer will remain in the Indian squad for the remainder of their ongoing T20I series against New Zealand, with Tilak Varma now slated to join the team only before India's warm-up match for the 2026 T20 World Cup.\n\n Read Full Article \n\n URL Copied\n\n 37 / 50\n These animals can ‘smell’ fear Lifestyle \n 16 hr ago\n\n This is an AI assisted summary.\n\n Some animals have the ability to detect fear through chemical signals, such as sweat and breath. Dogs, horses, sharks, snakes, rats, elephants, rabbits, and wolves are among the animals that possess this extraordinary sense. This sensitivity helps them assess danger, respond to threats, and survive in their environments.\n\n Read Full Article \n\n URL Copied\n\n 38 / 50\n ‘I am surprising myself’: Carlos Alcaraz opens up about renewed serve at Australian Open Sports \n 16 hr ago\n\n This is an AI assisted summary.\n\n At just 22 years old, Carlos Alcaraz has impressed at the Australian Open with his improved serving technique. He credits his high first serve percentage as a key weapon in his game. Breaking records, including most quarter-final appearances before turning 23 in the Open Era, Alcaraz has caught the attention of even Novak Djokovic, who jokes about their similar serves.\n\n Read Full Article \n\n URL Copied\n\n 39 / 50\n Chiranjeevi reacts to ‘casting couch’ allegations in Telugu cinema Entertainment \n 16 hr ago\n\n This is an AI assisted summary.\n\n Chiranjeevi's Mana Shankara Vara Prasad Garu has emerged as the winner of the Pongal-Sankranti season, grossing over Rs 300 crore worldwide. At a special event, the star addressed the issue of the casting couch in the film industry, stating that being professional and firm with principles can prevent exploitation. However, his remarks contradict the experiences of actors like Fatima Sana Shaikh.\n\n Read Full Article \n\n URL Copied\n\n 40 / 50\n Over 77% Indian esports players see streaming as key income path: YouGov poll Technology \n 16 hr ago\n\n This is an AI assisted summary.\n\n Over 77 per cent of Indian esports players say that they see clear monetisation opportunities in streaming today beyond participating and winning esports tournaments, according to a survey jointly conducted by JetSynthesys and YouGov. The survey also found that around 83 per cent of respondents believe there is financial viability in pursuing esports as a career.\n\n Read Full Article \n\n URL Copied\n\n 41 / 50\n ChatGPT cites Elon Musk’s Grokipedia as source multiple times: Report Technology \n 17 hr ago\n\n This is an AI assisted summary.\n\n GPT-5.2, the latest large language model (LLM) powering ChatGPT, has been found to cite Musk-owned xAI’s Grokipedia as a source in response to a wide range of queries, according to a report by The Guardian. The Wikipedia challenger was reportedly cited nine times in ChatGPT’s responses to more than a dozen questions on various topics such as the political structures in Iran and Holocaust deniers.\n\n Read Full Article \n\n URL Copied\n\n 42 / 50\n Amrit Bharat Express 3.0 trains: ICF to manufacture two rakes by FY26 end – what’s new India \n 14 hr ago\n\n This is an AI assisted summary.\n\n The Ministry of Railways is set to launch Amrit Bharat 3.0 trains, designed to provide affordable and high-quality service for passengers from lower and lower-middle income categories. Two rakes of the upgraded trains will be manufactured this financial year, featuring a mix of AC and non-AC coaches.\n\n Read Full Article \n\n URL Copied\n\n 43 / 50\n India-origin scientist’s reality check for Silicon Valley techies goes viral Trending \n 17 hr ago\n\n This is an AI assisted summary.\n\n India-origin scientist Ram Swaminathan recently sparked a conversation about everyday life in the US, questioning those who work 60 hours a week in Silicon Valley but escape city life over the weekend.\n\n Read Full Article \n\n URL Copied\n\n 44 / 50\n Govinda performs ‘Kisi disco mein jaaye’ at a school’s annual day event Entertainment \n 17 hr ago\n\n This is an AI assisted summary.\n\n Govinda, who has been absent from the film industry, made a comeback at a school's annual day function in Uttar Pradesh. He performed on his hit song and a Bhojpuri track, and also attended another event where he danced and sang. He also lit the ceremonial lamp at the annual day event.\n\n Read Full Article \n\n URL Copied\n\n 45 / 50\n ‘Jaya Bachchan scolds ministers; Rekha came to Parliament once in session’: Rajeev Shukla Entertainment \n 17 hr ago\n\n This is an AI assisted summary.\n\n Congress Rajya Sabha MP and veteran journalist Rajeev Shukla recently emphasised that Jaya Bachchan, unlike her husband Amitabh Bachchan, commands respect with an iron fist, as she is a very strict and disciplined person. \"If she feels that someone is being even a bit undisciplined, she won't tolerate it,\" he said during an interview. Shukla added, \"Rekha ji used to come only once per session.\"\n\n Read Full Article \n\n URL Copied\n\n 46 / 50\n How the voyage of INSV Kaundinya points to a deepening of Indo-Oman relations Explained \n 17 hr ago\n\n This is an AI assisted summary.\n\n The maiden voyage of INSV Kaundinya from Porbandar to Muscat symbolises the revival of India's ancient shipbuilding traditions and the strong maritime bond between India and Oman. The use of traditional techniques pays homage to indigenous knowledge and showcases the historical connections between the two nations.\n\n Read Full Article \n\n URL Copied\n\n 47 / 50\n Republic Day 2026: Sanjay Leela Bhansali pays tribute to Mother India and other classics Entertainment \n 18 hr ago\n\n This is an AI assisted summary.\n\n Bollywood director Sanjay Leela Bhansali, who is known for his elaborate sets and the grandeur he brings to his films, was asked to design the tableau of the Ministry of Information and Broadcasting, representing Indian cinema at Kartavya Path on Republic Day.\n\n Read Full Article \n\n URL Copied\n\n 48 / 50\n ExplainSpeaking | Budget 2026: Three macro worries for the Finance Minister Explained \n 10 hr ago\n\n This is an AI assisted summary.\n\n Finance Minister Nirmala Sitharaman will present the Budget on February 1, outlining the government's expected growth rate, revenue sources, and borrowing. Weak GDP growth, tax buoyancy, and private investments are major concerns for the FM, as government efforts to boost private sector investments have not been as successful as expected.\n\n Read Full Article \n\n URL Copied\n\n 49 / 50\n Why Carlos Alcaraz was forced to strip off fitness tracker device at Australian Open 2026 Sports \n 18 hr ago\n\n This is an AI assisted summary.\n\n Aussie tennis greats, including Whoop founder Will Ahmed, Todd Woodbridge, and Lleyton Hewitt, criticized the Australian Open organizers for banning the Whoop fitness tracking devices worn by players Carlos Alcaraz and Aryna Sabalenka. The ITF rules state that the devices are approved for in-match wear, but Tennis Australia confirmed that they are still banned during Grand Slam tournaments.\n\n Read Full Article \n\n URL Copied\n\n 50 / 50\n Zohran Mamdani shovels snow, helps dig out stranded cars amid record snowstorm in NYC Trending \n 18 hr ago\n\n This is an AI assisted summary.\n\n The United States is currently braving the biggest snowstorm in five years, leaving people stranded and transportation systems disrupted. New York City Mayor Zohran Mamdani surprised many residents over the weekend by assisting drivers whose cars were trapped by heavy snowfall.\n\n Read Full Article \n\n URL Copied","url":"https://indianexpress.com/shorts/world/top-china-general-zhang-youxia-removed-for-leaking-nuclear-plan-to-us-report-10496119/","image":"https://images.indianexpress.com/2026/01/General-Zhang-Youxia-75-was-joint-vice-chairperson-of-the-Central-Military-Commission.jpg","video":null,"publish_date":"2026-01-27 01:00:17","author":"President Xi Jinping","authors":["President Xi Jinping"],"language":"en","category":"politics","source_country":"in","sentiment":0.408},{"id":396403202,"title":"US looking inward under Trump made development space for China, expert says","text":"China should build on its “most important” strategic assets of domestic stability and progress to navigate US President Donald Trump’s shattering of global norms, a Washington watcher at a Chinese think tank says.\nNi Feng, a researcher and former director of the Chinese Academy of Social Sciences’ Institute of American Studies, said the Trump administration’s “disruptive” overhaul of US diplomacy was sending the international system into a “more volatile and uncertain” phase.\nThis could leave Beijing facing an increasingly “complex and volatile” outside world, he warned during an event organised by the Shanghai Development Research Foundation (SDRF), a non-profit advisory body.\n\n“The US strategic retrenchment and looking inward have created objective conditions for China to strive for development space,” Ni said, according to an excerpt of his speech published by the SDRF on its social media channel on Monday.\n“The US … more tending to be utilitarian and restless, will also increase external uncertainty and risks,” Ni told the event on January 15.\n“In the face of a United States that is ‘more restless, inward-looking and utilitarian’, the key for China is not to react passively to [America’s] policy changes but to enhance the certainty of [our] own development.”\nHis comments come amid growing debate and anxieties across the globe over how the world order will be affected by Trump’s “America first” agenda – as outlined in his administration’s National Security Strategy released last month and national defence strategy released on Friday.\nSuch concerns – recently stoked by Trump’s talk of taking over Greenland and the dramatic US abduction of Venezuela’s former leader Nicolas Maduro and his wife – were laid bare by Canadian Prime Minister Mark Carney last week.\nAddressing the World Economic Forum in Davos on January 20, Carney stated that recent events had shown the “rules-based international order” was effectively dead.\nThe following day, during a meandering 70-minute address in the same Swiss town, Trump slammed Nato once again – describing Europe as “not even recognisable” – and reiterated his push for control over Greenland. However, this time the US commander-in-chief said he “won’t use force” to acquire the semi-autonomous territory from Denmark, a transatlantic ally of Washington.\nQuestions have also been mounting over how the White House’s foreign policy approach could shape the China-US relationship – dubbed “G2” by Trump, although Beijing has not embraced the term – especially given the multiple potential occasions this year for face-to-face summits between Trump and his Chinese counterpart, Xi Jinping, amid a fierce strategic rivalry.\nNi said the Trump administration’s National Security Strategy had “systematically repudiated” the diplomatic paradigm that Washington had followed for more than eight decades since World War II, notably by refusing to continue providing global public goods, diluting alliance commitments and abandoning the outreach of values abroad.\nHe described the strategic transition as an inevitable outcome, as the US no longer possessed the absolute power to dominate the world single-handedly, faced deep-seated structural challenges at home, and was burdened by long-standing flaws in its traditional diplomatic model.\n\nUnder the American shift, international relations were becoming more prone to great-power politics and the law of the jungle, he warned, with the cohesion and institutional credibility of the US alliance system set to erode in the long run, while interstate rivalry would grow increasingly overt.\nFocusing on managing its own work properly and solidifying the foundations of development had emerged as China’s “fundamental strategy” for coping with offshore shocks, Ni continued.\n“In an international environment of rising uncertainty, internal stability and sustained development are the most important strategic resources,” he said.\n“Only by continuously enhancing comprehensive strength, institutional resilience and the quality of development can [China] maintain its strategic initiative.”","url":"https://www.scmp.com/news/china/diplomacy/article/3341292/us-looking-inward-under-trump-made-development-space-china-sino-us-expert-says?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/01/26/b5123a7c-a85e-40dd-96ac-7ce76003f657_0e649fdd.jpg","video":null,"publish_date":"2026-01-27 01:00:11","author":"Orange Wang","authors":["Orange Wang"],"language":"en","source_country":"hk","sentiment":0.32},{"id":396403200,"title":"US looking inward under Trump made development space for China, expert says","text":"China should build on its “most important” strategic assets of domestic stability and progress to navigate US President Donald Trump’s shattering of global norms, a Washington watcher at a Chinese think tank says.\nNi Feng, a researcher and former director of the Chinese Academy of Social Sciences’ Institute of American Studies, said the Trump administration’s “disruptive” overhaul of US diplomacy was sending the international system into a “more volatile and uncertain” phase.\nThis could leave Beijing facing an increasingly “complex and volatile” outside world, he warned during an event organised by the Shanghai Development Research Foundation (SDRF), a non-profit advisory body.\n\n“The US strategic retrenchment and looking inward have created objective conditions for China to strive for development space,” Ni said, according to an excerpt of his speech published by the SDRF on its social media channel on Monday.\n“The US … more tending to be utilitarian and restless, will also increase external uncertainty and risks,” Ni told the event on January 15.\n“In the face of a United States that is ‘more restless, inward-looking and utilitarian’, the key for China is not to react passively to [America’s] policy changes but to enhance the certainty of [our] own development.”\nHis comments come amid growing debate and anxieties across the globe over how the world order will be affected by Trump’s “America first” agenda – as outlined in his administration’s National Security Strategy released last month and national defence strategy released on Friday.\nSuch concerns – recently stoked by Trump’s talk of taking over Greenland and the dramatic US abduction of Venezuela’s former leader Nicolas Maduro and his wife – were laid bare by Canadian Prime Minister Mark Carney last week.\nAddressing the World Economic Forum in Davos on January 20, Carney stated that recent events had shown the “rules-based international order” was effectively dead.\nThe following day, during a meandering 70-minute address in the same Swiss town, Trump slammed Nato once again – describing Europe as “not even recognisable” – and reiterated his push for control over Greenland. However, this time the US commander-in-chief said he “won’t use force” to acquire the semi-autonomous territory from Denmark, a transatlantic ally of Washington.\nQuestions have also been mounting over how the White House’s foreign policy approach could shape the China-US relationship – dubbed “G2” by Trump, although Beijing has not embraced the term – especially given the multiple potential occasions this year for face-to-face summits between Trump and his Chinese counterpart, Xi Jinping, amid a fierce strategic rivalry.\nNi said the Trump administration’s National Security Strategy had “systematically repudiated” the diplomatic paradigm that Washington had followed for more than eight decades since World War II, notably by refusing to continue providing global public goods, diluting alliance commitments and abandoning the outreach of values abroad.\nHe described the strategic transition as an inevitable outcome, as the US no longer possessed the absolute power to dominate the world single-handedly, faced deep-seated structural challenges at home, and was burdened by long-standing flaws in its traditional diplomatic model.\n\nUnder the American shift, international relations were becoming more prone to great-power politics and the law of the jungle, he warned, with the cohesion and institutional credibility of the US alliance system set to erode in the long run, while interstate rivalry would grow increasingly overt.\nFocusing on managing its own work properly and solidifying the foundations of development had emerged as China’s “fundamental strategy” for coping with offshore shocks, Ni continued.\n“In an international environment of rising uncertainty, internal stability and sustained development are the most important strategic resources,” he said.\n“Only by continuously enhancing comprehensive strength, institutional resilience and the quality of development can [China] maintain its strategic initiative.”","url":"https://www.scmp.com/news/china/diplomacy/article/3341292/us-looking-inward-under-trump-made-development-space-china-sino-us-expert-says?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/01/26/b5123a7c-a85e-40dd-96ac-7ce76003f657_0e649fdd.jpg","video":null,"publish_date":"2026-01-27 01:00:11","author":"Orange Wang","authors":["Orange Wang"],"language":"en","source_country":"hk","sentiment":0.32},{"id":396405256,"title":"US looking inward under Trump made development space for China, expert says","text":"China should build on its “most important” strategic assets of domestic stability and progress to navigate US President Donald Trump’s shattering of global norms, a Washington watcher at a Chinese think tank says.\nNi Feng, a researcher and former director of the Chinese Academy of Social Sciences’ Institute of American Studies, said the Trump administration’s “disruptive” overhaul of US diplomacy was sending the international system into a “more volatile and uncertain” phase.\nThis could leave Beijing facing an increasingly “complex and volatile” outside world, he warned during an event organised by the Shanghai Development Research Foundation (SDRF), a non-profit advisory body.\n\n“The US strategic retrenchment and looking inward have created objective conditions for China to strive for development space,” Ni said, according to an excerpt of his speech published by the SDRF on its social media channel on Monday.\n“The US … more tending to be utilitarian and restless, will also increase external uncertainty and risks,” Ni told the event on January 15.\n“In the face of a United States that is ‘more restless, inward-looking and utilitarian’, the key for China is not to react passively to [America’s] policy changes but to enhance the certainty of [our] own development.”\nHis comments come amid growing debate and anxieties across the globe over how the world order will be affected by Trump’s “America first” agenda – as outlined in his administration’s National Security Strategy released last month and national defence strategy released on Friday.\nSuch concerns – recently stoked by Trump’s talk of taking over Greenland and the dramatic US abduction of Venezuela’s former leader Nicolas Maduro and his wife – were laid bare by Canadian Prime Minister Mark Carney last week.\nAddressing the World Economic Forum in Davos on January 20, Carney stated that recent events had shown the “rules-based international order” was effectively dead.\nThe following day, during a meandering 70-minute address in the same Swiss town, Trump slammed Nato once again – describing Europe as “not even recognisable” – and reiterated his push for control over Greenland. However, this time the US commander-in-chief said he “won’t use force” to acquire the semi-autonomous territory from Denmark, a transatlantic ally of Washington.\nQuestions have also been mounting over how the White House’s foreign policy approach could shape the China-US relationship – dubbed “G2” by Trump, although Beijing has not embraced the term – especially given the multiple potential occasions this year for face-to-face summits between Trump and his Chinese counterpart, Xi Jinping, amid a fierce strategic rivalry.\nNi said the Trump administration’s National Security Strategy had “systematically repudiated” the diplomatic paradigm that Washington had followed for more than eight decades since World War II, notably by refusing to continue providing global public goods, diluting alliance commitments and abandoning the outreach of values abroad.\nHe described the strategic transition as an inevitable outcome, as the US no longer possessed the absolute power to dominate the world single-handedly, faced deep-seated structural challenges at home, and was burdened by long-standing flaws in its traditional diplomatic model.\n\nUnder the American shift, international relations were becoming more prone to great-power politics and the law of the jungle, he warned, with the cohesion and institutional credibility of the US alliance system set to erode in the long run, while interstate rivalry would grow increasingly overt.\nFocusing on managing its own work properly and solidifying the foundations of development had emerged as China’s “fundamental strategy” for coping with offshore shocks, Ni continued.\n“In an international environment of rising uncertainty, internal stability and sustained development are the most important strategic resources,” he said.\n“Only by continuously enhancing comprehensive strength, institutional resilience and the quality of development can [China] maintain its strategic initiative.”","summary":"China should build on its “most important” strategic assets of domestic stability and progress to navigate US President Donald Trump’s shattering of global norms, a Washington watcher at a Chinese think tank says.\nNi Feng, a researcher and former director of the Chinese Academy of Social Sciences’ Institute of American Studies, said the Trump administration’s “disruptive” overhaul of US diplomacy was sending the international system into a “more volatile and uncertain” phase.\nThis could leave...","url":"https://www.scmp.com/news/china/diplomacy/article/3341292/us-looking-inward-under-trump-made-development-space-china-sino-us-expert-says","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/01/26/b5123a7c-a85e-40dd-96ac-7ce76003f657_0e649fdd.jpg","video":null,"publish_date":"2026-01-27 01:00:11","author":"Orange Wang","authors":["Orange Wang"],"language":"en","source_country":"cn","sentiment":0.32},{"id":396404244,"title":"\"Did The White House Just Blink?\" Border Patrol Boss 'Demoted' As Minneapolis Mayor Says Feds Are Leaving","text":"On the heels of President Trump's reconciliatory statement earlier hailing his \"very good call\" with Governor Tim Walz, and decision to send Tom Homan to the frontlines in Minnesota...\n\nTrump said.\"I told Governor Walz that I would have Tom Homan call him, and that what we are looking for are any and all Criminals that they have in their possession. The Governor, very respectfully, understood that, and I will be speaking to him in the near future. He was happy that Tom Homan was going to Minnesota, and so am I! \"\n\n...The Atlantic reports that Gregory Bovino has been removed from his role as Border Patrol “commander at large” and will return to his former job in El Centro, California, where he is expected to retire soon, according to a DHS official and two people with knowledge of the change.\n\nCNN's Kaitlan Collins further confirms that DHS has suspended Gregory Bovino’s access to his social media accounts effective immediately. \n\nHe spent yesterday responding to people who were criticizing him and raising questions about his unverified claims about Pretti.\n\nThis reported decision follows pressure from Senate Democrats who refused to allow the current DHS funding bill to move forward, this threatening another federal government shutdown.\n\nAdditionally, Minneapolis Mayor Jacob Frey said after speaking with President Donald Trump that he expects that some federal agents will start leaving the city on Jan. 27.\n\n“I expressed how much Minneapolis has benefited from our immigrant communities and was clear that my main ask is that Operation Metro Surge needs to end,” Frey wrote on X. \n\nTrump said that the conversation with Frey was “very good” and that progress was made.\n\n Trump posted on Truth Social.\n\nThe mayor said he would continue pushing for all federal agents to leave the city.\n\n“Minneapolis will continue to cooperate with state and federal law enforcement on real criminal investigations—but we will not participate in unconstitutional arrests of our neighbors or enforce federal immigration law,” Frey stated on X.\n\nWalz and Frey have repeatedly encouraged the public to protest and demonstrate against immigration operations taking place in the state, at some points using profanity to tell federal officers to leave.\n\nTrump presented a three-point plan to Walz during the call, according to White House press secretary Karoline Leavitt.\n\nThe plan calls for Walz, Frey, and other Minnesota leaders to turn over all criminal illegal immigrants who are currently in custody in state prisons and jails to federal authorities.\n\nThose with active warrants or known criminal histories would be immediately deported, Leavitt said during a press briefing on Jan. 26.\n\nThe plan also calls for state and local law enforcement to agree to turn over all illegal immigrants who are arrested by local police and for local police to help federal law enforcement in arresting and detaining illegal immigrants who are wanted for crimes, especially violent crimes, she said.\n\nWe give the last words to General Flynn...\n\nDid the WH just blink? https://t.co/lyIJ3kQBSq\n— General Mike Flynn (@GenFlynn) January 27, 2026\n\n...good question.","url":"https://www.zerohedge.com/political/did-white-house-just-blink-border-patrol-boss-demoted-minneapolis-mayor-says-feds-are","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2026-01/original.jpg?itok=i8wkViNQ","video":null,"publish_date":"2026-01-27 00:59:17","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.186},{"id":396402548,"title":"Prasoon Joshi once wrote anti-establishment anthems; is now the establishment himself","text":"Prasoon Joshi once wrote anti-establishment anthems; is now the establishment himself Entertainment \n 22 min ago\n\n This is an AI assisted summary.\n\n Prasoon Joshi's 'Roobaroo Roshni' inspired the youth to rebel and have a purpose, but this is lacking in current cinema. As CBFC chairperson, Prasoon has immense power, but the lack of transparency and authoritarianism suggests a larger issue. It's ironic how the man who wrote songs of revolution is now part of the establishment.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 2 / 50\n Top China general removed for ‘leaking’ nuclear-plan to US: Report World \n 1 hr ago\n\n This is an AI assisted summary.\n\n Top Chinese military general Zhang Youxia has been accused of leaking information about the country's nuclear weapons program and accepting bribes. This is part of a larger purge by President Xi Jinping to remove allegedly corrupt military leaders, with Zhang being the most senior leader targeted so far.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 3 / 50\n Hrithik Roshan’s personal chef Shubham Vishwakarma details the actor’s daily diet Lifestyle \n 48 min ago\n\n This is an AI assisted summary.\n\n Hrithik Roshan, known as the Greek God of Bollywood, recently gave a shoutout to his personal chef, Shubham Vishwakarma, on social media. Vishwakarma, who is trained in culinary arts and specializes in nutrition-focused cooking, sees himself as a \"student of food\". He travels with Hrithik and adapts to new kitchens and tight schedules, creating clean, balanced, and intentional meals for the actor.\n\n Read Full Article \n\n URL Copied\n\n Swipe up for next shorts \n\n 4 / 50\n Age rating to list of don’ts: Draft rules on obscenity online India \n 1 hr ago\n\n This is an AI assisted summary.\n\n The Indian government plans to introduce draft rules to tackle obscenity in online content. The proposed IT (Digital Code) Rules, 2026, suggest age-appropriate classification and guidelines for obscene content. Content curators are worried about arbitrary complaints, as the rules apply to all digital media platforms.\n\n Read Full Article \n\n URL Copied\n\n 5 / 50\n Vance, Navarro & Trump resisting India trade deal: US Senator Ted Cruz India \n 3 hr ago\n\n This is an AI assisted summary.\n\n Senator Cruz accuses Trump, Vance, and Navarro of hindering a trade deal with India despite Trump's warm Republic Day message. Cruz claims to have fought against the White House on this issue and warns of potential impeachment due to Trump's tariffs. Negotiations are ongoing to strengthen ties, with a bipartisan delegation meeting with India's External Affairs minister.\n\n Read Full Article \n\n URL Copied\n\n 6 / 50\n 77th Republic Day: Military might, with a dash of Sindoor India \n 3 hr ago\n\n This is an AI assisted summary.\n\n India celebrated its 77th Republic Day with a grand display of military strength, showcasing fighter jets and missiles used in recent operations. The theme of the parade was '150 years of Vande Mataram' and was attended by the President of the European Council and Commission. The parade also included a contingent from the EU and a tableau of a 5th-century ship.\n\n Read Full Article \n\n URL Copied\n\n 7 / 50\n Why modern life needs a touch of ‘Miyabi’ Lifestyle \n 6 hr ago\n\n This is an AI assisted summary.\n\n Miyabi, a Japanese concept rooted in culture for centuries, represents elegance, refinement, and grace. It emphasizes emotional depth, subtlety, and simplicity in design, manners, and art. In today's busy world, Miyabi reminds us to appreciate the small things and find beauty in restraint. It encourages a life of quiet dignity and cherishing the little things.\n\n Read Full Article \n\n URL Copied\n\n MORE FOR YOU\n\n My Express\n\n Podcast\n\n ePaper\n\n Games\n\n Horoscope\n\n UPSC\n\n 8 / 50\n Nat Sciver-Brunt: Didn’t want to replicate other players by getting out in 90s Sports \n 6 hr ago\n\n This is an AI assisted summary.\n\n Nat Sciver-Brunt becomes the first cricketer in Women's Premier League history to score a century in four editions. Her unbeaten 100 off 57 balls helped Mumbai Indians to a 15-run victory over Royal Challengers Bengaluru. Sciver-Brunt credits her preparations for the milestone and MI captain Harmanpreet Kaur praises the team's camaraderie and off-field bonding.\n\n Read Full Article \n\n URL Copied\n\n 9 / 50\n Lara Dutta reflects on never wanting to depend on any man Lifestyle \n 7 hr ago\n\n This is an AI assisted summary.\n\n Lara Dutta, 47, took her time before marrying Mahesh Bhupathi, prioritizing her career and financial stability. She emphasizes that her husband has never imposed on her and that she chose marriage after achieving a fulfilling life, not due to societal pressure.\n\n Read Full Article \n\n URL Copied\n\n 10 / 50\n Hockey India League: Kalinga Lancers beat Ranchi Royals to be crowned champions Sports \n 7 hr ago\n\n This is an AI assisted summary.\n\n Kalinga Lancers beat Ranchi Royals 3-2 in a thrilling final to win the HIL title in front of a home crowd. Hendrickx and Dilpreet Singh scored the decisive goals for the Lancers. Ranchi Royals fought hard but fell short, with Boon and Hundal scoring for them. Kalinga Lancers dominated the second quarter and held on to win, with goalkeeper Pathak making crucial saves.\n\n Read Full Article \n\n URL Copied\n\n 11 / 50\n India vs Zimbabwe U19 World Cup ​Super 6 Match Live Cricket Streaming Sports \n 8 hr ago\n\n This is an AI assisted summary.\n\n India will face Zimbabwe in the Super 6 match of the U19 World Cup, hoping to continue their winning streak after a dominant performance against New Zealand. The match will be telecast on Star Sports Network and streamed on JioHotstar app. \n\n Read Full Article \n\n URL Copied\n\n 12 / 50\n PCB defers T20 World Cup call amid ICC row, India match boycott looms Sports \n 9 hr ago\n\n This is an AI assisted summary.\n\n The PCB has delayed its decision on joining the T20 World Cup and will decide by Monday. The chairman met with the Prime Minister to discuss options. Basit Ali advises against boycotting India, citing potential consequences. The ICC may impose sanctions if Pakistan withdraws from the tournament.\n\n Read Full Article \n\n URL Copied\n\n 13 / 50\n Alex Honnold climbs ‘Skyscraper’ without any safety gear Entertainment \n 9 hr ago\n\n This is an AI assisted summary.\n\n Alex Honnold, a 40-year-old American free solo climber, made history by scaling a 101-floor skyscraper without any safety gear in Taiwan. The live stream of his ascent on Netflix kept viewers on the edge of their seats as he defied all odds and reached the top in an hour and a half.\n\n Read Full Article \n\n URL Copied\n\n 14 / 50\n ‘Pakistan shouldn’t boycott but play India with black arm band’: Basit Ali’s suggestion Sports \n 9 hr ago\n\n This is an AI assisted summary.\n\n Former Pakistan cricketer Basit Ali has urged Pakistan to play against India in the upcoming T20 World Cup while wearing black armbands as a form of protest, rather than boycotting the match. He warns that previous boycotts have damaged the sport and could have negative consequences, including sanctions from the ICC. He appeals to authorities to make decisions that do not harm cricket.\n\n Read Full Article \n\n URL Copied\n\n 15 / 50\n Nat Sciver-Brunt becomes first player to slam a century in WPL history Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n Nat Sciver-Brunt of Mumbai Indians made history by scoring the first century in the Women's Premier League, with 16 fours and 1 six in her 57-ball innings. RCB's Smriti Mandhana chose to bowl after winning the toss, while MI's Amelia Kerr returned to the playing XI. \n\n Read Full Article \n\n URL Copied\n\n 16 / 50\n IND vs NZ | The Jasprit Bumrah effect: India’s ultimate trump card at T20 World Cup Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n Jasprit Bumrah, a versatile and deceptive bowler, has been compared to Wasim Akram for his magical skills. With his strong bowling unit, he offers complete control in all phases of the game and is considered India's ultimate weapon for winning the T20 World Cup.\n\n Read Full Article \n\n URL Copied\n\n 17 / 50\n Varun Dhawan’s pull-up video inside Metro lands him in trouble, authorities issue warning Entertainment \n 12 hr ago\n\n This is an AI assisted summary.\n\n Varun Dhawan, star of the hit film Border 2, caused controversy when videos of him performing pull-ups inside a Mumbai Metro coach went viral. The actor had taken the metro to avoid traffic and promote his film, but the metro authorities issued a safety advisory and asked him to include a disclaimer in such situations.\n\n Read Full Article \n\n URL Copied\n\n 18 / 50\n ‘I don’t believe he is the man to get them winning league titles’: Keane on Carrick Sports \n 11 hr ago\n\n This is an AI assisted summary.\n\n Michael Carrick, interim manager of Manchester United, has impressed with two wins over top teams in the league. However, former United player Roy Keane doubts his ability to lead the team to league titles and believes he is not the right choice for the permanent job. Despite this, Carrick is enjoying the role and has already beaten the top two teams in just two games.\n\n Read Full Article \n\n URL Copied\n\n 19 / 50\n Darren Cahill reveals how Jannik Sinner survived extreme heat to reach 4th round Sports \n 11 hr ago\n\n This is an AI assisted summary.\n\n Despite facing challenges due to extreme heat, Jannik Sinner managed to advance to the fourth round at the Australian Open. With the help of his coach and self-management skills, he overcame cramps and conserved energy until the roof was closed. Sinner's struggles with heat were addressed and he stuck to his routine to defeat his opponent in straight sets.\n\n Read Full Article \n\n URL Copied\n\n 20 / 50\n WPL 2026 Playoffs qualification scenario for DC, MI, GG & UPW Sports \n 7 hr ago\n\n This is an AI assisted summary.\n\n RCB secures spot in WPL 2026 playoffs, leaving two teams to battle for remaining spot in Eliminator. Delhi Capitals and Gujarat Giants have chance to qualify with two wins, while Mumbai Indians must win both remaining matches to stay in race. UP Warriorz have slim chance of qualifying. RCB only needs one win for direct spot in final.\n\n Read Full Article \n\n URL Copied\n\n 21 / 50\n Can the right environment make animals ‘smarter’? An Expert Explains Explained \n 11 hr ago\n\n This is an AI assisted summary.\n\n Veronika, a 13-year-old cow from Austria, has been observed using a deck brush to scratch herself, demonstrating tool usage. Researchers found that her stimulating environment played a key role in developing her tooling abilities. While tool use is more common in certain animals due to various factors, livestock like Veronika have been overlooked in cognitive studies.\n\n Read Full Article \n\n URL Copied\n\n 22 / 50\n Ishan Kishan effect: How early intent is powering India’s powerplays against New Zealand Sports \n 10 hr ago\n\n This is an AI assisted summary.\n\n India's dominance in the ongoing T20I series against New Zealand is being driven by their ability to respond to early setbacks. In the third T20I, Ishan Kishan's aggressive batting in the powerplay, along with Abhishek Sharma's support, helped India break their own record for the fastest-ever team fifty.\n\n Read Full Article \n\n URL Copied\n\n 23 / 50\n Etihad Rail plans to launch passenger train service in UAE soon World \n 12 hr ago\n\n This is an AI assisted summary.\n\n Etihad Rail is launching the first phase of the UAE's passenger train service, connecting 11 cities through strategically located stations. The trains will have modern amenities and operate on a precise schedule, providing a safe and reliable mode of travel. The launch is expected to have a positive impact on tourism, economic and social ties between the Emirates.\n\n Read Full Article \n\n URL Copied\n\n 24 / 50\n Arjun Bijlani, Ankita Lokhande, Nia Sharma return to a ‘revamped’ Laughter Chefs 3 Entertainment \n 12 hr ago\n\n This is an AI assisted summary.\n\n Laughter Chefs Season 3 kicked off in November 2025 with a new concept and fresh faces, including Vivian D'sena, Tejasswi Prakash, Gurmeet Choudhary, Debina Bonnerjee, Eisha Singh, and Isha Malviya. However, the new format and additions failed to impress the audience, resulting in a major revamp and the abrupt end of the team concept.\n\n Read Full Article \n\n URL Copied\n\n 25 / 50\n How Donald Trump is driving de-dollarisation, and contributing to the gold surge Explained \n 12 min ago\n\n This is an AI assisted summary.\n\n Gold prices reach $5,000 per ounce as US dollar drops to four-month low. Central banks, including Reserve Bank of India, buying gold due to Trump's policies. This shift away from USD could impact global economy and security as more countries diversify their forex reserves. Trump's actions have weakened dollar's status and could lead to further diversification.\n\n Read Full Article \n\n URL Copied\n\n 26 / 50\n When Kajol’s son Yug called her out for scolding Nysa Lifestyle \n 13 hr ago\n\n This is an AI assisted summary.\n\n Kajol's son, Yug, showed maturity at a religious gathering, impressing his mother. Psychologist Rasshi Gurnani stresses the need for parents to differentiate between defiance and honest self-expression in children. Building a safe space for children to express themselves without fear of judgement is crucial. Repairing trust and validating a child's honesty can strengthen the parent-child bond.\n\n Read Full Article \n\n URL Copied\n\n 27 / 50\n ‘He is showing that he is a big-match player’: Rohit Sharma on Tilak Varma Sports \n 13 hr ago\n\n This is an AI assisted summary.\n\n Tilak Varma has emerged as a key player in India's T20I team, with Rohit Sharma praising his mindset and attitude. His impressive performance in the Asia Cup final against Pakistan last year showcased his temperament and ability to handle pressure. However, Varma's fitness is a concern and he is expected to join the team for the T20 World Cup warm-up match.\n\n Read Full Article \n\n URL Copied\n\n 28 / 50\n Shark Tank India 5 pitcher, says sales went up 2x, did one month’s revenue in a day Entertainment \n 13 hr ago\n\n This is an AI assisted summary.\n\n Brothers Harshit and Tanay Agarwal's mithai brand, Pistabarfi, was featured on Shark Tank India 5 but left without a deal. Despite receiving praise, they refused to give up their film careers for the brand, resulting in them losing out on funding. Tanay believes standing their ground is more important than getting a deal.\n\n Read Full Article \n\n URL Copied\n\n 29 / 50\n ‘Pakistan intervening in matter without any reason’: Rajeev Shukla on BAN’s T20 WC ouster Sports \n 14 hr ago\n\n This is an AI assisted summary.\n\n BCCI VP accuses Pakistan of interfering in India vs Bangladesh T20 World Cup issue, causing confusion. Bangladesh government and cricket board refused to travel due to security concerns, leading to Scotland's inclusion. Pakistan's participation depends on PM's decision, PCB suggests hybrid model for Bangladesh. Shukla says it is unnecessary for Pakistan to get involved.\n\n Read Full Article \n\n URL Copied\n\n 30 / 50\n ‘Game was over in single over’: R Ashwin on Ishan Kishan’s ‘audacity’ Sports \n 14 hr ago\n\n This is an AI assisted summary.\n\n Ashwin praises Ishan Kishan's confidence and approach in the India vs New Zealand match. Kishan came in at one down after Samson's wicket and immediately took on the Kiwi bowler, impressing Ashwin. Kishan's audacity and skill were on display as he helped India chase down the target of 154 in just 10 overs.\n\n Read Full Article \n\n URL Copied\n\n 31 / 50\n Sunita Williams names her ‘favourite’ dessert during Kerala visit, video wins hearts Trending \n 15 hr ago\n\n This is an AI assisted summary.\n\n In a viral video shared by the official handle of the outlet, Falooda Nation, the former Nasa astronaut can be seen relishing the popular Indian dessert. Williams is seen seated comfortably as she enjoys the falooda and chats with people around her. Text overlaid on the video read, “From zero gravity to full falooda.\"\n\n Read Full Article \n\n URL Copied\n\n 32 / 50\n ‘I don’t drink coffee anymore’: Actor Banita Sandhu on fitness, food, and films Lifestyle \n 15 hr ago\n\n This is an AI assisted summary.\n\n Banita Sandhu, the October actress, shares her secrets on her morning routine, fitness, wellness, food indulgences, and journey with Hindi. She reveals her handbag essentials and upcoming projects. Banita follows a structured morning routine with journaling, a turmeric and ginger concoction, and a French omelette for breakfast.\n\n Read Full Article \n\n URL Copied\n\n 33 / 50\n Vande Bharat Sleeper train: ICF to manufacture 50 rakes of 24-car coaches India \n 15 hr ago\n\n This is an AI assisted summary.\n\n The newly introduced Vande Bharat Sleeper train between Howrah and Kamakhya has reduced travel time and improved regional connectivity. It features 16 coaches, including 11 Third AC, 4 Second AC, and 1 First AC. The Chennai-based Integral Coach Factory (ICF) will manufacture 50 rakes of 24-coach Vande Bharat Sleeper trains.\n\n Read Full Article \n\n URL Copied\n\n 34 / 50\n Month before Xi Jinping’s purge of China’s general, Pentagon flagged ‘uncertainty’ Explained \n 2 hr ago\n\n This is an AI assisted summary.\n\n Chinese General Zhang Youxia is being investigated for allegedly sharing classified information about the country's nuclear weapons program with the US. This follows the removal of other high-ranking officers for corruption, raising concerns about the military's effectiveness. The purge of top leaders shows China's determination to weed out disloyalty, which could hinder the modernization efforts.\n\n Read Full Article \n\n URL Copied\n\n 35 / 50\n Waheeda Rehman reacts to AR Rahman’s Bollywood is ‘communal’ remark: ‘Yeh mulk hamara hai’ Entertainment \n 10 hr ago\n\n This is an AI assisted summary.\n\n AR Rahman has been facing backlash for suggesting that he has lost work in the Hindi film industry due to a communal bias and power shift. While he clarified his intentions, celebs like Javed Akhtar and Kangana Ranaut reacted. In an exclusive interview, Waheeda Rehman said that the reason behind his claims might be time and that such fluctuations are common in the industry.\n\n Read Full Article \n\n URL Copied\n\n 36 / 50\n Tilak Varma ruled out for remaining New Zealand T20Is, Shreyas Iyer to continue Sports \n 16 hr ago\n\n This is an AI assisted summary.\n\n Shreyas Iyer will remain in the Indian squad for the remainder of their ongoing T20I series against New Zealand, with Tilak Varma now slated to join the team only before India's warm-up match for the 2026 T20 World Cup.\n\n Read Full Article \n\n URL Copied\n\n 37 / 50\n These animals can ‘smell’ fear Lifestyle \n 16 hr ago\n\n This is an AI assisted summary.\n\n Some animals have the ability to detect fear through chemical signals, such as sweat and breath. Dogs, horses, sharks, snakes, rats, elephants, rabbits, and wolves are among the animals that possess this extraordinary sense. This sensitivity helps them assess danger, respond to threats, and survive in their environments.\n\n Read Full Article \n\n URL Copied\n\n 38 / 50\n ‘I am surprising myself’: Carlos Alcaraz opens up about renewed serve at Australian Open Sports \n 16 hr ago\n\n This is an AI assisted summary.\n\n At just 22 years old, Carlos Alcaraz has impressed at the Australian Open with his improved serving technique. He credits his high first serve percentage as a key weapon in his game. Breaking records, including most quarter-final appearances before turning 23 in the Open Era, Alcaraz has caught the attention of even Novak Djokovic, who jokes about their similar serves.\n\n Read Full Article \n\n URL Copied\n\n 39 / 50\n Chiranjeevi reacts to ‘casting couch’ allegations in Telugu cinema Entertainment \n 16 hr ago\n\n This is an AI assisted summary.\n\n Chiranjeevi's Mana Shankara Vara Prasad Garu has emerged as the winner of the Pongal-Sankranti season, grossing over Rs 300 crore worldwide. At a special event, the star addressed the issue of the casting couch in the film industry, stating that being professional and firm with principles can prevent exploitation. However, his remarks contradict the experiences of actors like Fatima Sana Shaikh.\n\n Read Full Article \n\n URL Copied\n\n 40 / 50\n Over 77% Indian esports players see streaming as key income path: YouGov poll Technology \n 16 hr ago\n\n This is an AI assisted summary.\n\n Over 77 per cent of Indian esports players say that they see clear monetisation opportunities in streaming today beyond participating and winning esports tournaments, according to a survey jointly conducted by JetSynthesys and YouGov. The survey also found that around 83 per cent of respondents believe there is financial viability in pursuing esports as a career.\n\n Read Full Article \n\n URL Copied\n\n 41 / 50\n ChatGPT cites Elon Musk’s Grokipedia as source multiple times: Report Technology \n 17 hr ago\n\n This is an AI assisted summary.\n\n GPT-5.2, the latest large language model (LLM) powering ChatGPT, has been found to cite Musk-owned xAI’s Grokipedia as a source in response to a wide range of queries, according to a report by The Guardian. The Wikipedia challenger was reportedly cited nine times in ChatGPT’s responses to more than a dozen questions on various topics such as the political structures in Iran and Holocaust deniers.\n\n Read Full Article \n\n URL Copied\n\n 42 / 50\n Amrit Bharat Express 3.0 trains: ICF to manufacture two rakes by FY26 end – what’s new India \n 14 hr ago\n\n This is an AI assisted summary.\n\n The Ministry of Railways is set to launch Amrit Bharat 3.0 trains, designed to provide affordable and high-quality service for passengers from lower and lower-middle income categories. Two rakes of the upgraded trains will be manufactured this financial year, featuring a mix of AC and non-AC coaches.\n\n Read Full Article \n\n URL Copied\n\n 43 / 50\n India-origin scientist’s reality check for Silicon Valley techies goes viral Trending \n 17 hr ago\n\n This is an AI assisted summary.\n\n India-origin scientist Ram Swaminathan recently sparked a conversation about everyday life in the US, questioning those who work 60 hours a week in Silicon Valley but escape city life over the weekend.\n\n Read Full Article \n\n URL Copied\n\n 44 / 50\n Govinda performs ‘Kisi disco mein jaaye’ at a school’s annual day event Entertainment \n 17 hr ago\n\n This is an AI assisted summary.\n\n Govinda, who has been absent from the film industry, made a comeback at a school's annual day function in Uttar Pradesh. He performed on his hit song and a Bhojpuri track, and also attended another event where he danced and sang. He also lit the ceremonial lamp at the annual day event.\n\n Read Full Article \n\n URL Copied\n\n 45 / 50\n ‘Jaya Bachchan scolds ministers; Rekha came to Parliament once in session’: Rajeev Shukla Entertainment \n 17 hr ago\n\n This is an AI assisted summary.\n\n Congress Rajya Sabha MP and veteran journalist Rajeev Shukla recently emphasised that Jaya Bachchan, unlike her husband Amitabh Bachchan, commands respect with an iron fist, as she is a very strict and disciplined person. \"If she feels that someone is being even a bit undisciplined, she won't tolerate it,\" he said during an interview. Shukla added, \"Rekha ji used to come only once per session.\"\n\n Read Full Article \n\n URL Copied\n\n 46 / 50\n How the voyage of INSV Kaundinya points to a deepening of Indo-Oman relations Explained \n 17 hr ago\n\n This is an AI assisted summary.\n\n The maiden voyage of INSV Kaundinya from Porbandar to Muscat symbolises the revival of India's ancient shipbuilding traditions and the strong maritime bond between India and Oman. The use of traditional techniques pays homage to indigenous knowledge and showcases the historical connections between the two nations.\n\n Read Full Article \n\n URL Copied\n\n 47 / 50\n Republic Day 2026: Sanjay Leela Bhansali pays tribute to Mother India and other classics Entertainment \n 18 hr ago\n\n This is an AI assisted summary.\n\n Bollywood director Sanjay Leela Bhansali, who is known for his elaborate sets and the grandeur he brings to his films, was asked to design the tableau of the Ministry of Information and Broadcasting, representing Indian cinema at Kartavya Path on Republic Day.\n\n Read Full Article \n\n URL Copied\n\n 48 / 50\n ExplainSpeaking | Budget 2026: Three macro worries for the Finance Minister Explained \n 10 hr ago\n\n This is an AI assisted summary.\n\n Finance Minister Nirmala Sitharaman will present the Budget on February 1, outlining the government's expected growth rate, revenue sources, and borrowing. Weak GDP growth, tax buoyancy, and private investments are major concerns for the FM, as government efforts to boost private sector investments have not been as successful as expected.\n\n Read Full Article \n\n URL Copied\n\n 49 / 50\n Why Carlos Alcaraz was forced to strip off fitness tracker device at Australian Open 2026 Sports \n 18 hr ago\n\n This is an AI assisted summary.\n\n Aussie tennis greats, including Whoop founder Will Ahmed, Todd Woodbridge, and Lleyton Hewitt, criticized the Australian Open organizers for banning the Whoop fitness tracking devices worn by players Carlos Alcaraz and Aryna Sabalenka. The ITF rules state that the devices are approved for in-match wear, but Tennis Australia confirmed that they are still banned during Grand Slam tournaments.\n\n Read Full Article \n\n URL Copied\n\n 50 / 50\n Zohran Mamdani shovels snow, helps dig out stranded cars amid record snowstorm in NYC Trending \n 18 hr ago\n\n This is an AI assisted summary.\n\n The United States is currently braving the biggest snowstorm in five years, leaving people stranded and transportation systems disrupted. New York City Mayor Zohran Mamdani surprised many residents over the weekend by assisting drivers whose cars were trapped by heavy snowfall.\n\n Read Full Article \n\n URL Copied","url":"https://indianexpress.com/shorts/entertainment/bollywood/rang-de-basanti-turns-20-poet-prasoon-joshi-wrote-anti-establishment-anthems-now-chairperson-of-cbfc-10490862/","image":"https://images.indianexpress.com/2026/01/rang-de-basanti-prasoon-joshi.jpg","video":null,"publish_date":"2026-01-27 00:59:12","author":"President Xi Jinping","authors":["President Xi Jinping"],"language":"en","category":"politics","source_country":"in","sentiment":0.408},{"id":396401136,"title":"Ex-FIFA president Sepp Blatter joins those calling for boycott of World Cup in United States","text":"Former FIFA president Sepp Blatter on Monday backed a proposed fan boycott of World Cup matches in the United States because of the conduct of President Donald Trump and his administration at home and abroad.\n\nBlatter was the latest international soccer figure to call into question the suitability of the United States as a host country. He called for the boycott in a post on X that supported Mark Pieth's comments in an interview last week with the Swiss newspaper Der Bund.\n\nPieth, a Swiss attorney specializing in white-collar crime and an anti-corruption expert, chaired the Independent Governance Committee's oversight of FIFA reform a decade ago. Blatter was president of the world's governing body for soccer from 1998-2015; he resigned amid an investigation into corruption.\n\nIn his interview with Der Bund, Pieth said, “If we consider everything we’ve discussed, there’s only one piece of advice for fans: Stay away from the USA! You’ll see it better on TV anyway. And upon arrival, fans should expect that if they don’t please the officials, they’ll be put straight on the next flight home. If they’re lucky.”\n\nIn his X post, Blatter quoted Pietha and added, “I think Mark Pieth is right to question this World Cup.”\n\nThe United States is co-hosting the World Cup with Canada and Mexico from June 11-July 19.\n\nThe international soccer community's concerns about the United States stem from Trump's expansionist posture on Greenland, travel bans and aggressive tactics in dealing with migrants and immigration enforcement protestors in American cities, particularly Minneapolis.\n\nOke Göttlich, one of the vice presidents of the German soccer federation, told the Hamburger Morgenpost newspaper in an interview on Friday that the time had come to seriously consider boycotting the World Cup.\n\nTwo weeks ago, travel plans for fans from two of the top soccer countries in Africa were thrown into disarray when the Trump administration announced a ban that would effectively bar people from Senegal and Ivory Coast from following their teams unless they already have visas. Trump cited “screening and vetting deficiencies” as the main reason for the suspensions.\n\nFans from Iran and Haiti, two other countries that have qualified for the World Cup, will be barred from entering the United States as well; they were included in the first iteration of the travel ban announced by the Trump administration.\n\nAP soccer: https://apnews.com/hub/soccer","summary":"Former FIFA president Sepp Blatter is backing a proposed fan boycott of World Cup matches in the United States because of the conduct of President Donald Trump and his administration at home and abroad","url":"https://www.independent.co.uk/news/sepp-blatter-donald-trump-united-states-swiss-mexico-b2908159.html","image":"https://static.independent.co.uk/2026/01/27/01/World_Cup_Blatter_Soccer_84817.jpg?width=1200","video":null,"publish_date":"2026-01-27 00:58:54","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.182},{"id":396405704,"title":"What if Trump doesn’t chicken out next time?","text":"Investors think they have Donald Trump worked out. He’s a classic bully who will always back down when confronted by a strong opponent, whether that opponent is a geopolitical counterpart or the markets themselves.\n\nThat’s the premise behind the market’s faith in the “TACO” (Trump will Always Chicken Out) trade.\n\nFor much of Trump’s second term, that has been how events have played out, most spectacularly last year when the US share and bond markets melted down in response to Trump’s April 2 “Liberation Day” tariffs. Trump immediately paused those Draconian tariffs for 90 days and subsequently diluted the severity of what he had planned.\n\nChina, faced with exceptionally punitive tariffs, responded with similarly punishing tariffs of its own. Trump backed off and now largely avoids references to America’s trading relationship with China.","url":"https://www.brisbanetimes.com.au/business/markets/what-if-trump-doesn-t-chicken-out-next-time-20260127-p5nx87.html","image":"https://static.ffx.io/images/$zoom_0.29045529347229837%2C$multiply_0.7025%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_19/t_crop_custom/q_86%2Cf_auto/5aa730a4cb672c8759ec9095e7900c190c55cce0","video":null,"publish_date":"2026-01-27 00:58:24","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.13},{"id":396401082,"title":"What if Trump doesn’t chicken out next time?","text":"Investors think they have Donald Trump worked out. He’s a classic bully who will always back down when confronted by a strong opponent, whether that opponent is a geopolitical counterpart or the markets themselves.\n\nThat’s the premise behind the market’s faith in the “TACO” (Trump will Always Chicken Out) trade.\n\nFor much of Trump’s second term, that has been how events have played out, most spectacularly last year when the US share and bond markets melted down in response to Trump’s April 2 “Liberation Day” tariffs. Trump immediately paused those Draconian tariffs for 90 days and subsequently diluted the severity of what he had planned.\n\nChina, faced with exceptionally punitive tariffs, responded with similarly punishing tariffs of its own. Trump backed off and now largely avoids references to America’s trading relationship with China.","url":"https://www.smh.com.au/business/markets/what-if-trump-doesn-t-chicken-out-next-time-20260127-p5nx87.html","image":"https://static.ffx.io/images/$zoom_0.29045529347229837%2C$multiply_0.7025%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_21/t_crop_custom/q_86%2Cf_auto/5aa730a4cb672c8759ec9095e7900c190c55cce0","video":null,"publish_date":"2026-01-27 00:58:24","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.13},{"id":396401286,"title":"What if Trump doesn’t chicken out next time?","text":"Investors think they have Donald Trump worked out. He’s a classic bully who will always back down when confronted by a strong opponent, whether that opponent is a geopolitical counterpart or the markets themselves.\n\nThat’s the premise behind the market’s faith in the “TACO” (Trump will Always Chicken Out) trade.\n\nFor much of Trump’s second term, that has been how events have played out, most spectacularly last year when the US share and bond markets melted down in response to Trump’s April 2 “Liberation Day” tariffs. Trump immediately paused those Draconian tariffs for 90 days and subsequently diluted the severity of what he had planned.\n\nChina, faced with exceptionally punitive tariffs, responded with similarly punishing tariffs of its own. Trump backed off and now largely avoids references to America’s trading relationship with China.","summary":"Investors think they have Donald Trump worked out, but that assumption could blow up in their faces.","url":"https://www.theage.com.au/business/markets/what-if-trump-doesn-t-chicken-out-next-time-20260127-p5nx87.html","image":"https://static.ffx.io/images/$zoom_0.29045529347229837%2C$multiply_0.7025%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_21/t_crop_custom/q_86%2Cf_auto/5aa730a4cb672c8759ec9095e7900c190c55cce0","video":null,"publish_date":"2026-01-27 00:58:24","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.13},{"id":396400204,"title":"Unveiling the Threat: Shadowy Funding Behind Anti-ICE Mobs Endangers Law Enforcement, CEO Alerts","text":"In Minnesota, violent clashes involving Immigration and Customs Enforcement agents have been escalating, with some attributing the unrest to external forces taking advantage of the disorder rather than genuine protest movements. An insider from the protest scene has raised alarms about the growing intensity of the situation, suggesting it’s spiraling out of control.\n\nAdam Swart, CEO of Crowds on Demand, shared insights with Fox News Digital, revealing that numerous agitators seem to be backed by “shadowy interests” that thrive on chaos and confrontation. Swart emphasized that law enforcement’s concerns about the increasing violence are indeed justified.\n\n“I believe many of the most aggressive and unlawful actors targeting ICE are not organic protesters, but are being financed by shadowy interests that benefit from chaos and confrontation,” Swart stated.\n\nThese warnings arise in the midst of prolonged disturbances linked to ICE enforcement activities in and around the Twin Cities. These operations have sparked protests often characterized by obstructed federal vehicles, personal threats against agents, and doxxing campaigns aimed at ICE personnel and their families.\n\nSwart mentioned that his company declined any involvement in the Minneapolis protests, labeling the unrest as “illegal chaos.” He further explained that his firm “would not touch the Minneapolis protests with a 10-foot pole” due to the unsafe and unlawful tactics being employed on the streets.\n\n“Blocking roadways, obstructing federal agents, and threatening authorities are illegal, and we don’t engage in any form of illegal protest,” Swart said in that earlier interview, warning the chaos could backfire and prompt increased enforcement rather than reform.\n\nAccording to Swart, confrontations between demonstrators and federal agents have devolved into a self-perpetuating escalation cycle.\n\n“When anti-ICE activists threaten agents personally, doxx their families, and use their cars to impede them, those actions cause agents to act more aggressively,” Swart said. “ICE acting aggressively in turn causes people to act more aggressively toward ICE, perpetuating the cycle.”\n\nSwart called on President Donald Trump to adopt an immediate “cease-fire posture” in Minnesota, not as a retreat from immigration enforcement, but as a tactical reset to de-escalate tensions and prevent further harm to agents, protesters, and civilians.\n\nHe also outlined a series of policy recommendations he said could narrow flashpoints, including prioritizing the deportation of criminal illegal immigrants, ensuring non-criminal undocumented immigrants can report crimes without fear of deportation, clarifying sanctuary city policies, requiring ICE to operate in clearly marked uniforms and vehicles, and limiting ICE’s role in crowd control.\n\nWhile condemning protesters who interfere with federal operations, Swart also said there are instances in which ICE has used disproportionate force, warning that continued escalation risks turning Minnesota into a sustained flashpoint.\n\nSwart’s comments come as the Trump administration shifts its response in Minnesota. The White House confirmed that border czar Tom Homan has been deployed to the state to oversee enforcement operations and assess the unrest.\n\nStepheny Price covers crime, including missing persons, homicides and migrant crime. Send story tips to stepheny.price@fox.com.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn Minnesota, violent clashes involving Immigration and Customs Enforcement agents have been&#8230;\n\n\nThis Post: Unveiling the Threat: Shadowy Funding Behind Anti-ICE Mobs Endangers Law Enforcement, CEO Alerts first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/unveiling-the-threat-shadowy-funding-behind-anti-ice-mobs-endangers-law-enforcement-ceo-alerts/","image":"https://internewscast.com/wp-content/uploads/2026/01/Anti-ICE-mobs-bankrolled-by-shadowy-interests-putting-law-enforcement-in.gif","video":null,"publish_date":"2026-01-27 00:57:24","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.096},{"id":396400770,"title":"Gold Extends Gains Above $5,000 As Debasement Trade Gathers Pace","text":"Gold rose, holding above $5,000 an ounce for a second day, as a weak dollar helped to extend a rally fueled by geopolitical risks and investor flight from sovereign bonds and currencies.Bullion jumped as much as 1.1% early on Tuesday, its seventh straight day of gains. A gauge of the dollar gauge fell to its lowest in nearly four years during the previous session, making gold more affordable for most buyers, while US President Donald Trump threatened to hike tariffs on South Korean goods to 25%.Gold's dramatic rally – the metal has more than doubled over the last two years – drives home bullion's historic role as a gauge of fear in markets. Fresh from its best annual performance since 1979, it's gained a further 17% so far this year due largely to the so-called debasement trade, whereby investors retreat from currencies and Treasuries. A massive selloff in the Japanese bond market is the latest example of investors rejecting heavy fiscal spending.In recent weeks, the Trump administration's actions — attacks on the independence of the Federal Reserve, threats to annexe Greenland, military intervention in Venezuela — have also shaken markets. The US leader's warning to South Korea follows a threat to Canada over the weekend to impose 100% tariffs if Ottawa makes a trade deal with China.Options traders are betting gold will rally further as investors diversify from American assets. Implied volatility of Comex gold futures climbed to the highest since the peak of the Covid-19 pandemic in March 2020, while volatility on State Street's SPDR Gold Shares — the world's largest gold-backed exchange-traded fund — has also broken out higher.Looking ahead, investors will also be keeping a close tab on the Federal Reserve's actions on Wednesday, with the US central bank widely expected to halt its rate-cutting cycle as a steadier jobs market restores a degree of consensus after months of growing division.Gold rose 0.9% to $5,051.50 an ounce as of 8:15 a.m. in Singapore. Silver advanced 3.6% to $107.49 an ounce, having hit an all-time high above $117.71 in the previous session before retreating. Platinum and palladium climbed, while the Bloomberg Dollar Spot Index was flat after falling 0.4% in the previous session.","url":"https://www.ndtvprofit.com/markets/gold-extends-gains-above-5-000-as-debasement-trade-gathers-pace-10890021","image":"https://c.ndtvimg.com/2026-01/2u87stkg_gold_625x300_26_January_26.jpg?im=FitAndFill,algorithm=dnn,width=1080,height=607","video":null,"publish_date":"2026-01-27 00:57:22","author":null,"language":"en","source_country":"in","sentiment":0.01},{"id":396353278,"title":"Holness saddened by passing of Sly Dunbar","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLowell \"Sly\" Dunbar (X photo: Andrew Holness) \n\n Latest News, News \n\nJanuary 26, 2026\n\n\n\n\n Holness saddened by passing of Sly Dunbar \n\n\n\n\n\n\n\nKINGSTON, Jamaica — Prime Minister Andrew Holness has expressed sadness at the passing of legendary drummer Lowell “Sly” Dunbar.\n\nHolness, in a tweet on X, said Jamaica and the entire world have lost a titan of music.\n\n“Sly was an architect of sound. Alongside Robbie Shakespeare, he established a foundation that defined the era of Reggae and Dancehall. From the “Taxi” label to his work with international superstars like Grace Jones and The Rolling Stones, Sly’s influence was global,” Holness wrote.\n\nThe prime minister described Dunbar as a pioneer who integrated electronic elements into traditional reggae beats, keeping our music modern and relevant for decades.\n\n“Despite his immense international success and his Order of Distinction, he remained a humble son of the soil, always ready to mentor the next generation. When you hear his signature “rim shot” or that specific drum beat, you know you are listening to a master. His contribution to our cultural heritage is immeasurable. His legacy lives on every time a drum kit is played or a reggae record spins,” Holness continued.\n\nHolness extended condolences to Dunbar’s family, friends, and the music fraternity.\n\nREAD: Legendary drummer Sly Dunbar dies at 73\n\n\n\n\n\n\n\n\nTags: death Drummer Lowell \"Sly\" Dunbar Prime Minister Andrew Holness \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Minor 3.2 magnitude earthquake felt in Portland \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n PORTLAND, Jamaica — A minor earthquake was felt in Portland on Monday. According to the Earthquake Unit at the University of the West Indies, the 3.2 ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n PNP pays tribute to Lowell ‘Sly’ Dunbar \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n KINGSTON, Jamaica — Shadow Minister of Culture, Creative Industries and Information, Nekeisha Burchell, says she is saddened by the passing of iconi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Sly Dunbar leaves behind legacy of hits that touched the world \n\n\n\n\n BY HOWARD CAMPBELL Observer writer \n\n\n\nJanuary 26, 2026 \n\n\n KINGSTON, Jamaica — Lowell \"Sly\" Dunbar, the celebrated drummer who helped fashion the reggae beat, died on January 26, his wife Thelma told Observer ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational, Latest News \n\n\n\n\n\n\n\n\n\n Ex-FIFA boss Blatter suggests fans should not travel to US for World Cup \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n PARIS, France (AFP) — Former FIFA president Sepp Blatter on Monday suggested he supports fans boycotting World Cup matches in the United States (US) t... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Jamalco track meet waives fees for western schools \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n KINGSTON, Jamaica — Organisers of the JAAA/Puma/Jamalco track meet have offered to assist schools from western Jamaica by waiving entry fees and offer... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n NHF urges asthmatics to take extra care during flu season \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n KINGSTON, Jamaica — As flu season continues, the National Health Fund (NHF) is urging Jamaicans living with asthma to take extra precautions, as influ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n US imposes visa restrictions on Haiti Transitional Presidential Council members \n\n\n\n\n\n\n\nJanuary 26, 2026 \n\n\n WASHINGTON, United States (CMC) — The Donald Trump administration says it is taking steps to impose visa restrictions and revoke the visas of two Hait... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/26/holness-saddened-passing-sly-dunbar/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/01/G_m6HG9XoAEBmRe.jpg","video":null,"publish_date":"2026-01-27 00:56:08","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.689},{"id":396406018,"title":"Trump doesn’t want anyone hurt or killed: White House after fatal ICE shooting in Minnesota","text":"The White House has said President Donald Trump does not want to see violence on US streets, while swiftly blaming Democratic leaders for unrest in Minneapolis following the fatal shooting of a local resident by federal immigration agents.Speaking on Monday, White House Press Secretary Karoline Leavitt said, “Nobody in the White House, including President Trump, wants to see people getting hurt or killed in America’s streets,” describing the killing of Alex Pretti as a “tragedy”.“We mourn for the parents. As a mother myself, of course, I cannot imagine the loss of life,” she added.Pretti, an ICU nurse, was shot dead on Saturday during an encounter with Immigration and Customs Enforcement (ICE) agents. A Trump aide had earlier, without evidence, labelled him a “domestic terrorist”. Federal officials have since declined to release details supporting their claim that the agent acted in self-defence.Leavitt’s conciliatory tone quickly gave way to criticism of Democratic officials in Minnesota, where protests have erupted following a surge in immigration enforcement ordered by Trump. Masked and armed federal agents were deployed in Minneapolis despite opposition from local authorities.“This tragedy occurred as a result of a deliberate and hostile resistance by Democrat leaders in Minnesota,” Leavitt said, singling out Governor Tim Walz and Minneapolis Mayor Jacob Frey. She accused Democrats of “spreading lies about federal law enforcement officers who are risking their lives daily to remove the worst criminal illegal aliens from our streets”.Leavitt also defended the administration’s deportation campaign, insisting it retained broad public support. “Americans overwhelmingly want exactly what President Trump is delivering: strong borders and strict immigration enforcement against the worst illegal aliens,” she said, claiming that polling showed “huge support for this exact thing”.Her remarks came amid mounting scrutiny of ICE operations in Minnesota, where two US citizens have been killed during immigration enforcement activity. Renee Good, a 37-year-old mother of three, was shot on 7 January during protests against what critics describe as militarised federal raids. Pretti was killed on 24 January after being restrained by federal officers and shot at point-blank range.Trump has defended ICE’s actions, suggesting Pretti may have been armed. Reports indicate that Pretti was legally licensed to carry a firearm but had already been disarmed at the time of the shooting. Minnesota Attorney General Keith Ellison dismissed the president’s claims as “flat-out insane”.Despite the escalating tensions, Trump said he had spoken with Governor Walz and described the conversation as constructive. Writing on his Truth Social platform, Trump said Walz had “called me with the request to work together with respect to Minnesota”.“It was a very good call, and we, actually, seemed to be on a similar wavelength,” Trump wrote. He said he would send his top border security official, Tom Homan, to Minnesota, adding that Walz was “happy that Tom Homan was going to Minnesota, and so am I!”Trump also pointed to what he described as successes in other cities. “We have had such tremendous SUCCESS in Washington, D.C., Memphis, Tennessee, and New Orleans, Louisiana, and virtually every other place that we have ‘touched’,” he said, adding that crime in Minnesota was “way down”, though both he and Walz wanted “to make it better”.Legal challenges are now underway over the federal crackdown. A judge has heard arguments on whether to temporarily halt immigration operations in Minnesota, while a separate federal hearing is scheduled after a temporary restraining order barred agencies from destroying or altering evidence related to Pretti’s death.Congressional Democrats have warned they may block federal funding unless reforms are made to immigration enforcement practices, as protests continue and criticism grows over the deployment of heavily armed federal agents in US cities.(With ANI inputs)","url":"https://zeenews.india.com/world/trump-doesn-t-want-anyone-hurt-or-killed-white-house-after-fatal-ice-shooting-in-minnesota-3010698.html","image":"https://english.cdn.zeenews.com/sites/default/files/2026/01/27/1896795-mixcollage-25-jan-2026-06-40-am-4736.jpg?im=Resize=(1200,900)","video":null,"publish_date":"2026-01-27 00:55:39","author":"Zee Media Bureau","authors":["Zee Media Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":-0.479},{"id":396405408,"title":"Trump says Iran called 'numerous' times to make deal as carrier enters Middle East waters","text":"President Donald Trump said Iran appears to be looking to negotiate with the U.S. amid a growing military buildup in the Middle East. In a Monday interview with Axios, Trump suggested that Tehran had reached out on \"numerous occasions\" and \"want[s] to make a deal.\" \"They want to make a deal. I know so. They called on numerous occasions. They want to talk,\" the president told the outlet. According to U.S. officials, also cited by Axios, any potential agreement would need Tehran to remove all enriched uranium, cap its long-range missile stockpile, a change in support for regional proxy forces, and cease independent uranium enrichment, terms Iranian leaders have not agreed to. ISRAELI UN AMBASSADOR SENDS STARK WARNING TO IRAN AMID GROWING UNREST Trump also described the situation with Iran as \"in flux,\" and pointed to the arrival of what he called \"a big armada next to Iran. Bigger than Venezuela,\" referencing the recent deployment of U.S. naval assets. As previously reported by Fox News Digital, the USS Abraham Lincoln aircraft carrier entered CENTCOM waters in the Indian Ocean on Monday amid increasing threats from Iran, a senior U.S. official said. Trump had told reporters Jan. 21, \"We have a big flotilla going in that direction, and we’ll see what happens. We have a big force going towards Iran. I’d rather not see anything happen, but we’re watching them very closely.\" The U.S. military buildup comes amid widespread unrest inside Iran following protests that began Dec. 28. SECRET SERVICE AWARE AFTER IRANIAN STATE TV AIRS TRUMP THREAT FEATURING PHOTO OF BUTLER ASSASSINATION ATTEMPT According to a recent report from Human Rights Activists News Agency (HRANA), the confirmed death toll from the protests has reached 5,848, with an additional 17,091 deaths under investigation. Supreme Leader Ayatollah Ali Khamenei has been sheltering in a fortified underground facility, according to Iran International. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Trump is expected to hold further consultations this week, Axios said, before adding that White House officials said an attack is still on the table. Fox News Digital has reached out to the White House for comment.","summary":"President Donald Trump indicated Iran is seeking negotiations as the USS Abraham Lincoln carrier enters the region and protests continue inside Iran.","url":"https://www.foxnews.com/world/trump-says-iran-called-numerous-times-make-deal-carrier-enters-middle-east-waters","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/trump-leadership-iran-historic-opportunity-change-fox-news-001.jpg","video":null,"publish_date":"2026-01-27 00:55:01","author":"Emma Bussey","authors":["Emma Bussey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.297},{"id":396401672,"title":"Trump says hiking tariffs on South Korean goods to 25%","text":"U.S. President Donald Trump said on Monday (January 26, 2026) that he would raise tariffs on South Korean goods, including autos, lumber and pharmaceuticals, accusing the country of not living up to an earlier trade pact struck with Washington.\n\nThe increase would bring tariff levels from 15% to 25%.\n\n\"South Korea's Legislature is not living up to its Deal with the United States,\" Mr. Trump wrote on his Truth Social platform.\n\nHe added that he was increasing tariff rates \"because the Korean Legislature hasn't enacted our Historic Trade Agreement, which is their prerogative.\"\n\nSouth Korea's Presidential office said it had not been informed about the tariff hike plans in advance.\n\nIt said Trade Minister Kim Jung-kwan, currently in Canada, would head to Washington for talks on the issue with U.S. Commerce Secretary Howard Lutnick.\n\nMr. Trump's apparent about-face comes months after Washington and Seoul struck a trade and security deal, capping a period of tense negotiations.\n\nThe agreement was finalised after Mr. Trump met his South Korean counterpart Lee Jae Myung in October, and included investment promises by South Korea alongside tariff cuts by the United States.\n\nSince then it remained in something of a legal limbo in South Korea.\n\nSeoul's Presidential office insisted in November that the deal does not require parliamentary approval, arguing it represents a memorandum of understanding rather than a binding legal document.\n\nAsked whether the tariff deal had been submitted to parliament for approval, a senior official told AFP on Tuesday (January 27, 2026) they were looking into it but did not elaborate.\n\nUnder the pact, Washington would maintain levies of up to 15 percent on South Korean goods including vehicles, car parts and pharmaceuticals.\n\nCrucially, the deal's terms brought US tariffs on South Korean cars down from a 25% level.\n\nMr. Trump's latest threat, if enacted, would reverse that.\n\nExport pain \n\nThe auto industry accounts for 27% of South Korea's exports to the United States, which takes in nearly half of the country's car exports.\n\nA reversal to a higher tariff level could also put South Korean exports in a less advantageous position compared with economies like Japan and the European Union, which have both struck deals for a 15% U.S. tariff.\n\nThe Trump administration has yet to issue formal notices to enact the changes.\n\nThe U.S. President's threat targeting South Korea is his latest against key trading partners in recent days.\n\nOver the weekend, Mr. Trump warned Canada that if it concludes a trade deal with China, he would impose a 100% tariff on all goods coming across the border.\n\nEarlier in January, Mr. Trump also threatened to slap tariffs on multiple European nations until his purchase of Greenland is achieved. He has since backed off the threat.","url":"https://www.thehindu.com/news/international/trump-says-hiking-tariffs-on-south-korean-goods-to-25/article70554997.ece","image":"https://th-i.thgim.com/public/incoming/q8wsp9/article70555000.ece/alternates/LANDSCAPE_1200/Trump_US_South_Korea_99619.jpg","video":null,"publish_date":"2026-01-27 00:54:49","author":"South Korea","authors":["South Korea"],"language":"en","category":"politics","source_country":"in","sentiment":-0.113},{"id":396402290,"title":"Border Patrol commander Gregory Bovino removed amid backlash over Pretti shooting; Kristi Noem also said to be at risk: Report","text":"Gregory Bovino was removed from his role as the \"commander at large\" for the US Border Patrol and was set to return to his former job in California, where he was expected to retire soon, the Atlantic reported on Monday, citing a Homeland Security official and two people with knowledge of the change. Earlier on Monday, President Donald Trump and Minnesota Governor Tim Walz each struck a conciliatory tone after a private phone call about immigration enforcement, a sign the two sides were seeking a way to end their standoff over a deportation drive that claimed the lives of two US citizens in Minneapolis.Bovino’s sudden demotion was the clearest sign yet that the Trump administration reconsidered its most aggressive tactics after the killing Saturday of 37-year-old Alex Pretti by Border Patrol agents under Bovino’s command. Earlier, President Trump appeared to signal in a series of social-media posts a tactical shift in the administration’s mass-deportation campaign. Trump wrote that he spoke with Minnesota Governor Tim Walz, whom the White House blamed for inciting violence, and the two men were now on “a similar wavelength.” Tom Homan, the former ICE chief whom Trump designated “border czar,” will head to Minnesota to assume command of the federal mobilisation there, Trump said. Homeland Security Secretary Kristi Noem and her close adviser Corey Lewandowski, who were Bovino’s biggest backers at DHS, were also at risk of losing their jobs, as per the Atlantic.","url":"https://timesofindia.indiatimes.com/world/us/border-patrol-commander-gregory-bovino-removed-amid-backlash-over-pretti-shooting-kristi-noem-also-said-to-be-at-risk-report/articleshow/127584810.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-127585097/127585097.jpg","video":null,"publish_date":"2026-01-27 00:54:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.283},{"id":396402558,"title":"Katy Perry, other celebrities call on citizens to speak out after Minnesota killings","text":"Singer Katy Perry and other US celebrities have urged people to contact lawmakers and speak out after federal immigration officers killed two US citizens during an immigration crackdown in Minnesota. Katy Perry asked her followers on Instagram to write to their senators and urge them to oppose funding for Immigration and Customs Enforcement (ICE), which operates under the Department of Homeland Security. View this post on Instagram A post shared by KATY PERRY (@katyperry) The deaths this month of Renee Good, a mother of three, and Alex Pretti, an intensive care nurse, have led to protests against US President Donald Trump’s decision to send more federal agents to Minnesota. Actor Pedro Pascal shared drawings of Good and Pretti on Instagram with the message: “Pretti Good reason for a national strike”. Singer Billie Eilish also posted on Instagram, calling Pretti “a real American hero” and urging others to speak out. “Hey my fellow celebrities u gonna speak up? or,” she wrote, according to Reuters. The National Basketball Players Association, which represents NBA players, said in a statement that players “can no longer remain silent”. “Now more than ever, we must defend the right to freedom of speech and stand in solidarity with the people in Minnesota protesting and risking their lives to demand justice,” the union said, Reuters reported. Trump administration officials have said the killings were acts of self-defence by officers. However, Reuters noted that video footage from the scenes has challenged that account. Reuters said US celebrities have frequently spoken out on social and political issues, including police violence after the killing of George Floyd and Israel’s war in Gaza.","url":"https://indianexpress.com/article/world/katy-perry-other-celebrities-call-on-citizens-to-speak-out-after-minnesota-killings-10496170/","image":"https://images.indianexpress.com/2026/01/US-1-39.jpg","video":null,"publish_date":"2026-01-27 00:53:01","author":"Express Web Desk","authors":["Express Web Desk"],"language":"en","source_country":"in","sentiment":0.194},{"id":396406376,"title":"Rift at influential Silicon Valley venture firm shows tech's divide over ICE shooting","text":"Jan 26 (Reuters) - Heated political rhetoric over ‌the fatal shooting of a U.S. citizen by immigration agents in Minneapolis on Saturday spilled into Silicon Valley as partners ‌at an influential venture firm distanced themselves from a colleague who defended the killing.\n\nThe death of 37-year-old Alex Pretti ‌was one of five shootings this month involving federal agents conducting immigration enforcement, including the fatal shooting of Minnesota woman Renee Good. At least six immigrants have died this month in federal immigration detention, an unusually rapid pace.\n\nThe Pretti shooting has drawn anger across the U.S. political spectrum as the administration of Republican President Donald Trump ‍backed the agents even as video evidence contradicted its version of events.\n\nThe back-and-forth on ‍social media highlights an ongoing political fracture at the ‌heart of the U.S. tech industry where some executives have abandoned the sector's longstanding reputation for progressive social values to publicly back ‍Trump's ​policies.\n\nAfter Khosla Ventures partner Keith Rabois said on social media on Saturday that law enforcement had not shot an innocent person and that illegal immigrants commit crimes daily, the firm's founder, Vinod Khosla, and partner Ethan Choi both disavowed the comments. The ⁠firm is notable for having backed companies including OpenAI, DoorDash and Instacart.\n\n\"ICE (Immigration and Customs ‌Enforcement) personnel must have ice water running thru their veins to treat other human beings this way,\" Khosla said in a post on X. \"There is politics but ⁠humanity should transcend that,\" ‍Khosla added.\n\nSeveral other tech executives including Jeff Dean, chief scientist at Alphabet's Google DeepMind AI lab, and Microsoft Chief Scientific Officer Eric Horvitz praised Pretti, who was an intensive-care nurse at a Veterans Affairs hospital.\n\nFRACTURE IN SILICON VALLEY\n\nBillionaire Elon Musk has led the charge to the politically conservative right, with hundreds ‍of millions of dollars in campaign donations to Trump's 2024 campaign and support ‌for his anti-immigration moves. This has led to public clashes with the likes of LinkedIn co-founder Reid Hoffman, a major Democratic donor.\n\nMusk has not commented on the Pretti shooting, while Hoffman echoed Khosla's message that humanity should transcend politics.\n\nWary of government retaliation, tech executives have spent the past year largely silent on policies impacting their businesses including the chaos surrounding the H-1B visa program and U.S tariffs.\n\nExecutives have instead sought to improve ties with Trump, contributing millions to his inauguration a year ago and backing his manufacturing push with tens of billions in pledged spending, which some analysts have called empty posturing.\n\nUrging tech CEOs to break their silence, more than 450 employees from firms such as Google, ‌Meta Platforms, Salesforce and OpenAI signed a letter on Saturday urging their top executives to pressure the White House to withdraw ICE from U.S. cities, cancel all contracts with ICE and to speak out publicly against ICE's violence.\n\n\"The wanton brutality ... has removed any credibility that these actions are about immigration enforcement. Their goal is ​terror, cruelty, and suppression of dissent,\" they said in the letter.\n\nThe workers noted that Trump had said he refrained from deploying federal agents to San Francisco after Nvidia CEO Jensen Huang and Salesforce CEO Marc Benioff advised against the action.\n\n(Reporting by Aditya Soni in Bengaluru; Editing by Sayantani Ghosh and Matthew Lewis)","url":"https://www.thestar.com.my/tech/tech-news/2026/01/27/rift-at-influential-silicon-valley-venture-firm-shows-tech039s-divide-over-ice-shooting","image":"https://apicms.thestar.com.my/uploads/images/2026/01/27/3740124.jpg","video":null,"publish_date":"2026-01-27 00:53:00","author":"Aditya Soni","authors":["Aditya Soni"],"language":"en","source_country":"my","sentiment":-0.387},{"id":396405716,"title":"Trump raising tariffs on South Korean imports","text":"President Donald Trump says he's increasing tariffs on South Korean imports into the US related to autos, ​lumber and pharmaceuticals to 25 per cent, while accusing the ally's legislature of \"not living up\" to its trade deal with Washington.","url":"https://www.canberratimes.com.au/story/9161738/trump-raising-tariffs-on-south-korean-imports/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/a3f7c4ae-8287-4990-bcd4-edfbaeda3300.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2026-01-27 00:52:59","author":"Kanishka Singh And Andrea Shalal And Joyce Lee","authors":["Kanishka Singh And Andrea Shalal And Joyce Lee"],"language":"en","category":"politics","source_country":"au","sentiment":-0.774},{"id":396401428,"title":"Trump raising tariffs on South Korean imports","text":"President Donald Trump says he's increasing tariffs on South Korean imports into the US related to autos, ​lumber and pharmaceuticals to 25 per cent, while accusing the ally's legislature of \"not living up\" to its trade deal with Washington. \"South Korea's Legislature is ⁠not living up to its Deal with the United States,\" Trump wrote on social media. \"Because the Korean Legislature hasn't enacted our Historic Trade Agreement, which is their prerogative, I am hereby increasing South Korean TARIFFS on Autos, Lumber, Pharma, and all other Reciprocal TARIFFS, from 15% to 25%.\" It was not clear when the tariff hike would take effect. South Korea's presidential office and the US Trade Representative's office did ‌not respond immediately ​to requests for comment. Trump has previously threatened other tariff hikes and in some cases delayed them or not ‍followed through. South Korea had been working to implement a deal announced with Washington last year that lowered US tariffs against many of its exports to 15 per cent. But earlier this month, South Korea's finance minister said the country's planned investment of $US350 billion ($A506 billion) in strategic US sectors under the trade deal was unlikely to kick off in the first half of 2026, citing the weak won currency. The prospect of large currency ​outflows has caused headaches for authorities in Seoul at a time when ‌the won has slumped to trade at levels unseen since the global financial crisis from 2007 to 2009. Trump has used the leverage of tariffs throughout his second term in ​office in his foreign policy. Economists have raised concerns about the approach and the policy also faces a test in an ‍ongoing case at the US Supreme Court. In the deal reached between the allies last year, Washington and Seoul agreed to set tariffs on US imports of Korean autos and auto parts at 15 per cent, down from 25 per cent, putting them on par ​with ​their Japanese competitors. The two countries said last year ​that as part of the $US350 billion ($A506 billion) South Korean investment into US ​strategic sectors, Seoul would pay $US200 billion ($A289 billion) in cash in phased installments that would be capped at $US20 billion ($A29 billion) a year in an effort to maintain won stability. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9161738/trump-raising-tariffs-on-south-korean-imports/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/a3f7c4ae-8287-4990-bcd4-edfbaeda3300.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2026-01-27 00:52:59","author":"Kanishka Singh And Andrea Shalal And Joyce Lee","authors":["Kanishka Singh And Andrea Shalal And Joyce Lee"],"language":"en","category":"politics","source_country":"au","sentiment":-0.478},{"id":396400596,"title":"Trump admin's 'smearing' of slain nurse more than 'simply a rhetorical tactic': experts","text":"The \"smearing\" of slain ICU nurse Alex Pretti by President Donald Trump's administration is \"not simply a rhetorical tactic,\" but is instead part of a larger scheme, according to two legal experts. \n\nRyan Goodman, a law professor at NYU and editor-in-chief of Just Security, and Tom Joscelyn, a senior fellow at Just Security, argued in a new article on Monday that the administration's efforts to smear Pretti as a \"domestic terrorist\" were foretold in a national security document quietly released last year. The document seemed to suggest the administration would try to quell dissent by labeling oppositional voices as \"domestic terrorists,\" a strategy they seem to be testing in Minneapolis, according to the article. \n\nFollowing Pretti's death, White House Deputy Chief of Staff Stephen Miller and Customs and Border Patrol commander Greg Bovino described him as a \"domestic terrorist.\" \n\n\"Senior officials’ dishonest portrayal of Pretti as a domestic terrorist is not a slip of the tongue or impulsive idea,\" Goodman and Joscelyn wrote. \"Instead, it appears to be part of the administration’s campaign to demonize opposition to its anti-immigrant policies as 'domestic terrorism,' and to weaponize powers of the federal government against such perceived political opponents. That plan is set forth in a National Security Presidential Memorandum (NSPM-7) and other official memoranda.\"\n\n\"NSPM-7’s authors claim that the ideas they are targeting threaten 'constitutional rights' and 'fundamental American liberties,'\" they added. \"That is an upside-down reality. The truth is NSPM-7 threatens core constitutional rights. The smearing of Alex Pretti and Renee Good is not simply a rhetorical tactic. It is part of a larger operation.\"\n\nRead the entire article by clicking here.","summary":"The \"smearing\" of slain ICU nurse Alex Pretti by President Donald Trump's administration is \"not simply a rhetorical tactic,\" but is instead part of a larger scheme, according to two legal experts. \n\nRyan Goodman, a law professor at NYU and editor-in-chief of Just Security, and Tom Joscelyn, a senior fellow at Just Security, argued in a new article on Monday that the administration's efforts to smear Pretti as a \"domestic terrorist\" were foretold in a national security document quietly released last year. The document seemed to suggest the administration would try to quell dissent by labeling oppositional voices as \"domestic terrorists,\" a strategy they seem to be testing in Minneapolis, according to the article. \n\nFollowing Pretti's death, White House Deputy Chief of Staff Stephen Miller and Customs and Border Patrol commander Greg Bovino described him as a \"domestic terrorist.\" \n\n\"Senior officials’ dishonest portrayal of Pretti as a domestic terrorist is not a slip of the tongue or impulsive idea,\" Goodman ","url":"https://www.rawstory.com/trump-2675035955/","image":"https://www.rawstory.com/media-library/homeland-security-secretary-kristi-noem-speaks-during-a-press-conference-to-discuss-ongoing-u-s-immigration-and-customs-enforce.jpg?id=63269337&width=1200&height=1200&coordinates=832%2C0%2C833%2C0","video":null,"publish_date":"2026-01-27 00:49:11","author":"Robert Davis","authors":["Robert Davis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.27},{"id":396406110,"title":"Ex-FIFA president joins calls for World Cup fan boycott","text":"Former FIFA president Sepp Blatter has backed a proposed fan boycott of World Cup matches in the United States because of the conduct of President Donald Trump and his administration at home and abroad.\n\nBlatter was the latest international soccer figure to call into question the suitability of the US as a host country.\n\nOn Monday (Tuesday AEDT) Blatter called for the boycott in a post on X that supported Mark Pieth's comments in an interview last week with Swiss newspaper Der Bund.\n\nPieth, a Swiss attorney specialising in white-collar crime and an anti-corruption expert, chaired the Independent Governance Committee's oversight of FIFA reform a decade ago.\n\nBlatter was president of the world's governing body for soccer from 1998-2015, before resigning amid an investigation into corruption.\n\nIn his interview with Der Bund, Pieth said: \"If we consider everything we've discussed, there's only one piece of advice for fans: Stay away from the USA! You'll see it better on TV anyway. And upon arrival, fans should expect that if they don't please the officials, they'll be put straight on the next flight home. If they're lucky.\"\n\nIn his X post, Blatter quoted Pietha and added: \"I think Mark Pieth is right to question this World Cup.\"\n\nThe US is co-hosting the World Cup with Canada and Mexico from June 11-July 19.\n\nThe international soccer community's concerns about the US stem from Trump's expansionist posture on Greenland, travel bans and aggressive tactics in dealing with migrants and immigration enforcement protesters in American cities, particularly Minneapolis.\n\nOke Gottlich, a vice-president of the German soccer federation, told the Hamburger Morgenpost newspaper last week that the time had come to seriously consider boycotting the World Cup.\n\nTwo weeks ago, travel plans for fans from two of the top soccer countries in Africa were thrown into disarray when the Trump administration announced a ban that would effectively bar people from Senegal and Ivory Coast from following their teams unless they already have visas.\n\nTrump cited \"screening and vetting deficiencies\" as the main reason for the suspensions.\n\nFans from Iran and Haiti, two other countries that have qualified for the World Cup, will also be barred from entering the US. They were included in the first iteration of the travel ban announced by the Trump administration.","url":"https://thewest.com.au/sport/soccer/ex-fifa-president-joins-calls-for-world-cup-fan-boycott-c-21436168","image":"https://images.thewest.com.au/publication/C-21436168/9aa26ec10d1e1b7270253d1771149cd3d52f1438-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2026-01-27 00:48:40","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.182}]}