{"offset":0,"number":50,"available":20098,"news":[{"id":381366772,"title":"Bidders for Warner Bros Discovery face barrage of political and regulatory risks","text":"By Dawn Chmielewski and Chris SandersNov 21 (Reuters) - Paramount Skydance, Comcast and Netflix are bidding to buy Warner Bros Discovery, Reuters reported on Thursday, but each company's bid faces its own political and regulatory risks. Factors to watch include market share imbalances each bidder could bring, investors and public comments by U.S. President Donald Trump or his administration about each company.The White House could not immediately be reached for comment.Political RiskParamount Skydance: Paramount may have the inside track because of its White House connections and the significant cash the world's second-richest person, Larry Ellison, can provide Warner Bros Discovery to close the deal. His son, Paramount CEO David Ellison, enjoys Trump's favor, which could help smooth regulatory hurdles. Democratic Senators Elizabeth Warren, Bernie Sanders and Richard Blumenthal worry approval of the deal could be tainted by political favoritism, citing Paramount Global's $16 million donation to Trump's Presidential Library. The payment, made prior to a merger with Skydance that placed Ellison at the media company's helm, settled a lawsuit Trump brought over edits to a \"60 Minutes\" interview.Still, if the bid includes foreign investors, the size of their potential stake could trigger a review by the Committee on Foreign Investment in the United States. The merging of Paramount's and Warner Bros' cable television networks could raise concerns about market concentration for the DOJ.Outside the U.S., regulators would also weigh in under foreign direct investment regimes, while European authorities would examine media plurality rules given the combination of CNN and CBS.Comcast: The Philadelphia-based cable giant faces a different political climate. Trump has repeatedly denigrated the company over its unit NBC's coverage of his second term in office, calling it \"Concast,\" and criticized its Chairman Brian Roberts.That hostility could complicate the DOJ's posture, though any opposition would need to be grounded in law and competition concerns rather than White House preference.The DOJ sought to block AT&T's $85.4 billion acquisition of Time Warner, whose CNN attracted Trump's ire during his first term in the White House. A federal judge ultimately cleared a path for the deal in 2018.Netflix:The streaming leader has its own potential political struggles. In October 2025, the Pentagon criticized \"Boots,\" a series about a gay Marine, according to the Hollywood Reporter. \"We will not compromise our standards to satisfy an ideological agenda, unlike Netflix whose leadership consistently produces and feeds woke garbage to their audience and children,\" a Defense Department representative said. Even before the bids were in, Republican Senator Roger Marshall and Representative Darrell Issa warned that allowing Netflix to take over the company would hand it the content rights of HBO Max and Warner Bros, which they said could raise prices and decrease choice for consumers.Market dominance, however, is in the eye of the beholder. YouTube accounts for more television viewing in the U.S. than its closest rival, Netflix, according to Nielsen.Competition and Antitrust Risk Given past practice, the Justice Department would likely have antitrust oversight of any deal. Warner Bros Discovery does not hold broadcast TV assets and as a result, Federal Communications Commission Chair Brendan Carr would likely not have jurisdiction.Paramount Skydance: A merger with Warner Bros Discovery would unite two major Hollywood studios, two streaming platforms (HBO Max and Paramount ) and two news operations (CNN and CBS). Exhibitors are likely to worry about the number of films reaching theaters, with Comscore estimating the combined entity would control 32% of the U.S. and Canadian box office, based on 2025 revenue.The creative community may also face reduced employment options if there are fewer movies or if, for example, CBS News and CNN were combined. Sports rights concentration — CBS and TNT under one roof — could potentially raise prices for consumers.Comcast:Combining Universal Pictures with Warner Bros Studios would create an even larger theatrical powerhouse, accounting for more than 43% of the North American box office, according to Comscore. That level of market share could alarm regulators and exhibitors, raising questions about diminished opportunities for filmmakers and talent.The DOJ would need to assess whether such consolidation harms competition in theatrical distribution. During Trump's first term, the DOJ approved a similarly sized deal - Walt Disney's acquisition of 21st Century Fox, which brought together two film studios that at the time represented a combined 38% of the domestic box office, according to Comscore.Netflix:The streaming leader's bid would not affect theatrical releases but would reshape the subscription video market. (Netflix will continue to distribute movies into theaters, a source familiar with the matter said, confirming a Bloomberg report). Adding HBO Max's 128 million subscribers to Netflix’s more than 300 million would create a formidable player.Regulators may ask whether such scale limits consumer choice, though the market definition is contested: YouTube, TikTok and other platforms command significant viewing time. The DOJ would need to decide whether Netflix's dominance constitutes a threat to competition or simply reflects evolving consumer habits.(Reporting by Dawn Chmielewski in Los Angeles and Chris Sanders in Washington; Editing by Richard Chang)","url":"https://www.livemint.com/companies/news/bidders-for-warner-bros-discovery-face-barrage-of-political-and-regulatory-risks-11763752713322.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/company_3_1733465099406_1733465108677.png","video":null,"publish_date":"2025-11-22 19:18:32","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":0.054},{"id":381346844,"title":"G20 envoys agree draft declaration despite US boycott, sources say","text":"By Tim Cocks, Alexander Winning and Julia PayneJOHANNESBURG -G20 envoys have agreed on a draft leaders' declaration ahead of this weekend's summit in Johannesburg without U.S. input, four sources familiar with the matter said on Friday.The administration of U.S. President Donald Trump has indicated that it will boycott the November 22-23 summit over disagreements with the host nation, South Africa.Trump had said he would not attend the first G20 summit in Africa because of allegations - which have been widely debunked - that the host country's Black majority government persecutes its white minority.He has also rejected the host nation's agenda of promoting solidarity and helping developing nations adapt to worsening weather disasters, transition to clean energy and cut their excessive debt costs.In defiance of Washington, G20 countries have included references to \"climate change\" in the draft declaration, a source familiar with the matter said, without sharing further details. The United States had earlier objected to mentions of climate change.WHITE HOUSE CALLS DRAFT DECLARATION 'SHAMEFUL'\"It is a longstanding G20 tradition to issue only consensus deliverables, and it is shameful that the South African government is now trying to depart from this standard practice despite our repeated objections,\" a senior Trump administration official said.While fearing that a loss of participation from its most powerful member would scupper a declaration at the G20, some analysts still saw an opportunity for the South African hosts, determined to set an agenda for global leaders in the face of Trump's hostility to multilateral diplomacy.The sources declined to detail the declaration's contents, and it was not clear what concessions had to be made on the language to get everyone to agree.Three out of four of South Africa's planned top agenda items - preparing for climate-induced weather disasters, financing the transition to green energy, and ensuring the rush for critical minerals benefits producers - were largely about climate change.President Cyril Ramaphosa said on Thursday that South Africa was in discussions with the United States - which will host the G20 in 2026 - over its possible participation in the summit after all, although the White House later denied this.Ramaphosa had earlier said he was resigned to handing over to an \"empty chair\". The White House on Thursday said it would send the U.S. charge d'affaires for the G20 handover, an offer which South Africa's presidency rejected.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/news/world/g20-envoys-agree-draft-declaration-despite-us-boycott-sources-say-11763751899439.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/news_3_1733464427658_1733464446564.jpg","video":null,"publish_date":"2025-11-22 19:04:59","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":0.274},{"id":381346840,"title":"Oil prices drop 2% to one-month low as US seeks Russia-Ukraine peace deal","text":"By Scott DiSavinoNEW YORK -Oil prices fell about 2% on Friday to a one-month low as the U.S. pushed for a Russia-Ukraine peace deal that could boost global oil supplies, while uncertainty over U.S. interest rates curbed investors' risk appetite.Brent futures fell $1.05, or 1.7%, to $62.33 per barrel at 1:36 p.m. EST , while U.S. West Texas Intermediate crude slipped $1.17, or 2.0%, to $57.83.That put both crude benchmarks down over 3% for the week and on track for their lowest closes since October 21.Market sentiment turned bearish as Washington pushed for a peace plan between Ukraine and Russia to end the three-year war, while sanctions on Russian oil producers Rosneft and Lukoil are set to take effect on Friday.Ukrainian President Volodymyr Zelenskiy said on Friday that Ukraine faced losing its dignity and freedom or Washington's support over the U.S. peace plan, which endorses key Russian demands and which U.S. President Donald Trump said Kyiv should agree to by Thursday.Russian President Vladimir Putin said on Friday that Moscow had received the U.S. proposals for peace in Ukraine and that the plan could be the basis of a peaceful resolution of the conflict.A peace deal could allow Russia to export more fuel. Russia was the second-biggest producer of crude oil in the world after the U.S. in 2024, according to U.S. federal energy data.\"With the news of talks coming just as U.S. sanctions on Russia's two largest oil companies are due to take effect today, oil markets saw some relief on risks to Russian oil supply,\" said Jim Reid, a managing director at Deutsche Bank.However, a peace deal could be some way off.\"An accord is far from certain,\" ANZ analysts said in a note to clients, adding that Kyiv has repeatedly dismissed Russia's demands as unacceptable.\"The market is also becoming sceptical that the latest restrictions on Russian oil companies Rosneft and Lukoil will be effective,\" the analysts said.Lukoil has until December 13 to sell its huge international portfolio.Another factor weighing on oil prices was a stronger U.S. dollar. The greenback hit a six-month high on Friday versus a basket of other currencies.A stronger U.S. dollar can make dollar-priced oil more expensive for buyers using other currencies.On U.S. interest rates, Dallas Fed President Lorie Logan on Friday called for leaving the policy rate on hold \"for a time\" while the central bank assesses how much of a brake the current level of borrowing costs is putting on the economy.Boston Fed President Susan Collins said on Friday that monetary policy is in the right place amid a resilient economy, in comments that suggest she remains sceptical of the need to cut rates again at next month’s monetary policy meeting.New York Fed President John Williams, meanwhile, said the central bank can still cut interest rates \"in the near term\" without putting its inflation goal at risk.Lower interest rates could boost economic growth and oil demand by lowering borrowing costs for consumers and businesses.In other economic news, U.S. factory activity slowed to a four-month low in November as higher prices because of tariffs on imports restrained demand, leading to a piling up of unsold goods that could hinder growth in the overall economy.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/market/commodities/oil-prices-drop-2-to-one-month-low-as-us-seeks-russia-ukraine-peace-deal-11763751346554.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/market_4_1733466069237_1733466076549.png","video":null,"publish_date":"2025-11-22 18:55:46","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.276},{"id":381346832,"title":"Wells Fargo Whistleblower on Sham Interviews Wins Right to Sue","text":"(Bloomberg) -- A whistleblower who accused Wells Fargo & Co. of conducting sham interviews with minority job candidates will now be able to sue the bank over his firing.Wells Fargo lost a bid to place the former employee’s wrongful-termination complaint into secret arbitration proceedings. That means Joe Bruno will have the chance to take to open court his claims that his firing was retaliatory, and potentially present new details about the interviews.Bruno was the first person to publicly claim in 2022 that Wells Fargo had been interviewing minority candidates for positions that had already been filled so executives could say they were making concrete efforts to diversify the bank’s workforce. His revelations led the US Department of Justice to open a criminal investigation into whether the bank had violated civil-rights laws. Wells Fargo shareholders sued over the resulting drop in the bank’s stock price and won class-action status before reaching an $85 million settlement last month.Wells Fargo has said that the fake interviews weren’t widespread, if they happened at all. In a February 2024 filing with regulators, it said the Justice Department had closed its investigation. Bruno, the bank claimed in a disclosure that’s visible to other banks considering hiring him, was fired for “workplace conduct inconsistent with company standards.” Bank officials claimed he had mistreated another employee.“Mr. Bruno’s allegations are baseless,” Dana Ripley, a Wells Fargo spokesman, said in an emailed statement. “Any claims he makes must be considered in the context that he was fired after an investigation confirmed he retaliated against another employee who had complained internally about him, and that he then launched a campaign of sending highly offensive and threatening messages to other employees.”Wells Fargo “will vigorously defend ourselves against this lawsuit’s claims,” Ripley said.The dispute with Bruno is one of the last outstanding matters tied to the alleged fake interviews. Wells Fargo’s lawyers claimed that Bruno had no right to sue, saying that in order to collect a bonus payment more quickly in 2016, he had signed an agreement stating that any disputes he had with the bank would have to be worked out in closed-door arbitration with the Financial Industry Regulatory Authority, the industry group that polices financial advisers.Bruno and his lawyer, Linda Friedman, argued that the agreement applied only to disputes that related to the bonus payment itself, and that it had expired in 2019.“Under the Federal Arbitration Act, the dispute has to arise out of the underlying contract,” Friedman said. “It’s like if you went and bought a television set, it had an arbitration agreement, and then you happened to be working for the company, it’s just unrelated thing.”On Thursday, a Finra arbitration panel issued a decision in Bruno’s favor, saying “there is no valid and enforceable agreement to arbitrate.”“While we disagree with the Finra decision and view it as inconsistent with Finra practice, it is important to note that the Finra arbitration panel did not make any decisions on the substance of Mr. Bruno’s claims related to his termination,” Wells Fargo’s Ripley said.Bruno said in an interview Thursday that “the allegations of my termination are 100% false, and I’ve been arguing that from the beginning,” He added that the case also offers a chance to hold the bank accountable for engaging in “performative” diversity, equity and inclusion efforts.The interview practices at issue were tied to a pledge the bank made nearly a decade ago to consider minority candidates for open job positions in the wake of a racial-discrimination lawsuit brought by Black wealth-management employees.A New York Times report about the practices included information provided by 12 current and former employees who had participated in fake interviews, helped arrange them or been aware of them. After the initial story, an additional 10 current and former staffers shared evidence showing how the practice worked. In one email, a human resources employee asked someone considered “diverse” by the bank’s standards who had just been hired for one role to fill out an application for another role. “Simply book keeping for us,” the HR representative wrote, according to The Times.The climate around corporate diversity, equity and inclusion has changed since Bruno first raised the issue at Wells Fargo, with President Donald Trump criticizing DEI as being little more than discrimination against White men. Friedman said the effort at Wells Fargo was intended to broaden the talent pool from which the bank could draw to fill open roles.Bruno said he’ll rely on Friedman’s advice over whether to take the case to trial or consider a settlement should the bank offer one. “I want to see change,” he said. “And if that means rejecting any settlement and going to a jury trial, then I’m OK with that.”More stories like this are available on bloomberg.com©2025 Bloomberg L.P.","url":"https://www.livemint.com/companies/news/wells-fargo-whistleblower-on-sham-interviews-wins-right-to-sue-11763751344019.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/company_1_1733464951182_1733464958176.png","video":null,"publish_date":"2025-11-22 18:55:43","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.509},{"id":381414278,"title":"Zelensky Rejects Trump-Led Peace Plan as Putin Welcomes Proposal","text":"KYIV, Ukraine: President Volodymyr Zelensky on Friday pushed back against a US plan to end the war in Ukraine, while Russian leader Vladimir Putin welcomed the proposal that includes many of his hardline demands. With President Donald Trump giving Ukraine less than a week to sign, Zelensky pledged to work to ensure any deal would not \"betray\" Ukraine's interests, while acknowledging he risked losing Washington as an ally. Putin said the blueprint could \"lay the foundation\" for a final peace settlement, but threatened more land seizures if Ukraine walked away from negotiations. Ukraine faces one of the most challenging moments in its history, Zelensky said in an address to the nation, adding that he would propose alternatives to Trump's 28-point plan. Kyiv and its European allies were startled by the proposal -- which would force Ukraine to give up land, cut its army and pledge never to join NATO. Russia, meanwhile, would gain territory, be reintegrated into the global economy and rejoin the G8, under a draft of the plan, seen by AFP. - 'He'll have to like it' - \"Ukraine and its European allies are still living under illusions and dreaming of inflicting a strategic defeat on Russia on the battlefield,\" Putin said in a televised meeting with his security council. If Kyiv walks away, Russia's claimed recent capture of Ukrainian city Kupiansk \"will inevitably be repeated in other key areas of the front line,\" Putin added. The Ukrainian army says Kupiansk remains under Kyiv's control. Zelensky on Friday recalled how he marshalled Kyiv's response to the Russian invasion in February 2022, saying \"we did not betray Ukraine then, we will not do so now.\" \"I will present arguments, I will persuade, I will propose alternatives,\" he added. Trump said at the White House that next Thursday was an \"appropriate time\" to set for Zelensky to agree a deal, but he indicated it could be flexible. \"He'll have to like it, and if he doesn't like it, then you know, they should just keep fighting,\" Trump told reporters at the White House. \"At some point he's going to have to accept something.\" Zelensky said after talks with US Vice President JD Vance that Ukraine continues to \"respect\" Trump's desire to end the war. He also held an emergency call with the German, French and British leaders as Europe, cut out of the process, scrambled to respond. - Army cuts - The Ukrainian leader plans to speak directly to Trump soon, his office has said. The US plan envisages recognizing territories controlled by Moscow as \"de-facto\" Russian, with Kyiv pulling troops out of parts of the Donetsk region. Kyiv would also cap its army at 600,000, rule out joining NATO and have no NATO troops deployed to its territory. In return, Ukraine would get unspecified \"reliable security guarantees\" and a fund for reconstruction using some Russia assets frozen in foreign accounts. \"Right now is one of the most difficult moments in our history,\" Zelensky said in his address. \"The pressure on Ukraine is one of the hardest. Ukraine may face a very difficult choice: either the loss of dignity or the risk of losing a key partner,\" he said, warning of a break with Washington. In a call with Zelensky, key allies Britain, France and Germany stressed their \"unwavering and full support for Ukraine on the path to a lasting and just peace,\" said a joint statement after the talks. The United States bypassed Europe with the plan, and many European governments were unsettled by the prospect of the war ending on Moscow's terms. - 'Flexibility' - Putin, who treated Trump's proposal more favourably, said an early version of the plan was discussed with the US president even before they met in Alaska on August 15. There, Putin told Trump that Russia was ready \"to show flexibility\" in resolving the conflict, without elaborating how, according to the Kremlin chief's televised meeting. Putin added that Russia is ready for detailed discussion of Trump's plan. Otherwise, it will continue the war. Trump's administration has previously rejected accusations that it worked on the proposal with Moscow. The White House gave Zelensky until November 27, when the United States celebrates Thanksgiving, to decide on what it called a \"good plan\" for Russia and Ukraine. In Kyiv, people were divided over whether Ukraine should engage with the proposal and negotiate a better position, or reject it as a capitulation. Yanina, a 41-year-old seamstress, predicted the proposal will lead nowhere and the war will continue. \"Neither us nor Russia will make concessions,\" she said.","summary":"Putin said the blueprint could \"lay the foundation\" for a final peace settlement, but threatened more land seizures if Ukraine walked away from negotiations","url":"https://www.deccanchronicle.com/world/europe/zelensky-rejects-trump-led-peace-plan-as-putin-welcomes-proposal-1918750","image":"https://www.deccanchronicle.com/h-upload/2025/11/22/1981275-aa-5964981-1.webp","video":null,"publish_date":"2025-11-22 01:13:57","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.232},{"id":381414450,"title":"US pushes for Hamas-free zones in Gaza, report says","text":"The United States is quietly advancing a plan to divide the Gaza Strip into zones of control and begin constructing temporary housing for Palestinians in areas held by the IDF, the Wall Street Journal reported on Friday. The reported initiative marks a shift in expectations around the dismantling of Hamas, which is formally listed as a second-phase objective under U.S. President Donald Trump’s proposed 20-point peace plan but is not anticipated to happen soon. According to the report, the U.S. plan would mark areas under Hamas control in red, while IDF-controlled zones would be marked green. Within these green zones—designated as areas beyond a “yellow line” demarcating Hamas influence—Washington is reportedly promoting the construction of so-called “alternative safe communities” for displaced Palestinians. American officials told the Journal that engineering teams have already been dispatched to Gaza to begin planning the removal of rubble and unexploded ordnance in preparation for these new sites. While construction has not yet begun, the planned communities would provide temporary housing, education and healthcare facilities, including schools and hospitals, until more permanent rebuilding can take place. The first such site is slated for Rafah, a southern Gazan city largely controlled by the IDF in recent months. Despite ongoing fighting with Hamas terrorists still entrenched in underground tunnel networks there, Israeli forces maintain operational control above ground. Some Hamas operatives reportedly surfaced from the tunnels on Friday several were killed and others captured, according to military sources. IDF Chief of Staff Lt. Gen. Eyal Zamir said Friday that all remaining terrorists in Rafah would either be eliminated or forced to surrender. Sources in both Israel and the U.S. confirmed to the Journal that the Rafah site is being considered as the pilot location for the first temporary settlement. The initiative comes amid international debate about the feasibility of rebuilding Gaza while Hamas remains in power. The Journal noted that no potential donor country has expressed willingness to fund reconstruction in Hamas-held areas. Arab states, according to the report, have also raised objections to the division of Gaza into de facto zones of control and the establishment of Israeli-overseen housing. Egypt in particular is reportedly concerned about a potential spillover from Rafah into the Sinai Peninsula and has warned against any move that might encourage displacement across the border. The U.S.-backed plan remains in its early stages, and its implementation will likely depend on continued military developments and political coordination between Israel, the U.S. and regional actors. Who will do the screening? A major question mark looms over the issue of security in the planned temporary communities in Gaza. It remains unclear how the U.S.-supported initiative would ensure that only innocent civilians, rather than Hamas terrorists, enter these zones. One idea, according to the report, is to involve local militias in Gaza that have been armed by Israel. These militias enjoy Israeli support, and according to both Israeli and Arab sources, this was one of the proposals under discussion. Some of these groups—such as the one led by Yasser Abu Shabab—already operate de facto communities in areas under their control. Abu Shabab, for instance, reportedly runs a school and shops selling basic goods. “We are open to cooperating with all parties that seek peace and stability in Gaza,” he told the Journal. However, a U.S. official cited in the report said Washington is not currently considering using these militias, noting that some of their members are viewed as criminals and are unlikely to be effective against Hamas if confrontation arises. Instead, U.S. sources expressed hope that Hamas-controlled zones will “shrink” over time and eventually disappear. In such a scenario, an international stabilization force (ISF), backed by a UN Security Council mandate, would take over security responsibilities in Gaza, working alongside a Palestinian police force. During the interim period, the Trump administration’s proposed Board of Peace would oversee civil governance and reconstruction in the enclave, with long-term control eventually handed to a Palestinian governing body. The arms dilemma Hamas, for its part, continues to reject the entire proposal, denouncing it as “international trusteeship” over Gaza that severs it from the Palestinian people. The group rejected this week’s UN Security Council resolution endorsing the plan, calling it “an attempt to impose a new order serving foreign interests, and harming the rights of the Palestinian people to resist the occupation and to manage the fate of Gaza themselves.” Palestinian Islamic Jihad also condemned the resolution, saying it “eliminates the prospect of resistance and turns humanitarian aid into a political lever, while infringing on basic rights enshrined in international law.” The resolution passed by the Security Council includes a provision empowering the international stabilization force to disarm Hamas. That is also Israel’s expectation. But Hamas has declared it will not hand over its weapons to any foreign entity—posing a serious challenge for any state wary of direct confrontation with the group. Israeli officials acknowledge that no Arab or Muslim soldier is likely to open fire on Hamas and that, at best, such forces may be limited to performing police duties. Earlier this week, ynet reported that Hamas had approached the Palestinian Authority seeking help on the weapons issue. According to sources in Gaza, Hamas proposed transferring its weapons to the PA—not for disarmament, but for storage under PA custody. “They asked the Palestinian Authority to open a dialogue and consider storing the weapons. They don’t intend to hand them over or destroy them,” the sources said. PA officials believe the chances of such a scenario are slim. Some have suggested that Hamas may be trying to mislead the PA or draw it into a scheme that would ultimately serve the interests of the terrorist group.","summary":"Washington reportedly advancing a plan to divide Gaza into Hamas- and IDF-controlled zones and build temporary communities for displaced Palestinians in the south, starting with Rafah, raising regional concern","url":"https://www.ynetnews.com/article/syjnotcgwe","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/11/21/Bky4UQAl11l/Bky4UQAl11l_0_0_738_1280_0_large.jpg","video":null,"publish_date":"2025-11-22 01:08:50","author":"Ynet","authors":["Ynet"],"language":"en","category":"politics","source_country":"il","sentiment":0.022},{"id":381414436,"title":"Comment on Trump signs bill requiring Epstein files release by Balaer","text":"The Republican president, a former friend of the late sex offender, announced on social media late Wednesday that he had signed the bill, forgoing any media spectacle of the event.\n\nInsiders warn that even with the president’s signature, his administration could lean on redactions, procedural delays or lingering federal investigations to keep explosive details out of the public eye.\n\n“Once the president signs the bill, he must apply and execute it faithfully. There must be no funny business from Donald Trump,” top Democrat Chuck Schumer warned in a speech on the Senate floor.\n\n“He must not use the excuse of frivolous investigations to release some Epstein documents, while intentionally hiding others that deserve to be seen by the American public.”\n\nEpstein, a wealthy financier, moved in elite circles for years, cultivating close ties with business tycoons, politicians, academics and celebrities to whom he was accused of trafficking girls and young women for sex.\n\nTrump and his allies spent years pushing theories about powerful Democrats being protected over involvement with Epstein, framing the case as a potent symbol of how powerful men can hide behind lawyers, money and connections.\n\nBut Trump himself was a longtime associate of Epstein, raising questions over what he knew about the notorious figure.\n\nFar beyond Trump’s conspiracy-minded voter base, the saga dented public trust in the US justice system and raised suspicion among voters who believe important pieces of the story were either hidden or ignored.\n\nEpstein’s 2019 arrest fueled a storm of outrage and pressure for a full accounting of his network, his finances and the people who helped him evade.\n\nConspiracy theories about a cover-up only deepened after his death — ruled a suicide — in a New York jail soon after.\n\n– ‘Smoke screen’? –\n\nPassage of the Epstein Files Transparency Act in Congress marked a moment of deep emotional resonance, with abuse survivors filling the House gallery as the vote was called, hugging and cheering when it passed.\n\nIt was a sharp rebuke of Trump and his ally, House Speaker Mike Johnson, who had led efforts to prevent disclosure.\n\nJohnson had said he would “cross that bridge” when asked if he’d push Trump to veto the bill.\n\nThe president had warned House Republicans off the action but reversed course, fearing humiliation as he faced the largest rebellion of his presidency.\n\nUnder the law, the Justice Department has a month to dump its unclassified files online — in a searchable trove of transcripts, flight logs and communications that could unearth unseen names and connections.\n\nThe text makes only narrow exceptions for personal data and genuine legal and security concerns.\n\nBut analysts question whether officials will comply, or argue that sensitive material cannot be released because related probes remain active — including a new investigation ordered by Trump last week into Epstein’s ties with Democrats.\n\n“(This) might be a big smoke screen, these investigations, to open a bunch of them as a last-ditch effort to prevent the release of the Epstein files,” Thomas Massie, the Kentucky Republican who pushed the House vote, told ABC News.\n\nThe Justice Department and FBI said in July they had uncovered no evidence in a review of the files that would support further action, and it was not clear if the new probe ordered by Trump on Friday would hamper disclosure.\n\nAttorney General Pam Bondi was pressed on the justification for further investigation and said there was “new information, additional information.”\n\n“If there are any victims, we encourage all victims to come forward,” she told reporters. “And we will continue to provide maximum transparency under the law.”\n\nft/bgs/jgc/des/sla","summary":"recently started playing at &lt;a href=&quot;https://pokiematecasino.com&quot; rel=&quot;nofollow ugc&quot;&gt;Casino Mate&lt;/a&gt;, and it has been a very positive experience. The site is user-friendly and responsive, with games loading smoothly without lag. They offer a solid variety of slots, table games, and live casino options, making it enjoyable for different types of players.","url":"https://extra.cw/trump-signs-bill-requiring-epstein-files-release/","image":"https://extra.cw/wp-content/uploads/2019/08/epstein.jpg","video":null,"publish_date":"2025-11-22 01:03:24","author":"Balaer","authors":["Balaer"],"language":"en","category":"politics","source_country":"aw","sentiment":-0.125},{"id":381414254,"title":"Staying Alive icon Finola Hughes makes rare public outing… 42 years after starring with John Travolta","text":"Home and Garden\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nPrivacy Policy\n\nSaturday, Nov 22nd 2025\n\n5-Day Forecast\n\nAdvertisement\n\nRevealed: The woman giving Harry and Meghan the royal life they can no longer afford - complete with lavish homes and a private jet\n\nMarried British soldier accused of stabbing young mother to death in Kenya breaks his silence from behind bars as he fights extradition to Africa\n\nTrump turns the screw: Zelensky's agonising choice as President demands he accept humiliating peace deal by Thursday - or lose US support\n\nWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends ring KATIE HIND, spill the gossip he'll hate... and drip venom over what's REALLY going on with Jungle no-show\n\nWhy Strictly's going to be cancelled: It's not just shocking rape, cocaine and vile on-set behaviour allegations, says AMANDA PLATELL. The judges and contestants represent the new kind of rot... why's it being silenced\n\nHow to know if your wardrobe is cringe: Celebrity stylist reveals the items officially deemed 'uncool' (and what you should wear instead)\n\nAs new rape allegations rock Strictly Come Dancing, why this could be the show's last dance...\n\nRevealed: The cheap supplement that turbo-charges how well Mounjaro and Wegovy work, keeps you losing weight if it's slowing - and experts say ALL patients coming off weight-loss jabs should take to avoid piling the pounds back on\n\nChurches were RIGHT to refuse to help women posing as needy mothers begging for formula who went viral. No one else will say it, says QUENTIN LETTS... but this is why - and the Bible backs me up\n\nJAN MOIR: My trip to Meghan Markle's pop up shop where even the Montecito set baulk at £24 for a jar of honey!\n\nLike our Home Secretary, I fear that if we don't sort out Britain's mass migration crisis, it will trigger a total breakdown in race relations: DR RAKIB EHSAN\n\nThe middle-aged mums making eye-watering sums selling on TikTok shop. Claire makes £9,000 a month. Jo makes £13,000. Now they say it's a gold mine for the over-40s, reveal how they did it... and the dark side\n\nForbidden book omitted from the Bible reveals a vengeful child Jesus... and exposes why it was kept hidden\n\n'This is how you wanted to die, right?' From a dark corner of the web to a tearful final video, the horrifying final days of British woman who 'asked to be murdered'\n\nSarah Ferguson 'is considering six-figure offers' to give tell-all interview after being stripped of Duchess of York title as palace aides fear she could go 'rogue'\n\nGladiators star The Giant 'SPLITS from wife Katie and reveals why their relationship ended'\n\nI'm A Celeb's Vogue Williams makes her jungle bikini debut and displays ripped six-pack as fans accuse her of 'fishing for compliments' after admitting she feels 'ugly'\n\nCharley Webb reveals diagnosis which helps explain her 'cold' personality as she opens up about neurodiversity\n\nFrom Matt Smith in dark drama The Death Of Bunny Munro to a Julia Roberts thriller fresh from the cinema, our critics have picked the 19 best shows and films to stream this weekend\n\nHelen Skelton and Gethin Jones make their second cosy red carpet appearance together at the RTS Awards after months of romance rumours\n\nHundreds of children - some as young as 10 - are set to be jabbed with puberty blockers in NHS-backed experiment\n\nForget something, Usha? Whispers about Vance marriage grow louder as Second Lady ditches her wedding band\n\nI'm A Celebrity's Vogue Williams reveals the truth behind her age-defying looks as she complains about feeling 'so ugly' in jungle - and is immediately grilled by Ruby Wax\n\nDark allegations about Netflix smash Physical Asia revealed: The damaging speculation, 'suspicious' moments and controversy that have tainted South Korea's shock victory. Special report by RONAN O'REILLY\n\nStaying Alive icon Finola Hughes makes rare public outing… 42 years after starring with John Travolta\n\nHave YOU got a story? Email tips@dailymail.com \nBy CHRISTINE RENDÓN \n Published:01:01 GMT, 22 November 2025 |Updated:01:01 GMT, 22 November 2025 \n\nStaying Alive icon Finola Hughes bundled up for a laid-back outing in Los Angeles this past week.\nThe soap icon, 66, cloaked herself in an olive green pea coat, grey sweater, white ankle boots and a tan suede hat.\nTextured black messenger bag looped across her chest, Hughes was a vision of fall fashion as she ran errands solo on Wednesday. \nThe British actress famously starred opposite John Travolta in the 1983 film Staying Alive, the sequel to the legendary Saturday Night Fever. \nShe was the beautiful dancer who captured Travolta's heart, a role she nabbed early in her impressive acting career. \nNot only did she sizzle on the big screen but she became a force to be reckoned with in the world of soap operas with long-time roles in All My Children and General Hospital.\n\nStaying Alive icon Finola Hughes bundled up for a laid-back outing in Los Angeles this past week\n\nShe was the beautiful dancer who captured his heart, a role she nabbed early in her impressive acting career\nHughes' small screen success also consisted of leading roles in the hit series Charmed and Blossom. \nThe fashionista also demonstrated her style prowess as the host of the reality makeover show, How Do I Look?\n\n General Hospital is bringing back fan-favorite star seven years after he was killed \nThis past year saw Hughes mark a major milestone - 40 years since she first appeared on General Hospital.\n'It’s literally crazy,' she told Soap Opera Digest. 'Forty years since you saw the whites of my eyes the very first time?! Wow.'\nThe anniversary also marked four decades living in the United States for Hughes. \n'It’s 40 years in America, so that’s part of the celebration. I’ve been back and forth [from the show], but the character has always been a mainstay of mine, and somewhere I’ve always found parts of myself,' she said.\n'I love playing Anna, I really do.'\nWhile the world may be more familiar with her acting skills, Hughes initially gravitated towards dance as a kid. \n\nHer acting credentials include a long-time role in the beloved 90s series Blossom\n\nFinola pictured hitting the dance floor with Travolta in Staying Alive\n\nTheir 1983 film was directed by Sylvester Stallone; Finola and Travolta pictured in the film\n\nThe former How Do I Look? host was a vision of fall fashion in an olive green pea coat and white ankle boots\n\nHughes faced the autumn chill with a grey sweater featuring fingerless gloves\n'I went to a school and then a college of performing arts, so from the age of 10, I was acting — I would get different jobs and I would go off and do a little TV series or whatever — but I never took it seriously,' she told Soap Opera Digest. \n'Dance was what I really had an affinity for. When it came time for me to transfer up to the college, they asked me if I would go into the acting side. And in my mind, I was like, \"No! I have to do dance now, while I’m 16 or 17,\" whatever age that I was. So I went and did that. But I’d be lying if I said that I hadn’t always loved acting. I just didn’t concentrate on it. My mind was just on dance.'\nHughes' dancing skills came in handy when she tried out for the role of Laura in the Sylvester Stallone directed film Staying Alive.\nAuditions consisted of her learning the routine before dancing with Travolta himself. \nShe got the part the same day she tried out for the role. \n\nThe star browsed through her phone \n'Sly [Stallone] was there, and then they sort of said, \"Yeah, you’ve got the role,\"' she told Remind. 'They told me right there.'\nHughes had high words for both her co-star and director.\n'He was the sweetest,' Hughes, who was in Los Angeles for the first time at the time of filming Staying Alive, said of Travolta. 'He’s just lovely. He was so supportive and so kind and kind of took me under his wing a little bit because I’d never been to Hollywood and he really looked after me. He made sure that I was taken care of, and he just is great.'\nOf Stallone, she gushed: 'He was fantastic, very spontaneous.'\n'He likes things to be spontaneous, and I think that was good for me because I didn’t know how to do that,' she continued. 'I didn’t really know how to do anything. I’m being completely honest — I had no idea what I was doing, and John would sort of give me little clues. I think they were always trying to loosen me up, so they would surprise me sometimes. They understood that they were working with a complete newbie.' \nBut Hughes didn't have the same praise when it came to her own acting ability. \n'I think my acting sucked,' she said. 'I was up for a Razzie Award [for Worst Supporting Actress and Worst New Star], which I now know is kind of in good standing.' \nJohn TravoltaLos Angeles\n\nShare or comment on this article: \nStaying Alive icon Finola Hughes makes rare public outing… 42 years after starring with John Travolta\n\nAdd comment\n\n Share what you think\n\nNo comments have so far been submitted. Why not be the first to send us your thoughts,\nor debate this issue live on our message boards.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nRevealed: The woman giving Harry and Meghan the royal life they can no longer afford - complete with lavish homes and a private jet\n\nI'm A Celeb's Vogue Williams makes her jungle bikini debut as fans accuse her of 'fishing for compliments' after admitting she feels 'ugly'\n\nAs new rape allegations rock Strictly Come Dancing, why this could be the show's last dance... \n\nEXCLUSIVEWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends ring KATIE HIND, spill the gossip he'll hate... and drip venom over what's REALLY going on with Jungle no-show\n\nI'm A Celebrity fans accuse Jack Osbourne of 'rage-baiting' the camp amid tense feud with Kelly Brook\n\nFrom £7 an hour to millionaire inventor: The British success story making cleaning a pleasure, and how it began\n\nCharley Webb reveals life-changing health diagnosis which helps explain her 'cold' personality as she opens up about neurodiversity\n\nWhy Strictly's going to be cancelled: It's not just shocking rape, cocaine and vile on-set behaviour allegations, says AMANDA PLATELL. The judges and contestants represent the new kind of rot... why's it being silenced\n\nAdam Peaty's sister Bethany survives family fallout as she joins team Ramsay 'after having her head turned by glitz and glamour'\n\nEXCLUSIVEDreading the winter fatigue? From simple food swaps to routine tweaks, this is how to support energy to live your life to the full\n\nGladiators star The Giant 'SPLITS from wife Katie and reveals why their relationship ended'\n\nMeghan has revealed the alarming depths of her delusion - and exposed herself as insecure, empty and kind of a jerk: MAUREEN CALLAHAN\n\nI'm A Celebrity's Vogue Williams reveals the truth behind her age-defying looks as she complains about feeling 'so ugly' in jungle\n\nHelen Skelton and Gethin Jones make their second cosy red carpet appearance together at the RTS Awards after months of romance rumours\n\nSeason of festive spending: How to stay in control of your spending during the run-up to Christmas \n\nNYC's hottest it-girl actress breaks silence on scandal that got her axed from Hollywood movie... as insiders spill on sickening whispers\n\nRuby Wax brings back the mean as she deals withering putdown to Tom Read Wilson - just days after I'm A Celeb viewers called for her to be AXED \n\nDua Lipa shows off her washboard abs in a skimpy bikini as she poses with lookalike sister Rina during a trip to Brazil\n\nRHOA star Kandi Burruss announces DIVORCE from husband Todd Tucker after 11 years together\n\nFrom trending toys and tech to beauty must-haves: Unwrap the ultimate Christmas gift guide... with picks that will fill them with sparkle and joy!\n\nJAN MOIR: My trip to Meghan Markle's pop up shop where even the Montecito set baulk at £24 for a jar of honey!\n\nCoronation Street star poses beside 'sex slave' speech hate preacher who was banned from the UK\n\nI'm A Celeb's Shona McGarty left red-faced as she is caught up in awkward innuendo with Martin Kemp during dunny trial\n\nEDEN CONFIDENTIAL: Cheryl Cole's name stripped from royal youth centre she raised £1million for\n\nFrom a tree that'll make your neighbours jealous, elegant tablescapes, great gifts, and fabulous festive outfits: We have your showstopping Christmas covered\n\nMeet the man Lisa Riley calls her 'soulmate'! I'm A Celeb star's rarely seen musician fiancé Al has won her heart - but there's a heartbreaking reason they'll never marry\n\nSarah Ferguson 'is considering six-figure offers' to give tell-all interview after being stripped of Duchess of York title as palace aides fear she could go 'rogue'\n\nAll you need is love - and £95 - to get yourself a copy of The Beatles' 191-track Anthology Collection: a deluxe reissue of a deluxe retrospective. Adrian Thrills reviews...\n\nWWE star Alexa Bliss hits back after being trolled for 'looking old' at just 34\n\nFrom TikTok to RED HOT! Sarel reveals she's dyed her hair for the very first time - and it cost her less than £10\n\nTravis Kelce speaks out on his future as he casts doubt on widely expected retirement plan\n\nTraitors star Jonny Holloway addresses speculation the 'dates don't add up' as he reveals new details in Charlotte Chilton-Conor Maynard baby row\n\nHilary Duff poses in stockings after debuting new taut face for music comeback\n\nDemi Lovato models a tiny bikini to show off her newly slender figure as she dances on a yacht\n\nEXCLUSIVEFrom garage workshop to global success: Meet the Brit who reinvented the vacuum cleaner\n\nBreaking Dad! Bryan Cranston put through the wringer in this tale of family despair: PATRICK MARMION reviews\n\nAlex Jones reveals she was a bikini-clad contestant on raunchy Magaluf dating show where 'everyone was having sex' \n\nElizabeth Hurley's nepo baby son Damian defends Billy Ray Cyrus amid pair's unlikely romance\n\nVanderpump Rules alum Charli Burnett marries boyfriend Corey Loftus in Mexico... two years after quitting Bravo show\n\nFrom legendary après-ski to snow-sure resorts and incredible all-inclusive packages: THIS is how to plan the ultimate ski holiday in the French Alps\n\nDenise Richards' ex 'begging friends for money' as he claims to be 'broke and almost homeless' amid nasty split\n\nKate Hudson and Hugh Jackman can't stop laughing as they pose together on the red carpet at Song Sung Blue premiere in London\n\nPaloma Faith posts cheeky pregnancy thirst trap as she shows off her blossoming bump in racy lace catsuit\n\nShe has won an Oscar, worked with Johnny Depp and was married to Nicolas Cage, who is she?\n\nGogglebox star Scarlett Moffatt is the first celebrity confirmed for this year's Strictly Come Dancing Christmas Special - despite dance experience\n\nThe Stone Roses' Gary 'Mani' Mounfield's unexpected death comes following the second anniversary of his wife's passing - leaving 12-year-old twins orphaned\n\nAmanda Bynes breaks silence on wild claim Nickelodeon producer Dan Schneider impregnated her at 13\n\nKanye West, 48, says he 'regrets life' during rare interview as he debuts grey hair in his beard\n\nKelly Brook and Jack Osbourne were ALWAYS going to clash on I'm A Celebrity for a simple reason - and it has nothing to do with the cooking\n\nEthan Hawke reveals why he never talks about ex-wife Uma Thurman even though they have been divorced for 20 years\n\nAlex Jones admits she felt like a 'failure' amid her husband Charlie Thomson's debilitating depression battle\n\nJessica Alba, 44, flashes her toned bikini body in Australia... after hot date with beau Danny Ramirez\n\nVictoria Beckham's sibling you've never heard of! Posh's brother Christian appears in rare snap after shunning the limelight for a private life with his family\n\nLady Gaga keeps a low profile as she strolls through Paris ahead of the final European date of the Mayhem Ball after revealing she had a 'psychotic break'\n\nBeauty lovers, take note - Elizabeth Arden is quietly offering double discounts on its most luxurious gift sets\n\nLizzie Cundy looks smitten with new love interest American DJ Donald Frieze in cosy snaps at swanky Hollywood restaurant\n\nReal Housewives of New York fan favorite QUITS show... as series preps for season 16\n\nEXCLUSIVEKelly Brook's family furiously hit back at I'm A Celebrity bullying accusations - insisting Jack Osbourne feud is 'a load of rubbish'\n\nKim Kardashian flashes her cleavage in bizarre dress that has over 100 safety pins hanging from the edges\n\nTesco shoppers discover 'delicious' award-winning Irish cream liqueur ahead of Christmas - and it's even beaten Baileys\n\nAriana Grande bids farewell to Glinda as she battles COVID days after fan ambush amid Wicked press tour\n\nMeghan Markle teases 'something big is coming' as she boasts about Harper's Bazaar cover being a 'mic drop' moment\n\nLila Moss, 23, looks effortlessly chic in black and white as she heads to the Swiss Alps to launch H&M & Perfect Moment's après-ski collection\n\nBrian Austin Green REUNITES with ex and Beverly Hills, 90210 co-star Tiffani Thiessen 30 years after breakup\n\nEXCLUSIVEFamily panic as Britney Spears takes 'disturbing' measures... after world was shocked by her unrecognisable new look\n\nTrainspotting star sells sprawling US home for millions after moving back to homeland\n\nSydney Sweeney confesses being alone forever is her 'biggest fear' - as Scooter Braun romance heats up\n\nRace faker Rachel Dolezal resurfaces with BOMBSHELL makeover on 48th birthday... as fans say she's twinning a very unlikely celebrity\n\nThe unassuming Scots star of a beloved children's TV show who left MILLIONS behind in her will\n\nEXCLUSIVETruth about Ariana Grande and Cynthia Erivo's 'secret marriage'... and the reason their friendship could soon be OVER\n\nStrictly's La Voix breaks silence on conspiracy theory about why she REALLY dropped out of show and shares injury update on It Takes Two\n\nBrad Pitt faces new scrutiny over past 'gross' on-screen kiss with underage costar\n\nJennifer Aniston's 'love guru' boyfriend Jim Curtis shares astrology forecast on relationship as he says 'emotions run deep'\n\nEXCLUSIVEAmy Tapper, 26, reveals she's having surgery to remove loose skin following incredible 8st weight loss after using Mounjaro\n\nKelly Brook turned to me for help with her cheating ex-boyfriend - but showed her true colours later with brutal snub, says former I'm A Celebrity star\n\nAna de Armas, 37, channels iconic meme of Nicole Kidman leaving her lawyer's office after Tom Cruise divorce was finalised following her own split from the Hollywood actor\n\nZach Bryan's ex Brianna Chickenfry reveals how she's doing one year after split left her in a 'dark place'\n\nAlan Carr shares the REAL reason he broke down in tears during Celebrity Traitors' finale reveal - and the 'abuse' he has received since winning show\n\nJelly Roll's wife Bunnie Xo reveals she has to check herself into jail... after sharing 7th mug shots\n\nAngellica Bell shows off her incredible curves in a floral multi-print bikini as she enjoys a sunshine break on a cruise in St Lucia\n\nRonnie Wood, 78, and Bryan Adams, 66, stun guests at Texas wedding of multi-millionaire CEO Rob Steele with epic all-star performance\n\nBrooklyn Beckham appears to share poignant message about being 'lonely' after his family post gushing tributes celebrating brother Cruz's music gig\n\nKris Jenner's sign of support for Meghan as she shares trailer for the Duchess's Netflix show after 'photogate' row\n\nTess Daly arrives in Blackpool with Claudia Winkleman for final Strictly show at iconic ballroom as she reflects on all the 'wonderful times'\n\nSimone Biles follows in Kylie Jenner's footsteps as she reveals all the details about her 'perfect' boob job\n\nLiev Schreiber, 58, is seen for the first time since he was rushed to the hospital for severe pain\n\nMeghan Markle fans spot uncanny resemblances in Harper's Bazaar photoshoot to Princess Diana\n\nBeloved detective series with whopping 97% Rotten Tomatoes score AXED after lead star quits in blow to fans\n\nKhloe Kardashian, 41, reveals if she ever hooks up with ex Tristan Thompson, 34, when he drops by for visits\n\nPrincess Andre stuns in black catsuit as she joins brother Junior at their PR agency's Christmas party - after she brushed off feud rumours with her mother Katie Price\n\nHailey Bieber rings in 29th birthday with lavish cake and martinis at exclusive Rhode bash\n\nBBC drama hailed as 'an absolute triumph' confirms return to screens after string of glowing reviews - with David Tennant joining in lead role\n\nJen Shah granted early prison release as departure date is unveiled... three years after wire fraud conviction\n\nThe 'insane' moment OJ Simpson 'pretended to kill' Ruby Wax in 1998 BBC interview after she recalled the bizarre ordeal on I'm A Celebrity\n\nTikTok star Ben Bader, 25, cause of death revealed after he was found unresponsive at a private Palm Beach club\n\nAlex Rodriguez makes rare remark about ex Cameron Diaz with glimpse into relationship\n\nScreaming Shona McGarty stuns Ant and Dec with VERY strange reaction to being showered with bugs in revolting first look at Dreaded Dunnies trial\n\nIs Ariana Grande and Cynthia Erivo's friendship codependency or one we could learn from?\n\nKate Beckinsale unveils sweet tattoo tribute to her late mother Judy Loe following her death aged 78\n\nDiane Kruger wows in a plunging gown as she poses for Defined Magazine and admits 'motherhood can be isolating' as she opens up about welcoming her daughter in her 40s\n\nJeff Goldblum makes hilarious confession as he reveals the one thing he has in common with Kim Kardashian\n\nEXCLUSIVEPhantom Of The Opera icon Sarah Brightman, 65, will be spending Christmas with her 'incredible' boyfriend after her holiday tour\n\nWhat Meghan's announcements in her pseudo-Royal court get wrong and why they 'speak volumes', revealed by experts\n\nJumanji 3 FIRST LOOK: Karen Gillan flaunts her toned abs in a crop top and hot pants for filming as she joins Jack Black, The Rock and Kevin Hart\n\nEXCLUSIVECurtis Pritchard signs up to Ex on the Beach as furious ex plans to confront him over last-minute dumping before Love Island: All Stars\n\nRita Ora bizarrely reveals she is a WITCH in new interview before sharing her weekly ritual and claiming 'astrology should be a religion'\n\nKimberley Garner stuns in a backless bodysuit and white jeans as she joins stylish Lottie Moss at the Harry's Covent Garden launch party\n\nStrictly's Katya Jones and Lewis Cope lead the stars stepping out for rehearsals ahead of the Blackpool special - after getting cosy on fish and chip date\n\nRochelle Humes breaks down in tears live on This Morning as young Wicked fans discusses cancer battle - with heart-wrenching twist\n\nAxed Gino D'Acampo hit with fresh 'bullying' allegations and claims ITV ignored complaints about the chef's 'humiliating and intimating' behaviour\n\nHugh Jackman, 57, backtracks on never playing Wolverine again - after his most recent appearance as the iconic superhero made £1B at the box office\n\nLeigh-Anne Pinnock wears sheer black bra and tiny top after vowing to shed her 'Miss Nice Girl' image as she announces another new release\n\nEXCLUSIVELove Island bosses back Whitney Adebayo as she's lined up for All Stars amid her legal battle with ex Lochan Nowacki\n\nWicked: For Good viewers have a BIG complaint about blockbuster sequel as it hits cinemas - despite string of glowing reviews\n\nVick Hope shares rare pictures of her baby son Micah with husband Calvin Harris as she balances work and motherhood\n\nGlenn Close forced to defend Kim Kardashian's 'stiff' acting in her new TV show All's Fair after it was SAVAGED by critics and branded 'the worst drama ever'\n\nRosie Huntington-Whiteley poses topless as she shows off her incredible figure during trip to Brazil\n\nLeonardo DiCaprio and pal Tobey Maguire attend star-studded party in Mayfair after celebrating One Battle After Another in London\n\nGal Gadot looks sensational in a figure-hugging sequinned gown as she attends Beverly Hills charity bash \n\nThe One Show's Alex Jones reflects on her co-host Jermaine Jenas' sexting scandal as she says: 'We were good friends and I was the last to know'\n\nGogglebox star Amy Tapper details her 7st medicated weight loss journey in 'empowering' post as she hits out at 'bullying and unsolicited advice'\n\nLouis Theroux cosies up to fashionable wife Nancy Strang as the couple make rare public appearance at Choose Love's 10th anniversary bash\n\nJosie Gibson shows off her impressive 5st weight-loss in a plunging pink dress before slipping into a bikini to go snorkelling during lavish Caribbean cruise\n\nI'm A Celebrity's Lisa Riley sparks concern among viewers as they notice a surprising change in her appearance\n\nEXCLUSIVESian Welby admits she's put her relationship with fiancé Jake Beckett 'on the back-burner' and says she doesn't have 'capacity' to plan her wedding\n\nDua Lipa is mobbed by fans in Brazil as she poses for selfies and signs autographs outside her hotel\n\nHolly Ramsay shares brand campaign snaps with Emporio Armani as she posts online for the first time since breaking her silence over wedding feud\n\nKelly Brook and Jack Osbourne's I'm A Celebrity feud deepens as new arrivals Vogue Williams and Tom Read Wilson wade into row\n\nMick Jagger, 82, wraps up in a colourful scarf as he and leggy fiancée Melanie Hamrick, 38, leave star-studded Mayfair bash hand-in-hand\n\nEXCLUSIVECharlotte Crosby admits she suffered a relationship crisis with fiancé Jake Ankers after welcoming her second child \n\nHotter than ever at 80! How Goldie Hawn is defying the laws of ageing with her youthful features and figure as she hits her milestone\n\nJameela Jamil holds hands with boyfriend James Blake in rare PDA as couple attend Choose Love 10th Birthday Gala\n\n'It's on Adam to build bridges': SARAH VINE weighs in on rift between Adam Peaty and his family overshadowing his upcoming marriage to Holly Ramsay\n\nEXCLUSIVEALISON BOSHOFF: Victoria's secret: Posh 'planning to sell' $100m beauty and fashion brand\n\nOn the market \n\nEverybody Loves Raymond stars now unrecognisable as they reunite for sitcom's 30th anniversary\n\nAlan Carr reveals the saddest moment of Celebrity Traitors - and it ISN'T the murder of his dear friend Paloma Faith\n\nStrictly star is arrested on suspicion of raping a woman after a BBC event\n\nThe man cannot be named for legal reasons\n\nKelly Brook sends fans into meltdown as she trades her swimsuit for a TINY bikini during first jungle shower on I'm A Celeb\n\nThe subtle sign of King Charles's 'devotion' to Queen Camilla during 'episode three' of their affair\n\nMeghan Trainor reveals illness during pregnancy led her to dropping 60lbs before turning to weight loss drug after giving birth\n\nJessie J puts on a daring display as she joins Louise Redknapp and Ashley Roberts at the ZYN Rolling Stone UK Awards 2025\n\nGrammy-winning artist from famed hip-hop group jailed for 14 years for funneling millions to Obama\n\nTimothee Chalamet makes VERY bizarre entrance at NYC event for his new film amid Kylie Jenner 'split'\n\n'I can't believe you're a rockstar!' Harper Beckham tells brother Cruz she was moved to tears watching him perform on stage\n\nBen Affleck relaxes with cigarette before hitting stage at Beverly Hills bash for Michael B. Jordan\n\nGlenn Close looks VERY different thanks to movie magic in trailer for Hunger Games prequel\n\nKaty Perry's whirlwind romance with Justin Trudeau gets even more serious as the holidays approach\n\nSofia Richie marks five months of second pregnancy as she shows off baby bump inside her VERY spacious bathroom\n\nBrooklyn Beckham whips up a fried chicken sandwich in his latest cooking video - but people all have the same criticism\n\nBruce Willis' daughter Rumer makes heartbreaking confession about her famous father's dementia battle\n\nBrendan Fraser breaks silence on The Mummy 4 as he's set to reunite with Rachel Weisz\n\nLeonardo DiCaprio rubs shoulders with Sir Mick Jagger as they join Pierce Brosnan and his son Dylan at London celebration for his latest filmOne Battle After Another\n\nShelley Duvall fans left shocked at her forgotten 1970s romance with music icon\n\nHailey Bieber enjoys girls' night out with Zoe Kravitz at celebrity hotspot ahead of her 29th birthday\n\nJeff Goldblum poses with ultra-lifelike Madame Tussauds wax figure... so can YOU tell which one is real?\n\nThe Stone Roses bassist Gary 'Mani' Mounfield dies aged 63: 'Devastated' band pay an emotional tribute to their 'wonderful brother'\n\nReunited at last! Elsa Pataky and Chris Hemsworth turn heads as they pose together at A Road to Remember special screening\n\nLouis Tomlinson donates huge four-figure sum towards life-saving surgery for former One Direction bodyguard\n\nCraig Revel Horwood details 'awful' childhood with his 'terrible alcoholic' father who tried to SHOOT his mother \n\nLIZ JONES: The real barb in Meghan's interview everyone's missed. Yes it's laughable... but the message is so clear\n\n'Missing him is now part of breathing': Liam Payne's sister Ruth Gibbins shares devastating tribute to her brother \n\nBridgerton star Genevieve Chenneour breaks down in tears as she reveals she was attacked in central London AGAIN\n\nCelebrity Masterchef fans are 'surprisingly loving' Grace Dent as they praise the new judge - just days after hitting out at the BBC\n\nJoseph Quinn 'is dating Australian singer Grace Stephenson as loved-up couple pack on the PDA at London gig' after his split from Doja Cat\n\nEDEN CONFIDENTIAL: Let me host Strictly, says oldest ever contestant Angela Rippon, 81\n\nShe dazzled viewers with her high kick on Strictly\n\nI'm A Celebrity stars Angry Ginge and Kelly Brook's 'secret codenames revealed' after bosses kept their identities under wraps\n\nEXCLUSIVERICHARD EDEN: Ouch! Ahead of Harry's bizarre lecture to estate agents, school friend's VERY cutting comment to me about Prince\n\nNatalie Portman and director Rebecca Zlotowski look extremely close on the red carpet at Vie Privée premiere in Paris\n\nVogue Williams and Tom Read Wilson finally enter the I'm A Celeb camp as Aitch is left with tears in his eyes as he fails to secure any stars\n\nBridget Fonda, 61, continues to flaunt thinner-than-ever frame on rare outing after losing 75lbs\n\nQuite a difference \n\nHollywood legend Dame Helen Mirren makes an unlikely visit to The Repair Shop this Christmas as she stars in festive special\n\nKessler twins who worked with Frank Sinatra and wowed Elvis Presley 'paid a lot of money' to die together at 89\n\n'Everyone does it!' I'm A Celebrity's Kelly Brook divides fans after admitting she wees in the jungle shower\n\nTend it like Beckham: Sir David to create garden for Chelsea Flower Show as part of The King's Foundation\n\nNew venture \n\nBobby Brazier shares a look at his spiritual journey after leaving showbiz as he joins worshippers in India for Hare Krishna dance \n\nBRIAN VINER reviews Sisu: Road to revenge... it's violent but exhilaratingly bonkers\n\nDavid and Victoria Beckham book out Notting Hill venue to watch son Cruz's gig - despite former hotspot being closed for years\n\nDwayne Johnson honors late Robin Williams with memento on Jumanji set in LA\n\nThe 53-year-old superstar took to social media\n\nROLAND WHITE reviews Play for Today: Big Winners - Will a £14million lottery win fix this unhappy marriage? Not a chance...\n\nCardi B divides fans as she reveals $1,000 glam accessory made from her umbilical cord\n\nUnconventional \n\nWilliam's secret gesture to Kate captured on camera before couple entered Royal Variety Performance - and it leaves fans swooning\n\nHeather Graham, 55, flaunts age-defying looks in sheer lace dress ahead of event celebrating 'female Viagra' documentary\n\nEXCLUSIVEWhat happens next now that D4vd is a suspect in the killing of a teen found in his Tesla?\n\nHe's a person of interest\n\nKelly Osbourne blasts 'bully' Kelly Brook over her 'performative' screen clash with I'm A Celeb star brother Jack in blistering attack\n\nVERONICA LEE reviews Sherlock Holmes and The 12 Days of Christmas: Oh, yes they did! Rice and Lloyd Webber reunite\n\nMachine Gun Kelly sings tribute to Megan Fox at concert amid claim they're 'closer than ever' after split\n\nStill smitten \n\nLouise Redknapp and her boyfriend Drew Michael enjoy a date night at the ZYN Rolling Stone UK Awards 2025\n\nCelebrity Big Brother 'set to be wiped from ITV's Spring schedule' in further blow just days after spin-off was axed\n\nPop star who rose to fame in the 90s wishes her lookalike daughter a happy 27th birthday - but can YOU guess who her mother is?\n\nChadwick Boseman's Hollywood A-list friends sob as tragic actor gets posthumous star... five years after cancer death\n\nTragic loss\n\nEXCLUSIVEAngryGinge's relationship status revealed as images of the I'm A Celeb star with mystery blonde surface\n\nProfessor Green's son Slimane, 4, is rushed to hospital after horror accident abroad left him needing stitches\n\nHow Martha Stewart, 84, would REALLY look if she never had any cosmetic tweakments\n\nShe has made headlines for her youthful looks\n\nLindsay Lohan's rarely-seen brother Dakota fuels concern with cryptic post about his 'behavior and bad habits'\n\nAriana Grande reveals she has COVID in latest setback... days after Wicked star was ambushed by deranged fan\n\nAshley James wows in a gold structured corset as she joins the glamorous Nathalie Emmanuel on the red carpet at Choose Love's 10th anniversary bash\n\nEXCLUSIVEFrail Kathleen Turner, 71, seen in wheelchair as she reveals debilitating health battle in rare public outing\n\nQueen Camilla reunites with Geri Halliwell-Horner as pair celebrate young winners of Queen's Commonwealth essay competition\n\nJane Fonda, 87, admits she did so many drugs in her 20s she thought she would die\n\nSpeaking on Michelle Obama's The Look\n\nSex And The City star is trolled for having 'so much Botox' before an Oscar winner jumps in to support her\n\nHailey Bieber sizzles in a thong bikini for sultry beach photo shoot ahead of 29th birthday\n\nPosed up a storm for latest snaps \n\nDani Dyer puts on a glamorous display in a glitzy black sheer gown as she joins dad Danny at the ZYN Rolling Stone UK Awards 2025\n\nSara Cox leaves Children In Need viewers sobbing as she breaks down in tears sharing heartbreaking truth behind her challenge\n\nEXCLUSIVEDance Moms divided! Multiple cast members speak to Daily Mail and hurl ugly allegations at each other\n\nZoe Saldana, 47, flashes thigh-high stockings for Vogue as she says she's 'embracing wrinkles'\n\nLooking good\n\nEXCLUSIVEGhost Adventures star's ongoing secret heartache after his wife took out hit on him\n\nStill weighing on him.\n\nKhloe Kardashian jokes about O.J. Simpson being her real father in front of mom Kris Jenner after affair rumours\n\nSteven Knight breaks his silence on the James Bond script and jokingly teases who Daniel Craig's replacement could be\n\nLiam Gallagher and Shaun Ryder lead celebrity tributes to The Stone Roses bassist Gary 'Mani' Mounfield after his death aged 63\n\nMeghan Markle risks alienating fans by showcasing $200,000 worth of clothes and jewels in Thanksgiving promo\n\nKim Kardashian is left speechless by sister Kourtney's callous responses after suggesting she put law school on pause\n\nRumer Willis cries over being a single mom and teases 'shady' new song I'd Rather Be Lonely\n\nConfirmed the end of her two-year relationship\n\nSpencer Lofranco dead at 33: Gotti actor who played John Travolta's son passes away as tributes pour in\n\nEmotional Sara Cox, 50, reveals she has raised £11.5MILLION for Children In Need as donations continue to soar\n\nCruz Beckham, 20, shares a very passionate kiss with girlfriend Jackie Apostel, 30, before hugging proud dad Sir David\n\nJack White's Thanksgiving NFL show risks Donald Trump fury after rock star branded President 'low-life fascist'\n\nKate Ferdinand reveals her thoughts on living in Dubai long term following her move to UAE with husband Rio and their family \n\nTina Knowles claims white couple was allowed to cut her in line at 'racially-charged' Kentucky Derby event\n\nKelsea Ballerini and Chase Stokes appear to call off romance AGAIN as actor shares cryptic posts about being 'blocked'\n\nMeghan King's former co-star Kelly Dodd defends RHOC alum after embattled mother lost custody of her three kids\n\nSimone Biles reveals she 'couldn't move' after her boob job and was 'freaked out' by the results\n\nRichard Dreyfuss' son claims he and his siblings are broke and 'estranged' from Oscar-winning Jaws star\n\nNot in touch \n\nJoJo Siwa reveals major next step in her relationship with Chris Hughes as she shares loved up festive snaps\n\nHappy couple \n\nEmotional Holly Hagan fights back tears as she explains how her 'world has stopped' in the 'toughest four weeks' of her life since sister Darci's death aged 19\n\nStrictly's Lewis Cope and partner Katya Jones put on a cosy display as they carb up on fish and chips ahead of the Blackpool special\n\nCountry music legend behind iconic hits dies aged 70 following battle with mystery illness\n\nLily Allen's ex husband David Harbour laughs as she admits 'everyone abandons me' in resurfaced clip\n\nDad is on Landman and mum was a '60s pinup who worked with Robert Redford, do you know who this beauty is?\n\nSienna Miller sports a brightly coloured fur-look coat as she steps out in London\n\nKim Kardashian shares health update after brain aneurysm diagnosis\n\nI'm A Celebrity... Get Me Out Of Here! fans demand that 'hard-to-watch' spin-off show is AXED as they bombard ITV with complaints\n\nJay Leno reveals the horrifying loss his dementia-stricken wife mourned 'every day' for three years\n\nDevastating \n\nRobert De Niro 'proud' to visit Manchester as work begins on his £360m skyscraper that will be UK's tallest outside London\n\nKatie Price, 47, reveals she is taking HRT medication for menopause symptoms - after being hospitalised for mystery weight loss\n\nJustin Bieber stops to help stranded driver in heartwarming moment caught on camera\n\nIs this Meghan's most bizarre 'moment' yet? Duchess crows over how 'boldly' Harry loves her and is 'announced' like royalty into room (containing two people)\n\nLeonardo DiCaprio attends an in-conversation at BFI Southbank to promote One Battle After Another\n\nCandace Cameron Bure reveals struggles in marriage of 30 years\n\nAshley Tisdale stuns fans with unexpected new name 11 years after marriage\n\nHas officially embraced a new chapter of her life\n\nIt Ends with Us author Colleen Hoover breaks silence on explosive Blake Lively and Justin Baldoni lawsuit\n\nSpeaking out \n\nRHOC star Meghan King loses custody of kids to ex Jim Edmonds after child protective services investigation\n\nCaprice, 54, slips into a sexy Santa costume as she promotes her new festive movie A Scottish Christmas Secret in her lavish London home\n\nPrince William tells Rob Burrow's widow and children they should be 'so proud' of 'incredibly brave and special' rugby star - as they open Motor Neurone Disease centre in his honour\n\nAriana Grande reveals her late Italian Nonna's hilarious reaction when her brother Frankie came out as gay\n\nNew Girl actress Olivia Munn who is battling breast cancer reveals how Kate gave her 'comfort' by speaking about her own journey \n\nJacob Elordi ridiculed over his 'horrific' handwriting: 'Was he holding the pen with his toes?'\n\nSusannah Constantine brands Andrew Mountbatten-Windsor 'ignorant and entitled'- and says scandal must be 'horrendous' for Beatrice and Eugenie\n\nBrittany Cartwright flaunts new chest while bra-free in plunging gown... one month after plastic surgery\n\nLeft little to the imagination\n\nEXCLUSIVECharlotte Crosby shares heartbreaking health update on her mother Letitia, 56, amid cancer battle\n\nJennifer Aniston, 56, has been wearing the SAME piece of jewelry for the past 25 years, can you guess what it is?\n\nKim Kardashian reveals doctors warn her brain aneurysm could 'RUPTURE' at any time from her high-pressure lifestyle\n\nEXCLUSIVESian Welby opens up on 'pressure' she felt to return to TV work just three months after giving birth as the 'breadwinner' in her relationship \n\nMORE DON'T MISS\n\nJessie J reveals reason behind her emotional 'mum-to-mum' embrace with Princess of Wales at Royal Variety Performance\n\nLily Collins shares rare insight into motherhood and admits she is 'still learning how to manage everything' as a parent as she flashes her bra in striking ELLE shoot\n\nProud parents David and Victoria Beckham break down in 'tears of joy and pride' as son Cruz, 20, performs for friends and family\n\nEXCLUSIVEGwyneth Paltrow and Jennifer Lopez are now friends after the stars, who BOTH romanced Ben Affleck, were frosty in the '90s\n\nHarper Beckham, 14, supports big brother Cruz, 20, as they share a sweet hug following his intimate gig for friends and family\n\nHow I'm A Celeb star Kelly Brook remains the ultimate swimsuit model three decades on from her Page 3 days - and she still gets to enjoy pasta and wine!\n\nKhloe Kardashian 'DESERVED' to be traumatized after overhearing her having sex, says mom Kris Jenner\n\nJennifer Aniston makes rare comment about the Me Too movement - revealing why she 'can't avoid' addressing it any longer\n\nEXCLUSIVEDame Judi Dench, 90, regifts a sheer thong to a red-faced Dame Imelda Staunton, 69, who quips it's 'a bit big' in hilarious festive ad\n\nGeorgia Harrison and boyfriend Jack Stacey enjoy their first post-baby date night three weeks after welcoming their daughter\n\n6ft 7\" Stephen Merchant towers over his stunning girlfriend Mircea Monroe at a surprise party to celebrate John Cleese's 60 years in showbiz\n\nThis Morning fans gasp 'he needs serious help!' as Britain's most tattooed man shows off inked EYEBALLS - complaining they've 'had to switch off'\n\nTom Hardy strips down to his underwear as he films Guy Ritchie's MobLand season 2 in East London\n\nLily James poses in swimwear as she shares a series of sun-soaked beach snaps from Australia and says she's 'never been better'\n\nSquirming Lorraine Kelly drowned out as Piers Morgan and Dr Amir furiously clash over trans rights and women's spaces\n\nKelly Brook's husband Jeremy Parisi responds to 'very tough' moment she broke down in tears on I'm A Celebrity - admitting that being without her is 'so much harder' than he expected\n\nWayne Rooney reveals the astonishing details behind his biggest Man United contract - leaving former teammates Gary Neville and Roy Keane in stunned silence\n\nJohn Cleese, 86, is supported by Hugh Grant, Ronnie Wood and Alison Steadman at a luvvy-filled surprise party to celebrate 60 years in showbiz\n\nMichelle Keegan desperately attempts to keep warm while filming The Blame in Hertfordshire during Met Office snow warning and -12C Arctic blast\n\nLily Allen announces her biggest EVER headline tour amid the success of David Harbour revenge album West End Girl - after selling out intimate shows in just minutes\n\nScreaming AngryGinge silences Ant and Dec as he struggles to stand facing his ultimate fear of spiders in first look at Camp Fright trial\n\nChanelle Hayes shows off her nine stone weight-loss in a bikini 'after quitting her job as a nurse to launch OnlyFans career'\n\n'Proud of how far I've come': Strictly dancer Amy Dowden shares a health update as she marks two weeks since her second mastectomy\n\nAaron Chalmers' ex Talia Oatway fears their son Oakley, three, could die after devastating new diagnosis\n\nThe hidden message Kate Middleton sent to her supporters with her dress at Royal Variety Performance\n\nI'm A Celeb's Vogue Williams jokes her biggest jungle fear is 'losing the ass that took so long to build'\n\nKate's great heir day! Princess of Wales reveals secret to her new lighter locks during chat with Su Pollard at the Royal Variety Performance \n\nKatie Price breaks her silence on her decade-long feud with Kelly Brook as she hits out at their shared ex Danny Cipriani \n\nJessie J reveals the poignant reason behind her Royal Variety tracksuit after sharing an emotional embrace with the Princess of Wales\n\nCoronation Street star breaks silence on quitting soap after character's sudden disappearance - and reveals new job worlds away from ITV soap\n\nKate Middleton stuns in green velvet dress at Royal Variety Performance - and we've found it on the high street\n\nKaty Perry 'did not expect to fall for someone so soon' as unlikely romance with ex-PM Justin Trudeau flourishes - months after Orlando Bloom split\n\nArchie and Lilibet have 'been good' this year! Meghan reveals her children's sweet letter to Santa in blink-and-you'll-miss-it moment in her new Netflix trailer\n\nAlison Hammond breaks down in tears as she meets a single mum who has been homeless with her son for six years\n\nWatch Victoria Beckham's rare performances from over the years after Spice Girl fans left in awe following acoustic track performance with Cruz\n\nThe biggest threat to Vogue Williams on I'm A Celebrity REVEALED - and it has nothing to do with the brutal Bushtucker Trials\n\nKatie Price issues a grovelling apology to Myleene Klass for calling her a 'clone' in scathing dig after the pianist was awarded an MBE\n\nSir Cliff Richard, 85, spends a 'gorgeous' intimate evening wining and dining Priscilla Presley, 80\n\nElizabeth Hurley and Billy Ray Cyrus can't keep their hands off each other as they make a PDA-filled appearance at the Country Music Awards\n\nThis Morning star calls in police to hunt down man who SPAT at his wife in explosive road rage row that left his eight-year-old daughter 'in pieces on the floor'\n\nBehind the scenes of Meghan's bizarre Bazaar interview! Duchess reclines barefoot on an armchair - as it's revealed the shoot was 5 YEARS in the making\n\nLoose Women star Brenda Edwards reveals secret boyfriend as she 'soft launches' their relationship with anniversary tribute\n\nJennifer Aniston's 'love guru' boyfriend Jim Curtis warns people 'not to settle' as he explains how 'relationships are the most...\n\nKim Kardashian reveals SHE was the secret bidder that paid $80k at auction for Bible her late dad Robert gave to O.J. Simpson\n\nGogglebox's Amy Tapper reveals the secret struggle behind her eight stone weight loss in emotional Good Morning Britain interview\n\nI'm a body language expert and there's A LOT more to Kelly Brook and Jack Osbourne's I'm A Celeb clash than meets the eye - here's what's going to happen next\n\nLily Allen says she feels 'validated' by overwhelming response to writing about her 'messed up' life on West End Girl\n\nMonty Panesar's infamous Celebrity Mastermind appearance goes viral after Steve Smith brutally mocked cricket hero for scoring ONE point in general knowledge round - so, how many can YOU get right?\n\nBenedict Cumberbatch enjoys a rare date night with his wife Sophie Hunter at the New York screening of his movie The Thing With Feathers\n\nEXCLUSIVEKatie Price WILL return to ITV despite rumours of being banned from daughter Princess Andre's reality show\n\nI'm A Celeb host Ant McPartlin packs a punch as he takes a break from presenting duties to attend a sweaty boxing class\n\nPrincess Of Wales shares an emotional hug with Jessie J at the Royal Variety Performance after battling through cancer\n\nVin Diesel cleared of sexual battery claims made by former assistant during filming of Fast 5\n\nKate Winslet fans campaign for What If to reach Christmas number one as 2001 festive movie track becomes a surprise hit on TikTok\n\nEXCLUSIVEThese bikini pictures will prove my critics wrong, says Place In The Sun's LAURA HAMILTON. Their vile comments infuriated me... but this is the truth\n\nThe White Lotus star Walton Goggins packs on the PDA as he makes a rare red carpet appearance with wife Nadia Conners at GQ Men Of The Year event\n\nHow the royal family formed their special connection with Paddington Bear: From Queen Elizabeth's iconic sketch to the Royal Variety Performance\n\nMick Jagger goes back to school: Rolling Stones rocker, 82, makes a surprise visit to Dartford Grammar\n\nUma Thurman channels her assassin alter-ego with a Kill Bill T-shirt as she reunites with Quentin Tarantino after the director's relationship with his 'muse' became strained\n\nEXCLUSIVECharlotte Kirk, the British actress who brought down one of Hollywood's most powerful execs, reveals she is engaged and seven months pregnant\n\nMeghan Markle goes barefaced as she poses on cover of Harper's Bazaar magazine\n\nThe latest edition \n\nAli Larter turns heads in a burgundy strapless mini-dress as she arrives at The Jimmy Kimmel Show\n\nIt's the little things they remember: From stirring the cake mix to leaving out carrots for Rudolph, tiny traditions that make Christmas magical\n\nReal Housewives star arrested for allegedly stealing thousands of dollars worth of furniture\n\nI'm A Celeb's Lisa Riley reveals the truth about her life-changing weight loss after dropping SIX dress sizes and undergoing breast lift\n\nAdam Peaty insists there are 'two sides to every story' as swimmer breaks his silence over bitter family rift\n\nAdam Peaty admits his family were 'ashamed' of him after he 'changed' following Olympic success - after breaking his silence on family row\n\nKate says George, Charlotte and Louis will be jealous as she and William have a meet and greet with Paddington Bear at the Royal Variety Performance\n\nDolly Parton reveals that 'health challenges' have forced her to miss another big event ... after skipping prestigious Governors Awards in Hollywood\n\nPrincess Diana's Panorama interview remains a 'wound that will not heal' for Prince William - and why that could be a 'big problem' for the BBC\n\nMiranda Lambert skips red carpet as she stuns with hunky husband Brendan McLoughlin at CMA Awards 2025\n\nElizabeth Hurley and Billy Ray Cyrus gaze lovingly at each other as they ooze romantic bliss at Country Music Awards in Nashville\n\nKelly's in the Brook! Former glamour model gets her first I'm A Celeb jungle shower moment as she sports a low-cut swimsuit to take a dip\n\nBRIAN VINER reviews Christmas Karma: This spectacularly dreadful offering will empty cinemas quicker than dysentery!\n\nKevin Costner set to play surprising former U.S. president in new United Nations TV series\n\nThe curse of Wicked: How cast have been blighted by an affair scandal, concerning weight loss and a mental health crisis\n\nSports Illustrated icon, 62, ditches fame for FISHING career - see her now\n\nArguably one of the most iconic American models \n\nKelly Brook is branded 'insufferable' by I'm A Celeb viewers after falling out with Jack Osbourne over how to cook an eel\n\nBailey Zimmerman proudly shows off results of cosmetic procedure on CMA Awards 2025 red carpet\n\nFrom Phillip Schofield and Lorraine Kelly to Anthea Turner: Eamonn Holmes' biggest feuds as GB News colleagues 'grow tired of him' \n\nI'm A Celebrity's Lisa Riley reveals she downed THREE bottles of Malbec every night during height of her booze addiction\n\nGogglebox star Amy Tapper hits back at trolls who criticise her of use of weight loss jabs after shedding 7st\n\nGrieving Jack Osbourne is 'being monitored closely by I'm A Celebrity bosses' after an emotional start in camp\n\nCynthia Erivo returns to New York after travelling 10,350 miles in THREE days for the GQ Awards in London amid her hectic press tour\n\nEastEnders New Year's Day episode set to leap a year into the future for Max Branning's iconic return to Albert Square\n\nKeith Urban stuns crowd with first TV performance since split from Nicole Kidman as he takes the stage at CMA Awards in Nashville\n\nTilda Swinton, 65, makes a very rare appearance with partner Sandro Kopp, 47, at Wes Anderson: The Archives viewing\n\nShould Princesses Beatrice and Eugenie be given more royal roles? Have your say in the Palace Confidential Poll\n\nChris Martin spotted out at night with influencer Brittany Broski... but there's a wild twist\n\nOut at a gig\n\nSpencer Matthews gushes over 'fearless and gorgeous' wife Vogue Williams as she prepares for her I'm A Celeb adventure \n\nAlec and Hilaria Baldwin look somber after admitting they are in therapy for 26 year age gap\n\nLow key outing \n\nHelena Bonham Carter mourns the death of her author cousin David Pryce-Jones who documented the lives of their aristocratic family\n\nI'm A Celebrity's Alex Scott reveals she had her first sexual encounter with a woman when she was 17 \n\nOpening up \n\nBikini-clad Dua Lipa leaves little to the imagination in skimpy two-piece as she soaks up the sun rays in Brazil\n\nToned and trim \n\nThe haunting question that set off alarm bells before the Great Fire of Windsor broke out during Queen Elizabeth and Prince Phillip's wedding anniversary\n\nLeAnn Rimes turns heads in a strapless gown with daring slit at 2025 CMA Awards after addressing boob job rumors\n\nHuge I'm A Celeb twist is revealed as newcomers Vogue Williams and Tom Read Wilson will stay in a luxury jungle lodge\n\nAddison Rae showcases her toned bikini body as she soaks up the sunshine while sailing on a private yacht\n\nPeep Show cast reunite on screen for the first time in a decade - but Robert Webb is nowhere to be seen\n\nThe It girls of 2025: Vogue names the 10 socialites 'redefining what it means to be cool' - including a nepo baby actress and a model \n\nJack Osbourne reveals the real reason why his late father Ozzy famously bit the head off a DOVE as he leaves campmates speechless\n\nLainey Wilson takes the plunge in a daring teal jumpsuit alongside glam Megan Moroney and Elizabeth Hurley at the CMA Awards 2025\n\nI'm A Celeb star Vogue Williams tipped for Jungle success - 10 years after husband Spencer Matthews was axed over steroid use\n\nLeonardo DiCaprio and best pal Tobey Maguire are 'surrounded by female fans' as they party into the early hours at London club\n\nCristiano Ronaldo and fiancée Georgina Rodriguez shock fans by getting their makeup done together\n\nSide by side \n\nMaya Jama 'set to shake up Love Island: All Stars schedule to spend more time with boyfriend Rúben Dias during his \nPremier League season'\n\nCMA Awards 2025 winners: Lainey Wilson shocks as she earns three including top prize of the night on top of hosting duties\n\nStrictly's Vicky Pattison admits she 'knew she was leaving' the moment dance off was announced on It Takes Two\n\nI'm A Celeb's Eddie Kadi is left floundering underwater after dropping 'countless keys' during croc infested challenge\n\nCardi B reveals first photos of newborn son with Stefon Diggs and flashes dazzling ring on wedding finger\n\nTom Hanks makes love for NYC subway official with song... after millionaire star's incognito appearances drove fans wild\n\nMeghan Markle reveals festive preparations for Archie and Lilibet and kisses Harry in glitzy new Netflix trailer\n\nEXCLUSIVEShe has been on the longest-running TV show and is related to Sabrina Carpenter... who is she?\n\nTake a guess \n\nVictoria Beckham fans beg her to release Spice Girls hit as a Christmas no.1 contender as she sings acoustic track with son Cruz, 20, in a rare performance\n\nMore proof Meryl Streep is dating Martin Short as coy couple attend play opening together\n\nPersistent rumours \n\nKarren Brady, 56, reveals her Instagram filter-free complexion as she showcases her dramatic weight loss at The Celebrity Apprentice\n\nLucy Mecklenburgh admits she's feeling 'fragile and sore' and reveals she's in recovery after undergoing surgery for a debilitating health condition\n\nKevin Spacey reveals he is currently homeless and 'living in hotels' as he admits his financial situation is 'not great' \n\nROLAND WHITE reviews Turner: The Secret Sketchbooks: Do the paintings really look like omelettes? Ronnie Wood disagrees\n\nMel C reveals the Spice Girls ARE having reunion talks ahead of 30th anniversary as she makes Good Morning America appearance\n\nI'm A Celeb bosses dismiss claims that a major a sports star was lined up for a place on the show... before 'pulling out of talks at the last minute'\n\nCristiano Ronaldo and fiancée Georgina Rodriguez share tender moment on way to White House dinner with Trump\n\nMotown legend Smokey Robinson, 85, accused of sexual battery by man as two former workers join explosive lawsuit\n\nCristiano Ronaldo splits fans with Donald Trump White House visit as Georgina Rodriguez flaunts $3m ring in Oval Office\n\nBilly Bob Thornton reveals why his sixth marriage to Connie Angland has lasted when his Angelina Jolie union did not\n\nToday's headlines\n\nRevealed: The woman giving Harry and Meghan the royal life they can no longer afford - complete with lavish...\n\nMarried British soldier accused of stabbing young mother to death in Kenya breaks his silence from behind...\n\nTrump turns the screw: Zelensky's agonising choice as President demands he accept humiliating peace deal by...\n\nWhy Spencer Matthews is 'humiliated' by wife Vogue's I'm A Celeb stint: After bombshell 'split', friends...\n\nWhy Strictly's going to be cancelled: It's not just shocking rape, cocaine and vile on-set behaviour...\n\nHow to know if your wardrobe is cringe: Celebrity stylist reveals the items officially deemed 'uncool' (and...\n\nAs new rape allegations rock Strictly Come Dancing, why this could be the show's last dance...\n\nRevealed: The cheap supplement that turbo-charges how well Mounjaro and Wegovy work, keeps you losing weight...\n\nChurches were RIGHT to refuse to help women posing as needy mothers begging for formula who went viral. No...\n\nCharley Webb reveals diagnosis which helps explain her 'cold' personality as she opens up about...\n\nLike our Home Secretary, I fear that if we don't sort out Britain's mass migration crisis, it will trigger a...\n\nThe middle-aged mums making eye-watering sums selling on TikTok shop. Claire makes £9,000 a month. Jo makes...\n\nForbidden book omitted from the Bible reveals a vengeful child Jesus... and exposes why it was kept hidden\n\n'This is how you wanted to die, right?' From a dark corner of the web to a tearful final video, the...\n\nSarah Ferguson 'is considering six-figure offers' to give tell-all interview after being stripped of Duchess...\n\nGladiators star The Giant 'SPLITS from wife Katie and reveals why their relationship ended'\n\nI'm A Celeb's Vogue Williams makes her jungle bikini debut and displays ripped six-pack as fans accuse her...\n\nI'm A Celebrity's Vogue Williams reveals the truth behind her age-defying looks as she complains about...\n\nFrom Matt Smith in dark drama The Death Of Bunny Munro to a Julia Roberts thriller fresh from the cinema,...\n\nEngland vs Australia LIVE - The Ashes Day 2: Australia on the ropes at 129 with just one wicket remaining...\n\nHundreds of children - some as young as 10 - are set to be jabbed with puberty blockers in NHS-backed...\n\nForget something, Usha? Whispers about Vance marriage grow louder as Second Lady ditches her wedding band\n\nHorrifying photo shows what happened after bald eagle dropped CAT onto window of car\n\nDark allegations about Netflix smash Physical Asia revealed: The damaging speculation, 'suspicious' moments...\n\nRachel Reeves' mother Sally just can't stop reading the Daily Mail - and the avid reader loves our puzzles...\n\nSurrender by Thursday: Zelensky insists he will 'not betray Ukraine'... but faces impossible choice after US...\n\nAdam Peaty's sister Bethany survives family fallout as she joins team Ramsay 'after having her head turned...\n\nTravis Kelce speaks out on his retirement plans as NFL legend, 36, enters final months of his Chiefs...\n\nWhich? reveals their Best Buys for Christmas 2025: How to get the best value champagne, mince pies and...\n\nI'm A Celebrity fans accuse Jack Osbourne of 'rage-baiting' the camp amid tense feud with Kelly Brook\n\n'He turned into the Incredible Hulk': Mother-of-two teacher weeps as she recalls moment jealous lover left...\n\nTrump caves to socialist Mamdani and says 'you can call me fascist' in extraordinary concession\n\nHelen Skelton and Gethin Jones make their second cosy red carpet appearance together at the RTS Awards after...\n\nTraitors star Jonny Holloway addresses speculation the 'dates don't add up' as he reveals new details in...\n\nShe has won an Oscar, worked with Johnny Depp and was married to Nicolas Cage, who is she?\n\nCoronation Street star poses beside 'sex slave' speech hate preacher who was banned from the UK\n\nMoment 'sneaky' bag thieves swipe drinker's valuables from right under her nose in mere seconds... but would...\n\nAnger as Sir Keir Starmer to approve Chinese mega-embassy despite MI5 spy warning\n\nConservatives are set to plunge to just 14 seats at next general election, according to new poll - with...\n\nDefence Secretary facing embarrassment after failing to pay full council tax on his second home in...\n\nTopless feminism activists are sexually assaulted in shocking scenes during anti-fascist protest in Spain\n\nEwan McGregor, 54, sells sprawling Los Angeles home for £1.5 million below asking price after moving back to...\n\nAlan Carr shares the REAL reason he broke down in tears during Celebrity Traitors' finale reveal - and the...\n\nHeiress, 18, died horrific death after meeting man called RAIDER... now her ultra-wealthy parents are...\n\nKelly Brook and Jack Osbourne were ALWAYS going to clash on I'm A Celebrity for a simple reason - and it has...\n\nRuby Wax brings back the mean as she deals withering putdown to Tom Read Wilson - just days after I'm A...\n\nAlex Jones reveals she was a bikini-clad contestant on raunchy Magaluf dating show where 'everyone was...\n\nUS issues terrifying NOTAM airspace warning as B-52 nuclear bomber conducts 'attack demo': Venezuela crisis...\n\nAustralia's ruthless media turn on their OWN cricketers and concede Ashes defence is in 'total disarray'...\n\nAnthony Joshua reveals why he said yes to controversial fight with former YouTuber Jake Paul - and it's not...\n\nMORE HEADLINES\n\nBBC loses £1.1billion as millions of homes refuse to pay the licence fee amid 'bias' storm\n\n'We are f***ing mind-blown': Trump's 28-point 'capitulation' peace plan sparks astonishment in Ukraine - as US 'issues threats to agree by Thursday'\n\nSurrender by Thursday: Zelensky insists he will 'not betray Ukraine'... but faces impossible choice after US sets peace deal deadline and Kyiv insider says 28-point plan left them 'f***ing mind-blown'\n\n'He turned into the Incredible Hulk': Mother-of-two teacher weeps as she recalls moment jealous lover left her paralysed after she lost husband to brain tumour\n\nRachel Reeves hints at what caused her notorious Commons tears and concedes she shouldn't have attended Parliament during 'difficult moment'\n\nChristmas rail strikes announced on train operator with workers to walkout on four dates\n\nFull details of Trump's 28-point Ukraine peace plan revealed: Putin 'expected' not to invade more countries, US financial rewards, Russia back in G8, and NATO restrictions among the terms\n\n'Heartbroken' lawyer wins restraining order against former 'soulmate' ex-boyfriend, 50, after he 'repeatedly fat-shamed her' during their relationship and placed a tracker on her car\n\nSecurity ramps up in town awaiting arrival of 600 lone male asylum seekers as residents are told they'll only get '48 hours' notice' before migrants move onto army base\n\nBeaujolais Day gone wild: Swansea adopts France's revered tradition and makes it their own...\n\nDefence Secretary facing embarrassment after failing to pay full council tax on his second home in Westminster\n\nControversial AI-generated Christmas mural that baffled shoppers in leafy west London is torn down after backlash\n\nDistraught grandmother shares photos of young girl who was one of 11 mauled by grizzly bear during school trip\n\nFormer Reform leader in Wales is jailed for 10 years for accepting pro-Russia bribes\n\nEwan McGregor, 54, sells sprawling Los Angeles home for £1.5 million below asking price after moving back to Scotland with wife, 40\n\nChaos at major London rail station as thousands of commuters are shut out in Friday night rush hour\n\nThe subtle sign of King Charles's 'devotion' to Queen Camilla during 'episode three' of their affair\n\nTopless feminism activists are sexually assaulted in shocking scenes during anti-fascist protest in Spain\n\nAfghan small boat migrant admits raping 12-year-old girl in Warwickshire in case that sparked protests and police cover-up row\n\nMoment father is mowed down by e-biker - before rider leaves him lying in the road\n\nWoman, 49, dies in hospital a month after nine-year-old girl found dead at house in Oxfordshire village\n\nRoyal engraver and his wife who buried his father in the garden sue police for arresting them and digging up the body\n\nCombat plane crashes in huge fireball while performing a vertical loop in front of crowd at Dubai Air Show\n\nYachtsman locked up for at least 27 years for stabbing his ex-wife 19 times with scissors she had taken to trim flowers at their late son's grave\n\nMo","summary":"Staying Alive icon Finola Hughes bundled up for a laid-back outing in Los Angeles this past week.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15314735/staying-alive-finola-hughes-rare-john-travolta.html","image":"https://i.dailymail.co.uk/1s/2025/11/21/20/104090551-0-image-a-26_1763757471638.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/21/6727400792002640351/1024x576_MP4_6727400792002640351.mp4","publish_date":"2025-11-22 01:01:53","author":"Christine Rendón,Editor","authors":["Christine Rendón","Editor"],"language":"en","source_country":"GB","sentiment":-0.075},{"id":381414412,"title":"Former Dem senator says Biden's failure on border paved way for President Trump, defends crime crackdown","text":"Former Sen. Joe Manchin, I-W. Va., called out Democratic leadership on Thursday, saying they mismanaged the border to the point Americans re-elected President Donald Trump. Manchin, a former Democrat, spoke with Terry Moran in a candid interview at the Texas Tribune Festival in Austin, Texas. Manchin criticized leadership of both parties, but said the Biden administration shoulders much of the blame for the nation’s border crisis. When Moran asked what Trump had done well, Manchin offered a blunt, yet nuanced answer. \"The border,\" Manchin said. \"Even the way he’s doing it?\" Moran asked. JOE MANCHIN TELLS JON STEWART HOW DC DEMS LOST SUPPORT FROM THEIR WORKING-CLASS VOTERS \"Nope,\" Manchin said. \"You said what’s right. Securing the border was the right thing to do.\" He went on to slam Democrats’ mismanagement of that issue, saying, \"They can't even say we made a mistake. I begged them not to do asylum at the border. We’ve never done that.\" The mismanagement of the border, Manchin said, has given Trump \"all the cover he needs to do all these outrageous things that are happening.\" \"The failure of Joe Biden?\" Moran asked for clarity. \"The failure of the Democratic Party led by Joe Biden,\" he confirmed. Manchin also weighed in on Trump’s \"hardcore on crime\" stance, saying he would respond differently than governors resisting federal aid and labeling it government overreach. JOE MANCHIN LAMENTS BIDEN PRESIDENCY AS A MISSED OPPORTUNITY SQUANDERED BY 'FAR-LEFT' WHO HAD PRESIDENT'S EAR \"When I was governor, if I'd have had a crime-ridden area and I didn't have the resources to take care of it, I'd invite him in,\" Manchin said, referring to Trump’s use of the National Guard. \"Bring the Marines, bring the Air Force, bring everything!\" Moran interjected, \"The federal government isn’t supposed to —\" \"I know that, but I'm saying if – let me make me sure you understand. If I was in that bad a shape and I was in a state I didn't have the resources, okay, or do it, I wouldn't be fighting if he wanted to bring people in.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fox News Digital reached out to former President Biden’s office for comment but did not receive an immediate response.","summary":"Former Democratic Sen. Joe Manchin blames former President Joe Biden&apos;s border failures for giving Trump cover to implement controversial policies.","url":"https://www.foxnews.com/media/former-dem-senator-says-bidens-failure-border-paved-way-president-trump-defends-crime-crackdown","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/12/senator-joe-manchin-1.jpg","video":null,"publish_date":"2025-11-22 01:00:48","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.43},{"id":381413798,"title":"Star-studded sangeet marks ongoing wedding festivities of NRI industrialist’s daughter in Udaipur","text":"Udaipur, Nov 22 (PTI) The high-profile wedding celebrations of US-based industrialist Raju Ramalinga Mantena's daughter continued in full swing here as a star-studded sangeet ceremony lit up the Manak Chowk of City Palace.Karan Johar and Sophie Choudry hosted the glittering event on Friday night, which saw several Bollywood celebrities take the stage.Ranveer Singh energised the crowd and even made Donald Trump Jr. and his girlfriend join him on the dance floor, according to people present at the venue.Kriti Sanon performed to her hit number 'Param Sundari', while Jacqueline Fernandez danced to 'Lal Chhadi'. Varun Dhawan and Shahid Kapoor also performed at the sangeet, drawing loud cheers from the guests, according to the wedding management firm.The bride, Netra Mantena, will marry NRI Vamsi Gadiraju, with events scheduled from November 21 to 24.US President's son Donald Trump Jr. had arrived in Udaipur on Friday night and travelled to The Leela Palace amid tight security.Several international personalities, including singer-actor Jennifer Lopez, are expected to join the celebrations.Bollywood actors are among the 600 invitees for the high-profile wedding.Preparations have transformed The Leela Palace into a lavish red-themed venue with massive floral installations, grand chandeliers and plush seating. Other events will take place at Manek Chowk, Zenana Mahal and Jagmandir.Security remains tight across Udaipur. Dutch DJ-producer Tiesto performed at The Leela Palace on Thursday night, while Rajasthani folk artistes also showcased cultural performances.The wedding will take place at Jagmandir on the morning of November 23, followed by a reception in the evening. Guests will depart on chartered flights from Dabok airport on November 24.","url":"https://www.livemint.com/focus/starstudded-sangeet-marks-ongoing-wedding-festivities-of-nri-industrialist-s-daughter-in-udaipur-11763773179270.html","image":"https://www.livemint.com/lm-img/img/2024/12/10/1600x900/logo/news2_1733829221757_1733829242164.jpg","video":null,"publish_date":"2025-11-22 00:59:38","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":0.563},{"id":381414594,"title":"US warns airlines of potential hazards when flying over Venezuela","text":"WASHINGTON, (Reuters) – The U.S. Federal Aviation Administration warned major airlines today of a “potentially hazardous situation” when flying over Venezuela and urged them to exercise caution.\n\nThe FAA notice cited the “worsening security situation and heightened military activity in or around Venezuela” and said threats could pose risks for aircraft at all altitudes.\n\nThere has been a massive American military buildup in the region in recent months, including the U.S. Navy’s largest aircraft carrier, at least eight other warships, and F-35 aircraft.\n\nThe administration of U.S. President Donald Trump has bombed boats allegedly carrying drugs that have departed from the shoreline of Venezuela and other Latin American countries.\n\nDirect flights by U.S. passenger or cargo carriers to Venezuela have been suspended since 2019 but some U.S. airlines fly over the country for some South American flights.\n\nAmerican Airlines AAL.O said today it had stopped overflying Venezuela in October. Delta Air Lines DAL.N said it had stopped flying over Venezuela “a while ago.” United Airlines UAL.O did not immediately comment.\n\nThe order requires U.S. airlines to provide the FAA with at least 72 hours advance notice of planned flights but stopped short of prohibiting flights over the country.\n\nThe FAA said since September there has been an increase in Global Navigation Satellite System interference in Venezuela, which in some cases caused lingering effects throughout a flight, as well as “activity associated with increasing Venezuela military readiness.”\n\n“Venezuela has conducted multiple military exercises and directed the mass mobilization of thousands of military and reserve forces,” the FAA said, adding that at no point had Venezuela expressed an intent to target civil aviation.\n\nThe agency said the Venezuelan military possessed advanced fighter aircraft and multiple weapons systems capable of reaching or exceeding civil aircraft operating altitudes, and there was potential low-altitude risk from air defense systems and anti-aircraft artillery.\n\nThe FAA said it will continue to monitor the risk environment for U.S. civil aviation operating in the region.","summary":"WASHINGTON,  (Reuters) &#8211; The U.S. Federal Aviation Administration warned major airlines today of a &#8220;potentially hazardous situation&#8221; when flying over Venezuela and urged them to exercise caution.\n\n\nThe article US warns airlines of potential hazards when flying over Venezuela appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/11/21/news/regional/us-warns-airlines-of-potential-hazards-when-flying-over-venezuela/","image":"https://www.stabroeknews.com/images/2025/11/us-airlines-scaled.jpg","video":null,"publish_date":"2025-11-22 00:57:18","author":"Staff Editor","authors":["Staff Editor"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.457},{"id":381412828,"title":"Supreme Court Blocks Order That Found Texas Congressional Map Is Likely Racially Biased","text":"WASHINGTON (AP) — The U.S. Supreme Court on Friday temporarily blocked a lower court court ruling that found Texas’ 2026 congressional redistricting plan likely discriminates on the basis of race.\n\nThe order signed by Justice Samuel Alito will remain in place at least for the next few days while the court considers whether to allow the new map favorable to Republicans to be used in the midterm elections.\n\nThe court’s conservative majority has blocked similar lower court rulings because they have come too close to elections.\n\nAlito handles emergency appeals from Texas.\n\nTHIS IS A BREAKING NEWS UPDATE. AP’s earlier story follows below.\n\nWASHINGTON (AP) — Texas on Friday asked the Supreme Court for an emergency order to be allowed to use a congressional redistricting plan pushed by President Donald Trump that is favorable to Republicans in the 2026 elections despite a lower court ruling that it likely discriminates on the basis of race.\n\nThe state is calling on the high court to intervene to avoid confusion as congressional primary elections approach in March. The justices have blocked past lower-court rulings in congressional redistricting cases, most recently in Alabama and Louisiana, that came several months before elections.\n\nTexas redrew its congressional map in the summer as part of Trump’s efforts to preserve a slim Republican majority in the House in next year’s elections, touching off a nationwide redistricting battle. The new redistricting map was engineered to give Republicans five additional House seats, but a panel of federal judges in El Paso ruled 2-1 Tuesday that the civil rights groups that challenged the map on behalf of Black and Hispanic voters were likely to win their case.\n\nIf the ruling holds for now, Texas could be forced to hold elections next year using the map drawn by the GOP-controlled Legislature in 2021 based on the 2020 census.\n\nTexas was the first state to meet Trump’s demands in what has become an expanding national battle over redistricting. Republicans drew the state’s new map to give the GOP five additional seats, and Missouri and North Carolina followed with new maps adding an additional Republican seat each. To counter those moves, California voters approved a ballot initiative to give Democrats an additional five seats there.\n\nThe redrawn maps are facing court challenges in California, Missouri and North Carolina.\n\nThe Supreme Court is separately considering a case from Louisiana which could further limit race-based districts under Section 2 of the Voting Rights Act. It’s not entirely clear how the current round of redistricting would be affected by the outcome in the Louisiana case.","url":"https://www.huffpost.com/entry/election-2026-redistricting-texas_n_6921096de4b0d31c0a7a79b6?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6921096f170000443aa90f6d.jpeg?cache=Jfcv7OaUdQ&ops=1778_1000","video":null,"publish_date":"2025-11-22 00:55:31","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.27},{"id":381413268,"title":"Morning Digest: COP30 draft text skips mention of fossil fuel use; Nitish Kumar hands over Home Ministry to BJP Deputy CM Samrat Choudhary, and more","text":"COP30 draft text skips mention of fossil fuel use\n\nWith the fires at the venue doused, new flashpoints emerged early on Friday (November 21, 2025) — officially, the last day of the climate talks in Brazil’s Belem — after a draft text skipped mention of fossil fuels. The Conference of Parties (COP) proceedings usually conclude with a ‘cover text’ or a consensus political statement issued by the COP Presidency, in this case led by Brazilian diplomat Andrei Lago, which lays out the united resolution by Parties (countries signatory to Paris Agreement) to take action on climate change.\n\nNitish gives up key portfolios to BJP; Deputy CM to hold Home department\n\nFor the first time in his two decades as Bihar Chief Minister, Nitish Kumar has given up the Home department and other key portfolios to his allies in the Bharatiya Janata Party, which emerged as the single largest party with 89 seats in the State Assembly election earlier this month. Mr. Kumar allocated portfolios to 26 Ministers on Friday (November 21, 2025), of which 46% have criminal records, while 88% are millionaires.\n\nPM Modi meets Australian counterpart, discusses cooperation in defence & security, critical minerals, trade\n\nPrime Minister Narendra Modi on Friday (November 21, 2025) met his Australian counterpart Anthony Albanese in Johannesburg and the two leaders took stock of progress in cooperation in diverse areas, including defence and security, critical minerals, trade & investment and people-to-people ties. PM Modi met Mr. Albanese hours after he arrived in South Africa to attend the G20 Leaders’ Summit.\n\nIAF’s Tejas fighter jet crashes at Dubai Air Show; pilot killed\n\nAn Indian Air Force (IAF) Tejas fighter jet crashed during the Dubai Air Show on Friday (November 21, 2025), claiming the life of the pilot, Wing Commander Namansh Syal. The accident occurred around 2 p.m. local time at the Al Makhtoum International Airport, the venue of the air show. Viral visuals on social media show the aircraft spiralling out of control just above the ground, igniting on impact, and sliding for a short distance before being engulfed in flames.\n\nUmar Khalid has ‘scant regard’ for Constitution, will quote Article 21 only for bail, Delhi Police tell Supreme Court\n\nThe Delhi Police on Friday vehemently objected to pleas for bail filed by former Jawaharlal Nehru University student leader Umar Khalid and others accused under the Unlawful Activities (Prevention) Act in the 2020 Delhi riots ‘larger conspiracy’ case, claiming that they only cite the Constitution for the sake of getting bail.\n\nValley-wide crackdown on hospital lockers, car sellers continue\n\nThe J&K Police on Friday (November 21, 2025) continued with the Valley-wide crackdown on hospital lockers, fertiliser shops and car sellers, in the wake of the Red Fort car blast in New Delhi that left 15 dead on November 10. Meanwhile, a hideout of terrorists was busted in north Kashmir’s Handwara. \n\nBJP slams Congress for awarding peace prize to Michelle Bachelet\n\nThe Bharatiya Janata Party (BJP) on Friday (November 21, 2025) criticised the Congress, describing it as an “army of traitors”, after its parliamentary party chairperson Sonia Gandhi presented the Indira Gandhi Prize for Peace, Disarmament, and Development for 2024 to Michelle Bachelet, the former President of Chile and former United Nations High Commissioner for Human Rights, on Wednesday (November 19).\n\nPAC questions FSSAI for unchecked sale of adulterated food items\n\nThe Parliament’s Public Accounts Committee (PAC) headed by senior Congress leader K.C. Venugopal on Friday (November 21, 2025) held a meeting with officials from the Ministry of Health and Family Welfare and the Food Safety and Standards Authority of India (FSSAI) to discuss a range of issues related to food safety and quality control.\n\nTrump vows ‘we are going to be helping’ New York Mayor-elect Mamdani\n\nMonths of sniping melted away Friday (November 21, 2025) as New York’s incoming Mayor Zohran Mamdani and U.S. President Donald Trump were all smiles at a White House meeting — promising to set aside their feud and cooperate on the city’s future. “We’re going to be helping him to make everybody’s dream come true: having a strong and very safe New York,” Mr. Trump said.\n\nTrump says Ukraine’s Zelenskyy will have to approve U.S.-backed peace plan\n\nUkrainian President Volodymyr Zelenskyy will have to like a U.S.-backed peace plan to halt Russia’s invasion and ultimately approve it, U.S. President Donald Trump told reporters on Friday (November 21, 2025). Mr. Trump said the approaching winter, the mounting death toll and repeated attacks on Ukrainian energy plants underscored the urgency of ending the war.\n\nLebanon ready to negotiate to reach an agreement that would end Israeli strikes, President says\n\nLebanon is ready to negotiate to reach an agreement that would end Israeli strikes on the country and lead to Israeli withdrawal from five border hills it has occupied since the Israel-Hezbollah war ended last year, President Joseph Aoun said Friday (November 21, 2025). In a televised speech marking Independence Day, Mr. Aoun added that Lebanese troops are ready to deploy in all points from where Israeli troops withdraw.\n\nU.N. chief Guterres urges G20 to use power to ease global suffering\n\nThe G20 nations hold enormous potential to ease suffering and set the world on a more peaceful course, U.N. Secretary-General Antonio Guterres has said, urging the bloc to lead the action required. Mr. Guterres made the remarks at a media briefing shortly after arriving in Johannesburg on Friday (November 21, 2025) to participate in the G20 Leaders’ Summit for the next two days.\n\nAdvantage South Africa as Pant’s men play catch up\n\nWhile the journey into the unknown can often be liberating and exciting, India, trailing 0-1 after the crushing loss in Kolkata, will enter the contest with some trepidation. Under a new captain, Rishabh Pant, who is standing in for the injured Shubman Gill, the last thing the home side would want is to add more variables to the equation. And there are quite a few in this match.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/morning-digest-november-22-2025/article70310220.ece","image":"https://th-i.thgim.com/public/incoming/rs95q0/article70308288.ece/alternates/LANDSCAPE_1200/Climate_COP30_48899.jpg","video":null,"publish_date":"2025-11-22 00:53:40","author":"The Hindu Bureau","authors":["The Hindu Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":0.116},{"id":381411248,"title":"Insecurity: US defence chief asks FG to be decisive","text":"The United States Defence Secretary, Pete Hegseth, has called on the Nigerian government to take decisive steps to curb violence targeting Christians.\n\nHegseth made the call during a meeting with Nigeria’s National Security Adviser, Nuhu Ribadu.\n\nAccording to the Pentagon, Hegseth used the meeting, held on Thursday, to express concern over the rising attacks in Nigeria.\n\nThe Defence Secretary wrote on his X handle on Friday,\n\n“Yesterday (Thursday), I met with Nigeria’s National Security Advisor and his team to discuss the horrific violence against Christians in their country. Under @POTUS leadership, DOW is working aggressively with Nigeria to end the persecution of Christians by jihadist terrorists.”\n\nPentagon spokesman Sean Parnell said in a statement that Hegseth urged Nigeria to “take both urgent and enduring action to stop violence against Christians,” adding that Washington seeks closer cooperation with Abuja “to deter and degrade terrorists that threaten the United States.”\n\nThe meeting, held at the Pentagon, followed recent remarks by US President Donald Trump, who claimed that Christianity was “facing an existential threat” in Nigeria.\n\nTrump warned that if the Federal Government failed to stop the killings, the United States could deploy military forces to Nigeria.\n\nMeanwhile, US Congressman Riley Moore disclosed on Wednesday night that he met with the Nigerian delegation led by Ribadu to discuss what he described as the intensifying persecution of Christians and rising terrorist activity.\n\nHe said the talks, held in Washington, DC, were “frank, honest, and productive,” focusing on counterterrorism collaboration, security assistance, and the protection of vulnerable communities.\n\nThe Nigerian delegation included senior government and security officials: Bianca Ojukwu, Minister of State for Foreign Affairs; Kayode Egbetokun, Inspector General of Police; Chief Lateef Fagbemi, SAN, Attorney General of the Federation; General Olufemi Olatunbosun Oluyede, Chief of Defence Staff; and Lt. Gen. Emmanuel Undiendeye, Chief of Defence Intelligence, among others.","summary":"The US Defence Secretary urges Nigeria&#8217;s government to take decisive action to curb the rising violence and persecution of Christians in the country.\n\nRead More: https://punchng.com/insecurity-us-defence-chief-asks-fg-to-be-decisive/","url":"https://punchng.com/insecurity-us-defence-chief-asks-fg-to-be-decisive/","image":"https://cdn.punchng.com/wp-content/uploads/2016/10/17155511/punchlogo.png","video":null,"publish_date":"2025-11-22 00:48:47","author":"Punch Newspapers,Us President Donald","authors":["Punch Newspapers","Us President Donald"],"language":"en","category":"politics","source_country":"ng","sentiment":0.01},{"id":381411246,"title":"Ex-envoy urges Tinubu to tackle insecurity","text":"A former Nigerian Ambassador to the Philippines, Yemi Farounbi, has urged President Bola Tinubu to fulfil his promise to provide security, as stated during his inaugural address on May 29, 2023.\n\nHe noted that worsening insecurity and emerging external threats demand immediate and decisive action.\n\nIn a statement shared with Saturday PUNCH, the ex-envoy said Tinubu made several commitments upon assuming office, some of which were implemented immediately, including the removal of fuel subsidy and the unification of foreign exchange rates.\n\nWhile these measures earned the President commendations, the former ambassador said they also triggered severe inflation and hardship for ordinary Nigerians.\n\nHe acknowledged that later reforms, such as tax restructuring, are already receiving praise, though their real effects will only become clear in 2026.\n\nHowever, he stressed that current realities — particularly rising insecurity and global uncertainties reportedly linked to threats by the US President, Donald Trump — make it critical for Tinubu to prioritise the safety of citizens.\n\nQuoting Tinubu’s inaugural pledge that “we are here to mend and heal this nation, not to tear and injure it,” the ex-envoy said many Nigerians were still waiting to see that promise materialise as communities face daily killings, kidnappings and displacement.\n\nHe also referenced the President’s assurance that Nigeria would remain “the indispensable home for each and every one of us,” urging the administration to demonstrate this in practical terms to citizens living under constant threat from ISWAP, ISGS and other militant groups who do not recognise Nigeria’s sovereignty. \n\nFarounbi reminded the President of his vow to “defend our nation from terror and all forms of criminality that threaten the peace and stability of our country,” noting that Nigerians had hoped this would finally bring an end to Boko Haram and other violent groups.\n\nThe ex-envoy expressed disappointment that the promised reform of Nigeria’s “security doctrine and architecture” has yet to materialise.\n\nHe argued that Nigeria’s size, population and diversity require more than a single centralised police force, advocating the creation of state and local government police formations as part of a decentralised security structure.\n\nAccording to him, many Nigerians expected President Tinubu — who showed political courage in eliminating fuel subsidy — to apply the same resolve in restructuring the country’s security framework, despite resistance from entrenched interests within existing agencies.\n\nHe urged the President to “restudy his charter with Nigerians” and recommit to the security reforms outlined in his inaugural speech, emphasising that continuing the same outdated approaches will not yield different results.\n\n“Many Nigerians believe that the promised security architecture will provide for decentralisation, devolution and indeed localisation of security formations.\n\n“We expect resistance from existing formations which will desperately protect their empires. But we believe and trust in the courage that PBAT used in withdrawing fuel subsidy will override those empire-protecting resistance.”\n\nThe ex-envoy said Nigerians still trust that President Tinubu can deliver on his promises, but insisted that the time for action is now.","summary":"A former ambassador urges President Tinubu to tackle insecurity, fulfilling his inaugural promise amid rising threats and advocating for security reform.\n\nRead More: https://punchng.com/ex-envoy-urges-tinubu-to-tackle-insecurity/","url":"https://punchng.com/ex-envoy-urges-tinubu-to-tackle-insecurity/","image":"https://cdn.punchng.com/wp-content/uploads/2019/03/31080939/Yemi-Farounbi.jpg","video":null,"publish_date":"2025-11-22 00:48:47","author":"Muhammed Lawal,Punch Newspapers","authors":["Muhammed Lawal","Punch Newspapers"],"language":"en","category":"politics","source_country":"ng","sentiment":0.007},{"id":381411492,"title":"Trump and Mamdani hope for positive relationship after ‘productive’ meeting  - Bahamas Spectator –","text":"United States President Donald Trump and New York City Mayor-elect Zohran Mamdani have held talks in the White House, expressing their hope for a productive and cordial relationship despite their history of mutual criticism.\n\nSpeaking to the press after their discussion on Friday, Trump praised Mamdani – the Muslim politician whom he once tarred as a “jihadist” and threatened to strip him of his US citizenship – for his successful campaign and emphasis on cost-of-living issues.\n\n“We’ve just had a great meeting, a really productive meeting. We have one thing in common: we want this city of ours that we love to do very well,” said Trump, who grew up in New York, adding that Mamdani had run an “incredible race” and beat his rivals “easily”.\n\n“I appreciated the meeting with the president, and as he said, it was a productive meeting focused on a place of shared admiration and love, which is New York City,” responded Mamdani, saying he discussed issues in areas such as rent, utilities and groceries.\n\nMamdani, a democratic socialist who embraced New York’s status as a community made up of people from around the world and offered a firm defence of Palestinian rights, is politically at odds with Trump, whose nativist politics have depicted immigrants as a dangerous internal threat and previously pushed for a ban on Muslims entering the US.\n\nAsked about areas of disagreement with Trump, such as immigration enforcement, Mamdani said he hoped to work together towards shared goals despite their differences.\n\nHe referred to a video he shared in November 2024, in which he discussed issues such as affordability and US involvement in conflicts abroad with Trump voters after the 2024 presidential election. Mamdani said he now hopes to find common ground on ending US “forever wars” and bringing down the cost of living.\n\n“I think both President Trump and I are very clear about our positions and our views. And what I really appreciate about the president is the meeting that we had focused not on places of disagreement, of which there are many, and focused on the shared purpose that we have of serving New Yorkers,” said Mamdani.\n\n“That’s something that could transform the lives of 8.5 million people who are currently under a cost-of-living crisis, with one in four people living in poverty,” he said.\n\nWith polls showing growing concerns over the state of the US economy, Trump has recently spoken positively about Mamdani’s focus on cost-of-living issues, despite previous acrimony.\n\n“He said a lot of my voters actually voted for him,” Trump told reporters. “And I’m ok with that.”","url":"https://bahamasspectator.com/trump-and-mamdani-hope-for-positive-relationship-after-productive-meeting/","image":"https://bahamasspectator.com/app/uploads/2025/11/AFP__20251121__84T33D9__v1__HighRes__UsPoliticsTrump-1763762754-KBT5y7.jpg","video":null,"publish_date":"2025-11-22 00:47:37","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":0.353},{"id":381411488,"title":"BBC board member Shumeet Banerji resigns  - Bahamas Spectator – Bahamas &amp; Caribbean News, Travel &amp;","text":"Shumeet Banerji has resigned from the BBC board and criticised governance issues at the organisation, the latest blow to the broadcaster weeks after its director general quit.\n\nThe BBC confirmed Banerji’s departure on Friday, saying he stepped down only weeks before the end of his four-year term.\n\nAccording to BBC News, Banerji said in his resignation letter that he was unhappy about governance issues at the organisation.\n\nHe also said he had not been consulted about key developments surrounding the abrupt exits of director general Tim Davie and BBC News chief executive Deborah Turness, BBC News reported.\n\nBoth stepped down on November 9 after mounting criticism of the broadcaster’s handling of political coverage, including the editing of a Donald Trump speech delivered on January 6, 2021, shortly before his supporters stormed the United States Capitol.\n\nThe BBC issued an apology on November 13 for how its investigative programme Panorama edited the footage. However, it insisted there was “no legal basis” for Trump to sue for defamation.\n\nThe dispute focuses on Panorama’s documentary, Trump: A Second Chance?, broadcast in October 2024, just days before Trump secured re-election.\n\nThe film stitched together two separate lines from Trump’s January 6 address, almost an hour apart, creating the impression he urged supporters to “fight like hell” while heading towards the Capitol.\n\nTrump and his allies say the sequence was misleading and stripped away crucial context from the speech.\n\nThey argue that Trump also told the crowd “to peacefully and patriotically make your voices heard” and encouraged supporters to “cheer on our brave senators and Congressmen and women”. The edited version, they say, suggested a more direct incitement to violence.\n\nThe scandal has intensified scrutiny of the BBC at a moment when the broadcaster is already grappling with accusations of internal bias, fuelled by a leaked internal memo.","url":"https://bahamasspectator.com/bbc-board-member-shumeet-banerji-resigns/","image":"https://bahamasspectator.com/app/uploads/2025/11/AP25316389227050-1763388954-GsWVAE.jpg","video":null,"publish_date":"2025-11-22 00:47:36","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"bs","sentiment":-0.588},{"id":381411988,"title":"Zelenskyy says US plan means Ukraine loses 'dignity' — or an ally","text":"KYIV, Ukraine — President Volodymyr Zelenskyy on Friday pushed back against a US plan to end the war in Ukraine, while Russian leader Vladimir Putin welcomed the proposal that includes many of his hardline demands.With President Donald Trump giving Ukraine less than a week to sign, Zelenskyy pledged to work to ensure any deal would not 'betray' Ukraine's interests, while acknowledging he risked losing Washington as an ally.Putin said the blueprint could 'lay the foundation' for a final peace settlement, but threatened more land seizures if Ukraine walked away from negotiations.Ukraine faces one of the most challenging moments in its history, Zelensky said in an address to the nation, adding that he would propose alternatives to Trump's 28-point plan.Kyiv and its European allies were startled by the proposal — which would force Ukraine to give up land, cut its army and pledge never to join NATO.Russia, meanwhile, would gain territory, be reintegrated into the global economy and rejoin the G8, under a draft of the plan, seen by AFP.'He'll have to like it''Ukraine and its European allies are still living under illusions and dreaming of inflicting a strategic defeat on Russia on the battlefield,' Putin said in a televised meeting with his security council.If Kyiv walks away, Russia's claimed recent capture of Ukrainian city Kupiansk 'will inevitably be repeated in other key areas of the front line,' Putin added.The Ukrainian army says Kupiansk remains under Kyiv's control.Zelensky on Friday recalled how he marshalled Kyiv's response to the Russian invasion in February 2022, saying 'we did not betray Ukraine then, we will not do so now.''I will present arguments, I will persuade, I will propose alternatives,' he added.Trump said at the White House that next Thursday was an 'appropriate time' to set for Zelensky to agree a deal, but he indicated it could be flexible.'He'll have to like it, and if he doesn't like it, then you know, they should just keep fighting,' Trump told reporters at the White House. 'At some point he's going to have to accept something.'Zelensky said after talks with US Vice President JD Vance that Ukraine continues to 'respect' Trump's desire to end the war.He also held an emergency call with the German, French and British leaders as Europe, cut out of the process, scrambled to respond.Army cutsThe Ukrainian leader plans to speak directly to Trump soon, his office has said.The US plan envisages recognizing territories controlled by Moscow as 'de-facto' Russian, with Kyiv pulling troops out of parts of the Donetsk region.Kyiv would also cap its army at 600,000, rule out joining NATO and have no NATO troops deployed to its territory.In return, Ukraine would get unspecified 'reliable security guarantees' and a fund for reconstruction using some Russia assets frozen in foreign accounts.'Right now is one of the most difficult moments in our history,' Zelenskyy said in his address.'The pressure on Ukraine is one of the hardest. Ukraine may face a very difficult choice: either the loss of dignity or the risk of losing a key partner,' he said, warning of a break with Washington.In a call with Zelenskyy, key allies Britain, France and Germany stressed their 'unwavering and full support for Ukraine on the path to a lasting and just peace,' said a joint statement after the talks.The United States bypassed Europe with the plan, and many European governments were unsettled by the prospect of the war ending on Moscow's terms.'Flexibility'Putin, who treated Trump's proposal more favorably, said an early version of the plan was discussed with the US president even before they met in Alaska on August 15.There, Putin told Trump that Russia was ready 'to show flexibility' in resolving the conflict, without elaborating how, according to the Kremlin chief's televised meeting.Putin added that Russia is ready for detailed discussion of Trump's plan. Otherwise, it will continue the war.Trump's administration has previously rejected accusations that it worked on the proposal with Moscow.The White House gave Zelenskyy until November 27, when the United States celebrates Thanksgiving, to decide on what it called a 'good plan' for Russia and Ukraine.In Kyiv, people were divided over whether Ukraine should engage with the proposal and negotiate a better position, or reject it as a capitulation.Yanina, a 41-year-old seamstress, predicted the proposal will lead nowhere and the war will continue.'Neither us nor Russia will make concessions,' she said.","url":"https://www.manilatimes.net/2025/11/22/world/americas-emea/zelenskyy-says-us-plan-means-ukraine-loses-dignity-or-an-ally/2229651","image":"https://www.manilatimes.net/manilatimes/uploads/images/2025/11/22/838981.jpg","video":null,"publish_date":"2025-11-22 00:47:00","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":-0.247},{"id":381411678,"title":"Trump and NYC's new socialist mayor call for Con Edison to lower rates, causing stock drop","text":"President Donald Trump on Friday hosted New York City Mayor-elect Zohran Mamdani at the White House where they discussed affordability issues and called for lower electricity prices in the city, which caused a major utility&apos;s stock to sink. Trump and Mamdani, a democratic socialist, spoke to reporters in the Oval Office following their meeting and said that they intend to focus on addressing affordability issues, which Mamdani noted helped increase Trump&apos;s level of support in New York City and was something his campaign tapped into. \"When we asked those New Yorkers who had voted for the president, and when we saw an increase in his numbers in New York City, that came back to the same issue – cost of living, cost of living, cost of living. They spoke about the cost of rent, the cost of Con Ed, the cost of childcare,\" Mamdani explained. Consolidated Edison, commonly known as Con Ed, is the main utility provider in New York City and has over 3 million customers, and President Trump echoed the need to reduce energy bills facing New Yorkers – saying there need to be talks with the company about lowering prices. TRUMP REVEALS &apos;ONE THING IN COMMON&apos; HE HAS WITH MAMDANI AFTER OVAL LOVE FEST \"We talked about Con Edison. We have to work a little bit on getting the prices, because you know, we&apos;ve gotten fuel prices way down, but it hasn&apos;t shown up in Con Edison,\" Trump said. \"We&apos;re going to have to talk to them, you know, if we&apos;re sending them fuel at a much lower price than it was a year ago, which is true, we have to get Con Edison to start lowering their rates,\" he added. VOTERS EXPRESS ECONOMIC WORRIES OVER INFLATION AS COSTS RISE, FOX NEWS POLL FINDS Con Edison told FOX Business the company \"powers the economic engine of our country by delivering the most reliable energy to more than 9 million people who live, work, and travel through New York City every day.\" \"We recognize affordability is a critical issue and work every day to balance the investments needed for resilience and reliability with customer costs. We welcome the opportunity to partner with the Mayor-elect on solutions that make New York affordable for everyone,\" the company added. Following Trump and Mamdani&apos;s comments, Con Ed shares sank to close the week. Con Ed stock opened Friday&apos;s session at $101.48 and hit a high of $103.28 – but it sank to a low of $99.55 following those remarks. The stock closed at $100.16, down 0.78% on Friday. MIDDLE-INCOME AMERICANS PESSIMISTIC ABOUT THEIR FINANCIAL FUTURE AMID PERSISTENT INFLATION, ANALYSIS SHOWS For the year, shares are up about 13%. New York City voters elected Zohran Mamdani in early November, when he defeated independent challenger and former New York Gov. Andrew Cuomo as well as Republican nominee Curtis Sliwa. The Fox News Voter Poll found that while a 59% majority of New York City voters felt their family&apos;s financial situation was holding steady, 22% felt that they were falling behind and just 17% felt they were getting ahead – with Mamdani leading among those holding steady or falling behind. Voters said that the cost of living was the most important issue facing New York City, with 55% of respondents to the Fox News Voter Poll focusing on pocketbook issues, with the next closest issue being crime at 23%. GET FOX BUSINESS ON THE GO BY CLICKING HERE Among voters who cited the cost of living as New York City&apos;s most important issue, 66% said they voted for Mamdani – more than double the 29% who backed Cuomo.","summary":"Lowering Con Ed’s NYC electricity prices were a topic of discussion between President Donald Trump and New York City Mayor-elect Zohran Mamdani during their Oval Office meeting.","url":"https://www.foxbusiness.com/politics/trump-nycs-new-socialist-mayor-call-con-edison-lower-rates-causing-stock-drop","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/11/donald-trump-zohran-mamdani-white-house.jpg","video":null,"publish_date":"2025-11-22 00:46:11","author":"Eric Revell","authors":["Eric Revell"],"language":"en","source_country":"us","sentiment":-0.159},{"id":381411254,"title":"Killings: MBF president knocks northern govs","text":"National President of the Middle Belt Forum, Dr. Bitrus Pogu, has urged the Federal Government to seek the intervention of the United States to confront banditry and terror attacks gripping some parts of the country.\n\nThe MBF president also faulted northern governors, accusing them of downplaying and covering up the attacks, especially those targeting Christians, instead of taking decisive action.\n\nPogu’s warning comes amid growing public concern over the surge in killings and kidnappings that have engulfed some northern communities in recent weeks, leaving dozens dead and many more displaced.\n\nIn the latest attack, three people were killed and about 35 others kidnapped at the Christ Apostolic Church, Oke Isegun, in Eruku, Ekiti Local Government Area of Kwara State on Tuesday, according to police and multiple eyewitness accounts.\n\nThe Kwara attack came barely 24 hours after bandits struck the Government Girls Comprehensive Senior Secondary School, Maga, in Danko/Wasagu Local Government Area of Kebbi State, killing the school’s Vice Principal, Hassan Makuku, and abducting 26 students.\n\nThe Federal Government, through the Secretary to the Government of the Federation, George Akume, on Wednesday, blamed the renewed terror attacks on recent remarks by the United States.\n\nThe SGF said President Donald Trump’s posts alleging “Christian genocide” in Nigeria and threatening to deploy US troops had “inadvertently emboldened opportunistic violent groups” now seeking to justify attacks on soft targets.\n\nSpeaking with Saturday PUNCH, Pogu said northern governors, not the US, should be blamed for the resurgent terror.\n\nHe argued that, despite not having direct control over the military or police, the governors could influence civil defence forces and other armed organisations to change the speed and effectiveness of responses to attacks.\n\nPogu said instead of admitting their faults, some government officials have been pretending and denying the genocidal claims out of fear of the United States.\n\nThe MBF President cautioned that if the situation escalates to a point where the US intervenes forcefully, the consequences could be devastating. \n\n“The best thing to do is for them to own up that these things are happening and that there is genocide—attacks deliberately against Christian organisations and settlements in their areas. They should plead to the Federal Government to partner with America so that these issues can be resolved.\n\n“The US know where these people are. They have satellites that can even identify you—how you look, where you are going, and your movement. So let the governors not pretend and think that the Americans don’t know,” Pogu said.\n\nHe also warned the governors against imposing their views on others under the guise of religion, stating that any attempt to enforce Sharia or other practices on unwilling populations would only bring trouble.\n\nThe MBF President also took a swipe at the Benue State Governor, Hyacinth Alia, for denying that an ethnic genocide is occurring in the state.\n\nAlia had, at a public function on Wednesday, stated that while insecurity remains a challenge, it should not be misrepresented as the targeted extermination of any group.\n\nPogu, however, faulted the governor’s stance, accusing him of serving the interests of political godfathers.\n\n“If Alia, because of serving the interests of some political godfathers and his pocket, can come out and say there is no genocide when hundreds of his people are being killed—and they are Christians, and their churches have been burnt —then I’m sorry for him,” Pogu said.\n\nHe added that, since the governor claimed to be a reverend father, he must change his stance and acknowledge the truth.\n\nPogu compared the situation in Benue to attacks in Chibok by Boko Haram, noting that while several villages in Chibok were targeted, leaving homes and churches burned and several people abducted, the scale of violence in Benue was far worse.\n\n“What is happening in Chibok is too small compared to what is happening in Benue. The people who were killed at Yelwata, the majority of them—more than 80 per cent—are Tiv people, and the former governor had to impose the anti-open grazing law to reduce the killing.\n\n“Even when the people were sent to IDP camps, these killers went after them in the camps. And for him as a governor to say there is no genocide, I’m sorry for him,” Pogu said.","summary":"The Middle Belt Forum president criticizes northern governors for downplaying terror attacks, urging the FG to seek US intervention to curb Nigerian insecu\n\nRead More: https://punchng.com/killings-mbf-president-knocks-northern-govs/","url":"https://punchng.com/killings-mbf-president-knocks-northern-govs/","image":"https://cdn.punchng.com/wp-content/uploads/2021/01/28132541/Dr-Bitrus-Pogu.jpg","video":null,"publish_date":"2025-11-22 00:45:02","author":"Imoleayo Oyedeyi,Punch Newspapers","authors":["Imoleayo Oyedeyi","Punch Newspapers"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.239},{"id":381412086,"title":"Very productive meeting: Trump praises Mamdani in warm welcome to White House","text":"New York/Washington, Nov 22 (PTI) US President Donald Trump said he had a “very productive meeting” with New York City Mayor-elect Zohran Mamdani and expressed confidence “he can do a very good job”, as the two adopted a mutually warm tone after months of engaging in bitter rhetoric against each other.\n Mamdani flew to Washington DC for his first meeting with Trump in the White House Friday. Trump said he “enjoyed” the meeting, which he described as “great.” “We’ve just had a great meeting, a really good, very productive meeting. We have one thing in common, we want this city of ours that we love to do very well. I wanted to congratulate the Mayor. He really ran an incredible race against a lot of smart people, starting with the early primaries…and he beat them easily,” Trump said in the Oval Office, as Mamdani stood next to him.\n When asked if he would feel comfortable living in New York City under a Mamdani administration, Trump responded emphatically, “Yeah, I would, especially after the meeting. Absolutely.” He added that they agreed on “a lot more than I would have thought. I want him to do a great job, and we’ll help him do a great job. He may have different views….I would feel very, very comfortable being in New York, and I think much more so after the meeting.” Mamdani said he “appreciated” the meeting with Trump, also describing it as a “productive” one “focused on a place of shared admiration and love, which is New York City and the need to deliver affordability to New Yorkers – the 8.5 million people who call our city their home, who are struggling to afford life in the most expensive city” in the US.\n Mamdani said the two spoke about issues such as rent, groceries, utilities, affordability, the cost of living crisis and housing.\n “I appreciated the time with the President. I appreciate the conversation. I look forward to working together to deliver that affordability for New Yorkers,” he said.\n Trump said, “We had a meeting today that actually surprised me. He wants to see no crime. He wants to see housing being built. He wants to see rents coming down, all things that I agree with.” “Now we may disagree how we get there…I expect to be helping him, not hurting him, a big help because I want New York City to be great. I love New York City,” he said, adding, “I think this mayor can do some things that are going to be really great.” The mutually warm and friendly tone of Trump and Mamdani was in stark contrast to their vitriolic attacks against each other during the NYC mayoral election campaign and after Mamdani emerged victorious on November 4, defeating Republican nominee Curtis Sliwa and former New York State Governor Andrew Cuomo, who was officially endorsed by Trump just hours before the elections. Trump had been critical of Mamdani’s policies, calling him a “communist” and warning that his win will be a “complete and total economic and social disaster” for New York City.\n In his fiery victory speech, Mamdani had challenged Trump, calling him a “despot” and saying that “if anyone can show a nation betrayed by Donald Trump how to defeat him, it is the city that gave rise to him…So, Donald Trump, since I know you’re watching, I have four words for you: Turn the volume up.” But in the Oval Office meeting, Trump praised Mamdani and said, “I think you’re going to have, hopefully, a really great mayor. The better he does, the happier I am…and we’re going to be helping him to make everybody’s dream come true, having a strong and very safe New York.” Trump said he has been called much worse than a despot, “so it’s not that insulting. I think he’ll change his mind after we get to working together.” Responding to questions about their bitter rhetoric against each other, Trump said that Mamdani has “got views that are a little out there”, and he could also change going forward.\n “We all change. I changed a lot from when I first came to office… We had discussions on some things…but I feel very confident that he can do a very good job. I think he’s going to surprise some conservative people actually,” Trump said.\n When asked if he views Mamdani as the true leader of the Democratic Party, Trump said, “This is a man that, right now, I think, is focused on New York City. I really think he has a chance to do a great job. We’re going to help him, but I really think he has a chance to do a great job.” On whether he will retract some of his remarks against Trump, Mamdani said, “What I really appreciate about the President is that the meeting that we had focused not on places of disagreement, which there are many, and also focused on the shared purpose that we have in serving New Yorkers.” Mamdani said that is something that could transform the lives of New Yorkers who are currently struggling under a cost-of-living crisis, with one in four living in poverty.\n “And the meeting came back again and again to what it could look like to lift those New Yorkers out of struggle and start to deliver them a city that they could do more than just struggle to afford it but actually start to live in it.” At one point, when asked if he is affirming that Trump is a fascist, as Mamdani was about to respond, Trump said, “That’s ok. You can just say yes. It’s easier than explaining it. I don’t mind.” Mamdani said he is really looking forward to delivering for New Yorkers in partnership with the President on the affordability agenda.\n Trump said, “We had some interesting conversation, and some of his ideas really are the same ideas that I have,” adding that they discussed issues such as crime and housing.\n “We discussed crime and he doesn’t want to see crime, and I don’t want to see crime, and I have very little doubt that we’re not going to get along on that issue.” Trump described Mamdani as “different” than “your typical guy” and “that can be in a very positive way”.\n “He’s different than your average candidate. He came out of nowhere…then all of a sudden, he wins the primary that nobody expected he was going to win. It’s a great, great tribute. It’s an amazing thing that he did.” To another question on why Mamdani flew to Washington DC from New York instead of taking a train, Trump again jumped to his defence, saying flying is a lot quicker and it’s a long drive between the two places. “He’s working very hard…that’s a very long drive. I’ll stick up for you.” To a question that US representative Elise Stefanik has called Mamdani a ‘jihadist’ and is he standing next to one in the Oval Office, Trump said, “No, I dont. I met with a man who is a very rational person. I met with a man who really wants to see New York be great again… I think he can bring it back. I think he wants to make it greater than ever before, and if he can, we’ll be out there cheering. I’ll be cheering for him.” PTI YAS GRS GRS GRS","summary":"","url":"https://www.news18.com/agency-feeds/very-productive-meeting-trump-praises-mamdani-in-warm-welcome-to-white-house-9723973.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-11-22 00:45:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.274},{"id":381410984,"title":"DHS skirts Noem accountability vow by awarding contracts $1 under threshold","text":"“All proposals for my consideration must include all relevant details, including any mission impact, dollar values, description of the supplies or services any timeline issues, and a description of the proposed action,” Noem wrote in the June memo. “Requests for approval of obligations above the $100,000 threshold must be submitted via memo through the Executive Secretary process. As with any request for Secretarial approval, please allow a minimum of 5 days for Front Office review.”\n\nPrior to Aug. 14, no other DHS contracts were awarded for between $99,999.00 and $99,999.99 in 2025. The POGO analysis pointed to an August New York Times report that showed Noem’s sign-off rule caused a delay in “mission critical” contracts.\n\nAssistant Homeland Security Secretary Tricia McLaughlin told the Washington Examiner that the 11 contracts were “for routine operational needs.”\n\n“These contracts were for routine operational needs. Under Secretary Noem’s leadership, DHS is rooting out waste, fraud, abuse, and is reprioritizing appropriated dollars — saving taxpayers more than $13.2 billion in her first 7 months,” McLaughlin said.\n\nDHS REVIEWS BIDEN-ERA GRANTS TO ‘TERROR-LINKED’ GROUPS\n\nAccording to available online federal spending data going back to 2007, no administration’s DHS has ever awarded 11 or more federal contracts within the one-dollar range in question. Former President Barack Obama’s administration came the closest with nine awarded in 2013. President Donald Trump’s first-term DHS only awarded two contracts within the $99,999.00 and $99,999.99 price range.\n\nThere were two contracts within this price range awarded in 2024, one in 2021, two in 2020, two in 2016, four in 2015, seven in 2014, nine in 2013, two in 2012, two in 2011, one in 2010, one in 2009, two in 2008, and one in 2007.","summary":"The Department of Homeland Security has been awarding a number of federal contracts for just under $100,000, after Secretary Kristi Noem vowed to review contracts of six figures and more personally. On June 11, Noem vowed to review and consider department proposals upwards of $100,000. Since then, DHS has authorized 11 federal contracts for between [&#8230;]","url":"https://www.washingtonexaminer.com/news/3895341/dhs-skirts-kristi-noem-accountability-vow-awarding-contracts-dollar-under-threshold/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/11/AP25312020285230-e1763771695222.jpg?w=696","video":null,"publish_date":"2025-11-22 00:42:33","author":"Molly Parks","authors":["Molly Parks"],"language":"en","category":"politics","source_country":"US","sentiment":-0.351},{"id":381410618,"title":"From Steve Bannon to Elizabeth Warren, bipartisan backlash erupts over push to block states from regulating AI","text":"New efforts this week in Washington to effectively ban individual states from governing artificial intelligence have provoked bipartisan backlash. The push from House Republicans and the White House to assert federal control over AI regulation, which echoes a similar attempt over the summer, has forged new lines of agreement between far-right commentators and progressive activists. “It’s a coalition of almost everyone against a few extreme tech billionaires who are trying to buy unfettered power,” said New York State Assembly Member Alex Bores, a proponent of states’ ability to govern AI and a Democratic candidate for the U.S. House. “States protecting our citizens is overwhelmingly popular and bipartisan.” A new poll released Friday night, conducted by YouGov in partnership with the conservative-leaning Institute for Family Studies, found that surveyed adults opposed congressional pre-emption efforts on AI by a 3-to-1 margin. Bores is a co-author of New York’s RAISE Act, which looks to impose safety-monitoring and evaluation requirements on some of America’s largest AI companies, among other measures. The act has passed the state Legislature and is awaiting New York Gov. Kathy Hochul’s signature. The current push for federal AI pre-emption efforts, so called because they would pre-empt or prohibit states’ ability to regulate AI, kicked off early this week. On Monday, Rep. Steve Scalise, R-La., told Punchbowl News that he and Republican leaders were considering introducing legislation overriding states’ ability to legislate AI into the National Defense Authorization Act (NDAA). Amendments unrelated to national defense are often attached to the bill, as lawmakers view the NDAA as must-pass legislation and use it to include measures that would otherwise face stiffer opposition. The move provoked immediate pushback, with Sen. Brian Schatz, D-Hawaii, writing on X Monday night that the bill “is a poison pill and we will block it.” On Tuesday, however, President Donald Trump came out in support of the effort on Truth Social: “Investment in AI is helping to make the U.S. Economy the ‘HOTTEST’ in the World — But overregulation by the States is threatening to undermine this Growth Engine.” Endorsing a ban on state AI regulation, Trump wrote: “Put it in the NDAA, or pass a separate Bill, and nobody will ever be able to compete with America.” Prominent proponents of federal pre-emption efforts include White House AI czar David Sacks and several Silicon Valley venture capital backers. Sacks reposted Trump’s comment on X Tuesday night. Marc Andreesen, co-founder of venture capital mainstay Andreesen Horowitz, followed up on Sacks’ post, writing on X Tuesday night: “A 50-state patchwork is a startup killer. Federal AI legislation is essential.” Yet several hours later, Florida Gov. Ron DeSantis denounced the efforts to prevent states from passing laws governing AI. Writing on X, DeSantis argued that federal pre-emption “takes away our sovereignty” and that “sneaking it into the defense bill is an insult to voters.” The federal pre-emption efforts have also triggered stiff opposition from Republicans’ populist MAGA flank. On his “War Room” podcast Wednesday, influential MAGA whisperer Steve Bannon criticized the moves and advocated for sensible AI regulations. “They’re trying to slip this into another 9,000 page, must-pass NDAA, that they don’t want to have a discussion about, in the dark of night,” he said. Bannon said individuals seeking “a license to do nails up here on Capitol Hill” currently face more regulation than America’s powerful AI companies. The fight over who regulates AI switched into a new gear Wednesday night, when a draft executive order designed to pre-empt state AI regulation leaked, as first reported by The Information. The order remains in draft form and might not be signed by Trump. The White House has not publicly commented on the draft order. The White House did not reply to a request for comment. On Thursday, Rep. Marjorie Taylor Greene, R-Ga., addressed the issue on X: “There should not be a moratorium on states rights for AI. States must retain the right to regulate and make laws on AI and anything else for the benefit of their state.” Many opponents of the pre-emption efforts contend that, given slow-moving attempts to regulate AI at the federal level, a pre-emption could introduce a vacuum of AI regulation by failing to replace state legislation with sufficient federal law. Other opponents charge that a federal monopoly on AI legislation would threaten American liberty. Mark Beall, president of the bipartisan AI Policy Network advocacy group, told NBC News: “Without guardrails, Americans are concerned that AI will be used to erode our liberties and privacy,” he said. “People who disagree on almost everything else agree that innovation shouldn’t mean surrender,” Beall said, arguing that sensible AI regulation would allow Americans to retain their civil liberties while still allowing tech companies to compete with China on cutting-edge AI technology. On Thursday, Massachusetts' Democratic senators, Elizabeth Warren and Ed Markey, urged their colleagues to fight the pre-emption effort given the gravity of risks from AI. In a joint statement, Warren and Markey wrote that pre-emption efforts “could block state policymakers from moving forward on basic, bipartisan protections, such as protecting children and teenagers online, combating deepfakes, slowing electricity price hikes, addressing the environmental impacts of data center buildout, preventing algorithmic discrimination, or safeguarding workers from dangerous AI-fueled workplace technology.” “The AI moratorium would be a massive giveaway to Big Tech and [a] devastating defeat for Americans,” they wrote. Max Bodach, executive vice president of the right-leaning tech think tank Foundation for American Innovation, said that AI’s potential to shake up political divisions remains undervalued. “Political backlash to AI diffusion and infrastructure buildout is still underpriced as an issue that will increasingly come to dominate U.S. political discourse,” Bodach told NBC News. “I expect to see more ‘horseshoe’ coalitions forming between center-left veterans of the ‘tech-lash’ fight, the new trustbusters, tech-skeptical social conservatives, and America First populists.” “You’re seeing this emergent coalition form in the reaction to the NDAA and executive order pre-emption push,” he said. “I’m very curious to see how the more techno-optimist wings of civil society, industry, Congress, and the Trump administration respond.” On Friday, according to Punchbowl News, Republican leaders urged the White House to delay any further action on the executive order as Scalise sought more time to include a pre-emption provision in the NDAA.","url":"https://www.nbcnews.com/tech/tech-news/steve-bannon-elizabeth-warren-bipartisan-backlash-erupts-push-block-st-rcna245040","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-11/251115-trump-ch-1430-dba88a.jpg","video":null,"publish_date":"2025-11-22 00:41:39","author":"Jared Perlo","authors":["Jared Perlo"],"language":"en","category":"politics","source_country":"us","sentiment":0.024},{"id":381413124,"title":"Karoline Leavitt Reacts Strongly to Report on Potential Trump Cabinet Shake-Up","text":"White House Press Secretary Karoline Leavitt publicly criticized CNN on Friday following their report suggesting President Donald Trump plans to significantly shuffle his Cabinet early next year.\n\nThe report alleged that Kristi Noem, Secretary of the Department of Homeland Security, and Energy Secretary Chris Wright might be at risk of losing their positions. The article claimed that Wright’s relationship with the White House has deteriorated over recent months.\n\nHowever, according to sources who spoke with CNN, no definitive decisions have been made, and the current Cabinet is expected to remain unchanged until President Trump reaches his one-year anniversary in office on January 20.\n\nLeavitt took to social media platform X to denounce the report, stating, “This story is 100 percent Fake News, and the White House repeatedly told this to CNN in the strongest possible terms.” She further accused the network of fabricating drama to boost their declining ratings.\n\n“The truth is: President Trump could not be happier with his Cabinet,” Leavitt added, expressing her disdain with, “Shame on you, CNN.”\n\nCNN’s story did include a denial from Leavitt, acknowledging her rejection of their claims.\n\n‘The cabinet is not changing no matter how much CNN wishes that it would because it thrives off drama,’ Leavitt said. \n\nTrumpworld firings and hirings were a staple of the president’s first term.\n\nThe president had to say goodbye to his communications director pick, Jason Miller, before his term even began, after Miller was exposed for fathering a love child with another Trump campaign staffer. \n\nTrump also dismissed National Security Advisor Michael Flynn less than a month into his first term after Flynn misled then-Vice President Mike Pence over dealings with Russia. \n\nThe turnover was so rampant that one D.C. restaurant offered drink specials every time an administration figure got axed. \n\nTrump 2.0 has, so far, been more stable. \n\nThe president let go of his National Security Advisor Mike Waltz, after the Signal-gate scandal, but immediately appointed him to serve as the ambassador to the United Nations. \n\nThe president also had a dramatic break-up with special government employee, Elon Musk, who was tasked with running the Department of Government Efficiency.\n\nBut as of this week, Musk was back in the fold, attending the president’s dinner in honor of Saudi Crown Prince Mohammed bin Salman. \n\nCNN reported that while the president is personally happy with Noem, White House officials have become frustrated with her de facto chief of staff, Corey Lewandowski. \n\n‘Yes, he likes [Noem], but it has been brought to his attention that [Lewandowski] is a problem, and the agency is being mismanaged because of it,’ a person close to the White House told the network. \n\nIn 2023, the Daily Mail exclusively reported that Noem and Lewandowski have been engaged in a years-long clandestine romantic relationship that began in 2019. Both Noem and Lewandowski have denied the relationship to DailyMail.com and remain married to their respective partners. \n\nNoem tapped Lewandowski to serve as a temporary DHS special government employee, and sources told CNN that there are some who believe that the two might exit the administration together, leaving the top spot at DHS open. \n\nA spokesperson for DHS did not immediately respond to the Daily Mail’s request for comment. \n\nWright also appeared ripe to go over frustration that he is ‘slow-walking’ some initiatives Trump promised to voters during his 2024 campaign, CNN said.\n\nBoth White House and Energy Department officials pushed back on the reporting.\n\n‘Just last week, President Trump called Secretary Wright “the number one energy person anywhere in the world.” No serious person is buying this anonymously sourced fake news,’ Energy Department spokesman Ben Dietderich told the network. \n\nCNN also reported on one potential Republican waiting in the wings should a Cabinet job be available: outgoing Virginia Governor Glenn Youngkin. \n\nWhile no official conversations appear to have taken place, Youngkin will be out of a job come January, just when the reshuffle will reportedly take place.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWhite House Press Secretary Karoline Leavitt publicly criticized CNN on Friday following&#8230;\n\n\nThis Post: Karoline Leavitt Reacts Strongly to Report on Potential Trump Cabinet Shake-Up first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/karoline-leavitt-reacts-strongly-to-report-on-potential-trump-cabinet-shake-up/","image":"https://internewscast.com/wp-content/uploads/2025/11/Karoline-Leavitt-issues-furious-tirade-over-report-Trump-is-set.jpg","video":null,"publish_date":"2025-11-22 00:40:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":381412076,"title":"\"You'll Be A Great Mayor\" Trump Praises Zohran Mamdani In Surprisingly Friendly Meeting | New York","text":"The highly anticipated meeting between President Donald Trump and New York City's mayor-elect Zohran Mamdani, turned out to be an unexpectedly friendly one. After months of warning that New York City would become a \"Complete and Total Economic and Social Disaster\" under a Mamdani administration, Trump said today he'd be comfortable living in the city with Mamdani as mayor. The president also said the pair have a lot in a common and that he feels confident in Mamdani's ability to lead the city they both love. n18oc_crux | n18oc_world","summary":"The highly anticipated meeting between President Donald Trump and New York City's mayor-elect Zohran Mamdani, turned out to be an unexpectedly friendly one. After months of warning that New York City would become a \"Complete and Total Economic and Social Disaster\" under a Mamdani administration, Trump said today he'd be comfortable living in the city with Mamdani as mayor. The president also said the pair have a lot in a common and that he feels confident in Mamdani's ability to lead the city they both love. n18oc_crux | n18oc_world","url":"https://www.news18.com/videos/originals/you-ll-be-a-great-mayor-trump-praises-zohran-mamdani-in-surprisingly-friendly-meeting-new-york-9723974.html","image":"https://images.news18.com/ibnlive/uploads/2025/11/1763772362_613a1287-7508-4156-8703-b156a48b76b6.jpeg","video":null,"publish_date":"2025-11-22 00:39:17","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.45},{"id":381410512,"title":"Jim Jordan Seeks Bank Information in Jack Smith Probe: Report","text":"House Judiciary Committee Chair Jim Jordan of Ohio, a Republican, is seeking information from major banks as he continues to probe whether special counsel Jack Smith overreached in his investigations into President Donald Trump.\n\nNewsweek reached out to Jordan’s office by email on Friday afternoon for comment. \n\nWhy It Matters\n\nThe Republican-led Senate Judiciary Committee has said that cellphones belonging to Republican lawmakers were targeted as part of the Artic Frost probe during the Biden administration, which investigated whether Trump or his allies broke the law in an alleged effort to overturn the results of the 2020 presidential election. \n\nThe FBI fired multiple employees and dismantled the public corruption unit following the revelation, with FBI Director Kash Patel announcing in a post on X that the investigation “tracked the communications of GOP Senators.” \n\nJack Smith, who led the Artic Frost probe, used information gathered from the investigation to bring charges against Donald Trump, but the cases against Trump went away after he won the 2024 U.S. presidential election. Smith has defended his work and denounced what he calls growing politicization within the Department of Justice (DOJ). \n\nU.S. Rep. Jim Jordan (R-OH) looks on during a hearing with the House Judiciary Committee in the Rayburn House Office Building on September 3, 2025, in Washington, D.C.\n\nWhat To Know\n\nJordan, who claimed he was one of the Republicans targeted in the phone data sweep, sent out a letter to major banks requesting any communications and materials related to Smith’s investigations. \n\nThe letter went out to Bank of America, JPMorgan Chase, Citigroup, and Morgan Stanley, among others. Jordan requested that they turn over any documents relating to requests for financial data from federal law enforcement officials, according to Politico.\n\n“During the Biden-Harris Administration, the Department of Justice subpoenaed financial institutions … for financial records of private customer data in its politicized investigations into President Trump,” Jordan wrote in the letter, according to Politico. “We write to request relevant materials in [your] possession.”\n\nJordan reacted to the discovery that the DOJ subpoenaed Verizon for his phone records during an interview with Fox News host Sean Hannity, saying: “It’s always worse than we thought. We know they spied on President Trump, then we learned it’s senators and the speaker of the House. Then we learn that they spied on me for 2 1/2 years.” \n\nHe also suggested that he may bring in former U.S. Attorney General Merrick Garland to find out what he knew of the investigation and may have authorized, saying it remains to be seen who signed off on the Arctic Frost probe.\n\nWhat Is the Arctic Frost Investigation?\n\nThe Senate Judiciary Committee has found that the FBI accessed data on Republican lawmakers’ phone usage from January 4 to January 7, 2021, the dates surrounding and including the January 6 attack on the U.S. Capitol.\n\nArctic Frost formed the basis of Smith’s inquiry into 2020 election interference, which led to a federal indictment of Trump in August 2023, though charges were dropped following his 2024 presidential election victory.\n\nWhat Happens Next\n\nJordan has previously asked Smith to sit for a transcribed interview about his investigations, who countered by requesting that the interview occur in a public forum and only after he has the opportunity to view his records from the DOJ, but an agreement has yet to be reached.","summary":"Jim Jordan may have been one of the Republicans whose phone records were subpoenaed by the Arctic Frost probe.","url":"https://www.newsweek.com/jim-jordan-bank-information-jack-smith-probe-11090174","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-2233556468_fd2cad.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-22 00:35:59","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.404},{"id":381409882,"title":"US reviews possible approval for Nvidia’s H200 sales to China","text":"The Trump administration is considering greenlighting sales of Nvidia's H200 artificial intelligence chips to China, people familiar with the matter said, as a bilateral detente boosts prospects for exports of advanced U.S. technology to China. The Commerce Department, which oversees U.S. export controls, is reviewing a change to its policy of barring sales of such chips to China, the sources said, stressing that plans could change. A White House official declined to comment but said, \"The administration is committed to securing America's global technology leadership and safeguarding our national security.\" The Commerce Department did not respond to a request for comment. Nvidia did not comment directly on the review but said current regulation does not allow the company to offer a competitive AI data center chip in China, leaving that massive market to its rapidly growing foreign competitors. ALSO READNvidia busts AI fears, crushes expectations with blockbuster results – 5 Key Takeaways Tech shifts amid tensions The possibility signals a friendlier approach to China, after U.S. President Donald Trump and Chinese leader Xi Jinping brokered a trade and tech war truce in Busan last month. China hawks in Washington are concerned that shipments of more advanced AI chips to China could help Beijing supercharge its military, fears that prompted the Biden administration to set limits on such exports. Faced with Beijing's muscular use of export controls on rare earth minerals, critical for producing a raft of tech goods, Trump this year has threatened new restrictions on tech exports to China, but ultimately rolled them back in most cases. The H200 chip, unveiled two years ago, has more high-bandwidth memory than its predecessor the H100, allowing it to process data more quickly. ALSO READChina advises companies to avoid using Nvidia H20 Chips in fresh notice H200 chip's power advantage grows It is estimated to be twice as powerful as Nvidia's H20 chip, the most advanced AI semiconductor that can legally be exported to China, after the Trump administration reversed its short-lived ban on such sales earlier this year. Earlier this week, Nvidia CEO Jensen Huang, whom Trump has described as a \"great guy,\" was among the guests at the White House during Saudi Crown Prince Mohammed bin Salman's visit. The Commerce Department announced this week it had approved shipments of the equivalent of up to 70,000 Nvidia Blackwell chips, Nvidia's next-generation AI chip, to Saudi Arabia's Humain and G42 of the United Arab Emirates","url":"https://www.financialexpress.com/world-news/us-news/us-reviews-possible-approval-for-nvidias-h200-sales-to-china/4052360/","image":"https://images.financialexpressdigital.com/2025/11/Nvidia.jpg","video":null,"publish_date":"2025-11-22 00:32:01","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"in","sentiment":0.066},{"id":381412890,"title":"‘Just say yes’: Trump cuts in as NYC mayor-elect Mamdani dodges on calling him a ‘fascist’ at Oval Office","text":"During an Oval Office media spray on Friday, Fox News’ Jacqui Heinrich pressed New York City mayor-elect Zohran Mamdani on whether he still believes President Donald Trump is a \"fascist.\" Mamdani began to answer — but before he could finish, Trump cut in from behind the Resolute Desk. \"That’s okay,\" Trump said, before patting Mamdani’s arm. \"You can just say yes. It’s easier than explaining it. I don’t mind.\" The full 10-minute exchange capped a wide-ranging availability focused on affordability, housing and public safety, and brimmed with tension between Mamdani’s past rhetoric and the political reality of governing alongside the Trump White House. TRUMP, MAMDANI SET TO FACE-OFF IN FIRST OVAL OFFICE MEETING — WHAT’S ON THE TABLE Heinrich had earlier asked Mamdani whether he stood by his previous comments describing Trump’s agenda as \"fascist\" and \"despotic.\" Mamdani did not give a direct answer, saying only that he intended to work with the president \"where we agree\" to help the city’s 8.5 million residents. Trump jumped in before he finished, adding with a laugh, \"I’ve been called much worse than a despot — maybe he’ll change his mind.\" TRUMP PREDICTS 'CIVIL' MEETING WITH MAMDANI DESPITE PAST COMMENTS ABOUT EACH OTHER The moment came after both men publicly emphasized areas of potential cooperation. Trump pointed to falling energy prices and said he wanted utilities, including Con Edison, to lower rates. Mamdani outlined a plan centered on housing, rent, groceries and utilities, saying New Yorkers are facing a \"cost-of-living crisis that threatens to push families out of the city.\" Heinrich also pressed Trump on Ukraine, asking how his proposed peace plan would work if President Zelenskyy rejected it. Trump replied that Ukraine would \"have to like it, or keep fighting,\" and repeated his claim that U.S. support would depend on securing an agreement. He also asserted that casualty numbers in the conflict were \"far higher\" than publicly reported. DAVID MARCUS: MR. MAMDANI GOES TO WASHINGTON BETWEEN ROCK AND HARD PLACE The spray also touched on public safety, with Mamdani saying he intends to maintain roughly 35,000 NYPD officers while shifting more non-urgent calls away from police and toward mental-health responders. Trump said both men shared a goal of removing \"very bad people\" and making the city safer, adding that \"we want New York to thrive again.\" The exchange with Heinrich is likely to fuel further scrutiny over how Mamdani balances far-left progressive messaging with the realistic demands of governing. The mayor-elect has proudly identified as a democratic socialist, but said he intends to \"meet the moment\" in partnership with the Trump administration when possible. Trump, who joked that the spray attracted \"more reporters than usual,\" said he was open to meeting again. Mamdani added the same, saying his goal was to find points of agreement that could \"deliver for New Yorkers right away.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP The President posted to Truth Social on Friday night, documenting the visit with several photos of the two men, captioned \"It was a Great Honor meeting Zohran Mamdani, the new Mayor of New York City!\" The White House did not immediately respond to Fox News Digital's request for comment.","summary":"Democratic socialist NYC mayor-elect navigates awkward Oval Office moment as Trump jokes about being called &apos;fascist&apos; during cooperation talks.","url":"https://www.foxnews.com/politics/just-say-yes-trump-cuts-nyc-mayor-elect-mamdani-dodges-calling-him-fascist-oval-office","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/mamdani-trump.jpg","video":null,"publish_date":"2025-11-22 00:31:36","author":"Jacqui Heinrich,Jasmine Baehr","authors":["Jacqui Heinrich","Jasmine Baehr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.202},{"id":381410006,"title":"G20 Summit Live Updates: PM Arrives In Johannesburg, Holds Bilateral Meeting With Australian Counterpart","text":"G20 Summit 2025, PM Narendra Modi South Africa Visit Live Updates: Prime Minister Narendra Modi received a warm and colourful welcome on Friday as he arrived in South Africa for the G20 Leaders’ Summit. A cultural group performed at the airport, and its members bowed to him as a gesture of respect.\n\nThis is PM Modi’s fourth official visit to South Africa. He previously visited the country for the BRICS summits in 2018 and 2023, and before that for a bilateral visit in 2016.\n\nThis year’s G20 is also notable because it marks the fourth consecutive summit hosted in the Global South, following Indonesia, India and Brazil. South Africa has taken over the presidency for 2025, after Brazil (2024), India (2023) and Indonesia (2022).\n\nOn Friday, PM Modi also held a bilateral meeting with Australian Prime Minister Anthony Albanese. The two leaders discussed key areas of cooperation and ongoing developments between their countries.\n\nG20 leaders are assembling in Johannesburg this weekend, but the United States will not be represented after former President Donald Trump declared he would boycott the summit. He made the announcement while repeating his controversial — and widely challenged — claims that South Africa is discriminating against its white Afrikaner population.\n\nChinese President Xi Jinping will also be absent, continuing his pattern of significantly limiting international travel in recent years.","summary":"G20 Summit 2025, PM Narendra Modi South Africa Visit Live Updates: PM Modi also held a bilateral meeting with counterpart Anthony Albanese on the first day of his visit.","url":"https://www.news18.com/india/g20-summit-live-updates-pm-narendra-modi-south-africa-visit-johannesburg-key-agendas-meetings-analysis-india-foreign-policy-bilateral-ties-global-economy-issues-liveblog-9723828.html","image":"https://images.news18.com/ibnlive/uploads/2025/11/narendramodiSA-2025-11-a0b5d5cb64f97f1aba412b05c427a3bd-16x9.jpg","video":null,"publish_date":"2025-11-22 00:30:28","author":"Anushka Vats,News18","authors":["Anushka Vats","News18"],"language":"en","source_country":"in","sentiment":0.459},{"id":381414530,"title":"Trump peace plan: We could all pay if Europe doesn’t step up and guarantee Ukraine’s security | World News","text":"The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum.\n\nIf accepted, it would reward armed aggression. The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world.\n\nThe Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped. It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO.\n\nThe question now is: are Europe’s leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure.\n\nThe plan proposes the following:\n\n• Land seized by Vladimir Putin’s unwarranted and unprovoked invasion would be ceded by Kyiv.\n\n• Territory his forces have fought but failed to take with colossal loss of life will be thrown into the bargain for good measure.\n\n• Ukraine will be barred from NATO, from having long-range weapons, from hosting foreign troops, from allowing foreign diplomatic planes to land, and its military neutered, reduced in size by more than half.\n\nAnd most worryingly for Western leaders, the plan proposes NATO and Russia negotiate with America acting as mediator.\n\nLest we forget, America is meant to be the strongest partner in NATO, not an outside arbitrator. In one clause, Mr Trump’s lack of commitment to the Western alliance is laid bare in chilling clarity.\n\nAnd even for all that, the plan will not bring peace. Mr Putin has made it abundantly clear he wants all of Ukraine.\n\nHe has a proven track record of retiring, rallying his forces, then returning for more. Reward a bully as they say, and he will only come back for more. Why wouldn’t he, if he is handed the fortress cities of Donetsk and a clear run over open tank country to Kyiv in a few years?\n\nSince the beginning of Trump’s presidency, Europe has tried to keep the maverick president onside when his true sympathies have repeatedly reverted to Moscow.\n\nIt has been a demeaning and sycophantic spectacle, NATO’s secretary general stooping even to calling the US president ‘Daddy’. And it hasn’t worked. It may have made matters worse.\n\nThe parade of world leaders trooping through Sharm el-Sheikh, Egypt, lavishing praise on his Gaza ceasefire plan, only encouraged him to believe he is capable of solving the world’s most complex conflicts with the minimum of effort.\n\nThe Gaza plan is mired in deepening difficulty, and it never came near addressing the underlying causes of the war.\n\nRead more:Ukraine war latest: Putin welcomes peace planTrump’s 28-point Ukraine peace plan in full\n\nMost importantly, principles the West has held inviolable for eight decades cannot be torn up for the sake of a quick and uncertain peace.\n\nWith a partner as unreliable, the challenge to Europe cannot be clearer.\n\nIn the words of one former Baltic foreign minister: “There is a glaringly obvious message for Europe in the 28-point plan: This is the end of the end.\n\n“We have been told repeatedly and unambiguously that Ukraine’s security, and therefore Europe’s security, will be Europe’s responsibility. And now it is. Entirely.”\n\nIf Europe does not step up to the plate and guarantee Ukraine’s security in the face of this American betrayal, we could all pay the consequences.","summary":"The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression. The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders [&#8230;]\n\n\nThe post Trump peace plan: We could all pay if Europe doesn&#8217;t step up and guarantee Ukraine&#8217;s security | World News appeared first on Ghana Latest News.","url":"https://ghananewss.com/trump-peace-plan-we-could-all-pay-if-europe-doesnt-step-up-and-guarantee-ukraines-security-world-news/","image":"https://e3.365dm.com/25/11/768x432/skynews-putin-russia_7087872.jpg?20251121192854","video":null,"publish_date":"2025-11-22 00:26:20","author":"Ghana News,Vladimir Putin","authors":["Ghana News","Vladimir Putin"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.152},{"id":381413812,"title":"Gunmen kidnap over 200 schoolchildren, 12 teachers from Nigerian Catholic school","text":"Abuja, Nov 22 (AP) Gunmen attacked a Catholic boarding school in a western region of Nigeria and abducted more than 200 schoolchildren Friday, the Christian Association of Nigeria said, in the latest in a spate of abductions in Africa's most populous country.The attack and abductions took place at St. Mary's School, a Catholic institution in the Agwara local government's Papiri community.Attackers seized 215 pupils and students as well as 12 teachers, said Daniel Atori, a spokesperson for the Niger state chapter of CAN.“I just got back to the village tonight after I visited the school where I also met with parents,” Atori said in a statement, quoting the Most Rev. Bulus Dauwa, the CAN chairman in Niger. The statement added that the association is working \"to ensure our children's safe return.”The Niger State Police Command said the abductions took place in the early hours, and that military and security forces have since been deployed to the community. It described St. Mary's as a secondary school, which in Nigeria would serve children between the ages of 12 and 17.A satellite image shows that the school compound is attached to an adjoining primary school, with more than 50 classroom and dormitory buildings. It's located near a major road linking the towns of Yelwa and Mokwa.Dauda Chekula, 62, said that four of his grandchildren, ranging in age from 7 to 10, were among the schoolchildren abducted.“We don't know what is happening now, because we have not heard anything since this morning,” Chekula said. ”The children who were able to escape have scattered, some of them ran back to their houses and the only information we are getting is that the attackers are still moving with the remaining children into the bush.”The statement by the secretary to the Niger state government said that the abduction occurred, despite prior intelligence warning of heightened threats.“Regrettably, St. Mary's School proceeded to reopen and resume academic activities without notifying or seeking clearance from the State Government, thereby exposing pupils and the staff to avoidable risk,” it read.Umar Yunus, a Papiri resident, said there were only local security arrangements and no official police or government forces securing the school at the time of the attack on Friday.The Catholic Diocese of Kontagora said in a statement that a security staffer was “badly shot” during the attack.Authorities, meanwhile, closed 47 of the country's federal unity colleges that are mostly in conflict-battered northern states. The unity colleges — a group of elite government schools with attendance drawn from across the country — are to be closed immediately, according to a circular issued by Nigeria's Federal Ministry of Education. Spate of abductions-----------------------The abductions took place days after gunmen on Monday attacked a high school and abducted 25 schoolgirls in the neighbouring Kebbi state, in Maga, around 170 kilometres from Papiri. One of the girls later escaped and is safe, the school's principal said.In a separate attack on Monday in Kwara state, which borders Niger state, gunmen attacked a church, killing two people. During the attack, 38 worshippers were also abducted, Femi Agbabiaka, secretary of the Christ Apostolic Church, told The Associated Press on Friday. He said that the kidnappers are demanding a ransom of 100 million naira (USD 69,000) for each person taken.Nigerian President Bola Tinubu cancelled his trip to this weekend's Group of 20 summit in South Africa over the recent events. Vice President Kashim Shettima will represent the president at the summit, the presidency said on X on Friday.“We will use every instrument of the state to bring these girls home and to ensure that the perpetrators of this wickedness face the full weight of justice,” Shettima said during a visit to Kebbi state on Wednesday.No group has claimed responsibility for the attacks in Niger and Kebbi state, but analysts and locals say gangs often target schools, travellers and remote villagers in kidnappings for ransom.Authorities say the gunmen are mostly former herders who have taken up arms against farming communities after clashes between them over strained resources.Abductions have come to define the insecurity prevailing in Africa's most populous nation.At least 1,500 students have been abducted in the region since Boko Haram jihadi extremists seized 276 Chibok schoolgirls more than a decade ago. But bandits are also active in the region, and analysts say gangs often target schools to gain attention.Nigeria was recently thrust into the spotlight after US President Donald Trump singled the country out, stating that Christians are being persecuted — an allegation that the government rejected.While Christians are among those targeted, analysts say that the majority of victims of armed groups are Muslims in Nigeria's Muslim-majority north, where most attacks occur. Community upset--------------------Analysts and residents blame the insecurity on a failure to prosecute known attackers, and the rampant corruption that limits weapons supplies to security forces while ensuring a steady supply to the gangs.Eze Gloria Chidinma, 27, a Lagos-based influencer, also known as “Riaz Kitchen,\" told The Associated Press her sister was able to escape the school during the attacks by jumping a fence.Chidinma said it's not the first time her family has been affected by the rampant kidnappings in the country.“My mother and my older brother were kidnapped last year. We called security, we called the police, and they just said there is nothing they can do,\" she said, noting the family had to pay “a huge amount of money” to rescue them.\"My message to the authorities right now is to think about the people. Your job is to protect lives and properties. People's lives should matter to you,\" Chidinma added.Yohanna Buru, a pastor and head of the Peace Revival And Reconciliation Foundation, an organisation focused on interfaith dialogue, called on authorities to increase security around schools in areas affected by the security crisis.“If the government was doing enough, then rampant kidnappings all over the country would not have happened,\" he said. “It's as if they don't care about the future of our children.” (AP) GRS GRS","url":"https://www.livemint.com/news/world/gunmen-kidnap-over-200-schoolchildren-12-teachers-from-nigerian-catholic-school-11763770324647.html","image":"https://www.livemint.com/lm-img/img/2025/11/22/1600x900/logo/Nigeria-Abductions-5_1763770775100_1763770784081.jpg","video":null,"publish_date":"2025-11-22 00:24:20","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.266},{"id":381407870,"title":"Chicago rejects DOJ grants tied to Trump's immigration policies","text":"Chicago will not apply for federal community violence intervention grants after the Trump administration reshaped the program to focus on law enforcement and immigration, the city said this week, calling the new stipulations an effort to politicize public safety. \n\n\"The city of Chicago does not intend to apply for any federal grants that require the city to comply with President Trump's political aims,\" Mayor Brandon Johnson's press office said in a statement first shared with Reuters.\n\nThe U.S. Department of Justice confirmed it has shifted the focus of the grant, which was originally intended to support community violence-prevention efforts. \n\nChicago officials and the Trump administration hold conflicting notions about what constitutes effective violence prevention. Johnson characterized the administration's decision to rescind more than $800 million in violence prevention grants in April as \"politically motivated.\"\n\nThe move to shun the new grants marks the latest flashpoint between the city and the administration over its aggressive immigration crackdown. Chicago previously sued the Trump administration over conditions it called \"illegal restrictions\" on other community policing grants.\n\nThe DOJ did not immediately respond to a request for comment on Friday about Chicago's decision to avoid seeking the grant funding.\n\nChicago is the only U.S. city so far to say publicly that it will not apply for the funding, even as cities such as Newark, New Jersey, and Columbia, South Carolina, told Reuters they are moving ahead with applications. Several cities benefited in the past from the grants, when money was given directly to community-based organizations.\n\nIn late September, the DOJ announced that it was changing its Community-Based Violence Intervention and Prevention Initiative to exclude community organizations from direct funding and prohibit services for undocumented residents. It also cut total funding of the program to $34.6 million. The grants were first appropriated in 2022 with $50 million for CVI and an additional $50 million was allocated over five years under the Bipartisan Safer Communities Act.\n\nLast week, a DOJ spokesperson confirmed the program shift in a statement and said the funding will also be used to hire more law enforcement officers, purchase equipment and \"build criminal justice system capacity.\"\n\nThe rewrite of the grants \"reflects our belief that the best way to prevent violence in our communities is through robust support for law enforcement,\" the statement said.\n\nHowever, two former DOJ officials who spoke on condition of anonymity, as well as community interventionists and gun violence experts, said the agency's goals deviate from the program’s original intent. The new goals, they said, reflect a broader ideological shift that steers resources away from historically marginalized communities impacted by crime.\n\n\"Now, the funds must pass through a government agency,\" said Jordan Costa, associate director for the Giffords Center for Violence Intervention. Community-based organizations can only be subrecipients, and they would presumably have to comply with the same mandates.\"\n\nSOME SEE 'OVERREACH' BY ADMINISTRATION\n\nPresident Donald Trump has made immigration crackdowns a cornerstone of his political agenda. He has also sought to strip federal grants from cities that refuse to comply with requests by U.S. Immigration and Customs Enforcement to detain suspected undocumented immigrants.\n\n\"I don't know how tying immigration into gang violence intervention even makes sense,\" said Reneé Hall, president of The National Organization of Black Law Enforcement Executives. \"This is just another overreach of the administration in an effort to further its agenda.\"\n\nWhite House spokesperson Abigail Jackson told Reuters in a statement last week that the administration has been successful in its approach to mitigating crime. \n\n\"Any insinuation that the Trump administration isn’t successfully combatting dangerous crime is false and uninformed.\" \n\nIn Columbia, South Carolina, Deputy Chief of Police Melron Kelly said earlier this month that his grant staff submitted an application for funding and is seeking answers to what cooperation with immigration enforcement would entail. \n\n\"There are always some parameters when you ask for federal dollars - but not specific to how you're going to enforce the law or what laws to enforce,\" said Kelly. REUTERS","url":"https://www.straitstimes.com/world/chicago-rejects-doj-grants-tied-to-trumps-immigration-policies","image":"https://cassette.sphdigital.com.sg/image/straitstimes/29a08b25740cd7def12d84fe844df2c35d7f7b1907435c3f5d55bc1d8cab4c99","video":null,"publish_date":"2025-11-22 00:24:18","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.413},{"id":381413096,"title":"Judge blocks Trump from cutting $350 million in grants to cities, counties","text":"NEW YORK (Reuters) -A federal judge on Friday temporarily blocked President Donald Trump's administration from unilaterally imposing new conditions on over $350 million in U.S. Department of Homeland Security grants to more than two dozen cities and counties in California, Washington and Arizona. U.S. District Judge William Orrick in San Francisco ruled the Trump administration likely violated the law when it issued executive orders that sought to cut off DHS funding to local governments unless they supported federal immigration enforcement, ended programs that support diversity, stopped providing benefits to immigrants who are in the country illegally, and complied with the president's other executive orders. The plaintiffs, which include San Francisco, Los Angeles and San Diego, sued the Trump administration on September 30, saying the federal government was playing politics with DHS and Federal Emergency Management Agency grants that local governments use to prepare for and recover from disasters. The cities and counties in the lawsuit represent 30 million people, and they said collectively they have over $350 million in grants at stake. Local governments use the federal grants to hire first responders, fund search and rescue operations, train employees in disaster response, and prepare for events like Super Bowl LX and the 2026 FIFA World Cup, according to Santa Clara County in California, the lead plaintiff in the lawsuit. The federal government has also threatened to criminally prosecute or claw back funds from localities that accept DHS money but do not comply with the new executive orders, according to the lawsuit. (Reporting by Dietrich Knauth; Editing by Chris Reese) By Dietrich Knauth","url":"https://www.marketscreener.com/news/judge-blocks-trump-from-cutting-350-million-in-grants-to-cities-counties-ce7d5edfde81f522","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-11/2025-11-22T002507Z_1_LYNXMPELAL00A_RTROPTP_4_USA-LOS-ANGELES-CITYSCAPE.JPG","video":null,"publish_date":"2025-11-22 00:24:16","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.479},{"id":381410454,"title":"CNN’s Kaitlan Collins Exalts Mamdani Calling a Jovial Trump Fascist to His Face: ‘Amazing Moment in Politics’","text":"Kaitlan Collins was shocked during Zohran Mamdani’s visit to the Oval Office when the mayor-elect called Donald Trump a fascist to his face — all with the president’s pleasant goading and permission.\n\nTrump surprised the political world Friday afternoon when his scheduled Oval Office meeting went off cordially – there were even moments where the president seemed to enjoy his time with the 34-year-old Mamdani. Trump even let him off the hook when Mamdani was asked if he stood by previous comments where he said Trump was fascist.\n\n“I’ve spoken about …” Mamdani began.\n\n“That’s OK,” Trump interrupted, smiling and eventually patting Mamdani’s arm good-naturedly. “You can say yes. It’s easier. It’s easier than explaining. I don’t mind.”\n\n“OK,” Mamdani said with a shrug. “Alright. Yes.”\n\nCNN’s Collins exalted the moment on social media after seeing it. Commenting in a now-pinned statement on influencer Evan Ross Katz’s Instagram post on the encounter, the news network’s chief White House correspondent called it “an amazing moment in politics.” She also posted a clip of the question on her own personal page. \n\nThe Trump-Mamdani meeting had that effect on many who watched Friday afternoon. The pair were cordial and Trump was so complimentary that Fox News’ Brian Kilmeade wondered if Vice President JD Vance was “jealous” of the interaction. Trump even came off voicing support for Mamdani’s efforts to improve New York City and that he might even surprise conservatives.\n\n“I think you’re going to have, hopefully, a really great mayor. The better he does, the happier I am,” Trump said. “There’s no difference in party, there’s no difference in anything. And we’re going to be helping him to make everybody’s dream come true. Having a strong and very safe New York.”\n\nHe added: “He’s got views that are a little out there, but who knows. I mean, we’re going to see what works. He’s going to change, also. I changed a lot. I feel very confident that he can do a very good job. I think he is going to surprise some conservative people, actually.”","summary":"\"That's OK. You can just say yes,\" the president told NYC's mayor-elect on Friday\n\n\nThe post CNN’s Kaitlan Collins Exalts Mamdani Calling a Jovial Trump Fascist to His Face: ‘Amazing Moment in Politics’ appeared first on TheWrap.","url":"https://www.thewrap.com/mamdani-trump-fascist-kaitlan-collins-reaction/","image":"https://www.thewrap.com/wp-content/uploads/2025/11/Mamdani-Trump-meeting-oval-office.jpeg","video":null,"publish_date":"2025-11-22 00:23:53","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","category":"politics","source_country":"US","sentiment":0.547},{"id":381407390,"title":"World News | PM Modi Interacts with Heads of Prominent Community Organisations in Johannesburg","text":"Johannesburg [South Africa], November 22 (ANI): Prime Minister Narendra Modi on Friday (local time) met with the heads of prominent community organisations in Johannesburg. Jaydev Shukla, priest of the Lakshminarayan Temple in Lenasia, expressed his happiness following the interaction, highlighting that the Prime Minister addressed several key issues, including the promotion of Indian languages and encouraging the diaspora to visit India annually.\nAlso Read | Who Are Netra Mantena and Vamsi Gadiraju, the US-Based Couple Whose Luxury Udaipur Wedding Donald Trump Jr Is Attending?.\n\"It felt really good to meet the Prime Minister. He emphasised on 2-3 things, including language, and promoting the Indian diaspora to visit India every year. He also mentioned the Indian government's will to organise a sports tournament for the Indian diaspora living here for 7-8 generations,\" Shukla told ANI.\nSwami Vivekananda Saraswati, Head of the Sanyasi Spiritual Council of South Africa, said that meeting PM Modi was an electrifying moment for him and asserted that the Indian community share a close relation with the country.\nAlso Read | IAF Plane Crash in Dubai: Tejas Fighter Jet Meets With Accident During Aerial Display at Dubai Air Show, Indian Air Force Regrets 'Loss of Life' (Watch Videos).\n\"It was indeed an electrifying moment to meet Prime Minister Narendra Modi, who has inspired us to continue taking the power of Bharat the world over. We share a close relation with our motherland, and through the inspiring leadership of PM Narendra Modi, our leadership has gained depth, spiritually and through old ties, diplomatically as well. We are thrilled that the Prime Minister has increased the OCI requirements from five generations to seven generations. This allows our children to share and experience what our Bharat has to offer, to connect them back to their motherland,\" he said.\nUpon his arrival in Johannesburg, Prime Minister Narendra Modi was welcomed by the Indian diaspora with folk dances from 11 different states. The cultural programme was aptly titled 'Rhythms of a United India', where the Prime Minister termed it a commendable effort by the Indian diaspora.\nThe folk dances which were performed by the Indian community belonged to Kerala, Tamil Nadu, Andhra Pradesh, Telangana, Maharashtra, Gujarat, Odisha, West Bengal, Assam, Bihar, Jharkhand, and Rajasthan.\n\"India's vibrant cultural diversity on display in South Africa! Members of the Indian community took the lead in showcasing folk dances from 11 states of India during a short cultural programme aptly titled 'Rhythms of a United India.' It is commendable how the Indian community has remained connected with its roots,\" PM Modi wrote on 'X'. Prime Minister Modi is currently on a three-day visit to South Africa from November 21 to 23 to participate in the G20 Summit 2025. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Jaydev Shukla, priest of the Lakshminarayan Temple in Lenasia expressed happiness following his meeting with PM Modi and mentioned that he emphasised various issues, including language, and promoting the Indian diaspora to visit India every year.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-interacts-with-heads-of-prominent-community-organisations-in-johannesburg-7213875.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251121212803.jpg","video":null,"publish_date":"2025-11-22 00:20:21","author":null,"language":"en","source_country":"in","sentiment":0.562},{"id":381411128,"title":"Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag","text":"By NICHOLAS RICCARDI, JOSH BOAK and JAKE OFFENHARTZ\n\nThe two had called each other “fascist” and “communist,” but when President Donald Trump and New York City Mayor-elect Zohran Mamdani faced reporters in the Oval Office on Friday, they were just two iconoclastic New York politicians who were all smiles.\n\nThe much-anticipated face-to-face showed how the politicians’ shared love of New York City — and no doubt some political calculus — could paper over months of insults. Both men used a plainspoken, wry approach tailor-made for the age of social media to make their points, and each left the meeting with something he needed.\n\nHere are some takeaways from the appearance.\n\nRepublicans lose their punching bag — at least for now\n\nTrump’s party had been queueing up a 2026 campaign warning that the Democratic Party is getting taken over by people like Mamdani, a 34-year-old Muslim and self-described democratic socialist who may not play as well west of the Hudson River. But Trump swatted all that down.\n\n“The better he does, the happier I am,” Trump, a native New Yorker, said of Mamdani.\n\nTrump denied a charge by Elise Stefanik, the Republican candidate for New York governor and one of his political allies, that Mamdani, a longtime critic of Israel, is a “jihadist,” saying, “I just met with a man who’s a very rational person” and adding that they both wanted peace in the Middle East.\n\nTrump said he’d happily live in Mamdani’s New York, countering conservative suggestions that rich New Yorkers should flee the city. He praised Mamdani’s decision to keep New York’s police commissioner, Jessica Tisch, noting she was a friend of the president’s daughter Ivanka. And he demurred when asked about Mamdani’s democratic socialism, saying instead that the two had many similar ideas. He noted — and Mamdani emphasized repeatedly — that they’d both run for office on affordability.\n\nIt was an inconvenient defense of democratic socialism on the very day that House Republicans muscled through a resolution condemning socialism with the express intent of embarassing their rivals over the mayor-elect. Trump even threw in some praise of another Republican punching bag, Vermont Sen. Bernie Sanders, also a democratic socialist.\n\n“Bernie Sanders and I agreed on much more than people thought,” Trump said. He added proudly that Mamdani was wowed by a painting of iconic Democratic President Franklin Delano Roosevelt — yet another GOP bugbear — in the Oval Office.\n\nTrump, struggling amid mounting dissatisfaction in his first year back in office, may see an advantage in lashing his star to that of the latest avatar of affordability.\n\nOf course, both Trump and Mamdani are experts at the 21st century art of political brawling and Trump is notoriously mercurial, so the detente may be short-lived. But it’s notable while it’s here.\n\nMamdani’s visit lets Trump talk about affordability\n\nFor the past few weeks, Trump has struggled to address voters’ concerns about inflation, suggesting that prices are already down and any claims otherwise are a “con job by the Democrats.” But Mamdani stomped his competition in the mayoral election by focusing relentlessly on the cost of rent, groceries and other basic needs — a successful strategy that White House officials noticed as they think about next year’s midterms.\n\nThe president leaned into that message in their White House meeting, saying he sees his efforts as complementary. He said that just like Mamdani, he too wants to build more housing. The president didn’t lay out any new policies as he repeated his claims that inflation has dropped under his watch.\n\n“Anything I do is going to be good for New York if I can get prices down,” Trump said. “The new word is affordability. Another word is just groceries. You know, it’s sort of an old-fashioned word, but it’s very accurate. And they’re coming down. They’re coming down.”\n\nThe challenge for Trump is whether voters trust that he’s genuinely addressing inflation. The consumer price index has jumped to an annual rate of 3% compared to 2.3% in April, when the president rolled out his “Liberation Day” import taxes.\n\nA confidence boost for Mamdani — with implications for his agenda\n\nThroughout his campaign, Mamdani’s opponents claimed his far-left politics and relative inexperience would make him an easy target for Trump. Friday’s meeting will likely quiet those concerns — at least for now. Trump seemed thoroughly impressed with Mamdani, describing him as “a very rational man” who “wants to see New York be great again.”\n\n“We had some interesting conversations and some of his ideas are the same that I have,” Trump added.\n\nFor his part, Mamdani struck a delicate balance: flattering Trump in broad terms, while avoiding sensitive subjects or concessions that could enrage his base. He noted repeatedly that many of his own voters were former Democrats who switched over to Trump in the previous election — a line the president seemed to like.\n\nThe backing of the president could help the mayor-elect avoid a National Guard deployment in New York, which Trump previously threatened as a likely outcome of his election victory. Trump also indicated that federal funding cuts could be off the table — a move that would give Mamdani a much better shot at achieving his ambitious agenda, which requires raising revenue for programs like universal free childcare.\n\n“I want him to do a great job and will help him do a great job,” Trump said.","url":"https://www.pilotonline.com/2025/11/21/trump-mamdani-takeaways/","image":"https://www.pilotonline.com/wp-content/uploads/2025/11/Trump_87494_0764df.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-22 00:20:06","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.038},{"id":381413618,"title":"Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag","text":"By NICHOLAS RICCARDI, JOSH BOAK and JAKE OFFENHARTZ\n\nThe two had called each other “fascist” and “communist,” but when President Donald Trump and New York City Mayor-elect Zohran Mamdani faced reporters in the Oval Office on Friday, they were just two iconoclastic New York politicians who were all smiles.\n\nThe much-anticipated face-to-face showed how the politicians’ shared love of New York City — and no doubt some political calculus — could paper over months of insults. Both men used a plainspoken, wry approach tailor-made for the age of social media to make their points, and each left the meeting with something he needed.\n\nHere are some takeaways from the appearance.\n\nRepublicans lose their punching bag — at least for now\n\nTrump’s party had been queueing up a 2026 campaign warning that the Democratic Party is getting taken over by people like Mamdani, a 34-year-old Muslim and self-described democratic socialist who may not play as well west of the Hudson River. But Trump swatted all that down.\n\n“The better he does, the happier I am,” Trump, a native New Yorker, said of Mamdani.\n\nTrump denied a charge by Elise Stefanik, the Republican candidate for New York governor and one of his political allies, that Mamdani, a longtime critic of Israel, is a “jihadist,” saying, “I just met with a man who’s a very rational person” and adding that they both wanted peace in the Middle East.\n\nTrump said he’d happily live in Mamdani’s New York, countering conservative suggestions that rich New Yorkers should flee the city. He praised Mamdani’s decision to keep New York’s police commissioner, Jessica Tisch, noting she was a friend of the president’s daughter Ivanka. And he demurred when asked about Mamdani’s democratic socialism, saying instead that the two had many similar ideas. He noted — and Mamdani emphasized repeatedly — that they’d both run for office on affordability.\n\nIt was an inconvenient defense of democratic socialism on the very day that House Republicans muscled through a resolution condemning socialism with the express intent of embarassing their rivals over the mayor-elect. Trump even threw in some praise of another Republican punching bag, Vermont Sen. Bernie Sanders, also a democratic socialist.\n\n“Bernie Sanders and I agreed on much more than people thought,” Trump said. He added proudly that Mamdani was wowed by a painting of iconic Democratic President Franklin Delano Roosevelt — yet another GOP bugbear — in the Oval Office.\n\nTrump, struggling amid mounting dissatisfaction in his first year back in office, may see an advantage in lashing his star to that of the latest avatar of affordability.\n\nOf course, both Trump and Mamdani are experts at the 21st century art of political brawling and Trump is notoriously mercurial, so the detente may be short-lived. But it’s notable while it’s here.\n\nMamdani’s visit lets Trump talk about affordability\n\nFor the past few weeks, Trump has struggled to address voters’ concerns about inflation, suggesting that prices are already down and any claims otherwise are a “con job by the Democrats.” But Mamdani stomped his competition in the mayoral election by focusing relentlessly on the cost of rent, groceries and other basic needs — a successful strategy that White House officials noticed as they think about next year’s midterms.\n\nThe president leaned into that message in their White House meeting, saying he sees his efforts as complementary. He said that just like Mamdani, he too wants to build more housing. The president didn’t lay out any new policies as he repeated his claims that inflation has dropped under his watch.\n\n“Anything I do is going to be good for New York if I can get prices down,” Trump said. “The new word is affordability. Another word is just groceries. You know, it’s sort of an old-fashioned word, but it’s very accurate. And they’re coming down. They’re coming down.”\n\nThe challenge for Trump is whether voters trust that he’s genuinely addressing inflation. The consumer price index has jumped to an annual rate of 3% compared to 2.3% in April, when the president rolled out his “Liberation Day” import taxes.\n\nA confidence boost for Mamdani — with implications for his agenda\n\nThroughout his campaign, Mamdani’s opponents claimed his far-left politics and relative inexperience would make him an easy target for Trump. Friday’s meeting will likely quiet those concerns — at least for now. Trump seemed thoroughly impressed with Mamdani, describing him as “a very rational man” who “wants to see New York be great again.”\n\n“We had some interesting conversations and some of his ideas are the same that I have,” Trump added.\n\nFor his part, Mamdani struck a delicate balance: flattering Trump in broad terms, while avoiding sensitive subjects or concessions that could enrage his base. He noted repeatedly that many of his own voters were former Democrats who switched over to Trump in the previous election — a line the president seemed to like.\n\nThe backing of the president could help the mayor-elect avoid a National Guard deployment in New York, which Trump previously threatened as a likely outcome of his election victory. Trump also indicated that federal funding cuts could be off the table — a move that would give Mamdani a much better shot at achieving his ambitious agenda, which requires raising revenue for programs like universal free childcare.\n\n“I want him to do a great job and will help him do a great job,” Trump said.","url":"https://www.courant.com/2025/11/21/trump-mamdani-takeaways/","image":"https://www.courant.com/wp-content/uploads/2025/11/Trump_87494_0764df.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-22 00:20:06","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":0.038},{"id":381411414,"title":"Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag","text":"By NICHOLAS RICCARDI, JOSH BOAK and JAKE OFFENHARTZ\n\nThe two had called each other “fascist” and “communist,” but when President Donald Trump and New York City Mayor-elect Zohran Mamdani faced reporters in the Oval Office on Friday, they were just two iconoclastic New York politicians who were all smiles.\n\nThe much-anticipated face-to-face showed how the politicians’ shared love of New York City — and no doubt some political calculus — could paper over months of insults. Both men used a plainspoken, wry approach tailor-made for the age of social media to make their points, and each left the meeting with something he needed.\n\nHere are some takeaways from the appearance.\n\nRepublicans lose their punching bag — at least for now\n\nTrump’s party had been queueing up a 2026 campaign warning that the Democratic Party is getting taken over by people like Mamdani, a 34-year-old Muslim and self-described democratic socialist who may not play as well west of the Hudson River. But Trump swatted all that down.\n\n“The better he does, the happier I am,” Trump, a native New Yorker, said of Mamdani.\n\nTrump denied a charge by Elise Stefanik, the Republican candidate for New York governor and one of his political allies, that Mamdani, a longtime critic of Israel, is a “jihadist,” saying, “I just met with a man who’s a very rational person” and adding that they both wanted peace in the Middle East.\n\nTrump said he’d happily live in Mamdani’s New York, countering conservative suggestions that rich New Yorkers should flee the city. He praised Mamdani’s decision to keep New York’s police commissioner, Jessica Tisch, noting she was a friend of the president’s daughter Ivanka. And he demurred when asked about Mamdani’s democratic socialism, saying instead that the two had many similar ideas. He noted — and Mamdani emphasized repeatedly — that they’d both run for office on affordability.\n\nIt was an inconvenient defense of democratic socialism on the very day that House Republicans muscled through a resolution condemning socialism with the express intent of embarassing their rivals over the mayor-elect. Trump even threw in some praise of another Republican punching bag, Vermont Sen. Bernie Sanders, also a democratic socialist.\n\n“Bernie Sanders and I agreed on much more than people thought,” Trump said. He added proudly that Mamdani was wowed by a painting of iconic Democratic President Franklin Delano Roosevelt — yet another GOP bugbear — in the Oval Office.\n\nTrump, struggling amid mounting dissatisfaction in his first year back in office, may see an advantage in lashing his star to that of the latest avatar of affordability.\n\nOf course, both Trump and Mamdani are experts at the 21st century art of political brawling and Trump is notoriously mercurial, so the detente may be short-lived. But it’s notable while it’s here.\n\nMamdani’s visit lets Trump talk about affordability\n\nFor the past few weeks, Trump has struggled to address voters’ concerns about inflation, suggesting that prices are already down and any claims otherwise are a “con job by the Democrats.” But Mamdani stomped his competition in the mayoral election by focusing relentlessly on the cost of rent, groceries and other basic needs — a successful strategy that White House officials noticed as they think about next year’s midterms.\n\nThe president leaned into that message in their White House meeting, saying he sees his efforts as complementary. He said that just like Mamdani, he too wants to build more housing. The president didn’t lay out any new policies as he repeated his claims that inflation has dropped under his watch.\n\n“Anything I do is going to be good for New York if I can get prices down,” Trump said. “The new word is affordability. Another word is just groceries. You know, it’s sort of an old-fashioned word, but it’s very accurate. And they’re coming down. They’re coming down.”\n\nThe challenge for Trump is whether voters trust that he’s genuinely addressing inflation. The consumer price index has jumped to an annual rate of 3% compared to 2.3% in April, when the president rolled out his “Liberation Day” import taxes.\n\nA confidence boost for Mamdani — with implications for his agenda\n\nThroughout his campaign, Mamdani’s opponents claimed his far-left politics and relative inexperience would make him an easy target for Trump. Friday’s meeting will likely quiet those concerns — at least for now. Trump seemed thoroughly impressed with Mamdani, describing him as “a very rational man” who “wants to see New York be great again.”\n\n“We had some interesting conversations and some of his ideas are the same that I have,” Trump added.\n\nFor his part, Mamdani struck a delicate balance: flattering Trump in broad terms, while avoiding sensitive subjects or concessions that could enrage his base. He noted repeatedly that many of his own voters were former Democrats who switched over to Trump in the previous election — a line the president seemed to like.\n\nThe backing of the president could help the mayor-elect avoid a National Guard deployment in New York, which Trump previously threatened as a likely outcome of his election victory. Trump also indicated that federal funding cuts could be off the table — a move that would give Mamdani a much better shot at achieving his ambitious agenda, which requires raising revenue for programs like universal free childcare.\n\n“I want him to do a great job and will help him do a great job,” Trump said.","summary":"Republicans hoped to make Mamdani a poster boy for Democratic party excess and radicalism.","url":"https://www.twincities.com/2025/11/21/trump-mamdani-takeaways/","image":"https://www.twincities.com/wp-content/uploads/2025/11/Trump_87494_0764df.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-22 00:20:06","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.038},{"id":381410150,"title":"Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag","text":"By NICHOLAS RICCARDI, JOSH BOAK and JAKE OFFENHARTZ\n\nThe two had called each other “fascist” and “communist,” but when President Donald Trump and New York City Mayor-elect Zohran Mamdani faced reporters in the Oval Office on Friday, they were just two iconoclastic New York politicians who were all smiles.\n\nThe much-anticipated face-to-face showed how the politicians’ shared love of New York City — and no doubt some political calculus — could paper over months of insults. Both men used a plainspoken, wry approach tailor-made for the age of social media to make their points, and each left the meeting with something he needed.\n\nHere are some takeaways from the appearance.\n\nRepublicans lose their punching bag — at least for now\n\nTrump’s party had been queueing up a 2026 campaign warning that the Democratic Party is getting taken over by people like Mamdani, a 34-year-old Muslim and self-described democratic socialist who may not play as well west of the Hudson River. But Trump swatted all that down.\n\n“The better he does, the happier I am,” Trump, a native New Yorker, said of Mamdani.\n\nTrump denied a charge by Elise Stefanik, the Republican candidate for New York governor and one of his political allies, that Mamdani, a longtime critic of Israel, is a “jihadist,” saying, “I just met with a man who’s a very rational person” and adding that they both wanted peace in the Middle East.\n\nTrump said he’d happily live in Mamdani’s New York, countering conservative suggestions that rich New Yorkers should flee the city. He praised Mamdani’s decision to keep New York’s police commissioner, Jessica Tisch, noting she was a friend of the president’s daughter Ivanka. And he demurred when asked about Mamdani’s democratic socialism, saying instead that the two had many similar ideas. He noted — and Mamdani emphasized repeatedly — that they’d both run for office on affordability.\n\nIt was an inconvenient defense of democratic socialism on the very day that House Republicans muscled through a resolution condemning socialism with the express intent of embarassing their rivals over the mayor-elect. Trump even threw in some praise of another Republican punching bag, Vermont Sen. Bernie Sanders, also a democratic socialist.\n\n“Bernie Sanders and I agreed on much more than people thought,” Trump said. He added proudly that Mamdani was wowed by a painting of iconic Democratic President Franklin Delano Roosevelt — yet another GOP bugbear — in the Oval Office.\n\nTrump, struggling amid mounting dissatisfaction in his first year back in office, may see an advantage in lashing his star to that of the latest avatar of affordability.\n\nOf course, both Trump and Mamdani are experts at the 21st century art of political brawling and Trump is notoriously mercurial, so the detente may be short-lived. But it’s notable while it’s here.\n\nMamdani’s visit lets Trump talk about affordability\n\nFor the past few weeks, Trump has struggled to address voters’ concerns about inflation, suggesting that prices are already down and any claims otherwise are a “con job by the Democrats.” But Mamdani stomped his competition in the mayoral election by focusing relentlessly on the cost of rent, groceries and other basic needs — a successful strategy that White House officials noticed as they think about next year’s midterms.\n\nThe president leaned into that message in their White House meeting, saying he sees his efforts as complementary. He said that just like Mamdani, he too wants to build more housing. The president didn’t lay out any new policies as he repeated his claims that inflation has dropped under his watch.\n\n“Anything I do is going to be good for New York if I can get prices down,” Trump said. “The new word is affordability. Another word is just groceries. You know, it’s sort of an old-fashioned word, but it’s very accurate. And they’re coming down. They’re coming down.”\n\nThe challenge for Trump is whether voters trust that he’s genuinely addressing inflation. The consumer price index has jumped to an annual rate of 3% compared to 2.3% in April, when the president rolled out his “Liberation Day” import taxes.\n\nA confidence boost for Mamdani — with implications for his agenda\n\nThroughout his campaign, Mamdani’s opponents claimed his far-left politics and relative inexperience would make him an easy target for Trump. Friday’s meeting will likely quiet those concerns — at least for now. Trump seemed thoroughly impressed with Mamdani, describing him as “a very rational man” who “wants to see New York be great again.”\n\n“We had some interesting conversations and some of his ideas are the same that I have,” Trump added.\n\nFor his part, Mamdani struck a delicate balance: flattering Trump in broad terms, while avoiding sensitive subjects or concessions that could enrage his base. He noted repeatedly that many of his own voters were former Democrats who switched over to Trump in the previous election — a line the president seemed to like.\n\nThe backing of the president could help the mayor-elect avoid a National Guard deployment in New York, which Trump previously threatened as a likely outcome of his election victory. Trump also indicated that federal funding cuts could be off the table — a move that would give Mamdani a much better shot at achieving his ambitious agenda, which requires raising revenue for programs like universal free childcare.\n\n“I want him to do a great job and will help him do a great job,” Trump said.","summary":"Republicans hoped to make Mamdani a poster boy for Democratic party excess and radicalism.","url":"https://www.bostonherald.com/2025/11/21/trump-mamdani-takeaways/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/Trump_87494_0764df.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-22 00:20:06","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.038},{"id":381413592,"title":"Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag","text":"By NICHOLAS RICCARDI, JOSH BOAK and JAKE OFFENHARTZ\n\nThe two had called each other “fascist” and “communist,” but when President Donald Trump and New York City Mayor-elect Zohran Mamdani faced reporters in the Oval Office on Friday, they were just two iconoclastic New York politicians who were all smiles.\n\nThe much-anticipated face-to-face showed how the politicians’ shared love of New York City — and no doubt some political calculus — could paper over months of insults. Both men used a plainspoken, wry approach tailor-made for the age of social media to make their points, and each left the meeting with something he needed.\n\nHere are some takeaways from the appearance.\n\nRepublicans lose their punching bag — at least for now\n\nTrump’s party had been queueing up a 2026 campaign warning that the Democratic Party is getting taken over by people like Mamdani, a 34-year-old Muslim and self-described democratic socialist who may not play as well west of the Hudson River. But Trump swatted all that down.\n\n“The better he does, the happier I am,” Trump, a native New Yorker, said of Mamdani.\n\nTrump denied a charge by Elise Stefanik, the Republican candidate for New York governor and one of his political allies, that Mamdani, a longtime critic of Israel, is a “jihadist,” saying, “I just met with a man who’s a very rational person” and adding that they both wanted peace in the Middle East.\n\nTrump said he’d happily live in Mamdani’s New York, countering conservative suggestions that rich New Yorkers should flee the city. He praised Mamdani’s decision to keep New York’s police commissioner, Jessica Tisch, noting she was a friend of the president’s daughter Ivanka. And he demurred when asked about Mamdani’s democratic socialism, saying instead that the two had many similar ideas. He noted — and Mamdani emphasized repeatedly — that they’d both run for office on affordability.\n\nIt was an inconvenient defense of democratic socialism on the very day that House Republicans muscled through a resolution condemning socialism with the express intent of embarassing their rivals over the mayor-elect. Trump even threw in some praise of another Republican punching bag, Vermont Sen. Bernie Sanders, also a democratic socialist.\n\n“Bernie Sanders and I agreed on much more than people thought,” Trump said. He added proudly that Mamdani was wowed by a painting of iconic Democratic President Franklin Delano Roosevelt — yet another GOP bugbear — in the Oval Office.\n\nTrump, struggling amid mounting dissatisfaction in his first year back in office, may see an advantage in lashing his star to that of the latest avatar of affordability.\n\nOf course, both Trump and Mamdani are experts at the 21st century art of political brawling and Trump is notoriously mercurial, so the detente may be short-lived. But it’s notable while it’s here.\n\nMamdani’s visit lets Trump talk about affordability\n\nFor the past few weeks, Trump has struggled to address voters’ concerns about inflation, suggesting that prices are already down and any claims otherwise are a “con job by the Democrats.” But Mamdani stomped his competition in the mayoral election by focusing relentlessly on the cost of rent, groceries and other basic needs — a successful strategy that White House officials noticed as they think about next year’s midterms.\n\nThe president leaned into that message in their White House meeting, saying he sees his efforts as complementary. He said that just like Mamdani, he too wants to build more housing. The president didn’t lay out any new policies as he repeated his claims that inflation has dropped under his watch.\n\n“Anything I do is going to be good for New York if I can get prices down,” Trump said. “The new word is affordability. Another word is just groceries. You know, it’s sort of an old-fashioned word, but it’s very accurate. And they’re coming down. They’re coming down.”\n\nThe challenge for Trump is whether voters trust that he’s genuinely addressing inflation. The consumer price index has jumped to an annual rate of 3% compared to 2.3% in April, when the president rolled out his “Liberation Day” import taxes.\n\nA confidence boost for Mamdani — with implications for his agenda\n\nThroughout his campaign, Mamdani’s opponents claimed his far-left politics and relative inexperience would make him an easy target for Trump. Friday’s meeting will likely quiet those concerns — at least for now. Trump seemed thoroughly impressed with Mamdani, describing him as “a very rational man” who “wants to see New York be great again.”\n\n“We had some interesting conversations and some of his ideas are the same that I have,” Trump added.\n\nFor his part, Mamdani struck a delicate balance: flattering Trump in broad terms, while avoiding sensitive subjects or concessions that could enrage his base. He noted repeatedly that many of his own voters were former Democrats who switched over to Trump in the previous election — a line the president seemed to like.\n\nThe backing of the president could help the mayor-elect avoid a National Guard deployment in New York, which Trump previously threatened as a likely outcome of his election victory. Trump also indicated that federal funding cuts could be off the table — a move that would give Mamdani a much better shot at achieving his ambitious agenda, which requires raising revenue for programs like universal free childcare.\n\n“I want him to do a great job and will help him do a great job,” Trump said.","url":"https://www.sun-sentinel.com/2025/11/21/trump-mamdani-takeaways/","image":"https://www.sun-sentinel.com/wp-content/uploads/2025/11/Trump_87494_0764df.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-22 00:20:06","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.038},{"id":381409584,"title":"Armed Attackers Kidnap Children From Catholic Elementary School in Nigeria","text":"The Diocese of Kontagora in Nigeria has described as “painful and disturbing” the Friday, Nov. 21, kidnapping of children and staff at St. Mary’s Catholic Nursery, Primary, and Secondary Schools.\n\nIn a statement shared with ACI Africa, CNA’s news partner in Africa, the diocesan secretary of the Nigerian episcopal see appealed for intensified national action against insecurity.\n\nFather Jatau Luka Joseph said armed attackers invaded St. Mary’s Catholic Primary and Secondary Schools in Papiri, Niger state, in the early hours of Nov. 21, abducting “some pupils, students, teachers, and a security personnel who was badly shot.”\n\n“The incident occurred between 1 a.m. and 3 a.m., causing fear and distress within the school community,” he said.\n\n“The Catholic Diocese of Kontagora strongly condemns the attack and expresses deep concern for the safety of the kidnapped children and their families,” Father Luka Joseph said.\n\nHe added that security agencies were immediately informed and had begun coordinated efforts to ensure the safe rescue and return of the victims.\n\nBishop Bulus Yohana Dauwa assured the public that the Kontagora Diocese is “actively collaborating with security operatives, community leaders, and government authorities.”\n\nThe diocese called on the public to “remain calm, support security efforts, and continue praying for the safe and quick return of all abducted.” It further reaffirmed its commitment to the protection of children and promised to provide further updates as verified information becomes available.\n\nThe statement shared by the diocesan secretary reads: “May the Lord grant quick release to those abducted and continue to protect his people from all danger. With prayers and sympathy.”\n\nNigeria has been battling with a surge of violence orchestrated by gangs, whose members carry out indiscriminate attacks, kidnapping for ransom, and in some cases, killing.\n\nBoko Haram insurgency has been a major challenge in the country since 2009, a group that allegedly aims to turn Africa’s most populous nation into an Islamic nation.\n\nThe insecurity situation in many other parts of the country has further been complicated by the involvement of the predominantly Muslim Fulani herdsmen, also referred to as the Fulani Militia.\n\nThe Nov. 21 attack and kidnappings follow a series of other abductions that have targeted members of the clergy in Africa’s most populous nation.\n\nOn Nov. 17, Father Bobbo Paschal was abducted from his residence when gunmen attacked St. Stephen Parish of Kaduna Archdiocese. During the attack, numerous people were kidnapped, and the brother of one priest, Father Anthony Yero, was killed.\n\nThe archdiocese on Nov. 20 refuted circulating social media reports that Paschal had been killed.\n\nOn Nov. 18, Bishop Dauwa raised concerns about the safety of children in the West African country following the Nov. 17 abduction of 25 school girls from Government Girls Comprehensive Secondary School in Maga, Kebbi state.\n\nIn an interview with ACI Africa, he described the incident as a tragic reminder that the country is no longer “safe for its children.”\n\nBishop Dauwa described the abduction as part of an escalating wave of violence sweeping across Kebbi and parts of Niger state. “It has never been this bad. People sleep in the bush because they have nowhere else to run,” he said.\n\nOn Nov. 19, one of the 25 kidnapped girls escaped and is now safe, authorities have confirmed, according to ACI Africa. \n\nThe student who escaped arrived home late Monday evening, hours after the kidnapping, according to the school principal, Musa Rabi Magaji.\n\nAs the international community expressed concern, Pope Leo XIV addressed the crisis Tuesday evening while departing the papal residence in Castel Gandolfo. \n\nResponding to a question from EWTN News, the Holy Father lamented the ongoing insecurity and called for renewed efforts to protect all civilians.\n\n“In Nigeria, in certain areas, there is certainly a danger for Christians — but for all people,” Pope Leo said, adding: “Christians and Muslims have been slaughtered. There’s a question of terrorism, a question tied to economics and control of land.”\n\nThe Pope noted that many Christians have died and emphasized that any long-term solution must involve cooperation between religious communities, civil authorities, and the Nigerian government.\n\n“It’s very important to seek a way… to promote authentic religious freedom,” he said.\n\nIn July, three minor seminarians were abducted during an armed attack on Immaculate Conception Minor Seminary in Nigeria’s Diocese of Auchi. All three endured months of torture despite pleas with abductors and the paying of ransoms. Two of the seminarians later regained their freedom, while the third died in captivity.\n\nU.S. President Donald Trump recently designated Nigeria as a country of particular concern (CPC) — a move that Father Hyacinth Ichoku, the vice chancellor of Veritas University in Abuja, said accords national leaders of the West African nation an opportunity for international collaboration rather than an act of hostility.\n\n“Anyone who can support us with equipment and help our soldiers in their war against bandits should be encouraged. That is what Trump wants for our country,” Father Ichoku told ACI Africa on Nov. 7 during Veritas University’s 14th convocation lecture.","summary":"cna","url":"https://www.ncregister.com/cna/armed-attackers-kidnap-children-from-catholic-elementary-school-in-nigeria","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/20230129220120_8c01f404c815a61cd0c366313270228fa38b20883962d44138faf52b1bd277bb.jpg","video":null,"publish_date":"2025-11-22 00:19:53","author":"Jude Atemanke/cna/aci Africa","authors":["Jude Atemanke/cna/aci Africa"],"language":"en","source_country":"US","sentiment":-0.175},{"id":381409820,"title":"Trump Says It's Totally Fine For Mamdani To Call Him A Fascist: 'That's OK'","text":"Although President Donald Trump hyped up his meeting Friday with New York City Mayor-elect Zohran Mamdani, nothing prepared social media for the exchange between the two of them.\n\nAnd while everyone knew there was a good chance of at least one viral moment, no one expected it would come when Trump told Mamdani it was “OK” for the democratic socialist to call him a fascist.\n\nWhen a New York Post reporter asked Mamdani if he stands by his previous statements that the president is a “despot” who has “betrayed the country” and promotes a “fascist agenda,” Mamdani did not disavow the comments. Instead, he spoke positively about Friday’s meeting and said he was focused on the “shared purpose” of serving New Yorkers.\n\nTrump, meanwhile, seemed amused by the question and joked, “I’ve been called much worse than a despot. So it’s not that insulting.”\n\nThen, after another reporter asked Mamdani if he still considered Trump a fascist, the typically thin-skinned president stopped Mamdani as he attempted a diplomatic response and said it was OK with him if he did.\n\n“That’s OK, you can just say yes,” Trump said, to which Mamdani smiled and said, “OK.”\n\n“It’s easier than explaining it. I don’t mind,” the president assured Mamdani before patting his arm.\n\nYou may have to see it below to believe it.\n\nTrump has frequently attacked socialism, Muslims, and Mamdani himself, even threatening to withhold funding from New York City if the democratic socialist became mayor. \n\nSo many people on social media were stunned by his apparently cordial meeting with the mayor-elect. But they tweeted through it anyway.","url":"https://www.huffpost.com/entry/social-media-trump-zohran-mamdani-meeting_n_6920dfa8e4b0d31c0a7a503d?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/6920e057170000e52fa90f38.jpeg?cache=UCoRkuDRZl&ops=1778_1000","video":null,"publish_date":"2025-11-22 00:18:56","author":"David Moye","authors":["David Moye"],"language":"en","source_country":"au","sentiment":-0.422},{"id":381409818,"title":"Trump Says It's Totally Fine For Mamdani To Call Him A Fascist: 'That's OK'","text":"Although President Donald Trump hyped up his meeting Friday with New York City Mayor-elect Zohran Mamdani, nothing prepared social media for the exchange between the two of them.\n\nAnd while everyone knew there was a good chance of at least one viral moment, no one expected it would come when Trump told Mamdani it was “OK” for the democratic socialist to call him a fascist.\n\nWhen a New York Post reporter asked Mamdani if he stands by his previous statements that the president is a “despot” who has “betrayed the country” and promotes a “fascist agenda,” Mamdani did not disavow the comments. Instead, he spoke positively about Friday’s meeting and said he was focused on the “shared purpose” of serving New Yorkers.\n\nTrump, meanwhile, seemed amused by the question and joked, “I’ve been called much worse than a despot. So it’s not that insulting.”\n\nThen, after another reporter asked Mamdani if he still considered Trump a fascist, the typically thin-skinned president stopped Mamdani as he attempted a diplomatic response and said it was OK with him if he did.\n\n“That’s OK, you can just say yes,” Trump said, to which Mamdani smiled and said, “OK.”\n\n“It’s easier than explaining it. I don’t mind,” the president assured Mamdani before patting his arm.\n\nYou may have to see it below to believe it.\n\nTrump has frequently attacked socialism, Muslims, and Mamdani himself, even threatening to withhold funding from New York City if the democratic socialist became mayor. \n\nSo many people on social media were stunned by his apparently cordial meeting with the mayor-elect. But they tweeted through it anyway.","url":"https://www.huffpost.com/entry/social-media-trump-zohran-mamdani-meeting_n_6920dfa8e4b0d31c0a7a503d?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6920e057170000e52fa90f38.jpeg?cache=UCoRkuDRZl&ops=1778_1000","video":null,"publish_date":"2025-11-22 00:18:56","author":"David Moye","authors":["David Moye"],"language":"en","source_country":"au","sentiment":-0.422},{"id":381413228,"title":"Umar Khalid &#8216;veteran of sedition&#8217;, anti-CAA protesters wanted regime change like in Nepal, Bangladesh: Delhi Police to SC on 2020 riots","text":"Calling 2020 riots accused Umar Khalid a “veteran of sedition”, the Delhi Police on Friday told the Supreme Court that the protests were not just a “simple dharna for (opposing the) Citizenship Amendment Act, it was for regime change…like in Nepal and Bangladesh.” “This is a clear case where offences under Unlawful Activities Prevention Act (UAPA), 1967, are attracted. A conspiracy to commit terrorist acts and murder is made out. And it was not simple dharna for CAA, it was for regime change. All those who went for dharna carried sticks, acid bottles, and (it) coincided with Donald Trump's visit — they wanted regime change like in Bangladesh and Nepal. They have scant regards to the constitution,” Additional Solicitor General (ASG) S V Raju, appearing for the Delhi Police, told a bench of Justice Aravind Kumar and N V Anjaria. The court is hearing appeals filed by Umar Khalid, Sharjeel Imam, Gulfisha Fatima, Meeran Haider, Shifa Ur Rehman, Mohd Saleem Khan, and Shadab Ahmad, challenging the Delhi High Court order denying them bail in the case of larger conspiracy behind the riots. Opposing their prayer for bail on the ground of undue delay in trial, Raju said the accused were responsible for the delay and cannot be given the benefit of the same. He added, “I can finish the trial in two years if they cooperate.\" Highlighting the violence in the wake of the riots, the ASG referred to Sharjeel Imam’s alleged speeches on severing the Chicken’s Neck area in Assam connecting the rest of India to Northeast and calls by some of the accused for disrupting economic supplies, and said that they attract the offence of 'terrorism' under Section 15 of the UAPA. The ASG pointed out that Umar Khalid had a case earlier too for his speech wherein he allegedly said \"Bharat tere tukde-tukde hoge\". Khalid, he said, is a \"veteran of sedition\" and had formed WhatsApp groups only with Muslim students for riots, the ASG said. “The intention was to cause havoc.\", he added. Raju said that on February 23, 2020, riots took place in North East Delhi but the conspirators still did not get their desired scale of violence as no murder could take place. So, the Delhi Protest Support Group (DPSG) – allegedly formed by the conspirators) members Athar and Shadab – again called a \"conspiratorial: meeting in the night at Mukhtyar’s house in Chand Bagh. “Absconding accused Suleman Siddiqui and one Ayub were also present. Therein, Athar informed that Nadeem bhai (a DPSG member) is annoyed as he is not getting the desired scale of violence in riots due to CCTVs,” the ASG said, adding that “this was revealed by a protected witness.” “The second step was to remove the CCTV cameras. Once CCTVs were damaged and destroyed, by 12:50 PM, large-scale mobilisation and subsequent violence was orchestrated in North-East Delhi as per conspiracy. Rioters attacked police in a planned manner at 1 PM. Head Constable Ratan Lal was killed in this attack at Chand Bagh and two IPS officers.were injured in a brutal manner inflicting life threatening injuries. One IB official Ankit Sharma was also killed. Rioters attacked police personnel with fire-arms, sharp edged weapons including swords, acid, stones etc. Sling-shots, fixed at roof earlier, were also used to throw acid bottles over the police personnel to get maximum casualties,” the ASG told the court. Raju told the bench that five accused — Tahir Hussain, Ishrat Jahan, Khalid Saifi, Shifa-Ur-Rehman and Meeran Haider — had allegedly financed the riots. Tahir Hussain provided Rs 1.3 crore and Shifa-Ur-Rehman Rs. 8.90 lakh, he submitted, adding that the Enforcement Directorate is probing the money trail. The hearing will now resume on November 24.","url":"https://indianexpress.com/article/cities/delhi/umar-khalid-veteran-of-sedition-anti-caa-protesters-wanted-regime-change-like-in-nepal-bangladesh-delhi-police-to-sc-on-2020-riots-10379368/","image":"https://images.indianexpress.com/2025/11/Umar-khalid-.jpg","video":null,"publish_date":"2025-11-22 00:18:56","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.53},{"id":381407378,"title":"World News | PM Modi Meets Australian Counterpart Albanese on Sidelines of G20 Summit, Pledges Deeper India-Australia Strategic Cooperation","text":"Johannesburg [South Africa], November 22 (ANI): Prime Minister Narendra Modi and Prime Minister of Australia, Anthony Albanese, met on Friday on the sidelines of the G20 Leaders' Summit in Johannesburg, South Africa, a press release from the Ministry of External Affairs said. \"Both leaders expressed satisfaction at the deepening and diversification of cooperation between India and Australia in the last five years following the elevation of the relationship to a Comprehensive Strategic Partnership in 2020. Prime Minister Albanese offered his solidarity on the recent terror attack in India. The leaders committed to strengthening the global fight against terrorism,\" the press release added. Also Read | Who Are Netra Mantena and Vamsi Gadiraju, the US-Based Couple Whose Luxury Udaipur Wedding Donald Trump Jr Is Attending?.\nBoth leaders reviewed ways to further deepen bilateral cooperation across a broad spectrum of areas, including political and strategic ties, defence and security, energy, trade and investment, critical minerals, technology, mobility, education, and people-to-people exchanges. The Prime Ministers also shared perspectives on regional and global matters of mutual concern. During their meeting, PM Modi and PM Albanese noted that regular high-level engagements have added significant momentum to the relationship between India and Australia. Reaffirming their shared vision, the two leaders pledged to elevate the India-Australia Comprehensive Strategic Partnership to new heights.\nAlso Read | IAF Plane Crash in Dubai: Tejas Fighter Jet Meets With Accident During Aerial Display at Dubai Air Show, Indian Air Force Regrets 'Loss of Life' (Watch Videos).\nPM Modi will attend the summit from November 21 to 23, marking a significant milestone as the first G20 summit held on the African continent. He will discuss key issues related to India and the global south.\nThis will be PM Modi's fourth official visit to South Africa, following his bilateral visit in 2016 and his attendance at the two BRICS summits in 2018 and 2023.\nThis summit is the fourth consecutive G20 meeting hosted by the Global South, following Indonesia, India, and Brazil's presidencies. Prior to South Africa, the G20 presidencies were held by Brazil (2024), India (2023) and Indonesia (2022). The G20 comprises major economies representing 85% of global GDP and 75% of international trade. The forum has identified priority areas under South Africa's presidency theme of 'Solidarity, Equality, Sustainability'. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi and Prime Minister of Australia, Anthony Albanese, met on Friday on the sidelines of the G20 Leaders' Summit in Johannesburg, South Africa, a press release from the Ministry of External Affairs said.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-meets-australian-counterpart-albanese-on-sidelines-of-g20-summit-pledges-deeper-india-australia-strategic-cooperation-7213873.html","image":"https://st1.latestly.com/wp-content/uploads/2025/11/ANI-20251121212339.jpg","video":null,"publish_date":"2025-11-22 00:18:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.466},{"id":381413130,"title":"Court Overturns Trump-Era Funding Cuts, Blocks Enforcement","text":"A federal judge has effectively halted the Trump administration’s plans to implement a series of contentious budget cuts.\n\nThe case, spearheaded by Rhode Island, involves a coalition of states opposing the administration’s attempts to slash funding and undermine operations at four key agencies responsible for managing library resources, business development, and mediation services. This is detailed in a 58-page complaint filed earlier this year.\n\nIn May, Chief U.S. District Judge John J. McConnell, Jr., appointed by Barack Obama, issued a preliminary injunction preventing the Trump administration from enacting the proposed cuts. This order required certain agency officials to reinstate essential staff and contractors, as well as distribute previously allocated grants and provide other forms of relief.\n\nSince the injunction, Justice Department lawyers have made multiple unsuccessful attempts to limit its impact, including a recent effort to halt proceedings due to the impending government shutdown.\n\nThe judge has now decisively ruled in favor of the plaintiffs, declaring that the Trump administration “acted without constitutional or statutory authority” when pursuing these budget reductions.\n\nIn a comprehensive 47-page memorandum and order, Judge McConnell characterizes the issue as an effort by the Trump administration to “dismantle federal agencies.”\n\n“By now, the question presented in this case is a familiar one: may the Executive Branch undertake such actions in circumvention of the will of the Legislative Branch?” the order asks and then answers. “In recent months, this Court—along with other courts across the country—has concluded that it may not. That answer remains the same here.”\n\nOf note, the original litigation sought to block funding cuts at three agencies — and earlier versions of relief only applied to three agencies. Since filing an amended complaint, however, a fourth agency was named as a defendant. The Friday ruling covers all four agencies.\n\nThe lawsuit was largely based on violations of the Administrative Procedure Act (APA), the federal statute governing the behavior of federal agencies. In ruling on dueling motions for summary judgment, the judge explained how the plaintiffs secured a vacatur — a form of annulment widely used in APA cases — of the executive order issued by President Donald Trump which set the funding cuts in motion.\n\n“Because Defendants’ actions were ‘arbitrary and capricious’ and ‘contrary to law,’ the Court concludes that the proper remedy is to vacate those actions in their entirety,” McConnell writes, signaling the use of two terms of art in reaching his conclusion.\n\nUnder longstanding APA precedent, the popularized “arbitrary and capricious” term describes government actions that go too far while simultaneously eschewing formal, mandatory processes. The notion of something being “contrary to law,” while perhaps a bit more self-explanatory, is also language native to the APA — and part of the same widely-used framework for assessing agency behavior.\n\nHere, the court reiterates its earlier findings from the order granting the preliminary injunction, explaining that “Congress mandated certain staffing requirements” for the defendant agencies and tasked them with “various functions” in order to carry out statutory duties.\n\n“Defendants have acted ‘contrary to law’ because they have made it impossible for the agency to continue to perform its statutory duties,” the court says, in an analysis typical to each named defendant.\n\nAdditionally, McConnell relies on a recent report by the Trump administration’s own Government Accountability Office (GAO).\n\nIn the court’s words, this report says one of the defendant agencies “unlawfully withheld funds that Congress had appropriated” in violation of the Impoundment Control Act (ICA), a law governing how the executive branch can delay or cancel already-appropriated funds.\n\n“Defendants also acted unlawfully when they failed to follow the procedures set forth in the ICA for rescinding or deferring funds appropriated to each agency,” the court summarized.\n\nMcConnell says the agencies did not follow mandatory ICA processes – and invokes a common iteration of the “contrary to law” phrase.\n\n“Also important to note—for the purposes of this claim—that contrary to law ‘means, of course, any law, and not merely those laws that the agency itself is charged with administering,’” the order goes on. “The Court therefore finds that Defendants’ actions in implementing the Reduction [executive order] were ‘not in accordance with law’ and must be set aside.”\n\nMcConnell also outlined some constitutional problems with the spending cuts.\n\n“[T]he President has no statutory authority to cancel appropriations passed by Congress or abolish federal agencies created by Congress,” the order continues. “Accordingly, the Court finds that Defendants violated the Constitution’s Take Care Clause and the Separation of Powers doctrine.”\n\nBut the court was not nearly done. The judge granted proactive relief for the plaintiff states to make sure the funds continue flowing.\n\nMcConnell issued a permanent injunction barring the agencies “from taking any future actions to implement, give effect to, comply with, or carry out the directives contained in” Trump’s executive order.\n\nPart of the court’s analysis assesses the harm each side might suffer should they find themselves on the losing end of the litigation. Here, McConnell says there might be “some harm” to the defendant agencies “were they erroneously required to pay funds that could not later be recouped” but determines the harm to the states without the money is far worse.\n\nFrom the order, at length:\n\n[C]onsider the public libraries in New Mexico, New Jersey, Maine, and Oregon that would have to close branches, implement hiring freezes, and/or cease providing services that aim to foster literacy and support learning among its patrons…Or consider the State universities in Hawai’i, Maryland, and Arizona that would be forced to eliminate their student programming, default on their contracts, and/or terminate their employees absent continued funding…Next, consider the State entities in Rhode Island, Illinois, and Minnesota that face the very real prospect of work stoppage and negotiation impasses should their labor disputes go unresolved…And finally, consider the loss that Michigan, New York, and Wisconsin would suffer without the research-based and community-specific expert assistance that each State’s agencies have continuously relied on in their efforts to support unhoused individuals.\n\nIn sum, the court found the states’ professed harms “are far more than merely economic or speculative.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump listens to a question from a reporter as he&#8230;\n\n\nThis Post: Court Overturns Trump-Era Funding Cuts, Blocks Enforcement first appeared on Internewscast Journal","url":"https://internewscast.com/crime/court-overturns-trump-era-funding-cuts-blocks-enforcement/","image":"https://internewscast.com/wp-content/uploads/2025/10/Ex-judges-use-Alexander-Hamilton-to-warn-SCOTUS-about-Trump.jpg","video":null,"publish_date":"2025-11-22 00:16:35","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":381411500,"title":"Odd couple Trump and Mamdani sing from same song sheet in remarkable meeting","text":"Washington: Donald Trump began to soften on Zohran Mamdani when it became clear the young Muslim democratic socialist was going to become the next mayor of New York. The president loves a winner. Now, he seems to have melted like butter.\n\nThe odd couple met for the first time on Saturday (AEDT) in the Oval Office amid a flurry of media interest. Trump’s team happily heightened expectations. “We have a communist coming to the White House,” press secretary Karoline Leavitt teased.\n\nWhat would happen? Would there be fireworks? Yelling? A walk-out?\n\nIn the end, none of the above. When they fronted the cameras after their meeting, Trump and Mamdani sang from the same song sheet. They might as well have sung Kumbaya.","summary":"“I’ll be cheering for him,” the US president said of the man he had previously branded a communist lunatic, completing his backflip on the Muslim democratic socialist mayor-elect.","url":"https://www.smh.com.au/world/north-america/odd-couple-trump-and-mamdani-sing-from-same-song-sheet-in-remarkable-meeting-20251122-p5nhk4.html","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/886b4b594c9eb6fc015af649ce1e6d2b032198cd","video":null,"publish_date":"2025-11-22 00:14:59","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","source_country":"au","sentiment":-0.269},{"id":381409792,"title":"Odd couple Trump and Mamdani sing from same song sheet in remarkable meeting","text":"Washington: Donald Trump began to soften on Zohran Mamdani when it became clear the young Muslim democratic socialist was going to become the next mayor of New York. The president loves a winner. Now, he seems to have melted like butter.\n\nThe odd couple met for the first time on Saturday (AEDT) in the Oval Office amid a flurry of media interest. Trump’s team happily heightened expectations. “We have a communist coming to the White House,” press secretary Karoline Leavitt teased.\n\nWhat would happen? Would there be fireworks? Yelling? A walk-out?\n\nIn the end, none of the above. When they fronted the cameras after their meeting, Trump and Mamdani sang from the same song sheet. They might as well have sung Kumbaya.","url":"https://www.brisbanetimes.com.au/world/north-america/odd-couple-trump-and-mamdani-sing-from-same-song-sheet-in-remarkable-meeting-20251122-p5nhk4.html","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/886b4b594c9eb6fc015af649ce1e6d2b032198cd","video":null,"publish_date":"2025-11-22 00:14:59","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","source_country":"au","sentiment":-0.269},{"id":381409374,"title":"Odd couple Trump and Mamdani sing from same song sheet in remarkable meeting","text":"Washington: Donald Trump began to soften on Zohran Mamdani when it became clear the young Muslim democratic socialist was going to become the next mayor of New York. The president loves a winner. Now, he seems to have melted like butter.\n\nThe odd couple met for the first time on Saturday (AEDT) in the Oval Office amid a flurry of media interest. Trump’s team happily heightened expectations. “We have a communist coming to the White House,” press secretary Karoline Leavitt teased.\n\nWhat would happen? Would there be fireworks? Yelling? A walk-out?\n\nIn the end, none of the above. When they fronted the cameras after their meeting, Trump and Mamdani sang from the same song sheet. They might as well have sung Kumbaya.","summary":"“I’ll be cheering for him,” the US president said of the man he had previously branded a communist lunatic, completing his backflip on the Muslim democratic socialist mayor-elect.","url":"https://www.theage.com.au/world/north-america/odd-couple-trump-and-mamdani-sing-from-same-song-sheet-in-remarkable-meeting-20251122-p5nhk4.html","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/886b4b594c9eb6fc015af649ce1e6d2b032198cd","video":null,"publish_date":"2025-11-22 00:14:59","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","source_country":"au","sentiment":-0.269},{"id":381414550,"title":"S&amp;P 500, NASDAQ and Dow futures show big gains after Wall Street ended volatile week on a high with AI stocks dictating things; here’s how key indices performed","text":"APS&P 500, NASDAQ and Dow futures show big gains.\n\nAfter Wall Street ended the week on Friday (November 21, 2025) on the higher side, US stocks futures also posted a strong showing with three key indices, S&P 500, Dow and NASDAQ recording gains.As of Friday November 21 2025 5:38 PM EST, Dow futures increased by 552 points with the index closing at 45,752.26 and the futures rising to 46,377, according to CNBC. S&P 500 futures also advanced. The index closed at 6,538.76, while futures moved up to 6,631.5, reflecting a gain of 74 points. NASDAQ futures saw notable momentum as well. The index closed at 24,054.38, and futures climbed to 24,349, an increase of 217.5 points.Meanwhile, after witnessing multiple fluctuations on Friday morning, the S&P 500 took off and rallied nearly 2% before finishing with a gain of 1%. The Dow Jones Industrial Average climbed 493 points, or 1.1%, and the Nasdaq composite rose 0.9%.The swings peaked on Thursday (November 21, 2025), when US stocks initially surged after Nvidia seemed to tamp down worries about a potential bubble in artificial-intelligence technology. But the market quickly dropped to a sharp loss in its biggest one-day reversal since April, when President Donald Trump shocked markets with his \"Liberation Day\" tariffs.Despite the strong profit report from Nvidia, whose chips are powering the move into AI, worries are still hanging around about the longer term. AI-linked stocks continued to swing on Friday, helping to drag the rest of the market behind them. Nvidia went from an initial gain to a drop of 4.3% and then swung back and forth before finishing with a loss of 1%, for example. Amazon went from an early loss to a gain of 1.6%.Live EventsThe S&P 500 rose 64.23 points to 6,602.99. The Dow Jones Industrial Average gained 493.15 to 46,245.41, and the Nasdaq composite climbed 195.03 to 22,273.08.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onS&P 500Dow futuresNASDAQ gainsAI stocksWall Street\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onS&P 500Dow futuresNASDAQ gainsAI stocksWall Street(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"US stock futures recorded gains on Friday after Wall Street closed higher. Futures for the S&amp;P 500, Dow, and NASDAQ also showed significant gains. After witnessing multiple fluctuations on Friday morning, the S&amp;P 500 took off and rallied nearly 2% before finishing with a gain of 1%. The Dow Jones Industrial Average climbed 493 points, or 1.1%, and the Nasdaq composite rose 0.9%.","url":"https://economictimes.indiatimes.com/news/international/us/sp-500-nasdaq-and-dow-futures-show-big-gains-after-wall-street-ended-volatile-week-on-a-high-with-ai-stocks-dictating-things-heres-how-key-indices-performed/articleshow/125497405.cms","image":"https://img.etimg.com/thumb/msid-125497412,width-1200,height-630,imgsize-340416,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-22 00:14:47","author":"Wall Street","authors":["Wall Street"],"language":"en","source_country":"in","sentiment":0.108}]}