{"offset":0,"number":50,"available":14650,"news":[{"id":392788202,"title":"Russia calls US threats against Iran ‘categorically unacceptable,’ warns of ‘disastrous consequences’","text":"Russia sharply criticised what it called “subversive external interference” in Iran’s internal affairs and denounced US threats of military action, saying such moves are “categorically unacceptable” and would have “disastrous consequences” for the Middle East and global security, according to a statement by the Russian Foreign Ministry.The remarks underline Moscow’s firm opposition to foreign involvement in Iran’s internal crisis and mirror Tehran’s own narrative that external powers are stoking unrest.Trump’s hardline response to Iran protestsThe Russian statement followed a sharp intervention by US President Donald Trump, who on January 13 said he has cancelled talks with Iranian officials and publicly backed mass protests against Tehran’s crackdown.Trump wrote on Truth Social: “Iranian Patriots, KEEP PROTESTING — TAKE OVER YOUR INSTITUTIONS!!!… HELP IS ON ITS WAY.”Trump’s comments came as human rights monitors reported that over 2,000 people have been killed and thousands arrested in protests that have spread nationwide.Earlier in the week Trump warned Iran not to use lethal force, saying “we’re watching it very closely” and that violent suppression could draw a strong US response.Protests escalate amid crackdownThe unrest, which began in late December as protests against economic hardship, has evolved into broader anti‑government demonstrations. Human rights groups report hundreds of deaths and widespread arrests.Iranian authorities have imposed internet and communications blackouts to limit information flow and have accused foreign powers — particularly the US and Israel — of fomenting the unrest. Tehran’s foreign ministry has condemned “interventionist statements” by Washington as violations of international law and Iranian sovereignty.The tense backdrop includes recent US actions such as imposing 25% tariffs on countries doing business with Iran, part of broader pressure on Tehran.Global reactions to the crisisInternational responses have been mixed, with some Western leaders supporting calls for accountability and human rights, while others emphasise respect for sovereignty and caution against escalation — reflecting deep divisions over how to address Iran’s protest crisis.","url":"https://www.livemint.com/news/world/russia-calls-us-threats-against-iran-categorically-unacceptable-warns-of-disastrous-consequences-11768329101786.html","image":"https://www.livemint.com/lm-img/img/2026/01/13/1600x900/logo/Iran-Protests-4_1768330029279_1768330044210.jpg","video":null,"publish_date":"2026-01-14 18:48:13","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","category":"politics","source_country":"in","sentiment":-0.117},{"id":392849554,"title":"\"Continue the struggle, don't let this regime portray situation as normal\": Reza Pahlavi urges Iranians","text":"Washington DC [US], January 14 (ANI): Amid continuing protests in Iran, exiled crown prince Reza Pahlavi on Tuesday (local time) appealed to protesters and the country's armed forces, asserting that the world not only saw and heard the demonstrators' courage and voice but is also \"taking action\".He urged citizens to sustain the movement against the Khamenei regime and warned that those responsible for violence would eventually be held accountable.In a video message shared on X, Pahlavi said the US President Donald Trump had responded to the protests, asserting that the voices of Iranians were being heard beyond the country's borders. Addressing protesters directly, he said, \"My compatriots, as I told you in my previous message, the world not only saw and heard your courage and voice but is taking action. By now, you have undoubtedly heard the message from the President of the United States. Help is on the way.\"\n\nهم‌میهنانم، همانطور که در پیام قبلیم به شما گفتم، جهانیان نه تنها شجاعت و صدای شما را دیدند و شنیدند بلکه دارند اقدام می‌کنند. قاعدتاً تا الان پیام رییس‌جمهوری آمریکا را شنیده‌اید. کمک در راه است.مبارزه را ادامه بدهید. نگذارید که این رژیم، شرایط را عادی جلوه بدهد. بعد از این… pic.twitter.com/TlK3Le43bd— Reza Pahlavi (@PahlaviReza) January 13, 2026\n\nFurther, Pahlavi called on demonstrators to remain steadfast and requested them not to let the Khamenei regime \"portray the situation as normal\".\"Continue the struggle. Do not let this regime portray the situation as normal,\" he said, adding that the scale of violence had permanently altered the relationship between the people and the ruling system. \"After all this killing, there is an ocean of blood between us and this regime,\" he said.The exiled Crown Prince urged citizens to document alleged abuses committed during the protests. \"Write down the names of these criminals. One day, they will face justice for their actions,\" he said.In a direct appeal to Iran's security forces and military personnel, Pahlavi sought to distinguish the nation from its current rulers. \"And I have a special message for the military personnel: You are the national army of Iran, not the army of the Islamic Republic,\" he said.He called on them to refuse orders that harm civilians and to side with protesters. \"It is your duty to protect the lives of your fellow compatriots. You do not have much time left. Join the people as soon as possible,\" Pahlavi added. Pahlavi has been living in exile since his father, Iran's last shah, was toppled in the 1979 Islamic Revolution that brought the current system to power. He said he has been in contact with the Trump administration, though he did not disclose details of their discussions.Meanwhile, in a post on X, the US House Foreign Affairs Committee Majority urged the public to change the inevitable Khamenei regime.\n\nTo the Iranian people: Ayatollah @khamenei_ir has butchered your people, made rial the weakest currency in the world, and squandered your country’s resources.Make regime change inevitable.— House Foreign Affairs Committee Majority (@HouseForeignGOP) January 13, 2026\n\n\"To the Iranian people: Ayatollah @khamenei_ir has butchered your people, made rial the weakest currency in the world, and squandered your country's resources. Make regime change inevitable,\" the post read. Iran has been witnessing sustained nationwide protests since late December, drawing divided reactions internationally, with some governments expressing concern over what they describe as foreign-instigated riots, while others have accused Iranian authorities of responding violently to demonstrators, Al Jazeera reported.The death toll includes 505 protesters, among them nine children, as well as 133 members of Iran's military and security forces, one prosecutor, and seven civilians who were not involved in the demonstrations. The current protest, in its 17th day, has spread nationwide, with 606 gatherings across 187 cities, according to HRANA. (ANI)","url":"https://www.aninews.in/news/world/us/continue-the-struggle-dont-let-this-regime-portray-situation-as-normal-reza-pahlavi-urges-iranians20260114064830","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260114011819.jpg","video":null,"publish_date":"2026-01-14 01:18:30","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.288},{"id":392848684,"title":"'Truth Hurts': Autoworker Praised For Heckling Trump Into Flipping The Bird, Dropping F-Bomb","text":"President Donald Trump on Tuesday gave the middle finger and told an autoworker “fuck you” after he was heckled during his visit to a Ford plant in Dearborn, Michigan.\n\nIn a clip shared by TMZ, the president looks down from a walkway above the factory floor as someone is heard yelling, “Pedophile protector!”\n\nIt’s an apparent nod to the president’s ties to Jeffrey Epstein and his administration’s handling — and sluggish release — of files tied to the late convicted sex offender. \n\nThe two-letter dig appeared to get under Trump’s skin as he responded by pointing his finger toward the factory floor below and appeared to mouth “fuck you” as well as “you’re fired” just before flipping the bird.\n\nThe president’s reaction to the worker was “appropriate,” per White House spokesperson Steven Cheung.\n\n“A lunatic was wildly screaming expletives in a complete fit of rage, and the President gave an appropriate and unambiguous response,” Cheung said.\n\nCritics on social media praised the autoworker, with one Bluesky user calling the worker a “god damn hero” and another simply declaring, “truth hurts.”\n\nCheck out more reactions below.","url":"https://www.huffpost.com/entry/trump-middle-finger-ford-autoworker-reactions_n_6966dae6e4b0d5c7db78787e?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6966df3a170000c639aacadf.jpeg?cache=V79uL6fbaN&ops=1778_1000","video":null,"publish_date":"2026-01-14 01:02:57","author":"Ben Blanchet","authors":["Ben Blanchet"],"language":"en","category":"politics","source_country":"us","sentiment":-0.153},{"id":392848686,"title":"Military Official Involved In Boat Strikes Feared They Were Illegal","text":"Early last September, the U.S. military made good on President Donald Trump’s promise to kill suspected drug smugglers when it bombed a speedboat off the coast of Venezuela and then fired another missile at survivors clinging to the wreckage. Two weeks later, the U.S. sank another boat and four days after that, a third vessel. \n\nWith the death toll at 17 by month’s end, a member of the U.S. military involved in these strikes expressed fear that the campaign was illegal and sought legal advice. Steve Woolford, a resource counselor with the GI Rights Hotline, took the call from the service member he described as having an important role in the approval process for the strikes. He declined to give specific details about the person’s exact role because the hotline, which provides free counseling services as a nonprofit organization, is confidential. The person told Woolford they were questioning whether the U.S. was engaged in a “legal military operation.” \n\n“This doesn’t look like what the military is supposed to be doing, and the military is doing it,” Woolford recalled the service member expressing, adding that “they didn’t want to be doing it.” He referred them to legal counsel. \n\nOn Monday, The New York Times reported the military used an unmarked aircraft painted to resemble a civilian plane to conduct the first boat strike on Sept. 2. Feigning civilian status to trick adversaries is a war crime known as “perfidy,” banned under both international and U.S. military law, according to the Times. \n\nWoolford said he also spoke with another service member who reached out in October to express concerns they may be ordered to participate in future boat strikes. \n\nSince then, the alarms inside the military have grown louder. Hours after the U.S. raid to capture Venezuela leader Nicolás Maduro became public, Woolford said, the hotline received three calls from service members concerned about the operation, with one describing it as unlawful and another objecting to it as “imperialist.” \n\nThe legal concerns of at least one service member involved in the strikes, reported here for the first time, mirror those of lawmakers, experts in the law of war, and reportedly the former admiral overseeing the operation. The Trump administration’s legal rationale for the campaign against supposed drug runners was extended this month to the arrest of Maduro on drug charges. The administration argues the alleged crimes pose a threat to national security and that the U.S. is engaged in a “non-international armed conflict” with cartels whose narcotics operations constitute an “armed attack” on the U.S. Legal experts have questioned the very logic of the claim that drug runners in the Caribbean and Pacific could pose such a threat.\n\nU.S. Navy Adm. Alvin Holsey, who led Southern Command with responsibility for the Caribbean, is said to have questioned the legality of the strikes before abruptly announcing his early retirement, reportedly under pressure from Defense Secretary Pete Hegseth. Holsey stepped down last month, less than a year into his tenure leading Southern Command, with no explanation given for his sudden departure and the Pentagon dismissing reports of internal conflict as “fake news.” The top lawyer for the command had warned in August, before the strikes were carried out, that they could amount to extrajudicial killings, according to multiple reports. He was ultimately overruled. \n\nSuch killings are prohibited by law and subject to prosecution in the U.S. military’s justice system. Woolford said the service members were referred to The Orders Project, a nonprofit organization that provides legal guidance to military personnel. Brenner Fissell, a law professor at Villanova University who helps run The Orders Project, said no service members currently involved in the strikes had contacted the project. \n\n“People are really scared of at all stepping out of line,” Fissell said. “I mean, when you see someone like Adm. Holsey lose his position, and he’s one of the top five people in the military, do you really want to reach out?”\n\nThe service member’s call to the GI Rights Hotline came months before the public learned details from the first strike, when Hegseth allegedly ordered the killing of any survivors and the military did so with another missile strike. Adm. Frank Bradley, who commanded the strike, reportedly told congressional lawmakers in a private briefing that the boat was on its way to transfer drugs to a larger vessel bound for Suriname, a small South American country that is typically on trafficking routes destined for Europe. Lawmakers viewed classified footage last month that left one “deeply disturbed.” Hegseth, who denied giving the second order, has refused to release the full footage of the strike to the public. \n\nThe description of the video — two shipwrecked survivors were waving before they were incinerated — has drawn accusations that the second strike was either a war crime or murder and that the same is true for the 123 people killed so far, according to Southern Command. There’s no legal rationale, many legal experts say, that can turn boats suspected of carrying drugs into an “armed attack” against the U.S., and even under international law governing armed conflict, the boat passengers would be considered civilians. \n\nWhile framing the operation as a matter of self-defense, Secretary of State Marco Rubio has gone further and stated the goal is to instill the “fear of the reaper” in would-be drug traffickers. Senior Trump aide Stephen Miller reportedly pushed for strikes that would attract attention and serve as a deterrent to traffickers.\n\nWhat’s more, the administration has not released any of the evidence it says proves the people targeted in the boat strikes were working for drug cartels. At least one of the fatalities was identified by the Colombian president as an innocent fisherman whose boat had broken down. \n\nThe Pentagon has not reported any new boat strikes since the capture of Maduro, though Trump has said he’s ready to use more military force if Venezuela’s leaders there “do not behave” and crack down on drug smuggling, among other U.S. demands.\n\nMichael Schmitt, a former Air Force lawyer and professor emeritus at the U.S. Naval War College, said the Maduro operation officially initiates a state of international armed conflict, triggering the Geneva Conventions and thereby raising the stakes of boat strikes if those targeted are affiliated with Venezuela.\n\n“These individuals involved in mere criminality are civilians who are not directly participating in the hostilities, and therefore not legally targetable,” he said. \n\nThe service members tasked with carrying out these strikes are left in a “terrible bind,” Fissell said.\n\n“They are going to take the fall if the shit hits the fan. Because the way that this works is if they follow an unlawful order, they can be prosecuted for that if it’s clearly unlawful,” he said. “If they don’t follow it, the hammer drops on them from Hegseth and Trump.”","url":"https://www.huffpost.com/entry/military-boat-bombings-illegal-fears_n_69666fd2e4b0dd199b1a6503?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/696567fd170000280aaac96d.jpg?cache=mjNY9P2Qdu&ops=1778_1000","video":null,"publish_date":"2026-01-14 01:00:17","author":"Allison Quinn","authors":["Allison Quinn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.428},{"id":392849560,"title":"\"That's going to be a big problem for him\": Trump rebukes Greenland PM's remarks on 'choosing Denmark' over US","text":"Washington DC [US], January 14 (ANI): Reacting to remarks by the Premier of Greenland expressing a \"preference to remain with Denmark\" over the US, United States President Donald Trump on Tuesday (local time) dismissed the statement and warned that it could create “a big problem” for the latter.\n\nTrump’s comments come after Greenland Prime Minister Jens-Frederik Nielsen said the self-governed Danish territory wants to remain part of Denmark rather than join the United States, amid US President Donald Trump’s ongoing push to take over the island, Al Jazeera reported.\n\nSpeaking to reporters, Trump said he \"disagreed\" with the Premier’s position and said he has no familiarity with him. “Well, that is their problem. I disagree with them. I don't know who he is. Don't know anything about him. But that is going to be a big problem for him,” the US President said.\n\nSpeaking at a news conference in Copenhagen alongside Denmark’s Prime Minister Mette Frederiksen, Nielsen said the autonomous Arctic territory would prefer to remain Danish.\n\n“We are now facing a geopolitical crisis, and if we have to choose between the United States and Denmark here and now, we choose Denmark,” he said.\n\n“The United States has once again reiterated its desire to take over Greenland. This is something that the governing coalition in Greenland cannot accept under any circumstances,” said the island’s coalition government.\n\n“As part of the Danish commonwealth, Greenland is a member of NATO, and the defence of Greenland must therefore be through NATO,” it added.\n\nOn Wednesday, US Vice President JD Vance and Secretary of State Marco Rubio will host a meeting with the foreign ministers of Denmark and Greenland at the White House, Al Jazeera reported.\n\nGreenland, the world's largest island, is a self-governing territory within Denmark and a NATO partner of the United States. Both Danish and Greenlandic leaders have repeatedly rejected any suggestion that the island could be sold or annexed, emphasising that Greenland's future should be decided by its own people.\n\nEarlier on Saturday, Trump reiterated claims of having to do \"something\" about Greenland, \"the easy way\" or \"the hard way\", saying that if the US doesn't take any action, Russia and China would spring in and that Washington does not want to have them as neighbours.\n\n\"We are going to do something on Greenland, whether they like it or not, because if we don't do it, Russia or China will take over Greenland - and we're not going to have Russia or China as a neighbour. I would like to make a deal the easy way, but if we don't do it the easy way, we're going to do it the hard way,\" Trump said when he was asked about the island. (ANI)","url":"https://www.aninews.in/news/world/us/thats-going-to-be-a-big-problem-for-him-trump-rebukes-greenland-pms-remarks-on-choosing-denmark-over-us20260114060509","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260114004018.jpg","video":null,"publish_date":"2026-01-14 00:35:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.476},{"id":392848018,"title":"‘Where do I sign up?’: ICE agent’s $200K salary with just a high school degree shocks the internet","text":"There was a time when the American administration and its policy decisions used to set an example for democracies across the world. However, in the past few years, both have only shocked people more and more. Out of everything that Donald Trump's second Presidential term would be known for, it's his brutal crackdown on immigrants by assigning dangerous authority to agents of the US Immigration and Customs Enforcement (ICE). It is well known that ICE agents enjoy immense executive powers and protection by the administration. However, it seems they also enjoy a good paycheck no matter what level of qualification they have and a video going viral on the internet is all the proof. The viral videoA video shot in Bloomington, Minnesota is going viral all over the internet. Shared on social media platforms such as X and YouTube, the clip showcases an interaction between an ICE officer and a man and a woman. It begins with the agent warning the two that \"if you get in my way, I will arrest you.\" To this the man can be heard replying, \"Sir, we are just observing, calm down,\" while the woman says, \"I am observing. Do you see me in the way? I am back.\"The two can be heard poking the ICE agent further asking him if he has \"anger issues\", if his \"parents were present\" and pointing out that he should be \"ashamed\" of himself. While this might seem like a normal conversation with an ICE agent considering the outrage the agency and the agents are receiving for their brutality, the interesting part of the video is revealed later on. When the woman points out that the ICE agent is ashamed of his job, he replies, \"I love my job. I can't believe I get paid for this. I'd do it for free.\"When the woman points out that she gets $200K as a physician's assistant, the ICE agent asks her how long she went to school for in order to get the job. \"Seven years,\" replies the woman to whom the officer said, \"Really? I went to high school and I make $200K.\"Netizens react to the viral videoPeople on the internet were shocked to know the salary of the ICE agent considering his basic educational qualifications. \"Where do I sign up,\" asked a person on YouTube. \"this is exactly why the system is broken when mindless muscle gets paid the same as medicine\" condemned another on X. \"Yeah I don’t think this is the flex you think it is. We have high school educated people roaming the streets with f*****g guns. Yikes.\" added one. \"wow I should apply to ICE lmao\" pondered another.\"$200k to be ICE?? Sign me up!\" wrote a social media user. How much do ICE agents earn?As per a July 2025 report by the New York Post, top recruits for ICE are provided $50,000 signing bonuses and six-figure salaries. New recruits are offered an amount between $50,000-$90,000 per year in base salary. Most entry-level jobs at ICE require a bachelor's degree whereas some positions require a year of graduate study unless the applicant graduated with Superior Academic Achievement (SAA)In some cases, a master's degree can help waive the requirement for the GL-9 level.While the ICE agent's claim about making $200K could still be considered, with just a high school degree, it could be just a retort rather than reality.","url":"https://timesofindia.indiatimes.com/etimes/trending/where-do-i-sign-up-ice-agents-200k-salary-with-just-a-high-school-degree-shocks-the-internet/articleshow/126515316.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126515342/126515342.jpg","video":null,"publish_date":"2026-01-14 00:21:00","author":"Toi Trending Desk","authors":["Toi Trending Desk"],"language":"en","source_country":"in","sentiment":-0.072},{"id":392847336,"title":"‘The View’ host Joy Behar claims Trump is aiming to use ICE protests as excuse to cancel midterm elections","text":"“The View” co-host Joy Behar said Tuesday that President Donald Trump was hoping for protests to cause chaos so that he could declare martial law and cancel the 2026 midterm elections.\n\n“I worry that Trump is looking for this kind of pandemonium to go on, like you just described, so he can declare martial law and also cancel the midterms,” Behar said as the co-hosts discussed protests against Immigration and Customs Enforcement (ICE) across the country. \n\nThe co-hosts discussed the ongoing protests against ICE in cities such as Minneapolis following the fatal shooting of Renee Good in the city.\n\n“Watch out for this guy!” Behar said. “Because he’s worried — he even said, ‘If the Democrats take Congress next time, I will be impeached,’ which means that he could be convicted and sent to jail. He does not want that to happen.”\n\nCo-host Whoopi Goldberg told viewers to know their rights while protesting.\n\n“Let us be very clear. Not all ICE agents are out of control. Not all of them,” Goldberg said. “Some of them actually do know what they’re doing, and they’re having a hard time because they don’t recognize the agency they’ve worked for, for years.”\n\n“So there’s a lot going on. But keep in mind, you don’t have the right to be a bonehead, OK?” she continued. “You can’t spit on people — people don’t like it. But you do have the right to say, ‘We don’t like what we see, we’re going to protest.’” \n\nGoldberg cited the American Civil Liberties Union’s (ACLU) advice for protesters: “Listen, think carefully about what you say, keep your hands where the officers can see them. Don’t run or touch an officer.”\n\nOn Monday, Goldberg walked back a claim she made suggesting ICE agents were “violent criminals.”\n\nBehar has previously claimed that Trump was sending National Guard troops to US cities to stop future elections, suggesting Americans may not be allowed to vote.\n\nDuring an episode of “The View” in October, Behar said, “This is a pretext to stop the next election — that’s what I think.”\n\nBehar continued, “And if they stop us from voting, that’s the one thing people have.”\n\nGoldberg responded, “It’s the one thing that makes us very different from lots of other countries. Our votes – they do count. I do know that they count.”","summary":"\"The View\" co-host Joy Behar said Tuesday that President Donald Trump was hoping for protests to cause chaos so that he could declare martial law and cancel the 2026 midterm elections.","url":"https://nypost.com/2026/01/13/media/joy-behar-claims-trump-is-aiming-to-use-ice-protests-as-excuse-to-cancel-midterm-elections/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/www-youtube-com-watch-v-118854988.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/7Hcb1BeA-RyIcpnTz.mp4","publish_date":"2026-01-14 00:12:49","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.348},{"id":392846772,"title":"'Greenland chooses Denmark over US', says PM Nielsen in joint presser with Danish counterpart","text":"Greenland's Prime Minister Jens-Frederik Nielsen has said that the citizens of the autonomous territory would prefer to stay a part of Denmark than join the US if they are asked to make a choice \"here and now\".\nNielsen made the remarks at a joint press conference with Danish Prime Minister Mette Frederiksen, marking the strongest show of disapproval of President Donald Trump's ambition to acquire Greenland.\n\"If we have to choose between the United States and Denmark here and now, we choose Denmark,\" the Greenlandic PM said.\nHe added, \"One thing must be clear to everyone. Greenland does not want to be owned by the United States. Greenland does not want to be governed by the United States. Greenland does not want to be part of the United States.\"\nTrump has renewed his ambition to take over Greenland ever since his military launched an operation in Venezuela, ultimately capturing President Nicolas Maduro earlier this month.\nWhen asked about his thoughts on Nielsen's comments, Trump said, \"That's their problem, I disagree with him... That's going to be a big problem for him.\"\nWhy does US want Greenland?\nGreenland’s geography creates a critical strategic bridge between North America and the Arctic, establishing the territory as a vital hub for monitoring maritime traffic and hosting early warning systems essential for detecting missile threats.\nHighlighting these advantages, Trump has consistently characterised the island as a cornerstone of US national security, though his claims that the region is \"covered with Russian and Chinese ships\" have been widely disputed by Nordic diplomats and intelligence assessments, which find no evidence of a significant naval presence from either nation in Greenlandic waters.\nDoes the US want to buy Greenland?\nUS Secretary of State Marco Rubio told lawmakers at a classified briefing that the Trump administration does not simply want to seize Greenland, but buy it from Denmark.\nA senior US official, speaking anonymously, told Reuters that Washington’s options include an outright purchase of Greenland or the creation of a Compact of Free Association with the territory.\nEarlier, Greenland and Denmark said they had requested an urgent meeting with Rubio to address US claims over the island.\nHowever, Trump, who first expressed his ambitions to buy Greenland during his first presidency, is not the only one who wants to acquire the island. Russia and China have shown interest in Greenland owing to its untapped rare earth deposits.","url":"https://www.firstpost.com/world/greenland-chooses-denmark-over-us-says-pm-nielsen-in-joint-presser-with-danish-counterpart-13968377.html","image":"https://images.firstpost.com/uploads/2026/01/TRUMP-GREENLAND-EUROPE1200-2026-01-a7b0a892dda36acfa959472b780e454f.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2026-01-14 00:12:41","author":null,"language":"en","source_country":"in","sentiment":-0.132},{"id":392846566,"title":"'Sizeism' and Stupidity: The Right Promotes Health While the Left Undermines It","text":"The political right, overall, has become much more interested in healthy food and healthy living in the last few years. In contrast, the political left has entrenched itself in the worst policies on vaccines, medical drugs, food, and welfare. This is hardly surprising. The political right aims to better people's lives. The political left aims to keep people discontented but apathetic and entitled, so that they continue to depend on handouts.\n\nThere are two recent stories that illustrate how different the attitudes of the right and left are when it comes to the American obesity epidemic. The first is the new food pyramid and reformed dietary guidelines from the Trump-Kennedy Department of Health and Human Services (HHS). \n\n Read Also: ‘Great Influencer’: Trump Pays Tribute to Scott Adams\n\nFormer Democrat Robert F. Kennedy Jr. and Republican Donald Trump are making a push to encourage Americans not to eat so much processed junk. The same reasoning is behind the Trump administration's pressure on states to eliminate soda and junk food from SNAP benefits. \n\nUnder President Trump’s leadership, common sense, scientific integrity, and accountability have been restored to federal food and health policy.For decades, the Dietary Guidelines favored corporate interests over common-sense, science-driven advice to improve the health of… pic.twitter.com/QMO2LAW00a— HHS (@HHSGov) January 7, 2026\n\nOn the flip side, we have this imbecility from Carnegie Mellon University in Pittsburgh:\n\nRecognizing diversity in our sizes and weight allows us to celebrate our bodies in their natural state. This also fosters a more accepting and inclusive society where everyone feels valued and respected, regardless of one's size. Sizeism, discrimination based on body size, also known as weight stigma, can have a significant impact on individuals' mental and physical health, leading to low self-esteem, eating disorders, and other serious health issues.Our counseling center strives to provide services that are inclusive and accessible to all bodies. Explore this page for size-inclusive resources, information about campus resources, and how to get involved.\n\nAmong the resources is the National Association to Advance Fat Acceptance, and the page argues that we need to separate health and weight in public healthcare treatment. I wish I were making that up.\n\nI recently went to Disneyland, and while it was a fun vacation, something which surprised me was the sheer number of morbidly obese young people. The workers were mostly obese, and the clientele were nearly as bad. As a nation, we really do have an obesity health crisis, and praising fatness won't solve it — only healthier living will.","url":"https://pjmedia.com/catherinesalgado/2026/01/13/sizeism-and-stupidity-the-right-promotes-health-the-left-undermines-it-n4948247","image":"https://media.townhall.com/cdn/hodl/2014/148/2a05b090-c10c-4066-a33a-93bf7380385d.jpg","video":null,"publish_date":"2026-01-14 00:05:40","author":"Catherine Salgado","authors":["Catherine Salgado"],"language":"en","source_country":"us","sentiment":0.138},{"id":392846942,"title":"Planned Parenthood recieves crucial lifeline as Trump releases tens of millions amid legal challenges","text":"Planned Parenthood and other health clinics have received a crucial lifeline as President Donald Trump’s Department of Health and Human Services releases tens of millions of dollars amid legal challenges. \n\nThe American Civil Liberties Union filed a lawsuit against the Trump administration on behalf of the National Family Planning and Reproductive Health Association last April after HHS withheld more than 20 Title X family planning grants worth $65.8 million. \n\nThe grants funded 865 family planning service sites to about 842,000 patients across nearly two dozen states. The federal dollars gave patients, especially those with low incomes, access to contraceptives, cancer screenings and testing and treatment for sexually transmitted infections.\n\nThe affected clinics slowly had their funding restored with HHS quietly releasing the remaining federal dollars in December, Politico reported. \n\nIn a court filing Tuesday, the National Family Planning and Reproductive Health Association voluntarily dismissed its lawsuit against the Trump administration after all the Title X grants were restored. \n\n“The Trump administration illegally withheld vital family planning funds that federal grantees were relying on to provide time-sensitive, critical care to hundreds of thousands of people in need,” Clare Coleman, president and CEO of the National Family Planning and Reproductive Health Association, said in a statement. \n\n“We are relieved all of our members now have access to their promised funds, but we know the fight for contraceptive access in this country goes on. We will continue to stand up for our members and the essential care they provide to millions of individuals,” Coleman added.\n\nThe Independent has reached out to HHS for comment. \n\nIn 10 days, anti-abortion advocates will participate in the annual March for Life demonstration in Washington, D.C., as organizers say, “our work to protect life continues at the state and federal levels.”\n\nIt comes at a time when anti-abortion groups are concerned that Trump isn’t doing enough for them.\n\n“There’s definitely some ill feeling” between anti-abortion advocates and the administration, Patrick Brown, a fellow at the conservative think tank Ethics and Public Policy Center, said in an article published by The Hill on Tuesday.","summary":"The National Family Planning and Reproductive Health Association sued the Trump administration last April after it withheld $65.8 million in family planning grants","url":"https://www.independent.co.uk/news/world/americas/us-politics/planned-parenthood-trump-lawsuit-funding-b2899996.html","image":"https://static.independent.co.uk/2026/01/13/23/24/GettyImages-2237389678.jpg?crop=6747,4498,x6,y0&trim=0,7,0,5&width=1200","video":"https://cdn.jwplayer.com/videos/agFvzZLG-4VHSaSK0.mp4","publish_date":"2026-01-14 00:05:22","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.127},{"id":392849356,"title":"Trump flips off heckler during tour of Michigan Ford plant","text":"Trump flips off heckler during tour of Michigan Ford plant\n\nTrump flips off heckler\n\nU.S. President Donald Trump flipped off a heckler Tuesday during a tour of a Ford Plant in Michigan.\n\n“A lunatic was wildly screaming expletives in a complete fit of rage, and the President gave an appropriate and unambiguous response,” White House Communications Director Steven Cheung said in a statement.\n\nIn a video published by TMZ, someone appears to yell at Trump. The outlet reported that a person yelled “pedophile protector” at the president.\n\nTrump responds by flipping off someone on the factory floor. He also points at the person and appears to say “f*ck you” twice.\n\nIn a statement to U.S. media outlets, Ford’s director of communications David Tovar said they have seen the video clip.\n\n“One of our core values is respect and we don’t condone anyone saying anything inappropriate like that within our facilities. When that happens, we have a process to deal with it but we don’t get into specific personnel matters.”","summary":"U.S. President Donald Trump flipped off a heckler Tuesday during a tour of a Ford Plant in Michigan.\n\n&ldquo;A lunatic was wildly screaming expletives in a complete fit of rage, and the President gave an appropriate and unambiguous response,&rdquo; White House Communications Director Steven Cheung...","url":"https://www.castanet.net/news/World/594032/Trump-flips-off-heckler-during-tour-of-Michigan-Ford-plant","image":"https://www.castanet.net/content/2026/1/large/screenshot_2026-01-13_at_4.59.21pm_p4257960.jpg","video":null,"publish_date":"2026-01-14 00:02:00","author":"Colin Dacre","authors":["Colin Dacre"],"language":"en","source_country":"ca","sentiment":-0.37},{"id":392847352,"title":"Trump has cut the technocratic Gordian Knot — and elites hate it","text":"“There are decades where nothing happens, and there are weeks where decades happen.”\n\nThat’s a quote often attributed (perhaps incorrectly) to Vladimir Lenin — but whoever said it first, it’s certainly true of the last week or so.\n\nJust look at the headlines. \n\nIn Iran, the mullahs who have ruled since 1979 are collapsing in the face of widespread popular revolt. \n\nFor nearly all of the 47 years since Jimmy Carter allowed Ayatollah Ruhollah Khomeini to take power in the fallacious belief that it would somehow advance the cause of human rights, Iran has been a major rival to the United States in the region and around the world.\n\nThe theocracy has been a source of headaches and humiliation as various administrations tried to manage the problem with techniques ranging from cakes baked in the shape of a key (Reagan) to palletloads of cash (Obama). \n\nNow even Democratic Party politicians are condemning the mullahs’ regime, which tells you how they think it’s going to turn out. \n\nIn Venezuela, dictator Nicolás Maduro was removed from power, and from his country, by US special forces deployed by President Donald Trump.\n\nThe stealthy American lightning raid that snatched him from Venezuela’s largest military base blew past advanced Chinese and Russian air defenses and incapacitated hundreds of troops guarding Maduro with high-tech sonic weapons that left them vomiting and bleeding from the ears. \n\nProbably the most intricate and successful military raid in history, and without the loss of a single American life.\n\nHere at home, leftists are trying to resurrect the Black Lives Matter strategy against US Immigration and Customs Enforcement — even though black Americans are conspicuous by their absence this time around. \n\nNow, it’s mostly middle-aged white women eager to taunt, threaten and obstruct lawful enforcement raids targeting criminal illegal aliens. \n\nBut the big news is that the raids are happening at all. \n\nWe were told for decades that we couldn’t do anything about illegal immigration — at least not without a big pork-filled, amnesty-laden “bipartisan” bill. \n\nBut now the border is basically closed, and those in the country illegally are being shipped out.\n\nCrime in Washington, DC, Memphis, Tenn., and other cities was out of control. Trump sent in the National Guard to fix it. \n\nSometimes the mere threat of sending the Guard was enough to get local authorities to fix crime problems for themselves — something they could have done all along, but mysteriously didn’t.\n\nTreasury Secretary Scott Bessent reported this week that up to 10% of the federal budget is lost to fraud annually. \n\nThe total fraud tally is probably greater than that — Elon Musk has estimated over a trillion dollars a year, and what we’ve seen just in Minneapolis suggests he may be on track. \n\nEveryone has known for years that the federal budget was out of control and riddled with waste, but even the most pessimistic estimates weren’t pessimistic enough. Yet nothing was done.\n\nNow that’s changing, too, as Bessent launches new initiatives to shut the fraud down.\n\nIn legend, the Gordian Knot was a rope fashioned into a knot of immense complexity. Whoever untied it would supposedly rule Asia, but no one could. \n\nUntil Alexander the Great — who declared, “It makes no difference how it is loosed,” and cut it with his sword. \n\nTo this day, “cutting the Gordian Knot” describes a simple, forceful approach to solving overly complex problems.\n\nAs political scientist Wilfred Reilly recently posted, “Ending crime and unwanted migration was always as simple as it seemed to you and your buddies at the bar or on the track. A great, great deal of mid-wit noise was made to disguise this.”\n\nAmerica’s institutional elite has spent decades making simple problems complex. \n\nBut the Gordian Knot can be cut. \n\nTrouble with Iran? Try ousting the mullahs, not negotiating with them. (They’re better at haggling than we are). \n\nTrouble with illegal aliens pouring into the country? Close the border down. \n\nTrouble with the illegitimate dictator of Venezuela? Depose him. \n\nTrouble with financial fraud? Arrest the fraudsters and shut off the money taps.\n\nThe people who made these knotty problems knotty did too well “managing” or “addressing” them to ever actually solve them. \n\nDoing so would shut down the whole feedlot.\n\nTrump just cut the knot. \n\nThat’s a terrible blow to the managerial class. \n\nIf the public realizes you can actually solve problems, there will be more pressure to do that — rather than just manage them endlessly.\n\nThat’s unforgivable. No wonder Trump is the villain in their eyes.\n\nGlenn Harlan Reynolds is a professor of law at the University of Tennessee and founder of the InstaPundit.com blog.","summary":"America’s ruling class has spent decades making simple problems complex. But the Gordian Knot can be cut.","url":"https://nypost.com/2026/01/13/opinion/trump-tackles-impossible-problems-and-the-elites-hate-it/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/newspress-collage-ejhdppwee-1768347827602.jpg?quality=75&strip=all&1768329841&w=1200","video":null,"publish_date":"2026-01-14 00:01:36","author":"Glenn H. Reynolds","authors":["Glenn H. Reynolds"],"language":"en","category":"politics","source_country":"us","sentiment":-0.286},{"id":392849532,"title":"Britain is ‘stepping up on Arctic security’, Yvette Cooper says amid Trump Greenland threats","text":"Britain is intensifying its focus on Arctic security, the Foreign Secretary Yvette Cooper said as she tours Scandinavia.\n\nHer visit comes amid ongoing concerns regarding US threats to annex Greenland, highlighting the strategic importance of the region.\n\nMs Cooper is also poised to advocate for enhanced Nato efforts to safeguard the High North from Russian aggression. \n\nDuring her visit to Finland and Norway on Wednesday, she is scheduled to meet Finnish border guards and British Royal Marines at Norway's Camp Viking base. \n\nMs Cooper said the government is \"reinforcing our diplomatic and security commitment to the region.\"\n\nAhead of the trip, she said: “Britain is stepping up on Arctic security. With our allies we are working to strengthen Arctic defences and deter any attempts from the likes of Vladimir Putin to threaten our interests and our infrastructure.”\n\nShe added: “We see it as our responsibility and our duty to tackle these challenges head on, making us all safer in the process.\n\n“Arctic security is a critical transatlantic partnership issue for the security of Britain and Nato. Coming together as an alliance allows us to unify and tackle this emerging threat.”\n\nBut while Ms Cooper’s visit has been billed as focusing on Arctic security, it comes under the shadow of Donald Trump’s repeated insistence that the US needs to take over Greenland to prevent Russia or China getting hold of the territory.\n\nMr Trump’s administration has even threatened to use force to annex Greenland, a semi-autonomous territory of Nato ally Denmark, prompting concern about the future of the transatlantic alliance.\n\nOn Tuesday, Greenland’s energy minister Naaja Nathanielsen told a press conference in Westminster the territory had “no intention of becoming American” and felt “betrayed” by the US.\n\nBut while she warned that “we would all be under attack” if the US invaded Greenland, she maintained that Greenland wanted “a peaceful solution” and was open to greater security monitoring or an expanded Nato deployment.\n\nSince the US began talking more loudly about annexing Greenland at the start of 2026, the UK appears to have increased discussions of Arctic security, with Sir Keir Starmer mentioning the issue in calls with Mr Trump, the Danish prime minister and the Nato secretary-general last week.","summary":"Cooper is also poised to advocate for enhanced Nato efforts to safeguard the High North from Russian aggression","url":"https://www.independent.co.uk/news/uk/politics/britain-greenland-trump-yvette-cooper-russia-nato-b2899975.html","image":"https://static.independent.co.uk/2025/12/16/16/031b9e6e6ac8e1aa83e5473ed192d656Y29udGVudHNlYXJjaGFwaSwxNzY1OTg3MjA2-2.82732179.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/BWZAM0aq-OhrQWqOm.mp4","publish_date":"2026-01-14 00:01:00","author":"Christopher McKeon","authors":["Christopher McKeon"],"language":"en","category":"politics","source_country":"gb","sentiment":0.267},{"id":392847974,"title":"Trump 'DECLARES WAR' On Khamenei, 'INSTIGATES' Iranians To Carry Out Coup | 'VERY BIG PRICE TO PAY'","text":"1 views | Jan 14, 2026, 05:39:01 AM | TOI.in\n\nU.S. President Donald Trump repeated his claims from the Truth Social post on Iran during remarks to the Detroit Economic Club. He encouraged Iranians to keep protesting, promising that “HELP IS ON ITS WAY.” Trump, who has been weighing an array of options to respond to the Iranian government’s violent crackdown on protests, also warned that those responsible for killing demonstrators would “pay a big price.” Earlier, during his tour of the Ford Auto Plant in Michigan, Trump said he didn't have accurate numbers on the death toll in Iran but added: “I think it’s a lot. It’s too many, whatever it is.” Asked if U.S. allies, like Europeans, should evacuate Iran, Trump said: \"I would say it’s not a bad idea if they get out.\" Watch#TrumpIran #HelpIsOnItsWay #IranProtests #TruthSocialTrump #IranCrackdown #DetroitEconomicClub #TrumpDetroitSpeech #IranEvacuationWarning #USIranTensions #RegimePressureIran #MiddleEastFlashpoint #IranUnrest2026 #TrumpForeignPolicy #IranProtesterDeaths #GlobalIranCrisis","url":"https://timesofindia.indiatimes.com/videos/international/trump-declares-war-on-khamenei-instigates-iranians-to-carry-out-coup-very-big-price-to-pay/videoshow/126515304.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126515304/126515304.jpg?resizemode=4","video":null,"publish_date":"2026-01-14 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":-0.872},{"id":392849162,"title":"Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally","text":"Skip to main content\n\n Toggle Menu\n\nJoin our Community\n\nSupport ToI and remove all ads\n\n Learn more\n\nGet The Daily Edition\n\n Account\n\n Sign In\n\n \n\nISRAEL AT WAR - DAY 831 \n\n Open Search form\n\n Input search\n\nClear search input\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nNewsletters\n\nThe Daily Edition\nWhat Matters Most Today\n\nTech Israel\nUpdates from Silicon Wadi\n\nReal Estate Israel\nMonthly Update\n\nThe Weekend Edition\nThe Best Reads of the Week\n\nWeekly Highlights\nChoice Voices From The Blogs\n\nAtlanta Jewish Times\n\nNorth New Jersey\nThe Jewish Standard\n\nJewish Chronicle\n\nUnited Kingdom\nThe Jewish News\n\nThe Australian Jewish News\n\nFor Publishers\nBecome a Partner \n\nJoin our community\n\nAbout The Times of Israel\n\nAdvertise on The Times of Israel\n\nGet the Daily Edition\n\n© 2026 The Times of Israel , All Rights Reserved\n\nTerms and conditions\nPrivacy policy\n\n Open Search form\n\n Input search\n\nClear search input\n\n \n\nAdvertisement\n\nNeo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\nMessages found by investigators show ex-Navy SEAL Gregory Vandenberg was mad at the president because he believes the US government is controlled by Israel and the Jewish people\n\n \n\n By AP\n\n Today, 2:15 am\n\n \n\n \n\nSend by email\n\n \n\n \n \n\nThis photo provided by US Attorney's Office shows clothing displaying antisemitic, anti-Israel, and extremist symbols that were found in former Navy SEAL SealGregory Vandenberg vehicle by authorities.(US Attorney's Office via AP)\n\nSAN DIEGO — A jury has convicted a former Navy SEAL with neo-Nazi beliefs of transporting fireworks across state lines with plans to shoot explosives at police during last year’s “No Kings” protest in San Diego, federal prosecutors said.\n\nFollowing his conviction on Monday, Gregory Vandenberg was ordered held in custody until his sentencing hearing, which has not yet been scheduled. He faces up to 10 years in prison, according to the US Attorney’s Office.\n\nDuring a five-day trial in Albuquerque, New Mexico, prosecutors outlined Vandenberg’s intention to travel from El Paso, Texas, to California to injure law enforcement officers at the June 14 rally.\n\n00:00 / 00:00\n\nPicture-in-Picture\n\nInvestigators found messages on his phone indicating he was angry with President Donald Trump because he believed the US government is controlled by Israel and the Jewish people, according to prosecutors. His home screen on his phone displayed a picture of the Taliban flag.\n\nFBI agents testified that they found clothing and paraphernalia in Vandenberg’s car with anti-Israel slogans and neo-Nazi symbols, including a flag for the militant group the Caucasian Front and a message in Latin saying “Judea must be destroyed.”\n\n Get The Times of Israel's Daily Edition\n by email and never miss our top stories\n\n Newsletter email address\n\n By signing up, you agree to the terms\n\nVandenberg, 49, stopped at a travel center near Lordsburg, New Mexico, on June 12 and purchased six large mortar fireworks as well as 72 M-150 firecrackers, which are designed to sound like gunfire. He told the store clerk that he had significant knowledge of explosives and prior special operations forces experience, and he outlined his intentions to harm police at the upcoming demonstration, prosecutors said.\n\nVandenberg, who had no stable employment and lived in his car, urged the clerk to join him, according to a statement from the US Attorney’s Office. While in the store, he wore a T-shirt with the word “Amalek” on the front, which he said he designed specifically to mean “destroyer of Jews,” the statement said.\n\n This photo provided by US Attorney’s Office shows a hat with Al-Qaeda flag that was found in former Navy SEAL Seal Gregory Vandenberg vehicle by authorities. (US Attorney’s Office via AP)\n\nStore employees wrote down his license plate and contacted authorities. Vandenberg was arrested June 13 while sleeping in his car at the Davis-Monthan Air Force Base in Arizona. He told FBI agents he was traveling for work, despite being unemployed, and visiting friends in Phoenix, prosecutors said.\n\nAdvertisement\n\nVandenberg was convicted of transportation of explosives with intent to kill, injure or intimidate and attempted transportation of prohibited fireworks into California. A phone message was left Tuesday seeking comment from his attorney, Russell Dean Clark.\n\nActing US Attorney Ryan Ellison said in a statement that the verdict shows that the government will prosecute those who intend to use violence to express political beliefs.\n\n“People in this country are free to hold their own beliefs and to express them peacefully,” Ellison said. “What they are not free to do is use explosives to threaten or terrorize others. Vandenberg intended to turn explosives into a tool of intimidation.”\n\n Is accurate Israel coverage important to you? \n\n \n\nIf so, we have a request. \n\nEvery day during the past two years of war and rising global anti-Zionism and antisemitism, our journalists kept you abreast of the most important developments that merit your attention. Millions of people rely on ToI for fact-based coverage of Israel and the Jewish world. \n\nWe care about Israel - and we know you do too. So we have an ask for this new year of 2026: express your values by joining The Times of Israel Community, an exclusive group for readers like you who appreciate and financially support our work. \n\n I'm with you and will give \n\n I'm with you and will give \n\n Already a member? Sign in to stop seeing this\n\n You appreciate our journalism \n\n \n\n We’re really pleased that you’ve readX Times of Israel articles in the past month.\n\nYou clearly find our careful reporting valuable, in a time when facts are often distorted and news coverage often lacks context.\n\nYour support is essential to continue our work. We want to continue delivering the professional journalism you value, even as the demands on our newsroom have grown dramatically since October 7.\n\nSo today, please consider joining our reader support group, The Times of Israel Community. For as little as $6 a month you'll become our partners while enjoying The Times of Israel AD-FREE, as well as accessing exclusive content available only to Times of Israel Community members.\n\nDavid Horovitz, Founding Editor of The Times of Israel\n\n Join Our Community \n\n Join Our Community \n\n Already a member? Sign in to stop seeing this\n\n Most Popular\n\nIn first calls to outside world, Iranians describe heavy security and damage\n\nIDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nFreed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nIranian authorities say some 2,000 people killed in protests, as news trickles out\n\nIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nAustralian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nJerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nAfter decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nAdvertisement\n\n read more:\n\n \n\n Jewish Times\n\n \n\n neo-Nazis\n\n \n\n antisemitism in the US\n\n \n\n San Diego\n\n \n\n \n\n If you’d like to comment, join \n The Times of Israel Community.\n\n JOIN THE TOI COMMUNITY\n Already a member? Log in here\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nPaying ToI Community members are invited to comment on articles\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nOr Continue with\n\nBy joining you agree to the terms and conditions\n\nclose popup\n\nRegister to continue\n\nEmail address *\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address *\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nYou are currently registered. Please join The Times of Israel Community to comment and enjoy other Community benefits\n\nOnly ToI Community members can comment below articles\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nForgot your password?\n\nSend me a login link\n\nSign in without joining\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete registration so you can comment.\n\nclose popup\n\nJoin The Times of Israel Community\n\nCommenting is available for paying members of The Times of Israel Community only. Please join our Community to comment and enjoy other Community benefits.\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nclose popup\n\nThank you! Now check your email\n\nYou are now a member of The Times of Israel Community! We sent you an email with a login link to . Once you're set up, you can start enjoying Community benefits and commenting.\n\n Advertisement \n\n \n\nAdvertisement\n\nRecommended Stories\n\nFall Winter Sale\n7 For All Mankind | Sponsored \n\nWant to meet 50+ women online? They’re ready to talk.\nwingtalks.com | Sponsored \n\nWhy ask when you can chat?\nfanlyfun.com | Sponsored \n\nDiscover Love Again: Meet online Single Experienced Women\ndatingsmatch.com | Sponsored \n\nLooking For a Chat Partner?\nfanforus.com | Sponsored \n\nDoctors amazed: A simple tip alleviates years of vision loss (try it tonight)\nVision Helper | Sponsored \n\nSecret Dating Site For Singles 50+\nlatamour.com | Sponsored \n\nFrom Grimy To Gleaming: The Toilet Foam UK Cleaners Secretly Recommend\nConsumer World | Sponsored \n\nAdvertisement\n\n \n\nJanuary 14, 2026\n\nCurrent Top Stories\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\nBy ToI Staff, Agencies, Lazar Berman and Jacob Magid\n\n US president says he has canceled unspecified meetings with Iranian officials, declines to elaborate on offer of help; Witkoff said to meet with son of deposed shah \n\n IDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nBy Stav Levaton, Jacob Magid and Agencies\n\n Trump: US military ‘looking at very strong options’ on Iran, Tehran ‘wants to negotiate’\n\nBy Jacob Magid, ToI Staff and AP\n\n Some US senators skeptical about military options for Iran\n\nBy Matt Tracy\n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire\n\nBy ToI Staff\n\n Several countries urge citizens to leave Iran * Mossad said to estimate Iran death toll at over 5,000 * Foreign Ministry severs ties with multiple UN agencies, citing anti-Israel bias\n\n 1hr ago\n\n Iran claims US, Israel to blame for 'loss of innocent civilian lives' in deadly protest crackdown\n\n 1hr ago\n\n Tehran doctors say Iranian security forces intentionally firing at protesters' eyes and heads\n\n 2hr ago\n\n Senior Khamenei aide speaks with Qatari PM about protests after calling Trump, Netanyahu 'main killers' of Iranians\n\n 3hr ago\n\n Heading into briefing, Trump says he'll soon have 'accurate numbers' on Iran protest death toll\n\n Iranian authorities say some 2,000 people killed in protests, as news trickles out\n\nBy Agencies and ToI StaffOpposition-aligned site claims 12,000 killed, far higher than any NGO or state estimates; Tehran defends internet block, as Germany’s Merz predicts regime in ‘last days and weeks’ \n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\nBy Melanie Lidman\n\n In first calls to outside world, Iranians describe heavy security and damage\n\nBy Agencies\n\n Israel, Germany agree to boost counterterrorism cooperation amid threat from Iran\n\n Coalition leaders urge Netanyahu to defy potential High Court ruling to fire Ben Gvir\n\nBy Ariela Karmel and ToI Staff\n\n In filing ahead of Thursday hearing, police minister tells judges they have no standing to rule on petitions calling for his ouster, accuses the AG of a conflict of interest\n\n UTJ’s Gafni calls for government to ignore High Court rulings on Haredi draft law\n\nBy Ariela Karmel\n\n Knesset advances bill subordinating police internal affairs unit to justice minister\n\nBy Jeremy Sharon\n\n Levin threatens to paralyze Supreme Court, sets out plans for renewed judicial overhaul\n\nBy ToI Staff\n\n Analysis\nSamia Nakhoul\n\n Why the massive Iran protests haven’t toppled its clerical establishment\n\n Protests have gone on for weeks, but unless street unrest and foreign pressure can prompt defections at the top, the regime, though weakened, will likely hold, analysts say \n\n AnalysisIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nBy Parisa Hafezi\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\nBy Luke Tress\n\n Hochul proposes ban on demonstrations within 25 feet of houses of worship to prevent antisemitic harassment\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\nBy Luke Tress\n\n Mississippi suspect laughed as he confessed to torching ‘Synagogue of Satan’ — FBI\n\nBy Luke Tress and Zev Stub\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Senior government official says Islamic Jihad knows where last slain hostage Ran Gvili is located\n\n Hamas seeks to rebuild shattered leadership as it faces postwar uncertainty\n\nBy AFP and ToI Staff\n\n Head of Gaza militia claims killing of senior Hamas cop\n\nBy Noam Lehmann and Reuters\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\nBy Agencies\n\n Washington accuses brotherhood branches of collaborating with Hamas and Hezbollah; Egypt, where fundamentalist group was born, praises move against ‘extremist ideology’\n\n UAE said to slash scholarships to study in UK, citing fear of Muslim Brotherhood\n\nBy ToI Staff\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\nBy AP and ToI Staff\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nBy ToI Staff\n\n Sa’ar decries UN Women for ignoring sexual violence cases on Oct. 7, slams another agency for wastefulness, will examine ties with further UN organizations \n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n Foreign Ministry confirms Samoa will open embassy in Jerusalem this year\n\nBy Lazar Berman and ToI Staff\n\n Knesset advances bill establishing military tribunal to try October 7 perpetrators\n\nBy ToI Staff\n\n Legislation would allow for death penalty and bar suspects from being released in prisoner exchange deals; hearings to be open to the public and broadcast live\n\n Three sentenced for Oct. 8 looting of belongings of Nova festival victims\n\nBy ToI Staff\n\n Zamir unveils multi-year plan for reinvigorating IDF after two years of war\n\nBy Stav Levaton\n\n 34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\nBy Jessica Steinberg\n\n Realizing he alone could obtain answers, first-time author Eyal Eshel hunted for clues of his child’s fate, while taking the government to task for ‘breaking a social contract’\n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nBy ToI Staff\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\nBy Michael Horovitz and Reuters\n\n Yaakov Harari, 72, said to be among 125 accused of serving as US mercenaries last January; Venezuela says release of prisoners part of efforts to ‘seek peace’ with Washington\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\nBy ToI Staff\n\n Amiram Ben Uliel, who perpetrated 2015 Duma firebombing that killed 18-month-old Ali Dawabsha and his parents, has been in prison for a decade and is serving three life sentences\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\nBy Sharon Wrobel\n\n Government working on a plan to float 25-30% of arms manufacturers on the Tel Aviv Stock Exchange later this year, as demand for battle-tested systems skyrockets\n\n Op-ed\n\n The government isn’t just dodging the Haredi draft; it’s dodging the law\n\n By ignoring the High Court’s ruling on military conscription, the coalition is stripping the judiciary of its power and risking a total breakdown of Israel’s democratic regime\n\n AG: Government violating court order on Haredi draft, in ‘real danger’ to democracy\n\nBy Jeremy Sharon\n\n Defense chiefs condemn violent disruption of Bnei Brak conference for Haredi brigade\n\nBy Stav Levaton and ToI Staff\n\n Jerusalem woman dies, teen missing, as winter storm lashes Israel with wind and rain\n\nBy ToI Staff\n\n Shuafat camp resident apparently hit by heavy object; several people lightly injured in other locations, others rescued from flood-swamped cars\n\n Howling winds send walls crashing down on Gaza tent camps, killing four\n\nBy AP and ToI Staff\n\n Australian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nBy Agencies and ToI StaffEvent falls apart as director resigns in protest against the disinviting of Randa Abdel-Fattah, who said Hamas is not a terror group and wished hell to ‘every last Zionist’ \n\n Australian parliament to meet early to pass hate speech laws after Bondi terror attack\n\n UK school nixed Labour MP’s civics talk, after outcry over his support for Israel\n\nBy ToI Staff\n\n Celebrities, NGOs sign letter accusing Israel of ‘direct attack’ on Gaza health care\n\nBy ToI Staff\n\n Some 60 actors, human rights groups and Palestinian medical personnel demand unfettered aid to Palestinians, use language lifted from Genocide Convention, accuse Israel of targeting civilians\n\n In reversal, Jewish US House candidate Scott Wiener says Israel committed ‘genocide’\n\nBy JTA and ToI Staff\n\n IDF has demolished over 2,500 buildings in Gaza since start of ceasefire – report\n\nBy ToI Staff, Noam Lehmann and Stav Levaton\n\n Cameron Kasky embodies rising Gen Z Jewish criticism of Israel. Can it get him to Congress?\n\nBy Joseph Strauss\n\n The 25-year-old Parkland school shooting survivor reflects a new political landscape after more than two years of war in Gaza, though his inexperience has some NY voters hesitating\n\n Online ICE fundraiser calls Minneapolis Mayor Jacob Frey a ‘Jewish traitor’\n\nBy Andrew Lapin\n\nMore Headlines\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\nBy Stav Levaton\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\nBy Reuters and ToI Staff\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\nBy STEPHEN GROVES\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\nBy Agencies\n\n After decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nBy ToI Staff\n\n Ex-NYC mayor Eric Adams launches cryptocurrency, says it will fight antisemitism\n\nBy Luke Tress and ToI Staff\n\n PM’s chief of staff, appealing release terms, says police probe is ‘delusional, political’\n\nBy ToI Staff\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\nBy Michael Holden\n\n Draw sets Israel’s opponents for Eurovision semifinal slated for May 12 in Vienna\n\nBy AFP and ToI Staff\n\n Anti-Israel activists drop lawsuit against Northwestern U antisemitism training\n\nBy Luke Tress\n\n ‘Arab blood isn’t cheap’: Hundreds rally in capital over police failure on violent crime\n\nBy ToI Staff\n\nNili Bresler\n\n Sundown at Hostages Square\n\n After more than two years, it’s time for the people of the Square to fold up the tents, stack the chairs, and move on with our lives. What are we waiting for?\n\nOrit Mizner\n\n Designing Jewish life, not just defending it\n\n Organizations are investing so much in the battle against antisemitism that they risk losing the longer fight for Jewish connection\n\nLeigh Hartzman\n\n Can we separate the art from the antisemitism?\n\n Losing an intellectual home means losing a source of comfort – it’s a painful realization that the culture that shaped you no longer wants you\n\n When solidarity costs too much: Europe’s silence on Iran\n\n The uprising is a textbook liberation movement, but supporting it could serve Israeli interests – and thisdoesn’t fit the oppressor-oppressed binary \n\nYasmin Sacks Fridman\n\n What the last of the Holocaust survivors deserve from us\n\n As Knesset committee chair, I’m pushing for funds no longer needed for the deceased to be used to provide dignity, health, and security for those still left\n\nCatherine Perez-Shakdam\n\n How the Iranian regime plans to survive its own collapse\n\n The Revolutionary Guard aims to hold on to power while shedding its most discredited skin. The people fighting for freedom can’t let that happen\n\nRocky Abramson\n\n PTSD on steroids: A psychological epidemic after October 7th\n\n The timing and intensity of this war were harsh triggers, and many need treatment, but even those without a diagnosis would benefit from these tips to reduce stress\n\nRawan Osman\n\n Is tradition in Judaism still relevant?\n\n Why would a rational, educated woman choose to join an ancient people and embrace traditions that seem to belong to another age?\n\nBrad Goverman\n\n Renee Good’s death by design\n\n Tragedy was the predictable outcome of a system built to prioritize intimidation over judgment, speed over restraint, and obedience over accountability\n\nMijal Bitton\n\n You can do God’s will without a burning bush\n\n Even without a dramatic reveal showing how much our actions matter, we are responsible for doing the good within our reach (Shemot)\n\nMichael Feldstein\n\n How we made the ‘shidduch’ crisis worse\n\n Before the now common rigid gender separation, Orthodox couples like my wife and me met organically. Here are 3 ways to improve the current culture of dating\n\n Australia must answer this question before it investigates Bondi\n\n Without recognizing the harm this one thing does to Jews, the commission of inquiry into the massacre will be worthless\n\n Latest Articles\n\n 20 minutes ago\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\n 50 minutes ago\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n 2 hours ago\n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\n 2 hours ago\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\n 4 hours ago\n\n AnalysisWhy the massive Iran protests haven’t toppled its clerical establishment\n\n 4 hours ago\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\n 4 hours ago\n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n 4 hours ago\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\n 5 hours ago\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\n 6 hours ago\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\n 6 hours ago\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\n 7 hours ago\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\n 7 hours ago\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\n 7 hours ago\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\n 8 hours ago\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\n 8 hours ago\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\n 8 hours ago\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\n 8 hours ago\n\n Interview34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\n 10 hours ago\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\n 10 hours ago\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\n Latest Blogs\n\n Gilles Touboul\n\n Washington threatens Tehran, the ...\n\n Mijael Even David\n\n Judaism is not an enemy of libera...\n\n Abraham Mannil Thomas\n\n In those days, and at that time, ...\n\n Mohamed Marshall Omer\n\n Israel’s Somaliland Recognition...\n\n Jasmin Mojrenfeld Polite\n\n A strong Jewish community shapes ...\n\n Orna Raz\n\n My Year Of Service In Merhavim Re...\n\n Elaine Rosenberg Miller\n\n Persia\n\n Leah Preston\n\n How Fear Shapes Advocacy on Campus\n\n Rebecca Bardach\n\n Return and Repair, North and Sout...\n\n Sheldon Kirshner\n\n Iran Convulsed By Anti-Government...\n\nToday's Daily Briefing\n\nDay 830 – Coalition’s latest attempt to rescue the PM\n\n listen to the podcast\n\nFlower Power\n\nBlack markets, propaganda, and... wildflowers.\n\n listen to the podcast\n\nThose We Have Lost\n\nCivilians and soldiers who have fallen since Oct. 7\n\n Read Here\n\n Full Coverage\n 2023-2025 Israel-Hamas war \n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects \n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Howling winds send walls crashing down on Gaza tent camps, killing four \n\nBy AP and ToI Staff\n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\nPromoting Community\n\nThe Times of Israel\n\nDaily Edition\n\nFree to Your Inbox\n\n The email is either missing or invalid.\n\n By signing up, you agree to our \n\n You hereby accept The Times of Israel Terms of Use and Privacy Policy, and you agree to receive the latest news & offers from The Times of Israel and its partners or ad sponsors.\n\n Full Coverage\n Times of Israel podcasts \n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\n Daily Briefing Jan. 12: Day 829 – Qatargate suspect Einhorn labeled ‘fugitive criminal’ \n\nBy Amanda Borschel-Dan and Jeremy Sharon\n\n Daily Briefing Jan. 11: Day 828 – Iran threatens Israel as anti-regime protests hit 2-week mark \n\nBy Amanda Borschel-Dan and Lazar Berman\n\n Full Coverage\n Hamas hostages \n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity \n\nBy ToI Staff\n\n As hostage-deal lobby disbands, a new group forms to home in on long road to recovery \n\nBy Jessica Steinberg\n\n Einav Zangauker considering entering politics ‘to send home’ Netanyahu \n\nBy ToI Staff\n\n Full Coverage\n Liveblog \n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire \n\nBy ToI Staff\n\n Jan. 12: IDF says it’s on alert for ‘surprise scenarios,’ calls Iran protests ‘an internal matter’ \n\nBy ToI Staff\n\n Jan. 11: UN chief ‘shocked’ by violence against Iran protesters, urges restraint \n\nBy ToI Staff\n\nThose we have lost\n\nStories of the civilians and soldiers who have fallen in the Israel-Hamas war\n\n Those we have lost \n\n Yehudit Itzchaki, 76: Doting grandma, child of Holocaust survivors\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Ilan Lipovsky, 30: Psychology student, a ‘smart, quiet’ animal lover\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Karina Pritika, 23: Former gymnast ‘who spread light everywhere’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Adi Dagan, 68: Lifelong kibbutznik ‘charmed everyone naturally’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Chen Ben Avi, 23: Dreamed of traveling the world\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Adiel Twito, 32: Chef and reality TV star who ‘loved to feed people’\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Ayala, 73, Liel & Yannai Hetzroni, 12: Great aunt and twins she raised\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Roland and Ronit Sultan, 68 & 55: Immigrant couple built kibbutz life\n\n \n\n By ToI Staff \n \n\n THOSE WE HAVE LOST \n\n Avi Hatuel, 52: Rescued family by confronting terrorists\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Mapal Adam, 25: Hid under a truck from Hamas terrorists for hours\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Noa Glazberg, 43: Devoted daughter ‘never stopped laughing’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Celine Ben David, 32: New mom celebrating last week of maternity leave\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Maya Bitton, 22 & Eliran Mizrahi, 23: Had just set a wedding date\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Meechai Ritthiphon, 42: Thai farmer hoped to move to Canada\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Yonatan Richter, 48: The ‘good guy’ who came to rave to help\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Staff Sgt. Roey Weiser, 21: Sought to divert Hamas terrorists from base\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Idan Edri, 36: Animal lover who ‘just went to dance’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Adir Mesika, 23: Charged at terrorists to save girlfriend and friends\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Sami al-Jerjawi, 51: Van driver and father of 30 ‘respected everyone’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Yuval and Noam Rabia, 33 & 30: Brothers slain at Psyduck festival\n\n \n\n By ToI Staff \n \n\nTales of the Times\n\nThe quirky, improbable, infuriating and uplifting\n\n A blooming friendship \n\n Over 50,000 Dutch tulips brighten Gaza border communities\n\n \n\n By Sue Surkes \n \n\n Unperturbed \n\n ‘Lords of the Sound’ orchestra back for 2nd tour amid wartime boycott\n\n \n\n By Jessica Steinberg \n \n\n Homeward bound \n\n Israelis pick ‘homecoming’ as Hebrew word of the year\n\n \n\n By ToI Staff \n \n\n In the frame \n\n Community leaders honored in inaugural Women of Iron awards\n\n \n\n By Jessica Steinberg \n \n\n Crashed and burned \n\n US court says ‘Top Gun: Maverick’ didn’t infringe Israeli writer’s copyright\n\n \n\n By Reuters \n \n\n Roll the dice \n\n Tel Aviv exhibit joins Jewish concepts to role-playing games\n\n \n\n By Jessica Steinberg \n \n\n To the Max \n\n HBO Max streaming to launch in Israel this month\n\n \n\n By Jessica Steinberg \n \n\n Blown off course \n\n Trump eagle-minded post tilts at windmills, crash lands in Israel\n\n \n\n By AFP \n \n\n Concrete art \n\n Exhibit brings visitors back to Tel Aviv’s Shalom Meir Tower\n\n \n\n By Jessica Steinberg \n \n\n Comeback performance \n\n Concert of former captive Alon Ohel sells out in hours\n\n \n\n By Jessica Steinberg \n \n\n Banishing darkness \n\n Shiri Bibas’s sister lights parents’ menorah while on reserve duty in Gaza\n\n \n\n By Jessica Steinberg \n \n\n Storm in a pint glass \n\n US rabbis warn against assuming beer is always kosher\n\n \n\n By David I. Klein \n \n\n Light entertainment \n\n ‘KPop Demon Hunters,’ AI lead this year’s Hanukkah video crop\n\n \n\n By Zev Stub \n \n\n Crimson tide \n\n Rain colors the coast of Iran’s Hormuz Island crimson\n\n \n\n By AP \n \n\n Holiday spirit \n\n Nazareth’s classical Christmas concerts return home\n\n \n\n By Jessica Steinberg \n \n\n Small sparks \n\n ‘Out of darkness’: Freed hostages lead Hanukkah candle-lightings\n\n \n\n By ToI Staff \n \n\n Red flag \n\n New Jersey city accidentally raises Palestinian flag on intifada anniversary\n\n \n\n By Luke Tress \n \n\n Built to last \n\n Discovery at Pompeii reveals the secrets of ancient Roman concrete\n\n \n\n By Will Dunham \n \n\n A message that it's calm \n\n Christmas festivities return to Bethlehem after 2 years of war in Gaza\n\n \n\n By Agencies and ToI Staff \n \n\n Hoops star \n\n Deni Avdija now Israel’s all-time leading NBA scorer\n\n \n\n By Ethan Rubinson and ToI Staff \n \n\n Scroll to view more\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nterms and conditions\n\nprivacy policy\n\nadvertise with us\n\nJobs at The Times of Israel\n\nJoin our community\n\nGet the Daily Edition\n Enter your email address\n\n © 2026 The Times of Israel, all rights reserved \n\n Concept, design & development by\n\n Powered by\n\nNever miss breaking news on Israel\n\nGet notifications to stay updated\n\nStay updated\n\nYou're subscribed\n\nclose popup\n\nRegister for free \n and continue reading\n\nRegistering allows you to manage your newsletters and alerts and helps us improve your experience. It takes just a few seconds.\n\nAlready registered? Enter your email to sign in.\n\nEmail address\n\nPlease use the following structure: example@domain.com\n\nREGISTER OR SIGN IN\n\nOr Continue with\n\n By registering you agree to the terms and conditions. Once registered, you’ll receive our Daily Edition email for free.\n\nSend me The Times of Israel Daily Edition\n\nclose popup\n\nRegister to continue\n\nEmail address\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Register\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nI forgot my password\n\nSend me a sign in link\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete your registration.","url":"https://www.timesofisrael.com/neo-nazi-convicted-of-planning-to-fire-explosives-at-cops-during-san-diego-anti-trump-rally/","image":"https://static-cdn.toi-media.com/www/uploads/2026/01/AP26013697607783-e1768349357649.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":"Us Attorney","authors":["Us Attorney"],"language":"en","category":"politics","source_country":"il","sentiment":-0.155},{"id":392849164,"title":"'Help is on its way': Trump urges Iranians to keep protesting, seize institutions","text":"Skip to main content\n\n Toggle Menu\n\nJoin our Community\n\nSupport ToI and remove all ads\n\n Learn more\n\nGet The Daily Edition\n\n Account\n\n Sign In\n\n \n\nISRAEL AT WAR - DAY 831 \n\n Open Search form\n\n Input search\n\nClear search input\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nNewsletters\n\nThe Daily Edition\nWhat Matters Most Today\n\nTech Israel\nUpdates from Silicon Wadi\n\nReal Estate Israel\nMonthly Update\n\nThe Weekend Edition\nThe Best Reads of the Week\n\nWeekly Highlights\nChoice Voices From The Blogs\n\nAtlanta Jewish Times\n\nNorth New Jersey\nThe Jewish Standard\n\nJewish Chronicle\n\nUnited Kingdom\nThe Jewish News\n\nThe Australian Jewish News\n\nFor Publishers\nBecome a Partner \n\nJoin our community\n\nAbout The Times of Israel\n\nAdvertise on The Times of Israel\n\nGet the Daily Edition\n\n© 2026 The Times of Israel , All Rights Reserved\n\nTerms and conditions\nPrivacy policy\n\n Open Search form\n\n Input search\n\nClear search input\n\n \n\nAdvertisement\n\nMossad reportedly puts death toll at 5,000\n\n‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\nUS president says he has canceled unspecified meetings with Iranian officials, declines to elaborate on offer of help; Witkoff said to meet with son of deposed shah \n\n \n\n By ToI Staff, Agencies, Lazar Berman\n\nYou will receive email alerts from this author.\nManage alert preferences on your profile page\n\nYou will no longer receive email alerts from this author.\nManage alert preferences on your profile page\n\n and Jacob Magid\n\nYou will receive email alerts from this author.\nManage alert preferences on your profile page\n\nYou will no longer receive email alerts from this author.\nManage alert preferences on your profile page\n\n 13 January 2026, 11:10 pmUpdated at 1:48 am\n\n Edit\n\n \n\n \n\nSend by email\n\n \n\n \n \n\nUS President Donald Trump speaks at the Detroit Economic Club, January 13, 2026, in Detroit. (AP/Ryan Sun)\n\nAppearing to depart from the notion of negotiating with the Iranian government, US President Donald Trump told protesters in Iran on Tuesday that “help is on its way” and urged them to keep protesting and take control of the country’s institutions.\n\nHe added that those who have killed protesters would “pay a big price.”\n\nTrump’s remarks, made in a social media post, came after Iranian authorities said some 2,000 people had been killed in the mass demonstrations, though the Mossad was reported to say that the true toll was more than twice as high.\n\nIranian authorities have now insisted that they have regained control of the country. But Trump urged the protests to continue.\n\n“Iranian Patriots, KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!! Save the names of the killers and abusers. They will pay a big price,” Trump wrote on his Truth Social platform. “I have cancelled all meetings with Iranian Officials until the senseless killing of protesters STOPS.”\n\n Get The Times of Israel's Daily Edition\n by email and never miss our top stories\n\n Newsletter email address\n\n By signing up, you agree to the terms\n\n“HELP IS ON ITS WAY,” he added.\n\nTwo days before publishing that post, Trump had appeared to tack toward negotiations with Iran, saying the regime wanted to talk and that the discussions were “being set up.” Now, the US president was broadcasting ambiguity about what his post means.\n\n“You’re going to have to figure that one out. I’m sorry,” he told reporters on Tuesday in response to a question about the post.\n\nAdvertisement\n\nLater, in a speech in Michigan otherwise focused on the economy, Trump essentially repeated the text of the post, telling protesters to “take over your institutions if possible,” reiterating that meetings with Iranian officials had been canceled, and saying again, without elaborating, that “help is on its way.”\n\n“Save the name of the killers and the abusers,” he repeated, “because they’ll pay a very big price.”\n\npic.twitter.com/dLuCtZaP0o\n\n— Rapid Response 47 (@RapidResponse47) January 13, 2026\n\nTalks on the Iranian protests did happen — but not with representatives of Iran’s regime. Axios reported, citing an unnamed senior US official, that White House Middle East envoy Steve Witkoff met with Reza Pahlavi, the exiled son of Iran’s last shah, over the weekend to discuss the demonstrations.\n\nPahlavi, who lives in exile, has become an increasingly prominent voice in the fragmented Iranian opposition in recent days. He has been encouraging Iranians to take to the streets to oppose the regime. The meeting comes after Trump, last week, had indicated that he did not plan to meet with Pahlavi, saying that he “seems like a nice person,” but that it would not be “appropriate at this point.”\n\nAdvertisement\n\n“There has been an ascendance of Pahlavi. They are chanting his name in demonstrations in many cities and it seems to be happening organically,” a US official told Axios.\n\nElsewhere, diplomatic engagement was taking place. The European Union summoned Iran’s ambassador in Brussels over the Islamic Republic’s response to the protests, an EU official said Tuesday on condition of anonymity.\n\nFrance, Germany and the United Kingdom also summoned their Iranian ambassadors to protest what French Foreign Minister Jean-Noel Barrot called “state violence unquestioningly unleashed on peaceful protesters.”\n\n Anti-Iranian regime protesters hold pre-1979 Iranian flags, US flags and light their cellphones during a gathering outside the US Consulate in Milan, January 13, 2026. (Piero CRUCIATTI / AFP)\n\nTrump’s post came as reports of the death toll from the protests has continued to mount. Other sources have reported far higher numbers than the figure cited by Iran’s authorities. According to an American official quoted by Channel 12 news on Tuesday, the Mossad has conveyed to the US that at least 5,000 Iranians have been killed in the protests.\n\n“[Security forces] are deliberately shooting at the head and the eyes. They want to damage the head and the eyes so they can no longer see, the same thing they did in [2022],” a doctor at a Tehran hospital told the Guardian.\n\n“Eyes were hit by birdshot pellets and it was deliberate, they are shooting to kill.”\n\nTrump lamented the death toll on Tuesday, even as he said its true scope was unclear.\n\n“I hear five different sets of numbers,” Trump said in the Michigan speech. “Look, one death is too much, but I hear much lower numbers, and then I hear much higher numbers.”\n\nAdvertisement\n\n In this frame grab from footage circulating on social media from Iran shows protesters taking to the streets of Tehran despite an intensifying crackdown as the Islamic Republic remains cut off from the rest of the world in Tehran, Iran, January 10, 2026. (UGC via AP)\n\nAgainst that backdrop, Trump has repeatedly threatened Tehran with military action if his administration found the Islamic Republic was using deadly force against anti-government protesters. On Sunday, he told reporters he believed Iran was “starting to cross” that line and has left him and his national security team weighing “very strong options.”\n\nOn Monday, Trump said he would slap 25% tariffs on countries doing business with Tehran “effective immediately,” but the White House has not provided details on that move.\n\nChina, the United Arab Emirates, Turkey, Brazil and Russia are among the economies that do business with Tehran.\n\nVice President JD Vance, Secretary of State Marco Rubio and key White House National Security Council officials began meeting Friday to develop options for Trump, ranging from a diplomatic approach to military strikes.\n\nIran, through the country’s parliamentary speaker, has warned that Israel and the US military and Israel would be “legitimate targets” if Washington uses force to protect demonstrators.\n\nOn Tuesday evening, Prime Minister Benjamin Netanyahu convened his security cabinet for a prescheduled meeting.\n\n A protester holds up a poster showing Iran’s exiled crown prince Reza Pahlavi, left, and US President Donald Trump, right, as she demonstrates outside the Houses of Parliament, in London, England, January 13, 2026. (AP Photo/Kin Cheung)\n\nMore than 600 protests have taken place across all of Iran’s 31 provinces, the Human Rights Activists News Agency reported Tuesday. The activist group said 1,850 of the dead were protesters and 135 were government-affiliated. It said more than 16,700 people had been detained.\n\nAdvertisement\n\nThe demonstrations are the biggest Iran has seen in years — protests spurred by the collapse of Iranian currency that have morphed into a larger test of the supreme leader, Ayatollah Ali Khamenei, and his repressive rule.\n\nThe Iranian government on Monday sought to regain control of the streets with mass nationwide rallies that Khamenei hailed as proof that the protest movement was defeated, calling them a “warning” to the United States.\n\nBut advocates urging Trump to take strong action against Iran say this moment offers an opportunity to further diminish the theocratic government that’s ruled the country since the Islamic revolution in 1979.\n\nTrump also may have hinted at that possibility in his speech.\n\n“I say make Iran great again,” he said, in a play on his “MAGA” slogan. “You know, it was a great country until these monsters came in and took it over.”\n\n Is accurate Israel coverage important to you? \n\n \n\nIf so, we have a request. \n\nEvery day during the past two years of war and rising global anti-Zionism and antisemitism, our journalists kept you abreast of the most important developments that merit your attention. Millions of people rely on ToI for fact-based coverage of Israel and the Jewish world. \n\nWe care about Israel - and we know you do too. So we have an ask for this new year of 2026: express your values by joining The Times of Israel Community, an exclusive group for readers like you who appreciate and financially support our work. \n\n I'm with you and will give \n\n I'm with you and will give \n\n Already a member? Sign in to stop seeing this\n\n You appreciate our journalism \n\n \n\n We’re really pleased that you’ve readX Times of Israel articles in the past month.\n\nYou clearly find our careful reporting valuable, in a time when facts are often distorted and news coverage often lacks context.\n\nYour support is essential to continue our work. We want to continue delivering the professional journalism you value, even as the demands on our newsroom have grown dramatically since October 7.\n\nSo today, please consider joining our reader support group, The Times of Israel Community. For as little as $6 a month you'll become our partners while enjoying The Times of Israel AD-FREE, as well as accessing exclusive content available only to Times of Israel Community members.\n\nDavid Horovitz, Founding Editor of The Times of Israel\n\n Join Our Community \n\n Join Our Community \n\n Already a member? Sign in to stop seeing this\n\n Most Popular\n\nIn first calls to outside world, Iranians describe heavy security and damage\n\nIDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nFreed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nIranian authorities say some 2,000 people killed in protests, as news trickles out\n\nIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nAustralian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nJerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nAfter decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nAdvertisement\n\n read more:\n\n \n\n Israel & the Region\n\n \n\n Iran protests\n\n \n\n Donald Trump\n\n \n\n Reza Pahlavi\n\n \n\n Steve Witkoff\n\n \n\n Ali Khamenei\n\n \n\n \n\n If you’d like to comment, join \n The Times of Israel Community.\n\n JOIN THE TOI COMMUNITY\n Already a member? Log in here\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nPaying ToI Community members are invited to comment on articles\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nOr Continue with\n\nBy joining you agree to the terms and conditions\n\nclose popup\n\nRegister to continue\n\nEmail address *\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address *\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nYou are currently registered. Please join The Times of Israel Community to comment and enjoy other Community benefits\n\nOnly ToI Community members can comment below articles\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nForgot your password?\n\nSend me a login link\n\nSign in without joining\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete registration so you can comment.\n\nclose popup\n\nJoin The Times of Israel Community\n\nCommenting is available for paying members of The Times of Israel Community only. Please join our Community to comment and enjoy other Community benefits.\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nclose popup\n\nThank you! Now check your email\n\nYou are now a member of The Times of Israel Community! We sent you an email with a login link to . Once you're set up, you can start enjoying Community benefits and commenting.\n\n \n\nAdvertisement\n\nAdvertisement\n\n \n\nJanuary 14, 2026\n\nCurrent Top Stories\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\nBy ToI Staff, Agencies, Lazar Berman and Jacob Magid\n\n US president says he has canceled unspecified meetings with Iranian officials, declines to elaborate on offer of help; Witkoff said to meet with son of deposed shah \n\n IDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nBy Stav Levaton, Jacob Magid and Agencies\n\n Trump: US military ‘looking at very strong options’ on Iran, Tehran ‘wants to negotiate’\n\nBy Jacob Magid, ToI Staff and AP\n\n Some US senators skeptical about military options for Iran\n\nBy Matt Tracy\n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire\n\nBy ToI Staff\n\n Several countries urge citizens to leave Iran * Mossad said to estimate Iran death toll at over 5,000 * Foreign Ministry severs ties with multiple UN agencies, citing anti-Israel bias\n\n 11:51 pm\n\n Iran claims US, Israel to blame for 'loss of innocent civilian lives' in deadly protest crackdown\n\n 11:44 pm\n\n Tehran doctors say Iranian security forces intentionally firing at protesters' eyes and heads\n\n 10:50 pm\n\n Senior Khamenei aide speaks with Qatari PM about protests after calling Trump, Netanyahu 'main killers' of Iranians\n\n 10:36 pm\n\n Heading into briefing, Trump says he'll soon have 'accurate numbers' on Iran protest death toll\n\n Iranian authorities say some 2,000 people killed in protests, as news trickles out\n\nBy Agencies and ToI StaffOpposition-aligned site claims 12,000 killed, far higher than any NGO or state estimates; Tehran defends internet block, as Germany’s Merz predicts regime in ‘last days and weeks’ \n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\nBy Melanie Lidman\n\n In first calls to outside world, Iranians describe heavy security and damage\n\nBy Agencies\n\n Israel, Germany agree to boost counterterrorism cooperation amid threat from Iran\n\n Coalition leaders urge Netanyahu to defy potential High Court ruling to fire Ben Gvir\n\nBy Ariela Karmel and ToI Staff\n\n In filing ahead of Thursday hearing, police minister tells judges they have no standing to rule on petitions calling for his ouster, accuses the AG of a conflict of interest\n\n UTJ’s Gafni calls for government to ignore High Court rulings on Haredi draft law\n\nBy Ariela Karmel\n\n Knesset advances bill subordinating police internal affairs unit to justice minister\n\nBy Jeremy Sharon\n\n Levin threatens to paralyze Supreme Court, sets out plans for renewed judicial overhaul\n\nBy ToI Staff\n\n Analysis\nSamia Nakhoul\n\n Why the massive Iran protests haven’t toppled its clerical establishment\n\n Protests have gone on for weeks, but unless street unrest and foreign pressure can prompt defections at the top, the regime, though weakened, will likely hold, analysts say \n\n AnalysisIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nBy Parisa Hafezi\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\nBy Luke Tress\n\n Hochul proposes ban on demonstrations within 25 feet of houses of worship to prevent antisemitic harassment\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\nBy Luke Tress\n\n Mississippi suspect laughed as he confessed to torching ‘Synagogue of Satan’ — FBI\n\nBy Luke Tress and Zev Stub\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Senior government official says Islamic Jihad knows where last slain hostage Ran Gvili is located\n\n Hamas seeks to rebuild shattered leadership as it faces postwar uncertainty\n\nBy AFP and ToI Staff\n\n Head of Gaza militia claims killing of senior Hamas cop\n\nBy Noam Lehmann and Reuters\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\nBy Agencies\n\n Washington accuses brotherhood branches of collaborating with Hamas and Hezbollah; Egypt, where fundamentalist group was born, praises move against ‘extremist ideology’\n\n UAE said to slash scholarships to study in UK, citing fear of Muslim Brotherhood\n\nBy ToI Staff\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\nBy AP and ToI Staff\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nBy ToI Staff\n\n Sa’ar decries UN Women for ignoring sexual violence cases on Oct. 7, slams another agency for wastefulness, will examine ties with further UN organizations \n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n Foreign Ministry confirms Samoa will open embassy in Jerusalem this year\n\nBy Lazar Berman and ToI Staff\n\n Knesset advances bill establishing military tribunal to try October 7 perpetrators\n\nBy ToI Staff\n\n Legislation would allow for death penalty and bar suspects from being released in prisoner exchange deals; hearings to be open to the public and broadcast live\n\n Three sentenced for Oct. 8 looting of belongings of Nova festival victims\n\nBy ToI Staff\n\n Zamir unveils multi-year plan for reinvigorating IDF after two years of war\n\nBy Stav Levaton\n\n 34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\nBy Jessica Steinberg\n\n Realizing he alone could obtain answers, first-time author Eyal Eshel hunted for clues of his child’s fate, while taking the government to task for ‘breaking a social contract’\n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nBy ToI Staff\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\nBy Michael Horovitz and Reuters\n\n Yaakov Harari, 72, said to be among 125 accused of serving as US mercenaries last January; Venezuela says release of prisoners part of efforts to ‘seek peace’ with Washington\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\nBy ToI Staff\n\n Amiram Ben Uliel, who perpetrated 2015 Duma firebombing that killed 18-month-old Ali Dawabsha and his parents, has been in prison for a decade and is serving three life sentences\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\nBy Sharon Wrobel\n\n Government working on a plan to float 25-30% of arms manufacturers on the Tel Aviv Stock Exchange later this year, as demand for battle-tested systems skyrockets\n\n Op-ed\n\n The government isn’t just dodging the Haredi draft; it’s dodging the law\n\n By ignoring the High Court’s ruling on military conscription, the coalition is stripping the judiciary of its power and risking a total breakdown of Israel’s democratic regime\n\n AG: Government violating court order on Haredi draft, in ‘real danger’ to democracy\n\nBy Jeremy Sharon\n\n Defense chiefs condemn violent disruption of Bnei Brak conference for Haredi brigade\n\nBy Stav Levaton and ToI Staff\n\n Jerusalem woman dies, teen missing, as winter storm lashes Israel with wind and rain\n\nBy ToI Staff\n\n Shuafat camp resident apparently hit by heavy object; several people lightly injured in other locations, others rescued from flood-swamped cars\n\n Howling winds send walls crashing down on Gaza tent camps, killing four\n\nBy AP and ToI Staff\n\n Australian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nBy Agencies and ToI StaffEvent falls apart as director resigns in protest against the disinviting of Randa Abdel-Fattah, who said Hamas is not a terror group and wished hell to ‘every last Zionist’ \n\n Australian parliament to meet early to pass hate speech laws after Bondi terror attack\n\n UK school nixed Labour MP’s civics talk, after outcry over his support for Israel\n\nBy ToI Staff\n\n Celebrities, NGOs sign letter accusing Israel of ‘direct attack’ on Gaza health care\n\nBy ToI Staff\n\n Some 60 actors, human rights groups and Palestinian medical personnel demand unfettered aid to Palestinians, use language lifted from Genocide Convention, accuse Israel of targeting civilians\n\n In reversal, Jewish US House candidate Scott Wiener says Israel committed ‘genocide’\n\nBy JTA and ToI Staff\n\n IDF has demolished over 2,500 buildings in Gaza since start of ceasefire – report\n\nBy ToI Staff, Noam Lehmann and Stav Levaton\n\n Cameron Kasky embodies rising Gen Z Jewish criticism of Israel. Can it get him to Congress?\n\nBy Joseph Strauss\n\n The 25-year-old Parkland school shooting survivor reflects a new political landscape after more than two years of war in Gaza, though his inexperience has some NY voters hesitating\n\n Online ICE fundraiser calls Minneapolis Mayor Jacob Frey a ‘Jewish traitor’\n\nBy Andrew Lapin\n\nMore Headlines\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\nBy Stav Levaton\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\nBy Reuters and ToI Staff\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\nBy STEPHEN GROVES\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\nBy Agencies\n\n After decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nBy ToI Staff\n\n Ex-NYC mayor Eric Adams launches cryptocurrency, says it will fight antisemitism\n\nBy Luke Tress and ToI Staff\n\n PM’s chief of staff, appealing release terms, says police probe is ‘delusional, political’\n\nBy ToI Staff\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\nBy Michael Holden\n\n Draw sets Israel’s opponents for Eurovision semifinal slated for May 12 in Vienna\n\nBy AFP and ToI Staff\n\n Anti-Israel activists drop lawsuit against Northwestern U antisemitism training\n\nBy Luke Tress\n\n ‘Arab blood isn’t cheap’: Hundreds rally in capital over police failure on violent crime\n\nBy ToI Staff\n\nNili Bresler\n\n Sundown at Hostages Square\n\n After more than two years, it’s time for the people of the Square to fold up the tents, stack the chairs, and move on with our lives. What are we waiting for?\n\nOrit Mizner\n\n Designing Jewish life, not just defending it\n\n Organizations are investing so much in the battle against antisemitism that they risk losing the longer fight for Jewish connection\n\nLeigh Hartzman\n\n Can we separate the art from the antisemitism?\n\n Losing an intellectual home means losing a source of comfort – it’s a painful realization that the culture that shaped you no longer wants you\n\n When solidarity costs too much: Europe’s silence on Iran\n\n The uprising is a textbook liberation movement, but supporting it could serve Israeli interests – and thisdoesn’t fit the oppressor-oppressed binary \n\nYasmin Sacks Fridman\n\n What the last of the Holocaust survivors deserve from us\n\n As Knesset committee chair, I’m pushing for funds no longer needed for the deceased to be used to provide dignity, health, and security for those still left\n\nCatherine Perez-Shakdam\n\n How the Iranian regime plans to survive its own collapse\n\n The Revolutionary Guard aims to hold on to power while shedding its most discredited skin. The people fighting for freedom can’t let that happen\n\nRocky Abramson\n\n PTSD on steroids: A psychological epidemic after October 7th\n\n The timing and intensity of this war were harsh triggers, and many need treatment, but even those without a diagnosis would benefit from these tips to reduce stress\n\nRawan Osman\n\n Is tradition in Judaism still relevant?\n\n Why would a rational, educated woman choose to join an ancient people and embrace traditions that seem to belong to another age?\n\nBrad Goverman\n\n Renee Good’s death by design\n\n Tragedy was the predictable outcome of a system built to prioritize intimidation over judgment, speed over restraint, and obedience over accountability\n\nMijal Bitton\n\n You can do God’s will without a burning bush\n\n Even without a dramatic reveal showing how much our actions matter, we are responsible for doing the good within our reach (Shemot)\n\nMichael Feldstein\n\n How we made the ‘shidduch’ crisis worse\n\n Before the now common rigid gender separation, Orthodox couples like my wife and me met organically. Here are 3 ways to improve the current culture of dating\n\n Australia must answer this question before it investigates Bondi\n\n Without recognizing the harm this one thing does to Jews, the commission of inquiry into the massacre will be worthless\n\n Latest Articles\n\n 20 minutes ago\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\n 50 minutes ago\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n 2 hours ago\n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\n 2 hours ago\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\n 4 hours ago\n\n AnalysisWhy the massive Iran protests haven’t toppled its clerical establishment\n\n 4 hours ago\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\n 4 hours ago\n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n 4 hours ago\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\n 5 hours ago\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\n 6 hours ago\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\n 6 hours ago\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\n 7 hours ago\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\n 7 hours ago\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\n 7 hours ago\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\n 8 hours ago\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\n 8 hours ago\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\n 8 hours ago\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\n 8 hours ago\n\n Interview34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\n 10 hours ago\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\n 10 hours ago\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\n Latest Blogs\n\n Gilles Touboul\n\n Washington threatens Tehran, the ...\n\n Mijael Even David\n\n Judaism is not an enemy of libera...\n\n Abraham Mannil Thomas\n\n In those days, and at that time, ...\n\n Mohamed Marshall Omer\n\n Israel’s Somaliland Recognition...\n\n Jasmin Mojrenfeld Polite\n\n A strong Jewish community shapes ...\n\n Orna Raz\n\n My Year Of Service In Merhavim Re...\n\n Elaine Rosenberg Miller\n\n Persia\n\n Leah Preston\n\n How Fear Shapes Advocacy on Campus\n\n Rebecca Bardach\n\n Return and Repair, North and Sout...\n\n Sheldon Kirshner\n\n Iran Convulsed By Anti-Government...\n\nToday's Daily Briefing\n\nDay 830 – Coalition’s latest attempt to rescue the PM\n\n listen to the podcast\n\nFlower Power\n\nBlack markets, propaganda, and... wildflowers.\n\n listen to the podcast\n\nThose We Have Lost\n\nCivilians and soldiers who have fallen since Oct. 7\n\n Read Here\n\n Full Coverage\n 2023-2025 Israel-Hamas war \n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects \n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Howling winds send walls crashing down on Gaza tent camps, killing four \n\nBy AP and ToI Staff\n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\nPromoting Community\n\nThe Times of Israel\n\nDaily Edition\n\nFree to Your Inbox\n\n The email is either missing or invalid.\n\n By signing up, you agree to our \n\n You hereby accept The Times of Israel Terms of Use and Privacy Policy, and you agree to receive the latest news & offers from The Times of Israel and its partners or ad sponsors.\n\n Full Coverage\n Times of Israel podcasts \n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\n Daily Briefing Jan. 12: Day 829 – Qatargate suspect Einhorn labeled ‘fugitive criminal’ \n\nBy Amanda Borschel-Dan and Jeremy Sharon\n\n Daily Briefing Jan. 11: Day 828 – Iran threatens Israel as anti-regime protests hit 2-week mark \n\nBy Amanda Borschel-Dan and Lazar Berman\n\n Full Coverage\n Hamas hostages \n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity \n\nBy ToI Staff\n\n As hostage-deal lobby disbands, a new group forms to home in on long road to recovery \n\nBy Jessica Steinberg\n\n Einav Zangauker considering entering politics ‘to send home’ Netanyahu \n\nBy ToI Staff\n\n Full Coverage\n Liveblog \n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire \n\nBy ToI Staff\n\n Jan. 12: IDF says it’s on alert for ‘surprise scenarios,’ calls Iran protests ‘an internal matter’ \n\nBy ToI Staff\n\n Jan. 11: UN chief ‘shocked’ by violence against Iran protesters, urges restraint \n\nBy ToI Staff\n\nThose we have lost\n\nStories of the civilians and soldiers who have fallen in the Israel-Hamas war\n\n Those we have lost \n\n Yehudit Itzchaki, 76: Doting grandma, child of Holocaust survivors\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Ilan Lipovsky, 30: Psychology student, a ‘smart, quiet’ animal lover\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Karina Pritika, 23: Former gymnast ‘who spread light everywhere’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Adi Dagan, 68: Lifelong kibbutznik ‘charmed everyone naturally’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Chen Ben Avi, 23: Dreamed of traveling the world\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Adiel Twito, 32: Chef and reality TV star who ‘loved to feed people’\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Ayala, 73, Liel & Yannai Hetzroni, 12: Great aunt and twins she raised\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Roland and Ronit Sultan, 68 & 55: Immigrant couple built kibbutz life\n\n \n\n By ToI Staff \n \n\n THOSE WE HAVE LOST \n\n Avi Hatuel, 52: Rescued family by confronting terrorists\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Mapal Adam, 25: Hid under a truck from Hamas terrorists for hours\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Noa Glazberg, 43: Devoted daughter ‘never stopped laughing’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Celine Ben David, 32: New mom celebrating last week of maternity leave\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Maya Bitton, 22 & Eliran Mizrahi, 23: Had just set a wedding date\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Meechai Ritthiphon, 42: Thai farmer hoped to move to Canada\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Yonatan Richter, 48: The ‘good guy’ who came to rave to help\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Staff Sgt. Roey Weiser, 21: Sought to divert Hamas terrorists from base\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Idan Edri, 36: Animal lover who ‘just went to dance’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Adir Mesika, 23: Charged at terrorists to save girlfriend and friends\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Sami al-Jerjawi, 51: Van driver and father of 30 ‘respected everyone’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Yuval and Noam Rabia, 33 & 30: Brothers slain at Psyduck festival\n\n \n\n By ToI Staff \n \n\nTales of the Times\n\nThe quirky, improbable, infuriating and uplifting\n\n A blooming friendship \n\n Over 50,000 Dutch tulips brighten Gaza border communities\n\n \n\n By Sue Surkes \n \n\n Unperturbed \n\n ‘Lords of the Sound’ orchestra back for 2nd tour amid wartime boycott\n\n \n\n By Jessica Steinberg \n \n\n Homeward bound \n\n Israelis pick ‘homecoming’ as Hebrew word of the year\n\n \n\n By ToI Staff \n \n\n In the frame \n\n Community leaders honored in inaugural Women of Iron awards\n\n \n\n By Jessica Steinberg \n \n\n Crashed and burned \n\n US court says ‘Top Gun: Maverick’ didn’t infringe Israeli writer’s copyright\n\n \n\n By Reuters \n \n\n Roll the dice \n\n Tel Aviv exhibit joins Jewish concepts to role-playing games\n\n \n\n By Jessica Steinberg \n \n\n To the Max \n\n HBO Max streaming to launch in Israel this month\n\n \n\n By Jessica Steinberg \n \n\n Blown off course \n\n Trump eagle-minded post tilts at windmills, crash lands in Israel\n\n \n\n By AFP \n \n\n Concrete art \n\n Exhibit brings visitors back to Tel Aviv’s Shalom Meir Tower\n\n \n\n By Jessica Steinberg \n \n\n Comeback performance \n\n Concert of former captive Alon Ohel sells out in hours\n\n \n\n By Jessica Steinberg \n \n\n Banishing darkness \n\n Shiri Bibas’s sister lights parents’ menorah while on reserve duty in Gaza\n\n \n\n By Jessica Steinberg \n \n\n Storm in a pint glass \n\n US rabbis warn against assuming beer is always kosher\n\n \n\n By David I. Klein \n \n\n Light entertainment \n\n ‘KPop Demon Hunters,’ AI lead this year’s Hanukkah video crop\n\n \n\n By Zev Stub \n \n\n Crimson tide \n\n Rain colors the coast of Iran’s Hormuz Island crimson\n\n \n\n By AP \n \n\n Holiday spirit \n\n Nazareth’s classical Christmas concerts return home\n\n \n\n By Jessica Steinberg \n \n\n Small sparks \n\n ‘Out of darkness’: Freed hostages lead Hanukkah candle-lightings\n\n \n\n By ToI Staff \n \n\n Red flag \n\n New Jersey city accidentally raises Palestinian flag on intifada anniversary\n\n \n\n By Luke Tress \n \n\n Built to last \n\n Discovery at Pompeii reveals the secrets of ancient Roman concrete\n\n \n\n By Will Dunham \n \n\n A message that it's calm \n\n Christmas festivities return to Bethlehem after 2 years of war in Gaza\n\n \n\n By Agencies and ToI Staff \n \n\n Hoops star \n\n Deni Avdija now Israel’s all-time leading NBA scorer\n\n \n\n By Ethan Rubinson and ToI Staff \n \n\n Scroll to view more\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nterms and conditions\n\nprivacy policy\n\nadvertise with us\n\nJobs at The Times of Israel\n\nJoin our community\n\nGet the Daily Edition\n Enter your email address\n\n © 2026 The Times of Israel, all rights reserved \n\n Concept, design & development by\n\n Powered by\n\nNever miss breaking news on Israel\n\nGet notifications to stay updated\n\nStay updated\n\nYou're subscribed\n\nclose popup\n\nRegister for free \n and continue reading\n\nRegistering allows you to manage your newsletters and alerts and helps us improve your experience. It takes just a few seconds.\n\nAlready registered? Enter your email to sign in.\n\nEmail address\n\nPlease use the following structure: example@domain.com\n\nREGISTER OR SIGN IN\n\nOr Continue with\n\n By registering you agree to the terms and conditions. Once registered, you’ll receive our Daily Edition email for free.\n\nSend me The Times of Israel Daily Edition\n\nclose popup\n\nRegister to continue\n\nEmail address\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Register\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nI forgot my password\n\nSend me a sign in link\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete your registration.","url":"https://www.timesofisrael.com/help-is-on-its-way-trump-urges-iranians-to-keep-protesting-seize-institutions/","image":"https://static-cdn.toi-media.com/www/uploads/2026/01/AP26013714552322.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","category":"politics","source_country":"il","sentiment":0.007},{"id":392849156,"title":"Why the massive Iran protests haven't toppled its clerical establishment","text":"Skip to main content\n\n Toggle Menu\n\nJoin our Community\n\nSupport ToI and remove all ads\n\n Learn more\n\nGet The Daily Edition\n\n Account\n\n Sign In\n\n \n\nISRAEL AT WAR - DAY 831 \n\n Open Search form\n\n Input search\n\nClear search input\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nNewsletters\n\nThe Daily Edition\nWhat Matters Most Today\n\nTech Israel\nUpdates from Silicon Wadi\n\nReal Estate Israel\nMonthly Update\n\nThe Weekend Edition\nThe Best Reads of the Week\n\nWeekly Highlights\nChoice Voices From The Blogs\n\nAtlanta Jewish Times\n\nNorth New Jersey\nThe Jewish Standard\n\nJewish Chronicle\n\nUnited Kingdom\nThe Jewish News\n\nThe Australian Jewish News\n\nFor Publishers\nBecome a Partner \n\nJoin our community\n\nAbout The Times of Israel\n\nAdvertise on The Times of Israel\n\nGet the Daily Edition\n\n© 2026 The Times of Israel , All Rights Reserved\n\nTerms and conditions\nPrivacy policy\n\n Open Search form\n\n Input search\n\nClear search input\n\n \n\nAdvertisement\n\nWhy the massive Iran protests haven’t toppled its clerical establishment\n\nProtests have gone on for weeks, but unless street unrest and foreign pressure can prompt defections at the top, the regime, though weakened, will likely hold, analysts say\n\n \n\n \n\n By Samia Nakhoul\n\n 13 January 2026, 11:24 pm\n\n Edit\n\n \n\n \n\nSend by email\n\n \n\n \n \n\nProtesters burn images of Ayatollah Ali Khamenei during a rally in support of anti-regime protesters in Iran, in central London, January 11, 2026. (Carlos Jasso/AFP)\n\nReuters —Despite Iran’s nationwide protests and years of external pressure, there are as yet no clear signs of fracture in the Islamic Republic’s security elite that could bring an end to one of the world’s most resilient governments.\n\nAdding to the stress on Iran’s clerical rulers, US President Donald Trump has repeatedly threatened military action over Tehran’s severe crackdown on the protests, which follow an air war between Israel and Iran last June in which the IDF, joined by US bombers, struck Iran’s nuclear facilities and key officials.\n\nResponding to Reuters, a White House official said “all options” were at Trump’s disposal to address the situation in Iran.\n\nBut unless the street unrest and foreign pressure can prompt defections at the top, the establishment, though weakened, will likely hold, two diplomats, two government sources in the Middle East and two analysts told Reuters.\n\nAround 2,000 people have been killed in the protests, an Iranian official told Reuters, blaming people he called terrorists for the deaths of civilians and security personnel. Human rights groups had previously tallied around 600 deaths. Some estimates of the death toll have been far higher.\n\n Get The Times of Israel's Daily Edition\n by email and never miss our top stories\n\n Newsletter email address\n\n By signing up, you agree to the terms\n\nIran’s layered security architecture, anchored by the Revolutionary Guards and Basij paramilitary force, which together number close to one million people, makes external coercion without internal rupture exceedingly difficult, said Vali Nasr, an Iranian-American academic and expert on regional conflicts and US foreign policy.\n\n“For this sort of thing to succeed, you have to have crowds in the streets for a much longer period of time. And you have to have a breakup of the state. Some segments of the state, and particularly the security forces, have to defect,” he said.\n\nIran’s foreign ministry declined to comment.\n\nAdvertisement\n\n Iranians ride their motorbike past a huge banner of former Iran Islamic Revolutionary Guard Corps (IRGC) Quds Force commander Qasem Soleimani ahead of the sixth anniversary of his assassination, at Valiasr Square in Tehran, on December 31, 2025. (ATTA KENARE / AFP)\n\nThe country’s supreme leader, Ayatollah Ali Khamenei, 86, has survived several past waves of unrest. This is the fifth major uprising since 2009, evidence of resilience and cohesion even as the government confronts a deep, unresolved internal crisis, said Paul Salem of the Middle East Institute.\n\nFor that to change, protesters would have to generate enough momentum to overcome the state’s entrenched advantages: powerful institutions, a sizeable constituency loyal to the clerical rule, and the geographic and demographic scale of a country of 90 million people, said Alan Eyre, a former US diplomat and Iran expert.\n\nSurvival, however, does not equal stability, the analysts said. The Islamic Republic is facing one of its gravest challenges since the 1979 Islamic Revolution. Sanctions have strangled the economy with no clear path to recovery. Strategically, it is under pressure from Israel and the United States, its nuclear program degraded, its regional “Axis of Resistance” proxies weakened by crippling losses to terror groups and other allies in Lebanon, Syria and Gaza.\n\nFor this sort of thing to succeed, you have to have crowds in the streets for a much longer period of time. And you have to have a breakup of the state. Some segments of the state, and particularly the security forces, have to defect.\n\nNasr said that while he didn’t think the Islamic Republic had reached the “moment of fall,” it was “now in a situation of great difficulty going forward.”\n\nThe protests began on December 28 in response to soaring prices, before turning squarely against clerical rule. Politically, the violent crackdown has further eroded what remained of the Islamic Republic’s legitimacy.\n\nAdvertisement\n\nWhat sets this moment apart, and raises the stakes, analysts say, is Trump’s explicit warnings that the killing of demonstrators could trigger an American intervention.\n\nOn Tuesday, Trump urged protesters to take over institutions and said “help is on its way,” while saying he was cancelling meetings with Iranian officials. Earlier, he threatened tariffs on countries that trade with Iran. China is Tehran’s top trade partner.\n\n US President Donald Trump speaks to reporters while in flight on Air Force One to Joint Base Andrews, Maryland, January 11, 2026. (AP Photo/Julia Demaree Nikhinson)\n\nIn a phone call on Saturday, Prime Minister Benjamin Netanyahu and US Secretary of State Marco Rubio discussed the possibility of US intervention in Iran, according to an Israeli source present for the conversation.\n\nTrump’s interest in the protests, the analysts said, is likely tactical rather than ideological, Salem said. The aim could be pliability — weakening the state enough to extract concessions such as curbs on Tehran’s nuclear program, he said.\n\nThe White House did not respond to a request for comment about Trump’s goals in Iran. The White House official said Trump had demonstrated with military operations in Iran and Venezuela last year and this month “that he means what he says.”\n\nThe idea of a “Venezuela model” has growing appeal in some circles in Washington and Jerusalem, a diplomat and three of the analysts said. It envisions the removal of Iran’s top authority while signaling to the remaining state apparatus: stay in place, provided they cooperate, they said.\n\nApplied to Iran, however, it collides with formidable obstacles — a security state entrenched for decades, deep institutional cohesion and a much larger and ethnically complex country.\n\n A man holds up national flags from Venezuela and Iran, during a government-organized march amid Israel’s war with Iran, in Caracas, Venezuela, June 19, 2025. (AP/Jesus Vargas)\n\nTwo regional officials and two of the analysts told Reuters that foreign military action could fracture Iran along ethnic and sectarian lines, particularly in Kurdish and Sunni Baloch regions with histories of resistance.\n\nAdvertisement\n\nFor now, constraints remain. US military assets are stretched elsewhere, though the diplomats said that deployments could shift quickly.\n\nDavid Makovsky at The Washington Institute for Near East Policy, a think tank, said that if Trump acts, he expects a swift, high-impact action rather than a prolonged campaign – consistent with the president’s preference in recent conflicts for a single decisive action rather than deploying ground troops.\n\n“He looks for this one gesture that might be a game changer, but what is it?” said Makovsky.\n\nOptions range from maritime pressure on Iranian oil shipments to targeted military or cyber strikes, all carrying serious risks.\n\nSome measures, all the sources said, could stop short of force, such as restoring internet access via Starlink to help protesters communicate. Some telecommunications access came back on Tuesday.\n\nThe White House and State Department did not respond to Reuters’ questions about what action, if any, Trump might take.\n\n“Trump sometimes uses threats to delay decisions, sometimes to deter adversaries, and sometimes to signal he is actually preparing to intervene,” said Makovsky. “We just don’t know yet which applies here.”\n\nTimes of Israel staff contributed to this report. \n\n Is accurate Israel coverage important to you? \n\n \n\nIf so, we have a request. \n\nEvery day during the past two years of war and rising global anti-Zionism and antisemitism, our journalists kept you abreast of the most important developments that merit your attention. Millions of people rely on ToI for fact-based coverage of Israel and the Jewish world. \n\nWe care about Israel - and we know you do too. So we have an ask for this new year of 2026: express your values by joining The Times of Israel Community, an exclusive group for readers like you who appreciate and financially support our work. \n\n I'm with you and will give \n\n I'm with you and will give \n\n Already a member? Sign in to stop seeing this\n\n You appreciate our journalism \n\n \n\n We’re really pleased that you’ve readX Times of Israel articles in the past month.\n\nYou clearly find our careful reporting valuable, in a time when facts are often distorted and news coverage often lacks context.\n\nYour support is essential to continue our work. We want to continue delivering the professional journalism you value, even as the demands on our newsroom have grown dramatically since October 7.\n\nSo today, please consider joining our reader support group, The Times of Israel Community. For as little as $6 a month you'll become our partners while enjoying The Times of Israel AD-FREE, as well as accessing exclusive content available only to Times of Israel Community members.\n\nDavid Horovitz, Founding Editor of The Times of Israel\n\n Join Our Community \n\n Join Our Community \n\n Already a member? Sign in to stop seeing this\n\n Most Popular\n\nIn first calls to outside world, Iranians describe heavy security and damage\n\nIDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nFreed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nIranian authorities say some 2,000 people killed in protests, as news trickles out\n\nIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nAustralian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nJerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nAfter decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nAdvertisement\n\n read more:\n\n \n\n Israel & the Region\n\n \n\n Iran protests\n\n \n\n Islamic Revolutionary Guard Corps IRGC\n\n \n\n Basij\n\n \n\n Ali Khamenei\n\n \n\n David Makovsky\n\n \n\n \n\n If you’d like to comment, join \n The Times of Israel Community.\n\n JOIN THE TOI COMMUNITY\n Already a member? Log in here\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nPaying ToI Community members are invited to comment on articles\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nOr Continue with\n\nBy joining you agree to the terms and conditions\n\nclose popup\n\nRegister to continue\n\nEmail address *\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address *\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Join The Times of Israel Community\n\nYou are currently registered. Please join The Times of Israel Community to comment and enjoy other Community benefits\n\nOnly ToI Community members can comment below articles\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nForgot your password?\n\nSend me a login link\n\nSign in without joining\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete registration so you can comment.\n\nclose popup\n\nJoin The Times of Israel Community\n\nCommenting is available for paying members of The Times of Israel Community only. Please join our Community to comment and enjoy other Community benefits.\n\nEmail address *\n\nPlease use the following structure: example@domain.com\n\nclose popup\n\nThank you! Now check your email\n\nYou are now a member of The Times of Israel Community! We sent you an email with a login link to . Once you're set up, you can start enjoying Community benefits and commenting.\n\n \n\nAdvertisement\n\n \n\nAdvertisement\n\n \n\nJanuary 14, 2026\n\nCurrent Top Stories\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\nBy ToI Staff, Agencies, Lazar Berman and Jacob Magid\n\n US president says he has canceled unspecified meetings with Iranian officials, declines to elaborate on offer of help; Witkoff said to meet with son of deposed shah \n\n IDF says it’s on alert for ‘surprise scenarios,’ as US mulls military strikes on Iran\n\nBy Stav Levaton, Jacob Magid and Agencies\n\n Trump: US military ‘looking at very strong options’ on Iran, Tehran ‘wants to negotiate’\n\nBy Jacob Magid, ToI Staff and AP\n\n Some US senators skeptical about military options for Iran\n\nBy Matt Tracy\n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire\n\nBy ToI Staff\n\n Several countries urge citizens to leave Iran * Mossad said to estimate Iran death toll at over 5,000 * Foreign Ministry severs ties with multiple UN agencies, citing anti-Israel bias\n\n 11:51 pm\n\n Iran claims US, Israel to blame for 'loss of innocent civilian lives' in deadly protest crackdown\n\n 11:44 pm\n\n Tehran doctors say Iranian security forces intentionally firing at protesters' eyes and heads\n\n 10:50 pm\n\n Senior Khamenei aide speaks with Qatari PM about protests after calling Trump, Netanyahu 'main killers' of Iranians\n\n 10:36 pm\n\n Heading into briefing, Trump says he'll soon have 'accurate numbers' on Iran protest death toll\n\n Iranian authorities say some 2,000 people killed in protests, as news trickles out\n\nBy Agencies and ToI StaffOpposition-aligned site claims 12,000 killed, far higher than any NGO or state estimates; Tehran defends internet block, as Germany’s Merz predicts regime in ‘last days and weeks’ \n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\nBy Melanie Lidman\n\n In first calls to outside world, Iranians describe heavy security and damage\n\nBy Agencies\n\n Israel, Germany agree to boost counterterrorism cooperation amid threat from Iran\n\n Coalition leaders urge Netanyahu to defy potential High Court ruling to fire Ben Gvir\n\nBy Ariela Karmel and ToI Staff\n\n In filing ahead of Thursday hearing, police minister tells judges they have no standing to rule on petitions calling for his ouster, accuses the AG of a conflict of interest\n\n UTJ’s Gafni calls for government to ignore High Court rulings on Haredi draft law\n\nBy Ariela Karmel\n\n Knesset advances bill subordinating police internal affairs unit to justice minister\n\nBy Jeremy Sharon\n\n Levin threatens to paralyze Supreme Court, sets out plans for renewed judicial overhaul\n\nBy ToI Staff\n\n Analysis\nSamia Nakhoul\n\n Why the massive Iran protests haven’t toppled its clerical establishment\n\n Protests have gone on for weeks, but unless street unrest and foreign pressure can prompt defections at the top, the regime, though weakened, will likely hold, analysts say \n\n AnalysisIran’s merchants, bankrollers of 1979 revolution, turn against clerics\n\nBy Parisa Hafezi\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\nBy Luke Tress\n\n Hochul proposes ban on demonstrations within 25 feet of houses of worship to prevent antisemitic harassment\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\nBy Luke Tress\n\n Mississippi suspect laughed as he confessed to torching ‘Synagogue of Satan’ — FBI\n\nBy Luke Tress and Zev Stub\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Senior government official says Islamic Jihad knows where last slain hostage Ran Gvili is located\n\n Hamas seeks to rebuild shattered leadership as it faces postwar uncertainty\n\nBy AFP and ToI Staff\n\n Head of Gaza militia claims killing of senior Hamas cop\n\nBy Noam Lehmann and Reuters\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\nBy Agencies\n\n Washington accuses brotherhood branches of collaborating with Hamas and Hezbollah; Egypt, where fundamentalist group was born, praises move against ‘extremist ideology’\n\n UAE said to slash scholarships to study in UK, citing fear of Muslim Brotherhood\n\nBy ToI Staff\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\nBy AP and ToI Staff\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\nBy ToI Staff\n\n Sa’ar decries UN Women for ignoring sexual violence cases on Oct. 7, slams another agency for wastefulness, will examine ties with further UN organizations \n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n Foreign Ministry confirms Samoa will open embassy in Jerusalem this year\n\nBy Lazar Berman and ToI Staff\n\n Knesset advances bill establishing military tribunal to try October 7 perpetrators\n\nBy ToI Staff\n\n Legislation would allow for death penalty and bar suspects from being released in prisoner exchange deals; hearings to be open to the public and broadcast live\n\n Three sentenced for Oct. 8 looting of belongings of Nova festival victims\n\nBy ToI Staff\n\n Zamir unveils multi-year plan for reinvigorating IDF after two years of war\n\nBy Stav Levaton\n\n 34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\nBy Jessica Steinberg\n\n Realizing he alone could obtain answers, first-time author Eyal Eshel hunted for clues of his child’s fate, while taking the government to task for ‘breaking a social contract’\n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity\n\nBy ToI Staff\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\nBy Michael Horovitz and Reuters\n\n Yaakov Harari, 72, said to be among 125 accused of serving as US mercenaries last January; Venezuela says release of prisoners part of efforts to ‘seek peace’ with Washington\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\nBy ToI Staff\n\n Amiram Ben Uliel, who perpetrated 2015 Duma firebombing that killed 18-month-old Ali Dawabsha and his parents, has been in prison for a decade and is serving three life sentences\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\nBy Sharon Wrobel\n\n Government working on a plan to float 25-30% of arms manufacturers on the Tel Aviv Stock Exchange later this year, as demand for battle-tested systems skyrockets\n\n Op-ed\n\n The government isn’t just dodging the Haredi draft; it’s dodging the law\n\n By ignoring the High Court’s ruling on military conscription, the coalition is stripping the judiciary of its power and risking a total breakdown of Israel’s democratic regime\n\n AG: Government violating court order on Haredi draft, in ‘real danger’ to democracy\n\nBy Jeremy Sharon\n\n Defense chiefs condemn violent disruption of Bnei Brak conference for Haredi brigade\n\nBy Stav Levaton and ToI Staff\n\n Jerusalem woman dies, teen missing, as winter storm lashes Israel with wind and rain\n\nBy ToI Staff\n\n Shuafat camp resident apparently hit by heavy object; several people lightly injured in other locations, others rescued from flood-swamped cars\n\n Howling winds send walls crashing down on Gaza tent camps, killing four\n\nBy AP and ToI Staff\n\n Australian writers’ festival canceled after booting Palestinian author who lauded Oct. 7\n\nBy Agencies and ToI StaffEvent falls apart as director resigns in protest against the disinviting of Randa Abdel-Fattah, who said Hamas is not a terror group and wished hell to ‘every last Zionist’ \n\n Australian parliament to meet early to pass hate speech laws after Bondi terror attack\n\n UK school nixed Labour MP’s civics talk, after outcry over his support for Israel\n\nBy ToI Staff\n\n Celebrities, NGOs sign letter accusing Israel of ‘direct attack’ on Gaza health care\n\nBy ToI Staff\n\n Some 60 actors, human rights groups and Palestinian medical personnel demand unfettered aid to Palestinians, use language lifted from Genocide Convention, accuse Israel of targeting civilians\n\n In reversal, Jewish US House candidate Scott Wiener says Israel committed ‘genocide’\n\nBy JTA and ToI Staff\n\n IDF has demolished over 2,500 buildings in Gaza since start of ceasefire – report\n\nBy ToI Staff, Noam Lehmann and Stav Levaton\n\n Cameron Kasky embodies rising Gen Z Jewish criticism of Israel. Can it get him to Congress?\n\nBy Joseph Strauss\n\n The 25-year-old Parkland school shooting survivor reflects a new political landscape after more than two years of war in Gaza, though his inexperience has some NY voters hesitating\n\n Online ICE fundraiser calls Minneapolis Mayor Jacob Frey a ‘Jewish traitor’\n\nBy Andrew Lapin\n\nMore Headlines\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\nBy Stav Levaton\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\nBy Reuters and ToI Staff\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\nBy STEPHEN GROVES\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\nBy Agencies\n\n After decade-long trial, attorney Ronel Fisher gets 9 months’ community service\n\nBy ToI Staff\n\n Ex-NYC mayor Eric Adams launches cryptocurrency, says it will fight antisemitism\n\nBy Luke Tress and ToI Staff\n\n PM’s chief of staff, appealing release terms, says police probe is ‘delusional, political’\n\nBy ToI Staff\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\nBy Michael Holden\n\n Draw sets Israel’s opponents for Eurovision semifinal slated for May 12 in Vienna\n\nBy AFP and ToI Staff\n\n Anti-Israel activists drop lawsuit against Northwestern U antisemitism training\n\nBy Luke Tress\n\n ‘Arab blood isn’t cheap’: Hundreds rally in capital over police failure on violent crime\n\nBy ToI Staff\n\nNili Bresler\n\n Sundown at Hostages Square\n\n After more than two years, it’s time for the people of the Square to fold up the tents, stack the chairs, and move on with our lives. What are we waiting for?\n\nOrit Mizner\n\n Designing Jewish life, not just defending it\n\n Organizations are investing so much in the battle against antisemitism that they risk losing the longer fight for Jewish connection\n\nLeigh Hartzman\n\n Can we separate the art from the antisemitism?\n\n Losing an intellectual home means losing a source of comfort – it’s a painful realization that the culture that shaped you no longer wants you\n\n When solidarity costs too much: Europe’s silence on Iran\n\n The uprising is a textbook liberation movement, but supporting it could serve Israeli interests – and thisdoesn’t fit the oppressor-oppressed binary \n\nYasmin Sacks Fridman\n\n What the last of the Holocaust survivors deserve from us\n\n As Knesset committee chair, I’m pushing for funds no longer needed for the deceased to be used to provide dignity, health, and security for those still left\n\nCatherine Perez-Shakdam\n\n How the Iranian regime plans to survive its own collapse\n\n The Revolutionary Guard aims to hold on to power while shedding its most discredited skin. The people fighting for freedom can’t let that happen\n\nRocky Abramson\n\n PTSD on steroids: A psychological epidemic after October 7th\n\n The timing and intensity of this war were harsh triggers, and many need treatment, but even those without a diagnosis would benefit from these tips to reduce stress\n\nRawan Osman\n\n Is tradition in Judaism still relevant?\n\n Why would a rational, educated woman choose to join an ancient people and embrace traditions that seem to belong to another age?\n\nBrad Goverman\n\n Renee Good’s death by design\n\n Tragedy was the predictable outcome of a system built to prioritize intimidation over judgment, speed over restraint, and obedience over accountability\n\nMijal Bitton\n\n You can do God’s will without a burning bush\n\n Even without a dramatic reveal showing how much our actions matter, we are responsible for doing the good within our reach (Shemot)\n\nMichael Feldstein\n\n How we made the ‘shidduch’ crisis worse\n\n Before the now common rigid gender separation, Orthodox couples like my wife and me met organically. Here are 3 ways to improve the current culture of dating\n\n Australia must answer this question before it investigates Bondi\n\n Without recognizing the harm this one thing does to Jews, the commission of inquiry into the massacre will be worthless\n\n Latest Articles\n\n 15 minutes ago\n\n Far-right Jewish group Betar to halt activities in NY, state attorney general says\n\n 45 minutes ago\n\n Neo-Nazi convicted of planning to fire explosives at cops during San Diego anti-Trump rally\n\n 1 hour ago\n\n Iran has aired some 100 forced confessions by anti-regime protesters, activists say\n\n 2 hours ago\n\n NY governor pushes for buffer zone to protect synagogues from protests\n\n 4 hours ago\n\n AnalysisWhy the massive Iran protests haven’t toppled its clerical establishment\n\n 4 hours ago\n\n ‘Help is on its way’: Trump urges Iranians to keep protesting, seize institutions\n\n 4 hours ago\n\n UN chief threatens to refer Israel to World Court over laws targeting UNRWA\n\n 4 hours ago\n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects\n\n 5 hours ago\n\n Jewish terrorist who killed Palestinian family said allowed conjugal visits\n\n 6 hours ago\n\n US labels Muslim Brotherhood branches in Egypt, Lebanon, Jordan as terror organizations\n\n 6 hours ago\n\n Jerusalem severs ties with 7 UN agencies, citing anti-Israel bias\n\n 7 hours ago\n\n UK teen accused of admiring Hitler, scouting synagogues and planning terror goes on trial\n\n 7 hours ago\n\n Syrian army, Kurds exchange fire in area near Aleppo declared closed military zone\n\n 7 hours ago\n\n Israel eyes privatization of defense giants IAI and Rafael via public share sale\n\n 8 hours ago\n\n Clintons refuse to testify at congressional Epstein probe, as GOP mulls contempt charges\n\n 8 hours ago\n\n ‘This will destroy our dreams’: Israel slates West Bank soccer field for demolition\n\n 8 hours ago\n\n Israeli-Argentinian imprisoned in Venezuela for over a year released, returns home\n\n 8 hours ago\n\n Interview34 days of uncertainty: Bereaved father writes about loss of IDF lookout soldier Roni Eshel\n\n 10 hours ago\n\n 4 suspects who impersonated IDF troops in West Bank heist nabbed by Israel Police, PA\n\n 10 hours ago\n\n UK to pay ‘substantial sum’ to Palestinian Guantanamo detainee over torture claims\n\n Latest Blogs\n\n Gilles Touboul\n\n Washington threatens Tehran, the ...\n\n Mijael Even David\n\n Judaism is not an enemy of libera...\n\n Abraham Mannil Thomas\n\n In those days, and at that time, ...\n\n Mohamed Marshall Omer\n\n Israel’s Somaliland Recognition...\n\n Jasmin Mojrenfeld Polite\n\n A strong Jewish community shapes ...\n\n Orna Raz\n\n My Year Of Service In Merhavim Re...\n\n Elaine Rosenberg Miller\n\n Persia\n\n Leah Preston\n\n How Fear Shapes Advocacy on Campus\n\n Rebecca Bardach\n\n Return and Repair, North and Sout...\n\n Sheldon Kirshner\n\n Iran Convulsed By Anti-Government...\n\nToday's Daily Briefing\n\nDay 830 – Coalition’s latest attempt to rescue the PM\n\n listen to the podcast\n\nFlower Power\n\nBlack markets, propaganda, and... wildflowers.\n\n listen to the podcast\n\nThose We Have Lost\n\nCivilians and soldiers who have fallen since Oct. 7\n\n Read Here\n\n Full Coverage\n 2023-2025 Israel-Hamas war \n\n IDF kills 2 gunmen in Rafah firefight, search for additional suspects \n\nBy Stav Levaton, Noam Lehmann, Lazar Berman and Agencies\n\n Howling winds send walls crashing down on Gaza tent camps, killing four \n\nBy AP and ToI Staff\n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\nPromoting Community\n\nThe Times of Israel\n\nDaily Edition\n\nFree to Your Inbox\n\n The email is either missing or invalid.\n\n By signing up, you agree to our \n\n You hereby accept The Times of Israel Terms of Use and Privacy Policy, and you agree to receive the latest news & offers from The Times of Israel and its partners or ad sponsors.\n\n Full Coverage\n Times of Israel podcasts \n\n Daily Briefing Jan. 13: Day 830 – Coalition’s latest attempt to rescue the PM \n\nBy Jessica Steinberg, Ariela Karmel and Sharon Wrobel\n\n Daily Briefing Jan. 12: Day 829 – Qatargate suspect Einhorn labeled ‘fugitive criminal’ \n\nBy Amanda Borschel-Dan and Jeremy Sharon\n\n Daily Briefing Jan. 11: Day 828 – Iran threatens Israel as anti-regime protests hit 2-week mark \n\nBy Amanda Borschel-Dan and Lazar Berman\n\n Full Coverage\n Hamas hostages \n\n Freed hostage David Cunio says he weighed suicide by overdosing during captivity \n\nBy ToI Staff\n\n As hostage-deal lobby disbands, a new group forms to home in on long road to recovery \n\nBy Jessica Steinberg\n\n Einav Zangauker considering entering politics ‘to send home’ Netanyahu \n\nBy ToI Staff\n\n Full Coverage\n Liveblog \n\n Hamas says its delegation arrived in Cairo for talks on second phase of ceasefire \n\nBy ToI Staff\n\n Jan. 12: IDF says it’s on alert for ‘surprise scenarios,’ calls Iran protests ‘an internal matter’ \n\nBy ToI Staff\n\n Jan. 11: UN chief ‘shocked’ by violence against Iran protesters, urges restraint \n\nBy ToI Staff\n\nThose we have lost\n\nStories of the civilians and soldiers who have fallen in the Israel-Hamas war\n\n Those we have lost \n\n Itzik Dahan, 47: Landscape designer who was ‘always laughing’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Sgt. Shaked Dahan, 19: Dreamed of defending the State of Israel\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Dorin Atias, 23: ‘Tough on the outside, but inside she was all feeling’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Sgt. 1st Class Amir Fisher, 22: Lone soldier dreamed of soccer career\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Marcelle Frailich Kaplun, 64: Longtime high school science teacher\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Sgt. Nathanel Young, 20: British-born lone soldier was a talented DJ\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Cpt. Daniel Perez, 22: South African immigrant and tank commander\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Yuval Ben Yehuda, 26: Dog lover was ‘the sun and the light’\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Odaya and Dolev Swissa, 33 & 34: Murdered in front of their daughters\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Staff Sgt. Roy Bareket, 20: ‘Redhead with dimples’ slain in firefight\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Staff Sgt. Ben Rubinshtain, 20: Sports lover and soccer referee\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Mor Cohen, 24: Talented athlete was a pioneer in Israel’s lacrosse scene\n\n \n\n By ToI Staff \n \n\n Those We Have Lost \n\n Eden Abdulayev, 22: Killed one day before her birthday\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Cpt. Eily Adany, 21: Platoon commander ‘gave everything to his soldiers’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Oded Abergel, 26: Guided his friends at rave ‘saving them from hell’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Cpt. Amitay Granot, 24: Newly engaged commander was talented pianist\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Daniel Sheinkerman, 25: Bar owner who sought to ‘conquer the world’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Avidan Torgeman, 26: Entrepreneur ‘celebrated life in an endless dance’\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Anita Lisman, 25: Student partygoer just moved in with her boyfriend\n\n \n\n By ToI Staff \n \n\n Those we have lost \n\n Omri Ahrak, 26: Hi-tech worker with musical aspirations\n\n \n\n By ToI Staff \n \n\nTales of the Times\n\nThe quirky, improbable, infuriating and uplifting\n\n A blooming friendship \n\n Over 50,000 Dutch tulips brighten Gaza border communities\n\n \n\n By Sue Surkes \n \n\n Unperturbed \n\n ‘Lords of the Sound’ orchestra back for 2nd tour amid wartime boycott\n\n \n\n By Jessica Steinberg \n \n\n Homeward bound \n\n Israelis pick ‘homecoming’ as Hebrew word of the year\n\n \n\n By ToI Staff \n \n\n In the frame \n\n Community leaders honored in inaugural Women of Iron awards\n\n \n\n By Jessica Steinberg \n \n\n Crashed and burned \n\n US court says ‘Top Gun: Maverick’ didn’t infringe Israeli writer’s copyright\n\n \n\n By Reuters \n \n\n Roll the dice \n\n Tel Aviv exhibit joins Jewish concepts to role-playing games\n\n \n\n By Jessica Steinberg \n \n\n To the Max \n\n HBO Max streaming to launch in Israel this month\n\n \n\n By Jessica Steinberg \n \n\n Blown off course \n\n Trump eagle-minded post tilts at windmills, crash lands in Israel\n\n \n\n By AFP \n \n\n Concrete art \n\n Exhibit brings visitors back to Tel Aviv’s Shalom Meir Tower\n\n \n\n By Jessica Steinberg \n \n\n Comeback performance \n\n Concert of former captive Alon Ohel sells out in hours\n\n \n\n By Jessica Steinberg \n \n\n Banishing darkness \n\n Shiri Bibas’s sister lights parents’ menorah while on reserve duty in Gaza\n\n \n\n By Jessica Steinberg \n \n\n Storm in a pint glass \n\n US rabbis warn against assuming beer is always kosher\n\n \n\n By David I. Klein \n \n\n Light entertainment \n\n ‘KPop Demon Hunters,’ AI lead this year’s Hanukkah video crop\n\n \n\n By Zev Stub \n \n\n Crimson tide \n\n Rain colors the coast of Iran’s Hormuz Island crimson\n\n \n\n By AP \n \n\n Holiday spirit \n\n Nazareth’s classical Christmas concerts return home\n\n \n\n By Jessica Steinberg \n \n\n Small sparks \n\n ‘Out of darkness’: Freed hostages lead Hanukkah candle-lightings\n\n \n\n By ToI Staff \n \n\n Red flag \n\n New Jersey city accidentally raises Palestinian flag on intifada anniversary\n\n \n\n By Luke Tress \n \n\n Built to last \n\n Discovery at Pompeii reveals the secrets of ancient Roman concrete\n\n \n\n By Will Dunham \n \n\n A message that it's calm \n\n Christmas festivities return to Bethlehem after 2 years of war in Gaza\n\n \n\n By Agencies and ToI Staff \n \n\n Hoops star \n\n Deni Avdija now Israel’s all-time leading NBA scorer\n\n \n\n By Ethan Rubinson and ToI Staff \n \n\n Scroll to view more\n\nIsrael & the Region\n\nJewish Times\n\nIsrael Inside\n\nTech Israel\n\nReal Estate Israel\n\nterms and conditions\n\nprivacy policy\n\nadvertise with us\n\nJobs at The Times of Israel\n\nJoin our community\n\nGet the Daily Edition\n Enter your email address\n\n © 2026 The Times of Israel, all rights reserved \n\n Concept, design & development by\n\n Powered by\n\nNever miss breaking news on Israel\n\nGet notifications to stay updated\n\nStay updated\n\nYou're subscribed\n\nclose popup\n\nRegister for free \n and continue reading\n\nRegistering allows you to manage your newsletters and alerts and helps us improve your experience. It takes just a few seconds.\n\nAlready registered? Enter your email to sign in.\n\nEmail address\n\nPlease use the following structure: example@domain.com\n\nREGISTER OR SIGN IN\n\nOr Continue with\n\n By registering you agree to the terms and conditions. Once registered, you’ll receive our Daily Edition email for free.\n\nSend me The Times of Israel Daily Edition\n\nclose popup\n\nRegister to continue\n\nEmail address\n\nOr Continue with\n\nclose popup\n\nLog in to continue\n\nEmail address\n\nSomething went wrong. \n Please try again in a few minutes..\n\nclose popup\n\nSign in or Register\n\nEmail address *\n\nIncorrect password. Please try again or choose an option below.\n\nI forgot my password\n\nSend me a sign in link\n\nOr Continue with\n\nclose popup\n\nCheck your email\n\nWe sent an email to you at .\n\nIt has a link that will sign you in.\n\nClick the link in that email to complete your registration.","url":"https://www.timesofisrael.com/why-the-massive-iran-protests-havent-toppled-its-clerical-establishment/","image":"https://static-cdn.toi-media.com/www/uploads/2026/01/AFP__20260111__92CD4EB__v1__HighRes__BritainIranProtestRights.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","source_country":"il","sentiment":-0.233},{"id":392846998,"title":"\"We're bringing Venezuela back\": Trump says US \"working closely\" with Caracas on oil deal","text":"Washington DC [US], January 14 (ANI): US President Donald Trump on Tuesday (local time) said that the country is working 'very well' with Venezuelan authorities as Caracas prepares to send millions of barrels of oil to American refineries.\n\nTrump asserted that his administration is working closely with Caracas and claimed that large volumes of Venezuelan oil are already entering the United States as part of the engagement.\n\nSpeaking at the Detroit Economic Club, Trump said, 'I'm Venezuela's biggest fan. We're working with them. They came down from a very high number to a disaster.' \n\nThe US President informed that Venezuela has begun supplying oil to the United States. Trump said the arrangement would have a direct impact on global energy markets, asserting that increased supply would help lower prices.\n\n'We are bringing Venezuela back, and we are going to be great for Venezuela, great for our country. We're taking in millions and millions of barrels of oil, and now they are coming in initially on a daily basis, 50 million, and values of over $5 billion. We will get oil prices down even further,' he said.\n\nSharing the success of his military action, Trump added, 'It's an incredible feeling. Winning is a good thing.'\n\nTrump's remarks came after the United States on January 3, launched military action in Venezuela and captured Venezuela's then-president, Nicolas Maduro.\n\nEarlier on Sunday, Trump also spoke with the interim President of Venezuela, Delcy Rodriguez, saying, 'She's been very good. She asked us if we could take 50 million barrels of oil, and I said yes, we can, it is worth $4.2 billion, and it is on its way right now to the United States.' (ANI)","url":"https://www.argentinastar.com/news/278807285/were-bringing-venezuela-back-trump-says-us-working-closely-with-caracas-on-oil-deal","image":"https://image.chitra.live/api/v1/wps/4f18bd8/c71f23d5-7323-4d70-ad9f-08b1b46e1818/0/ANI-20260113213842-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","category":"politics","source_country":"ar","sentiment":-0.049},{"id":392845288,"title":"Euro, Swiss franc jump after Powell indictment warning","text":"NEW YORK CITY, New York: The U.S. dollar tumbled against major currencies as markets reacted to a threat by the Trump administration to pursue a criminal indictment against Federal Reserve Chair Jerome Powell, raising fears over the future independence of U.S. monetary policy and the greenback's safe-haven appeal.\n\nThe dollar fell sharply versus the euro and the Swiss franc and edged lower against the Japanese yen. The dollar index, which tracks the currency against a basket of six peers, was down 0.37 percent at 98.759, snapping a five-day winning streak. Gold surged to a record US$4,600.33 an ounce after Powell released a video defending the independence of the central bank.\n\n\"The point is that the central bank's response function is likely to change fundamentally and in the long term if the White House succeeds (in gaining control of monetary policy),\" said Thu Lan Nguyen, head of forex and commodity research at Commerzbank. She noted the Federal Reserve is already in a rate-cutting cycle, adding: \"However, as the foreign exchange market is forward-looking, this already justifies a higher US dollar risk premium today.\"\n\nSome analysts said markets have not yet panicked, as investors still expect U.S. President Donald Trump to appoint a credible successor to Powell and allow that person to steer policy.\n\nThe Swiss franc led gains, rising 0.52 percent to 0.7968 per dollar, while the euro climbed 0.44 percent to $1.1688 — its most significant daily rise since December 10 — as U.S. political uncertainty triggered a selloff in American assets.\n\nEarlier in the session, the dollar had touched a one-month high in Asian trade after the U.S. jobs report on January 9 bolstered expectations the Fed would hold interest rates steady later this month. Heightened geopolitical tensions, including reports of hundreds of deaths during protests in Iran, had also supported demand for traditional safe havens.\n\nAgainst the yen, the dollar was last down 0.1 percent at 157.80, not far from a one-year high. Investor caution was compounded after a coalition partner of Japanese Prime Minister Sanae Takaichi said she might call a snap election on February 8 or February 15.\n\nGeopolitical tensions in Iran \"should be positive for the U.S. dollar, but we haven't seen any upside there yet,\" said Kyle Rodda, senior market analyst at Capital.com. \"The question from here is whether the momentum behind the protest movement continues and whether the regime cracks down even harder, opening the door to some U.S. involvement.\"\n\nTrump said the United States might meet Iranian officials and was in contact with opposition figures as he weighed options, including military action.\n\nMarkets are bracing for a packed week of data, starting with the U.S. consumer price index for December, one of the last major releases before the Fed's policy meeting at the end of January. Investors are also watching for a possible U.S. Supreme Court ruling on the legality of Trump's emergency tariffs, which could come as soon as January 14.\n\nElsewhere, the dollar slipped 0.1 percent against the offshore Chinese yuan to 6.9706, its weakest level in a week and near its softest since May 2023. A former Chinese foreign exchange regulator cautioned in a blog post that the yuan's rise does not necessarily signal a revaluation of the currency or Chinese assets, citing a lack of support from underlying fundamentals.","url":"https://www.nigeriasun.com/news/278805194/euro-swiss-franc-jump-after-powell-indictment-warning","image":"https://image.chitra.live/api/v1/wps/08d8058/d6b60feb-ee33-44d5-b69b-479c7ce03881/1/US-dollars-count-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","source_country":"ng","sentiment":-0.058},{"id":392847988,"title":"Trump 'Orders' Americans Out As Khamenei Regime Names 'KILLERS' Of Iranians","text":"1 views | Jan 14, 2026, 02:45:50 AM | TOI.in\n\nU.S. President Donald Trump has ignited global tension with a cryptic message to Iranian protesters, declaring that “help is on its way” as nationwide demonstrations face a brutal crackdown. Speaking during a visit to Detroit, Trump refused to clarify what that help means — even as he urged Americans to consider evacuating Iran. Tehran responded furiously, with Iran’s top security official accusing Trump of being responsible for Iranian bloodshed. As Canada warns its citizens to leave, the European Union summons Iran’s envoy, Starlink internet access quietly becomes free inside Iran, and U.S. lawmakers openly debate regime change, the crisis is escalating fast. With activists reporting over 2,000 killed, the question now is whether Trump’s warning signals diplomatic pressure — or something far more serious.","url":"https://timesofindia.indiatimes.com/videos/international/trump-orders-americans-out-as-khamenei-regime-names-killers-of-iranians/videoshow/126512914.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126512914/126512914.jpg?resizemode=4","video":null,"publish_date":"2026-01-14 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":-0.266},{"id":392844676,"title":"Gold hits record as investors reassess U.S. safe-haven status","text":"NEW YORK CITY, New York: The U.S. dollar tumbled against major currencies as markets reacted to a threat by the Trump administration to pursue a criminal indictment against Federal Reserve Chair Jerome Powell, raising fears over the future independence of U.S. monetary policy and the greenback's safe-haven appeal.\n\nThe dollar fell sharply versus the euro and the Swiss franc and edged lower against the Japanese yen. The dollar index, which tracks the currency against a basket of six peers, was down 0.37 percent at 98.759, snapping a five-day winning streak. Gold surged to a record US$4,600.33 an ounce after Powell released a video defending the independence of the central bank.\n\n\"The point is that the central bank's response function is likely to change fundamentally and in the long term if the White House succeeds (in gaining control of monetary policy),\" said Thu Lan Nguyen, head of forex and commodity research at Commerzbank. She noted the Federal Reserve is already in a rate-cutting cycle, adding: \"However, as the foreign exchange market is forward-looking, this already justifies a higher US dollar risk premium today.\"\n\nSome analysts said markets have not yet panicked, as investors still expect U.S. President Donald Trump to appoint a credible successor to Powell and allow that person to steer policy.\n\nThe Swiss franc led gains, rising 0.52 percent to 0.7968 per dollar, while the euro climbed 0.44 percent to $1.1688 — its most significant daily rise since December 10 — as U.S. political uncertainty triggered a selloff in American assets.\n\nEarlier in the session, the dollar had touched a one-month high in Asian trade after the U.S. jobs report on January 9 bolstered expectations the Fed would hold interest rates steady later this month. Heightened geopolitical tensions, including reports of hundreds of deaths during protests in Iran, had also supported demand for traditional safe havens.\n\nAgainst the yen, the dollar was last down 0.1 percent at 157.80, not far from a one-year high. Investor caution was compounded after a coalition partner of Japanese Prime Minister Sanae Takaichi said she might call a snap election on February 8 or February 15.\n\nGeopolitical tensions in Iran \"should be positive for the U.S. dollar, but we haven't seen any upside there yet,\" said Kyle Rodda, senior market analyst at Capital.com. \"The question from here is whether the momentum behind the protest movement continues and whether the regime cracks down even harder, opening the door to some U.S. involvement.\"\n\nTrump said the United States might meet Iranian officials and was in contact with opposition figures as he weighed options, including military action.\n\nMarkets are bracing for a packed week of data, starting with the U.S. consumer price index for December, one of the last major releases before the Fed's policy meeting at the end of January. Investors are also watching for a possible U.S. Supreme Court ruling on the legality of Trump's emergency tariffs, which could come as soon as January 14.\n\nElsewhere, the dollar slipped 0.1 percent against the offshore Chinese yuan to 6.9706, its weakest level in a week and near its softest since May 2023. A former Chinese foreign exchange regulator cautioned in a blog post that the yuan's rise does not necessarily signal a revaluation of the currency or Chinese assets, citing a lack of support from underlying fundamentals.","url":"https://www.afghanistannews.net/news/278805194/gold-hits-record-as-investors-reassess-u-s-safe-haven-status","image":"https://image.chitra.live/api/v1/wps/08d8058/d6b60feb-ee33-44d5-b69b-479c7ce03881/1/US-dollars-count-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","source_country":"af","sentiment":-0.058},{"id":392844862,"title":"\"We're bringing Venezuela back\": Trump says US \"working closely\" with Caracas on oil deal","text":"Washington DC [US], January 14 (ANI): US President Donald Trump on Tuesday (local time) said that the country is working 'very well' with Venezuelan authorities as Caracas prepares to send millions of barrels of oil to American refineries.\n\nTrump asserted that his administration is working closely with Caracas and claimed that large volumes of Venezuelan oil are already entering the United States as part of the engagement.\n\nSpeaking at the Detroit Economic Club, Trump said, 'I'm Venezuela's biggest fan. We're working with them. They came down from a very high number to a disaster.' \n\nThe US President informed that Venezuela has begun supplying oil to the United States. Trump said the arrangement would have a direct impact on global energy markets, asserting that increased supply would help lower prices.\n\n'We are bringing Venezuela back, and we are going to be great for Venezuela, great for our country. We're taking in millions and millions of barrels of oil, and now they are coming in initially on a daily basis, 50 million, and values of over $5 billion. We will get oil prices down even further,' he said.\n\nSharing the success of his military action, Trump added, 'It's an incredible feeling. Winning is a good thing.'\n\nTrump's remarks came after the United States on January 3, launched military action in Venezuela and captured Venezuela's then-president, Nicolas Maduro.\n\nEarlier on Sunday, Trump also spoke with the interim President of Venezuela, Delcy Rodriguez, saying, 'She's been very good. She asked us if we could take 50 million barrels of oil, and I said yes, we can, it is worth $4.2 billion, and it is on its way right now to the United States.' (ANI)","url":"https://www.bahamasnews.net/news/278807285/were-bringing-venezuela-back-trump-says-us-working-closely-with-caracas-on-oil-deal","image":"https://image.chitra.live/api/v1/wps/4f18bd8/c71f23d5-7323-4d70-ad9f-08b1b46e1818/0/ANI-20260113213842-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","category":"politics","source_country":"bs","sentiment":-0.049},{"id":392844860,"title":"Gold hits record as investors reassess U.S. safe-haven status","text":"NEW YORK CITY, New York: The U.S. dollar tumbled against major currencies as markets reacted to a threat by the Trump administration to pursue a criminal indictment against Federal Reserve Chair Jerome Powell, raising fears over the future independence of U.S. monetary policy and the greenback's safe-haven appeal.\n\nThe dollar fell sharply versus the euro and the Swiss franc and edged lower against the Japanese yen. The dollar index, which tracks the currency against a basket of six peers, was down 0.37 percent at 98.759, snapping a five-day winning streak. Gold surged to a record US$4,600.33 an ounce after Powell released a video defending the independence of the central bank.\n\n\"The point is that the central bank's response function is likely to change fundamentally and in the long term if the White House succeeds (in gaining control of monetary policy),\" said Thu Lan Nguyen, head of forex and commodity research at Commerzbank. She noted the Federal Reserve is already in a rate-cutting cycle, adding: \"However, as the foreign exchange market is forward-looking, this already justifies a higher US dollar risk premium today.\"\n\nSome analysts said markets have not yet panicked, as investors still expect U.S. President Donald Trump to appoint a credible successor to Powell and allow that person to steer policy.\n\nThe Swiss franc led gains, rising 0.52 percent to 0.7968 per dollar, while the euro climbed 0.44 percent to $1.1688 — its most significant daily rise since December 10 — as U.S. political uncertainty triggered a selloff in American assets.\n\nEarlier in the session, the dollar had touched a one-month high in Asian trade after the U.S. jobs report on January 9 bolstered expectations the Fed would hold interest rates steady later this month. Heightened geopolitical tensions, including reports of hundreds of deaths during protests in Iran, had also supported demand for traditional safe havens.\n\nAgainst the yen, the dollar was last down 0.1 percent at 157.80, not far from a one-year high. Investor caution was compounded after a coalition partner of Japanese Prime Minister Sanae Takaichi said she might call a snap election on February 8 or February 15.\n\nGeopolitical tensions in Iran \"should be positive for the U.S. dollar, but we haven't seen any upside there yet,\" said Kyle Rodda, senior market analyst at Capital.com. \"The question from here is whether the momentum behind the protest movement continues and whether the regime cracks down even harder, opening the door to some U.S. involvement.\"\n\nTrump said the United States might meet Iranian officials and was in contact with opposition figures as he weighed options, including military action.\n\nMarkets are bracing for a packed week of data, starting with the U.S. consumer price index for December, one of the last major releases before the Fed's policy meeting at the end of January. Investors are also watching for a possible U.S. Supreme Court ruling on the legality of Trump's emergency tariffs, which could come as soon as January 14.\n\nElsewhere, the dollar slipped 0.1 percent against the offshore Chinese yuan to 6.9706, its weakest level in a week and near its softest since May 2023. A former Chinese foreign exchange regulator cautioned in a blog post that the yuan's rise does not necessarily signal a revaluation of the currency or Chinese assets, citing a lack of support from underlying fundamentals.","url":"https://www.bahamasnews.net/news/278805194/gold-hits-record-as-investors-reassess-u-s-safe-haven-status","image":"https://image.chitra.live/api/v1/wps/08d8058/d6b60feb-ee33-44d5-b69b-479c7ce03881/1/US-dollars-count-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","source_country":"bs","sentiment":-0.058},{"id":392845842,"title":"\"We're bringing Venezuela back\": Trump says US \"working closely\" with Caracas on oil deal","text":"Washington DC [US], January 14 (ANI): US President Donald Trump on Tuesday (local time) said that the country is working 'very well' with Venezuelan authorities as Caracas prepares to send millions of barrels of oil to American refineries.\n\nTrump asserted that his administration is working closely with Caracas and claimed that large volumes of Venezuelan oil are already entering the United States as part of the engagement.\n\nSpeaking at the Detroit Economic Club, Trump said, 'I'm Venezuela's biggest fan. We're working with them. They came down from a very high number to a disaster.' \n\nThe US President informed that Venezuela has begun supplying oil to the United States. Trump said the arrangement would have a direct impact on global energy markets, asserting that increased supply would help lower prices.\n\n'We are bringing Venezuela back, and we are going to be great for Venezuela, great for our country. We're taking in millions and millions of barrels of oil, and now they are coming in initially on a daily basis, 50 million, and values of over $5 billion. We will get oil prices down even further,' he said.\n\nSharing the success of his military action, Trump added, 'It's an incredible feeling. Winning is a good thing.'\n\nTrump's remarks came after the United States on January 3, launched military action in Venezuela and captured Venezuela's then-president, Nicolas Maduro.\n\nEarlier on Sunday, Trump also spoke with the interim President of Venezuela, Delcy Rodriguez, saying, 'She's been very good. She asked us if we could take 50 million barrels of oil, and I said yes, we can, it is worth $4.2 billion, and it is on its way right now to the United States.' (ANI)","url":"https://www.argentinanews.net/news/278807285/were-bringing-venezuela-back-trump-says-us-working-closely-with-caracas-on-oil-deal","image":"https://image.chitra.live/api/v1/wps/4f18bd8/c71f23d5-7323-4d70-ad9f-08b1b46e1818/0/ANI-20260113213842-600x315.jpg","video":null,"publish_date":"2026-01-14 00:00:00","author":null,"language":"en","category":"politics","source_country":"ar","sentiment":-0.049},{"id":392806284,"title":"Trump ‘FEARS’ Putin & Xi At US Borders; Greenland’s Polar ‘Silk Road’, Rare Earths Fuelling Threats?","text":"1 views | Jan 14, 2026, 12:29:17 AM | TOI.in\n\nDonald Trump’s Greenland warning sparks global debate. The US President claims China and Russia are circling the Arctic, raising alarms over Greenland’s strategic value. But analysts say Beijing’s presence near Greenland is limited and overstated. China’s ambitions lie in Arctic shipping routes, rare earth minerals, and long-term influence - mostly via Russia. Denmark and Greenland reject US takeover threats, calling them violations of international law. So is Greenland really under threat - or is this Arctic politics heating up fast?","url":"https://timesofindia.indiatimes.com/videos/international/trump-fears-putin-xi-at-us-borders-greenlands-polar-silk-road-rare-earths-fuelling-threats/videoshow/126512326.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126512326/126512326.jpg?resizemode=4","video":null,"publish_date":"2026-01-14 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":-0.634},{"id":392847456,"title":"Trump says Americans &#8216;don&#8217;t need&#8217; Canadian products, calls CUSMA &#8216;irrelevant&#8217;","text":"U.S. President Donald Trump said Tuesday the Canada-United States-Mexico Agreement on trade is “irrelevant” to him and Americans don’t need Canadian products.\n\n“It expires very shortly and we could have it or not,” Trump said while touring a Ford plant in Michigan. “It wouldn’t matter to me. I think they want it. I don’t really care about it.”\n\nTrump statements have rattled Canada and Mexico ahead of a mandatory review this year of the future of the continental trade pact, known as CUSMA. The president told reporters that “Canada wants it” but the United States doesn’t need anything from its northern neighbour.\n\nThe three countries have started domestic consultations on the review and Dominic LeBlanc, the minister in charge of Canada-U.S. relations, is set to meet with U.S. counterparts in mid-January to launch formal CUSMA talks.\n\nThe trade pact has shielded Canada and Mexico from the worst impacts of Trump’s tariffs. The president increased duties on Canada to 35 per cent last August, citing the flow of deadly fentanyl, but those tariffs do not apply to goods compliant with CUSMA.\n\nCanadian industries are still being hammered by Trump’s separate sector-specific tariffs on products like steel, aluminum, automobiles, lumber, copper and cabinets.\n\nThe president remained committed Tuesday to his automobile tariffs, saying he wants cars to be built in the United States, not Canada.\n\nDetroit is famously known as “Motor City” and has served as the headquarters of the Big Three — Ford, General Motors and Stellantis. Before Trump’s tariffs, there was a long history of integration with the Canadian auto industry.\n\nTrump was also asked about raw materials coming in from countries like Canada. “We have a lot of our own raw materials,” he replied.\n\nCUSMA was negotiated during the first Trump administration and served as a stress test for Ottawa. The trade talks were tense at times, but ultimately the pact that replaced the North American Free Trade Agreement was hailed a success in all three countries.\n\nSince his return to the White House last year, Trump has repeatedly questioned the value of CUSMA and has claimed the United States doesn’t need anything from Canada.\n\nTrump previously called the deal “transitional” and said it may have served its purpose during a meeting with Prime Minister Mark Carney at the White House last October.\n\nThe CUSMA review essentially sets up a three-way choice for the three partner countries to make in July. They can renew the deal for another 16 years, withdraw from it or signal both non-renewal and non-withdrawal — which would trigger an annual review that keeps negotiations going.\n\nTrump’s public comments signal a longer review — or that the United States could walk away.\n\nU.S. Trade Representative Jamieson Greer has spoken about long-standing trade irritants that will be part of CUSMA negotiations, including the supply management system for dairy products and the alleged subsidization of the softwood lumber sector.\n\nGreer has pointed to other non-tariff barriers like Canada’s Online Streaming Act and Online News Act, as well as the provincial bans on sales of American alcohol that were imposed in response to Trump hitting Canada with a barrage of tariffs.\n\nGreer also said the Trump administration is considering splitting up the three-way pact and negotiating separate deals with Canada and Mexico.","url":"https://www.ipolitics.ca/2026/01/13/trump-says-americans-dont-need-canadian-products-calls-cusma-irrelevant/","image":"https://www.ipolitics.ca/wp-content/uploads/2026/01/a2974cb86b6303337948c3b7ad6604726d95b2ab8c0d97408d745516f74d2790.jpg","video":null,"publish_date":"2026-01-13 23:42:56","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.5},{"id":392843288,"title":"Johnson pushes back on Trump threat to halt U.S. funding for Chicago, other sanctuary cities","text":"President Donald Trump and Chicago Mayor Brandon Johnson are facing off once again over Trump’s threats to pull funding from sanctuary cities like Chicago by the end of the month.\n\n“Starting February 1st, we’re not making any payments to sanctuary cities or states having sanctuary cities because they do everything possible to protect criminals at the expense of American citizens. And it breeds fraud, crime and all of the other problems that come. We are not making any payments to anybody that supports sanctuary cities,” Trump said during remarks at the Detroit Economic Club.\n\nChicago, along with cities like New York City and Los Angeles, is a sanctuary city, meaning local officials limit cooperation with federal immigration enforcement and have stronger protections for immigrants who entered the country without permission. The latest threat continues Trump’s trend of punishing sanctuary cities in his second presidential term. He signed executive orders targeting officials who uphold sanctuary city laws, and Chicago was one of 66 cities that sued the Trump administration over a previous threat to funding in July.\n\nThe Justice Department last year published a list of three dozen states, cities and counties that it considers to be sanctuary jurisdictions.\n\nThe list is overwhelmingly made up of places where the governments are controlled by Democrats, including the states of California, Connecticut and New York, cities such as Boston and New York and counties including Baltimore County, Maryland, and Cook County.\n\nChicago Mayor Brandon Johnson, who has been vocal in his opposition to the Trump administration, specifically about immigration enforcement, blasted the decision.\n\n“President Trump’s announcement that he will attempt to cut off federal funds from Chicago for political reasons is blatantly unconstitutional and immoral,” Johnson said in a statement. “We will be relentless until we restore every dollar that has been withheld by the Trump administration. Those are funds that belong to the people of Chicago, not the president.”\n\nJohnson pointed out that Chicagoans contribute billions of dollars in federal taxes and pointed to the potential of another lawsuit in response to the threats.\n\n“Chicago will never back down from a fight,” he said. “To the president, our message is simple: We’ll see you in court.”","url":"https://chicago.suntimes.com/immigration/2026/01/13/brandon-johnson-donald-trump-sanctuary-cities","image":"https://cst.brightspotcdn.com/dims4/default/263a30a/2147483647/strip/false/crop/870x630+0+0/resize/870x630!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F86%2F28%2F74a546b5b93b6ef15c618eb14cd3%2Ftrump-e1","video":null,"publish_date":"2026-01-13 23:42:54","author":"Mary Norkol","authors":["Mary Norkol"],"language":"en","source_country":"us","sentiment":-0.344},{"id":392848638,"title":"US to end deportation protections for Somalis  - Antigua Tribune – Daily Antigua &amp; Caribbean News,","text":"The administration of United States President Donald Trump will end temporary deportation protections and work permits for some Somali nationals in the US, authorities say.\n\nHomeland Security Secretary Kristi Noem said on Tuesday that the Trump administration was ending Temporary Protected Status (TPS), which shields migrants from deportation to countries where it is deemed unsafe to return and grants temporary work authorisation, for Somalis living in the US.\n\n“Country conditions in Somalia have improved to the point that it no longer meets the law’s requirement for Temporary Protected Status,” Noem said in a statement. “Further, allowing Somali nationals to remain temporarily in the United States is contrary to our national interests. We are putting Americans first.”\n\nThe decision, which is expected to affect about 1,100 people, is likely to face legal challenges.\n\nThe Somali community has become a frequent target of the Trump administration. The US president has called Somalis “garbage” and depicted them as criminals.\n\nIn recent weeks, the Trump administration has lashed out at Somalis in the US, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country, with about 80,000 members.\n\nTrump has threatened to strip any naturalised Somali or foreign-born person of their US citizenship if they were convicted of fraud, as he continued his attacks on the Somali community.\n\n“We’re going to revoke the citizenship of any naturalised immigrant from Somalia or anywhere else who is convicted of defrauding our citizens,” Trump said on Tuesday.\n\nThe administration has additionally cut off Minnesota’s access to federal childcare assistance and surged immigration enforcement agents to the state, home to a sizeable Somali population, prompting widespread anger and condemnation from local and state officials over aggressive immigration raids.\n\nHeavily-armed agents have broken car windows and detained people, used frequent force against protesters, and asked residents for proof of citizenship, drawing concerns from civil liberties groups.\n\nTensions rose further after a federal immigration agent last week shot and killed Renee Good, a US citizen and mother of three, who had been acting as a legal monitor of federal immigration activity in Minneapolis.","url":"https://antiguatribune.com/us-to-end-deportation-protections-for-somalis/","image":"https://antiguatribune.com/app/uploads/2026/01/2025-12-11T124539Z_1493693040_RC2NCIAVCH4B_RTRMADP_3_USA-SOMALIA-DIPLOMACY-1767167777-MtNtsK.jpg","video":null,"publish_date":"2026-01-13 23:42:32","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ag","sentiment":-0.229},{"id":392845968,"title":"US to end deportation protections for Somalis  - Dominican Republic Post – Caribbean News, Business,","text":"The administration of United States President Donald Trump will end temporary deportation protections and work permits for some Somali nationals in the US, authorities say.\n\nHomeland Security Secretary Kristi Noem said on Tuesday that the Trump administration was ending Temporary Protected Status (TPS), which shields migrants from deportation to countries where it is deemed unsafe to return and grants temporary work authorisation, for Somalis living in the US.\n\n“Country conditions in Somalia have improved to the point that it no longer meets the law’s requirement for Temporary Protected Status,” Noem said in a statement. “Further, allowing Somali nationals to remain temporarily in the United States is contrary to our national interests. We are putting Americans first.”\n\nThe decision, which is expected to affect about 1,100 people, is likely to face legal challenges.\n\nThe Somali community has become a frequent target of the Trump administration. The US president has called Somalis “garbage” and depicted them as criminals.\n\nIn recent weeks, the Trump administration has lashed out at Somalis in the US, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country, with about 80,000 members.\n\nTrump has threatened to strip any naturalised Somali or foreign-born person of their US citizenship if they were convicted of fraud, as he continued his attacks on the Somali community.\n\n“We’re going to revoke the citizenship of any naturalised immigrant from Somalia or anywhere else who is convicted of defrauding our citizens,” Trump said on Tuesday.\n\nThe administration has additionally cut off Minnesota’s access to federal childcare assistance and surged immigration enforcement agents to the state, home to a sizeable Somali population, prompting widespread anger and condemnation from local and state officials over aggressive immigration raids.\n\nHeavily-armed agents have broken car windows and detained people, used frequent force against protesters, and asked residents for proof of citizenship, drawing concerns from civil liberties groups.\n\nTensions rose further after a federal immigration agent last week shot and killed Renee Good, a US citizen and mother of three, who had been acting as a legal monitor of federal immigration activity in Minneapolis.","url":"https://dominicanrepublicpost.com/us-to-end-deportation-protections-for-somalis/","image":"https://dominicanrepublicpost.com/app/uploads/2026/01/2025-12-11T124539Z_1493693040_RC2NCIAVCH4B_RTRMADP_3_USA-SOMALIA-DIPLOMACY-1767167777-GPkzWs.jpg","video":null,"publish_date":"2026-01-13 23:42:15","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":-0.229},{"id":392843280,"title":"None of This Should have Happenedd","text":"This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the best in culture. Sign up for it here.\n\nAfter an ICE agent shot and killed Renee Good in Minneapolis last week, forensic examinations of videos of the incident emerged within hours. These meticulous reconstructions were useful for debunking the lies told by Trump-administration officials in the immediate aftermath of the killing, and they show the power of technology, in an age when nearly everyone has a camera in their pocket, to convey a complicated moment.\n\nSleuths, amateur and professional, pored over each frame to try to guess what Jonathan Ross, the ICE officer who fatally shot Good, might have believed or known in the moment about what she was doing or where her car was heading. But at the core of the tragedy is a larger truth: None of this needed to happen. A series of choices by the administration led to this point—the use of ICE and Border Patrol to menace Democratic-led states and cities; White House pressure on the Department of Homeland Security to make high quotas, which has resulted in shortened training and rushed missions; and the president’s inclination to inflame tensions, all of which created the conditions for the moment that’s now been replayed millions of times.\n\nUnder Supreme Court precedent, an officer may shoot at someone fleeing if he reasonably believes that his life or the lives of others are in danger. Prosecutors are often slow to charge officers, because they or juries are hesitant to second-guess officers’ determinations. Ross was also reportedly dragged by a car in June during an attempted arrest, which may have made him more likely to assume the worst about a driver. The shooting might ultimately be legally justified. But Ross also placed himself in front of Good’s car. Many policing experts suggest that this wasn’t tactically justified. How about moral justification? Nothing indicated that Good was trying to hurt anyone before officers began running at her; moments before being shot, Good had said that she wasn’t mad at Ross. In the videos, after Ross fires, a man is heard saying, “Fucking bitch.” With the information we have, a moral defense for the killing is nowhere to be found.\n\nThere was no need for the huge deployment of federal agents—including a reported 1,500 deportation officers—to Minnesota in the first place. Homeland Security Secretary Kristi Noem dispatched ICE agents to the Minneapolis area after the White House, inspired by MAGA media, grabbed onto a sprawling fraud investigation involving Somali immigrants and government aid. By all accounts, this is a real scandal, not a partisan invention; charges were first brought by Joe Biden’s Justice Department. But the scandal also presented an opportunity for political grandstanding (especially because Minnesota Governor Tim Walz was on the ticket against Donald Trump and J. D. Vance in the previous election). The president is using the fraud case as an opportunity to demonize immigrants. “THE DAY OF RECKONING & RETRIBUTION IS COMING!” he posted this morning on Truth Social, referring to immigration enforcement in Minnesota. Although DHS does conduct investigations, less obvious is why tactical experts such as Ross were needed on the scene.\n\nBefore and after Good’s death, the Trump DHS has sought opportunities to escalate. When citizens called attention to ICE’s presence by making noise and spreading word via social media, DHS falsely claimed that those people were violent rioters. After Good’s death, DHS surged more officers to the area, alleging that the fraud situation merited more agents; officers are now conducting traffic stops and door-to-door operations. But Good’s killing has no obvious connection to fraud, and it does not suggest any elevated threat to officers. Instead, the presence of more officers elevates the threat to civilians, as a Wall Street Journal investigation into ICE traffic stops demonstrates.\n\nPressure from the White House to meet deportation quotas has meant that ICE agents at best are working hastily and at worst feel unshackled to act with brutality, aware that they are unlikely to face discipline. (Six federal prosecutors in Minnesota resigned today, including the leader of the Somali-fraud investigation, because of the Justice Department’s direction to investigate Good’s widow but not Ross.) This, too, increases the likelihood for mistakes and abuses of power.\n\nThe Minnesota actions are, of course, only the latest in a string of similar Trump-administration actions targeting cities that vote Democratic: Los Angeles; Washington, D.C.; Chicago; Portland, Oregon; Memphis; Charlotte, North Carolina; New Orleans. The administration has used DHS personnel, the National Guard, and, in L.A., Marines. Trump and his aides have argued that these raids are essential for controlling crime and illegal immigration, but sometimes enforcement seems incidental to performative brutality. In one midnight raid at a Chicago building, for example, the federal government flew a Black Hawk helicopter and turned people out of bed with flash-bang grenades, yet ProPublica found that not a single one of the people arrested was charged with a crime afterward.\n\nTrump ended National Guard deployments in Los Angeles, Chicago, and Portland late last year, bowing to repeated federal-court rulings, in lawsuits brought by cities and states, that establish that he had exceeded his powers. The first two weeks of January suggest that the administration will simply use DHS to serve the same function of punishing and intimidating cities and states that diverge from Trump politically. Minnesota and Illinois officials sued to block some immigration enforcement yesterday, but because immigration enforcement is a standard federal power, these suits may face longer odds.\n\nEven unfettered, however, the White House is unlikely to achieve its goals of deporting all unauthorized immigrants—in part because they are based on wild overestimates of how many people are in the United States illegally. But Trump and the top aide Stephen Miller’s obsession with the issue means more incidents like Renee Good’s killing. A one-off tragedy is horrifying. What’s worse is when policy choices make it likely to happen again.\n\nHere are three new stories from The Atlantic:\n\nToday’s News\n\nEvening Read\n\nWho Gets to Be Indian—And Who Decides?\n\nBy David Treuer\n\nMore From The Atlantic\n\nCulture Break\n\nWatch. Black Swan, released 15 years ago, offers a sharp social critique of the pitfalls faced by ambitious women, Faith Hill writes.\n\nRead. Gideon Leek explores the unhappy literary families of the internet age.\n\nNew tidbits continue to emerge from The New York Times’ lengthy interview with Trump, and one in particular caught my eye. In my December cover story about how Trump and his allies could seek to subvert the midterm elections, I reported on the danger of the executive branch attempting to seize ballot boxes. This isn’t just catastrophizing: Some Trump allies proposed such a plan after the 2020 election, but it was rejected. In the Times interview, the reporter David Sanger asked Trump about that. “Well, I should have,” Trump replied. Americans should be prepared for him to try again when he has a chance.\n\nExplore all of our newsletters here.\n\nRafaela Jinich contributed to this newsletter.\n\nWhen you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","url":"https://www.theatlantic.com/newsletters/2026/01/escalation-ice-renee-good-minneapolis-shooting/685605/","image":"https://cdn.theatlantic.com/thumbor/gzs6XyEsWBYLWWU_cSTV9u4yhoI=/0x0:4155x2337/720x405/media/newsletters/2026/01/2026_01_13_The_Daily_How_Did_We_Get_To_The_Minneapolis_Shooting/original.jpg","video":null,"publish_date":"2026-01-13 23:42:00","author":"David A. Graham","authors":["David A. Graham"],"language":"en","source_country":"us","sentiment":-0.141},{"id":392847388,"title":"Iran warning: US Government tells citizens to ‘leave now’, Donald Trump says ‘help is on the way’ after deaths","text":"The US Government has told its citizens to “leave Iran now”, issuing the statement hours after US President Donald Trump told Iranians “help is on the way”.\n\nThe statement, issued by the US Department of State, said: “Consider departing by land to Türkiye or Armenia, if safe to do so.”\n\nProtests in Iran have reportedly spread to 180 cities and towns across all of Iran’s provinces, as citizens revolt against the current regime, sparked by the collapse of the countries currency and the soaring cost of living.\n\nAs the regime, led by Supreme Leader Ali Khamenei, attempts to control the citizen revolt, Internet has been cut off, with little information getting in or out.\n\nMr Trump has been vocally critical of Iranian authorities, mainly for the reported mass killings of locals who joined protests.\n\nSo far, human rights groups say around 2000 people have been killed.\n\nThe US President and the Iranian Supreme Leader have traded barbs, mainly on social media, with Mr Trump recently saying he was weighing up military action.\n\nOn Wednesday morning, Mr Trump sent his clearest message yet that the US was about to get involved, saying “help is on the way”.\n\n“Iranian Patriots, KEEP PROTESTING - TAKE OVER YOUR INSTITUTIONS!” Mr Trump wrote on Truth Social.\n\n“Save the names of the killers and abusers. They will pay a big price.\n\n“I have cancelled all meetings with Iranian Officials until the senseless killing of protesters STOPS.\n\n“HELP IS ON ITS WAY.”\n\nThe US President ended the post with “MIGA”, presumably an acronym for Make Iran Great Again.\n\nShortly after Mr Trump’s post, he was asked what he meant by “help is on the way”, telling reporters they would need to work that out themselves.\n\nNow, the US Government has told US citizens to get out of the Middle Eastern country, a familiar move which often comes before an imminent attack or military action.\n\nAirspace closure is another precursor to imminent attacks or military action. An announcement has not yet been made, however, many commercial airlines appear to be avoiding the airspace according to live flight data on popular air traffic website Flightradar 24.\n\nThe US Government announcement for its citizens to leave Iran said: “Protests across Iran continue to escalate and may turn violent, resulting in arrests and injuries. Increased security measures, road closures, public transportation disruptions, and internet blockages are ongoing.”\n\n“The Government of Iran has restricted access to mobile, landline, and national internet networks. Airlines continue to limit or cancel flights to and from Iran, with several suspending service.\n\n“Have a plan for departing Iran that does not rely on US Government help.\n\n“If you cannot leave, find a secure location within your residence or another safe building. Have a supply of food, water, medications, and other essential items.”\n\nSmartraveller tells Australians to leave Iran\n\nThe advice comes days after the Australian Government told Australian citizens to “leave Iran now”.\n\nSmartraveller said Iran is at the highest level of travel risk on its scale, grading it as a level four situation, while departure options become increasingly more limited.\n\n“Airspace closures and flight cancellations could happen soon, making it impossible to leave later,” the DFAT-run body said.\n\n“If you remain in Iran against our advice, you’re responsible for your own safety. Be prepared to shelter in place for an extended period. Make sure you have supplies of water, food and medication.”\n\nSafety is especially at risk because of the widespread blackouts affecting telecommunications, including the internet.\n\nThere is also the possibility of violence at the hands of authorities.\n\n“Security forces’ response to protests has been severe, and many protesters and bystanders have been injured, killed or detained. Avoid public gatherings and protests. Australians, including dual nationals, are at a high risk of being detained,” the advice said.\n\nIn the event that an Australian was detained, the Australian Government is unable to guarantee access to consular services or legal representation, and may not be notified of the detention at all.\n\nFurther, the advice reiterates the risk of terrorists attacks across the state, particularly in Tehran.\n\n“They could occur at any time with little or no warning. Possible targets for attacks include embassies, hotels, places of worship, tourist sites, government interests, military parades and locations, Western businesses and other interests.”","url":"https://thewest.com.au/news/world/iran-warning-us-government-tells-citizens-to-leave-now-donald-trump-says-help-is-on-the-way-after-deaths-c-21302458","image":"https://images.thewest.com.au/publication/C-21302458/848e8872ac72f35e24aaaf931ef39bcec9e2e910-16x9-x1y0w2446h1376.jpg?imwidth=1200","video":null,"publish_date":"2026-01-13 23:41:55","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.547},{"id":392849182,"title":"US to end deportation protections for Somalis  - Jamaica Inquirer – Daily Jamaica News","text":"The administration of United States President Donald Trump will end temporary deportation protections and work permits for some Somali nationals in the US, authorities say.\n\nHomeland Security Secretary Kristi Noem said on Tuesday that the Trump administration was ending Temporary Protected Status (TPS), which shields migrants from deportation to countries where it is deemed unsafe to return and grants temporary work authorisation, for Somalis living in the US.\n\n“Country conditions in Somalia have improved to the point that it no longer meets the law’s requirement for Temporary Protected Status,” Noem said in a statement. “Further, allowing Somali nationals to remain temporarily in the United States is contrary to our national interests. We are putting Americans first.”\n\nThe decision, which is expected to affect about 1,100 people, is likely to face legal challenges.\n\nThe Somali community has become a frequent target of the Trump administration. The US president has called Somalis “garbage” and depicted them as criminals.\n\nIn recent weeks, the Trump administration has lashed out at Somalis in the US, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country, with about 80,000 members.\n\nTrump has threatened to strip any naturalised Somali or foreign-born person of their US citizenship if they were convicted of fraud, as he continued his attacks on the Somali community.\n\n“We’re going to revoke the citizenship of any naturalised immigrant from Somalia or anywhere else who is convicted of defrauding our citizens,” Trump said on Tuesday.\n\nThe administration has additionally cut off Minnesota’s access to federal childcare assistance and surged immigration enforcement agents to the state, home to a sizeable Somali population, prompting widespread anger and condemnation from local and state officials over aggressive immigration raids.\n\nHeavily-armed agents have broken car windows and detained people, used frequent force against protesters, and asked residents for proof of citizenship, drawing concerns from civil liberties groups.\n\nTensions rose further after a federal immigration agent last week shot and killed Renee Good, a US citizen and mother of three, who had been acting as a legal monitor of federal immigration activity in Minneapolis.","url":"https://jamaicainquirer.com/us-to-end-deportation-protections-for-somalis/","image":"https://jamaicainquirer.com/app/uploads/2026/01/2025-12-11T124539Z_1493693040_RC2NCIAVCH4B_RTRMADP_3_USA-SOMALIA-DIPLOMACY-1767167777-AjAR1V.jpg","video":null,"publish_date":"2026-01-13 23:39:35","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"jm","sentiment":-0.229},{"id":392845944,"title":"US to end deportation protections for Somalis  - Grenada Chronicle – Daily Grenada And Caribbean News","text":"The administration of United States President Donald Trump will end temporary deportation protections and work permits for some Somali nationals in the US, authorities say.\n\nHomeland Security Secretary Kristi Noem said on Tuesday that the Trump administration was ending Temporary Protected Status (TPS), which shields migrants from deportation to countries where it is deemed unsafe to return and grants temporary work authorisation, for Somalis living in the US.\n\n“Country conditions in Somalia have improved to the point that it no longer meets the law’s requirement for Temporary Protected Status,” Noem said in a statement. “Further, allowing Somali nationals to remain temporarily in the United States is contrary to our national interests. We are putting Americans first.”\n\nThe decision, which is expected to affect about 1,100 people, is likely to face legal challenges.\n\nThe Somali community has become a frequent target of the Trump administration. The US president has called Somalis “garbage” and depicted them as criminals.\n\nIn recent weeks, the Trump administration has lashed out at Somalis in the US, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country, with about 80,000 members.\n\nTrump has threatened to strip any naturalised Somali or foreign-born person of their US citizenship if they were convicted of fraud, as he continued his attacks on the Somali community.\n\n“We’re going to revoke the citizenship of any naturalised immigrant from Somalia or anywhere else who is convicted of defrauding our citizens,” Trump said on Tuesday.\n\nThe administration has additionally cut off Minnesota’s access to federal childcare assistance and surged immigration enforcement agents to the state, home to a sizeable Somali population, prompting widespread anger and condemnation from local and state officials over aggressive immigration raids.\n\nHeavily-armed agents have broken car windows and detained people, used frequent force against protesters, and asked residents for proof of citizenship, drawing concerns from civil liberties groups.\n\nTensions rose further after a federal immigration agent last week shot and killed Renee Good, a US citizen and mother of three, who had been acting as a legal monitor of federal immigration activity in Minneapolis.","url":"https://grenadachronicle.com/us-to-end-deportation-protections-for-somalis/","image":"https://grenadachronicle.com/app/uploads/2026/01/2025-12-11T124539Z_1493693040_RC2NCIAVCH4B_RTRMADP_3_USA-SOMALIA-DIPLOMACY-1767167777-cwTpyY.jpg","video":null,"publish_date":"2026-01-13 23:39:13","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gd","sentiment":-0.229},{"id":392849562,"title":"\"We'll get some accurate numbers about killing, Iran better behave\": Trump warns amid unrest","text":"Washington DC [United States], January 14 (ANI): As the protests continue to rise in Iran, US President Donald Trump on Tuesday (local time) warned the country of \"consequences\" if it continues violent actions against its own citizens, saying Tehran \"better behave\".Trump said that the United States would \"review the situation\" in regard of reports of killings and alleged executions during unrest in the country.Speaking to reporters after an event in Detroit, Trump said he was returning to Washington to assess developments related to Iran.\"We had a wonderful speech in front of great people in Detroit. I'm going back to the White House now, and we're going to look at the whole situation that's going on in Iran. We'll get some accurate numbers as to what's happening with regard to the killing,\" the US President told reporters.On being asked if he wants to see democracy in Iran, Trump added that he would want to see a \"little bit of freedom\" for the Iranian people.\"Ideally, we would like to see it. We don't want to see people killed, and we want to see a little bit of freedom for these people. These people have been living in hell for a long time. I have friends who used to invest in Iran, and they did well with their investments. It was a great place. The people were great. Even the leadership was good. And now it is living in hell,\" he said.When asked by a reporter about Iran's warning of retaliation in the event of US strikes, Trump responded, \"Yeah, Iran said that the last time I blew them up with the nuclear capability, which they don't have any longer, so. they better behave.\"When asked whether he had a message for Iran's leadership amid reports of violence against protesters, Trump said, \"The message is they've got to show humanity. They've got a big problem, and I hope they're not going to be killing people. It would seem to me that they have been badly misbehaving, but that is not confirmed.\"While responding to a question from CBS News reporter Emily Schrader during his tour of Ford Motor Company's historic River Rouge Complex in Michigan about reports of executions, Trump responded, \"When they start killing thousands of people and now you're telling me about hanging [protesters], we'll see how that works out for them. It's not going to work out good.\"Trump's remarks came amid heightened US messaging about the situation with Iran and a series of White House statements indicating that \"many options\" remain under review.White House Press Secretary Karoline Leavitt told journalists yesterday that airstrikes are among the \"many, many options\" under consideration, while stressing that diplomacy remains the administration's \"first option.\"Her comments followed a fresh directive from Trump aimed at countries doing business with Iran.Trump announced that any country doing business with the Islamic Republic would face a 25 per cent tariff on all trade conducted with the United States.In a statement, Trump said, \"Effective immediately, any country doing business with the Islamic Republic of Iran will pay a tariff of 25% on any and all business being done with the United States of America. This order is final and conclusive.\"The developments come as Iran has been witnessing sustained nationwide protests since late December, drawing divided reactions internationally, with some governments expressing concern over what they describe as foreign-instigated riots, while others have accused Iranian authorities of responding violently to demonstrators, Al Jazeera reported.The death toll includes 505 protesters, among them nine children, as well as 133 members of Iran's military and security forces, one prosecutor, and seven civilians who were not involved in the demonstrations. The current protest, in its 17th day, has spread nationwide, with 606 gatherings across 187 cities, according to HRANA. (ANI)","url":"https://www.aninews.in/news/world/us/well-get-some-accurate-numbers-about-killing-iran-better-behave-trump-warns-amid-unrest20260114050348","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260113233319.jpg","video":null,"publish_date":"2026-01-13 23:33:48","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.267},{"id":392772758,"title":"DNA TV Show: Why has Trump announced 25% tariff on countries trading with Iran?","text":"To put pressure on Iran, US President Donald Trump has made a new announcement, saying a 25 per cent tariff would be imposed on countries that do business with Iran. This means that countries trading with Iran will have to pay an additional 25 per cent tariff if they also trade with the US.\n\nTrump announced on Truth Social that this decision would be implemented immediately, without any grace period. However, the White House has not yet issued any official document regarding this tariff. The objective of this decision is to discourage countries around the world from trading with Iran. If Iran cannot export its oil and other goods, it will impact the government's revenue, further worsening the economic situation. Furthermore, if Iran cannot import essential goods, people will intensify their protests against the government.\n\nTrump's decision is particularly significant because the protests in Iran began due to economic reasons. If this decision negatively impacts Iran's trade, it will likely fuel even greater public anger. The US has already imposed various sanctions on Iranian trade, limiting Iran's global commerce. Despite this, Iran trades with 147 countries worldwide. This means that the US decision will impact these 147 countries.\n\nAccording to 2022 World Bank data, China is Iran's largest trading partner in terms of both imports and exports, with total trade amounting to approximately USD 37 billion. Iran's second-largest trading partner is the UAE, with trade between the two countries reaching USD 30 billion in 2022. Another important trading partner for Iran is Turkey, with which it conducted USD 10 billion worth of trade in 2022.\n\nTrump's decision will have the biggest impact on China. According to one estimate, more than 80 per cent of Iran's oil exports go to China. This is why China reacted sharply as soon as Trump announced the tariffs.\n\nThe Chinese Foreign Ministry said it would resolutely defend its rights. China also stated that there are no winners in a tariff or trade war and that the US decision is against international rules. China has also threatened to impose retaliatory tariffs. This decision by Trump could reignite the trade war between the US and China.\n\nTrump's decision comes shortly after his ambassador to India, Sergio Gor, made effusive statements about friendship between the two countries. But far from a trade deal, Trump announced yet another tariff. This tariff could also apply to India because of the trade relations between Delhi and Tehran.\n\nThis will make Indian exports to the US more expensive. In this situation, India might be forced to stop trading with Iran. It's also important to note that trade between India and Iran has decreased significantly in recent years. In 2022, trade between India and Iran amounted to $14 billion, but by 2025, it had fallen to USD 1.68 billion.","url":"https://www.dnaindia.com/analysis/report-dna-tv-show-why-has-us-president-donald-trump-announced-25-per-cent-tariff-on-countries-trading-with-iran-3196982","image":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2026/01/13/2738134-trump-4.jpg","video":null,"publish_date":"2026-01-13 23:33:00","author":"Pm Ist","authors":["Pm Ist"],"language":"en","category":"politics","source_country":"in","sentiment":-0.337},{"id":392842856,"title":"Flashback: When Scott Adams Explained Trump, Persuasion, and 'Loserthink'","text":"Loserthink currently sits in Amazon’s top spot for political humor, which Adams discusses as a successful marketing plan, but don’t let that category limit your perspective on what the book discusses. Adams lays out his premise, in detailed and sometimes personal terms, that we allow ourselves to create mental prisons based on our own assumptions and lack of analytical thinking, especially through a deficiency of cross-disciplinary training. Adams argues that the oft-suggested advice of “stay in your own lane” might be the worst advice one could possibly offer.\n\nAdams and I spend a little time discussing Donald Trump and his previous book, Win Bigly, as another example of how the lack of cross-disciplinary experience can keep people from seeing a connected reality. “What I noticed about Trump,” Adams says of the early campaign, “is that he had the toolbox of a persuader — which I could recognize, because it’s something I’ve been studying for decades.” Without that cross-disciplinary training or even experience, Adams notes, people end up thinking, “‘Hey, it’s just some crazy clown, just giving people nicknames, full of bluster,’ and that’s there’s nothing to that.” We continue on that topic for a while, including whether people have begun figuring out that particular blind spot — and who has the best opportunity to do so, and why.\n\nIn Loserthink, Adams urges people to leave their lane, and often. “Leaving your lane is what allows you to pick up a new talent,” Adams notes in this interview. It’s that effort and experience that produces “all the good things” on the macro and micro levels, Adams argues, but it also teaches our brains to think better and comprehend reality more clearly. That is just part of the ways in which Adams instructs us to break out of our mental prisons.\n\nIt’s a fun interview, and I must admit being a little fanboy-ish here, as I have long admired Adams and enjoyed his work. I don’t think I’ve ever read an Adams book from which I didn’t get something valuable, but Loserthink might in some ways be the most practical and thought-provoking yet. Be sure to pick up a copy, and pay attention to his practical advice.","url":"https://hotair.com/ed-morrissey/2026/01/13/flashback-when-scott-adams-explained-trump-persuasion-and-loserthink-n3810791","image":"https://media.townhall.com/cdn/hodl/2026/9/db966a8b-25da-4599-9f18-2e8432bab302.png","video":null,"publish_date":"2026-01-13 23:30:48","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":0.274},{"id":392840928,"title":"THE ECONOMIST: Elon Musk’s Grok AI is under fire for nude deepfakes, but who will punish the rogue chatbot","text":"From drug use to libel suits, Elon Musk has long been able to shrug off problems that would have imperilled most bosses. But the reaction to a recent update to Grok, the AI chatbot linked to X, the billionaire’s social network, poses a fresh test of his imperviousness. Grok’s willingness to churn out nude deepfakes has led to scrutiny in Britain and Australia, among other places, and outright bans of the chatbot in Malaysia and Indonesia.\n\nThe flood of deepfakes began after December 24, when Mr Musk announced that Grok had been updated with a new image generator. The change brought the chatbot to parity with those of Google and OpenAI, but with some big differences.\n\nIn line with Mr Musk’s desire to create the most “based” chatbot — anti-censorship, politically incorrect and “maximally truth-seeking” — the system is far less likely than others to refuse requests to generate images because they violate content policies. Ask ChatGPT to edit an image of a real person to strip them to their underwear, and it will demur. Grok, however, has no such qualms.\n\nMoreover, because Grok can be accessed on X, it answers many requests in public. Until another update limited the feature to paying subscribers on January 9, the chatbot’s public profile was responding to a hundred such “nudification” requests a minute, some of them involving children.\n\nThe phrase “put her in a bikini” soared on the social-media site (and some users have managed to go further still, generating pornographic images with cleverly worded prompts).\n\nOther companies might have declared such creations an abuse of their product and apologised; Mr Musk has responded with laughter to an image putting a toaster in a bikini.\n\nThe fallout might be harder to laugh off. Mr Musk accuses the British government of just wanting “to suppress free speech”.\n\nAnd the legal status of artificial non-consensual intimate imagery (NCII), as nude deepfakes are technically known, varies around the world. But there is less variation when such imagery involves children.\n\nIndonesia, home to 24 million X users, has responded to the trend with a temporary ban of Grok, calling the imagery “a serious violation of human rights, dignity and the security of citizens in the digital space”. Malaysia, with another 5 million users, has followed suit.\n\nIn Britain the Labour government has announced plans to accelerate the enforcement of new laws against generated NCII, passed by parliament last summer, alongside an investigation by Ofcom into various breaches of the Online Safety Act, including failures to take down illegal content such as child-sexual-abuse material swiftly.\n\nThe move comes as governments everywhere are toughening up on social media and online porn, especially where children are concerned. Canada and Australia are mulling action, and are thought to be co-ordinating their responses with Britain.\n\nA fine from Ofcom would be noticeable, but not a disaster for the deep-pocketed Mr Musk. For serious breaches of the Online Safety Act, the regulator can levy penalties of up to 10 per cent of a firm’s global revenues — around $US250million ($374m) in X’s case.\n\nIn X’s biggest market, America, the picture is more mixed. Last May Donald Trump signed into law the “Take It Down Act”, which penalises platforms that spread “intimate visual depictions” of a person online.\n\nCompanies have been given a year to draw up take-down policies. But some of the images causing controversy today might not meet the definition of an “intimate visual depiction”, says Riana Pfefferkorn, a lawyer and policy fellow at Stanford University’s Institute for Human-Centred AI.\n\nNor is enforcement guaranteed. X benefits from its owner’s close links to the Trump administration. After the EU issued fines against the social network in December for violations of its Digital Services Act, America’s secretary of state, Marco Rubio, warned that “the days of censoring Americans online are over”.\n\nReal discipline, however, might not come from government action, but from commercial consequences. Advertisers had already begun to flee X, prompting lawsuits from Mr Musk. Those remaining could vote with their wallets.\n\nPayment processors such as Visa and Mastercard have strict content standards and have shown a willingness to enforce them — such as in 2021, when they required pornographic websites to verify the age of anyone featured in online content.\n\nMastercard has said it would refuse to work with purveyors of “nudification” software. Now that this includes the world’s richest man, will the line hold?","summary":"THE ECONOMIST: The real power to discipline the AI chatbot lies outside governments","url":"https://thewest.com.au/business/the-economist/the-economist-elon-musks-grok-ai-is-under-fire-for-nude-deepfakes-but-who-will-punish-the-rogue-chatbot-c-21302431","image":"https://images.thewest.com.au/publication/C-21302431/a116d389092202d9768fc841b6e4470fdf1be008-16x9-x0y75w800h450.jpg?imwidth=1200","video":null,"publish_date":"2026-01-13 23:29:47","author":"The Economistwe","authors":["The Economistwe"],"language":"en","source_country":"au","sentiment":-0.035},{"id":392841684,"title":"Trump tariffs set for big Supreme Court rulings, Amazon makes shocking announcements. What does this mean for Donald Trump?","text":"Global Desk\n\nU.S. Supreme Court said last week it would issue its next ‍rulings ⁠on January 14 ⁠as several major cases remain pending, including the legality of President Donald Trump's sweeping global tariffs. Ahead of Wednesday's hearings, Amazon is seeking to ​cut what it pays suppliers for goods ⁠it sells on its e-commerce platform, as the tech giant moves to reverse concessions intended to limit the shock of U.S. ‌President ‌Donald Trump's tariffs, the Financial Times reported on Tuesday.Trump TariffsET Budget Survey: Tell us your wishlistThe justices raised doubts during arguments on November 5 over the legality of Trump's sweeping tariffs in a case with implications for ​the global economy that marks a major test of Trump's powers. Conservative and liberal justices alike sharply questioned the lawyer representing Trump's administration about whether a 1977 law meant for use during national emergencies gave Trump the power he claimed to impose tariffs or whether the president had intruded on the powers of Congress. But some of the conservative ⁠justices also stressed the inherent authority of presidents in dealing with foreign countries, suggesting the court could be sharply divided in the outcome of the case. Lower courts ruled that Trump overreached in invoking a 1977 law known as the International Emergency Economic Powers Act to impose the tariffs, which were challenged by various businesses and 12 U.S. states. A ruling is expected by the end of June.AmazonLive EventsAmazon has sought ‌discounts from suppliers ranging from low single digits to as high as 30%, the report said, citing several vendor consultants.The world's largest e-commerce ​platform had accelerated talks with some suppliers by several ‌weeks ‍and in individual cases had sought to ‍impose a January 1 deadline, the report added.Last ‌year, Amazon agreed to raise the price it paid to some suppliers for tariffed goods in return for them guaranteeing minimum margins. The company sells goods directly and hosts third-party retailers, who account for more than 60 per cent of sales ‍on its platform, FT said.The administration faces the possibility of having to refund nearly $150 billion paid in tariffs to importers if the court declares that the sweeping duties Trump has imposed under the International Emergency Economic Powers Act are illegal.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump tariffsSupreme Court rulingsAmazon supplier discountsDonald Trump powerstariffs legality\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump tariffsSupreme Court rulingsAmazon supplier discountsDonald Trump powerstariffs legality(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Trump Traiffs are set to undergo major litmus test as the U.S. Supreme Court will make rulings on the key issue.","url":"https://economictimes.indiatimes.com/news/international/us/trump-tariffs-set-for-big-supreme-court-rulings-amazon-makes-shocking-announcements-what-does-this-mean-for-donald-trump/articleshow/126515187.cms","image":"https://img.etimg.com/thumb/msid-126515187,width-1200,height-630,imgsize-1391855,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2026-01-13 23:24:44","author":"Supreme Court","authors":["Supreme Court"],"language":"en","category":"politics","source_country":"in","sentiment":-0.209},{"id":392841164,"title":"US to take three-quarter stake in Armenia corridor","text":"Armenia will give the United States a nearly three-quarters stake in a corridor of its land connecting parts of rival Azerbaijan, Washington announced Tuesday, as it said it expected to benefit financially from the arrangement but promised to respect sovereignty. Secretary of State Marco Rubio laid out a framework for the project as he met in Washington with the top diplomat of Armenia, whose government agreed to the plan after a crushing Azerbaijani military victory in 2023 that ended a long-running conflict. The United States had proposed developing a corridor that would connect the larger part of Azerbaijan with its exclave of Nakhchivan, which is not linked otherwise with the rest of Azerbaijan and borders the country's key ally, Turkey. Armenia lies between these two parts of Azerbaijan. In the typical fashion of President Donald Trump's administration, the corridor is named after him -- the Trump Route for International Peace and Prosperity (TRIPP) -- and he has listed Armenia and Azerbaijan as beneficiaries of peace after a series of wars he claims to have ended. A framework released by the State Department after Rubio's meeting said that Armenia would give the United States a 74 percent share in a new \"TRIPP Development Company\" and retain the rest for itself. The company will set up a corporate structure bringing together the two governments that will develop rail and road routes through the corridor, it said. The company's objectives will include giving a \"financial return to the US for its initial contribution or other economic benefits to the US government or for US companies,\" the framework said. The project will open new markets for US investment and speed up trade \"to bring raw materials, critical minerals and rare earth metals to American markets,\" it said. Speaking with Armenian Foreign Minister Ararat Mirzoyan, Rubio said: \"The TRIPP arrangement really is going to turn out to be a model for the world of how you can open yourself up to economic activity and prosperity without in any way questioning or undermining your sovereignty and your territorial integrity.\" \"It's going to be great for Armenia, great for the United States, great for everyone involved,\" Rubio said. Release of the project details come days after the United States deposed the leader of Venezuela and said that US companies would profit from its oil sector, whose proceeds would go back to buy US products. - Sovereignty safeguards - The United States previously announced $145 million in funding for development of the Armenia corridor. The framework said that Armenia's sovereignty over the corridor would be \"absolute and non-negotiable.\" Armenia will maintain the right to enforce its own domestic laws within the TRIPP area, including by controlling law enforcement. Some US policymakers hope that the corridor will also help reduce the influence of Russia, the historic ally of Armenia. Many Armenians voiced resentment that Moscow, bogged down in Ukraine, failed to prevent the Azerbaijani victory in 2023. Armenian separatists for nearly three decades held the breakaway region of Nagorno-Karabakh inside energy-rich Azerbaijan, which swept through the area in a lightning offensive in 2023. The TRIPP project, and the prospect of a major US presence, has raised concern in Iran, which also borders Nakhchivan and has had warm relations with Armenia. Armenian Prime Minister Nikol Pashinyan last year assured Iran's clerical government by saying that the corridor would remain under Armenian sovereignty. sct/dw","url":"https://today.rtl.lu/news/world/us-pushes-forward-trade-enclave-over-armenia-564384587","image":"https://static-prod.rtl.lu/dims4/default/5277da4/2147483647/strip/false/crop/768x511+0+0/resize/768x511!/quality/90/?url=https%3A%2F%2Frtl-luxembourg-new-production-web.s3.eu-central-1.amazonaws.com%2Fbrightspot%2F3a%2Fa6%2F3fb1c8323cae2e162011b4cad9bb%2F","video":null,"publish_date":"2026-01-13 23:16:39","author":null,"language":"en","category":"politics","source_country":"lu","sentiment":0.28},{"id":392849358,"title":"Trump visits Ford plant and defends his tariffs, hoping to counter jitters about the economy","text":"Trump visits Ford plant and defends his tariffs, hoping to counter jitters about the economy\n\nTrump visits Ford plant\n\nPresident Donald Trump offered a full-throated defense of his sweeping tariffs on Tuesday, traveling to swing-state Michigan to push the case that he’s boosted domestic manufacturing in hopes of countering fears about a weakening job market and still-rising prices that have squeezed American pocketbooks.\n\nTrump visited the factory floor of a Ford plant in Dearborn, where he viewed F-150s — the bestselling domestic vehicle in the U.S. — at various stages of production. That included seeing how gas and hybrid models were built, as well as the all-gas Raptor model, designed for off-road use.\n\nThe president chatted with assembly line workers as well as the automaker’s executive chairman, Bill Ford, a descendent of Henry Ford. “All U.S. automakers are doing great,\" Trump said.\n\nHe later gave a speech to the Detroit Economic Club that was meant to be focused on his economic policies but veered heavily to other topics as well. Those included falsely claiming to have won Michigan three times (he lost the state in 2020 to Joe Biden) and recalling the snakes that felled workers during U.S. efforts to build the Panama Canal more than a century ago.\n\n“The results are in, and the Trump economic boom has officially begun,” the president said at the MotorCity Casino. He argued that “one of the biggest reasons for this unbelievable success has been our historic use of tariffs.”\n\nTrump falsely insists tariffs haven't increased costs\n\nThe president said that tariffs were “overwhelmingly” paid by “foreign nations and middlemen” — even as economists say steep import taxes are simply passed from overseas manufactures to U.S. consumers, helping exacerbate fears about the rising cost of living.\n\n“It’s tariffs that are making money for Michigan and the entire country,” the president said, insisting that “every prediction the critics made about our tariff policy has failed to materialize.”\n\nBut voters remain worried about the state of the economy. The Michigan stop — his third trip to a swing state since last month to talk about his economic policies — followed a poor showing for Republicans in November’s off-year elections in Virginia, New Jersey and elsewhere amid persistent concerns about kitchen table issues.\n\nThe White House pledged after Election Day that Trump would hit the road more frequently to talk directly to the public about what he is doing to ease their financial fears. The president tried to drive that home on Tuesday, but only amid lengthy asides.\n\n“I go off teleprompter about 80% of the time, but isn’t it nice to have a president who can go off teleprompter?” he said, before mocking Biden, suggesting his predecessor gave short speeches and doing an impression that included a dramatic clearing of his throat.\n\nTrump promised to unveil a new “health care affordability framework” later this week that he promised would lower the cost of care. He also pledged to soon offer more plans to help with affordability nationwide — even as he blamed Democrats for hyping up the issue.\n\n“One of our top priorities of this mission is promoting greater affordability. Now, that’s a word used by the Democrats,\" Trump said. “They’re the ones who caused the problem.”\n\nTrump eased some auto tariffs\n\nDespite cheering tariffs, Trump has actually backed off the import taxes when it comes to the automobile sector. The president originally announced 25% tariffs on automobiles and auto parts, only to later relax those, seeking to provide domestic automakers some relief from seeing their production costs rise.\n\nFord nonetheless announced in December that it was scrapping plans to make an electric F-150, despite pouring billions of dollars into broader electrification. That followed the Trump administration slashing targets to have half of all new vehicle sales be electric by 2030, eliminated EV tax credits and proposed weakening the emissions and gas mileage rules.\n\nWhile touring the plant, video posted by TMZ showed Trump making an obscene gesture at someone who was yelling at him from afar. White House spokesman Steven Cheung said \"a lunatic was wildly screaming expletives in a complete fit of rage, and the president gave an appropriate and unambiguous response.”\n\nTrump also suggested during the tour that a major North American trade pact he negotiated during his first term, the United States-Mexico-Canada Agreement, was irrelevant and no longer necessary for the United States — though he provided few details.\n\nKnown as the USMCA, it is up for review this year.\n\nTrump largely sidesteps Powell investigation\n\nThe president's attempt to shift national attention to his efforts to spur the economy comes as his Department of Justice has launched a criminal investigation into Federal Reserve Chair Jerome Powell, a move that Powell says is a blatant endeavor to undermine the central bank's independence in setting interest rates.\n\nCritics of the move include former Fed chairs, economic officials and even some Republican lawmakers. Trump lobbed his often-repeated criticisms of Powell during his trip, but offered little mention of the investigation.\n\nSome good economic news for Trump arrived, though, before he left Washington, with new data from December showing inflation declined a bit last month as prices for gas and used cars fell — a sign that cost pressures are slowly easing. Consumer prices rose 0.3% in December from the prior month, the Labor Department said, the same as in November.\n\n“We have quickly achieved the exact opposite of stagflation, almost no inflation and super-high growth,” he said in his speech.\n\nTrump has made other economic policy speeches\n\nThe Michigan stop follows speeches Trump gave last month in Pennsylvania — where his gripes about immigrants arriving to the U.S. from “filthy” countries got more attention than his pledges to fight inflation — and North Carolina, where he also insisted his tariffs have spurred the economy, despite residents noting the sting of higher prices.\n\nLike in Michigan, Trump also used a casino as a backdrop to talk about the economy in Pennsylvania, giving his speech there at Mount Airy Casino Resort in Mount Pocono.\n\nTrump carried Michigan in 2016 and 2024, after it swung Democratic and backed Biden in 2020. He marked his first 100 days in office with a rally-style April speech outside Detroit, where he focused more on past campaign grudges than his administration's economic or policy plans.\n\nDemocrats seized on Trump's latest trip to the state to recall his visit in October 2024, when Trump, then also addressing the Detroit Economic Club, said that Democrats' retaining the White House would mean “our whole country will end up being like Detroit.\"\n\n\"You’re going to have a mess on your hands,” Trump said during a campaign stop back then.\n\nAbout 100 people protested outside the venue where Trump spoke Tuesday, including Kassandra Rodriguez, a member of the Detroit Community Action Committee.\n\n“He says a lot, but he means very little and I think we can see that,” Rodriguez said of the president. “He doesn’t know how to enact real policy in a real way.”","summary":"President Donald Trump offered a full-throated defense of his sweeping tariffs on Tuesday, traveling to swing-state Michigan to push the case that he's boosted domestic manufacturing in hopes of countering fears about a weakening job market and still-rising prices that have squeezed American pocketb...","url":"https://www.castanet.net/news/World/594021/Trump-visits-Ford-plant-and-defends-his-tariffs-hoping-to-counter-jitters-about-the-economy","image":"https://www.castanet.net/content/2026/1/e9eaae074c2a7e0b91dfdb16a65da1afa071eac44b19b634958284ecf2b736e4.jpg","video":null,"publish_date":"2026-01-13 23:15:00","author":"The Canadian Press,Will Weissert And","authors":["The Canadian Press","Will Weissert And"],"language":"en","source_country":"ca","sentiment":-0.337},{"id":392848384,"title":"US government approves Nvidia H200 chip exports to China","text":"The US has officially green-lighted Nvidia to sell its H200 artificial intelligence chips in China, as the Trump administration seeks to strike a balance between curtailing China’s AI progress and maintaining American AI firms’ global market share.\nThe H200, US chip giant Nvidia’s second-most-advanced AI processor, can be shipped to China under conditions that include that its China shipments account for no more than half of the amount sold domestically, according to the Department of Commerce’s Bureau of Industry and Security (BIS).\nThe new policy is scheduled to be published and take effect on Thursday.\nThe H200 was initially subject to export restrictions to China in January 2025, in the final days of the Biden Administration, as part of the AI Diffusion Rule, which aimed to limit other countries’ access to advanced American technology.\n\nOver the past year, the Trump administration has sought to rescind the rule and ease certain curbs, efforts that some US officials criticised.\nIn July, Nvidia founder and CEO Jensen Huang said the US government had promised to grant the company licences to resume exporting the H20 chip, a product specifically designed for the Chinese market that is less powerful than its standard AI graphics processing units (GPUs).\nHuang said last week at the annual consumer electronics trade show CES in Las Vegas that Nvidia was seeing “very high” customer demand from China for its H200 AI chips, and that the company was “firing up” its supply chain.\nIn December, US President Donald Trump said he would allow Nvidia to sell the H200 to approved customers in China, days after Huang met with the US President in Washington to discuss US export controls.\nTrump said at the time that 25 per cent of the chip sales would be “paid” to the US government. The BIS announcement this week made no mention of this.\nThe latest BIS rules revised the country’s licensing policy from a presumption of denial to a case-by-case review.\nNvidia would need to put every China shipment of the H200 through reviews by a third-party lab headquartered in the US to confirm the chips’ “technical capabilities and functions”, the BIS said.\nNvidia’s AI chips, however, have faced growing hurdles in China as Beijing pushes for technology self-sufficiency. After Nvidia declared the resumption of H20 sales in July, Chinese state media outlets called the US chip “unsafe” and urged Chinese firms to boycott the made-for-China AI processor.\nThe Cyberspace Administration of China also summoned Nvidia in July to discuss alleged risks posed by the H20 chips’ potential tracking and remote-control functions.\nThe Chinese government told some tech companies this week that it would approve their orders for Nvidia’s H200 chips only under exceptional circumstances, such as for university research and development labs, according to a report by tech industry publication The Information on Tuesday.","url":"https://www.scmp.com/news/china/diplomacy/article/3339797/us-government-approves-nvidia-h200-chip-exports-china?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/01/14/95a484c3-c173-49b7-b2ab-ce4ae34a9eb1_7acb7e27.jpg","video":null,"publish_date":"2026-01-13 23:14:41","author":"Xinmei Shen","authors":["Xinmei Shen"],"language":"en","source_country":"hk","sentiment":-0.394},{"id":392847032,"title":"'A kid who wants to play sports might not be able to'. Trans rights hits SCOTUS","text":"WASHINGTON − Supreme Court Justice Brett Kavanaugh seemed to draw from personal experience coaching his daughter’s basketball team when the high court debated on Jan. 13 whether states can ban transgender girls from playing on female teams.\n\n“I hate, hate that a kid who wants to play sports might not be able to play sports. I hate that,” Kavanaugh told the lawyer representing the transgender student challenging West Virginia’s ban. “But it's kind of a zero-sum game for a lot of teams.”\n\nIf a transgender girl makes a team or a starting line-up, she will bump someone else, he said, backing the argument for “fairness” that has driven the bans passed by more than half the states.\n\nAlthough the court’s three liberal justices focused, during the more than three hours of oral arguments, on whether transgender females should have the right to prove they don’t have physical advantages after receiving medical treatments, a majority of the court’s six conservatives seemed likely to uphold bans in West Virginia and Idaho.\n\nLawyers for those states, as well as the Justice Department, argued that the laws pass legal muster because they’re fair when applied to nearly all students who were designated male at birth.\n\nChief Justice John Roberts, a key conservative because of his 2020 vote that transgender people are protected from discrimination in the workplace, said allowing challenges to the state laws from a fairly small group of people could have implications in areas beyond school sports teams.\n\n“If we adopted that, that would have to apply across board and not simply to the area of athletics,” Roberts said.\n\nHere are seven takeaways from the Supreme Court arguments:\n\n'Are they bigots?' Conservative justices question fairness for athletes who aren't transgender\n\nSeveral conservative justices suggested transgender participation in women's sports jeopardizes fairness for non-transgender athletes.\n\nJustice Samuel Alito appeared to defend non-transgender women athletes who oppose transgender inclusion and face accusations that they are irrational or hateful.\n\n\"Are they bigots? Are they deluded in thinking that they are subjected to unfair competition?\" Alito asked Kathleen Hartnett, the lawyer representing an Idaho transgender student who has challenged Idaho's ban.\n\nHartnett said she would never call someone that, and was focused on whether the Idaho ban is constitutional.\n\nKavanaugh, an appointee of President Donald Trump, praised the growth of women's and girls' sports in the past 50 years, and said he worried about undermining that with transgender participation in female categories.\n\n\"Some states, and the federal government, and the NCAA, and the Olympic Committee – so these are a variety of groups who study this issue – think that allowing transgender women and girls to participate will undermine or reverse that amazing success,\" he said. \"I think we can't sweep that aside.\"\n\nHartnett said the real question is a scientific one: Is there an unfair biological advantage for transgender women and girls? She argued that transgender athletes can mitigate their sex-based advantage by reducing the level of testosterone circulating in their bodies.\n\nLiberal justices pushed against categorical bans\n\nThe court’s three liberal justices fought an uphill battle to convince their colleagues that transgender students should have the chance to argue why the bans don’t apply to their particular circumstances.\n\nJustice Sonia Sotomayor, an Obama appointee, asked a Justice Department attorney about his position that the state bans are okay because they’re fair when applied to 99% of biological males.\n\n“The numbers don’t talk about the human being,” she said.\n\nHashim Mooppan, the U.S. Principal Deputy Solicitor General, said those challenging the bans would have to show the laws are unfair against a “substantial enough percentage” of people.\n\n“Why does it have to be that many people? Why? Why?” Justice Ketanji Brown Jackson, a Biden appointee, asked.\n\nShe said if a law is unconstitutional for one person, it shouldn’t matter whether the person is outnumbered by the rest of the people covered by the law.\n\nIdaho Solicitor General Alan Hurst told Justice Elena Kagan, an Obama appointee, it would be unworkable for courts to order exceptions to laws based on a class of litigants any time judges thought they didn’t make sense.\n\nHurst argued litigants could keep moving the goal lines. For example, he said, if a law was based on taking testosterone, a transgender athlete could argue they are taking so little it provides no advantage.\n\n“It’s going to be enormously burdensome and the state can never win,” Hurst said. “You’d have to make as many exceptions as courts thought you needed to make.”\n\nKagan tried to mitigate the loss for transgender students\n\nPerhaps anticipating that a majority of the court is going to uphold the bans, Kagan pressed the lawyers on how the court could write that opinion without requiring states without bans to impose them.\n\nThat issue is important because President Trump has moved to cut off federal funding from schools that allow transgender athletes to compete on female teams.\n\nCalifornia, for example, is fighting that requirement.\n\nKavanaugh, one of the conservative justices, said he wanted to be “crystal clear” about whether deciding in favor of Idaho and West Virginia would affect California’s fight.\n\nMooppan, the Justice Department attorney, said the court could back the bans in a way that doesn’t settle the issue of whether they’re required under Title IX, the 1972 federal law that bans sex-based discrimination.\n\n“I don’t think if you adopt the argument I’m making here today, their hands are going to be tied,” he said of California.\n\nHurst, Idaho’s solicitor general, likewise told Kavanaugh he hasn’t been “persuaded by a constitutional theory that would let us use the equal protection clause to impose our policy on other states.”\n\n'Infamy': Sotomayor suggests allowing transgender athlete to drop case\n\nThe plaintiff in one of the two cases before the court, Lindsay Hecox, has stopped playing women's sports and now says she wants the justices to simply dismiss her case.\n\nHecox originally sued because Idaho's ban blocked her from trying out for the Boise State University track and cross-country teams. \n\nSotomayor said Hecox clearly isn't trying to maneuver herself to prevent the conservative-majority court from potentially upholding transgender athlete bans. The justice noted that, even if the court dismisses Hecox's case, it would still be able to rule in the separate West Virginia case.\n\n\"So we don't have a subterfuge in attempting to stop the court from reaching an important legal question,\" Sotomayor said.\n\nIn that context, Sotomayor asked Hurst, Idaho's solicitor general, why the court shouldn't let Hecox get out of what will be a historic Supreme Court ruling, as a matter of compassion.\n\n\"Do you dispute that having a case named after you makes your infamy ... live forever?\" Sotomayor asked. \n\nSotomayor said that famous cases draw attention to the named plaintiffs who won or lost them.\n\n\"Is it the right thing to do?\" she pressed, over the prospect of forcing an unwilling plaintiff to continue with their case.\n\nHurst said the Supreme Court has already ruled in previous cases that, after a certain point in litigation, plaintiffs can't get their cases dismissed unless they show the underlying issue behind their case is unlikely to re-occur.\n\n\"There is a reasonable basis to doubt whether Hecox's current plans are the final plans,\" he said.\n\nCelebrities, parents and kids rally outside the Supreme Court\n\nElliot Page, a transgender actor, appeared outside the Supreme Court as the justices debated the state bans. But the crowd of protesters was also chock full of everyday people who felt passionately on both sides of the issue.\n\n“As a dad, watching my kids join and participate in sports and other activities was so fulfilling, knowing that they were enjoying the same positive experiences that I have, I cannot fathom how upsetting it would be to be told you can't participate, either as a kid or a parent,” said Neil Giles. “Our transgender and gender non−conforming kids deserve the same right to participate as every other kid.”\n\nAt an opposing rally, parents expressed concern that no matter how hard their daughters trained, transgender girls would have a biological advantage.\n\n“It's not fair and it's not lawful,” said Stacey Schieffelin of the America First Policy Initiative. “It deprives the opportunity for women to break records, win scholarships and become the true champions they deserve to be. It strips girls of privacy and threatens their physical safety, and it cuts straight through the heart of what Title IX was designed to do: protect young women.”\n\n2020 transgender discrimination case overshadows athletic case\n\nRoberts, the chief justice, signaled that he may view this case differently from one in 2020, when he joined the court’s liberals in ruling that transgender people cannot be discriminated against at work.\n\nThat 2020 case, called Bostock v Clayton County, Georgia, was about whether firing someone because they are transgender is discriminating on the basis of sex. Justice Neil Gorsuch, another conservative closely watched in the current case, wrote the earlier decision.\n\nRoberts asked whether a sex-based classification is necessarily a transgender classification.\n\nWest Virginia Solicitor General Michael Williams said the justices could uphold his state’s law banning transgender athletes while staying true to the 2020 ruling. Laws focused on someone’s biological sex are different from laws defining transgender students, Williams said. He argued the law should be upheld because a “biological boy identifying as a boy applies in the very same way as a biological boy identifying as a girl.”\n\nKavanaugh asked the Justice Department lawyer why Bostock doesn’t matter to the two latest cases.\n\nMooppan said the state law classifies on the basis of biological sex. “The person's gender identity is wholly irrelevant to how the law applies,” he said.\n\nBut Joshua Block, the lawyer for a transgender student, said arguing that Title IX protects only groups of people – rather than individuals – when sex is the reason for adverse treatment “takes a wrecking ball to the text of Title IX and the structure of this court's anti-discrimination precedents.”\n\nLawyer: The real issue is whether transgender athlete has an unfair advantage\n\nThe lawyer for transgender athlete Becky Pepper-Jackson in West Virginia said the justices should send the case back to U.S. District Court for a trial to determine whether she has an advantage over teammates or rivals who were identified as girls at birth.\n\nThe lawyer, Block, said Pepper-Jackson has received puberty-delaying medication and estrogen, so she has no physical advantage over her peers. Block said excluding her wouldn’t make the female teams safer or more fair, as the law’s defenders contend.\n\n“I really do want to make a pitch for resolving it based on the facts,” Block said. “Because, look, if they’re right about the facts, then we should lose.”","url":"https://eu.usatoday.com/story/news/politics/2026/01/13/supreme-court-transgender-athletes-sports/88163125007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/13/USAT/88164113007-usatsi-27994869.jpg?auto=webp&crop=5999,3375,x0,y312&format=pjpg&width=1200","video":null,"publish_date":"2026-01-13 23:12:32","author":"Usa Today","authors":["Usa Today"],"language":"en","source_country":"us","sentiment":0.054},{"id":392844122,"title":"Have plan to leave Iran without government help: US advises citizens amid protests","text":"The United States has issued an urgent advisory telling its citizens to leave Iran immediately, a day after issuing a similar warning, citing the risk of detention as protests across the country continue to escalate. Americans were also urged to have a plan to depart Iran that does not rely on US government assistance, as Washington has no diplomatic or consular presence in the country..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}.preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}In a notice released on Tuesday, the US virtual embassy in Tehran directed Americans to consider departing Iran by land to Turkiye or Armenia. It also warned US citizens not to travel to Afghanistan, Iraq, or the Pakistan-Iran border region.\"Have a plan for departing Iran that does not rely on US government help,\" the advisory read, noting that the US has currently no diplomatic or consular presence in the country. For those unable to leave immediately, the department advised sheltering in place. \"If you cannot leave, find a secure location within your residence or another safe building,\" the notice said.The warning also called on Americans to avoid demonstrations, keep a low profile and remain alert. \"Monitor local media for breaking news. Be prepared to adjust your plans,\" it said, while advising travellers to keep phones charged and use alternative communication methods if needed.The advisory carried particularly stark warnings for US-Iranian dual nationals. Iran does not recognise dual citizenship and treats dual nationals solely as Iranian citizens, the notice said.\"US nationals are at significant risk of questioning, arrest and detention in Iran,\" the advisory warned. \"Showing a US passport or demonstrating connections to the United States can be reason enough for Iranian authorities to detain someone.\"IRAN BLAMES US AND FOREIGN POWERSIran’s leadership has repeatedly blamed the US and other foreign powers for fuelling the unrest gripping the country. Tehran’s foreign ministry has accused Washington and Israel of interfering in Iran’s internal affairs, alleging that their statements and actions have encouraged and \"stoked\" violent protests.This comes as US President Donald Trump urged all Iranians to continue protesting and taking to the streets, assuring that help is on the way without providing further details, signing off with \"Make Iran Great Again (MIGA).\"With the death toll surpassing 2,400 in Iran, Trump described the protesters as “patriots” and urged them to take control of the institutions in a Truth Social post..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}- EndsWith inputs from agenciesPublished By: Satyam SinghPublished On: Jan 14, 2026Must Watch","url":"https://www.indiatoday.in/world/story/us-issues-urgent-advisory-americans-leave-iran-amid-protests-detention-risks-glbs-2851544-2026-01-14","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/iran-protests-131307273-16x9_0.png?VersionId=4NyAWNcRkw6n7NAlyGwa68gMRN.LC4uB?size=1280:720","video":null,"publish_date":"2026-01-13 23:10:52","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.216},{"id":392848768,"title":"Man arrested for driving U-Haul into Iran protesters in Los Angeles was released on $0 bail","text":"The man who was arrested for ramming protesters against the Islamic regime in Los Angeles was given a $0 bail and was released on his own recognizance.\n\n Iranian dissidents have organized one of the largest political demonstrations against the ruling regime and have been met with brutal state violence in response. Hundreds have been killed in the clashes, with some estimates reaching over 1,000 dead.\n\n'The demonstrators tore the signs off the truck and attacked the driver, who then drove toward a group of LAPD officers.'\n\nSupporters of the dissidents have protested in cities across the globe, but one group in Westwood was violently attacked by a man driving a U-Haul truck.\n\nVideo showed protesters attacking the man as police dragged him away from the scene. He was later identified as 48-year-old Calor Madanescht. Only minor injuries were reported from the incident.\n\nThe truck had signs on it indicating that Madanescht was opposed to the demonstration. One side read, \"No Shah,\" which refers to the ruling leader before the Islamic regime overthrew the Western-backed Shah.\n\nHowever, the FBI's Joint Terrorism Task Force is trying to determine whether he intentionally rammed the protesters or was reacting to being boxed in by the protest.\n\nHe was only charged with a misdemeanor count of reckless driving.\n\n\"Officers stopped the truck and directed the driver to turn around,\" reads a statement from the Los Angeles Police Dept. on Monday. \"The demonstrators tore the signs off the truck and attacked the driver, who then drove toward a group of LAPD officers.\"\n\nInvestigators said nothing significant was found inside the truck after it was impounded and searched.\n\nMadanescht was booked into the Los Angeles County Jail but was released on $0 bail. The Los Angeles City Attorney will review the case.\n\nRELATED: Trump has already reportedly approved attack on Iran but is giving the regime one last chance\n\nIranian and Middle East studies professor Ciruce Movahedi-Lankarani at USC told KABC-TV the man appeared to be opposed to both the Islamic regime as well as the previous Shah.\n\nHe went on to say that the regime's actions to cloud reporting on the demonstrations had made it difficult to ascertain how many people had been killed.\n\n\"It's difficult to know the scale and the size because the communications have been cut off, and that's by design, right?\" Movahedi-Lankarani said. \"The government doesn't want the news to be easily spread about what is happening there.\"\n\nOn Tuesday, President Donald Trump issued a statement of support for the anti-regime protesters and said that help was on the way. \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"The man who was arrested for ramming protesters against the Islamic regime in Los Angeles was given a $0 bail and was released on his own recognizance.\n\n Iranian dissidents have organized one of the largest political demonstrations against the ruling regime and have been met with brutal state violence in response. Hundreds have been killed in the clashes, with some estimates reaching over 1,000 dead.\n\n'The demonstrators tore the signs off the truck and attacked the driver, who then drove toward a group of LAPD officers.'\n\nSupporters of the dissidents have protested in cities across the globe, but one group in Westwood was violently attacked by a man driving a U-Haul truck.\n\nVideo showed protesters attacking the man as police dragged him away from the scene. He was later identified as 48-year-old Calor Madanescht. Only minor injuries were reported from the incident.\n\nThe truck had signs on it indicating that Madanescht was opposed to the demonstration. One side read, \"No Shah,\" which refers to the ruling leade","url":"https://www.theblaze.com/news/uhaul-truck-iran-protest-man","image":"https://www.theblaze.com/media-library/man-arrested-for-driving-u-haul-into-iran-protesters-in-los-angeles-was-released-on-0-bail.jpg?id=62726196&width=1200&height=600&coordinates=0%2C179%2C0%2C180","video":null,"publish_date":"2026-01-13 23:10:00","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","category":"politics","source_country":"US","sentiment":-0.532},{"id":392846586,"title":"Trump threatens to halt federal money next month not only to sanctuary cities but also their states - AP News","text":"President Donald Trump said Tuesday that starting Feb. 1 he will deny federal funding to any states that are home to local governments resisting his administration’s immigration policies, expanding on previous threats to cut off resources to the so-called sanctuary cities themselves.\n\nSuch an action could have far-reaching impacts across the U.S., potentially even in places that aren’t particularly friendly to noncitizens.\n\nTwo previous efforts by Trump to cut off some funding for sanctuary jurisdictions were shut down by courts.\n\nTrump unveiled the concept this time late in a speech Tuesday at the Detroit Economic Club, without offering specifics.\n\n“Starting Feb. 1, we’re not making any payments to sanctuary cities or states having sanctuary cities, because they do everything possible to protect criminals at the expense of American citizens and it breeds fraud and crime and all of the other problems that come,” he said. “So we’re not making any payment to anybody that supports sanctuary cities.”\n\nBack in Washington, Trump was asked by reporters what kind of funding would be affected on Feb 1: “You’ll see,” he said. “It’ll be significant.”\n\nThere is no strict definition for sanctuary policies or sanctuary cities, but the terms generally describe limited cooperation with Immigration and Customs Enforcement.\n\nCourts have rejected the idea before\n\nIn an executive orders last year, the president directed federal officials to withhold money from sanctuary jurisdictions that seek to shield people in the country illegally from deportation.\n\nA California-based federal judge struck it down despite government lawyers saying it was too early to stop the plan when no action had been taken and no specific conditions had been laid out.\n\nIn Trump’s first term in office, in 2017, courts struck down his effort to cut funding to the cities.\n\nSome of the details are tricky\n\nThe Justice Department last year published a list of three dozen states, cities and counties that it considers to be sanctuary jurisdictions.\n\nThe list is overwhelmingly made up of places where the governments are controlled by Democrats, including the states of California, Connecticut and New York, cities such as Boston and New York and counties including Baltimore County, Maryland, and Cook County, Illinois.\n\nThat list replaced an earlier, longer one that was met with pushback from officials who said it wasn’t clear why their jurisdictions were on it.\n\nThe administration has been threatening funding in specific places\n\nThe federal government has moved to halt funding for a variety of programs in recent weeks and is already facing legal challenges.\n\nThe U.S. Department of Agriculture has warned states that have refused to provide data on recipients of Supplemental Nutrition Assistance Program money that they’ll be docked administrative funds. A court fight over the request for information was already under way before the threat came. Money hasn’t been stopped yet.\n\nThe U.S. Department of Health and Social Services said last week that it was halting money from five Democratic-led states for daycare subsidies and other aid to low-income families with children over unspecified suspicions about fraud. A court put that on hold\n\nThe administration has tried to use additional financial pressure against Minnesota, a state where it has also sent a wave of federal officers in an immigration crackdown. The Agriculture Department has said it’s freezing funding in the state — but without laying out many details.\n\nThe Centers for Medicare and Medicaid Services also told Minnesota last week that it intends to withhold $515 million every three months from 14 Medicaid programs that were deemed “high risk” after rejecting a corrective action plan it demanded because of fraud allegations. The amount is equivalent to one-fourth of the federal money for those programs. State officials said Tuesday that they’re appealing.","summary":"Trump threatens to halt federal money next month not only to sanctuary cities but also their states  AP News","url":"https://apnews.com/article/trump-sanctuary-cities-states-federal-funding-f0bb01398d9d955a498170e7334ce14a","image":"https://dims.apnews.com/dims4/default/cc6037c/2147483647/strip/false/crop/5716x3811+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fcb%2Fb66fde74218547816cdddffd9d27%2F15233df2c5ab43218fc8f5d37b273604","video":null,"publish_date":"2026-01-13 23:09:00","author":"Geoff Mulvihill","authors":["Geoff Mulvihill"],"language":"en","category":"politics","source_country":"us","sentiment":-0.316},{"id":392842500,"title":"Trump Has Been Secretly Texting His Favorite Dem","text":"President Donald Trump has been trading texts with his favorite Democratic star, according to a new report.\n\nTrump, 79, and New York City Mayor Zohran Mamdani, 34, recently texted back and forth, two sources told Axios. It was unclear what they discussed, and the White House and Mayor’s Office did not immediately return a request for comment from the Daily Beast on Tuesday.\n\nTrump shocked his own allies when he met Mamdani with a warm welcome instead of a tense face-off. Fox News presented the meeting as a “showdown with socialism,” expecting a clash between the Republican president and the democratic socialist he had repeatedly blasted as a “communist,” but got thrown for a loop when Trump quickly got chummy with his newfound pal.\n\nWhen Mamdani walked into the Oval Office on Nov. 21, Trump remarked, “Wow, you are even better looking in person than you are on TV,” according to New York magazine. The president, who rose to fame as a high-flying New York socialite and TV personality, famously loves good looks and being associated with winners.\n\nAt one point, Trump even let Mamdani call him a “fascist” while playfully patting the mayor on the arm.\n\nThe day after their meeting, Trump stepped out in an unusually snazzy outfit featuring a burgundy scarf draped around his neck, sending social media abuzz with jokes about a supposed attempt to match Mamdani’s style.\n\nBut it appears things have changed since then. At the start of the year, Mamdani said he called Trump to voice his opposition to the U.S. raid that captured Venezuelan autocrat Nicolás Maduro. \n\nTrump told The New York Times last week that he was “surprised” by the criticism.\n\n“I thought it was awfully quick for him to be criticizing,” he said. “We’ve had numerous conversations. We get along great. I thought it was quick to be criticized. I thought he’d wait at least a month.”\n\nMore cracks in the wall appeared on Monday afternoon, when Trump ripped into New York City’s congestion pricing as a “DISASTER.”\n\n“It’s got to be ended, IMMEDIATELY! It’s never worked before, and it will never work now,” he wrote in a Truth Social post. “I love New York, and hate to see it being destroyed so rapidly with such obviously foolish ‘policy.’” \n\nEarly indicators have shown that pollution has dropped in parts of Manhattan and traffic has declined in the tolled zone after congestion pricing was introduced last January.\n\nTrump presented Mamdani with a new hurdle on Tuesday when he announced that he plans to cut off federal funding for sanctuary cities at the end of the month.","summary":"AFP via Getty ImagesPresident Donald Trump has been trading texts with his favorite Democratic star, according to a new report.\n\nTrump, 79, and New York City Mayor Zohran Mamdani, 34, recently texted back and forth, two sources told Axios. It was unclear what they discussed, and the White House and Mayor’s Office did not immediately return a request for comment from the Daily Beast on Tuesday.\n\nThe two began texting soon after they exchanged numbers at their Oval Office lovefest in November, the outlet reported. It’s unknown how frequently they’ve been messaging each other.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-has-been-secretly-texting-his-favorite-dem-zohran-mamdani/","image":"https://www.thedailybeast.com/resizer/v2/BYBOVTEEQ5H6FC4L54QGGKI3GA.jpg?smart=true&auth=100d21572258b6b0091bdcdccf62640ad8343ba5b6d0bba38e76f3c3415ce0d4&width=1440&height=1080","video":null,"publish_date":"2026-01-13 23:07:58","author":"Julia Ornedo","authors":["Julia Ornedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.118},{"id":392842480,"title":"Opinion: Aging Trump’s MAGA Agenda Means Gutting America’s Truly Great Past","text":"Donald Trump is trying to erase the 20th century.\n\nFor those of you too young to remember back that far, he is also going after what we’ve gone through in the past two and a half decades as well.\n\nIt is almost as if he wishes to reverse that rise.\n\nIn just the first weeks of this year, we have seen him attack the foundations of our international leadership. He has threatened to annex Greenland—to take arms against a NATO ally, if required, and thereby destroy the North Atlantic Alliance that has been one of the world’s most important stabilizing forces for nearly eighty years.\n\nHe has withdrawn the United States from 66 international organizations, further weakening the global order we have sought to maintain since the end of the Second World War. In so doing, he undermines vital initiatives with regard to culture, the environment and the spread of democracy.\n\nHe has also threatened our neighbors with U.S. “domination” of the region, a violation of all the principles that underpin hemispheric relations, not to mention the United Nations Charter, a binding treaty to which the U.S. was not only a signatory but the principal author.\n\nHe has announced further tariffs to go along with a sweeping assault on the international trading system (also a key product of post-war international economic policies). And should the Supreme Court decide that these tariffs were imposed illegally, the White House has promised to reintroduce them via other mechanisms, reverting to the protectionism of the prior century.\n\nIf there was one foundation of strength that helped underpin the rise of the U.S. as the richest and most powerful nation in the world, it was the faith placed in the U.S. dollar. That dates to the establishment of the U.S. Federal Reserve in 1913 as an independent central bank, an effort to provide stability following financial panics that had plagued the economy in prior years.\n\nTrump’s decision to turn the ill-named U.S. Department of Justice against Federal Reserve Chairman Jerome Powell is, then, the latest and most egregious effort to undo the Fed’s independence, and to turn it into a political weapon for the White House to wield—an approach that has resulted in monetary disaster in country after country that has tried this.\n\nIt was a move so unsettling that central bank governors from across the world spoke out in protest. Powell was moved to put out a video explaining precisely what was going on and why. It even produced the rarest of events: Peeps of criticism from the usually silent GOP ranks—even, reportedly, from Secretary of the Treasury Scott Bessent.\n\nOther great triumphs the United States brought into being during the 20th century included the defeat of fascist and other authoritarian threats targeting our way of life and the passage of legislation establishing and protecting fundamental civil rights for all Americans.\n\nThis year, meanwhile, has already seen a masked, rogue force of armed thugs acting on behalf of the president and his minions attack Americans in the streets. These attacks have been fatal, including the cold-blooded murder of 37-year-old mom Renee Nicole Good in Minneapolis. When asked if the lethal force was warranted, Trump replied that Good was being “disrespectful”—apparently asserting that protestors, exercising their First Amendment rights, could now get the death penalty for daring to be critical of his administration. \n\nIn further keeping with the actions of police states, the White House has again this week renewed its efforts to scrub key U.S. institutions of any thoughts or ideas that they conclude embody “improper ideologies,” targeting the Smithsonian Institution and the National Portrait Gallery.\n\nAt the same time, Secretary of Beer Pong Pete Hegseth held an event at SpaceX, a company owned by noted white supremacist sociopath Elon Musk. There, he announced that the Department of Defense will embrace AI usage—and Musk’s controversial Grok chatbot in particular—in the military that is is anti-woke and anti-DEI—code for racist, sexist and pro-MAGA. It’s precisely what Hitler or Stalin would have done with the technology had it existed in their day, seeking to ensure that the entire massive apparatus of their military would only be exposed to a worldview consistent with their own (and the cultists surrounding them).\n\nAnd that’s just the first two weeks of the year, ladies and gentlemen. (Events swirl faster the closer you get to the drain. If you don’t believe me, flush your toilet and see.)\n\nIn other words, don’t think the only way Trump is commemorating the 250th anniversary of the birth of this great country is with a wrestling match on the South Lawn of the White House. He is also working hard to erase our history. What better way for a country to feel young again than to pretend parts of its past and the progress of time didn’t take place? And to just look at those shiny gold things on the wall instead?","summary":"Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyDonald Trump is trying to erase the 20th century.\n\nFor those of you too young to remember back that far, he is also going after what we’ve gone through in the past two and a half decades as well.\n\nWith a thoroughness that is surprising for a man who barely seems to know where he is at any given moment, Trump is rapidly eliminating many of the United States’ most important accomplishments during the period that marked our rise as a superpower.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/aging-trumps-maga-agenda-means-gutting-americas-truly-great-past/","image":"https://www.thedailybeast.com/resizer/v2/QQVWR2E56RBJDJKZDEGTOQR5KM.jpg?smart=true&auth=bf04bcf4c3602b2a099da09f4e220c88e76cc5b86fb8a25396887e8a98f04008&width=1440&height=1080","video":null,"publish_date":"2026-01-13 23:05:53","author":"David Rothkopf","authors":["David Rothkopf"],"language":"en","category":"politics","source_country":"us","sentiment":0.227},{"id":392847850,"title":"Amazon holds talks with suppliers on pricing following tariff changes - Reuters","text":"Jan 13 (Reuters) - Tech giant Amazon (AMZN.O), opens new tab said on Tuesday it held discussions with some vendors about adjusting costs to reflect the reduction in tariff rates for Chinese imports.\n\nThe Financial Times reported earlier in the day that the company was seeking to cut what it pays suppliers for goods sold on its e-commerce platform, as it moves to reverse concessions intended to soften the impact of U.S. President Donald Trump's tariffs.\n\nAdvertisement · Scroll to continueReport Ad\n\n\"We're continually working with our broad, varied range of valued selling partners in our store to support them in adapting to the evolving environment while maintaining broad selection and low prices for customers,\" a company spokesperson told Reuters.\n\nIn late October last year, Trump agreed with President Xi Jinping to trim tariffs on imports from China in exchange for Beijing cracking down on the illicit fentanyl trade, resuming U.S. soybean purchases and maintaining rare earths exports flowing.\n\nThe current average U.S. tariffs on Chinese imports were lowered to about 47% from 57%.\n\nMeanwhile, the U.S. Supreme Court said last week that it would issue its next rulings on January 14 as several major cases remain pending, including the legality of Trump's sweeping global tariffs.\n\nAdvertisement · Scroll to continue\n\nThe administration faces the possibility of having to refund nearly $150 billion paid in tariffs to importers if the court declares that the sweeping duties Trump has imposed under the International Emergency Economic Powers Act are illegal.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV113601871 \nAbout ConnatixV113601871 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Pooja Menon and Puyaan Singh in Bengaluru; Editing by Alan Barona\n\nPurchase Licensing Rights","summary":"Amazon holds talks with suppliers on pricing following tariff changes  Reuters","url":"https://www.reuters.com/business/retail-consumer/amazon-pushes-suppliers-cuts-ahead-supreme-court-tariff-ruling-ft-reports-2026-01-13/","image":"https://www.reuters.com/resizer/v2/3MODNIUCZ5NGZGCLHBSSKM4NAM.jpg?auth=96de5d9874af2ad969356c3fe7ec8677a070845be7753947f953ea2f00a80fa2&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2026-01-13 23:01:59","author":"Pooja Menon,Puyaan Singh","authors":["Pooja Menon","Puyaan Singh"],"language":"en","source_country":"gb","sentiment":-0.49},{"id":392842420,"title":"Trump hurls abuse and shows middle finger to Ford worker who shouted ‘pedophile protector’","text":"President Donald Trump appeared to lash out at a worker who shouted pedophile protector during his visit to Ford Motor Company’s River Rouge complex in Dearborn, Michigan, on Tuesday, with video showing him seemingly responding with an expletive and the middle finger.Footage obtained by TMZ captured the moment as Trump toured the plant, pointing towards the person off camera before walking away and raising his middle finger.The visit took place hours before the president was due to speak at the Detroit Economic Club as part of his Michigan trip.While the man who shouted at Trump is not seen in the video, the insult is audible, though it is difficult to make out what else was said due to unclear audio.The outburst comes as Trump continues to face scrutiny over the handling of files linked to convicted sex offender Jeffrey Epstein, who died in jail in 2019.Trump was criticised last year after pushing back for months against releasing the Epstein files, despite earlier suggesting during the campaign that they would be made public if he returned to office.A bipartisan group of lawmakers pushed legislation to compel the Justice Department to release its Epstein-related files, and the bill ultimately passed with overwhelming support, prompting Trump to reverse course and back the effort.Despite that shift, the Justice Department has missed multiple deadlines, including a requirement to release the files with limited redactions by mid-December and provide further details to Congress about the redaction process.Trump’s relationship with Epstein has remained part of the public debate, after he was photographed with Epstein and Ghislaine Maxwell multiple times in the 1990s and early 2000s.Trump has denied wrongdoing and has not been accused by any Epstein survivors.","summary":"During a Michigan visit, President Trump appeared to react angrily to a heckler shouting an insult, with video showing him gesturing with an expletive and the middle finger. This incident occurs amid ongoing scrutiny over the handling of files related to convicted sex offender Jeffrey Epstein, a figure Trump has past associations with.","url":"https://timesofindia.indiatimes.com/world/us/trump-hurls-abuse-and-shows-middle-finger-to-ford-worker-who-shouted-pedophile-protector/articleshow/126515136.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126515135/126515135.jpg","video":null,"publish_date":"2026-01-13 23:01:03","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.425},{"id":392842504,"title":"Trump’s So Vein, This Doctor Knows What to Do","text":"Donald Trump wants to crush The Swamp. The leaks, the sneaks, and the secrets are all there. Our writers, David Gardner, Farrah Tomazin, and Sarah Ewall-Wice, are sifting through the ooze so you don’t have to. Don’t miss out.\n\nIn this week’s news from the ooze… Ted Cruz, Steven Cheung, JD Vance, Lew Olowski, Dr. Sanjiv Lakhanpal, John Ratcliffe, Nicklas Backstrom, Rupert Murdoch, Kevin Rudd, and Pete Hegseth.\n\nTrump’s Health Problems Help Make Ankles Great Again\n\nAs vein specialists gathered at the Marriott Marquis a few blocks from the White House, one of the field’s top doctors used the moment to issue some unsolicited lifestyle advice to the president. \n\nSpeaking exclusively to The Swamp, Dr. Sanjiv Lakhanpal, founder of the Center for Vein Restoration, suggested that Trump, 79, might want to rethink… well, most things.\n\nFirst, there are the compression socks, which Trump tried wearing briefly after the White House confirmed his chronic venous insufficiency diagnosis—and then ditched them. \n\n“I didn’t like them,” Trump told the Wall Street Journal in an interview this month. Lakhanpal’s response: patients don’t have to love them, but they improve circulation, reduce swelling and lower the risk of blood clots.","summary":"Photo Illustration by Eric Faison/The Daily Beast/Getty ImagesDonald Trump wants to crush The Swamp. The leaks, the sneaks, and the secrets are all there. Our writers, David Gardner, Farrah Tomazin, and Sarah Ewall-Wice, are sifting through the ooze so you don’t have to. Don’t miss out.\n\nIn this week’s news from the ooze… Ted Cruz, Steven Cheung, JD Vance, Lew Olowski, Dr. Sanjiv Lakhanpal, John Ratcliffe, Nicklas Backstrom, Rupert Murdoch, Kevin Rudd, and Pete Hegseth.\n\nTrump’s Health Problems Help Make Ankles Great AgainRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trumps-so-vein-this-doctor-knows-what-to-do/","image":"https://www.thedailybeast.com/resizer/v2/XONPMQMJCREJ7C76X5YUUQTKQ4.png?smart=true&auth=37cada3ec108a418658418411a75a4d904689148c81b0e718b570fa1d4ac66dc&width=1440&height=1080","video":null,"publish_date":"2026-01-13 23:00:19","author":"The Swamp","authors":["The Swamp"],"language":"en","category":"politics","source_country":"us","sentiment":-0.008}]}