{"offset":0,"number":50,"available":9866,"news":[{"id":325196744,"title":"China tariffs will push up US prices in coming weeks, manufacturers warn","text":"HONG KONG -- With U.S. President Donald Trump's latest China tariffs now set at 30%, more American businesses with manufacturing operations on the mainland are warning they will be forced to raise prices in the coming weeks as inventories dwindle and shipping costs surge.\n\nMichael Wieder, co-founder and president of Lalo, a maker of baby products such as highchairs and play kits for retailers including Target and Amazon.com, said he kept prices steady after Trump kicked off the latest round of trade tensions, but was facing pressure to switch gears.","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/China-tariffs-will-push-up-US-prices-in-coming-weeks-manufacturers-warn","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F6%2F9%2F2%2F2%2F49552296-1-eng-GB%2FAP22076072610835.jpg?width=1200&fit=cover&gravity=faces&d","video":null,"publish_date":"2025-05-27 01:20:36","author":null,"language":"en","category":"business","source_country":"jp","sentiment":-0.386},{"id":325195948,"title":"Tornado-ravaged voters in MAGA stronghold reveal glaring problem with Trump's 'America First'","text":"MAGA voters in a tornado-ravaged pocket of Mississippi have turned on Donald Trump after he failed to help them for months after deadly twisters tore up their town.\n\nLocals in rural Tylertown have said they have felt let down and abandoned by the current administration since the natural disaster caused carnage in March 2025. \n\nA violent EF4 tornado - with a wind speed of 166 to 200mph - hit close to the community on March 15, killing five people. \n\nAnother tornado of EF3 intensity - with wind speeds between 136 and 165 mph - pummeled the area just 30 minutes later, killing another person. \n\nThe wider southern Mississippi area was ravaged by almost 20 tornadoes in total over a one-week period, damaging thousands of homes and businesses. \n\nSeveral of the red-state residents said they haven't seen a single federal agent in the two months since, despite the widespread carnage. \n\n'I know President Trump said that \"America First, we're gonna help our American folks first,\" but we haven't seen the federal folks down here,' Tylertown resident Bobby McGinnis told PBS.\n\n'I don't know what you got to do or what you got to have to be able to be declared for a federal disaster area because this is pretty bad,' said another Tylertown local, Brian Lowery. \n\n'We can't help you because, whatever, we're waiting on a letter; we're waiting on somebody to sign his name. You know, all that. I'm just over it.'\n\nRepublican Mississippi Governor Tate Reeves applied for a federal disaster declaration from the government on April 1, but he has not received a response. \n\nGovernors for multiple other red states, including Arkansas and Missouri, have also appealed for federal funding in the wake of recent tornadoes and been rejected. \n\nA federal disaster declaration allows the Federal Emergency Management Agency (FEMA) to allocate more resources to help states and local governments cope with the aftermath of a major weather event. \n\nTrump, 78, pledged to dismantle FEMA within his first weeks in the White House back in January. \n\nHe claimed the agency was partisan and failed to give adequate aid to Republican states, arguing that emergency relief would be better handled at a local level. \n\nDavid Richardson took over as acting chief at FEMA after previous boss Cameron Hamilton was booted from the role a day after criticizing the president's plans to abolish the department.\n\nRichardson promptly threatened to 'run right over' any staff in his department who resist Trump's agenda.\n\n'Don't get in my way,' the former US marine told staffers, according to a recording of his speech obtained by CBS News. \n\n'I don't need the full title I just need the authority from the president,' Richardson continued from behind a presidential-style podium.\n\n'Obfuscation, delay, undermining. If you're one of those 20 percent of the people and you think those tactics and techniques are going to help you, they will not, because I will run right over you. I will achieve the president's intent.\n\n'I, and I alone in FEMA, speak for FEMA,' Richardson said. \n\nFEMA employees later described the speech to CBS as 'unhinged' and 'terrifying'.","summary":"MAGA voters in a tornado-ravaged towns have turned to Donald Trump for help after deadly twisters tore up their town.","url":"https://www.dailymail.co.uk/news/article-14751747/MAGA-voters-Mississippi-criticize-Trump-tornadoes.html","image":"https://i.dailymail.co.uk/1s/2025/05/27/01/98773563-0-image-m-16_1748304354074.jpg","video":null,"publish_date":"2025-05-27 01:05:54","author":"Editor,Laura Parnaby","authors":["Editor","Laura Parnaby"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.205},{"id":325196152,"title":"Stephen Glover: Trump's the last man on Earth with the moral right to lecture us. Yet he's the one backing free speech in Britain - while Keir Starmer remains silent","text":"There is a long standing convention that democratic leaders shouldn’t lecture other democratic leaders about how to run their countries.\n\nThat precept has been torn up by Donald Trump. The man who may be the most immoral and mendacious president in American history – which is saying something – has taken it upon himself to lecture the British Government about free speech.\n\nTrump has distinct authoritarian tendencies – witness his current assault on the independence of Harvard University and his almost complete disregard for the elected representatives of Congress. His championing of free speech is as egregious an example of rank hypocrisy as one is ever likely to find.\n\nHe’s partly right, of course, and that creates problems for those of us who resent any interference by a foreign leader and abominate Trump while believing that free speech is under attack in modern Britain.\n\nTrump’s latest hobbyhorse is the case of Lucy Connolly, who during the riots last August sent a nasty and incendiary tweet in which she wrote: ‘Mass deportations now, set fire to all the f***ing hotels full of the b******s for all I care’.\n\nAlthough she deleted the tweet quickly, it was viewed more than 310,000 times. Despite having no criminal record, and there being no evidence that her tweet had incited others to violence, Connolly was sentenced to 31 months in prison. Appeal Court judges declined to reduce that term last week.\n\nGiven her previous law-abiding record, and the lesser sentences often handed out to violent criminals, Lucy Connolly was undoubtedly treated very harshly. That said, for former Home Secretary Suella Braverman to describe her as ‘a political prisoner’ is over the top.\n\nThe White House is reportedly ‘monitoring’ the case, as though it has every right to question the rulings of British courts. This is only the latest evidence of the Trump administration, itself hardly the acme of probity, sticking its nose into our affairs.\n\nIn March it dispatched officials from the US Bureau of Democracy, Human Rights and Labour to London to ‘affirm the importance of freedom of expression in the UK and across Europe’. What presumption!\n\nThe American delegation held meetings with Foreign Office officials, and challenged Ofcom about the generally unexceptionable Online Safety Act, which is one of Donald Trump’s perennial beefs.\n\nIt also met five British pro-life activists over their censorship concerns. One of them was anti-abortion campaigner Livia Tossici-Bolt, who was recently found guilty of breaching a public spaces protection order outside a clinic in Bournemouth in March 2023, given a conditional discharge, and ordered to pay costs of £20,000.\n\nI was personally on her side since she was only holding a placard some distance from the clinic. But what business is it of officials from the United States to interfere?\n\nHow would Trump feel if British civil servants were to travel to Washington to investigate miscarriages of justice, some of which are much more serious than Dr Tossici-Bolt’s case?\n\nSuch meddling in our affairs would be annoying if Donald Trump were the Archangel Gabriel. It is unendurable given that he is as far from being such an embodiment of virtue as it’s possible to conceive.\n\nThis professed lover of liberty – egged on by Vice-President JD Vance, who claimed in a speech last February that free speech is ‘in retreat’ across Britain and the EU – encouraged a mob to storm Congress, the home of American democracy, little more than four years ago.\n\nPerhaps we should send a delegation to look into Trump’s new cryptocurrency business. At a $1.7 million-a-head dinner in Virginia last Thursday, the sitting President and his family are estimated to have netted $148 million (£109 million). Trump delivered some anodyne remarks. The fare was described as ‘worse than airline food’.\n\nHow can such a venal man put himself on a moral pedestal, and presume to keep tabs on free speech in this country? It is utterly preposterous, beyond satire. Even the novelist Anthony Trollope could not have imagined him.\n\nAnd yet some figures on the Right of British politics evidently think it is acceptable for him to pass judgment on our country. Suella Braverman rushed to Lucy Connolly’s defence without it occurring to her that Trump has no business to interfere.\n\nReform UK leader Nigel Farage, a close friend of Trump’s, claimed ‘our American Republican friends seem to care more about free speech in the United Kingdom than our own Government’. Just possibly, although I doubt it, but in any event why can’t they keep their views to themselves?\n\nPerhaps the silliest response came from someone I admire – Toby Young, director of the Free Speech Union. Without disclosing reservations about the US government monitoring human rights abuses in this country, he declared that ‘Britain is becoming the North Korea of the North Sea’. God preserve us.\n\nTrump is the last person on this planet with the moral right to tell us how to order our affairs. And yet, as I’ve said, that doesn’t mean all his misgivings are misplaced.\n\nFree speech in Britain is threatened, as Lord Young has correctly argued. A retired policeman was arrested and handcuffed in his own home by six police officers armed with batons and pepper spray after he had suggested a pro-Palestinian social media post was anti-Semitic.\n\nJulian Foulkes was detained by Kent Police. His electronic devices were seized, and officers described the books scattered around his home as ‘very Brexity’.\n\nThere are countless other cases that give cause for concern. As my colleague Boris Johnson recently pointed out, ‘the UK police are now making over 10,000 arrests every year for online comments, more than the police in Russia itself’.\n\nBut much as I criticise Sir Keir Starmer when he’s at fault, this state of affairs can’t be blamed on him alone. Julian Foulkes was arrested in November 2023, when the Tories were in power, and had been for more than 13 years.\n\nAccording to the Free Speech Union, there were 12,183 arrests over offensive posts on social media and other platforms in 2023, when Starmer didn’t yet have a toe in No 10.\n\nThe police have been gradually bearing down on free speech for years. The Tories let it happen, and Labour is making things worse. We can’t blame Sir Keir Starmer for creating a police state.\n\nNor should we expect him as a politician to involve himself in Lucy Connolly’s case – that is for judges – though he was wrong last August to say that he was expecting ‘substantive sentencing’ of rioters within days. That surely must have influenced the courts.\n\nWhat we should now object to is the Prime Minister’s smugness, and his pretence that free speech is safe in Britain. When JD Vance alleged in the Oval Office in February that it was threatened, Starmer replied: ‘We’ve had free speech for a very long time, it will last a long time, and we are very proud of that.’\n\nWe did have it once, but it’s increasingly in peril. Trump is the last man in the world who should be encouraged to say so. Sir Keir Starmer – the British Prime Minister – is the first. Yet he refuses to speak up.","summary":"There is a long standing convention that democratic leaders shouldn't lecture other democratic leaders about how to run their countries.","url":"https://www.dailymail.co.uk/debate/article-14751703/Stephen-Glover-Trumps-man-Earth-moral-right-lecture-hes-one-backing-free-speech-Britain-Keir-Starmer-remains-silent.html","image":"https://i.dailymail.co.uk/1s/2025/05/26/23/98772069-0-image-a-28_1748298992502.jpg","video":null,"publish_date":"2025-05-27 01:02:10","author":"Editor,Stephen Glover","authors":["Editor","Stephen Glover"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.082},{"id":325194644,"title":"Texas governor makes it 'crystal clear' only U.S. citizens can vote in state elections","text":"Texas Gov. Greg Abbott signed legislation on Monday which he said makes it \"crystal clear\" that only U.S. citizens are allowed to vote in elections in his state. \"I just signed off on a joint resolution to make it crystal clear under the Texas Constitution that if you are not a citizen of the United States of America, you are not allowed to vote in Texas,\" the governor said in a video posted to X. Texas State Senator Brian Birdwell, a Republican, introduced Senate Joint Resolution (SJR) 37 in January, and in the resolution, he proposed a constitutional amendment clarifying that voters in Texas elections must be citizens of the U.S. Prior to the resolution, the constitution prohibited people who are under the age of 18, along with those who were determined mentally incompetent by a court or who were convicted of a felony, from voting in elections. TRUMP SIGNS EXECUTIVE ORDER REQUIRING PROOF OF CITIZENSHIP IN FEDERAL ELECTIONS: 'AN HONOR TO SIGN THIS ONE' But the amendment proposes adding a line to the classes of people who \"shall not be allowed to vote\" in Texas, which reads, \"persons who are not citizens of the United States.\" Birdwell’s joint resolution was approved by the state senate in April, then by the state house in May. Abbott signed the joint resolution on Monday, but it still has one more step. In fact, Texas citizens will have the final say in November on whether the state constitution can be ratified to include the requirement in the state constitution. TRUMP'S EXECUTIVE ORDER ON VOTING BLOCKED BY FEDERAL JUDGE AMID FLURRY OF LEGAL SETBACKS Fox News Digital has reached out to Abbott’s and Birdwell’s offices for comment. Last month, a federal judge blocked an executive order signed by President Donald Trump that would require documentary proof of citizenship before being allowed to register to vote. Judge Colleen Kollar-Kotelly of the U.S. District Court for the District of Columbia handed down the order in response to lawsuits filed by three separate groups of plaintiffs over five different provisions in a March 25 Trump executive order relating to election integrity. While Kollar-Kotelly dismissed requests to block three of the provisions, requests to block two other provisions pertaining to a proof of citizenship requirement for voters were granted. JUDGE BLOCKS TRUMP ELECTION ORDER DESPITE OVERWHELMING AMERICAN SUPPORT FOR VOTER ID The first blocked provision sought to compel the Election Assistance Commission to amend standardized national voter registration forms to require documentary proof of citizenship. The second sought to require federal agencies offering voter registration to people on public assistance to \"assess\" the individual's citizenship status before doing so. \"Our Constitution entrusts Congress and the States — not the President — with the authority to regulate federal elections. Consistent with that allocation of power, Congress is currently debating legislation that would affect many of the changes the President purports to order,\" Kollar-Kotelly, a Clinton-appointee, wrote in her order. \"No statutory delegation of authority to the Executive Branch permits the President to short-circuit Congress’s deliberative process by executive order.\" CLICK HERE TO GET THE FOX NEWS APP Meanwhile, 25 states, including Texas, are considering some form of proof-of-citizenship legislation, according to the Voting Rights Lab, which is tracking such legislation. In total, 15 state constitutions have explicit prohibitions against non-citizen voting. Fox News Digital’s Alec Schemmel contributed to this report.","summary":"Texas Gov. Greg Abbott signed a resolution to amend the state constitution, ensuring only U.S. citizens can vote, pending voter approval in November.","url":"https://www.foxnews.com/politics/texas-governor-makes-crystal-clear-only-u-s-citizens-can-vote-state-elections","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/11/931/523/abbott.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 00:47:16","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"US","sentiment":-0.148},{"id":325194862,"title":"The EU signals willingness to fast-track trade talks with the US before a 50% tariff returns in July","text":"The European Union said Monday that it is accelerating trade negotiations with the US in a bid to avert a costly transatlantic trade war.\"They agreed both to fast-track the trade negotiations and to stay in close contact,\" Paula Pinho, a spokeswoman for the European Commission, said during a press conference a day after EU Commission President Ursula von der Leyen spoke with President Donald Trump over the phone.\"We are talking about, of course, the world's single largest and closest trading relations, so these negotiations are complex,\" Pinho added. \"With this call, there's now a new impetus for the negotiations.\"The comments from the EU came days after Trump criticized the bloc for dragging its feet and taking advantage of the US.Earlier last week, the US rejected a trade proposal sent by the EU Commission.In a Friday social media post, Trump warned he would slap a 50% tariff on EU goods. He said the 27-nation bloc has been \"very difficult to deal with\" and that trade negotiations were \"going nowhere.\" The tariffs were originally set to take effect on June 1.In response, the EU has also approved tariffs on $23.9 billion of US goods, including soybeans, poultry, motorcycles, and other farm products.After Sunday's call, Trump said he would delay the planned tariff hike on European goods by over a month, with July 9 as the new deadline.\"It was my privilege to do so,\" Trump said of the tariff delay on Truth Social on Sunday evening.More conversations seem to be taking place on the sidelines to de-escalate trade tensions.On Monday, Maros Sefcovic, the EU's chief trade negotiator, said on X that he had \"good calls\" with the secretary of commerce, Howard Lutnick, and ambassador Jamieson Greer. Sefcovic added that the EU was \"fully committed\" to reaching a trade deal by the July 9 deadline.The White House did not immediately respond to a request for comments.","summary":"The European Union said Monday that it will \"fast-track\" trade negotiations with the US as a new deadline looms.","url":"https://www.businessinsider.com/eu-signals-willingness-to-fast-track-trade-talks-with-us-2025-5","image":"https://i.insider.com/6835095bca50259add4d0929?width=1200&format=jpeg","video":null,"publish_date":"2025-05-27 00:43:54","author":"Katherine Li","authors":["Katherine Li"],"language":"en","source_country":"US","sentiment":-0.185},{"id":325194646,"title":"Sens Cruz, Lujan introduce bill to expedite permits for international bridges and ports of entry","text":"Sen. Ted Cruz, R-Texas, has put forth legislation amending the International Bridge Act of 1972 that would ​​expedite the presidential permitting process for all international bridges and land ports of entry. The bipartisan bill from Cruz and Sen. Ben Ray Lujan, D-N.M., will expand on legislation previously written by Cruz and passed into law that streamlined permits for international bridges in Eagle Pass, Laredo and Brownsville. The new bill will streamline all permits for international bridges and ports of entry for Mexico and Canada. TED CRUZ MOCKS ‘CRAZY TOWN’ DEMS, AS MARYLAND SENATOR GETS DEFENSIVE ABOUT ADVOCACY FOR ALLEGED MS-13 MEMBER In a news release, Cruz discussed how this new bill has been a top priority for him. \"This bill builds on and expands our success in securing presidential permits for four major international bridge projects in South Texas by streamlining the approval process for all future international bridges along the Texas–Mexico border,\" Cruz said in a news release. Cruz strongly urged his colleagues \"to pass this bill so it can be sent to the President for signature.\" BIPARTISAN SENATE BILL TARGETS BORDER HUMAN, DRUG TRAFFICKING WITH INNOVATIVE TECHNOLOGY Lujan said in a news release that he was proud to introduce bipartisan legislation that would deliver real investments to New Mexico. \"Ports of entry and international bridges are vital to the economic success of our border communities, supporting trade, business, and tourism,\" Lujan said. \"Yet, new border crossings are too often held up by the presidential permit process.\" Dr. Victor Treviño, Mayor of the City of Laredo, thanked both senators for putting this bipartisan bill together that strengthens the northern and southern border. \"This bill marks a critical step toward modernizing the development and expansion of cross-border infrastructure by bringing much-needed efficiency and predictability to the presidential permitting process—an essential reform for communities like Laredo, which continues to be on the front lines of international commerce as the #1 Port of Entry in the United States,\" Trevino said in a news release. Trevino also urged Congress to pass this bill so that President Donald Trump can sign it. CLICK HERE TO GET THE FOX NEWS APP The bill also includes a bar on future administrations from considering environmental documents, including documents created as part of the National Environmental Policy Act. Fox News Digital has reached out to Cruz’s office for comment.","summary":"Senators Ted Cruz, R-Texas, and Ben Ray Lujan, D-N.M., introduce bipartisan legislation to streamline the presidential permitting process for international bridges and ports of entry.","url":"https://www.foxnews.com/politics/sens-cruz-lujan-introduce-bill-expedite-permits-international-bridges-ports-entry","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/sen.-ted-cruz-sen-ben-lujan-international-bridge.png?ve=1&tl=1","video":null,"publish_date":"2025-05-27 00:34:01","author":"Nick Butler","authors":["Nick Butler"],"language":"en","category":"politics","source_country":"US","sentiment":0.585},{"id":325194076,"title":"Brett Favre shares post saying Netflix ‘going after’ him for being ‘an outspoken Trump supporter’","text":"Brett Favre appears to believe Netflix is out to get him due to his support of President Donald Trump.\n\nThe streaming service released its documentary on the Hall of Famer titled “Untold: The Fall of Favre.”\n\nThe documentary highlights the scandals of Favre allegedly sending inappropriate messages to a woman while playing for the New York Jets, and his alleged involvement in the Mississippi State welfare scandal.\n\n“Netflix is going after @BrettFavre for being an outspoken Trump supporter. We stand with Brett Favre,” the Hodge twins wrote.\n\nAnd wrote @SteveLovesAmmo, “Haven’t you ever noticed that these “scandals” seem to pop up (or again) every single time a famous individual vocally supports President Trump?… Brett has been under constant attack from the mainstream media and also now today, Netflix… Tonight, a new documentary premiers tonight on Netflix attempting to tarnish his name. \n\n“We all know that if he wasn’t a Conservative, this would not be happening right now. Was this a hit documentary because Donald Trump won the 2024 election? That has yet to be determined.With that being said, I support .@BrettFavre! One of the greats!”\n\nFavre didn’t comment on whether he agreed or disagreed with the posts but amplified the posts.\n\nWhile speaking at a Trump rally in October just before the election, Favre said it would be “insane” to vote for Kamala Harris.\n\n“We’ve already had President Trump once — we’ve already seen Kamala in action. We can compare, and we know which is better,” Favre said at the rally. “The definition of insanity is doing the same thing over and over and expecting different results. . . . It would be insane to give Kamala four more years in office. So it’s time to bench Kamala and put in the star quarterback.”\n\n“USA is a great country. But we all know this: Kamala broke it. Trump will fix it,” Favre added. “I have lived the American dream, but I want to make sure that future generations get to, as well. So remember this: Let’s make American great again.”\n\nFavre has long supported Trump, saying last year that the country was in a “better place” when he was president. He endorsed Trump in 2020 because of his stance on freedom of speech, gun rights and support for the military and police after a summer of racial unrest after the death of George Floyd.\n\nFox News’ Ryan Gaydos contributed to this report.","summary":"The streaming service released its documentary on the Hall of Famer titled \"Untold: The Fall of Favre.\"","url":"https://nypost.com/2025/05/26/sports/brett-favre-shares-post-saying-netflix-going-after-him-for-being-a-trump-supporter/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105376482.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-27 00:33:59","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.199},{"id":325196064,"title":"Trump eyes more cuts to Harvard grants","text":"WASHINGTON — President Donald Trump on Monday threatened to divert billions in grant dollars away from Harvard University and give those funds to trade schools across the U.S., escalating his clash with the elite institution.\n\n“I am considering taking Three Billion Dollars of Grant Money away from a very antisemitic Harvard, and giving it to TRADE SCHOOLS all across our land,” Trump said in a post on social media. “What a great investment that would be for the USA, and so badly needed!!!”\n\nHarvard did not immediately respond to a request for comment.\n\nThe Trump administration has already moved to freeze funding and block Harvard’s ability to enroll international students in an intensifying battle over what the president has cast as a failure by the Ivy League university and others to crack down on antisemitism. Harvard is the oldest and richest U.S. university with a $53 billion endowment.\n\nAdministration officials have been using that rationale to pressure schools to institute wide policy changes that university officials say infringe on free speech and their academic missions. Harvard has been front and center in Trump’s campaign, with the administration already suspending more than $2.6 billion in federal research money and saying the school won’t be able to receive new funding.\n\nThe government had demanded a series of changes as a condition of continuing its financial relationship with the university: It has to remake its governance, transform admissions and faculty hiring, which the administration has called discriminatory, as well as stop admitting international students who officials say are hostile to American values.\n\nThe administration has also said that Harvard should ensure more diverse viewpoints on a campus that it says leans too liberal. Harvard sued in April. The government has also moved to bar Harvard from enrolling foreign students, but the university won a temporary court order blocking the government from enforcing that ban.\n\nHomeland Security Secretary Kristi Noem said last week that Harvard’s responses to the government’s requests to provide information about misconduct by foreign students were insufficient.\n\nTo regain its program certification, Harvard was given 72 hours to provide six categories of information about foreign students over the past five years, including disciplinary records and video of those engaged in protests.\n\nHarvard still hasn’t turned over the information about foreign students, with Trump calling the university “very slow in the presentation of these documents.” The information is needed, Trump said in a second post on Monday, the Memorial Day holiday, to determine “how many radicalized lunatics, troublemakers all, should not be let back into our Country.”\n\nAt Harvard nearly 6,800 students — 27% of the entire student body — come from other countries, up from 19.6% in 2006, according to the university’s data.\n\nHarvard says its international population on campus is comprised of more than 10,000 people, which includes fellows or others coming for nondegree programs and their dependents.","summary":"President Donald Trump on Monday threatened to divert billions in grant dollars away from Harvard University and give those funds to trade schools across the U.S., escalating his clash with the elite institution.","url":"https://www.bostonherald.com/2025/05/26/trump-eyes-more-cuts-to-harvard-grants/","image":"https://www.bostonherald.com/wp-content/uploads/2025/05/AP25146652598726.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-27 00:31:06","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","category":"politics","source_country":"US","sentiment":-0.249},{"id":325193534,"title":"‘Whatever it takes,’ Fed chair defends universities, calls on Princeton students to save democracy in Trump swipe","text":"Federal Reserve Chair Jerome Powell launched a thinly veiled rebuke to President Donald Trump on Sunday as he called on students in a speech at a Princeton University pre-graduation baccalaureate ceremony to save democracy.\n\nPowell implored the students to see the value in public service, and to do \"whatever it takes\" to defend democracy as they pursue their careers.\n\n“As you navigate the world of bright possibilities that awaits you, I urge you to take on the challenge and the opportunity to serve your fellow citizens,” Powell said. “Fifty years from now, you will want to be able to look in the mirror and know that you did what you thought was right, in every part of your life.”\n\nHe reminded the students that \"at the end of the day, your integrity is all you have,\" and that they should \"guard it carefully.\"\n\nPowell spoke just days after the U.S. Supreme Court signaled its protection of officials of the nation’s central bank from Donald Trump, even though the president has often threatened to fire Powell because the Federal Reserve chairman has not lowered interest rates as Trump has pressed him to do.\n\nThe court last Thursday let stand the recent firings of other federal agency heads by the Trump administration, pending legal arguments. But the central bank, the top court added, “is a uniquely structured, quasi-private entity that follows in [a] distinct historical tradition.”\n\nPowell’s speech also heaped praise on the nation's universities at a time when the Trump administration is slashing funding to Harvard University for refusing to acquiesce to his policy goals and ideological positions.\n\nPowell called U.S. universities the \"envy of the world and a crucial national asset,\" and warned that higher learning institutions were under threat, though he never mentioned Trump’s name.\n\nHe charged the almost-graduates with using their careers to \"preserve and strengthen\" the nation's democracy.\n\n“When you look back ... you will want to know that you have done whatever it takes to preserve and strengthen our democracy, and bring us ever closer to the Founders’ timeless ideals,” he said.\n\nPowell graduated from Princeton in 1975 with a degree in political science, which he joked to the students was the \"wrong degree\" considering where he ended up.\n\n\"I had brushed off my parents' one academic suggestion, which was to major in economics, which struck me as boring and useless,\" Powell said. \"After 13 years at the Fed, I admit I was wrong about that!\"\n\nTrump has personally attacked Powell on several occasions after the Federal Reserve chair refused to lower interest rates at a pace the president deems appropriate. The president has called him a \"fool\" and a \"major loser,\" and has both threatened to fire him while also walking back his threats, insisting he never considered firing Powell. Trump said earlier this month that talking to Powell is like talking to “a wall.”\n\nThe Federal Reserve chair has mostly stayed quiet in the face of Trump's threats, though he has noted he would not step down if Trump asked because it’s \"not permitted under the law” for the president to fire him.\n\nTrump has accused the Fed of refusing to cut rates as a way to make his economy look troubled and help the Democrats. But Fed officials have insisted they're keeping rates on hold due to uncertainty surrounding Trump's tariffs. Powell has predicted that the president’s tariffs will spike inflation and slow the economy.\n\nPrinceton University’s graduation ceremony is Tuesday May 27.","url":"https://uk.news.yahoo.com/whatever-takes-fed-chair-defends-002857639.html","image":"https://media.zenfs.com/en/the_independent_577/4f58895f359af4aa3751cac9dfafb0cc","video":"","publish_date":"2025-05-27 00:28:57","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.38},{"id":325194086,"title":"Jake Tapper admits Democratic cover-up of Biden’s cognitive decline may be ‘worse than Watergate’","text":"The cover-up of former President Joe Biden’s mental decline might be a bigger scandal than Watergate, CNN host Jake Tapper acknowledged Monday. \n\nTapper, the co-author of a new book detailing Democratic efforts to hide Biden’s deteriorating health from the public during his 2024 re-election campaign, was asked by Piers Morgan why he concluded in the book – “Original Sin” – that the efforts to prop up the octogenarian former president were not akin to the 1972 burglary at the Democratic National Committee headquarters that eventually forced Richard Nixon to resign. \n\n“Joe Biden is not Richard Nixon, and the hiding and cover-up of his deterioration is not Watergate.’ I am not entirely sure I agree, Jake, with that conclusion,” Morgan, host of “Piers Morgan Uncensored,” told Tapper, quoting from his book. \n\nThe CNN host noted that he considers the Biden health cover-up “an entirely separate scandal” from Watergate but “a scandal” nonetheless. \n\n“It is a scandal. It is without question – and maybe even worse than Watergate in some ways,” Tapper admitted, adding, “Because Richard Nixon was in control of his faculties when he was not drinking.” \n\nTapper insisted that he and “Original Sin” co-author Alex Thompson didn’t “mean to exonerate” by concluding the Biden scandal was “not Watergate.” \n\n“The only reason that we have the Watergate thing in there is because we quote Archibald Cox, who was a Watergate investigator, talking about how powerful the presidency is and how presidents get surrounded by people who have a vested interest in keeping that president propped up.” \n\n“This is an entirely separate scandal,” Tapper reiterated. “Maybe even worse … maybe even worse.” \n\nWhile promoting his book, the CNN host has drawn criticism over his past coverage of Biden, including accusations that he insufficiently reported on the former president’s health concerns during his term. \n\n“I think some of the criticism is fair, to be honest,” Tapper told CNN earlier this month.\n\n“Of me, certainly. I’m not going to speak for anybody else, but knowing then what I know now, I look back at my coverage during the Biden years — and I did cover some of these issues, but not enough,” he added. “I look back on it with humility.”\n\nAsked point blank by Morgan if he owed the American people an apology, Tapper responded: “I feel like I owe the American people an acknowledgement that I wish I had covered the story better.”\n\nIn their book, released last week, Tapper and Thompson chronicle Biden’s mounting health struggles during his term in the White House and his inner circle’s attempt to cover up the decline and get him re-elected.\n\nThe authors detail how Biden apparently didn’t recognize actor and Democratic supporter George Clooney — in an incident that left the Hollywood star “shaken to his core – and recall how aides seriously considered putting the president in a wheelchair and took steps to ensure he didn’t fall in public.\n\nBiden ended his run for re-election about a month after his disastrous June 2024 debate performance against Donald Trump.","summary":"“It is a scandal. It is without question – and maybe even worse than Watergate in some ways,” Tapper admitted. “Because Richard Nixon was in control of his faculties when he was not drinking.” ","url":"https://nypost.com/2025/05/26/us-news/jake-tapper-admits-democratic-cover-up-of-bidens-cognitive-decline-may-be-worse-than-watergate/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/jake-tapper-admits-democratic-cover-105372422.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/o5DeVDBU-RyIcpnTz.mp4","publish_date":"2025-05-27 00:26:29","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.267},{"id":325191316,"title":"Pertimbang misi ketenteraan dan kemanusiaan PBB, OIC lindungi Gaza","text":"KETIKA tentera Israel sedang rakus mengebom bumi Gaza, Presiden Amerika Syarikat (AS), Donald Trump mengkritik Presiden Russia, Vladimir Putin kerana memperhebat serangan dron ke Ukraine dan mengakibatkan belasan nyawa terkorban dalam tempoh 48 jam.\n\n Difahamkan, lebih 13,000 orang awam di Ukraine dilaporkan terkorban akibat perang Russia-Ukraine sejak Februari 2022, menurut Pejabat Pesuruhjaya Tinggi Hak Asasi Manusia Pertubuhan Bangsa-bangsa Bersatu (OHCHR).\n\n Sementara itu, di rantau tidak jauh dari bumi Ukraine, lebih 50,000 rakyat awam Gaza majoritinya wanita dan kanak-kanak, terbunuh akibat serangan tentera Israel, Bangunan awam seperti hospital, sekolah, masjid dan pusat pelarian dibom tanpa henti. Namun, dunia masih memilih untuk bersidang, berforum dan berunding untuk menyelesaikan perang berat sebelah di Gaza.\n\n Sejak Oktober 2023 serangan di Gaza bermula, jelas sekali forum, rundingan dan kecaman tidak mampu menghentikan Israel terus mengganas di wilayah itu. Rejim Zionis tidak pernah tunduk tekanan antarabangsa.\n\n Israel pula mendakwa serangan dilancarkan kerana hendak memburu pejuang Hamas namun bukti lapangan menunjukkan sebaliknya. Serangan Israel jelas menyasarkan seluruh populasi Gaza secara sistematik. Ini bukan operasi ketenteraan terhadap kumpulan bersenjata sebaliknya genosid kolektif terhadap seluruh rakyat Palestin.\n\n Walaupun terdapat tekanan dan kritikan dari Barat termasuk negara Kesatuan Eropah (EU), ia belum mencukupi untuk menghentikan keganasan tentera Israel. \n\n Terbaharu, Menteri Luar Sepanyol, Jose Manuel Albares, berkata perang di Gaza perlu dihentikan segera. Beliau menegaskan bantuan kemanusiaan perlu dibenarkan masuk ke Gaza tanpa syarat dan bebas daripada kawalan tentera Israel. Sepanyol turut menggesa sekatan senjata terhadap Israel kerana rejim itu dilaporkan mahu melipatgandakan serangan di Gaza.\n\n Jelas di sini, meskipun memegang mandat undang-undang antarabangsa, Pertubuhan Bangsa-bangsa Bersatu (PBB) lumpuh dek kuasa veto. Pertubuhan Kerjasama Islam (OIC) pula terus terperangkap dalam kitaran resolusi tanpa tindakan. \n\n Seperti sudah tiada badan rasmi antarabangsa yang mampu bertindak, mengawal dan menghalang tentera Israel daripada terus mengebom Gaza sehingga menjadi 'padang jarak, padang tekukur'. \n\n Maka, tiba masanya dunia mempertimbangkan misi ketenteraan kemanusiaan di bawah panji PBB dan OIC untuk melindungi Gaza. Syor ini bukan bertujuan mewujudkan ketumbukan ketenteraan agresif, tetapi sebagai langkah mewujudkan pasukan pertahanan bagi melindungi Gaza dan rakyatnya daripada kezaliman Israel.\n\n Tanpa sebarang tindakan ketenteraan, dunia sebenarnya 'merestui' keganasan Israel di Gaza walaupun banyak negara menentang secara berhemah. Cukuplah dunia berforum dan berunding dalam mendepani isu di Gaza. \n\n ASEAN juga tidak boleh berdiam diri terhadap krisis global seperti kekejaman dan penindasan berterusan rejim Zionis di Gaza. Krisis di Gaza bukan isu Asia Barat semata-mata, sebaliknya isu kemanusiaan sejagat. Malaysia, ASEAN dan OIC boleh mendesak PBB dan dunia untuk menyokong penyelesaian lebih berani dan bermakna di Gaza.","summary":"KETIKA tentera Israel sedang rakus mengebom bumi Gaza, Presiden Amerika Syarikat (AS), Donald Trump mengkritik Presiden Russia, Vladimir Putin kerana memperhebat serangan dron ke Ukraine dan mengakibatkan belasan nyawa terkorban dalam tempoh 48 jam.","url":"https://www.bharian.com.my/berita/nasional/2025/05/1400977/pertimbang-misi-ketenteraan-dan-kemanusiaan-pbb-oic-lindungi-gaza","image":"https://assets.bharian.com.my/images/articles/pertimbang_BHfield_image_listing_featured.var_1748304731.jpg","video":null,"publish_date":"2025-05-27 00:12:17","author":null,"language":"en","source_country":"my","sentiment":0.086},{"id":325190472,"title":"AU Day: ‘It was sad to see Ramaphosa being scolded by Trump’","text":"The Acting Director-General of the National Road Safety Authority (NRSA) and member of the National Democratic Congress (NDC) legal team, Abraham Amaliba, has expressed disappointment in South African President Cyril Ramaphosa over his visit to the Oval Office to meet US President Donald Trump concerning the controversial genocide issue in South Africa.\n\nIn an exclusive interview with GhanaWeb on May 26, 2025, marking African Union Day, celebrated on May 25, Amaliba described the situation as “embarrassing and sad.”\n\nThe politician and legal practitioner noted that he is unconvinced African leaders have done enough to realise the vision of the AU’s founding fathers.\n\n“I’m not sure that our transition from the OAU to AU has changed anything significantly. We don’t have Africans acting independently in dealings with foreign partners such as the Bretton Woods institutions and countries from the Global North,” he said.\n\nAmaliba lamented what he sees as a departure from the principles laid down by the AU’s forebears.\n\n“I think that if we had adhered to what our forefathers said, particularly Julius Nyerere and Dr. Kwame Nkrumah, to speak with one voice, the world would have taken Africa more seriously. As we speak, I’m afraid I am not convinced that African leaders are making meaningful progress toward African unity,” he said.\n\nHe cited the appeal of figures like Burkina Faso’s Ibrahim Traoré and South Africa’s Julius Malema among African youth as indicative of dissatisfaction with the current crop of leaders.\n\n“The reason why you see the youth of Africa gravitating towards leaders like Ibrahim Traoré and Julius Malema is because they tend to speak in a way the youth expect our leaders to speak. It was sad to see Ramaphosa in the Oval Office being virtually scolded by Trump, I was sad as an African,” he added.\n\nAmaliba stressed the need for African leaders to take bold and decisive steps toward the continent’s development.\n\n“We need to do more as Africans and as African politicians,” he emphasised.\n\nHis comments follow a speech by President John Mahama on AU Day. President Mahama, who currently serves as the AU’s Champion for Reparations, reaffirmed his commitment to working with African leaders and stakeholders to achieve lasting progress.\n\nIn his Africa Day 2025 message, President Mahama stated, “The AU has declared 2025 as the Year for Justice for Africans and People of African Descent through Reparations. As the AU Champion for this critical cause, I am deeply committed to working with you all to achieve this objective.”\n\nThe African Union has designated 2025 as the Year of ‘Justice for Africans and People of African Descent Through Reparations’, a theme aimed at generating momentum across the continent for reparations, driving AU-wide engagement, and supporting the implementation of reparations for historical injustices, including transatlantic slavery, colonialism, and apartheid.\n\nMeanwhile, catch up on the concluding part of the story of Fort William, where children were sold in exchange for kitchenware, others, below","summary":"Abraham Amaliba, the Acting Director General of the (NRSA) The Acting Director-General of the National Road Safety Authority (NRSA) and member of the National Democratic Congress (NDC) legal team, Abraham Amaliba, has expressed disappointment in South African President Cyril Ramaphosa over his visit to the Oval Office to meet US President Donald Trump concerning the [&#8230;]\n\n\nThe post AU Day: &#8216;It was sad to see Ramaphosa being scolded by Trump&#8217; appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/05/27/au-day-it-was-sad-to-see-ramaphosa-being-scolded-by-trump-2/","image":"https://cdn.ghanaweb.com/imagelib/pics/181/18117549.295.jpg","video":null,"publish_date":"2025-05-27 00:08:06","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.065},{"id":325194562,"title":"SE Asian Leaders Meet China's Li And Gulf States To Bolster Ties","text":"Southeast Asian leaders are looking to insulate their trade-dependent economies from geopolitical uncertainty, in particular US tariffs, as they hold talks with Chinese Premier Li Qiang and Gulf state dignitaries in Kuala Lumpur on Tuesday.US President Donald Trump blew up global trade norms in April when he announced a slew of punishing levies targeting countries around the world, including US allies. Though he subsequently instigated a 90-day pause for most, the experience has spurred the Association of Southeast Asian Nations (ASEAN) to accelerate efforts to diversify its trading networks.\"A transition in the geopolitical order is underway,\" Malaysian Prime Minister Anwar Ibrahim said in written remarks Monday. After a lavish gala dinner the night before, Tuesday marks the inaugural summit between ASEAN, China and the Gulf Cooperation Council (GCC) -- a regional bloc made up of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates. The meeting shows \"the successful reshaping of the matrix of partnership that speaks to today's multipolar reality\", Anwar said.ASEAN has traditionally served as \"a middleman of sorts\" between developed economies like the United States, and China, said Chong Ja Ian from the National University of Singapore (NUS). \"Given the uncertainty and unpredictability associated with economic relations with the United States, ASEAN member states are looking to diversify,\" he said. \"Facilitating exchanges between the Gulf and People's Republic of China is one aspect of this diversification.\"Malaysia, which holds ASEAN's rotating chairmanship and opened the bloc's 46th summit on Monday, is the main force behind the initiative, he said. Beijing, which has suffered the brunt of Trump's tariffs, is also looking to shore up its other markets. Its foreign ministry said Monday it \"look(ed) forward to strengthening cooperation\" with ASEAN and the GCC.China and ASEAN are already each other's largest trading partners, and Chinese exports to Thailand, Indonesia and Vietnam surged by double digits in April -- attributed to a re-routing of US-bound goods.Premier Li's participation is \"both timely and calculated\", Khoo Ying Hooi from the University of Malaya told AFP. \"China sees an opportunity here to reinforce its image as a reliable economic partner, especially in the face of Western decoupling efforts.\"Beijing and Washington engaged in an escalating flurry of tit-for-tat levies until a meeting in Switzerland saw an agreement to slash them for 90 days. Chinese goods still face higher tariffs than most though. According to a draft statement seen by AFP, ASEAN will express \"deep concern... over the imposition of unilateral tariff measures\". But it said earlier this year it would not impose retaliatory duties.The bloc \"is unlikely to formally endorse a pro-China position on US tariffs\", said Khoo.\"Li's presence is less about coercion and more about shaping long-term narratives and partnerships,\" she said. ASEAN as a body has historically avoided choosing a side between the United States and China. China is only Southeast Asia's fourth largest source of foreign direct investment, after the United States, Japan, and the European Union, noted NUS' Chong. Anwar said Monday he had written to request an ASEAN-US summit this year, with his foreign minister saying Washington had not yet responded. Yet any closer alignment with Beijing presents problems of its own, despite Anwar's insistence Monday night that \"whatever is being said... we are here as a friend of China\". On Monday, Philippines leader Ferdinand Marcos said there was an \"urgent need\" to adopt a legally binding code of conduct in the South China Sea. Beijing has territorial disputes with five ASEAN member states in the area, with China and the Philippines having engaged in months of confrontations in the contested waters.\"Other disputants... are perhaps willing to let the Philippines bear the brunt of pressure,\" said NUS' Chong. However, tension between Manila and Beijing \"means that these issues will not fade into the background, much as some other Southeast Asian states wish to focus on economic issues\".","summary":"Southeast Asian leaders are looking to insulate their trade-dependent economies from geopolitical uncertainty, in particular US tariffs, as they hold talks with Chinese Premier Li Qiang and Gulf state dignitaries in Kuala Lumpur on Tuesday.","url":"https://www.ibtimes.com/se-asian-leaders-meet-chinas-li-gulf-states-bolster-ties-3774538","image":"https://d.ibtimes.com/en/full/4602904/chinese-premier-li-qiang-l-attended-asean-gala-dinner-monday-alongside-malaysian-prime.jpg","video":null,"publish_date":"2025-05-27 00:06:15","author":"Rebecca Bailey And Isabelle Leong","authors":["Rebecca Bailey And Isabelle Leong"],"language":"en","source_country":"US","sentiment":0.409},{"id":325193056,"title":"Trump’s Recent Rift with Billionaire Tech Mogul Following Musk Feud – How It Might Affect Your Finances","text":"President Donald Trump’s friendship with the head of Apple has recently devolved following First Buddy Elon Musk’s White House departure – and the fallout could put iPhones prices through the roof. \n\nTrump issued a blistering criticism of Apple CEO Tim Cook during his recent trip to the Middle East. The president then followed up with a threat to impose tariffs on all iPhones built outside the US. \n\nThe move was more shocking because Cook has long been considered tech’s ‘Trump whisperer.’ \n\nThe apparent disintegration of their friendship comes on the heels of a high-profile bust-up with Amazon founder Jeff Bezos and mounting reports that the friendship between Trump and Musk has fizzled. \n\nCook reportedly drew the president’s ire last week when he refused an invitation to join Trump in the Middle East, the New York Times claimed.\n\nDuring his time in Qatar, Trump publicly admitted he ‘had a little problem with Tim Cook.’\n\nHe praised Apple’s investment into the United States before revealing he told Cook: ‘Now I hear you’re building all over India. I don’t want you building in India.’\n\nAnd during a speech in Riyadh, Saudi Arabia, Trump took a separate shot at Cook.\n\nPraising Nvidia chief executive Jensen Huang for traveling with the White House delegation, Trump said: ‘I mean, Tim Cook isn’t here but you are.’\n\nDays later, Trump posted out a blast on Truth Social which caught even some of his own administration by surprise.\n\n‘I have long ago informed Tim Cook of Apple that I expect their iPhone’s that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,’ he wrote.\n\n‘If that is not the case, a Tariff of at least 25% must be paid by Apple to the U.S. Thank your for your attention to this matter!’\n\n‘If they’re going to sell it in America, I want it to be built in the United States,’ Mr. Trump said on Friday. ‘They’re able to do that.’ \n\nThe tariff revelation once again sent the stock market into a tailspin amid concerns about what it would mean for the broader economy. If it goes ahead, the price of iPhones and Apple products made abroad could skyrocket.\n\nTrump said the tariff would apply to ‘anybody that makes the product,’ including Samsung, and would begin ‘by the end of June.’\n\nIt marked a significant shift in the pair’s relationship. In 2019, Trump described Cook as a ‘great executive, because he calls me and others don’t.’ \n\nApple had vowed to pour $500billion into the United States over the next four years in an effort to placate Trump despite not building their phones domestically.\n\nSimilarly, Cook said Apple would source 19 billion chips from the US and begin making AI servers in Houston.\n\nBack in 2017, Cook said while the company would love to make more of its product in the United States, China simply had better skilled workers and more engineers.\n\nJust last month in April, Trump spared iPhone, laptops and other electronics from his brutal 125 percent China tariffs.\n\nThe list of spared items includes smartphones, laptop computers, hard drives, memory chips and processors – all tech essentials that are rarely made in the United States. \n\nExperts warned it would take years to ramp up domestic production, if it happens at all. More than 80 percent of all Apple products are made in China — including a staggering 80 percent of iPads and over half of all Mac computers, according to data from Evercore ISI.\n\nIn the days following Trump’s tariff announcement, Apple saw $640 billion wiped from its market value.\n\nAnalysts warn that relocating iPhone production to the U.S. would be a monumental task, both logistically and financially. \n\nBank of America Securities analyst Wamsi Mohan previously estimated that producing the iPhone 16 Pro Max domestically could increase its price by 91 percent, pushing it from $1,199 to approximately $2,300.\n\nWedbush Securities analyst Dan Ives also suggested the cost could soar even higher, potentially reaching $3,500 per unit. \n\nThe challenges stem from higher labor costs in the U.S. — around $200 per unit compared to $40 in China — and the lack of a skilled workforce for specialized manufacturing tasks. \n\nApple CEO Tim Cook has previously highlighted the scarcity of qualified tooling engineers in the U.S., noting that while China boasts a vast pool of such talent, the U.S. has a significant shortfall. \n\nIn response to the escalating tariffs, Apple has taken swift action to mitigate potential disruptions. \n\nThe company chartered flights to expedite the shipment of approximately 1.5 million iPhones from India to the U.S., aiming to preempt the impact of the tariffs. \n\nTrump’s former First Buddy Elon Musk was among outspoken critics of Trump’s tariff agenda. In April, he said he would like to see ‘zero tariffs’ between certain nations, including Europe and the United States, for the financial betterment of citizens.\n\nMusk personally lost billions of dollars during the subsequent market crash.\n\nAnd while Trump did ultimately negotiate with many nations as well as implement a sweeping tariff freeze, Musk’s sway in the White House has significantly diminished amid whispers that he and Trump are no longer as chummy as they once were.\n\nMusk revealed during the Qatar Economic Forum that he was moving away from politics and political spending.\n\n‘In terms of political spending, I’m going to do a lot less in the future,’ he said at the Qatar Economic Forum.\n\n‘I think I’ve done enough,’ he added, sparking laughter in the audience.\n\nA person familiar with Musk’s activities did not rule out the billionaire getting financially engaged in the congressional midterms, but suggested he was dialing it back.\n\n‘Hard to say if he will do the same sort of thing like putting everything on pause to do rallies,’ the source said.\n\nPresident Trump has noticeably turned his attention away from Musk, sending him fewer messages of support on his social media account in recent weeks.\n\nTrump did not mention Musk in any of his Truth Social posts in April or May, according to a Politico analysis of his posts. That’s a steep decline from when he first took office and was constantly posting about DOGE and Musk’s accomplishments.\n\nMusk’s posts on X also appear to be veering away from politics and more toward his projects.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump&#8217;s friendship with the head of Apple has recently devolved  following&#8230;\n\n\nThis Post: Trump&#8217;s Recent Rift with Billionaire Tech Mogul Following Musk Feud &#8211; How It Might Affect Your Finances first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-news/trumps-recent-rift-with-billionaire-tech-mogul-following-musk-feud-how-it-might-affect-your-finances/","image":"https://internewscast.com/wp-content/uploads/2025/05/rewrite-this-title-Trump-latest-fallout-with-billionaire-tech-mogul.jpg","video":null,"publish_date":"2025-05-27 00:05:11","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.143},{"id":325193680,"title":"3 Monster Stocks to Hold for the Next 10 Years","text":"Most investors are best served by owning high-quality \"forever\" stocks, even if these stocks are only apt to produce average returns.\n\nEvery now and then, though, there's good reason to take a shot on a higher-risk ticker with a ton of upside potential. The key is just identifying the right -- even if temporary -- growth opportunity.\n\nTo this end, here's a rundown of three stocks with the potential to produce monster-sized gains over the course of the coming 10 years thanks to recent technological and sociocultural developments. There are still gains to be made past that point to be sure, but the hottest part of the underlying opportunities should be cooling off by then.\n\nIntuitive Machines\n\nAfter a 53-year hiatus, mankind is going back to the moon. As of its most recent plans, NASA intends to land astronauts on the moon again sometime in 2027. These missions are going to be considerably more complex than the Apollo landings in the late 1960s and early 1970s, however. This time around we're going to do far more than merely go there and come back. The next missions are ultimately laying the groundwork for future mining, scientific development, and perhaps even colonization. And NASA's using new technologies to ensure the agency gets the very most out of these expensive trips.\n\nEnter Intuitive Machines (LUNR -0.92%).\n\nIn simplest terms, Intuitive Machines makes a great deal of the tech that will make the upcoming moon missions a success. Cargo landers, on-surface transportation drones, and in-orbit payload transfer solutions are all in its wheelhouse. It's also developing lunar-based communications satellites and mining/prospecting tools, as well as testing a fission-based power plant that could be deployed as soon as 2028.\n\nThe big challenge in owning a stake in Intuitive Machines right now is a lack of profits, or for that matter, minimal revenue. Although there is some revenue being booked, this is mostly modest partnership/developmental funding that's not even fully covering the company's operating and R&D costs.\n\nThere's little doubt that the bigger bucks are coming sooner than later, though. Global Market Insights expects the worldwide lunar lander and rover market alone to grow at an average annual pace of about 10% through 2034. This company's equipment just needs to start being sent into space more often -- and to the moon in particular -- to start producing a tangible and meaningful fiscal benefit. That's not going to happen in earnest until the Artemis rocket responsible for getting the next manned moon missions off the ground (literally as well as figuratively) is satisfactory reliable, along with the Orion capsule that will house actual crew members. That's apt to take until the aforementioned 2027.\n\nJust don't tarry if you're a believer. The market's got a knack for rewarding stocks based on a company's plausible future more so than its present.\n\nNuScale Power\n\nThe proliferation of data centers (and artificial intelligence data centers in particular) has undeniably given rise to some amazing new technological tools for consumers and corporations alike. Data centers have a serious downside, though. That is, they consume a massive amount of electricity. Not only is this straining too many utility companies' power outputs, but it's environmentally unfriendly. As it turns out, the bulk of the world's current electricity production isn't yet coming from renewables.\n\nNuScale Power (SMR 19.59%) offers an optimal solution to both problems. See, this company designs and builds small-scale nuclear reactors that can be installed and operated where the electricity they generate is needed.\n\nIt's not nearly as crazy as it sounds, if the fact that NuScale is far from being the only name working on such tech is any indication. Nano Nuclear and Oklo are also so-called \"pure plays\" within the small modular reactor (or SMR) space, while Fluor and Brookfield-owned Westinghouse are a couple of the bigger and more diversified companies also working on the idea. It's a legitimate premise, even if there's a bit more work to be done; most of that work is just clearing regulatory hurdles.\n\nEven those walls are starting to crumble, however. On Friday President Donald Trump signed an executive order to ease the regularly requirements for approving new nuclear power reactors. Although not specifically supportive of NuScale Power, it's a big step in the right direction.\n\nNow, interested investors might not want to blindly rush into a position here. This stock has outright soared just since late last week, mostly in anticipation of President Trump's executive order. Shares have more than doubled since their early April low, in fact, nearing a 52-week high as a result. Given that the company's still got years of work left to do before meaningful, profit-producing revenue starts to flow, this stock could slide just as easily as it rallied.\n\nJust keep the bigger, 10-year picture in mind, using any decent pullback as a buying opportunity. Goldman Sachs believes artificial intelligence alone is going to fuel a 165% increase in data centers' usage of electricity between now and 2030. Solar, wind, and hydro power installations on their own can't keep up with that pace.\n\nRecursion Pharmaceuticals\n\nFinally, add Recursion Pharmaceuticals (RXRX -1.69%) to your list of monster stocks to buy and hold for the next 10 years.\n\nJust as the name suggests, Recursion is a drug company. Although it's got nothing on the market yet, it has six different drugs in early-stage trials right now. Most of these drugs are being developed in partnership with better-known pharma companies, including Sanofi, and the bulk of its R&D pipeline is aimed at cancer, where the opportunity for better treatments is always significant.\n\nThat's not the compelling reason you might want to take on a 10-year stake in Recursion Pharmaceuticals, however. Rather, the reason Recursion is such a hot prospect is how it's designing and developing the drugs in its pipeline. Simply put, this company is using artificial intelligence to digitally figure out what pharmacologically works -- and what doesn't work -- before any resources are needlessly consumed.\n\nIt's called Recursion OS. With 36 petabytes (36 million gigabytes) worth of proprietary data about chemical, biological, and molecular reactions ready to be accessed by a hypothetical drug-development test, pre-trial R&D work that used to require months if not years to complete can now be done in weeks, if not days. Costs that normally measure in the millions of dollars can be pared back to hundreds of thousands of dollars, or less.\n\nRecursion OS isn't a substitute for true clinical trials, to be clear -- the FDA and other regulatory agencies will still require these drugs to go through the real-world testing process. The AI-powered platform can provide a drug developer with a much better idea of what's likely to fail or succeed, though, limiting wasted resources or perhaps encouraging the development of a treatment that might have otherwise been left untreated.\n\nLike Intuitive Machines and NuScale, Recursion Pharmaceuticals is presently unprofitable, and likely to remain that way for some time.\n\nThat doesn't really matter in the long run, though. Recursion Pharmaceuticals is well-positioned to lead the artificial intelligence drug discovery market that Straits Research expects to grow an annualized pace of more than 30% through 2030. That should put it on a trajectory that gets it over the profit hump. Investors are of course likely to reward mere progress toward that point in the meantime.","summary":"A handful of industries are on the verge of explosive growth. These three companies are poised to gain the most.","url":"https://www.fool.com/investing/2025/05/26/3-monster-stocks-to-hold-for-the-next-10-years/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F819425%2Finvestment-analyst.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-05-27 00:05:00","author":"James Brumley","authors":["James Brumley"],"language":"en","source_country":"us","sentiment":-0.093},{"id":325192536,"title":"Inadequate housing supply 'costly' to Ireland's economy, Dáil committee to hear","text":"Robert Kelly, the Central Bank's director of economics and statistics, is to tell the committee that Ireland’s significant ties with the US via trade and investment places the country at significant risk of heightened impact due to the tariff and isolationist policies of President Donald Trump.\n\n “In the short term, the main challenge is heightened uncertainty, now estimated to be nearly twice as high as it was during the early pandemic, which risks reducing consumer spending and delaying investment decisions,” Mr Kelly will say.\n\n Regarding the immediate future of housing in Ireland, Mr Kelly will strike a downbeat note, reiterating that housing completions here across 2025 are projected to be 35,000 at a maximum, itself a more optimistic outlook than that of most developers.\n\n He will note commencements in 2024 “surged”, but this may have been a result of the temporary waiver of levies on development and water connections.\n\nThe ongoing stasis seen within Ireland’s housing market is a “costly” one, Mr Kelly will tell the committee, noting “inadequate housing supply will lead to rising rents and house prices”, a fact which will only serve to further undermine “our competitiveness as a small open economy”.\n\n Both Mr Kelly and the ESRI’s associate research professor Dr Conor O’Toole are set to outline similar opinions on the primary blockages to increasing housing supply — with the planning system, low productivity in the construction sector, and infrastructural deficits all cited as being factors which are holding the country back.\n\n Mr Kelly will describe the fragmented nature of Ireland’s construction sector — which sees 175,000 workers employed predominantly in small firms — as hindering “scalability and efficiency”, to the extent output per hour in Ireland is “25% below the euro area average”.\n\n Dr O’Toole is expected to reiterate the same point, that in Ireland there is “lower productivity for small and domestic-owned construction firms relative to foreign-owned construction firms”, an issue which is “likely to be inhibiting activity in the sector”.\n\n Central Bank director Mr Kelly will estimate an additional €7bn in investment will be required each year in order for the country to scale up to the 54,000 dwellings required each year to match the growing Irish population’s demand for housing.\n\n Of the three factors the Central Bank believes need to be maximised in order to deal with the crisis — “prepared land, efficient planning, and productive building” — Mr Kelly will emphasise the shortage of zoned land, particularly in Dublin and the other urban centres, is “a critical bottleneck to housing delivery”.\n\n He will criticise the domination of short-term thinking with regard to overhauling Ireland’s dated water, transport and energy infrastructure.\n\n “Without these, development cannot proceed,” Mr Kelly will say. “Our analysis shows that delays in infrastructure planning or execution lead to long wait times, causing a permanent reduction in private sector participation and resulting in poor value for money.”\n\n Dr O’Toole will note, meanwhile, the challenges in the housing market are “complicated” and “interlinked”, and structural reforms on the supply side in planning, zoning and regulation “are likely to yield the best return in terms of fostering the long-term production of housing”.","summary":"ESRI and Central Bank to address Oireachtas housing committee on the challenges facing Ireland's housing market","url":"https://www.irishexaminer.com/news/arid-41639683.html","image":"https://www.irishexaminer.com/cms_media/module_img/9273/4636513_5_seoimage1x1_HouseConstructionGettyMay2020.jpg","video":null,"publish_date":"2025-05-27 00:00:00","author":"Cianan Brennan,Irishexaminer.com","authors":["Cianan Brennan","Irishexaminer.com"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.396},{"id":325187280,"title":"Trump lays wreath at Arlington cemetery ceremony","text":"US President Donald Trump, Vice-President JD Vance, and Defence Secretary Pete Hegseth have attended a Memorial Day ceremony at Arlington National Cemetery, near Washington DC. \n\nThey stood by the Tomb of the Unknown Soldier to honour fallen American service members.","url":"https://www.bbc.com/news/videos/cdr56v35rnno","image":"https://ichef.bbci.co.uk/news/1024/branded_news/2c68/live/915fa960-3a47-11f0-96c3-cf669419a2b0.jpg","video":null,"publish_date":"2025-05-26 23:55:16","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.423},{"id":325188932,"title":"Russia claims Vladimir Putin survived drone attack following Donald Trump's outrage","text":"The Kremlin has claimed Russian President Vladimir Putin survived a massive drone attack on his helicopter. Mr Putin's helicopter was \"virtually at the epicentre of repelling a large-scale attack by the enemy's drones\" last Tuesday but the country's air defences were deployed to keep the world leader safe. Yury Dashkin, commander of a Russian air defence division, said: \"We simultaneously conducted an air defense battle and ensured the safety of the presidential helicopter’s flight in the air.\" Donald Trump insisted he had no knowledge of the incident when quizzed by reporters on Sunday. He said: \"I haven't heard that. I don't know, but I have not heard that.\" Yet, on Monday, Mr Trump took aim at Mr Putin , branding the Russian leader \"absolutely crazy\" in a post on Truth Social. The Russians have provided no additional evidence that the near-miss occurred. Moscow recently claimed it had driven Ukrainian forces out of The Kursk region, which borders Ukraine , out of the area. Mr Trump became angry following escalation in the fighting in Ukraine. Around 900 drones were launched by Russia in attacks from Friday to Sunday, it is understood. In addition to Mr Trump's Truth Social rant, he told reporters: \"I'm not happy with what Putin's doing. He's killing a lot of people.\" \"I don't know what the hell happened to Putin. I've known him a long time. Always gotten along with him. But he's sending rockets into cities and killing people. We're in the middle of talking and he's shooting rockets into Kyiv and other cities. I don't like it at all... I don't know what's wrong with him.\" It is understood Mr Trump had spoken to Mr Putin on the phone for two hours last Monday - a day before the alleged helicopter incident happened. The US President left the call believing progress could be made, saying that the \"tone and spirit of the conversation were excellent.\" He added: \"If it wasn't, I would say so now, rather than later.\" But then, on Truth Social, furious Mr Trump said: \"I've always said that he wants ALL of Ukraine, not just a piece of it, and maybe that's proving to be right, but if he does, it will lead to the downfall of Russia .\" On Monday, French President Emmanuel Macron said the Russian attacks \"show the extent to which President Putin has lied to the Europeans and to the Americans.\" It led to Mr Trump telling reporters on Sunday he was \"absolutely\" considering upping sanctions on Russia but an announcement has yet to be made. The president spent Monday morning at Arlington National Cemetery to mark Memorial Day and then headed to his Trump-branded Sterling, Virginia golf club where he spent the rest of the day.","summary":"Vladimir Putin was branded &quot;absolutely crazy&quot; by Donald Trump in a blistering attack on Monday, following which The Kremlin has claimed Mr Putin was the target of a drone attack","url":"https://www.mirror.co.uk/news/world-news/russia-claims-vladimir-putin-survived-35290874","image":"https://i2-prod.mirror.co.uk/article35290875.ece/ALTERNATES/s1200b/1_Russian-President-Vladimir-Putin-Meets-Business-Leaders.jpg","video":null,"publish_date":"2025-05-26 23:46:29","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.434},{"id":325195518,"title":"Trump pardons Virginia sheriff due to  ‘weaponized’ prosecution","text":"May 26 (UPI) -- Former Culpeper County (Va.) Sheriff Scott Jenkins won't have to go to prison for bribery after President Donald Trump pardoned him on Monday.\n\nTrump accused a \"corrupt and weaponized Biden\" Department of Justice of engaging in an \"overzealous\" prosecution of Jenkins that resulted in his December conviction on bribery and other charges in the U.S. District Court of Western Virginia.\n\n\"In fact, during his trial, when Sheriff Jenkins tried to offer exculpatory evidence to support himself, the Biden [-nominated] Judge, Robert Ballou, refused to allow it, shut him down and then went on a tirade,\" Trump said Monday in a Truth Social post.\n\n\"In federal, city and state courts, radical left or liberal judges allow into evidence what they feel like, not what is mandated under the Constitution and rules of evidence,\" Trump continued.\n\n\"This sheriff is a victim of an overzealous Biden Department of Justice and doesn't deserve to spend a single day in jail.\"\n\nHe said Jenkins \"was persecuted by radical left 'monsters' and 'left for dead,'\" so he granted him a full and unconditional pardon.\n\nThe federal court in December convicted Jenkins of accepting $70,000 in bribes and campaign contributions to appoint local businessmen as auxiliary deputy sheriffs and in March sentenced him to 10 years in prison, The Hill reported.\n\nHe was convicted on seven counts of bribery concerning programs receiving public funds, four counts of honest services mail and wire fraud, and one count of conspiracy.\n\nJenkins was the Culpeper County sheriff from 2012 until losing his bid for re-election in 2023.\n\nTwo of those from whom he was convicted for accepting bribes were undercover FBI agents.\n\nAlthough the alleged bribers were from those who lacked training and weren't vetted, Jenkins offered them badges and sheriff department credentials, federal prosecutors said.\n\nAfter Jenkins in March was sentenced to serve 10 years in prison, prosecuting U.S. Attorney Zachary T. Lee said those who received the badges and credentials did not provide any services for the county or the sheriff's office.\n\n\"Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,\" Lee said in a statement.\n\n\"We hold our elected law enforcement officials to a higher standard of conduct,\" Lee added. \"This case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable.\"","summary":"Former Culpeper County (Va.) Sheriff Scott Jenkins won't have to go to prison for bribery after President Donald Trump pardoned him on Monday.","url":"https://www.upi.com/Top_News/US/2025/05/26/trump-jenkins-pardon/4031748302232/","image":"https://cdnph.upi.com/ph/st/th/4031748302232/2025/upi/a14fffe4289ea2d2a7faf132d44d10c9/v1.2/Trump-pardons-Virginia-sheriff-due-to-weaponized-prosecution.jpg","video":null,"publish_date":"2025-05-26 23:45:44","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"US","sentiment":-0.302},{"id":325190308,"title":"Trump latest fallout with billionaire tech mogul after Musk bromance blowout - and how it could cost you big money","text":"President Donald Trump's friendship with the head of Apple has recently devolved following First Buddy Elon Musk's White House departure - and the fallout could put iPhones prices through the roof. \n\nTrump issued a blistering criticism of Apple CEO Tim Cook during his recent trip to the Middle East. The president then followed up with a threat to impose tariffs on all iPhones built outside the US. \n\nThe move was more shocking because Cook has long been considered tech's 'Trump whisperer.' \n\nThe apparent disintegration of their friendship comes on the heels of a high-profile bust-up with Amazon founder Jeff Bezos and mounting reports that the friendship between Trump and Musk has fizzled. \n\nCook reportedly drew the president's ire last week when he refused an invitation to join Trump in the Middle East, the New York Times claimed.\n\nDuring his time in Qatar, Trump publicly admitted he 'had a little problem with Tim Cook.'\n\nHe praised Apple's investment into the United States before revealing he told Cook: 'Now I hear you're building all over India. I don't want you building in India.'\n\nAnd during a speech in Riyadh, Saudi Arabia, Trump took a separate shot at Cook.\n\nPraising Nvidia chief executive Jensen Huang for traveling with the White House delegation, Trump said: 'I mean, Tim Cook isn't here but you are.'\n\nDays later, Trump posted out a blast on Truth Social which caught even some of his own administration by surprise.\n\n'I have long ago informed Tim Cook of Apple that I expect their iPhone's that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,' he wrote.\n\n'If that is not the case, a Tariff of at least 25% must be paid by Apple to the U.S. Thank your for your attention to this matter!'\n\n'If they're going to sell it in America, I want it to be built in the United States,' Mr. Trump said on Friday. 'They're able to do that.' \n\nThe tariff revelation once again sent the stock market into a tailspin amid concerns about what it would mean for the broader economy. If it goes ahead, the price of iPhones and Apple products made abroad could skyrocket.\n\nTrump said the tariff would apply to 'anybody that makes the product,' including Samsung, and would begin 'by the end of June.'\n\nIt marked a significant shift in the pair's relationship. In 2019, Trump described Cook as a 'great executive, because he calls me and others don't.' \n\nApple had vowed to pour $500billion into the United States over the next four years in an effort to placate Trump despite not building their phones domestically.\n\nSimilarly, Cook said Apple would source 19 billion chips from the US and begin making AI servers in Houston.\n\nBack in 2017, Cook said while the company would love to make more of its product in the United States, China simply had better skilled workers and more engineers.\n\nJust last month in April, Trump spared iPhone, laptops and other electronics from his brutal 125 percent China tariffs.\n\nThe list of spared items includes smartphones, laptop computers, hard drives, memory chips and processors – all tech essentials that are rarely made in the United States. \n\nExperts warned it would take years to ramp up domestic production, if it happens at all. More than 80 percent of all Apple products are made in China — including a staggering 80 percent of iPads and over half of all Mac computers, according to data from Evercore ISI.\n\nIn the days following Trump's tariff announcement, Apple saw $640 billion wiped from its market value.\n\nAnalysts warn that relocating iPhone production to the U.S. would be a monumental task, both logistically and financially. \n\nBank of America Securities analyst Wamsi Mohan previously estimated that producing the iPhone 16 Pro Max domestically could increase its price by 91 percent, pushing it from $1,199 to approximately $2,300.\n\nWedbush Securities analyst Dan Ives also suggested the cost could soar even higher, potentially reaching $3,500 per unit. \n\nThe challenges stem from higher labor costs in the U.S. — around $200 per unit compared to $40 in China — and the lack of a skilled workforce for specialized manufacturing tasks. \n\nApple CEO Tim Cook has previously highlighted the scarcity of qualified tooling engineers in the U.S., noting that while China boasts a vast pool of such talent, the U.S. has a significant shortfall. \n\nIn response to the escalating tariffs, Apple has taken swift action to mitigate potential disruptions. \n\nThe company chartered flights to expedite the shipment of approximately 1.5 million iPhones from India to the U.S., aiming to preempt the impact of the tariffs. \n\nTrump's former First Buddy Elon Musk was among outspoken critics of Trump's tariff agenda. In April, he said he would like to see 'zero tariffs' between certain nations, including Europe and the United States, for the financial betterment of citizens.\n\nMusk personally lost billions of dollars during the subsequent market crash.\n\nAnd while Trump did ultimately negotiate with many nations as well as implement a sweeping tariff freeze, Musk's sway in the White House has significantly diminished amid whispers that he and Trump are no longer as chummy as they once were.\n\nMusk revealed during the Qatar Economic Forum that he was moving away from politics and political spending.\n\n'In terms of political spending, I'm going to do a lot less in the future,' he said at the Qatar Economic Forum.\n\n'I think I've done enough,' he added, sparking laughter in the audience.\n\nA person familiar with Musk's activities did not rule out the billionaire getting financially engaged in the congressional midterms, but suggested he was dialing it back.\n\n'Hard to say if he will do the same sort of thing like putting everything on pause to do rallies,' the source said.\n\nPresident Trump has noticeably turned his attention away from Musk, sending him fewer messages of support on his social media account in recent weeks.\n\nTrump did not mention Musk in any of his Truth Social posts in April or May, according to a Politico analysis of his posts. That's a steep decline from when he first took office and was constantly posting about DOGE and Musk's accomplishments.\n\nMusk's posts on X also appear to be veering away from politics and more toward his projects.","summary":"The disintegration of their friendship would come on the heels of a high-profile bust-up with Amazon founder Jeff Bezos and mounting reports that the friendship between Trump and Elon Musk has fizzled.","url":"https://www.dailymail.co.uk/news/article-14751645/trump-tech-mogul-fallout-tim-cook-apple.html","image":"https://i.dailymail.co.uk/1s/2025/05/27/00/98771477-0-image-m-74_1748301089358.jpg","video":null,"publish_date":"2025-05-26 23:44:25","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","source_country":"gb","sentiment":-0.143},{"id":325184998,"title":"FBI's deputy director Bongino to reopen 3 unsolved Biden-era cases","text":"May 26 (UPI) -- FBI Deputy Director Dan Bongino said Monday the bureau will reexamine three high-profile Biden-era cases.\n\n\"Shortly after swearing in, (FBI Director Kash Patel) and I evaluated a number of cases of potential public corruption that, understandably, have garnered public interest,\" he said in a statement on X.\n\nThe government will reopen cases related to the 2021 pipe bombings in Washington, D.C., the 2023 discovery of cocaine in the White House and the 2022 leak of the U.S. Supreme Court's ruling to end women's 50-year-long right to choose an abortion nationwide.\n\n\"We made the decision to either re-open, or push additional resources and investigative attention, to these cases,\" Bongino, a conservative social media personality nominated in February for the role by President Donald Trump, added Monday.\n\nThe suspect behind the planting of two pipe bombs outside the Republican and Democratic Party national headquarters around Jan 5, 2021, remains a mystery that occurred in the final days of the first Trump administration.\n\nThe other FBI case Bongino reopened was the leak of the U.S. Supreme Court's 2022 draft opinion in the Dobbs ruling, which overturned the 1973 Roe v. Wade decision that legalized abortion, in what was the first-ever draft opinion leak in the high court.\n\n\"This was a singular and egregious breach of trust that is an affront to the court,\" Chief Justice John Roberts said at the time.\n\nFinally, Bongino cited the July 2, 2023, discovery of cocaine at the Biden White House in a case closed by the U.S. Secret Service after some 11 days. Investigators narrowed their list down to \"several hundred\" possible suspects with \"insufficient\" DNA samples on the bag.\n\n\"I receive requested briefings on these cases weekly,\" Bongino says, adding that FBI officials are \"making progress.\"","summary":"FBI Deputy Director Dan Bongino said Monday the bureau will reexamine three unsolved high-profile Biden-era cases.","url":"https://www.upi.com/Top_News/US/2025/05/26/FBI-Don-Bongino-Biden-reopen-cases/5621748291636/","image":"https://cdnph.upi.com/ph/st/th/5621748291636/2025/upi/0388b56d13f80c85759eeac059835a24/v1.2/FBIs-deputy-director-Bongino-to-reopen-3-unsolved-Biden-era-cases.jpg","video":null,"publish_date":"2025-05-26 23:35:59","author":"Chris Benson","authors":["Chris Benson"],"language":"en","source_country":"us","sentiment":-0.34},{"id":325188096,"title":"Donald Trump grows angrier as Vladimir Putin exposes his impotence","text":"As Washington settled in for a typically sleepy Memorial Day following the passage of Donald Trump’s “big, beautiful bill” in the House, the president fired off one of his trademark furious rants on Truth Social, but the target was a surprise.\n\nThis time, the target wasn’t any of his domestic political foes — like the Democrats who voted in lockstep against the budget package he endorsed, or the handful of Republicans who refused to fall into line. It wasn’t even aimed at the various law enforcement figures who have attempted to hold him to account over the years.\n\nSunday evening’s rant was aimed squarely at Russian President Vladimir Putin. Despite what he called a “very good relationship” with Putin, Trump in his latest statement on the Ukraine-Russia war blasted the Russian leader as “absolutely crazy.”\n\n“He is needlessly killing a lot of people, and I’m not just talking about soldiers. Missiles and drones are being shot into Cities in Ukraine, for no reason whatsoever,” Trump posted on Truth Social. “I’ve always said that he wants ALL of Ukraine, not just a piece of it, and maybe that’s proving to be right, but if he does, it will lead to the downfall of Russia!” Trump warned.\n\nHe echoed the same thoughts as he spoke to reporters in New Jersey on Sunday ahead of his return to Washington that day.\n\n\"He's killing a lot of people,\" said the president. \"I don't know what the hell happened to Putin, I've known him for a long time.”\n\nTrump sudden harsh turn was illuminative, if not for the reason he may have intended. A throwaway jab aimed at Ukraine’s Volodymyr Zelensky (“everything out of his mouth causes problems … it better stop”) in the same post solidified the underlying intention of the screed: Trump was massaging a bruised ego.\n\nWith his pride wounded, Trump has turned to lashing out at the Russian leader who is now publicly refuting his repeated claim that he could end the destructive three-year-old conflict in “24 hours.” Four months after Trump took office, supposedly poised to immediately shut down the war, attacks on Ukrainian targets intensified over the weekend, with Russia launching its largest aerial assault of the war thus far.\n\nLoathe as he is to give Zelensky any credit for correctly predicting that Russia’s leadership had no real intentions of ending the war, Trump’s emotional outburst comes as he seems to be realizing that the issue could become a major blemish on the “dealmaker” perception he has sought to cultivate.\n\nMore importantly than representing a threat to his ability to live up to his own boasting, the attacks also refute many of Trump’s more recent statements about the Russian president and his supposed desire to see the war end. Trump, who famously hates being made to look foolish by his allies, said as recently as last Monday of Putin: “I do believe he wants to end it.”\n\nBut France’s president Emmanuel Macron believes Trump is beginning to realize the truth about Putin’s war stance.\n\n\"I believe that President Trump has realized that when President Putin told him he was ready for peace, he was lying,\" Macron said on Monday. He pointed to the severity of Russian offensives as the persuading factor.\n\n\"You cannot claim to be ready for negotiations and carry out attacks at the same time. Such double rhetoric demonstrates the insincerity of any statements about dialogue,\" said the French president.\n\nNow, Washington is already beginning to wonder if Trump will back up his rhetoric with action. He has repeatedly vowed to slap damaging sanctions on Russia if the invasion continues without a resolution, most recently doing so this month in an interview with Fox’s Bret Baier.\n\nBut in a press gaggle days after those remarks, Trump also suggested that his administration may “just back away” from the conflict, which would “keep going” without U.S. involvement if a deal was not reached.\n\nCapitol Hill is not keen to let that happen — a bipartisan resolution to impose a new slate of sanctions on Russia hit 81 co-sponsors in the Senate last Wednesday, according to a press release from joint co-sponsors Lindsey Graham and Richard Blumenthal.\n\nThe bill, which is designed to be snapped into place if peace talks fall apart, would slap sanctions on a range of Russian top ministers, as well as on businesses and entities that transact with the Russian armed forces.\n\n“Russia has agreed to provide its term sheet for a ceasefire in the next few days. Its contents will speak volumes as to whether or not Russia is serious about peace. We suspect it will be more of the same,” the pair said in a joint statement.\n\n“If it is more of the same, Russia can expect decisive action from the United States Senate.”","url":"https://uk.news.yahoo.com/donald-trump-grows-angrier-vladimir-233417032.html","image":"https://media.zenfs.com/en/the_independent_577/8529ef4eb0482678d7a7c1c33f753848","video":null,"publish_date":"2025-05-26 23:34:17","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.48},{"id":325195962,"title":"Democrats Claim Republicans Undermined Filibuster While Voting to Repeal It for Years","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters \n\n BREITBART\n\nHarvard Hammered\nBig Beautiful Bill\nDC Antisemitic Terror\nTariff Talks\nUkraine Peace Push\n\nDemocrats Claim Republicans Undermined Filibuster While Voting to Repeal It for Years\n\n J. Scott Applewhite/AP\n\nSean Moran26 May 2025 \n\nAlex Padilla\nChuck Schumer\n\nJohn Barrasso\nSheldon Whitehouse \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nJon Stewart Wonders if Trump Will ‘Burn Our F**king Country'\nTrump Looking to Redirect $3 Billion in Harvard Grants to U.S.\nTrump Delays 50 Per Cent EU Tariffs After Request From Brussels\nTrump Tells Sen. GOP to 'Make the Changes They Want' to Big Beautiful Bill\nSam Harris: Would Rather Have Biden in a Coma than Evil Trump\nTrump: 'Our Debt' to Fallen Service Members 'Is Eternal' and Ever-Growing\nGermany Says No Limits on Ukraine Using Weapons to Attack Russia\nReport: Democrats Set $20 Million Plan to Win Back Young Men\nWatch: Massive Brawl Engulfs San Diego Soccer Game\nWatch Live: Donald Trump Participates in Memorial Day Tribute\n\nFROM THE HOMEPAGE\n\nDOGE: Social Security Officially Removes 12.3 Million Individuals Listed Age 120+\nDonald Trump: ‘Our Debt’ to Fallen Service Members ‘Is Eternal’ and Ever-Growing\nMelania Trump on Memorial Day: ‘Not Only Mourn Their Loss But Celebrate Their Bravery’\nVIDEO — Memorial Day: Floridians Clean Neglected Cemetery to ‘Honor Those American Heroes’\nDemocrats Claim Republicans Undermined Filibuster While Voting to Repeal It for Years\nTrump Tells Senate GOP to ‘Make the Changes They Want’ to Big Beautiful Bill\nTrump Looking to Redirect $3 Billion in Harvard Grants to U.S. Trade Schools\nWATCH: Pit Stop Fires, Track Chaos, Crashes Galore in Indy 500\nFormer New York Congressman Charles Rangel Dead at 94\nReport: Messy Leftist Power Struggle Cripples Government of Colombia\nWATCH: Massive Brawl Between Fans Engulfs San Diego Soccer Game\nHouse-Passed ‘Big Beautiful Bill’ Has Buried Tobacco Tax; Trump Backs Senate Republican Move to Make Changes \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters\n\nCopyright © 2025 Breitbart","summary":"Senate Democrats have claimed that Republicans undermined the Senate filibuster while they have moved to repeal it outright for years. \n\n\nThe post Democrats Claim Republicans Undermined Filibuster While Voting to Repeal It for Years appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/05/26/democrats-claim-republicans-undermined-filibuster-while-voting-to-repeal-it-for-years/","image":"https://media.breitbart.com/media/2025/05/Chuck-Schumer-640x335.jpg","video":null,"publish_date":"2025-05-26 23:32:22","author":"Sean Moran","authors":["Sean Moran"],"language":"en","category":"politics","source_country":"US","sentiment":0.146},{"id":325196830,"title":"YOURSAY | Risky for Anwar to seek a meeting with Trump","text":"YOURSAY | “Trump might ambush Anwar like he did with Zelenskyy.”Anwar writes to Trump to request US-Asean meetingAnonymous_3f4b: When and why did Mr Madani (Prime Minister Anwar Ibrahim) write to US President Donald Trump? As though Trump would read his letter.For all you know, the letter would have been dumped into the wastepaper basket even without Trump knowing it, at worst, or left to his many secretaries and officials to vet even before putting it on his desk.Mr Madani, as prime minister of this year’s Asean chair, should and could have made a direct line phone/video call to Trump like his Asean counterparts Indonesia, Thailand, Vietnam, Singapore, and the like. Did he even congratulate Trump on the latter’s win?By not doing so, he has not shown respect and diplomatic decorum to Trump, and likewise, we should not expect favours or diplomatic considerations from the Trump administration.But then Trump would have chastised him and given Mr Madani a piece of his mind.Prime Minister Anwar IbrahimUnlikely that Trump will accord a US-Asean meeting soon, and if so, he would send one of his many secretaries or officials to do the talking to Mr Madani as head of the Asean chair. Another head would have been better suited to expedite the talks.Pink: Trump does not like to deal with trade blocs; he prefers to have bilateral trade negotiations between individual countries because he will have better negotiating power. This is the reason why he is belligerent towards the European Union. So, this is bound to fail.I fear Trump will insult Anwar the way he insulted Cyril Ramaphosa, the president of South Africa, by showing a fake video claiming there is a genocide of white people in South Africa.What if he raised the issue of racial and religious discrimination in Malaysia in front of all the cameras for the world to see, even though it is far from the truth? That will damage Malaysia’s reputation as a moderate, liberal country. He may also likely claim that Anwar’s support of Hamas is anti-semitic.It is a risky proposition. Anwar may be highly regarded and respected by all at home. But to Trump, he is just the leader of a small, underdeveloped country.Just a Malaysian: It’s just a formality. How do you negotiate with a “madman” who is hell-bent on bullying his way through? He who believes power will get everything their way?It is much like our citizens who love to shout down at all minorities’ concerns. Who refused to listen to different opinions and ideas, where “my way” is the only way, or else?Now we are faced with a real bully, while our local bullies are all quiet as mice. Isn’t this the time to defend race and religion? For real this time, not the wayang, chest-thumping performance at people who cannot fight back.TaaS: It used to be protests and boycotts (towards America). Now, it is like begging (to meet their president).How can the village leader possibly lead Asean when he has shown poor leadership for his country and a bad example for his party?Do you think Trump would be particularly concerned about meeting with a group of Asean countries, many of which have recorded among the highest trade deficits with the US, and making concessions?Do you think Malaysia and others can get away without removing non-tariff barriers?BesamanMucho: Did you also mention in the letter that:1. Malaysia is a “fiercely independent nation”;2. I have written to the United Nations to sack Israel from the world body;3. I have met the leaders of Hamas; I have met now deceased Hamas leaders such as Ismail Haniyeh, Yahya Sinwar, and Hassan Nasrallah;4. I have contributed RM100 million of our people’s money to Gaza;5. I give free education to Palestinian children, while the same may not be available to other local minorities.“Based on the above achievements, it is only right that you meet me soonest.”Apanama is back: I prefer Trump to come over (to Malaysia) for the Asean meeting. Why? So that he can ambush Anwar (on several issues).So far, Trump had ambushed Ukrainian President Volodymyr Zelenskyy (ongoing war with Russia) and Ramaphosa (over white farmers and land reforms) in the Oval Office.US President Donald Trump (right) and Ukrainian President Volodymyr ZelenskyyTherefore, Trump needs to give Anwar a “tight slap” in front of the Asean leaders by ambushing him, playing the videos, showing proof that Anwar is supporting Hamas, as the US will not be happy with his behaviour.Trump accepts the invitation and ambushes Anwar. Just do this favour for me.Hmmmmmmmm: Trump is willing to let his own most prestigious university in the world sink because of some of their students’ pro-Palestine protests.What do you think he will do to someone who openly supports Hamas and even supports protests against the US, boycotts US franchises, and lets school children mimic Hamas in schools?When you are only a small fry, don’t try to be a hero. Look after your own backyard first. If you want to support Hamas, do it quietly and don’t drag the country down with you.The above is a selection of comments posted by Malaysiakini subscribers. Only paying subscribers can post comments. In the past year, Malaysiakinians have posted over 100,000 comments. Join the Malaysiakini community and help set the news agenda. Subscribe now.These comments are compiled to reflect the views of Malaysiakini subscribers on matters of public interest. Malaysiakini does not intend to represent these views as fact.","summary":"'Trump might ambush Anwar like he did with Zelenskyy.'","url":"https://www.malaysiakini.com/news/744436","image":"https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2025/04/2eb0f01e044bb5e44492200664ef95d3.jpg","video":null,"publish_date":"2025-05-26 23:30:59","author":"Yoursay","authors":["Yoursay"],"language":"en","category":"politics","source_country":"my","sentiment":-0.278},{"id":325188564,"title":"Letters: Bay Area homeless advocates must pool their resources","text":"Homeless advocates\nmust pool resources\n\nDespite tireless efforts by mission-driven nonprofits, the homelessness crisis remains stubbornly persistent — largely because we’re solving in silos. Each organization measures success using its own key performance indicators, without a systemwide lens.\n\nThe result? Critical gaps in care and missed opportunities to allocate resources where they’re needed most. Imagine if we could define a universal care pathway — from “at risk” to “housed” — assign key performance indicators to each step, and map nonprofit efforts accordingly. With today’s technology, we can build a secure, unified dashboard that integrates existing tools nonprofits already use — no added data entry required. Privacy concerns? Solved — existing industry standards can be adapted.\n\nThis approach isn’t about more reporting — it’s about collective clarity. When we see the whole system in real time, we empower smarter decisions, faster action and better outcomes. To truly move the needle on homelessness, we must shift from isolated impact to shared insight.\n\nJagdish Girimaji\n\nDemand on-site\nvets for rodeos\n\nRodeo season, alas, is upon us, an activity condemned for its inherent cruelty by nearly every animal welfare organization on Earth. Rodeo is mostly hype, a macho exercise in domination. Both Cesar Chavez and Pope Francis were vocal critics.\n\nCalifornia boasts the nation’s most comprehensive rodeo law, Penal Code 596.7, enacted in 2000, amended in 2007 to cover the hundreds of Mexican-style rodeos called “charreadas.” The law forbids the use of electric prods in the holding chutes, and requires either an on-site or on-call veterinarian at every rodeo and charreada. The law should be amended, dropping the “on-call” vet option. Racetracks, horse shows and endurance rides all require on-site vets — so should all rodeos.\n\nState rodeo law also requires that injury reports be submitted to the state Veterinary Medical Board. These reports are public record, free for the asking.\n\nLet your state reps hear from you.\n\nMedia portrays Israelis\nas blameless, right\n\nRe: “2 staff members of Israeli embassy killed in DC shooting” (May 22):\n\nThe tragic killing of two Israeli embassy employees is immediately being used falsely by those advocating for the Israeli war in Gaza to prove Israel right and blameless.\n\nIt’s hard not to notice that victims of this crime, like the Israeli hostages, are portrayed in our media as full individuals we can identify with.\n\nBy contrast, the more than 100 average Palestinians killed daily by Israel (including by starvation and disease), plus dozens who lose limbs, pass by us as empty numbers.\n\nYet Israel uses every possibility to reassert its absolute rightness despite the carpet-bombing and starvation of civilians, which they imply has somehow been fabricated by the world media.\n\nIsrael’s government has become a horrific historic disgrace to the Jewish people worldwide, who should absolutely separate from it. It has no more allegiance to truth than Donald Trump does.\n\nSteve Koppman\n\nBig Oil isn’t only party\nresponsible for climate\n\nRe: “We must revive bills to make polluters pay” (Page A6, May 20).\n\nSusan Harris’ letter wanting to sue the oil companies is presumptuous and incorrect.\n\nThe oil companies were supplying an essential service that everybody used. If you went by her theory, you would have to sue everyone who used the products to get to work and school and deliver groceries and other essentials. Everyone who heated their house and water, too. CO2 wasn’t even called a pollutant until 2009. In fact, it is an essential gas that plants need to produce oxygen for us to breathe.\n\nThe only ones that would make out are the lawyers.\n\nTrump’s ‘Big Bill’ seeks\nto neuter the courts\n\nThe most dangerous part of Trump’s Big Ugly Bill is a hidden provision that will prevent courts from holding Trump or any of his minions in contempt. Thus, there will no longer be any defense of our beloved Constitution or its Bill of Rights. There will no longer be any restraint on Trump or Project 2025 and MAGA zealots. Trump will become a dictator in all but name. Fascism will reign in America.\n\nWhen this heinous bill comes to a vote in the Senate, I urge all Democratic representatives and senators to exit their chambers, gather on the steps outside the Capitol wearing black armbands, stand in silence as a lone trumpet intones taps, and to thus publicly mourn the end of democracy in the United States. “Government of the people, by the people, and for the people” will have perished in America — not with a bang, but a whimper.\n\nDavid Ellison\n\nTrump has earned\nanimosity aimed at him\n\nRe: “Hatred of Trump is unhealthy for U.S.” (Page A6, May 21).\n\nThis is not the first time I’ve read a Donald Trump supporter decrying hatred of him. The hatred is real. It is justified.\n\nTrump is doing his best to destroy our country with his attacks on the judiciary, the press and the universities, which are not veiled threats but real. The rule of law is severely threatened by a senseless narcissist who attempted a coup and is now aiming for authoritarian rule.\n\nHe is nothing like President Ronald Reagan. Reagan had a sense of decency and an unquestioned allegiance to the Constitution. Trump is an unbalanced grifter without the barest sense of decency.\n\nBy the way, where was the outrage over the hatred for Joe Biden when he was president? “Let’s go, Brandon” still rings in my ears. Hatred for Trump is an unfortunate byproduct of his own outrageous actions.\n\nStephen Gutierrez\nCastro Valley","summary":"Also: On-site vets &#124; Media portrayal &#124; Not alone &#124; Neutering the courts &#124; Earned animosity. East Bay Times reader letters to the editor for May 27, 2025.","url":"https://www.mercurynews.com/2025/05/26/letters-bay-area-homeless-advocates-pool-resources/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/SJM-L-SWEEP-0513-8.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-26 23:30:15","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.009},{"id":325196224,"title":"Navy to use AI to detect ‘hostile’ Russian activity in the Arctic","text":"The UK Navy is to use artificial intelligence to detect hostile state activity in the Arctic, amid the increasing threat from Russia in the region. \n\nThe area is a key flank of European and Britain’s security, while the Kremlin’s operations there aid it war in Ukraine and threaten critical infrastructure like undersea cables to the UK, ministers warn. \n\nOn a visit to Iceland, the Foreign Secretary David Lammy will announce a new joint scheme between the two countries to use cutting edge AI technology to monitor the activity of state actors. \n\nMr Lammy said: “It’s more important than ever that we work with our allies in the High North, like Norway and Iceland, to enhance our ability to patrol and protect these waters,” \n\nThe problem is growing as rising temperatures lead ice caps to melt, opening up previously inaccessible routes. \n\nAreas close to the Arctic are being used by Russia’s nuclear-powered icebreakers, clearing paths for tankers helping fund his illegal war in Ukraine. \n\nThese are Russia’s “shadow fleet” of ships which transport oil and gas or stolen Ukrainian grain, to get around Western sanctions. \n\nThe foreign secretary will also reveal that the UK has halted Putin’s plans to have a floating repair dock in the Arctic, to service the icebreakers. \n\nUnder the new joint UK-Iceland strategy more than half a million pounds, £554,000, of UK funding from the UK Integrated Security Fund, for the Alan Turing Institute, will examine how AI can improve monitoring. \n\nThe announcement comes after Donald Trump hit out at Putin, calling the Russian leader “absolutely crazy” for firing hundreds of drones and missiles at Ukraine overnight. \n\nFrench president Emmanuel Macron said he hopes Trump’s latest remarks would “translate into action”, while Ukrainian leader Volodymyr Zelensky called for the US to slap additional sanctions on Moscow instead of continuing talks.","summary":"UK sanctions have also hampered Russian President Vladimir Putin's efforts to maintain his fleet of nuclear-powered icebreakers to aid his invasion of Ukraine, as Donald Trump calls him ‘absolutely crazy’ for firing hundreds of drones and missiles overnight","url":"https://www.independent.co.uk/news/uk/politics/ai-russia-ukraine-war-arctic-b2758037.html","image":"https://static.independent.co.uk/2025/05/09/18/8161512ffdce7f9bef974ef57fbdeb32Y29udGVudHNlYXJjaGFwaSwxNzQ2ODk2MzQ5-2.80049072.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/2yuhep9N-4VHSaSK0.mp4","publish_date":"2025-05-26 23:27:50","author":"Kate Devlin","authors":["Kate Devlin"],"language":"en","source_country":"gb","sentiment":0.112},{"id":325188094,"title":"Navy to use AI to detect ‘hostile’ Russian activity in the Arctic","text":"The UK Navy is to use artificial intelligence to detect hostile state activity in the Arctic, amid the increasing threat from Russia in the region.\n\nThe area is a key flank of European and Britain’s security, while the Kremlin’s operations there aid it war in Ukraine and threaten critical infrastructure like undersea cables to the UK, ministers warn.\n\nOn a visit to Iceland, the Foreign Secretary David Lammy will announce a new joint scheme between the two countries to use cutting edge AI technology to monitor the activity of state actors.\n\nMr Lammy said: “It’s more important than ever that we work with our allies in the High North, like Norway and Iceland, to enhance our ability to patrol and protect these waters,”\n\nThe problem is growing as rising temperatures lead ice caps to melt, opening up previously inaccessible routes.\n\nAreas close to the Arctic are being used by Russia’s nuclear-powered icebreakers, clearing paths for tankers helping fund his illegal war in Ukraine.\n\nThese are Russia’s “shadow fleet” of ships which transport oil and gas or stolen Ukrainian grain, to get around Western sanctions.\n\nThe foreign secretary will also reveal that the UK has halted Putin’s plans to have a floating repair dock in the Arctic, to service the icebreakers.\n\nUnder the new joint UK-Iceland strategy more than half a million pounds, £554,000, of UK funding from the UK Integrated Security Fund, for the Alan Turing Institute, will examine how AI can improve monitoring.\n\nThe announcement comes after Donald Trump hit out at Putin, calling the Russian leader “absolutely crazy” for firing hundreds of drones and missiles at Ukraine overnight.\n\nFrench president Emmanuel Macron said he hopes Trump’s latest remarks would “translate into action”, while Ukrainian leader Volodymyr Zelensky called for the US to slap additional sanctions on Moscow instead of continuing talks.","url":"https://uk.news.yahoo.com/navy-ai-detect-hostile-russian-232750960.html","image":"https://media.zenfs.com/en/the_independent_577/b147961cd890da414d30292af3d25cb1","video":"","publish_date":"2025-05-26 23:27:50","author":"Kate Devlin","authors":["Kate Devlin"],"language":"en","source_country":"gb","sentiment":0.112},{"id":325194558,"title":"N. Korea Says US 'Golden Dome' Missile Shield 'Very Dangerous'","text":"North Korea has slammed US President Donald Trump's \"Golden Dome\" missile shield plan as a \"very dangerous\" threat that aims to weaponise space, state media reported Tuesday.Pyongyang's foreign ministry has issued a memorandum calling the system \"a very dangerous 'threatening initiative' aimed at threatening the strategic security of the nuclear weapons states,\" the Korean Central News Agency (KCNA) said.Trump announced new details and initial funding for the missile shield system last week, calling it \"very important for the success and even survival of our country\".The initiative faces significant technical and political challenges, according to analysts, and could come at a hefty price tag.The memorandum by nuclear-armed North Korea accused the United States of being \"hell-bent on the moves to militarize outer space,\" KCNA said.\"The U.S. plan for building a new missile defense system is the root cause of sparking off global nuclear and space arms race by stimulating the security concerns of nuclear weapons states and turning the outer space into a potential nuclear war field,\" it added.Washington -- Seoul's key security ally -- has in recent years ramped up joint military exercises and increased the presence of strategic US assets, such as an aircraft carrier and a nuclear-powered submarine, in the region to deter the North.Pyongyang has repeatedly declared itself an \"irreversible\" nuclear weapons state and routinely denounces joint US-South Korea drills as rehearsals for invasion.China has similarly expressed strong concerns about Washington's Golden Dome plan, accusing the United States of undermining global stability.Beijing is closing the gap with Washington when it comes to ballistic and hypersonic missile technology, while Moscow is modernising its intercontinental-range missile systems and developing advanced precision strike missiles, according to a 2022 Pentagon review.The Kremlin has said Trump's initiative would require consultations with Russia but was otherwise a \"sovereign matter\" for the United States, softening its tone after also previously slamming the idea as destabilising.The plan's Golden Dome name stems from Israel's Iron Dome air defence system which has intercepted thousands of short-range rockets and other projectiles since it went into operation in 2011.The United States faces various missile threats from adversaries, but they differ significantly from the short-range weapons that Israel's Iron Dome is designed to counter.","summary":"North Korea has slammed US President Donald Trump's \"Golden Dome\" missile shield plan as a \"very dangerous\" threat that aims to weaponise space, state media reported Tuesday.","url":"https://www.ibtimes.com/n-korea-says-us-golden-dome-missile-shield-very-dangerous-3774537","image":"https://d.ibtimes.com/en/full/4602903/us-president-donald-trump-announced-new-details-initial-funding-missile-shield-system-last-week.jpg","video":null,"publish_date":"2025-05-26 23:27:14","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.324},{"id":325188090,"title":"N. Korea says US 'Golden Dome' missile shield 'very dangerous'","text":"North Korea has slammed US President Donald Trump's \"Golden Dome\" missile shield plan as a \"very dangerous\" threat that aims to weaponise space, state media reported Tuesday.\n\nPyongyang's foreign ministry has issued a memorandum calling the system \"a very dangerous 'threatening initiative' aimed at threatening the strategic security of the nuclear weapons states,\" the Korean Central News Agency (KCNA) said.\n\nTrump announced new details and initial funding for the missile shield system last week, calling it \"very important for the success and even survival of our country\".\n\nThe initiative faces significant technical and political challenges, according to analysts, and could come at a hefty price tag.\n\nThe memorandum by nuclear-armed North Korea accused the United States of being \"hell-bent on the moves to militarize outer space,\" KCNA said.\n\n\"The U.S. plan for building a new missile defense system is the root cause of sparking off global nuclear and space arms race by stimulating the security concerns of nuclear weapons states and turning the outer space into a potential nuclear war field,\" it added.\n\nWashington -- Seoul's key security ally -- has in recent years ramped up joint military exercises and increased the presence of strategic US assets, such as an aircraft carrier and a nuclear-powered submarine, in the region to deter the North.\n\nPyongyang has repeatedly declared itself an \"irreversible\" nuclear weapons state and routinely denounces joint US-South Korea drills as rehearsals for invasion.\n\n- China, Russia modernising weapons -\n\nChina has similarly expressed strong concerns about Washington's Golden Dome plan, accusing the United States of undermining global stability.\n\nBeijing is closing the gap with Washington when it comes to ballistic and hypersonic missile technology, while Moscow is modernising its intercontinental-range missile systems and developing advanced precision strike missiles, according to a 2022 Pentagon review.\n\nThe Kremlin has said Trump's initiative would require consultations with Russia but was otherwise a \"sovereign matter\" for the United States, softening its tone after also previously slamming the idea as destabilising.\n\nThe plan's Golden Dome name stems from Israel's Iron Dome air defence system which has intercepted thousands of short-range rockets and other projectiles since it went into operation in 2011.\n\nThe United States faces various missile threats from adversaries, but they differ significantly from the short-range weapons that Israel's Iron Dome is designed to counter.\n\nbur-des/rsc","url":"https://uk.news.yahoo.com/n-korea-says-us-golden-232449736.html","image":"https://media.zenfs.com/en/afp.co.uk/3ff67cd96d3cf98d365e9accecad8253","video":null,"publish_date":"2025-05-26 23:24:49","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.303},{"id":325193026,"title":"Is ‘reef safe’ sunscreen really safer for the ocean?","text":"Some of the sunscreen you slather on this summer will end up in lakes, streams or the ocean, even if you don’t go swimming. And a growing body of evidence suggests that ultraviolet filters, the active ingredients in sunscreens, can harm creatures that live in the water.\n\nSome products are marketed as “reef safe” or friendly to aquatic life. But has that been proved? We talked to a dermatologist, several ecologists and toxicologists, and a chemical engineer to find out the best way to protect your skin and the environment, too.\n\n Your Sunscreen Options \n\nThere are two kinds of UV filters in sunscreens on the market today.\n\nMineral sunscreens create a physical barrier on your skin that reflects UV rays like a mirror, while chemical sunscreens are absorbed into the skin and convert the UV radiation into harmless heat. (Chemical sunscreens are also sometimes labeled “organic,” but that’s a chemistry term, not a claim of environmental friendliness.)\n\nAny sunscreen you apply will eventually end up in water. Researchers estimate that between 25% and 50% of sunscreen comes off during a dip. The rest goes down the drain when you shower or enters the wastewater system through the laundry when you wash your beach towels.\n\nMost standard treatment plants aren’t effective at removing trace levels of UV filters from wastewater, said Dunia Santiago, a chemical engineer at the University of Las Palmas de Gran Canaria in Spain who studies how treatment plants process contaminants. That means the chemicals are still in the water that flows out of the plant and into the world.\n\nAnd, since many UV filters don’t biodegrade well, levels can build up over time in the environment, floating around, settling into sediment and being eaten by animals, especially in shallow areas popular with swimmers.\n\n What We Know and Don’t Know \n\nThere’s a growing body of evidence that both chemical and mineral UV filters have the potential to harm wildlife, including coral reefs, at high concentrations. A 2016 study on the potential for a chemical UV filter called oxybenzone to make coral more vulnerable to bleaching made a particularly big splash in the public consciousness, increasing demand for gentler alternatives and leading some places to ban the sale of some chemical sunscreens.\n\nIn response, some manufacturers have started marketing mineral sunscreens as “reef safe.” But researchers generally agree that you shouldn’t put too much stock in these labels, which aren’t regulated.\n\nCalling one UV filter safer than another “implies that we have information to make a comparison, which we do not have,” said Sandy Raimondo, an ecologist at the Environmental Protection Agency who studies chemical contaminants.\n\nSome researchers, nevertheless, say that even with our incomplete knowledge of the impacts of UV filters, the existing evidence on certain chemical UV filters is damning enough for us to switch to a subgroup of UV mineral filter alternatives whose formulations don’t contain so-called nano versions of zinc oxide and titanium dioxide, substances that raise their own environmental concerns.\n\nThe science on UV-filter toxicity isn’t rock-solid because the laboratory methods used to test them haven’t been standardized, according to the ecologists and toxicologists interviewed.\n\nOne important issue is the “stickiness” of chemical UV filters. They cling to the surface of the water, the sides of tanks and the inside of tools designed to measure their concentrations. When researchers can’t be certain of the concentration of a chemical in water, Raimondo said, the resulting data isn’t reliable.\n\nThe data on mineral UV filters is more reliable, but new formulations designed to minimize that ghostly white cast on the skin cause their own problems. Some manufacturers use so-called nano versions of zinc oxide and titanium dioxide. These even-tinier particles can get embedded in the tissues of plants and animals in ways that scientists are only beginning to understand, Raimondo said.\n\n Trying To Fill in the Blanks \n\nThe EPA is currently funding studies to fill the gaps in our understanding of UV-filter toxicity. Top priorities include resolving measurement issues and developing standardized methods to make comparisons easier. But President Donald Trump’s plans for deep cuts at the agency have put the future of many environmental studies in doubt.\n\nEven if those studies continue, they will probably take years to complete, and the agency could take several more years to conduct an official ecological risk assessment for any particular UV filter.\n\n What You Can Do Right Now \n\nThankfully, you don’t have to broil to help the environment. Dermatologists and toxicologists agree on the best form of sun protection. But it’s not mineral or chemical sunscreen. It’s clothing.\n\nSunscreen is an important component of protection, “but it’s not the only component,” said Dr. Henry Lim, a dermatologist at Henry Ford Health in Detroit and a former president of the American Academy of Dermatology. “Staying in the shade, wearing photoprotective clothing, a wide-brimmed hat and sunglasses are very, very important.”\n\nCover as much real estate as you can with UPF-rated clothing. (UPF, for ultraviolet protection factor, is the SPF equivalent for fabric.)\n\n“Sunscreen should be applied only in the areas that cannot be covered,” Lim said.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"Some of the sunscreen you slather on this summer will end up in lakes, streams or the ocean, even if you don&#8217;t go swimming. And a growing body of evidence suggests that ultraviolet filters, the active ingredients in sunscreens, can harm creatures that live in the water.","url":"https://www.staradvertiser.com/2025/05/26/breaking-news/is-reef-safe-sunscreen-really-safer-for-the-ocean/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/05/web1_20250526_brk_sun01.jpg","video":null,"publish_date":"2025-05-26 23:20:00","author":"New York Times","authors":["New York Times"],"language":"en","source_country":"us","sentiment":-0.039},{"id":325191664,"title":"Trump, Who Dodged the Draft, Chooses Memorial Day to Lash Out at Political Foes Rather Than Honor the Fallen","text":"“All gave some and some gave all” is an often repeated phrase in America during Memorial Day, a quote attributed to Korean War veteran and purple heart recipient Howard William Osterkamp, who served in the US Army from 1951 to 1953.\n\nUS President Donald Trump, who avoided military conscription a reported five times during the Vietnam War, and whose former lawyer has said made up his injuries in order to do so, managed instead to give a speech on Memorial Day that lashed out at his political adversaries on a day meant to honor those gave the ultimate sacrifice for their country.\n\nAfter being helped to lay a wreath at Arlington Memorial Cemetery near Washington D.C., which contains the graves of countless American soldiers killed in action, Trump took the opportunity to once again degrade former commanders-in-chief on matters completely unrelated to soldiers’ sacrifices.\n\nHe used the time to talk about his own domestic policy, complaining that former administrations did not crack down hard enough on immigration across the US-Mexico border.\n\n“Who would let that happen?” Trump said at the revered burial ground. “People pouring through our borders unchecked. People doing things that are indescribable and not for today to discuss.”\n\nIt was a veiled reference to his predecessor Joe Biden, whose son Beau served with the US military in Iraq and Kosovo before dying of brain cancer in 2015 at the age of 46. None of Trump’s children has served in the military.\n\nIn a Truth Social post that same day Trump wrote, “Including the scum that spent the last four years trying to destroy our country through warped radical left minds, who allowed 21,000,000 million people to illegally enter our country, many of them being criminals and the mentally insane, through an open border that only an incompetent president would approve.”\n\nAfter paying some lip service to the armed forces at the sacred burial ground, what Trump did not discuss was his own sidestepping of military service, nor his own degrading comments about fallen US soldiers, once describing them as “suckers” and “losers”.\n\nIn 2023, former Trump White House chief of staff John Kelly, himself a former US Marine Corps general, described Trump as “a person that thinks those who defend their country in uniform, or are shot down or seriously wounded in combat, or spend years being tortured as POWs are all ‘suckers’ because ‘there is nothing in it for them.”\n\nHe continued that Trump was someone who “did not want to be seen in the presence of military amputees because ‘it doesn’t look good for me.’ A person who demonstrated open contempt for a Gold Star family — for all Gold Star families — on TV during the 2016 campaign, and rants that our most precious heroes who gave their lives in America’s defense are ‘losers’ and wouldn’t visit their graves in France.”\n\nA Gold Star family is one who lost a family member in active duty.\n\nWhile Veterans Day in the United States, in November, is meant to honor all US servicemen and servicewoman (of which there are several on the staff of Kyiv Post), Memorial Day in America is reserved for those who died serving their country.\n\nThe first Memorial Day in the US was observed on May 30, 1868, after a proclamation by then-Commander in Chief John A. Logan of the Grand Army of the Republic to honor Union soldiers (those fighting for the North) who had died in the American Civil War. It has since been observed to honor all soldiers who died serving in all of America’s conflicts.\n\nAn estimated 620,000 soldiers from both the Union and Confederacy died in the Civil War.\n\nIn the American Revolutionary War, an estimated 6,800 patriots died in battle.\n\nIn World War II, an estimated 417,000 US servicemen sacrificed their lives.\n\nIn Vietnam, an estimated 60,000 US soldiers gave their lives, about the same number as the average estimate for Ukrainian soldiers killed defending their own country against the full-scale Russian invasion that started in February 2022.","summary":"The commander-in-chief who used family connections to avoid service during the Vietnam War, and who called KIA soldiers “suckers”, spent a day dedicated to heroes to advance his own agenda.","url":"https://www.kyivpost.com/post/53398","image":"https://static.kyivpost.com/storage/2025/05/27/aedc3eccba93faf81ea1c0387a58b531.jpeg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-05-26 23:15:10","author":"John Moretti","authors":["John Moretti"],"language":"en","category":"politics","source_country":"ua","sentiment":-0.301},{"id":325183716,"title":"Winemakers finding Trump’s tariffs hard to swallow","text":"Burgundy is one of the most prestigious wine regions in France, and the US is its biggest export market. But now, Donald Trump’s tariffs are threatening to price European wine out of the American marketplace.\n\nCrouched in cold mud under a thin Spring rain, vineyard employee Élodie Bonet snaps off unwanted vine shoots with her fingers and pruning clippers.\n\n“We want the vine to put all its energy into the shoots that have the flowers where the grapes are going to grow,” she explains.\n\nI leave Élodie working her way down the rows of vines, and walk up to the house and winery in the Burgundy village of Morey-Saint-Denis, where I meet owner and winemaker Cécile Tremblay.\n\nShe takes me down to her cellar to taste some of her prized red wines, standing among the oak barrels and old bottles with labels weathered by mould and age.\n\nThey have names on them that make wine lovers go weak at the knees – Nuits-Saint-Georges, Echezeaux, Vosne-Romanée, Clos-Vougeot, and Chapelle-Chambertin.\n\nMs Tremblay sells over half of her wine abroad, under the name Domaine Cecile Tremblay.\n\n“For the United States, it’s around 10% of the production; it’s a big production for me!” she says.\n\nAfter threatening a 200% mark-up on alcohol from Europe, Donald Trump imposed a 20% tariff on practically all European Union products on 5 April.\n\nFour days later, he lowered this to 10%, with the threat that he’d hike it back up again to 20% in July, depending on how trade negotiations pan out. And now Trump is threatening a future tariff of 50% on all goods from the EU.\n\nI ask Ms Tremblay if she’s worried. “Yes, sure,” she says, “As everybody is.”\n\nBut that is all she will say on the matter. French winemakers are walking on eggshells at the moment, fearful of saying anything that might aggravate the situation.\n\nPerhaps their representatives will be more forthcoming? I get in my car and drive over to one of her neighbours – François Labet. He is the president of the Burgundy Wine Board, which represents this region’s 3,500 winemakers.\n\n“The US is the largest export market for the whole region. Definitely,” he tells me. “They are the biggest in volume and the biggest in value.”\n\nAnd, until Donald Trump’s re-election, the US market was booming. While French wines and spirits’ global exports fell 4% last year overall, sales of Burgundy wines to the US rose sharply.\n\nIn volume terms, there were up 16% from 2024, to 20.9 million bottles. This was worth €370m ($415m; £312m) in revenues, 26.2% higher than in 2023.\n\nMr Labet says the US accounted for about a quarter of Burgundy’s wine exports last year.\n\nBurgundy’s reputation abroad is mainly for its red wines, which are made from the celebrated pinot noir grape. Indeed, in the English-speaking world, burgundy is not so much a wine as a colour.\n\nThe French word for the same colour is bordeaux; showing they know more about their wine, because while Bordeaux wines are mostly red, two-thirds of Burgundy is actually white.\n\nThese are predominantly made from the Chardonnay grape. Chablis, one of the best-known examples, is extremely popular in the US.\n\nBurgundy also produces an increasingly successful sparkling wine, called Crémant de Bourgogne, and a small amount of rosé.\n\nAll of which is good for Burgundy because while general red wine consumption just keeps going down, white is holding firm, and sparkling is going up.\n\nAlso, the reds that come out of Burgundy are, according to Mr Labet, the kind consumers increasingly want, as they are typically lighter than New World reds.\n\n“What is interesting to see is that there is a strong de-consumption of what we call the big reds, made in the US. Wines with a lot of alcohol, aged in new wood.”\n\nLess sun and lower temperatures in Burgundy, even with climate change, means less sugar in the grapes and lower alcohol content.\n\nMr Labet remembers when, for 18 months of his first presidency, Donald Trump hit European wine with a 25% import tariff during a dispute over airlines.\n\n“We were hostages of that situation, and it really did affect our sales to the US. We had a drop of about 50% of our exports to the US.”\n\nRegarding the current 10% Trump tariff, he predicts that French wine producers and US merchants will split the cost of the new import duty between them in order to maintain sales.\n\nBut what will be the impact if, in July, Trump decides to increase the tariff on all European Union exports to 20%, as he has threatened to do? “We will go back to the 2019 situation where the market was almost stopped,” says Mr Labet.\n\nFor French wines in general, things could be even worse.\n\n“When President Trump raised import duties by 25% for one-and-a-half years of his first mandate, we lost about $600m [£450m] very quickly,” says Jerome Bauer, president of the French National Wines and Spirits Confederation.\n\n“But back then Champagne wasn’t included, and neither were wines stronger than 14 degrees of alcohol. So you can see the scale of the threat today.”\n\nThe solution Mr Bauer is backing is free trade. No tariffs. But you’d expect him to say that, given that France and Europe run a big trade surplus with the US when it comes to wines and spirits.\n\nMore surprising, perhaps, is the opinion of his American competitors in California and Oregon who, you might think, would be cracking open something a bit special to celebrate.\n\n“This looks horrible from our perspective. We don’t like it one bit,” says Rex Stoltz, vice-president of industry relations at Napa Valley Vintners, which represents 540 wineries in the sunny slopes of California’s most famous wine region.\n\n“Wine is an international product. Even here in the Napa Valley, our wineries primarily get their corks from Portugal, and their oak barrels, a key component in winemaking, from France.\n\nMr Stoltz adds: “They’re already expensive and the potential is that they will get more expensive.”\n\nAlso, trade wars cut both ways. He says the tariffs announced against Canada are having a devastating impact on US wine exports.\n\n“Canada is the most important export market for California wines, and one of the top export markets for Napa Valley wines. Right now, there are zero Napa Valley wines on the shelves of stores in Canada.\n\n“They’ve removed all American alcohol beverage products from their store shelves!”\n\nMr Stoltz adds: “We just want to compete on an even playing field with our friends and neighbours all over the world. That’s our ask and that’s our hope.”\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"Burgundy is one of the most prestigious wine regions in France, and the US is its biggest export market. But now, Donald Trump&#8217;s tariffs are threatening to price European wine out of the American marketplace. Crouched in cold mud under a thin Spring rain, vineyard employee Élodie Bonet snaps off unwanted vine shoots with her [&#8230;]\n\n\nThe post Winemakers finding Trump&#8217;s tariffs hard to swallow appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/05/26/winemakers-finding-trumps-tariffs-hard-to-swallow/","image":"https://ichef.bbci.co.uk/news/480/cpsprodpb/a9f5/live/9486e5c0-3580-11f0-9b2c-138cad92aeb3.jpg.webp","video":null,"publish_date":"2025-05-26 23:07:52","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":0.026},{"id":325185250,"title":"Undocumented Irish are not attending routine US immigration meetings over deportation fears","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nIrish people are choosing not to show up to meetings with the Immigration and Customs Enforcement agency.Alamy\n\nThe Morning Lead\n\nUndocumented Irish are not attending routine US immigration meetings over deportation fears\n\nMany believe they can “disappear into the economy” if they avoid meeting ICE agents. \n\n12.06am, 27 May 2025\n\nShare options\n\nUNDOCUMENTED IRISH PEOPLE living in the US are not attending routine meetings with immigration enforcement agents out of fear that they may be deported.\n\nMany believe that they can “disappear back into the economy” where they have been evading deportation for years. Others avoid meeting with immigration officials on advice from their solicitor.\n\nThis is according to two Irish-American lawyers who assist Irish-born people who are living in the US.\n\nThe lawyers told The Journal that these meetings with the Immigration and Customs Enforcement (ICE) agency are typically described to attendants as being informal, but can have serious outcomes.\n\nAccording to Brian O’Dwyer, a veteran Irish-American lawyer and a well-known immigration activist, there have been people who attend the ‘routine’ meetings “and have the handcuffs put on them” immediately.\n\nHowever, if someone doesn’t turn up to the meeting, a warrant can be issued for them and eventually, ICE agents can obtain a court-ordered deportation notice. \n\nThe O’Dwyer & Bernstein lawyer in New York said the meetings are currently viewed as a legal “grey area”. Some Irish people try to avoid them and blend away into the workforce or informal economy, he said. \n\nMost undocumented Irish people living in the US have overstayed a visa and are considered ‘low-hanging fruit’ by ICE officials, it is understood.\n\nThese visa overstayers are not entitled to appear before a judge if detained by immigration officers, and typically are deported within days. The group commonly come to ICE’s attention after being ticketed by police for minor traffic infractions.\n\nBoston-based Irish-American immigration lawyer John Foley told The Journal: “I wouldn’t encourage any individual to speak to ICE without first speaking to a lawyer.”\n\nAdvertisement\n\nFoley, who is representing a Donegal man facing deportation despite waiting three years for a green card application, said even if people discuss their meetings with a lawyer, they are not guaranteed their desired outcome. \n\nAccording to the Legal Aid Society in New York, ICE agents require immigrants to appear for regular appointments to confirm that they are still living at the same location and that they are not a security risk.\n\n“It is important to show up to your ICE appointments,” their website says. “If you miss an appointment, ICE may try to detain you.”\n\nO’Dwyer said the detention process amounts to “deliberate cruelty” and that some people are picked up and “put into a centre for days on end”. Many people who have been detained by ICE have reportedly not had access to counsel either.\n\nThe lawyer said there was “no question” that the manner in which ICE is detaining people is an attempt to intimidate people before deporting them. He said that many Irish citizens facing deportation are “keeping it quiet” in hopes that they can return again.\n\nO’Dwyer said there is no evidence to suggest that there have been any diplomatic communications between the US and Ireland, as there have been in the past, that seek to minimise the deportation of undocumented Irish people in the US.\n\n“I’m unaware of what the Trump administration has done that would give any satisfaction to Irish people,” O’Dwyer said, adding that ICE does not seem to have a “preference” for who faces deportation.\n\nSpeaking to The Journal previously, Foley said he had his request for his client’s release under 24/7 monitoring with an ankle bracelet rejected, without hesitation. He said there was “no flexibility” from the ICE officials.\n\nHe noted that agents had been willing to compromise before the second Trump administration.\n\nFoley said fear of deportation is growing among Irish immigrants and other diasporas in the US.\n\nSince January, the Trump administration has intensified immigration enforcement, carrying out widespread arrests at immigration courts across the US. Over 70,000 people have been detained and deported since Trump took office in January.\n\nIncreased deportations have impacted many Irish nationals living in the US, sparking concern among communities and advocacy groups about family separations and legal rights.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nMuiris O'Cearbhaill\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Undocumented Irish are not attending routine US immigration meetings over deportation fears”.\n\nRecipient's Email\n\nFeedback on “Undocumented Irish are not attending routine US immigration meetings over deportation fears”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nBrian O'Dwyer\nDeportation\nDonald Trump\n\nImmigration\n\nThe Morning Lead\n\nUndocumented Irish\nUnited States\n\nUS Immigration and Customs Enforcement\n\nNews in 60 seconds\n\n27 people hospitalised after car struck pedestrians at Liverpool Premier League victory parade\n\nHamas source says group accepts mediators' latest Gaza ceasefire proposal for 70-day truce\n\nhousing delivery\nFines for housing developers who miss deadlines? Wouldn't work in Ireland, say experts\n\nTwo teenagers jailed for nine years for murder of gunman Tristan Sherry at Blanchardstown steakhouse\n\nJozef Puska told brother he 'cut' a woman and it was 'probably bad', court hears\n\ncold war of words\nKremlin says Trump 'emotional' after US President called Putin 'absolutely crazy' over Ukraine strikes\n\nCork Circuit Criminal Court\nMan jailed for hijacking Cork taxi and bundling 75-year-old driver out of the vehicle\n\n27 people hospitalised after car struck pedestrians at Liverpool Premier League victory parade\n\nFrench president Macron dismisses wife’s ‘slap’ caught on camera as 'playful teasing'\n\nMurder Investigation\nGardaí begin new search in Offaly relating to 1996 disappearance of Fiona Pender\n\ncold war of words\nKremlin says Trump 'emotional' after US President called Putin 'absolutely crazy' over Ukraine strikes\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Many believe they can “disappear into the economy” if they avoid meeting ICE agents.","url":"https://www.thejournal.ie/undocumented-irish-not-attending-us-immigration-meetings-6714969-May2025/","image":"https://img2.thejournal.ie/article/6714969/river/?height=400&version=6715218","video":null,"publish_date":"2025-05-26 23:05:05","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":-0.03},{"id":325180394,"title":"King Charles Arrives in Canada for Royal Visit Amid Tensions Over Trump’s Annexation Comments","text":"King Charles III arrived in Ottawa to open Canada’s parliament in a historic and symbolic visit.\nThe visit is seen as a response to Donald Trump’s repeated threats to annex Canada and make it the 51st US state.\nCanadian Prime Minister Mark Carney pledged to reduce reliance on the US and strengthen ties with other allies.\n\nKing Charles III arrived in Ottawa for a historic visit to open Canada’s parliament, a brief trip seen as part of the pushback against US President Donald Trump’s annexation threats.\n\nThe 76-year-old monarch, who is Canada’s head of state as part of the Commonwealth, was greeted at the airport by Prime Minister Mark Carney, who has invited him to give an address opening Canada’s new legislature.\n\nCharles, making his first visit to Canada since his coronation, has never commented on Trump’s repeated talk of making Canada the 51st US state.\n\nTrump has slapped tariffs on Canadian goods including sector-specific levies on autos, steel and aluminium, rattling the Canadian economy, although he has suspended some of them pending negotiations.\n\nCarney has said his newly-elected government has been given a mandate “to define a new economic and security relationship with the United States”, a neighbour he believes Canada “can no longer trust”.\n\nHe has promised to curb reliance on trade with the United States by boosting internal commerce while forging deeper economic ties with allies overseas.\n\nA government statement described the visit as “a momentous and historic occasion that underscores Canada’s identity and sovereignty as a constitutional monarchy”.\n\nTrump repeatedly returned to his annexation musings during Carney’s Oval Office visit earlier this month, insisting it would be a “wonderful marriage”.\n\nCarney stood his ground, saying Canada was “never for sale”.\n\nTrump’s envoy to Canada, ambassador Pete Hoekstra, dismissed the notion that inviting Charles to open parliament was an effective way to make a statement on annexation.\n\n“If there’s a message in there, there’s easier ways to send messages. Just give me a call. Carney can call the president at any time,” he told the public broadcaster CBC last week.\n\nHoekstra added that he sees the annexation issue as being “over”.\n\n“Move on. If the Canadians want to keep talking about it — that’s their business.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nKey Points King Charles III arrived in Ottawa to open Canada’s parliament&#8230;\n\n\nThis Post: King Charles Arrives in Canada for Royal Visit Amid Tensions Over Trump&#8217;s Annexation Comments first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/king-charles-arrives-in-canada-for-royal-visit-amid-tensions-over-trumps-annexation-comments/","image":"https://images.sbs.com.au/dims4/default/5ebb89d/2147483647/strip/false/crop/3000x1378+0+485/resize/1234x567!/format/jpeg/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F63%2F84%2Fd6408c714edaa08c5c37341d84cf%2F20250527140802784864-origin","video":null,"publish_date":"2025-05-26 23:03:13","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.188},{"id":325180028,"title":"Democrats' Support May Be Eroding Among Strongest Backers—Data","text":"There has been more activity by Democrats in Virginia on social media speaking out against the Trump administration than there has been to support the Democratic Party's candidate in this year's gubernatorial race, according to analysis for Newsweek by Impact Social.The data set shows that while former Representative Abigail Spanberger is the frontrunner for the state's top seat, the Democratic Party in the Old Dominion state has spent more time in recent months interacting negatively with President Donald Trump's policies, including the use of the Department of Government Efficiency (DOGE).Spanberger, 45, most recently served as a congresswoman for the state's 7th Congressional District from 2019 to 2025 and is a former intelligence officer.Why It MattersViriginia was once a Republican-leaning state, but suburban shifts and growth in the northern region of the state propelled it leftward over the past two decades. Last November, former Vice President Kamala Harris carried the state by less than 6 points against Trump, down from former President Joe Biden's 10-point win in 2020.However, the prospect of eroding support among reliable Democratic voters in Virginia could have repercussions beyond the state, potentially signaling vulnerability in key battlegrounds for upcoming elections.Virginia serves as a microcosm for broader national trends, with historical analysis showing that demographic and shifts in attitude among voters often precede changes elsewhere in the country.The trend that Impact Social found indicates that Spanberger may lack the key support needed to move her campaign in a winning direction.\"This isn't apathy, it's disengagement. Democrat are showing up online, just not for her,\" Phil Snape of Impact Social said in his analysis.What To KnowThe data shared shows that conversations surrounding Spanberger online dropped from about 9 percent in February and March to 5 percent in April and May discussions.This data is collected from humans, not algorithms, Impact Social pointed out in the analysis.Similar data shows negative sentiment expressed in social media discussions surrounding the former congresswoman remained around -45 and -47.\"Our sentiment insight reveals a serious vulnerability: Spanberger is struggling to energize her own base,\" Snape explained.Other data sets compared to conversations surrounding Spanberger show that her Republican opponent, Virginia's Lieutenant Governor Winsome Earle-Sears, saw a decrease in her net sentiment from +7 in February and March to -3 in April and May.\"But here again, it's Democrats driving the negativity, tying Earle-Sears to Governor [Glenn] Youngkin and the broader GOP VA brand,\" Snape wrote.Comparatively, negative conversations on social media regarding Trump from Democrats, which were about 360,000 and a had a net of -12, according to Impact Social, show the Democratic Party's interest in the upcoming midterms.\"Key issues include corruption, Gaza, tariffs, immigration, democracy and DOGE. The tone is unmistakably combative and energized, the kind of oppositional vigor we tracked across blue leaning constituencies throughout 2024,\" the analysis said.What People Are SayingPhil Snape of Impact Social said in the analysis: \"How Democrats perform and whether they can energize their base will shape national narratives around turnout, enthusiasm and messaging heading into the next cycle. And that's what makes our latest analysis so troubling from a democratic perspective.\"He added: \"There's more at stake here than just Virginia. As one of the highest-profile off-year contests this race will be read as a bellwether for the 2026 midterms. The Democratic base is active, mobilized and clear-eyed about the states. So why aren't they rallying behind their own candidate?\"What the Polls ShowsA poll from Roanoke College last week showed Spanberger had a double-digit lead over Earle-Sears. The poll took data from the 658 Virginians who were surveyed between May 12 to 19, Newsweek previously reported.While 43 percent of respondents planned to vote for Spanberger, only 26 percent indicated they planned to vote for Earle-Sears.The survey also showed that 41 percent of Virginians view Spanberger favorably while 40 percent view her unfavorably. That's compared to a 32 percent viewing Earle-Sears favorably while 48 percent view her unfavorably.The same poll showed that favorability is at an all-time low for GOP Governor Glenn Youngkin, with 50 of respondents viewing him unfavorably.The poll had a margin of error of plus or minus 5.25 percentage points.A poll commissioned by business advocacy group Virginia FREE and conducted by Pantheon/HarrisX pointed to a closer race.That poll found Spanberger leading by only four points—52 percent of voters supporting her, and 48 percent backing Earle-Sears. The poll surveyed 1,000 likely voters from May 9 to 13, and had a margin of error of plus or minus 3.1 percentage points.What Happens Next?The results in Virginia will be closely watched for signals about broader national trends as the 2026 midterm cycle progresses.The Virginia gubernatorial election will be held on November 4, 2025. The Cook Political Report currently classifies the race as Lean Democratic, meaning it is \"considered competitive\" but that Democrats do have \"an advantage.\"","summary":"There's been more activity by Democrats in Virginia online speaking out against the Trump administration than support for the Democratic Party's candidate in this year's governor race.","url":"https://www.newsweek.com/virginia-democrats-support-may-eroding-among-strongest-backers-data-2077212","image":"https://d.newsweek.com/en/full/2651780/virginia-gubernatorial-candidate-abigail-spanberger-speaks.jpg","video":null,"publish_date":"2025-05-26 23:02:00","author":"Hollie Silverman","authors":["Hollie Silverman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.252},{"id":325190622,"title":"Demand for trips to US slumps among tariff-hit countries, says Trivago","text":"Holidaymakers in countries hit hardest by Donald Trump’s trade tariffs are shunning America for their trips abroad, while UK and US travellers are increasingly choosing to staycation amid economic worries, according to hotel search site Trivago.\n\nJohannes Thomas, chief executive of Trivago, told the PA news agency the group was seeing double-digit declines in bookings to the US from travellers in Canada, Mexico and Japan.\n\nDemand among Germans for trips to the US is also down heavily, with a single-digit decline in bookings for accommodation in America, although the firm has not seen a significant change in demand from Britons travelling to the US.\n\nMr Trump has levied tariffs on more than 180 countries, with Canada and Mexico among the first to be impacted – although he later paused many of his so-called “reciprocal” tariffs for 90 days following financial market turmoil.\n\nGermany – the largest economy in Europe – is set to be hit particularly hard by the US tariffs and the threat to its exports.\n\nMr Thomas added that US holidaymakers are also paring back their holiday spend in the face of economic uncertainty caused by Mr Trump’s move to unleash higher tariffs on countries across the world.\n\nMr Thomas told PA: “If you look at the different markets, the US tends to be the more sensitive one to uncertainty.\n\n“People there are much more connected to the stock market and have a higher amount of debt, so are more sensitive to economic developments.”\n\nBookings on the site show Americans are spending less on their trips, while there is higher demand for cheaper hotels and lower star categories.\n\nGerman-based Trivago, which is majority-owned by Expedia, said that the economic worries caused by the trade war has also seen a trend for many travellers across the US and UK to opt for domestic trips.\n\nRecent booking data shows that in the UK, there has been a 25% year-on-year leap in demand for domestic travel for the key months of July to September.\n\n“In times of uncertainty, people stay closer to home,” said Mr Thomas.\n\nThe group said London is topping the destinations for British staycationers, followed by Edinburgh, where demand is up by nearly 30%; York; Blackpool; and Manchester.\n\nBut Mr Thomas said that among Britons, bookings have remained robust despite clouds over the wider global and UK economy, with a 16% increase in total travel demand for the peak quarter to September.","summary":"The hotel search and price comparison site said that US and UK holidaymakers are choosing more domestic stays in the face of economic uncertainty.","url":"https://www.independent.co.uk/news/business/demand-for-trips-to-us-slumps-among-tariffhit-countries-says-trivago-b2758155.html","image":"https://static.independent.co.uk/2025/05/27/00/579db4aa5728a26cbda51063cc554818Y29udGVudHNlYXJjaGFwaSwxNzQ4MDEyNDQ2-2.79984834.jpg?width=1200","video":null,"publish_date":"2025-05-26 23:01:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","category":"politics","source_country":"gb","sentiment":0.264},{"id":325185418,"title":"Demand for trips to US slumps among tariff-hit countries, says Trivago","text":"Holidaymakers in countries hit hardest by Donald Trump’s trade tariffs are shunning America for their trips abroad, while UK and US travellers are increasingly choosing to staycation amid economic worries, according to hotel search site Trivago.\n\nJohannes Thomas, chief executive of Trivago, told the PA news agency the group was seeing double-digit declines in bookings to the US from travellers in Canada, Mexico and Japan.\n\nDemand among Germans for trips to the US is also down heavily, with a single-digit decline in bookings for accommodation in America, although the firm has not seen a significant change in demand from Britons travelling to the US.\n\nMr Trump has levied tariffs on more than 180 countries, with Canada and Mexico among the first to be impacted – although he later paused many of his so-called “reciprocal” tariffs for 90 days following financial market turmoil.\n\nGermany – the largest economy in Europe – is set to be hit particularly hard by the US tariffs and the threat to its exports.\n\nMr Thomas added that US holidaymakers are also paring back their holiday spend in the face of economic uncertainty caused by Mr Trump’s move to unleash higher tariffs on countries across the world.\n\nMr Thomas told PA: “If you look at the different markets, the US tends to be the more sensitive one to uncertainty.\n\n“People there are much more connected to the stock market and have a higher amount of debt, so are more sensitive to economic developments.”\n\nBookings on the site show Americans are spending less on their trips, while there is higher demand for cheaper hotels and lower star categories.\n\nGerman-based Trivago, which is majority-owned by Expedia, said that the economic worries caused by the trade war has also seen a trend for many travellers across the US and UK to opt for domestic trips.\n\nRecent booking data shows that in the UK, there has been a 25% year-on-year leap in demand for domestic travel for the key months of July to September.\n\n“In times of uncertainty, people stay closer to home,” said Mr Thomas.\n\nThe group said London is topping the destinations for British staycationers, followed by Edinburgh, where demand is up by nearly 30%; York; Blackpool; and Manchester.\n\nBut Mr Thomas said that among Britons, bookings have remained robust despite clouds over the wider global and UK economy, with a 16% increase in total travel demand for the peak quarter to September.","summary":"The hotel search and price comparison site said that US and UK holidaymakers are choosing more domestic stays in the face of economic uncertainty.","url":"https://www.standard.co.uk/business/business-news/demand-for-trips-to-us-slumps-among-tariffhit-countries-says-trivago-b1229797.html","image":"https://static.standard.co.uk/2025/05/27/00/579db4aa5728a26cbda51063cc554818Y29udGVudHNlYXJjaGFwaSwxNzQ4MDEyNDQ2-2.79984834.jpg?width=1200","video":null,"publish_date":"2025-05-26 23:01:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","category":"politics","source_country":"GB","sentiment":0.264},{"id":325188566,"title":"Letters: Knowledge is the best tool to help the unhoused","text":"Knowledge best tool\nagainst homelessness\n\nAs a single mother with two small children under the age of 2, I was homeless in 2019 in Santa Clara County.\n\nVarious agencies screened me multiple times, even to be considered for emergency shelter for myself and my children. As a property manager, I want to inform others that there are housing options for them, such as below-market-rate apartments, tax credits, HUD, property-based vouchers, and low-income and affordable housing. The goal is to have this information more readily available to the community.\n\nMonica Cortez\n\nCommunity should come\ntogether for unhoused\n\nThe homeless population has increased monumentally. California has the highest unhoused population in the United States.\n\nI did my own research, and I saw that in San Jose, there has been a decrease in the number of unhoused people over the past two years. However, that doesn’t mean there has been a decrease in Santa Clara County. If we can figure out a plan to get more homeless shelters, ones with clothes, nurses and food, we can decrease the population in California.\n\nCommunities can help out and make a difference. We can ask for clothes from the community and whether any hospitals are willing to help out by sending nurses to check on unhoused residents.\n\nAs a community, we can advocate for people who don’t get a voice because society deems them less than.\n\nMachelle Ruiz\n\nClimate change is more\nexpensive than solution\n\nRe: “Consumers will pay if we punish Big Oil” (Page A8, May 11).\n\nDan Walters makes a commonly heard argument among climate change deniers that reducing carbon emissions is too expensive for consumers. Yet we all know climate change is an urgent threat that is already costing many billions of dollars every year. An extra 23 cents per gallon for gasoline due to cap and trade is relatively small, especially compared to the normal swings in gasoline prices due to global oil supply changes.\n\nCurrent policies that reduce carbon emissions are working, just not working fast enough. Electric vehicles and renewable energy are lowering the cost of energy. Yet Big Oil is powerful and very effectively resists all actions that reduce the use of fossil fuels. Action against climate change is so urgent that we should look seriously at all options and not scare consumers about options that will have a significant impact on reducing emissions.\n\nWe need a pause on\nlicense plate cameras\n\nLicense plate cameras must balance safety and privacy. I am torn myself.\n\nHowever, my trust in related data being limited to local police investigations is severely shaken by the current federal administration’s activities.\n\nDOGE is compiling a centralized database of widely disparate information on citizens. Their collection includes the Department of the Treasury, Social Security Administration, VA, Consumer Financial Protection Bureau, Medicare and Medicaid Services, the IRS and more.\n\nA recent executive order demands “unfettered access to comprehensive data from all state programs that receive federal funding, including third-party databases.”\n\nMuch is being slowed in courts, but outcomes there are uncertain, as is the administration’s respect for court orders.\n\nFederal pressures for access to who of us went where are highly likely. The safest course for local communities is a moratorium on collecting license plate information until protections of this data are established.\n\nAndreas Paepcke\n\nNational malaise is\njust what Trump ordered\n\nWe are suffering from a national malaise as Donald Trump intended.\n\nCreate a daily barrage of misinformation, insults, preening, tantrums, constitutional grievances and corruption so we will be overwhelmed by his chaos and simply retreat and allow him a free hand to enrich himself and his friends, embarrass us on a global scale, and dismantle the government.\n\nFor 250 years, we naively believed we were impervious to the upheaval of oligarchs and dictators. Now we know how it happens. We were too comfortable and self-assured to notice as we brought doom upon ourselves. And now we suffer from fatigue and impotence as we watch from the sidelines.\n\nClaudia Parker","summary":"Also: Come together &#124; Climate solution &#124; License readers &#124; National malaise. Mercury News reader letters to the editor for May 27, 2025.","url":"https://www.mercurynews.com/2025/05/26/letters-knowledge-best-tool-help-unhoused/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/SJM-L-SWEEP-0513-12.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-26 23:00:58","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.197},{"id":325188358,"title":"4 upcoming SCOTUS decisions that may destroy our rights","text":"Normally, by this point in the Supreme Court term, we’re all acutely aware of the big cases that remain, steeling ourselves for the late June opinion drop so we can find out what rights we no longer have. \n\nThose big cases are all still there, still poised to wreck us, but this year things have been obscured by President Donald Trump’s near-constant running to the highest court for emergency relief because lower courts keep ruling against him. \n\nOn this holiday weekend, let’s step back, breathe, and remind ourselves of the horrors that await. \n\nFree Speech Coalition v. Paxton: A bunch of tradcaths will decide how hard it should be to look at porn\n\nIn 2023, Texas passed an age-verification law that required websites where “more than one-third of which is sexual material harmful to minors” to verify that the person accessing the material is at least 18. \n\nYou can already see the problem here. What does “material harmful to minors” mean? Who decides? A lower court judge found the law unconstitutional, but it was reversed by the Fifth Circuit Court of Appeals. So, the law has been in effect since March of last year, with the main practical effect being that Texans can’t access Pornhub unless they use a VPN to hide their location. \n\nThe plaintiffs, a group of adult entertainment websites, argue that the age-verification law violates the First Amendment because, while it is theoretically aimed only at restricting access to minors, the hoops of age verification will limit adult access to legal adult speech. \n\nDuring oral arguments in January, the usual SCOTUS suspects fretted about teens and technology and pornography, but it isn’t clear how the justices will come down. The vagueness of Texas’ law could restrict minors from accessing information about reproductive health or LGBTQ+ issues. And given that conservatives already believe that the mere existence of queer characters in books sexualizes children, it’s not fearmongering to assume that, if this law is upheld, we’ll see more conservative states passing similar laws. \n\nKennedy v. Braidwood Management, Inc.: A bunch of tradcaths will decide whether some preventive care is too sexy\n\nThe Affordable Care Act requires insurers to cover several preventive care services at no cost. Some of those services make conservatives very sad, however, because they make it less likely you will die from having sex. \n\nSo, a motley combo of individuals and Christian businesses sued in Texas to invalidate all preventive care services, saying it violated their religious freedom to require coverage for things like HIV prevention drugs, HPV vaccines, and contraception. They made sure to get the case in front of Judge Reed O’Connor, who has made a career out of trying to kill Obamacare. \n\nAlong with the religious freedom argument, the plaintiffs also argued that the Preventive Services Task Force, which is responsible for making care recommendations, violated the Constitution’s Appointments Clause. \n\nO’Connor performed as expected, giving the plaintiffs a win on both arguments. He issued a nationwide injunction—which conservatives used to love until it started being applied to Trump—blocking all preventive care requirements since the start of the ACA in 2010. \n\nOnly the Appointments Clause argument is before the Supreme Court, and it appeared during oral arguments in April that the court was inclined to find the structure of the task force was constitutional. But it also asked for additional briefing following the oral arguments, so who can say? \n\nNo matter the result here, it won’t be the end of conservative attacks on the ACA. \n\nMahmoud v. Taylor: A bunch of tradcaths will decide whether your children can read books about dogs that go to Pride parades\n\nThis might have been the worst oral argument of the year.\n\nSeveral conservative parents in Montgomery County, Maryland, objected to the school district’s inclusion of LGBTQ+ books in the English Language Arts curriculum. Previously, parents were able to opt their children out of reading books like “Pride Puppy,” a terrifying and obscene alphabet book about … tracking down a lost dog at a Pride parade. The horror. \n\nWhen the district decided not to allow parents to opt their children out of learning about the existence of LGBTQ+ people, the parents sued. During oral arguments, Justice Neil Gorsuch claimed to have read “Pride Puppy,” describing it as “the one where [students] are supposed to look for the leather and things—and bondage.” \n\nHe went on to ask the school district’s lawyer to confirm that the students were also supposed to be looking for a sex worker within the pages of “Pride Puppy.” Reader, there are no sex workers in “Pride Puppy.” \n\nGorsuch sounded ridiculous here, flailing through whatever gay stereotypes his brain coughed up, but his underlying worldview—that any positive discussion of LGBTQ+ issues or people is somehow inherently sexual, designed to entrap innocent children—is one widely shared by conservatives. \n\nJustice Samuel Alito spent most of his argument complaining that it’s unfair that the books chosen by the district show that same-sex marriage is a good thing.\n\nIt looks pretty likely that there are at least five votes to allow parents to opt out of any instruction, no matter how anodyne, about LGBTQ+ people. And after that? More Florida-style “Don’t Say Gay” book bans across the country. \n\nU.S. v. Skrmetti: A bunch of tradcaths will decide whether transgender minors can get health care\n\nSeveral states have passed laws banning gender-affirming health care for minors, with Tennessee’s ban being the first to make it to the Supreme Court. The law prohibits the administration of puberty blockers, hormone therapies, and gender-affirming surgeries to minors—well, only trans minors.\n\nIt’s precisely this carveout that makes clear that Tennessee’s law discriminates on the basis of sex. Puberty blockers, for example, cannot be prescribed for a child experiencing gender dysphoria, but they can be prescribed to a cisgender child to treat precocious puberty. That’s a violation of the Equal Protection Clause of the 14th Amendment.\n\nWhen this case started during the Biden administration, the Department of Justice joined the lawsuit thanks to a law allowing the government to intervene in certain equal protection cases. When the Supreme Court took up the case, it took up only the government’s petition for review on the equal protection question.\n\nIn February, the Trump administration reversed course and told the court that it does not believe Tennessee’s law violates the Constitution, making the literal opposite argument from what the government made at oral argument in December 2024. \n\nThe Trump administration asked the court to decide the case regardless—because of course it did. You really couldn’t ask for a much better group of hardcore anti-trans justices eager to enshrine discrimination into law. \n\nAnd from the sound of the oral argument, it seems likely that that’s exactly what will happen.","summary":"Normally, by this point in the Supreme Court term, we’re all acutely aware of the big cases that remain, steeling ourselves for the late June opinion drop so we can find out what rights we no longer have. \n\n\n\nThose big cases are all still there, still poised to wreck us, but this year things have been obscured by President Donald Trump’s near-constant running to the highest court for emergency relief because lower courts keep ruling against him. \n\n\n\nOn this holiday weekend, let’s step back, breathe, and remind ourselves of the horrors that await. \n\n\n\nFree Speech Coalition v. Paxton: A bunch of tradcaths will decide how hard it should be to look at porn\n\nIn 2023, Texas passed an age-verification law that required websites where “more than one-third of which is sexual material harmful to minors” to verify that the person accessing the material is at least 18. \n\n\n\nYou can already see the problem here. What does “material harmful to minors” mean? Who decides? A lower court judge found the law unconstitutional, bu","url":"https://www.dailykos.com/story/2025/5/26/2323525/-4-upcoming-SCOTUS-decisions-that-may-destroy-our-rights?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1435179/story_image/AP25135711919958.jpg?1747855483","video":null,"publish_date":"2025-05-26 23:00:15","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.276},{"id":325189874,"title":"Top Trump ally publicly contradicts him on one of his biggest campaign promises","text":"White House adviser David Sacks acknowledged during his \"All-In\" podcast over the weekend that the GOP’s \"Big, Beautiful Bill\" will involve major reductions to Medicaid. \n\nHis statement contradicts repeated assurances from President Donald Trump and other Make America Great Again (MAGA) allies that no such cuts would be made.\n\n“This bill cuts $880 billion from Medicaid over a decade,\" admitted Sacks, who serves as Trump’s point person on Artificial Intelligence and cryptocurrency, in remarks first highlighted by Rolling Stones. \n\nREAD MORE: 'Graceless soulless ghoul': JD Vance buried over comment about Biden’s cancer diagnosis \n\n85 million Americans currently rely on Medicaid for free or low-cost health care. The Republican-backed bill passed the House by a slim margin on Thursday, with a final vote of 215 to 214.\n\nDuring the podcast, Sacks mentioned that Trump lacked the necessary support in the House to push through deeper cuts. However, host Jason Calacanis countered by pointing out that the president has never hesitated to strong-arm his way into achieving his goals.\n\nOn Sunday, Speaker Mike Johnson (R-La.) had denied reports that the bill included any Medicaid cuts. He told CBS News that Republicans were focused on addressing inefficiencies rather than reducing the program’s funding.\n\nThe Medicaid reductions in the GOP bill are largely driven by the introduction of new work requirements for eligibility. This policy shift could result in millions of Americans losing access to health coverage. \n\nREAD MORE: Struggles to 'even finish a sentence': Behind the obvious signs of Trump's growing dementia \n\nAccording to projections by the nonpartisan Congressional Budget Office, around 10 million people could be dropped from the program by 2034 if the measure is implemented.\n\nThe legislation has yet to clear the U.S. Senate, where it is expected to face revisions.\n\nAlterNet reached out to the Speaker's office for comment.","summary":"White House adviser David Sacks acknowledged during his \"All-In\" podcast over the weekend that the GOP’s \"Big, Beautiful Bill\" will involve major reductions to Medicaid. \n\nHis statement contradicts repeated assurances from President Donald Trump and other Make America Great Again (MAGA) allies that no such cuts would be made.\n\n“This bill cuts $880 billion from Medicaid over a decade,\" admitted Sacks, who serves as Trump’s point person on Artificial Intelligence and cryptocurrency, in remarks first highlighted by Rolling Stones. \n\nREAD MORE: 'Graceless soulless ghoul': JD Vance buried over comment about Biden’s cancer diagnosis \n\n85 million Americans currently rely on Medicaid for free or low-cost health care. The Republican-backed bill passed the House by a slim margin on Thursday, with a final vote of 215 to 214.\n\nDuring the podcast, Sacks mentioned that Trump lacked the necessary support in the House to push through deeper cuts. However, host Jason Calacanis countered by pointing out that the president has ","url":"https://www.alternet.org/trump-big-beautiful-bill-medicaid/","image":"https://www.alternet.org/media-library/image.jpg?id=54843042&width=1200&height=600&coordinates=0%2C92%2C0%2C93","video":null,"publish_date":"2025-05-26 22:59:23","author":"Ailia Zehra","authors":["Ailia Zehra"],"language":"en","category":"politics","source_country":"us","sentiment":0.028},{"id":325182502,"title":"Germany Confirms Ukraine Is Free to Use Long-Range Weapons Against Russia","text":"German Chancellor Friedrich Merz on Monday confirmed that Ukraine is now free to strike military targets deep inside Russia using Western-supplied weapons, as the Kremlin warned that such a move could sabotage fragile peace negotiations.\n\nThe German chancellor added that Kyiv must be able to use its weapons to target Russian military infrastructure when Moscow is attacking civilian targets in Ukraine.\n\n“A country that can only confront an aggressor on its own territory is not defending itself adequately,” Merz said.\n\nThe airstrike came just hours ahead of the third and final prisoner exchange between Russia and Ukraine, in which both sides released hundreds of captured soldiers as part of efforts to de-escalate the conflict.\n\nThe prisoner swap was the only meaningful outcome of a recent summit in Turkey, which marked a high-profile resumption of direct talks between Russian and Ukrainian negotiating teams. Hopes that presidents Vladimir Putin and Volodymyr Zelenskyy would attend in person—including expectations voiced by President Donald Trump—were dashed when Putin withdrew at the last minute, prompting Zelenskyy to follow suit.\n\nIn their absence, lower-level officials led the negotiations, which concluded with a prisoner exchange without a broader cease-fire agreement.\n\n“I’m not happy with what Putin is doing. He’s killing a lot of people. And I don’t know what ... happened to Putin,” Trump told reporters at the airport in New Jersey before boarding Air Force One.\n\nThe current German administration no longer discloses details of the weapons it provides to Ukraine, citing operational security.\n\nZelenskyy, for his part, has long urged NATO allies to lift restrictions on Ukraine’s usage of long-range weapons, saying that the ability to strike across the border would be a game-changer in pushing Russia toward a negotiated peace.\n\nTrump expressed his displeasure with Putin over the latest wave of strikes against Ukraine.\n\nIn response, the Kremlin thanked Trump for trying to broker an end to the long-running war without directly addressing the airstrike.\n\n“We are really grateful to the Americans and to President Trump personally for their assistance in organizing and launching this negotiation process,” Peskov told reporters when asked to comment about Trump’s remarks. “Of course, at the same time, this is a very crucial moment, which is associated, of course, with the emotional overload of everyone absolutely and with emotional reactions.”","summary":"Germany has confirmed no more range limits on Ukraine’s Western weapons, drawing Kremlin's warnings that the move endangers cease-fire talks.","url":"https://www.theepochtimes.com/world/germany-confirms-ukraine-is-free-to-use-long-range-weapons-against-russia-drawing-kremlin-rebuke-5863621","image":"https://img.theepochtimes.com/assets/uploads/2025/05/26/id5863666-GettyImages-2213751387-300x180.jpg","video":null,"publish_date":"2025-05-26 22:57:09","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","category":"politics","source_country":"us","sentiment":-0.177},{"id":325188848,"title":"Hotel booking giant claims tourists are now shunning American holidays","text":"Holidaymakers from countries most affected by US President Donald Trump's trade tariffs are opting against vacations in America, while UK and US travellers are increasingly choosing staycations amid economic concerns, according to hotel search site Trivago.\n\nTrivago's chief executive, Johannes Thomas, revealed to the PA news agency that the group has observed double-digit declines in bookings to the US from travellers in Canada, Mexico, and Japan – countries significantly impacted by the trade disputes. \n\nThis shift in travel patterns suggests a potential link between economic policies and tourism choices, with travellers from affected nations seemingly diverting their holiday spending elsewhere. Simultaneously, rising economic anxieties appear to be influencing UK and US travellers to favour domestic holidays, contributing to a growing staycation trend.\n\nDemand among Germans for trips to the US is also down heavily, with a single-digit decline in bookings for accommodation in America, although the firm has not seen a significant change in demand from Britons travelling to the US.\n\nMr Trump has levied tariffs on more than 180 countries, with Canada and Mexico among the first to be impacted – although he later paused many of his so-called “reciprocal” tariffs for 90 days following financial market turmoil.\n\nGermany – the largest economy in Europe – is set to be hit particularly hard by the US tariffs and the threat to its exports.\n\nMr Thomas added that US holidaymakers are also paring back their holiday spend in the face of economic uncertainty caused by Mr Trump’s move to unleash higher tariffs on countries across the world.\n\nMr Thomas told PA: “If you look at the different markets, the US tends to be the more sensitive one to uncertainty.\n\n“People there are much more connected to the stock market and have a higher amount of debt, so are more sensitive to economic developments.”\n\nBookings on the site show Americans are spending less on their trips, while there is higher demand for cheaper hotels and lower star categories.\n\nGerman-based Trivago, which is majority-owned by Expedia, said that the economic worries caused by the trade war has also seen a trend for many travellers across the US and UK to opt for domestic trips.\n\nRecent booking data shows that in the UK, there has been a 25% year-on-year leap in demand for domestic travel for the key months of July to September.\n\n“In times of uncertainty, people stay closer to home,” said Mr Thomas.\n\nThe group said London is topping the destinations for British staycationers, followed by Edinburgh, where demand is up by nearly 30%; York; Blackpool; and Manchester.\n\nBut Mr Thomas said that among Britons, bookings have remained robust despite clouds over the wider global and UK economy, with a 16% increase in total travel demand for the peak quarter to September.","summary":"Trivago claimed the company if seeing double-digit declines in bookings to the US from travellers in Canada, Mexico and Japan","url":"https://www.independent.co.uk/travel/news-and-advice/trivago-booking-america-hotels-down-b2758124.html","image":"https://static.independent.co.uk/2025/05/26/16/030fbb267be7be6fe77975f8cd65ed3aY29udGVudHNlYXJjaGFwaSwxNzQ4MzU5MTU1-2.80385179.jpg?width=1200","video":null,"publish_date":"2025-05-26 22:56:00","author":"Holly Williams","authors":["Holly Williams"],"language":"en","source_country":"gb","sentiment":0.154},{"id":325179462,"title":"Trump honours veterans and fallen soldiers in Memorial Day ceremony","text":"A memorial was held in Arlington, Virginia on Memorial Day to honour fallen US troops and commemorate their sacrifice. The ceremony was attended by US President Donald Trump, Vice President JD Vance and Defence Secretary Pete Hegseth.The ceremony was held at Arlington National Cemetery, where more than 400,000 people, many of them soldiers, have been laid to rest.Trump placed a wreath at the Tomb of the Unknown Soldier, a sombre tradition for US presidents. The president paused after placing the wreath, then stepped back before being joined by Vance and Hegseth in a salute.The US president then delivered an address where he called US troops “great, great warriors”, and singled out several families and relatives of late soldiers to tell their stories.“We just revere their incredible legacy,\" Trump said. “We salute them in their eternal and everlasting glory. And we continue our relentless pursuit of America’s destiny as we make our nation stronger, prouder, freer and greater than ever before.”“Their valour,\" he said, “gave us the freest, greatest and most noble republic ever to exist on the face of the earth. A republic that I am fixing after a long and hard four years.”He told the story of Navy Senior Chief Petty Officer Shannon Kent, killed along with three other Americans by a suicide bomber in 2019 in Syria, leaving behind her husband, 3-year-old son and 18-month-old son.The New York native was on her fifth deployment, embedded with a team where she served as a linguist, translator and cryptologic technician working alongside special forces in a mission targeted at hunting down Islamic State group militants.“She was among the first women ever to do it, and she did it better than anyone,” Trump said, calling out Kent's family for applause at the ceremony.It didn’t take long for the address to veer into politics as Trump took the opportunity to criticise his predecessor Joe Biden, adding that his term as president was one filled with errors and failures, which his administration is working on fixing.“A republic that I am fixing after a long and hard four years. That was a hard four years we went through,” said the US president. “People pouring through our borders unchecked. People doing things that are indescribable and not for today to discuss,” he added.Though the holiday is one that US presidents usually treat with pure solemnity, Trump began the day with a fiery all-caps social media post on his social media platform, Truth Social, aimed at Biden.“SCUM THAT SPENT THE LAST FOUR YEARS TRYING TO DESTROY OUR COUNTRY.\"Meanwhile, European Parliament President Roberta Metsola also attended the ceremony. In a post on X, Metsola also paid her respects to fallen US soldiers, acknowledging their sacrifice for Europe and expressing her gratitude.“On Memorial Day, we honour the courage of all the fallen heroes whose sacrifice meant peace and freedom in Europe,” said Metsola “Europe is forever grateful. We remember them. We honour them.”","summary":"US President Donald Trump honoured US soldiers who died in combat in a ceremony at the Arlington National Cemetery, calling them “America’s best and bravest”.","url":"https://www.euronews.com/2025/05/27/trump-honours-veterans-and-fallen-soldiers-in-memorial-day-ceremony","image":"https://static.euronews.com/articles/stories/09/30/34/28/1440x810_cmsv2_0b8f0645-658e-5523-85b6-7039e31c4946-9303428.jpg","video":null,"publish_date":"2025-05-26 22:55:07","author":"Malek Fouda","authors":["Malek Fouda"],"language":"en","category":"politics","source_country":"fr","sentiment":0.174},{"id":325180368,"title":"Winemakers finding Trump’s tariffs hard to swallow","text":"Burgundy is one of the most prestigious wine regions in France, and the US is its biggest export market. But now, Donald Trump's tariffs are threatening to price European wine out of the American marketplace.\n\nCrouched in cold mud under a thin Spring rain, vineyard employee Élodie Bonet snaps off unwanted vine shoots with her fingers and pruning clippers.\n\n\"We want the vine to put all its energy into the shoots that have the flowers where the grapes are going to grow,\" she explains.\n\nI leave Élodie working her way down the rows of vines, and walk up to the house and winery in the Burgundy village of Morey-Saint-Denis, where I meet owner and winemaker Cécile Tremblay.\n\nShe takes me down to her cellar to taste some of her prized red wines, standing among the oak barrels and old bottles with labels weathered by mould and age.\n\nThey have names on them that make wine lovers go weak at the knees - Nuits-Saint-Georges, Echezeaux, Vosne-Romanée, Clos-Vougeot, and Chapelle-Chambertin.\n\nMs Tremblay sells over half of her wine abroad, under the name Domaine Cecile Tremblay.\n\n\"For the United States, it's around 10% of the production; it's a big production for me!\" she says.\n\nAfter threatening a 200% mark-up on alcohol from Europe, Donald Trump imposed a 20% tariff on practically all European Union products on 5 April.\n\nFour days later, he lowered this to 10%, with the threat that he'd hike it back up again to 20% in July, depending on how trade negotiations pan out. And now Trump is threatening a future tariff of 50% on all goods from the EU.\n\nI ask Ms Tremblay if she's worried. \"Yes, sure,\" she says, \"As everybody is.\"\n\nBut that is all she will say on the matter. French winemakers are walking on eggshells at the moment, fearful of saying anything that might aggravate the situation.\n\nPerhaps their representatives will be more forthcoming? I get in my car and drive over to one of her neighbours - François Labet. He is the president of the Burgundy Wine Board, which represents this region's 3,500 winemakers.\n\n\"The US is the largest export market for the whole region. Definitely,\" he tells me. \"They are the biggest in volume and the biggest in value.\"\n\nAnd, until Donald Trump's re-election, the US market was booming. While French wines and spirits' global exports fell 4% last year overall, sales of Burgundy wines to the US rose sharply.\n\nIn volume terms, there were up 16% from 2024, to 20.9 million bottles. This was worth €370m ($415m; £312m) in revenues, 26.2% higher than in 2023.\n\nMr Labet says the US accounted for about a quarter of Burgundy's wine exports last year.\n\nBurgundy's reputation abroad is mainly for its red wines, which are made from the celebrated pinot noir grape. Indeed, in the English-speaking world, burgundy is not so much a wine as a colour.\n\nThe French word for the same colour is bordeaux; showing they know more about their wine, because while Bordeaux wines are mostly red, two-thirds of Burgundy is actually white.\n\nThese are predominantly made from the Chardonnay grape. Chablis, one of the best-known examples, is extremely popular in the US.\n\nBurgundy also produces an increasingly successful sparkling wine, called Crémant de Bourgogne, and a small amount of rosé.\n\nAll of which is good for Burgundy because while general red wine consumption just keeps going down, white is holding firm, and sparkling is going up.\n\nAlso, the reds that come out of Burgundy are, according to Mr Labet, the kind consumers increasingly want, as they are typically lighter than New World reds.\n\n\"What is interesting to see is that there is a strong de-consumption of what we call the big reds, made in the US. Wines with a lot of alcohol, aged in new wood.\"\n\nLess sun and lower temperatures in Burgundy, even with climate change, means less sugar in the grapes and lower alcohol content.\n\nMr Labet remembers when, for 18 months of his first presidency, Donald Trump hit European wine with a 25% import tariff during a dispute over airlines.\n\n\"We were hostages of that situation, and it really did affect our sales to the US. We had a drop of about 50% of our exports to the US.\"\n\nRegarding the current 10% Trump tariff, he predicts that French wine producers and US merchants will split the cost of the new import duty between them in order to maintain sales.\n\nBut what will be the impact if, in July, Trump decides to increase the tariff on all European Union exports to 20%, as he has threatened to do? \"We will go back to the 2019 situation where the market was almost stopped,\" says Mr Labet.\n\nFor French wines in general, things could be even worse.\n\n\"When President Trump raised import duties by 25% for one-and-a-half years of his first mandate, we lost about $600m [£450m] very quickly,\" says Jerome Bauer, president of the French National Wines and Spirits Confederation.\n\n\"But back then Champagne wasn't included, and neither were wines stronger than 14 degrees of alcohol. So you can see the scale of the threat today.\"\n\nThe solution Mr Bauer is backing is free trade. No tariffs. But you'd expect him to say that, given that France and Europe run a big trade surplus with the US when it comes to wines and spirits.\n\nMore surprising, perhaps, is the opinion of his American competitors in California and Oregon who, you might think, would be cracking open something a bit special to celebrate.\n\n\"This looks horrible from our perspective. We don't like it one bit,\" says Rex Stoltz, vice-president of industry relations at Napa Valley Vintners, which represents 540 wineries in the sunny slopes of California's most famous wine region.\n\n\"Wine is an international product. Even here in the Napa Valley, our wineries primarily get their corks from Portugal, and their oak barrels, a key component in winemaking, from France.\n\nMr Stoltz adds: \"They're already expensive and the potential is that they will get more expensive.\"\n\nAlso, trade wars cut both ways. He says the tariffs announced against Canada are having a devastating impact on US wine exports.\n\n\"Canada is the most important export market for California wines, and one of the top export markets for Napa Valley wines. Right now, there are zero Napa Valley wines on the shelves of stores in Canada.\n\n\"They've removed all American alcohol beverage products from their store shelves!\"\n\nMr Stoltz adds: \"We just want to compete on an even playing field with our friends and neighbours all over the world. That's our ask and that's our hope.\"","summary":"Burgundy is one of the most prestigious wine regions in France, and the US is its biggest export market. But now Donald Trump's tariffs are threatening to price European wine out of the American marketplace.","url":"https://www.myjoyonline.com/winemakers-finding-trumps-tariffs-hard-to-swallow/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/05/image-1330-1024x576.png","video":null,"publish_date":"2025-05-26 22:41:44","author":"Abubakar Ibrahim,Bbc 41pm","authors":["Abubakar Ibrahim","Bbc 41pm"],"language":"en","category":"politics","source_country":"gh","sentiment":0.026},{"id":325193022,"title":"Trump pardons former sheriff convicted of bribery","text":"WASHINGTON >> President Donald Trump issued a pardon today for a former Virginia sheriff who was convicted last year of federal bribery charges, averting prison time for the officer.\n\n“Sheriff Scott Jenkins, his wife Patricia, and their family have been dragged through HELL,” Trump posted online, issuing a full and unconditional pardon. “He will NOT be going to jail tomorrow, but instead will have a wonderful and productive life.”\n\nJenkins, a former Virginia sheriff who served an area about two hours outside Washington, D.C., was convicted by a jury in December 2024 for accepting more than $75,000 in bribes in exchange for appointments as auxiliary deputy sheriffs.\n\nIn March, Jenkins was sentenced to 10 years in federal prison.\n\nThe bribes came from several people in the form of campaign contributions, and in exchange, they were sworn into deputy sheriff positions and received badges and credentials, according to court documents and evidence presented at the trial.\n\n“The bribe payors were not trained or vetted and did not render any legitimate services to the Sheriff’s Office,” the Justice Department said at the time.\n\nSince his conviction, Jenkins has appealed directly to the Trump administration for relief. “I believe wholeheartedly in the president,” Jenkins said in April on a webinar hosted by the Constitutional Sheriffs and Peace Officers Association, according to the NBC4 affiliate in Washington.\n\n“I believe if he heard the information, I know he would help if he knew my story,” Jenkins said, referencing Trump.\n\nIn issuing the pardon, Trump in his online post called Jenkins a “victim of an overzealous Biden Department of Justice.”\n\nThe top Justice Department official who announced Jenkins’ conviction last year did not immediately respond to a request for comment.\n\nThis latest pardon follows Trump’s January pardon of almost everyone criminally charged with participating in the January 6, 2021, attack on the U.S. Capitol, a February pardon of the former Democratic governor of Illinois who was convicted for trying to sell former President Barack Obama’s vacated U.S. Senate seat, and others.","summary":"WASHINGTON >> President Donald Trump issued a pardon today for a former Virginia sheriff who was convicted last year of federal bribery charges, averting prison time for the officer.","url":"https://www.staradvertiser.com/2025/05/26/breaking-news/trump-pardons-former-sheriff-convicted-of-bribery/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/05/web1_2025-05-26T211536Z_3_LYNXNPEL4P0Q0_RTROPTP_3_USA-TRUMP-PARDON.JPG","video":null,"publish_date":"2025-05-26 22:40:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.608},{"id":325184746,"title":"Australia shares likely to open higher; NZ flat - TradingView","text":"Australian shares were set to open higher on Tuesday, helped by potential gains in mining stocks as global sentiment improved after U.S. President Donald Trump delayed his tariff threats on the European Union. \n\nThe local share price index futures (YAPcm1) rose 0.2%, a 50-point premium to the underlying S&P/ASX 200 index XJO close. The benchmark ended flat on Monday. \n\nNew Zealand's benchmark S&P/NZX 50 index NZ50G was flat in early trade.","summary":"Australia shares likely to open higher; NZ flat  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L2N3RY0LR:0-australia-shares-likely-to-open-higher-nz-flat/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-05-26 22:34:55","author":null,"language":"en","source_country":"gb","sentiment":0.205},{"id":325182334,"title":"Biden aides were willing to do ‘undemocratic things’ to keep faltering president in power: ‘Original Sin’ author ","text":"Joe Biden’s aides were willing to do “undemocratic things” to cover up the former president’s mental decline and keep him in power for another four years, the author of a bombshell book revealed Sunday. \n\nBiden’s team of unelected staffers felt justified in “picking up the slack” for the faltering commander in chief and shielding him from the public because they viewed President Trump as an “existential threat” to democracy, Alex Thompson, co-author of “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again,” told Fox News’ Shannon Bream. \n\n“Who would have been running the White House in a second Biden term?” Bream asked Thompson, after noting that he quoted a long-time Biden aide in his book “basically admitting he shouldn’t be running again.”\n\n“Well, this person went on to say that when you’re voting for a president, you’re voting for the aides around him,” the author and Axios journalist revealed. \n\n“But these aides were not even Senate-confirmed aides,” Thompson pointed out. “These are White House aides, these were unelected people.” \n\nBream highlighted a passage from Thompson’s book, where one anonymous aide argued Biden “just had to win, and then he could disappear for four years. He’d only have to show proof of life every once in a while … His aides could pick up the slack.”\n\nThompson explained that in his reporting for the book with co-author Jake Tapper, it became clear that many in Biden’s orbit were willing to go to extreme lengths if it meant keeping Trump out of the Oval Office. \n\n“If you believe — and I think a lot of these people do sincerely believe that Donald Trump was and is an existential threat to democracy — you can rationalize anything, including sometimes doing undemocratic things, which I think is what this person is talking about,” Thompson told Bream. \n\nIn his book, Thompson referred to the small group of people in Biden’s inner circle running the White House as the “Politburo,” noting that the term was also used by some within the administration. \n\nThe small, tight-knit group included top Biden aides Mike Donilon, Steve Ricchetti and Bruce Reed, as well as first lady Jill Biden and the president’s scandal-scarred son, Hunter. \n\nThompson claims the “politburo” were the “ultimate decision-makers” as Biden’s mental acuity declined.\n\nThe term “politburo” is commonly defined as the top echelon of a communist state.","summary":"Biden’s staffers felt justified in “picking up the slack” for the faltering president and shielding him because they viewed President Trump as an “existential threat” to democracy, he charged.","url":"https://nypost.com/2025/05/26/us-news/biden-aides-were-willing-to-do-undemocratic-things-to-keep-faltering-president-in-power-original-sin-author/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-2t0sx891y-1748297477051.jpg?quality=75&strip=all&1748283090&w=1200","video":"https://cdn.jwplayer.com/videos/o5DeVDBU-RyIcpnTz.mp4","publish_date":"2025-05-26 22:32:50","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.339},{"id":325176982,"title":"All the people banned from Don Jr.'s exclusive DC club Executive Branch - and the former GOP president who will be furious","text":"Donald Trump Jr.'s exclusive new club for supporters of his father's administration will ban many of Washington DC's elites - including mostly everyone who worked for former President George W. Bush.\n\nThe president's eldest son is set to open Executive Branch in the heart of the capitol's Georgetown neighborhood next month for Trump supporters who are willing to shell out half a million to join - with some even offering to pay $1 million to get in the door, per CNBC.\n\nBut even those with that kind of money will have to pass some rigorous criteria to gain admittance into the subterranean night club tucked behind Georgetown Park via a set of stairs next to the mall's parking garage, according to the New York Times.\n\nOnly those who personally know one of the club's owners can gain admittance. \n\nIn addition to Trump Jr., the club was co-founded by President Trump's crypto czar David Sacks, Zach and Alex Witkoff - the sons of Trump's Middle East envoy, Omeed Malik, who leads 1789 Capital and Chris Buskirk, who cofounded the conservative donor group Rockbridge Network.\n\nAnd even those who know one of the founders may be barred from the club if they are a member of the media, Sacks has said.\n\n'Bush-era Republicans' are also likely to be barred from the club, the Times reports.\n\n'This is not just for any Saudi businessman,' a spokesman for Executive Branch told the outlet.\n\nSacks had explained the reasoning for the club's exclusivity on his podcast last month.\n\n'To the extent there are Republican clubs, they tend to be more Bush-era Republicans as opposed to Trump-era Republicans,' he said. \n\n'So we wanted to create something new, hipper and Trump-aligned.'\n\nAn insider familiar with the club's plans also told CNBC that prospective members have to be heavily vetted and approved by its founders.\n\n'We don't want members of the media or just a lot of lobbyists joining,' the source said. 'We want people to feel comfortable having conversations in privacy.' \n\nThere is now expected to be fewer than 200 members at the club, according to the Times. \n\nAmong those who were lucky enough to be named founding members are Sacks, the controversial Winklevoss twins who famously sued Facebook founder Mark Zuckerberg over the social media site's founding; Jeff Miller, a top Trump fundraiser; and venture capitalist Chamath Palihapitiya.\n\nExecutive Branch's launch party last month also reportedly featured Secretary of State Marco Rubio, Securities and Exchange Commission Chairman Paul Atkins, Attorney General Pam Bondi, Federal Trade Commission Chairman Andrew Ferguson, Federal Communications Chairman Brendan Carr, Director of National Intelligence Tulsi Gabbard, deputy FBI director Dan Bongino and Mehmet Oz, the administrator for the Centers for Medicare and Medicaid Services.\n\nAlso in attendance were several tech founders and CEOs, including AppLovin CEO Adam Foroughi, CNBC reports.\n\nIt is now expected that the commander-in-chief may also stop by, after losing his Trump International Hotel - where he spent nights in his first administration holding a table at the steakhouse and providing fodder for journalists in the lobby.\n\nThe hotel faced ethics complaints as several world leaders and DC elites frequented the space to speak with the president, whose Trump Organization owned the building.\n\nIn 2022, the Trump Organization sold the hotel's lease.","summary":"Donald Trump Jr.'s exclusive new club for supporters of his father's administration will ban many of Washington DC 's elites.","url":"https://www.dailymail.co.uk/news/article-14751595/Donald-Trump-Jr-Executive-Branch-banned.html","image":"https://i.dailymail.co.uk/1s/2025/05/26/23/98770895-0-image-m-16_1748297016746.jpg","video":null,"publish_date":"2025-05-26 22:32:20","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","category":"politics","source_country":"gb","sentiment":0.138},{"id":325176896,"title":"David Eby: British Columbia is ready to lead in a turbulent global economy","text":"The global economy is undergoing rapid and fundamental change.\n\nRussian President Vladimir Putin’s illegal invasion of Ukraine is accelerating Europe’s move away from Russian energy. U.S President Donald Trump’s trade wars have made countries reconsider their economic ties with the U.S. And China’s retaliatory export controls on rare earth minerals are a stark reminder of the vulnerabilities in critical supply chains.\n\nIn this time of rapid change and disruption, there’s no place I’d rather be to meet these challenges than right here in British Columbia. Our province will be the economic engine of the new Canada that emerges from this global transition.\n\nFor over 180 years, mining has shaped our province. Its early chapters were often marked by labour conflict, environmental harm, and disregard for Indigenous rights. But we’ve made real progress. Today, communities in B.C.’s northwest—near the Alaska and Yukon borders—stand on the brink of a generational opportunity: to build lasting prosperity for our province and nation through true partnership with First Nations, while conserving the lands and waters we all depend on.\n\nThis region is rich in critical minerals and precious metals—the building blocks of modern life and the green technologies of tomorrow, from electric vehicles to wind turbines. As global demand for these minerals is projected to grow fivefold by 2040, B.C. has a vital role to play.\n\nDozens of proposed new mines and major expansions are already in advanced planning or exploration. If we seize this moment, we can unlock private investment that delivers long-term, family-supporting jobs across the province.\n\nMining is a powerful job multiplier. Each direct job in a B.C. mine or smelter supports at least two more in supply and service sectors, from Prince George to Port Alberni. A thriving supply chain sustains thousands of small- and medium-sized businesses, while project revenues help fund the priorities we all share—affordable housing, better health care and stronger infrastructure.\n\nDeveloping the northwest also opens doors to new investment in refining and technology that rely on these minerals. A key part of our vision is to process more resources here in B.C. to add value, capture more jobs and ensure that the benefits of our natural wealth stay close to home. Because these resources belong to all of us.\n\nAs we build this future, our values will guide us.\n\nThe northwest is home to some of Canada’s most rugged and wild landscapes—rich ecosystems and vital watersheds that must be protected for generations to come.\n\nIt’s part of what makes B.C. special.\n\nOur province doesn’t see economic development and conservation as opposing forces. We know they go hand in hand.\n\nFirst Nations in the northwest have already worked hard on conservation planning and identifying where responsible development can proceed more efficiently. I’ve listened to local leaders share a compelling and unified vision: protecting land, air, and water while creating good jobs and strong communities.\n\nThat’s why we’re working toward a new agreement—to provide clarity, speed, and certainty for responsible exploration and development. Endless delays help no one. A clear, collaborative framework will ensure projects move forward in a way that respects people, land and law.\n\nIn the coming months, we’ll share more about our plan for an expedited process—one that balances economic opportunity with ecological responsibility, all in partnership with First Nations.\n\nThis is a true nation-building opportunity. And like any bold undertaking, it will require collaboration and compromise from all involved—from governments, industry, workers and communities, Indigenous and non-Indigenous alike. The outcome will be one we can all take pride in—one that will build and a lay a foundation for prosperity for generations to come.\n\nI’ve never been more optimistic about the future we can build together. Ambition and resilience are in our DNA. British Columbians don’t back down when things get tough—we rise to the occasion. And today, we have the chance to rise again in the face of adversity by seizing one of the most promising economic opportunities in our province’s history.\n\nDavid Eby is the premier of British Columbia.","summary":"A resource-rich northwest and modern mining partnerships can anchor Canada’s economic future, argues B.C. premier","url":"https://www.biv.com/news/commentary/david-eby-british-columbia-is-ready-to-lead-in-a-turbulent-global-economy-10716202","image":"https://www.vmcdn.ca/f/files/biv/victoria-bc-legislature-patrickdonovan-moment-gettyimages-1.jpg","video":null,"publish_date":"2025-05-26 22:30:00","author":"David Eby","authors":["David Eby"],"language":"en","category":"politics","source_country":"ca","sentiment":0.35},{"id":325176984,"title":"Obama advisor warns Dems have 'no path' to victory if they don't win back key voter demographic","text":"A former advisor to Barack Obama has warned that Democrats have 'no path' back to the White House unless they win back Latino voters. \n\nEx-presidential aide Dan Pfeiffer, 49, told Pod Save America the demographic holds the key to the beleaguered party's redemption at the next election. \n\n'There's no way to look at this without recognizing the massive scale of our problems,' Pfieffer told former Obama speechwriter Jon Favreau on Friday's episode of the left-leaning podcast. \n\n'You can kind of tell yourself that things might be kind of OK by looking at just the shift from '20 to '24,' he added. \n\n'But if you really want to assess where we are as a party, you have to look at the shift from 2016 to 2024.'\n\nPfeiffer pointed out that former Democrat hopeful Hillary Clinton was much more popular among the Hispanic population than President Trump. \n\nShe gained around 70 percentage points more from the demographic voter pool than Trump did - a wider margin than Obama. \n\nBut former Vice President Kamala Harris secured the group by only 54 percentage points on Trump. Several exit polls even indicated that Trump gained more of the vote among Latino men. \n\n'Latinos moved 17 points (to the right) in eight years,' Pfeiffer said. 'Latino men went 14 points (toward the GOP) in eight years.'\n\nHe added that 'Latinos are the fastest-growing population' in the country.\n\n'They are particularly politically powerful because of how the population is distributed in electoral-rich sunbelt states like Texas, Florida, Arizona, Nevada,' he said. \n\n'They are becoming more of the electorate, and we are losing more of them at a very fast rate. If that trend continues, there is no path to Democrats winning elections.'\n\nIt comes as voter polls indicate that New York Congresswoman Alexandria Ocasio-Cortez could be the Democratic Party's next presidential candidate. \n\nThere are 65.2 million Hispanics and Latinos in the US, or around one-fifth of the population, according to the US Census Bureau. \n\n'The message I take from this is, anyone who thinks that we can get away with just tinkering around the edges, just hoping that Donald Trump becomes unpopular or they nominate some yahoo in 2028 or we're going to ride the wave of tariffs and inflation to a narrow House victory is just rearranging the deck chairs on the Titanic,' Pfieffer added.\n\n'We have to be willing to ask very hard questions.'\n\nEfforts by Trump's campaign group to sway over millions of Hispanic voters proved hugely successful, despite a massive pre-election controversy when a comedian at a Trump rally compared Puerto Rico to a ‘floating island of garbage’. \n\nTrump's biggest gains among Hispanic voters were evident in the key states of Pennsylvania and Michigan.\n\nBefore midnight on election night, Trump became the first Republican since George H. W. Bush in 1988 to win Miami-Dade, a county where two-thirds of residents are Latino.\n\nAs well as targeting Hispanic voters, Team Trump also aimed to sway over African-Americans — another huge demographic group in the US.\n\nBut there was less of a noticeable impact on African-American voters.\n\nExit polls suggested Trump narrowed the gap with Harris among Black men by two points, compared with 2020.\n\nOf the 100-plus counties with a Black population of at least 50 percent, the Republicans gained ground in all but eight.","summary":"Ex-presidential aide Dan Pfeiffer, 49, told Pod Save America the demographic holds the key to the beleaguered party's redemption at the next election.","url":"https://www.dailymail.co.uk/news/article-14751591/obama-advisor-warns-democrats-need-hispanic-voters-election.html","image":"https://i.dailymail.co.uk/1s/2025/05/26/22/98770791-0-image-m-10_1748295256479.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/07/4291789463853157443/1024x576_MP4_4291789463853157443.mp4","publish_date":"2025-05-26 22:29:54","author":"Editor,Laura Parnaby","authors":["Editor","Laura Parnaby"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.3}]}