{"offset":0,"number":50,"available":15942,"news":[{"id":385146564,"title":"Widow's horror after man crushed to death at work by faulty forklift","text":"A heartbroken widow says she will never get over her husband's death after he was fatally crushed in a \"horrific\" forklift accident. Delivery driver Chris Keegan was killed in an incident while working for Hessle Plant Ltd at the firm's main depot in Castleford, West Yorks. Now, his employer has been fined more than £400,000 and ordered to pay £8,000 in costs - as well as a £2,000 victim surcharge. It comes two years after Mr Keegan's death on November 20, 2023. READ MORE: Woman and her dog die weeks before Christmas as driver goes wrong way on A48 READ MORE: Prince Harry makes brutal Donald Trump joke as he appears in surprise sketch Leeds Magistrates' Court heard that he had been tasked with returning a forklift truck to a site in Sheffield, South Yorks., following repair work. As he reversed the vehicle onto the trailer shortly after 6am, it fell from the side of the trailer bed. Mr Keegan was thrown from the seat and became trapped between the forklift and a neighbouring trailer. His wife and two of his stepdaughters arrived at the depot as the emergency services fought to save his life, but tragically his injuries proved fatal and he died at the scene. Chris' widow Dianne said: \"Chris was a wonderful, kind and generous man, who would do anything he could for anyone. He especially did anything he could for me. \"My heart is broken, and I will never get over losing my husband in such a horrific way. He never deserved to die in such tragic circumstances.\" An investigation by the Health and Safety Executive (HSE) found that the forklift had not been subject to a full inspection to ensure it was safe to operate. Examination of the forklift by HSE after the accident found several other defects which should have been identified and rectified before it was operated. The investigation found that whilst Hessle Plant Ltd would undertake a full pre-delivery inspection on forklift trucks being delivered to new customers, at the time of the accident the company did not do this for machines being returned to existing customers. HSE also found that many company employees would rarely wear seatbelts when operating forklift trucks, and there was no system for monitoring and enforcing seatbelt use on site. Hessle Plant Ltd, of Carrwood Road Industrial Estate, Glasshoughton, pleaded guilty to breaching Section 2(1) of the Health and Safety at Work etc. Act 1974. The company was fined £433,550 and ordered to pay £8,146.80 in costs and a £2,000 victim surcharge as Leeds Magistrates' Court on November 26. Speaking after the hearing HSE inspector, David Beaton, said: \"This was a tragic and preventable death. \"Mr Keegan was placed at undue risk by operating a machine with underlying maintenance defects, which he would have been unaware of when attempting to reverse the forklift in the dark onto a trailer with an exposed edge. \"Had Mr Keegan been wearing the seatbelt provided, the accident he suffered would likely not have proven fatal. \"Every year there are fatal accidents caused by machinery which has not been properly maintained or inspected, and forklift truck drivers not wearing seatbelts. \"This case should underline to all businesses, which hire out or operate forklift trucks, the importance of keeping machinery in efficient working order and ensuring the use of seatbelts by forklift drivers is appropriately supervised.\" The Mirror has contacted Hessle Plant Ltd for omment.","summary":"Chris Keegan was thrown from the seat of a forklift and became trapped between the forklift and a neighbouring trailer - tragically his injuries proved fatal and he died at the scene","url":"https://www.mirror.co.uk/news/uk-news/widows-horror-after-man-crushed-36354875","image":"https://i2-prod.mirror.co.uk/article36354883.ece/ALTERNATES/s1200b/2_Heartbroken-widow-says-shell-never-get-over-husbands-horrific-forklift-death.jpg","video":null,"publish_date":"2025-12-05 01:08:29","author":"James Connolly,Paige Ingram","authors":["James Connolly","Paige Ingram"],"language":"en","source_country":"gb","sentiment":-0.836},{"id":385147148,"title":"New York Times sues Pentagon over rules limiting access for media  - Trinidad Tribune – Latest Trinidad And","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://trinidadtribune.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://trinidadtribune.com/app/uploads/2025/12/ap_69321360daedf-1764889440-UaCMN4.jpg","video":null,"publish_date":"2025-12-05 01:06:28","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"tt","sentiment":-0.1},{"id":385147146,"title":"Trump hails ‘great day for the world’ as DRC, Rwanda finalise peace deal  - Trinidad Tribune – Latest","text":"United States President Donald Trump has hosted the leaders of Rwanda and the Democratic Republic of the Congo to sign a peace deal that could end the conflict between the two countries.\n\nAlthough the violence on the ground has not stopped, Trump hailed the US-brokered deal on Thursday as a new chapter for the region.\n\n“It is an amazing day: great day for Africa, great day for the world and for these two countries,” Trump said. “And they have so much to be proud of.”\n\nThe agreement was originally reached in June. DRC President Felix Tshisekedi and his Rwandan counterpart Paul Kagame had met in Qatar in March, initiating the talks that led to the deal.\n\nThursday’s ceremony finalises the accords.\n\nThe agreement has sparked hopes of ending the conflict in the DRC, where the March 23 Movement (M23), a Rwanda-backed armed group, has been advancing deeper into the resource-rich east of the country.\n\nThe renewed violence had raised fears of a full-blown conflict, akin to the wars that the DRC endured in the late 1990s, which involved several African countries and killed millions of people.\n\nRwanda’s main grievance with the DRC focuses on accusations that the Central African country has been harbouring ethnic Hutu militias linked to the 1994 Rwanda genocide, which targeted the country’s Tutsi population.\n\nThe Trump-backed peace deal stipulates that Rwanda will end its support for M23 and the DRC will help “neutralise” Hutu militias — namely, the Democratic Forces for the Liberation of Rwanda.\n\nIt also requires both countries to respect each other’s territorial integrity.\n\nOn Thursday, the DRC’s Tshisekedi said the agreement’s terms mark a “turning point” for the region.\n\n“They bring together, under a coherent architecture, a declaration of principles of a peace agreement and also the regional economic integration framework to provide to the peoples of the region a new perspective, a new outlook,” Tshisekedi said.\n\nHe added that the deal would “begin a new era of friendship, cooperation and prosperity”.\n\nFor his part, Rwanda’s Kagame said the success of the pact depends on the two countries themselves.\n\n“There will be ups and downs on the road ahead. There’s no doubt about it,” Kagame explained. “Rwanda will not be found wanting, I can assure you of that.”\n\nReporting from Washington, DC, Al Jazeera’s Alan Fisher said the leaders of the DRC and Rwanda appeared to acknowledge that it will take more than a signing ceremony for the agreement to stick.\n\nThe conflict, Fisher explained, “is a lot more ingrained, a lot more developed, a lot more aggressive than many people have assumed”.\n\n“So the pressure is on the United States, on the African leaders and, of course, on the two countries to make sure that what develops from here is something that can develop into a lasting peace.”\n\nThe DRC had signed a separate deal with M23 in July. Still, the fighting in the eastern parts of the country has persisted.\n\n“We are still at war,” Amani Chibalonza Edith, a 32-year-old resident of Goma, a key city captured by M23 early this year, told The Associated Press news agency.\n\n“There can be no peace as long as the front lines remain active.”\n\nBut in Washington, DC, on Thursday, Trump appeared optimistic about the prospects for peace.\n\n“We’ll see how it all works out, but I think it’s going to work out really great,” the US president said.\n\nTrump also announced that the US will be signing bilateral deals with the DRC and Rwanda to buy rare earth minerals from the two countries.\n\n“We’ll be involved with sending some of our biggest and greatest companies over to the two countries,” Trump added.\n\n“And we’re going to take out some of the rare earth, take out some of the assets and pay. Everybody is going to make a lot of money.”\n\nRare earth minerals are used in emerging technologies, energy production and medical devices.\n\nTrump has openly campaigned for the Nobel Peace Prize, claiming he has resolved eight world conflicts, though that number is disputed.\n\nDuring Thursday’s signing ceremony at the US Institute for Peace, a think tank, he heaped praise onto the DRC and Rwanda. But his embrace of the countries’ two leaders drew a stark contrast with his insulting remarks towards another war-torn African country: Somalia.\n\nTwo days before hosting the ceremonial signing, Trump hurled insults at Somalia, describing it as “hell” and saying that “it stinks”.\n\nHe also called the Somali community in the US “garbage”.","url":"https://trinidadtribune.com/trump-hails-great-day-for-the-world-as-drc-rwanda-finalise-peace-deal/","image":"https://trinidadtribune.com/app/uploads/2025/12/2025-12-04T191314Z_173990078_RC2V9IADTB06_RTRMADP_3_USA-TRUMP-RWANDA-CONGO-1764887531-WLuQBa.jpg","video":null,"publish_date":"2025-12-05 01:06:27","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"tt","sentiment":0.198},{"id":385147144,"title":"US military kills four in latest strike on boat in the Caribbean  - Trinidad Tribune – Latest Trinidad And","text":"The United States military has conducted another deadly strike on an alleged drug smuggling boat in the Caribbean, killing four, according to the Pentagon.\n\nThe attack on Thursday comes as the administration of US President Donald Trump has faced renewed scrutiny over the strikes after it was revealed that a targeted boat had been struck twice during a September 2 attack.\n\nExperts have said such an attack could constitute a war crime.\n\nIn a post on X, the US Southern Command said the latest strike was directed by Secretary of Defense Pete Hegseth.\n\nThe military “conducted a lethal kinetic strike on a vessel in international waters operated by a Designated Terrorist Organization,” it said.\n\n“Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the Eastern Pacific. Four male narco-terrorists aboard the vessel were killed,” it said.\n\nThe Trump administration has killed more than 80 alleged drug smugglers in the months-long campaign.\n\nBut revelations over the September 2 strike have prompted renewed scrutiny and investigations from bipartisan committees in Congress.\n\nThe White House has denied that Hegseth ordered the second strike on the vessel following an initial strike. Instead, they said the second strike that appeared to kill two survivors of the first attack was ordered by Admiral Frank “Mitch” Bradley.\n\nThe White House has said the second strike was still in compliance with the laws of armed conflict. Legal experts have said it is a war crime to target unarmed combatants. The military’s own manual says it is illegal to fire on shipwrecks.\n\nBradley appeared on Capitol Hill on Thursday for a series of closed-door briefings. He denied that he had been ordered to kill all people on board.\n\nLawmakers gave conflicting accounts of the briefings.\n\n“Bradley was very clear that he was given no such order, to give no quarter or to kill them all,” said Republican Senator Tom Cotton, who heads the Senate Intelligence Committee, according to The Associated Press news agency.\n\n“The order was basically: Destroy the drugs, kill the 11 people on the boat,” said Representative Adam Smith, the top Democrat on the House Armed Services Committee.\n\nSmith said the survivors were “basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water – until the missiles come and kill them.”\n\nEven prior to revelations over the September 2 double-strike attack, rights groups have said the strikes likely constitute extrajudicial killings.\n\nThe latest attack comes as the US continues to surge military assets near the coast of Venezuela, with Trump repeatedly threatening that land strikes could happen “very soon”.\n\nVenezuela’s leader, Nicolas Maduro, has said the US pressure campaign is aimed at toppling his government.","url":"https://trinidadtribune.com/us-military-kills-four-in-latest-strike-on-boat-in-the-caribbean/","image":"https://trinidadtribune.com/app/uploads/2025/12/2025-11-16T214234Z_1228634577_RC2ZVHAK9N69_RTRMADP_3_USA-VENEZUELA-MILITARY-1764448238-VJflqn.jpg","video":null,"publish_date":"2025-12-05 01:06:24","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"tt","sentiment":-0.33},{"id":385145646,"title":"Russia's Putin to hold summit talks with India's Modi in Delhi","text":"NEW DELHI, Dec 5 - Russian President Vladimir Putin will hold summit talks with Prime Minister Narendra Modi in New Delhi on Friday, aiming to boost trade with the top buyer of Russia's arms and seaborne oil as Western sanctions squeeze their decades-old ties.\n\nPutin is on his first visit to India in four years at a time when New Delhi is engaged in talks with the U.S. for a trade deal to cut punitive tariffs imposed by President Donald Trump on its goods over India's Russian oil purchases.\n\nMoscow has been India's top arms supplier for decades and has said that it wants to import more Indian goods in an effort to grow trade to $100 billion by 2030 that so far has been skewed in its favour due to New Delhi's energy imports.\n\nSince European countries cut back their reliance on Russian energy after Russia invaded Ukraine nearly four years ago, India has ramped up its purchases of discounted Russian crude. \n\n\"India faces a conundrum; by taking steps to strengthen ties with Moscow or Washington, New Delhi risks setting back ties with the other,\" Michael Kugelman, senior fellow at Washington's Atlantic Council think tank, wrote in Foreign Policy magazine this week. \n\nModi and Putin are also expected to discuss other topics including labour and civil nuclear energy, with the sides expected to announce new agreements to showcase resilience of their relations.\n\nHUGS AND HANDSHAKES\n\nThe Indian leader received Putin with a hug and handshake as he walked down the red carpet after arriving at an airport near New Delhi on Thursday for the two-day visit. Modi later hosted the Russian president for a private dinner at his residence.\n\nA business and government delegation has accompanied Putin for the visit, including his defence minister, Andrei Belousov, who held talks with his Indian counterpart Rajnath Singh on Thursday. \n\nBelousov \"stated that the Russian defence industry is ready to support India towards becoming self-reliant in the field of defence production,\" India's defence ministry said after the talks.\n\nPutin arrived in India a day after holding talks with Trump's top envoys on a possible peace deal to end the war in Ukraine, but they did not reach a compromise.\n\nIndia has resisted condemning Russia over the war and called for peace though dialogue and diplomacy, while saying that its ties with Moscow were being unfairly targeted by Western nations that continue to do business with Moscow when it is in their interest. REUTERS","url":"https://www.straitstimes.com/asia/russias-putin-to-hold-summit-talks-with-indias-modi-in-delhi","image":"https://cassette.sphdigital.com.sg/image/straitstimes/5be95615b560e867ff088f00418b7a12d47974c84844931347b0c6f85c42b361","video":null,"publish_date":"2025-12-05 01:05:49","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.026},{"id":385094868,"title":"‘God is so good to me’","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nBY KELSEY THOMAS Online coordinator thomask@jamaicaobserver.com \n December 4, 2025\n\n\n\n\n ‘God is so good to me’ \n\nSt Elizabeth hurricane victims grateful for home repairs by church community \n\n\n\n\n\n\nST ELIZABETH, Jamaica — For Janet Chambers, the devastation of Hurricane Melissa was not just about losing her home, but also the overwhelming sense of powerlessness that followed. After the October storm tore through Middle Quarters, St Elizabeth, she was left uncertain of how she could rebuild.\n\n“I wasn’t here [when it hit],” she recalled. “One of my sisters called me and told me that I must pack up and leave the house because she’s not sure my house is secure.”\n\nHer sister’s judgment proved sound.\n\n“After the storm blow, my next door neighbour come up…and say, ‘Janet, your house gone,” Chambers said.\n\nShe said when she arrived at her property, the damage was beyond belief.\n\n“Around that side, it gone, the kitchen gone, the veranda gone…[It] take off the top, not even leave the zinc, it take off the whole entire top carry go put it over suh,” Chambers said.\n\nWith no immediate help in sight, she turned to God in her desperation.\n\n“So mi seh, ‘Then how me a go manage now, Father God?’…And mi nuh have no money to put on back the top, nor nothing…So mi say Lord, you see God, mi no have nobody but you.”\n\nThough she received some relief items from a person she described as her stepson, Chambers was still without the funds and support to repair her home. But, fortunately, she wasn’t alone. As a member of the Middle Quarters New Testament Church of God, she had a community that rallied behind her.\n\nWhen Reverend Leslie Pinnock, parish coordinator for the New Testament Churches of God for Saint Elizabeth, visited Chambers, he didn’t just offer words of sympathy; he brought a plan of action.\n\n“We went and visited the house, looked at the house and we couldn’t leave the house. We one had to get back to the car and in the pouring rain put a tarpaulin over her house because she was outside washing. The rain was falling we told her to go in and she said inside is wet so it’s okay and so we put on a tarpaulin and decided that was one of the house,” Reverend Pinnock shared, adding, “She doesn’t have a husband, she don’t have any children, she lives alone.”\n\nThe church member of 20 years found comfort in Reverend Pinnock’s visit.\n\n“It come in like somebody said, ‘You can’t pray? And believe in a God?’ And I pray and I cry. And I cry and I pray. Until one of my church sisters bring the pastor down here…and he said, ‘Don’t worry yourself. I’m going to take care of you’ and he look through the house, and then said, ‘I’m going to fix it and make you feel comfortable again,” Chambers recounted.\n\nThat promise turned into action. Pastor Pinnock and the church community, including those from Escarpment Road, Middle Quarters and other districts, spent the last weekend repairing her home. As Janet watched them work, she could only express her deep gratitude.\n\n“Thank you, Jesus. You’re so worthy to me. How can I leave you, God, when I know I love you? And I know, God, that you love me too. And my aim and my desire is to continue to press on with Jesus because he’s so wonderful to me because I didn’t know where the first cent a come from,” she told Observer Online.\n\n“If God never show up for me, I don’t know how I would manage. Mi can’t stop serving God, he’s so good to me. In everything, God stand by me and don’t leave me,” Chambers added.\n\nSixty-nine-year-old pensioner Wilbert Peart was also grateful for the support from his church.\n\n“Oh God, I can’t explain [how grateful I am]. It’s really needed. Not want, need,” he said.\n\nPeart and his wife’s house was one of three selected by the Escarpment Road New Testament Church of God to receive repairs as part of their Mission Rise 3.0 project in Middle Quarters.\n\nThe Category 5 storm left them with a damaged roof, cracked walls and destroyed belongings.\n\n“Mi piece of deck roof, I just run inside there, closed the door, let it pass. That’s what it was for real,” Peart shared.\n\n“I didn’t lose my clothes. I make sure I take them out and secure them before the hurricane. I knew it was going to be rough so I make sure I secure a couple of necessary things, personal documents and clothing. But the one room couldn’t take all the furniture I have, so some are going to have to perish,” he explained.\n\nHowever, like many in his situation, Peart still faces a long road to full recovery.\n\n“I’m a pensioner. I survive on $14,000 per month. Pay light bill, water bill so that’s almost nothing…I still give thanks for the support but I’m going to need some more,” Peart said.\n\nJanet Chambers (Photo: Gavin Jones)\n\nChambers’ home was one of three selected by the Escarpment Road New Testament Church of God to receive repairs as part of their Mission Rise 3.0 project in Middle Quarters. (Photo: Gavin Jones)\n\nWilbert Peart (Photo: Gavin Jones)\n\nPeart’s home was one of three selected by the Escarpment Road New Testament Church of God to receive repairs as part of their Mission Rise 3.0 project in Middle Quarters. (Photo: Gavin Jones)\n\n\n\n\n\n\n\n\nTags: Church Hurricane Melissa St Elizabeth \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Former Newcastle footballer Shaka Hislop reveals he has prostate cancer \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n Former Newcastle goalkeeper Shaka Hislop has revealed that he is battling with prostate cancer. Hislop made the revelation in a video on his Instagram... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Mom charged for death ofpregnant daughter in Michigan \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n MICHIGAN, United States — Michigan police have charged a woman and her husband with murder after the discovery of her pregnant daughter’s body in the ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n KC seek motivation for second-tier Walker Cup through record title chase \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica – For the first time in over a decade, Kingston College (KC) will not be represented in the quarterfinals of the ISSA Manning Cup. T... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Jazz Must Be returns to The Summit for second staging \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — Vocalist Apryl-Jaye will present the second staging of Island Car Rentals Presents: Jazz Must Be on Thursday, December 4 at The Su... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t receives Ethiopian delegation on hurricane recovery assistance mission \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — The Government of Jamaica on Thursday received a high-level delegation from the Federal Democratic Republic of Ethiopia which was ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Jamaica-bound hurricane relief container robbed in Canada \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n TORONTO, Canada — Canadian police are investigating what volunteers say is a heartbreaking robbery after thieves emptied out a container of donated it... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump’s immigration stance contradicting World Cup ‘unity’ message \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States — With the World Cup draw set for Washington this Friday, United States (US) President Donald Trump is expected to feature h... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/04/god-is-so-good-to-me/","image":"https://img.youtube.com/vi/sbnQnp0IMmQ/sddefault.jpg","video":null,"publish_date":"2025-12-05 01:05:31","author":"By Kelsey Thomas Online Coordinator","authors":["By Kelsey Thomas Online Coordinator"],"language":"en","source_country":"jm","sentiment":-0.317},{"id":385145870,"title":"U.S. Military Conducts Strike On Another Suspected Drug Boat As Probe Into The First Strike Begins","text":"WASHINGTON (AP) — U.S. Southern Command announced that it had conducted another strike against a small boat in the eastern Pacific Ocean on Thursday, following a pause of almost three weeks.\n\nIt is the 22nd strike the U.S. military has carried out against boats in the Caribbean Sea and eastern Pacific Ocean that the Trump administration claimed were trafficking drugs. \n\nThere were four casualties in Thursday’s strike, according to the social media post, bringing the death toll of the campaign to at least 87 people.\n\nIn a video that accompanied the announcement, a small boat can be seen moving across the water before it is suddenly consumed by a large explosion. The video then zooms out to show the boat covered in flames and billowing smoke. \n\nThe strike was conducted the same day Adm. Frank “Mitch” Bradley appeared for a series of closed-door classified briefings at the U.S. Capitol as lawmakers began an investigation into the very first strike carried out by the military on Sept. 2. The sessions came after a report that Bradley ordered a follow-on attack that killed the survivors to comply with Defense Secretary Pete Hegseth’s demands.\n\nBradley told lawmakers there was no “kill them all” order from Hegseth, but a stark video of the entire series of attacks left some lawmakers with serious questions.\n\nLegal experts have said killing survivors of a strike at sea could be a violation of the laws of military warfare.\n\nBradley spoke to lawmakers alongside the chairman of the Joint Chiefs of Staff, Gen. Dan Caine, in a classified session. His testimony provided fresh information at a crucial moment as Hegseth’s leadership comes under scrutiny, but it did little to resolve growing questions about the legal basis for President Donald Trump’s extraordinary campaign to use war powers against suspected drug smugglers. \n\nLawmakers offered differing accounts of what they saw on the video.\n\nRepublican Sen. Tom Cotton of Arkansas said he saw the survivors “trying to flip a boat loaded with drugs bound for United States back over so they could stay in the fight.”\n\nConnecticut Rep. Jim Himes, the top Democrat on the House Intelligence Committee, said, “What I saw in that room was one of the most troubling things I’ve seen in my time in public service.”\n\n“You have two individuals in clear distress, without any means of locomotion, with a destroyed vessel,” he said, adding they “were killed by the United States.”\n\nWashington Rep. Adam Smith, the top Democrat on the House Armed Services Committee, said the survivors were “basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water — until the missiles come and kill them.”","url":"https://www.huffpost.com/entry/military-strike-suspected-drug-boat_n_69322f3ee4b08d8fed015cef?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/69322f87190000122f7f3542.jpeg?cache=l29DFUHOVK&ops=1778_1000","video":null,"publish_date":"2025-12-05 01:05:03","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.164},{"id":385145880,"title":"U.S. Military Conducts Strike On Another Suspected Drug Boat As Probe Into The First Strike Begins","text":"WASHINGTON (AP) — U.S. Southern Command announced that it had conducted another strike against a small boat in the eastern Pacific Ocean on Thursday, following a pause of almost three weeks.\n\nIt is the 22nd strike the U.S. military has carried out against boats in the Caribbean Sea and eastern Pacific Ocean that the Trump administration claimed were trafficking drugs. \n\nThere were four casualties in Thursday’s strike, according to the social media post, bringing the death toll of the campaign to at least 87 people.\n\nIn a video that accompanied the announcement, a small boat can be seen moving across the water before it is suddenly consumed by a large explosion. The video then zooms out to show the boat covered in flames and billowing smoke. \n\nThe strike was conducted the same day Adm. Frank “Mitch” Bradley appeared for a series of closed-door classified briefings at the U.S. Capitol as lawmakers began an investigation into the very first strike carried out by the military on Sept. 2. The sessions came after a report that Bradley ordered a follow-on attack that killed the survivors to comply with Defense Secretary Pete Hegseth’s demands.\n\nBradley told lawmakers there was no “kill them all” order from Hegseth, but a stark video of the entire series of attacks left some lawmakers with serious questions.\n\nLegal experts have said killing survivors of a strike at sea could be a violation of the laws of military warfare.\n\nBradley spoke to lawmakers alongside the chairman of the Joint Chiefs of Staff, Gen. Dan Caine, in a classified session. His testimony provided fresh information at a crucial moment as Hegseth’s leadership comes under scrutiny, but it did little to resolve growing questions about the legal basis for President Donald Trump’s extraordinary campaign to use war powers against suspected drug smugglers. \n\nLawmakers offered differing accounts of what they saw on the video.\n\nRepublican Sen. Tom Cotton of Arkansas said he saw the survivors “trying to flip a boat loaded with drugs bound for United States back over so they could stay in the fight.”\n\nConnecticut Rep. Jim Himes, the top Democrat on the House Intelligence Committee, said, “What I saw in that room was one of the most troubling things I’ve seen in my time in public service.”\n\n“You have two individuals in clear distress, without any means of locomotion, with a destroyed vessel,” he said, adding they “were killed by the United States.”\n\nWashington Rep. Adam Smith, the top Democrat on the House Armed Services Committee, said the survivors were “basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water — until the missiles come and kill them.”","url":"https://www.huffpost.com/entry/military-strike-suspected-drug-boat_n_69322f3ee4b08d8fed015cef?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/69322f87190000122f7f3542.jpeg?cache=l29DFUHOVK&ops=1778_1000","video":null,"publish_date":"2025-12-05 01:05:03","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.164},{"id":385094870,"title":"Former Trinidad footballer Shaka Hislop reveals he has prostate cancer","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShaka Hislop \n\n International News, Latest News \n\nDecember 4, 2025\n\n\n\n\n Former Trinidad footballer Shaka Hislop reveals he has prostate cancer \n\n\n\n\n\n\n\nFormer Newcastle goalkeeper Shaka Hislop has revealed that he is battling with prostate cancer.\n\nHislop made the revelation in a video on his Instagram page.\n\n“Roughly, 18 months ago, I went for my annual physical and insisted on a PSA test. As I always do. This time, though, my PSA was elevated, and MRI and biopsy quickly determined that I have a fairly aggressive prostate cancer,” he shared.\n\nThe former player said on December 6, 2024, that he had a radical prostatectomy.\n\nAccording to Johns Hopkins Medicine, a prostatectomy is a surgical procedure for the partial or complete removal of the prostate.\n\n“Six months later, my PSA was again on the rise, and another scan showed that my prostate cancer had spread to my pelvic bone. We started on medication pretty soon after and just this morning completed seven-and-a-half weeks of therapy,” he added.\n\nHislop used the opportunity to educate men about the need to have their PSA tests done, especially Caribbean men who he noted had the highest rate of prostate cancer mortality.\n\n“My community, my people, please go get tested. Know your PSA. Track its history. Prostate cancer is survivable if caught early enough. There are treatments for it. Testing saves lives; it saved mine,” he encouraged.\n\n\n\n\n\n\n\n\nTags: former footballer Prostate Cancer Shaka Hislop \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n ‘God is so good to me’ \n\n\n St Elizabeth hurricane victims grateful for home repairs by church community \n\n\n BY KELSEY THOMAS Online coordinator thomask@jamaicaobserver.com \n\n\n\nDecember 4, 2025 \n\n\n ST ELIZABETH, Jamaica — For Janet Chambers, the devastation of Hurricane Melissa was not just about losing her home, but also the overwhelming sense o... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Mom charged for death ofpregnant daughter in Michigan \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n MICHIGAN, United States — Michigan police have charged a woman and her husband with murder after the discovery of her pregnant daughter’s body in the ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n KC seek motivation for second-tier Walker Cup through record title chase \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica – For the first time in over a decade, Kingston College (KC) will not be represented in the quarterfinals of the ISSA Manning Cup. T... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Jazz Must Be returns to The Summit for second staging \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — Vocalist Apryl-Jaye will present the second staging of Island Car Rentals Presents: Jazz Must Be on Thursday, December 4 at The Su... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t receives Ethiopian delegation on hurricane recovery assistance mission \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — The Government of Jamaica on Thursday received a high-level delegation from the Federal Democratic Republic of Ethiopia which was ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Jamaica-bound hurricane relief container robbed in Canada \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n TORONTO, Canada — Canadian police are investigating what volunteers say is a heartbreaking robbery after thieves emptied out a container of donated it... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump’s immigration stance contradicting World Cup ‘unity’ message \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States — With the World Cup draw set for Washington this Friday, United States (US) President Donald Trump is expected to feature h... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/04/trinidadia-footballer-shaka-hislop-reveals-prostate-cancer/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/02/2181c72925258c791a483248ddd45a6b-1024x577.jpg","video":null,"publish_date":"2025-12-05 01:03:16","author":null,"language":"en","source_country":"jm","sentiment":0.22},{"id":385147398,"title":"Donald, Melania Trump participate in National Christmas Tree Lighting ceremony at White House","text":"President Donald Trump let the first lady light the National Christmas Tree at a ceremony in the nation’s capital Thursday evening. “The first lady is going to do the honors,” Trump said. He counted down from five to zero, and Melania Trump stepped forward and pressed a button that made the tree behind them sparkle with gold-toned lights.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/donald-melania-trump-participate-in-national-christmas-tree-lighting-ceremony-at-white-house/videoshow/125778224.cms","image":"https://img.etimg.com/thumb/msid-125778224,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-125778224,imgsize-108694.cms","publish_date":"2025-12-05 01:03:09","author":"Et Online","authors":["Et Online"],"language":"en","source_country":"in","sentiment":-0.625},{"id":385147350,"title":"FirstUp: Putin to visit Rajghat, hold summit talks with PM Modi... The big news today","text":"It is set to be a busy Friday with several events lined up for the day.\nPrime Minister Narendra Modi and Russian President Putin will attend the 23rd India–Russia Annual Summit today.\nThis is Putin’s first trip to India in four years and the first since the invasion of Ukraine in February 2022.\nThe Reserve Bank of India Governor Sanjay Malhotra is to announce the panel’s decision on rate cuts.\nHere is all that will take place across the world.\nSTORY CONTINUES BELOW THIS AD The Putin-Modi summit The Russian premier will have a packed schedule today. He and PM Modi will hold discussions to strengthen trade, defence and economic ties.\nThe two leaders will participate in the 23rd India-Russia summit. Putin will begin his day with a visit to Rashtrapati Bhavan at 11 am, where he will be accorded a ceremonial welcome.\nMore from Explainers Why has the rupee hit a record low? What does it mean for Indians? PM Modi gifts Russian edition of Bhagavad Gita to President Putin Both leaders are also expected to issue a joint statement after the talks.\nHe will also attend the launch of Russia’s state-run broadcaster RT’s India channel.\nAround 7 pm, the Russian leader will meet President Droupadi Murmu, who will host a banquet in his honour.\nPutin is expected to depart from India around 9:30 pm.\nRBI to announce repo rate Amid low inflation and strong growth, all eyes are on the briefing of Reserve Bank of India governor Sanjay Malhotra, who will reveal the panel’s decision on rates cut today.\nIt comes just five days before the US Federal Reserve chair Jerome Powell makes his announcement on Fed rate cuts.\nThe Monetary Policy Committee is reviewing rates from December 3-5, with the main focus being to assess the repo rate, growth projections and other crucial policy matters.\nQuick Reads View All Why does Putin travel with a ‘poop suitcase’? Su-57 fighter jets, labour and civil nuclear cooperation… Deals likely to be cracked during Putin’s India visit 2026 FiFa World Cup draw in presence of Trump The United States President Donald Trump will be in attendance at Friday’s Fifa World Cup 2026.\nTrump’s favourite campaign anthem, ‘YMCA’, will also be performed by the original American disco group Village People at the Kennedy Centre.\nUS President Donald Trump is set to receive the inaugural FIFA Peace Prize at the World Cup 2026 draw on Friday in Washington. Reuters The Fifa World Cup has been expanded from a 32-team format. The 2026 mega event will be the first tournament to have 48 teams.\nClassical singer Andrea Bocelli will be performing at the event. British pop star Robbie Williams and American singer Nicole Scherzinger will also entertain the audience with their presence.\nSTORY CONTINUES BELOW THIS AD German Chancellor Merz in Norway The German Chancellor Friedrich Merz will visit Oslo today at the invitation of Prime Minister Jonas Gahr Støre.\n“I look forward to further developing our strategic partnership, not least in the area of defence cooperation. Norway and Germany already cooperate on submarines and tanks. This strengthens our security policy ties,” asserted Prime Minister Jonas Gahr Støre. I believe that space will be an important area of strategic cooperation for our two countries in the future. This opens up opportunities for Norwegian and German businesses and contributes to greater security in Europe,” he added.\nAuction of Birkin bag that belonged to Jane Today, Jane Birkin’s Hermès “Birkin Voyageur” bag is being auctioned in Abu Dhabi. It is estimated to be worth between $230,000 and $430,000.\n“My Birkin bag, my globetrotting companion”, the black leather bag has a handwritten inscription by Birkin\nThe auction is a part of the inaugural Abu Dhabi Collectors’ Week. With inputs from agencies","url":"https://www.firstpost.com/explainers/firstup-putin-to-visit-rajghat-hold-summit-talks-with-pm-modi-the-big-news-today-13956629.html","image":"https://images.firstpost.com/uploads/2025/12/delhi-2025-12-42670b19a681ffc0d49db82c48de587b.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2025-12-05 01:00:28","author":"Fp Explainers","authors":["Fp Explainers"],"language":"en","category":"politics","source_country":"in","sentiment":0.626},{"id":385144932,"title":"Gov. Walz denounces Trump for calling Minnesota's Somali community garbage'","text":"St. Paul (US), Dec 5 (AP) Democratic Gov. Tim Walz denounced President Donald Trump on Thursday for calling Minnesota’s Somali community “garbage” and dismissing the state as a “hellhole”.\nWalz said on Thursday that Trump slandered all Minnesotans and that his expressions of contempt for the state’s Somali community — the largest in the U.S. — were “unprecedented for a United States president. We’ve got little children going to school today who their president called them garbage.” Republican legislative leaders stopped short of accepting the governor’s invitation to join him in condemnation, and countered that the dispute wouldn’t have erupted if Walz had acted more effectively to prevent fraud in social service programs.\nTrump’s rhetoric against Somalis in the state has intensified since a conservative news outlet, City Journal, claimed last month that taxpayer dollars from defrauded government programs have flowed to the Somali militant group al-Shabab, an affiliate of al-Qaida.\nOn Thanksgiving, Trump called Minnesota “a hub of fraudulent money laundering activity” and said he was terminating Temporary Protected Status for Somalis in Minnesota, a legal safeguard against deportation for immigrants from certain countries.\nThe president went further Tuesday, saying at a Cabinet meeting that he did not want immigrants from the war-torn East African country to stay in the U.S. “We can go one way or the other, and we’re going to go the wrong way if we keep taking in garbage into our country,” he said.\nAnd Trump kept it up Wednesday, saying Minnesota had become a “hellhole” because of them. “Somalians should be out of here,” he told reporters. “They’ve destroyed our country.” Federal authorities have prepared an immigration enforcement operation in Minnesota this week that a person familiar with the planning said would focus on Somalis living unlawfully in the U.S.\nA congressional report put the number of Somalis with protected status at around 700 nationwide. Within that, Walz estimated the number of Minnesota Somalis to be around 300.\nWalz and community leaders said they didn’t have figures on how many people might have been detained in recent days. The Immigration and Customs Enforcement press office did not reply to requests for details Wednesday or Thursday.\nThe Minneapolis-St. Paul area is home to about 84,000 people of Somali descent, who make up nearly one-third of the Somalis living in the U.S. Almost 58% of the Somalis in Minnesota were born in the U.S., and 87% of the foreign-born Somalis in Minnesota are naturalized U.S. citizens.\nIt’s unclear how much loss there’s been due to fraud schemes against government programs in Minnesota. Many but not all of the defendants in those cases are Somali Americans, and most are U.S. citizens.\nFederal prosecutor Joe Thompson — who led the investigation into the $300 million Feeding Our Future scandal, which has led to charges against 78 people — estimated in an interview with KSTP-TV this summer that the total across several programs could reach $1 billion.\nWalz said an audit due for completion by late January should give a better picture, but allowed that the $1 billion figure “certainly could be” accurate. He said his administration is taking aggressive action to prevent additional fraud.\n“Demonizing an entire group of people by their race and their ethnicity, a very group of people who contribute to the vitality — economic, cultural — of this state is something I was hoping we’d never have to see. This is on top of all the other vile comments,” Walz told reporters during a briefing on the state’s budget.\nRepublican Minnesota House Speaker Lisa Demuth, who is running for governor and has said she hopes to win Trump’s endorsement, hedged when asked if she would condemn the president’s remarks, too.\n“In no way do I believe any community is all bad. Just like I don’t believe any community is all good,” Demuth said. “What we need to do is call the fraudsters in any community accountable for their actions and stop it here in the state of Minnesota.” GOP state Sen. Eric Pratt, who is running for the suburban congressional seat being vacated by Democratic U.S. Rep. Angie Craig, went a little further.\n“It wasn’t said the way that I would have said it,” Pratt said. “But what I will say is, I share the president’s frustration in the amount of fraud and corruption that’s effectively gone on in the state. I mean, it’s really put a black eye on the state, and we are in the national news for all the wrong reasons.” The president’s attacks also drew condemnations Thursday from lawmakers in Ohio, which has the second-largest Somali population in the U.S.\n“Our Somali neighbors deserve to live in a state where they are respected for their contributions and not singled out by divisive commentary,” said state Rep. Terrence Upchurch, president of the Ohio Legislative Black Caucus.\n“President Trump’s comments about Somali immigrants are xenophobic, dangerous and wholly unacceptable from any public official, let alone the President of the United States,” the Ohio Jewish Caucus said in a separate statement. (AP) DIV DIV","summary":"","url":"https://www.news18.com/agency-feeds/gov-walz-denounces-trump-for-calling-minnesotas-somali-community-garbage-9750890.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-12-05 01:00:05","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.316},{"id":385146926,"title":"US military conducts strike on another suspected drug boat as probe into the first strike begins","text":"By KONSTANTIN TOROPIN, Associated Press\n\nWASHINGTON (AP) — U.S. Southern Command announced that it had conducted another strike against a small boat in the eastern Pacific Ocean on Thursday, following a pause of almost three weeks.\n\nIt is the 22nd strike the U.S. military has carried out against boats in the Caribbean Sea and eastern Pacific Ocean that the Trump administration claimed were trafficking drugs.\n\nThere were four casualties in Thursday’s strike, according to the social media post, bringing the death toll of the campaign to at least 87 people.\n\nIn a video that accompanied the announcement, a small boat can be seen moving across the water before it is suddenly consumed by a large explosion. The video then zooms out to show the boat covered in flames and billowing smoke.\n\nThe strike was conducted the same day Adm. Frank “Mitch” Bradley appeared for a series of closed-door classified briefings at the U.S. Capitol as lawmakers began an investigation into the very first strike carried out by the military on Sept. 2. The sessions came after a report that Bradley ordered a follow-on attack that killed the survivors to comply with Defense Secretary Pete Hegseth’s demands.\n\nBradley told lawmakers there was no “kill them all” order from Hegseth, but a stark video of the entire series of attacks left some lawmakers with serious questions.\n\nLegal experts have said killing survivors of a strike at sea could be a violation of the laws of military warfare.\n\nBradley spoke to lawmakers alongside the chairman of the Joint Chiefs of Staff, Gen. Dan Caine, in a classified session. His testimony provided fresh information at a crucial moment as Hegseth’s leadership comes under scrutiny, but it did little to resolve growing questions about the legal basis for President Donald Trump’s extraordinary campaign to use war powers against suspected drug smugglers.\n\nLawmakers offered differing accounts of what they saw on the video.\n\nRepublican Sen. Tom Cotton of Arkansas said he saw the survivors “trying to flip a boat loaded with drugs bound for United States back over so they could stay in the fight.”\n\nConnecticut Rep. Jim Himes, the top Democrat on the House Intelligence Committee, said, “What I saw in that room was one of the most troubling things I’ve seen in my time in public service.”\n\n“You have two individuals in clear distress, without any means of locomotion, with a destroyed vessel,” he said, adding they “were killed by the United States.”\n\nWashington Rep. Adam Smith, the top Democrat on the House Armed Services Committee, said the survivors were “basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water — until the missiles come and kill them.”","summary":"There were four casualties in Thursday’s strike, according to U.S. Southern Command.","url":"https://www.twincities.com/2025/12/04/us-trump-cartels/","image":"https://www.twincities.com/wp-content/uploads/2025/12/Trump_Christmas_Tree_56407-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-05 00:59:31","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.189},{"id":385144630,"title":"Washington DC lights the National Christmas Tree","text":"“So I’ve never been here, and so it’s a wonderful experience with my family. We are just exploring the city, and it’s so beautiful,” said Melissa from Pensacola, Florida.\n\nEvery year, students adorn the tree with ornaments from every state, territory, and Washington, D.C. This year’s ornaments focused on the history, heritage, and culture of the artists’ homes across the country.\n\n“Someone in the Capitol area in my neighborhood said they had an extra ticket, so I lucked out here… I just came straight from work. I don’t have any gloves, so I’m gonna freeze, but it’s gonna be great, it’s gonna be fun,” Marybeth Morgan said.\n\nPresident Calvin Coolidge began the National Christmas Tree lighting tradition when he walked to the Ellipse to light the tree in 1923, accompanied by a performance from the U.S. Marine Band. President Donald Trump continues the 103-year-long tradition.\n\nIn addition to the National Christmas Tree, 58 trees were also decorated in the President’s Park. America250, a bipartisan organization leading celebrations for America’s 250th anniversary, also debuted its tree with ornaments designed by winners of a school contest that asked the question: “What does America mean to you?” \n\n“We are honored to partner with the National Park Foundation on this longstanding tradition. As we celebrate the creativity of this year’s America’s Field Trip winners, we’re also inviting students across the country to add their voices to this historic moment. We encourage all students in grades 3–12 to enter the contest by March 30 for a chance to have their artwork featured on next year’s tree,” an America250 spokesperson said in a statement to the Washington Examiner. \n\nPresident Donald Trump and first lady Melania Trump participated in the annual lighting, with Trump speaking on the beginning of the holiday season.\n\n“Tonight, this beautiful evergreen tree glows bright on the dark and cold winter night and reminds us of the words of [the] Gospel of John. In him was life, and that life was the light of all mankind. Beautiful words with the birth of Jesus, human history turned from night today. His word and his example, call us to love one another to serve one another,” Trump said.\n\nThis year’s lighting celebration featured musical performances from Gabby Barrett and Matthew West, Alana Springsteen, and the U.S. Navy Band Commodores Jazz Ensemble, among others.\n\nThe public can view the ceremony on Great America Family at 8 p.m., Dec. 5.\n\nThe tree will be lit daily after sunset and stay up until the New Year.","summary":"With 21 days until Christmas Day, the National Christmas Tree has arrived, been decorated, and lit to celebrate the holiday season.&#160; The 35-foot-tall spruce tree made its journey from the George Washington and Jefferson National Forest in Virginia early Thursday morning, and the event has attracted visitors from all over the country. “So I’ve never [&#8230;]","url":"https://www.washingtonexaminer.com/news/3907214/washington-dc-lights-the-national-christmas-tree/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/12/AP25339005295509.jpg?w=696","video":null,"publish_date":"2025-12-05 00:57:52","author":"Adisa Hargett-Robinson","authors":["Adisa Hargett-Robinson"],"language":"en","source_country":"US","sentiment":0.299},{"id":385146250,"title":"'79 year-old kid': Joe Rogan mocks Trump's 'ridiculous' texting style","text":"Podcaster Joe Rogan recently revealed that President Donald Trump often sends him text messages out of the blue, and ridiculed his style as childish.\n\nThat's according to a Thursday article in The Daily Beast, which reported that Rogan said the president texts like a \"79 year-old kid\" while interviewing Nvidia CEO Jensen Huang on his podcast. He further described him as \"an odd guy.\"\n\n\"He makes the text go big, like ‘USA is RESPECTED again’ — all caps — and it makes the text enlarge,\" Rogan said. \"It’s kind of ridiculous.\"\n\nHuang laughed at Rogan's anecdote, but went on to say that Trump was \"surprising\" in person. The Nvidia CEO has found common ground with the Trump administration on the matter of regulating artificial intelligence (AI), with Huang's company manufacturing a bulk of the chips that power AI globally. Both Trump and Huang have publicly opposed state-level efforts to regulate AI.\n\n\"The one-on-one Trump, President Trump, is very different,\" Huang told Rogan.\n\nRogan, who endorsed Trump in the 2024 election, went on to say that \"there's a lot of things [Trump] does\" that he shouldn't, and listed the example of Trump calling a female reporter \"piggy\" who asked him a question about the Epstein files.\n\n“I wish he hadn’t done that,” Rogan said. “But other than that, he’s an interesting guy.”\n\nRogan's interview with Huang was a notable shift from the podcaster's previous adversarial attitude toward the administration's resistance toward releasing the Department of Justice's remaining evidence pertaining to convicted child predator Jeffrey Epstein. Rogan said Trump dragging his feet on releasing the Epstein files was his \"line in the sand,\" and that the administration was attempting to \"gaslight\" Americans by walking back his previous rhetoric about full transparency when it came to Epstein.\n\nClick here to read the Daily Beast's full article (subscription required).","summary":"Podcaster Joe Rogan recently revealed that President Donald Trump often sends him text messages out of the blue, and ridiculed his style as childish.\n\nThat's according to a Thursday article in The Daily Beast, which reported that Rogan said the president texts like a \"79 year-old kid\" while interviewing Nvidia CEO Jensen Huang on his podcast. He further described him as \"an odd guy.\"\n\n\"He makes the text go big, like ‘USA is RESPECTED again’ — all caps — and it makes the text enlarge,\" Rogan said. \"It’s kind of ridiculous.\"\n\nHuang laughed at Rogan's anecdote, but went on to say that Trump was \"surprising\" in person. The Nvidia CEO has found common ground with the Trump administration on the matter of regulating artificial intelligence (AI), with Huang's company manufacturing a bulk of the chips that power AI globally. Both Trump and Huang have publicly opposed state-level efforts to regulate AI.\n\n\"The one-on-one Trump, President Trump, is very different,\" Huang told Rogan.\n\nRogan, who endorsed Trump in the 202","url":"https://www.alternet.org/joe-rogan-trump-kid/","image":"https://www.alternet.org/media-library/image.png?id=62284693&width=1200&height=600&coordinates=0%2C101%2C0%2C101","video":null,"publish_date":"2025-12-05 00:57:46","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"us","sentiment":-0.272},{"id":385094872,"title":"Mom charged for death of  pregnant daughter in Michigan","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPregnant belly (Photo: CMC) \n\n International News, Latest News \n\nDecember 4, 2025\n\n\n\n\n Mom charged for death ofpregnant daughter in Michigan \n\n\n\n\n\n\n\nMICHIGAN, United States — Michigan police have charged a woman and her husband with murder after the discovery of her pregnant daughter’s body in the woods, three weeks after she went missing.\n\nA report from the Associated Press details that the 22-year-old victim Rebecca Park was almost to term in her pregnancy when she went missing.\n\nCortney Bartholomew was Park’s biological mother, but Park was raised by a couple who adopted her and her siblings.\n\nWhen Rebecca’s body was discovered, the baby had been cut out of her the report indicated an action prosecutor Johanna Carey described as ‘evil personified’.\n\nForty-year-old Cortney and her husband 47-year-old Brad Bartholomew, were both charged with murder, torture and other crimes.\n\nThe prosecutor did not disclose a motive but explained the circumstances of the crime, “Mr Bartholomew brought Rebecca to their home, forced her into another vehicle and took her into the woods where they stabbed her, forced her to lie on the ground while they cut her baby out, ultimately caused her death and the death of the baby,” Carey said.\n\nThe couple has been denied bond and appeared in court by video link.\n\n\n\n\n\n\n\n\n\nTags: death murder pregnancy \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n KC seek motivation for second-tier Walker Cup through record title chase \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica – For the first time in over a decade, Kingston College (KC) will not be represented in the quarterfinals of the ISSA Manning Cup. T... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Jazz Must Be returns to The Summit for second staging \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — Vocalist Apryl-Jaye will present the second staging of Island Car Rentals Presents: Jazz Must Be on Thursday, December 4 at The Su... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t receives Ethiopian delegation on hurricane recovery assistance mission \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — The Government of Jamaica on Thursday received a high-level delegation from the Federal Democratic Republic of Ethiopia which was ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Jamaica-bound hurricane relief container robbed in Canada \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n TORONTO, Canada — Canadian police are investigating what volunteers say is a heartbreaking robbery after thieves emptied out a container of donated it... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump’s immigration stance contradicting World Cup ‘unity’ message \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States — With the World Cup draw set for Washington this Friday, United States (US) President Donald Trump is expected to feature h... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Leader of notorious Haitian gang sentenced to life in prison \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States (CMC) — The self-proclaimed “king” of Haiti’s violent 400 Mawozo gang, Joly Germine, was on Wednesday sentenced to life in p... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic changes announced for Santa Cruz during festive season \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n ST ELIZABETH, Jamaica — Effective Monday, December 8, 2025, traditional Christmas traffic changes will be in effect for the town of Santa Cruz, St Eli... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/04/mom-charged-death-pregnant-daughter-michigan/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/tecnavia-social-meta-image?post_slug=mom-charged-death-pregnant-daughter-michigan","video":null,"publish_date":"2025-12-05 00:56:15","author":null,"language":"en","source_country":"jm","sentiment":-0.004},{"id":385147252,"title":"US military conducts strike on another suspected drug boat","text":"WASHINGTON (AP) — U.S. Southern Command announced that it had conducted another strike against a small boat in the eastern Pacific Ocean on Thursday, following a pause of almost three weeks.\n\nIt is the 22nd strike the U.S. military has carried out against boats in the Caribbean Sea and eastern Pacific Ocean that the Trump administration claimed were trafficking drugs. \n\nThere were four casualties in Thursday’s strike, according to the social media post, bringing the death toll of the campaign to at least 87 people.\n\nIn a video that accompanied the announcement, a small boat can be seen moving across the water before it is suddenly consumed by a large explosion. The video then zooms out to show the boat covered in flames and billowing smoke. \n\nThe strike was conducted the same day Adm. Frank “Mitch” Bradley appeared for a series of closed-door classified briefings at the U.S. Capitol as lawmakers began an investigation into the very first strike carried out by the military on Sept. 2. The sessions came after a report that Bradley ordered a follow-on attack that killed the survivors to comply with Defense Secretary Pete Hegseth’s demands.\n\nBradley told lawmakers there was no “kill them all” order from Hegseth, but a stark video of the entire series of attacks left some lawmakers with serious questions.\n\nLegal experts have said killing survivors of a strike at sea could be a violation of the laws of military warfare.\n\nBradley spoke to lawmakers alongside the chairman of the Joint Chiefs of Staff, Gen. Dan Caine, in a classified session. His testimony provided fresh information at a crucial moment as Hegseth’s leadership comes under scrutiny, but it did little to resolve growing questions about the legal basis for President Donald Trump’s extraordinary campaign to use war powers against suspected drug smugglers. \n\nLawmakers offered differing accounts of what they saw on the video.\n\nRepublican Sen. Tom Cotton of Arkansas said he saw the survivors “trying to flip a boat loaded with drugs bound for United States back over so they could stay in the fight.”\n\nConnecticut Rep. Jim Himes, the top Democrat on the House Intelligence Committee, said, “What I saw in that room was one of the most troubling things I’ve seen in my time in public service.”\n\n“You have two individuals in clear distress, without any means of locomotion, with a destroyed vessel,” he said, adding they “were killed by the United States.”\n\nWashington Rep. Adam Smith, the top Democrat on the House Armed Services Committee, said the survivors were “basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water — until the missiles come and kill them.”","url":"https://apnews.com/article/trump-hegseth-pentagon-drug-boats-pacific-35a60ce3bc018e5f66c18b2d18b49c35","image":"https://dims.apnews.com/dims4/default/7b2fc5e/2147483647/strip/false/crop/2738x1825+0+0/resize/1486x990!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fe1%2F486485062434904149f6152ac061%2F50b20bf2b41e4586965fac9dcddd7af9","video":null,"publish_date":"2025-12-05 00:52:08","author":"Konstantin Toropin","authors":["Konstantin Toropin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.164},{"id":385144622,"title":"Modi rolls out the red carpet for Putin, defying U.S. pressure","text":"Russian President Vladimir Putin arrived in New Delhi for his first state visit to India since Russia’s full-scale invasion of Ukraine, showcasing warming ties that have angered the U.S. and led to hefty trade tariffs.Putin was welcomed at the airport by Prime Minister Narendra Modi, who embraced the Russian leader after he disembarked from his plane Thursday evening in New Delhi. The two leaders watched a group of traditional dancers on the tarmac before driving together to a private dinner hosted at Modi’s residence.India is rolling out the red carpet for the Russian president, who has defied attempts by many leading Western democracies to cast him as an international pariah. The stakes are high for Modi, who is seeking to assert India’s strategic autonomy after U.S. President Donald Trump slapped tariffs of 50% on the nation’s goods to punish New Delhi for its close ties with Russia.","summary":"The stakes are high for the Indian prime minister as he seeks to assert the nation's strategic autonomy after U.S. President Donald Trump slapped tariffs of 50% on India's goods.","url":"https://www.japantimes.co.jp/news/2025/12/05/asia-pacific/politics/modi-putin-red-carpet/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/05/509931.jpg?v=3.1","video":null,"publish_date":"2025-12-05 00:52:00","author":"Sudhi Ranjan Sen,Web Master","authors":["Sudhi Ranjan Sen","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.096},{"id":385147402,"title":"Supreme Court allows Texas to use a congressional map favorable to Republicans in 2026","text":"APFILE - Texas state Sen. Pete Flores, R-Pleasanton, looks over a redrawn U.S. congressional map during debate over a bill in the Senate Chamber at the Texas Capitol in Austin, Texas, Aug. 22, 2025.\n\nA divided Supreme Court on Thursday came to the rescue of Texas Republicans, allowing next year's elections to be held under the state's congressional redistricting plan favorable to the GOP and pushed by President Donald Trump despite a lower-court ruling that the map likely discriminates on the basis of race.With conservative justices in the majority, the court acted on an emergency request from Texas for quick action because qualifying in the new districts already has begun, with primary elections in March. The Supreme Court's order puts the 2-1 ruling blocking the map on hold at least until after the high court issues a final decision in the case. Justice Samuel Alito had previously temporarily blocked the order while the full court considered the Texas appeal.The justices cast doubt on the lower-court finding that race played a role in the new map, saying in an unsigned statement that Texas lawmakers had \"avowedly partisan goals.\"In dissent, Justice Elena Kagan wrote for the three liberal justices that her colleagues should not have intervened at this point. Doing so, she wrote, \"ensures that many Texas citizens, for no good reason, will be placed in electoral districts because of their race. And that result, as this Court has pronounced year in and year out, is a violation of the Constitution.\"Live EventsThe high court's vote \"is a green light for there to be even more re-redistricting, and a strong message to lower courts to butt out,\" Richard Hasen, an election law expert at the University of California at Los Angeles law school, wrote on the Election Law Blog.The justices have blocked past lower-court rulings in congressional redistricting cases, most recently in Alabama and Louisiana, that came several months before elections.The Texas congressional map enacted last summer at Trump's urging was engineered to give Republicans five additional House seats.The effort to preserve a slim Republican majority in the House in next year's elections touched off a nationwide redistricting battle. Texas was the first state to meet Trump's demands in what has become an expanding national battle over redistricting. Republicans drew the state's new map to give the GOP five additional seats, and Missouri and North Carolina followed with new maps adding an additional Republican seat each. To counter those moves, California voters approved a ballot initiative to give Democrats an additional five seats there. The redrawn maps are facing court challenges in California and Missouri. A three-judge panel allowed the new North Carolina map to be used in the 2026 elections. The Trump administration is suing to block the new California maps, but it called for the Supreme Court to keep the redrawn Texas districts in place. The justices are separately considering a case from Louisiana that could further limit race-based districts under Section 2 of the Voting Rights Act. It's unclear how the current round of redistricting would be affected by the outcome in the Louisiana case.Texas Attorney General Ken Paxton said the Supreme Court's order \"defended Texas's fundamental right to draw a map that ensures we are represented by Republicans.\" He called the redistricting law \"the Big Beautiful Map.\"\"Texas is paving the way as we take our country back, district by district, state by state,\" Paxton said in a statement. \"This map reflects the political climate of our state and is a massive win for Texas and every conservative who is tired of watching the left try to upend the political system with bogus lawsuits.\"Texas Gov. Greg Abbott issued a statement saying: \"We won! Texas is officially - and legally - more red.\"Democratic National Committee chairman Ken Martin said in a statement that the court's decision \"to allow Texas Republicans' rigged, racially gerrymandered maps to go into effect is wrong - both morally and legally. Once again, the Supreme Court gave Trump exactly what he wanted: a rigged map to help Republicans avoid accountability in the midterms for turning their backs on the American people.\"In the Texas case, U.S. District Judges Jeffrey V. Brown and David Guaderrama concluded that the redistricting plan likely dilutes the political power of Black and Latino voters in violation of the Constitution. Trump appointed Brown in his first term while President Barack Obama, a Democrat, appointed Guaderrama.\"To be sure, politics played a role in drawing the 2025 Map,\" Brown wrote. \"But it was much more than just politics. Substantial evidence shows that Texas racially gerrymandered the 2025 Map.\"The majority opinion provoked a vituperative dissent from Judge Jerry Smith, an appeals court judge on the panel.Smith accused Brown of \"pernicious judicial misbehavior\" for not giving Smith sufficient time before issuing the majority opinion. Smith, an appointee of President Ronald Reagan, a Republican, also disagreed strenuously with the substance of the opinion, saying it would be a candidate for the \"Nobel Prize for Fiction,\" if there were such an award.\"The main winners from Judge Brown's opinion are George Soros and Gavin Newsom,\" Smith wrote, referring to the liberal megadonor and California's Democratic governor. \"The obvious losers are the People of Texas and the Rule of Law.\"U.S. Attorney General Pam Bondi hailed Thursday's Supreme Court stay, posting on X, \"Federal courts have no right to interfere with a State's decision to redraw legislative maps for partisan reasons.\"The new map eliminated five of the state's nine \"coalition\" districts, where no minority group has a majority but together they outnumber non-Hispanic white voters. The total number of congressional districts in which minorities make up a majority of voting-age citizens dropped from 16 to 14.Yet Republicans argued the map is better for minority voters. There's a new, eighth Hispanic-majority district, and two Black-majority districts instead of none.But critics consider that the Hispanic or Black majority in each district is so slim that white voters, who tend to turn out in larger percentages, will control election results.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ondemocratic national committeeronald reagansamuel alitouniversity of california at los angelessupreme courtguaderramatexas map\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ondemocratic national committeeronald reagansamuel alitouniversity of california at los angelessupreme courtguaderramatexas map \n\nExplore More Stories123","summary":"The Supreme Court has allowed Texas Republicans to use their new congressional map for next year's elections. This decision overrides a lower court ruling that found the map likely discriminated based on race. The court's action ensures the map will be used while a final decision is pending.","url":"https://economictimes.indiatimes.com/news/international/global-trends/supreme-court-allows-texas-to-use-a-congressional-map-favorable-to-republicans-in-2026/articleshow/125778131.cms","image":"https://img.etimg.com/thumb/msid-125778146,width-1200,height-630,imgsize-101742,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-12-05 00:47:00","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","category":"politics","source_country":"in","sentiment":-0.135},{"id":385144608,"title":"Australian superannuation: Super’s river of money has created a super accountability void","text":"Australia is rightfully proud of a national superannuation system that now adds up to well over $4 trillion. Even Donald Trump sounds impressed by its success.\n\nBut such an extraordinary pot of other people’s money – with billions of dollars more constantly arriving – will always attract more than the usual share of financial opportunists, ticket clippers and outright fraudsters.","url":"https://www.afr.com/companies/financial-services/super-s-river-of-money-has-created-a-super-accountability-void-20251204-p5nkwb","image":"https://static.ffx.io/images/$zoom_0.2948%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_138/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_opinion_no_age_social_wm/fdd5b278cd5880c491fa4f7cce087f4603a82890","video":null,"publish_date":"2025-12-05 00:46:52","author":"Jennifer Hewett","authors":["Jennifer Hewett"],"language":"en","category":"politics","source_country":"au","sentiment":-0.103},{"id":385144828,"title":"Who was Yasser Abu Shabab? Israel-backed anti-Hamas militia leader killed in Gaza","text":"Anti-Hamas militia leader Yasser Abu Shabab was killed on Thursday in an “internal clash” in the southern Gaza Strip, Times of Israel reported, citing Israeli defence sources. According to the sources, Abu Shabab was taken to a hospital in Israel, where he died of his wounds.Abu Shabab, a Bedouin tribal leader based in Israeli-held Rafah, led the most prominent of several small anti-Hamas groups that emerged in Gaza during the war. The Ynet news site cited a “senior source within the militia,” who said a fight broke out between families and groups within the militia, which deteriorated until shots were fired, at which point Abu Shabab was killed. Ynet later cited an Israeli security official as saying he was beaten to death as part of an argument over collaborating with Israel.When and Where: The incident occurred on Thursday in the southern Gaza Strip. As of Thursday afternoon, there was no official comment from the militia or Israeli authorities.Hamas, which branded Abu Shabab a collaborator and ordered its fighters to kill or capture him, has denied that his group received backing from Israel. Despite a US-backed ceasefire reached in October, the group continued to operate in areas controlled by Israeli forces. On November 18, the group posted a video showing dozens of fighters receiving orders from his deputy to launch a security sweep to “clear Rafah of terror,” an apparent reference to Hamas fighters believed to be holed up there.Israel’s broader operations in southern Gaza also continued. The Israel Defense Forces said on Thursday that security forces had killed more than 40 Hamas operatives in that area, including the commander of Hamas’s East Rafah Battalion, his deputy, and two other terror operatives, all of whom were killed on Sunday. According to the military, the four were spotted emerging from tunnels in eastern Rafah and were killed by troops and the Israeli Air Force.The IDF said that following a review of intelligence, it could officially confirm that Mohammad Bawab, the East Rafah Battalion commander; Ismail Abu Labda, the deputy battalion commander; Tawfiq Salem, a company commander; and Abdullah Hamad, the son of a senior Hamas official, were the four operatives killed. Bawab and Abu Labda were responsible for planning the battalion’s invasion of southern Israel during the October 7-2023 onslaught, the military said. Hamad, the son of senior Hamas official Ghazi Hamad, served as a security officer in Bawab’s team.Meanwhile, troops of the 7th Armoured Brigade stationed in southern Gaza opened fire on Thursday on a Palestinian terror operative who crossed the so-called Yellow Line that divides Gaza as part of the ceasefire agreement. The IDF said the operative posed “an immediate threat” to the soldiers. “The troops opened fire on the terrorists to remove the threat, and a hit was identified,” the military said.In related developments, Israel confirmed that the remains of Sudthisak Rinthalak, a Thai farmer kidnapped by terrorists from Israel on October 7-2023, had been returned to Israel. Only one hostage’s body remains held in the Strip—that of police officer Master Sgt. Ran Gvili.In the next stage of US President Donald Trump’s peace plan, Israel is meant to withdraw further from the Strip, establish a transitional authority to govern Gaza, deploy a multinational security force to take over from the Israeli military, disarm Hamas, and begin reconstruction. Hamas has so far refused to agree on demilitarisation. Israel insists the Strip must be demilitarised before the plan can advance. However, the US leader said Wednesday that phase two is “going to happen pretty soon,” adding that the process is “going along well.”","url":"https://timesofindia.indiatimes.com/world/middle-east/who-was-yasser-abu-shabab-israel-backed-anti-hamas-militia-leader-killed-in-gaza/articleshow/125778042.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-125778128/125778128.jpg","video":null,"publish_date":"2025-12-05 00:46:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.426},{"id":385145648,"title":"Grand jury rejects second criminal case against New York A-G Letitia James, sources say","text":"WASHINGTON – A federal grand jury on Dec 4 rejected prosecutors’ attempt to revive a criminal case against New York Attorney-General Letitia James, two sources familiar with the matter said, after a judge threw out an initial set of charges against the prominent critic of US President Donald Trump.\n\nThe indictment would have marked the Justice Department’s second attempt to prosecute Ms James, an elected Democrat, after a \n\nThe grand jury’s rejection of the case is the latest legal stumble by the Justice Department in its efforts to pursue figures who have criticised Mr Trump or led investigations into him.\n\nProsecutors plan to try again to seek a new indictment, the two sources said.\n\nA Justice Department spokesperson declined to comment.\n\nProsecutors rarely struggle to obtain indictments from grand juries given the government alone presents evidence and must only show probable cause that a crime was committed, a lower legal bar than to secure a conviction at trial.\n\nGrand juries have rejected several proposed indictments during Mr Trump’s second term, but Ms James is the most high-profile rejection yet.\n\nJames faced mortgage charges\n\nMs James is one of three high-profile Trump critics hit with federal criminal charges in recent months, along with \n\nDistrict Judge Currie also dismissed the case against Mr Comey, which was led by Ms Halligan, ruling that her appointment as interim US attorney for the Eastern District of Virginia was impermissible.\n\nBolton has pleaded not guilty to federal charges brought in Maryland.\n\nMs James initially pleaded not guilty to charges of bank fraud and lying to a financial institution. The initial indictment accused her of misleading on mortgage documents to secure more favourable loan terms for a home she owns in Norfolk, Virginia.\n\nMr Trump has long assailed Ms James over a civil fraud case she brought against Mr Trump and his family business, which resulted in a more than US$450 million (S$583.3 million) penalty after a judge found in 2024 that Mr Trump fraudulently overstated his net worth to dupe lenders.\n\nMr Trump, who campaigned in part on a vow of retribution, has for years railed against Ms James and called for her prosecution, claiming the case was brought to damage him politically.\n\nA New York state appeals court in August threw out the penalty, which had grown to more than half a billion dollars with interest, but upheld the trial judge’s finding that Mr Trump was liable for fraud.\n\nBoth Mr Trump and Ms James’ office are appealing to the state’s highest court. REUTERS","url":"https://www.straitstimes.com/world/united-states/grand-jury-rejects-second-criminal-case-against-new-york-a-g-letitia-james-sources-say","image":"https://cassette.sphdigital.com.sg/image/straitstimes/6b05baa3064128e006b6ef3c9faca7352817bc142e74c6bd5803d10aa127092a","video":null,"publish_date":"2025-12-05 00:40:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.392},{"id":385143844,"title":"Citan indulto de Trump a expresidente hondureño como motivo para sentencia indulgente a exlegislador","text":"Por LARRY NEUMEISTER\n\nNUEVA YORK (AP) — Una abogada defensora mencionó el jueves el reciente indulto que el mandatario estadounidense Donald Trump otorgó al expresidente hondureño Juan Orlando Hernández al momento de solicitar a un juez que tratara con indulgencia a un exlegislador hondureño condenado por asociación delictuosa para traficar drogas.\n\nLa abogada Kristen Santillo dijo que el indulto a Hernández hacía que fuera injusto obligar a su cliente de 65 años, Midence Oqueli Martínez Turcios, a pasar prácticamente el resto de su vida en prisión mientras otros que “son los más poderosos, que tienen más dinero… van a ir a casa”.\n\nEl juez Lewis A. Kaplan, quien alguna vez presidió un caso civil de abuso sexual contra Trump, sentenció a Martínez a 21 años y 10 meses en prisión. Si bien reconoció que las disparidades en las sentencias son un factor que los jueces deben considerar, también dejó en claro que Martínez estaba siendo sentenciado principalmente por sus crímenes.\n\n“Es mi trabajo aplicar la ley”, declaró el juez. “Hago mi trabajo”.\n\nSeñaló que la autoridad para emitir indultos se estableció en la Convención Constitucional de 1787 a 1789, la cual le otorgó poderes de indulto a Trump “que le fueron confiados y no tienen restricción legal de la que yo tenga conocimiento”.\n\n“Eso es todo lo que voy a decir sobre eso”, agregó el juez.\n\nKaplan presidió el año pasado la segunda fase de un juicio civil derivado de las afirmaciones de la columnista E. Jean Carroll de que Trump abusó sexualmente de ella en el probador de una tienda departamental de Manhattan en 1996. Un jurado le otorgó una compensación de 83,3 millones de dólares en daños.\n\nEse fallo se produjo menos de un año después de que otro jurado le otorgó a Carroll 5 millones de dólares en daños después de llegar a la conclusión de que el actual mandatario abusó sexualmente de ella y posteriormente la difamó, luego de que la columnista reveló el ataque en su autobiografía publicada en 2019.\n\nTrump no asistió al primer juicio, pero testificó durante el segundo, el cual se centró únicamente en el monto de compensación que debería pagar. Kaplan limitó severamente lo que se le podía preguntar a Trump, y su testimonio duró menos de tres minutos. En un momento, Kaplan amenazó con expulsar a Trump del tribunal después de que los abogados de Carroll se quejaron de que se le podía escuchar haciendo comentarios a su equipo legal como “es una cacería de brujas” y “esto es una verdadera farsa”.\n\nMartínez no habló durante su audiencia de sentencia del jueves. Fue acusado formalmente ante el tribunal federal de Manhattan en julio de 2018, y las autoridades hondureñas lo arrestaron en diciembre de 2022. Fue extraditado a Estados Unidos en marzo siguiente y apenas en agosto del año pasado se declaró culpable de asociación delictuosa para importar cinco kilogramos o más de cocaína entre 2004 y 2014.\n\nLa fiscalía había solicitado una sentencia de 30 años en prisión, argumentando que Martínez “trabajó directamente con una de las organizaciones de narcotráfico más reconocidas y poderosas de Honduras durante una década”.\n\nEn documentos judiciales presentados antes de la sentencia, el gobierno desestimó el argumento de Santillo de indulgencia sobre la base de que otros funcionarios hondureños recibieron mejor trato.\n\n“Aquí, por supuesto, el acusado era un exoficial militar y congresista que no sólo participó directamente en una operación a gran escala de tráfico de drogas, sino que también fue responsable de los asesinatos de varias personas, algunas de las cuales incluso fueron secuestradas y torturadas por el propio acusado, antes de su muerte”, escribieron los fiscales.\n\nEn sus argumentos por escrito, Santillo buscó una sentencia de una docena de años, mencionando el contraste en la situación de su cliente con la de otros procesados en el caso que “vivieron en el lujo y acumularon significativos activos por sus actividades de narcotráfico”.\n\nMartínez, dijo su abogada, “vivió modestamente, trabajó duro en el campo, incluso mientras era congresista, y tiene pocos activos”.\n\nTambién mencionó la posible disparidad con la indulgencia hacia otros “que ocuparon posiciones de poder mucho más altas que la del señor Martínez en Honduras, que jugaron roles más críticos en el tráfico de drogas, y que se encontró que participaron en actos de violencia comparables, si no mayores, en Honduras”.\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.","summary":"Por LARRY NEUMEISTER NUEVA YORK (AP) &#8212; Una abogada defensora mencion&#243; el jueves el reciente indulto que el mandatario estadounidense Donald Trump otorg&#243; al expresidente hondure&#241;o Juan Orlando Hern&#225;ndez al momento de solicitar a un juez que tratara con indulgencia a un exlegislador hondure&#241;o condenado por asociaci&#243;n delictuosa para traficar drogas. La abogada Kristen Santillo [&#8230;]","url":"https://www.bostonherald.com/2025/12/04/citan-indulto-de-trump-a-expresidente-hondureo-como-motivo-para-sentencia-indulgente-a-exlegislador/","image":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","video":null,"publish_date":"2025-12-05 00:37:00","author":"Associated Press Spanish","authors":["Associated Press Spanish"],"language":"en","category":"politics","source_country":"US","sentiment":1},{"id":385146878,"title":"Revealed: Lavish MAGA-influencer Qatar trip that has Trump ally Laura Loomer in a rage","text":"A group of MAGA influencers recently took a luxury trip to Qatar, sparking criticism from prominent allies of President Donald Trump, who alleged the visit smacked of a foreign influence campaign, according to a new report.\n\nIn late November, right-wing internet personalities Emily Wilson, Caitlin Sinclair and Rob Smith flew to the Gulf state and documented their visits to a nightclub, upscale restaurants and a Formula 1 race. \n\nBut, the trip wasn’t just about leisure — it also included sit-downs with Qatari officials to talk over the country’s partnership with the U.S., The Bulwark reported.\n\nThe foreign visit ignited internal conflict within the GOP, as figures such as Laura Loomer and others accused the influencers of selling out to the Qatari lobby at the expense of Israel’s interests.\n\nThe controversy unfolds as the two nations — whose relationship has deteriorated, especially after Israel’s September strike on Doha — compete to win the support of the Republican Party.\n\nTrump himself has been pulled in two directions. \n\nWhile he has proclaimed himself the most pro-Israel president in American history and stands as a staunch supporter of Prime Minister Benjamin Netanyahu, Trump has also referred to Qatar— a country that gifted him a Boeing 747 jumbo jet in May — as a “great ally.” Moreover, he advised Israel to be “very careful” following its strike on Qatar, which enraged him and spurred him to push for a ceasefire in Gaza, according to The New York Times.\n\nThe influencers’ luxe trip took place around Thanksgiving, according to The Bulwark.\n\nThe trio — who have a combined social media following of over one million users — posted videos at the red carpet for a Formula 1 race, which can cost nearly $9,000 per ticket. They also enjoyed an audience with tennis star Serena Williams and appear to have eaten at Cipriani Doha, an upscale restaurant. It’s unclear who footed the bill.\n\nWilson, who hosts a podcast called Emily Saves America, spoke glowingly of her time in the Gulf state, saying it’s preferable to the U.S.\n\n “Honestly it was amazing to finally feel safe and not be surrounded by homeless crackheads and criminals for once,” she wrote on X. “I could actually relax and enjoy myself.”\n\nOn her podcast, she added, “Wow, America’s like really third world compared to these places,” per The Bulwark.\n\nWilson also commented on the people of Qatar, noting that she viewed them far more favorably than Muslims residing in the U.S., whom she heaped scorn on.\n\n“All the Muslims there are extremely smart, successful, and productive,” she said. “The ones [in the U.S.] and in the U.K. are the ones they don’t f****** tolerate in their country, and they kick out — that’s why they suck and they’re pieces of sh**.”\n\nIn response, a slew of MAGA influencers, some of whom are strongly aligned with Israel, attacked the trio for their apparent lack of scruples.\n\n“Qatar appears to have sponsored a trip of conservative influencers to travel to Qatar for Thanksgiving, the same week President Trump signed an Executive Order proposing a 75 day review period to designate the Muslim Brotherhood as a foreign Islamic terrorist organization,” Loomer, a close ally of the president, wrote on X.\n\n“Is Qatar paying these influencers to promote Qatar?” she added. “Are they going to register with FARA [Foreign Agents Registration Act]? Are we now going to see coordinated posts from these individuals telling us ‘Qatar is our number one Ally’ and that the Muslim Brotherhood isn’t a threat?”\n\nOthers in MAGA world soon piled on. \n\nRyan Mauro, a Newsmax contributor, wrote, “You’re watching hostile subversion campaigns succeed in real time, folks.” Seth Dillon, the CEO of conservative satire site The Babylon Bee, chimed in, writing, “Does Qatar pay better than Israel?”\n\nBut, the influencers defended their foreign travel, brushing aside claims they were being paid to promote Qatari interests.\n\n“I genuinely can’t believe how clueless some people are,” Wilson wrote on X. Qatar hosts Formula 1 and people from all over the world fly in for it. Tourists, models, celebrities, fans. It is a massive international destination.”\n\nSmith seized on Loomer’s critique that he shouldn’t visit the Middle Eastern state as a gay man. \n\n“Either you don't really believe my safety was at risk, or you were actively trying to get me killed,” Smith wrote.","summary":"“Are we now going to see coordinated posts from these individuals telling us ‘Qatar is our number one Ally,’” Loomer questioned.","url":"https://www.independent.co.uk/news/world/americas/us-politics/maga-trip-qatar-laura-loomer-trump-b2878451.html","image":"https://static.independent.co.uk/2025/12/04/22/58/GettyImages-2179804288.jpeg?crop=5500,3666.7,x0,y0.2&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/yKPOGsJP-OhrQWqOm.mp4","publish_date":"2025-12-05 00:36:59","author":"Brendan Rascius","authors":["Brendan Rascius"],"language":"en","source_country":"gb","sentiment":0.252},{"id":385146958,"title":"US Supreme Court approves Texas's Republican-friendly electoral map","text":"The US Supreme Court on Thursday allowed Texas to use redrawn congressional districts for the 2026 midterm elections, boosting the hopes of President Donald Trump’s Republicans to retain control of the House of Representatives.\n\nThe decision by the conservative-dominated court stayed a lower ruling which had said the redrawn maps — pushed for by Trump — had incorrectly used race to set district lines.\n\nThe new maps carve out five new House districts in Texas that are likely to vote Republican, making it significantly harder for Democrats to win control of Congress and throw a wrench into Trump’s often unchecked power.\n\n“Texas needs certainty on which map will govern the 2026 midterm elections, so I will not delay the Court’s order,” Justice Samuel J. Alito, one of six conservatives on the court, wrote in his concurring opinion.\n\nThe three liberal justices on the Supreme Court all dissented with the order, which was unsigned.\n\nRead moreTrump cuts migrant work permits to 18 months amid renewed crackdown\n\n“The District Court conducted a nine-day hearing… And after considering all the evidence, it held that the answer was clear. Texas largely divided its citizens along racial lines to create its new pro-Republican House map,” Justice Elena Kagan wrote in her dissent.\n\nWhile the ruling is technically only a temporary halt to the lower court ruling, it effectively ensures the Republican-favoured map will be in effect for the 2026 midterms.\n\nTexas’s move to redraw its districts kicked off a race for other states to follow suit, eschewing the norm of only conducting redistricting once a decade.\n\nDemocratic-run California has already approved a new electoral map that would also create five districts more likely to vote for the left-leaning party.\n\nThose maps have been challenged in court by the Republican Party of California in a lawsuit that has received the backing of the Trump administration.\n\nRepublicans in North Carolina have also redrawn that state’s map, while efforts are underway in Indiana, Missouri, and elsewhere.\n\n(FRANCE 24 with AFP)","summary":"The US Supreme Court on Thursday allowed Texas to use its newly redrawn congressional districts for the 2026 midterms, a major win for President Donald Trump’s Republicans that could reshape the battle for control of the House and accelerate a wave of politically charged redistricting across the country.","url":"https://www.france24.com/en/americas/20251205-us-supreme-court-approves-texas-electoral-map","image":"https://s.france24.com/media/display/d8717a32-d16d-11f0-a365-005056a90284/w:1280/p:16x9/AP25328704047319.jpg","video":null,"publish_date":"2025-12-05 00:36:37","author":"FRANCE 24","authors":["FRANCE 24"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.225},{"id":385143238,"title":"Most Immigrants Prefer to Remain in the U.S. Despite Risk of Deportation, Poll Shows","text":"A majority of immigrants living in the United States say their lives are better here than in their countries of origin and that they would choose to migrate again, even as fear of arrest and deportation has increased under President Donald Trump's administration, according to a new national survey.\n\nThe KFF/New York Times Survey of Immigrants, based on responses from 1,805 immigrant adults found that most respondents believe they have gained improved financial stability, economic opportunity and long-term prospects for their families since coming to the U.S.\n\n\"Most immigrants still say their own lives are better for coming to the U.S., and most would come again,\" the report states.\n\nNevertheless, fear of enforcement has grown sharply: 41% now worry that they or a family member could be detained or deported, up from 26% in 2023. More than one in five immigrants — 22% — say they personally know someone who has been arrested, detained or deported since Trump returned to office, nearly three times the share reported in April 2025.\n\nAs a result, about half of immigrants across legal statuses report feeling less safe since January. Three in ten say they or family members avoid activities such as traveling, working, or seeking medical care due to enforcement concerns. Among likely undocumented immigrants, that figure rises to three in four.\n\nMany respondents also reported economic hardship. About half said they struggle to pay for housing, food or health care — an increase from 31% in 2023 — and many say earning a living has become more difficult in the past year.\n\nHealth concerns have also grown, with 40% of adult immigrants and 77% of likely undocumented immigrants reporting negative impacts such as stress, sleep issues or worsening medical conditions linked to fears of enforcement.\n\nOther recent polling shows similar sentiment among Latino residents. A survey by Axios Ipsos and Noticias Telemundo from early November found that less than a third of Latinos — 31% — believe it is a good time to be a Latino in the U.S., down from 55% in March 2024. A majority of respondents in that survey said they want an end to immigration raids and deportations and worry their loved ones could be targeted due to their ethnicity.\n\nOriginally published on Latin Times","summary":"A majority of immigrants living in the United States say their lives are better here than in their countries of origin and that they would choose to migrate again, even as fear of arrest and deportation has increased under President Donald Trump's administration.","url":"https://www.ibtimes.com/most-immigrants-prefer-remain-us-despite-risk-deportation-poll-shows-3791994","image":"https://d.ibtimes.com/en/full/4585279/deportation-flight.jpg","video":null,"publish_date":"2025-12-05 00:27:32","author":"Axios Ipsos","authors":["Axios Ipsos"],"language":"en","category":"politics","source_country":"US","sentiment":0.115},{"id":385144420,"title":"After review, Pentagon confirms submarine sales to Australia","text":"WASHINGTON: The Pentagon said on Monday (Dec 1) it has endorsed the tripartite AUKUS security pact with the United Kingdom and Australia, which would involve Canberra's acquisition of at least three Virginia-class nuclear submarines within 15 years.\n\nThe administration of Donald Trump said earlier this year it was reviewing a 2021 deal for the nuclear-powered attack subs signed under his presidential predecessor Joe Biden.\n\nThe Department of Defense completed its five-month review, which endorsed the AUKUS agreement and determined it is \"in alignment with President Trump's America First agenda\", Pentagon spokesman Sean Parnell said in a statement.\n\n\"Consistent with President Trump's guidance that AUKUS should move 'full steam ahead', the review identified opportunities to put AUKUS on the strongest possible footing.\"\n\nCongressman Joe Courtney, the top Democrat on a US House subcommittee on sea power, said the review's completion assures that the pact's \"framework is aligned with our country's national security interest\".\n\n\"With its completion, it is important to note that the 2021 AUKUS agreement has now survived three changes of government in all three nations and still stands strong.\"\n\nCourtney is a vocal champion of AUKUS in Congress, and represents a Connecticut district that is home to the primary submarine manufacturing facility in the US.","summary":"","url":"https://www.channelnewsasia.com/world/australia-us-aukus-pentagon-submarine-sale-5558916","image":"https://dam.mediacorp.sg/image/upload/s--rl6jsjVT--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-12-04T220435Z_1_LYNXMPELB319S_RTROPTP_3_USA-MILITARY-AUKUS.JPG?itok","video":null,"publish_date":"2025-12-05 00:24:00","author":null,"language":"en","source_country":"sg","sentiment":-0.261},{"id":385144810,"title":"Grand jury rejects justice department's bid to revive criminal case against New York Attorney General Letitia James","text":"A federal grand jury on Thursday rejected prosecutors’ attempt to revive a criminal case against New York Attorney General Letitia James, Reuters reported. The decision came after US District Judge Cameron McGowan Currie threw out an initial set of charges, finding in November that the prosecutor who secured that indictment, Lindsey Halligan, was unlawfully appointed.The indictment would have marked the Justice Department’s second attempt to prosecute James, an elected Democrat and prominent critic of President Donald Trump. Prosecutors plan to seek a new indictment, the two sources added. A Justice Department spokesperson declined to comment.Prosecutors rarely struggle to obtain indictments from grand juries, since the govt alone presents evidence and must only show probable cause that a crime was committed. Grand juries have rejected several proposed charges during Trump’s second term, but James is the most high-profile rejection yet.James is one of three high-profile Trump critics hit with federal criminal charges in recent months, along with former FBI Director James Comey and John Bolton, a former Trump national security adviser. Currie also dismissed the case against Comey, ruling that Halligan’s appointment as interim U.S. attorney for the Eastern District of Virginia was impermissible. Bolton pleaded not guilty to federal charges brought in Maryland.James initially pleaded not guilty to charges of bank fraud and lying to a financial institution. The initial indictment accused her of misleading on mortgage documents to secure more favourable loan terms for a home she owns in Norfolk, Virginia.Trump has long assailed James over a civil fraud case she brought against him and his family business, which resulted in a more than Rs 3,735 crore (approx) penalty after a judge found in 2024 that Trump fraudulently overstated his net worth to dupe lenders. A New York state appeals court in August threw out the penalty, which had grown to more than half a billion dollars with interest, but upheld the trial judge’s finding that Trump was liable for fraud. Both Trump and James’ office are appealing to the state’s highest court.A California doctor was sentenced to 2½ years in prison on Wednesday for illegally supplying ‘Friends’ sitcom star Matthew Perry with ketamine.","url":"https://timesofindia.indiatimes.com/world/us/grand-jury-rejects-justice-departments-bid-to-revive-criminal-case-against-new-york-attorney-general-letitia-james/articleshow/125777872.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-125777979/125777979.jpg","video":null,"publish_date":"2025-12-05 00:23:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.256},{"id":385145578,"title":"HEAR HEAR!!! By Donu Kogbara","text":"On this page, last Friday, I challenged those who are sure that Tinubu will win the next election and said that politics is so volatile that nobody can predict the outcome of the 2027 polls this far in advance.\n\nA wise reader called Afolabi Oni (folabioni@yahoo.com) had this to say:\n\nDear Donu Kogbara, \n\nYour write up “A Year Is A Long Time in Politics!” offers an interesting reflection on Nigeria’s shifting political climate. Yet, beyond the manoeuvres of politicians, there is a deeper issue we must confront: the troubling docility and gullibility of the Nigerian electorate.\n\nThe trajectory of President Bola Tinubu illustrates this clearly. Despite publicly chastising former President Muhammadu Buhari while the latter was still in office, Tinubu faced no real political backlash.\n\nHe then contested the presidential election-and won. Even with longstanding controversies surrounding his record, he continues to attract significant support across religious and tribal lines and also across social classes, including the elites and the masses.\n\nThis is not an isolated case. All over the country, individuals who would struggle to meet basic standards in more disciplined societies routinely contest-and comfortably win-public office.\n\nThis reality reflects less on the calibre of the politicians and more on the credibility gaps in our followership culture. The 2023 general election, however briefly, disrupted this pattern.\n\nPeter Obi’s unexpected performance was driven not by traditional political structures but by millions of Nigerians who are usually politically disengaged. Their sudden participation altered the tone and trajectory of the election season.\n\nIf Nigeria is truly serious about securing better leadership and greater accountability, this same group of motivated citizens-commonly referred to as the “Obidients”-must remain engaged.\n\nTheir participation will matter most not in just one election cycle, but over the next two or three. Sustained involvement is the only way to shift our political outcomes. If this bloc slips back into apathy, the entrenched political establishment will once again operate without meaningful challenge. There is thus a need to create a forum for continuous conversation to nurture the movement.\n\nIt is equally important to clarify that “Obidients” should not be narrowly interpreted as followers of Peter Obi alone. The label increasingly reflects Nigerians committed to transparency, reform, and national progress, irrespective of which political alliances emerge in the future, eg Obi teaming up with Atiku or El-Rufai.\n\nWhat the country needs is not the elevation of any single individual, but the consistent support of leaders who embody these values.\n\nAs long as voters remain passive, uncritical, or easily swayed, Nigeria will continue to recycle the same political actors. Real change will come not only from those who hold office, but from citizens who insist-through their votes-on something better.\n\nFriendships Lost, On Hold And At Risk\n\nA lot of Muslim/Christian friendships have been adversely affected by the recent furore about killings in Northern Nigeria.\n\nSome of my Muslim friends – Fulanis especially – feel that their ethnic group and religion are being unjustly demonized by black/white Christians in general and President Donald Trump in particular.\n\nSome have even accused ME of “unfairly” emphasizing Christian deaths at a time when Muslims are also being targeted by jihadis and bandits.\n\nOther Muslim friends of mine have chosen to maintain diplomatic silences and say nothing publicly about the elephant in the room when we are together. Then there are those who are simply avoiding me.\n\nI actually think that the angry and confrontational Muslim friends have the healthiest attitude because they are honestly airing their grievances, compelling me to hear their side of the story and insisting on communicating about the most important issue in today’s Nigeria.\n\nHaving said this, some of these blunt interactions have ended so badly that I’ve lost a couple of friendships that may never be regained.\n\nMany of the Christians around me are having similar experiences with their Muslim friends…some of whom are now former friends.\n\nI wonder whether any of these shattered relationships can eventually be repaired when the atmosphere in the country becomes less febrile. I even wonder whether the atmosphere will become less febrile in my lifetime because this does seem to be a massive tipping point.\n\nWill essentially decent Nigerian Christians and Muslims get over this corrosive tension, elevate the good things they have in common over the bad things that divide them and move forward jointly to build a less toxic nation in which no group feels oppressed or misunderstood?\n\nOr can the numerous silent and noisy rifts never be healed? In other words, is this the beginning of the end of the Nigerian Unity ideal?","url":"https://www.vanguardngr.com/2025/12/hear-hear-by-donu-kogbara/","image":"https://cdn.vanguardngr.com/wp-content/uploads/2025/06/image-118.png","video":null,"publish_date":"2025-12-05 00:23:00","author":"Emmanuel Okogba","authors":["Emmanuel Okogba"],"language":"en","source_country":"ng","sentiment":0.264},{"id":385144178,"title":"BREAKING: Supreme Court Rules on Texas Redistricting Maps for 2026 Midterms","text":"The Supreme Court allowed Texas’ redistricting maps to remain in place for the 2026 midterms in a 6-3 unsigned opinion Thursday.\n\nThe maps could grant the GOP five additional seats in the House of Representatives. \n\nThursday’s ruling comes after a lower court recently tossed out the maps, with Republican Gov. Greg Abbott appealing that decision.\n\nThe decision was an ideological split, with the six conservative justices ruling in favor of pausing the ruling from a lower court. Three liberal justices dissented. \n\nThursday’s move from the court has key implications for the midterms. \n\nAt issue for the maps according to the lower court was a concern that the newly redrawn maps posed constitutional issues based on race. \n\nAs the unsigned opinion of Abbott v. LULAC read in part, “Texas is likely to succeed on the merits of its claim that the District Court committed at least two serious errors.” The opinion also mentioned that the lower court “improperly inserted itself into an active primary campaign, causing much confusion and upsetting the delicate federal-state balance in elections.”\n\nTexas is not the only state to consider redistricting ahead of the 2026 midterms. California voters passed Proposition 50 last month to redraw maps to give Democrats a further edge in the Golden State in an effort spearheaded by Democratic Gov. Gavin Newsom. Those maps have also been challenged.\n\nBoth sides of the political aisle have been pushing for redistricting in recent years, with President Donald Trump and JD Vance urging red states to redraw their maps. Vance has framed the matter about Republicans needing to act after years of “very aggressive Democratic tricks” on redistricting. \n\nThe 2026 midterms look to be particularly consequential with Republicans narrowly controlling the House and with a slim majority in the Senate, though they do not have enough votes to overcome the filibuster. \n\nThis is a breaking news story. Check back for updates.","summary":"The Supreme Court allowed Texas&#8217; redistricting maps to remain in place for the 2026 midterms in a 6-3 unsigned opinion Thursday. The maps could grant... Read More\n\n\nThe post BREAKING: Supreme Court Rules on Texas Redistricting Maps for 2026 Midterms appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/12/04/breaking-supreme-court-rules-texas-redistricting-maps-2026-midterms/","image":"https://www.dailysignal.com/wp-content/uploads/2025/12/251204_Greg-Abbott.jpg","video":null,"publish_date":"2025-12-05 00:22:32","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.205},{"id":385141886,"title":"US signs health aid deal with Kenya in Trump first","text":"Secretary of State Marco Rubio (right) signed the agreement in Washington with Kenyan President William Ruto. (AFP pic)\nWASHINGTON: The US on Thursday signed a US$2.5 billion health aid deal with Kenya, the first such bilateral agreement after President Donald Trump tore down the historic US aid agency and sidelined NGOs.\nTrump administration officials said the agreement would be the first in a series of agreements with developing countries' governments, which will be asked to share the bill and cooperate with Washington on other priorities.\nSecretary of State Marco Rubio signed the agreement in Washington with Kenyan President William Ruto, whom he praised for the longtime US partner's assistance in troubled Haiti.\n\"If we had five or 10 countries willing to step forward and do just half of what Kenya has done already, it would be an extraordinary achievement,\" Rubio said.\nKenya has led a security force to stabilize Haiti, wracked by years of violence.\nUnder the agreement, the US will provide US$1.6 billion over five years to Kenya to work on health issues including combating HIV/AIDS and malaria and preventing polio.\nKenya will contribute another US$850 million with an agreement to gradually take on more responsibility.\nRuto said the agreement would contribute to Kenya's priorities including buying modern equipment for hospitals and boosting the health workforce.\n\"The framework we sign today adds momentum to my administration's universal health coverage,\" Ruto said.\nTrump, on his return to the White House this year, shut down the US Agency for International Development, the world's largest aid agency, as he vowed an \"America First\" policy.\nAn international group of researchers last month found that cuts by the US and other countries could lead to the preventable deaths of more than 22 million people, many of them children, by 2030.\nRubio has previously denied any deaths from aid cuts and has railed against Western non-governmental organizations with long involvement in the developing world.\n\"We are not going to spend billions of dollars funding the NGO industrial complex while close and important partners like Kenya either have no role to play or have very little influence over how health care money is being spent,\" Rubio said.\nKeeping eye on AIDS\nUS assistance cuts met wide criticism from the development world, but the UN agency in charge of combatting HIV/AIDS praised the Kenya agreement.\nUNAIDS said the agreement marks \"a milestone in the future of global health cooperation,\" and is consistent with its goal of reducing new HIV infections and AIDS-related deaths by 90% by 2030 compared with 2010 levels.\nJeremy Lewin, who is in charge of foreign assistance at the State Department under Trump, said the US would refuse accords with countries with which it has disagreements and named South Africa, which has the world's largest population of HIV-positive people.\nTrump has accused post-apartheid South Africa of targeting killings of the white minority. The government denies the claims, which have been fanned by far-right social media accounts.\nLewin said the US would also direct aid increasingly to religious groups.\nHe rejected criticism that the new approach could sideline marginalised and at-risk people, such as gay men in Uganda, where homosexuality can technically be punishable by death.\n\"We believe that the structure that we've set up will reduce cases, whether they're from the LGBT community or other people that are at high risk,\" he said.","summary":"Trump administration officials said the US$2.5 billion agreement would be the first in a series of agreements with developing countries' governments.","url":"https://www.freemalaysiatoday.com/category/world/2025/12/05/us-signs-health-aid-deal-with-kenya-in-trump-first","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/12/60ca6577-afp__20251204__874e6v7__v1__highres__uskenyapoliticsdiplomacyhealth.","video":null,"publish_date":"2025-12-05 00:21:24","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.05},{"id":385139922,"title":"Supreme Court allows Texas redistricting map for midterm elections; liberals dissent","text":"The U.S. Supreme Court temporarily approved the redistricting map in Texas for the midterm election over the dissent of the liberal justices.\n\nThe 5-3 partisan vote means Republicans will likely gain several seats from Texas. The decision blocks a lower court injunction just as politicians begin to qualify for elections in the state.\n\n'Congratulations to Texas for advancing the rule of law.' \n\nThe court has not yet issued a permanent decision on the lawsuit, claiming that the redistricting effort pushed by Republicans is discriminatory and unlawful.\n\nRepublicans hope the redrawn map will lead to five additional seats in the U.S. House, but Democrats have countered with their own redistricting effort, including one in California.\n\nThe Trump administration is suing against the new district map in California.\n\n\"To be sure, politics played a role in drawing the 2025 Map,\" U.S. District Judge Jeffrey V. Brown previously wrote in the Texas case. \"But it was much more than just politics. Substantial evidence shows that Texas racially gerrymandered the 2025 Map.\"\n\nU.S. Attorney Pam Bondi praised the decision on social media. \n\n\"Federal courts have no right to interfere with a State's decision to redraw legislative maps for partisan reasons,\" she asserted.\n\n\"A federal district court ignored that principle two weeks ago, and the Supreme Court correctly stayed that overreaching decision tonight,\" she added. \"Congratulations to Texas for advancing the rule of law, my Solicitor General John Sauer, and our team of lawyers for their excellent brief supporting Texas in this important case.\" \n\nRELATED: Gov. Hochul says New York is jumping into redistricting feud between California and Texas\n\nThe redistricting effort in California was championed by Democratic Gov. Gavin Newsom, who campaigned to push the proposition by characterizing it as a chance for Californians to push back against President Donald Trump. \n\nThe president accused them of rigging the election for the redistricting proposition, which passed easily. \n\n\"The Unconstitutional Redistricting Vote in California is a GIANT SCAM in that the entire process, in particular the Voting itself, is RIGGED,\" Trump said at the time. \"All 'Mail-In' Ballots, where the Republicans in that State are 'Shut Out,' is under very serious legal and criminal review.\" \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/supreme-court-redistrict-texas-midterms","image":"https://www.theblaze.com/media-library/supreme-court-allows-texas-redistricting-map-for-midterm-elections-liberals-dissent.jpg?id=62284592&width=1200&height=600&coordinates=0%2C166%2C0%2C167","video":null,"publish_date":"2025-12-05 00:20:00","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":-0.283},{"id":385094876,"title":"KC seek motivation for second-tier Walker Cup through record title chase","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVassell Reynolds, Kingston College football coach \n\n Latest News, Sports \n\nDecember 4, 2025\n\n\n\n\n KC seek motivation for second-tier Walker Cup through record title chase \n\n\n\n\n\n\n\nKINGSTON, Jamaica – For the first time in over a decade, Kingston College (KC) will not be represented in the quarterfinals of the ISSA Manning Cup.\n\nThe defending champions relinquished their title meekly after finishing third in their round of 16 group and failing to advance to the last eight for the first time in 12 years.\n\nThat disappointment also meant KC will not be contesting the all-island Champions Cup while being relegated to the urban area Walker Cup.\n\nIronically, it gives KC a rare chance to become the most successful school in the history of the Walker Cup.\n\nKC have won the Walker Cup nine times, the same as St George’s College, but since the controversial change to make it a second-tier competition – for teams that have been eliminated in the second round of the Manning Cup – the ‘Purples’, who last lifted the trophy in 2016, have not competed for the title. \n\nHead coach Vassell Reynold said he was disappointed to have been knocked out of the Manning Cup, but will have a go at the Walker Cup.\n\n“Having started the competition as the defending champions and to have given the preparation our best shot as a coaching staff, clearly we have to feel somewhat disappointed,” he told the Jamaica Observer.\n\n“The fact of the matter, though, is that we would have lost at least seven of our regular starters from last year’s team who would have been hard to replace.However, we had a core of players we felt had sufficient experience and we would give it our best shot to at least reach the quarter finals,” he explained.\n\n“When you look at the overall stats, just losing 1-0 to Hydel, the only loss of the season, and drawing two games, we thought the team did fairly well,” he noted.\n\n“I don’t think we gave a good enough consistent performance at the critical stage of the competition, largely because we had been chopping and changing our squad due to several circumstances.\n\n“We lost at least six to seven players of the past several weeks, including our two starting CBs, so it was very difficult for us to get going,” said Reynolds.\n\nKC were visibly weak at the back, missing the towering 16-year-old Jaeshawn Edwards, who is on trials in Dubai. He scored the opening goal in the 202 final. \n\nKC were also without the tough-tackling left back Rajae Ximines, who Reynolds said walked out of the football programme. Ximines has since been invited to the national under-20 training camp.\n\nThe school last won the Walker Cup in 2016, which was a signal that they were on their way back after a long drought. They went on to win the Manning Cup in 2018, the first time in nearly 30 years.\n\nSince then, they have been perennial contenders, winning two more Manning Cups and were all-island champions last year, having won the Olivier Shield.\n\nStepping down to the Walker Cup will take some motivation but Coach Reynolds is ready.\n\n“We feel, having not won the Walker Cup since 2016, that can be something to motivate ourselves and look forward to achieving,” said Reynolds.\n\nKC will face St Jago next Wednesday, as the Walker Cup kicks off with four games. Joint nine-time winner St George’s College will meet last year’s champion Mona High; St Catherine High take on Campion College and Tivoli Gardens play Wolmer’s Boys.\n\n\n\n\n\n\n\n\nTags: Kingston College Manning Cup Vassell Reynolds Walker Cup \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Jazz Must Be returns to The Summit for second staging \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — Vocalist Apryl-Jaye will present the second staging of Island Car Rentals Presents: Jazz Must Be on Thursday, December 4 at The Su... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t receives Ethiopian delegation on hurricane recovery assistance mission \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — The Government of Jamaica on Thursday received a high-level delegation from the Federal Democratic Republic of Ethiopia which was ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Jamaica-bound hurricane relief container robbed in Canada \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n TORONTO, Canada — Canadian police are investigating what volunteers say is a heartbreaking robbery after thieves emptied out a container of donated it... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump’s immigration stance contradicting World Cup ‘unity’ message \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States — With the World Cup draw set for Washington this Friday, United States (US) President Donald Trump is expected to feature h... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Leader of notorious Haitian gang sentenced to life in prison \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States (CMC) — The self-proclaimed “king” of Haiti’s violent 400 Mawozo gang, Joly Germine, was on Wednesday sentenced to life in p... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic changes announced for Santa Cruz during festive season \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n ST ELIZABETH, Jamaica — Effective Monday, December 8, 2025, traditional Christmas traffic changes will be in effect for the town of Santa Cruz, St Eli... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic changes to be implemented in Christiana, Manchester for the holiday season \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n MANCHESTER, Jamaica — The National Works Agency (NWA) will introduce a series of traffic changes in Christiana, Manchester, beginning Monday, December... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Unsure of how to help? 10 ways to give back Christmas \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n Hurricane Melissa has brought great tragedy to our island but it has also taught us the value of community. Many have already sprung into action by do... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/04/kc-seek-motivation-second-tier-walker-cup-record-title-chase/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/08/image_1-249.jpg","video":null,"publish_date":"2025-12-05 00:19:04","author":null,"language":"en","source_country":"jm","sentiment":0.069},{"id":385146956,"title":"Exclusive: Survivors clinging to capsized boat didn’t radio for backup, admiral overseeing double-tap strike tells lawmakers","text":"The two men killed as they floated holding onto their capsized boat in a secondary strike against a suspected drug vessel in early September did not appear to have radio or other communications devices, the top military official overseeing the strike told lawmakers on Thursday, according to three sources with direct knowledge of his congressional briefings. As far back as September, defense officials have been quietly pushing back on criticism that killing the two survivors amounted to a war crime by arguing, in part, that they were legitimate targets because they appeared to be radioing for help or backup — reinforcements that, if they had received it, could have theoretically allowed them to continue to traffic the drugs aboard their sinking ship. Defense officials made that claim in at least one briefing in September for congressional staff, according to a source familiar with the session, and several media outlets cited officials repeating that justification in the last week. But Thursday, Adm. Frank “Mitch” Bradley acknowledged that the two survivors of the military’s initial strike were in no position to make a distress call in his briefings to lawmakers. Bradley was in charge of Joint Special Operations Command at the time of the strike and was the top military officer directing the attack. The initial hit on the vessel, believed to be carrying cocaine, killed nine people immediately and split the boat in half, capsizing it and sending a massive smoke plume into the sky, the sources who viewed the video as part of the briefings said. Part of the surveillance video was a zoomed-in, higher-definition view of the two survivors clinging to a still-floating, capsized portion, they said. For a little under an hour — 41 minutes, according to a separate US official — Bradley and the rest of the US military command center discussed what to do as they watched the men struggle to overturn what was left of their boat, the sources said. Ultimately, Bradley told lawmakers, he ordered a second strike to destroy the remains of the vessel, killing the two survivors, on the grounds that it appeared that part of the vessel remained afloat because it still held cocaine, according to one of the sources. The survivors could hypothetically have floated to safety, been rescued, and carried on with trafficking the drugs, the logic went. The other source with direct knowledge of the briefing called that rationale “f**king insane.” The Pentagon did not immediately respond to a request for comment. According to Senate Intelligence Committee Chairman Tom Cotton, Republican of Arkansas, and Democratic Sen. Chris Coons of Delaware, who were also briefed, the military used a total of four missiles to sink the boat: two missiles in the initial strike, according to Coons, and two in the second strike. It was the most detailed account of the September 2 strike to date — yet it came no closer to creating a consensus view. It is considered a war crime to kill shipwrecked people, which the Pentagon’s law of war manual defines as people “in need of assistance and care” who “must refrain from any hostile act.” Although most Republicans have signaled support for President Donald Trump’s broader military campaign in the Caribbean, the secondary strike on September 2 has drawn bipartisan scrutiny — including, most consequentially, a vow from the Senate Armed Services Committee to conduct oversight. But after Thursday’s round-robin of closed-door briefings by Bradley, what had been poised to be the most significant congressional scrutiny of the campaign to date appeared to fracture along party lines. Interpretations of the video differed wildly: Cotton said he “saw two survivors trying to flip a boat, loaded with drugs bound for the United States, back over so they could stay in the fight.” House Intelligence Committee Chairman Jim Himes, Democrat of Connecticut, called it “one of the most troubling things” he has seen as a lawmaker. “Any American who sees the video that I saw will see the United States military attacking shipwrecked sailors — bad guys, bad guys, but attacking shipwrecked sailors,” Himes said. “Yes, they were carrying drugs. They were not in the position to continue their mission in any way.” Himes later told CNN’s Jake Tapper that, “The end result was two individuals without any weaponry, without any tools of any kind, clinging to a wrecked boat … the decision was taken to kill them and that is in fact what happened. And that was pretty hard to watch.” Shifting story The apparent abandonment of defense officials’ claims of a distress call as evidence of continued hostile intent — and thus, the validity of the secondary strike — is only the latest in a series of shifting accounts from the Trump administration since reports first emerged in the press over the weekend. Defense Secretary Pete Hegseth and his spokespeople initially railed against reporting of the second strike, with Hegseth calling it “fabricated, inflammatory, and derogatory reporting.” Just days later, however, White House press secretary Karoline Leavitt confirmed the second strike occurred and said Bradley was the one who ordered it. Hegseth’s role in the secondary strike — including the precise orders he gave Bradley — continues to be a point of scrutiny. Himes and other lawmakers said Thursday that the admiral told them that Hegseth did not issue an order to “kill them all,” as the Washington Post initially reported. Lawmakers were told on Thursday that Hegseth had made clear before the mission began that the strikes should be lethal, but that he was not made aware of the survivors until after they had been killed, one of the sources with direct knowledge said. During a Cabinet meeting on Tuesday, Hegseth said that he observed the initial strike on the boat but then left to attend other meetings and learned about the second strike hours later. Republican lawmakers largely stood by Hegseth after Thursday’s briefing. “I feel confident and have no further questions of Hegseth,” House Intelligence Committee Chairman Rick Crawford of Arkansas told CNN. But the precise language of Hegseth’s orders surrounding the September 2 strike — or the more than 20 others that the military has carried out — remain unclear, as has the broader legal justification for the campaign. Since the September 2 strike, the US military has carried out more than 20 additional strikes on boats it has deemed to be manned by “narco-terrorists,” killing at least 87 people in a campaign that a broad range of outside legal experts have argued is likely unlawful. “The underlying judgment that frames this entire operation is that if there is a boat with narcotics and people that are affiliated with a narcotics trafficking organization, that that’s a legitimate target,” Coons told reporters on Thursday. “I’ve still got questions about that.” CNN’s Allison Main, Manu Raju, Ellis Kim, Morgan Rimmer, Annie Grayer","url":"https://edition.cnn.com/2025/12/04/politics/strike-lawmakers-briefing-radio-survivors","image":"https://media.cnn.com/api/v1/images/stellar/prod/still-21916724-1690-981-still.jpg?c=16x9&q=w_800,c_fill","video":null,"publish_date":"2025-12-05 00:17:55","author":"Haley Britzky,Natasha Bertrand","authors":["Haley Britzky","Natasha Bertrand"],"language":"en","category":"politics","source_country":"us","sentiment":-0.544},{"id":385143848,"title":"El Mundial ampliado comienza a tomar forma con el sorteo del viernes","text":"Por RONALD BLUM\n\nWASHINGTON (AP) — La FIFA ha invitado a más equipos que nunca a un Mundial cuyos precios lo hacen asequible quizá para el 1% de los aficionados del mundo. El proceso para determinar qué partidos disputarán los equipos en un certamen ampliado a 48 naciones y dónde jugarán comienza con el sorteo de este viernes en el Centro Kennedy para las Artes Escénicas.\n\nCabo Verde, Curazao, Jordania y Uzbekistán aparecerán en el evento principal del fútbol por primera vez en el torneo del próximo año, que se celebrará del 11 de junio al 19 de julio en 16 sedes en Estados Unidos, México y Canadá.\n\n“Estoy bastante optimista porque para clasificarte necesitas vencer a los otros equipos de tus confederaciones, y eso es un signo de calidad”, expresó el jueves Arsene Wenger, exentrenador del Arsenal, mientras se instalaban alfombras rojas en el Centro Kennedy. “Los equipos no están acá por casualidad”.\n\nSe espera la presencia del presidente estadounidense Donald Trump y de su colega mexicana Claudia Sheinbaum, junto con el primer ministro de Canadá, Mark Carney. En lugar de artículos de fútbol, la tienda de regalos del Centro Kennedy todavía estaba llena de calcetines de Shakespeare, Beethoven y Verdi junto con estantes de cascanueces rojos y blancos, propios de esta temporada del año.\n\nLos 11 mejores equipos del escalafón mundial se han clasificado. Italia, el 12mo, está entre las 22 naciones que compiten en los repechajes por las seis plazas finales que se decidirán el 31 de marzo.\n\nLiderada por el capitán Lionel Messi, quien cumplirá 39 años durante el torneo, Argentina intenta convertirse en la primera nación en ganar Copas del Mundo consecutivas desde Brasil en 1958 y 1962. Messi buscará extender su récord de 26 partidos jugados y entra con 13 goles mundialistas en su carrera, a tres del récord de Miroslav Klose.\n\nLos partidos se jugarán en 11 estadios de la NFL junto con tres en México y dos en Canadá, donde se realizan obras de construcción para agregar 17.000 asientos temporales al BMO Field, elevando la capacidad a alrededor de 45.000. La asistencia superará el récord de 3,59 millones, establecido en 1994.\n\n“Básicamente establecimos el nuevo tono en términos de asistencia, en términos de rodear el torneo con mucho entretenimiento y glamour”, manifestó Alan Rothenberg, organizador principal de la Copa del Mundo de 1994 en Estados Unidos. “Hicimos muchas cosas que rompieron el hielo respecto a cómo presentar el Mundial como algo más que un torneo de fútbol”.\n\nLa FIFA anunció precios iniciales de entradas que van de 60 a 6 mil 730 dólares. Advirtió que serían dinámicos, en comparación con los precios de entre 25 y 475 dólares para el torneo de 1994 en Estados Unidos. Se ha negado a publicar una lista completa de precios, como lo había hecho para cada otra Copa del Mundo desde al menos 1990. \n\nEl organismo rector también está vendiendo pases de estacionamiento por hasta 175 dólares para un solo partido, una semifinal en Arlington, Texas.\n\nEl portavoz de FIFA, Bryan Swanson, no respondió a una solicitud para que el presidente de FIFA, Gianni Infantino, hablara sobre los precios de las entradas.\n\nSesenta y cuatro naciones participarán en el sorteo, el 30% de los miembros de FIFA, pero sólo 42 países tienen asegurados lugares. Entre los equipos de repechaje, Albania, Kosovo, Nueva Caledonia y Surinam intentan llegar a la Copa del Mundo por primera vez.\n\nCon la expansión, los dos primeros equipos de cada uno de los 12 grupos avanzan junto con los ocho mejores equipos en tercer lugar. Algunas naciones podrían llegar a la nueva ronda de dieciseisavos de final con tres puntos.\n\n“Creo que vamos a estar en muy buena forma”, opinó Tab Ramos, exmediocampista de Estados Unidos. “Tenemos un buen equipo, así que no estoy tan preocupado como en el pasado por este sorteo”.\n\nLos sistemas informáticos de Opta Analyst proyectan que Estados Unidos tiene un 0,9% de probabilidades de ganar la Copa del Mundo. Los estadounidenses no han llegado a las semifinales desde la primera Copa del Mundo en 1930. \n\nEspaña encabeza el pronóstico con un 17%, seguida de Francia (14,1%), Inglaterra (11,8%), Argentina (8,7%), Alemania (7,1%), Portugal (6,6%), Brasil (5,6%) y Holanda (5,2%).\n\nEn un nuevo giro, la FIFA informó que los cuatro mejores equipos en el ranking —España, Argentina, Francia e Inglaterra— evitarán enfrentarse entre sí hasta las semifinales si es que terminan primeros en sus grupos de la primera ronda.\n\nLas ciudades sede para la mayoría de los enfrentamientos y los horarios de inicio no se anunciarán sino hasta el sábado. En 1994, sólo hubo siete partidos nocturnos.\n\nLos lugares donde una selección jugará sus encuentros de la fase de grupos estarán restringidos a una región (oriental, central y occidental).\n\nEl sorteo de la Copa del Mundo de 1994 en Las Vegas fue apolítico, con actuaciones de Stevie Wonder, Barry Manilow, James Brown y Vanessa Williams, además del comediante Robin Williams, quien llamó a la pantalla del sorteo “el tablero de lotería más grande del mundo” y gritó “¡Bingo!” cuando se seleccionó a Grecia.\n\nEste sorteo parece ser más parecido a la ceremonia del torneo de 2018 en Moscú, inaugurada por el presidente ruso Vladimir Putin. Se espera que Trump, quien ha hecho campaña por un Premio Nobel de la Paz, reciba el propio galardón de la paz de FIFA que Infantino estableció después de viajar a varios eventos con el presidente estadounidense.\n\nPero el evento principal es la extracción de esferas de los bombos para conformar los grupos. Las estrellas retiradas Tom Brady de la NFL, Shaquille O’Neal de la NBA y Wayne Gretzky de la NHL junto con el tres veces Jugador Más Valioso de la Liga Americana Aaron Judge ayudarán en una ceremonia que será dirigida por el ex capitán de Inglaterra Rio Ferdinand.\n\n“Hay angustia y miradas de puro terror y decepción y/o alegría y euforia de los entrenadores y del personal”, comentó Alexi Lalas, exdefensor de Estados Unidos y ahora analista principal de fútbol de Fox. “Realmente se vuelve algo tangible para la gente”.\n\nDeportes AP: https://apnews.com/hub/deportes","summary":"Por RONALD BLUM WASHINGTON (AP) &#8212; La FIFA ha invitado a m&#225;s equipos que nunca a un Mundial cuyos precios lo hacen asequible quiz&#225; para el 1% de los aficionados del mundo. El proceso para determinar qu&#233; partidos disputar&#225;n los equipos en un certamen ampliado a 48 naciones y d&#243;nde jugar&#225;n comienza con el sorteo [&#8230;]","url":"https://www.bostonherald.com/2025/12/04/el-mundial-ampliado-comienza-a-tomar-forma-con-el-sorteo-del-viernes/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/MUNDIAL-SORTEO_68033.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-05 00:16:06","author":"Associated Press Spanish","authors":["Associated Press Spanish"],"language":"en","category":"politics","source_country":"US","sentiment":1},{"id":385143824,"title":"New York Times sues Pentagon over rules limiting access for media  - Dominica Gazette – Dominica &amp;","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://dominicagazette.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://dominicagazette.com/app/uploads/2025/12/ap_69321360daedf-1764889440-EsAmyU.jpg","video":null,"publish_date":"2025-12-05 00:11:56","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"dn","sentiment":-0.1},{"id":385143826,"title":"Trump hails ‘great day for the world’ as DRC, Rwanda finalise peace deal  - Dominica Gazette – Dominica","text":"United States President Donald Trump has hosted the leaders of Rwanda and the Democratic Republic of the Congo to sign a peace deal that could end the conflict between the two countries.\n\nAlthough the violence on the ground has not stopped, Trump hailed the US-brokered deal on Thursday as a new chapter for the region.\n\n“It is an amazing day: great day for Africa, great day for the world and for these two countries,” Trump said. “And they have so much to be proud of.”\n\nThe agreement was originally reached in June. DRC President Felix Tshisekedi and his Rwandan counterpart Paul Kagame had met in Qatar in March, initiating the talks that led to the deal.\n\nThursday’s ceremony finalises the accords.\n\nThe agreement has sparked hopes of ending the conflict in the DRC, where the March 23 Movement (M23), a Rwanda-backed armed group, has been advancing deeper into the resource-rich east of the country.\n\nThe renewed violence had raised fears of a full-blown conflict, akin to the wars that the DRC endured in the late 1990s, which involved several African countries and killed millions of people.\n\nRwanda’s main grievance with the DRC focuses on accusations that the Central African country has been harbouring ethnic Hutu militias linked to the 1994 Rwanda genocide, which targeted the country’s Tutsi population.\n\nThe Trump-backed peace deal stipulates that Rwanda will end its support for M23 and the DRC will help “neutralise” Hutu militias — namely, the Democratic Forces for the Liberation of Rwanda.\n\nIt also requires both countries to respect each other’s territorial integrity.\n\nOn Thursday, the DRC’s Tshisekedi said the agreement’s terms mark a “turning point” for the region.\n\n“They bring together, under a coherent architecture, a declaration of principles of a peace agreement and also the regional economic integration framework to provide to the peoples of the region a new perspective, a new outlook,” Tshisekedi said.\n\nHe added that the deal would “begin a new era of friendship, cooperation and prosperity”.\n\nFor his part, Rwanda’s Kagame said the success of the pact depends on the two countries themselves.\n\n“There will be ups and downs on the road ahead. There’s no doubt about it,” Kagame explained. “Rwanda will not be found wanting, I can assure you of that.”\n\nReporting from Washington, DC, Al Jazeera’s Alan Fisher said the leaders of the DRC and Rwanda appeared to acknowledge that it will take more than a signing ceremony for the agreement to stick.\n\nThe conflict, Fisher explained, “is a lot more ingrained, a lot more developed, a lot more aggressive than many people have assumed”.\n\n“So the pressure is on the United States, on the African leaders and, of course, on the two countries to make sure that what develops from here is something that can develop into a lasting peace.”\n\nThe DRC had signed a separate deal with M23 in July. Still, the fighting in the eastern parts of the country has persisted.\n\n“We are still at war,” Amani Chibalonza Edith, a 32-year-old resident of Goma, a key city captured by M23 early this year, told The Associated Press news agency.\n\n“There can be no peace as long as the front lines remain active.”\n\nBut in Washington, DC, on Thursday, Trump appeared optimistic about the prospects for peace.\n\n“We’ll see how it all works out, but I think it’s going to work out really great,” the US president said.\n\nTrump also announced that the US will be signing bilateral deals with the DRC and Rwanda to buy rare earth minerals from the two countries.\n\n“We’ll be involved with sending some of our biggest and greatest companies over to the two countries,” Trump added.\n\n“And we’re going to take out some of the rare earth, take out some of the assets and pay. Everybody is going to make a lot of money.”\n\nRare earth minerals are used in emerging technologies, energy production and medical devices.\n\nTrump has openly campaigned for the Nobel Peace Prize, claiming he has resolved eight world conflicts, though that number is disputed.\n\nDuring Thursday’s signing ceremony at the US Institute for Peace, a think tank, he heaped praise onto the DRC and Rwanda. But his embrace of the countries’ two leaders drew a stark contrast with his insulting remarks towards another war-torn African country: Somalia.\n\nTwo days before hosting the ceremonial signing, Trump hurled insults at Somalia, describing it as “hell” and saying that “it stinks”.\n\nHe also called the Somali community in the US “garbage”.","url":"https://dominicagazette.com/trump-hails-great-day-for-the-world-as-drc-rwanda-finalise-peace-deal/","image":"https://dominicagazette.com/app/uploads/2025/12/2025-12-04T191314Z_173990078_RC2V9IADTB06_RTRMADP_3_USA-TRUMP-RWANDA-CONGO-1764887531-q3EneK.jpg","video":null,"publish_date":"2025-12-05 00:11:54","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"dn","sentiment":0.198},{"id":385145976,"title":"World News | Trump Seals Rwanda, Congo Peace Deal; Opens Rare Earth Minerals for US","text":"Washington DC [US], December 5 (ANI): US President Donald Trump on Thursday (local time) hosted the leaders of Rwanda and the Democratic Republic of Congo (DRC) to sign a Washington-brokered peace treaty aimed at ending a 30-year conflict, and opening the region's vast critical mineral reserves for American companies.\nRwanda President Paul Kagame and Democratic Republic of Congo President Felix Tshisekedi affirmed their commitment to adhere to the deal, despite suggesting a \"demanding\" path ahead. Also Read | PM Narendra Modi Gifts Russian Edition of Bhagavad Gita to President Vladimir Putin, Says Its Teachings Inspire Millions (See Pic).\nAs the leaders signed the deal, President Donald Trump called it a \"great day for Africa.\"\n\"It is an amazing day, a great day for Africa, a great day for the world and for these two countries,\" Trump said. \"And they have so much to be proud of,\" he said. Also Read | Russian President Vladimir Putin Says India-Russia Cooperation Is Not Aimed Against Anyone, Including US.\nThis development comes after a preliminary pact was signed in June this year to end the violence. However, fighting continues on the ground with the Rwanda-backed M23 rebels, who recently captured the key Congo cities of Goma and Bukavu.\nTrump also pointed out that this deal opens a gateway for Washington to rare-earth minerals in Central Africa.\n\"There's tremendous wealth in those in that beautiful earth,\" he said, referring to rare-earth minerals in Central Africa. \"It's a beautiful Earth, but it was stained badly with blood.\"\n\"We'll be involved with sending some of our biggest and greatest companies over to the two countries,\" Trump added. \"And we're going to take out some of the rare earth, take out some of the assets and pay. Everybody is going to make a lot of money.\"\nEastern Congo is rich in gold, tin, tungsten and tantalum, while Congo is the world's biggest cobalt producer and the second-largest source of copper. Rwanda President Paul Kagame clarified if the agreement falters, then the responsibility lies with both nations.\n\"\"If this agreement falters and things do not work out as they are supposed to, the responsibility will not lie with (US) President (Donald) Trump, but with ourselves,\" he said.\n\"There will be ups and downs on the road ahead,\" Kagame continued. \"There is no doubt about it. Rwanda, I know, will not be found wanting. I can assure you of that.\"\nDRC President Felix Tshisekedi hailed the deal, calling it \"the beginning of a new path,\" mentioning the difficulties that lie ahead.\n\"I do believe this day is the beginning of a new path, a demanding path, yes, indeed, quite difficult, but this is a path where peace will not just be a wish and aspiration, but a turning point,\" he said.\nThe violence in the eastern Congo is tied to the aftermath of Rwanda's 1994 genocide, which killed up to 1 million people. The members of the Hutu militia fled into eastern Congo, triggering security concerns for Rwanda. Over the years, tensions deepened as Rwanda repeatedly accused the DRC of sheltering hostile armed groups like the FDLR, while Kinshasa accused Kigali of backing rebel factions such as the M23. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The violence in the eastern Congo is tied to the aftermath of Rwanda's 1994 genocide, which killed up to 1 million people. The members of the Hutu militia fled into eastern Congo, triggering security concerns for Rwanda. Over the years, tensions deepened as Rwanda repeatedly accused the DRC of sheltering hostile armed groups like the FDLR, while Kinshasa accused Kigali of backing rebel factions such as the M23.","url":"https://www.latestly.com/agency-news/world-news-trump-seals-rwanda-congo-peace-deal-opens-rare-earth-minerals-for-us-7228352.html","image":"https://st1.latestly.com/wp-content/uploads/2025/12/ANI-20251204220735.jpg","video":null,"publish_date":"2025-12-05 00:10:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.08},{"id":385143322,"title":"Doorbell footage captures moment earthquake struck UK town with 'shake and bang'","text":"A doorbell camera has caught the exact moment an earthquake struck Lancashire , delivering residents an 'almighty' wake-up call. A 3.3-magnitude tremor was recorded off Silverdale's coastline at 11.23pm on Wednesday evening (December 3). Local inhabitants reported sensing as if something had smashed into their properties due to the 3km-deep seismic event. They recalled hearing a 'bizarre rumbling' and 'thunderous crash' as the tremor took place. A Silverdale local has shared doorbell footage capturing the precise instant the earthquake occurred. READ MORE: Woman and her dog die weeks before Christmas as driver goes wrong way on A48 READ MORE: Prince Harry makes brutal Donald Trump joke as he appears in surprise sketch Emergency crews were swamped with calls regarding the disturbance before the quake received official confirmation. Ben Anslow, 23, was making his way home from the local when the seismic activity began. He revealed: \"It was like this really violent shake and a loud bang. At first I thought something had exploded.\", reports Lancs Live . \"I was quite relieved to find out that it was just an earthquake. Everybody came out on the street to see what had happened. \"All the neighbours came out. It was quite a shock actually, yeah, it definitely gave me a bit of anxiety.\" Ben reports the impact caused him to wobble slightly from side to side, though it wasn't 'excessive'. \"It was more of a noise,\" he informed the M.E. N. \"The shake wasn't overly excessive on the ground, but I imagine quite a few people in buildings would have felt things shake. I know a lot of people have said they thought the chimneys were coming off roofs and things like that. \"It was quite exciting and nerve-wracking at the same time... Everybody seems to be OK which is a good thing. My dog managed to remain undisturbed in the house apparently, which is quite a relief.\" Local resident Paul, 71, who chose not to disclose his surname, chimed in: \"It was exciting. It was the middle of the night and you're thinking, 'what the f*** is that!'. We all ran out in our undergarments wondering what went on.\" David Moore, 71, was startled by the quake, initially fearing something had collided with his home. He recounted: \"I'm in bed and there's an almighty bang. It lasted around two seconds. Something I've never heard before. \"I thought something had hit the house because it was that loud. I got dressed and went outside. A couple of neighbours came out and we all sort of thought 'what was it?'. \"The consensus was that it was a sonic boom. That's what it sounded like, breaking the sound barrier. I said it was an earthquake, and they said 'nah'. But waking up this morning they say it was an earthquake. I've never experienced anything like it before.\" Antique shop owners Charlotte Fotheringham and Michael Winder were also taken aback by the ' weird rumble' while in bed, with Michael describing it as feeling 'more like an explosion'. \"We thought it was inside the house,\" he said. \"It was like this weird rumble. Luckily we've got cameras so I checked the cameras and everything was fine. It felt more like an explosion, your initial reaction isn't that it's an earthquake. It's really bizarre.\" Charlotte added: \"We were just going to sleep. Our bed was shaking... It made a noise like a really bad vibration and then a bang.\" The tremor was also experienced across neighbouring parts of Lancashire and the South Lakes. The BGS was flooded with reports of the earthquake being sensed in locations surrounding Carnforth, Morecambe, Heysham, Burton-in-Kendal and Arnside. It also gathered several accounts of the quake being detected as far north as Kendal, west as Ulverston and south as Blackpool and Cleveleys. Joni Ann Kennedy, 38, was tucked up in bed at her Morecambe home when the tremor hit. She said: \"I was in bed with my granddaughter and it started shaking, but not violently. \"There was no bang, just a sound, like a gust of wind hitting the house. It freaked me out so I video called my mum who thought I'd been dreaming as she hadn't felt a thing in her park home less than a five-minute drive away. \"I checked my cameras to see if they picked it up as I honestly thought my house had to be haunted.\" One resident from the village of Warton, roughly three miles from the epicentre, said: \"There was a short rumble and a huge bang. It really felt like part of your house had fallen down. \"When I went outside to investigate I was relieved to see the neighbours there, all thinking the same thing. Everyone had run outside to see what was happening. \"I wouldn't say it was tremors and there was no shaking - it was a very big bang. I would describe it as a rumble and then a huge bang, just as if part of your house had fallen down. It was fine once you realised all was well but I had to have a cup of tea afterwards.\" Officers confirmed nobody was hurt, whilst emergency crews rushed to evaluate potential damage after being swamped with calls regarding a 'bang' when the earthquake hit. In a statement released during the early hours, a Lancaster police spokesperson revealed: \"At 11.23pm on Wednesday night (December 3), we received reports of a loud explosion in the Carnforth area. There has been a minor earthquake in the area, near to the Lancashire and Cumbria border, measuring 3.3 magnitude. \"There have been no reports of anyone injured or damage caused but we have officers in the area, together with colleagues from the Lancashire Fire and Rescue Service and the North West Ambulance Service. If you know of any property that has been damaged or potentially, please contact 101 – quoting log 1613 of December 3.\" This marked the second earthquake to strike the UK this month, according to the British Geological Survey, following a 1-magnitude tremor in Newport, South Wales, on Monday. The organisation records between 200 and 300 earthquakes across the UK annually.","summary":"A 3.3-magnitude earthquake struck off the coast of Silverdale at 11.23pm on Wednesday night with local residents recalling hearing a 'bizarre rumbling' and 'thunderous crash'","url":"https://www.mirror.co.uk/news/uk-news/doorbell-footage-captures-moment-earthquake-36354851","image":"https://i2-prod.mirror.co.uk/article36354848.ece/ALTERNATES/s1200b/2_e1.jpg","video":null,"publish_date":"2025-12-05 00:09:10","author":"Jon Macpherson,Paige Ingram,Ramazani Mwamba,Stephen Topping","authors":["Jon Macpherson","Paige Ingram","Ramazani Mwamba","Stephen Topping"],"language":"en","source_country":"gb","sentiment":-0.656},{"id":385138588,"title":"Former Maronite Priest Still Presenting Himself as a Cleric, Denver Archdiocese Warns","text":"Andre Mahanna, a former Maronite Catholic priest who gained a national profile as a commentator, fundraiser and advocate for persecuted Christians, is continuing to present himself as a priest despite having been dismissed from the clerical state for financial impropriety, the Archdiocese of Denver announced Thursday. \n\nIn a statement, the archdiocese said Bishop Elias Zaidan of the Maronite Eparchy of Our Lady of Lebanon of Los Angeles had dismissed Mahanna from the clerical state due to financial impropriety and that Mahanna is not permitted to act or present himself validly as a Catholic priest.\n\nMahanna has no priestly faculties, the statement continues, and is not authorized to “celebrate sacraments, preach, bless, or represent himself as a cleric in any setting.” \n\nCatholics and members of the public should not engage in any invalid sacraments he is attempting nor give him money or support fundraising efforts connected to him, the archdiocese warned. \n\n“The archdiocese asks Catholics to take this warning seriously and avoid any involvement that could imply Church approval, including donations, sponsorships, event invitations, or promotion of his activities,” the statement reads, noting that Bishop Zaidan has sent an alert to all U.S. bishops warning them that Mahanna is still presenting himself as a priest.\n\nMahanna served for a time at St. Rafka Maronite Catholic Church in Lakewood, Colorado, in the Denver metro. The charitable organization he founded, Saint Rafka Mission of Hope and Mercy, is registered in Lakewood. The mission reported $138,045 in revenue against $67,422 in expenses in 2024, according to its tax forms.\n\nAlthough Mahanna’s mission is a registered 501(c)(3) nonprofit, it is not recognized as a Catholic organization and is not authorized to solicit funds or participate in ministry within the Archdiocese of Denver, the statement continues.\n\n“Neither Mr. Mahanna nor this nonprofit may take part in parish life, ministry, or fundraising in any Catholic setting within the archdiocese,” it says.\n\nArchbishop Samuel Aquila was not immediately available for further comment. The Maronite Eparchy was also queried for further comment — seeking information on the nature of his financial impropriety and the date when Mahanna was informed of his laicization — but did not hear back by publication. \n\nMahanna grew up in Lebanon during the country’s civil war and is now an American citizen, according to the biography on his website. He was a guest of President Donald Trump for the signing of an executive order on religious freedom at the White House on the National Day of Prayer in 2017 and “has been invited back to this event as one of 40 select religious leaders every year since then,” the bio says. \n\nHis bio describes him as a popular speaker and says he has written many articles focused on the unity of Christians, religious freedom, and the biblical foundation of Judeo-Christian values and traditions. \n\nDuring 2017 and 2018, Mahanna appeared several times as a guest on EWTN television programs such as EWTN News Nightly and The World Over with Raymond Arroyo, mainly as an expert voice discussing the plight of Christians in the Middle East. (Note: EWTN is the parent company of the Register and CNA.)\n\nNumerous videos posted by Mission of Hope and Mercy in recent days show Mahanna wearing his priestly collar and introducing himself as “Father.” \n\nIn a Nov. 28 video, Mahanna, seeking donations, described how his mission provides aid to Christian families and victims of persecution in Lebanon, delivering food boxes, mattresses, water, and Christmas presents to villages affected by conflict.","summary":"cna","url":"https://www.ncregister.com/cna/former-maronite-priest-still-presenting-himself-as-a-cleric-denver-archdiocese-warns","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/2025120418120_2793c111daeec7ba8eb0a19fa6ae5c98fb3576f4473c0d6f5e72978512de3da5.png","video":null,"publish_date":"2025-12-05 00:08:59","author":"Jonah McKeown","authors":["Jonah McKeown"],"language":"en","category":"politics","source_country":"US","sentiment":-0.146},{"id":385141666,"title":"Supreme Court gives Trump key win on Texas map ahead of 2026 midterm elections","text":"The Supreme Court on Thursday cleared the way for Texas to use a congressional map drawn to boost Republican power, handing a major victory to the Trump administration in a fast-expanding national redistricting battle.The ruling means Texas can proceed with its 2026 elections under a map designed to give the GOP five additional seats, despite a lower court finding that it likely discriminates against Black and Latino voters, according to the Associated Press.The justices granted Texas’ emergency request to keep the map in place, noting that candidate qualifying has already begun and the state holds primaries in March. The order pauses a 2–1 lower court ruling that blocked the map, at least until the Supreme Court issues a final decision. Justice Samuel Alito had earlier issued a temporary stay while the full court reviewed the appeal.The high court has repeatedly intervened in redistricting fights near elections, most recently in Alabama and Louisiana, a sign of its growing willingness to halt lower-court decisions even when discrimination concerns have been raised..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}TEXAS SPARKS A NATIONAL REDISTRICTING WAVE Texas became the first state to swiftly deliver on Donald Trump’s demand for new congressional boundaries that expand GOP control. Republicans drew a map that adds five new Republican-held seats, positioning the party to shore up a slim House majority in 2026, according to the Associated Press.Other states quickly followed. Missouri and North Carolina each approved new maps adding one Republican seat.California, in response, passed a ballot initiative designed to generate five more Democratic seats.Court challenges are now underway in California and Missouri, while North Carolina’s map has already been cleared for use in 2026 by a three-judge panel.LOWER COURT SAID MAP RACIALLY GERRYMANDERED In Texas, US District Judges Jeffrey V. Brown and David Guaderrama ruled that the GOP-drawn map likely dilutes the voting power of Black and Latino residents.Judge Brown wrote that while politics played a role, “Substantial evidence shows that Texas racially gerrymandered the 2025 map.”The dissenting judge, Jerry Smith, responded with unusually sharp language, accusing Brown of pernicious judicial misbehaviour and quipping that the ruling could win a “Nobel Prize for Fiction.” He wrote that the “winners” of the majority’s logic were George Soros and Gavin Newsom, not Texas voters.Separately, the Supreme Court is considering a Louisiana case that could further narrow the use of race in redistricting under Section 2 of the Voting Rights Act. A ruling there could reshape how states draw maps nationwide — including those approved during this recent wave of rapid redistricting aligned with Trump’s political goals.- EndsWith inputs from Associated PressPublished By: Aashish VashisthaPublished On: Dec 5, 2025Must Watch","url":"https://www.indiatoday.in/world/us-news/story/supreme-court-gives-trump-key-win-on-texas-map-ahead-of-2026-midterm-elections-glbs-2831027-2025-12-05","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202512/donald-trump-092837207-16x9.jpg?VersionId=miXJUiDR8ddajbYvffH5ibPW_XCUkqIu?size=1280:720","video":null,"publish_date":"2025-12-05 00:08:52","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.253},{"id":385140428,"title":"Watch: Awkward tensions test US, Mexico and Canada ahead of World Cup","text":"The leaders of the three 2026 Fifa World Cup host nations are expected to meet in Washington DC on Friday for the tournament draw. It will be the first time all three gather together, and the first in-person meeting between US President Donald Trump and Mexican President Claudia Sheinbaum. \n\nThe BBC's Anthony Zurcher, Jessica Murphy and Will Grant explain how the three countries are getting along in the midst of recent tensions ahead of the draw.\n\nVideo by Blanca Estrada","url":"https://www.bbc.com/news/videos/cvg185pgm0po","image":"https://ichef.bbci.co.uk/news/1024/branded_news/bf07/live/4533a540-d165-11f0-9fb5-5f3a3703a365.jpg","video":null,"publish_date":"2025-12-05 00:07:11","author":"Blanca Estrada","authors":["Blanca Estrada"],"language":"en","source_country":"gb","sentiment":0.254},{"id":385144556,"title":"New York Times sues Pentagon over rules limiting access for media  - Antigua Tribune – Daily Antigua &amp;","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://antiguatribune.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://antiguatribune.com/app/uploads/2025/12/ap_69321360daedf-1764889440-md812B.jpg","video":null,"publish_date":"2025-12-05 00:06:44","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ag","sentiment":-0.1},{"id":385144554,"title":"Trump hails ‘great day for the world’ as DRC, Rwanda finalise peace deal  - Antigua Tribune – Daily","text":"United States President Donald Trump has hosted the leaders of Rwanda and the Democratic Republic of the Congo to sign a peace deal that could end the conflict between the two countries.\n\nAlthough the violence on the ground has not stopped, Trump hailed the US-brokered deal on Thursday as a new chapter for the region.\n\n“It is an amazing day: great day for Africa, great day for the world and for these two countries,” Trump said. “And they have so much to be proud of.”\n\nThe agreement was originally reached in June. DRC President Felix Tshisekedi and his Rwandan counterpart Paul Kagame had met in Qatar in March, initiating the talks that led to the deal.\n\nThursday’s ceremony finalises the accords.\n\nThe agreement has sparked hopes of ending the conflict in the DRC, where the March 23 Movement (M23), a Rwanda-backed armed group, has been advancing deeper into the resource-rich east of the country.\n\nThe renewed violence had raised fears of a full-blown conflict, akin to the wars that the DRC endured in the late 1990s, which involved several African countries and killed millions of people.\n\nRwanda’s main grievance with the DRC focuses on accusations that the Central African country has been harbouring ethnic Hutu militias linked to the 1994 Rwanda genocide, which targeted the country’s Tutsi population.\n\nThe Trump-backed peace deal stipulates that Rwanda will end its support for M23 and the DRC will help “neutralise” Hutu militias — namely, the Democratic Forces for the Liberation of Rwanda.\n\nIt also requires both countries to respect each other’s territorial integrity.\n\nOn Thursday, the DRC’s Tshisekedi said the agreement’s terms mark a “turning point” for the region.\n\n“They bring together, under a coherent architecture, a declaration of principles of a peace agreement and also the regional economic integration framework to provide to the peoples of the region a new perspective, a new outlook,” Tshisekedi said.\n\nHe added that the deal would “begin a new era of friendship, cooperation and prosperity”.\n\nFor his part, Rwanda’s Kagame said the success of the pact depends on the two countries themselves.\n\n“There will be ups and downs on the road ahead. There’s no doubt about it,” Kagame explained. “Rwanda will not be found wanting, I can assure you of that.”\n\nReporting from Washington, DC, Al Jazeera’s Alan Fisher said the leaders of the DRC and Rwanda appeared to acknowledge that it will take more than a signing ceremony for the agreement to stick.\n\nThe conflict, Fisher explained, “is a lot more ingrained, a lot more developed, a lot more aggressive than many people have assumed”.\n\n“So the pressure is on the United States, on the African leaders and, of course, on the two countries to make sure that what develops from here is something that can develop into a lasting peace.”\n\nThe DRC had signed a separate deal with M23 in July. Still, the fighting in the eastern parts of the country has persisted.\n\n“We are still at war,” Amani Chibalonza Edith, a 32-year-old resident of Goma, a key city captured by M23 early this year, told The Associated Press news agency.\n\n“There can be no peace as long as the front lines remain active.”\n\nBut in Washington, DC, on Thursday, Trump appeared optimistic about the prospects for peace.\n\n“We’ll see how it all works out, but I think it’s going to work out really great,” the US president said.\n\nTrump also announced that the US will be signing bilateral deals with the DRC and Rwanda to buy rare earth minerals from the two countries.\n\n“We’ll be involved with sending some of our biggest and greatest companies over to the two countries,” Trump added.\n\n“And we’re going to take out some of the rare earth, take out some of the assets and pay. Everybody is going to make a lot of money.”\n\nRare earth minerals are used in emerging technologies, energy production and medical devices.\n\nTrump has openly campaigned for the Nobel Peace Prize, claiming he has resolved eight world conflicts, though that number is disputed.\n\nDuring Thursday’s signing ceremony at the US Institute for Peace, a think tank, he heaped praise onto the DRC and Rwanda. But his embrace of the countries’ two leaders drew a stark contrast with his insulting remarks towards another war-torn African country: Somalia.\n\nTwo days before hosting the ceremonial signing, Trump hurled insults at Somalia, describing it as “hell” and saying that “it stinks”.\n\nHe also called the Somali community in the US “garbage”.","url":"https://antiguatribune.com/trump-hails-great-day-for-the-world-as-drc-rwanda-finalise-peace-deal/","image":"https://antiguatribune.com/app/uploads/2025/12/2025-12-04T191314Z_173990078_RC2V9IADTB06_RTRMADP_3_USA-TRUMP-RWANDA-CONGO-1764887531-pZz7GZ.jpg","video":null,"publish_date":"2025-12-05 00:06:41","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ag","sentiment":0.198},{"id":385144628,"title":"Appeals court allows DC National Guard deployment to continue","text":"The order from the appeals court said the pause was “to give the court sufficient opportunity to consider the motion for stay pending appeal and should not be construed in any way as a ruling on the merits of that motion.”\n\nThe three-judge panel assigned to the case includes two appointees of President Donald Trump and one appointee of former President Barack Obama.\n\nThe order allowing the deployment to continue comes just over a week after two National Guardsmen from West Virginia on patrol in Washington, D.C., were shot. Sarah Beckstrom later died from her injuries suffered from the shooting, while Andrew Wolfe remains in critical condition. The two guardsmen were allegedly shot by Afghan national Rahmanullah Lakanwal, who pleaded not guilty to multiple charges levied against him, including first-degree murder, earlier this week.\n\nEarlier in November, Cobb ruled that Trump’s deployment of the D.C. National Guard and use of out-of-state troops around the District of Columbia was likely unlawful.\n\n“The Court finds that the President has no free-floating Article II power to deploy the [D.C. National Guard] for the deterrence of crime. Historical practice confirms this understanding of the President’s authority,” Cobb wrote in her Nov. 20 ruling. \n\nHOUSE GOP AGREES DC NEEDS MORE INTERVENTION AFTER NATIONAL GUARD SHOOTING\n\nThe ruling from the appeals court panel halts Cobb’s finding and allows troops to remain deployed in the district, pending further order from the panel. The administration had previously set the troops to be deployed through at least February 2026.\n\nThe president’s deployment of the National Guard to various cities across the country has been focused on protecting federal immigration operations from unruly protests. However, in D.C., the deployment was done to combat crime in the capital city. Because of the unique setup of the D.C. National Guard, with the president as the commander in chief of the force instead of a governor, different laws govern how the president may use that force as opposed to other state National Guard troops.","summary":"A federal appeals court granted a request by the Trump administration to continue to allow for the deployment of the D.C. National Guard in the capital city on Thursday, temporarily halting a lower court’s previous order. A three-judge panel of the U.S. Court of Appeals for the D.C. Circuit granted an administrative stay of U.S. [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3907947/appeals-court-allows-dc-national-guard-deployment-continue/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/12/AP25337813548850.jpg?w=696","video":null,"publish_date":"2025-12-05 00:06:22","author":"Jack Birle","authors":["Jack Birle"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245},{"id":385143536,"title":"New York Times sues Pentagon over rules limiting access for media  - St. Lucia Chronicle – Daily St Lucia News","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://stluciachronicle.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://stluciachronicle.com/app/uploads/2025/12/ap_69321360daedf-1764889440-lxQAdY.jpg","video":null,"publish_date":"2025-12-05 00:06:16","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"lu","sentiment":-0.1},{"id":385138766,"title":"New York Times sues Pentagon over rules limiting access for media  - St. Kitts Gazette – Daily News from St","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://stkittsgazette.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://stkittsgazette.com/app/uploads/2025/12/ap_69321360daedf-1764889440-l8oNEI.jpg","video":null,"publish_date":"2025-12-05 00:06:16","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":-0.1},{"id":385139648,"title":"New York Times sues Pentagon over rules limiting access for media  - Jamaica Inquirer – Daily Jamaica News","text":"The New York Times newspaper, one of the largest in the United States, has filed a lawsuit against the Pentagon that seeks to overturn new rules limiting access to media outlets.\n\nIn the filing on Thursday, the newspaper said the rules imposed by Defense Secretary Pete Hegseth violate the US Constitution’s First Amendment freedom of speech guarantees, as well as its due process provisions. They argue the rules give Hegseth the power to determine on his own whether a reporter should be banned.\n\nSeveral outlets, including The New York Times, have left offices located inside the Pentagon instead of agreeing to the new rules, reshaping the press corps inside the building to include mostly outlets seen as friendly to the administration of US President Donald Trump.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” Charles Stadtlander, spokesman for the Times, said in a statement after the case was filed with the US District Court in Washington, DC.\n\nThe Pentagon did not immediately respond to the lawsuit.\n\nNews outlets have continued to report on the military from outside of the facility since October, breaking several stories in recent weeks, including a so-called double-tap strike on a boat in the Caribbean that experts say may constitute a war crime.\n\nStill, the Times argues in the lawsuit that the denial of access restricts its reporters’ ability to do their jobs and will, in turn, “deprive the public of vital information about the United States military and its leadership”.\n\nThe policy enacted under Hegseth states that receiving or publishing sensitive information “is generally protected by the First Amendment”, but adds that soliciting the disclosure of such information “may weigh in the consideration of whether you pose a security or safety risk”.\n\nThe wording effectively gives Pentagon officials the right to oust reporters if they do not like a story they are working on, the Times lawsuit argued.\n\nThe Pentagon has said the policy imposes “common sense” rules that protect the military from the release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets were not missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back, and we’re not rebuilding a broken model just to appease them.”\n\nIn a statement, the Pentagon Press Association, a group that represents journalists who cover the agency, said it was encouraged by the Times’ “effort to step up and defend press freedom”.\n\n“The Defense Department’s attempt to limit how credentialed reporters gather the news and what information they may publish is antithetical to a free and independent press and prohibited by the First Amendment,” it said.","url":"https://jamaicainquirer.com/new-york-times-sues-pentagon-over-rules-limiting-access-for-media/","image":"https://jamaicainquirer.com/app/uploads/2025/12/ap_69321360daedf-1764889440-Pg5bSl.jpg","video":null,"publish_date":"2025-12-05 00:06:00","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"jm","sentiment":-0.1},{"id":385145654,"title":"Cuba says island is no 'black hole' on drug trafficking route to US","text":"HAVANA, Dec 4 - Top law enforcement officials in Cuba said on Thursday the island was prioritizing the fight against narcotics trafficking in the Caribbean and continued to provide information to the U.S. Coast Guard amid escalating tensions and surging U.S. military presence in the region.\n\nCuba and the United States in 2017 agreed to cooperate in the fight against drug trafficking, but Colonel Ybey Carballo, chief of Cuba's Border Guard, told reporters in Havana formal engagement between the two long-time rival nations had ended under the second administration of U.S. President Donald Trump.\n\nCarballo said Cuba nonetheless routinely provides the U.S. Coast Guard with intelligence, locations, routes and characteristics of boats suspected of trafficking drugs near its waters.\n\n\"Cuba is not a black hole like some like to say,\" said Carballo, adding that the island's proactive approach contributed both to the security of the region and \"especially to that of the United States, because the boats are often headed (there).\"\n\nCarballo said Cuba had provided more than 1,500 tips and intelligence on drug traffickers to the U.S. Coast Guard between 1990 and November 30, 2025, proof, he said, of the island's long-standing commitment to fighting the drug trade.\n\nCuba sits directly astride a key route between major drug producers in South America and top consumer, the United States, and the U.S. State Department as recently as 2016 said the island \"is not a major consumer, producer or transit point of illicit narcotics.\" \n\nThe Trump administration has launched an offensive on alleged drug-trafficking boats elsewhere in the Caribbean and Pacific in recent months, killing dozens through targeted missile strikes while accusing Venezuelan President Nicolas Maduro, a key Cuba ally, of profiting from the trade.\n\nCuba has criticized those attacks and accuses the U.S. of seeking a violent overthrow of the Venezuelan government.\n\nCarballo told Reuters that Cuban security forces had not noticed a dramatic change in drug-running activity around Cuba despite the surging U.S. military activity and strikes. REUTERS","url":"https://www.straitstimes.com/world/cuba-says-island-is-no-black-hole-on-drug-trafficking-route-to-us","image":"https://cassette.sphdigital.com.sg/image/straitstimes/b31603ad87600d797dd0887ac930277c4c3d73af35dba054f3a18782f7716878","video":null,"publish_date":"2025-12-05 00:05:46","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.037},{"id":385094874,"title":"Jazz Must Be returns to The Summit for second staging","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApryl-Jaye \n\n Latest News, News \n\nDecember 4, 2025\n\n\n\n\n Jazz Must Be returns to The Summit for second staging \n\n\n\n\n\n\n\nKINGSTON, Jamaica — Vocalist Apryl-Jaye will present the second staging of Island Car Rentals Presents: Jazz Must Be on Thursday, December 4 at The Summit in Kingston.\n\nThe two-hour jazz fusion showcase begins at 8:00 pm and ends at 10:00 pm, with doors opening at 7:00 pm.\n\nTickets are being pre-sold only at $5,000 and can be purchased at Music Mart.\n\nThis year’s event will be held under the patronage of Minister of Culture, Gender, Entertainment and Sport Olivia “Babsy” Grange. Island Car Rentals returns as title sponsor, with support from Tamia Carey, Roots Financial Group and FMA Customs Brokers.\n\nThe show follows a polished, concise format: two hours of music anchored by a 15-minute intermission. Patrons are encouraged to arrive early, explore the Food Village.\n\nApryl-Jaye will headline with a mix of jazz, bossa nova and jazz fusion. As in the first staging, a surprise guest performer is expected. Last year’s show featured saxophonist Dean Fraser, who has again contributed to the production with a special arrangement for a tribute segment honouring reggae greats Dennis Brown, Gregory Isaacs, Delroy Wilson and John Holt. The programme will also include a tribute to black artists who died in 2025, including Angie Stone and D’Angelo.\n\nThe band for the night includes Keneil Delisser on drums, Dale Brown on bass, Gregory Palmer on keyboard, Okiel McIntyre on trumpet and Lamont “Monty” Savory on guitar.\n\nA portion of the proceeds will go toward Hurricane Melissa relief efforts. Patrons are also encouraged to bring non-perishable food or personal care items for an in-kind donation drive at the venue.\n\nFurther information is available via WhatsApp at 876-540-1020.\n\n\n\n\n\n\n\n\nTags: Apryl-Jaye Jazz Must Be Minister Olivia Grange The Summit \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t receives Ethiopian delegation on hurricane recovery assistance mission \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n KINGSTON, Jamaica — The Government of Jamaica on Thursday received a high-level delegation from the Federal Democratic Republic of Ethiopia which was ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Jamaica-bound hurricane relief container robbed in Canada \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n TORONTO, Canada — Canadian police are investigating what volunteers say is a heartbreaking robbery after thieves emptied out a container of donated it... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump’s immigration stance contradicting World Cup ‘unity’ message \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States — With the World Cup draw set for Washington this Friday, United States (US) President Donald Trump is expected to feature h... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Leader of notorious Haitian gang sentenced to life in prison \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n WASHINGTON, United States (CMC) — The self-proclaimed “king” of Haiti’s violent 400 Mawozo gang, Joly Germine, was on Wednesday sentenced to life in p... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic changes announced for Santa Cruz during festive season \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n ST ELIZABETH, Jamaica — Effective Monday, December 8, 2025, traditional Christmas traffic changes will be in effect for the town of Santa Cruz, St Eli... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic changes to be implemented in Christiana, Manchester for the holiday season \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n MANCHESTER, Jamaica — The National Works Agency (NWA) will introduce a series of traffic changes in Christiana, Manchester, beginning Monday, December... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Unsure of how to help? 10 ways to give back Christmas \n\n\n\n\n\n\n\nDecember 4, 2025 \n\n\n Hurricane Melissa has brought great tragedy to our island but it has also taught us the value of community. Many have already sprung into action by do... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/04/jazz-must-returns-summit-second-staging/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/lknfqew-1024x697.png","video":null,"publish_date":"2025-12-05 00:05:34","author":null,"language":"en","source_country":"jm","sentiment":0.57}]}