{"offset":0,"number":50,"available":7221,"news":[{"id":277437180,"title":"Let the rupee find its own level","text":"By N Chandra Mohan As the new year kicks off, the persisting weakness of the rupee vis-à-vis the US dollar in 2024 —although not as much as China’s yuan, South Korea’s won, Türkiye’s lira, or Indonesia’s rupiah, among other currencies—raises important questions on its effect on the Indian economy. Those who welcome a depreciating rupee are exporters, as it improves their competitiveness in selling their merchandise abroad. Those who would complain include Indian travellers, who now need to exchange more rupees to acquire dollars for their expenses abroad, so too will thousands of students who plan to study overseas as their loan expenses will be more. A cheaper rupee is also bad news for the oil import-dependent Indian economy as imports become costlier, besides contributing to higher inflation. The silver lining, however, is that despite geopolitical tensions in West Asia, global crude prices are not ruling at elevated levels due to relative excess supply amidst lower demand for oil. Low prices offset the rupee impact of the costs of rising energy imports. The country’s overall import bill will rise as Indian industry is highly import-intensive, thanks to liberal access to internationally available raw materials and intermediate goods — like for assembling smartphones in the country — which become costlier. The coming year will see more downward pressure on the rupee as the dollar further strengthens after Donald Trump returns as the 47th President of the US. Paradoxically, while he wants a weaker dollar to boost American exports and protect jobs, his tariff bluster only makes the dollar stronger. Higher tariffs impact domestic consumers through higher prices. His presidency will also widen the budget deficit because of tax cuts and higher spending, further driving up inflation. With the US Federal Reserve cautious on cutting interest rates, the consequent higher yields on US treasuries will attract inflows from foreign investors who pull out from emerging markets like India, weakening the rupee. What can policymakers do about the rupee? Since 1993, the Reserve Bank of India (RBI) has followed a flexible exchange rate policy, which allowed the currency unit to be largely market-determined. It has regularly maintained that it doesn’t target any particular exchange rate of the rupee, although it can and does intervene to smooth any sharp upward or downward movements. During the global financial crisis from mid-2007-early 2009, or the so-called “taper tantrum”, when it hits lows of Rs 68.8 to a dollar in August 2013, the RBI did not defend the rupee by drawing down foreign exchange reserves. Instead, it even built up reserves through these episodes. During the last couple of years, however, the RBI’s stance shifted to an inflexible exchange rate policy, argues Arvind Subramanian, former chief economic advisor to the government of India. The RBI’s interventions sought to ensure a stable exchange rate of the rupee vis-à -vis the dollar by drawing down foreign exchange reserves by as much as $100-150 billion since October 2021. Last Friday, for instance, the RBI resorted to dollar sales of $2.5 billion via state-run banks to defend the rupee when it hit a two-year low. To be sure, the country has adequate foreign exchange reserves — which are enough to take care of a year’s imports — to defend the currency unit. The shift in stance and its consequences can be better understood through the “trilemma” of policymaking. According to international finance theory, if policymakers want to keep the economy open to international flows of capital, use monetary policy to stabilise the economy, and maintain stability in the exchange rate, only two of these three objectives can be satisfied. Since the reforms of the early 1990s, the economy has remained open to foreign capital, while the RBI’s strong monetary policy checked inflation and boosted economic growth. Exchange rate stability had to be given up, reflected in the rupee being allowed to fluctuate in line with market forces. Seeking stability in the exchange rate—which has made the rupee overvalued in the process—while the economy is open to capital inflows and outflows entails abandoning a strong monetary policy. According to Subramanian, this shift in stance of late has damaged the country’s export competitiveness by 10% and resulted in a tightening of monetary conditions at a time of slowing economic growth. Interestingly, the latest official monthly review of the economy appears to concur with this assessment as it mentions that “a combination of monetary policy stance and macroprudential measures by the central bank may have contributed to the demand slowdown” in the economy. The upshot is that the downtrend in the rupee is likely to persist, if not intensify, with the dollar entering a phase of strength during the forthcoming Trump presidency. Analysts expect Rs 86 per dollar by end-March and Rs 87 per dollar by end-2025. While this would benefit exporters, this is not an unmixed blessing as the currencies of rival emerging economies depreciate more against the dollar. Instead of defending the indefensible, the RBI may be better off reverting to its earlier stance of a flexible exchange rate policy that allows fluctuations in the Indian currency unit, in line with cyclical conditions. The writer is an economics and business commentator based in New Delhi. Disclaimer: Views expressed are personal and do not reflect the official position or policy of FinancialExpress.com. Reproducing this content without permission is prohibited.","url":"https://www.financialexpress.com/opinion/let-the-rupee-find-its-own-level/3704722/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/rupe.Canva_.jpg","video":null,"publish_date":"2025-01-01 01:08:51","author":"Guest","authors":["Guest"],"language":"en","source_country":"in","sentiment":-0.272},{"id":277436666,"title":"Chief Justice Roberts Warns of Four Areas of Concern in End of Year Report","text":"Supreme Court Chief Justice John Roberts on Tuesday addressed four areas of \"illegitimate activity\" that he said threaten the independence of judges: violence, intimidation, disinformation and threats to defy lawfully entered judgments.The conservative justice expressed his concerns in the Supreme Court's annual report.Why It MattersThe report was released following a tumultuous year in which the nation's courts were unusually entangled in a tightly contested presidential race. During this time, then-Republican presidential candidate Donald Trump, who faced a host of criminal charges that he denied, repeatedly attacked the integrity of the judicial system.Newsweek reached out via email to the Supreme Court's Public Information Office and President-elect Donald Trump's transition team on Tuesday evening for additional comments.What to KnowThe Supreme Court, which has a 6-3 conservative majority, has come under heightened scrutiny since its 2022 decision to gut the constitutional right to an abortion, which was established in Roe v. Wade.Conservative justices faced significant backlash from abortion rights advocates and protests near their homes when the draft 2022 opinion in Dobbs v. Jackson Women's Health Organization was leaked.In June 2022, Nicholas John Roske, a California resident, was arrested near Justice Brett Kavanaugh's home in Maryland. At the time of his arrest, Roske was found to be in possession of a firearm, a knife and zip ties. An FBI affidavit, obtained by the Associated Press, said Roske told authorities that he was angered at Kavanaugh over the leaked opinion.In his 15-page report, Roberts expressed concern over the rising threats of violence against judges nationwide, calling such actions \"wholly unacceptable\" and adding that they could \"undermine our Republic.\"He also highlighted the threat of disinformation about court rulings to judicial independence, noting that social media can amplify distortions and be exploited by \"hostile foreign state actors\" to deepen divisions.The chief justice went on to decry elected officials across the political spectrum who have \"raised the specter of open disregard for federal court rulings.\"Roberts didn't mention President-elect Trump in his report, but he emphasized that even when court decisions are unpopular or represent a setback for a presidential administration, other branches of government must still enforce them to uphold the rule of law.He referenced the landmark 1954 Brown v. Board of Education ruling, which desegregated schools and required federal enforcement against resistance from southern governors.What People Are SayingRoberts wrote in the end of year report: \"Attempts to intimidate judges for their rulings in cases are inappropriate and should be vigorously opposed.\" He added that while public officials have the right to criticize rulings, they should also be aware that their statements can \"prompt dangerous reactions by others.\"\"Of course, the courts are no more infallible than any other branch,\" Roberts wrote. \"In hindsight, some judicial decisions were wrong, sometimes egregiously wrong. And it was right of critics to say so. In a democracy—especially in one like ours, with robust First Amendment protections—criticism comes with the territory. It can be healthy.\"Journalist Chris Geidner, who operates the widely-read legal blog, Law Dork, wrote on X, formerly Twitter: \"Conflating violence against judges with broad criticism the court faces for its extremism, Chief Justice John Roberts ultimately sent a chilling end-of-year report today.\"What's NextFrom puberty blockers to TikTok, online porn and ghost guns, major Supreme Court decisions are expected in 2025 that could have a massive influence on American culture.","summary":"John Roberts decried politicians across the spectrum who have \"raised the specter of open disregard for federal court rulings.\"","url":"https://www.newsweek.com/supreme-court-justice-john-roberts-report-concerns-2008202","image":"https://d.newsweek.com/en/full/2554253/scotus-john-roberts.jpg","video":null,"publish_date":"2025-01-01 01:02:06","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.358},{"id":277436566,"title":"Zelenskiy says US will be beside Ukraine to stop Russia","text":"Ukrainian President Volodymyr Zelenskiy says no one will give peace to his country as a gift, but he believes the United States will stand alongside Kyiv as it fights to stop Russia&apos;s 34-month invasion. Zelenskiy, in a slick 21-minute New Year video greeting to his compatriots, also said only a strong Ukraine could secure peace and earn worldwide respect. \"We know that peace will not be given to us as a gift, but we will do everything to stop Russia and end the war, something each of us desires,\" Zelenskiy said against a backdrop of the blue-and-yellow national flag, battlefield scenes and pictures of children. He recalled conversations with outgoing US President Joe Biden, President-elect Donald Trump and \"everyone who supports us in the United States\". \"I have no doubt that the new American president wants and will be able to bring peace and end (Russian President Vladimir) Putin&apos;s aggression,\" Zelenskiy said. \"He understands that the former is impossible without the latter. Because this is not a street brawl where the two sides need to be pacified. This is a full-scale aggression by a deranged state against a civilised one. And I believe that, together with the United States, we are capable of the strength to force Russia into a just peace.\" Russia, Zelenskiy said, was not to be trusted either in battle or in talks. \"If today Russia shakes your hand, it doesn&apos;t mean that tomorrow the same hand will not start killing you,\" he said. \"Russians fear those who are free. What they don&apos;t understand. They fear freedom.\" Biden&apos;s administration has provided by far the most military support for Ukraine among Western nations since the February 2022 full-scale invasion. Ukraine has been wary of Trump&apos;s criticism of aid to Kyiv and his pledge, during the US election campaign, to bring a quick end to the war, but Zelenskiy has expressed optimism about ensuring continuing US support. Ukraine has endured a difficult year, with Russian forces taking village after village in a quicker advance on the eastern front than since the beginning of the invasion. In recent months, Zelenskiy has said that any settlement to the conflict is predicated on receiving security guarantees from Western nations and Kyiv securing an invitation to join the NATO alliance, a notion Russia rejects out of hand. In his greeting, Zelenskiy said that in the past year, Ukraine had launched an incursion into southern Russia&apos;s Kursk region, staged long-range drone strikes against distant Russian targets and developed domestically produced drones and other weapons. \"Every day in the coming year, I and all of us must fight so that Ukraine can be strong enough,\" he said. \"Only such a Ukraine is respected and heard - both on the battlefield and at the negotiating table.\" Australian Associated Press","url":"https://www.canberratimes.com.au/story/8857371/zelenskiy-says-us-will-be-beside-ukraine-to-stop-russia/?cs=14232","image":"/images/transform/v1/crop/frm/silverstone-feed-data/f33aa9d7-91c7-4071-9c49-c8e897aef586.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-01-01 01:01:51","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.1},{"id":277436552,"title":"New year&apos;s crowds praised, outbursts of local trouble","text":"New Year&apos;s Eve revellers have largely been praised for their behaviour at the nation&apos;s largest fireworks shows, while officers were kept busy with outbursts of trouble around local fireworks. More than a million people swarmed the main vantage points around Sydney Harbour for the city&apos;s biggest-ever new year extravaganza as millions of dollars of fireworks went up in smoke. Skies exploded with colour across Australia and revelry continued into the early hours, with hundreds of thousands of Melbourne partygoers treated to a fireworks and laser spectacular. Police in the nation&apos;s two largest cities noted the vast majority of partygoers enjoyed the night safely, although officers were kept busy with violence away from the main celebration areas. The hunt is on for an attacker wanted over the stabbing of a 17-year-old boy at a park in Guilford in Sydney&apos;s west, with police revealing they were called to an incident as a group of males allegedly let off fireworks at a park around 10.40pm. They boy was taken to hospital in serious but stable condition, with the force now searching for an offender who allegedly fled the scene. There were some 36 arrests in the Sydney CBD and harbour foreshore areas for offences including assault, affray, robbery and knife possession. NSW Assistant Commissioner Peter McKenna said the vast majority people enjoyed their night safely and without incident. \"Unfortunately, police were kept busy by a handful of revellers doing the wrong thing, but those people were dealt with quickly,\" he said. Victoria Police were also pleased with crowd behaviour but disappointed by a significant number of fireworks-related incidents, including three events in Melbourne&apos;s north sparking fires on December 31. \"Despite no serious harm caused on this occasion, fireworks carry the risk of serious injury or death, whilst being unpredictable and volatile items that can result in fires,\" police said in a statement. There were some 287 reports of fireworks-related incidents across the state, including illegal products seized, as well as more than 50 assaults. A teenager is in hospital with non-life threatening injuries after he was approached by a group and stabbed at a popular holiday spot on the Mornington Peninsula just before 6pm. Police said the group fled but two teens were quickly identified and arrested over the Blairgowrie attack, warning police will remain visible across the state on New Year&apos;s Day. Revellers in Queensland and Tasmania were also generally well-behaved, police said. In his new year message, Prime Minister Anthony Albanese said despite times still being tough the nation could head into 2025 optimistically with wages rising and inflation falling. Federal Opposition Leader Peter Dutton urged Australians to \"reignite our national confidence and our sense of hope\" - by electing the Liberal-National coalition in 2025. Sydney&apos;s first baby to be born in 2025 was delivered at 12.32am at the Royal Hospital for Women, with NSW health authorities saying both the mother and baby boy were doing well. Here&apos;s some of what Australians can look forward to, or not, in 2025: ECONOMY * The wait for mortgage relief drags on with the Commonwealth Bank and bond markets suggesting the Reserve Bank of Australia may start easing interest rates in February, while the other big four banks tip a May start * Following some good news that more people have been finding employment, more than a million Australians will get an immediate new year bonus with welfare payments for young people, students, carers and others rising under indexation to keep up with inflation POLITICS * With a federal election due by May 17, bookmakers are tipping the coalition to win while the latest polls suggest a knife-edge outcome * Australia anxiously waits to see if Donald Trump will disrupt the nation&apos;s trade with new tariffs and the AUKUS defence arrangement after being sworn in as US president on January 20 WEATHER * The Bureau of Meteorology forecasts warmer-than-average temperatures across the continent over the next three months and a wetter-than-average season for large parts of eastern, western and southern Australia. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8857238/new-years-crowds-praised-outbursts-of-local-trouble/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/963667ad-84a8-4b1f-bc9c-9c30cd722d86.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-01-01 01:01:51","author":"Rachael Ward And Nick Brown","authors":["Rachael Ward And Nick Brown"],"language":"en","source_country":"au","sentiment":-0.114},{"id":277436530,"title":"Global stocks end strong year with a whimper","text":"Global stocks declined as elevated US Treasury yields again contributed to a lacklustre close in an otherwise strong year for equities. On Wall Street on Tuesday early modest gains evaporated as the tech sector dropped 1.04 per cent. Some of the year&apos;s top S&P 500 performers, including Palantir Technologies, Vistra Corp and Nvidia , closed lower on the day as investors continued to book profits, wrapping up a strong 2024 in which the benchmark S&P jumped 23.3 per cent and the Nasdaq rose 28.7 per cent. The Dow Jones Industrial Average fell 29.51 points, or 0.07per cent, to 42,544.22, the S&P 500 dropped 25.31 points, or 0.43 per cent, to 5,881.63 and the Nasdaq Composite slid 175.99 points, or 0.90 per cent, to 19,310.79. US equities have surged this year, with the S&P 500 on track for its fifth annual gain in the past six years. The two-year jump of about 53.19 per cent marks the strongest back-to-back annual performance for the index since 1997-1998. The rally has been fueled by growth expectations surrounding artificial intelligence, expected interest rate cuts from the Federal Reserve, and more recently, the likelihood of deregulation policies from the incoming Trump administration. But bond yields have risen on the Fed&apos;s recent economic forecast and worries that President-elect Donald Trump&apos;s policies including on tariffs, may prove inflationary. The benchmark 10-year US Treasury note reached its highest level since May 2 at 4.641 per cent last week, helping to cool the rally. \"There&apos;s no Santa Claus rally this week, but investors received the gift of gains in 2024,\" said Greg Bassuk, chief executive officer at AXS Investments in New York. \"2024 was a massive year for equity gains driven by a trifecta of the AI explosion, a slew of Fed interest rate cuts and a robust US economy.\" MSCI&apos;s gauge of stocks across the globe dipped 2.59 points, or 0.31 per cent, to 841.24 but was set for a second-straight yearly advance after rallying almost 16 per cent in 2024. In Europe, the STOXX 600 index rose 0.51 per cent but closed out the session with its biggest quarterly percentage drop in more than two years. It ended 2024 with a gain of 5.99 per cent. Trading volumes were subdued ahead of the New Year holiday on Wednesday. Stock markets in Germany, Italy and Switzerland were closed on Tuesday, while those in the UK, Spain and France had a half-day trading session. The benchmark US 10-year note yield added 2.8 basis points at 4.573 per cent, reversing an earlier decline but staying above the 4.5 per cent mark that many analysts see as problematic for equities. The yield has risen about 69 basis points this year, including a surge of more than 74 bps in the fourth quarter. Widening interest-rate differentials have increased the appeal of the US dollar this year. The dollar index, which measures the greenback against other major currencies, is up 6.6 per cent on the year after surging 7.3 per cent in the fourth quarter, its biggest quarterly jump since the first quarter of 2015. On Tuesday, the dollar index climbed 0.36 per cent to 108.44, with the euro down 0.47 per cent at $1.0358. The single currency is down 6.1 per cent on the year versus the greenback after slumping 6.5 per cent in the quarter. Against the Japanese yen, the dollar strengthened 0.31 per cent to 157.32. Sterling softened 0.28 per cent to $1.2516. US crude settled up 1.03 per cent to $71.72 a barrel and Brent settled at $74.64 per barrel, up 0.88 per cent on the day as data showing an expansion in Chinese manufacturing was balanced by Nigeria targeting higher output next year. Oil prices were still set to close out 2024 with their second straight year of declines. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8857293/global-stocks-end-strong-year-with-a-whimper/?cs=14232","image":"/images/transform/v1/crop/frm/silverstone-feed-data/90d0fadb-6d2a-4ebe-96ab-bf81d55112ba.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-01-01 01:01:51","author":"Chuck Mikolajczak","authors":["Chuck Mikolajczak"],"language":"en","category":"politics","source_country":"au","sentiment":-0.271},{"id":277436526,"title":"New year&apos;s crowds praised, outbursts of local trouble","text":"New Year&apos;s Eve revellers have largely been praised for their behaviour at the nation&apos;s largest fireworks shows, while officers were kept busy with outbursts of trouble around local fireworks. More than a million people swarmed the main vantage points around Sydney Harbour for the city&apos;s biggest-ever new year extravaganza as millions of dollars of fireworks went up in smoke. Skies exploded with colour across Australia and revelry continued into the early hours, with hundreds of thousands of Melbourne partygoers treated to a fireworks and laser spectacular. Police in the nation&apos;s two largest cities noted the vast majority of partygoers enjoyed the night safely, although officers were kept busy with violence away from the main celebration areas. The hunt is on for an attacker wanted over the stabbing of a 17-year-old boy at a park in Guilford in Sydney&apos;s west, with police revealing they were called to an incident as a group of males allegedly let off fireworks at a park around 10.40pm. They boy was taken to hospital in serious but stable condition, with the force now searching for an offender who allegedly fled the scene. There were some 36 arrests in the Sydney CBD and harbour foreshore areas for offences including assault, affray, robbery and knife possession. NSW Assistant Commissioner Peter McKenna said the vast majority people enjoyed their night safely and without incident. \"Unfortunately, police were kept busy by a handful of revellers doing the wrong thing, but those people were dealt with quickly,\" he said. Victoria Police were also pleased with crowd behaviour but disappointed by a significant number of fireworks-related incidents, including three events in Melbourne&apos;s north sparking fires on December 31. \"Despite no serious harm caused on this occasion, fireworks carry the risk of serious injury or death, whilst being unpredictable and volatile items that can result in fires,\" police said in a statement. There were some 287 reports of fireworks-related incidents across the state, including illegal products seized, as well as more than 50 assaults. A teenager is in hospital with non-life threatening injuries after he was approached by a group and stabbed at a popular holiday spot on the Mornington Peninsula just before 6pm. Police said the group fled but two teens were quickly identified and arrested over the Blairgowrie attack, warning police will remain visible across the state on New Year&apos;s Day. Revellers in Queensland and Tasmania were also generally well-behaved, police said. In his new year message, Prime Minister Anthony Albanese said despite times still being tough the nation could head into 2025 optimistically with wages rising and inflation falling. Federal Opposition Leader Peter Dutton urged Australians to \"reignite our national confidence and our sense of hope\" - by electing the Liberal-National coalition in 2025. Sydney&apos;s first baby to be born in 2025 was delivered at 12.32am at the Royal Hospital for Women, with NSW health authorities saying both the mother and baby boy were doing well. Here&apos;s some of what Australians can look forward to, or not, in 2025: ECONOMY * The wait for mortgage relief drags on with the Commonwealth Bank and bond markets suggesting the Reserve Bank of Australia may start easing interest rates in February, while the other big four banks tip a May start * Following some good news that more people have been finding employment, more than a million Australians will get an immediate new year bonus with welfare payments for young people, students, carers and others rising under indexation to keep up with inflation POLITICS * With a federal election due by May 17, bookmakers are tipping the coalition to win while the latest polls suggest a knife-edge outcome * Australia anxiously waits to see if Donald Trump will disrupt the nation&apos;s trade with new tariffs and the AUKUS defence arrangement after being sworn in as US president on January 20 WEATHER * The Bureau of Meteorology forecasts warmer-than-average temperatures across the continent over the next three months and a wetter-than-average season for large parts of eastern, western and southern Australia. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8857238/new-years-crowds-praised-outbursts-of-local-trouble/?cs=14329","image":"/images/transform/v1/crop/frm/silverstone-feed-data/963667ad-84a8-4b1f-bc9c-9c30cd722d86.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-01-01 01:01:51","author":"Rachael Ward And Nick Brown","authors":["Rachael Ward And Nick Brown"],"language":"en","source_country":"au","sentiment":-0.114},{"id":277436478,"title":"Zelenskiy says US will be beside Ukraine to stop Russia","text":"Ukrainian President Volodymyr Zelenskiy says no one will give peace to his country as a gift, but he believes the United States will stand alongside Kyiv as it fights to stop Russia&apos;s 34-month invasion. Zelenskiy, in a slick 21-minute New Year video greeting to his compatriots, also said only a strong Ukraine could secure peace and earn worldwide respect. \"We know that peace will not be given to us as a gift, but we will do everything to stop Russia and end the war, something each of us desires,\" Zelenskiy said against a backdrop of the blue-and-yellow national flag, battlefield scenes and pictures of children. He recalled conversations with outgoing US President Joe Biden, President-elect Donald Trump and \"everyone who supports us in the United States\". \"I have no doubt that the new American president wants and will be able to bring peace and end (Russian President Vladimir) Putin&apos;s aggression,\" Zelenskiy said. \"He understands that the former is impossible without the latter. Because this is not a street brawl where the two sides need to be pacified. This is a full-scale aggression by a deranged state against a civilised one. And I believe that, together with the United States, we are capable of the strength to force Russia into a just peace.\" Russia, Zelenskiy said, was not to be trusted either in battle or in talks. \"If today Russia shakes your hand, it doesn&apos;t mean that tomorrow the same hand will not start killing you,\" he said. \"Russians fear those who are free. What they don&apos;t understand. They fear freedom.\" Biden&apos;s administration has provided by far the most military support for Ukraine among Western nations since the February 2022 full-scale invasion. Ukraine has been wary of Trump&apos;s criticism of aid to Kyiv and his pledge, during the US election campaign, to bring a quick end to the war, but Zelenskiy has expressed optimism about ensuring continuing US support. Ukraine has endured a difficult year, with Russian forces taking village after village in a quicker advance on the eastern front than since the beginning of the invasion. In recent months, Zelenskiy has said that any settlement to the conflict is predicated on receiving security guarantees from Western nations and Kyiv securing an invitation to join the NATO alliance, a notion Russia rejects out of hand. In his greeting, Zelenskiy said that in the past year, Ukraine had launched an incursion into southern Russia&apos;s Kursk region, staged long-range drone strikes against distant Russian targets and developed domestically produced drones and other weapons. \"Every day in the coming year, I and all of us must fight so that Ukraine can be strong enough,\" he said. \"Only such a Ukraine is respected and heard - both on the battlefield and at the negotiating table.\" Australian Associated Press","url":"https://www.canberratimes.com.au/story/8857371/zelenskiy-says-us-will-be-beside-ukraine-to-stop-russia/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/f33aa9d7-91c7-4071-9c49-c8e897aef586.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-01-01 01:01:51","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.1},{"id":277437800,"title":"Small businesses brace themselves for potentially disruptive TikTok ban","text":"AP – A looming TikTok ban could affect the millions of small businesses that use the short-video social media app to help them grow their business.\n\nDesiree Hill, owner of Crown’s Corner Mechanic in Conyers, Georgia, started her business solo as a mobile mechanic. Sharing videos of her work on TikTok helped spread the word and she became so popular she was able to open a 9,000 square foot brick and mortar shop with five employees 18 months ago.\n\n“Every day I get at least two to three customers that have seen me on TikTok, watched my videos and wanted to become a customer,” she said.\n\nThough TikTok has been around only since 2016, small business owners use the platform in a variety of ways, from growing a customer base to advertising and marketing, as well as selling goods directly from the site.\n\nAccording to TikTok’s own estimates, small businesses on TikTok would lose more than $1 billion in revenue in a single month if the ban goes into effect.\n\nThe Justice Department ordered the app’s China-based parent company, ByteDance, to sell TikTok or face a U.S. ban by Jan. 19, citing security concerns. The Supreme Court will take up the matter in January. President-elect Donald Trump, who takes office Jan. 20, has asked the Supreme Court for a delay.\n\nIf a ban does occur, small businesses will have to migrate to other platforms to find their customers. Instagram Reels, SnapChat and YouTube Shorts are alternatives. The good news is brands likely already have a presence there. But it may be harder to reach teens that have made TikTok their preferred social media app.\n\nAnother alternative is to build a strong database of customers that opt in to providing contact emails or phone numbers. That lets owners reach out directly to customers with promotions and other marketing messages.\n\nBut Crown Corner Mechanic’s Hill said she is worried that other sites may not have the reach that TikTok does. She has a presence on YouTube, Instagram and Facebook, but it’s not the same, she said.\n\n“I am worried because there is no preparation for this,” she said. “It holds such a significant place in regards to my customer base and how I reach customers that if I lose TikTok, I will lose a large part of my business or I will lose my ability to grow anymore.”\n\nCrystal Lister is the owner of Mommy and Me: The Listers, in Cypress, Texas, which offers interactive workshops about STEM education. She’s working on pivoting to YouTube for videos and Instagram Reels for teasers to direct people to YouTube, but said TikTok is easier.\n\n“It is going to be a challenge if TikTok is banned because we’re losing kind of all the functionality you want — the ability for video creation, the ability to spread the word via social media,” she said. “So we’ll have to use many other platforms to supplement what TikTok did in one.”","summary":"","url":"https://borneobulletin.com.bn/small-businesses-brace-themselves-for-potentially-disruptive-tiktok-ban/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/12/AP24365656527208-1.jpg","video":null,"publish_date":"2025-01-01 01:00:23","author":"Borneo Bulletin Ap Video","authors":["Borneo Bulletin Ap Video"],"language":"en","source_country":"bn","sentiment":-0.052},{"id":277436018,"title":"The 7 states that will tax Social Security benefits in the U.S. next year","text":"A recent report revealed that, by 2025, 41 states in the U.S. will no longer tax Social Security benefits. Both Missouri and Kansas decided to eliminate these taxes in 2024, with Kansas making the change shortly after Missouri.\n\nThis leaves just nine states that will continue to tax benefits in 2025. Check if your state —or the one you’re considering for retirement— will still tax Social Security benefits.\n\nIn 2025, Colorado will still tax Social Security benefits. However, people aged 55 to 64 with an adjusted gross income of $75,000 or less (for single filers) or $95,000 or less (for couples filing jointly) can deduct the federally taxed benefits completely when filing their taxes.\n\nIn Connecticut, the rules for exempting Social Security benefits are similar to Colorado’s. Single filers or married individuals filing separately with an adjusted gross income (AGI) under $75,000 don’t have their benefits taxed. Married couples filing jointly also qualify for the exemption if their AGI is below $100,000.\n\nIn Minnesota, Social Security benefits are exempt from taxes for married filers with an adjusted gross income (AGI) under $105,380 and single filers with an AGI below $82,190.\n\nIn Montana, Social Security benefits are fully tax-deductible for single filers with an AGI under $25,000 and joint filers with an AGI below $32,000.\n\nNew Mexico no longer taxes Social Security benefits for individuals earning less than $100,000 annually and married couples with incomes under $150,000.\n\nRhode Island\n\nIn the Ocean State, Social Security benefits sail tax-free for individuals earning under $88,950 in adjusted gross income (AGI). Married couples with AGIs below $111,200 can also dock their tax concerns at shore.\n\nIn Utah, Social Security benefits are as safe as the Great Salt Lake for single filers earning less than $30,000 annually. Married couples with incomes under $50,000 also enjoy a sweet “tax-free” ride through the Beehive State.\n\nIn Vermont, Social Security benefits are not taxed for married couples with incomes under $65,000 or for individuals earning less than $50,000 per year.\n\nWest Virginia\n\nWest Virginia is set to completely phase out its state tax on Social Security benefits over the next three years, thanks to a new law. For now, individuals earning under $50,000 and joint filers with incomes below $100,000 are exempt. Starting with 2024 taxes, benefits will be taxed 35% less, followed by a 65% reduction in 2025, and by 2026, no taxes will be applied at all.\n\nTrump’s stance on taxing Social Security\n\nDuring his first term, President-elect Donald Trump largely avoided tackling the controversial topic of Social Security. However, candidates on the campaign trail often face pressure to address key issues.\n\nIn late July, Trump posted on his social media platform, sharing a statement that might indicate a big change for Social Security. His bold claim, “Seniors should not pay tax on Social Security,” suggests he may be planning significant reforms for the program.\n\nThis isn’t an official bill or even a draft, but it does show that the incoming president is open to the idea of ending taxes on Social Security benefits.\n\nBack in 1983, Social Security faced a crisis much like the one experts predict will happen in the next nine years. With its reserves running low, Congress passed the Social Security Amendments of 1983, which President Ronald Reagan signed into law.\n\nThis bipartisan reform slowly raised payroll taxes for workers, increased the full retirement age, and introduced taxes on Social Security benefits.\n\nBeginning in 1984, up to 50% of Social Security benefits could be taxed at the federal level if your provisional income—calculated as adjusted gross income plus tax-free interest and half of your benefits—was over $25,000 for single filers or $32,000 for married couples filing jointly.\n\nThen, in 1993, the Clinton administration added a second tax bracket, allowing up to 85% of benefits to be taxed if provisional income exceeded $34,000 for single filers or $44,000 for joint filers.","url":"https://eladelantado.com/news/social-security-taxes-2025-states/","image":"https://eladelantado.com/news/wp-content/uploads/2024/12/social-security-US-flag.jpg","video":null,"publish_date":"2025-01-01 00:56:51","author":"Raquel","authors":["Raquel"],"language":"en","source_country":"es","sentiment":-0.03},{"id":277437866,"title":"Stocks close down in final session of 2024; S&P 500 posts best two-year gain in decades","text":"Dec. 31 (UPI) -- Stocks closed lower on the final trading day of 2024 to end what has been a strong year for the Dow Jones Industrial Average and the S&P 500, which notched its second consecutive larger than 20% annual return in decades.\n\nThe Dow Jones Industrial Average closed down 29.51 points, or 0.07%, on Tuesday to close at 42,544.22. The S&P 500 was off 0.4% to 5,881 and the Nasdaq Composite was down 0.9% to 19,310.\n\nTuesday's close marks the first time since 1966 that the S&P 500 ended the year with four-straight down days. December was the worst month for the S&P 500 and the Nasdaq since April, according to data from FactSet.\n\nThe lower New Year's Eve close puts the so-called Santa Claus rally, defined as \"the last five trading days of the year plus the first two trading days of the new year,\" at risk, according to Adam Turnquist, chief technical strategist for LPL Financial.\n\n\"Since 1950, the S&P 500 has generated average and median returns of 1.3% during this period, widely outpacing the market's average seven-day return of 0.3%,\" Turnquist said.\n\nDespite a sluggish December, the Dow added 12.88% for the year, while the Nasdaq gained 28.64% in 2024.\n\nAnd the S&P 500 surged more than 23% this year after topping 24% in 2023. The two-year gain of 53% is the best since the S&P 500 rallied nearly 66% in 1997 and 1998, according to data from FactSet.\n\nAnalysts credit the enthusiasm for Artificial Intelligence and developments in Washington, D.C., including President-elect Donald Trump's win in November and the prospect of lower taxes, for the positive year-end numbers.\n\n\"I think a lot of what drove that enthusiasm is you had good developments on all those fronts in 2024. You had inflation on a downward trajectory, the Fed coming out aggressively in September when they started cutting rates,\" said Yung-Yu Ma, chief investment officer for BMO Wealth Management.\n\n\"And for a lot of the time you had a 10-year Treasury yield that was very well behaved, along with earnings growth. So you got everything together at once that was going well.\"\n\nTech stocks also saw strong gains in 2024 as Amazon, Apple, Alphabet, Meta, Microsoft, Nvidia and Tesla -- also known as the \"Magnificent Seven\" -- accounted for more than 50% of the S&P 500's total gains, according to data from S&P Dow Jones Indices. Since November, those stocks have accounted for more than 96% of the S&P 500's returns.\n\nBitcoin surged more than 120% in 2024, while gold rose nearly 29%.\n\n\"We believe the chances of another positive year in 2025 are favorable given the high probability of economic growth and a Fed that is likely to cut rates next year,\" Jeffrey Buchbinder, chief equity strategist at LPL Financial, said in a Dec. 30 note.\n\n\"But if resurgent inflation takes rate cuts off the table or speculation gets out of hand, this bull market could have a difficult time making it through next year.\"","summary":"Stocks closed lower on the final trading day of 2024 to end what has been a strong year for the Dow Jones Industrial Average and the S&P 500, which notched its second consecutive larger than 20% annual return in decades.","url":"https://www.upi.com/Top_News/US/2024/12/31/stocks-end-of-year/1041735690931/","image":"https://cdnph.upi.com/ph/st/th/1041735690931/2024/upi/197d3649252b668b795c961635213794/v1.2/Stocks-close-down-in-final-session-of-2024-SP-500-posts-best-2-year-gain-in-decades.jpg","video":null,"publish_date":"2025-01-01 00:48:55","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","source_country":"US","sentiment":-0.493},{"id":277436800,"title":"Investors hope for U.S. stock market trifecta in 2025 after back-to-back boom years","text":"New York - Investors are expecting more gains for the U.S. stock market in 2025 after two straight standout years, fueled by a solid economy supporting corporate profits, moderating interest rates and pro-growth policies from incoming President Donald Trump.The benchmark S&P 500 was up 23.31% in 2024, even with a recent speed bump, marking its second-straight year of gains exceeding 20%, lifted by megacap tech stocks and excitement over the business potential of artificial intelligence.The index soared 53.19% over the last two years, the biggest two-year percentage jump since 1998.","summary":"Investors are more confident about the economy than this time a year ago, with consumers and businesses having absorbed higher interest rates.","url":"https://www.japantimes.co.jp/business/2025/01/01/markets/investors-us-markets/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/01/01/443692.jpg?v=3.1","video":null,"publish_date":"2025-01-01 00:48:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"business","source_country":"JP","sentiment":0.063},{"id":277435558,"title":"Donald Trump Jr.'s New Girlfriend Bettina Anderson Shares Cryptic Quote on Social Media As His Family Fears Socialite is 'Using' Him and 'Will Ruin' The Brand","text":"Donald Trump Jr.'s new girlfriend is entering the new year with a note of optimism and appreciation.\n\nBettina Anderson, who has been linked to the president-elect's son since August, is trying to keep a positive outlook amid growing questions about her intentions, RadarOnline.com has learned.Trump Jr. and Anderson were first spotted together in back in August.\n\nWitnesses said the two were flirty during a brunch date that did not appear to be for \"business purposes\", adding it was clear the two had been intimate with each other.\n\nNow, as they prepare to enter the new year as a public couple, Anderson has shared a special note online.\n\nThe 38-year-old forwarded a note from another page that encouraged: \"Take a step back today, look at all those beautiful things you have.\"\n\nUnder that, she added her own gratitude for a life-changing year, writing: \"Thank you 2024.\"The beautiful thing Anderson has with Trump Jr. heated up over the summer – even though the president's first-born was engaged at the time to former Fox News anchor Kimberly Guilfoyle.\n\nTrump Jr. and Guilfoyle broke off their engagement just three months after Trump Jr. was first spotted getting cozy with Anderson, with his dad stepping in to smooth things over by naming Guilfoyle ambassador to Greece.\n\nSince their breakup, Trump Jr. has not been shy about showering Anderson with affection. Earlier this month the couple was spotted at a Florida hotspot – and neither attempted to conceal their PDA.\n\nThe two also headed to Italy to enjoy themselves after news of their potential relationship broke.As their relationship grows stronger, Anderson is expected at President-elect Donald Trump's second inauguration in January. \n\nBut some people within Trump's inner circle are concerned Anderson isn't exactly the one for Trump Jr., especially knowing her socialite reputation.\n\nA source said: \"It's one thing to worry about Palm Beach shenanigans making a stop at Mar-a-Lago, but to let those problems penetrate the White House is a new level of trouble.\"\n\nOther insiders close to Trump Jr. claim Anderson is using the 46-year-old in the latest move in her \"social ladder climbing\".\n\n\"We want to protect the Trump brand and don't want her close to the family,\" the insider said.After being accused of using her new high-powered man simply to climb the social ladder, Anderson angrily fired back, making it clear to everyone what she has with the president-elect's son is legit.\n\nThe model and influencer took to her Instagram Stories to share a notable bible passage from the book of Exodus, as it said: \"So let them lie. Let them manipulate. Let them talk. You just be still, because when God is on your side, who can stand against you?\"\n\nThe post quoted the bible, Exodus 1414, which says, \"Hold your peace and the lord will fight for you. You only need to be still.\"Trump Jr. and Anderson have been spending a lot of time at the philanthropist's townhouse as of late, further raising eyebrows about their seemingly close relationship.\n\nEyewitnesses dismissed the notion of an earlier meeting being for business purposes as they noted the flirtatious nature between the pair – and recalled Anderson kissing Trump Jr. at least three times.\n\nOne witness said: \"She seemed totally smitten with Don – and he is with her.\n\n\"They looked totally relaxed, she wearing a white shirt tied off to show her midriff and wide-leg pants, he was in shorts and a t-shirt.\"\n\nThe witness further insisted: \"They were definitely on a date\" before clarifying, \"They weren't exactly making out, but the kisses were romantic – and you could tell they were intimate with each other.\"","summary":"Donald Trump Jr.'s new socialite flame has shared a cryptic reflection on the end of the year, as she continues to face criticism of using the president-elect's son.","url":"https://radaronline.com/p/donald-trump-jr-new-girlfriend-bettina-anderson-cryptic-quote-social-media/","image":"https://media.radaronline.com/brand-img/EOO2Pde93/0x0/bettina-anderson-note-1735684389195.jpg","video":null,"publish_date":"2025-01-01 00:40:17","author":"Radar Staff","authors":["Radar Staff"],"language":"en","source_country":"us","sentiment":0.199},{"id":277433622,"title":"Panama commemorates canal handover despite Trump’s call for US control","text":"Top political leaders in Panama have held a ceremony to mark the 25th anniversary of the return of the Panama Canal after decades of United States control.\n\nBut the celebration took place under a pall, as US President-elect Donald Trump continued calls for his country to reassert dominance over the pivotal waterway, which connects the Pacific Ocean to the Caribbean Sea.\n\nPanamanian President Jose Raul Mulino, a right-leaning leader like Trump, was among the speakers at Tuesday’s main ceremony in the capital Panama City.\n\nHe reassured spectators that the Panama Canal would remain in his country’s possession, dismissing Trump’s remarks without mentioning the US leader by name.\n\n“There are no hands involved in the canal other than Panama’s,” Mulino said. “Rest assured, it will be in our hands forever.”\n\nBut Trump has increasingly pushed for US governance over the canal as part of his broader expansionist rhetoric.\n\nEarlier this month, Trump teased that Canada should become the 51st US state, and he repeated his desire to buy Greenland, an idea he floated during his first term in office.\n\nBut as Trump prepares for a second term on January 20, he has alarmed some observers with threats to potentially wrest the Panama Canal back from Panama’s control.\n\nOn December 21, in a post on his online platform Truth Social, Trump accused Panamanian officials of exacting “exorbitant prices” for passage in the canal.\n\nThe canal allows cargo ships to pass from the Pacific to the Atlantic Ocean without having to navigate all the way around South America, a perilous route that stretches thousands of kilometres.\n\nBut the canal has seen increased traffic in recent decades. It has also suffered a severe drought that stymied travel through its system of locks: water chambers that lift boats up and down when the surrounding land is not level.\n\nIn his posts, however, Trump indicated that Panama was violating a 1977 agreement that established conditions for the canal to shift from the US to Panamanian hands.\n\n“This complete ‘rip-off’ of our Country will immediately stop,” Trump wrote in the first of two lengthy posts. In the second, he continued with a warning.\n\n“If the principles, both moral and legal, of this magnanimous gesture of giving are not followed, then we will demand that the Panama Canal be returned to us, in full, and without question,” he wrote.\n\n“To the Officials of Panama, please be guided accordingly.”\n\nA history of control\n\nBuilding the canal through the isthmus of Panama had long been an ambition of Western colonial powers.\n\nIn the late 1800s, for instance, the US made overtures to construct the canal in Panama — part of Colombia at the time — but the South American country refused the deal.\n\nWhen Panama later declared independence, the US quickly supported its secession. The US was the first country to recognise Panama as its own state.\n\nIn return for US support, Panama granted the North American country the right to build the canal and oversee the land surrounding it. That area became known as the Panama Canal Zone.\n\nBut critics saw the agreement as a violation of Panama’s sovereignty. Ultimately, in 1977, then-US President Jimmy Carter signed two treaties to engineer the return of the canal and its surrounding lands.\n\nThat transfer took effect on December 31, 1999, exactly 25 years ago.\n\nCarter died on Sunday, just shy of the anniversary. Mulino paid tribute to the late US president on Tuesday by holding a moment of silence.\n\nIn his speech, Mulino described feeling a “mix of happiness for this 25th anniversary” and “sadness” over Carter’s death.\n\nRemembering ‘martyrs’\n\nTuesday’s celebrations also acknowledged the protesters who died advocating for the canal’s return to Panamanian control.\n\nAmong the honoured were the more than 20 participants killed in a student protest on January 9, 1964.\n\nThat day, known in Panama as the Martyrs Day, saw students try to raise a Panamanian flag alongside a US one at a high school in the canal zone. Violence erupted, resulting in the deaths of the protesters as well as four US soldiers.\n\nIn recent days, Trump has accused Panama of violating the terms of the canal’s return, by allegedly allowing Chinese soldiers to operate the shipping route.\n\nBut Panama’s officials have denied that China has any influence over the canal.\n\nJorge Luis Quijano, who served as the canal’s administrator from 2014 to 2019, was quoted in The Associated Press as saying that Trump has no legal basis for his claims to the canal.\n\n“There’s no clause of any kind in the neutrality agreement that allows for the taking back of the canal,” Quijano said.","url":"https://stkittsgazette.com/panama-commemorates-canal-handover-despite-trumps-call-for-us-control/","image":"https://stkittsgazette.com/app/uploads/2024/12/2024-12-31T182233Z_2023502128_RC290CAFUQFD_RTRMADP_3_PANAMA-USA-CANAL-1735684863-iauWZd.jpeg","video":null,"publish_date":"2025-01-01 00:36:51","author":null,"language":"en","source_country":"kn","sentiment":0.176},{"id":277432814,"title":"The Hollywood Reporter Tears George Clooney Apart for Role in Forcing Biden Out of the Race","text":"As 2024 comes to an end, we're seeing plenty of wrap up lists of \"best of\" and \"worst of,\" as well as memorable moments from the year. Among those participating included The Hollywood Reporter, and not just when it comes to their slew of articles to do with movies and film performances from the year. Last week, the outlet posted about George Clooney and his impact on the 2024 presidential election. \n\nWhen it comes to THR remembering \"all we've been through in 2024,\" one such example includes \"when George Clooney wrote the dumbest op-ed ever[.]\" \n\nTHR remembers all we've been through in 2024...Like when George Clooney wrote the dumbest op-ed ever: https://t.co/Lswt49uiaW pic.twitter.com/dcCwisDJsd— The Hollywood Reporter (@THR) December 23, 2024\n\nThe post shared to X links not to Clooney's op-ed, which he wrote in July for The New York Times, but to \"The Year in Entertainment: The 24 Weirdest, Wildest Moments of ‘24,\" from earlier this month. \n\nAs is mentioned in the piece's intro, \"George Clooney wrote an op-ed for The New York Times that for some reason people took seriously (honestly, what was everyone thinking?).\" \n\nThere's more on the op-ed as well:\n\nAt the time, it seemed like a sensible enough idea. After all, during his 90-minute senior moment at the June debate against Donald Trump, Joe Biden looked like a surefire loser. So why shouldn’t Clooney, a major Democratic fundraiser, write an op-ed for The New York Times prompting the president to step aside and let a younger candidate run? What could possibly go wrong? Oy. But to be fair, Clooney wasn’t the only left-leaning celebrity who underdelivered this election cycle. Beyoncé, Will Ferrell, Richard Gere, Katy Perry, Dick Van Dyke — none of them were able to move the needle of public opinion enough to get Kamala Harris into the White House, not even Taylor Swift. In the end, America listened to Hulk Hogan.\n\nAs THR alludes to, Clooney hosted a Hollywood fundraiser for President Joe Biden in June. It was one of the many events in which something was very clearly wrong with the president, despite how the White House, especially Press Secretary Karine Jean-Pierre, tried to gaslight the American people into thinking otherwise. After the disastrous June 27 debate against now President-elect Donald Trump, the calls came in to replace Biden, including from Clooney, with his op-ed. Once Vice President Kamala Harris was installed as the nominee, Clooney tried to help her campaign, as he was included in an ad trying to get Christian men to vote for her. \n\nClooney was asked about his role and Biden's exit from the race in the following months, including while promoting his film \"Wolfs\" with Brad Pitt. Just as was the case with Speaker Emerita Nancy Pelosi (D-CA), who also had a role in ousting Biden as the nominee, Clooney praised Biden for dropping out. Pelosi and Clooney even both managed to compare the 46th president to our very first one, with Pelosi saying that Biden should be on Mount Rushmore, and Clooney equating their supposedly \"selfless acts.\"\n\nAfter Harris' loss, though, Clooney wisely decided he would be taking a step back from politics. He still reportedly whined about being treated as a \"scapegoat,\" though. \n\nComing from an entertainment magazine, the above blurb about the op-ed could have been much worse. It wasn't just that \"America listened to Hulk Hogan,\" who supported Trump and who had memorable appearances at the RNC in July and the Madison Square Garden rally that took place just days before the election. Voters didn't just soundly reject Harris, who was installed as the replacement nominee after Biden was finally forced out on July 21, and has yet to win a single primary vote. They also chose Trump and the peace, prosperity, and stability that his presidency will hopefully once again bring to the country and the world.\n\nThat being said, it's not necessary to focus on which celebrities supported which candidate, even for an entertainment magazine. Last week, as we covered earlier on Tuesday, the AP-NORC put out a poll showing that just 24 percent of Americans say they \"strongly/somewhat approve\" of celebrities speaking out on political issues. A plurality, at 39 percent, say they \"strongly/somewhat disapprove.\" Just 12 percent of Independents and 11 percent of Republicans fall into the \"strongly/somewhat approve\" category. Thirty nine percent of Democrats fall into that \"strongly/somewhat approve\" category, however.","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/31/the-hollywood-reporter-tears-george-clooney-apart-for-part-in-forcing-biden-out-of-the-race-n2649826","image":"https://media.townhall.com/cdn/hodl/2018/235/a65dd923-054a-45a4-97ff-ee109565534b.jpg","video":null,"publish_date":"2025-01-01 00:31:51","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","source_country":"us","sentiment":-0.317},{"id":277433400,"title":"Governor Commutes Sentence of Man Who Raped, Killed Elderly Woman","text":"More than three decades after raping and murdering an elderly woman, Christopher Roseboro, on death row since 1994, on Tuesday saw North Carolina Governor Roy Cooper commute his sentence to life without the possibility of parole—as Roseboro was among 15 granted clemency by the outgoing Democrat.Why It MattersOpponents of the death penalty have urged Cooper to commute sentences of the 136 people on death row in North Carolina, converting them to prison terms. The Tar Heel State has not executed a death row inmate since 2006.Cooper's decision comes in the wake of a series of death row commutations made at the federal level by President Joe Biden during the closing days of his administration. Unable to seek a third consecutive term, the governor's run will end next week.Tuesday's action reduced North Carolina's death row population by more than 10 percent. Before Tuesday, the state had 136 death row offenders, with Cooper's office receiving clemency petitions from 89 of them.What To KnowIn March 1992, Roseboro murdered 72-year-old Martha Edwards in her home. The pathologist in the case indicated that the cause of death was consistent with smothering. Evidence presented at Roseboro's trial suggested that Edwards was also raped either while she was dying or after her death as Roseboro burglarized the house.His co-defendant, Roger Bell, received a life sentence and is still incarcerated.In 2019, Roseboro's attorneys argued that his intellectual disability made him ineligible for execution and sought a new sentence or trial, citing ineffective counsel during his 1994 court proceedings.The state, represented by Danielle Elbert, acknowledged some evidence of intellectual disability but maintained it was insufficient to remove him from death row.The case has remained unresolved for years, leaving questions about the fairness of his sentence unanswered.What People Are SayingCooper, in a news release: \"These reviews are among the most difficult decisions a Governor can make and the death penalty is the most severe sentence that the state can impose. After thorough review, reflection, and prayer, I concluded that the death sentence imposed on these 15 people should be commuted while ensuring they will spend the rest of their lives in prison.\"Biden, in a news release about federal death row commutations: \"These commutations are consistent with the moratorium my Administration has imposed on federal executions, in cases other than terrorism and hate-motivated mass murder.\"\"Make no mistake: I condemn these murderers, grieve for the victims of their despicable acts, and ache for all the families who have suffered unimaginable and irreparable loss.\"President-elect Donald Trump's reaction to Biden on Truth Social: \"Joe Biden just commuted the Death Sentence on 37 of the worst killers in our Country. When you hear the acts of each, you won't believe that he did this. Makes no sense. Relatives and friends are further devastated. They can't believe this is happening!\"What Happens NextCooper will hand the gubernatorial reins to fellow Democrat Josh Stein on Wednesday when Stein is sworn in.At the federal level, Biden is commuting the sentences of 37 inmates on federal death row, leaving all but three remaining: Dzhokhar Tsarnaev (Boston Marathon bombing), Robert Bowers (Tree of Life Synagogue shooting) and Dylann Roof (South Carolina church shooting).Do you have a story Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.","summary":"North Carolina Governor Roy Cooper commuted death row inmate Christopher Roseboro's sentence to life without the possibility of parole.","url":"https://www.newsweek.com/governor-commutes-sentence-man-who-raped-killed-elderly-woman-2008197","image":"https://d.newsweek.com/en/full/2554259/christopher-roseboro-north-carolina-governor.png","video":null,"publish_date":"2025-01-01 00:30:23","author":"Erin Keller","authors":["Erin Keller"],"language":"en","category":"politics","source_country":"US","sentiment":-0.451},{"id":277437410,"title":"Judge rejects Giuliani’s attempt to keep witness list secret in upcoming trial linked to defamation case","text":"An upcoming trial in a federal court in Manhattan will determine if Rudy Giuliani can exempt his multi-million dollar Florida condominium from a list of property he must hand over to mother-and-daughter election workers trying to collect on their $150 million defamation judgment against him.\n\nThe case has exploded into a lengthy legal back and forth, with dozens of court filings and briefings about the state of Giuliani’s assets and whether he has complied with court orders to turn them over to the election workers.\n\nDonald Trump’s former attorney turned in a list of people he intends to call as witnesses at the trial — which he tried to keep under seal, despite the fact that the court had “neither directed nor permitted this list to be filed under seal,” a judge wrote in response Monday.\n\nThe trial on January 16 will determine whether Giuliani can claim a homestead exemption for his Palm Beach condo, which he had previously claimed was his permanent property, and exempt from any court orders to hand the keys over to Ruby Freeman and Shaye Moss.\n\nBut attorneys for the defamed women have argued that Giuliani was treating the property as a vacation home, not a permanent residence, and have accused the former mayor of repeatedly dodging questions about it.\n\nGiuliani’s son, Andrew, is expected to appear at trial to also testify about the ownership of World Series rings he claims his father had gifted him. The elder Giuliani has already handed over a 1980 Mercedes Benz convertible, his New York penthouse apartment and other valuables locked up in a storage facility, among other items.\n\nThe former New York City mayor is seeking to present several witnesses at the mini trial, including his friend Alan Placa, a retired priest who played a central role in the Catholic Church’s sexual abuse scandal in New York.\n\nGiuliani also plans to call Maria Ryan, Ryan Medrano, and Michael Ragusa, who are expected to testify to Giuliani’s move to Florida. Ted Goodman, Giuliani’s current spokesperson, may also testify “if the need arises.”\n\nGiuliani’s latest mess joins a long list of courtroom rebukes and legal failures.\n\nThe trial over the Florida property will follow a contempt hearing scheduled for January 3, when District Judge Lewis Liman will hear from Trump’s former attorney why he should not face severe sanctions for repeatedly dodging court orders and deadlines in the case.\n\nIn a filing last week, Judge Liman dismissed Giuliani’s defense — and said he would be prepared to rule from the bench.\n\nThe case stems from Trump’s defeat in the 2020 election, when Giuliani falsely accused Freeman and Moss of manipulating election results in Georgia. They sued him for defamation in Washington, D.C., and in December 2023, a jury awarded them $148 million in damages.\n\nGiuliani then filed for bankruptcy. But after a protracted legal battle, that case was dismissed earlier this year to let Giuliani and his many creditors battle for control of his assets in separate courtrooms overseeing the lawsuits against him.\n\nJudge Liman is overseeing the turnover of Giuliani’s property.\n\nGiuliani will also face a contempt hearing in Washington, D.C., next month, after election workers accused him of repeatedly violating a court order that prevents him from repeating the same false statements about them.","summary":"The former New York mayor is hoping to keep his Palm Beach condo away from defamed election workers seeking to collect nearly $150 million he owes them","url":"https://www.independent.co.uk/news/world/americas/us-politics/giuliani-trial-florida-maria-ryan-b2672283.html","image":"https://static.independent.co.uk/2025/01/01/00/GettyImages-2182751623.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/UoFGxs2A-4VHSaSK0.mp4","publish_date":"2025-01-01 00:25:35","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.015},{"id":277432518,"title":"Trump supporters accused of storming the Capitol on Jan. 6 now seek permission to attend inauguration","text":"Washington — Some of the defendants accused of being part of the Capitol attack on Jan. 6, 2021, are now asking courts for permission to return to Washington, D.C, on Jan. 20 to attend the inauguration of President-elect Donald Trump. \n\nMany of the approximately 1,600 people who have been charged with felony or misdemeanor crimes for their alleged roles in the Jan. 6 attack have been subjected to court orders restricting their travel to and within the capital. But some have said that they should be afforded permission to return for the inauguration, arguing they are not a threat to public safety. \n\nIn a court filing on Monday, the Justice Department argued against allowing defendant Christopher Belliveau to attend the inauguration. “The last organized event the defendant attended in Washington, D.C., spiraled into a full-scale riot. This was the scene of his charged crime — a violent felony which contributed to the disruption of the peaceful transition of power,” federal prosecutors wrote.\n\n“The most compelling reason to deny Belliveau’s motion is that allowing his travel to Washington, D.C. places Capitol Police Officers in danger,” prosecutors added. “Belliveau argues that his lack of violent past warrants a modification of his conditions of release. But that makes his return to the Capitol even more concerning — Belliveau was only willing to engage in violence against Capitol Police Officers who were trying to keep a crowd of rioters under control.”\n\nBelliveau is accused of deploying bear spray against police during the Capitol attack and has pleaded not guilty. He filed his own motion in support of his request to attend the inauguration. Belliveau’s attorneys argued, “It is also vital to remember that, while Mr. Belliveau stands accused, he is presumed innocent, thus the mere fact that he is charged does not suggest that he is inherently more dangerous that any other person.”\n\nDefendant Cindy Young, who was found guilty on four criminal charges at trial in August, has also sought permission to travel to Washington for the festivities. In her filing on Dec. 11, Young’s lawyer said she has “complied with her conditions of release” for “well over a year.” \n\n“She poses no threat of danger to the community and she is not a risk of flight. She was allowed to travel several times to Washington, D.C., including to the Capitol building while preparing for trial and there were no incidents,” Young’s attorney said. \n\nBut prosecutors opposed Young’s request. Writing in response a week later, the Justice Department said Young has “continuously endorsed calls for retribution against those involved in January 6 prosecutions — specifically jurors, judges, and law enforcement — all whom help make up the D.C. community.” They wrote that Young “has also mocked officer victims,” many of whom “will, once again, be tasked in protecting the Capitol and Constitution on January 20, 2025.” The judge has not ruled on Young’s request.\n\nWilliam Pope, a Jan. 6 defendant who is serving as his own defense lawyer, also requested permission to attend the inauguration. In a filing on Saturday, Pope said, “I now move the Court for permission to travel to Washington, D.C. for the purpose of attending the Presidential Inauguration on January 20, 2025. Initially, I had declined an invitation to attend the inauguration (since I don’t enjoy being in Washington), however, I have now been asked a second time, and I believe it would be inappropriate for me to turn this request down.”\n\nPope has pleaded not guilty and is scheduled for trial in May. The court filing did not specify who invited Pope to be in attendance. The Justice Department has not yet responded to the request.\n\nTrump has pledged to pardons at least some of those charged or convicted with crimes related to Jan. 6. According to the latest Justice Department report, approximately 1,000 defendants have pleaded guilty. Roughly 600 have been charged with assaulting or resisting police. There are several fugitives being sought by federal agents, with more arrests still expected.","summary":"Washington — Some of the defendants accused of being part of the Capitol attack on Jan. 6, 2021, are now asking courts for permission to return to Washington, D.C, on Jan. 20 to attend the inauguration of President-elect Donald Trump.  Many of the approximately 1,600 people who have been charged with felony or misdemeanor crimes &#8230;\n\n\nThe post Trump supporters accused of storming the Capitol on Jan. 6 now seek permission to attend inauguration appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/trump-supporters-accused-of-storming-the-capitol-on-jan-6-now-seek-permission-to-attend-inauguration/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/23/51b4c4d5-aef5-42fc-8a4e-b44c019c4742/thumbnail/1200x630/38a86355b4493e4da3900aca77ee48f1/hypatia-h-d3e5e07e1c09bac8f46dda4f93d88a51-h-2c55fbe76abcf70a38e5cf722bed9ccc.jpg?v=fa9977353833f46f40b07abcd9d52","video":null,"publish_date":"2025-01-01 00:25:12","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.42},{"id":277431774,"title":"Jaishankar in Doha for talks, to prepare for Qatari Emir visit in February amidst West Asia outreach","text":"External Affairs Minister S. Jaishankar is in Doha for a 3-day visit over the New Year for a series of bilateral meetings, as well as to prepare for a visit by Qatar’s Emir Sheikh Tamim ibn Hamad Al Thani to India, expected early next month, sources told The Hindu.\n\nDuring Prime Minister Narendra Modi’s visit to Qatar last February, he had met and invited Sheikh Al Thani to India. The Emir’s visit is part of New Delhi’s recent broader outreach to the Gulf region, as Israel’s bombardment of Gaza continues, with the effects of the West Asian crisis now spreading to Lebanon, Syria, and Yemen.\n\nMr. Jaishankar was due to meet the Prime Minister and Foreign Minister of Qatar Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani in Doha, and to discuss “political, trade, investment, energy, security, cultural, and people-to-people” ties as well as “regional and international issues of mutual interest”, the Ministry of External Affairs (MEA) said in a statement before his departure.\n\nNaval officer stuck in Doha\n\nMr. Jaishankar’s visit to Qatar, his third in six months, has also raised hopes for the return of the eighth former Naval officer convicted for spying in 2023, who has been detained in Doha while others on death row along with him were pardoned. The decision to drop the death penalty against all eight men was taken at the end of December 2023, but while seven men were released and returned to India in February 2024, Commander (Retired) Purnendu Tiwari has been held back under a travel ban. \n\nThe MEA has said that the former Naval officer, who was also decorated with the Pravasi Bharatiya Samman, is required to complete certain “formalities” in the Qatari legal system. According to officials, the pending requirements pertain to financial charges against the Dahra Global company where Mr. Tiwari was Managing Director and the other seven former naval personnel were employed.\n\nFamily’s plea\n\nHowever, Mr. Tiwari’s family has rejected any charges of wrongdoing, pleading to the Prime Minister to “intervene” and facilitate his return at the earliest.\n\n“MEA made blunder in leaving my brother alone & now they should not take refuge by citing his financial case, which is as absurd as the first case [of spying]… It is becoming difficult day by day to explain to his 86-year-old mother as to why the Government of India has left [her] son only while seven others are back to India,” Mr. Tiwari’s sister Meetu Bhargava, who has been repeatedly petitioning the government for help, said on social media on December 21.\n\nWooing West Asia\n\nAmong a number of bilateral visits meant to shore up India’s ties with the troubled region, Mr. Modi has travelled to Kuwait while Mr. Jaishankar visited Bahrain, and twice travelled to Qatar in December. After the proposed visit of the Qatari Emir to India, expected in the first or second week of February, Mr. Jaishankar is expected to travel to Oman. The Crown Prince of Abu Dhabi Sheikh Khaled bin Mohamed bin Zayed Al Nahyan and Foreign Minister of Saudi Arabia Prince Faisal bin Farhan Al Saud also visited Delhi in the last few months. \n\nIn addition, New Delhi will receive Iranian Vice Minister for External Affairs Takht Ravanchi on January 2 as its first high-level diplomatic visitor in 2025. He is coming for annual Foreign Office consultations with Foreign Secretary Vikram Misri and will meet Mr. Jaishankar as well.\n\nThe visit from the new Iranian government is significant, given its growing tensions with Israel, as well as the imminent inauguration of incoming U.S. President Donald Trump later in January. Mr. Trump is expected to take a tougher line on Iran, and to step up sanctions, which will affect India as well. \n\nThe Foreign Office consultations were meant to be held in 2024, but were delayed amidst a year in which Iran exchanged missile attacks with Israel, lost its President and Foreign Minister in a helicopter crash, and faced a severe weakening of its international influence due to the Israeli operations against Hamas, Hezbollah, and the Houthis, as well as the ouster of President Bashar al-Assad from Syria.","url":"https://www.thehindu.com/news/national/jaishankar-in-doha-for-talks-to-prepare-for-qatari-emir-visit-in-february-amidst-west-asia-outreach/article69047576.ece","image":"https://th-i.thgim.com/public/news/national/b7mrse/article69047816.ece/alternates/LANDSCAPE_1200/20241215182L.jpg","video":null,"publish_date":"2025-01-01 00:23:51","author":"Suhasini Haidar","authors":["Suhasini Haidar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.168},{"id":277432530,"title":"Steve Bannon advises Elon Musk to slow down and 'study modern political history'","text":"President-elect Donald Trump's former advisor, Steve Bannon, has some advice for Elon Musk — start studying.\"You need to study modern political history of the fights we've been through for twelve or fourteen years to get to this spot,\" Bannon said on his \"War Room\" podcast on Tuesday.The remarks were made during a discussion about the H-1B visa, for which Musk has recently expressed support. While Bannon said Musk earned a seat at the table for investing in Trump's reelection and supporting the cause, he said he didn't agree with the Tesla CEO's stance on the H-1B visa.\"Don't come up and go to the pulpit in your first week here and start lecturing people about the way things are gonna be. If you're gonna do that,\" Bannon said, \"we're gonna rip your face off.\"Musk said on X that the US needs to attract foreign talent to remain globally competitive. He strongly supports H-1B visas, which he said were crucial to building \"SpaceX, Tesla and hundreds of other companies that made America strong.\"While Trump stood behind Musk, his stance has been criticized by MAGA supporters who say employers are using H-1B visas and other legal immigration methods to take jobs from Americans and drive down wages.Bannon was considered one of the most powerful figures in Trump's administration before he was ousted from the White House. He was later found in contempt of Congress after refusing to comply with the January 6 panel.Bannon completed a four-month prison sentence in October. After his release, the former strategist said at a media conference that he was \"empowered\" by his sentence.","summary":"Steve Bannon told Elon Musk to \"study modern political history\" amid MAGA's H-1B visa controversy.","url":"https://www.businessinsider.com/steve-bannon-elon-musk-war-room-podcast-visas-2024-12","image":"https://i.insider.com/677451319de00e389eb40803?width=1200&format=jpeg","video":null,"publish_date":"2025-01-01 00:23:44","author":"Ana Altchek","authors":["Ana Altchek"],"language":"en","category":"politics","source_country":"US","sentiment":-0.274},{"id":277434716,"title":"Musk living in Trump’s house – NYT","text":"Billionaire Tesla and SpaceX founder Elon Musk has reportedly been living in a cottage on Donald Trump's Mar-a-Lago estate in Florida since the US presidential election in November, according to The New York Times.\n\nMusk took up residence at the Banyan Cottage, which typically rents for $2,000 per night and is situated just a few hundred feet from Trump’s main house, providing Musk with easy access to the president-elect, the NYT reported on Monday, citing a person familiar with the property.\n\nThis arrangement underscores Musk's significant influence on Trump’s transition team and has allowed him frequent visits with the president-elect, including dinners and policy discussions, the newspaper noted.\n\nSince publicly endorsing Trump following a failed assassination attempt in July, Musk has gradually become one of his key advisors on both policy and personnel decisions. He attended meetings at the Mar-a-Lago Teahouse, participated in phone calls with foreign leaders, and involved his employees in vetting candidates for senior administration roles. Recently, Musk joined Trump for dinner with Amazon founder Jeff Bezos, a rival in the tech industry.\n\nMusk's financial contributions to Trump’s campaign have also been substantial: he reportedly spent around $250 million in the final months of the election cycle to support Trump. This level of backing has cemented Musk’s role as one of the most important donors and social media promoters for the president-elect.\n\nThe tech mogul's stay at Mar-a-Lago allegedly began around Election Day, during which he watched the returns with Trump. He left the property briefly around Christmas but is expected to return soon, the newspaper wrote, noting that the exact amount Musk will pay for his stay at Mar-a-Lago remains unclear. Vice President-elect JD Vance has also been frequently seen at Mar-a-Lago during the transition period.\n\nLast week, Trump posted what appears to be a private text to Musk on his social media platform, extending an invitation to visit Mar-a-Lago. Screenshots shared by several outlets included Musk’s acknowledgment of the invitation but did not confirm whether he planned to attend.\n\n”Where are you? When are you coming to the ‘Center of the Universe,’ Mar-a-Lago?” Trump wrote in a soon-deleted post, adding, “We miss you and X! New Year’s Eve is going to be AMAZING!!!” before signing off with his initials, “DJT.”","summary":"Billionaire tech mogul Elon Musk has reportedly been living in a cottage on Donald Trump’s Mar-a-Lago since the US presidential election \nRead Full Article at RT.com","url":"https://www.rt.com/news/610252-musk-lives-trump-house/","image":"https://mf.b37mrtl.ru/files/2025.01/article/67748a1420302750252d1970.jpg","video":null,"publish_date":"2025-01-01 00:20:06","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":0.171},{"id":277437432,"title":"‘We’re going to rip your face off’ in visa fight, Steve Bannon warns Elon Musk","text":"Donald Trump’s one-time White House strategist Steve Bannon warned Elon Musk Tuesday that he and other MAGA diehards are going to “rip your face off” unless Musk smartens up and stops pushing visas for skilled foreign workers to take good-paying tech industry jobs away from Americans.\n\nHe instructed Musk to “sit back and study” to understand MAGA’s - and what supporters believed was Trump’s - America First stance to keep U.S. jobs for Americans.\n\n“They’re recent converts,” Bannon said Tuesday on his War Room podcast, referring to Musk and other tech-world Trump supporters.\n\n“We love converts,” Bannon noted. “But the converts sit in the back and study for years and years and years to make sure you understand the faith and you understand the nuances of the faith and understand how you can internalize the faith.”\n\nDon’t “come up and go to the pulpit in your first week here and start lecturing people about the way things are going to be,” Bannon added. “If you’re going to do that, we’re going to rip your face off.”\n\nBannon called for a “100% moratorium on all immigration until we get this thing sorted.”\n\nBannon the previous day demanded “reparations” from Musk and other tech leaders for cutting Americans out of jobs. The visa issue is “central to the way they gutted the middle class in this country,” he complained.\n\nMusk was a Johnny-come-lately to politics before he forked over at least $250 million to help Trump get elected. Both he and tech entrepreneur (and Trump’s former rival for GOP presidential nomination) Vivek Ramaswamy have now been tasked by the president-elect with carving up the federal government to save money in their new DOGE operation.\n\nMusk and Ramaswamy have suddenly strongly spoken up in recent days on behalf of protecting special H-1B visas for skilled foreigners to fill high-level tech jobs, including in Musk’s businesses because American simply aren’t up to the task. The South African-born Musk last week endorsed a post on X that referred to American workers as “re***ed,” which is widely regarded as an ugly slur (Musk has since deleted his support for the attack post).\n\nRamaswamy has also complained that Americans are not up to snuff when it comes to competing with brainy foreigners. He blamed the dumbed-down culture of the U.S.\n\nTrump has backed Musk on the many “great” foreign workers in the country on H-1B visas, surprising many of the MAGA supporters who voted for him.\n\nMusk doesn’t appear to be budging, even though he has, out of character, suddenly called for a more “positive” and “beautiful” social media conversation. He made the appeal two days after he told H-1B opponents in a diatribe on X: “F*** yourself in the face.” Bannon came back with a different idea for Musk’s face.","summary":"‘Sit back and study ... Don’t come up and go to the pulpit in your first week here and start lecturing people about the way things are going to be,’ Trump’s former White House strategist warns tech billionaire","url":"https://www.independent.co.uk/politics/bannon-musk-rip-face-h1b-visa-b2672259.html","image":"https://static.independent.co.uk/2024/12/28/16/MUSKBANNON.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/wYMcbRey-OhrQWqOm.mp4","publish_date":"2025-01-01 00:12:04","author":"Mary Papenfuss","authors":["Mary Papenfuss"],"language":"en","source_country":"gb","sentiment":0.043},{"id":277430456,"title":"Elon Musk, Mark Zuckerberg top 2024 world’s richest billionaires ranking","text":"Carlos Slim: Slim, who has major stakes in Latin American businesses across the telecom, banking, construction and energy sectors, saw his net worth decline by $26 billion in 2024. His wealth was hurt by exchange rates — the peso fell about 20% after years of relative strength — and flagging markets after leftist candidate Claudia Sheinbaum’s June victory in Mexico’s presidential election.\n\nPham Nhat Vuong: The Vietnamese mogul, who has holdings in property development, retail and health care, saw shares in his electric vehicle company Vinfast Auto Ltd. Fall about 70% early in the year after losses widened and the market soured on its aggressive expansion plans. The stock has since recovered some ground, but the decline cost Vuong nearly half of his fortune.\n\nDonald Trump: The president-elect’s fortune soared to record highs this year, boosted by the performance of his majority stake in Trump Media & Technology Group Corp. Despite reporting a $19.2 million loss last quarter, DJT, as the social-media company is known, gained 95% this year, to a current market value of over $7 billion.\n\nJensen Huang: Nvidia CEO Huang has been one of the biggest individual winners of the AI boom so far, adding $76 billion to his net worth this year. Nvidia’s stock nearly tripled in 2024, and it became the world’s most valuable company for the first time in June.\n\nMark Zuckerberg: Despite a blockbuster $841 million antitrust fine from the EU and early-year hesitation from investors about the company’s multibillion-dollar AI push, the Meta CEO added $81 billion to his net worth this year as Meta stock gained nearly 70%.\n\nChinese billionaires: Chinese billionaires, including Tencent Holdings Ltd. CEO Pony Ma, Xiaomi Corp. Chairman Lei Jun and Cambricon Technologies Corp. co-founder Chen Tianshi, added 14% to their fortunes in 2024. Their gains reversed three straight years of losses spurred by an ongoing property crisis and government clampdowns on powerful tech firms.\n\nBillionaires under age 60: The younger billionaires on the list grew their wealth more than twice as much as their older counterparts this year. Billionaires under 60 make up 27% of the index. (AFP)","url":"https://www.newsexpressngr.com/news/247716/elon-musk-mark-zuckerberg-top-2024-worlds-richest-billionaires-ranking","image":"https://support.newsexpressngr.com/images/2024/12/1735672772.jpg","video":null,"publish_date":"2025-01-01 00:09:53","author":"Just Web Services","authors":["Just Web Services"],"language":"en","source_country":"ng","sentiment":0.104},{"id":277430444,"title":"Migrants anxious to enter US legally before Trump ends humanitarian programs","text":"The Mexican government runs a program of busing migrants with confirmed CBP One appointments from southern Mexico to the northern border, seeking to protect them from gangs and organized crime groups that extort and kidnap migrants traveling across the country.\n\nOn Monday, migrants in the southern Mexican city of Tapachula waited to secure seats on these buses and expressed relief that they’d managed to land one of the coveted CBP One appointments for early January, before Trump takes office on the 20th.\n\n“We will arrive before President Donald Trump takes office, regardless of the actions he may take,” said Venezuelan migrant Johandry Paz. “We already have confirmed appointments and we want to reach our destination: the United States of America.”\n\nThe Mexican government’s buses generally run two or three times a week, transporting migrants over a thousand miles north to Mexican border cities.","url":"https://www.newsexpressngr.com/news/247715/migrants-anxious-to-enter-us-legally-before-trump-ends-humanitarian-programs","image":"https://support.newsexpressngr.com/images/2024/12/1735672740.jpg","video":null,"publish_date":"2025-01-01 00:09:53","author":"Just Web Services","authors":["Just Web Services"],"language":"en","category":"politics","source_country":"ng","sentiment":0.082},{"id":277429602,"title":"Is a Constitutional Crisis Coming At Us Next Week?","text":"Fasten your seatbelts: Jan. 6, 2025 is just a few days away, and we could be in for a bumpy ride.\n\nFirst, there are the Democrats. Back in Oct. 2024, a few weeks before the election, Rep. Jamie Raskin (D-Pirate Bay) said that if Trump \"won a free, fair and honest election, then we would obviously accept it.\" Hey, that’s mighty big of you, Jamie, thanks! \n\nIn a neat instance of projection, however, Raskin wasn’t at all sure whether or not Bad Orange Man would manage to thwart the will of the people and steal the election. He said that he “definitely” did not think that Trump would refrain from resorting to chicanery in order to win, and claimed that the focus of all evil in the modern world was \"doing whatever he can to try to interfere with the process, whether we're talking about manipulating electoral college counts in Nebraska or manipulating the vote count in Georgia or imposing other kinds of impediments.\"\n\nWell, now the election is over and Trump won fair and square, although in some leftist circles, conspiracy theories are still circulating about how Trump managed to purloin the big prize from right under the nose of the People’s Choice, Kamala Harris. Raskin has heatedly denied making a statement that has circulated widely, attributed to him: “Let folks cast their votes for Trump if that’s their choice. But mark my words, we won’t be certifying the election. He might win, but we’ll ensure he doesn’t step foot in the Oval Office.”\n\nThe outraged solon declared: “This fictional ‘quote’ is 100% fabricated. It's one more lie in the stream of right-wing lies designed to undermine our election. Despite this actionable libel and all the disinformation, America is having a free and fair election and Congress will certify the winner.” Very well, then. Raskin didn’t say it. But why patriots would want to undermine an election that they won, Raskin didn’t say.\n\nAnd even if Raskin didn’t say this, it’s hard to imagine the left, which has devoted eight years to trying to destroy Donald Trump, would stand idly by on Jan. 6 and let him be certified as the next president of the United States. Even if leftists really don’t have something up their sleeve for that day, however, the Republicans could ruin everything for themselves quite well on their own. \n\nThe Daily Caller reported Tuesday that Rep. Chip Roy (R-Tex.) “said Tuesday that Speaker Mike Johnson does not have the votes among the House Republican conference to continue serving as speaker despite President-elect Donald Trump’s endorsement of Johnson on Monday.”\n\nIf Roy is correct, this is a big deal, for as PJM’s Paula Bolyard explained Monday: “If there's no House Speaker, there may not be a vote. If there is no certification, Trump cannot be inaugurated as president. Nor can JD Vance be sworn in without that crucial ceremonial vote. With no speaker in the House, the presidency could fall to Chuck Grassley until the House, with a slim Republican majority, can get things sorted out.” \n\nChuck Grassley would become president because, as the President Pro Tempore of the Senate, he is next in the line of succession. He is also 91 years old, and has been in the Senate since Jimmy Carter, who just died at age 100, was president of the United States.\n\n Related: Be Warned: The Dems Aren’t Finished Hatching Schemes to Keep Trump From Taking Office\n\nThe country has never gone through a muddle of such magnitude; as Paula pointed out, “the U.S. line of succession has never gone past the level of vice president.” If there is a time for a first, however, it could be right when the man whom the left has relentlessly demonized as the destroyer of democracy and all that is good is about to return to the Oval Office.\n\nChip Roy said: “I remain undecided, as do a number of my colleagues, because we saw so many of the failures last year that we are concerned about that might limit or inhibit our ability to advance the President’s agenda.” \n\nGreat, but if there is no certification on Jan. 6, there might not be any president’s agenda for Roy to defend. Trump has endorsed Johnson, and for the sake of the country, the Republicans should get on board. The alternative could be far worse than having a relatively weak speaker of the House.","url":"https://pjmedia.com/robert-spencer/2024/12/31/is-a-constitutional-crisis-coming-at-us-next-week-n4935570","image":"https://media.townhall.com/cdn/hodl/2022/60/aac8adf0-8fb6-4699-b8d5-b0f81d7740cb.jpg","video":null,"publish_date":"2025-01-01 00:04:51","author":"Robert Spencer","authors":["Robert Spencer"],"language":"en","source_country":"us","sentiment":-0.117},{"id":277429942,"title":"Zelenskiy says US will be beside Ukraine to stop Russia","text":"Ukrainian President Volodymyr Zelenskiy says no one will give peace to his country as a gift, but he believes the United States will stand alongside Kyiv as it fights to stop Russia's 34-month invasion.\n\nZelenskiy, in a slick 21-minute New Year video greeting to his compatriots, also said only a strong Ukraine could secure peace and earn worldwide respect.\n\n\"We know that peace will not be given to us as a gift, but we will do everything to stop Russia and end the war, something each of us desires,\" Zelenskiy said against a backdrop of the blue-and-yellow national flag, battlefield scenes and pictures of children.\n\nHe recalled conversations with outgoing US President Joe Biden, President-elect Donald Trump and \"everyone who supports us in the United States\".\n\n\"I have no doubt that the new American president wants and will be able to bring peace and end (Russian President Vladimir) Putin's aggression,\" Zelenskiy said.\n\n\"He understands that the former is impossible without the latter. Because this is not a street brawl where the two sides need to be pacified. This is a full-scale aggression by a deranged state against a civilised one. And I believe that, together with the United States, we are capable of the strength to force Russia into a just peace.\"\n\nRussia, Zelenskiy said, was not to be trusted either in battle or in talks.\n\n\"If today Russia shakes your hand, it doesn't mean that tomorrow the same hand will not start killing you,\" he said. \"Russians fear those who are free. What they don't understand. They fear freedom.\"\n\nBiden's administration has provided by far the most military support for Ukraine among Western nations since the February 2022 full-scale invasion.\n\nUkraine has been wary of Trump's criticism of aid to Kyiv and his pledge, during the US election campaign, to bring a quick end to the war, but Zelenskiy has expressed optimism about ensuring continuing US support.\n\nUkraine has endured a difficult year, with Russian forces taking village after village in a quicker advance on the eastern front than since the beginning of the invasion.\n\nIn recent months, Zelenskiy has said that any settlement to the conflict is predicated on receiving security guarantees from Western nations and Kyiv securing an invitation to join the NATO alliance, a notion Russia rejects out of hand.\n\nIn his greeting, Zelenskiy said that in the past year, Ukraine had launched an incursion into southern Russia's Kursk region, staged long-range drone strikes against distant Russian targets and developed domestically produced drones and other weapons.\n\n\"Every day in the coming year, I and all of us must fight so that Ukraine can be strong enough,\" he said. \"Only such a Ukraine is respected and heard - both on the battlefield and at the negotiating table.\"","summary":"No one will give peace to Ukraine as a gift but the US will stand alongside Kyiv as it fights to stop Russia's agression, President Volodymyr Zelenskiy says.","url":"https://thewest.com.au/news/conflict/zelenskiy-says-us-will-be-beside-ukraine-to-stop-russia-c-17252323","image":"https://images.thewest.com.au/publication/C-17252323/0d8857b4a0206d1ba73abbd2128f8218f9d20d05-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-01 00:03:31","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":0.136},{"id":277429272,"title":"Mike Johnson Won't 'Be Good At' Enacting Trump Agenda, Republican Warns","text":"Republican Representative Thomas Massie said Tuesday that House Speaker Mike Johnson will not be able to enact President-elect Donald Trump's agenda.Newsweek reached out to Johnson's spokesperson via email for comment.Why It MattersMassie's criticism came days after Trump offered a full-throated endorsement of Johnson, calling him a \"good, hard-working, religious man.\"Johnson's role as House speaker will be up for a vote after the new Congress is sworn in, and the vote will come just days after Johnson faced sharp blowback from his colleagues over a federal funding fight that nearly resulted in a government shutdown.What To Know\"Johnson is not up for this task,\" Massie, a Kentucky Republican, wrote on X, formerly Twitter.He made the comment in response to former House Speaker Newt Gingrich, who criticized \"contrarian\" House Republicans for being \"in effect allies of the Democrats.\"\"I do not understand what the CONTRARIAN house republicans think they will gain by opposing Speaker Mike Johnson,\" Gingrich wrote on X. \"They have no one who can get more votes.\"Gingrich added that \"they risk crippling President Trump's electoral win on January 6. They are in effect allies of the Democrats. I challenge them to explain what their end game is other than noise.\"\"Challenge accepted,\" Massie replied. \"First let me note that the 'vote for Mike' camp is not trying to make the case that Mike Johnson is endowed with the qualities necessary to lead our conference. Even you have limited yourself here to procedural justifications for his speakership rather than telling us why he is a good or capable leader.\"\"Even if Mike's entire goal is to do everything Trump wants without debate or question (which I would argue is not healthy for the institution of Congress), he's not going to be good at it,\" Massie continued. \"He already demonstrated this month that he won't tell the President what is achievable and what is not achievable in the House, and he lacks the situational awareness himself to know what can pass and what cannot.\"Massie said that he and other Republicans who oppose Johnson hope to gain \"a competent Speaker who has the will and ability to capitalize on this once in a decade opportunity.\"\"Johnson is not up for this task,\" he wrote.The Kentucky lawmaker also characterized Gingrich's claim that \"no one can get more votes\" as \"somewhat ridiculous.\"\"He was only electable the first time because he hadn't held any type of leadership position, nor had he ever fought for anything, so no one disliked him and everyone was tired of voting. He won by being the least objectionable candidate, and he no longer possesses that title,\" Massie wrote.What People Are SayingRepresentative Thomas Massie, on X: \"I respect and support President Trump, but his endorsement of Mike Johnson is going to work out about as well as his endorsement of Speaker Paul Ryan. We've seen Johnson partner with the democrats to send money to Ukraine, authorize spying on Americans, and blow the budget.\"Former Florida Representative Matt Gaetz, on X: \"Trump endorsing Johnson is 'art of the deal' level practicality. We could never have held up McCarthy two years ago for concessions if a Trump certification hung in the balance. Now, it does. We were able to hold up McCarthy because Republican voters weren't all that eager to see us getting back to being Biden's bitch (which Kevin ultimately did anyway). The resistance to @SpeakerJohnson is now futile. Let's work to make him the best version of himself (which was more like the 2023 vintage of Mike).\"What Comes NextThe new Congress will be sworn in on January 3, after which Republicans will vote on the next House speaker.","summary":"\"Even if Mike's entire goal is to do everything Trump wants...he's not going to be good at it,\" Thomas Massie wrote on X.","url":"https://www.newsweek.com/mike-johnson-thomas-massie-house-speaker-trump-2008194","image":"https://d.newsweek.com/en/full/2554242/thomas-massie.jpg","video":null,"publish_date":"2025-01-01 00:01:31","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.321},{"id":277432000,"title":"Russian advances in Ukraine grew seven-fold in 2024, data shows","text":"Russia advanced by almost 4,000 square kilometers (1,500 miles) in Ukraine in 2024, seven times more than in 2023, an AFP analysis of data from the Institute for the Study of War showed Tuesday.The data highlights the pressure Ukraine faces as it enters 2025, with Moscow pouring resources into its nearly three-year invasion and uncertainty hanging over future US aid for Kyiv under a Donald Trump presidency.Much of the Russian gains came in the autumn, as they took 610 square kilometers in October and 725 square kilometers in November. Those two months saw the Russians capture the most territory since March 2022, in the early weeks of the conflict.Russia's advance slowed in December, coming to 465 square kilometers in the first 30 days of the month.But it is already nearly four times bigger than in the same month of the previous year and two-and-a-half times more than in December 2022.Incumbent US President Joe Biden's administration unveiled almost $6 billion in military and budget aid for Ukraine on Monday in a race to support Kyiv before Trump takes office in January.The Republican has said he will end the conflict in \"24 hours\" once in power, raising fears in Ukraine it will be forced to give up all the land the Kremlin currently controls in exchange for peace. Missile hits Russia has launched overnight aerial attacks on Ukraine almost every day since its forces invaded in February 2022, targeting military and civilian infrastructure, including the power grid.Moscow launched a barrage of drones and missiles across Ukraine overnight and early Tuesday, with officials conceding there were successful strikes in the east of the country and near the capital.Authorities did not elaborate on what had been hit but in the wider Kyiv region, the governor said debris from a downed projectile had damaged a private home and wounded a woman.Moscow said its forces had used attack drones and precision weapons in a \"combined\" assault on a military airfield and a munitions production facility, claiming that the targets were struck.Ukraine has stepped up its own attacks inside Russian territory in response, and urged its Western allies to supply more air defense systems.A Ukrainian drone strike in western Russia caused a fuel spill and fire at an oil depot, a Russian regional governor said earlier Tuesday.In his New Year's Eve address Tuesday, Russian President Vladimir Putin did not explicitly mention the war in Ukraine but praised Russia's soldiers for their \"courage and bravery\".\"You are true heroes who have undertaken the great military labor to defend Russia,\" he said.Russian Defense Minister Andrei Belousov paid tribute to \"fallen soldiers\" in his address, saying they had died fighting \"Nazism\" -- a pretext Putin used to launch his invasion. 'Everyone has one wish' Ukrainian President Volodymyr Zelensky has urged his war-battered country's allies to help end the invasion and bring lasting peace in 2025.Those hopes were echoed to AFP on the streets of Kyiv ahead of the turn of the new year.\"I want peace to finally be obtained for Ukraine, for people to stop dying, for all our soldiers to return to their homes and celebrate next year and next Christmas with their families,\" said Kateryna Chemeryz, a teacher.\"It seems to me that everyone has one wish, one dream: that Ukraine will win, and all our territories are regained,\" said Tetiana, a civil servant who declined to give her family name.The incoming US president has also vowed to end the war but has not outlined any roadmap and there are concerns a deal could come at the expense of Ukrainian territory.Zelensky has sought to build bridges with Trump and his team, amid fears the Republican could slow vital US military aid or halt it entirely.\"For me personally, there is some anxiety, because I was hoping for a different outcome,\" Chemeryz, the teacher, said of Trump's return to the White House.Tetiana was dismissive, saying Ukraine should work to determine its own fate \"without Trump or anyone else.\"","summary":"","url":"https://tribune.net.ph/2025/01/01/russian-advances-in-ukraine-grew-seven-fold-in-2024-data-shows","image":"https://media.assettype.com/tribune/2024-09-18/fs0v4too/00036G47V4.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-01-01 00:00:00","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":-0.002},{"id":277431140,"title":"Liz Peek: Biden has 'surpassed' Obama in 'tsunami' of regulations","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics December 31, 2024 06:48 \n\n Liz Peek: Biden has 'surpassed' Obama in 'tsunami' of regulations \n Fox News contributor Liz Peek discusses President-elect Donald Trump's plan to overhaul President Biden's big government on 'The Bottom Line.' \n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSWHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODES","summary":"Fox News contributor Liz Peek discusses President-elect Donald Trump&apos;s plan to overhaul President Biden&apos;s big government on &apos;The Bottom Line.&apos;","url":"https://www.foxbusiness.com/video/6366586814112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/b8e6b0ce-a0e7-4b77-ab1e-0a8b3f84e7e0/c6538a7f-95a1-4aed-bd02-b3a55662b41b/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-31 23:59:46","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":277427980,"title":"Tyler Perry Blames WGA Racism for Avoiding Writer&#8217;s Rooms in His Projects","text":"1/1Eurweb 6Read More\n\n Video Player is loading.Duration -:-/Current Time 0:00Loaded: 0.00%0:00Remaining Time --:- This is a modal window.The media could not be loaded, either because the server or network failed or because the format is not supported.Beginning of dialog window. Escape will cancel and close the window.TextWhiteBlackRedGreenBlueYellowMagentaCyanOpaqueSemi-TransparentBackgroundBlackWhiteRedGreenBlueYellowMagentaCyanOpaqueSemi-TransparentTransparentWindowBlackWhiteRedGreenBlueYellowMagentaCyanTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsEnd of dialog window.SharePlayback Speed0.25x0.5x1x 1.5x2x\n\n TOP ARTICLES\n\n Powered by AnyClip Privacy PolicyKeyboard Shortcuts\n\n Home » News » Tyler Perry Blames WGA Racism for Avoiding Writer’s Rooms in His Projects \n\n Tyler Perry Blames WGA Racism for Avoiding Writer’s Rooms in His Projects \n\n \n \n\n Ny MaGee \n\n \n \n\n December 31, 2024 \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n Tyler Perry (The Triple Six Eight) – screenshot\n*Tyler Perry has made it clear that he doesn’t need advice on achieving success, including the use of writer’s rooms for his TV projects. \n\nWhile promoting his new Netflix movie “The Six Triple Eight,” Perry reiterated that he prefers writing most of his scripts himself, citing a decline in ratings when he previously opened up his projects to writer’s rooms, Cassius Life reports.\nThe successful self-made mogul noted that an unspecified issue with the Writers Guild of America influenced his decision not to share the writing responsibilities, especially following the 2023 Hollywood strike involving the Writers Guild and the Screen Actors Guild.\n“What people don’t know is that early on, I had a writer’s room and it was a nightmare for me,” he told Essence in 2020. “Not only that, they were turning in scripts that didn’t speak to my audience and my ratings took a dip. My audience knows my voice. They want to hear from me. They want to hear what I’m saying. I don’t know what people are complaining about because I am writing specifically for my audience…specifically for them.”\nWhen Perry appeared on Keke Palmer’s podcast in July, he explained why he does not use writer’s rooms on certain shows.\n\n“Over the last two years now, I’ve brought in writers’ rooms and we’ve had them on other, on the sitcoms, but now I’ve brought them in on other shows,” he said on an episode of Baby This is Keke Palmer. “I’ve trained enough young directors to be able to understand how to edit and shoot. So they’re able to do a huge page count like I can. I’ve trained them how to watch for waste and time, but it’s very important to know when to let go.”\nSpeaking to USA Today, Perry unpacked his gripe with the Writers Guild of America, the union that represents film and TV writers.\n“Because if people understood why there was no writers or if they understood what I had to deal with, if they understood what I had to endure, the racism that brought me to the place where I didn’t have a writer’s room,” he said. “It was a racist moment with the WGA that brought me to that place, that I had to fight my way through, that made me stand in my own strength to be able to write all of those shows.”\nREAD MORE FROM EURWEB.COM: Tyler Perry Honored at the Paley Center for Media Gala | EURexclusivePICs\n\n We Publish News 24/7. Don’t Miss A Story. Click HERE to SUBSCRIBE to Our Newsletter Now! \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n PrevPrevious ArticleJennifer Lopez Rejected Bruno Mars for Wedding Over $5M Fee, Fans Say: ‘He Was Trying to Get Out of Debt’ \n\n Next Article‘The Simpsons’ Showrunner Reveals How He Wants Long Running Series to EndNext \n\n Wait. Whaaat?! Joe Budden Charged with Lewdness After Naked Encounter Outside Apartment | VIDEO\n\n Police Identify Woman Burned Alive in Horrific NYC Subway Attack\n\n Angelina Jolie and Brad Pitt Finalize Divorce After Eight-Year Legal Dispute\n\n Single Chinese Women Stage Baby Bump Photoshoots to Preserve Youthful Moments\n\n FSU Coach Leonard Hamilton Faces Lawsuit Over Unfulfilled NIL Promises\n\n ‘The Simpsons’ Showrunner Reveals How He Wants Long Running Series to End\n\n Jennifer Lopez Rejected Bruno Mars for Wedding Over $5M Fee, Fans Say: 'He Was Trying to Get Out of Debt'\n\n The Roots Picnic Enrolls All-Star Rap Alumni for ‘Class Of ’95’ Experience | PicsVideo\n\n The Worst-behaved Travelers of 2024 | PicsVideo\n\n TAYO Fatunla's Fact Finder - Black History Timeline for Educational Purposes\n\n No posts found\n\n TikToker 'Cooking With Kya' Goes Viral Amid Controversy, Allegations of Influenced Violence\n\n Cooking With Kya screenshot (TikTok)\n*TikToker “Cooking With Kya” has gained viral fame for her cooking...\n\n EURweb and KBLA Talk 1580 Remembers Robin Ayers Who Has Passed Away at 44\n\n Robin Ayers\n*With heavy hearts, the entertainment journalism community mourns the passing of Robin Ayers,...\n\n Heartbreaking! Once Again Eddie Levert Has Lost A Child: His 22-Year-Old Daughter Ryan\n\n Eddie Levert and Ryan Levert\n*The music world mourns yet again as legendary soul singer Eddie Levert,...\n\n Denzel Washington's Spiritual Journey Culminates in Baptism and Ministry License at Kelly Temple COGIC | WATCH-it-Happen!\n\n *Yesterday (12-21-24), Denzel Washington took a profound step in his spiritual journey by being baptized...\n\n JAY-Z’s Legal Team Reportedly Preparing Lawsuit Against Jaguar Wright\n\n Jaguar Wright – via Instagram\n*Jay Z’s legal team is allegedly preparing a lawsuit against Jaguar...\n\n Here's a Recipe for Sweet Candied Yams for Your Holiday Meal | Video\n\n Homemade Thanksgiving Candied Yams with Brown Sugar\n*Candied yams are the ultimate comfort food, evoking...\n\n Donald Trump’s Health Under Scrutiny: Speculation Grows Amid Recent Public Appearances with Bruises on Hands | PHOTOs\n\n Trump with bruised hands\n*In recent weeks, speculation about the health of President-elect Donald Trump...\n\n Gail Bean and Taye Diggs Star in Psychological Thriller 'Both Eyes Open' | Watch Trailer\n\n*The trailer for the psychological thriller “Both Eyes Open,” starring Gail Bean and Taye Diggs has...\n\n Current Election Results Show Trump's Popular Vote Over Harris Below 50 Percent - That's Not A Mandate\n\n Donald Trump (AP-Getty Images via CNN Newsource)\n*He may be celebrating his win over Vice President Kamala...\n\n Kamala Harris Mocked After She Appears 'Drunk' in Video Message to Supporters | WATCH\n\n Kamala Harris (tan suit) – Getty\n*The official X account for The Democrats posted a video on Tuesday...\n\n No posts found\n\n 1/1EUR-Promo Read More\n\n Video Player is loading.Duration -:-/Current Time 0:00Loaded: 0.00%0:00Remaining Time --:- This is a modal window.The media could not be loaded, either because the server or network failed or because the format is not supported.Beginning of dialog window. Escape will cancel and close the window.TextWhiteBlackRedGreenBlueYellowMagentaCyanOpaqueSemi-TransparentBackgroundBlackWhiteRedGreenBlueYellowMagentaCyanOpaqueSemi-TransparentTransparentWindowBlackWhiteRedGreenBlueYellowMagentaCyanTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsEnd of dialog window.SharePlayback Speed0.25x0.5x1x 1.5x2x\n\n TOP ARTICLES\n\n Powered by AnyClip Privacy PolicyKeyboard Shortcuts\n\n EUR-Promo \n\n POPULAR \n\n Social Heat\n\n Today’s Video\n\n Wait. Whaaat?! Joe Budden Charged with Lewdness After Naked Encounter Outside Apartment | VIDEO \n\n Police Identify Woman Burned Alive in Horrific NYC Subway Attack \n\n Angelina Jolie and Brad Pitt Finalize Divorce After Eight-Year Legal Dispute \n\n Single Chinese Women Stage Baby Bump Photoshoots to Preserve Youthful Moments \n\n FSU Coach Leonard Hamilton Faces Lawsuit Over Unfulfilled NIL Promises \n\n ‘The Simpsons’ Showrunner Reveals How He Wants Long Running Series to End \n\n Tyler Perry Blames WGA Racism for Avoiding Writer's Rooms in His Projects \n\n Jennifer Lopez Rejected Bruno Mars for Wedding Over $5M Fee, Fans Say: 'He Was Trying to Get Out of Debt' \n\n The Roots Picnic Enrolls All-Star Rap Alumni for ‘Class Of ’95’ Experience | PicsVideo \n\n No posts found","url":"https://eurweb.com/2024/tyler-perry-blames-wga-racism-for-avoiding-writers-rooms/","image":"https://eurweb.com/wp-content/uploads/2024/08/Tyler-Perry-Getty1.jpg","video":null,"publish_date":"2024-12-31 23:48:51","author":"Ny Magee","authors":["Ny Magee"],"language":"en","source_country":"us","sentiment":0.129},{"id":277427970,"title":"Noooo! Roscoe&#8217;s Chicken n Waffles Ownership Controversy: Are MAGA Ties a Factor? Boycott Called? | VIDEOs","text":"Roscoe’s Chicken n Waffles has long been more than just a restaurant; it is a cultural landmark in Southern California, particularly within the Black community. However, recent discussions surrounding its ownership have sparked controversy and concern among loyal patrons.\n\nRumors suggest new ownership may have affiliations with MAGA supporters, raising alarms about the potential loss of the restaurant’s original essence. Currently, Roscoe’s is under the auspices of East Coast Foods, but details regarding the actual ownership remain unclear, leading to anxiety among those who cherish its legacy.\n\nThe situation escalated dramatically in November 2024 when a large inflatable figure of president-elect Donald Trump appeared in front of the Long Beach location. Social media, particularly on platform X, saw a flurry of comments expressing disappointment and outrage at what many perceived to be a betrayal of Roscoe’s roots as a Black-owned establishment.\n\nThe restaurant has not only served as a culinary haven. Still, it has also been a fixture in the cultural narrative of the Black community, frequently frequented by celebrities, politicians, and influential figures, Eater reports.\n\nThe timing of the Trump inflatable sighting coincided with additional scrutiny, as Epicurious Expeditions, a popular food influencer, posted videos highlighting the inflatable and troubling health inspection reports citing multiple violations.\n\nThis dual revelation ignited a wave of customer dissatisfaction, with many expressing their heartbreak over the restaurant’s apparent shift in values.\n\n“Ain’t gonna lie, this one hurts. I used to love Roscoe’s,” lamented one user, echoing a sentiment felt widely in the community.\n\nDiane Vara, identified as a partner in Roscoe’s by her Instagram, attempted to quell the backlash by clarifying that the inflatable belonged to a nearby venue, emphasizing that Roscoe’s remains committed to serving the community.\n\nIn her social media response, she strived to separate the restaurant’s identity from the political controversies enveloping it. Yet, at a time when many patrons feel personally connected to the restaurant’s legacy, her words did little to assuage growing concerns.\n\nRoscoe’s legacy has been challenged in recent years, facing a series of financial struggles, legal battles, and allegations of racial discrimination.\n\nFormer owner Herb Hudson opened the first location back in 1975, and while the brand has made strides, including a new flagship location in 2021, the narrative surrounding Roscoe’s Chicken & Waffles has shifted significantly.\n\nEvents like the tragic shooting of rapper PnB Rock within its walls further add to the tumultuous backdrop of this beloved establishment.\n\nAs Roscoe’s nears its 50th anniversary, the intersection of culture, community, and politics cannot be overlooked. Loyal customers voice their nostalgia and disappointment amid these changes, wondering whether the foundational values of Roscoe’s Chicken & Waffles will survive a rapidly evolving landscape.\n\nWith so much uncertainty surrounding ownership and direction, the future of Roscoe’s remains as unpredictable as the conversations that define its reputation today.\n\nMORE NEWS ON EURWEB.COM: The Worst-behaved Travelers of 2024 | PicsVideo","url":"https://eurweb.com/2024/roscoes-chicken-n-waffles-faces-backlash-over-maga-rumors/","image":"https://eurweb.com/wp-content/uploads/2022/09/Roscoes-sign.jpg","video":null,"publish_date":"2024-12-31 23:48:51","author":"Fisher Jack","authors":["Fisher Jack"],"language":"en","source_country":"us","sentiment":0.224},{"id":277437610,"title":"Citigroup Withdraws from Global Climate Banking Alliance","text":"Citigroup has announced its departure from the Net-Zero Banking Alliance (NZBA), becoming the third major U.S. bank to exit the United Nations-backed coalition this month. This move follows similar decisions by Goldman Sachs and Wells Fargo, highlighting a significant shift among American financial institutions regarding collective climate commitments.\n\nThe NZBA, established in 2021, comprises banks dedicated to aligning their lending and investment portfolios with net-zero greenhouse gas emissions by 2050. Citigroup, a founding member, emphasized that despite its withdrawal, it remains steadfast in pursuing its individual climate objectives. The bank stated it will continue to work with clients on transitioning to a low-carbon economy while ensuring energy security. \n\nThis series of exits occurs amid escalating political pressure from Republican lawmakers who argue that such climate commitments could impede investments in traditional energy sectors, particularly oil and gas. The re-election of President Donald Trump has intensified scrutiny of environmental, social, and governance (ESG) initiatives, with critics contending that these efforts may contravene antitrust laws or state regulations. Notably, Republican-led states have filed antitrust lawsuits against major asset managers like BlackRock, State Street, and Vanguard, accusing them of using their investment power to limit supplies in pursuit of net-zero carbon emissions goals. \n\nWells Fargo’s departure from the NZBA followed a review by Texas Attorney General Ken Paxton, who suggested that the bank’s ESG commitments might violate state laws prohibiting discrimination against the fossil fuel industry. In response, Wells Fargo confirmed its exit, aligning with state requirements while maintaining its commitment to supporting clients in the energy sector. \n\nSimilarly, Goldman Sachs withdrew from the NZBA earlier this month, citing a desire to focus on its sustainability efforts independently. The bank reiterated its commitment to achieving net-zero emissions by 2050 and emphasized its ongoing work to set and report on interim targets. \n\nThe NZBA is part of the broader Glasgow Financial Alliance for Net Zero (GFANZ), which unites financial institutions in the goal of accelerating the decarbonization of the economy. Despite the recent withdrawals, the alliance continues to grow, now surpassing 100 member banks since its inception. \n\nThese developments underscore the complex landscape financial institutions navigate in balancing climate commitments with regulatory and political pressures. As debates over the role of ESG considerations in financial decision-making intensify, banks are reassessing their participation in collective climate initiatives, opting instead to pursue individualized strategies that align with their business models and stakeholder expectations.\n\nCitigroup’s exit from the NZBA reflects this trend, as the bank plans to refocus its efforts on providing capital to emerging markets to support climate initiatives. This approach aims to address the unique challenges and opportunities present in different regions, acknowledging that a one-size-fits-all strategy may not be effective in achieving global climate goals.","summary":"Arabian Post -Citigroup has announced its departure from the Net-Zero Banking Alliance (NZBA), becoming the third major U.S. bank to exit the United Nations-backed coalition this month. This move follows similar decisions by Goldman Sachs and Wells Fargo, highlighting a significant shift among American financial institutions regarding collective climate commitments. The NZBA, established in 2021, comprises banks dedicated to aligning their lending and investment portfolios with net-zero greenhouse gas [&#8230;]\n\n\nvia Citigroup Withdraws from Global Climate Banking Alliance","url":"https://thearabianpost.com/citigroup-withdraws-from-global-climate-banking-alliance/","image":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Citi_logo_March_2023.svg/1200px-Citi_logo_March_2023.svg.png","video":null,"publish_date":"2024-12-31 23:41:42","author":"Goldman Sachs,The Arabian Post Network","authors":["Goldman Sachs","The Arabian Post Network"],"language":"en","source_country":"ae","sentiment":0.223},{"id":277433158,"title":"Supreme Court Chief Justice says judicial independence under threat, as Trump return looms","text":"US Supreme Court Chief Justice John Roberts issued a defence Tuesday of judicial independence, which he said is under threat from intimidation, disinformation and the prospect of public officials defying court orders.\nRoberts laid out his concerns in an annual report released after a year where the nation’s court system was unusually enmeshed in a closely fought presidential race, with then-Republican US presidential candidate Donald Trump attacking its integrity as he faced criminal charges for which he denied wrongdoing.\nTrump won the election following a landmark Supreme Court immunity decision penned by Roberts that led to criticism from Democrats like US President Joe Biden.\nTrump is now readying for a second term as president with an ambitious agenda, elements of which are likely to be legally challenged and end up before the court whose conservative majority includes three justices appointed by Trump during his first term.\nRoberts did not mention Trump. Still, he wrote that even if court decisions are unpopular or mark a defeat for a presidential administration, other branches of government must be willing to enforce them to ensure the rule of law.\n\nHe pointed to the Brown vs Board of Education decision that desegrated schools in 1954 as one that needed federal enforcement in the face of resistance from southern governors.\n“It is not in the nature of judicial work to make everyone happy,” he wrote.\nThe chief justice also decried elected officials across the political spectrum who have “raised the spectre of open disregard for federal court rulings”.\n“Attempts to intimidate judges for their rulings in cases are inappropriate and should be vigorously opposed,” he wrote. While public officials have the right to criticise rulings, they should also be aware of that their statements can “prompt dangerous reactions by others”.\nHe also pointed to disinformation about court rulings as a threat to judges’ independence, saying that social media can magnify distortions and even be exploited by “hostile foreign state actors” to exacerbate divisions.\nThreats of violence against judges around the country have been on the rise across the country in recent years, something that Roberts called “wholly unacceptable”.","summary":"John Roberts did not name Trump but said that even if court decisions are unpopular, other branches of government must still enforce them.","url":"https://www.scmp.com/news/world/united-states-canada/article/3292978/supreme-court-chief-justice-says-judicial-independence-under-threat-trump-return-looms","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/01/b5632a1c-8bb6-4761-aa7e-ea6b2271ef43_1a649ba1.jpg","video":null,"publish_date":"2024-12-31 23:41:19","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.182},{"id":277426014,"title":"Elon Musk changes his name, profile picture on X after famous comic","text":"Once again, Elon Musk-the oddest tech mogul and infamous serial headline-grabber-move the internet once more this time by changing his X (formerly Twitter) profile to an offbeat display name \"Kekius Maximus\" and uploading an iconic \"Pepe the Frog\" meme as his profile picture. The new profile picture features Pepe decked out in golden armor, gripping a video game controller—a nod to a meme that has long symbolized humor and sarcasm in internet culture. The name \"Kekius Maximus\" runs deeper than it would appear. It's also the nickname of a cryptocurrency token that has been making waves across the market. According to platforms like Ethereum and Solana, the token has recently become popular, and its value surged by nearly 500% in 24 hours, climbing to $0.005667 on December 27. What it means that Musk suddenly embraced \"Kekius Maximus\" is anyone's guess. Adding to the mystery, he teased in a post: \"Kekius Maximus will soon reach level 80 in hardcore PoE,\" a reference to the video game *Path of Exile*. The history of dabbling in cryptocurrencies is long for Elon Musk, and his influence on their value is no secret. In a related twist, U.S. President-elect Donald Trump recently tapped Musk to head the newly created \"Department of Government Efficiency\" (DOGE), a sly nod to the Dogecoin cryptocurrency Musk frequently champions. The department's mission? Streamlining government processes. For Musk, changing his display name isn’t unusual. Fans may recall when, in January 2023, he playfully renamed himself \"Mr. Tweet\" and joked about being unable to revert it. Whether it's memes, cryptos, or government roles, Musk has a knack for keeping people guessing—and talking.","url":"https://www.dnaindia.com/viral/report-elon-musk-changes-his-name-profile-picture-on-x-after-famous-comic-character-it-iselon-musk-changes-his-name-profile-picture-on-x-after-famous-comic-character-it-is-3125046","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2024/12/31/2669555-2591492-elon-musk1-ezgif.com-avif-to-jpg-converter.jpg","video":null,"publish_date":"2024-12-31 23:33:51","author":"Varnika Srivastava","authors":["Varnika Srivastava"],"language":"en","source_country":"in","sentiment":0.291},{"id":277425944,"title":"'Time traveller' predicts short bromance between Elon Musk, Donald Trump in 2025, says, 'there's a","text":"A self-proclaimed time traveller, Drew Curtis, has made bold predictions for the new year, claiming that Elon Musk and Donald Trump’s alliance will not last. Curtis, who went viral for predicting the COVID-19 pandemic, shared his latest forecasts with The US Sun. Curtis suggests that Musk, co-leading President-elect Trump’s Department of Government Efficiency with Vivek Ramaswamy, will soon find himself at odds with the former president. Despite Musk’s recent support for Trump, attending rallies and appearing at Mar-a-Lago, Curtis believes there’s a “near 100% chance that Trump throws Elon under the bus in 2025.” While the aftermath remains uncertain, Curtis predicts Musk won’t handle it lightly. The Tesla CEO, an immigrant himself, has been vocal about his frustrations with the US immigration system, calling it “ridiculously slow & difficult.” Curtis hinted at bigger challenges and opportunities ahead for Musk, including a potential 2028 presidential run if laws change to allow non-native citizens to run. In other predictions, Curtis shared good news for Erik and Lyle Menendez, who are set to return to court on January 30. He believes they may finally gain their freedom next year. Curtis also dismissed fears of World War 3 in 2025, stating, “no one wants in.” While he ruled out a Doomsday scenario, he warned of an intense hurricane season ahead. Known for his cryptic predictions, Curtis’s outlook on 2025 raises curiosity about what lies ahead for some of the most prominent figures in Western politics and society.","url":"https://www.dnaindia.com/world/report-time-traveller-predicts-short-bromance-between-elon-musk-donald-trump-in-2025-says-there-a-near-100-chance-3124990","image":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2024/12/31/2669486-image-2024-12-23t091846.837.jpg","video":null,"publish_date":"2024-12-31 23:33:51","author":"Shivam Verma","authors":["Shivam Verma"],"language":"en","category":"politics","source_country":"in","sentiment":0.334},{"id":277428172,"title":"Steve Bannon Says MAGA Infighting Over H-1B Visas Is Good Thing After Elon Musk Trashed American Workers: 'We're Battle Hardened'","text":"Steve Bannon welcomed growing tensions between the MAGA movement and Elon Musk over immigration policy, particularly regarding the H-1B visa program, calling the \"escalation\" a positive development.On his WarRoom podcast, Bannon criticized Musk's support for the H-1B program, a visa category that allows skilled foreign workers to fill U.S. jobs, arguing it undercuts American workers and goes against President-elect Donald Trump's immigration agenda, Mediaite reported.\"It's unfortunate that things have escalated the way they have escalated, but we'll see,\" fellow Musk critic Laura Loomer said during the discussion.Loomer, who has faced account restrictions on Musk-owned X (formerly Twitter), accused Musk of \"abuse\" toward the MAGA base, citing inflammatory comments such as calling critics \"retarded\" and urging them to \"go f*** yourself in the face.\"Bannon, however, dismissed Musk's insults and took a combative stance, saying, \"I think escalation's good. When an enemy's in retreat, fix bayonets and pursue.\"He added that the MAGA movement has become resilient after years of political conflict. \"We're battle-hardened [after] over a decade of fighting,\" Bannon said. \"People are — hey, it's nothing.\"Bannon has long advocated for the elimination of the H-1B program, while Musk and Republican presidential candidate Vivek Ramaswamy have defended it as a solution to a skills gap in the U.S. workforce.","summary":"Steve Bannon welcomed growing tensions between the MAGA movement and Elon Musk over immigration policy, particularly regarding the H-1B visa program.","url":"https://www.ibtimes.com/steve-bannon-says-maga-infighting-over-h-1b-visas-good-thing-after-elon-musk-trashed-american-3757455","image":"https://d.ibtimes.com/en/full/4572375/steve-bannon-says-maga-infighting-over-h-1b-visas-good.jpg","video":null,"publish_date":"2024-12-31 23:31:09","author":"Morgan Music","authors":["Morgan Music"],"language":"en","source_country":"US","sentiment":-0.228},{"id":277428062,"title":"Fumes in the cockpit prompts Hawaiian flight's return to Seattle","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n 10 Family Calendars And Planners That'll Help You Keep Track Of Everything In The New Year\n\n Our Guide To The Best Elliptical Machines In Canada In 2024 (And Where To Get Them)\n\n The Best Bedding For Cold Canadian Winters\n\n Our Guide To The Best Fondue Machines In Canada In 2024 (And Where To Get Them)\n\n 19 Bestselling Amazon Canada Products Worth Adding To Your Own Cart\n\n 17 Amazon Canada Products That'll Help Keep You Organized\n\n The Clock Is Ticking — Shop These 25 Last-Minute Amazon Prime Gifts Now\n\n If You Have An Amazon Prime Account, These 70+ Crowd-Pleasing Gifts Will Still Arrive Before Christmas\n\n If You Have An Amazon Prime Account, These 50 Brilliant Stocking Stuffers Will Still Arrive Before Christmas\n\n 20 Products Your Dry, Dehydrated Skin Will Thank You For Ordering\n\n 14 Hydrating Face Masks That’ll Save Your Skin This December\n\n 12 Budget-Friendly Products To Add To Your Winter Skincare Routine\n\n From Banana Republic to Reformation: Here Are The Best Boxing Week Deals On Clothing And Accessories\n\n 11 Bestselling Coffee Makers And Espresso Machines You Can Get On Sale Right Now\n\n Don’t Walk, Run! These LEGO Kits Are On Sale For Boxing Day 2024\n\n CTVNews.ca Top Stories\n\n Poilievre's Conservatives end 2024 hitting long-term high in the polls amid Trudeau resignation calls: Nanos\n\n Pierre Poilievre's Conservatives are closing out 2024 hitting a new long-term high in ballot support, with a 26 point advantage over the Liberals amid calls for Prime Minister Justin Trudeau to resign.\n\n WATCH LIVE \n\n WATCH LIVE | \n\n The world begins welcoming 2025 with light shows, embraces and ice plunges\n\n From Sydney to Vladivostok to Mumbai, communities around the world have begun welcoming 2025 with spectacular light shows, embraces and ice plunges.\n\n BREAKING | \n\n Female victim in Calgary double homicide identified as elementary school teacher\n\n Rocky View School Division (RVSD) on Tuesday identified the woman who was murdered Sunday night in Calgary as Ania Kaminski, an elementary school teacher in Cochrane, west of the city.\n\n One arrested following terrifying road rage incident on Hwy. 11 in northern Ont.\n\n Ontario Provincial Police are asking for the public's help in investigating a road rage incident Monday on Highway 11 near Temiskaming Shores.\n\n Telegraph Cove, B.C., fire takes out beloved businesses, parts of boardwalk\n\n The most iconic portion of a picturesque boardwalk in Telegraph Cove, B.C. was destroyed by fire on Tuesday morning.\n\n Woman burned to death inside New York City subway is identified\n\n The woman who died after being set on fire in a New York subway train earlier this month was a 57-year-old from New Jersey, New York City police announced Tuesday.\n\n Xi says no one can stop China's 'reunification' with Taiwan\n\n No one can stop China's \"reunification\" with Taiwan, Chinese President Xi Jinping said in his New Year's speech on Tuesday, laying down a clear warning to what Beijing regards as pro-independence forces within and outside of the island of 23 million people.\n\n France's Macron acknowledges that dissolving parliament in 2024 backfired but celebrates Olympics\n\n French President Emmanuel Macron acknowledged in his New Year’s address to the nation that his decision to dissolve parliament backfired.\n\n Angelina Jolie and Brad Pitt reach divorce settlement after 8 years\n\n Angelina Jolie and Brad Pitt have reached a divorce settlement, ending one of the longest and most contentious divorces in Hollywood history but not every legal issue between the two.\n\n BREAKING | \n\n Female victim in Calgary double homicide identified as elementary school teacher\n\n Rocky View School Division (RVSD) on Tuesday identified the woman who was murdered Sunday night in Calgary as Ania Kaminski, an elementary school teacher in Cochrane, west of the city.\n\n Telegraph Cove, B.C., fire takes out beloved businesses, parts of boardwalk\n\n The most iconic portion of a picturesque boardwalk in Telegraph Cove, B.C. was destroyed by fire on Tuesday morning.\n\n Multiple dead cats found in Winnipeg; police investigating\n\n Winnipeg police are investigating three reports of animal cruelty in the west side of the city.\n\n One arrested following terrifying road rage incident on Hwy. 11 in northern Ont.\n\n Ontario Provincial Police are asking for the public's help in investigating a road rage incident Monday on Highway 11 near Temiskaming Shores.\n\n New Year's Eve: Here's what the weather in Canada will be tonight\n\n New Year's Eve revellers will ring in the arrival of 2025 tonight, but there will be a vast variance in weather conditions across Canada on the final night of the year.\n\n Surfing sea otter clambers onto board in B.C., prompting warning\n\n A sea otter has been seen clambering onto a surfboard and following surfers off Vancouver Island, prompting reminders from Fisheries and Oceans Canada to avoid close interactions with the mammals.\n\n Fumes in the cockpit prompts Hawaiian flight's return to Seattle\n\n A Hawaiian airlines flight bound for Honolulu was forced to return to the Seattle airport shortly after takeoff due to reports of fumes in the cockpit, according to the Federal Aviation Administration.\n\n France's Macron acknowledges that dissolving parliament in 2024 backfired but celebrates Olympics\n\n French President Emmanuel Macron acknowledged in his New Year’s address to the nation that his decision to dissolve parliament backfired.\n\n Panama celebrates the 25th anniversary of the Panama Canal handover as Trump wants to take it back\n\n Panama celebrated the 25th anniversary of the U.S. handover of the Panama Canal, which president-elect Donald Trump has threatened to take back.\n\n Woman burned to death inside New York City subway is identified\n\n The woman who died after being set on fire in a New York subway train earlier this month was a 57-year-old from New Jersey, New York City police announced Tuesday.\n\n The Pentagon chief loses bid to reject 9/11 plea deals\n\n A military appeals court has ruled against Defense Secretary Lloyd Austin's effort to throw out the plea deals reached for Khalid Sheikh Mohammed and two other defendants in the 9/11 attacks, a U.S. official said.\n\n Xi says no one can stop China's 'reunification' with Taiwan\n\n No one can stop China's \"reunification\" with Taiwan, Chinese President Xi Jinping said in his New Year's speech on Tuesday, laying down a clear warning to what Beijing regards as pro-independence forces within and outside of the island of 23 million people.\n\n Poilievre's Conservatives end 2024 hitting long-term high in the polls amid Trudeau resignation calls: Nanos\n\n Pierre Poilievre's Conservatives are closing out 2024 hitting a new long-term high in ballot support, with a 26 point advantage over the Liberals amid calls for Prime Minister Justin Trudeau to resign.\n\n Manitoba premier promises help for small businesses, eyes Trump fallout\n\n Manitoba Premier Wab Kinew is leaving the door open to financial support for people affected by possible tariffs and other actions that may be taken by United States president-elect Donald Trump.\n\n opinion | \n\n Tom Mulcair: Grading Trudeau's performance in 2024, and what's ahead for him in the new year\n\n Prime Minister Justin Trudeau is about to enter the final year of his mandate and, quite possibly, of his political career, writes Tom Mulcair in his column for CTVNews.ca. The former NDP leader takes a snapshot of Trudeau's leadership balance sheet as a way of understanding how he got to where he is in the polls.\n\n B.C. nurse suspended for improper use of Botox, college says\n\n A nurse from B.C.'s Lower Mainland has been given a suspension and reprimand after she was found to have improperly obtained and administered Botox.\n\n 1 in 5 Canadians exposed to high levels of radon inside their homes\n\n Radon, an invisible, odorless and tasteless gas, is being found at dangerously high levels inside homes, affecting 17.8 percent or approximately one in every five Canadians.\n\n 'Vacuum of services': B.C. sexual health clinics at risk of closure\n\n One of Canada’s largest non-profit sexual health organizations is at risk of closing dozens of its clinics due to funding constraints.\n\n Scientists have identified an estimated 10% of all species on Earth. Here’s what they found in 2024\n\n A toothy toadstool. A vegetarian piranha with a distinctive mark. And a pygmy pipehorse floating in the Indian Ocean shallows. These wild wonders were among the hundreds of previously unknown species of animals, plants and fungi that scientists named and described for the first time in 2024.\n\n Venezuela's top court issues TikTok US$10M fine over allegedly deadly video challenges\n\n Venezuela’s Supreme Court on Monday issued a US$10 million fine against TikTok for “not implementing measures” to prevent viral video challenges that have allegedly led to the deaths of three Venezuelan children recently.\n\n Losing your kids to doom scrolling? Greece is building a government app for that\n\n Greece announced plans on Monday to enhance parental oversight of mobile devices in 2025 through a government-operated app, that will help get digital age verification and browsing controls.\n\n Entertainment \n\n Aaron Brown, former CNN anchor and influential newsman, dies at 76\n\n Aaron Brown, the renowned CNN anchor who gained prominence for his coverage of the September 11 attacks, died Sunday at 76.\n\n Kate Beckinsale says Blake Lively's complaint shows how social media can be weaponized to 'foment hatred against actresses'\n\n The controversy between Blake Lively and Justin Baldoni has Kate Beckinsale reflecting on her own professional experiences.\n\n The comic book industry has nearly died before. Some artists fear AI will kill it\n\n It may surprise some people unfamiliar with the comic book industry, with its multibillion-dollar movie tie-ins, that it’s been on the verge of collapse multiple times over the decades. Now AI tools are adding new fears of a death knell.\n\n Stock market today: Wall Street indexes drift higher into the close of another record-breaking year\n\n U.S. stock indexes were drifting higher in early trading Tuesday as Wall Street closes out another milestone-shattering year of gains.\n\n New year, new budget: A step-by-step guide on how to refresh your finances\n\n A simple copy and paste of your 2024 budget isn't enough to help you achieve your goals and maximize your finances for the new year, experts say.\n\n 'There's a lot of uncertainty': Some Toronto businesses anxious about Trump's tariff threat\n\n Looking to expand into the U.S., Dani Kagan says she's concerned that incoming president Donald Trump's threat of a 25 per cent tariff on Canadian goods could stifle growth for local businesses.\n\n Lifestyle \n\n The ancient origins of New Year’s resolutions and how the tradition has changed\n\n The prospect of rising from the fog of holiday hustle, bustle and feasts to contemplate how to do better next year is welcomed by many, and resented by others.\n\n It's called the 'Winter Arc.' And for some, it's replacing New Year's resolutions\n\n In an attempt to reframe the thinking around new year goal-setting, a new wellness trend has popped up online called the 'Winter Arc.'\n\n 10 of the best places for New Year's Eve fireworks, parties and more\n\n From Australia to the Americas, check out 10 of the top cities to visit if you love New Year’s Eve fireworks and parties.\n\n Canadian tennis star Gabriela Dabrowski played season after cancer surgery\n\n Canadian tennis star Gabriela Dabrowski revealed Tuesday that she underwent two surgeries to treat breast cancer following a diagnosis in April.\n\n Kampf, Lorentz and Tavares score for Maple Leafs in 3-1 win over Islanders\n\n David Kampf, Steven Lorentz and John Tavares scored to lead the Toronto Maple Leafs to a 3-1 victory over the New York Islanders on Tuesday afternoon at Scotiabank Arena.\n\n Running a marathon a day in 2024, she has a world record within her grasp\n\n Finally coming to a halt on the last day of 2024, Belgian ultra runner Hilde Dosogne felt she had done all to take the world record as the first woman to run a marathon every single day of the year.\n\n Suzuki Motor former boss who turned the minicar maker into a global player dies at 94\n\n Osamu Suzuki, the charismatic former boss of Suzuki Motor Corp. who helped turn the Japanese mini-vehicle maker into a globally competitive company, has died, the company said Friday. He was 94.\n\n More drivers opt for personalized plates in Sask. — and behind every one there's a story\n\n You may have noticed a few more vanity plates on Saskatchewan roads in recent years, and every one of them comes with a personal story.\n\n Nissan and Honda to attempt a merger that would create the world's No. 3 automaker\n\n Japanese automakers Honda and Nissan have announced plans to work toward a merger that would form the world's third-largest automaker by sales, as the industry undergoes dramatic changes in its transition away from fossil fuels.\n\n Local Spotlight \n\n Louis Riel depicted as Lego figure\n\n A first-of-its-kind figurine is paying tribute to the founder of Manitoba.\n\n 'I always loved dancing': Winnipeg dancer, 102, takes stage during Nutcracker production\n\n An esteemed Winnipeg dancer graced the stage once again last week, more than eight decades after her debut.\n\n Community partners in Windsor propose education campaign to veer people away from payday loans\n\n In a move aimed at combatting the financial strain caused by payday loans, the City of Windsor is considering the launch of a comprehensive education campaign to promote alternative financial options.\n\n Port Elgin, Ont. woman named Canada's Favourite Crossing Guard\n\n A Port Elgin woman has been named one of three of Canada’s Favourite Crossing Guards in a recent contest.\n\n 'Something that connected us all': For 53 years, Sask. family celebrates holidays with street hockey game\n\n For over 50 years, Stephen Lentzos and his family have celebrated Christmas Day with a street hockey game.\n\n 43-quintillion combinations: Speedcubers solve Rubik's Cubes in record breaking times\n\n On Saturday, Barrie is testing the abilities of some of the fastest cube solvers from across the province and around the world.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Ho! Ho! HOLY that's cold! Montreal boogie boarder in Santa suit hits St. Lawrence waters\n\n Montreal body surfer Carlos Hebert-Plante boogie boards all year round, and donned a Santa Claus suit to hit the water on Christmas Day in -14 degree Celsius weather.\n\n Teen cancer patient pays forward Make-A-Wish donation to local fire department\n\n A 16-year-old cancer patient from Hemmingford, Que. decided to donate his Make-A-Wish Foundation gift to the local fire department rather than use it himself.\n\n Vancouver \n\n Telegraph Cove, B.C., fire takes out beloved businesses, parts of boardwalk\n\n The most iconic portion of a picturesque boardwalk in Telegraph Cove, B.C. was destroyed by fire on Tuesday morning.\n\n Surfing sea otter clambers onto board in B.C., prompting warning\n\n A sea otter has been seen clambering onto a surfboard and following surfers off Vancouver Island, prompting reminders from Fisheries and Oceans Canada to avoid close interactions with the mammals.\n\n More road checks, police patrols in Vancouver this New Year's Eve\n\n Vancouver police are reminding New Year's Eve revellers to party responsibly on Tuesday night – particularly if they're thinking about getting behind the wheel.\n\n Oshawa shooting leaves one person dead\n\n One person is dead after a shooting in Oshawa on Tuesday.\n\n De Villa signs off as Toronto’s top doctor with New Year’s prescription for ‘unity’\n\n Dr. Eileen de Villa is offering some parting words of wisdom for the city on her last day on the job as Toronto’s top doctor.\n\n New Ontario laws and regulations coming into effect in 2025. Here's what you need to know.\n\n Several new laws and regulations in Ontario are taking effect this new year. Here's what residents in the province need to know.\n\n BREAKING | \n\n Female victim in Calgary double homicide identified as elementary school teacher\n\n Rocky View School Division (RVSD) on Tuesday identified the woman who was murdered Sunday night in Calgary as Ania Kaminski, an elementary school teacher in Cochrane, west of the city.\n\n 'Grateful is an understatement': Calgary family thanks community for help after townhome destroyed\n\n One of the Calgary families who lost everything in an October explosion is thanking the community for a holiday season to remember.\n\n Fireworks, drone show and balloon drops: NYE 2025 fun for all ages in Calgary\n\n Fireworks, a skating party and stilt-walkers at Prince's Island Park are all part of a city party that will celebrate the arrival of 2025 in Calgary.\n\n Things to do in Ottawa on New Year’s Eve and New Year’s Day\n\n CTVNewsOttawa.ca looks at things to do in Ottawa on New Year’s Eve and New Year’s Day.\n\n Ottawa police chief says he's 'optimistic' about future of ByWard Market in year-end interview\n\n 2024 proved to be an impactful and at times tumultuous year for the Ottawa Police Service.\n\n What's open and closed in Ottawa over the holidays\n\n CTVNewsOttawa.ca takes a look at what's open and closed over the Christmas and New Year's holidays this year.\n\n Here’s how to celebrate New Year's Eve for free in Montreal and Quebec City\n\n To celebrate the New Year, a number of artists will be taking to outdoor stages in Montreal and Quebec City on Tuesday to offer free shows to the public.\n\n Quebec heritage site, former home of renowned artist, destroyed by fire\n\n A Quebec heritage site on the Island of Montreal that was the former home of a renowned artist has been destroyed in a fire.\n\n Montreal shelters turning people away on New Year's Eve\n\n On the eve of a new year, Montreal’s homeless shelters are overflowing and turning people away. Advocates want to see a change in the new year.\n\n Fireworks, waterparks and horse-drawn carriages: Here are New Year's Eve events happening in Edmonton\n\n With Christmas 2024 in the books, there's only one more holiday for families to enjoy before opening the 2025 cat calendar you received from a distant relative: New Year's Eve.\n\n How this Edmonton family of 7 spends $700 a month on groceries and gas\n\n The high cost of food can be highly demanding on a family's monthly budget. However, a St. Albert family of seven has found a way to reduce their spending.\n\n Oilers look to limit losing skid on New Year's Eve vs. Utah\n\n The Edmonton Oilers remember their first time playing the Utah Hockey Club – a hard-fought overtime win a month ago – and also know they're coming off their first set of back-to-back losses since mid-November. Combine that with Utah's loss late last night in Seattle and the heat's on the Oilers to keep their brief skid from turning into a longer slide Tuesday night (7 p.m.) against the Salt Lake City-based team.\n\n Two males confirmed dead after vehicle pulled from Moncton creek\n\n Two men are dead following a crash in a creek in Moncton, N.B., Tuesday morning.\n\n Woman struck by vehicle in Moncton plaza parking lot\n\n A woman was sent to hospital with serious injuries Friday morning after a vehicle allegedly struck her in the parking lot of a Moncton shopping centre.\n\n N.S. premier looks ahead to 2025 with strong legislative majority\n\n Nova Scotia Premier Tim Houston looks back on the major events in the province in 2024.\n\n Multiple dead cats found in Winnipeg; police investigating\n\n Winnipeg police are investigating three reports of animal cruelty in the west side of the city.\n\n Injunction granted against protesters in LeMay Forest amid ongoing development\n\n A Manitoba judge has granted an injunction against a group protesting the clearing of a Winnipeg forest to build a development.\n\n River Trail rebound: Portion of trail at The Forks now open, fifth time opening in December since 2008\n\n The first portion of the Nestaweya River Trail has opened.\n\n A record tornado and a solar eclipse: Here are CTV Regina's top weather stories of 2024\n\n Weather is always a conversation starter for many in Saskatchewan. The province with 'Land of Living Skies' written on its licence plate often makes that conversation easy - with severe, interesting or rare weather phenomenon occurring.\n\n Sask. village loses only grocery store due to fire\n\n A locally owned grocery store has burned down in the Village of Pelly, Sask.\n\n Saskatchewan Science Centre celebrates early New Year's with a bang\n\n Noon Year's Eve returned to the Saskatchewan Science Centre on Tuesday.\n\n Kitchener \n\n Progress or band-aid solution? Community weighs in on Guelph’s downtown drug crackdown\n\n Downtown Guelph continues to be the focal point for concerns about drug use and its impact on local businesses.\n\n Driver charged after hitting Harvey's in Waterloo\n\n A driver has been charged after a vehicle crashed into a fast food restaurant in Waterloo.\n\n New Ontario laws and regulations coming into effect in 2025. Here's what you need to know.\n\n Several new laws and regulations in Ontario are taking effect this new year. Here's what residents in the province need to know.\n\n Saskatoon \n\n SGI, advocates remind people to plan a safe ride home this New Years Eve\n\n Advocates against impaired driving are reminding people to find a safe ride home this New Years Eve.\n\n Premier Scott Moe is ending his year on the nice list, Canadian Taxpayers Federation says\n\n Santa may be on a much-needed vacation, but Scott Moe is ending his year on the nice list.\n\n Saskatoon's Medavie paramedics saw another record year for emergency calls\n\n Saskatoon paramedics responded to a record number of emergency calls this year, yet again, although they say the increase is smaller than in recent years.\n\n Northern Ontario \n\n One arrested following terrifying road rage incident on Hwy. 11 in northern Ont.\n\n Ontario Provincial Police are asking for the public's help in investigating a road rage incident Monday on Highway 11 near Temiskaming Shores.\n\n Vigil planned for drowning victims in Temiskaming Shores, Ont.\n\n A vigil will be held this evening in New Liskeard for a father and daughter who drowned Dec. 29 at Pete's Dam Park in the community of Temiskaming Shores.\n\n Poilievre's Conservatives end 2024 hitting long-term high in the polls amid Trudeau resignation calls: Nanos\n\n Pierre Poilievre's Conservatives are closing out 2024 hitting a new long-term high in ballot support, with a 26 point advantage over the Liberals amid calls for Prime Minister Justin Trudeau to resign.\n\n Highbury Ave. collision sends one to hospital with serious injuries\n\n Emergency crews were called to a motor vehicle collision in the area of Highbury Avenue and Huron Street at around 5:00 p.m. on Tuesday evening.\n\n Pedestrian dies of injuries sustained in Dec. 9 collision\n\n A collision between a vehicle and pedestrian at the intersection of Adelaide Street north and Huron Street on Dec. 9 has proved fatal.\n\n In spite of milder weather, the slopes at Boler Mountain remain in full swing\n\n A spell of warm winter weather melted away a lot of the snow in London this week, but that hasn’t stopped Boler Mountain from keeping its hills running.\n\n Motorists passing collision charged with distracted driving\n\n Several motorists face charges after a pickup truck rolled into a ditch in Collingwood on Tuesday, including two drivers who weren’t involved in the crash.\n\n Here's what OPP wants you to know about a new scam targeting drivers\n\n Provincial police say there is a growing trend of fraudsters attempting to cash in on municipalities using automated photo radar programs to scam drivers through text messages.\n\n Midland man accused of attempted murder, fleeing R.I.D.E. program denied bail\n\n A 25-year-old Midland man accused of attempted murder related to an alleged hit-and-run over the summer is back behind bars after being arrested over the holidays while out on bail.\n\n Fire confirmed fatal at 920 Ouellette Ave\n\n Windsor fire officials confirm there has been another fatal fire in the city.\n\n Windsor city councillors divided over $20M proposal for Festival Plaza redevelopment\n\n The Riverfront Festival Plaza in Windsor may be on the verge of a major transformation, with city council set to debate a $20-million redevelopment plan at its first meeting of the new year.\n\n Smoke alarm not functioning in fatal Sandwich fire: officials\n\n Windsor fire officials say a smoke alarm was not functioning in a fatal fire on Sandwich Street.\n\n Vancouver Island \n\n Telegraph Cove, B.C., fire takes out beloved businesses, parts of boardwalk\n\n The most iconic portion of a picturesque boardwalk in Telegraph Cove, B.C. was destroyed by fire on Tuesday morning.\n\n Surfing sea otter clambers onto board in B.C., prompting warning\n\n A sea otter has been seen clambering onto a surfboard and following surfers off Vancouver Island, prompting reminders from Fisheries and Oceans Canada to avoid close interactions with the mammals.\n\n West Shore RCMP seeking witnesses to Christmas Eve hit-and-run, assault\n\n Police in Greater Victoria are looking for witnesses to a Christmas Eve hit-and-run and assault.\n\n B.C. team building 100 beaver 'starter homes' in the name of wetland preservation\n\n More than 70 manmade beaver dams have been installed in Interior waterways since the B.C. Wildlife Federation project launched last year with the goal of building 100 dams by the end of 2025.\n\n B.C. man charged with drug trafficking and weapons offences after CBSA investigation\n\n A resident of B.C.'s Interior has been charged with weapon and drug trafficking offences after an investigation launched by border agents at Vancouver International Airport earlier this year.\n\n B.C woman awarded nearly $750K in court case against contractor\n\n A B.C. woman has been awarded nearly $750,000 in damages in a dispute with a contractor who strung her along for a year and a half and failed to complete a renovation, according to a recent court decision.\n\n Lethbridge \n\n Investigation underway after theft at helium recovery facility near Brooks, Alta.\n\n Brooks RCMP are investigating a robbery at the Royal Helium Recovery Production facility that took place on Christmas Eve.\n\n Lethbridge-West byelection results officially confirmed by Elections Alberta\n\n Elections Alberta officially confirmed the results of the recent Lethbridge-West provincial byelection, declaring a win for NDP candidate Rob Miyashiro.\n\n Hiker hospitalized after serious fall south of Lethbridge\n\n A hiker is lucky to be alive after a serious fall over the weekend just southwest of Lethbridge.\n\n Sault Ste. Marie \n\n Impaired drivers end up in the ditch on Manitoulin Island\n\n Two recent impaired driving cases on Manitoulin Island left two drivers in the ditch, both facing multiple charges.\n\n Sault suspect charged with threatening clerk with screwdriver, stealing cash\n\n A 29-year-old suspect has been charged after a robbery on Queen Street West on Sunday morning.\n\n Police presence on Cathcart Street in the Sault is over, no charges expected\n\n A heavy police in the 200 block of Cathcart Street in Sault Ste. Marie has ended, police said Monday afternoon.\n\n Labradorians pay thousands to fly to Newfoundland. Could a Quebec energy deal help?\n\n An airport executive in Labrador hopes a new energy deal with Quebec could help attract a competing airline company to the northern region, where flights costs have climbed at more than three times the national rate.\n\n Icebreaker on hand in Labrador to guide season's last freight arrivals by ferry\n\n A Canadian Coast Guard icebreaker is in central Labrador until Saturday to guide the Kamutik W ferry on its last freight deliveries of the season.\n\n Whooping cough in Canada: Outbreaks or case increases reported in these provinces\n\n Canadian health officials say they're seeing spikes in whooping cough cases in parts of the country as the U.S. deals with case numbers not seen in more than a decade.\n\n Stay Connected","summary":"A Hawaiian airlines flight bound for Honolulu was forced to return to the Seattle airport shortly after takeoff due to reports of fumes in the cockpit, according to the Federal Aviation Administration.","url":"https://www.ctvnews.ca/world/fumes-in-the-cockpit-prompts-hawaiian-flight-s-return-to-seattle-1.7161752","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/31/fumes-in-cockpit-force-flight-to-land-1-7161753-1735687123430.jpg","video":null,"publish_date":"2024-12-31 23:25:14","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"ca","sentiment":0.288},{"id":277423986,"title":"US Stocks Slide in Final Trading Session of 2024","text":"Wall Street closed out a record-breaking year on Tuesday with a mixed performance with stocks sliding in the final trading session of 2024.Why It MattersDespite some December losses that have pared back the year's gains, Wall Street has had a record-breaking year. The S&P 500 slipped 0.4 percent to cap a stellar year, gaining 23.3 percent overall and marking its second consecutive year of 20 percent-plus growth, a feat not seen since 1998.This comes after Wall Street rallied with a strong performance in a holiday-shortened trading session last Tuesday that was led by the technology sector.This seasonal rally, often referred to as the \"Santa rally,\" has historically delivered average gains of 1.3 percent over the final five trading days of the year and the first two of the new year. Analysts say this period often sets a tone for January and the coming year.What To KnowThe Dow Jones Industrial Average ticked down 0.1 percent, while the tech-heavy Nasdaq shed 0.9 percent, still boasting a remarkable annual gain of 28.6 percent. The Dow, with less exposure to technology, grew by a solid 12.9 percent over the year.The rally was propelled by a thriving economy, robust consumer spending and a strong job market. Companies like Nvidia and Super Micro Computer, driven by soaring demand in artificial intelligence, were at the forefront of the market's momentum.Corporate earnings also played a crucial role with S&P 500 companies projected to deliver a broad earnings growth of over 9 percent, according to FactSet.Meanwhile, fears of an imminent recession dissipated as the U.S. economy navigated higher interest rates without faltering.Tech StocksOn the last trading day of 2024, technology stocks weighed on markets. Semiconductor giant Nvidia dropped 2.3 percent, while Apple and AMD slipped 0.7 percent and 1.3 percent, respectively.However, Energy stocks offered some relief, with Exxon Mobil and Chevron posting gains of 1.7 percent and 1.2 percent.Despite the S&P 500's decline of 25.31 points to close at 5,881.63, the year's results left investors optimistic.Inflation, Rate Cuts And Tariff TensionsWall Street found renewed optimism as inflation receded closer to the Federal Reserve's 2 percent target, spurring hopes for more interest rate cuts.However, the Fed adopted a more cautious tone heading into 2025 with inflation still stubborn in certain sectors and new policy uncertainties as President-elect Donald Trump prepares for office. Trump's proposed tariff hikes have raised concerns about potential inflationary pressures in the coming year.What People Are SayingSam Stovall, chief investment strategist at CFRA, told The Associated Press that the stock market's record-breaking turn in 2024 was \"certainly much better that what most people on Wall Street, myself included, thought we would get this year,\" adding, \"Historically, a negative Santa Claus rally still resulted in an average gain of almost 6% in the subsequent year.Michael Hartnett, chief investment strategist at BofA Global Research, previously noted that economic optimism—based on expectations for economic growth and other indicators—is now at its highest level since August 2021, another signal that sentiment might be overheated.What Happens NextMarkets will pause for the New Year's Day holiday and resume on Thursday with updates on U.S. construction spending and manufacturing data.Wall Street will also be closed on January 9 to observe a National Day of Mourning to honor former President Jimmy Carter, who passed away on Sunday at age 100.This article includes reporting from The Associated Press.","summary":"Despite some December losses that have pared back the year's gains, Wall Street has had a record-breaking year.","url":"https://www.newsweek.com/us-stocks-slide-final-trading-session-2024-2008191","image":"https://d.newsweek.com/en/full/2554235/new-york-stock-exchange.jpg","video":null,"publish_date":"2024-12-31 23:19:35","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","source_country":"US","sentiment":0.198},{"id":277423584,"title":"Starmer hails ‘year of change’ as he delivers first New Year message as prime minister, with plan for ‘more cash in your pocket’ in 2025","text":"Sir Keir Starmer has hailed 2024 as a “year of change” as he shared his first New Year message as prime minister.\n\nBut the Labour leader, who took office after a staggering general election victory over the Conservatives in July, admitted there is “still so much more to do” in 2025.\n\nIt will include a plan to make sure there will be “more cash in your pocket”, as well as a raft of other initiatives for “change”.\n\nAlmost six months into the prime minister’s time in Downing Street, Sir Keir is battling criticisms of his party’s management of the economy and the direction in which he is taking the country.\n\nDespite this, the Labour leader’s New Year message largely takes an optimistic tone, celebrating a “year of changing Britain for the better” and looking forward to a “fight for change” that will define “every waking hour of this government”.\n\nThe prime minister also takes a moment to joke that his mantra of “change” didn’t extend to football in 2024, lamenting “another agonisingly close shave for England” in the Euros final.\n\nHe said: “But change in politics, with the election of this Labour government in July. And more importantly, with the work of change that we have begun.\n\n“The minimum wage will be raised by a record amount. Wages are up more broadly. Returns of foreign national criminals – up 20%. Billions of pounds worth of new projects in clean British energy making our country more secure. And over £25bn invested in our NHS starting to cut waiting lists in your local hospital.\n\n“Now, I know there is still so much more to do. And that for many people it’s hard to think about the future when you spend all of your time fighting to get through the week.\n\n“So I want to be clear. Until you can look forward and believe in the promise and the prosperity of Britain again, then this government will fight for you.”\n\nThe prime minister says this “fight for change” will “define this year, next year, and indeed – every waking hour of this government”.\n\nRead more from Sky News:Labour would lose 200 seats if election held today, poll saysMayor of London honoured in New Year list\n\nHe mentions his “Plan for Change”, vowing to focus on a “year of rebuilding” for the country – and “rediscovering the great nation that we are”.\n\n“We have a clear plan for change: 1.5 million new homes – restoring the dream of home ownership; children starting school, ready to learn; a more secure energy system; waiting lists cut dramatically; immigration – reduced; neighbourhood police, tackling anti-social behaviour in every community; and more cash in your pocket, wherever you live,” Sir Keir explains.\n\n“A nation that gets things done. No matter how hard or tough the circumstances.\n\n“We will have time to reflect on that this year. A chance, with the 80th anniversary of VE and VJ day, to cherish the greatest victories of this country. And the greatest generation that achieved it.\n\n“But that victory – and indeed the peace and the prosperity that followed – all rested on that same foundation we must rebuild today.\n\n“The security of working people. That is the purpose of this government. The goal of our Plan for Change. And we will push it forward in 2025.”\n\nThe prime minister concludes: “Here’s to a year of changing Britain for the better.”\n\nSir Ed Davey, the leader of the Liberal Democrats, has also shared his New Year message.\n\nHe has called on Labour to “be much bolder” to deliver “real change” and tackle the challenges facing the UK in 2025.\n\nThe Lib Dem leader also used his New Year message to claim instability and insecurity around the world has been “made worse” by Donald Trump’s re-election in the US.\n\nSir Ed is looking forward to the next year with “genuine hope”, he will say, as the UK has “the people, the grit, the talent, the businesses – and the right values, to change things for the better”.\n\nMeanwhile, Reform UK leader Nigel Farage said in his message that the UK has been “appallingly led” for several decades.\n\nHe said: “We’re in societal decline, we’re in economic decline, most people are getting poorer with every year that passes, we’re losing any sense of national identity and we’re actually teaching kids at school that people like Winston Churchill – born in this palace – are bad people and that our country’s history is something to be ashamed of.”\n\nMr Farage said Reform’s campaigning will include calls for “proper border controls” and to reduce the cost of living.","summary":"Sir Keir Starmer has hailed 2024 as a &#8220;year of change&#8221; as he shared his first New Year message as prime minister. But the Labour leader, who took office after a staggering general election victory over the Conservatives in July, admitted there is &#8220;still so much more to do&#8221; in 2025. It will include a &#8230;\n\n\nThe post Starmer hails &#8216;year of change&#8217; as he delivers first New Year message as prime minister, with plan for &#8216;more cash in your pocket&#8217; in 2025 appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/starmer-hails-year-of-change-as-he-delivers-first-new-year-message-as-prime-minister-with-plan-for-more-cash-in-your-pocket-in-2025/","image":"https://e3.365dm.com/24/12/1600x900/skynews-keir-starmer-downing-street_6779368.jpg?20241218113332","video":null,"publish_date":"2024-12-31 23:12:08","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.105},{"id":277423316,"title":"2025: Who needs a crystal ball?","text":"With the clock slowly ticking as humanity makes the final approach into the new year, one can only imagine the bucket list of supplications that would be dumped in heaven’s gate in the year that one lone individual – Donald Trump – has promised will be defined, strictly, by himself alone. With his inauguration barely three weeks away, Trump, courtesy of his MAGA/America First doctrine, has sufficiently served notice that the year, either for good or for bad, will be like no other –in global trade, diplomacy or immigration for America and the world.\n\nTake this example: Trump in his ruffling showmanship thinks Panama Canal could well be America’s to be taken at his whim: “Merry Christmas to all, including to the wonderful soldiers of China, who are lovingly, but illegally, operating the Panama Canal,” the US president-elect had posted in his cryptic Christmas message – adding “Welcome to the United States Canal!”\n\nNot done, he actually thinks Canada should be America’s 51st state with its prime minister, Justin Trudeau as “governor” so he could better harvest the boundless prospects of his Greater America.\n\nAnd then his remaining nemesis, China, which he conceives as the beast; he insists that the Orientals need to be brought down by punitive tariffs so his America – his White America, could relive the once great dream. As for the rest of the world, they could as well stew in their juices at least to the extent they do nothing to imperil his empire’s grand ambitions. It is after all, Trump’s world.\n\nI wager that such far-flung issues will be the last thing in the mind of Nigerians as they troop to their religious houses as they are wont to do in the annual ritual of countdown. Surely, there must be far more immediate things on their plate – from the monstrous principalities of hunger, the ravaging inflation, not least the engulfing atmosphere of insecurity, than the overblown anxieties over the now-familiar eccentricities of America’s wayward returnee-president.\n\nRead Also: Presidency blasts Bauchi governor over remarks on Tinubu\n\nHowever, if one understands those last minute sieges on religious houses by Nigerians as an intrinsic element of transition; the army of religious leaders of every shape and hue ever so available and so eager to cash out on the anxieties through hare-brained prophecies can only be part of troubling culture of citizens’ penchant to outsource their responsibilities.\n\nNigerians had better watch out for them as things are already bad enough without the cheap, opportunistic zealots needlessly raising their hopes, (which is not necessarily a bad thing so long as these are grounded in plausibility and undergirded by the lessons on hard work), and stoking their fears.\n\nHours into 2025, a section of Nigerians, ever so implacable, could easily write a book about the hardships in the 12 months and how the Tinubu reforms have compounded the pains of the people. If they have not succeeded in painting the past – the same past they only a while ago decried – in glowing colours solely on the grounds that the man running the show, Bola Ahmed Tinubu, is the one they would love to hate, it has not been for a lack of organised effort. In their efforts to de-market the administration and its policies, they have left little to imagination.\n\nFor a Bola Tinubu administration that neither pretended that the pains of adjustment would be easy, nor that the problems that have endured for decades would lend to quick-fixes, what we have seen, largely from its army of critics, are the same wearisome fixations with tired orthodoxies that created the mess in the first place. Even those who agree that the reforms being undertaken by the Tinubu administration was not only inevitable but necessary, merely argue that only they could do a good job of it.\n\nTake Peter Obi, the Labour Party candidate in the 2023 presidential elections. Asked on a television programme as to what he would do differently on the subsidy issue, the same individual, who had earlier depicted the oil subsidy as organised crime with a pledge not to allow it beyond the first day of his presidency, could only mouth some incomprehensible mumbo-jumbo of an ‘immediate-effect palliative pills’ to be administered on his first day in office to cushion its pains! Talk of political opportunism having no better name or description!\n\nThe same with the ongoing tax reforms; the vocal few sworn to oppose the four bills have since told Nigerians that they couldn’t be bothered to read it! They would rather have the proposals killed before the benefits of appearance on the floors of the parliament.\n\nIn the books of the man leading the charge, Senator Ali Ndume, the gadfly from Borno, leadership, a la democracy, is doing what the people want, simplicita! In other words, it is not about doing what is good for the people!\n\nSummary: President Bola Tinubu should be leading from behind on a major pillar of his administration’s reform agenda if only to convince his ilk that he, the president is a democrat! Coming from an individual who has been in parliament in the entire life of the current republic, it is sadly a reflection of how unschooled he appears to be on the subject of leadership.\n\nThis obviously takes us to the prognosis of the coming year. That the outgoing year has been a particularly difficult one is no exaggeration. In the same vein, it is neither useful nor does it make sense for anyone to understate the enormity of the challenges awaiting Nigerians in the coming year. Without any doubt, there is a lot to be concerned about. The revenue side, for instance, might seem encouraging but so also has the debt been growing. While it might well be the case that Nigeria has no debt but revenue problem, the managers of the economy will certainly will do well do pay attention to its management.\n\nThe other is the monstrosity called inflation. Again, if I understand Yemi Cardoso and company at the Central Bank of Nigeria (CBN) so well, it has to be fought ruthlessly. However, much as the CBN is already doing a yeoman’s job to tame the monster, the problem, particularly the food component of it, would appear far more than the monetary tools can effectively wrestle. This is where the federal government needs to do more. The current expectation of bumper harvests is no doubt a good testimonial to the efforts to stabilise the food inflation. Yet, one must hasten to add the other lacuna that has remained somewhat intractable is a reliable and efficient system of logistics on which our hordes of farmers can count on. Clearly, if Lord Frederick Lugard understood this imperative in the last century, one finds it hard to understand why successive governments could not understand its place in the scheme of things.\n\nHere’s my candid advice on the matter: our old, disused rail network might seem obsolete for moving people in this day and age; there can be no denying its utility in moving cattle and produce particularly in the circumstances that the country has found itself. With good thinking, right investment and proper management, Nigerians might yet discover the gold on those old tracks.\n\n Here’s wishing Nigerians a happy new year!","url":"https://thenationonlineng.net/2025-who-needs-a-crystal-ball/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2024/02/06165614/Trump.webp","video":null,"publish_date":"2024-12-31 23:10:51","author":"Sanya Oni","authors":["Sanya Oni"],"language":"en","source_country":"ng","sentiment":0.055},{"id":277422760,"title":"New Jersey Offshore Wind Project Faces Another Delay","text":"A New Jersey offshore wind project is requesting a second delay on its plans to develop a wind farm, citing ongoing difficulties in securing a manufacturer for key turbine components.Why It MattersLeading Light Wind, an American-founded initiative, requested a pause from the New Jersey Board of Public Utilities (BPU) on its plans to develop a wind farm off Long Beach Island.This is not the first delay the project has faced as a similar situation was reported in September. Critics of offshore wind projects have pointed to the latest delay request as further evidence of the industry's economic challenges, particularly as President-elect Donald Trump, a vocal opponent of offshore wind, prepares to return to the White House.What To KnowLeading Light Wind previously secured a delay from the New Jersey Board of Public Utilities, which recognized the project's challenges in finding a manufacturer for the turbine blades needed to generate electricity.The initial pause expired on December 20, but a day earlier, Leading Light Wind requested an extension from the board, seeking to push the deadline to May 20.While the company did not explicitly cite difficulties in securing a blade manufacturer for the second delay, its latest request pointed to ongoing challenges in the offshore wind equipment market.\"The offshore wind equipment market continues to experience significant price volatility, and the company has not yet identified a solution to that volatility,\" the request said.The company did not respond to questions from The Associated Press on Monday and Tuesday regarding whether the search for a blade manufacturer is central to its latest delay request.Offshore Wind ProjectsThe project, a collaboration between Chicago-based Invenergy and New York-based energyRE, aims to construct up to 100 turbines roughly 40 miles off Long Beach Island, with the capacity to power one million homes.Leading Light was among two offshore wind projects selected by the New Jersey Board of Public Utilities in January 2024. However, just three weeks later, GE Vernova, one of the three major turbine manufacturers, announced it would not produce the type of turbine planned for the project, according to a public filing.Invenergy stated that a turbine model from Vestas was deemed incompatible with the project, while Siemens Gamesa Renewable Energy, the remaining manufacturer, informed the company in June of a price hike for its turbines.Invenergy emphasized its commitment to the project, noting it has already invested millions of dollars. The company is also obligated to contribute $105 million toward the construction of a monopile manufacturing facility in Paulsboro, which will produce the tower-like foundations for the wind turbines.What People Are SayingIn a statement, Wes Jacobs, the project director said: \"This additional time will allow us to continue to navigate ongoing market shifts and supply chain challenges, as we work to advance development of this important project for New Jersey.\"Protect Our Coast NJ issued a statement saying: \"We can only draw one logical conclusion: the Trump administration threatens the lifeblood of the offshore wind industry, namely, large government subsidies and less regulation.\"What's NextThe board has not provided a timeline for when it will review the request.This article includes reporting from The Associated Press.","summary":"Leading Light Wind requested a second delay on its plans to develop a wind farm.","url":"https://www.newsweek.com/new-jersey-offshore-wind-turbine-project-delay-2008190","image":"https://d.newsweek.com/en/full/2554225/wind-turbine.jpg","video":null,"publish_date":"2024-12-31 23:07:55","author":"Matthew Impelli","authors":["Matthew Impelli"],"language":"en","source_country":"US","sentiment":-0.419},{"id":277422234,"title":"Brace for turbulence","text":"LONDON (AP) – When voters around the globe had their say in 2024, their message was often: “You’re fired”.\n\nSome 70 countries that are home to half the world’s population held elections this year, and in many incumbents were punished. From India and the United States (US) to Japan, France and Britain, voters tired of economic disruption and global instability rejected sitting governments – and sometimes turned to disruptive outsiders.\n\nThe rocky democratic landscape just seemed to get bumpier as a dramatic year careened toward its end, with mass protests in Mozambique and Georgia, an election annulled in Romania.\n\nProfessor of International Affairs at the University of Georgia Cas Mudde who studies extremism and democracy, summed up 2024 in Prospect magazine as “a great year for the far right, a terrible year for incumbents and a troublesome year for democracy around the world”.\n\nINCUMBENTS BATTERED\n\nOne message sent by voters in 2024: They’re fed up.\n\nUniversity of Manchester political scientist Rob Ford has attributed the anti-incumbent mood to “electoral long COVID” – lingering pandemic-related health, education, social and economic disruptions that have made millions of people unhappier and worse off. High inflation and mass displacement from that war and conflicts have added to the global unease.\n\nIn South Africa, high unemployment and inequality helped drive a dramatic loss of support for the African National Congress, which had governed for three decades since the end of the apartheid system of white minority rule. \n\nThe party once led by Nelson Mandela lost its political dominance in May’s election and was forced to go into coalition with opposition parties.\n\nIncumbents also were defeated in Senegal, Ghana and Botswana, where voters ousted the party that had been in power for 58 years since independence from Britain. Namibia’s ruling SWAPO party extended its 34 years in power in December – but only by a whisker.\n\nUruguay’s leftist opposition candidate, Yamandú Orsi, became the country’s new president in a November runoff that delivered another rebuke to incumbents.\n\nIn India, the world’s largest democracy, Prime Minister Narendra Modi’s nationalist Bharatiya Janata Party lost its parliamentary majority in a shock election result in June after a decade of dominance. It was forced to govern in coalition as the opposition doubled its strength in Parliament.\n\nJapanese politics entered a new era of uncertainty after Prime Minister Shigeru Ishiba’s governing Liberal Democratic Party, which has ruled almost without interruption since 1955, suffered a major loss in October amid voter anger at party financial scandals. It now leads a minority government.\n\nThe United Kingdom’s July election saw the right-of-centre Conservatives ousted after 14 years in office as the centre-left Labour Party swept to power in a landslide. But the results also revealed growing fragmentation: Support for the two big parties that have dominated British politics for a century shrank as voters turned to smaller parties, including the hard-right party Reform UK led by Nigel Farage.\n\nAUTHORITARIANS ADVANCE\n\nBritain is not alone in seeing a rise for the right. Elections in June for the Parliament of the 27-nation European Union (EU) saw conservative populists and the far right rock ruling parties in France and Germany, the EU’s biggest and most powerful members.\n\nThe anti-immigration National Rally party won the first round of France’s Parliamentary election in June, but alliances and tactical voting by the center and left knocked it down to third place in the second round, producing a divided legislature and a fragile government that collapsed in a December 4 no-confidence vote.\n\nIn Austria, the conservative governing People’s Party was beaten by the far-right though other parties allied to keep it out of a coalition government.\n\nNepotism and political dynasties continued to exert influence – and to be challenged. After messy elections in February, Pakistan elected Prime Minister Shehbaz Sharif, younger brother of three-time leader Nawaz Sharif. Indonesia, Southeast Asia’s largest democracy, elected President Prabowo Subianto, son-in-law of the late Suharto.\n\nBangladeshi Prime Minister Sheikh Hasina, the world’s longest-serving female leader, won a fourth successive term in a January election that opposition parties boycotted. Months later, her 15-year rule came to a tumultuous end: After mass student-led protests in which hundreds were killed, Hasina was ousted in August and fled to India.\n\nIn Sri Lanka, voters also rejected a discredited old guard.\n\nVoters elected the Marxist Anura Kumara Dissanayake as president in September, two years after an island-wide public movement by an engaged middle class removed the long-ruling Rajapaksa clan.\n\nINTERFERENCE ALLEGATIONS\n\nCovert meddling and online disinformation were growing concerns in 2024. Meta, the parent company of Facebook, Instagram and WhatsApp, said that this year it took down 20 election-related “covert influence operations around the world”.\n\nIn Romania, far-right candidate Călin Georgescu came from nowhere to win the first round of the presidential election in November, aided in part by a flood of TikTok videos promoting his campaign. \n\nRomania’s Constitutional Court cancelled the presidential election run-off two days before it was due to take place after a trove of declassified intelligence alleged another country organised a sprawling campaign across social media to promote Georgescu. No date has yet been set for a rerun.\n\nMoldova’s pro-Western President Maia Sandu won a November run-off against her Moscow-friendly rival in an election seen as pivotal to the future of one of Europe’s poorest nations.\n\nGeorgia has seen huge protests since an election in October was won by the pro-Moscow Georgian Dream party, which suspended negotiations on joining the European Union.\n\nThe opposition and the pro-Western president, Salome Zourabichvili, have accused the governing party of rigging the vote.\n\nUNCERTAINTY REIGNS\n\nPossibly the year’s most seismic result, Donald Trump’s victory in November’s United States (US) presidential election, has America’s allies and opponents bracing for what the unpredictable “America-first” leader will do with his second term.\n\nAnd instability already reigns on several continents as the year ends. Venezuela has been in political crisis since a July election marred by serious fraud allegations which both President Nicolás Maduro and the opposition claim to have won. Amid opposition protests and a harsh crackdown, opposition candidate Edmundo González went into exile in Spain.\n\nIn Mozambique, the Frelimo party that has ruled for half a century was declared the winner of an October election that the opposition called rigged. Weeks of ongoing street protests across the country have left more than 100 dead.\n\nDemocracy’s bumpy ride looks likely to continue in 2025, with embattled incumbents facing challenge in countries including Germany, where Chancellor Olaf Scholz lost a confidence vote on December 16, triggering an early election likely in February.\n\nCanada will also vote in 2025, with the governing Liberals widely unpopular and increasingly divided after almost a decade in power.\n\nHead of democracy assessment at the Stockholm-based International Institute for Democracy and Electoral Assistance Seema Shah said global surveys suggest support for the concept of democracy remains strong, but the numbers plummet “when you ask people how satisfied they are with their own democracy”.\n\n“People want democracy. They like the theory of it,” she said.\n\n“But when they see it actually play out, it’s not living up to their expectations.” – Jill Lawless","summary":"","url":"https://borneobulletin.com.bn/brace-for-turbulence/","image":"https://borneobulletin.com.bn/wp-content/uploads/2025/01/page-26-b_01012025.jpg","video":null,"publish_date":"2024-12-31 23:03:28","author":null,"language":"en","category":"politics","source_country":"bn","sentiment":-0.068},{"id":277437404,"title":"Trump’s Medicare pick Dr. Oz once said uninsured have no ‘right to health’","text":"Mehmet Oz, President-elect Donald Trump’s pick to lead the Centers for Medicare and Medicaid Services, once said the uninsured “don’t have a right to health.”\n\nThe physician, better known as the TV celebrity Dr. Oz, made the comment during a 2013 address to the National Governor’s Association. He told attendees that uninsured people should be given “a way of crawling back out of the abyss of darkness, of fear, over not having the health they need” in a “festival-like setting” with physicians.\n\nHe added that the uninsured don’t have a right to health, only the right to access a chance at health.\n\n“You can screen thousands of people for almost nothing, and can you allow a conversation to take place in more of a festival-like setting,” Oz said. “It is not scary … a lot don’t have insurance. Give them a way of crawling pack out of the abyss of darkness of fear over not having the health they need and give them an opportunity.\n\n“Because they don’t have the right to health, but they have the right to access a chance to get that health,” he added.\n\nIf confirmed by the US Senate next year, Oz will serve as the Centers for Medicare and Medicaid Services, which insures more than 160 million people. Medicare is a federal health insurance program for people 65 years old and over, while Medicaid is a joint federal and state program for people on low income. \n\nOz has a history of peddling baseless medical claims, including falsely claiming the antimalarial drug hydroxychloroquine is an effective treatment for COVID-19.\n\nNot only is the drug ineffective against the virus, but it can also actively harm patients who take it to combat COVID-19, according to the World Health Organization.\n\nOz is just one of many TV personalities to be a part of Trump’s potential cabinet. Other picks include former Fox News host Pete Hegseth, who was tapped to lead the Department of Defense, and Fox News contributor Sean Duffy, who was nominated to head the Department of Transportation.\n\nIn his nomination announcement, Trump vowed Oz will “cut waste and fraud” within the agency.\n\n“Our broken Healthcare System harms everyday Americans, and crushes our Country’s budget. Dr Oz will be a leader in incentivizing Disease Prevention, so we get the best results in the World for every dollar we spend on Healthcare in our Great Country,” Trump said in his statement.\n\nGiven Trump is unlikely to cut defense, Medicare or Social Security spending, Medicaid could be under threat during his next term, experts warn.\n\n“That means almost half of federal spending would be protected from cuts, leaving Medicaid, which is the next largest source of federal spending, and the ACA as prime targets for spending cuts. The math is inescapable,” Larry Levitt, executive vice president for health policy at KFF, wrote earlier this month for the Journal of the American Medical Association.\n\nThe Independent has contacted Trump’s transition team for comment.","summary":"The TV personality has repeatedly peddled dubious medical claims","url":"https://www.independent.co.uk/news/world/americas/us-politics/mehmet-oz-uninsured-americans-medicaid-medicare-b2672250.html","image":"https://static.independent.co.uk/2024/12/06/17/2185014265.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/Jqrx0881-4VHSaSK0.mp4","publish_date":"2024-12-31 23:02:27","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":-0.121},{"id":277430610,"title":"Stacey Abrams says Trump re-election was not a 'seismic shift' or 'landslide'","text":"Stacey Abrams said on MSNBC Monday that President-elect Donald Trump’s victory did not indicate a \"seismic shift.\" \"We keep misremembering what happened in November. Yes, Donald Trump won the election, but it wasn’t a landslide,\" Abrams told MSNBC’s Chris Hayes. \"It was an evenly divided nation. He got more people, but this was not the seismic shift where 57, 58 percent of America said no,\" the two-time failed Georgia gubernatorial candidate said. 'EMBARRASSINGLY WRONG': LIBERAL MEDIA FIGURES ADMIT BEING IN DENIAL ABOUT BIDEN'S MENTAL DECLINE Soon after winning both the popular vote and electoral college, Trump vowed to lead a \"golden age of America\" after launching the \"greatest political movement of all time.\" The incoming commander-in-chief's second presidential victory entailed sweeping all battleground states as well as Republicans winning a majority in the House and Senate. Furthermore, Trump improved his vote share across the country, starting with conservative areas but extending into deeply Democratic states. Vice President Kamala Harris congratulated Trump over the phone the next morning and later delivered her concession speech at her alma mater, Howard University. The feat is determined by many to be a mandate from the American people, who are fed up with economic woes, a border crisis and a broken immigration system. However, Abrams said, \"It was less than 50 percent of the electorate who said this is what we want.\" According to the Associated Press, Trump got 49.9% of the national vote totals. BIDEN 'A LITTLE OLDER AND A LITTLE SLOWER' IN THE FINAL DAYS OF HIS PRESIDENCY: NEW YORK TIMES REPORT During the interview, Abrams also reflected on the late President Jimmy Carter's legacy by discussing \"decency\" in politics. She implored Democrats to \"expand the ambit of decency\" to bring more people into the party. \"I think decency is a choice. It’s a difficult choice, but one that, when viewed authentically, has this effect of boosting confidence and boosting morale. It cannot be by itself the only offering and I think what we saw, unfortunately, with President Carter, was that when decency confronts ignominy—ignominy has a leg up because he’s willing to do things decency won’t. That doesn’t mean you abandon decency.\" She argued further, \"Our responsibility is for decency to show those who stayed home, those who stayed silent that there is a place for decency and a place for them,\" she told Hayes. \"That’s the work that has to be done next.\" Abrams, a Democrat, made headlines after refusing to concede the 2018 gubernatorial election to Republican Brian Kemp after losing by 60,000 votes. In 2019, Abrams said \"we won\" despite the final tally and Kemp's inauguration, though she has since argued that she accepted the results in 2018. She had also suggested that Kemp, as Georgia's secretary of state, enacted policies to suppress voters. Abrams ran for election again for governor of Georgia and lost on November 8, 2022. Abrams, despite never officially conceding her loss to Kemp, was heralded as an election reform icon. CLICK HERE TO GET THE FOX NEWS APP","summary":"Former Georgia gubernatorial candidate Stacey Abrams downplayed President-elect Donald Trump&apos;s victory, claiming that it was not a &quot;seismic shift&quot; or a &quot;landslide.&quot;","url":"https://www.foxnews.com/media/stacey-abrams-says-trump-re-election-not-seismic-shift-landslide","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/03/931/523/GettyImages-1244626792.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-31 23:00:48","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.213},{"id":277425716,"title":"After historic year, the Bank of Japan ambles into 2025","text":"Two or three rate increases are expected in 2025 from the Bank of Japan, possibly taking the benchmark to 1% for the first time in three decades.“There seems to be a widespread view that the BOJ raising rates two more times this year wouldn’t be considered monetary-policy tightening given the current level of interest rates,” said Tsuyoshi Ueno, a senior economist at NLI Research Institute. “While maintaining its free hand and monitoring economic conditions, I think the BOJ is contemplating two rate increases.”Possible spanners in the works are many. They include unexpected movements in the yen and U.S. economic policy under Donald Trump once he becomes president on Jan. 20. Central bank officials continue to suggest that they are in no hurry to make a move higher given the uncertainty in the world, especially in the United States.","summary":"Two or three rate hikes expected this year could take the central bank's benchmark to 1% for the first time in three decades.","url":"https://www.japantimes.co.jp/business/2025/01/01/economy/boj-rates-2025/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/12/31/442501.jpg?v=3.1","video":null,"publish_date":"2024-12-31 23:00:00","author":"Kazuaki Nagata,Web Master","authors":["Kazuaki Nagata","Web Master"],"language":"en","source_country":"jp","sentiment":0.265},{"id":277428676,"title":"Supreme Court Chief Justice John Roberts defends judicial independence, says it is under threat - The Associated Press","text":"WASHINGTON (AP) — Chief Justice John Roberts issued a defense Tuesday of judicial independence, which he said is under threat from intimidation, disinformation and the prospect of public officials defying court orders.\n\nRoberts laid out his concerns in his annual report on the federal judiciary. It was released after a year where the nation’s court system was unusually enmeshed in a closely fought presidential race, with then-Republican presidential candidate Donald Trump attacking its integrity as he faced criminal charges for which he denied wrongdoing. \n\nTrump won the race following a landmark Supreme Court immunity decision penned by Roberts that, along with another high court decision halting efforts to disqualify him from the ballot, removed obstacles to his election. The immunity decision came under criticism from Democrats like President Joe Biden. \n\nTrump is now readying for a second term as president with an ambitious agenda, elements of which are likely to be legally challenged and end up before the court whose conservative majority includes three justices appointed by Trump during his first term. \n\nRoberts and Trump clashed in 2018 when the chief justice rebuked the president for denouncing a judge who rejected his migrant asylum policy as an “Obama judge.”\n\nRoberts didn’t mention Trump in this year’s annual report. Instead, he wrote generally that even if court decisions are unpopular or mark a defeat for a presidential administration, other branches of government must be willing to enforce them to ensure the rule of law.\n\nHe pointed to the Brown v. Board of Education decision that desegrated schools in 1954 as one that needed federal enforcement in the face of resistance from southern governors. \n\n“It is not in the nature of judicial work to make everyone happy,” he wrote. \n\nThe chief justice also decried elected officials across the political spectrum who have “raised the specter of open disregard for federal court rulings.”\n\n“Attempts to intimidate judges for their rulings in cases are inappropriate and should be vigorously opposed,” he wrote. While public officials have the right to criticize rulings, they should also be aware of that their statements can “prompt dangerous reactions by others.” \n\nHe also pointed to disinformation about court rulings as a threat to judges’ independence, saying that social media can magnify distortions and even be exploited by “hostile foreign state actors” to exacerbate divisions. \n\nThreats of violence against judges around the country have been on the rise across the country in recent years, something that Roberts called “wholly unacceptable.”","summary":"Supreme Court Chief Justice John Roberts defends judicial independence, says it is under threat  The Associated Press","url":"https://apnews.com/article/supreme-court-chief-justice-john-roberts-1e11fa540245a8c629c90772674ea8f7","image":"https://dims.apnews.com/dims4/default/cd68302/2147483647/strip/true/crop/5643x3174+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fe2%2F595b35b252132b5699b6fbce2d48%2Fceeed4af9b404f0f977295136f507107","video":null,"publish_date":"2024-12-31 23:00:00","author":"Lindsay Whitehurst","authors":["Lindsay Whitehurst"],"language":"en","category":"politics","source_country":"us","sentiment":-0.121},{"id":277420538,"title":"Challenges Facing the European Union in 2025","text":"The year 2025 is set to be a pivotal one for the European Union (EU), as it grapples with significant geopolitical and economic hurdles. The newly elected leadership in Brussels will be tasked with addressing a myriad of pressing issues, particularly in light of the ongoing conflict in Ukraine, tensions with Russia, and the potential impact of a returning Trump administration in the United States.\n\nAmong the foremost concerns for the EU will be the ongoing assistance to Ukraine, which continues to be embroiled in a war with Russia. The EU plans to allocate approximately EUR1.5 billion each month from its joint budget to support Ukraine's treasury throughout 2025. Additionally, a EUR50 billion loan from the G7, funded by profits from frozen Russian assets, is also in the works. This financial backing is critical as the EU aims to bolster Ukraine's military and financial stability amidst the aggression from Russia.\n\nHowever, the financial landscape is complicated by the uncertainties surrounding U.S. foreign aid. With Donald Trump potentially resuming the presidency, there are concerns that U.S. support for Ukraine may wane, particularly if Trump follows through on his threats to cut aid. This could place additional financial strain on Europe, which has historically relied on U.S. assistance for half of Ukraine's aid.\n\nIn addition to the situation in Ukraine, the EU is also focused on enhancing its defense capabilities against potential Russian threats. The newly appointed commissioner for defense and space has been tasked with improving coordination among member states on arms procurement and defense strategies. However, many member states face budgetary constraints that hinder their ability to expand military resources adequately. As the geopolitical climate evolves, these limitations may become increasingly pronounced, especially if U.S. defense spending in Europe is reduced.\n\nMoreover, the EU is under pressure to manage its own economic challenges, which include sluggish growth, high debt levels, and the need for substantial investments in climate-friendly initiatives. Former European Central Bank head Mario Draghi highlighted an investment need of EUR800 billion to enhance the EU's economic competitiveness. However, countries like France and Italy are currently facing deficit proceedings from the EU, complicating the financial landscape further.\n\nThe trade environment is also fraught with tension, as a potential trade war with China looms over the EU, particularly concerning electric vehicle tariffs. Additionally, Trump's administration may impose punitive tariffs on European goods, which could escalate into broader trade conflicts. EU officials are keen to remind the incoming U.S. administration of the detrimental effects of such trade wars, emphasizing that they could significantly impact global economic stability.\n\nAs the EU navigates these multifaceted challenges, the need for unity among its member states becomes ever more critical. However, internal divisions and political instability in several countries may hinder the EU's ability to respond effectively. With France facing government crises and Germany constrained by an upcoming federal election, the EU's capacity for collective action may be tested.\n\nIn conclusion, 2025 promises to be a year of significant challenges for the EU, requiring adept navigation of complex geopolitical landscapes, economic pressures, and internal unity. The outcomes will likely shape the future trajectory of the European Union, as it strives to maintain its influence and stability in an increasingly uncertain world.","url":"https://themunicheye.com/challenges-facing-the-eu-in-2025-7144","image":"https://themunicheye.com/content_images/open-graph-tme.webp","video":null,"publish_date":"2024-12-31 22:56:51","author":"Article Collated/edited/curated, Or Written In-House, By The Munich Eye","authors":["Article Collated/edited/curated, Or Written In-House, By The Munich Eye"],"language":"en","source_country":"de","sentiment":0.424},{"id":277420520,"title":"2024 Political Highlights: Key Events and Turbulences","text":"The year 2024 has come to a close, showcasing significant political upheaval alongside pivotal elections across the globe. This retrospective examines the key events that shaped the political landscape throughout the year.\n\nJanuary kicked off with a startling revelation when the media organization Correctiv published an investigative report on a secret meeting in Potsdam, involving members of the Alternative for Germany (AfD), far-right extremists, and individuals such as Austrian neo-Nazi Martin Sellner. The exposure of this clandestine gathering sparked widespread protests against the AfD throughout Germany.\n\nIn response to the revelations, thousands rallied in various cities to oppose the rise of right-wing ideologies. The protests were fueled by Sellner's controversial presentation of a so-called 'master plan for remigration,' which further galvanized public sentiment against the AfD.\n\nThe political climate in Russia also saw significant turmoil with the reported death of Alexei Navalny, a prominent opposition leader, in a Siberian penal colony in mid-February. Many speculate that his death may have been orchestrated by the Kremlin, particularly given the history of targeted attacks against him. This event prompted a wave of silent protests across Russia, as citizens mourned the loss of a critical voice against President Vladimir Putin.\n\nMarch marked the Russian presidential elections, but the process was largely viewed as a sham, with Putin securing re-election amid widespread allegations of vote rigging. His victory, claiming 88.5% of the vote, was met with international condemnation.\n\nIn April, Germany took a progressive step towards cannabis legalization, as the Bundesrat approved a legislation to decriminalize the substance. This move was championed primarily by the Green Party and the Free Democratic Party (FDP), gaining further support from Health Minister Karl Lauterbach of the Social Democratic Party (SPD).\n\nThe following month witnessed an assassination attempt on Slovak Prime Minister Robert Fico, who narrowly survived after being shot at multiple times. The assailant, a 71-year-old man, was reportedly motivated by political dissent.\n\nJune brought the European Parliament elections, where the political center maintained its majority. Ursula von der Leyen was re-elected as the Commission President in July, despite controversies surrounding the AfD and its leadership.\n\nOne of the most shocking incidents of the year occurred in July when former U.S. President Donald Trump survived an assassination attempt during a campaign rally in Pennsylvania. The incident left one spectator dead and Trump with a minor injury, further intensifying the already charged political atmosphere in the U.S.\n\nAs the year progressed, President Joe Biden unexpectedly withdrew from the 2024 presidential race, endorsing Vice President Kamala Harris as his successor in the Democratic campaign. This shift created a wave of optimism among Democratic supporters, though the competition against Trump remained fierce.\n\nIn September, several German states held elections, with the AfD emerging as the leading party in Thuringia under the leadership of Björn Höcke, while the SPD secured a victory in Brandenburg.\n\nThe U.S. presidential election on November 5 saw Trump win against Harris, reclaiming the presidency with a significant electoral college lead despite a tighter popular vote margin. Harris conceded the race the following day, marking a significant moment in U.S. politics.\n\nBack in Germany, Chancellor Olaf Scholz faced a political crisis, resulting in the dismissal of Finance Minister Christian Lindner due to irreconcilable differences, which ultimately jeopardized the coalition's stability.\n\nThe year concluded with the dramatic fall of the Assad regime in Syria, as rebel forces successfully ousted the long-standing dictator, leading to celebrations among the Syrian populace who had endured years of conflict.\n\nAmidst these events, the ongoing warfare in Ukraine and the Israeli-Palestinian conflict continued to unfold, highlighting the persistent global challenges facing leaders and citizens alike. The year 2024 has undoubtedly been a pivotal chapter in the annals of political history.","url":"https://themunicheye.com/2024-political-highlights-key-events-and-turbulences-7141","image":"https://themunicheye.com/content_images/open-graph-tme.webp","video":null,"publish_date":"2024-12-31 22:56:51","author":"Article Collated/edited/curated, Or Written In-House, By The Munich Eye","authors":["Article Collated/edited/curated, Or Written In-House, By The Munich Eye"],"language":"en","category":"politics","source_country":"de","sentiment":0.203},{"id":277420200,"title":"Nissan, Nippon Steel show perils of misreading political, economic tides","text":"TOKYO -- The stock market toward the end of 2024 reflected two major missteps by corporate Japan.\n\nNissan Motor's share price has fallen more or less consistently since autumn as Donald Trump, who proposes higher tariffs on goods from Mexico, took the lead in the U.S. presidential election.","url":"https://asia.nikkei.com/Spotlight/Comment/Nissan-Nippon-Steel-show-perils-of-misreading-political-economic-tides","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F4%2F8%2F4%2F5%2F48805484-7-eng-GB%2FCropped-1735674268photo_SXM2024122000012304.jpg?width=120","video":null,"publish_date":"2024-12-31 22:52:51","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":-0.107},{"id":277437482,"title":"Visiting the Big Apple? Prepare to pay more if you drive to busiest part of Manhattan","text":"New York’s much-debated plan to charge drivers to enter the center of Manhattan is set to take effect Sunday, following years of bureaucratic and legal roadblocks. \n\nThe goals of what is known as “congestion pricing” are to reduce gridlock and pollution and raise revenue for public transit. Gov. Kathy Hochul said this week that the state will push forward with the plan.\n\nHere are some things to know if you plan to come into Manhattan by car after Jan. 5:\n\n Will I have to pay the toll? \n\nThe toll applies to the most congested part of Manhattan, south of Central Park. It will vary depending on the time and whether a car has E-ZPass, which is an electronic toll collection system used in many states. \n\nDuring peak traffic hours -- that’s 5 a.m. to 9 p.m. on weekdays, and 9 a.m. to 9 p.m. on weekends — most cars, SUVs, small vans and pickup trucks during with an E-ZPass will be charged $9, once per day. \n\nDuring the overnight hours, the tolls will go down to $2.25. \n\nDrivers without an E-ZPass will receive bills by mail and pay more: $13.50 for peak hours and $3.30 overnight.\n\nMotorcyclists will pay half the amount that cars pay during peak. Drivers of buses and trucks, depending on their size, will pay more.\n\nThere are some exceptions. Certain emergency vehicles, school buses, people with disabilities who can’t take public transportation, and the people who transport them are all exempt. Low-income drivers who pay the toll 10 times in a month can apply for a 50% discount on trips they take the rest of the month. \n\nThere's also a little break for those who have already paid a toll to enter Manhattan at the Lincoln Tunnel, Holland Tunnel, Queens-Midtown Tunnel or Hugh L. Carey Tunnel during peak hours. They should see a credit on their E-ZPass of up to $3 for passenger vehicles and more for trucks and buses. \n\nStill, with tolls for bridges and tunnels from New Jersey set to go up in the new year, a driver coming via the Holland Tunnel during peak traffic could pay $22 even with the credit. \n\n What if I take a taxi or Uber? \n\nPassengers in taxis and for-hire vehicles will have a per-trip surcharge added to their fares for rides to, from, within or through what is known as the Congestion Relief Zone. That charge is 75 cents for people taking taxis, green cabs and black cars, and $1.50 for Uber or Lyft passengers.\n\n Where did this come from? \n\nCongestion pricing has long existed in other cities around the globe, including London, Stockholm, Milan and Singapore, but New York is the first U.S. city to adopt it. \n\nIt's been floated in New York for years. Then-Mayor Michael Bloomberg suggested such a scheme in 2007, and state lawmakers approved the concept in 2019. But it has run into opposition and legal challenges from politicians, commuters and commercial drivers. \n\nThe idea has supporters in environmental and public transit advocates, who say encouraging people to forgo driving in favor of public transportation will reduce air pollution and help pay for the region’s subway, bus and commuter rail network. Millions of New Yorkers ride the subway system daily. \n\nThe plan stalled while awaiting a required federal environmental review during Donald Trump's first presidential administration. \n\nIt was finally set to go into effect earlier this year — with a heftier $15 toll — but Hochul, a Democrat, abruptly halted it weeks before the launch, arguing it was too expensive. \n\nShe put forward latest plan with a lower fee in November, shortly after Trump was elected to another term, with the Republican having vowed to stop it after he returns to office on Jan. 20.","summary":"New York’s plan to charge drivers extra to enter the center of Manhattan is set to to take effect Sunday","url":"https://www.independent.co.uk/news/ap-kathy-hochul-manhattan-donald-trump-passengers-b2672253.html","image":"https://static.independent.co.uk/2024/12/31/22/Manhattan_Congestion_Tolls_96966.jpg?width=1200","video":null,"publish_date":"2024-12-31 22:50:24","author":"Via AP news wire","authors":["Via AP news wire"],"language":"en","source_country":"gb","sentiment":-0.046},{"id":277422840,"title":"Visiting the Big Apple? Prepare to pay more if you drive to busiest part of Manhattan - The Associated Press","text":"NEW YORK (AP) — New York’s much-debated plan to charge drivers to enter the center of Manhattan is set to take effect Sunday, following years of bureaucratic and legal roadblocks. \n\nThe goals of what is known as “congestion pricing” are to reduce gridlock and pollution and raise revenue for public transit. Gov. Kathy Hochul said this week that the state will push forward with the plan.\n\nHere are some things to know if you plan to come into Manhattan by car after Jan. 5:\n\nWill I have to pay the toll?\n\nThe toll applies to the most congested part of Manhattan, south of Central Park. It will vary depending on the time and whether a car has E-ZPass, which is an electronic toll collection system used in many states. \n\nDuring peak traffic hours -- that’s 5 a.m. to 9 p.m. on weekdays, and 9 a.m. to 9 p.m. on weekends — most cars, SUVs, small vans and pickup trucks during with an E-ZPass will be charged $9, once per day. \n\nDuring the overnight hours, the tolls will go down to $2.25. \n\nDrivers without an E-ZPass will receive bills by mail and pay more: $13.50 for peak hours and $3.30 overnight.\n\nMotorcyclists will pay half the amount that cars pay during peak. Drivers of buses and trucks, depending on their size, will pay more.\n\nThere are some exceptions. Certain emergency vehicles, school buses, people with disabilities who can’t take public transportation, and the people who transport them are all exempt. Low-income drivers who pay the toll 10 times in a month can apply for a 50% discount on trips they take the rest of the month. \n\nThere’s also a little break for those who have already paid a toll to enter Manhattan at the Lincoln Tunnel, Holland Tunnel, Queens-Midtown Tunnel or Hugh L. Carey Tunnel during peak hours. They should see a credit on their E-ZPass of up to $3 for passenger vehicles and more for trucks and buses. \n\nStill, with tolls for bridges and tunnels from New Jersey set to go up in the new year, a driver coming via the Holland Tunnel during peak traffic could pay $22 even with the credit. \n\nWhat if I take a taxi or Uber?\n\nPassengers in taxis and for-hire vehicles will have a per-trip surcharge added to their fares for rides to, from, within or through what is known as the Congestion Relief Zone. That charge is 75 cents for people taking taxis, green cabs and black cars, and $1.50 for Uber or Lyft passengers.\n\nWhere did this come from?\n\nCongestion pricing has long existed in other cities around the globe, including London, Stockholm, Milan and Singapore, but New York is the first U.S. city to adopt it. \n\nIt’s been floated in New York for years. Then-Mayor Michael Bloomberg suggested such a scheme in 2007, and state lawmakers approved the concept in 2019. But it has run into opposition and legal challenges from politicians, commuters and commercial drivers. \n\nThe idea has supporters in environmental and public transit advocates, who say encouraging people to forgo driving in favor of public transportation will reduce air pollution and help pay for the region’s subway, bus and commuter rail network. Millions of New Yorkers ride the subway system daily. \n\nThe plan stalled while awaiting a required federal environmental review during Donald Trump’s first presidential administration. \n\nIt was finally set to go into effect earlier this year — with a heftier $15 toll — but Hochul, a Democrat, abruptly halted it weeks before the launch, arguing it was too expensive. \n\nShe put forward latest plan with a lower fee in November, shortly after Trump was elected to another term, with the Republican having vowed to stop it after he returns to office on Jan. 20.","summary":"Visiting the Big Apple? Prepare to pay more if you drive to busiest part of Manhattan  The Associated Press","url":"https://apnews.com/article/new-york-congestion-tolls-123ad0724cddfd061fb3e5a573d8417a","image":"https://dims.apnews.com/dims4/default/af2c242/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F80%2Fde3d8c7e038908f8a8d1567ceb53%2F5b0b13ffe29446c7bc36bc84e7bd5655","video":null,"publish_date":"2024-12-31 22:50:00","author":"Pm Utc","authors":["Pm Utc"],"language":"en","source_country":"us","sentiment":-0.046}]}