{"offset":0,"number":50,"available":15191,"news":[{"id":285252486,"title":"U.S. Sen. Jon Husted named to 4 committees, vows to back Trump agenda","text":"WASHINGTON, D. C. - Ohio’s newest U.S. Senator has been assigned to serve on four committees and says he’s eager to start work supporting President Donald Trump’s agenda.\n\nFormer Lt. Gov. Jon Husted, a Columbus-area Republican who was sworn in last week as Vice President JD Vance’s Senate replacement, has been named to serve on the U.S. Senate’s Committee on Small Business and Entrepreneurship, its Committee on Health, Education, Labor and Pensions, its Committee on Environment and Public Works, and its Special Committee on Aging, an aide said.\n\nIn a Wednesday interview with conservative radio host Bob Frantz, Husted said he’s been scrambling to hire staff, get office space, and continue to serve the public. \n\n“I’m here because Donald Trump won and JD Vance won, and that people expect me to support the America first agenda, and that’s what I’m going to do,” Husted told Frantz, pledging he’ll vote to confirm all the nominees Trump has forwarded to the Senate for confirmation.\n\nHusted has done that so far. For instance, he was among the Republican Senators who voted to approved the nomination of Pete Hesgeth, Trump’s nominee for Defense secretary. Three Republicans broke with the party, forcing Vance to cast the tie-breaking vote.\n\nHe said the Small Business Committee is scheduled to have a confirmation hearing on Wednesday with former U.S. Sen. Kelly Loeffler of Georgia, who Trump has nominated to head the Small Business Administration.\n\nOn Thursday, the Health, Education, Labor and Pensions Committee is scheduled to hear from Trump’s nominee to head the Department of Health and Human Services, Robert F. Kennedy, Jr., whose views on the value of vaccinations and recent alliance with the Democratic party has made his confirmation less certain than Loeffler’s.\n\nHe said he plans to use his questioning to ask Kennedy what he intends to do if he’s confirmed to the job, and what success will look like if he heads the agency for the next four years.\n\n“How will America be different when you’re done?” said Husted. “What will your priorities be?”\n\nHusted said he’ll bring the priorities he had as a longtime officeholder in Ohio to the U.S. Senate and try to enact laws to address immigration and inflation. Addressing high energy costs will help reduce inflation, Husted told Frantz.\n\nHe said the nation has “too much regulation standing in the way of how we generate our energy, how we fuel our cars, all of these kinds of energy related problems that America had under the Biden administration. That’s one of the things will be my agenda here to fix.”\n\nHe said Ohio’s growing manufacturing sector and data centers all need electricity, and it’s also important to keep energy prices low for consumers. He advocates removing “bureaucracy” and “regulations” to facilitate energy production.\n\n“Those are a couple things that will be on my agenda,” he said.","summary":"Ohio's newest senator, sworn in as JD Vance's replacement, aims to address immigration, inflation, and energy costs in new role.","url":"https://www.cleveland.com/news/2025/01/us-sen-jon-husted-named-to-4-committees-vows-to-back-trump-agenda.html","image":"https://www.cleveland.com/resizer/v2/YEUB4WR77RCCVBBJWSJBOJPZEA.jpg?auth=cc91d42a7d7f50b32878c34084ef4a8448e3813bc2fd726b42be2bae34380beb&width=1280&quality=90","video":null,"publish_date":"2025-01-29 20:06:44","author":"Sabrina Eaton","authors":["Sabrina Eaton"],"language":"en","category":"politics","source_country":"US","sentiment":0.046},{"id":285250070,"title":"Federal military spouse workers ‘should’ be able to continue remotely","text":"Federally employed military spouses who work remotely for their agencies “should” be allowed to continue to do so, according to a joint memo from the federal agencies in charge of budget and personnel.\n\nDespite the guidance, some spouses with federal jobs continue to feel uncertainty and angst following President Donald Trump’s new policy requiring in-person work.\n\nIn a Jan. 27 memo about the return-to-office requirement for federal workers, the Office of Personnel Management and the Office of Management and Budget included a footnote that stated agencies “should also exclude military spouses working remotely based on the Military Spouse Employment Act.” That law includes a provision that authorizes military spouses to telework from remote locations.\n\nBut some advocates are concerned that the guidance does not explicitly require federal agencies to exempt military spouses from the return-to-office requirement, meaning policies could differ from agency to agency.\n\nFor spouses who work remotely – whether in the continental United States or overseas under a Domestic Employee Teleworking Overseas (DETO) agreement – there is uncertainty about whether they will be able to continue their careers. Any roadblocks to working for the federal government would add to the many difficulties military spouses face in their battle for employment.\n\nExceptions to the return-to-office policy will likely apply to military spouses working both remotely in the continental U.S. and overseas, said John Hatton, staff vice president for policy and programs at the National Active and Retired Federal Employees Association, or NARFE. However, Hatton said the specifics won’t be clear until guidance flows down to the agencies, and from the agencies to their employees.\n\nAs a result, the policy is sowing angst among military spouses who work for the federal government, said Emmalee Gruesen, a Navy wife and Navy civilian employee who volunteers as an advocate for federally employed military spouses. Gruesen lives in Charlottesville, Virginia, where she works remotely for a Navy office in Norfolk. She and Army wife Maria Donnelly administer a Facebook page for other federally employed spouses.\n\n“A lot of spouses want to proactively submit requests” for exemptions, Gruesen said. “We’re telling them to wait for the agency.”\n\nShe told Military Times the departments of Veterans Affairs and Health and Human Services have issued clear instructions that do exempt military spouses from the return-to-office requirement.\n\n“We’re trying to calm a whole community,” Gruesen said, noting that the time lag between the return-to-office order and any clarification about the policy has exacerbated the worry.\n\n“The unfortunate thing is, people are making geo-bach decisions now,” she said. In those cases, some military families are deciding that the service member will move ahead to the next duty station while the spouse stays behind to be near work in case remote work isn’t allowed.\n\nAll federal employees are prohibited from teleworking overseas without approval from their agency and the State Department. An agreement signed in April 2024 between the departments of State and Defense was designed to make it easier for military spouses to work overseas under these DETO agreements.\n\nGruesen has heard from some spouses that their approvals for DETO have been put on hold, she said.\n\n“People are fearful. There are a wide range of these executive orders,” NARFE’s Hatton said. “It’s disappointing to see the range and breadth and scope of these orders. The concern is that it’s not clearly tied to some productivity measure that had been going down because people were working from home versus in the office.”\n\nTaken together, Hatton said, these executive orders “show a lack of appreciation for the work that federal employees are doing day in and day out ... [seeing] them more as expendable and part of the problem, rather than part of the solution to what we need to help discover and operate and work on behalf of the American people.”","summary":"\"We're trying to calm a whole community,\" said one military spouse advocate who's looking for answers.","url":"https://www.marinecorpstimes.com/news/pentagon-congress/2025/01/29/federal-military-spouse-workers-should-be-able-to-continue-remotely/","image":"https://www.armytimes.com/resizer/v2/EFLAITI7TJHFDL65X6SVGEL2WY.jpg?width=1200&auth=92211bdaca2e1eb268ca63a1331c445b7cad16774f819bc39d7fa4b87eb4f6fb","video":null,"publish_date":"2025-01-29 20:06:10","author":"Karen Jowers","authors":["Karen Jowers"],"language":"en","category":"politics","source_country":"US","sentiment":-0.174},{"id":285252444,"title":"Trump to sign executive order to prepare Guantanamo Bay for 30K 'criminal illegal aliens'","text":"President Donald Trump announced Wednesday that he would sign an executive order for the Pentagon to prepare Guantanamo Bay to detain 30,000 \"criminal illegal aliens.\" \"Today I'm also signing an executive order to instruct the Departments of Defense and Homeland Security to begin preparing the 30,000 person migrant facility at Guantanamo Bay,\" Trump said. \"Most people don't even know about it.\" TRUMP ADMINISTRATION TOUTS 969 ILLEGAL IMMIGRANT ARRESTS IN ONE DAY: ‘HERE ARE SOME OF THE WORST’ He said they need 30,000 beds to house the detainees, adding that putting them there will ensure they do not come back. CLICK TO GET THE FOX NEWS APP \"It’s a tough place to get out of,\" Trump added.","summary":"President Trump announced on Wednesday that he plans to send 30,000 criminal illegal aliens to Guantanamo Bay in Cuba, to ensure they don&apos;t return.","url":"https://www.foxnews.com/politics/trump-sign-executive-order-prepare-guantanamo-bay-30k-criminal-illegal-aliens","image":"https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Guantanamo-Bay-1.gif","video":null,"publish_date":"2025-01-29 20:06:03","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.508},{"id":285252446,"title":"No 2 Republican Steve Scalise lays out government funding strategies, with fiscal deadlines looming","text":"DORAL, Fla. — House Republicans have their work cut out for them in the coming weeks, with three fiscal deadlines looming and President Donald Trump pushing for a very active first 100 days of his administration. Congressional GOP leaders are working on a massive conservative policy overhaul via the reconciliation process. By lowering the threshold for passage in the Senate from 60 votes to a simple 51-seat majority, it allows the party in power to advance their policy goals into law, provided those policies deal with budgetary and other fiscal matters. \"We want to deliver on all the things that President Trump talked about during the campaign…including no tax on tips, which was one of those early items that the president talked about, but also ensuring no tax increases happen. We can fully fund our border security needs, making sure we build the wall out, that we give more technology and tools to our Border Patrol agents,\" House Majority Leader Steve Scalise, R-La., told Fox News Digital. \"We can produce more energy in America…try to get rid of some of these crazy rules and regulations that add so much cost for no good reason to families.\" TRUMP DHS REPEALS KEY MAYORKAS MEMO LIMITING ICE AGENTS Scalise said it would be \"much more robust\" than Republicans’ last reconciliation bill passed in 2017 — the last time the GOP controlled Congress and the White House. His optimism comes as congressional Republicans still appear divided over how best to enact their plans. Senate Republicans and some GOP hardliners in the House have argued that trying to pass a bill with border and energy policies first would give Trump a quick win, while allowing more time for more complex issues like taxes. But House leaders are concerned that, given Republicans last passed two reconciliation bills in one year in the 1990s with much larger majorities, the two-track strategy could allow Trump’s 2017 provisions to expire and raise taxes on millions of families. \"You have to start somewhere. We're starting with one package,\" Scalise said. \"No disagreement on the details of what we're going to include.\" Meanwhile, lawmakers are also contending with the debt ceiling being reinstated this month after it was temporarily suspended in a bipartisan deal during the Biden administration. At least one projection suggests Congress will have until mid-June or earlier to deal with it or risk financial turmoil that comes with a downgrade in the U.S.’s national credit rating. And coming on March 14 is the deadline to avert a partial government shutdown, which Congress has extended twice since the end of the previous fiscal year on Oct. 1. The No. 2 House Republican floated the possibility of combining those latter two deadlines. \"The Appropriations Committee, which is not directly involved in budget reconciliation, is simultaneously having a negotiation with the Senate on government funding, you know, working with the White House to make sure it meets President Trump's priorities,\" Scalise said. WHAT TO KNOW ABOUT DOGE AND ITS QUEST TO SLASH GOVERNMENT WASTE, SPENDING \"I would imagine the debt ceiling could very well be a part of that conversation in that negotiation.\" Scalise spoke with Fox News Digital at the House GOP’s annual retreat, held this year at Trump’s golf club in Doral, Florida. Lawmakers huddled behind closed doors for three days to hash out a roadmap for grappling with their multiple deadlines and enacting Trump’s agenda. They also heard from the president himself, as well as Vice President JD Vance. Trump has on multiple occasions called on Republicans to act on the debt limit to avoid a U.S. credit default. Vance told Republicans on Tuesday that Trump wanted them to do so without giving leverage to Democrats — a weighty task given some GOP hardliners’ opposition to raising or suspending the limit over the U.S.’s $36 trillion national debt. House GOP leaders can currently only afford one defection to still pass a bill along party lines. CLICK HERE TO GET THE FOX NEWS APP They’ve been forced to seek Democratic support on government funding multiple times, including most recently in December. With no topline agreement reached and roughly 19 days in session before the March 14 deadline to avert a partial government shutdown, it’s becoming increasingly likely that congressional leaders will have to combine all 12 annual appropriations bills into one massive \"omnibus,\" a move also generally opposed by GOP hardliners. \"I think we're getting closer,\" Scalise said of a topline number for fiscal year 2025 spending. \"The House and Senate were apart by a pretty sizable amount of money. They’re trying to negotiate that down to get a resolution.\"","summary":"House Majority Leader Steve Scalise discussed Republicans&apos; plans to grapple with several fiscal deadlines on the horizon.","url":"https://www.foxnews.com/politics/no-2-republican-steve-scalise-lays-out-government-funding-strategies-fiscal-deadlines-looming","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/trump-scalise-money.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-29 20:03:59","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"us","sentiment":0.204},{"id":285250530,"title":"Approximately 150 Fort Carson soldiers deployed to the southern border, Army says","text":"FORT CARSON, Colo. — Approximately 150 soldiers from Fort Carson have been deployed to the southern border as part of President Donald Trump’s executive order aimed at stopping illegal immigration into the country, according to a spokesperson with the U.S. Army.\n\nThe soldiers form part of the 759th Military Police Battalion Headquarters and the 569th Combat Engineer Company-Armored from Fort Carson, the spokesperson said, noting they were deployed “as an immediate augmentation of military active-duty forces to the Southern Border to carry out directed missions called for by the President to secure the Southern Border and protect and defend the territorial integrity of the United States.”\n\nThe deployment of about 1,500 active-duty Army and Marine personnel, including an unknown number of troops coming from Fort Carson, was reported by our Scripps sister station KOAA-TV on Friday, the same day U.S. Northern Command (USNORTHCOM) made the announcement.\n\nUSNORTHCOM, based at Peterson Space Force Base in Colorado Springs, serves as the U.S. Department of Defense’s operational lead for forces carrying out President Trump’s executive orders on the border.\n\nRead more at Denver7.\n\nGet more Colorado news by signing up for our daily Your Morning Dozen email newsletter.","summary":"Approximately 150 soldiers from Fort Carson have been deployed to the southern border as part of President Donald Trump’s executive order aimed at stopping illegal immigration.","url":"https://www.denverpost.com/2025/01/29/fort-carson-soldiers-deployed-southern-border/","image":"https://www.denverpost.com/wp-content/uploads/2018/01/fort-carson.jpg?w=960&h=638","video":null,"publish_date":"2025-01-29 20:02:54","author":"Denver7","authors":["Denver7"],"language":"en","category":"politics","source_country":"us","sentiment":0.155},{"id":285248370,"title":"RFK Jr. Says He Won't Take Away Twinkies if Confirmed as Health Secretary — or Diet Coke, 'Which My Boss Loves'","text":"Robert F. Kennedy Jr. says he isn't attacking junk food — he just wants Americans to know what they're eating.\n\n In his first of two Senate confirmation hearings for the role of health and human services secretary on Jan. 29, Kennedy said he doesn't plan to restrict Americans from certain foods, as some had wondered.\n\n \"We need to ... deploy NIH and FDA to doing the research to understand the relationship between these different food additives and chronic disease,\" he said of the National Institutes of Health and the Food and Drug Administration, \"so that Americans understand it and make sure that Americans are aware.\"\n\n He added, \"But I don't want to take food away from anybody.\"\n\n \"If you like ... a McDonald's cheeseburger, Diet Coke — which my boss loves — you should be able to get them,\" he told the Senate panel. \"If you want to eat Hostess Twinkies, you should be able to do that, but you should know what the impacts are on your family and your health.\"\n\n In referencing his \"boss,\" Kennedy meant President Donald Trump, whom he would answer to if confirmed to lead the Department of Health and Human Services. Trump has a well-documented love of Diet Coke.\n\n Kennedy's high-stakes confirmation hearing comes less than 24 hours after his cousin Caroline Kennedy, daughter of former President John F. Kennedy, released a scathing letter about him.\n\n In the letter, Caroline — who is normally a very private person, a source close to the family told PEOPLE — called her cousin a \"predator\" who is \"addicted to attention and power.\"\n\n Caroline went on to note his history of substance abuse and claimed he led other family members down the same path. She also alleged that he had previously engaged in animal abuse and capitalized off of their family's tragedies, including his father Robert F. Kennedy's assassination.\n\n Kennedy's confirmation as Trump's health secretary is far from certain, and criticisms from his family haven't helped quiet the noise about his status as a controversial public figure.\n\n Aside from a number of personal scandals in recent months — including an alleged relationship with a journalist who profiled him and allegations of sexual assault, which he has denied — Kennedy's political goals have divided Americans given his history of peddling conspiracy theories that aren't backed by science.\n\n Since siding with Trump last year, the vaccine skeptic claimed without evidence that fluoride is a harmful addition to drinking water, and suggested Americans begin drinking raw milk amid news of bird flu being found in batches of the beverage.","summary":"Kennedy's Senate confirmation hearings began less than 24 hours after his cousin Caroline released a scathing letter full of allegations against him","url":"https://people.com/rfk-jr-says-he-wont-take-away-twinkies-hhs-confirmation-hearings-8782505","image":"https://people.com/thmb/jDi69KLLML4V_4Pnc-v58OaRfo4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/robert-kennedy-jr-confirmation-hearing-tout-012925-a3e637ee7f464251b7d4cae7f04aa2be.jpg","video":null,"publish_date":"2025-01-29 20:02:28","author":"Rachel Raposas","authors":["Rachel Raposas"],"language":"en","source_country":"US","sentiment":0.099},{"id":285247468,"title":"Trump's envoy meets Netanyahu and visits Gaza Strip","text":"Israeli Prime Minister Benjamin Netanyahu has met with US Middle East envoy Steve Witkoff, Netanyahu says in a statement, amid the Gaza Strip ceasefire and a regional diplomatic push.\n\nIsraeli media said Witkoff also visited the Gaza Strip on Wednesday to oversee the implementation of the ceasefire there, which US President Donald Trump hopes to leverage into a broader regional accord that would include Saudi Arabia and Israel formalising diplomatic ties.\n\nThe US official visited Saudi Arabia on Tuesday.\n\nNetanyahu has long eyed ties with Saudi Arabia and is due to meet Trump in Washington DC on February 4, when talks for the next phase of the three-stage Gaza Strip ceasefire are meant to formally start.\n\nAn Israeli government spokesman declined to provide any details on Witkoff's visit to the Gaza Strip, which Israel's public broadcaster Kan said included an inspection of the Netzarim corridor.\n\nTens of thousands of displaced Palestinians have crossed over the route which cuts through the Gaza Strip east to west, as they returned to their homes in the northern part of the enclave.\n\nIsrael began pulling out of the corridor on Monday and has allowed civilians to return to homes in the north as part of the first six-week phase of the ceasefire, which will also included 33 hostages being freed in exchange for almost 2000 Palestinian prisoners and detainees.\n\nSeven hostages have already been released since the ceasefire took effect on January 19.\n\nThree more, including a civilian woman and an elderly man, as well as a female soldier, will be released on Thursday, according to Netanyahu's office.\n\nIsrael will free 110 Palestinian prisoners and detainees, according to the Palestinian prisoners' Information Office, including 30 minors and 32 prisoners serving life sentences.\n\nFive Thai citizens abducted from Israel during Hamas' October 7, 2023 attack that sparked the Gaza conflict may also be released on Thursday, according to an Israeli official.\n\nNinety hostages remain in the Gaza Strip, according to Israeli authorities, 10 of them foreigners.\n\nThe second stage of the deal, if it is agreed in the negotiations, is meant to open the way to ending the war with the release of all hostages and a full Israeli military withdrawal from the Palestinian enclave.\n\nThe Gaza Strip is one of the territories which the Palestinians seek for an independent state.\n\nSaudi Arabia has conditioned formal ties with Israel on Palestinian statehood and is unlikely to make progress on this front if the war in Gaza resumes.\n\nIn Saudi Arabia, Witkoff also met with Palestinian officials, according to a Palestinian source who spoke on condition of anonymity.\n\nTrump in his first term in office brokered the Abraham Accords in 2020 that led to Israel normalising ties with the United Arab Emirates and Bahrain.","summary":"Israeli officials say five Thai citizens and three Israelis abducted during Hamas' October 7, 2023 attack are the next hostages set to be released.","url":"https://thewest.com.au/news/conflict/trumps-envoy-meets-netanyahu-and-visits-gaza-strip-c-17552455","image":"https://images.thewest.com.au/publication/C-17552455/c69e0ead45b0766bde92a62a86f467afa895d885-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-29 20:01:45","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.102},{"id":285251824,"title":"Lord Sugar says Donald Trump always tells people he works for the US president","text":"The Apprentice star Lord Sugar has joked that US president and former The Apprentice US host Donald Trump claims he “works for me”.\n\nThe 77-year-old former Tottenham Hotspur owner was speaking to the PA news agency ahead of the launch of series 19 of the BBC business show, which he presents.\n\nAsked whether he would consider going into business with the president, Lord Sugar told PA: “He will tell you I am in business with him.\n\n“Because The Apprentice format, which was originally owned by someone called Mark Burnett, he sold it to MGM, and apparently, according to President Trump, he has a little shareholding, a small shareholding in the format.\n\n“So he always reminds people that Lord Sugar works for me.\n\n“Would I ever go in to business with him? I don’t think that opportunity will ever arise, because he’s too busy at the moment being president, he’s just taken over and started to implement some of his promises and plans.”\n\nMr Trump, who is now in his second term as president, hosted the first 14 series of the show’s American edition between 2003 and 2015, when he was replaced by former governor of California Arnold Schwarzenegger until the show was cancelled in the US in 2017.\n\nThe Hackney-born entrepreneur, who has recently been spending time in the US, also spoke about the atmosphere in the country following his election.\n\nHe added: “There is a kind of nervous atmosphere amongst people here about being deported, because there’s a lot of non-US citizens here that have got jobs and help to boost the economy, and I don’t know where you draw the line to leave them here, but get rid of the criminals.”\n\nThe upcoming series of The Apprentice will see contestants vying to become Lord Sugar’s next business partner, challenged on their skills with the latest technology including AI and holograms.\n\nThe former Amstrad boss said the show had to include it as it was what the younger element of its audience wanted to see, even if he had to learn the technology himself.\n\nLord Sugar said: “The production crew are a very, very clever bunch of people, they come up with these tasks that include technology, and the first person they have to explain it to is me.\n\n“So I have to understand it, and I have to make out I understand it deeply, and I do spend quite a bit of time going through it.\n\n“So I do understand it in order for me to project my questions at the candidates on it.\n\n“We have to have some up-to-date stuff, people are talking about AI, they’re talking about online stuff, we have to include it, because that’s what the younger audience wants to see.”\n\nThe star explained that he hoped his show would inspire young people to become entrepreneurs, having explained that he felt work ethic was becoming “too relaxed”, but Lord Sugar said he was “sure” there were still youngsters who wanted to graft towards their goals.\n\nHe said: “I hope that my programme encourages (hard work) of course.\n\n“I would like those people to grasp something and realise you’ve got to physically go and do something, physically work somewhere, or have a passion for something that you want to do.\n\n“So I’m not painting every young person with the same brush.”\n\nRunning for almost 20 years with Lord Sugar at the helm, The Apprentice sees 18 budding business people compete for £250,000 worth of investment from its host.\n\nContestants attempt to impress Lord Sugar and his associates Baroness Brady and Tim Campbell by completing a range of business-related tasks in each episode, with participants being fired for poor performance.\n\nThe prize was previously a job working alongside Lord Sugar, but this was changed to investment in 2011.\n\nThe first episode of The Apprentice series 19 will air at 9pm on Thursday on BBC One and BBC iPlayer.","summary":"The entrepreneur was speaking ahead of the launch of series 19 of The Apprentice.","url":"https://www.standard.co.uk/showbiz/celebrity-news/donald-trump-lord-sugar-the-apprentice-bbc-tottenham-hotspur-b1207986.html","image":"https://static.standard.co.uk/2025/01/29/20/eb28722f567ca38a19411c2b65b78e18Y29udGVudHNlYXJjaGFwaSwxNzM4MjU5NTk1-2.78822360.jpg?width=1200","video":null,"publish_date":"2025-01-29 20:00:00","author":"Casey Cooper-Fiske","authors":["Casey Cooper-Fiske"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.005},{"id":285249244,"title":"Southern California wildfires could be a double whammy for the state’s shaky budget","text":"Three weeks ago, Gov. Gavin Newsom proposed a $322 billion state budget for the fiscal year that begins on July 1, emphasizing that it would be balanced without new taxes and have a “modest” $363 million surplus.\n\nThe latter number is scarcely one-tenth of 1% of the overall budget, which makes one wonder how Newsom’s budget writers could calculate it so precisely. It may have been plucked from thin air so the first draft of the budget could be portrayed as balanced.\n\nIn fact, its purported balance assumes that at least $11 billion in drawdowns from emergency reserves, bookkeeping gimmicks and off-the-books loans can be counted as revenues. So by its own numbers, the proposed budget is actually leaking red ink.\n\nFurthermore, the budget is already scrap paper because the deadly wildfires that were scorching Southern California as it was being released will clobber tax revenues while imposing massive new financial burdens. The $2.5 billion hastily appropriated by the Legislature is only a down payment on what the state may have to spend on fire suppression and recovery.\n\nThat would be true even if President Donald Trump supplied billions of dollars in federal disaster aid that Newsom and other officials are seeking. During his visit to the fire scene last week, Trump both promised to help the region recover and suggested that the state should change some of its environmental and immigration policies in return.\n\nIf federal aid is not forthcoming, or is markedly less than being sought, the impact on state finances — both in loss of revenue and new spending — could be immense, potentially encompassing all of the state’s emergency reserves and then some.\n\nA hint of that potential impact is contained in a memo that Joe Stephenshaw, California’s finance director, sent to heads of state agencies last week, basicallytelling them to stifle any hopes for new or expanded programs.\n\nStephenshaw told the officials that “the recent devastating fires in southern California have resulted in the federal government delayed tax filings for Los Angeles and Ventura counties until November 15, introducing a level of uncertainty to the revenue forecast.”\n\nCiting the “projected structural deficits in future years and fiscal uncertainty the state continues to face,” he said that the state will stay within a “workload budget,” defined as the current level of authorized spending, adjusted only for such inescapable factors as inflation, caseloads and federal or judicial requirements.\n\nThe phrase “projected structural deficits in future years” refers to calculations by both Stepenshaw’s staff and the Legislature’s budget analyst, Gabe Petek, that no matter how the 2025-26 budget turns out, the state faces annual multibillion-dollar gaps between income and outgo after Newsom’s governorship ends two years hence.\n\nPetek sees annual deficits in the $25-30 billion range in the future, while the administration’s projected shortfalls are in the $15-20 billion range. Neither includes the potentially massive revenue and spending impacts of wildfires.\n\n“These gains are not tied to improvements in the state’s broader economy, which has been lackluster, with elevated unemployment, a stagnant job market outside of government and healthcare, and sluggish consumer spending,” Petek noted. “Instead, the gains appear largely tied to the booming stock market, a situation which can change rapidly and without warning.”\n\nThe meltdown in artificial intelligence stock values this week punctuates Petek’s admonition.\n\nCalifornia has faced budget crises before, but this could be the perfect storm of a chronically unbalanced budget made infinitely worse by disaster.\n\nDan Walters is a CalMatters columnist.","summary":"California has faced budget crises before, but this could be the perfect storm of a chronically unbalanced budget made infinitely worse by disaster. ","url":"https://www.ocregister.com/2025/01/29/southern-california-wildfires-could-be-a-double-whammy-for-the-states-shaky-budget/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/AP25006775691478.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-29 19:59:55","author":"Dan Walters","authors":["Dan Walters"],"language":"en","source_country":"us","sentiment":-0.358},{"id":285246634,"title":"Trump Directs Guantanamo Bay to Prepare to Hold up to 30,000 Migrants","text":"President Donald Trump said Wednesday that he is directing the opening of a detention center at Guantanamo Bay to hold up to 30,000 migrants who are living illegally in the United States.More to follow.","summary":"Trump made the announcement before he signed the Laken Riley Act into law as his administration's first piece of legislation.","url":"https://www.newsweek.com/trump-directs-guantanamo-bay-prepare-hold-30000-migrants-2023123","image":"https://d.newsweek.com/en/full/2450666/breaking-news.jpg","video":null,"publish_date":"2025-01-29 19:57:11","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"us","sentiment":-0.749},{"id":285249190,"title":"Who is Karoline Leavitt? White House’s youngest press secretary makes debut","text":"White House press secretary Karoline Leavitt made her debut in the briefing room on Tuesday, spending about 47 minutes answering questions from the White House press corps, promising to speak frequently with the news media and opening up the briefing room to social media influencers and podcasters.\n\n“President Trump is back, and the golden age of America has most definitely begun,” she said as Tuesday’s briefing kicked off.\n\nShe took a combative tone with those covering the White House and President Donald Trump’s administration, echoing her boss’ longtime hostility toward many legacy media outlets and outlining what to expect with how the White House will handle media during Trump’s second term.\n\nLeavitt committed to “telling the truth from this podium every single day,” and said the White House would “call out” media outlets for pushing any perceived misinformation.\n\n“We know for a fact that there have been lies that have been pushed by many legacy media outlets about this president,” Leavitt said to the reporters in the room.\n\n“While I vow to provide the truth from this podium, we ask that all of you in this room hold yourselves to that same standard.”\n\n“Millions of Americans, especially young people, have turned from traditional television outlets and newspapers to consume their news from blogs, social media and other independent outlets,” she continued. “It is essential to our team that we share President Trump’s message everywhere and adapt this White House to the new media landscape.”\n\nLeavitt also announced that the Trump administration has introduced a “new media” seat in the James S. Brady Briefing Room; a move she said would “welcome independent journalists, podcasters, social media influencers and content creators to apply for credentials to cover this White House.”\n\n“Whether you are a TikTok content creator, a blogger, a podcaster, if you are producing legitimate news content … you will be allowed to apply,” she said.\n\nRead on to learn more about Leavitt’s rise in politics, other controversial topics she touched on in Tuesday’s briefing and how her debut became a history-making event.\n\nThe youngest person to hold the position\n\nLeavitt’s appointment as press secretary at the age of 27 secures her as the youngest person to ever hold the job, beating out Ronald Ziegler, who was 29 when he served under President Richard Nixon.\n\nLeavitt attended at Saint Anselm College, a liberal arts school in Manchester, N.H., on an athletic scholarship. She played on the softball team and graduated in 2019 with a bachelor’s degree in politics and communication, the first in her immediate family to earn a college degree.\n\nIn 2016 she interned at Fox News during the New Hampshire primary.\n\n“The NH Primary is how my love for politics and media originated,” Leavitt wrote on a post shared to her Instagram last year. “From that week on, I knew what I wanted to do for my career.”\n\nDuring Trump’s first presidency, Leavitt worked as an assistant press secretary and presidential writer. When he lost re-election in 2020, she began working as communications director for New York Republican Rep. Elise Stefanik.\n\nIn 2022, Leavitt ran for Congress in New Hampshire’s 1st District. She won the Republican nomination but lost the general election to Democrat Chris Pappas.\n\nEventually, Leavitt made her way back to Trump’s team, serving as his national press secretary during his 2024 campaign and spokesperson for his transition team.\n\nJuggling the job as a mom\n\nLeavitt is the sixth working mother in a row to hold the job of press secretary, joining President Joe Biden’s Karine Jean-Pierre and Jen Psaki and Trump’s first-term press secretaries, Kayleigh McEnany, Stephanie Grisham and Sarah Huckabee Sanders.\n\nShe returned to work “just days” after giving birth to her son, Nicholas, in July 2024.\n\nSpeaking to The Conservateur in October, she said she was just three days into her maternity leave, watching television and relaxing at home with her newborn, when she watched Trump get shot at a rally in Butler, Penn.\n\n“I looked at my husband and said, ‘Looks like I’m going back to work,’” she told the outlet.\n\nThe next day, she was back on television.\n\n“Leaving the baby every day to go to work, it does break your heart,” Leavitt confessed in the interview. “It’s incredibly challenging emotionally, physically, spiritually.\n\n“It would have been a lot easier for me to respectfully decline this job offer and enjoy this past year in the peace and comfort of my previous job.”\n\nWhen an Instagram follower asked her if she was worried about the demands of the job and missing out on moments with her son, she shared that she prays about it every day and that “it’s very difficult but it’s also all I know.”\n\nWhat Trump has said about Leavitt\n\nWhen Trump announced Leavitt’s appointment last November, he praised her strength and intelligence.\n\n“Karoline Leavitt did a phenomenal job as the National Press Secretary on my Historic Campaign, and I am pleased to announce she will serve as White House Press Secretary,” his statement read.\n\n“Karoline is smart, tough, and has proven to be a highly effective communicator. I have the utmost confidence she will excel at the podium, and help deliver our message to the American people as we Make America Great Again.”\n\nStill, she confessed to The Conservateur that working for Trump has challenging aspects — in particular, she’s had to adjust to the “Donald Trump sleep schedule,” as she called it, and was waking up at 4 a.m. every day after only getting about four hours of sleep every night.\n\nWhat else Leavitt said during Tuesday’s briefing\n\nAside from announcing that the White House would open up seats in the briefing room for alternative forms of media and influencers, Leavitt addressed an array of topics, including plans to cut down on diversity, equity and inclusion initiatives, and the administration’s freeze on federal grants and loans. She also spoke about an elimination of funding for “transgenderism and wokeness.”\n\nShe defended Trump’s executive order that eliminates the acknowledgement of trans Americans, describing it as a restoration of “sanity” in the face of “wokeness.”\n\nShe also reinforced Trump’s stance on immigration, telling the public, “If you are an individual, a foreign national who illegally enters the United States of America, you are by definition a criminal.”\n\nDuring the briefing, she said the plans to slap Canada with punishing tariffs on Saturday is still in play, telling reporters that she spoke with the president Monday night and he indicated Feb. 1 was “still on the books” for the introduction of damaging duties against Canada and Mexico.\n\nTrump initially promised 25 per cent across-the-board tariffs in response to what he called the failure of both countries to curb the illegal flow of people and drugs across the border.\n\nShe also pointed to last weekend’s standoff with Colombia, which initially refused U.S. repatriation flights of deported migrants but then backed down when Trump threatened tariffs, as an example of the use of tariffs as a negotiating tool.\n\n“I won’t get ahead of the president on advocating to foreign nations what they should or shouldn’t do to get away from these tariffs,” she said.\n\n“The president has made it very clear that he expects every nation around this world to co-operate with the repatriation of their citizens.”\n\nWhen asked about whether this administration would celebrate Black History Month, she responded with: “We will continue to celebrate American history and the contributions that all Americans, regardless of race, religion or creed, have made to our great country.”\n\n— With files from Global News’ Sean Boynton and The Associated Press","summary":"At just 27 years old, Karoline Leavitt has set a record in the White House. Here's what she had to say in her first press briefing for the Trump administration.","url":"https://globalnews.ca/news/10987088/karoline-leavitt-donald-trump-press-secretary-debut-white-house-briefing-room/","image":"https://globalnews.ca/wp-content/uploads/2025/01/GettyImages-2196424610.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-01-29 19:53:18","author":"Michelle Butterfield","authors":["Michelle Butterfield"],"language":"en","category":"politics","source_country":"ca","sentiment":0.299},{"id":285246148,"title":"Trump swipes at 'vicious' illegal migrants during Laken Riley Act signing alongside an emotional John Fetterman","text":"Trump swipes at 'vicious' illegal migrants during Laken Riley Act signing alongside an emotional John Fetterman\n\nPODCAST: On Welcome to MAGAland, we dive into the JFK files, that Gavin Newsom kiss & Trump’s latest sparring matches\n\nBy EMILY GOODIN, SENIOR WHITE HOUSE CORRESPONDENT\n\nPublished: 19:51 GMT, 29 January 2025 | Updated: 19:52 GMT, 29 January 2025\n\nPresident Donald Trump signed the Laken Riley Act into law on Wednesday, declaring that he's cracking down on 'vicious criminals' including the illegal migrant who killed the 22-year-old nursing student last year.\n\nIt is the first legislation he's signed into law since he return to the White House. \n\nThe law, named after the slain Georgia nursing student, requires the detention of unauthorized immigrants accused of theft and violent crimes. \n\nThe president was joined by Laken's parents, Jason Riley and Allyson Phillips, at the signing and her sister Lauren. \n\n'So sad... we were together right after that happened, and it's a tremendous tribute to your daughter what's taken place today. That's all I can say... but so sad we have to be doing it all,' he added.\n\nThe new law will ensure that the 'horrific atrocity' will never happen again, Trump went on. \n\n'It's landmark law that we're doing today. It's going to save countless innocent American lives.'\n\nIt also enables individual states to sue the federal government if it or its citizens are harmed by immigration related actions. \n\nRiley, 22, was a student at Augusta University College of Nursing when she went out for a run on Feb. 22, 2024. She encountered Jose Antonio Ibarra, a Venezuelan national in the U.S. illegally who killed her during a struggle. He was found guilty and ultimately sentenced to life in prison.\n\nDemocratic Senator John Fetterman, who co-sponsored the legislation, was spotted applauding during the formal ceremony while wearing his signature black hoodie.\n\nHe looked visibly emotional during the event, crossing his arms with a somber expression as Trump detailed the gruesome details of Riley's death. \n\nThe president was joined by Laken's parents, Jason Riley and Allyson Phillips, at the signing\n\nJohn Fetterman applauds Trump at the White House as he takes swing at 'vicious' illegal migrants during Laken Riley Act signing\n\nThe new law will ensure that the 'horrific atrocity' will never happen again, Trump went on\n\nFetterman, who is known to split with his party on immigration and the Israel war, became the first Democrat senator to voice support for the GOP bill.\n\nShortly after Fetterman's announcement, Sen. Gary Peters, D-Mich., also said that he would support the act in the Senate. Many others soon followed like Sens. Ruben Gallego, Mark Kelly, Mark Warner and more.\n\nLawmakers who voted for the Laken Riley Act - including 48 House members and 12 Senate Democrats - were invited. \n\nLaken's name became a rallying cry for Republicans during the 2024 presidential campaign. During President Joe Biden's final State of the Union Address, Republican Congresswoman Marjorie Taylor Greene, from Georgia, demanded that the president 'say her name.'\n\nTrump launches anti-Semitism crackdown as he orders deportation of pro-Hamas students\n\nTrump vowed during his campaign to crack down on illegal migration and used the fact Ibarra had a criminal record to slam the Biden administration. \n\nIbarra had been arrested for illegal entry in September 2022 near El Paso, Texas, amid an unprecedented surge in migration, and released to pursue his case in immigration court.\n\nAdditionally, he was arrested in New York for endangering a child and was cited in Georgia for shoplifting, but wasn't detained by Immigration and Customs Enforcement (ICE) before Riley's murder.\n\nTrump and Republicans put the blame for Riley's death on Biden and his immigration policies. \n\nThe president has hinted there could be more legislation like this to come.\n\n'This shows the potential for additional enforcement bills that will help us crack down on criminal aliens and totally restore the rule of law in our country,' Trump told House Republicans on Monday during a conference at his Miami Doral golf club.\n\nFetterman looked visibly upset during the event, crossing his arms with a somber expression as Trump detailed the gruesome details of Riley's death.\n\nFetterman is one of only a handful of Democrats who voted for the bill\n\nJose Ibarra (right) was sentenced to life in prison for Laken Riley's (left) murder\n\n'We're tracking down the illegal alien criminals and we're detaining them and we're throwing them the hell out of our country,' Trump said. 'We have no apologies, and we're moving forward very fast.' \n\nThe bill passed both the House and Senate with bipartisan support. \n\nOpponents argued it would strip due process rights for migrants. \n\nDonald TrumpGeorgiaRepublicansJohn Fetterman\n\nShare or comment on this article:\nTrump swipes at 'vicious' illegal migrants during Laken Riley Act signing alongside an emotional John Fetterman\n\nAdd comment","summary":"President Donald Trump signed the Laken Riley Act into law on Wednesday, declaring that he's cracking down on 'vicious criminals.'","url":"https://www.dailymail.co.uk/news/article-14338953/trump-swipes-vicious-illegal-migrants-laken-riley-act-signing.html","image":"https://i.dailymail.co.uk/1s/2025/01/29/19/94651733-0-image-a-43_1738179941454.jpg","video":null,"publish_date":"2025-01-29 19:52:41","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","category":"politics","source_country":"gb","sentiment":0.008},{"id":285244948,"title":"Federal Reserve holds rates steady: Policy divergence with ECB widens","text":"The Federal Reserve decided to keep interest rates unchanged in the 4.25%-4.50% range during its January meeting, in line with market expectations. Following three consecutive rate cuts totalling one percentage point, the US central bank’s policymakers opted to hit the brake at the first policy meeting since the Trump administration took office.The US economy remains resilient, with a strong labour market. However, inflation is still deemed ‘somewhat elevated’, prompting the Fed’s committee to reiterate the cautious approach outlined in December:\"In considering the extent and timing of additional adjustments to the target range for the federal funds rate, the Committee will carefully assess incoming data, the evolving outlook, and the balance of risks.\"Essentially, the timing and scale of any further rate cuts will depend on economic data and emerging risks – a notion that had sparked concerns among market participants last month. The Fed continues to exercise caution, choosing to assess economic developments before implementing further monetary easing—a luxury not available for the European Central Bank, which faces mounting pressure to cut rates more aggressively.Fed-ECB policy divergence growsIn December, the Fed surprised markets by raising its inflation forecast for 2025 to 2.5% and cutting its projection for interest rate reductions to just two for the year, down from four in its September outlook. Fed Chair Jerome Powell underscored that rates are close to neutral levels and that any further cuts must be approached with great care. While the US economy’s strength and persistent inflation are keeping Fed policymakers on edge, the situation in Europe is markedly different: economic outlook is deteriorating, and inflation is making steady progress towards the 2% target. On Wednesday, the German government slashed its 2025 economic growth forecast to just 0.3%, down from the previous estimate of 1.1% in October. Economy Minister Robert Habeck described the economic situation as \"difficult\" and warned that stagnation has persisted for an extended period, exacerbated by labour shortages, excessive bureaucracy, and insufficient public and private investment. Market expectations currently point to two Fed rate cuts in 2025, beginning in June, while the ECB is expected to implement four rate cuts by year-end. Euro weakens to 1.04 ahead of Powell Following the Fed’s decision and ahead of Powell’s press conference, the euro fell to 1.04 against the US dollar, reflecting the greenback’s strength amid growing monetary policy divergence between the two economies. Powell is also likely to face questions over Donald Trump’s renewed efforts to influence the Fed’s decision-making. Speaking via videoconference at the World Economic Forum last week, the newly elected US president explicitly stated that he would push for lower interest rates, a stance that could increase political pressure on the central bank in the coming months.","summary":"Federal Reserve holds rates steady: Policy divergence with ECB widens","url":"https://www.euronews.com/business/2025/01/29/federal-reserve-holds-rates-steady-policy-divergence-with-ecb-widens","image":"https://static.euronews.com/articles/stories/09/01/51/14/1440x810_cmsv2_632d73d6-c059-50ce-a9ce-e3bb327181f3-9015114.jpg","video":null,"publish_date":"2025-01-29 19:51:55","author":null,"language":"en","source_country":"fr","sentiment":0.051},{"id":285246652,"title":"Will Trump's Executive Order Require Americans to Carry ID or Face Arrest?","text":"Among President Donald Trump's slew of immigration-related executive orders signed in his first week is mention of an 80-year law that went largely unnoticed.In seeking to tighten border security, Trump invoked a rule requiring immigrants to carry identification proving their status — something civil-rights groups who spoke to Newsweek say is all but certain to end up with American citizens being detained by police.\"The act itself is called the (ARA), and so it's easy to think on the face of it: 'Well, this is not a concern for a U.S. citizen, I'm not a non-citizen, I was born here, or I naturalized here, so this doesn't affect me at all',\" Anthony Enriquez, vice president of U.S. advocacy and human rights at RFK Human Rights, told Newsweek.\"In fact, that's not the real question. The real question is, well, are police going to believe that you actually are a U.S. citizen when they stop you and they say: 'where's your document?'\"Newsweek reached out to the White House with a list of questions related to the executive order.Why It MattersPresident Trump was elected off the back of an campaign promising big changes on immigration, including tougher border security and an increase in deportations of illegal immigrants. Polling has shown widespread support across the political spectrum for immigration reform, although there have been disagreements over how this should be carried out.What To KnowThe law from the 1940s was referenced in Trump's executive order, titled \"Protecting the American People Against Invasion\" and signed on Inauguration Day. As part of a list of orders meant to tackle the immigration issue, it emphasized the need to enforce immigration laws and shift the priorities of Department of Homeland Security agencies to make sure migrants in the U.S. illegally are removed.Under Trump's order, and through the ARA, immigrants would be expected to carry I.D. proving their status. If they do not comply, then they face either civil or criminal prosecution, per the order. While the law has been in place — with a few amendments — for decades, it has not always been widely enforced.For Enriquez, the concern is that American citizens or legally-present immigrants – such as Green Card holders – will be swept up by law enforcement as a result. He pointed to the Immigration and Customs Enforcement (ICE) raid in New Jersey last week, in which a U.S. veteran from Puerto Rico was detained because his military I.D. was not accepted.\"An alien registration scheme actually works as a citizen registration scheme,\" Enriquez said. \"Because if the only way to avoid arrest is to make sure that you're carrying proof of your citizenship on you at all times, then this law affects everybody in the United States.\"The example in New Jersey isn't the first time federal agents have arrested a U.S. citizen by mistake. In 2021, the Government Accountability Office reported that ICE may have deported as many as 70 Americans between 2015 and 2020, while 674 were arrested.With the White House under pressure from Republican voters to deliver on Trump's mass deportation promise, civil rights groups have raised concerns that racial profiling could lead to a spike in those numbers.In the past week, Native American leaders in Arizona and New Mexico have said members of their tribe had been approached by federal agents, with congressional Democrats calling for the Trump administration to \"stop harassing\" them.\"We know that disproportionately the burdens of the enforced by this type of law are going to hit people that are not white, that are racial minorities, that have a different last name, that have an accent, that have a skin color, that immigration agencies are assuming means you can't be born here,\" Enriquez said.In a country where a national I.D. is not mandated or even necessarily available – an idea rooted in the inherent American desire for freedom from government control – it could be difficult to determine who is carrying eligible documentation and who isn't.Approximately 24 percent of Hispanic and 21 percent of Black voting-age citizens do not have a current driver's license, compared to 8 percent of white citizens, according to the Center for Democracy and Civic Engagement. Nearly half of American citizens don't hold a passport.Enriquez said it would be vital for law enforcement to fully understand what was expected of officers, and to use caution when determining how this applies to those living in the U.S., before trying to act on the Trump order.\"What's happening here is the executive order really says: no, don't take that kind of caution, don't take that kind of circumspection, and instead just go forth and treat this as a criminal enforcement priority,\" he said.\"When you get that kind of messaging from the top, inevitably you're going to have people swept up that have no business being prosecuted by these kinds of laws.\"That really is why it's baked into the DNA of Americans to not have a national ID and registration and carry requirement. There's a presumption that we have freedom and that you can't just be stopped by agents of the state to produce your permission documents to be there.\"What People Are SayingLucas Guttentag, professor at Yale Law, told Newsweek: \"Any widespread application of the law, especially in the undisciplined and unsupervised manner unleashed by this administration, will de facto compel citizens to produce identification at the whim of federal agents, will cause the harassment and arrest of innocent individuals, and will exacerbate racial profiling.\"Eric Ruark, director at the right-leaning NumbersUSA, told Newsweek: \"President Biden released seven million inadmissible aliens into the United States, not including 'gotaways' or visa overstays. The Trump Administration's position is that these inadmissible aliens are removable and it pledges the 'total and efficient enforcement' of immigration laws -- and the Supreme Court is likely to uphold these efforts.\"The main effect of this executive order will be twofold. First, it will result in the expedited removal of criminal aliens who benefitted from the Biden Administration's effective dismantlement of immigration enforcement. Second, it will send a powerful message to all foreign nationals unlawfully present in the United States that President Trump is serious about reestablishing the rule of law when it comes to immigration.\"White House Press Secretary Karoline Leavitt, at a briefing Tuesday: \"To foreign nationals who are thinking about trying to illegally enter the United States – think again. Under this President you will be detained and you will be deported. Every day Americans are safer because of the violent criminals that President Trump's administration is removing from our communities.\"What's NextRFK Human Rights said it will be watching to see how this executive order is implemented, and whether there is the funding available to actually register and provide I.D. to all immigrants.","summary":"Among the immigration orders signed on Inauguration Day was a requirement for all immigrants to carry proof of documentation.","url":"https://www.newsweek.com/trump-immigration-executive-order-american-citizens-carry-id-2022904","image":"https://d.newsweek.com/en/full/2576286/trump-executive-order-id.jpg","video":null,"publish_date":"2025-01-29 19:50:50","author":"Dan Gooding","authors":["Dan Gooding"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":285248384,"title":"Cheryl Hines Supports Husband RFK Jr. at Confirmation Hearing amid Kennedy Family Drama","text":"Cheryl Hines was in the crowd during Robert F. Kennedy Jr.’s Senate confirmation hearing. \n\n On Wednesday, Jan. 29, the actress, 59, was photographed beside her husband, 71, as he addressed the Senate during a Senate Finance Committee hearing at the Capitol in Washington, D.C. after President Donald Trump nominated him to lead the U.S. Department of Health and Human Services.\n\n In one photo, Hines is seen sitting behind Kennedy Jr. as he stands behind a podium and speaks into a microphone. \n\n Another shows her and Kennedy Jr. holding hands in solidarity as they walked into the government building surrounded by others on their team.\n\n USA Today reports that the ongoing hearing has not been going entirely in Kennedy Jr.’s favor as multiple senators challenged his beliefs on abortions, vaccines and prescription drug prices. \n\n Kennedy Jr. is among Trump's more controversial picks as he continues to pull together his cabinet following his inauguration on Jan. 20. Most of his nominees are likely to be confirmed by the Republican-controlled Senate.\n\n The hearing comes a day after Caroline Kennedy came forward with scathing allegations against her cousin, calling him a \"predator\" and \"unqualified\" to lead the nation's health policy.\n\n In her shocking six-minute video shared to social media, she said, \"I did not comment, not only because I was serving in a government position as United States Ambassador to Australia, but because I have never wanted to speak publicly about my family members and their challenges.\"\n\n Caroline, who resigned from her political position in November, continued, “But now that Bobby has been nominated by President Trump to be Secretary of Health and Human Services — a position that would put him in charge of the health of the American people — I feel an obligation to speak out.\"\n\n She went on to criticize her cousin’s conspiracy-laced position against vaccinations, saying that Kennedy Jr. \"preys on the desperation of parents of sick children\" by advocating against vaccines while vaccinating his own kids.\n\n Caroline also accused him of various lewd behaviors, including encouraging others to partake in substance abuse, allegedly \"showing off how he put baby chickens and mice in a blender to feed to his hawks\" and exploiting his own family tragedies. \n\n PEOPLE previously reported that a source close to the Democratic political dynasty called Caroline’s video a \"pretty fierce statement.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.\n\n \"She’s so, so private and her speaking out — as harshly as she did — about her cousin is shocking,\" this source said, calling it \"a complete departure for her.\"\n\n Kennedy Jr. and Hines have yet to comment on Caroline’s statement. \n\n In November, Kennedy Jr. shared an Instagram post to express his appreciation towards Trump.\n\n \"Thank you @realdonaldtrump for your leadership and courage. I’m committed to advancing your vision to Make America Healthy Again,” he wrote. “We have a generational opportunity to bring together the greatest minds in science, medicine, industry and government to put an end to the chronic disease epidemic.”\n\n Kennedy Jr. continued, \"I look forward to working with the more than 80,000 employees at HHS to free the agencies from the smothering cloud of corporate capture so they can pursue their mission to make Americans once again the healthiest people on Earth.\"","summary":"The hearing comes a day after Caroline Kennedy came forward with scathing allegations against her cousin","url":"https://people.com/cheryl-hines-supports-husband-rfk-jr-at-confirmation-hearing-8782499","image":"https://people.com/thmb/fo0Ys4SRNl13_7Mp21CAZiEGCss=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/cheryl-hines-rfk-tout-012925-be61c82ab471477b8a0becb37deebf8b.jpg","video":null,"publish_date":"2025-01-29 19:50:15","author":"Raven Brunner","authors":["Raven Brunner"],"language":"en","source_country":"US","sentiment":0.175},{"id":285246138,"title":"Trump says he'll send 30,000 illegal migrants to Guantanamo Bay","text":"BREAKING NEWSTrump says he'll send 30,000 illegal migrants to Guantanamo Bay\n\nPODCAST: On Welcome to MAGAland, we dive into the JFK files, that Gavin Newsom kiss & Trump’s latest sparring matches\n\nBy WILLS ROBINSON FOR DAILYMAIL.COM\n\nPublished: 19:47 GMT, 29 January 2025 | Updated: 19:47 GMT, 29 January 2025\n\nPresident Donald Trump has annoucned plans to open a facility on Guantanamo Bay to house 30,000 illegal migrants.\n\nThis is breaking news\n\nPresident Donald Trump has annoucned plans to open a facility on Guantanamo Bay to house 30,000 illegal migrants.\n\nDonald Trump\n\nShare or comment on this article:\nTrump says he'll send 30,000 illegal migrants to Guantanamo Bay\n\nAdd comment","summary":"The president has accelerated his crackdown on illegal migrants since the monent he took office for the second time.","url":"https://www.dailymail.co.uk/news/article-14339467/trump-announces-illegal-migrants-guantanamo-bay-cuba.html","image":"https://i.dailymail.co.uk/1s/2025/01/29/19/94651843-0-image-m-24_1738180056247.jpg","video":null,"publish_date":"2025-01-29 19:47:59","author":"Editor,Wills Robinson","authors":["Editor","Wills Robinson"],"language":"en","category":"politics","source_country":"gb","sentiment":0.294},{"id":285244088,"title":"Trump scraps plan to freeze federal loans and grants after backlash","text":"Donald Trump has scrapped his order to freeze hundreds of billions of dollars in federal domestic funding, in a major climbdown following a widespread backlash.\n\nThe White House’s Office of Management and Budget issued a two-line memo to executive branch departments and agencies on Wednesday saying the original plan had been dropped.\n\nThe U-turn came a day after the original order sparked a day of political chaos and confusion among politicians from both parties, who were grappling with how their states critical federal services including support for the poor and elderly would be affected.\n\nA federal judge blocked the freeze on Tuesday just minutes before it was set to take effect.\n\nAfter the revocation, the White House said it rescinded the memo “to end any confusion on federal policy created by the court ruling and the dishonest media coverage”.\n\nTrump said he wanted to “correct any confusion that the media has purposely and somehow, for whatever reason, created”, adding Social Security, Medicare and Medicaid would not be affected by his freeze.\n\n“We are merely looking at parts of the big bureaucracy where there has been tremendous waste and fraud and abuse,” he said.\n\nThe president’s comments came a day after the White House issued clarifications about which programmes would be affected by its sweeping payment freeze.\n\nWhite House press secretary Karoline Leavitt on Wednesday insisted Trump’s order to review federal funding to align it with his Maga agenda would “remain in full force and . . . will be rigorously implemented by all agencies and department”.\n\nWednesday’s reversal was a blow to Trump less than two weeks into a second term. His team wanted to be free of the kind of policy reversals that characterised the early months of his first presidency.\n\nRepublican officials, including Louisiana governor Jeff Landry, had joined Democratic lawmakers and state officials in opposing the freeze.\n\nBut the U-turn will be awkward for House Republicans who defended Trump’s funding freeze during their retreat in Florida.\n\nThe president has issued scores of executive orders since re-entering office as he tries to execute a plan to deregulate the US economy and slash the size of the federal government. The orders have included blocks on federal support for foreign aid and domestic clean energy.\n\nDemocrats said the revocation of its original memo just a day after it was issued marked an early policy failure by the new administration.\n\nChuck Schumer, the top Democrat in the US Senate, said “Americans fought back and Donald Trump backed off” and the president had “failed in this tactic”.\n\nHakeem Jeffries, the highest-ranking Democrat in the House of Representatives, wrote on social media platform Bluesky that “round one goes to team America. We remain in the ring until far-right extremism has been completely and totally knocked out.”","summary":"President rescinds order to halt payments to US government programmes","url":"https://www.ft.com/content/62f9f242-b514-493d-b894-0210c722695b","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc1cb492a-5fd4-4b96-9899-d000ac2160de.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1","video":null,"publish_date":"2025-01-29 19:47:49","author":"Steff Chávez","authors":["Steff Chávez"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.436},{"id":285243608,"title":"Who Is Elizabeth Warren? Massachusetts&#8217; Senator Spars With RFK Jr Over Vaccine And Money-making Claims","text":"During a Senate Finance Committee confirmation hearing for President Donald Trump’s nominee to lead the Department of Health and Human Services (HHS), a tense confrontation took place between Robert F. Kennedy Jr. and Democratic Senator Elizabeth Warren of Massachusetts. The exchange focused on the influence of the pharmaceutical industry in Washington and the potential for conflicts of interest.\nWarren opened the exchange by acknowledging a shared belief between herself and Kennedy—namely, that “Big Pharma has too much power in Washington.” She cited Kennedy’s past statements where he expressed a commitment to “slam shut the revolving door between government agencies and the companies they regulate.”\nElizabeth Warren Presses Kennedy on Future Financial Commitments\nWarren, seeking to hold Kennedy accountable for his past rhetoric, asked a direct question: “Will you commit that when you leave this job, you will not accept compensation from a company, a medical device company, a hospital system, or a health insurer for at least four years, including as a lobbyist or a board member?”\nKennedy responded, initially with confusion, but ultimately stated, “I’m happy to commit to not taking money from drug companies. I don’t think any of them wants to give me money, by the way.”\nHowever, Warren wasn’t satisfied with the response and shifted the focus to Kennedy’s recent activities. She accused him of encouraging individuals to join lawsuits against vaccine manufacturers, pointing to his financial ties with the law firm Wisner Baum.\nElizabeth Warren Accuses Kennedy of Profiting from Lawsuits Against Vaccine Makers\n“In the past two years, you’ve raked in two and a half million dollars from a law firm called Wisner Baum,” Warren stated. “You go online, you do commercials to encourage people to sign up with Wisner Baum to join lawsuits against vaccine makers. And for everyone who signs up, you personally get paid. And if they win their case, you get 10 percent of what they win.”\nWarren emphasized the potential financial windfall, noting, “If you bring in somebody who gets ten million, you walk away with a million dollars.”\nShe continued, pressing Kennedy on his commitment to refrain from profiting from lawsuits against drug companies. “Mr. Kennedy, will you also agree that you won’t take any compensation from any lawsuits against drug companies while you are secretary and for four years afterward?”\nKennedy Denies Conflict of Interest, Refuses to Relinquish Right to Sue\nKennedy, visibly frustrated by the line of questioning, denied the implication that he was profiting off of such lawsuits. “You’re making me sound like a shill,” he remarked. Despite this, he confirmed that he would not take fees from drug companies during his tenure as secretary.\nThe back-and-forth between the senator and Kennedy grew more heated as Warren’s questioning continued. She pushed again for a commitment regarding lawsuits against drug companies, to which Kennedy retorted, “You’re asking me to not sue drug companies.”\nWarren, exasperated, clarified, “No, you can sue drug companies as much as you want.” She then outlined numerous potential ways Kennedy could exert influence over vaccine-related lawsuits if confirmed as HHS Secretary.\nSenator Warren Highlights Potential Conflicts of Interest\n“If you get confirmed, you can influence every one of those lawsuits,” Warren said. She detailed various hypothetical scenarios in which Kennedy, as secretary, could influence public health policies and lawsuits, including using government resources to support anti-vaccine rhetoric, altering vaccine schedules, and modifying compensation rules related to vaccine injuries.\nShe further suggested that Kennedy could leverage his position to assist the law firm Wisner Baum in ways that would benefit their lawsuits, including turning over FDA data and changing vaccine labeling and information rules.\nKennedy Responds, Insists on Following Ethical Guidelines\nDespite Warren’s claims, Kennedy reiterated his commitment to comply with all ethical guidelines. “I will comply with all the ethical guidance,” he said, but Warren was not satisfied with this answer.\n“That’s not the question,” she fired back, her frustration mounting.\nAs the exchange became more contentious, Kennedy attempted to clarify his position once more, “Senator, you’re asking me not to sue vaccine companies—” but was immediately interrupted by an outraged Warren, who sharply retorted, “No, I am not!”\nWho Is Senator Elizabeth Warren?\nSenator Elizabeth Warren has represented Massachusetts in the United States Senate since 2013. She serves on several key Senate committees, including Banking, Housing, and Urban Affairs; Health, Education, Labor, and Pensions (HELP); Energy and Natural Resources; and the Special Committee on Aging.\nA leading expert on bankruptcy and the financial challenges facing middle-class families, Senator Warren played a pivotal role in establishing the Consumer Financial Protection Bureau (CFPB). Appointed by President Barack Obama as Assistant to the President and Special Advisor to the Secretary of the Treasury, she was responsible for setting up the agency to hold financial institutions accountable and safeguard consumers from deceptive financial practices. Following the 2008 financial crisis, she also chaired the Congressional Oversight Panel (COP) for the Troubled Asset Relief Program (TARP).\nAlso Read: Why Is US Health Secretary Pick RFK Jr Facing A Heated Senate Hearing?","summary":"During a heated Senate Finance Committee hearing, Senator Elizabeth Warren confronted Robert F. Kennedy Jr. over his financial ties and potential conflicts of interest. The tense exchange centered on Kennedy’s past advocacy against pharmaceutical companies and whether he would commit to avoiding financial gains from related lawsuits.","url":"https://www.newsx.com/world/who-is-elizabeth-warren-massachusetts-senator-spars-with-rfk-jr-over-vaccine-and-money-making-claims/","image":"https://www.newsx.com/wp-content/uploads/2025/01/elizabeth-warren-hhs-kennedy-hhs-secretary-rfk-confirmation-will-rfk-jr-be-confirmed-kennedy-hearing-sheldon-whitehouse-confirmation-hearings-rfk-vote-did-rfk-get-confirmed-1.webp","video":null,"publish_date":"2025-01-29 19:46:41","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","source_country":"in","sentiment":-0.515},{"id":285243598,"title":"Trump Administration Rescinds Federal Grant and Loan Freeze Amid Backlash","text":"President Donald Trump's administration on Wednesday reversed a sweeping freeze on most federal grants and loans, just a day after the controversial order was issued. The decision to rescind the freeze comes in the wake of significant criticism from both lawmakers and stakeholders who were caught off guard by the sudden move.\nLegal Intervention Halts the Freeze\nThe freeze, which had sent shockwaves through Washington, D.C., was briefly halted on Tuesday evening by a federal district judge. The swift legal intervention temporarily prevented the order from taking effect, as confusion spread regarding the implications for federal funding.\nThe decision to undo the freeze appears to be in response to the confusion and mounting concerns surrounding its potential impact.\nThis is a developing story.\nAlso Read: Has Trump Suspended Student Loan Forgiveness And Federal Student Aid?","summary":"In a swift reversal, President Donald Trump&#8217;s administration rescinded a freeze on most federal grants and loans just one day after its implementation. The decision follows widespread backlash and a federal court’s temporary halt to the controversial order.","url":"https://www.newsx.com/world/trump-administration-rescinds-federal-grant-and-loan-freeze-amid-backlash/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Federal-grant-Rescinds-loan-freeze-Rescinds-Rescinds-trump-adminstration.webp","video":null,"publish_date":"2025-01-29 19:46:41","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","category":"politics","source_country":"in","sentiment":-0.467},{"id":285252448,"title":"Trump signs Laken Riley Act into law as first legislative victory in new administration","text":"President Donald Trump signed the Laken Riley Act into law Wednesday, marking the first piece of legislation to become law in his second administration. \"This horrific atrocity should never have been allowed to happen,\" Trump told reporters Wednesday ahead of signing the legislation. \"And as president, I'm fighting every single day to ensure that such a tragedy never happens again.\" The measure, which advanced through the House and Senate in January, directs Immigration and Customs Enforcement (ICE) to detain illegal immigrants arrested or charged with theft-related crimes, or those accused of assaulting a police officer. The law also allows states to sue the Department of Homeland Security for harm caused to their citizens because of illegal immigration. CONGRESS SENDS LAKEN RILEY ACT TO TRUMP'S DESK AS FIRST BILL OF GOP'S WASHINGTON TAKEOVER The law's name honors a nursing student who was killed during a jog on the University of Georgia’s campus by an illegal immigrant. Jose Ibarra, who previously had been arrested but never detained by ICE, received a prison life sentence for killing 22-year-old Laken Riley. Riley's mother, Allyson Phillips, expressed her gratitude at the signing for everyone who pushed to advance the legislation. \"We also want to thank President Trump for the promises he made us,\" Phillips said. \"He said he would secure our borders and that he would never forget about Laken. And he hasn't. He's a man of his word.\" Riley's father, John, and sister, Lauren, also were present at the signing. The measure received support from all House Republicans and 48 Democrats, and all Senate Republicans and 12 Senate Democrats. Trump touted the bipartisan effort Wednesday. \"With today's action, her name will also live forever in the laws of our country,\" Trump said. \"And this is a very important law. This is something that has brought Democrats and Republicans together. That's not easy to do. Laken did it. Laken did it. America will never, ever forget Laken Hope Riley.\" Meanwhile, critics of the measure claim that the law will pave the way for mass detention, including for those who’ve committed minor offenses like shoplifting. Sarah Mehta, senior border policy counsel with the American Civil Liberties Union, said in a statement after the Senate voted to advance the measure ahead of a final vote, \"This is an extreme and reactive bill that will authorize the largest expansion of mandatory detention we have seen in decades.\" LAKEN RILEY ACT PASSES HOUSE WITH 48 DEMS, ALL REPUBLICANS \"While we are disappointed this bill will pass the Senate, it is notable that so many senators opposed it and recognized the need for actual immigration reform — not the chaos and cruelty this legislation will unleash,\" Mehta said. Trump promised to crack down on illegal immigration during his campaign, and declared a national emergency at the southern border following his inauguration. He also immediately ordered the expulsion of migrants without the possibility of asylum. On Tuesday, White House Press Secretary Karoline Leavitt cautioned foreign nationals considering entering the U.S. that they will be detained and kicked out of the country. TIDAL WAVE OF BORDER SECURITY BILLS HIT HOUSE AS REPUBLICANS MOVE FAST ON DC TAKEOVER CLICK HERE TO GET THE FOX NEWS APP \"So to foreign nationals who are thinking about trying to illegally enter the United States, think again,\" Leavitt told reporters Tuesday at the White House press briefing. \"Under this president, you will be detained and you will be deported. Every day, Americans are safer because of the violent criminals that President Trump's administration is removing from our communities.\" Elizabeth Elkind contributed to this report.","summary":"The law directs Immigration and Customs Enforcement to detain illegal immigrants arrested or charged with theft-related crimes, or those accused of assaulting a police officer.","url":"https://www.foxnews.com/politics/trump-signs-laken-riley-act-law-first-legislative-victory-new-administration","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/lakenriley_trump.png?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:46:05","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.11},{"id":285248968,"title":"CDC ordered to immediately stop collaborating with WHO after Trump begins process for US withdrawal","text":"The Centers for Disease Control and Prevention (CDC) has been ordered to immediately halt all collaborations with the World Health Organization (WHO), according to a memo obtained by the Associated Press. The memo was reportedly sent to senior leaders of the agency by CDC official John Nkengasong on Sunday, just days after President Donald Trump issued an executive order withdrawing the U.S. from the United Nations (UN) agency. According to the memo, the stop-work policy applied to \"all CDC staff engaging with WHO through technical working groups, coordinating centers, advisory boards, cooperative agreements or other means — in person or virtual.\" Visiting WHO offices also became prohibited until \"further guidance.\" FOX News reached out to the CDC and the Department of Health and Human Services for comment, but they did not immediately respond. TRUMP ORDERS US WITHDRAWAL FROM WORLD HEALTH ORGANIZATION In an interview with the Associated Press, a University of Southern California public health expert who collaborates with WHO on work against sexually transmitted infections said the stop-work policy may have major consequences. \"Stopping communications and meetings with WHO is a big problem,\" Dr. Jeffrey Klausner, who learned about the memo from someone at the CDC, said. Halting collaborations, which Klausner said could \"help us protect Americans abroad and at home,\" could affect how the U.S. monitors certain outbreaks. This includes bird flu outbreaks, which reportedly have affected American livestock, caused human infections, and even raised grocery prices. TRUMP OPEN TO CONSIDERING RE-ENTRY INTO WORLD HEALTH ORGANIZATION: 'THEY'D HAVE TO CLEAN IT UP' \"People thought there would be a slow withdrawal. This has really caught everyone with their pants down,\" Klausner continued. According to a White House statement on America's withdrawal, the WHO demands unfair and heavy payments from the U.S. disproportionate to other countries, such as China. \"China, with a population of 1.4 billion, has 300 percent of the population of the United States, yet contributes nearly 90 percent less to the WHO,\" the statement said. CLICK HERE TO GET THE FOX NEWS APP During a rally in Downtown Las Vegas on Saturday, Trump said the U.S. pays $500 million a year while China pays $39 million. However, the prospect of rejoining the organization is possible if WHO can \"clean it up a bit.\" \"They offered me at $39 million, they said 'We'll let you back in for $39 million,' they're going to reduce it from [$500 million] to [$39 million], and I turned them down, because it became so popular I didn't know if it would be well received even at [$39 million], but maybe we would consider doing it again, I don’t know, they have to clean it up a bit.\" FOX News' Alec Schemmel and The Associated Press contributed to this report.","summary":"Health officials at the Center for Disease Control have reportedly been ordered to stop working with the World Health Organization, following Trump&apos;s criticisms on the agency.","url":"https://www.foxnews.com/us/cdc-ordered-stop-working-who-immediately-after-trump-begins-process-us-withdrawal","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/03/931/523/8d5683e4-CDC.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:44:51","author":"Bonny Chu,Pilar Arias","authors":["Bonny Chu","Pilar Arias"],"language":"en","source_country":"us","sentiment":-0.222},{"id":285247478,"title":"US central bank holds interest rates steady","text":"The Federal Reserve has held interest rates steady and gave little insight into when further reductions in borrowing costs may take place in an economy where inflation remains above target, growth continues, and the unemployment rate is low.\n\nAfter several months in which inflation data have largely moved sideways, the US central bank dropped from its latest policy statement language saying that inflation \"has made progress\" towards the Fed's 2 per cent inflation goal, noting only that the pace of price increases \"remains elevated\".\n\nRecent key inflation readings remain about half a percentage point or more above the Fed's target.\n\nFed officials say they largely believe the progress in lowering inflation will resume this year but have now put rates on hold as they await data to confirm it.\n\n\"Economic activity has continued to expand at a solid pace. The unemployment rate has stabilised at a low level in recent months, and labour market conditions remain solid,\" the central bank's policy-setting Federal Open Market Committee said in a statement after the end of its latest two-day meeting.\n\n\"In considering the extent and timing of additional adjustments to the target range for the federal funds rate, the Committee will carefully assess incoming data, the evolving outlook, and the balance of risks,\" it said.\n\nThe unanimous decision to keep the overnight interest rate in the current 4.25 per cent-4.50 per cent range, coupled with the new statement, puts the Fed in a holding pattern as officials await further inflation and jobs data and clarity on the effect of US President Donald Trump's policies.\n\nTrump's administration already has moved to deport some undocumented immigrants and freeze federal spending, and could broaden its reach to include as soon as this weekend new import tariffs on major trading partners such as Mexico and Canada.\n\nThe decision to hold the policy rate steady was widely anticipated following three consecutive rate cuts in 2024 that reduced the Fed's benchmark rate by a full percentage point.\n\nThere is debate at the central bank about how much further rates may need to fall, with policy makers anticipating perhaps two quarter-percentage-point rate cuts over the course of the year.\n\nOfficials say they want to see if inflation continues to fall to the Fed's target in the months ahead before easing monetary policy again while also expressing uncertainty about the effect Trump's plans will have on price pressures, the labour market and economic growth.","summary":"The US central bank has left its benchmark interest rate unchanged after cutting it three times in a row last year.","url":"https://thewest.com.au/business/us-central-bank-holds-interest-rates-steady-c-17552347","image":"https://images.thewest.com.au/publication/C-17552347/98f8819af14ef7e833713e50b3d5c5a64b98e475-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-29 19:43:39","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"business","source_country":"au","sentiment":0.105},{"id":285244114,"title":"Whoopi Goldberg describes Trump's presidency as 'reality show‘ as The View host supports Selena Gomez","text":"Whoopi Goldberg described Donald Trump's presidency as a “reality show” as The View host showed support to Selena Gomez.\n\nThe View panelists discussed a video posted by the actress, in which she sobbed on camera saying: “All my people are being attacked, and children”, in relation to Trump’s immigration crackdown.\n\nThe singer then deleted her emotional post about the mass deportation of undocumented immigrants.\n\nThe View host weighed in on the response from Trump border Czar Tom Homan.\n\nGoldberg, who has previously clashed with Trump, said: “It’s now a reality show, this is the new reality show.”","summary":"Whoopi Goldberg described Donald Trump's presidency as a “reality show” as The View host showed support to Selena Gomez.","url":"https://www.independent.co.uk/tv/news/whoopi-goldberg-trump-selena-gomez-the-view-b2688696.html","image":"https://static.independent.co.uk/2024/10/10/18/Untitled-design.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/5gHNEEXZ-4VHSaSK0.mp4","publish_date":"2025-01-29 19:43:38","author":"Lucy Leeson","authors":["Lucy Leeson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.482},{"id":285244892,"title":"Justice Department drops classified documents case against Trump co-defendants","text":"The Justice Department on Wednesday moved to drop its appeal of a federal court order dismissing the criminal charges against President Donald Trump's former co-defendants in the classified documents case, which would effectively end the case. Then-U.S. Attorney General Merrick Garland had cited the pending appeal as the reason why he would not publicly release special counsel Jack Smith's report on the criminal case he'd brought against Trump, saying it could impact the due process rights of the co-defendants, Walt Nauta and Carlos De Oliviera. The Justice Department's motion to the 11th U.S. Circuit Court of Appeals to drop the appeal was filed by Hayden O'Byrne. O'Byrne was named interim U.S. attorney for the Southern District of Florida this week, the Miami Herald reported. O’Byrne's filing asks the circuit court to dismiss the DOJ's appeal \"with prejudice,\" which means it could not be revived again at a later date. His office was assigned the case after Smith resigned earlier this month. The filing notes that Nauta and De Oliveira \"do not object to the voluntary dismissal.\" The appeals court needs to approve of the Justice Department's move for its appeal to officially be dropped. A spokesperson for the department declined to comment on what affect the move would have on the possibility of Smith's report becoming public. Trump and his attorneys had vehemently opposed the release of the report, as had attorneys for Nauta and De Oliveira. U.S. District Judge Aileen Cannon, a Trump nominee, had dismissed the case against then-presidential candidate Trump, his aide Nauta and Mar-a-Lago employee De Oliveira last year. The three had been charged with allegedly taking part in a scheme to help Trump retain highly classified documents that improperly remained in his possession after he left the White House in 2021 and with obstructing the ensuing federal investigation. All three had pleaded not guilty. Cannon tossed the case in July after finding that Smith's appointment as special counsel was illegal, which led to the current appeal. The Justice Department dropped its case against Trump after his election win, citing guidance from its Office of Legal Counsel that the executive branch agency cannot prosecute a sitting president — the person who heads the executive branch. That guidance also resulted in Smith dropping his other case against Trump, which had charged him with conspiracy against the United States for his efforts to stay in power after losing the 2020 presidential election. Trump had no co-defendants in that case, and Smith's report on the matter was released earlier this month. It contained mostly information from public court filings in the case. Trump, Nauta and De Oliveira all sought to block the release of the second volume of the report, which centered on the classified documents case. Garland agreed not to release that volume pending the resolution of the appeal, but still sought to share the report with congressional leaders, a move that Cannon blocked. “Given the very strong public interest in this criminal proceeding and the absence of any enforceable limits on the proposed disclosure, there is certainly a reasonable likelihood that review by members of Congress as proposed will result in public dissemination of all or part of Volume II,” she wrote. Cannon added that the report, which she had reviewed, contains “detailed and voluminous” information outlining the case against Trump, much of which “has not been made public in court filings.” House Democrats on the Judiciary Committee had urged Garland to withdraw the appeal involving Nauta and De Oliveira before Trump took office so the attorney general could release the report. They said their concerns that dismissing the case could enable further corruption “are outweighed by the many indications that Mr. Trump will simply end the prosecutions against his co-conspirators upon taking office anyway and then instruct his DOJ to permanently bury this report.”","summary":"The Justice Department on Wednesday moved to drop its appeal of a federal court order dismissing the criminal charges against President Donald Trump's former co-defendants in the classified documents case, which would effectively end the case.","url":"https://www.nbcnews.com/politics/donald-trump/justice-department-drops-classified-documents-case-trump-co-defendants-rcna189836","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-12/241224-donald-trump-classified-documents-mar-a-lago-vl-902p-4a1909.jpg","video":null,"publish_date":"2025-01-29 19:43:16","author":"Daniel Barnes,Dareh Gregorian","authors":["Daniel Barnes","Dareh Gregorian"],"language":"en","category":"politics","source_country":"us","sentiment":-0.244},{"id":285249104,"title":"Fed hold rates steady, says job market is solid, inflation 'somewhat elevated'","text":"The Federal Reserve left its benchmark interest rate unchanged Wednesday after cutting it three times in a row last year, a sign of a more cautious approach as the Fed seeks to gauge where inflation is headed and what policies President Donald Trump may pursue.\n\nThe Fed reduced its rate last year to 4.3% from 5.3%, in part out of concern that the job market was weakening. Hiring had slowed in the summer and the unemployment rate ticked up, leading Fed officials to approve an outsized half-point cut in September. Yet hiring rebounded last month and the unemployment rate declined slightly, to a low 4.1%.\n\nIn its statement Wednesday, the Fed upgraded its assessment of the job market, calling it “solid,” and noting that the unemployment rate “has stabilized at a low level in recent months.” \n\nThe Fed also appeared to toughen its assessment of inflation, saying that it “remains somewhat elevated.” Both a healthier job market and more stubborn inflation typically would imply fewer Fed rate cuts in the coming months.\n\nFed Chair Jerome Powell has said it is harder to gauge where inflation is headed, in part because of increased uncertainty around what policies Trump will adopt and how quickly they will affect the economy. \n\nTrump has promised widespread tariffs, tax cuts, and mass deportation of immigrants, all of which could push prices higher. The Fed typically keeps interest rates high to slow borrowing and spending and cool inflation.\n\nTrump said last week in Davos, Switzerland that he would bring down energy prices, then “demand” that the Fed lower borrowing costs. Later, when asked by reporters if he expected the Fed to listen to him, he said, “yes.” Presidents in recent decades have avoided publicly pressuring the Fed out of deference to its political independence.\n\nPowell said in December that the central bank has entered a “new phase,” in which it expects to move more deliberately. In December, Fed officials signaled they may reduce their rate just twice more this year. Goldman Sachs economists believes those cuts won’t happen until June and December.\n\nIn November, inflation was just 2.4%, according to the Fed’s preferred measure, not far from its 2% target. But excluding the volatile food and energy categories, core prices rose a more painful 2.8% from a year earlier. The Fed pays close attention to core prices because they are often a better guide to inflation’s future path.\n\nA cut in March is still possible, though financial markets’ futures pricing puts the odds of that happening at just one-third.\n\nAs a result, American households and businesses are unlikely to see much relief from high borrowing costs anytime soon. The average rate on a 30-year mortgage slipped to just below 7% last week, after rising for five straight weeks. The costs of borrowing money have remained high economy-wide even after the Fed reduced its benchmark rate.\n\nThat is because investors expect healthy economic growth and stubborn inflation will forestall future rate cuts. They recently bid up the 10-year Treasury above 4.8%, its highest level since 2023.\n\nAnother reason for caution among Fed policymakers this year is that they will want to evaluate any changes in economic policy by the Trump administration. Trump has said he could slap tariffs of 25% on imports from Canada and Mexico as early as Saturday. \n\nThe Trump administration has also said it will carry out mass deportations of migrants, which could push up inflation by reducing the economy’s ability to produce goods and services. At the same time, some economists say Trump’s promises to deregulate the economy could lower prices over time.\n\nWhen Trump imposed tariffs on a limited number of imports in 2018 and 2019, Fed economists expected the biggest impact to fall on economic growth, with the inflationary impact being relatively minor. As a result, when growth did slow, the Fed ended up cutting its key rate in 2019, rather than raising it to fight off any inflationary impact.\n\nOn Wednesday, Fed officials could also change the statement that they release after each meeting to upgrade their assessment of the labor market, a signal that rate cuts may be delayed.","url":"https://chicago.suntimes.com/money/2025/01/29/fed-hold-rates-steady-job-market-solid-inflation-elevated","image":"https://cst.brightspotcdn.com/dims4/default/f0cb6ac/2147483647/strip/true/crop/8640x4932+0+414/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F61%2Fa4%2Fd3057a929fb1cba50e89756ea120%2Fjero","video":null,"publish_date":"2025-01-29 19:42:51","author":"Christopher Rugaber | AP","authors":["Christopher Rugaber | AP"],"language":"en","source_country":"us","sentiment":-0.17},{"id":285246676,"title":"Federal workers: Will you take President Trump’s buyout?","text":"On Tuesday, the Trump administration announced it would offer buyouts to all federal employees who choose to leave their jobs by the end of next week, in an effort to downsize the workforce and reform the federal government. \n\nIn a memo sent from the Office of Personnel Management, the downsizing efforts are part of “four pillars” that President Donald Trump is using to reform the federal government. Included in the pillars are: a return to in-person work; updated performance standards that “insist on excellence at every level”; a downsized workforce; and new standards for employee conduct.\n\n“While a few agencies and even branches of the military are likely to see increases in the size of their workforce, the majority of federal agencies are likely to be downsized through restructurings, realignments, and reductions in force,” the OPM memo said. “These actions are likely to include the use of furloughs and the reclassification to at-will status for a substantial number of federal employees.”\n\nThe buyout offer applies to most full-time federal employees, except for military personnel, the U.S. Postal Service employees, and those who work in immigration enforcement and national security, according to the memo. \n\nThe memo said employees who leave their posts voluntarily will retain all pay and benefits, and will be exempted from in-person work requirement until Sept. 30, but they have to choose to do so by Feb 6.\n\nAccording to the Associated Press, the impact of federal downsizing and even just a fraction of federal employees taking buyouts “could send shockwaves through the economy and trigger widespread disruptions throughout society as a whole, triggering wide-ranging — and as yet unknowable — implications for the delivery, timeliness and effectiveness of federal services across the nation.”\n\nSome federal employees said they intend to stay in their positions, according to social media posts.\n\n“I took an oath under this position to the American people and leaving my job under the current state would be failing to maintain my oath as a civil servant,” one federal employee wrote in a thread on Reddit.\n\nIf you’re a federal employee, we want to know: Will you take the buyout, or stay in your position? Are you concerned about the Trump administration’s new directives on the federal government?\n\nTell us by filling out the form or e-mailing us at [email protected], and your response may appear in a future Boston.com article.","summary":"On Tuesday, the Trump administration announced it would offer buyouts to all federal employees who choose to leave their jobs by Feb. 6.\n\n\nThe post Federal workers: Will you take President Trump’s buyout? appeared first on Boston.com.","url":"https://www.boston.com/community/tell-us/2025/01/29/federal-workers-will-you-take-president-trumps-buyout/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/01/https___nytapi.wieck_.com_feed-photos_pLTKn0KQ-679a747c7829a-768x432.jpg","video":null,"publish_date":"2025-01-29 19:42:45","author":"Annie Jonas","authors":["Annie Jonas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":285246134,"title":"Lily James sends temperatures soaring in a skimpy black bikini during sun-soaked holiday","text":"Black Friday\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nWednesday, Jan 29th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nHorrifying moment man is stabbed in the neck after accidentally bumping into a stranger in subway station\n\nLove Island Jack Fincham seen for the first time as he's FREED on bail after being sentenced to six weeks in jail for dog attack\n\nPictured: Female hospital worker, 51, charged with plot to kidnap, rape and murder a girl under 13\n\nExpert reveals four red flag signs your cold is actually something sinister - including cancer\n\nI was a prolific middle-class shoplifter for months until I was caught in the act. Then I discovered what drove me and other wealthy mothers to steal... and I was shocked to my core\n\nPrince Andrew is seen for the first time since daughter Princess Beatrice gives birth - as delighted mother Sarah Ferguson shares heartwarming message\n\nTruth about Wynne Evans' 'sad, derelict house': Star claimed home he bought before divorce had boarded-up windows and his children had to sleep in tents before £500,000 makeover\n\nDEAR JANE: I've discovered my neighbor's dirty little secret. If I expose her it'll ruin her life. But is that so wrong?\n\nReeves's big plan for growth is totally doomed... and it's all the fault of her terrible Budget which has crippled Britain's economy: ANDREW NEIL\n\nWe live next to Heathrow and are terrified we'll have our homes ripped from beneath our feet and demolished so Rachel Reeves can build her third runway\n\nRihanna makes shock court appearance to support boyfriend A$AP Rocky who faces 24 years prison\n\nI thought I'd changed my life after making thousands through Bitcoin... then I found out the truth, says SUSANNAH JOWITT\n\nSchoolgirl, 14, accused of stabbing two teachers and one pupil had told friends 'I'm going to do something stupid', court hears\n\nYard sale painting bought for $50 is undiscovered Van Gogh masterpiece worth gigantic sum, experts say\n\nBlake Lively's brother-in-law apologizes to Justin Baldoni in shocking twist amid $400M lawsuit\n\nWoman, 25, who sent videos of herself FARTING to boyfriend's ex-partner admits harassment\n\nItalian ski resort chaos as 260 buses carrying 10,000 tourists descend at the same time, with slopes overcrowded, streets rammed and the town littered in trash after influencer promoted it\n\n'Nervous' Stacey Solomon reveals she's finally able to share huge news with husband Joe Swash\n\nBritons rank the 15 best and worst Canary Island resorts, with a beach that's 'too full of British tat' at the bottom of the list and a 'beautiful town' rated No.1\n\nI've been unfaithful to my husband eight times but he doesn't know about my sexual betrayals - here's how I got away with it\n\nThe top 10 trending destinations around the world for 2025 revealed by American Express Travel - from a U.S ski resort with fewer crowds to an Australian coastal city with 'vibrant nightlife'\n\nFamily who were accused of force-feeding arranged marriage bride pills and leaving her in a vegetative state are freed from jail after their convictions were quashed\n\nPrincess Beatrice's new baby Athena is officially the lightest ever royal newborn! Here we recall the wide variety of shapes and sizes that Windsor babies have come in at over the last 100 years\n\nStepmom charged with murder after toddler drowns in washing machine\n\nLily James sends temperatures soaring in a skimpy black bikini during sun-soaked holiday\n\n Have YOU got a story? Email tips@dailymail.com\nBy JESSICA JANES FOR MAILONLINE \n Published:19:35 GMT, 29 January 2025 |Updated:19:41 GMT, 29 January 2025 \n\nLily James sent temperatures soaring on Wednesday as she shared a series of vacation snaps from her sun-soaked getaway. \nThe actress, 35, looked incredible as she slipped into a black triangle bikini in sizzling snaps posted on Instagram. \nEscaping the hustle and bustle of the UK, Lily went makeup-free for her beach outing, letting her tousled waves flow freely as she swung on a beachside swing. \nIn another breathtaking shot, she flaunted wet hair while unwinding in a private hut, later diving into a book as the sun set. \nLily also treated her followers to a gorgeous silhouette shot of the sunset, plus a natural selfie showcasing her effortless beauty and embracing her natural hair. \nEarlier this month, Lily gave her followers an insightful look into her recent tropical getaway and also shared a very cheeky inspirational message. \n\nLily James, 35, sent temperatures soaring on Wednesday as she shared a series of vacation snaps from her sun-soaked getaway\n\nIn one breathtaking shot, the actress showed off her natural beauty as she went makeup-free while unwinding in a private hut\nIn one of the snaps, Lily was laid back as she sat down for dinner during the winter escape, covering her mouth with her phone which had a cheeky inspirational message.\nLily's phone case sported the phrase, 'Slow the f*** down'. \nLast month, the English actress was seen leaving London celebrity hangout Chiltern Firehouse with American billionaire Brian Chesky – who is chief executive of Airbnb.\nDespite the late hour, Lily looked elegant in a black faux fur coat, leather trousers and slingback stiletto heels.\nBut US entrepreneur Chesky – said to be worth £6.2billion - seemed keen not to be spotted with the Downton Abbey star, leaving the nightspot via a back entrance and attempting to hide his face as they climbed into a waiting Range Rover together.\nIt is not clear how the pair know each other.\nChesky, 43, who co-founded the short-term-rental app in 2007, is the 355th richest person in the world, according to Forbes, and was in a long-term relationship with artist Elissa Patel until they split in 2022.\nHe has more recently been linked with Sports Illustrated model Brooks Nader.\n\nLily also treated her followers to a gorgeous silhouette shot of the sunset\n\nEscaping the hustle and bustle of the UK, Lily then dived into a book as the sun set \n\nShe also shared a natural selfie that highlighted her effortless beauty and embraced her natural hair \nLily has previously dated Queens Of The Stone Age bassist Michael Shuma, but it is unclear if they are still together.\nLily was also linked to married actor Dominic West while they filmed The Pursuit of Love together. And she had a five-year relationship with former Doctor Who Matt Smith.\nThe actress will be back on the big screen next year in a reboot of the 1993 thriller Cliffhanger.\nShe is also set to appear in Swiped, a film based on the life of Whitney Wolfe Herd, who founded the online dating platform Bumble, so maybe Chesky can offer her some insight into the life of a tech tycoon.\n\nEarlier this month, Lily gave her followers an insightful look into her recent tropical getaway and also shared a very cheeky inspirational message \n\nLast month, the English actress was seen leaving London celebrity hangout Chiltern Firehouse with American billionaire Brian Chesky (pictured last month) - who is chief executive of Airbnb\n\nThe actress will be back on the big screen next year in a reboot of 1993 thriller Cliffhanger (pictured)\n\n Make-up free Lily James poses in a tiny black bikini as she continues to enjoy a sun-soaked holiday \nIn the first shots from the Austrian production, the British actress is shown hanging from a rock face in a shot that mimics one from the original film.\nThe father-daughter duo, Naomi (Lily) and Ray (Pierce Brosnan) 'run a mountain chalet in the Dolomites. During a weekend trip with a billionaire's son, they are targeted by a gang of kidnappers,' an official synopsis reads.\n'Ray's older daughter Naomi, still haunted by a past climbing accident, witnesses the attack and escapes.'\nRay is kidnapped while climbing with the son of a billionaire and Naomi must 'save her family' while fighting 'for survival in the Italian Dolomites,' the synopsis concludes.\nThe film is shot in Austria, Italy and Germany and also stars Nell Tiger Free, Franz Rogowski, Shubham Saraf, Assaad Bouab, Suzy Bemba and Bruno Gouery.\n\nShare or comment on this article: \nLily James sends temperatures soaring in a skimpy black bikini during sun-soaked holiday\n\nAdd comment\n\nEnter search term:\n\nEXCLUSIVETaylor Swift taking a 'step back' from Blake Lively as dramatic legal battle with Justin Baldoni threatens their decade-long friendship\n\nCriminal Love Island star Jack Fincham walks free from court with his Towie girlfriend after being jailed for six weeks for dog attack\n\nBREAKING NEWSRihanna makes shock court appearance to support boyfriend A$AP Rocky who faces 24 years prison\n\nVanessa Feltz's ex Ben Ofoedu breaks his silence on their calamitous split and reveals how he REALLY feels about her: EDEN CONFIDENTIAL\n\n'Nervous' Stacey Solomon reveals she's finally able to share huge news with husband Joe Swash\n\nSomething for everyone! Our edit of the best family holiday destinations to book now for summer\n\nCher Lloyd claims her record label asked her to 'seduce' Justin Bieber to launch her career\n\nLily James sends temperatures soaring in a skimpy black bikini during sun-soaked holiday\n\nCameron Diaz fuels rumor she's quitting Hollywood again for 'extreme' reason\n\n'How this smart money app helped me save £7,000!'\n\nShocking footage shows Taylor Swift get punched while with Travis Kelce in Chiefs' AFC celebrations\n\nThe Voice star Ryan Whyte Maloney's cause of death revealed after shock passing aged 44\n\nShe worked with Blake Lively and Cher while starring in a big Disney movie and is wed to a hunk, who is she?\n\nLisa Snowdon flaunts her jaw-dropping figure as she shares bikini-clad snaps from her sun-soaked birthday celebrations in the Caribbean\n\nNew year, new tech! Our guide to the hottest buys for 2025 whether you're upping your fitness game or renovating your home (and how not to blow the budget!)\n\nEXCLUSIVEThis 80s punk rock icon who traded hard drugs for cardio was spotted with a toothache in LA... can you guess who?\n\nWynne Evans' last chance to fix his career! Singer is latest Strictly star to hire 'cancel culture' crisis PR expert after pulling out of Strictly tour amid sexual remark scandal\n\nBlake Lively's brother-in-law apologizes to Justin Baldoni in shocking twist amid $400M lawsuit\n\nModel nepo baby, 31, who is the daughter of a popstar mother and film director father wows at Valentino runway show - but do YOU know who it is?\n\nGive your brood a boost! Discover how to enhance your homelife with these top 10 brands for families\n\nA Place In The Sun viewers call out house hunters for glaring blunder as they get a VERY nasty shock touring properties with a £350k budget\n\nStrictly's Janette Manrara breaks her social media silence after Wynne Evans' vile 'spit-roast' jibe about her\n\nCandice Swanepoel storms the runway alongside Joan Small and Romee Strijd in the star-studded Elie Saab show during Paris Fashion Week\n\nReese Witherspoon looks chic in blue suit as she reveals update for Legally Blonde prequel series\n\nFrom modern art to ancient monuments - here's how to experience the best of Hong Kong's fascinating local culture\n\nInside Olivia Wilde's murky dating history... from her messy Jason Sudeikis divorce to the Harry Styles drama\n\nExcruciating moment This Morning stars clash in 'rude and patronising' interview - as viewers gasp 'these women REALLY don't like each other!'\n\nConan O'Brien talks preparing to host the 2025 Oscars amid the 'traumatic' LA fires\n\nBBC stalwart quits broadcaster after a whopping 38 years on screens - confirming exit with immediate effect\n\nFrom after-hours fun in Tignes to the endless slopes of Les Sybelles - here's why a ski break in France is always a good idea\n\nJulia Fox goes NUDE on NYC subway for MAC Cosmetics campaign: 'The best I've ever looked'\n\nMartha Stewart's scathing statement about Blake Lively's now defunct lifestyle blog revealed\n\nEd Sheeran ditches his iPad after revealing he hasn't owned a mobile phone for 10 years as he shares pictures from Bhutan concerts\n\nEXCLUSIVETruth about Wynne Evans' 'sad, derelict house': Star claimed home he bought before divorce had boarded-up windows \n\nMum's the word! Here are the top 10 brands for both mother and baby this month\n\nElton John is supported by husband David Furnish at Valentino show during Paris Fashion Week - after opening up about losing his eyesight\n\nMillie Mackintosh speaks out on her 'toxic' marriage to Professor Green as she admits she was drinking and 'medicating with Xanax'\n\nLove Island winner Jack Fincham is FREED on bail as he appeals six weeks jail sentence over Cane Corso Elvis' attack on jogger\n\nDelighted parents! Prince Andrew is seen for the first time since Beatrice gives birth - as Sarah Ferguson says she's 'incredibly blessed to be a granny again'\n\nTour Britannia: Getting to know the Isle of Wight, the Lake District and Llandudno on a hassle-free UK adventure\n\nWynne Evans: 'I've got two personalities': Opera singer admits his goal is to be a 'better' person\n\nMaya Jama dances around in a sports bra before skipping the gym to soak up the South African sunshine in a bikini\n\nEXCLUSIVEBeyonce set to perform string of UK concerts as she presses ahead with world tour amid husband Jay-Z's child sexual assault lawsuit\n\nRebekah Vardy humiliated as her 'Wagatha Christie' business fails to make any profit after she tried to cash in on libel case against Coleen Rooney\n\nAre you ready to book your dream 2025 cruise? These unique itineraries offer MORE amazing destinations and experiences\nAdvertising\n\nTurning Beck time! Shirtless David shows he has still got it at nearly 50 as he teases announcement and shares sizzling snap to social media\n\nMeg Ryan and Billy Crystal recreate iconic When Harry Met Sally scene for Super Bowl spot with Sydney Sweeney\n\nInside Jessica Alba's bizarre 1996 kidnapping case that shook Hollywood\n\nSteamy romcom shatters streaming records despite dire reviews branding it 'bizarre and wooden' - and it's free to stream now\n\nOlivia Attwood swipes 'these are people's husbands!' as she calls out the troubling part of Bonnie Blue's 1057-man romp 'we need to pay more attention to' \n\nBlake Lively's powerful A-list friends who could sink Justin Baldoni's career amid lawsuits (one owns Gucci)\n\nLove Island SPOILER: New bombshells Sammy Root and Danielle Sellers make show history with racy new twist\n\nTaylor and Travis may be taking a major step in their relationship that hints they are on the road to marriage\n\nEmily Atack shares touching tribute to her boyfriend Alistair Garner's late brother Jim as she asks fans to donate to heart disease research\n\nThis £35 hyaluronic acid serum users say plumps and adds glow to skin 'immediately' is a must for winter - here's why\n\nSharon Stone, 66, left stunned as she discovers unbelievable royal ancestry on Finding Your Roots\n\nPeter Andre reveals poignant parenting regret with oldest children Junior, 19, and Princess, 17, on Loose Women after birth of youngest daughter\n\nPrincess Beatrice gives birth to her second daughter with Edoardo Mapelli Mozzi as her adorable name is revealed\n\nStrictly judge Craig Revel Horwood takes a swipe at former professional Ola Jordan after she suggested that he should be replaced\n\nFlog It! antiques expert Michael Baggott's heartbreaking final post before his tragic death aged 51 following a heart attack\n\nDame Joan Collins, 91, proves she's not ready to retire just yet as she takes on the role of Wallis Simpson in a new biopic\n\nWatch Miranda Hart struggle to contain her shock as she's reunited with her Call The Midwife son - and he's unrecognisable\n\nRingo Starr's musician son Zak Starkey admits he feared he would DIE as he speaks for the first time since cancelling gigs \n\nEXCLUSIVEJoanna Page cuts out Wynne Evans! Star fails to defend star as she promotes their joint TV venture as fans call for their show to be axed\n\nHUGE mobile phone offer: Save up to £932 on the new Google Pixel 9 Pro XL with Vodafone - but there's a catch\n\nSelling Sunset star deletes 'tone deaf' post amid LA wildfires after igniting furious backlash\n\nRevealed: How Princess Beatrice's newborn daughter changes the line of succession - as Eugenie and royal cousins are pushed further down\n\nEXCLUSIVESure you quit smoking, Dua? Lipa puffs away and puckers up as she enjoys PDA and a cigarette with fiancé Callum Turner in Paris\n\nThe real reason why TOWIE newcomer Matilda Draper won't be joining the cast in Bali amid rumours she dropped out just a week after joining the show\n\nLove Island winner Jack Fincham is jailed for six weeks after his hulking out-of-control Cane Corso dog Elvis attacked a man\n\nMegan Thee Stallion turns heads in an alien-esque chain-mail dress and matching headpiece as she attends Gaurav Gupta show in Paris\n\nMarisa Berenson was a '60s model who meditated with the Beatles and acted with Liza Minnelli, see her now at 77\n\nRyan Seacrest slammed as 'annoying' and 'lazy' by Wheel of Fortune viewers\n\nEMILY BLACKWELL posted joyous snaps to 400,000 followers of prams and gifts as she counted down the days to her baby's arrival... but, she was living every new mother's nightmare\n\nJane Seymour, 73, looks smitten with boyfriend John Zambetti, 78, after opening up about unexpected romance\n\nPregnant Jesy Nelson is seen for the first time since announcing she is expecting twins with boyfriend Zion Foster as she steps out in sweats while picking up snacks\n\nRosie Huntington-Whiteley stuns in a plunging blazer while pregnant Poppy Delevingne opts for a chic cape at Elie Saab show in Paris\n\nEx Strictly star Giovanni Pernice reveals he needed 'support' of girlfriend Bianca Guaccero during his lowest moments following Amanda Abbington bullying row\n\nUniversity Challenge fans 'staggered and disappointed' as BBC contestants fumble 'mainstream' question about 'total legend' - but can you answer it?\n\nLouise Thompson and fiancé Ryan Libbey break down discussing who they would rather die first in emotional chat - after near-fatal childbirth experience \n\nKelly Brook, 45, admits she has to be careful about any extra weight gain as it goes 'straight to her 34FF boobs'\n\nMia Regan's new man revealed: Romeo Beckham's model ex moves on with new beau - and he's already got her mum's approval\n\nAs Annie Kilner is spotted without her wedding ring, ALISON BOSHOFF reveals how she REALLY feels about Kyle Walker's move to Milan... and what it means for their family\n\nLove Island: All Stars' Luca Bish tries to make amends with Scott Thomas following their explosive row as he saves Tina Stinnes from shock dumping\n\nNew mother Jenna Coleman, 38, stuns in a black lace dress as she enjoys a night out at Barbour dinner in London after welcoming her first child\n\nEXCLUSIVEThe latest All Stars bombshell to return to Love Island revealed - and she'll ruffle feathers with her VERY strong opinions\n\nServing looks! Queen Maxima of the Netherlands looks effortlessly chic as she visits food trade school in Houten while carrying a £7,000 Chanel bag\n\nNHS hell of Flog It! star Michael Baggott: How expert told worried fans he had been left 'badly dehydrated' while bed-bound following stroke\n\n'I fell out of love with my body': Rebecca Adlington opens about struggling with two 'heartbreaking' miscarriages\n\nHis mom is a model legend and dad is a singer... can you guess the nepo baby who made his runway debut?\n\nEXCLUSIVEDR PHIL: Dry your eyes, Selena Gomez. The child rapists and murderers I saw detained in Trump's migrant raids don't deserve your tears\n\nAll seasons of legendary nineties sitcom hailed by fans as their 'favourite EVER growing up' and 'the funniest show on TV' finally land on Netflix\n\nColeen Rooney wraps up in a fleece coat as she leaves her Pilates class after a morning workout\n\nTom Kerridge's brutal comeback to critics who moan about price of his £37 fish and chips\n\nThe One Show fans floored by Karren Brady's 'fantastic' appearance - gasping 'I had to do a double take!' at the 55-year-old Apprentice star's ageless looks\n\nEXCLUSIVE'I turned on the TV and my heart was warmed by Catherine's significant gesture on Holocaust Memorial Day', writes REBECCA ENGLISH\n\nFlog It! antiques expert Michael Baggott dies aged 51 following heart attack as his co-stars pay tribute\n\nLisa Rinna, 61, looks unrecognisable as she ditches her blonde pixie 'do for a bold new look at Schiaparelli's Paris Fashion Week show\n\nRita Ora flaunts her toned frame in a busty sports bra as she enjoys 7am Pilates session while in Australia filming new Marvel film Voltron\n\nGood Morning Britain viewers complain to Ofcom over Ranvir Singh's 'abysmal' failure to mention Jews in Holocaust coverage\n\nMeghan's college best friend reveals secret gushing book dedication to Duchess - and reflects on her 'wonderful' choice to marry Prince Harry\n\nTravis Kelce reveals whether Taylor Swift listens to his and brother Jason's podcast\n\nLorraine Kelly brands Wynne Evans a 'nutter' for sick sex jibes - raging 'why would you think that's acceptable?!' in GMB rant as he's axed from Strictly tour\n\nNow Wynne Evans's £200,000-a-year GoCompare gig is at risk: Firm refuse to say if they back disgraced star after he was axed from Strictly tour for crude 'spit roast' remark\n\nThe Chase fans rage 'have some shame!' after player's controversial advice to her teammates - as Mark Labbett gasps 'how can you say that?!'\n\nAs Madonna's daughter bares all, has it all gone wrong for Paris Fashion Week? Haute Couture event is overrun with starlets flashing flesh\n\nNoel Clarke accuses Guardian journalists of deleting messages they shared during investigation into sexual misconduct claim, High Court hears\n\nGood Morning Britain fans brand Chris Packham an 'absolute joke' as he defends Just Stop Oil protests live on show \n\nEXCLUSIVEInside Selena Gomez's decision to delete crying video about migrants after it sparked deportation calls\n\nJamie Oliver hits out at cultural appropriation rows after critics tried to cancel his jerk rice and paella recipes\n\nNick Cave's son Earl looks stylish in an edgy oversized blazer as he attends the Saint Laurent menswear show during Paris Fashion Week\n\nRihanna puts on a united front with boyfriend A$AP Rocky as they enjoy a night out as she 'considers' visiting LA court for rappers' trial\n\nWynne Evans 'splits from girlfriend after she was left \"humiliated\" by his X-rated remark' as he breaks silence on Strictly tour withdrawal and issues apology\n\nSmallville star Tom Welling's shock transformation revealed in mugshot after DUI arrest\n\nAnya Taylor-Joy puts on a leggy display in a mini dress as she joins husband Malcolm McRae at Lenny Kravitz's Paris Fashion Week party\n\nGangs Of London's season three trailer is finally revealed - as British TV's 'most violent' show is set to return to screens in just months\n\nBonnie Tyler, 73, leaves Richard Madeley, 68, red-faced as she flirts with flustered presenter on GMB\n\nHarrison Ford the heartthrob! Actor, 82, strips off in the bathtub before meditating in tiny shorts for new whisky campaign\n\nMaura Higgins stars in nude campaign as she puts on a VERY risqué display in skimpy lingerie for MAC Cosmetics\n\nDavid Beckham packages up home-harvested honey once cheekily dubbed his 'sticky stuff' by wife Victoria\n\nBrad Pitt sports a bushy silver beard and a bucket hat as he steps out after finalising eight-year divorce battle with Angelina Jolie\n\nTV fans beyond excited as 'transfixing' series with 99% Rotten Tomatoes score returns to screens next week - raving 'it's going to be epic!'\n\nNick Knowles' fiancée Katie Dadzie, 34, flashes her toned legs in a black thigh-split dress as she supports the DIY SOS host, 62, at Radio Times event\n\n'Don't give up the fight': Madonna takes a swing at Donald Trump for 'dismantling' the freedoms for LGBTQ people \n\nMadonna's daughter Lourdes Leon goes BRALESS in a sheer catsuit as she joins modest Zoe Kravitz and Iris Law at Saint Laurent's PFW show\n\nAlan Carr admits he struggles to remember his 'worth' as he opens up about dating after his divorce from husband of 13 years\n\nKatya Jones 'unfollows' Wynne Evans' ex-girlfriend Liz Brookes as dancer urges people to 'show compassion' following his tour withdrawal \n\nKristen Stewart looks edgy as she is supported by her mother at Love Me screening with co-star Steven Yeun\n\nTOWIE's Joe Blackman packs on the PDA with boyfriend Junaid Ahmed as he risks an awkward run-in with ex Harry Derbridge \n\nEXCLUSIVECharlotte Crosby confirms she WON'T return to Geordie Shore as she 'isn't about that life' anymore\n\nKate Ferdinand reveals she won't have anymore children to 'save her sanity' after becoming a parent to five\n\nDua Lipa and Callum Turner put on a very loved-up display as they lead the stars at glamorous Tiffany event in Paris\n\nPregnant Poppy Delevingne shows off her baby bump in a glittering sheer gown as she party-hops around Paris Fashion Week\n\nPrue Leith, 84, admits she is 'conscious it's nearly the end' of her life in an emotional confession about her health\n\nDua Lipa's sister Rina puts on a leggy display as she joins the singer and her fiancé Callum Turner at Paris hotspot Costes to celebrate their engagement\n\nAnya Taylor-Joy puts on a racy display in a lace bodice mini dress as she cosies up to glamorous Rosie Huntington-Whiteley at PFW party\n\nEXCLUSIVEThe Boyzone bandmates you've NEVER heard of: How two singers were cruelly dumped from the initial line-up by Louis Walsh just before act went stratospheric \n\nFans divided over Martha Stewart's outrageous new thirst trap video at 83: 'Is this OnlyFans?!'\n\nSuperman director James Gunn defends 'goofy' new clip after it was mocked by fans sparking frenzy of memes\n\nHeartwarming reason why Quentin Tarantino is waiting to film his final movie\n\nKylie Jenner puts on a leggy display in figure-hugging black mini dress as she grabs lunch during outing in Paris\n\nJessica Biel looks chic in beaded blazer at Giorgio Armani show for rare Paris Fashion Week appearance\n\nRoseanne Barr reveals why Trump's inner circle have given her the cold shoulder despite going full MAGA\n\nIdris Elba says kitchen knives should have their ends rounded off to help stop violent gang crime\n\nOrlando Bloom reacts to Keira Knightley's criticism of their Pirates of the Caribbean movies\n\nWhy I fear there is a troubling code of silence among Strictly stars over Wynne's vile 'spit-roast' slur\n\nDrake is all smiles as he dances in elevator and shows off jaw-dropping win at Crown Melbourne\n\nCLAUDIA JOSEPH: All the ways Carole Middleton and her daughters are just like the late Queen as we celebrate her milestone birthday\n\nBachelor Nation's Rachael Kirkconnell reveals real reason Matt James dumped her in bombshell tell-all interview\n\nAmy Schumer recalls Bradley Cooper's brutal two-word comment that left her ego in tatters\n\nWynne Evans suffers fresh blow as opera singer 'fights to save £1million Go Compare job and new BBC travel series' after 'splitting from girlfriend' \n\nShaughna Phillips shows off her six stone weight loss in racy black lace lingerie as she reveals how much her transformation has affected her boobs\n\nExpert issues urgent health warning over Cardi B 'butt crack' piercing\n\nCharli XCX 'won't be performing at the Brit Awards despite leading the nominations' - as new artist is revealed\n\nMachine Gun Kelly reacts to claim he and ex Megan Fox are 'not talking' ahead of birth of first child together\n\nEXCLUSIVETexts reveal Blake Lively's VERY flirty exchanges with Justin Baldoni before they went from friendly co-stars to enemies\n\nBradley Cooper bonds with daughter Lea, 7, as they brave the New York City chill days after enjoying Philadelphia Eagles big win\n\nThe Home Edit star Clea Shearer, 42, undergoes 8th breast cancer surgery in two years\n\nParis Hilton and sister Nicky pose for rare family photo with their children at charity party\n\nBruno Mars breaks silence on THAT $50 million gambling debt rumor\n\nKristen Stewart goes BRALESS under see-through Chanel jacket with Steven Yeun at Love Me screening\n\nWynne Evans pulls out of Strictly live tour: Opera singer agrees with BBC to 'take time out' after repeated warnings about his behaviour\n\nColeen Nolan admits she's struggling to pay her bills and has money 'worries' - after buying North Staffordshire farm last year\n\nThe Traitors' Linda eyes up another villainous role on the stage after her Oscar-worthy acting skills made her the show's standout star\n\nStrictly tour stars look to be in high spirits as they arrive back at their Liverpool hotel - after Wynne Evans withdrew from show \n\nMatty Healy's fianceé Gabbriette Bechtel flashes underboob in a daring sheer minidress at Saint Laurent's Paris Fashion Week show\n\nDrake Down Under! Rapper arrives in Melbourne by private jet and shows off his insane $25,000-per-night hotel\n\nReese Witherspoon shows off her legs in cute black look as she poses on the red carpet with co-star Will Ferrell at You're Cordially Invited screening in NY\n\nKanye West's ex Amber Rose opens up about being 'canceled' for supporting Donald Trump\n\nKylie Jenner models a Chanel crop jacket and mini skirt after getting sent over $150K worth of designer purses for Paris Fashion Week\n\nKendall Jenner's bizarre semi-nude gown causes pal Hailey Bieber to break down in tears\n\nLove Island All Stars reveals TWO new bombshells: Sammy Root and Danielle Sellers prepare to shake things up as THREE Islanders get the boot in shock mass dumping\n\nAnthony Mackie forced to address his controversial Captain America comment after stoking online outrage\n\nPregnant Jennifer Lawrence opts for comfort in trendy 'rich mom' sneakers on outing with husband Cooke Maroney\n\nKylie Jenner's BFF Stassie Karanikolaou sizzles in barely-there bikini during Turks and Caicos getaway\n\nEllen DeGeneres' bizarre connection to It Ends With Us amid Blake Lively and Justin Baldoni drama\n\nBen Fogle who starred in BBC's Castaway 2000 reveals he would do it all over again 25 years later\n\nVicky Pattison's Channel 4 doc is branded 'excellent and brave' by fans as they commend her for 'shining light on darkest corners of Internet' - despite backlash\n\nBen Affleck shows off charitable side volunteering at LA homeless site after reuniting with ex-wife Jennifer Garner\n\nLady Gaga breaks her silence on disastrous reception to box office bomb Joker: Folie à Deux\n\nBilly Ray Cyrus breaks his silence with coded message for his son Trace and Australian ex-wife Firerose: 'Let this moment be the start of healing'\n\nChappell Roan breaks silence over contentious Triple J Hottest 100 win... after outraged fans petitioned for broadcaster to be 'defunded'\n\nThe Voice star Ryan Whyte Maloney dead at 44: Singer passes away hours after posting poignant bar video\n\nEXCLUSIVELouis Walsh, 72, agreed to tell his side of the story in Boyzone documentary while undergoing chemotherapy for rare blood cancer\n\nMadonna, 66, posts rare snap WITHOUT filters after hinting at major career change\n\nBBC bosses 'hire top ITV star to host Traitors-style quiz show' after finale pulled in 7.4m viewers\n\nJulia Fox fans are left baffled as she appears on a billboard for New Jersey real estate\n\nWho left Love Island? THREE All Stars get the boot in shocking mass dumping as brutal twist leaves the villa in tears\n\nEXCLUSIVEDiddy's assistant recalls sickening moment he was ordered to have sex to prove his 'loyalty' to the 'King'\n\nMeryl Streep was forced to make a quick-thinking escape from $4M home amid LA fires... and it involved wire cutters\n\nEXCLUSIVE Explosive clue that The New York Times prepped report about Blake Lively's sex assault claims against Justin Baldoni FOUR days before complaint was filed\n\nKatya Jones breaks silence on Wynne Evans' Strictly withdrawal after Opera singer apologised for his 'inappropriate actions'\n\nKate Lawler sets pulses racing as she showcases her jaw-dropping physique in slew of bikini snaps from Saint Lucia\n\nCher Lloyd reveals she battled postnatal depression after the birth of her second daughter and admits it left her unable to 'sleep or eat' \n\nDave Franco addresses Luigi Mangione comparisons after fans begged for star to play 'CEO killer' in movie\n\nDolly Parton, 79, reveals heartbreaking reason she's turning her life into a musical\n\nChris Pratt grosses out fans with FIRST baby picture with Katherine Schwarzenegger\n\nApprentice star Lord Sugar reveals 'kiss of death' interview question that gets candidates instantly fired and swipes 'hard graft has gone' from modern workplaces\n\nTasha Ghouri's parents drop big hint she may have reunited with 'ex-boyfriend' Andrew Le Page\n\nAFL star Jimmy Bartel enjoys a family holiday in Noosa with his rarely-seen partner Amelia and their daughter Paloma, one\n\nAmanda Bynes puffs on her vape as she gives telling hint about engagement rumors\n\nNikita Kuzmin and model girlfriend Lauren Jaine walk hand-in-hand as they stroll around Liverpool\n\nSuits creator is 'open' to Meghan Markle reprising her role as Rachel in a Los Angeles-set spinoff\n\nRoseanne Barr reveals wild new idea for a TV series comeback... 7 years after being cancelled\n\nMaya Jama flaunts her jaw-dropping figure in red latex catsuit for latest Rimmel London campaign\n\nSmallville star Tom Welling ARRESTED for DUI in Arby's parking lot\n\nRachael Kirkconnell breaks silence on Matt James split and cheating rumors ahead of Call Her Daddy interview\n\nWynne Evans WILL return to the BBC with All At Sea despite his withdrawal from Strictly tour over X-rated remark - after fans questioned why the show wasn't postponed\n\nDemi Moore exudes sophisticated glamour in sequinned blazer and velvet trousers as she leaves her hotel during Paris Fashion Week - after landing her first Oscar nomination\n\nSunrise viewers accuse breakfast show of copying rival Today: 'Always chasing that viral moment'\n\nThe REAL reason Phil Spencer did not attend Location, Location, Location co-host Kirstie Allsopp's top secret wedding to millionaire property tycoon \n\nKyle Richards breaks her silence over 'lesbian' rift with fellow RHOBH star Garcelle Beauvais\n\nHow Billy Ray Cyrus has 'lost faith' after Firerose divorce and Trump inauguration performance backlash\n\nPregnant Kelsey Parker attends April Banbury's bridal launch after revealing she is expecting her first child with boyfriend Will Lindsay\n\nReese Witherspoon is ready for Valentine's Day with a red blouse amid You're Cordially Invited press flurry\n\nKathryn Newton dazzles in a sheer gold dress at Georges Chakra Haute Couture's Paris Fashion Week show\n\nChloe Ferry 'overwhelmed with love and support' as she reveals her surgery to reverse botched cosmetic procedures 'went to plan'\n\nOscar-nominated actress, 77, who worked with David Bowie is pictured in very rare sighting... can you guess who?\n\nDesperate Housewives vet Teri Hatcher, 60, is a wrinkle-free wonder outside a Brazilian jiu-jitsu gym in LA\n\nAshlee Simpson and husband Evan Ross prove they're still going strong as sister Jessica faces divorce\n\nEXCLUSIVECalculated reason Justin Baldoni is suing Blake Lively and Ryan Reynolds for the eye-watering sum of $400 million\n\nAmelia Gray Hamlin flaunts her incredibly chiselled abs in tiny pink crop top and low slung jeans at Chanel show during Paris Fashion Week\n\nAnnie Kilner steps out without her wedding ring as she emerges for the first time since snubbing Kyle Walker's AC Milan move and staying in the UK\n\nChaos at the BBC as they refuse to confirm whether Wynne Evans is axed from Strictly tour following 'repeated warnings about his behaviour'\n\nTimothee Chalamet gifted jersey by Knicks star Karl-Anthony Towns as he settles Kylie Jenner feud rumors\n\nColeen Rooney shares a glimpse of her family's £20m Cheshire mansion with an entrance hall boasting two staircases and a luxurious marble floor \n\nPregnant Charlotte Dawson shows off her blossoming bump at star-studded parenting event \n\nLove Island is embroiled in 'bullying' row as fans accuse contestants of 'picking on' TWO different All Stars\n\nGossip Girl star Kelly Rutherford poses with her son Hermes for first time in 10 YEARS... after $2M custody battle\n\nCher Lloyd defends her 'supportive' X Factor mentor Cheryl despite their bitter feud that followed her tumultuous time on the show\n\nKylie Jenner narrowly avoids awkward run-in with boyfriend Timothee Chalamet's ex Lily-Rose Depp\n\nBelow Deck Sailing Yacht co-stars shock fans by splitting after only a year of romance\n\nWynne Evans' brother Mark shows his 'unwavering support' for the star and insists he 'has a heart of gold' amid claims he's been 'axed from the Strictly tour' after X-rated jibe\n\nGogglebox star Daniel Lustig talks about marrying again and reveals what he would do differently this time after split from Stephen Webb\n\nAdvertisement\n\nMORE DON'T MISS\n\nSophie Turner sends temperatures soaring in a purple bikini as she enjoys a lavish girls' getaway at a £2,400-per-night resort in the Maldives\n\nParis Fury and Tyson Fury put on a united front as they enjoy romantic getaway to Scotland - after the pair went three months without speaking\n\nCoronation Street star Jack P Shepherd says a soap fan left him 10 percent of their estate after they died - and reveals how he spent the unexpected windfall\n\nLady Gaga vows 'we're not going down without a fight' in fiery interview after Trump election victory\n\nAs science confirms women really DO prefer younger men, can YOU guess the age of showbiz's biggest cougars? \n\nBobby Norris shows off the results of his hair transplant following battle with his appearance - as he makes heartfelt plea over homophobic attack\n\nKay Burley reveals major health update in her sister Jacqueline's cancer battle after the illness killed their sister, grandmother and three of her friends\n\nRonan Keating hurt so badly by Boyzone documentary he was left 'on the floor in a mess' - recounting 'very difficult' times at hands of Louis Walsh on GMB\n\nHappy Valley and Trigger Point stars team up in first look at new police corruption thriller Protection - but can it stand up to Line Of Duty?\n\nPregnant Megan Fox and ex Machine Gun Kelly hit with major drama just weeks before baby's due date\n\nLady Gaga's fiancé Michael Polansky says he's 'really lucky' and reveals what he calls her in private\n\nBritain's smallest glamour model insists 'I'm taking power back' after being 'sexualised' by men for posting body positive pics in bikinis and lingerie\n\nShaughna Phillips shows off her dramatic six-stone weight loss in a bikini and reveals how she shed the pounds\n\nGregg Wallace's wife Anna shares cryptic quote in rare post amid the former MasterChef star's sexual misconduct probe\n\nAnais Gallagher looks sensational in a vintage hot pink party dress as she celebrates her 25th birthday\n\nMacaulay Culkin and Brenda Strong think they 'would've hated each other' if they had met 10 years earlier\n\nKylie Jenner flashes her toned abs in a red bra for sexy Khy shoot before Valentine's Day\n\nBrooklyn Beckham shares major career announcement as the aspiring chef makes savvy business move\n\nLove Island All Stars SPOILER: Harriett Blackmore confronts Ronnie Vint over his cheating past as former couple attempt to mend broken bridges\n\nHollyoaks star reveals he's signed a new contract to keep him on the show until 2026 amid soaps' mass cast exodus\n\nWynne Evans snubbed his own birthday meal with his Strictly co-stars hours before it was revealed he has been axed from the tour\n\nLove Island: All Stars SPOILER: Chaos as THREE Islanders set to be axed in shock mass dumping\n\nNetflix confirms return of legendary movie after livid fans branded its axing an 'absolute disgrace'\n\nCristiano Ronaldo fuels marriage rumours to Georgina Rodriguez with two-word message amid speculation couple wed in SECRET\n\nHeidi Montag lands first VOGUE interview as she talks losing 'irreplaceable' designer clothing in LA fires\n\nEXCLUSIVEStrictly star Jowita Przystal in secret romance with EastEnders actor Jamie Borthwick after former partner Pete Wicks let slip their close bond\n\nGrinning Katya Jones steps out after publicly showing support for Strictly partner Wynne Evans - as his glittering career hangs in the balance\n\nLesley Joseph makes first TV appearance since Pauline Quirke's dementia diagnosis - paying emotional tribute to time on Birds Of Feather\n\nSelena Gomez defended by Flavor Flav over tearful video about Trump's deportation policy after brutal backlash\n\nMartha Stewart reveals how her parole officer stopped her from hosting SNL\n\nHarrison Ford, 82, models a kilt in Scotland for new 'amusing' side hustle gig\n\nBritney Spears' ex Sam Asghari insists he's 'not sad' marriage ended as he says he 'stayed grounded' in their relationship despite her fame\n\nNetflix is removing a 'masterpiece' horror film dubbed 'better than The Exorcist' with 99% Rotten Tomatoes score - you only have days left to watch it\n\nHow under-fire Wynne Evans found love again with new girlfriend after breakdown of his 16-year marriage which left him at rock bottom - as his X-rated sex jibe scandal rumbles on\n\nFernanda Torres makes first appearance since issuing apology for blackface controversy as Oscar-nominee attends Chanel presentation \n\nCoronation Street's horror blaze leaves Max fighting for life and Toyah hospitalised - but who started it?\n\nThis Morning's Eva Speakman is forced to defend husband Nik's changing face after cruel trolls criticised his new appearance\n\nEmotional Kate Ferdinand reveals she felt like her step children 'didn't love her' after she gave birth to her son Cree\n\nJamie Oliver claims his 'hero' Marco Pierre White 'still doesn't like him' after he 'destroyed' him when they first met - as he breaks silence on long-running feud\n\nEastEnders' Denise and Ravi's passionate affair exposed and Walford legend rushed to hospital after garage brawl\n\nJamie Oliver fans baffled after he keeps 'glugging' expensive olive oil and salt all over his dishes in his £1 meal series\n\nHit BBC drama thrown into chaos as production on new series is halted 'right in the middle of filming' after 'really stressful' emergency\n\n'I used to drink and smoke a lot': Lady Gaga admits she was 'always looking for an out' while battling demons and reveals sweet thing her fiancé Michael Polansky said when they first met\n\nEXCLUSIVEThe Traitors star Livi Deane reveals her rare eye cancer was only picked up after begging to go opticians because she was jealous of her sister's glasses \n\nDua Lipa sheds her dramatic floor-length cape and changes into a tailored two-piece as she attends Chanel show at Paris Fashion Week\n\nPete Doherty is every inch the family man as he spends time with daughter Billy-Mae and partner Katia de Vidas before heading back home to Normandy\n\nHow Kendrick Lamar plans to troll bitter rival Drake in Super Bowl half-time show\n\nEXCLUSIVEBridget Fonda, 61, shows off dramatic weight loss in rare sighting amid Hollywood's Ozempic craze\n\nEmmerdale's missing April's fate finally revealed - while Noah is lured away by a fresh start abroad\n\nChelsea star Alvaro Morata and model wife Alice Campello are back together - five months after announcing split following Spain's Euro 2024 triumph\n\nStrictly fans unearth awkward moment between Wynne Evans and Katya Jones as BBC insiders describe timing of his new series as 'deeply unfortunate'\n\nDigging it! Prince William beams as he visits Hereford farm working to become net zero on his Duchy of Cornwall estate\n\nLily-Rose Depp, 25, oozes sophistication in a boucle co-ord as she joins lookalike mother Vanessa Paradis, 52, at the Chanel show during Paris Fashion Week\n\nKylie Jenner's high fashion moment! Billionaire gets approval from Chanel as ab-flashing star is the main attraction at the Paris Fashion Week show\n\nLeigh Francis says he 'doesn't regret' his controversial portrayal of black stars Craig David and Trisha Goddard on Bo Selecta\n\nCome Dine With Me viewers rage 'what an awful show this has become!' as new series kicks off with string of 'attention-seeking' hosts\n\nPamela Anderson, 57, goes makeup-free as she stuns in a dramatic white frilled co-ord while attending the Chanel show at Haute Couture Fashion Week \n\nMeghan Markle's ex-Suits co-star Gabriel Macht reveals he has left America with his family but is keeping his new home with actress wife secret\n\nVicky Pattison fights back tears and admits 'I know it has ruffled some feathers' as she addresses explosive backlash to 'leaking' her own deepfake sex tape\n\nFormer gang leader 'claims he's agreed a boxing fight against Tommy Fury' - after former Love Island star pulled out of bout with Darren Till\n\nNetflix viewers 'are losing their minds' over the return of 'amazing' drama appearing on screens this week\n\nNow Meghan 'delays' new episodes of her Archetypes podcast after postponing her Netflix cookery show - following bombshell claims \n\nEXCLUSIVEDevastated MAFS star breaks down as her ex - one of Australia's most notorious gangland figures - is executed in a hail of bullets\n\nHugh Grant, 64, strolls alongside leggy wife Anna Eberstein, 41, as they depart the Paris premiere of Bridget Jones: Mad About the Boy\n\nColeen Rooney is gym-chic in a fluffy white jacket for an early morning workout after revealing how she and Wayne are sharing the parenting load\n\nEXCLUSIVECharlotte Crosby breaks silence on terrifying armed burglary - admitting she's 'rethinking her future' after ordeal caught on camera\n\nEXCLUSIVEREVEALED: Justin Baldoni's voice note to Blake Lively addressing It Ends With Us rooftop scene feud\n\nBritney Spears' ex-husband Sam Asghari reveals 'weirdest thing' about relationship in rare interview about her\n\nChloe Ferry in hospital as she prepares to undergo surgery to reverse botched cosmetic surgery after 'mistakes' left her battling depression\n\nWicked star Cynthia Erivo says London drama school RADA dismissed her as 'lazy'\n\nTamzin Outhwaite, 54, shows off her toned figure in a one-shoulder swimsuit as she works out on a balcony in Malta\n\nCher Lloyd becomes latest X Factor star to hit out at bosses as she says she was on antidepressants aged 16 after being 'painted as villain' on the show\n\nBBC announces return of beloved comedy series as EastEnders legend joins cast after 13 years off screens\n\nDancing On Ice star Ferne McCann was 'let down' by friends who 'ignored her appearance on the show and did not encourage followers to vote for her' before she was axed\n\nRita Ora sizzles in tiny bikinis and skimpy summer dresses as she shares holiday snaps from Australia's Gold Coast\n\nSheridan Smith drama The Castaways branded 'completely unwatchable' after 'slow and shoddy' launch as viewers rage 'I can't follow anything!'\n\nInside Kate's sweet relationship with her 'old friend' Holocaust survivor Yvonne Bernstein as they share emotional reunion hug \n\nPrince Harry makes heartfelt plea for WellChild nominations from his Montecito mansion\n\n'80s pinup who worked with Harrison Ford and wed an Oscar-winner still looks stunning at 71... who is she?\n\nBraless Rosie Huntington-Whiteley looks sensational in a cut out top as she leaves Costes party during Paris Fashion Week\n\nHarry Derbidge shows off his impressive six month gym transformation in shirtless selfies following split from Joe Blackman\n\nThe hidden meaning behind Kate's necklace: Princess of Wales wore stunning pearl necklace from celebrated Jewish curator during moving Holocaust Memorial Service\n\nNicole Scherzinger puts on a busty display in a pink satin mini dress as she steps out in style in NYC\n\nEastEnders star Jessie Wallace reveals the major change she made to one of the BBC soap's most ICONIC scenes - as she calls for the return of legendary character\n\nGood Morning Britain host Ranvir Singh apologises after she faced furious backlash for failing to mention Jews as being victims of the Holocaust\n\nKimberley Garner looks stylish in a navy suit as she departs the Costes party with hunky new boyfriend during Paris Fashion Week\n\nEXCLUSIVEOlivia Attwood wages war with Bonnie Blue as she reveals why OnlyFans star WON'T feature on her new documentary \n\nSoap schedule shake-up as Coronation Street episode pulled from screens this week - leaving fans livid\n\nSelena Gomez hits back at Senate candidate who called for her to be 'deported' for sympathizing with migrants\n\nElizabeth Hurley, 59, puts on a racy display as she models plunging kaftan from her clothing line\n\nWham! star Pepsi opens up about 'shame' she felt after suffering 'traumatic' miscarriage as she shares moment she 'knew she'd never have children'\n\nRenee Zellweger stuns as she reunites with Hugh Grant on the red carpet at Bridget Jones Mad About The Boy premiere in Paris\n\nJeremy Clarkson set to launch his own range of cosmetics from his Diddly Squat Farm Shop after applying for bizarre trademark\n\nBBC Radio 1's Big Weekend reveal location for 2025 and announce huge indie singer as first headliner\n\nHollywood's 'funny fat guy' Josh Gad fears Ozempic will ruin his career after 40lbs weight loss\n\nJesy Nelson pokes fun at herself for saying she didn't want kids before announcing her pregnancy with boyfriend Zion Foster: 'That aged well'\n\nCara Delevingne goes makeup free in a vintage band T-shirt and cycling shorts as she leaves the gym\n\nWynne Evans suffers TV backlash as BBC viewers question why his travel show All At Sea wasn't postponed after latest scandal \n\nCardi B posts photo proof of wild new 'butt crack' piercing after fans accused her of lying\n\nMegan Thee Stallion stuns in creamsicle hooded dress at Giambattista Valli show during Paris Fashion Week\n\nEXCLUSIVEKyle Walker's wife Annie Kilner opts to stay in UK instead of going to Italy to watch his AC Milan debut \n\nBradley Cooper and daughter Lea, 7, wear matching Philadelphia Eagles hats after enjoying big win together\n\nLove Island: All Stars set to be rocked by a mass cull as 'multiple islanders' face being axed from the villa\n\nEXCLUSIVEOlivia Wilde's surprise new love revealed two years after Harry Styles split\n\nAnna Nicole Smith's daughter Dannielynn, 18, swoons over meeting this A-list star and Broadway veteran\n\nTravis Kelce plays coy over adorable Taylor Swift-themed clue while hosting Are You Smarter Than A Celebrity\n\nTwo actors, two rugby aces and even a Gladiator: A look back at Kelly Brook's romantic history including four failed engagements\n\nLove The Night Agent? Here are the other spy thrillers you NEED to be watching - including one that starts TONIGHT\n\nReese Witherspoon cuts a stylish figure in black while on a shopping trip in New York City\n\n'My parents weren't proud of me and my own brother didn't trust me' - Spencer Matthews opens up about his demons \n\nInside Charles and Camilla's 'coming out' party at the Ritz: On this day 26 years ago they began their public relations comeback with an iconic photo...\n\nEXCLUSIVEBoyzone's Keith Duffy breaks down at the premiere of new tell-all docuseries rememberingStephen Gately \n\n50 Cent will fight suit brought about by man represented by Gloria Allred over alleged SUV assault in LA\n\nJustin Baldoni is all smiles after leaking bombshell Blake Lively evidence in It Ends With Us lawsuits\n\nThe lucrative Hollywood job Heidi Montag and Spencer Pratt would STILL refuse despite losing everything in fire\n\nRHOBH marriage curse cuts deep for Kyle and Dorit as lives crumble on explosive mid-season trailer\n\nEight-time Grammy nominee looks almost unrecognisable but for her signature flaming red hair as she appears alongside Vernon Kay on BBC Radio 2 - but who is she?\n\nHow The Traitors star Claudia Winkleman stays camera-ready - from spin classes and CBD oil to daytime snoozes and strictly no caffeine\n\nGwyneth Paltrow finally sells the house that Goop built for the cut price of $22 million amid major life change\n\nRyan Reynolds sparks concern after appearing at Hugh Jackman's show looking 'like he hasn't slept for days'\n\nRihanna 'considering' visiting court in Los Angeles where her boyfriend A$AP Rocky is due to stand trials on firearm assault charge\n\nQueen Of Versailles' Jackie Siegel shares rare update on $100 million Florida megamansion... 21 YEARS after construction began\n\n'90s indie icon is unrecognisable as she announces she is releasing new music - Can YOU guess who it is?\n\nToday's headlines\n\nHorrifying moment man is stabbed in the neck after accidentally bumping into a stranger in subway station\n\nLove Island Jack Fincham seen for the first time as he's FREED on bail after being sentenced to six weeks in...\n\nPictured: Female hospital worker, 51, charged with plot to kidnap, rape and murder a girl under 13\n\nExpert reveals four red flag signs your cold is actually something sinister - including cancer\n\nI was a prolific middle-class shoplifter for months until I was caught in the act. Then I discovered what...\n\nPrince Andrew is seen for the first time since daughter Princess Beatrice gives birth - as delighted mother...\n\nTruth about Wynne Evans' 'sad, derelict house': Star claimed home he bought before divorce had boarded-up...\n\nDEAR JANE: I've discovered my neighbor's dirty little secret. If I expose her it'll ruin her life. But is...\n\nReeves's big plan for growth is totally doomed... and it's all the fault of her terrible Budget which has...\n\nWe live next to Heathrow and are terrified we'll have our homes ripped from beneath our feet and demolished...\n\nWoman, 25, who sent videos of herself FARTING to boyfriend's ex-partner admits harassment\n\nI thought I'd changed my life after making thousands through Bitcoin... then I found out the truth, says...\n\nSchoolgirl, 14, accused of stabbing two teachers and one pupil had told friends 'I'm going to do something...\n\nYard sale painting bought for $50 is undiscovered Van Gogh masterpiece worth gigantic sum, experts say\n\nTaylor Swift taking a 'step back' from Blake Lively as dramatic legal battle with Justin Baldoni threatens...\n\nRevealed: The Voice star Ryan Whyte Maloney's cause of death, aged just 44\n\nItalian ski resort chaos as 260 buses carrying 10,000 tourists descend at the same time, with slopes...\n\n'Nervous' Stacey Solomon reveals she's finally able to share huge news with husband Joe Swash\n\nBritons rank the 15 best and worst Canary Island resorts, with a beach that's 'too full of British tat' at...\n\nI've been unfaithful to my husband eight times but he doesn't know about my sexual betrayals - here's how I...\n\nThe top 10 trending destinations around the world for 2025 revealed by American Express Travel - from a U.S...\n\nFamily who were accused of force-feeding arranged marriage bride pills and leaving her in a vegetative state...\n\nPrincess Beatrice's new baby Athena is officially the lightest ever royal newborn! Here we recall the wide...\n\nStepmom charged with murder after toddler drowns in washing machine\n\nScientists uncover the 'strongest evidence yet' for aliens: Breakthrough study confirms asteroid Bennu...\n\nPrincess Beatrice's daughter is wrapped in plush £220 blanket made by distant Greek cousin in first photo\n\nA Place In The Sun viewers call out house hunters for glaring blunder as they get a VERY nasty shock touring...\n\nTrump scores stunning symbolic victory as feds flush out America's most notorious criminal migrant hub\n\nSharon Stone, 66, left stunned as she discovers unbelievable royal ancestry on Finding Your Roots\n\nWhy am I paying £710 a year in car tax while my neighbour only pays £190 for the same make of car?\n\nInside Olivia Wilde's murky dating history... from her messy Jason Sudeikis split to the Harry Styles drama\n\nExcruciating moment This Morning stars clash in 'rude and patronising' interview - as viewers gasp 'these...\n\nAs Madonna's daughter bares all, has it all gone wrong for Paris Fashion Week? Haute Couture event is...\n\nNiece swindled elderly couple, 88 and 90, out of their £150,000 life savings to blow on luxury foreign...\n\nTom Kerridge's brutal comeback to critics who moan about price of his £37 fish and chips\n\nNoel Clarke accuses Guardian journalists of deleting messages they shared on encrypted app Signal during...\n\nMillie Mackintosh speaks out on her 'toxic' marriage to Professor Green as she admits she was drinking and...\n\nSmallville star Tom Welling's shock transformation revealed in mugshot after DUI arrest\n\niPhone SE4 leaks online - and it suggests Apple is sticking with one HATED feature in its upcoming budget...\n\nRevealed: Coca-Cola announces fizzy drinks recalls in the UK in health scare over chemical levels - here are...\n\nThe sewage leak map of England: How many are near your house in shocking graphic which updates in real time\n\nTrump launches anti-Semitism crackdown as he orders deportation of pro-Hamas students who terrorised...\n\nFarmer who killed his three-year-old son when he reversed over him in farm vehicle breaks down in tears in...\n\nChinese PhD student who drugged and raped 10 women while videoing victims told one who was begging him to...\n\nModel nepo baby, 31, who is the daughter of a popstar mother and film director father wows at Valentino...\n\nBlake Lively's brother-in-law apologizes to Justin Baldoni in shocking twist amid $400M lawsuit\n\nFIRE breaks out outside Man City's Etihad Stadium - just two hours before critical Champions League clash\n\nManchester City vs Club Brugge - Champions League: Live score, team news and updates as Pep Guardiola's...\n\nPSV Eindhoven vs Liverpool - Champions League: Live score, team news and updates as Reds look to advance...\n\nRihanna makes shock court appearance to support boyfriend A$AP Rocky who faces 24 years prison\n\nMORE HEADLINES\n\nLove Island winner is jailed for six weeks after his hulking out-of-control Cane Corso dog attacked a man\n\nShaken migrants deported by Trump issue stark warning to others after returning to Colombia\n\nCarole Middleton's secrets to looking incredible at 70: Her diet plan (with red wine allowed!), confidence in a bikini and the reason you won't see her wearing trousers\n\nHorrifying moment man is stabbed in the neck after accidentally bumping into a stranger in subway station\n\nNHS ordeal of Flog It! star Michael Baggott as he dies aged 51: Expert complained about care from Labour's crisis-hit health service that left him 'dying of thirst'\n\nVillage under siege by masked yobs: Furious locals accuse police of 'abandoning' them after 70 'travellers' rip up fields, attack fire engines and raid petrol stations in weekend of terror\n\nLloyds, Halifax and Bank of Scotland announce 136 branch closures in major blow to the high street\n\nFemale hospital worker, 51, is charged with plot to kidnap, rape and murder a girl under 13\n\nRachel Reeves sparks war with Labour eco-zealots as she says Heathrow third runway MUST happen to help revive stalling economy - but Sadiq Khan joins MPs and top donor condemning the move\n\nFamily who were accused of force-feeding arranged marriage bride pills and leaving her in a vegetative state are freed from jail after their convictions were quashed\n\nItalian ski resort chaos as 260 buses carrying 10,000 tourists descend at the same time, with slopes overcrowded, streets rammed and the town littered in trash after influencer promoted it\n\nPictured: Female hospital worker, 51, charged with plot to kidnap, rape and murder a girl under 13\n\nTruth about Wynne Evans' 'sad, derelict house': Star claimed home he bought before divorce had boarded-up windows and his children had to sleep in tents before £500,000 makeover\n\nAnger as Labour plot to make streaming-only households pay the BBC licence fee even if they don't watch it\n\nCoca-Cola drinks with higher levels of chemical chlorate HAVE now been found in the UK, health chiefs say - after list of products which have been recalled was revealed\n\nTrump launches anti-Semitism crackdown as he orders deportation of pro-Hamas students who terrorised campuses\n\nWhy China's young super geeks could herald the West's 'darkest hour': Their AI is cheaper, quicker and better... no wonder the world fears a 'Sputnik' moment\n\nNeighbour from hell who made yoga teacher's life in posh suburb a 'misery' with campaign of 'unremitting shouting and screaming' is finally evicted and ordered to pay £15k\n\nVogue launches vile attack on Melania Trump after Anna Wintour slobbered over Jill Biden and Kamala Harris\n\nMore than 10,000 high street jobs are now at risk in UK retail bloodbath - as fashion chain Quiz is on the brink of collapse\n\nBritish man, 55, is killed in the French Alps after being swept away by 'very large' avalanche\n\nDR PHIL: Dry your eyes, Selena Gomez. The child rapists and murderers I saw detained in Trump's migrant raids don't deserve your tears\n\n'I'm not worried - when my time is up, my time's up' - how Sam 'The Punisher' Abdulrahim shrugged off death threats and botched executions before he was brutally gunned down in a hotel car park\n\nTear down the barriers to growth YOU created, critics tell Chancellor: Rachel Reeves urged to rip up hated measures like £25bn National Insurance grab as she launches latest bid to revive economy\n\nMap shows how UK will be battered by Portugal's Storm Ivo as 60mph gales and driving rain to torment the coast\n\nVanessa Feltz's ex Ben Ofoedu breaks his silence on their calamitous split and reveals how he REALLY feels about her: EDEN CONFIDENTIAL\n\nLove Island Jack Fincham seen for the first time as he's FREED on bail after being sentenced to six weeks in jail for dog attack\n\nCoroner demands to know how mother-of-two personal trainer, 48, was able to kill herself on NHS ward - accusing staff of 'a very grave error'\n\nTesco axes 400 jobs from its stores and head office\n\nMoment traumatised shopper makes a VERY surprising discovery in her supermarket vegetable order - and narrowly misses being 'poisoned'\n\nICE descends on San Diego border crossing for 'biggest illegal immigrant grab in recent history'\n\nHarrowing moment giant fish attacks young 'mermaid' performer's face in front of terrified children\n\nCLAUDIA JOSEPH: All the ways Carole Middleton and her daughters are just like the late Queen as we celebrate her milestone birthday\n\nIdris Elba says kitchen knives should have their ends rounded off to help stop violent gang crime\n\nMOST READ IN DETAIL\n\nNEW ARTICLESHomeTop\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Lily James sent temperatures soaring on Wednesday as she shared a series of vacation snaps from her sun-soaked getaway. ","url":"https://www.dailymail.co.uk/tvshowbiz/article-14339211/Lily-James-skimpy-bikini-holiday.html","image":"https://i.dailymail.co.uk/1s/2025/01/29/19/94649495-0-image-m-19_1738178423687.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/08/07/918424722651922296/1024x576_MP4_918424722651922296.mp4","publish_date":"2025-01-29 19:41:58","author":"Editor,Jessica Janes","authors":["Editor","Jessica Janes"],"language":"en","source_country":"GB","sentiment":0.151},{"id":285251204,"title":"Are All Federal Grants Paused? White House Rescinds Federal Aid Freeze","text":"The White House announced in a memo that federal loans and grants would temporarily pause starting on Tuesday, January 28, at 5 p.m. ET. Per CNN, White House Office of Management and Budget acting director Matthew Vaeth wrote that Donald Trump‘s administration “must temporarily pause all activities related to obligation or disbursement of all federal financial assistance.” However, just one day later, the White House rescinded the freeze.\n\nThe news comes on the heels of Trump’s decision to put federal diversity, equity and inclusion employees (otherwise known as DEI workers) on paid leave as the administration aims to terminate DEI-related programs and offices.\n\nWhy Is Trump Freezing Federal Loans and Assistance?\n\nAccording to Vaeth’s memorandum obtained by CNN, the temporary pause of certain federal aid “will provide [Trump’s] administration time to review agency programs and determine the best uses of the funding for those programs consistent with the law and the president’s priorities.”\n\nWhich Federal Aid Programs Are on Pause?\n\nVaeth did not specify which federal assistance programs would have been paused. However, according to NBC New York, social security and medicare benefits wouldn’t have been affected.\n\nPer Vaeth’s memo, “other relevant agency activities [may] be implicated by the executive orders, including, but not limited to, financial assistance for foreign aid, nongovernmental organizations, DEI, woke gender ideology and the green new deal.”\n\n“Career and political appointees in the executive branch have a duty to align federal spending and action with the will of the American people as expressed through presidential priorities,” Vaeth wrote, adding in the memo that the budget office “may grant exceptions allowing federal agencies to issue new awards or take other actions on a case-by-case basis.”\n\nAbout 24 hours later, the White House rescinded the memorandum known as OMB 25-13.\n\nWill FAFSA Be Paused?\n\nIt is not clear if the free application for federal student aid (a.k.a FAFSA) will be impacted by any federal changes.\n\nAre Food Stamps on Pause?\n\nIt’s still unclear if food stamps, most commonly known as Supplemental Nutrition Assistance Program benefits (or SNAP benefits), will be paused under Trump’s administration.","summary":"One day after the White House announced a temporary pause on federal loans and grants, it rescinded the freeze.","url":"https://hollywoodlife.com/2025/01/29/are-all-federal-grants-paused/","image":"https://hollywoodlife.com/wp-content/uploads/2025/01/GettyImages-2195146861-e1737834427179_dc56c3-e1738084961589.jpg?fit=2115%2C1195","video":null,"publish_date":"2025-01-29 19:39:31","author":"Elisabeth McGowan","authors":["Elisabeth McGowan"],"language":"en","category":"politics","source_country":"US","sentiment":0.033},{"id":285245564,"title":"3 SW Washington cities debate whether to remove fluoride from drinking water","text":"Three cities in southwest Washington have joined the list of communities nationally that have revisited the issue of adding cavity-preventing fluoride to drinking water.\n\nCity council members in Longview plan to discuss the issue Thursday during a public debate-style workshop, Oregon Public Broadcasting reported. Battle Ground waded into the debate earlier this month, and the Camas City Council plans to hold a hearing in March. The meetings held or planned so far have all been informational only.\n\nThe debate has gained new traction after a federal judge in California last year ordered the U.S. Environmental Protection Agency to further regulate fluoride in drinking water because high levels could pose a risk to the intellectual development of children. It also comes as the U.S. Senate weighs President Donald Trump’s nomination of Robert F. Kennedy Jr. to run the Department of Health and Human Services. Kennedy has said he wants the federal government to advise local governments against putting fluoride in their drinking water.\n\nMore than 70% of the U.S. population that uses public drinking water systems has access to water with fluoride levels that prevent tooth decay, according to the U.S. Centers for Disease Control and Prevention.\n\nPortland is the largest U.S. city that does not fluoridate its water.\n\nAt a Jan. 6 Battle Ground City Council study session, Deputy Mayor Shane Bowman weighed the city’s cost of spending between $10,000 and $15,000 a year on fluoridation against the outcomes of improved oral health for residents.\n\n“I don’t know if you’ve taken your kid to a pediatric dentist, but that’s very minimal – $10,000-$15,000 – when you think about the difference it is for the kids that maybe don’t have the access to dental health,” Bowman said.\n\nCritics contend that adding fluoride to public drinking water is outdated and say its use should be a matter of personal choice.","summary":"The debate over fluoride has gained new traction after a federal judge in California last year ordered the U.S. Environmental Protection Agency to further regulate fluoride in drinking water","url":"https://www.oregonlive.com/politics/2025/01/3-sw-washington-cities-debate-whether-to-remove-fluoride-from-drinking-water.html","image":"https://www.oregonlive.com/resizer/v2/4747RYUMGZEYRIHBATQ363XGRQ.JPG?auth=8d1a804d4d77650ccfb82314b385ba86a48b20c42f5377ae7c959ba95297d290&width=1280&quality=90","video":null,"publish_date":"2025-01-29 19:39:00","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.065},{"id":285244090,"title":"Powell says Fed does ‘not need to be in a hurry’ to adjust policy stance","text":"Economists and investors will be on the lookout for clues on how the Federal Reserve is thinking about the Trump administration's aims, particularly plans to impose tariffs on US imports. \n\n“To me, tariffs really are the wild card for macroeconomic policy this year,” said Claudia Sahm, chief economist at New Century Advisors and a former Fed official. “It feels like it’s just outweighing everything else at this point.” \n\nThe Fed has faced global trade wars before — including during Donald Trump's first term in office. However, at that point neither price pressures nor aggregate demand were as strong as now. This time around, the risk is that the impact on inflation is more pronounced — and more enduring. \n\nA definitive response from Fed chair Jay Powell on the impact of tariffs on interest rates as soon as today is unlikely. \n\nPowell said after the central bank's December vote that there were “many, many factors” determining how levies on US imports would affect consumer prices, and that central bankers would “take our time” and not rush to conclusions. \n\nSome economy watchers anticipated executive orders on day one of Trump's second term. But at this stage it is still unclear how tough the US president and self-described “tariff man” will be on the US's trade partners: trade restrictions could constitute a one-off shock, or prove a slow burn, getting steeper by the month — as desired by Treasury secretary Scott Bessent. Both paths have implications for the knock-on impact on consumer prices.","summary":"US central bank resists Donald Trump’s calls to cut borrowing costs","url":"https://www.ft.com/content/077f0516-dbe2-4953-89cd-fa70025f748d","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff5fa2369-5bdd-4525-9e58-2eac844949e9.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1","video":null,"publish_date":"2025-01-29 19:38:28","author":"Alexandra White,Peter Wells,Zehra Munir","authors":["Alexandra White","Peter Wells","Zehra Munir"],"language":"en","category":"politics","source_country":"GB","sentiment":0.04},{"id":285246398,"title":"Charles Grassley: the senator in charge of Trump's legal agenda","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nIn-the-spotlight\n\nCharles Grassley: the senator in charge of Trump's legal agenda\n\nHe will spearhead filling the courts with conservatives\n\nNewsletter sign up\n\nGrassley 'pisses excellence and experience,\" said Sen. John Kennedy (R-La.).\n\n(Image credit: Bloomberg / Getty Images)\n\nBy Joel Mathis, The Week US\n published 29 January 2025 \n\nSen. Chuck Grassley, the Iowa Republican, has been in the Senate longer than most Americans have been alive. Now he holds an important key to Donald Trump's second-term agenda.\n\nThe 91-year-old Grassley will oversee everything from \"remaking the immigration system to unraveling the so-called 'deep state'\" from his perch atop the Senate Judiciary Committee, said Politico. Critically, he will also be in charge of helping confirm Trump's judicial nominees. But his age — he is the chamber's only nonagenarian — has raised concerns among GOP colleagues about whether he is \"too old for a job central to the execution of Trump's agenda.\" Other Republicans are quick to come to his defense: Grassley \"pisses excellence and experience,\" said Sen. John Kennedy (R-La.).\nWhat is Grassley's Senate history?\n\nGrassley is the \"longest-serving GOP senator in U.S. history,\" said The Washington Post. He ran for his first political office in 1958, and was elected to Congress in 1974 before ascending to the Senate in 1981. He is \"known for his reverence for Senate tradition\" and a willingness to work with Democrats. In his Judiciary role, he is also charged with shepherding the nominations of Pam Bondi to be Trump's attorney general and Kash Patel to head the FBI. Grassley says he is not worried Trump's appointees will weaponize law enforcement on the president's behalf. \"Common sense tells me that,\" he told the Post.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nThe senator can be fiercely partisan. Grassley is \"unapologetic\" about leading the GOP's successful 2016 effort to block President Barack Obama's nominee Merrick Garland to the Supreme Court, said USA Today. That maneuver opened the way for conservatives' current 6-3 supermajority on the court. \"I took a position and stuck to it. That's it,\" he said in 2021, when Garland was nominated to serve as President Joe Biden's attorney general.\n\nHow much will he advocate for Trump?\nGrassley can depart from GOP orthodoxy. He has urged caution on Trump's enthusiasm for tariffs, telling Radio Iowa that Congress \"violated the Constitution\" by handing the presidency the power to unilaterally impose tariffs on imports from other countries. \"When you delegate too much authority for presidential action, you're really violating that section of the code,\" he said.\n\nThere are some (anonymous) Republicans on the Judiciary Committee who say Grassley is not fierce enough to advance Trump's legal agenda. Grassley is \"not a knife fighter,\" one GOP senator said to Punchbowl News. One reason for concern: Big battles over the future of the Supreme Court are likely. There is speculation that conservative Justices Clarence Thomas and Samuel Alito will use Trump's return to retire and pave the way for replacements. The stakes on the Judiciary Committee \"are going to be high,\" said the anonymous senator.\nGrassley's power affects not only the Supreme Court. One of Grassley's tasks is to \"add more conservatives to the federal courts,\" said Roll Call. That includes the district and appellate courts. But the Supreme Court remains the big prize. The replacements for Thomas and Alito will be just as conservative, said George Washington University law professor John P. Collins Jr., \"but 30 years younger.\"\n\nExplore More\n\nDonald Trump\nU.S. Senate\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nJoel Mathis, The Week US\n\nSocial Links Navigation\n\nJoel Mathis is a writer with 30 years of newspaper and online journalism experience. His work also regularly appears in National Geographic and The Kansas City Star. His awards include best online commentary at the Online News Association and (twice) at the City and Regional Magazine Association. \n\nThe best TV series with multiple timelines right now\n\nThe Week Recommends\nNarratives that spend significant time in two or more stories can be especially rewarding\n\nBy David Faris\n\nPublished 29 January 25\n\n'The Mountain West has acquired a whole new mythos, updated for the high-tech era'\n\nInstant Opinion\nOpinion, comment and editorials of the day\n\nBy Justin Klawans, The Week US\n\nPublished 29 January 25\n\nDeepSeek: the Chinese AI company rocking the tech world\n\nIn the spotlight\nAmerica's hold on artificial intelligence is on shaky ground\n\nBy Theara Coleman, The Week US\n\nPublished 29 January 25\n\nYou might also like\n\nCaroline Kennedy urges Senate to reject RFK Jr.\n\nRobert F. Kennedy Jr.'s cousin said he should not become President Donald Trump's health secretary, calling his medical views 'dangerous'\n\nBy Peter Weber, The Week US\n\nPublished 29 January 25\n\nChina's backyard: will Trump's aggression push Latin America away?\n\nToday's Big Question\nRift between US and Colombia, threats of tariffs on Mexico, designs on Panama Canal and mass deportations could encourage closer ties with Beijing\n\nBy Harriet Marsden, The Week UK\n\nPublished 29 January 25\n\nThe biggest international naming disputes in history\n\nThe Explainer\nNations have often been at odds with each other over geographic titles\n\nBy Justin Klawans, The Week US\n\nPublished 28 January 25\n\nTrump sparks chaos with spending, aid freezes\n\nA sudden freeze on federal grants and loans by President Donald Trump's administration has created widespread confusion\n\nBy Rafi Schwartz, The Week US\n\nPublished 28 January 25\n\nWhat could happen to the US food supply under Trump's isolationist agenda?\n\nTODAY'S BIG QUESTION \nThe president's plan to deport undocumented workers and levy massive taxes on international imports might have repercussions on your dinner plate\n\nBy Rafi Schwartz, The Week US\n\nPublished 27 January 25\n\nTrump feuds with Colombia on deportee flights\n\nColombia has backed off from a trade war with the U.S., reaching an agreement on accepting deported migrants following tariff threats from President Donald Trump\n\nBy Peter Weber, The Week US\n\nPublished 27 January 25\n\nTrump proposal to 'clean out' Gaza gets cool reception\n\nU.S. allies Jordan and Egypt rejected President Donald Trump's suggestion that Palestinians leave Gaza\n\nBy Peter Weber, The Week US\n\nPublished 27 January 25\n\nThe new JFK, RFK and MLK files: what to expect\n\nThe Explainer\nWill the release of documents on the assassinations that 'shattered the 60s' satisfy the conspiracy theorists?\n\nBy Chas Newkey-Burden, The Week UK\n\nPublished 27 January 25\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nTheweek is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"The Senate Judiciary Committee chairman in charge of Trump's legal agenda","url":"https://theweek.com/politics/charles-grassley-senator-trump-legal-agenda","image":"https://cdn.mos.cms.futurecdn.net/ig74CBXbjnuRha7qVxsCGY.jpg","video":null,"publish_date":"2025-01-29 19:38:26","author":"Joel Mathis","authors":["Joel Mathis"],"language":"en","category":"politics","source_country":"gb","sentiment":0.449},{"id":285246178,"title":"RFK Jr tells lawmakers that ‘every abortion is a tragedy’ at confirmation hearing","text":"Every abortion is a \"tragedy,\" President Donald Trump's Health and Human Services nominee, Robert F. Kennedy Jr., told lawmakers Wednesday. While Kennedy previously voiced support for abortion even in the late stages of pregnancy, Kennedy told the Senate Finance Committee Wednesday he would carry out Trump’s policy priorities concerning abortion. \"I agree with President Trump that every abortion is a tragedy,\" Kennedy said at his confirmation hearing. \"I agree with him that we cannot be a moral nation if we have 1.2 million abortions a year. I agree with him that the states should control abortion. President Trump has told me that he wants to end late-term abortions, and he wants to protect conscience exemptions.\" \"I serve at the pleasure of the president,\" Kennedy said. \"I’m going to implement his policies.\" MULTIPLE OUTBURTS ERUPT AT RFK JR HEARING: ‘YOU ARE’ According to the Centers for Disease Control and Prevention, 625,978 abortions were reported from 48 areas in 2021. Trump has said on multiple occasions that he supports abortion in certain instances, and said that \"powerful exceptions\" for abortion would remain in place under his administration. Meanwhile, Kennedy has altered his position on abortion several times in the past year. Kennedy, a former Democrat who ran as an independent presidential candidate in the 2024 election, has historically stated that he doesn’t believe the government should step in with a woman’s choice to end a pregnancy, despite his \"personally pro-life\" stance. RFK JR RIPS DEM SENATOR FOR PUSHING ‘DISHONEST’ NARRATIVE ON PAST VACCINE COMMENTS: ‘CORRECTED IT MANY TIMES’ In May, Kennedy said he supported abortions in the third trimester, although he later followed up and said he does back some restrictions. Kennedy’s views appeared at odds with one another, and Democratic lawmakers said they were \"confused\" by his answers on abortion. \"Mr. Kennedy, I’m confused. You have clearly stated in the past that bodily autonomy is one of your core values. The question is, do you stand for that value or not?\" Sen. Maggie Hassan, D-N.H., said during the confirmation hearing. \"When was it that you decided to sell out the values you have had your whole life in order to be given power by President Trump?\" RFK JR. LIKELY TO BE CONFIRMED AS HEALTH SECRETARY, DR. SIEGEL SAYS Other lawmakers voiced concerns about Kennedy’s nomination, including Democratic Sen. Sheldon Whitehouse of Rhode Island. \"Frankly, you frighten people,\" Whitehouse said, after claiming that there was a measles outbreak in Rhode Island for the first time since 2013 amid a broader discussion about Kennedy’s stance on vaccines. CLICK HERE TO GET THE FOX NEWS APP Kennedy pushed back on \"news reports\" that he is anti-vaccine and anti-industry in his opening statements Wednesday, noting that all his children are vaccinated. He also has previously said that he isn't interested in taking \"away anybody's vaccines.\" Fox News Digital's Chris Pandolfo contributed to this report.","summary":"President Donald Trump&apos;s Health and Human Services nominee, Robert F. Kennedy Jr., told lawmakers that he agrees that &apos;every abortion is a tragedy.&apos;","url":"https://www.foxnews.com/politics/rfk-jr-tells-lawmakers-every-abortion-tragedy-confirmation-hearing","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/whitehouse_rfkjr.png?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:37:57","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.308},{"id":285246780,"title":"Behind the Chaotic Attempt to Freeze Federal Assistance","text":"The announcement provoked widespread confusion and disbelief. In a massive grab for power from Congress, the order seemed to halt almost every federal program touching people’s lives except Social Security and Medicare. O.M.B. identified twenty-six hundred programs affected. These include grants for law-enforcement and homeland-security activities; community health centers; firefighting; clinical trials across the country; special-education programs; and Meals on Wheels for the elderly. Even the portal for payments to states for Medicaid, which the Administration promised would be unaffected, shut down. Minutes before the 5 P.M. deadline, a federal judge blocked implementation of the freeze until she could review a challenge from multiple plaintiffs. Then today, O.M.B. rescinded its order. The legality of the plan was as murky as the intentions.\nA week before the announcement, however, we received a clear indication of what was in store. On January 20th, amid the barrage of executive orders that Trump signed after the Inauguration—including the U.S. withdrawal from the World Health Organization—was an order to pause new foreign-aid spending commitments for ninety days. Soon afterward, the new Secretary of State, Marco Rubio, issued a stop-work order for the State Department and the U.S. Agency for International Development, halting not only new awards but virtually all existing programs.\nForeign aid has long been funded by bipartisan majorities in Congress as a cornerstone of national security, along with diplomacy and defense. This supports work, much of it through contractors and nongovernmental organizations, with countries worldwide in areas of mutual interest. Examples include combatting global disease threats and malnutrition; stopping human trafficking and drug trafficking; advancing access to education for girls; and demining postwar countries like Vietnam and Cambodia. In the days that followed, nonetheless, organizations across the U.S. and the world received letters stating that they must stop all work and use of existing funds immediately. No staff can be paid. No services can be provided. No medicines or supplies sitting on shelves can be used.\n“To be clear, there is no such thing as a temporary pause,” Michael Schiffer, a former U.S.A.I.D. official, has written. “When an NGO, a small business, or an American company that receives U.S. government funding to implement U.S. foreign assistance is told to stop work, even for 90 days, that means people are fired, expertise is lost, and programs are shut down with no guarantee they’ll start back up, even if they survive the review.”\nOn the afternoon of January 27th, major portions of the staff who operate U.S.A.I.D. were purged. The top layers of civilian and foreign-service leadership—fifty-seven people in all, including the agency’s general counsel and ethics counsel—had their badges turned off and were put on immediate leave. Technical experts and support staff hired through contractors—which includes half of U.S.A.I.D.’s Global Health workforce—were dismissed. Orders instructed the remaining staff that they not only had to stop funding work with partner organizations but they also had to stop communicating with them. There could be no coördination or information exchange, whether with the World Health Organization or local universities and nonprofits. The U.S. Centers for Disease Control was put under a similar gag order.\nThe impact has been calamitous. I know the effect on health programs vividly, having run U.S.A.I.D.’s Bureau for Global Health during the last Administration. For example, the U.S. has limited sight on infectious-disease outbreaks in many parts of the world, such as Russia and China. So U.S.A.I.D. has funded experts in neighboring countries, such as Kazakhstan, sitting between those particular two, to upgrade monitoring and share information on bird flu and other deadly diseases. That work has halted.\nMany other programs are similarly affected. U.S.A.I.D.’s work with W.H.O. and the government of Tanzania battling a Marburg virus outbreak—a cousin of Ebola with no approved test, drug, or vaccine, and a death rate of up to ninety-per-cent-death—halted.\nThe U.S. government’s work with countries around the world, W.H.O., and UNICEF, to eradicate polio—halted.\nU.S.A.I.D.’s coördination and delivery of more than a billion dollars in corporate drug donations, which have brought neglected tropical diseases such as river blindness and elephantiasis to the brink of elimination in whole regions of the world—halted.\nThe deployment of medicines, supplies, staff training, and systems aiding more than twenty-five countries to increase access to vaccinations, prenatal care, safe childbirth, contraception, and other lifesaving health services for ninety-two million women and children—a program that has dramatically reduced death rates—halted.\nAmerica’s celebrated global H.I.V. program, PEPFAR—halted entirely. This includes its H.I.V.-vaccine research trials; its delivery of low-cost daily medications, which are keeping twenty million people with H.I.V. alive in more than fifty countries; and the rollout of a new U.S. drug that could end the AIDS epidemic —an H.I.V. treatment-and-prevention drug called lenacapavir, which delivers six months of protection in a single shot.\nThe effects go well beyond health. U.S.A.I.D. comprises the largest nonmilitary operational capacity the U.S. has for assisting countries in many other areas of mutual coöperation. The agency has built a network of hundreds of thousands of personnel across the U.S. and the world, and it is supported to do this work mainly through federal grants and contracts. This infrastructure is the engine of American soft power. And in a matter of days—and contravening laws and budgets passed by Congress—the Trump Administration has attempted not simply to redirect U.S.A.I.D.’s policy but to gut the agency’s capacity.\nThis is not a pause. It is a destruction. And it’s all completely irrelevant to doing a “review.” Every Administration takes a top-to-bottom review of policy and spending and makes changes—even big changes, shifting the activities of whole agencies. But they act through constitutionally defined processes to make these happen—and work to protect people and institutions from harm. By both shutting down most of U.S.A.I.D.’s existing activities and purging the people who manage them, Donald Trump and his allies are eviscerating the entire structure.\nUnder public scrutiny and mounting pressure from Congress, Secretary Rubio did not rescind the foreign aid funding freeze, but instead only issued a waiver backtracking on parts of it, including on some of the global health programs. “Existing life-saving global health assistance programs for H.I.V., malaria, TB control, nutrition, skilled birth and prenatal care, and immunization should continue or resume work if they have stopped,” the waiver says. However, it’s unclear how narrowly “life-saving” will be defined. The resumption is temporary. (How long is not specified.) Work combatting new disease outbreaks, eradicating diseases such as polio, and supporting contraception seems to be excluded from the waiver. Plus, the demolition of staffing already turns the agency into a shadow of itself.\nFor a century now, the U.S. has led the world on collaboration and impact in health, which has doubled the life expectancy of all of humanity—and delivered similarly outsized results beyond health. If this Administration really wanted to put America first, it would have built on that legacy. Instead, it is demolishing U.S. standing, our world-leading capacity and expertise, and our national security.\nThe Administration has seemed intent on deploying this playbook across the entire scope of federal agencies and activities for the United States. There are other institutions driving whole areas of critical work—environmental protection, education, labor, and disease control, to name just a few—that the President has targeted for dismantling, despite the fact that both red and blue majorities in Congress have voted to fund them. Foreign aid is a speck in the 6.75-trillion-dollar government budget. At about eight billion dollars last year, U.S.A.I.D.’s global health budget is smaller than that of many hospital systems. But the agency’s experience reveals what remains at stake—the collective capacity of the American government to pursue the common good. ♦","summary":"The potential for devastation is made plain by another order, concerning the crucial work of U.S.A.I.D.","url":"https://www.newyorker.com/news/the-lede/behind-the-chaotic-attempt-to-freeze-federal-assistance","image":"https://media.newyorker.com/photos/679a66121c75002242fc853f/16:9/w_2560,h_1440,c_limit/Gawande-Health-Agencies.jpg","video":null,"publish_date":"2025-01-29 19:37:13","author":"Atul Gawande","authors":["Atul Gawande"],"language":"en","category":"politics","source_country":"US","sentiment":-0.383},{"id":285246776,"title":"US spent $50 million on condoms for Gaza – White House","text":"President Donald Trump’s push for government efficiency has already discovered wasteful spending such as $50 million allocated to purchase condoms for residents of Gaza, White House press secretary Karoline Leavitt told reporters at her first briefing.\n\nTrump established the Department of Government Efficiency (DOGE) as a temporary outfit shortly after being sworn in last week. The body is headed by tech mogul and major Trump supporter Elon Musk.\n\nDOGE and the Office of Management and Budget (OMB) “found that there was about to be 50 million taxpayer dollars that went out the door to fund condoms in Gaza,” Leavitt told reporters on Tuesday, accusing former President Joe Biden’s administration of “a preposterous waste of taxpayer money.”\n\nAnother $37 million was earmarked for the World Health Organization [WHO], which “President Trump, with the swipe of his pen and that executive order, no longer wants the US to be a part of,” Leavitt added.\n\nOn Friday, the US State Department ordered a freeze on almost all foreign aid programs for 90 days, pending review to determine whether they line up with the Trump administration’s foreign policy objectives. USAID has already informed NGOs around the world that it was suspending funding until further notice.\n\nFormer Deputy Assistant Secretary of State for Israeli-Palestinian Affairs Andrew Miller told the Times of Israel that Leavitt’s claim was “outlandish.”\n\n“It’s possible that $50 million is for sexual health or something like that, which includes gynecology and many other services, but certainly not just condoms,” Miller said.\n\nAccording to AFP, the US Agency for International Development (USAID) allocated $60 million in fiscal year 2023 for a variety of contraceptive devices to be sent around the world, not just to Gaza. There are around two million residents in the Palestinian enclave, which has been devastated by a 15-month war with Israel.\n\nDuring the 2018 tensions with Hamas in Gaza, the Israeli military accused the Palestinian militants of using balloons made from latex condoms to send incendiary and explosive devices across the border. The improvised devices triggered “hundreds” of wildfires, according to the Times of Israel.\n\nAt the time, The Israel Defense Forces (IDF) was baffled as to where the condoms might be coming from, as they were not produced locally. The WHO had denied supplying Gaza with the contraceptives.","summary":"Elon Musk’s DOGE has already helped discover “preposterous waste” of American taxpayer funds, the Trump administration has announced \nRead Full Article at RT.com","url":"https://www.rt.com/news/611851-gaza-condoms-white-house/","image":"https://mf.b37mrtl.ru/files/2025.01/article/679a598e85f54040082d3d10.jpg","video":null,"publish_date":"2025-01-29 19:37:12","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.38},{"id":285246196,"title":"Tren de Aragua gang member arrested in NYC was ‘trying to buy grenades,’ Noem says","text":"A member of the violent Venezuelan Tren de Aragua gang arrested Tuesday during sweeping immigration raids in New York City was trying to buy grenades, Department of Homeland Security Secretary Kristi Noem told Fox News on Wednesday. Noem had joined federal immigration authorities Tuesday in New York City for the sweeps, which officials said were targeting violent criminals in major cities and elsewhere. On Wednesday, Noem addressed the arrest of who she described as a \"ringleader\" of the Tren de Aragua gang during an appearance on \"Fox & Friends.\" \"He had just been a part of a gun weapons exchange and was trying to buy grenades,\" Noem said. \"Why would anybody in this country need to buy a grenade and go out and perpetuate violence?\" NOEM SAYS 'WORST OF THE WORST' ARRESTED IN NYC RAID TARGETING CRIMINAL ILLEGAL IMMIGRANTS Sources in the Department of Homeland Security told Fox News on Tuesday that the suspected gang member, whom they identified as Anderson Zambrano-Pacheco, was arrested inside a Bronx apartment and charged with kidnapping, assault and burglary. Zambrano-Pacheco, 26, is the same man who was caught on camera in a video showing heavily armed men kicking down an apartment door at an apartment complex in Aurora, Colorado, the sources said. He was in the country illegally. Zambrano-Pacheco appeared in Manhattan federal court on Wednesday. Noem confirmed that the gang member arrested was involved in incidents in Aurora, Colorado, that captured national attention in August. NYC RESIDENTS PRAISE ICE RAIDS AFTER VIOLENT GANG MEMBER CAPTURED She said President Donald Trump is taking action to go after criminals who are in the country illegally despite some Democratic leaders opposing the effort. \"What was amazing is you'll hear people and Democrat leaders in different cities, like New York City, some of their city council members have tried to attack what we're doing as far as enforcing our laws,\" she said. \"But the people on the streets are not with them.\" \"It was amazing to hear people and see them as they walked by taking their kids to school, going to work, just walk by us and quietly say thank you, thank you for being here,\" Noem continued. \"And that means a world to those officers that are out there risking their lives to bring safety back.\" Tyreek Goodman, a member of the Bronx County Conservative Party, said the threat of the gang's violent crimes had sowed fear within the community. \"You do have the feeling, the fear of what happens if they come here next,\" Goodman, who is a city council candidate, told Fox News Digital. \"There's been a lot of crimes on the MTA, based off people that weren't supposed to be here. So we have to understand that in order to keep our people safe, this is a time for us to stand by law enforcement.\" CLICK TO GET THE FOX NEWS APP As the Trump administration continues to move rapidly to fulfill its promise to mass deport dangerous foreign criminals, U.S. Immigration and Customs Enforcement (ICE) on Wednesday issued an update that the agency made 1016 arrests and issued 814 detainers in a single day. Fox News Digital’s Michael Dorgan contributed to this report.","summary":"A Tren de Aragua gang member arrested during sweeping immigration raids in New York City was trying to buy grenades, DHS Secretary Kristi Noem said.","url":"https://www.foxnews.com/us/tda-gang-member-arrested-nyc-trying-buy-grenades-noem-says","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/tda-noem-thumb.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:35:29","author":"Stephen Sorace","authors":["Stephen Sorace"],"language":"en","category":"politics","source_country":"us","sentiment":-0.373},{"id":285245580,"title":"Social media posts claim immigration officials are questioning Oregonians. Beware of misinformation","text":"Several social media posts have warned Oregonians that federal immigration officials have stormed a public university, made appearances at local businesses and questioned children riding public transportation in the days since President Donald Trump returned to office.\n\nNone of that appears to be true, according to local officials.\n\nSome immigrant communities across the country have been on edge since Trump pledged to complete the largest deportation operation in American history. That threat, coupled with the ability of unverified information to spread like wildfire on social media platforms, has produced palpable fear for some undocumented immigrants who are worried about being deported or separated from family members who are U.S. citizens.\n\nCommunity organizations say they are concerned with increased reports of U.S. Immigration and Customs Enforcement activity in Oregon, and at least one person has been arrested – at their home, not in a public setting. But advocates for immigrants are urging the public not to jump to conclusions or share unverified information that can cause more harm and fear. \n\n“There are people taking advantage to scare people,” Pedro Sosa, director of Oregon Project Voice, an immigrant rights program funded by the American Friends Service Committee, said in Spanish. “There’s a lot of uncertainty, a lot of fear and a lot of disinformation.”\n\nTriMet on Tuesday denied a claim made in a Facebook post that three middle-school-aged children were questioned by ICE agents at the Clackamas Town Center light-rail station.\n\nRoberta Altstadt, a spokesperson with TriMet, said staff looked into the claim and found no evidence to support it. Under state law, TriMet does not work with ICE, and people are encouraged to immediately file a report if they “experienced, witnessed or heard about activity by ICE on TriMet property,” according to information on its website, shared by Altstadt.\n\nAltstadt said TriMet “did not receive any complaint or direct communications” from the person who posted the information to Facebook on Monday, nor any reports from anyone else about ICE agents boarding trains at Clackamas Town Center or elsewhere. \n\nThe only inquiry TriMet received, she said, was from someone who shared the post and “noted there was no actual evidence shared.” \n\n“I believe they are meant to create fear in the community,” Altstadt said. \n\nThe woman who posted on Facebook didn’t respond to a Facebook message from the newsroom, and a call and text to a phone number listed with the woman’s name were not immediately answered Wednesday morning. It appears the woman deleted her Facebook post.\n\nLast Thursday, someone posted on Reddit that vans full of ICE officers were storming Portland State University. The post was later removed.\n\nChristina Williams, a university spokesperson, said the report was fake and officials had seen no ICE activity on campus. In a public message sent the same day, university president Ann Cudd reminded the community that officials would not consent to immigration enforcement actions on campus and would take all legal measures to protect students.\n\nBusiness officials also distanced themselves from social media posts alleging that patrons had been questioned or detained.\n\nLast week, a message circulated on Instagram and Facebook alleging that ICE officers were at the WinCo Foods on Southeast 82nd Avenue near Happy Valley.\n\nAn employee at WinCo, who didn’t provide her name, denied such an incident happened at the store before hanging up. Several requests for comment to the WinCo corporate office and its corporate communications director went unanswered. \n\nAn ICE spokesperson told the newsroom that “this was not an U.S. Immigration and Customs Enforcement encounter.” \n\nSeparately, a post on Reddit last week included a screenshot of a post that appeared to originate on Facebook claiming people had been detained at WinCo and also at La Tapatia Supermarket in Gresham. \n\nAn employee at La Tapatia, who declined to provide her name, denied an ICE presence and referred The Oregonian/OregonLive to a statement on the company’s Facebook page.\n\nThe brief statement didn’t specifically address the allegations but urged the public to be responsible amid false information being spread. \n\n“Social media a powerful tool,” La Tapatia’s Spanish statement reads, “but it can also generate chaos if not used carefully. Let’s prevent spreading rumors that can cause alarm. Always confirm the information before sharing.” \n\nLa Tapatia did not respond to requests for further comment. \n\nSosa, with Oregon Project Voice, said people should be careful before sharing or reposting information on social media. He urged the public to trust information if it’s coming from a community organization, for example, but to be cautions when the information is from an unknown source. \n\nHe said his organization has a hotline, 888-622-1510, where people can submit photos or video, with other information, such as location, date and time, so the program can send a rapid response team. \n\nFrank Garcia, executive director at Immigration Counseling Service, a nonprofit legal service provider, shared similar guidance in the event someone witnesses an immigration raid in public or at work.\n\nPeople who feel safe to gather information should ensure their phone’s audio and video is on; they should try to get the officer’s name, badge number and agency; they should narrate the date, time and location; and not share information about themselves or their loved ones with the agents. \n\nGarcia also urged people not to jump to conclusions or share unverified information about immigration raids to help protect the safety and security of the immigrant community. \n\n“These rumors can create panic and drive immigrant communities to live in the shadows,” Garcia said in a statement. “We need to be mindful about the sources and reliability of information before spreading it far and wide.” \n\nOregon is home to an estimated 120,000 undocumented immigrants, or 2.9% of the state’s population, according to data from the Pew Research Center, a nonpartisan think tank. More than half of the state’s undocumented immigrants are from Mexico.\n\nSosa said ICE is, indeed, making arrests in Oregon, but those are outnumbered by rumors meant to scare the community. He said his program, which organizes rapid response teams that mobilize during and after immigration raids, hasn’t yet had to dispatch a team since Trump took office. \n\nSosa said his organization is aware of at least one arrest in Salem where ICE agents showed up at a family’s house on Friday and took the father, who is now detained at the Tacoma Northwest Detention Center and is receiving legal assistance. The remaining family members were connected with services. \n\n“Is very important for the community to get educated on their Constitutional rights,” he said. \n\nGarcia also reminded the public that suspected violations of Oregon’s sanctuary state laws, which prohibit cooperation by local officials for immigration enforcement, can be submitted to the Oregon Department of Justice Sanctuary Promise Hotline. Public agencies are also required to make a report when they receive a request from a federal agency for immigration enforcement. \n\nSince Trump took office, the Criminal Justice Commission has received four reports – two of which were submitted Tuesday – from law enforcement and public agencies that have received a request from a federal agency for immigration enforcement. In all four requests, none of the local agencies assisted federal officials in their request. \n\n“Since agencies have 30 days to report to us, it’s still unknown what the increase in volume will be there,” said Kelly Officer, research director at the Criminal Justice Commission.\n\nBeth Slovic contributed this story.\n\n--Yesenia Amaro is an investigative reporter with a focus on social issues and communities of color. Do you have a news tip related to immigration, deportations or publicly funded programs designed to help immigrant Oregonians? Get in touch, 503-221-4395; yamaro@oregonian.com.","summary":"Four Oregon entities deny ICE activity at their properties, urge public not to share unverified information","url":"https://www.oregonlive.com/politics/2025/01/social-media-posts-claim-immigration-officials-are-questioning-oregonians-beware-of-misinformation.html","image":"https://www.oregonlive.com/resizer/v2/RWLISFPN7NENBIOX2LRSHIXSBE.png?auth=87d9e78c8a904c4164ac3ab6a875822618e8ce4c72b903e4dab606b363c1f02f&width=1280&quality=90","video":null,"publish_date":"2025-01-29 19:33:52","author":"Yesenia Amaro","authors":["Yesenia Amaro"],"language":"en","category":"politics","source_country":"us","sentiment":-0.452},{"id":285249182,"title":"U.S. Fed holds key rate as it gauges inflation impact of Trump policies","text":"The Federal Reserve left its benchmark interest rate unchanged Wednesday after cutting it three times in a row last year, a sign of a more cautious approach as the Fed seeks to gauge where inflation is headed and what policies President Donald Trump may pursue.\n\nThe Fed reduced its rate last year to 4.3% from 5.3%, in part out of concern that the job market was weakening. Hiring had slowed in the summer and the unemployment rate ticked up, leading Fed officials to approve an outsized half-point cut in September. Yet hiring rebounded last month and the unemployment rate declined slightly, to a low 4.1%.\n\nIn its statement Wednesday, the Fed upgraded its assessment of the job market, calling it “solid,” and noting that the unemployment rate “has stabilized at a low level in recent months.” The Fed also appeared to toughen its assessment of inflation, saying that it “remains somewhat elevated.” Both a healthier job market and more stubborn inflation typically would imply fewer Fed rate cuts in the coming months.\n\nFed Chair Jerome Powell has said it is harder to gauge where inflation is headed, in part because of increased uncertainty around what policies Trump will adopt and how quickly they will affect the economy. Trump has promised widespread tariffs, tax cuts, and mass deportation of immigrants, all of which could push prices higher. The Fed typically keeps interest rates high to slow borrowing and spending and cool inflation.\n\nPowell said in December that the central bank has entered a “new phase,” in which it expects to move more deliberately. In December, Fed officials signaled they may reduce their rate just twice more this year. Goldman Sachs economists believes those cuts won’t happen until June and December.\n\nIn November, inflation was just 2.4%, according to the Fed’s preferred measure, not far from its 2% target. But excluding the volatile food and energy categories, core prices rose a more painful 2.8% from a year earlier. The Fed pays close attention to core prices because they are often a better guide to inflation’s future path.\n\nIt’s unclear how of if Trump will respond to the Fed’s decision to stand pat. Last week in Davos, Switzerland, Trump said that he would bring down energy prices, then “demand” that the Fed lower borrowing costs.\n\nLater, when asked by reporters if he expected the Fed to listen to him, he said, “yes.” Presidents in recent decades have avoided publicly pressuring the Fed out of deference to its political independence.\n\nMost other central banks in developed countries are cutting their interest rates. The European Central Bank, for example, is widely expected to reduce borrowing costs at its next meeting on Thursday. The Bank of Canada said Wednesday it has also cut its rate, and the Bank of England is also expected to do so next month.\n\nThe Bank of Japan, however, is actually raising its rate from a rock-bottom level. Japan has finally experienced some inflation after decades of slower growth and bouts of deflation.\n\nA Fed rate cut in March is still possible, though financial markets’ futures pricing puts the odds of that happening at just one-third.\n\nAs a result, American households and businesses are unlikely to see much relief from high borrowing costs anytime soon. The average rate on a 30-year mortgage slipped to just below 7% last week after rising for five straight weeks. The costs of borrowing money have remained high economywide even after the Fed reduced its benchmark rate.\n\nThat is because investors expect healthy economic growth and stubborn inflation will forestall future rate cuts. They recently bid up the 10-year Treasury above 4.80%, its highest level since 2023.\n\nAnother reason for caution among Fed policymakers this year is that they will want to evaluate any changes in economic policy by the Trump administration. Trump has said he could slap tariffs of 25% on imports from Canada and Mexico as early as Feb. 1. During his presidential campaign he threatened to impose taxes on all imports.\n\nThe Trump administration has also said it will carry out mass deportations of migrants, which could push up inflation by reducing the economy’s ability to produce goods and services. At the same time, some economists say Trump’s promises to deregulate the economy could lower prices over time.\n\nWhen Trump imposed tariffs on a limited number of imports in 2018 and 2019, Fed economists expected the biggest impact to fall on economic growth, with the inflationary impact being relatively minor. As a result, when growth did slow, the Fed ended up cutting its key rate in 2019, rather than raising it to fight off any inflationary impact.","summary":"The U.S. Fed signalled a more cautious approach as the it seeks to gauge where inflation is headed and what policies President Donald Trump may pursue.","url":"https://globalnews.ca/news/10987249/us-fed-bank-of-canada-jan-2025/","image":"https://globalnews.ca/wp-content/uploads/2025/01/federal-reserve.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-01-29 19:33:47","author":"Globalnews Digital,The Associated Press","authors":["Globalnews Digital","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.108},{"id":285247816,"title":"Influential Lawyer Accused of Hiding Millions in Poker Winnings from IRS Banned from Getting Drunk, Playing Poker","text":"A high-profile Supreme Court lawyer accused of federal tax evasion pleaded not guilty on Monday, and entered an official agreement to abstain from alcohol and poker as he awaits trial.Tom Goldstein, the SCOTUSblog founder and formerly prominent lawyer, has agreed to a court order, PokerNews reported. The agreement bars him from \"any type of gambling including poker of any type,\" consuming alcohol, or traveling outside the Washington, D.C., metro area without permission.Once a respected legal mind who argued cases before the Supreme Court, Goldstein now finds himself entangled in a 22-count indictment, which accuses him of diverting legal fees from his firm, Goldstein & Russell, to pay off poker debts and fund personal expenses, including financial support for multiple romantic partners. Prosecutors allege that between 2016 and 2021, he avoided paying $5.3 million in taxes, underreported over $3.4 million in gambling winnings, and fraudulently obtained a $1.98 million mortgage loan by concealing substantial debts.The former attorney is also infamous within the poker world, having reportedly won upwards of $50 million in ultra-high-stakes private games against unnamed billionaires. His alleged tax scheme, which included classifying poker losses as business expenses, has drawn widespread attention from both the legal and poker communities.Goldstein's attorneys, John Lauro and Christopher Kise—both of whom also represent President Donald Trump—have dismissed the charges as rushed and unfounded, stating that their client will \"vigorously contest\" the allegations and expects to be exonerated at trial.Originally published on Latin Times","summary":"A high-profile Supreme Court lawyer accused of federal tax evasion pleaded not guilty on Monday, and has been ordered to abstain from alcohol and poker.","url":"https://www.ibtimes.com/supreme-court-lawyer-poker-winnings-irs-3761473","image":"https://d.ibtimes.com/en/full/4579156/influential-lawyer-accused-hiding-millions-poker-winnings.jpg","video":null,"publish_date":"2025-01-29 19:32:38","author":"Morgan Music","authors":["Morgan Music"],"language":"en","category":"politics","source_country":"US","sentiment":-0.203},{"id":285243696,"title":"Fed leaves key rate unchanged awaiting impact of Trump policies","text":"WASHINGTON: The Federal Reserve left its benchmark interest rate unchanged Wednesday (Jan 29) after cutting it three times in a row last year, a sign of a more cautious approach as the Fed seeks to gauge where inflation is headed and what policies President Donald Trump may pursue.\n\nThe Fed reduced its rate last year to 4.3% from 5.3%, in part out of concern that the job market was weakening. Hiring had slowed in the summer and the unemployment rate ticked up, leading Fed officials to approve an outsized half-point cut in September. Yet hiring rebounded last month, and the unemployment rate declined slightly, to a low 4.1%.\n\nIn its statement Wednesday, the Fed upgraded its assessment of the job market, calling it “solid,” and noting that the unemployment rate “has stabilized at a low level in recent months.” The Fed also appeared to toughen its assessment of inflation, saying that it “remains somewhat elevated.” Both a healthier job market and more stubborn inflation typically would imply fewer Fed rate cuts in the coming months.\n\nFed Chair Jerome Powell has said it is harder to gauge where inflation is headed, in part because of increased uncertainty around what policies Trump will adopt and how quickly they will affect the economy. Trump has promised widespread tariffs, tax cuts, and mass deportation of immigrants, all of which could push prices higher. The Fed typically keeps interest rates high to slow borrowing and spending and cool inflation.\n\nPowell said in December that the central bank has entered a “new phase,” in which it expects to move more deliberately. Fed officials signalled they may reduce their rate just twice more this year. Goldman Sachs economists believe those cuts won’t happen until June and December.\n\nIn November, inflation was just 2.4%, according to the Fed’s preferred measure, not far from its 2% target. But excluding the volatile food and energy categories, core prices rose a more painful 2.8% from a year earlier. The Fed pays close attention to core prices because they are often a better guide to inflation’s future path.\n\nAmerican households and businesses are unlikely to see much relief from high borrowing costs anytime soon. The average rate on a 30-year mortgage slipped to just below 7% last week, after rising for five straight weeks. The costs of borrowing money have remained high economywide even after the Fed reduced its benchmark rate.\n\nTRUMP SAID HE WOULD \"DEMAND\" FED LOWER RATES\n\nIt is likely to be a quiet start to an eventful year for the central bank. Trump said last week in Davos, Switzerland that he would bring down energy prices, then \"demand\" the Fed lower borrowing costs.\n\nLater, when asked by reporters if he expected the Fed to listen to him, he said, “yes.” Presidents in recent decades have avoided publicly pressuring the Fed out of deference to its political independence.\n\nWhen Trump imposed tariffs on a limited number of imports in 2018 and 2019, Fed economists expected the biggest impact to fall on economic growth, with the inflationary impact being relatively minor. As a result, when growth did slow, the Fed ended up cutting its key rate in 2019, rather than raising it to fight off any inflationary impact.\n\nOn Wednesday, Fed officials could also change the statement that they release after each meeting to upgrade their assessment of the labour market, a signal that rate cuts may be delayed.\n\nIn December, the statement included a mildly pessimistic take: \"Labor market conditions have generally eased, and the unemployment rate has moved up but remains low.” In the summer and fall, employers slowed their hiring. The rise in the unemployment rate had unnerved Fed officials and was a big reason they reduced their key rate by an unusually large half-percentage point in September.\n\nEarlier this month, Fed governor Chris Waller cited weaker hiring as evidence that the Fed's key rate is “restrictive,” meaning it is acting as a brake on the economy and should bring down inflation over time. If rates are restrictive, that means the Fed would have more room to cut them if inflation were to decline further. Yet this month, just a few days after Waller's remarks, the December jobs report showed that hiring accelerated and the unemployment rate slipped to a low 4.1% from 4.2%.\n\nThe healthier employment numbers suggested that hiring has at least levelled off. If it stays as strong as last month, the improved job gains would suggest the Fed's rate isn't restrictive at all, and few, if any, rate cuts are needed.","summary":"","url":"https://www.channelnewsasia.com/world/fed-leaves-key-rate-unchanged-awaiting-impact-trump-policies-4904476","image":"https://dam.mediacorp.sg/image/upload/s--nbK_pXVS--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/federal_reserve_64988.jpg?itok=XIJ1Urfy","video":null,"publish_date":"2025-01-29 19:30:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.242},{"id":285241282,"title":"Understanding Trump’s proposal to buy out federal employees","text":"President Donald Trump’s administration is offering buyouts to federal employees to quickly reduce the government workforce. They don’t have a long time to decide: The deadline is Feb. 6.\n\nThe buyouts are for all full-time federal employees except for military personnel, employees of the U.S. Postal Service and those in positions related to immigration enforcement and national security. They would get about eight months of salary if they accept.\n\nAn email about the offer was sent Tuesday to more than 2 million workers, according to Katie Miller, who serves on an advisory board to the Department of Government Efficiency, a special commission headed by Tesla CEO Elon Musk and tasked with shrinking the size of government.\n\nHere’s what we know about the offer and the makeup of the federal workforce:\n\nWhat is the offer?\n\nIn addition to receiving their salary and retaining all benefits during this time, workers who go along will be exempted from all applicable in-person work requirements until Sept. 30, as the administration pushes to require employees to return to offices. The emailed offer includes instructions on how to accept: select “Reply” and “Type the word ‘Resign’ into the body of this email and hit ‘send.'”\n\nWhat if workers decide to stay?\n\nThey will be expected to return to their offices full time, in keeping with the president’s push to end COVID-19 pandemic-era remote work. The memo says Trump “will insist on excellence at every level.” It also notes that the majority of federal agencies “are likely to be downsized,” and that “employees will be subject to enhanced standards of suitability and conduct as we move forward.”\n\nCan they return to government service?\n\nWorkers who take the buyout can apply for other government work in the future.\n\nHow many employees are there?\n\nThe federal government employed more than 3 million people as of November, accounting for nearly 1.9% of the nation’s entire civilian workforce, according to the Pew Research Center. The civilian workforce is about 2.4 million, excluding U.S. Postal Service employees and active-duty military.\n\nThe number of federal workers who are not postal employees or active-duty military has been slowly growing since 2000, but has mostly kept pace with the growth of the overall population, according to an analysis by Pew.\n\nHow long do federal employees stay on the job?\n\nThe average tenure for a federal employee is nearly 12 years, according to a Pew analysis of data from the Office of Personnel Management. The highest percentage of them, about 19%, have worked for the government between five years and 10 years About 15% have worked between 10 years to 14 years, and about 14% have worked between 15 years and 19 years. The numbers drop off after that. Nearly 9% have worked 20 years to 24 years, and nearly 4% have worked between 25 years and 29 years. A little more than 3% have worked 30 years to 34 years, and about 3.4% have worked 35 or more years.\n\nWhere do they work?\n\nThe largest chunk of federal workers, nearly 20%, are in the District of Columbia and neighboring Maryland and Virginia, according to the Pew analysis. California, the nation’s largest state by population, has the highest number, about 147,500, but that’s less than 1% of total nonfarming employees in the state.\n\nOther big states also have large numbers of federal workers. There are about 130,000 in Texas, but that accounts for less than 1% of nonfarming jobs there; Florida has about 94,000.\n\nWhat do workers say about the offer?\n\nFederal workers only got the offer late Tuesday. The proposal was criticized by the head of the American Federation of Government Employees Union, Everett Kelley, who said the buyouts were more of an effort to pressure workers who were not considered loyal to the new administration to leave their jobs.\n\n“Purging the federal government of dedicated career federal employees will have vast, unintended consequences that will cause chaos for the Americans who depend on a functioning federal government,” Kelley said in a statement. “Between the flurry of anti-worker executive orders and policies, it is clear that the Trump administration’s goal is to turn the federal government into a toxic environment where workers cannot stay even if they want to.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump&#8217;s administration is offering buyouts to federal employees to quickly&#8230;\n\n\nThis Post: Understanding Trump&#8217;s proposal to buy out federal employees first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/understanding-trumps-proposal-to-buy-out-federal-employees/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-What-to-know-about-Trump039s-buyout-proposal.jpg","video":null,"publish_date":"2025-01-29 19:29:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.097},{"id":285246182,"title":"TikTok suppressed content critical of Trump, exclusive report alleges","text":"EXCLUSIVE: As the Trump administration works to keep TikTok legally available in the United States, the wildly popular app has suppressed content critical of President Donald Trump, according to a new report shared exclusively with Fox News. TikTok maintains the report has reached a false conclusion, and that the researchers used terms subjected to additional safety measures because they’ve been associated with election misinformation or profanity. The report, from the Network Contagion Research Institute (NCRI) at Rutgers University, contained findings that \"highlight TikTok's ability to act as a powerful influence tool, adaptable to partisan politics, but with no inherent incentive for transparency or accountability.\" CHINESE AI STARTUP DEEPSEEK FACING HACK, BLOCKS QUESTIONS ABOUT COMMUNIST PARTY TIES \"What you're seeing is not sweeping policies around content moderation that can be battle tested by the public or by researchers,\" said Adam Sohn, an NCRI board member. \"TikTok seems to be just sort of picking and choosing their policies based on political expediency, and that's a big concern.\" NCRI said it analyzed TikTok, X, and Instagram \"to evaluate their handling of specific hashtags associated with the 2020 election controversy\" and that researchers received a response that \"explicitly indicated content suppression based on TikTok’s enforcement of its community standards.\" The group said terms such as \"#RiggedElection,\" \"#VoterFraud,\" \"#StopTheSteal,\" and \"#StolenElection\" returned no results on TikTok in the U.S. Researchers said that when they searched using software that swapped their domestic location for one overseas, those terms produced video results. Screen grabs provided by NCRI show a Jan. 24 TikTok search for \"#F***JoeBiden\" that returned 37,000 results. A search the same day for \"#F***Trump\" returned none. Three days later, Fox News replicated the search and there were videos listed under both. REPUBLICAN STATE AGS AWAIT TRUMP-BROKERED TIKTOK DEAL, REMAIN SKEPTICAL ON APP SAFETY \"The concern is that the Chinese Communist Party and Bytedance and TikTok itself can consistently tweak its algorithm to cover up its tracks,\" Sohn said. \"Our policies and algorithms haven't changed in the last week,\" said a TikTok spokesperson. The company maintains hashtags regarding the 2020 election controversies have promoted election misinformation, which is why they’ve been unavailable. TikTok contends that because the anti-Trump and anti-Biden search terms contain profanity, the app can limit those results. The company also says it’s experiencing technical issues as it’s trying to return its service to normal. Last year, Congress passed a bipartisan law that would ban TikTok if its Chinese parent company, ByteDance, failed to sell the app by Jan. 19. Earlier this month, the U.S. Supreme Court upheld the law. ByteDance still owns TikTok, but Trump signed an executive order delaying the ban’s enforcement for 75 days while his administration tries to negotiate an agreement for the app to comply with the law and keep it operating in the U.S. NCRI has issued several reports on TikTok, concluding its search algorithm produced results to construct a favorable view of China’s government. TikTok has denied that allegation, calling NCRI’s work \"flawed\" and \"clearly engineered to reach a false, predetermined conclusion.\" In its arguments against TikTok, the Justice Department under the Biden administration cited NCRI’s reports. Cybersecurity experts told Fox that algorithms for apps like TikTok are held closely by their parent companies and can be difficult to evaluate. \"Doing sort of this community management of these vast social media platforms, especially TikTok, which is so popular, is a Herculean task,\" said Theresa Payton, a cybersecurity expert and the White House Chief Information Officer in the George W. Bush administration. \"It could be that as they were making tweaks to handle capacity, to be able to more closely evaluate things that could be perceived as election interference, things that are considered hate speech.\" Others note social media companies have sizable teams working with automated software to moderate content on their platforms. CLICK HERE TO GET THE FOX NEWS APP \"Someone interprets something as in terms of a violation [that] may not match with someone else – it all sort of has to add up to a pattern,\" said Pete Pachal, the Founder of The Media Copilot, a newsletter on AI changing media and journalism. \"In the report, they do a very good job of showing that this pattern of supposed repression … content not appearing in searches does tend to happen more in one direction, and that should arouse a certain amount of suspicion.\"","summary":"A new report claims TikTok participates in suppressing content critical of President Donald Trump as the new administration works to keep the app available in the U.S.","url":"https://www.foxnews.com/politics/tiktok-suppressed-content-critical-trump-exclusive-report-alleges","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/12/931/523/trump-tiktok.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:28:43","author":"Rich Edson","authors":["Rich Edson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.401},{"id":285246190,"title":"Democrats coordinate multi-state response to Trump's funding freeze","text":"Morally indignant Senate Democrats piled on President Donald Trump's federal funding freeze Wednesday, with Senate Minority Leader Chuck Schumer, D-N.Y., announcing a coordinated response with Democratic governors to come. The Office of Management and Budget issued a memo on Monday issuing a pause on all federal grants and loans aiming to eradicate \"wokeness\" and the \"weaponization of government\" to improve government efficiency. The memo claims nearly $3 trillion was spent in 2024 on such assistance programs. The White House insists this freeze does not touch programs including Social Security, Medicare, or other entitlement payments, but Schumer called Trump's action \"chaotic,\" \"careless,\" and \"cruel\" at the Democratic leadership's weekly press briefing. \"In one instant, in the blink of an eye, in the dark of night, Donald Trump committed one of the cruelest actions that I have seen the federal government do in a very long time,\" Schumer said, claiming Trump had shut off \"billions, maybe trillions of dollars that average American families need.\" FEDERAL JUDGE PAUSES TRUMP ADMIN'S TEMPORARY FEDERAL GRANTS, LOANS FREEZE The minority leader said there are ongoing discussions between Capitol Hill Democrats and various Democratic governors on a coordinated response to Trump's action. Two dozen blue state attorneys general have already announced legal action to keep the federal grant, loan and other aid flowing. Democrats said they have received an avalanche of phone calls from local officials, non-governmental organizations, charities and individual constituents demanding to know if OMB's memo meant taxpayer dollars they rely on to serve people were about to disappear. \"Chaos reigned. I got calls from a whole lot of Republican town supervisors and mayors, asking, what about flood prevention? What about sewer construction projects?\" Schumer said. He recounted additional calls from food bank operators, nonprofit groups that treat addiction and church groups worried they would not be able to make payroll. White House press secretary Karoline Leavitt told reporters Tuesday that the OMB memo would not impact individuals who receive direct assistance from the federal government. She described the pause as \"temporary\" and likened it to simultaneous efforts by the Trump administration to freeze hiring and regulations in an effort to shrink the government. FACT OR FICTION: WILL TRUMP'S FEDERAL FUNDING FREEZE IMPACT STUDENT LOANS, GRANTS? \"Federal agencies must temporarily pause all activities related to obligation or disbursement of all Federal financial assistance, and other relevant agency activities that may be implicated by the executive orders, including, but not limited to, financial assistance for foreign aid, nongovernmental organizations, DEI, woke gender ideology, and the green new deal,\" the memo, obtained by Fox Digital, reads. A federal judge on Tuesday imposed a stay on Trump's action, delaying it until Monday as a torrent of lawsuits against the administration were announced this week. New York Attorney General Letitia James on Tuesday led a coalition of 22 other attorneys general suing to stop the implementation of the memo. In a statement from James' office, she said the policy \"puts an indefinite pause on the majority of federal assistance to states\" and would \"immediately jeopardize state programs that provide critical health and childcare services to families in need, deliver support to public schools, combat hate crimes and violence against women, provide life-saving disaster relief to states, and more.\" ‘ANSWERED THIS QUESTION FOUR TIMES’: LEAVITT PUSHES BACK ON MEDIA'S ‘UNCERTAINTY’ ABOUT FEDERAL FUNDING FREEZE Republicans have mostly backed Trump, insisting that the new presidential administration has a right to examine how taxpayer dollars are spent. \"This is not unusual for an administration to pause funding and to take a hard look and scrub of how these programs are being spent and how they interact with a lot of the executive orders that the president signed,\" Senate Majority Leader John Thune, R-S.D., told reporters, though he expressed hope that the White House would \"further clarify what exactly will be impacted by this.\" CLICK TO GET THE FOX NEWS APP Sen. Patty Murray, D-Wash., the top Democratic appropriator, said Trump's actions have endangered chances for a bipartisan spending agreement when the government funding deadline arrives in March. \"It is extremely difficult to agree to a compromise on anything if the White House is going to assert that they control the funds, we don't,\" Murray said. \"So this is really putting that in jeopardy.\"","summary":"Senate Democrats announced they would coordinate with blue state governors to fight back against Trump&apos;s federal funding freeze, which could hold up trillions of dollars in assistance.","url":"https://www.foxnews.com/politics/democrats-coordinate-multi-state-response-trumps-funding-freeze","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/senate-minority-leader-chuck-schumer-martin-heinrich.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:27:19","author":"Chris Pandolfo","authors":["Chris Pandolfo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.425},{"id":285241274,"title":"Indian Prime Minister Modi holds talks with President Trump, aiming to strengthen relations","text":"President Donald Trump’s recent return to the White House has caused a stir worldwide, but India appears to be viewing his second term with a positive outlook. Just a little over a week into Trump’s new term, India seems willing to adjust to his approach of diplomatic dealings based on transactions.\n\nTrump and Indian Prime Minister Narendra Modi had a “productive call” on Monday, focused on “expanding and deepening cooperation.” \n\nThe White House has reported that during their recent discussions, the leaders exchanged views on geopolitical matters and trade relations between the two countries. President Trump stressed the significance of India ramping up its procurement of security equipment made in America to help level the playing field in their trade ties. This conversation is believed to be one of the initial calls Trump has had with foreign leaders since resuming office.\n\nMoreover, notable figures of Indian descent are part of Trump’s administration. For instance, Kash Patel, who has been nominated for the position of FBI director, is set to undergo a critical Senate confirmation hearing this week. If his appointment is confirmed, Patel will make history as the first Indian American to head the FBI, holding the distinction of being its youngest director too. Additionally, Trump has selected Dr. Jay Bhattacharya to lead the National Institutes of Health, and Harmeet K. Dhillon for the role of assistant attorney general for Civil Rights. Other influential Indian-Americans, such as former 2024 presidential contender Vivek Ramaswamy and senior policy adviser for AI Sriram Krishnan, already play significant advisory roles in the administration. Although these appointments have inspired hope among many Indian immigrants, Krishnan, a first-generation Indian, has sparked controversy within the MAGA community. Furthermore, while not serving in a cabinet position, Usha, the wife of Vice President JD Vance, is the first woman of Indian origin to hold the title of second lady.\n\nIndia remains optimistic about strengthening its relationship with the U.S. under Trump’s leadership, viewing it as an opportunity to further its strategic interests on the global stage. Modi is expected to meet with Trump as soon as next month. Meanwhile, Trump is expected to visit India later this year to attend a Quad Leaders’ Summit hosted by New Delhi.\n\n“The fact that India, with its nationalist government and strong confidence as a rising power, would so quickly and publicly acknowledge a willingness to consider making concessions to the U.S. says a lot about just how much it wants its partnership with Washington to work in the second Trump administration,” Kugelman said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump&#8217;s recent return to the White House has caused a&#8230;\n\n\nThis Post: Indian Prime Minister Modi holds talks with President Trump, aiming to strengthen relations first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/indian-prime-minister-modi-holds-talks-with-president-trump-aiming-to-strengthen-relations/","image":"https://internewscast.com/wp-content/uploads/2025/01/Indias-Modi-speaks-with-dear-friend-President-Trump-amid-hopes.jpg","video":null,"publish_date":"2025-01-29 19:26:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.265},{"id":285249572,"title":"'Backs down with a whimper': Trump slammed as 'agent of chaos' after OMB rescinds funding freeze","text":"President Donald Trump set off yet another controversy when, on Tuesday, January 28, he declared a federal government funding freeze. Many Democrats were quick to express their outrage, arguing that he had no right to do that — as the funds in question had already been approved by Congress.\n\n But the following day, a brief memo from the U.S. Office of Management and Budget (OMB) informed federal workers that the freeze had been \"rescinded.\" The memo didn't offer a lot of details but read, \"If you have questions about implementing the President's Executive Orders, please contact your agency General Counsel.\"\n\nWhite House Press secretary Karoline Leavitt, however, is saying that the freeze has not been rescinded.\n\nREAD MORE: Outraged Trump lashes out at Seth Meyers as explosive Jack Smith report unveiled\n\nIn a Wednesday afternoon, January 29 post on X, formerly twitter, Leavitt wrote, \"This is NOT a rescission of the federal funding freeze. It is simply a rescission of the OMB memo. Why? To end any confusion created by the court's injunction. The President's EO's on federal funding remain in full force and effect, and will be rigorously implemented.\" \n\nMSNBC's Michael A. Cohen tweeted, in response, \"Even for the White House, this is impressive lying. The OMB memo is the federal funding freeze. It has been rescinded. Not happening. Trump's EO on federal funding is something different.\"\n\nPolitico's Kyle Cheney, responding to Leavitt's tweet, wrote, \"This is causing widespread confusion -- but we may get clarity in an hour when DOJ has to represent to a federal court what is going on here.\"\n\n The memo announcing the rescinding of the freeze is getting many other reactions on X. And a word that is being used a lot is \"chaos.\" \n\nREAD MORE: GOP lawmakers staying silent as Trump 'runs roughshod over Congress'\n\nDaily Kos reporter Emily C. Singer tweeted, \"After causing chaos to order a blatantly unconstitutional freeze on congressionally appropriated funds, the Trump administration backs down with a whimper.\"\n\nNBC News' Peter Alexander tweeted a copy of the memo, noting, \" Trump’s White House OMB rescinds federal aid freeze.\"\n\nRep. Joe Neguse (D-Colorado) posted, \"House Republicans spent the past 24 hours shamelessly defending President Trump's unconstitutional funding freeze — only for him to rescind it this morning!\"\n\nBloomberg News noted that the order, before it was rescinded, froze \"an array of federal grants, loans and financial assistance in a dramatic reversal.\"\n\nDemocratic activist Ron Smith commented, \"We need to put more pressure on him so he can at least start listening to the American people.\"\n\nAnother Democratic activist, Lucas Sanders, wrote, \"BREAKING: Donald Trump has officially released a memo rescinding his federal freeze of grants and loans. Thank you to everyone for speaking out.\"\n\nWCTV Eyewitness News in Tallahassee, Florida posted, \"President Trump's budget office Wednesday rescinded an order freezing spending on federal grants, less than two days after it sparked widespread confusion and legal challenges across the country, according to two people familiar with the matter.\"\n\nPathfinder Research founder Derek Martin remarked, \"This OMB order was so misguided that the Trump admin rescinded it in 48 hours. These people aren't revolutionaries, they're uninformed trolls who got the key to the castle. They won't be able to help you're family because *they don't know how to.*\"\n\nThe group New York Women for Action tweeted, \"CHAOS. Trump White House reverses course, rescinds freeze on federal grants after Americans deluge Washington with angry posts, calls, letters.\"\n\nTracie Delgado, a professor at Seattle Pacific University, commented, \"Looks like we are back in business. Now that was chaotic.\"\n\nDocumentary filmmaker/historian Dan Manatt wrote, \"NOW DEMS: ATTACK! Trump is Emperor of Chaos Trump White House reverses course, rescinds freeze on federal grants.\"\n\nREAD MORE: 'Dangerous precedent': Bill criminalizing local votes draws outrage – even from Republicans","summary":"President Donald Trump set off yet another controversy when, on Tuesday, January 28, he declared a federal government funding freeze. Many Democrats were quick to express their outrage, arguing that he had no right to do that — as the funds in question had already been approved by Congress.\n\n But the following day, a brief memo from the U.S. Office of Management and Budget (OMB) informed federal workers that the freeze had been \"rescinded.\" The memo didn't offer a lot of details but read, \"If you have questions about implementing the President's Executive Orders, please contact your agency General Counsel.\"\n\nWhite House Press secretary Karoline Leavitt, however, is saying that the freeze has not been rescinded.\n\nREAD MORE: Outraged Trump lashes out at Seth Meyers as explosive Jack Smith report unveiled\n\nIn a Wednesday afternoon, January 29 post on X, formerly twitter, Leavitt wrote, \"This is NOT a rescission of the federal funding freeze. It is simply a rescission of the OMB memo. Why? To end any confusion cr","url":"https://www.alternet.org/backs-down-with-a-whimper-trump-slammed-as-agent-of-chaos-after-rescinding-federal-funding-freeze/","image":"https://www.alternet.org/media-library/image.jpg?id=56106200&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-01-29 19:25:34","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":-0.314},{"id":285240244,"title":"Fed hold rates steady, says job market is ‘solid’ while inflation ‘remains somewhat elevated’","text":"WASHINGTON (AP) — The Federal Reserve left its benchmark interest rate unchanged Wednesday after cutting it three times in a row last year, a sign of a more cautious approach as the Fed seeks to gauge where inflation is headed and what policies President Donald Trump may pursue.\n\nThe Fed reduced its rate last year to 4.3% from 5.3%, in part out of concern that the job market was weakening. Hiring had slowed in the summer and the unemployment rate ticked up, leading Fed officials to approve an outsized half-point cut in September. Yet hiring rebounded last month and the unemployment rate declined slightly, to a low 4.1%.\n\nIn its statement Wednesday, the Fed upgraded its assessment of the job market, calling it “solid,” and noting that the unemployment rate “has stabilized at a low level in recent months.” The Fed also appeared to toughen its assessment of inflation, saying that it “remains somewhat elevated.” Both a healthier job market and more stubborn inflation typically would imply fewer Fed rate cuts in the coming months.\n\nFed Chair Jerome Powell has said it is harder to gauge where inflation is headed, in part because of increased uncertainty around what policies Trump will adopt and how quickly they will affect the economy. Trump has promised widespread tariffs, tax cuts, and mass deportation of immigrants, all of which could push prices higher. The Fed typically keeps interest rates high to slow borrowing and spending and cool inflation.\n\nPowell said in December that the central bank has entered a “new phase,” in which it expects to move more deliberately. In December, Fed officials signaled they may reduce their rate just twice more this year. Goldman Sachs economists believes those cuts won’t happen until June and December.\n\nIn November, inflation was just 2.4%, according to the Fed’s preferred measure, not far from its 2% target. But excluding the volatile food and energy categories, core prices rose a more painful 2.8% from a year earlier. The Fed pays close attention to core prices because they are often a better guide to inflation’s future path.\n\nNoting that the Fed had removed a reference to “inflation making progress” that was included in its previous rate decision statement, Lindsay Rosner, head of multi sector fixed income investing at Goldman Sachs Asset Management, said “while we continue to think the Fed’s easing cycle has not yet run its course, the (Fed) will want to see further progress in the inflation data to deliver the next rate cut.”\n\nIt’s unclear how of if Trump will respond to the Fed’s decision to stand pat. Last week in Davos, Switzerland, Trump said that he would bring down energy prices, then “demand” that the Fed lower borrowing costs.\n\nLater, when asked by reporters if he expected the Fed to listen to him, he said, “yes.” Presidents in recent decades have avoided publicly pressuring the Fed out of deference to its political independence.\n\nMost other central banks in developed countries are cutting their interest rates. The European Central Bank, for example, is widely expected to reduce borrowing costs at its next meeting on Thursday. The Bank of Canada said Wednesday it has also cut its rate, and the Bank of England is also expected to do so next month.\n\nThe Bank of Japan, however, is actually raising its rate from a rock-bottom level. Japan has finally experienced some inflation after decades of slower growth and bouts of deflation.\n\nA Fed rate cut in March is still possible, though financial markets’ futures pricing puts the odds of that happening at just one-third.\n\nAs a result, American households and businesses are unlikely to see much relief from high borrowing costs anytime soon. The average rate on a 30-year mortgage slipped to just below 7% last week after rising for five straight weeks. The costs of borrowing money have remained high economywide even after the Fed reduced its benchmark rate.\n\nThat is because investors expect healthy economic growth and stubborn inflation will forestall future rate cuts. They recently bid up the 10-year Treasury above 4.80%, its highest level since 2023.\n\nAnother reason for caution among Fed policymakers this year is that they will want to evaluate any changes in economic policy by the Trump administration. Trump has said he could slap tariffs of 25% on imports from Canada and Mexico as early as Feb. 1. During his presidential campaign he threatened to impose taxes on all imports.\n\nThe Trump administration has also said it will carry out mass deportations of migrants, which could push up inflation by reducing the economy’s ability to produce goods and services. At the same time, some economists say Trump’s promises to deregulate the economy could lower prices over time.\n\nWhen Trump imposed tariffs on a limited number of imports in 2018 and 2019, Fed economists expected the biggest impact to fall on economic growth, with the inflationary impact being relatively minor. As a result, when growth did slow, the Fed ended up cutting its key rate in 2019, rather than raising it to fight off any inflationary impact.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The Federal Reserve left its benchmark interest rate unchanged Wednesday after cutting it three times in a row last year, a sign...","url":"https://wsvn.com/news/us-world/fed-hold-rates-steady-says-job-market-is-solid-while-inflation-remains-somewhat-elevated/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/11/110724-Federal-Reserve.png","video":null,"publish_date":"2025-01-29 19:25:22","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.283},{"id":285247214,"title":"Fed holds rates steady, drops reference to inflation ‘progress’ from policy statement","text":"WASHINGTON: The Federal Reserve held interest rates steady on Wednesday and gave little insight into when further reductions in borrowing costs may take place in an economy where inflation remains above target, growth continues, and the unemployment rate is low.\n\nAfter several months in which inflation data have largely moved sideways, the U.S. central bank dropped from its latest policy statement language saying that inflation “has made progress” towards the Fed’s 2% inflation goal, noting only that the pace of price increases “remains elevated.”\n\nRecent key inflation readings remain about half a percentage point or more above the Fed’s target.\n\nFed officials say they largely believe the progress in lowering inflation will resume this year, but have now put rates on hold as they await data to confirm it.\n\n“Economic activity has continued to expand at a solid pace. The unemployment rate has stabilized at a low level in recent months, and labor market conditions remain solid,” the central bank’s policy-setting Federal Open Market Committee said in a statement after the end of its latest two-day meeting.\n\nUS Fed starts rate deliberations with pause expected\n\n“In considering the extent and timing of additional adjustments to the target range for the federal funds rate, the Committee will carefully assess incoming data, the evolving outlook, and the balance of risks,” it said.\n\nThe unanimous decision to keep the overnight interest rate in the current 4.25%-4.50% range, coupled with the new statement, puts the Fed in a holding pattern as officials await further inflation and jobs data and clarity on the impact of President Donald Trump’s policies.\n\nThe Trump administration already has moved to deport some undocumented immigrants and freeze federal spending, and could broaden its reach to include as soon as this weekend new import tariffs on major trading partners such as Mexico and Canada.\n\nFed Chair Jerome Powell will hold a press conference at 2:30\np.m. EST (1930 GMT) to elaborate on this week’s policy meeting.\n\nThe decision to hold the policy rate steady was widely anticipated following three consecutive rate cuts in 2024 that reduced the Fed’s benchmark rate by a full percentage point.\n\nThere is debate at the central bank about how much further rates may need to fall, with policymakers anticipating perhaps two quarter-percentage-point rate cuts over the course of the year.\n\nOfficials say they want to see if inflation continues to fall to the Fed’s target in the months ahead before easing monetary policy again, while also expressing uncertainty about the effect Trump’s plans will have on price pressures, the labor market and economic growth.","summary":"WASHINGTON: The Federal Reserve held interest rates steady on Wednesday and gave little insight into when further reductions in borrowing costs may take place in an economy where inflation remains above target, growth continues, and the unemployment rate is low.\n\n\nAfter several months in which inflation data have largely moved sideways, the U.S. central bank dropped from its latest policy statement language saying that inflation “has made progress” towards the Fed’s 2% inflation goal, noting only that the pace of price increases “remains elevated.”\n\n\nRecent key inflation readings remain about half a percentage point or more above the Fed’s target.\n\n\nFed officials say they largely believe the progress in lowering inflation will resume this year, but have now put rates on hold as they await data to confirm it.\n\n\n“Economic activity has continued to expand at a solid pace. The unemployment rate has stabilized at a low level in recent months, and labor market conditions remain solid,” the central bank’s policy-set","url":"https://www.brecorder.com/news/40345318/fed-holds-rates-steady-drops-reference-to-inflation-progress-from-policy-statement","image":"https://i.brecorder.com/large/2025/01/3000224928f8414.jpg?r=002304","video":null,"publish_date":"2025-01-29 19:23:03","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.108},{"id":285246188,"title":"Illinois city's police department vows to block law enforcement from coordinating with ICE","text":"An Illinois city police department has vowed to block local law enforcement from coordinating with ICE. The department said that, in accordance with Illinois’ Trust Act, it will not give ICE information on individuals suspected to be illegal immigrants. \"The city’s main objective during this time is to secure and maintain the well-being of our community by following the guidance of the Illinois Attorney General Office, avoiding participation in federal enforcement efforts by preventing the sharing of information based solely on immigration status,\" Waukegan Police Department's official statement reads. Illinois passed the Trust Act during President Donald Trump’s first term in office in 2017. Popular X account Libs of TikTok shared the statement and slammed the department. \"Obstructing law enforcement is a crime,\" the account posted. \"Harboring a fugitive is a crime.\" NYC OFFICIAL SAYS 'PARTY IS OVER' FOR ILLEGAL IMMIGRANTS Chicago Mayor Brandon Johnson confirmed that the city will continue to comply with the state’s legislation. \"Chicago stands strong: regardless of the circumstances, our commitment to protecting and supporting this city remains unwavering,\" Johnson wrote in a social media post on Sunday. \"We will continue to fight for the justice and safety of all who call this place home.\" Ahead of President Trump’s return to the White House, sanctuary city leaders doubled down on their opposition to aiding federal immigration efforts. City lawmakers from Chicago to San Diego reaffirmed their local ordinances blocking local law enforcement from aiding ICE. In his January 2025 inauguration address, Trump touched on his plan to tackle illegal immigration, which played a central role in his re-election campaign. \"All illegal entry will immediately be halted, and we will begin the process of returning millions and millions of criminal aliens back to the places from which they came,\" Trump said. TRUMP ADMINISTRATION CARRIES OUT MULTIPLE RAIDS TARGETING ‘CRIMINAL ALIENS’ IN FIRST WEEKEND Tom Homan, Trump’s no-nonsense border czar, isn’t backing down to sanctuary cities that refuse to cooperate. \"Sanctuary cities are going to get exactly what they don't want — more agents in the communities, more people arrested, more collaterals arrested. So that's a game they want to play? Game on,\" Homan recently told \"Fox & Friends.\" ICE has been documenting its arrest numbers on X as it works to fulfill the mass deportation promise Trump made to voters during his campaign. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital was unable to reach Waukegan Police Department for comment.","summary":"Waukegan Police Department in Illinois issued a statement reaffirming its adherence to the state&apos;s Trust Act, which prohibits local law enforcement from providing information to ICE.","url":"https://www.foxnews.com/us/illinois-citys-police-department-vows-block-law-enforcement-from-coordinating-ice","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/ice-making-arrest.png?ve=1&tl=1","video":null,"publish_date":"2025-01-29 19:23:01","author":"Rachel Wolf,Sarah Rumpf-Whitten","authors":["Rachel Wolf","Sarah Rumpf-Whitten"],"language":"en","category":"politics","source_country":"us","sentiment":-0.018},{"id":285242488,"title":"Kash Patel, Trump's pick to lead the FBI, to have confirmation hearing tomorrow","text":"Kash Patel, President Trump's nominee to serve as FBI director, is set to appear Thursday on Capitol Hill for a high-stakes confirmation hearing before the Senate Judiciary Committee amid calls from Republicans for massive reforms in FBI leadership and concerns from Democrats about his fitness to lead the nation's top law enforcement agency.Patel — a staunch Trump ally and former federal prosecutor and national security official — was Mr. Trump in December to take the helm at the agency that has long been a target of the president's ire. The FBI director at the time, Christopher Wray, appointed by Mr. Trump in his first term, then announced his departure from the top job despite having not yet served the full ten-year term. He told 60 Minutes his decision was prompted in part by a desire to transition \"in an orderly way\" and \"not thrust the FBI deeper into the fray.\"Presidents have the power to replace FBI directors as they see fit and many past directors have not served full 10-year terms. Patel previously served in intelligence and defense roles in Mr. Trump's first term and held a position on the National Security Council and as chief of staff to the secretary of defense.An FBI whistleblower alleged that while serving in government, Patel violated firmly entrenched protocols to keep hostage rescue operations under wraps until the captives are safely in U.S. hands and their families have been notified, CBS News previously reported. In a letter obtained by CBS News, Sen. Dick Durbin, the ranking Democrat on the Senate Judiciary Committee, wrote that Patel, while serving on the National Security Council during the first Trump term, \"broke protocol regarding hostage rescues by publicly commenting without authorization on the then-in-progress retrieval of two Americans held captive by Iranian-backed militants in Yemen in October 2020.\" A source close to Patel pushed back on the allegations and Democrats' criticism, telling CBS News, \"Mr. Patel was a public defender, decorated prosecutor and accomplished national security official that kept Americans safe. He has a track record of success in every branch of government, from the courtroom to congressional hearing room to the situation room. There is no veracity to this anonymous source's complaints about protocol.\" A former Justice Department prosecutor, Patel has been highly critical of leadership within the organization and he has alleged recent cases against Mr. Trump were politically weaponized against the president and Republicans, allegations officials within the agency have previously denied. In 2023, Patel published a book titled \"Government Gangsters\" in which he alleged the \"FBI has become so thoroughly compromised that it will remain a threat to the people unless drastic measures are taken.\" And he has pledged to take on government officials and members of the media who he said \"lied about American citizens who helped Joe Biden rig presidential elections.\" The FBI came under increased scrutiny from Mr. Trump and his allies in 2022, when FBI agents executed a court-authorized search warrant at his Mar-a-Lago residence in Florida. The search exposed what had been an ongoing federal probe into Trump's handling of classified records after he left office. The president has long denied wrongdoing and alleged the FBI and Justice Department were targeting him because of political considerations.If confirmed by the Senate, Patel would be the third FBI director to work under a Trump administration and would take over the nation's chief federal law enforcement apparatus amid years of intense criticism from Trump and his allies on Capitol Hill. He would report to the U.S. Attorney General. Trump's pick for that role, former Florida Attorney General Pam Bondi, cleared a critical committee vote on Wednesday and is likely to be confirmed for her post in the coming days. Many Republican senators on the Judiciary Committee, including chairman Chuck Grassley of Iowa, have applauded Patel's nomination as a step toward needed reform. \"The common sense that we have in the Midwest – we need more of it in Washington, D.C. and I think the [nominees] are going to bring it in, and Kash is one of them,\" Grassley said on a recent podcast. Democrats, however, have been outspoken in their opposition to Patel's nomination and pointed to his past as a reason for concern. To be confirmed, Patel will first have to receive a majority of votes from within the GOP-led Senate Judiciary Committee, after which his nomination would be presented to the full senate for a vote. Dan Klaidman contributed to this report.","summary":"Kash Patel is a staunch Trump ally and a former federal prosecutor and national security official.","url":"https://www.cbsnews.com/news/kash-patel-to-face-confirmation-hearing-fbi-donald-trump-ally/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/01/29/558af177-b177-4a12-b96a-634450e090bf/thumbnail/1200x630/ea38b19271616a0b39d78e02569b2b5e/gettyimages-2189592219.jpg?v=d4034f91d2441fe84007132fdf593e3f","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3496393_hls/master.m3u8","publish_date":"2025-01-29 19:22:55","author":"Jacob Rosen,Robert Legare","authors":["Jacob Rosen","Robert Legare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.091},{"id":285246642,"title":"Fed Pauses Interest Rate Cuts in First Key Decision of Trump's Second Term","text":"On Wednesday, the Federal Reserve opted to keep its benchmark interest rate unchanged after reducing it three times consecutively last year. This decision reflects a more cautious stance as the Fed aims to assess the future direction of inflation and the policies that President Donald Trump may implement.Newsweek reached out to the Trump administration via email Wednesday afternoon for comment.Why It MattersLast year, the Fed lowered its rate from 5.3 percent to 4.3 percent, partly due to concerns about a weakening job market. Over the summer, hiring had slowed, and the unemployment rate had increased, prompting Fed officials to approve an unusually large half-point cut in September. However, hiring recovered last month, and the unemployment rate declined slightly to a low of 4.1 percent.What To KnowFederal Reserve Chair Jerome Powell emphasized the challenges in predicting inflation's path, particularly with the uncertainty around Trump's policies, such as tariffs, tax cuts and immigration measures. Trump's proposed policies could lead to higher prices, affecting the Fed's strategy to control inflation by maintaining higher interest rates to curb borrowing and spending.Whether or not Trump will react to the Fed's decision to keep interest rates steady remains uncertain. During a recent appearance in Davos, Switzerland, Trump declared his intention to reduce energy prices and subsequently \"demand\" that the Fed lower borrowing costs.When pressed by reporters on whether he believed the Fed would heed his demands, Trump responded affirmatively with \"yes.\" Traditionally, presidents have refrained from publicly pressuring the Federal Reserve, respecting its political independence.Goldman Sachs economists expect only two more rate cuts this year, which are predicted for June and December while acknowledging the ambiguity around policy impact. The slightly improved core prices, excluding food and energy, increased by 2.8 percent from the previous year. The Fed generally focuses on core prices as predictors of future inflation trends.Other central banks, like the European Central Bank and the Bank of Canada, are expected to cut their borrowing costs soon, contrasting with Japan's Bank, which is raising rates after prolonged economic stagnation.In the U.S., borrowing costs remain high, including the average rate on a 30-year mortgage hovering just below 7 percent.What Happens NextThough the Fed cut its rate last year, many investors anticipate steady economic growth and persistent inflation, thereby maintaining elevated borrowing rates. As Trump's administration plans more economic changes, the Fed remains observant, poised to adjust its policies based on upcoming economic data and policy implementations.This article includes reporting from The Associated Press.Update 1/29/25, 2:53 p.m. ET: This article was updated with additional information.","summary":"The decision reflects a cautious stance as the Fed assesses the direction of inflation and policies President Trump may implement.","url":"https://www.newsweek.com/fed-pauses-interest-rate-cuts-first-key-decision-trumps-second-term-2023103","image":"https://d.newsweek.com/en/full/2576617/powell-presser.jpg","video":null,"publish_date":"2025-01-29 19:22:26","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","source_country":"us","sentiment":0.143},{"id":285250090,"title":"Trump White House rescinds memo freezing federal grants after widespread confusion","text":"WASHINGTON (AP) — President Donald Trump’s budget office on Wednesday rescinded a memo freezing spending on federal grants, less than two days after it sparked widespread confusion and legal challenges across the country.\n\nThe Monday evening memo from the White House Office of Management and Budget sparked uncertainty over a crucial financial lifeline for states, schools and organizations that rely on trillions of dollars from Washington and left the White House scrambling to explain what would and wouldn’t be subject to a pause in funding.\n\nThe White House confirmed that OMB pulled the memo Wednesday in a two sentence notice sent to agencies and departments, but said that Trump’s underlying executive orders targeting federal spending in areas like diversity, equity and inclusion and climate change, remained in place.\n\nAdministration officials said the notice to halt loans and grants was necessary to conduct a review to ensure that spending complies with Trump’s recent blitz of executive orders. Agencies had been directed to answer a series of yes or no questions on each federal program by Feb. 7. The questions included “does this program promote gender ideology?” and “does this program promote or support in any way abortion?”\n\nStill, the vaguely worded memo, combined with incomplete answers from the White House throughout the day, left lawmakers, public officials and average Americans struggling to figure out what programs would be affected by the pause. Even temporary interruptions in funding could cause layoffs or delays in public services.\n\nThe freeze was scheduled to go into effect at 5 p.m. Tuesday, but was stayed by a federal judge until at least Monday after an emergency hearing requested by nonprofit groups that receive federal grants. An additional lawsuit by Democratic state attorneys general was also pending.\n\n“The Executive Orders issued by the President on funding reviews remain in full force and effect and will be rigorously implemented by all agencies and departments,” White House press secretary Karoline Leavitt said, blaming the confusion on the courts and news outlets, not the administration. “This action should effectively end the court case and allow the government to focus on enforcing the President’s orders on controlling federal spending.”\n\nTrump administration officials said programs that provide direct assistance to Americans, including Medicare, Social Security, student loans and food stamps, would not be affected. But they sometimes struggled to provide a clear picture.\n\nLeavitt initially would not say whether Medicaid was exempted from the freeze, but the administration later clarified that it was.\n\nAlthough Trump had promised to turn Washington upside down if elected to a second term, the effects of his effort to pause funding were being felt far from the nation’s capital. Organizations like Meals on Wheels, which receives federal money to deliver food to the elderly, and Head Start which provides early childcare in lower income communities, were worried about getting cut off.\n\nDemocratic critics of the order moved swiftly to celebrate the action.\n\n“This is an important victory for the American people whose voices were heard after massive pressure from every corner of this country—real people made a difference by speaking out,” said Sen. Patty Murray, D-Wash. “Still, the Trump administration—through a combination of sheer incompetence, cruel intentions, and a willful disregard of the law—caused real harm and chaos for millions over the span of the last 48 hours which is still ongoing.”\n\nSenate Democratic leader Chuck Schumer of New York said that “Americans fought back and Donald Trump backed off.","summary":"The White House confirmed that OMB pulled the memo Wednesday in a two sentence notice to agencies and departments, but said that Trump’s underlying executive orders targeting federal spending in areas like diversity, equity and inclusion and climate change, remained in place.","url":"https://www.mlive.com/politics/2025/01/trump-white-house-rescinds-memo-freezing-federal-grants-after-widespread-confusion.html","image":"https://www.mlive.com/resizer/v2/TVEWINY2EVCPZFLHPXUMDIOOAI.jpg?auth=4ddaf3b8e13b313e24949982ccfc0a55811f8753c74f4bab3b9142b8f17c6b54&width=1280&quality=90","video":null,"publish_date":"2025-01-29 19:21:38","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.432}]}