{"offset":0,"number":50,"available":20755,"news":[{"id":263201952,"title":"Key deadlines for the 2024 election results certification process","text":"President-elect Donald Trump defeated Vice President Kamala Harris in the 2024 presidential race, but several key dates are still ahead in the certification process before he takes the oath of office for his second term. \n\nThough considered bureaucratic in the past, the certification process has come under increased public scrutiny since the 2020 election, when Trump and his allies pushed false, unproven claims of widespread voter fraud and unsuccessfully challenged the results in court.\n\nElection officials and experts repeatedly stress that U.S. elections are free and fair.\n\nThe disinformation campaign ultimately culminated in the Jan. 6, 2021, riot at the U.S. Capitol that briefly delayed a joint session of Congress from certifying the 2020 election results. Trump has been charged with four counts in a case brought by special counsel Jack Smith stemming from his post-election conduct.\n\nIn late 2022, as a direct response to the Jan. 6 attack on the Capitol, Congress passed the Electoral Count Reform Act to tighten and clarify the rules of the electoral certification process.\n\nHere are the key presidential election certification dates for battleground states, the Electoral College and Congress.\n\nBattleground state certification deadlines\n\nState deadline: Nov. 25, 2024\n\nCounty boards of supervisors have until Nov. 21 to officially count votes in a process known as the “canvass.” Upon completion, the boards must send a copy to the secretary of state, who has until Nov. 25 to finish the statewide canvass and issue certificates of election.\n\nState deadline: Nov. 22, 2024\n\nCounty election superintendents must certify results by 5 p.m. ET on Nov. 12 and immediately send them to the secretary of state, who has until 5 p.m. on Nov. 22 to certify the votes cast and transmit them to the governor.\n\nState deadline: Nov. 25, 2024\n\nBoards of county canvassers must complete a canvass of the election by Nov. 19 and forward the results to the secretary of state within 24 hours. The Board of State Canvassers must then meet to finish its canvass and certify the outcome by Nov. 25.\n\nState deadline: Nov. 26, 2024\n\nBoards of county commissioners must finish the canvass of ballot returns and send the results to the secretary of state by Nov. 15. A majority of justices from the Nevada Supreme Court must then meet with the secretary of state by Nov. 26 to canvass the vote. Once the statewide canvass is done, the governor will issue certificates of election.\n\nNorth Carolina\n\nState deadline: Dec. 2, 2024\n\nCounty boards of elections must meet at 11 a.m. ET on Nov. 15 to canvass the votes and mail abstracts — forms showing the votes cast for each candidate — to the State Board of Elections and Clerk of the Court. The State Board of Elections will then meet at 11 a.m. on Nov. 26 to conduct a statewide canvass. Barring any protest, the state board will issue certificates of election on Dec. 2. If a protest is pending, the state board could delay certification until 10 days after its final decision on the matter.\n\nPennsylvania\n\nDeadline: Nov. 25, 2024\n\nCounty boards of elections must submit unofficial results to the secretary of the commonwealth by 5 p.m. on Nov. 12. If after five days there are no petitions for recounts or recanvasses filed, the county boards will certify the results with the secretary of the commonwealth. Boards must certify by Nov. 25 even in the event of a recount or a recanvass. The secretary will then conduct a statewide canvass and present the results to the governor, for which there is no state deadline.\n\nState deadline: Dec. 1, 2024\n\nCounty clerks have until Nov. 19 to deliver certified vote statements to the Wisconsin Elections Commission. The commission chair must then conduct a public canvass and certify the results by Dec. 1.\n\nFull Electoral College election results certification deadline\n\nSafe harbor deadline: Dec. 11, 2024\n\nUnder federal law, states have until Dec. 11 to certify election results, known as the safe harbor deadline. \n\nMeeting: Dec. 17, 2024\n\nAfter this date, state election results become finalized. On Dec. 17, Electoral College electors will meet and cast votes for the presidential candidates according to the will of their states. The results are then sent to Congress.\n\nU.S. Congress election results certification deadline\n\nCertification deadline: Jan. 6, 2025\n\nOn Jan. 6, 2025, four years after the assault on the Capitol, the House of Representatives and the Senate will convene to count and finalize the votes cast by the Electoral College. Lawmakers can object to a state’s electors, but the 2022 Electoral Count Act raised the necessary threshold to one-fifth of the House and Senate to proceed with the objection.","summary":"President-elect Donald Trump defeated Vice President Kamala Harris in the 2024 presidential race, but several key dates are still ahead in the certification process before he takes the oath of office for his second term.  Though considered bureaucratic in the past, the certification process has come under increased public scrutiny since the 2020 election, when &#8230;\n\n\nThe post Key deadlines for the 2024 election results certification process appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/key-deadlines-for-the-2024-election-results-certification-process/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/06/171950c3-5372-4177-8ffb-2e8ab6781921/thumbnail/1200x630/e7ffe50144c9d8d8c633b808db93fd13/ap24281855292303.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 01:03:09","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","source_country":"us","sentiment":-0.292},{"id":263202052,"title":"Australia ‘confident’ Trump won’t torpedo Aukus submarine deal","text":"Australia’s top diplomat said on Thursday she had a “great deal of confidence” that Donald Trump’s re-election will not sink a defence pact designed to underpin her country’s security.\nForeign Minister Penny Wong insisted the multibillion-dollar Aukus pact had bipartisan support and that both countries were eager to see a “stable” and “peaceful” Asia-Pacific region.\nThe 2021 pact binds the United States, Britain and Australia, facilitating the transfer of sensitive nuclear, missile and other defence technology.\n“We’ve been engaging with both sides of politics in the US for a very long time about this project,” Wong told Australian media.\n“We’re very pleased to see both the progress we’ve made with the support from Republicans and Democrats alike.”\nWong said in radio and television interviews on Thursday she had met with Mike Pompeo, who served as secretary of state in the previous Trump administration during the election campaign.\n“The United States is our principal strategic partner. We share very, very clear strategic objectives,” she told the Today programme.\nUnder the deal, Australia will acquire a fleet of nuclear-powered submarines and long-range missiles, a response to Chinese military ambitions in the Pacific region.\nSome fear Trump could jettison or try to rewrite the pact, returning to his “America first” style of foreign policy.\nChina’s Foreign Minister Wang Yi warned in a visit to Australia in April that Aukus raised “serious nuclear proliferation risks”, claiming it ran counter to a South Pacific treaty banning nuclear weapons in the region.\n\nMeanwhile, Australia’s high-profile ambassador to Washington – former centre-left prime minister Kevin Rudd – has deleted a series of withering social media posts about Trump, following the Republican’s election victory.\nAustralia’s foreign affairs department confirmed Rudd had deleted posts on social media platform X that had described Trump as “destructive” and a “traitor to the West”.\nA department official told a parliamentary hearing on Thursday that Rudd had deleted the tweets to “eliminate the possibility of such comments being misconstrued”.\n“Ambassador Rudd looks forward to working with President Trump and his team to continue strengthening the US-Australia alliance,” the official said.\nTrump, when asked about Rudd’s comments in a British TV interview in March, said Rudd was “not the brightest bulb” and “nasty”.\n“He won’t be there long if that’s the case,” Trump said.\nWong said she backed Rudd’s ability to work with a Republican administration.\nAdditional reporting by Reuters","summary":"Foreign Minister Penny Wong said the pact had bipartisan support and that both countries were eager to see a ‘stable’ Asia-Pacific region.","url":"https://www.scmp.com/news/asia/australasia/article/3285509/australia-confident-trump-wont-torpedo-aukus-submarine-deal","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/07/49487ace-3d60-40f8-ab00-344d1ca84dd9_e81ba834.jpg","video":null,"publish_date":"2024-11-07 01:02:59","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":0.158},{"id":263201628,"title":"Federal agency responsible for the draft reposts vulgar tweet suggesting the US is becoming Nazi Germany","text":"The federal agency responsible for implementing a military draft, should the need arise, reposted a vulgar tweet Wednesday suggesting that the US is on a course reminiscent of Nazi Germany. \n\n“For all you stupid f—s out there that still believe military service will be voluntary. Remember Germany 1936,” read an X post shared by the Selective Service System. \n\nThe tweet was initially posted by an X user going by “SloJoe,” whose profile picture includes a photo of the late general and secretary of state Colin Powell. \n\nThe post appears to be referring to Adolof Hitler’s decision to reintroduce military conscription in Nazi Germany, in violation of the Treaty of Versailles, prior to his occupation of the Rhineland in 1936. \n\nDemocrats, including Vice President Kamala Harris and Minnesota Gov. Tim Walz, boosted comparisons of President-elect Donald Trump and Hitler in the final weeks of the 2024 presidential campaign. \n\nThe Selective Service System did not respond to The Post’s request for comment. \n\nThe reposted tweet remained on the SSS’s X account for over an hour, even after it was flagged by a CBS News reporter and other users on the social media platform. \n\n“What’s going on with the @SSS_gov (Selective Service) X account?” reporter Jim LaPorta wrote on X. \n\n“Why is the official selective service account retweeting this???” another puzzled X user tweeted.\n\nUS law requires nearly all men between the ages of 18 and 25 to register with the Selective Service System, which maintains the nation’s draft databases.\n\nIn June, Trump dismissed the notion that he would push for mandatory military service in a second White House term. \n\nTrump, 78, called the idea of compulsory military service a “ridiculous idea” in response to a Washington Post report that some former administration officials and Republican lawmakers see a national service mandate as a “remedy” to a decline in military recruiting numbers. \n\n“The Story is completely untrue. In fact, I never even thought of that idea,” Trump wrote on Truth Social.","summary":"“For all you stupid f—s out there that still believe military service will be voluntary. Remember Germany 1936,” read an X post shared by the Selective Service System. ","url":"https://nypost.com/2024/11/06/us-news/fed-agency-responsible-for-the-draft-reposts-vulgar-tweet-suggesting-us-is-becoming-nazi-germany/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/x-com-sss-gov-93175937.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/VymoAejj-RyIcpnTz.mp4","publish_date":"2024-11-07 01:01:42","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.33},{"id":263202028,"title":"Report: Special counsel, Justice Department in talks to wind down Trump prosecutions","text":"Nov. 6 (UPI) -- Special counsel Jack Smith is working with the Justice Department to wind down two federal cases against President-elect Donald Trump before he takes office in January, according to sources familiar with the deliberations.\n\nSmith, who moved forward with his federal election interference case against Trump just weeks before the election, and DOJ officials have determined that there can be no trials after Trump's resounding presidential win, two people familiar with the talks told CNN, NBC and NPR on Wednesday.\n\nThe Justice Department has a longstanding policy against prosecuting a sitting president, which means the cases -- including allegations of mishandled documents from the former president's first term -- are likely to end before Trump's inauguration.\n\nLast month, Smith's 165-page election interference filing was unsealed to reveal his case against Trump. The former Republican nominee blasted the timing, calling the unsealing \"election interference\" five weeks before the election.\n\n\"Democrats are weaponizing the Justice Department against me because they know I am winning, and they are desperate to prop up their failing candidate, Kamala Harris,\" Trump wrote last month in a post on Truth Social, where he called it a \"hit job.\"\n\nDuring his campaign, Trump repeatedly vowed to fire Smith \"within two seconds\" after taking office. On Wednesday, his legal team was considering its own next steps.\n\n\"The American people have re-elected President Trump with an overwhelming mandate to Make America Great Again,\" Trump campaign spokesman Steven Cheung said in a statement.\n\n\"It is now abundantly clear that Americans want an immediate end to the weaponization of our justice system, so we can, as President Trump said in his historic speech last night, unify our country and work together for the betterment of our nation,\" Cheung added.\n\nWhile the two federal cases are likely to be dismissed, Trump still faces a sentencing hearing scheduled for Nov. 26, in his New York felony conviction. Trump pleaded not guilty to 34 counts of falsifying business records to cover up a hush money payment during his 2016 campaign.\n\nNew York Judge Juan Merchan could still scrap the conviction before sentencing, after the U.S. Supreme Court ruled this summer that presidents are granted some presidential immunity.\n\nTrump's Georgia election interference case is currently tied up with appeals over possible conflicts of interest involving District Attorney Fani Willis.","summary":"Special counsel Jack Smith is working with the Justice Department to wind down two federal cases against President-elect Donald Trump before he takes office in January, according to sources familiar with the talks.","url":"https://www.upi.com/Top_News/US/2024/11/06/justice-department-special-counsel-Trump-prosecutions/6631730939170/","image":"https://cdnph.upi.com/ph/st/th/6631730939170/2024/upi/8fb32610caad0d5dcd4b6b60c5192ee8/v1.2/Report-Special-counsel-Justice-Department-in-talks-to-wind-down-Trump-prosecutions.jpg","video":null,"publish_date":"2024-11-07 01:00:35","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.121},{"id":263201630,"title":"Trump remade the GOP in his own image — to reject Obama’s overhauled Democrats","text":"Donald Trump has made history: Not only by returning to the White House four years after his expulsion from it, but also by founding a new American political party in his own image. \n\nHe’s consolidated a new coalition under an old name, a rare feat we’ve seen before in America’s past, most recently achieved by Trump’s former predecessor.\n\nToday and perhaps for decades to come, the Republican Party is the Trump Party while the Democratic Party is the Barack Obama Party.\n\nFollowing two transitional presidents, Jimmy Carter and Bill Clinton, Obama presided over the assembly of what was in reality a new party under the Democratic Party’s banner. \n\nTo the older Democratic constituencies of organized labor and African Americans, Obama and his allies welded former moderate Republicans whose great causes were Planned Parenthood and environmentalism. \n\nFinancial backing came from Hollywood, long affiliated with Democrats, and from Silicon Valley and Wall Street libertarians who combined liberalism on social issues with free-market conservative economics. \n\nIn the new Obama party, the hierarchical organizations of the past, with their bosses and patronage employees, were eclipsed by new urban machines based on nonprofits, many funded by city, state or federal funds. \n\nThose ideologues — including environmentalists and race- and gender-studies departments on university campuses — devised the party line, expecting voters to support the Democrats on the basis of their race and gender. \n\nIn return, members of these abstract categories were promised targeted and different benefits. \n\nThe Obama Party that took shape in the 2010s has achieved a near-monopoly of political power in its homelands — big cities and college towns. In 2024, nine of the 10 most populous American cities had Democratic mayors; in 2000, four of those same had Republican mayors.\n\nEven in red states like Texas, big cities and university towns today are usually blue.\n\nBut this new Democratic coalition has struggled to extend its control to national politics, as well as to governors’ mansions and state legislatures in states like Florida and Texas. \n\nDuring Obama’s first term, the Republicans regained control of the House, which they had lost in 2006. Obama’s Democrats suffered the highest losses in a midterm election since 1938. A “red wave” election inflicted further damage on them in 2014.\n\nBut worse was to come. In 2011, at the annual White House correspondents’ dinner, Obama mocked Donald Trump, who was sitting in the audience.\n\nTrump had his revenge in 2016, when he shocked Democrats, and many Republicans, by winning first the GOP presidential nomination and then the presidency. \n\nDefeated in 2020 after serving one term, Trump was disgraced in the eyes of many by discredited claims about electoral cheating and subjected to “lawfare.” Yet he survived and won the presidency a second time in 2024 — this time as the undisputed leader of a new Republican Party.\n\nThe Reagan Republican coalition devoted to free trade, mass legal immigration, “wars of choice” and entitlement cuts and hostile to organized labor, is no more. \n\nIn its place, Trump and his allies have formed a new coalition based on strategic trade, limited immigration, skepticism about foreign military quagmires, defense of entitlements and outreach to labor union members. \n\nTo the old GOP constituencies of small-business owners and evangelicals, the Trump movement has added former Democrats — working-class whites and a growing number of black and Latino voters — while losing most college-educated Americans to the rival Obama party. \n\nThe public personas of their leaders reflect the parties’ constituencies. Obama, leading a party of college-credentialed professionals and technocratic experts, exudes the kind of soft-spoken rationality favored in academic seminars and corporate suites. \n\nTrump, a veteran of reality television, a serial brander of commercial products and a fan of TV wrestling, is as raucous and hyperbolic as Obama is cool and deliberate. \n\nAn Obama speech is an NPR-approved author’s talk at a metropolitan bookstore. A Trump speech is half-time entertainment at a demolition derby.\n\nThe victory of the Trump party at the federal level does not mean the disappearance of the Obama party. \n\nObama’s new Democratic coalition will continue to control its big-city and college-town strongholds, biding its time until it can regain power in Washington. \n\nFor its part, the new Trump coalition may squabble: Its diverse constituents, from Bitcoin-bedazzled libertarians to anti-woke trade unionists, may share little other than their rejection of Obama’s Democrats. \n\nOne thing seems certain: The grudge match between Obama and Trump that flared at that 2011 dinner, and has been institutionalized in the national parties they remade, will likely continue for years to come.\n\nMichael Lind is the author of “Hell to Pay: How the Suppression of Wages is Destroying America.”","summary":"Donald Trump has consolidated a new coalition under an old name, a rare feat we’ve seen before in America’s past — most recently achieved by Barack Obama.","url":"https://nypost.com/2024/11/06/opinion/trump-has-remade-the-gop-to-reject-obamas-democrats/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/newspress-collage-p15775rf9-1730940074102.jpg?quality=75&strip=all&1730922168&w=1200","video":"https://cdn.jwplayer.com/videos/bJ4y4qfh-RyIcpnTz.mp4","publish_date":"2024-11-07 01:00:23","author":"Michael Lind","authors":["Michael Lind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.197},{"id":263202168,"title":"RFK Jr. wants to clear out 'entire departments' in the FDA: 'They have to go'","text":"Robert F. Kennedy Jr. suggested the second Trump administration could eliminate entire departments within the Food and Drug Administration (FDA) for \"corruption.\" The former independent presidential candidate spoke to MSNBC Wednesday about President-elect Donald Trump's 2024 election victory. Kennedy, who has been a key figure in the Trump campaign since endorsing him, was asked about his potential role in the next White House and whether he would begin \"clearing out the top level federal service workers that are currently at the FDA and the CDC.\" \"In some categories, I would say,\" Kennedy answered. LIBERAL MEDIA OUTLETS MELT DOWN OVER RFK JR. ENDORSING TRUMP: ‘BETRAYS THE KENNEDY LEGACY’ He continued, \"In some categories, their entire departments, like the nutrition department in the FDA, they have to go. They’re not doing their job. They’re not protecting our kids. Why do we have Froot Loops in this country that have 18 or 19 ingredients, and you go to Canada, and it’s got two or three?\" As for whether he would eliminate entire agencies like the FDA, Kennedy was less committed. \"To eliminate the agencies, as long as it requires congressional approval, I wouldn’t be doing that,\" Kennedy said. He followed up, \"But I can get the corruption out of the agencies. This is what I’ve been doing for 40 years. I’ve sued all those agencies. I have a Ph.D. in corporate corruption and that’s what I do. Once they’re not corrupt, once Americans are getting good science and are allowed to make their own choices, they’re going to get a lot healthier.\" Kennedy posted the interview from his X account and reiterated his efforts to \"clean up the corruption\" in agencies like the FDA. \"President Trump has asked me to do three things: 1. Clean up the corruption in our government health agencies. 2. Return those agencies to their rich tradition of gold-standard, evidence-based science. 3. Make America Healthy Again by ending the chronic disease epidemic,\" Kennedy wrote. Kennedy previously ran as an independent candidate before ultimately suspending his campaign in August to endorse Trump. Since then, he has campaigned on behalf of Trump and has hinted about a potential role in the White House. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE A few days before the election, he suggested Trump would work to remove fluoride from drinking water. \"On January 20, the Trump White House will advise all U.S. water systems to remove fluoride from public water,\" Kennedy posted on X. \"Fluoride is an industrial waste associated with arthritis, bone fractures, bone cancer, IQ loss, neurodevelopmental disorders, and thyroid disease,\" he claimed, adding that former President Trump and first lady Melania Trump \"want to Make America Healthy Again.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Former presidential candidate Robert F. Kennedy Jr. discussed his hopes for reforming the FDA in a second Trump administration following the 2024 election.","url":"https://www.foxnews.com/media/rfk-jr-wants-clear-out-entire-departments-fda-they-have-go","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/rfk-and-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-07 01:00:17","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":-0.169},{"id":263201866,"title":"US Deserves A \"Badass Commander-In-Chief\": Vivek Ramaswamy On Trump's Win","text":"Of the view that the comeback of president-elect Donald Trump is the American comeback, entrepreneur-turned-politician Vivek Ramaswamy on Wednesday said that the country deserves a \"badass commander-in-chief\" right now and that's exactly what it got.\n\nTrump, 78, not only won the November 5 presidential elections in both popular votes and electoral college votes but also got the Republican Party control of the House of Representatives and the Senate.\n\n\"Here's the reason why Donald Trump won by the largest margin of any president in modern history. He's not an ideologue. He's not a policy wonk. He's an American badass. They tried to DQ him, jail him, kill him (twice). None of it worked. Our self-appointed 'betters' in the media misunderstood him, underestimated him, doubted him,\" Ramaswamy said on Wednesday.\n\n\"But not once during this campaign did Trump misunderstand, underestimate, or doubt himself. As everyone at Mar-a-Lago celebrated around him last night, I watched him unfazed, with full conviction that he was exactly where he was destined to be,\" he said.\n\n\"He's just like our nation in that way. We've always believed it was our manifest destiny to be exceptional, to be the greatest nation on Earth, to show the world what's possible for humanity to achieve, even when other countries doubted us. Some still do today,\" Ramaswamy said.\n\n\"But they're wrong. Trump's comeback is the American comeback. Our nation deserves a badass commander-in-chief right now and that's exactly what we got. Funny how well our democracy actually works,\" said the former Republican presidential aspirant.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Of the view that the comeback of president-elect Donald Trump is the American comeback, entrepreneur-turned-politician Vivek Ramaswamy on Wednesday said that the country deserves a &quot;badass commander-in-chief&quot; right now and that&apos;s exactly what it got.","url":"https://nation.lk/online/us-deserves-a-badass-commander-in-chief-vivek-ramaswamy-on-trump-s-win-282401.html","image":"https://c.ndtvimg.com/2023-12/fiva7t7_vivek-ramaswamy-_625x300_07_December_23.jpeg","video":null,"publish_date":"2024-11-07 01:00:15","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":-0.113},{"id":263202054,"title":"Semiconductor firms ASML, AMD, Qualcomm reaffirm China commitment at CIIE trade fair","text":"International semiconductor firms – including ASML, Advanced Micro Devices (AMD) and Qualcomm – have put the spotlight on some of their latest products at a major trade fair in Shanghai this week, in a fresh sign of their commitment to China in spite of mounting US sanctions on the country.\nThey joined about 400 other companies at the Intelligent Industry & Information Technology exhibition, as part of this year’s China International Import Expo (CIIE) event. The six-day trade show will conclude on Sunday.\nTaking part in the CIIE reflects how these foreign semiconductor technology vendors see the world’s second-largest economy as a vast market for their products and services, according to participants, despite tensions between Washington and Beijing.\n“This marks our sixth participation in CIIE,” ASML executive vice-president Shen Bo, who serves as the Dutch chipmaking equipment vendor’s country manager for China, said on Monday. “This annual event continuously demonstrates China’s commitment to openness and collaboration, aligning perfectly with ASML’s corporate culture.”\n\nASML, which dominates the global market for advanced lithography systems used to make chips, did not display any of its large machines at the exhibition area. But that did not prevent a large number of people to crowd its booth on Wednesday.\nThe Dutch firm, instead, provided various product information for its lithography solutions, including three deep ultraviolet systems – the NXT:1470, NXT:870 and XT:260. The NXT:1470 was highlighted as ASML’s first “dry NXT system”, capable of producing more than 300 wafers per hour.\nMeanwhile, AMD – Nvidia’s rival in the global market for graphics processing units used in video gaming and artificial intelligence (AI) development projects – is taking part in the CIIE trade show for the fourth time. The US company exhibited various AI infrastructure products and solutions, while Nvidia skipped the event.\n“CIIE provides a high-level international platform for us to showcase our broad range of end-to-end AI solutions and applications with our ecosystem partners,” said AMD senior vice-president Spencer Pan, who serves as the firm’s president for Greater China. “Through expanded cooperation with Chinese partners, we are accelerating digital transformation and industrial upgrade [on the mainland].”\n\nSan Diego, California-based chip designer Qualcomm featured its recently launched SnapDragon8 Elite mobile platform at the CIIE. This chip, which support generative AI applications, has been installed in various Chinese Android smartphone models, including the Xiaomi 15, Honor’s Magic 7 and Vivo’s iQOO.\nNew US sanctions, however, could make it difficult for more major foreign tech companies to take part in the CIIE. From January 2, the US will ban outbound investments in China’s semiconductors, quantum computing and AI sectors if they are deemed a threat to American national security, according to a US Treasury announcement last month.\nWhen asked about the potential impact of Donald Trump’s triumph in the US presidential election, several employees at the semiconductor booths in the CIIE exhibition area said it remains to be seen what measures he will pursue. But they expressed hope that trade sanctions on China could be relaxed, allowing for the sustainable development of the country’s semiconductor industry.","summary":"They joined about 400 other firms at the Intelligent Industry & Information Technology exhibition, part of the 2024 CIIE trade fair in Shanghai.","url":"https://www.scmp.com/tech/tech-war/article/3285473/semiconductor-firms-asml-amd-qualcomm-reaffirm-china-commitment-ciie-trade-fair","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/06/b5fb511a-8302-4527-ad15-5a5f4f1cb2b6_c9cd6abc.jpg","video":null,"publish_date":"2024-11-07 01:00:11","author":"Ann Cao","authors":["Ann Cao"],"language":"en","source_country":"cn","sentiment":0.153},{"id":263201870,"title":"How Trump’s victory could hit home in Berkeley","text":"As they digested the news of former President Donald Trump’s election victory, Berkeley leaders expressed concerns on how voters’ decision to restore Trump to power could impact the city through mass deportation of immigrants, rolling back environmental protections, attacks on transgender students and emboldening white supremacists.\n\n“I believe there will be an unprecedented, broad and coordinated attack on our democracy and the rule of law, and on all the progress we’ve worked so hard to achieve,” councilmember Sophie Hahn, who’s leading the race to become Berkeley’s next mayor, wrote in a letter to the community Wednesday. “But this reality does not break my resolve to stand up and fight back.” \n\nImmigration\n\nWhen he was elected in 2016, one of Trump’s first acts was to initiate a ban against travelers from seven largely Muslim countries; he briefly succeeded in ending a program protecting young immigrants from being deported — an act that threatened the future of undocumented UC Berkeley students.\n\nDuring his first term in office, Trump promised to punish sanctuary cities like Berkeley that refuse to comply with immigration law. Berkeley could have lost up to $11.5 million in federal funds if he went through with his promise.\n\n“We are still committed to being a sanctuary city, and during our transition out of office, we will be sure to relay that to the new administration,” said Stefan Elgstrand, assistant to Mayor Jesse Arreguín. “We are confident that whoever the new mayor is would want to continue that policy.”\n\nTrump’s 2024 campaign emphasized mass deportations and ending protections for undocumented immigrants brought to the U.S. as children. \n\nDepending on their residency status — and if Trump also revives his push to limit legal immigration, including by refugees, foreign workers and international students — this could impact the 25,800 Berkeley residents who were born outside the United States, according to Data USA.\n\n“We have to protect first and foremost the immigrants,” longtime East Bay civil rights lawyer Osha Neumann told Berkeleyside Wednesday.\n\nThe California Immigrant Policy Center, an immigrant rights advocacy group, has already led 15 scenario-planning exercises with hundreds of people from organizations across the state to prepare. Masih Fouladi, executive director of the group, said under Trump, immigrant rights groups would lobby to make sure state and local resources are not used to detain and deport people and that non-citizen residents continue to have access to health care and other public services, which the state has significantly expanded over the past decade.\n\nCourtney McCausland, co-director of the immigration unit of the East Bay Community Law Center in Berkeley, said the center will be “doubling down on our commitment to robust and zealous representation of our clients in exercising their right to obtain the benefits and protections to which they are legally entitled.”\n\nAlso, the center is working “to train the next generation of lawyers to be vigilant against manipulations of the systems of the rule of law in the United States, and to recognize the limits of that system as it exists,” McCausland said.\n\nWhite supremacists\n\nNeumann said that to far-right groups like the Proud Boys, Berkeley symbolizes everything they oppose. \n\nIn 2017, the year Trump took office, white supremacists staged a rally supporting him in Civic Center Park. When leftist counter-protesters showed up to express their contempt for the president and his supporters, they were attacked by members of the Southern California-based Rise Above Movement. RAM members banded together and stomped, kicked and beat up people they identified as opponents, according to a ProPublica investigation. More than 20 people were arrested, both those on the far right as well as multiple far-left counter-protesters.\n\nTwo months earlier, just hours before right-wing provocateur Milo Yiannopoulos was to speak at UC Berkeley, a band of black-masked Antifa protesters swept into Sproul Plaza. Over the next few hours, they threw metal barricades, smashed windows, lit a generator on fire, and directed pepper spray at attendees who spoke in favor of the newly inaugurated President Donald Trump. The violence led Cal to cancel the speech.\n\nIn response, Trump threatened on social media to stop federally funding UC Berkeley. \n\nNeumann worried that in a second term, white supremacists will be further empowered and Berkeley “will be seen as the home base for all of the targets of the new Trump regime.”\n\n“We have history when Berkeley has been invaded by Proud Boys and fascists — they claimed free speech and set up in the Civic Center Park and hit people,” he said. “We are going to have to depend on our own solidarity and come together to provide what the government is no longer providing.” \n\nTrump, whose position on education has focused more on cultural ideology than on policies to improve education, has threatened to cut school funding to states, such as California, that protect transgender students and promote diversity, equity and inclusion programs in their schools. \n\nBruce Fuller, professor of education and public policy at UC Berkeley, worries that Trump will give tax cuts to the rich paid for by budget cuts in public education. “The president-elect’s commitment to cutting taxes for affluent Americans means there will be no new funding for public schools,” Fuller said. “Watch out for efforts to expand vouchers and tax credits for well-off parents who opt for private schools.”\n\nA Trump presidency also could have a big impact on how educators teach and on whether they choose to stay in the profession. Trump has claimed teachers have been indoctrinating children with anti-American ideologies. His solution: Create a new credentialing agency to certify teachers “who embrace patriotic values and understand that their job is not to indoctrinate children, but to educate them.” \n\nHe also wants to abolish teacher tenure and give preference in federal funding to states and school districts that support his efforts to do so. \n\nWith an estimated 1 in 10 California children having an undocumented immigrant parent, Trump’s planned deportations would impact many Berkeley families and their children.\n\nScott Moore, head of Kidango, a nonprofit that runs many Bay Area child care centers, fears that many of the families he works with will be terrified.\n\n“What is sad is that today, children will come to Kidango, and some of them will be crying and scared that their parents or a close relative will be taken away from them,” Moore said. “This is what happened in 2016.”\n\nEnvironment\n\nDuring Trump’s four years in office, his administration officially rolled back nearly 100 environmental rules. The Trump administration dismantled major climate policies and rolled back many more rules governing clean air, water, wildlife and toxic chemicals.\n\n“While I wish the next administration would let states like California continue their climate leadership, past experience has shown that it prefers to go to war against our state on this and other issues that are important to working families,” City Councilmember Igor Tregub said in a text.\n\n“I am grateful to our state leaders who are preparing plans to resist, fight, and win to retain our strong clean air, clean water and other climate justice protections. I stand ready to lock arms with our community, which determined a long time ago that we’re not going back,” Tregub said.\n\nAnother key issue arose when Berkeley adopted a landmark ban on natural gas in new homes and buildings in 2019, a move that started a climate change-driven effort in dozens of other cities and counties. \n\nThough the ban was touted as a way to reduce greenhouse gas emissions and improve indoor air quality, Trump criticized the ban. Eventually, the ban was struck down in court. \n\nIf a bill already passed by the Republican-controlled U.S. House amid the gas stove culture war were to become law, it could become even more difficult to regulate gas stoves. \n\nA note of hope\n\nLike Neumann and Hahn, Berkeley Mayor Jesse Arreguín said he was hopeful that local leaders can overcome challenges.\n\n“As we await more election results, I recognize the fear and anger many people are feeling about the future of our country. California has shown that regardless of what happens on a federal level, we can be the leaders that this country and the world look up to,” Arreguin said in an emailed statement. “We can and must be trailblazers in advancing our democratic and progressive values, helping lift up people and focusing on what unites us.” \n\nAdena Ishii, who is running second in the still-tight race for Berkeley mayor, quoted Kamala Harris’ concession speech on social media Wednesday: “This is not a time to throw up our hands. This is a time to roll up our sleeves!”\n\nAcross state government, officials have been gaming out a response to “Trump-proof” California. Gov. Gavin Newsom and his budget team are developing a proposal for a disaster relief fund after the former president repeatedly threatened to withhold emergency aid for wildfire recovery from California because of its water policy.\n\n“The best way to protect California, its values, the rights of our people, is to be prepared, so we won’t be flat-footed,” said Attorney General Rob Bonta, whose team has been working with advocacy organizations and attorneys general in other states on how they would answer another Trump administration. “We will fight as we did in the past if that scenario unfolds.”\n\nDuring Trump’s first term, California sued more than 100 times over his rules and regulatory rollbacks. Bonta said his team has preemptively written briefs and tested arguments to challenge many of the policies they expect the former president to pursue over the next four years: passing a national abortion ban and restricting access to abortion medication; revoking California’s waiver to regulate its own automobile tailpipe emissions and overruling its commitment to transition to zero-emission vehicles; ending protections for immigrants brought to the country illegally as children; undermining the state’s extensive gun control laws, including for assault weapons, 3D-printed firearms and ghost guns; implementing voter identification requirements; and attacking civil rights for transgender youth.\n\n“Unfortunately, it’s a long list,” Bonta said shortly before the election. “We are and have been for months developing strategies for all of those things.”\n\nCalMatters and EdSource contributed reporting to this story.","summary":"Undocumented residents could be deported. Transgender students could lose protections. And white supremacists could again be emboldened to descend on the city like in 2017.","url":"https://nation.lk/online/how-trump-s-victory-could-hit-home-in-berkeley-282399.html","image":"https://newspack-berkeleyside-cityside.s3.amazonaws.com/wp-content/uploads/2017/02/32661125715_426846e267_b.jpg","video":null,"publish_date":"2024-11-07 01:00:04","author":"Proud Boys","authors":["Proud Boys"],"language":"en","category":"politics","source_country":"lk","sentiment":-0.061},{"id":263202074,"title":"Why Donald Trump had a chuckle about Aston Villa's Doug Ellis","text":"With Donald Trump once again named as President Of The United States, you can perhaps forgive the Republican for forgetting all about the Rumbelows League Cup in 1992.\n\nThe incumbent US president was still in his 40s - minus the tan and bleached hair - when he was invited to do the cup draw alongside Ian St John and Jimmy Greaves, better known as Saint and Greavsie.\n\nThe pair shot to fame in the late 80s for their comedy-led football punditry shows on ITV between 1985 and 1992. Prior to their TV show ending, though, the duo managed to pull off a bit of a coup by getting Trump to do the League Cup quarter-final draw live from his Trump Towers boardroom.\n\nThen-Football League secretary David Dent oversaw the draw with Greaves picking the home teams and Trump picking the away sides.\n\n\"I told you, didn't I,\" Greaves said with a smile during the clip that emerged overnight, making reference at landing Trump to conduct the draw.\n\nThe camera then panned to Trump smiling awkwardly after before Greaves shook hands and complimented Trump's office, while adding how it reminded him of a certain Doug Ellis's back at Villa Park.\n\n\"This is some pad you've got here, isn't it,\" the brilliant Greaves said with a smile. \"I tell you this is beautiful. I haven't seen a boardroom like this since I was in Doug Ellis's at Aston Villa.\"\n\nThat very Villa comment made Trump cackle with real amusement, almost as if he'd previously sat in Ellis's office in B6 himself.\n\nSo, as Greavsie used to say, it's a funny old game.","summary":"With the US election concluded and Donald Trump back at the White House we take a look back at a funny moment involving Donald Trump and a comment made on live TV about former Villa chairman Doug Ellis","url":"https://www.birminghammail.co.uk/sport/football/football-news/donald-trump-us-election-villa-19225709","image":"https://i2-prod.birminghammail.co.uk/incoming/article19225764.ece/ALTERNATES/s1200/0_Untitled-design-5.jpg","video":null,"publish_date":"2024-11-07 01:00:00","author":"Steve Wollaston","authors":["Steve Wollaston"],"language":"en","category":"politics","source_country":"gb","sentiment":0.076},{"id":263201498,"title":"Tiny town reveals why Harris lost it all","text":"It was 1892 and the small Texas community put their support behind incumbent Benjamin Harris, who ultimately lost to Democratic candidate Grover Cleveland.\n\nInterestingly, Mr Cleveland was the first former president to be returned to office after a defeat – an electoral feat pulled off yesterday by Donald Trump.\n\nHistory repeated in more ways than one in Starr Country, sitting on the Rio Grande river at the border with Mexico, with voters breaking a near 130-year winning streak for the Democrats – the longest anywhere in the United States.\n\nWith counting virtually completed, Mr Trump received almost 58 per cent of the vote, dwarfing Kamala Harris’ 41.8 per cent.\n\nIn any other election year, the happenings in a small community of 65,900 people might not register much attention, but the historic flip is part of a surprising demographic shift.\n\nHispanic people comprise a whopping 57 per cent of eligible voters in Starr County. According to the last US Census, 98 per cent of locals are either Hispanic or Latino.\n\nBack in 2016 when Mr Trump faced off against Hillary Clinton, she took Starr County with a mammoth 79 per cent of the vote.\n\nHispanic and Latino voters are traditionally seen as being far more likely to support a Democrat than a Republican, but political pundits are now wondering if those days are over.\n\nAs The Economist bluntly put it: “Democrats can no longer rely on the Hispanic vote.”\n\n“In 2016, Hillary Clinton won Hispanic voters by a margin of 38 percentage points, according to exit polls,” its post-election analysis pointed out. “By 2020, Joe Biden’s margin had shrunk to 33 points.\n\n“This year, early exit polling conducted by CNN suggests that Ms Harris’s margin of victory among Hispanic voters is just eight percentage points – a remarkable collapse, if right.”\n\nSimilarly, a Fox News exit poll indicated Mr Trump saw significant improvements in voter support among Latino voters since 2020 – up eight per cent among men and six per cent among women.\n\nIn analysis in the New York Post, the incoming president’s stance on border security and illegal immigration were credited with the lift. \n\nStarr Country is far from the only shock result, with a number of typically strong Democratic heartlands deserting Ms Harris at the end of the day.\n\nMiami-Dade in Florida has long been staunchly blue, with voters there not backing a Republican candidate for president since the late 1980s.\n\nBut Mr Trump romped home with a stunning margin of 11 per cent, winning 55 per cent of the vote compared to Ms Harris’ 44 per cent.\n\nEven New York City shifted to the right this election.\n\nWhile Ms Harris took the Big Apple with a margin of 37 points, the result was much smaller than that of Joe Biden in 2020, who won by 54 points.\n\nEven Hillary Clinton in 2016 swamped famed New Yorker Donald Trump by some 63 points.\n\nNew York remains “a deep blue city”, John Liu, a Democratic state senator representing Queens, told The New York Times.\n\nBut the party needs to seriously acknowledge the significance of the shift, Mr Liu told the newspaper.\n\n“The mood changed.”\n\nHispanic and Latino voters comprise about 12 per cent of the total American electorate and 45 per cent voted Republican, exit polls indicate.\n\nDown gender lines, male Latino voters backed Republicans more strongly at 54 per cent, which Forbes analyst Corein Carter said reflected “a growing trend of conservative support”\n\n“According to various sources, it’s clear why some Latino men supported Trump in the 2024 election,” Carter wrote. \n\n“For many, the economic promises he makes as a businessman speak to their goals for stability and growth. His tough stance on immigration also appeals to those who see stricter policies as a way to ensure fairness. \n\n“Beyond that, some Latino men connect with Trump’s values on masculinity and tradition. For those feeling overlooked by Democratic policies, Trump’s platform seems like the alternative they’re looking for.”\n\nElsewhere, Democrats will be spend coming weeks and months reflecting on other shock losses in normally supportive parts of the country.\n\nTake the Midwestern state of Minnesota, where the blue collar Carlton County backed Mr Trump, who won with a margin of three points.\n\nThat marks the first Republican victory there since 1928.\n\nIn Berlin, New Hampshire, 52.8 per cent of voters put their support behind Mr Biden in 2020, compared to Mr Trump’s result of 45.6 per cent.\n\nThis time around, Mr Trump scored 52 per cent while 48 per cent voted for Ms Harris.\n\nIn analysis for The Conversation, anthropologist Professor Alex Hinton from Rutgers University said many on the left “fail to understand who Trump voters are and how they vary”.\n\n“Trump’s base cannot simply be dismissed as racist ‘deplorables’, as Hillary Clinton famously said in 2016, or as country bumpkins in red MAGA hats,” Professor Hinton wrote. \n\n“Trump voters trend older, white, rural, religious and less educated. But they include other groups, including Latinos and male voters.\n\n“Many people have thoughtful reasons for voting for Trump, even if their reasoning – as is also true for those on the left – is often inflamed by populist polarisers and media platforms.”","summary":"The vote in this small town reveals the shocking extent of Kamala Harris’ loss against Donald Trump – and it could change US politics forever.","url":"https://www.news.com.au/world/north-america/us-politics/tiny-town-sums-up-exactly-why-donald-trump-won-the-2024-us-presidential-election/news-story/d24c8305741096bb53b7a1eb5a6c85da?from=rss-basic","image":"https://content.api.news/v3/images/bin/56cdda496a054fe3dbb38e8834b8680b","video":null,"publish_date":"2024-11-07 00:59:43","author":"Shannon Molloy","authors":["Shannon Molloy"],"language":"en","source_country":"au","sentiment":-0.387},{"id":263202026,"title":"Agents in Philadelphia stop hundreds of pounds of marijuana on way to Britain","text":"Nov. 6 (UPI) -- A U.S. Customs and Border Protection official in Philadelphia says an \"unprecedented\" amount of marijuana was recently found in a warehouse outside the city and was destined for Europe.\n\nOn Wednesday, CBP said officers on Monday seized a combined total of 170 pounds of marijuana in 35 total parcels at an international shipping facility at a Delaware County warehouse in southeast Pennsylvania.\n\nAlthough medical and recreational use of marijuana is being decriminalized in some states, marijuana possession and bulk smuggling \"remain illegal under federal law, and so Customs and Border Protection officers will continue to seize it when we encounter it,\" Cleatus Hunt, CBP's Philadelphia area port director, said Wednesday.\n\nAccording to the federal government, the payload was getting shipped from California to Britain and had a street value of roughly $800,000.\n\n\"Depending on potency, this haul could fetch two to three times more in London,\" the border protection agency claimed.\n\nEarlier this year, the Biden DEA moved to ease restrictions on marijuana in order to reclassify it from a Schedule 1 to a low-risk substance by striking to remove its association with deadly drugs such as heroin and LSD in a \"historic\" move.\n\nHowever, under now President-elect Donald Trump, if that intended reclassification of cannabis will happen remains to be seen.\n\nMeanwhile, CBP officers and agents seized last year an average of 2,339 pounds of illicit drugs at air, sea and land ports of entry.\n\nAnd about two weeks ago, Philadelphia CBP officers had discovered 114 pounds of marijuana concealed inside the luggage of two women attempting to board a flight to London.\n\nBut Hunt says this new discovery was \"an unprecedented\" number of cannabis parcels the Philadelphia Port had seen, adding \"they are also parcels that London consumers won't see.\"\n\nThe border agency says CBP officers \"usually see\" marijuana getting exported in smaller parcels as in this latest seizure, but occasionally officers \"encounter travelers carrying marijuana-stuffed suitcases.\"\n\nBut despite federal law forbidding the transport of marijuana across state lines or exporting it from the country, CBP added it has been seeing a continued \"trend\" of U.S.-based growers, retailers and \"criminal organizations\" that have been shipping or transporting the plant to Europe and Africa where, according to the agency, \"high-quality weed can fetch prices many times higher than in the U.S.\"","summary":"A U.S. Customs and Border Protection official in Philadelphia says an \"unprecedented\" amount of marijuana was recently found in a warehouse outside the city and was destined for Europe.","url":"https://www.upi.com/Top_News/US/2024/11/06/Philadelphia-Customs-Border-Protecton-marijuana-cannabis-DEA/3431730931105/","image":"https://cdnph.upi.com/ph/st/th/3431730931105/2024/upi/4f1444755930dd774c673b229ac6bde2/v1.2/Agents-in-Philadelphia-stop-hundreds-of-pounds-of-marijuana-on-way-to-Britain.jpg","video":null,"publish_date":"2024-11-07 00:59:10","author":"Chris Benson","authors":["Chris Benson"],"language":"en","category":"politics","source_country":"us","sentiment":0.017},{"id":263202156,"title":"‘Una combinación de serenidad y terror’: el condado de San Diego votó así en el último día de una tumultuosa elección presidencial","text":"Miles de votantes del condado de San Diego se enfrentaron a largas filas para emitir sus votos para presidente, Senado y una serie de elecciones locales el martes, último día de una elección turbulenta en la que muchos describieron su participación como un deber. Y miles que ya habían votado esperaban nerviosos el resultado.\n\nMike Waters, residente de Pacific Highlands, dijo al Union-Tribune que sentía “una combinación de serenidad y terror” en el Día de las Elecciones. Dijo que la serenidad provenía de saber que, gane quien gane la presidencia, aún hay trabajo por hacer.\n\nEn los dos puertos peatonales de entrada en San Ysidro, entre los miles que transitan diarios en la frontera, había algunos ciudadanos estadounidenses haciendo fila para cruzar y votar.\n\nCristina Ríos, residente de Chula Vista, de 60 años, pasa medio semana en Tijuana para cuidar a su padre. Este martes, cruzó la frontera de regreso a casa solo para votar por la vicepresidenta Kamala Harris, “porque una mujer tiene que ser presidenta”, dijo.\n\n“Creo que tiene buenos principios, buenas cualidades”, dijo Ríos, una republicana registrada que ha votado por los demócratas en las tres últimas elecciones presidenciales. “Voy con lo que siento que es correcto para mí y mis creencias”, añadió antes de cruzar por PedWest.\n\nMatilde Levy, de 57 años, trató de cruzar con su esposo en coche o a pie, pero cuando vio la larga fila, optó por un servicio de autobús de $10 para cruzar más rápido.\n\n“No creo que el país esté yendo bien en este momento, y creo que es importante tener voz”, dijo afuera del cruce de PedEast. Dijo que votaba por el expresidente Donald Trump.\n\n“No todos nosotros, los latinos o inmigrantes, estamos en contra de Donald Trump”, dijo. Republicana, comentó que ella y su esposo se mudaron a México después de 25 años en el condado de San Diego debido a la economía. “Es más barato allí”, dijo.\n\nAdemás de la carrera más importante, los votantes locales también decidirán el destino de 10 medidas estatales, un aumento del medio centavo en el impuesto a las ventas para el transporte a nivel condal, y una serie de carreras legislativas y medidas locales, dependiendo de dónde vivan.\n\nEl martes por la mañana, Jamie y Afshin Karimi llegaron al centro de votación en el Centro Comunitario de Encinitas motivados por problemas locales.\n\n“La carrera presidencial en California ya está decidida”, dijo Jamie. “Pero hay un bono llamado Z que ayudará a reparar las cosas en el Distrito Escolar de Encinitas (Union). Y queremos poder decirles a nuestros hijos que votamos”.\n\nAfshin asintió. “Queremos cumplir con nuestro deber cívico”.\n\nMás de 200 centros de votación en todo el condado cerraron a las 8 p.m., excepto para aquellos votantes que ya estaban esperando en la fila.\n\nA medida que un brillante atardecer naranja y azul dio paso a la noche, un flujo constante de votantes continuó entrando en el edificio del Registro de Votantes del Condado de San Diego para dejar sus votos por correo o votar en persona durante la última hora de votación.\n\n“Se siente más auténtico”, dijo Dayton Bettencourt, de 25 años, al votar en persona. Dijo que ha votado en todas las elecciones desde los 18 años.\n\nPara Bettencourt, las elecciones presidenciales no eran su principal motivo. “Me preocupa más la carrera para la alcaldía”, dijo, señalando que su voto probablemente iría en contra del actual alcalde Todd Gloria.\n\nPero tanto ella como su amiga Moriah Dowell, quien votaba por primera vez, emitiendo su voto por Harris, anticipaban el final de la temporada electoral, aunque los resultados finales no se conocerían hasta varios días después.\n\n“Tengo miedo de ver cómo será el día de mañana”, dijo Bettencourt.\n\nVotar por correo seguía siendo la opción más popular entre los votantes del condado de San Diego. Para el martes por la mañana, los funcionarios electorales del condado ya habían recibido más de 880,000 boletas por correo, y alrededor de 80,000 personas ya habían votado en persona.\n\nY para cuando se cuenten todos los votos, los funcionarios esperan una participación entre el 80% y el 84%, en línea con las elecciones presidenciales pasadas. En las elecciones presidenciales de 2016, la participación fue del 81%, y en 2020 fue casi del 84%, según informes.\n\nLos funcionarios electorales advirtieron a los votantes de última hora que esperaran largas filas si optaban por votar en persona el martes. Y con tantas contiendas en la boleta, dijeron que podría llevar más tiempo de lo habitual.\n\nEso fue lo que ocurrió en algunos centros de votación del condado el martes.\n\nEl tráfico de hora punta llegó al centro de votación de la Biblioteca de Mission Valley a última hora de la tarde, con más de 150 personas esperando en una fila serpenteante detrás del edificio. Un trabajador voluntario informaba a las personas en la fila que la espera era de una hora y media.\n\nLos votantes en el Ayuntamiento de Chula Vista experimentaron lo mismo.\n\n“No me esperaba esto”, dijo Raúl Noriega, de 33 años, quien esperó poco menos de dos horas en la fila para votar allí. Dijo que votaba para aprobar la Medida P para extender el recargo del impuesto a las ventas de la ciudad.\n\n“La ciudad necesita dinero”, dijo. “Siento que si vamos a invertir en infraestructura, estoy a favor. Incluso si eso significa que los impuestos se van a aumentar parcialmente, al menos sabemos que el dinero se destinará a algo, ya sea reparar carreteras, transporte público.”\n\nPatricia Ouellette, residente de Carmel Valley, paseaba a su perro golden retriever cerca de un centro de votación el martes por la tarde para “alejarse” de la televisión, dijo.\n\n“Hay mucha ansiedad. Ojalá no estuviera tan reñida”, dijo sobre la elección presidencial. Dijo que había votado por Harris para presidenta y que temía una segunda presidencia de Trump.\n\n“Estoy conteniendo la respiración para que Harris gane. De lo contrario, no sé qué haré mañana”, dijo. “No sé si me levantaré de la cama”.\n\nDentro del centro de votación, Meghan LeClaire, quien dirige un spa en San Diego, marcó solo una burbuja en su boleta: votó por Trump, quien espera que reduzca los impuestos y ayude a los dueños de negocios como ella. Dijo que ha estado demasiado ocupada para investigar todo lo demás en la boleta.\n\n“La política me estresa”, dijo. “Solo me gusta mantenerme al margen.”\n\nAlgunos votantes evitaron las multitudes votando en las oficinas del Registro de Votantes en Kearny Mesa justo después de que se abrieran las urnas a las 7 a.m.\n\nCarl Savoia fue uno de ellos. Dijo que su voto “se siente más importante que en elecciones anteriores. Hay dos plataformas drásticamente diferentes. Esto es más significativo que en elecciones pasadas.”\n\nUn flujo constante de votantes también se vio dejando sus boletas el martes por la mañana en una caja de recolección en Bankers Hill, en la entrada a Balboa Park, cerca de la Sexta Avenida y Laurel Street.\n\n“Tengo una hija adolescente, así que las decisiones que tomamos hoy la afectarán”, dijo Michelle Sainz de Chula Vista, quien se describió a sí misma como alguien que vota regularmente. “Quiero asegurarme de que lo que hagamos hoy sea beneficioso no solo para nosotros, sino para las futuras generaciones.”\n\nLos funcionarios del condado recomiendan que los votantes lean su folleto informativo electoral y marquen sus selecciones en su boleta de muestra por adelantado para que puedan consultar sus opciones una vez dentro de la cabina de votación.\n\nLos residentes elegibles que deseen votar pero aún no están registrados pueden registrarse condicionalmente y votar en persona.\n\nLos votantes que devuelvan su boleta por correo deben recordar firmar y fechar el sobre para asegurarse de que su voto sea contado. Pueden rastrearlo registrándose en “¿Dónde está mi boleta?” en california.ballottrax.net.\n\nLos votantes pueden verificar su estado de registro o localizar centros de votación y cajas de recolección de boletas en línea en sdvote.com. También pueden llamar al 858-565-5800 o al 800-696-0136 para obtener más información.\n\nAunque las urnas cierran el martes por la noche, los resultados completos de las elecciones tardarán mucho más.\n\nLa oficina del condado comenzará a publicar los resultados parciales — de las boletas recibidas hasta el lunes — poco después de que cierren las urnas a las 8 p.m. Actualizarán los resultados durante la noche y en los días siguientes a medida que se cuenten más boletas, pero los resultados oficiales no se certificarán hasta principios de diciembre.\n\nLa carrera presidencial ha cautivado la atención de la mayoría de los votantes, junto con el control de las dos cámaras del Congreso. Pero en las elecciones también se deciden varios puestos en las asambleas estatales, el Senado estatal, 10 proposiciones estatales y decenas de carreras locales, además de cinco escaños en la Cámara de Representantes de EE.UU. y el escaño abierto de California en el Senado de EE.UU.\n\nUno de los aspectos destacados es la carrera por el Distrito 49 de la Cámara de Representantes. El republicano Matt Gunderson espera desbancar al demócrata de tres mandatos Mike Levin por el escaño en el condado costero del norte y el sur del condado de Orange.\n\nA nivel del condado, la carrera de alto perfil en el Distrito 3 — donde el exalcalde de San Diego Kevin Faulconer desafía a la actual supervisora Terra Lawson-Remer — podría determinar qué partido controla la Junta de Supervisores.\n\nEn la ciudad de San Diego, los votantes de toda la ciudad decidirán no solo si reelegir al alcalde Todd Gloria, sino también quién sucederá al fiscal de la ciudad, entre otras carreras. Los votantes de al menos una docena de otras ciudades también decidirán quién los representará y si aprueban medidas locales.\n\nEn las carreras legislativas estatales, los distritos de la Asamblea 75 y 79 presentan rondas finales entre dos candidatos del mismo partido.\n\nEl activista republicano Carl DeMaio y su rival respaldado por el partido Andrew Hayes se postulan para representar una amplia zona del Este del condado y el norte del condado interior en Sacramento, mientras que los demócratas Colin Parent y LaShae Sharp-Collins compiten para representar partes del este de San Diego, Lemon Grove y La Mesa.\n\nOriginal Story","summary":"Miles de votantes del condado de San Diego se enfrentaron a largas filas para emitir sus votos","url":"https://www.sandiegouniontribune.com/2024/11/06/una-combinacion-de-serenidad-y-terror-el-condado-de-san-diego-voto-asi-en-el-ultimo-dia-de-una-tumultuosa-eleccion-presidencial/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/11/SUT-L-Elex-Encinitas-Vote01-1.jpg?w=1024","video":null,"publish_date":"2024-11-07 00:58:56","author":"Alexandra Mendoza,Emily Alvarenga,Gary Robbins,Kristen Taketa","authors":["Alexandra Mendoza","Emily Alvarenga","Gary Robbins","Kristen Taketa"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":263201704,"title":"Trump sent Wall Street soaring but there was one danger sign","text":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note. US bond yields shot up.\n\nWhile the US sharemarket posted record levels, as did Bitcoin, and the dollar surged against America’s major trading partners’ currencies, a 16 basis point jump in the 10-year bond yield and an 11 basis point rise in the yield on two-year Treasury notes provided a cautionary note.\n\nThe sharemarket investors were responding to the prospect of Trump’s promise to not only extend his 2017 tax cuts, which would otherwise expire next year, but also to add another layer of tax cuts for companies and wealthier households. The Dow Jones index rose 3.6 per cent and the S&P 500 2.6 per cent.\n\nThe investors are also enthused by the prospect of Trump’s promised deregulation, with Elon Musk’s, likely to be in charge of a commission to audit government spending, targeting $US2 trillion ($3 trillion) of cuts to government outlays.","summary":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note.","url":"https://www.smh.com.au/business/markets/trump-sent-wall-street-soaring-but-there-was-one-danger-sign-20241107-p5kol2.html","image":"https://static.ffx.io/images/$zoom_0.23860000000000003%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_261%2C$y_85/t_crop_custom/q_86%2Cf_auto/655292d37d4006eb83eb5258496dac0c8eed6eb3","video":null,"publish_date":"2024-11-07 00:58:18","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":-0.316},{"id":263201534,"title":"Trump sent Wall Street soaring but there was one danger sign","text":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note. US bond yields shot up.\n\nWhile the US sharemarket posted record levels, as did Bitcoin, and the dollar surged against America’s major trading partners’ currencies, a 16 basis point jump in the 10-year bond yield and an 11 basis point rise in the yield on two-year Treasury notes provided a cautionary note.\n\nThe sharemarket investors were responding to the prospect of Trump’s promise to not only extend his 2017 tax cuts, which would otherwise expire next year, but also to add another layer of tax cuts for companies and wealthier households. The Dow Jones index rose 3.6 per cent and the S&P 500 2.6 per cent.\n\nThe investors are also enthused by the prospect of Trump’s promised deregulation, with Elon Musk’s, likely to be in charge of a commission to audit government spending, targeting $US2 trillion ($3 trillion) of cuts to government outlays.","summary":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note.","url":"https://www.brisbanetimes.com.au/business/markets/trump-sent-wall-street-soaring-but-there-was-one-danger-sign-20241107-p5kol2.html","image":"https://static.ffx.io/images/$zoom_0.23860000000000003%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_261%2C$y_85/t_crop_custom/q_86%2Cf_auto/655292d37d4006eb83eb5258496dac0c8eed6eb3","video":null,"publish_date":"2024-11-07 00:58:18","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":-0.316},{"id":263201488,"title":"Trump sent Wall Street soaring but there was one danger sign","text":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note. US bond yields shot up.\n\nWhile the US sharemarket posted record levels, as did Bitcoin, and the dollar surged against America’s major trading partners’ currencies, a 16 basis point jump in the 10-year bond yield and an 11 basis point rise in the yield on two-year Treasury notes provided a cautionary note.\n\nThe sharemarket investors were responding to the prospect of Trump’s promise to not only extend his 2017 tax cuts, which would otherwise expire next year, but also to add another layer of tax cuts for companies and wealthier households. The Dow Jones index rose 3.6 per cent and the S&P 500 2.6 per cent.\n\nThe investors are also enthused by the prospect of Trump’s promised deregulation, with Elon Musk’s, likely to be in charge of a commission to audit government spending, targeting $US2 trillion ($3 trillion) of cuts to government outlays.","summary":"Amid the near-euphoria in financial markets that erupted when it became clear that Donald Trump had regained the US presidency there was one sobering note.","url":"https://www.theage.com.au/business/markets/trump-sent-wall-street-soaring-but-there-was-one-danger-sign-20241107-p5kol2.html","image":"https://static.ffx.io/images/$zoom_0.23860000000000003%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_261%2C$y_85/t_crop_custom/q_86%2Cf_auto/655292d37d4006eb83eb5258496dac0c8eed6eb3","video":null,"publish_date":"2024-11-07 00:58:18","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":-0.316},{"id":263202182,"title":"Foreign Minister Looks Forward to Working With Trump, Confident on AUKUS","text":"Foreign Minister Penny Wong has extended her congratulations to Donald Trump following his win in the election.\n\nTrump has secured 295 electoral college votes at the time of writing compared to Kamala Harris’s 226.\n\nIn response to his election, Australia’s Foreign Minister Wong expressed confidence in the AUKUS defence pact and touted the long-standing alliance between the two countries on Nov. 7.\n\n“We have an alliance that has bipartisan support that’s based on long-standing friendship, timeless democratic values, and shared objectives.”\n\nWong said the alliance between Australia and the U.S. has stood the test of time and is bigger than any individual or past comments.\n\nWhen Albanese and Trump speak, she said they will be talking about issues critical to Australia’s interest, including AUKUS.\n\n“We have a lot of confidence in the bipartisan support for AUKUS. It’s certainly been a priority for the Government and our Ambassador,” she said.\n\n“In the lead up to the election, we assured we were very pleased to see passage of legislation through the Congress, which was all about delivering AUKUS.\n\n“I met with senior Republicans over this last year, including very recently on my trip to the United States. And obviously, key amongst those discussions was AUKUS.”\n\nAUKUS is a trilateral partnership between Australia, the United States, and United Kingdom aimed at maintaining stability in the Indo-Pacific and providing Australia with nuclear-powered submarines.\n\nWong noted that AUKUS would be delivered over many governments and decades, requiring deep support across the political spectrum in all three countries.\n\nHowever, in relation to Trump’s overall policies including tariffs, Wong noted that Trump had campaigned on a platform of change and made his commitment to it clear.\n\nSpeaking to reporters, Albanese said he would not be apologising for previous comments about Trump and plans to speak with him soon.\n\n“No, I look forward to working with President Trump. I’ve demonstrated my ability to work with world leaders and to develop relationships with them, which are positive.”\n\n“And they are some of the key arguments you’d advance when it comes to dealing with trade and tariff agendas, or with ensuring that we are actually delivering upon those AUKUS commitments that have been made and secured.”\n\nBirmingham noted that AUKUS enjoys strong bipartisan support in both the Australian Parliament and the U.S. Congress, highlighting it was initially negotiated by the Morrison government with the Biden administration.\n\nIn contrast, Greens Leader Adam Bandt has described the election of Trump as a “pretty terrifying outcome for many of us.”\n\n“Congratulations to President Trump on his return to the leadership of the free world. Self-belief is what the West needs right now and Trump has that in spades,” Abbott said.\n\nFormer Prime Minister Scott Morrison also offered his congratulations to President Trump, posting a photo of the pair shaking hands in the United States.","summary":"Albanese also congratulated Trump, adding that he will not apologise for past comments about him.","url":"https://www.theepochtimes.com/world/foreign-minister-looks-forward-to-working-with-trump-confident-on-aukus-5755631","image":"https://img.theepochtimes.com/assets/uploads/2024/11/06/id5755260-Trump-Win-3_JF_11052024_1-LSedit-300x180.jpg","video":null,"publish_date":"2024-11-07 00:56:10","author":"Monica O’shea","authors":["Monica O’shea"],"language":"en","category":"politics","source_country":"us","sentiment":0.36},{"id":263201366,"title":"Donald Trump and Olympics on collision course over transgender ban vow","text":"Trump made that promise a key plank of his election campaign, although it remains to be seen how any such move at a federal level might affect LA 2028, which is being held in the Democrat stronghold of California.\n\nThe IOC has been approached for comment about Games rules that host cities are ordinarily required to abide by.\n\nIn the case of gender eligibility, these do not include a blanket ban on transgender women or those such as Khelif – who appears to have been born with differences of sexual development – competing in women’s events.\n\nSuch decisions on eligibility are delegated to international federations, many of which also do not prohibit entirely those born male from female categories.","summary":"The president-elect wants to ban transgender athletes from women’s sport ahead of the 2028 Los Angeles Games.","url":"https://www.smh.com.au/sport/donald-trump-and-olympics-on-collision-course-over-transgender-ban-vow-20241107-p5kom6.html","image":"https://static.ffx.io/images/$zoom_0.191%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/46046e0d207e181c176db1901e8b3e067f08856f","video":null,"publish_date":"2024-11-07 00:56:02","author":"Ben Rumsby","authors":["Ben Rumsby"],"language":"en","category":"politics","source_country":"au","sentiment":0.096},{"id":263201536,"title":"Donald Trump and Olympics on collision course over transgender ban vow","text":"Trump made that promise a key plank of his election campaign, although it remains to be seen how any such move at a federal level might affect LA 2028, which is being held in the Democrat stronghold of California.\n\nThe IOC has been approached for comment about Games rules that host cities are ordinarily required to abide by.\n\nIn the case of gender eligibility, these do not include a blanket ban on transgender women or those such as Khelif – who appears to have been born with differences of sexual development – competing in women’s events.\n\nSuch decisions on eligibility are delegated to international federations, many of which also do not prohibit entirely those born male from female categories.","summary":"The president-elect wants to ban transgender athletes from women’s sport ahead of the 2028 Los Angeles Games.","url":"https://www.brisbanetimes.com.au/sport/donald-trump-and-olympics-on-collision-course-over-transgender-ban-vow-20241107-p5kom6.html","image":"https://static.ffx.io/images/$zoom_0.191%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/46046e0d207e181c176db1901e8b3e067f08856f","video":null,"publish_date":"2024-11-07 00:56:02","author":"Ben Rumsby","authors":["Ben Rumsby"],"language":"en","category":"politics","source_country":"au","sentiment":0.096},{"id":263201490,"title":"Donald Trump and Olympics on collision course over transgender ban vow","text":"Trump made that promise a key plank of his election campaign, although it remains to be seen how any such move at a federal level might affect LA 2028, which is being held in the Democrat stronghold of California.\n\nThe IOC has been approached for comment about Games rules that host cities are ordinarily required to abide by.\n\nIn the case of gender eligibility, these do not include a blanket ban on transgender women or those such as Khelif – who appears to have been born with differences of sexual development – competing in women’s events.\n\nSuch decisions on eligibility are delegated to international federations, many of which also do not prohibit entirely those born male from female categories.","summary":"The president-elect wants to ban transgender athletes from women’s sport ahead of the 2028 Los Angeles Games.","url":"https://www.theage.com.au/sport/donald-trump-and-olympics-on-collision-course-over-transgender-ban-vow-20241107-p5kom6.html","image":"https://static.ffx.io/images/$zoom_0.191%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/46046e0d207e181c176db1901e8b3e067f08856f","video":null,"publish_date":"2024-11-07 00:56:02","author":"Ben Rumsby","authors":["Ben Rumsby"],"language":"en","category":"politics","source_country":"au","sentiment":0.096},{"id":263201730,"title":"LAURA INGRAHAM: Donald Trump's 'stunning victory' was a 'total political vindication'","text":"Fox News host Laura Ingraham calls elites who counted out President-elect Trump since his first time running for office \"venal\" and \"selfish\" after his \"stunning victory\" on \"The Ingraham Angle.\" LAURA INGRAHAM: These past nine years have been a total blur, because from the day that Donald Trump came down that golden escalator back in 2015 right up until yesterday afternoon, the elites counted him out. But they weren't content to beat Donald Trump in a fair election. They needed their insurance policies with corrupt prosecutions. And in this maniacal mission, they abused our government institutions. They destroyed the credibility of the FBI, the DOJ, state DA offices, the House of Representatives — even the NIH. How venal and how selfish they all were. DONALD TRUMP ELECTED AS THE NEXT PRESIDENT OF THE UNITED STATES But last night's stunning victory — it wasn't just a personal triumph for President Trump and his family, who have all gone through hell, by the way — it was a complete and a total political vindication of his first-term record and of his current agenda. So, it turns out that you can't allow a migrant invasion; you can't drive up inflation, food and gas prices and blow $200 billion in Ukraine and expect to win the presidency. Democrat strategists knew that both Kamala's record and her personality — they weren't very popular… CLICK HERE TO GET THE FOX NEWS APP Tonight, I say, \"Bravo, Donald Trump.\" No one else could have pulled this off. And now, the hard work begins.","summary":"Fox News host Laura Ingraham says President-elect Trump has been vindicated personally and politically after winning the 2024 election on &quot;The Ingraham Angle.&quot;","url":"https://www.foxnews.com/media/laura-ingraham-donald-trumps-stunning-victory-total-political-vindication","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/816c169b-8a73-4295-90e0-447b7500c26a/93775703-47d0-4ceb-971d-854ae629bf9f/1280x720/match/896/500/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-07 00:55:49","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.387},{"id":263201566,"title":"‘Huge implications’: Trump election highlights possible B.C. immigration impacts","text":"In the leadup to his election victory, Donald Trump announced a variety of policies that could have a potential impact on Canada, including a promise to deport millions of undocumented immigrants from the U.S.\n\n“That has huge implications for Canada,” Terri Givens, a professor of political science at the University of British Columbia told Global News.\n\n“You’re going to start seeing more asylum seekers coming to Canada immediately.\n\n“I expect to see a surge in people, you know, instead of coming to the U.S. or leaving the U.S. and wanting to declare asylum in Canada.”\n\nSpeaking on Wednesday, Canadian government officials say they have a “plan” to ensure the country’s border security and control over who comes into the country.\n\nDeputy Prime Minister Chrystia Freeland said the government is focused on Canada’s border and the potential impacts of what could come next.\n\n“What’s important for Canadians is to control our own border and that is something that’s really important, it’s fundamental,” she said.\n\n“I do want to assure Canadians that we absolutely recognize the importance of border security and of controlling our own border, of controlling who comes into Canada and who doesn’t.”\n\nIn a statement, Immigration, Refugees and Citizenship Canada told Global News, “We are a country that has demonstrated that we can successfully manage our relationship with the United States, our neighbour and principle strategic partner. We will continue to keep the interests of Canada at heart as we work with the incoming administration in the months to come.\n\n“Over the last 18 months, Minister Miller has worked to ensure that we have an immigration system that enables safe and orderly migration, refugee protection, and border security.”\n\nThe organization said it will continue to prepare and anticipate all possible scenarios and any approach taken will be first and foremost in the best interest of Canada and its citizens.\n\nEdward Alden, a senior fellow at the Council on Foreign Relations in Washington, D.C., said he thinks they will see a similar situation to what happened after 9/11.\n\n“The Bush administration was attempting to register all Muslim migrants who were in the United States and those who were out of status for one reason or another, fled north to try to get into Canada” he said.\n\n“So there were large numbers of people at various shelters and other facilities up on the northern border heading into Canada. And the scale of this could be much larger. The rules have changed, so the reception in Canada is likely to be quite different. But yes, I expect a similar surge, probably even before… President-elect Trump is inaugurated because he’s been so clear about his plan.”\n\nAlden said the threat of mass deportations does cause a certain degree of panic.\n\n“So I think the threat alone will generate a response,” he said.\n\n“Deporting millions of people is no routine undertaking. But the president-elect has made it clear that he’s going to expand resources in whatever ways he can, deploying National Guard and others, building tent cities, trying to increase the number of removals substantially. It’ll take a long time to get into anything that approaches millions, but there’ll be a lot of disruption on the way. There’s no question.”\n\nThe B.C. business community is also reacting to the news that Donald Trump has won another presidential election.\n\n“It’s an America-first economic vision that Trump has been proposing throughout his campaign, and it’s one that does not necessarily bode well for free trade,” Tyler Orton with Business in Vancouver told Global News.\n\n“This is based on Trump’s own intentions to implement wide-ranging tariffs. Greater Vancouver Board of Trade CEO Bridget Anderson says she’s concerned about the province’s economy combined with labour issues at the ports (and) Canada Post. She says we need to be focused on stable supply chains, trade and investments. Otherwise, we’re just going to be a bit of a small player on the global realm when it comes to free trade here.”\n\nOrton said former premier Christy Clark said she is also concerned about the free trade agreement between the U.S., Canada and Mexico, which is up for review and renewal in 2026.\n\n“If it doesn’t go forward with a renewal, we’re going to be facing a wide range of protectionist measures, including tariffs as well,” Orton said.\n\nGivens said what happened in the U.S. on election day showed the divide in the country but also showed that many did not appear to vote at all.\n\n“Trust me, my political science colleagues and I are going to be analyzing these numbers,” she said.\n\n“And, you know, we need to make sure we know kind of what the final numbers overall happen to be. But I can tell you for sure, we’re going to be looking at this up, down, sideways, backwards, forwards to see what was really going on here.”\n\nPaul Quirk, a professor in the Department of Political Science at the University of British Columbia said the polls before election day showed the race was very close but that was a significant error.\n\n‘That is, Trump outperformed the polls,” he said.\n\n“That kind of error is not especially unusual. What from a longer-term perspective, it’s surprising, I think, because it’s hard to understand how so many people supported a candidate who was rejected by many of the top people in his prior administration who said that he was unfit for office and a danger to democracy and so forth. So the reasons for his support are, to some degree puzzling.”\n\nIt is unclear how Trump’s win could influence the Canadian federal election next year but Quirk said it could worry some Canadians.\n\n“I would kind of think that the election of a candidate is so extreme as Trump is going to worry a lot of people and have somewhat of a backlash effect,” he said.\n\n“So I kind of think it would help liberals more than conservatives. It’s similar to what happens in congressional elections in the midterms. There’s a reaction against whoever it was that was elected president. And if Canada is influenced by the presidential election, I think it’d be similar to the reaction against, you know, reaction going in the opposite direction.”\n\n— with files from Sean Previl","summary":"\"That has huge implications for Canada,\" Terri Givens, a professor of political science at the University of British Columbia told Global News.","url":"https://globalnews.ca/news/10856439/donald-trump-election-bc-border-immigration/","image":"https://globalnews.ca/wp-content/uploads/2024/11/20241106081128-20241106081112-05f95eee6e2cca3a7697e8ce4b090b377018408dd6c62bc3daf5aac2a16e4e58.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2024-11-07 00:55:23","author":"Amy Judd","authors":["Amy Judd"],"language":"en","category":"politics","source_country":"ca","sentiment":0.006},{"id":263201338,"title":"Simone Biles tells Joe Biden to ‘stand up’ after Kamala Harris’ presidential election defeat: ‘Straighten your back’","text":"Simone Biles reacted to the presidential election results by calling out President Joe Biden.\n\nThe Olympic gold medalist encouraged the 46th president to take action in the final months of his presidency after Kamala Harris lost to Donald Trump.\n\n“Mr Biden, I need you to stand up, straighten your back and make some things shake before your departure,” Biles wrote via X on Wednesday.\n\nShe signed off the message, “xoxo the women in america 💙.”\n\nPresident-elect Trump — who previously won the election in 2016 — was declared the winner over Vice President Harris early Wednesday morning.\n\nShortly after, Biles shared her emotional reaction to Trump’s victory on Threads.\n\n“you gotta be f–king kidding me,” she posted, adding, “I’m SO sorry america.” \n\nThe elite gymnast, 27, also wrote, “we deserve better 💔.”\n\nSeveral hours after Biles’ call-to-action to Biden, the commander-in-chief applauded Harris, 60, for her concession speech at Howard University this afternoon.\n\n“What America saw today was the Kamala Harris I know and deeply admire. She’s been a tremendous partner and public servant full of integrity, courage, and character,” he said in statement shared on X.\n\n“Under extraordinary circumstances, she stepped up and led a historic campaign that embodied what’s possible when guided by a strong moral compass and a clear vision for a nation that is more free, more just, and full of more opportunities for all Americans.”\n\nBiden, 81, went on to say that choosing Harris as his vice president was the “very first decision” he made when he became the Democratic presidential nominee in 2020.\n\n“It was the best decision I made. Her story represents the best of America’s story. And as she made clear today, I have no doubt that she’ll continue writing that story,” he continued.\n\n“She will continue the fight with purpose, determination, and joy. She will continue to be a champion for all Americans. Above all, she will continue to be a leader our children will look up to for generations to come as she puts her stamp on America’s future.”\n\nAlong with Biles, other celebrities and public figures have also shared their reactions to Trump, 78, returning to the White House in 2025.\n\n“Please unfollow me if you voted against female rights. Against disability rights. Yeah that. Unfollow me because what you did is unreal. Don’t want followers like this,” Christina Applegate posted on X Wednesday morning. \n\nMeanwhile, Barstool Sports founder Dave Portnoy claimed Democrats left him “no choice” but to vote for the former president.\n\n“That was the worst campaign and their pure arrogance and moral superiority have driven people away,” he said in a “rant” on Instagram Tuesday night.","summary":"The Olympic gold medalist encouraged the 46th president to take action in the final months of his presidency after Harris lost to Donald Trump.","url":"https://pagesix.com/2024/11/06/celebrity-news/simone-biles-tells-joe-biden-to-stand-up-after-kamala-harris-election-defeat/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/11/93173416.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-11-07 00:54:41","author":"Sabrina Picou","authors":["Sabrina Picou"],"language":"en","category":"politics","source_country":"us","sentiment":-0.122},{"id":263201156,"title":"STEPHEN GLOVER: Unlike some of my Tory friends, the return of Donald Trump, a rabble-rousing braggart, leaves me fearful and depressed","text":"STEPHEN GLOVER: Unlike some of my Tory friends, the return of Donald Trump, a rabble-rousing braggart, leaves me fearful and depressed\n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nView the full results of the US election via our live-updating maps and charts\n\nBy Stephen Glover for the Daily Mail\n\nPublished: 00:44 GMT, 7 November 2024 | Updated: 00:52 GMT, 7 November 2024\n\nMany people on the Right in Britain are delighted by Donald Trump's victory. He has seen off Kamala Harris, a patently mediocre woman of the soft Left who champions woke causes. I am very far from delighted. In fact, I'm profoundly depressed. \n\nThere is good reason to believe that Trump will be bad for America, the world and Britain.\n\nOf course, we don't have very much idea what he will do since such policies as he unveiled during the presidential campaign were pretty vague, and may never see the light of day.\n\nNevertheless, we know he is a convicted felon who incited an insurrection in Washington in January 2021. We know he's a liar and cheat who claimed without supplying any evidence that the November 2020 election was stolen from him.\n\nWe also know that last year a civil court delivered a judgment that Trump sexually abused a woman in the mid-1990s, and was liable for battery, as well as for defaming her.\n\nBoris Johnson defended Trump during Channel 4's live coverage of the election last night\n\nDonald Trump's more extreme policies could unsettle America and the rest of the world\n\nTrump, his wife and their son celebrate the victory in Florida early on November 6\n\nThese are not mere character flaws or blemishes. They collectively amount to the most damning moral indictment of any leader elected in a modern democracy. Not for nothing was he recently described by his longest-serving former chief of staff as a 'fascist'.\n\nI am amazed that some of my Tory friends, not to mention millions of American voters, are prepared to overlook the sins of this foul-mouthed braggart.\n\nWill Donald Trump's win mean that Volodymyr Zelensky now has to do a deal with Vladimir Putin?\n\nLet me say, in a spirit of fairness, that Trump has one quality – an ability to persevere despite being hauled from one court to another and being chastised by the mainstream media. No one should gainsay the extent of his achievement in being only the second man in American history to return to the White House after being out of office.\n\nWe saw Trump's inner strength in the moments after he was wounded in an assassination attempt in July, mouthing the words 'Fight, fight, fight' having been raised to his feet.\n\nRemarkable, yes, but this resilience doesn't wipe out the lies or the name-calling or the whipping up of a violent mob. It is proof of an unquenchable ego, and possibly of a narcissistic personality.\n\nWhat does Trump's triumph tell the young people of the United States and the world? That brazen lying can be rewarded with the highest prizes. That cheats prosper. What a dismal example, and how far from America's idea of itself as a shining city on a hill.\n\nIt gets worse. Looking at Trump – his rambling and incoherent speeches, often delivered in babyish English – who can say with any confidence that this capricious, unpredictable 78-year-old will be a stable and reliable leader of the Free World?\n\nKamala Harris is pedestrian, and misguided in her economic prescriptions for America. Her dullness, though, would have guaranteed security. She wouldn't have done anything mad. We can't say the same about Donald Trump.\n\nConsider his ideas. He has vowed to impose a 10 per cent tariff on imports from all countries except China, which is threatened with 60 per cent duties. Oh, and Mexico faces 100 per cent tariffs unless it stops illegal immigrants from crossing the border with the US. The effect of such measures would be to increase prices in America, and probably lead to a global trade war.\n\nTrump will be challenged to confront Russia and help Ukraine negotiate peace terms \n\nThe United States is Britain's largest single trade partner. We enjoy a surplus. Don't imagine that, just because Trump is half-British and supposedly likes this country, he will exempt us.\n\nMaybe he'll change his mind about tariffs. But it's certainly possible that he will go ahead with the scheme to our detriment. The other day – this is a measure of the man's wildness – he suggested he would like to scrap federal income tax and replace the revenue with money generated from tariffs.\n\nTrump pledged to restore the USA 'to -greatness' - but just how will he do it? asks TOM LEONARD\n\nTrump is an isolationist as well as a protectionist. My colleague Boris Johnson – who as Prime Minister was the Western leader who first rallied to President Volodymyr Zelensky's side after Russia's invasion – has suggested that Trump 'will be strong and decisive' in his support of Ukraine and in 'defending democracy'.\n\nThere's very little evidence to support this view. Trump has spoken about Ukraine in negative terms, describing it as 'demolished' in September, and its people as 'dead'. The US has hitherto provided far more military aid to the beleaguered country than any other government. Only optimistic souls believe this will continue under Trump.\n\nIndeed, the happiest man in the world apart from Donald Trump is probably Vladimir Putin. He knows that prospective Vice-President JD Vance has said Ukraine should cede land to end the war. If such a capitulation is forced on Zelensky by Trump, it will embolden Putin in further adventures.\n\nThen there is Nato, of which Trump has been a relentless critic. Earlier this year, he said during a campaign rally that he would 'encourage' Russia 'to do whatever the hell they want' to Nato allies that don't spend enough on defence.\n\nDuring his first presidency Trump rightly rebuked European countries for taking a free ride on American taxpayers, and devoting insufficient resources to defence. France, Germany, Spain and Italy must dig much deeper into their pockets. So should Britain, which spends only slightly more.\n\nBritain urged to hike defence spending amid renewed fears Trump could pull out of NATO\n\nBut it's bound to take time for European countries to build up their capabilities. The danger is that they will face a resurgent Russia – which may be handed victory in Ukraine by the mercurial Trump – before they are able to defend themselves without Uncle Sam's protection.\n\nThose on the Right who deprecate Kamala Harris should accept that, for all her shortcomings, she wouldn't have left Nato allies in such a predicament. That is what I mean when I say that she offered far greater security.\n\nNot all of Trump's policies are dangerous, of course. His tough line on illegal immigration, which has run out of control during the Biden years, evidently won him support including, interestingly, from Latinos. (Keir Starmer, take note.) That said, Trump's threatened deportation of 'maybe 20 million' undocumented migrants sounds draconian.\n\nRemember he will have a Republican Senate and, very possibly when the results have come in, a Republican House of Representatives. Republican appointees also control the Supreme Court. He will have almost untrammelled freedom to do whatever he wants.\n\nFile photo. Labour will be pressed to meet its defence obligations under Trump - but European leaders will fear the 47th President may pull the US out of the bloc altogether\n\nWe are heading for turbulent times. And I don't expect that the bellicose Trump will be drawn to our own dear Government.\n\nA man more different from our PM could scarcely be imagined; Starmer idiotically boasted of his recent dinner with Trump yesterday, as though it was proof of a deep friendship. I'm sure the volatile President-elect won't forget insults recklessly churned out by Foreign Secretary David Lammy while in opposition, such as calling him a 'neo-Nazi sympathising sociopath' and 'a tyrant in a toupee'.\n\nWe'll have to try to get on with him, of course. Let's pray that his often insane bark turns out to be worse than his bite.\n\nDonald Trump is, or will be once installed in the White House in January, the most powerful man on earth. It is the prospect of this vast power being misused and abused that truly terrifies me.\n\nUkraineDonald TrumpKamala Harris\n\nShare or comment on this article:\nSTEPHEN GLOVER: Unlike some of my Tory friends, the return of Donald Trump, a rabble-rousing braggart, leaves me fearful and depressed\n\nAdd comment","summary":"STEPHEN GLOVER: \nMany people on the Right in Britain are delighted by Donald Trump's victory. I am very far from delighted. In fact, I'm profoundly depressed. ","url":"https://www.dailymail.co.uk/debate/article-14051535/stephen-glover-donald-trump-victory.html","image":"https://i.dailymail.co.uk/1s/2024/11/07/00/91783489-0-image-a-114_1730940127567.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/06/8234531159518236231/1024x576_MP4_8234531159518236231.mp4","publish_date":"2024-11-07 00:52:57","author":"Editor,Stephen Glover","authors":["Editor","Stephen Glover"],"language":"en","source_country":"gb","sentiment":-0.208},{"id":263201068,"title":"AP exit polls show minorities and young voters turnout for Trump in Texas","text":"HOUSTON, Texas (KTRK) -- As former president Donald Trump won his 2024 bid for a second term this week, 13 Investigates takes a look at exit polling data that provides insight into why Texas is more Republican-leaning than it was four years ago.\n\nThis election year, Trump made inroads with minority and young voters, according to exit poll data from AP Votecast.\n\nFour years ago, when Trump lost the presidential race to Biden, just 15% of Black men who voted in Texas cast a ballot for Trump, according to exit poll data. This year that grew to 34% of Black male voters who cast a ballot for Trump.\n\nTrump's popularity also grew among Latino voters in Texas. Just 38% of Latino men who voted in Texas cast a ballot for Trump four years ago, compared to 53% this year.\n\nWhen it comes to Latino women, 36% of Texans from that demographic voted for Trump in 2020 compared to 48% this year, the AP Votecast exit polling data shows.\n\nTrump's popularity among young Texas voters also grew. In 2020, just 35% of voters between the ages of 18 and 29 voted for Trump. This year, that grew to 51%.\n\nAmong Texas voters, Trump made a 27-point improvement with young men.\n\nFour years ago, 33% of Texas' male voters younger than 30 voted for Trump in 2020. The exit poll data shows that up to 60% of young male voters are casting a ballot for Trump this year.\n\nDespite Democrats banking on abortion to drive young women to the polls, Trump made gains there, too, in Texas. Just 38% of Texas young female voters cast a ballot for Trump in 2020, up to 45% this year.\n\nThe economy and jobs were the most important issues for Texas voters when it came to both Trump and Democratic candidate and current Vice President Kamala Harris.\n\nNearly half, or 47%, of Trump voters in Texas said the economy and jobs were the most important issues, followed by 37% of Trump voters saying immigration was the most important issue.\n\nFor Harris voters in Texas, 32% said the economy and jobs were the most important issue, and while abortion came in second, just 22% of Harris supporters said that was the most important issue.\n\nWhile some political ads this election cycle were centered around abortion, exit polling data shows it wasn't a huge driver among Texas voters.\n\nJust 61% of Trump supporters in Texas said abortion policy had an impact on who to support.\n\nNearly a third of Trump supporters in Texas think a woman should be able to get an abortion if they don't want to be pregnant for any reason at all, the exit poll data shows. There were also 85% of Texas Trump supporters who think abortion should be legal if the woman's health is at risk.\n\nThe economy is a top issue among both Trump and Harris supporters. Exit poll data found that 65% of Texas voters who would describe themselves as getting ahead financially are Harris supporters, while 68% of Texans who say they're falling behind financially support Trump.\n\nFor updates on this story, follow Kevin Ozebek on Facebook, Twitter and Instagram.\n\nContact 13 Investigates\n\nHave a tip? A problem to solve? Send a tip below. If you don't have a photo or document to include, just hit 'skip upload' and send the details. (On mobile? You can open our form by tapping here.)","summary":"Exclusive exit poll data you'll only see on ABC13 shows minorities and young voters in Texas turned to Trump.","url":"https://abc13.com/post/2024-elections-results-ap-exit-polls-show-minority-youth-voters-turnout-trump-texas/15518703/","image":"https://cdn.abcotvs.com/dip/images/15519733_110624-ktrk-6pm-koz-polling-data-wed-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/ktrk/110624-ktrk-6pm-koz-polling-data-wed-vid.mp4","publish_date":"2024-11-07 00:52:43","author":"Kevin Ozebek,Sarah Rafique","authors":["Kevin Ozebek","Sarah Rafique"],"language":"en","category":"politics","source_country":"us","sentiment":-0.201},{"id":263201192,"title":"Donald Trump Pressured to Release Jeffrey Epstein Files After Election Win","text":"Following his recent election win, social media users have been urging Donald Trump to release files related to sex offender Jeffrey Epstein and a rumored client list tied to Epstein's activities.The day after his victory, several users on X (formerly Twitter) referenced Trump's campaign comments, where he had stated he would have \"no problem\" releasing documents related to the Epstein case.In a September interview with podcaster Lex Fridman, Trump reiterated his openness to releasing these documents if he returned to the White House, saying, \"I'd have no problem with it,\" and adding that he would \"certainly take a look at it\" if given the opportunity.The topic of Epstein's client list was frequently discussed in podcasts and interviews featuring Trump and his allies during the campaign, including a widely shared clip of Elon Musk, Tesla's CEO and one of Trump's close allies.Musk suggested that increased support for Kamala Harris from certain donors might be driven by fear of potential disclosures, implying these individuals were \"terrified\" of what might be revealed.\"I think part of why Kamala is getting so much support is the fear that if Trump wins, the Epstein client list might go public,\" Musk said. He added that this possible disclosure was causing anxiety among some prominent figures in Harris's camp, though he didn't mention anyone by name.Epstein's murky past as an accused sex trafficker has drawn intense public interest and speculation since his death by suicide five years ago. This fascination is partly due to Trump's past association with Epstein, who also had ties to high-profile Democrats, including former President Bill Clinton.The issue resurfaced with Trump reaffirming his stance, emphasizing that he \"was never involved\" with Epstein and would have \"no problem\" releasing related files if the opportunity arose. Trump has distanced himself from Epstein over the years, asserting that he cut ties with the New York businessman in the early 2000s.Trump also pointed out that many influential people were drawn to Epstein because of his wealth and private Caribbean island, Little Saint James, where alleged illicit activities occurred. \"I never went to his island, fortunately, but a lot of people did,\" Trump noted.In 2023, some of Epstein's connections were revealed in court documents from a lawsuit filed by Virginia Giuffre, one of Epstein's accusers.However, these records did not confirm the existence of a definitive \"client list,\" as speculated since his arrest in 2019 and death in 2021. The documents mainly included depositions, police reports, and emails tied to a 2015 defamation case.","summary":"Several users on X brought Trump's campaign comments about having \"no problem\" releasing Epstein-related documents, one day after his victory.","url":"https://www.newsweek.com/donald-trump-pressured-release-jeffrey-epstein-files-after-election-win-1981781","image":"https://d.newsweek.com/en/full/2514814/donald-trump-jeffrey-epstein.jpg","video":null,"publish_date":"2024-11-07 00:52:20","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"US","sentiment":0.048},{"id":263201282,"title":"What Trump's win could mean for Russia's war against Ukraine","text":"What Trump's win could mean for Russia's war against Ukraine\n Throughout his campaign, President-elect Donald Trump has repeatedly promised to negotiate peace between Russia and Ukraine, vowing that Moscow's war on Kyiv would quickly end after he won the election. Imtiaz Tyab has more.","summary":"Throughout his campaign, President-elect Donald Trump has repeatedly promised to negotiate peace between Russia and Ukraine, vowing that Moscow's war on Kyiv would quickly end after he won the election. Imtiaz Tyab has more.","url":"https://www.cbsnews.com/video/what-trumps-win-could-mean-for-russias-war-against-ukraine/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/07/139138a8-af7e-41e7-b4c8-dabdda7bb476/thumbnail/1200x630/0cdb9f7c5c2d5d148bc8d365668b3e37/1106-en-tyab.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:51:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.296},{"id":263201278,"title":"Netanyahu congratulates Trump on his \"huge victory\"","text":"Netanyahu congratulates Trump on his \"huge victory\"\n Israeli Prime Minister Benjamin Netanyahu was effusive in his praise for President-elect Donald Trump's election win, calling it \"history's greatest comeback.\" Holly Williams reports from Tel Aviv.","summary":"Israeli Prime Minister Benjamin Netanyahu was effusive in his praise for President-elect Donald Trump's election win, calling it \"history's greatest comeback.\" Holly Williams reports from Tel Aviv.","url":"https://www.cbsnews.com/video/netanyahu-congratulates-trump-on-his-huge-victory/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/07/be90790f-1a0d-48b3-816d-79294a5dc55f/thumbnail/1200x630/81970941b16c62a9a54ba555098bf71a/1106-en-williams.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:51:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":1},{"id":263201228,"title":"How the Trump transition team will tackle his return to the White House","text":"How the Trump transition team will tackle his return to the White House\n When Donald Trump was elected president in 2016, he didn't expect to win and had to rely on the Republican establishment to fill jobs in his administration. That won't be the case this time around. Robert Costa has more.","summary":"When Donald Trump was elected president in 2016, he didn't expect to win and had to rely on the Republican establishment to fill jobs in his administration. That won't be the case this time around. Robert Costa has more.","url":"https://www.cbsnews.com/video/how-the-trump-transition-team-will-tackle-his-return-to-the-white-house/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/07/c38f0a8d-8560-44bb-8281-31d33a84ea4e/thumbnail/1200x630/cad6d770d8893b723fb28bbf3a120cf2/1106-en-costa.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:50:50","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.397},{"id":263200994,"title":"The return of ScoMo: How Trump's victory could see Scott Morrison make a shock political comeback","text":"The return of ScoMo: How Trump's victory could see Scott Morrison make a shock political comeback\n\nDonald Trump's comeback likely to lead to Scott Morrison's \n\nREAD MORE: Kamala Harris finally concedes election to Donald Trump hours after his sweeping win\n\nBy Padraig Collins For Daily Mail Australia\n\nPublished: 00:50 GMT, 7 November 2024 | Updated: 00:50 GMT, 7 November 2024\n\nDonald Trump's extraordinary return to the White House could be followed by an even more unlikely political comeback - Scott Morrison's.\n\nIn January, Mr Morrison resigned from politics and announced he would be moving to Washington to work at political advisory group American Global Strategies (AGS), where he is vice-chairman. \n\nAGS was co-founded and chaired by Robert O'Brien, who was National Security Advisor to then-president Mr Trump from 2019 to 2021. \n\nThis connection will become significant when Mr Trump is sworn in as President in January and the Albanese government seeks to leverage any influence it can, including Mr Morrison's relationships. \n\nThese alliances are vital, given Prime Minister Anthony Albanese was recorded saying Mr Trump 'scares the s*** out of me' while he was shadow minister for transport and infrastructure in 2017. \n\nAustralia's US Ambassador Kevin Rudd has reportedly been encouraging Mr Morrison to prepare the ground for Australia's response to a Trump victory.\n\nIn October, former prime minister Mr Morrison met former and now future president Mr Trump in New York, then a day later former prime minister Mr Rudd launched Mr Morrison's book Plans For Your Good at the Australian embassy in Washington.\n\nMany of Mr Trump's former colleagues, including former secretary of state Mike Pompeo and close advisor Kellyanne Conway attended the book launch. \n\nDonald Trump's extraordinary comeback to win the US presidential election could be about to be mirrored by an even more unlikely political comeback - Scott Morrison's. They are pictured\n\nMr Morrison congratulated Mr Trump on his election win in a post to X (pictured)\n\nBREAKING NEWS\n\nAnthony Albanese breaks silence about whether he will apologise to Donald Trump\n\nVice-president Mike Pence was also in attendance, but he won't be of much use to Australia since falling out with Mr Trump for refusing instructions to block Joe Biden as the incoming president in January 2021.\n\n'The book launch was a very public demonstration by Rudd that he and Morrison have put aside their differences and that the two can work together in Australia's interests,' an Australian government insider told the Saturday Paper.\n\nMr Rudd's own immediate future will be less certain after Mr Trump is sworn in as the 47th US president on January 20.\n\nMr Trump has previously suggested Mr Rudd may not get to keep his ambassador role when questioned by right wing UK politician Nigel Farage on GB News. \n\n'Things have changed in Australia. We've got a Labor government. The previous ambassador, Joe Hockey, I think was quite a good friend of yours. Now they've appointed Kevin Rudd,' Mr Farage said.\n\n'He has said the most horrible things; you were a destructive president, a traitor to the West, and he's now Australia's ambassador in Washington.'\n\nMr Trump snapped back: 'I don't know, he won't be there long if that's the case.\n\n'I don't know much about him. I heard he was a little bit nasty. I hear he's not the brightest bulb. If he is at all hostile, he will not be there for long.'\n\nAnthony Albanese (right) was recorded saying Mr Trump 'scares the s*** out of me' while he was shadow minister for transport and infrastructure in 2017\n\nJenny and Scott Morrison are pictured with Donald and Melania Trump in September 2019\n\nMr Morrison is on far better terms with the incoming US president, saying on Wednesday that it would lead to a 'rejuvenation of the US economy' and that Mr Trump had given a 'stellar' performance in the election campaign. \n\nHis prime ministership coincided with Mr Trump's first presidency from 2018 to 2021, with Mr Morrison sharing effusive praise for the leader.\n\n'The US is an entrepreneurial animal... and I think we'll see great confidence come into that economy,' he said.\n\nBut, Mr Morrison also had some praise for his Mr Rudd, saying his former rival had been 'building those relationships across the aisle' and should continue in his role. \n\nBefore he became prime minister, Anthony Albanese criticised Mr Morrison for being too close to Mr Trump.\n\n'Scott Morrison went too far – partly out of his affinity with Donald Trump, partly because of the political constituency they share,' Mr Albanese said in early 2021.\n\n'There is no doubt Mr Morrison put this affinity and his political interests first when he effectively went on a campaign rally stage with Donald Trump in Ohio (during the 2020 US presidential election campaign).'\n\nOne way or another, Mr Albanese and his Labor government will be hoping that Mr Morrison can help heal its fractured relationship with Mr Trump.\n\nShare or comment on this article:\nThe return of ScoMo: How Trump's victory could see Scott Morrison make a shock political comeback\n\nAdd comment","summary":"Donald Trump's extraordinary return to the White House could be followed by an even more unlikely political comeback - Scott Morrison's.","url":"https://www.dailymail.co.uk/news/article-14050751/Donald-Trump-Scott-Morrison-political-comeback.html","image":"https://i.dailymail.co.uk/1s/2024/11/06/21/91776257-0-image-m-19_1730928870733.jpg","video":null,"publish_date":"2024-11-07 00:50:16","author":"Editor,Padraig Collins","authors":["Editor","Padraig Collins"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.107},{"id":263201950,"title":"What to know about Trump's mass deportation plan","text":"What to know about Trump's mass deportation plan\n Mass deportation is a pillar of President-elect Donald Trump's immigration policy plans for his second term. CBS News immigration and politics reporter Camilo Montoya-Galvez explains what the operation could look like.","summary":"Mass deportation is a pillar of President-elect Donald Trump's immigration policy plans for his second term. CBS News immigration and politics reporter Camilo Montoya-Galvez explains what the operation could look like.","url":"https://www.cbsnews.com/video/know-trumps-mass-deportation-plan/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/07/a81c9f4a-11e9-45df-89e8-4bc6ab7a937b/thumbnail/1200x630/8a33e055cacafcaf905d692440de4fff/cbsn-fusion-know-trumps-mass-deportation-plan-thumbnail.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:49:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.182},{"id":263201232,"title":"What fueled Trump's victory and where Harris underperformed","text":"What fueled Trump's victory and where Harris underperformed\n President-elect Donald Trump's victory saw him win support from many different demographics, while Vice President Kamala Harris lost support among Latino voters. Major Garrett digs into the numbers.","summary":"President-elect Donald Trump's victory saw him win support from many different demographics, while Vice President Kamala Harris lost support among Latino voters. Major Garrett digs into the numbers.","url":"https://www.cbsnews.com/video/what-fueled-trumps-victory-and-where-harris-underperformed/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/07/0e9d5731-273a-4ad6-b06e-9e43cbe93829/thumbnail/1200x630/6024c2a5e221823d8470420c73dec59c/1106-en-garrett.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:48:52","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.119},{"id":263202228,"title":"Donald Trump win to test limit of presidential power; Kamala Harris concedes but vows 'fight'","text":"PALM BEACH, Florida/WASHINGTON: Donald Trump recaptured the White House with a sweeping victory on Wednesday as tens of millions of Americans looked past his criminal charges and divisive rhetoric to embrace a leader who, if he carries out his campaign promises, will test the limits of presidential power. Trump, 78, clinched Tuesday's election after a polarizing and dizzying campaign marked by two attempts on his life and Kamala Harris' late entry into the race following President Joe Biden's surprise withdrawal. In a concession speech at her alma mater Howard University on Wednesday afternoon, Harris sought to console the voters who had hoped she would become the first woman to win the White House. To everyone who is watching, do not despair, she said. This is not a time to throw up our hands. This is a time to roll up our sleeves. Harris said she had called Trump to congratulate him and promised to aid his transition. But she was not prepared to embrace his vision for the country. While I concede this election, I do not concede the fight that fueled this campaign, she said, as some supporters in the crowd shed tears. The fight for freedom, for opportunity, for fairness and the dignity of all people. Biden planned to address the nation on Thursday. Trump's resounding victory underscored how disenchanted Americans had become with the economy, border security and the direction of the country and its culture. Voters demanded a change, even if the agent of change was a convicted felon twice impeached and no longer the Washington outsider he was in his 2016 campaign. Trump has said he wants the authority to fire civil servants he views as disloyal and has vowed to use federal law enforcement agencies to investigate or prosecute perceived enemies, including political rivals. Trump and his incoming vice president, U.S. Senator JD Vance, are due to take office on Inauguration Day, Jan. 20. He promised roles in his administration to Tesla CEO Elon Musk, the world's richest man and a prominent Trump donor, and former presidential candidate Robert F. Kennedy Jr. The outcome defied polls that showed a razor-close race ahead of Tuesday's Election Day. Trump prevailed in at least five of the seven battleground states to push him over the 270 Electoral College votes needed to win the presidency and was leading in the remaining two, Arizona and Nevada, where votes were still being tallied. Trump was also on track to become the first Republican presidential candidate to win the popular vote since George W. Bush two decades ago. His fellow Republicans wrested control of the U.S. Senate from Democrats and had added to their narrow majority in the U.S. House of Representatives, though the outcome there may not be known for several days with dozens of races still uncalled. It was a hell of a good day, said Mitch McConnell, the longtime Senate Republican leader. Unified Republican control on Capitol Hill would clear the way for major portions of Trump's legislative agenda, as it did in the first two years of his 2017-2021 presidency when Republicans whipped a major tax-cut bill through Congress that mainly benefited the wealthy. America has given us an unprecedented and powerful mandate, Trump said early on Wednesday to a roaring crowd at the Palm Beach County Convention Center in Florida. Major stock markets around the world rallied following Trump's victory, and the dollar was set for its biggest one-day jump since 2020. OVERCOMING ODDS Trump was elected despite persistently low approval ratings, four criminal indictments and a civil judgment against him for sexual abuse and defamation. In May, Trump became the first former U.S. president to be convicted of a crime when a New York jury found him guilty on 34 felony counts of falsifying business records to cover up hush money paid to a porn star. Trump's political career appeared over after his false claims of election fraud led a mob of supporters to storm the U.S. Capitol on Jan. 6, 2021, in a failed bid to overturn his 2020 defeat. His efforts to reverse his defeat led to two separate indictments, though all the criminal cases against him are expected to end after his victory. Trump swept away challengers inside his party and then beat Harris by capitalizing on voter concerns about high prices and what Trump claimed falsely was a rise in crime due to illegal immigration. Trump's win will have major implications for U.S. trade and climate change policies, Americans' taxes and immigration, and U.S. foreign policy, including in the Middle East and Ukraine. Israeli Prime Minister Benjamin Netanyahu congratulated Trump, and they discussed the Iranian threat and the need to work together for Israel's security, Netanyahu's office said. Hamas, the Palestinian militant group, called for an end to the blind support for Israel from the United States. Ukrainian President Volodymyr Zelenskiy welcomed Trump's commitment to peace through strength, while the Kremlin said it would wait and see if his victory could help end the war in Ukraine more quickly. Trump had said he could end the war in 24 hours but has not offered a detailed plan. Trump's tariff proposals could spark a fiercer trade war with China and U.S. allies, while his pledges to reduce corporate taxes and implement a spate of new cuts could balloon U.S. debt, economists say. A second Trump presidency could drive a bigger wedge between Democrats and Republicans on issues such as immigration, race, gender and reproductive rights. Trump has promised to launch a mass deportation campaign targeting immigrants in the country illegally. Hispanics, traditionally Democratic voters, and lower-income households hit hardest by inflation helped fuel the victory. Trump's support among women, whose backing Democrats had counted on, improved from four years ago. And his loyal base of rural, white and non-college educated voters again showed up in force, according to Edison Research exit polls. Meanwhile, many Democratic-leaning voters appear to have stayed home this year. The number of votes cast in counties that supported Trump in 2020 and where nearly all ballots have been tallied grew by almost 2% this year, while votes cast in counties that supported Biden four years ago dropped almost 5%.","summary":"Defying all odds and overcoming multiple controversies, Donald Trump has been re-elected as the President of the United States. Trump's victory signals a stark shift in the American political landscape, with voters choosing him despite his criminal charges and divisive rhetoric.","url":"https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-win-to-test-limit-of-presidential-power-kamala-harris-concedes-but-vows-fight/articleshow/115035020.cms","image":"https://img.etimg.com/thumb/msid-115035028,resizemode-4,width-1200,height-900,imgsize-136130,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-11-07 00:48:44","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":0.231},{"id":263201180,"title":"New York Democrat rips 'far left' for Trump victory: 'Ivory-towered nonsense'","text":"A Democratic congressman from New York recently blamed progressives for President-elect Trump's victory this week, arguing that far-left causes actually disenchant certain voters. Rep. Ritchie Torres, D-N.Y., claimed that his party has \"alienated historic numbers\" of minority voters in an X (former Twitter) post on Wednesday. Torres, a vocal supporter of Israel, pointed fingers at pro-Palestinian protests as one of the causes – as well as the movement to defend police. \"Donald Trump has no greater friend than the far left, which has managed to alienate historic numbers of Latinos, Blacks, Asians, and Jews from the Democratic Party with absurdities like 'Defund the Police' or ‘From the River to the Sea’ or ‘Latinx,’ Torres wrote. \"There is more to lose than there is to gain politically from pandering to a far left that is more representative of Twitter, Twitch, and TikTok than it is of the real world,\" the Democrat added. \"The working class is not buying the ivory-towered nonsense that the far left is selling.\" MONTAGE: LIBERAL MEDIA PUNDITS PREDICTED KAMALA HARRIS VICTORY Torres' comments came in the aftermath of the initial 2024 election results, which found that Vice President Harris had less favorability among Latino and Hispanic voters than President Biden did in 2020. According to a Fox News Voter Analysis, Biden garnered 63% of Latino support in 2020 while Harris only had 54% this year. Another Fox News Voter Analysis found that support for Trump among Latino and Hispanic voters jumped from 35% in 2020 to 41% in 2024. HARRIS WILL NOT SPEAK FROM HOWARD UNIVERSITY ON ELECTION NIGHT AS PLANNED The shift came days after the Trump campaign was criticized for hosting comedian Tony Hinchcliffe at a high-profile Oct. 27 rally at Madison Square Garden in New York City. The comedian made an inflammatory joke about Puerto Rico being a \"floating island of garbage,\" prompting an outcry. Rep. Alexandria Ocasio-Cortez, D-N.Y., attempted to use Hinchliffe's joke as an opportunity to sway the Latino community shortly after he uttered the remark. CLICK HERE TO GET THE FOX NEWS APP \"That's just what they think about you,\" the congresswoman said during a Twitch stream. \"It's what they think about anyone who makes less money than them. It's what they think about the people who serve them food in a restaurant. It's what they think about the people who, who fold their clothes in a store.\"","summary":"Rep. Ritchie Torres, D-N.Y., blamed far-left Democrats for Trump&apos;s presidential victory, writing on Tuesday that progressive causes alienated crucial minority voters.","url":"https://www.foxnews.com/politics/new-york-democrat-rips-far-left-trump-victory-ivory-towered-nonsense","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/copy-of-right-inset-40.png?ve=1&tl=1","video":null,"publish_date":"2024-11-07 00:48:37","author":"Andrea Margolis","authors":["Andrea Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.284},{"id":263202224,"title":"'Peaceful transfer of power...': Kamala Harris' subtle dig at Donald Trump in concession speech","text":"Kamala Harris, the Democratic candidate in the US presidential election, conceded defeat to Republican President-elect Donald Trump in what was one of the most hard-fought races for the White House in American history. In her first post-election address to supporters, the outgoing Vice President emphasised that the administration would ensure a peaceful transfer of power, indirectly referring to Trump’s refusal to vacate the White House following his loss in the 2020 election.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/peaceful-transfer-of-power-kamala-harris-subtle-dig-at-donald-trump-in-concession-speech/videoshow/115035018.cms","image":"https://img.etimg.com/thumb/msid-115035018,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-115035018,imgsize-57008.cms","publish_date":"2024-11-07 00:48:32","author":"Et Online","authors":["Et Online"],"language":"en","source_country":"in","sentiment":-0.475},{"id":263200486,"title":"Kyodo News Digest: Nov. 7, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nWASHINGTON - Former President Donald Trump marked a landslide victory in Tuesday's U.S. presidential election, defeating Democratic Vice President Kamala Harris in key battleground states.\n\nTrump's victory sets up the Republican for a return to the White House in January following a four-year hiatus, foiling Harris' bid to become the first female, the first Black woman and first Asian American U.S. president.\n\nTOKYO - Donald Trump's win in the U.S. presidential election has raised the prospect of a tariff-fueled global trade war that may be damaging to Japan and many of Washington's closest allies, rather than dealing a blow to just his main target -- China.\n\nTrump, who was in office between 2017 and 2021, and his Democratic opponent in Tuesday's election, Vice President Kamala Harris, differed significantly in their campaign proposals on issues ranging from abortion and immigration to wars in the Middle East and Ukraine.\n\nJapan real wages in September fall 0.1% on year\n\nTOKYO - Japan's real wages fell 0.1 percent in September from a year earlier, marking the second consecutive monthly decline, as salary growth failed to keep pace with higher prices, government data showed Thursday.\n\nInflation-adjusted wages at workplaces with five or more employees -- a barometer of consumer purchasing power -- dropped for the first time in three months in August as the boost from summer bonuses waned.\n\nTOKYO - Survivors of the U.S. atomic bombings of Hiroshima and Nagasaki in Japan on Wednesday expressed concerns that former President Donald Trump, who has won the U.S. presidential election, would be passive about global nuclear abolition and called for the incoming leader to embrace a nuclear-free world.\n\n\"Trump may believe that the world is stable because of nuclear weapons,\" said Toshiyuki Mimaki, 82, who heads the Hiroshima Prefectural Confederation of A-bomb Sufferers Organizations. \"It's difficult to predict in which direction the United States will move, but as hibakusha, we just want him to aim for a world without nuclear weapons.\"\n\nS. Korea congratulates Trump, China \"respects\" Americans' choice\n\nSEOUL/BEIJING - South Korean President Yoon Suk Yeol on Wednesday congratulated Donald Trump on winning the U.S. presidential race, while the Chinese government said it respects the choice of American voters.\n\n\"Under your strong leadership, the future of the ROK-U.S. alliance and America will shine brighter,\" Yoon said in a post on the X social media platform, referring to the Republic of Korea, South Korea's official name.\n\nChina, Myanmar leaders agree to deepen cooperation\n\nBEIJING - Chinese Premier Li Qiang and Myanmar's commander-in-chief, Senior Gen. Min Aung Hlaing, agreed Wednesday to deepen bilateral cooperation during the junta leader's first visit to China since the 2021 overthrow of his country's civilian government, Chinese state-run media said.\n\nLi told the junta leader in Kunming, the capital of the southwestern province of Yunnan, that strengthening relations with Myanmar is vital to China's diplomacy with its neighboring countries. He vowed support for Myanmar's development path that \"suits its national conditions,\" China Central Television said.\n\nVideo: Autumn foliage test illumination at Kyoto temple","summary":"A test illumination is held at Eikando Zenrinji temple in Kyoto on Nov. 6, 2024, ahead of its s...","url":"https://english.kyodonews.net/news/2024/11/a071c95849e0-kyodo-news-digest-nov-7-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/bea60735c1495cd1bc96fd00ac310e33/image_l.jpg","video":null,"publish_date":"2024-11-07 00:47:35","author":null,"language":"en","source_country":"jp","sentiment":0.242},{"id":263201230,"title":"Trump's political comeback and what could come next","text":"Trump's political comeback and what could come next\n President-elect Donald Trump pulled off a political comeback with the help of an expansive base of support and despite a campaign filled with false and offensive rhetoric. In claiming victory, Trump said that \"America has given us an unprecedented and powerful mandate.\" Caitlin Huey-Burns reports.","summary":"President-elect Donald Trump pulled off a political comeback with the help of an expansive base of support and despite a campaign filled with false and offensive rhetoric. In claiming victory, Trump said that \"America has given us an unprecedented and powerful mandate.\" Caitlin Huey-Burns reports.","url":"https://www.cbsnews.com/video/trumps-political-comeback-and-what-could-come-next/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/07/596b945e-558a-46b6-b151-60a4f9dcb023/thumbnail/1200x630/8d556e7cf8561d174e8539b6d08e67d8/1106-en-chb.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:47:00","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.419},{"id":263201234,"title":"Harris delivers concession address after Trump victory","text":"Harris delivers concession address after Trump victory\n Vice President Kamala Harris delivered a concession address Wednesday from her alma mater Howard University after she called President-elect Donald Trump and congratulated him on his victory. Harris told supporters she was \"so proud of the race we ran and the way we ran it.\" Nancy Cordes reports from Washington.","summary":"Vice President Kamala Harris delivered a concession address Wednesday from her alma mater Howard University after she called President-elect Donald Trump and congratulated him on his victory. Harris told supporters she was \"so proud of the race we ran and the way we ran it.\" Nancy Cordes reports from Washington.","url":"https://www.cbsnews.com/video/harris-delivers-concession-address-after-trump-victory/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/07/69f73592-4b9d-4911-852b-9dee20cdfd78/thumbnail/1200x630/13ded9773b2456f2d3d7eb791c2a6103/1106-en-cordes.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-07 00:46:00","author":null,"language":"en","source_country":"us","sentiment":0.006},{"id":263201000,"title":"Donald Trump will dismiss Keir Starmer as a 'lightweight woke lefty' and a negotiating 'novice', warns top US analyst who says the PM should now sack David Lammy","text":"Donald Trump will view Keir Starmer as a 'lightweight woke lefty' and will not trust him, a top US analyst has warned.\n\nNile Gardiner, director of The Heritage Foundation's Margaret Thatcher Center for Freedom, told DailyMail.com that the President-elect would see the Prime Minister as a 'novice' when it comes to negotiating.\n\nThe Labour leader is currently 'in the dog house' after dozens of Labour activists flew to the US to help Democratic candidate Kamala Harris in the election.\n\nMr Gardiner said that relations are so bad Sir Keir might not even be welcome at Mr Trump's Florida estate were he to fly there and kiss the ring.\n\nBut he could start by sacking his foreign secretary David Lammy, who has called the President-elect a 'serial liar' and a 'wannabe despot' in the past.\n\nThe incident with Labour activists in the final weeks of the US election, which Mr Trump won convincingly, led the Trump campaign to file a complaint with the American election regulator, the FEC.\n\nSir Keir tried to patch things over with Mr Trump by pointing to the dinner they shared in New York in September.\n\nAnd after Mr Trump's surprise landslide against Ms Harris, the Prime Minister has talked about how 'crucial' a strong US / UK relationship is.\n\nMr Gardiner however said there would be 'significant tensions ahead' when it came to Britain and America.\n\nThe 'Special Relationship' would come under strain because Sir Keir 'represents a socialist worldview and agenda that's an anathema to Trump'.\n\nMr Gardiner said: 'I do not think Donald Trump will trust Keir Starmer at all.\n\n'I think he will view Starmer and the Labour government in many respects as problematic.'\n\nThe two men are likely to clash over the Middle East with Labour recently banning some arms sales to Israel while Mr Trump will be one of the country's strongest supporters.\n\nThe same dynamic will play out with regards to Israeli attacks on Iran which Labour are more cautious about.\n\nOn climate there are big differences too and even on Brexit, Sir Keir is far softer than Mr Trump.\n\nMr Gardiner said: 'Mr Trump will hold Starmer's feet to the fire on Brexit. Trump intensely dislikes supranationalism and has a sceptical view of the EU.'\n\nThere is also a breakdown on a personal level too, despite the two-hour charm offensive Sir Keir deployed over dinner in September.\n\n'Mr Trump will view Starmer as lightweight and as a novice on the international stage,' Mr Gardiner said.\n\n'He will view Starmer as a woke lefty and Trump doesn't like woke lefties'.\n\nBut the biggest divide may well be the more than 100 Labour activists who flew to the US to campaign on behalf of Ms Harris.\n\nIn the complaint to the FEC, the Trump campaign demanded an inquiry into 'immediate investigation into blatant foreign interference'.\n\nThe complaint cited a now-deleted post on LinkedIn by Sofia Patel, head of operations at the Labour Party, which said 100 staffers were going to be working in battleground states like North Carolina and Nevada.\n\nThe six page document cited a report in the Telegraph which said staffers from Labour would have to be on holiday and be paying their own way.\n\nRules about foreigners working in US elections are strict and state that they must volunteer and cannot receive any payment.\n\nMr Gardiner said: 'This is an extremely serious matter and hugely damaging to Sir Keir in terms of his relationship with Trump and the Trump administration.\n\n'Sir Keir underestimated the damage this has caused and clearly he thought Harris would win.\n\n'That may explain why the Prime Minister Starmer handled it very badly. He should have apologised and called his Labour activists back to the UK. He didn't do that. That was a big mistake.\n\n'There are going to be significant implications from this: the Trump administration won't trust Sir Keir and Labour and will view them as adversarial and batting for the other side.\n\n'The damage for the UK is very, very significant here. It should not be underestimated.'\n\nMr Gardiner predicted there would be Congressional hearings on the use of Labour activists, not least because Republicans have won back control of the Senate with the House still to play for.\n\n'I think Keir Starmer is in the dog house right now and I'm not sure he would be welcome at Mar-a-Lago right now,' Mr Gardiner said.\n\n'Sir Keir is viewed as part and parcel of the Harris operation'.\n\nFiring Mr Lammy for his 'vicious' attacks on Mr Trump would be a start, Mr Gardiner said.\n\nAmong the barbs directed at Mr Trump by Mr Lammy on social media include the quip: 'If Trump did GCSEs he wouldn't make it to sixth form.'\n\nMr Lammy has said that Mr Trump is a 'neo-Nazi-sympathising sociopath' and mocked him as a 'troll' who is 'truly beneath contempt'.\n\nNow that same man will be sitting at the table with Mr Lammy talking about Britain's future relationship with the US.\n\nMr Gardiner said: 'The smartest thing would be to sack David Lammy and apologise for the intervention by Labour staffers.\n\n'But I'm in no doubt that it will be practically impossible for Sir Keir to work with the Trump Presidency'.","summary":"Nile Gardiner, Director of The Heritage Foundation's Margaret Thatcher Center for Freedom, said that the President-elect will see the Prime Minister as a 'novice' when it comes to negotiating.","url":"https://www.dailymail.co.uk/news/article-14051471/donald-trump-keir-starmer-woke-lefty-analyst-warns.html","image":"https://i.dailymail.co.uk/1s/2024/11/07/00/91779633-0-image-m-81_1730940002580.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/06/8234531159518236231/1024x576_MP4_8234531159518236231.mp4","publish_date":"2024-11-07 00:45:47","author":"Daniel Bates,Editor","authors":["Daniel Bates","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.203},{"id":263201252,"title":"Portland police chief says bureau will ‘remain vigilant’ for further election-related demonstrations","text":"Following a relatively quiet Election Day in Portland, Police Chief Bob Day said the Police Bureau remains ready for any unrest that could occur through the weekend.\n\n“We’re going to remain vigilant,” Day said Wednesday afternoon. “But that plan is always flexible and adaptable.” \n\nIt’s not clear what impact, if any, former President Donald Trump’s projected win against Vice President Kamala Harris will have when it comes to possible large-scale demonstrations in the city. Trump has inflamed tensions in Portland in the past, verbally sparring with Mayor Ted Wheeler. This past summer, he called Portland “destroyed,” asserting that the city hasn’t recovered from the aftermath of the 2020 racial justice protests. \n\nNone of those pressures seemed to factor in Tuesday night, as police hovered around a gathering that took place near Chapman and Lownsdale squares right behind the Police Bureau’s Central Precinct. It remained peaceful, allowing officers to turn their attention to other matters. For example, officers who were out and about led 16 people caught with illegal drugs into deflection, Day said.\n\nAlso on Tuesday, police responded to a search for an armed robbery suspect in Southeast Portland and a street takeover in North Portland. Two people were arrested in the takeover.\n\nDay said police are aware of a possible event planned for Pioneer Courthouse Square on Wednesday night and will monitor that. Officers are working 12-hour shifts on Wednesday and through the weekend to address any potential conflicts. \n\n“It doesn’t mean that 24 hours or 48 hours or 72 hours from now, new information may change that,” he said. “But for right now, we’re going to stay the course.”\n\nDay acknowledged the toll the long hours have on officers and called the shifts an “expensive endeavor.” The Police Bureau had requested up to $2.3 million to cover projected overtime costs related to protests. Day also said the Police Bureau would adopt similar measures in the future if heightened tensions return.\n\n“We also know that we face an uncertain election season, as we transition into Jan. 6 and the inauguration,” Day said. “So there could be a need for future responses similar to this.”\n\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221- 4323, zshaikh@oregonian.com or on X @zaeemshake.","summary":"Police Chief Bob Day said the bureau would continue to monitor downtown for protests through the weekend.","url":"https://www.oregonlive.com/crime/2024/11/portland-police-chief-says-bureau-will-remain-vigilant-for-further-election-related-demonstrations.html","image":"https://www.oregonlive.com/resizer/v2/B7CG3MS4RRBTJDXP4GCPZI7OBY.jpg?auth=3cf792042e6f550a2482a5378b51fb737abb1c5722a1706f4fd22172a4c46a5a&width=1280&quality=90","video":null,"publish_date":"2024-11-07 00:45:41","author":"Zaeem Shaikh","authors":["Zaeem Shaikh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.055},{"id":263201440,"title":"Social media speculates about Donna Brazile and Nancy Pelosi’s animated exchange at Harris concession speech","text":"Pelosi, dressed in a red pantsuit, was seen pointing and waving her hands around as she had an intense conversation with Brazile while Bowser stood listening to the lively exchange. Brazile was also seen using her hands as she spoke to Pelosi.\n\nFormer House Speaker Nancy Pelosi, Washington D.C. Mayor Muriel Bowser and Democrat strategist Donna Brazile appeared to have an animated discussion at Vice President Kamala Harris's concession speech.What do you think the three were chatting about?#nancypelosi #murielbowser… pic.twitter.com/Rfeu1bGFXu— Washington Examiner (@dcexaminer) November 6, 2024\n\nIn late October, Brazile spoke to a symposium for black women in Pittsburgh to encourage women to vote for Harris.\n\nThe exchange happened between the three women on the day following a historic win by Republican rival and President-elect Donald Trump, leading to the defeat of Harris in the 2024 presidential election.\n\nNewsNation’s Kellie Meyer captured another angle of the exchange of the top Democrats.\n\nPelosi, DC Mayor Bowser, Donna Brazil? In intense convo ahead of Harris concession speech at Howard. pic.twitter.com/kR3OEVzyxm— Kellie Meyer (@KellieMeyerNews) November 6, 2024\n\nSocial media responded with their own mix of speculation and snark about what the discussion might have been between the Democratic power players following the defeat of Harris.\n\n“Democrats in disarray: Nancy Pelosi is arguing with Donna Brazile at the Kamala Harris defeat speech,” former Trump campaign adviser Steve Cortes speculated on X. \n\n“Looks like DC Mayor Muriel Bowser in the middle, looking for a chance to calm things down,” journalist Tom Sherwood reacted. \n\n“They’re conspiring to leave the inauguration unprotected again,” an X user said.\n\nSome X users made up snarky fake transcripts.\n\n“Brazile: ‘Those are YOUR fingerprints on the knife in Joe Biden’s back.’ Pelosi: ‘I wouldn’t have had to do it if YOU’D have given him the debate questions ahead of time like you did for Hillary,'” one person quipped. \n\n“The real answer is ‘yes’, Brazile is pissed that Pelosi couped Biden,” another person said on X.\n\nThis exchange during the vice president’s concession speech came as Democrats have been rationalizing why the Democrats lost on Tuesday.\n\nThe Washington Examiner reached out to Pelosi, Brazile, and Bowser for more information about the conversation.","summary":"Former House Speaker Nancy Pelosi (D-CA), Washington, D.C., Mayor Muriel Bowser, and Democratic strategist Donna Brazile were caught in an animated conversation as the crowd waited on Wednesday at Howard University for Vice President Kamala Harris to give her concession speech. Pelosi, dressed in a red pantsuit, was seen pointing and waving her hands around [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3221900/social-media-speculates-donna-brazile-and-nancy-pelosi-animated-exchange-at-harris-concession-speech/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Nancy-Pelosi-2.webp","video":null,"publish_date":"2024-11-07 00:45:20","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","source_country":"US","sentiment":-0.315},{"id":263201160,"title":"Project 2025 is the Trump agenda, Republicans are gleefully declaring","text":"Donald Trump and his presidential campaign have repeatedly denied any connection to Project 2025, a radical blueprint created by the far-right Heritage Foundation to entirely rebuild the executive branch of the federal government on a Christian nationalist foundation. But now that the election is over and Trump has won the White House, several far-right influencers allege that Project 2025 is Trump’s agenda.\n\nProject 2025 is so toxic its creator, Paul Dans, was eliminated from the project. Public opinion gives Project 2025 a single-digit approval rating, according to NBC News:\n\n“It was the least popular of all the subjects tested in the September NBC News poll — a battery that included socialism, capitalism, both presidential and vice presidential candidates, the Republican and Democratic parties, Taylor Swift and Elon Musk.”\n\nThe Project 2025 blueprint, a 900-page “manifesto,” according to The Guardian, “describes an America poisoned by ‘wokeness’ and overtaken by lawlessness and chaos, where conservatives need to seize power immediately – and for as long as possible – to right a sinking ship.”\n\nREAD MORE: Day One: Trump Planning ‘Largest Mass Deportation Operation’\n\nProject 2025 would effectively make abortion and contraception extremely difficult to obtain, would make pornography illegal, and elevate Christian nationalism throughout the government. It would eliminate the Dept. of Education. It would create a massive forced deportation program, removing possibly millions of undocumented immigrants from the U.S. And it would reduce efforts to improve diversity, while restricting and reducing LGBTQ rights and protections.\n\n“Republicans are now comfortable openly admitting that Project 2025 was the plan all along,” Rolling Stone reports after Trump won the election. “Sure enough, less than 24 hours after the election was called for Trump, his allies, advisers, and prominent supporters were celebrating the now-open road to Project 2025’s implementation.”\n\nMother Jones notes that after Trump won the White House, some of his “favorite fans finally felt comfortable joking about what the next president has long denied: Project 2025 has always been the plan for a second Trump term.”\n\nREAD MORE: The List of Who Donald Trump Has ‘Pledged to Punish,’ According to One of His Targets\n\nMatt Walsh, the far-right podcaster with millions of followers on several platforms, wrote: “Now that the election is over I think we can finally say that yeah actually Project 2025 is the agenda. Lol.”\n\nThe New Republic reports, “Project 2025 has begun. And Donald Trump’s allies are now openly celebrating it.”\n\n“Former White House chief strategist Steve Bannon, who was recently released from prison, responded on his live War Room podcast with one word: ‘Fabulous,'” TNR added. “Later during the livestream, Bannon could be seen holding a hard copy of the Heritage Foundation’s Project 2025 ‘Mandate For Leadership’ up to the camera in celebration. On election night, Bannon had vowed to eliminate Joe Biden, Kamala Harris, MSNBC, and the Justice Department in an unhinged rant.”\n\n“Now, you’re going to pay the price,” Bannon said.\n\nREAD MORE: ‘Be the Guardrails of Democracy’: Liz Cheney and Other Never-Trumpers Suggest Path Forward","summary":"Donald Trump and his presidential campaign have repeatedly denied any connection to Project 2025, a radical blueprint created by the far-right Heritage Foundation to entirely rebuild the executive branch of the federal government on a Christian nationalist foundation. But now that the election is over and Trump has won the White House, several far-right influencers allege that Project 2025 is Trump’s agenda.\n\nProject 2025 is so toxic its creator, Paul Dans, was eliminated from the project. Public opinion gives Project 2025 a single-digit approval rating, according to NBC News:\n\n“It was the least popular of all the subjects tested in the September NBC News poll — a battery that included socialism, capitalism, both presidential and vice presidential candidates, the Republican and Democratic parties, Taylor Swift and Elon Musk.”\n\nThe Project 2025 blueprint, a 900-page “manifesto,” according to The Guardian, “describes an America poisoned by ‘wokeness’ and overtaken by lawlessness and chaos, where conservatives n","url":"https://www.alternet.org/project-2025-trump-agenda/","image":"https://www.alternet.org/media-library/image.webp?id=54285539&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2024-11-07 00:45:02","author":"David Badash","authors":["David Badash"],"language":"en","category":"politics","source_country":"us","sentiment":-0.167},{"id":263200222,"title":"‘Keep Doing Your Best’: How Hollywood Agencies Are Addressing Staffers After Trump’s Win","text":"Hollywood’s top agencies are taking a head-on approach with staffers in the wake of Donald Trump’s victory over Kamala Harris. While Sunset Blvd. is a far cry from 1600 Penn., this year’s presidential election saw the lines between L.A. and D.C.’s biggest names blurred more than ever, with the agencies taking on more responsibility in […]","summary":"Hollywood&#8217;s top agencies are taking a head-on approach with staffers in the wake of Donald Trump&#8217;s victory over Kamala Harris. While Sunset Blvd. is a far cry from 1600 Penn., this year&#8217;s presidential election saw the lines between L.A. and D.C.&#8217;s biggest names blurred more than ever, with the agencies taking on more responsibility in [&#8230;]","url":"https://variety.com/2024/politics/news/hollywood-agencies-trump-election-win-1236203057/","image":"https://variety.com/wp-content/uploads/2024/11/GettyImages-2183337623-e1730930138506.jpg","video":null,"publish_date":"2024-11-07 00:45:00","author":"Katcy Stephan","authors":["Katcy Stephan"],"language":"en","source_country":"us","sentiment":0.047},{"id":263200148,"title":"Criticism of George Clooney for calling on Joe Biden to resign before Donald Trump wins the election","text":"George Clooney has been slammed by fans after he demanded that Joe Biden quit ahead of Donald Trump’s election victory on Tuesday. \n\nIn July, the Ocean’s Eleven actor, 63, notably penned an op-ed for the New York Times where he demanded Biden to drop out of the presidential race. \n\nLater that same month, the current 46th president of the United States announced his withdrawal of the presidential race, and Clooney soon backed Kamala Harris when she took his place. \n\nHowever, after months of campaigning from both parties, Donald J. Trump became the U.S. 47th president-elect after a major victory – currently holding 295 electoral votes and also winning the popular vote. \n\nSocial media users have since shared their thoughts on George urging Biden to step down from the race months earlier. \n\nA veteran-led, political commentator group called altNOAA typed on X, ‘Someone bring me George Clooney. We need to have a…talk.’ \n\nJournalist Joshua Hartley uploaded a screenshot of Clooney’s op-ed piece and added, ‘Thank you George Clooney.’ \n\nOne X user penned, ‘Trump should not forget to thank the Hollywood celebrities. Especially George Clooney.’ \n\nA fan of Donald Trump also referenced to the actor, and wrote, ‘It’s just occurred to me, we have failed to acknowledge George Clooney’s roll in this victory!’ \n\n‘What did George Clooney change his mind!!’ another fan shared, possibly referencing to the actor’s silence on social media following Trump’s win on Tuesday.\n\nAnother added on X, ‘I blame George Clooney he said no more money… and now look…’ \n\n‘Since I’m in a deep depression and feel like lashing out at someone, what’s the plan now George Clooney?’ one social media user typed out, while another simply added, ‘It’s all George Clooney’s fault!’ \n\nA professor at New York University named Laurence F. Maslon opened up to The Guardian in regards to celebrity endorsements.\n\n‘I think endorsements have probably always done more for the celebrity than the person being endorsed.’ \n\nMaslon added, ‘It’s a way to hitch your star to somebody who seems to be good for you, and maybe there’s a certain kind of reflected glory in that.’ \n\n‘There’s probably not a Republican candidate for any office in the last 20 years who didn’t append the word liberal before the word Hollywood when speaking about it…People like George Clooney and Robert De Niro, I mean, who cares, frankly?’ \n\nMargaretha Bentley, a professor at Arizona State University, also told the outlet, ‘In the academic literature, research has shown that, while celebrity endorsements can increase civic engagement and voter registrations, it has not proven to have a direct impact on how people make their voting decisions.’ \n\nShe also added, ‘Voters may do more research after a celebrity endorses, but they will vote based on their own values and not necessarily the values of the celebrity endorser.’ \n\nIt comes just months after Clooney wrote an op-ed calling for President Joe Biden to step aside. \n\nHe also first threw his support behind Harris in July – only two weeks after he said it was time to move on from Biden in the scathing article for the New York Times.\n\n‘President Biden has shown what true leadership is. He’s saving democracy once again,’ he said in a statement to CNN, two days after Biden made the extraordinary decision to drop out of the race.\n\nHe endorsed the Vice President to succeed him as the Democratic nominee to take on Trump, saying: ‘We’re all so excited to do whatever we can to support Vice President Harris in her historic quest.’\n\nBiden had faced an increasingly frenzied clamor to step aside after a disastrous debate performance against Trump in June.\n\nLess than a month before he dropped out of the race, Clooney had raised $30million at a fundraiser for Biden.\n\nHowever, the megastar, who hosted multiple fundraisers for Biden, wrote on July 10 that the president couldn’t win the ‘battle against time.’\n\nThe brutal opinion piece was seen as one of the turning points against Biden’s bid to cling onto the nomination in a bid to secure a second term.\n\nThe actor condemned Democratic party leaders for ignoring ‘every warning sign’ of Biden’s declining physical and mental health and for trying to defend his car-crash debate performance against Trump.\n\nHe added that Democrat voters ‘collectively hold our breath or turn down the volume whenever we see the president, who we respect, walk off Air Force One or walk back to a mic to answer an unscripted question.’\n\nAnd earlier this month ahead of the election, the actor doubled down on his endorsement of Kamala Harris in a campaign advertisement urging men to consider how voting for Donald Trump will affect the women in their lives.\n\nThe ad, released by left-wing Christian organization Vote Common Good, reminded men that they can lie to their Trump supporting friends about how they voted. \n\nAnd it also urged them to think about how their vote will ‘impact the people you care about the most’ before casting their ballots.\n\nThe clip followed a father and his masculine-looking friends into the polls as they encourage each other to ‘make America great again.’ \n\nClooney – who narrates the short video – then urged voters to think about their families and reminds them that ‘you can vote any way you want and no one will ever know’ before the man is seen voting for Harris.’ \n\nThe ad is the second released by Vote Common Good that encourages voters to hide their choices from their families or friends. \n\nThe first ad, starring Clooney’s Ocean’s Eleven co-star Julia Roberts, urged women to keep their votes secret from their husbands and was branded ‘nauseating’ and ‘condescending’ by critics.","summary":"George Clooney has been slammed by fans after he demanded that Joe&#8230;","url":"https://internewscast.com/news/us/criticism-of-george-clooney-for-calling-on-joe-biden-to-resign-before-donald-trump-wins-the-election/","image":null,"video":null,"publish_date":"2024-11-07 00:44:07","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.204},{"id":263200774,"title":"Kamala Harris Officially Acknowledges Defeat to Donald Trump in 2024 U.S. Presidential Election","text":"TEMPO.CO, Jakarta - Vice President of the United States and Democratic Party candidate Kamala Harris delivered a speech acknowledging her defeat to Donald Trump in the presidential election (2024 U.S. presidential election). The speech was given at her alma mater, Howard University on Wednesday evening.Thousands of people gathered at Howard University, Harris's alma mater, on Tuesday night to attend what they hoped would be a historic victory for the first woman to become president. They returned on Wednesday to show their support after her defeat.Greeted with cheers of 'Kamala, Kamala!', Harris acknowledged the election results and accepted her defeat. However, she vowed to 'not acknowledge the struggle that sparked this campaign', referring to her failed campaign to stop Donald Trump's return from the Republican Party to the White House.U.S. President-elect Donald Trump won 295 electoral college votes and captured the electoral college votes in the state of Michigan and also won in Alaska.\"Listen to me when I say: The light of America's promise will always shine bright as long as we never give up and as long as we keep fighting,\" said Harris.\"While I acknowledge this election, I will continue to support the struggle that sparked this campaign,\" she told her supporters.She promised to continue advocating for women's rights, combating gun violence, and \"fighting for the dignity that should be afforded to everyone.\"Harris mentioned having called President-elect Trump, congratulating him on his victory and promising a peaceful transition of power.Harris spoke in front of an audience consisting of former Speaker of the House Nancy Pelosi, aides at the White House during President Joe Biden's administration, and thousands of fans listening to the soundtrack of Beyonce's song \"Run the World (Girls)\" and Tye Tribbett's \"We Gon' Be Alright.\"Her running mate, Governor of Minnesota Tim Walz, joined the crowd.Harris topped the list of Democratic Party candidates in July after Biden stepped down, providing new enthusiasm and support for the Democratic candidate. However, the Indian-American female politician struggled to address voters' concerns about the economy and immigration.She suffered a major defeat, with Trump winning by a larger margin in most states compared to his performance in 2020. The Democratic Party even failed to secure battleground states crucial in determining the election results.REUTERSEditor's Choice: Prabowo Congratulates Donald Trump, Sees Potential in Indonesia-U.S. PartnershipClick here to get the latest news updates from Tempo on Google News","summary":"Kamala Harris delivers a speech admitting her defeat to Donald Trump in the 2024 U.S. presidential election","url":"https://en.tempo.co/read/1938095/kamala-harris-officially-acknowledges-defeat-to-donald-trump-in-2024-u-s-presidential-election","image":"https://statik.tempo.co/data/2024/11/01/id_1349855/1349855_720.jpg","video":null,"publish_date":"2024-11-07 00:43:17","author":"Tempo.co","authors":["Tempo.co"],"language":"en","category":"politics","source_country":"id","sentiment":0.16},{"id":263201046,"title":"Kemenangan Trump: PAS harap agenda keamanan diutamakan","text":"KUALA LUMPUR: Parti Islam Se-Malaysia (PAS) berharap dengan kemenangan Donald Trump dalam pilihan raya presiden 2024 untuk menduduki kerusi Presiden Amerika Syarikat (AS) ke-47, dunia akan mengalami tempoh yang bebas daripada konflik global.Ketua Penerangannya, Ahmad Fadhli Shaari berkata, ia terutamanya ketika dalam penggal kedua Presiden Trump, bermatlamat bagi memupuk kestabilan dan persefahaman di peringkat antarabangsa.\n\n“Bagi pihak PAS, saya ingin mengucapkan tahniah kepada Donald Trump atas pemilihan semula beliau sebagai Presiden Amerika Syarikat,” katanya dalam satu kenyataan.\n\nMenurutnya, sebagai parti pembangkang di Malaysia, PAS mengakui tidak mempunyai kaitan langsung dengan kempen presiden AS. \n\n“Bagaimanapun, kami berharap Presiden yang baru dilantik akan mengutamakan agenda berorientasikan keamanan, seperti yang ditekankan semasa kempen.\n\n“Justeru, kami menggesa Presiden Trump untuk tidak tunduk kepada tuntutan Israel di Timur Tengah, kerana ia boleh memupuk kebencian terhadap Amerika Syarikat dalam kalangan umat Islam, dan menyebabkan Amerika dilihat sebagai boneka kepentingan Israel,” katanya.\n\nTerdahulu, media antarabangsa melaporkan bahawa Trump, 78, yang memenangi pilihan raya presiden AS kali ini dan dipilih sebagai Presiden ke-47 sebagai kemunculan semula yang luar biasa bagi mantan yang dikatakan enggan menerima kekalahannya empat tahun lalu, mencetuskan pemberontakan ganas di Capitol AS, disabitkan dengan tuduhan jenayah, dan terselamat dalam dua percubaan bunuh.\n\nTrump sebelum ini menjadi presiden pertama dalam tempoh lebih daripada 120 tahun yang kehilangan tempat di Rumah Putih, dan kemudian kembali memenanginya semula, selepas perkara yang sama dialami Presiden Grover Cleveland pada 1892.\n\nAgensi berita AP melaporkan bahawa Trump telah memenangi 277 undi (70.9 peratus) manakala lawannya, Kamala Harris meraih 224 undi (47.5 peratus) daripada 270 undi iaitu ‘magic number’ yang diperlukan untuk diisytiharkan sebagai pemenang pilihan raya presiden AS 2024. – HARAKAHDAILY 7/11/2024","summary":"KUALA LUMPUR: Parti Islam Se-Malaysia (PAS) berharap dengan kemenangan Donald Trump dalam pilihan raya presiden 2024 untuk menduduki kerusi Presiden Amerika Syarikat (AS) ke-47, dunia akan mengalami tempoh yang bebas daripada konflik global. Ketua Penerangannya, Ahmad Fadhli Shaari berkata, ia terutamanya ketika dalam penggal kedua Presiden Trump, bermatlamat bagi memupuk kestabilan dan persefahaman di peringkat antarabangsa. [&#8230;]\n\n\nThe post Kemenangan Trump: PAS harap agenda keamanan diutamakan appeared first on Harakahdaily.","url":"https://harakahdaily.net/index.php/2024/11/07/kemenangan-trump-pas-harap-agenda-keamanan-diutamakan/","image":"https://harakahdaily.net/wp-content/uploads/2024/09/Ahmad-Fadhli.jpg","video":null,"publish_date":"2024-11-07 00:42:36","author":"Team Hd,Yusman Awang","authors":["Team Hd","Yusman Awang"],"language":"en","category":"politics","source_country":"my","sentiment":0.798},{"id":263201014,"title":"Harris concedes presidential election to Trump, calls for unity","text":"United States Democratic Presidential Candidate Kamala Harris has conceded the 2024 presidential election to Donald Trump, following a decisive victory for the Republican candidate.\n\nAccording to a senior aide, as reported by Al Jazeera, Harris called Trump on Wednesday to congratulate him and “discussed the importance of a peaceful transfer of power” and being a president for everyone in the country.\n\nIn her phone call, Harris reportedly expressed her commitment to unity, urging the country to come together.\n\nShe is scheduled to deliver remarks later today in Washington, D.C., marking her first public statement since her projected loss.\n\nTrump, who has surpassed the 270 electoral votes required to reclaim the presidency, returns to office as the 47th President of the United States after his 2020 defeat by Joe Biden.\n\nHis campaign found success among voters frustrated by economic concerns, high inflation, and immigration issues, which exit polls showed were key factors in shifting battleground states away from the Democrats.\nHarris’s historic candidacy followed Biden’s withdrawal from the race in July due to health concerns.\n\nAfter endorsing Harris, the 60-year-old Vice President led a vigorous campaign, focusing on issues such as economic recovery, reproductive rights, and inclusivity.\n\nHarris’s platform resonated with young voters, particularly women concerned about reproductive freedoms following the US Supreme Court’s recent decision to overturn constitutional protections for abortion.","summary":"United States Democratic Presidential Candidate Kamala Harris has conceded the 2024 presidential election to Donald Trump, following a decisive victory for the Republican candidate. According to a senior aide, as reported by Al Jazeera, Harris called Trump on Wednesday to congratulate him and “discussed the importance of a peaceful transfer of power” and being a [&#8230;]\n\n\nThe post Harris concedes presidential election to Trump, calls for unity appeared first on TheCitizen - It&#039;s all about you.","url":"https://thecitizenng.com/harris-concedes-presidential-election-to-trump-calls-for-unity/","image":"https://thecitizenng.com/wp-content/uploads/2024/11/Trump.jpg","video":null,"publish_date":"2024-11-07 00:41:50","author":"The Editor","authors":["The Editor"],"language":"en","category":"politics","source_country":"ng","sentiment":0.228},{"id":263200996,"title":"JOSH HAMMER: The early omen that Trump was headed for a landslide that you may have missed","text":"JOSH HAMMER: The early omen that Trump was headed for a landslide that you may have missed\n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nBy Josh Hammer For Dailymail.Com\n\nPublished: 00:35 GMT, 7 November 2024 | Updated: 00:41 GMT, 7 November 2024\n\nAt 5:00 PM EST Tuesday the Exit Polls started to trickle in.\n\nI flipped on the TV to hear Chris Wallace, the erstwhile Fox News anchor-turned-CNN analyst, soberly opine on a statistic showing a whopping 72 percent of Americans were either dissatisfied or angry about the direction of the country.\n\nIt would be a 'miracle,' said Wallace, if Harris can win 'with that kind of headwind.'\n\nCo-host Dana Bash scoffed. It wasn't clear which candidate, Donald Trump or Kamala Harris, would bear blame for America's problems, she argued.\n\nIndeed, it was too early to tell.\n\nI had expectations of a strong Trump showing, but even I lost my nerve a bit when the actual votes started coming in.\n\nPresident Trump is seen here arriving to speak at an election watch party in the early hours of Wednesday morning in West Palm Beach, Florida\n\nIt would be a 'miracle,' said Wallace, right, if Harris can win 'with that kind of headwind.' Pictured with his co-host Dana Bash\n\nIn the majority-Hispanic Miami-Dade County, seen here on polling day, Trump was winning by a double-digit margin\n\nMy adopted home state of Florida was one of the first to start reporting results.\n\nAt 8:01 pm, the Associated Press called the longtime Democratic stronghold of Miami-Dade County in the state's southeast. A Republican presidential candidate hadn't won there since George H.W. Bush in 1988.\n\nAcross the state, Trump was dramatically overperforming his 2020 results in the Sunshine State, winning with a margin closer to Florida Governor Ron DeSantis's massive 2022 statewide romp.\n\nIn the majority-Hispanic Miami-Dade County, Trump was winning by a double-digit margin. He was prevailing in blue Hillsborough County, where the city of Tampa lies and was running neck-and-neck in ritzy, elite Palm Beach County (where he lives).\n\nTrump considerably outperformed his RealClearPolitics average of polling in Florida, which had him winning by eight percentage points. (Today, he's projected to win by more than 13 points).\n\nConservative causes on the ballot also won: A proposed measure to codify abortion into the Florida Constitution failed as did a pro-marijuana measure that had been widely expected to pass.\n\nIt was a red wave in Florida – but how far would the tide carry Trump and the Republicans?\n\nRural counties across the South and Midwest began to report. It became clear that Trump was overperforming elsewhere too – and Harris was trailing. Black voter turnout in the major metro areas, such as Atlanta and Charlotte, was lower than Team Harris had banked on.\n\nTrump considerably outperformed his RealClearPolitics average of polling in Florida, which had him winning by eight percentage points\n\nBefore a single swing state was called, Democratic campaign guru James Carville (pictured) sounded the alarm\n\n'Let me just give you a gut check about what we are hearing from… the Harris headquarters,' reported CNN's Abby Phillips as the night rolled on. 'I think the operative word right now is silence. There's not a lot being said, because the Harris team appears to be searching for bright spots in the map.'\n\nThe lights were blinking red.\n\nIt became apparent that Harris was also struggling to match Biden's vote count in the Commonwealth of Virginia. The Old Dominion was not supposed to be in play. Then, before a single swing state was called, Democratic campaign guru James Carville sounded the alarm.\n\n'There are troubling signs out there… early indications here are not sterling,' the Ragin' Cajun said on Amazon's live Election Day coverage.\n\nLiberal faces on the panel blanched and Democratic panic began to pick up steam.\n\nIowa was called for Trump. No big surprise there—it's a bright-red state. But Trump's Hawkeye State rout destroyed the myth spun by pollster Ann Selzer, who had confounded so many politicos over the weekend with her eyebrow-raising final poll showing Harris in the lead there.\n\nThe MAGA movement's success in the Acela corridor was also remarkable. \n\nVoters wait in line at a polling station on November 5, 2024 in Orlando, Florida\n\nHarris won bright-blue New Jersey by a paltry margin of under five percent. In New York State, the statewide margin was barely double digits—with embattled down-ballot Republican congressmen, such as Mike Lawler, prevailing, and Trump picking up massive additional support in New York City and neighboring Nassau County from his victory four years ago. \n\nIn Queens County, one of the most racially and ethnically diverse counties in America, Trump gained 20 points from his 2020 performance.\n\nThe dominos started to fall quickly after that.\n\nThe first battleground, North Carolina, was called. Trump overperformed there— as he did in Georgia. Neither state was quite as close as the polls suggested.\n\nHarris's path to 270 Electoral College votes narrowed.\n\nIt was then apparent that the Harris campaign was forced to go all-in on the Commonwealth of Pennsylvania.\n\nBut by 10:30 or 11:00 pm, it was already clear that prognosticators were projecting a likelier-than-not Trump victory in the Keystone State—as well as its fellow Rust Belt battlegrounds, Michigan and Wisconsin.\n\nAt around 12:30 AM or so, Team Harris announced that she would not be addressing supporters. They sent out Cedric Richmond to do that thankless task instead \n\nThe infamous New York Times 'needle,' the source of so many Hillary Clinton jokes eight years ago, began trending toward Trump. \n\nGloom descended on the sets at CNN and MSNBC.\n\nAround 12:30 AM or so, Team Harris announced that she wouldn't be addressing supporters. They sent out Cedric Richmond to do that thankless task instead. It was Hillary Clinton at the Javits Center all over again: ever-flowing liberal tears.\n\nBy 1:20 AM, many of the networks had called Pennsylvania. It was all over. It wasn't just looking like a win, but an electoral blowout. \n\nSubsequent results across the Rust Belt and Sun Belt have only confirmed the Electoral College massacre.\n\nUltimately, Donald Trump became the first Republican presidential standard-bearer to win the national popular vote since George W. Bush in 2004. \n\nHe did so by outright winning Hispanic men, winning a historically high percentage of black men and younger voters, and maintaining his margins with his bedrock demographic, the white working class. \n\nThe result: the death of the 2008 Barack Obama Democratic Party intersectional coalition, the further MAGA-ization of the erstwhile country club GOP, and the single greatest comeback story in American history.\n\nDonald TrumpFloridaCNN\n\nShare or comment on this article:\nJOSH HAMMER: The early omen that Trump was headed for a landslide that you may have missed\n\nAdd comment","summary":"I had expectations of a strong Trump showing, but even I lost my nerve a bit when the actual votes started coming in.","url":"https://www.dailymail.co.uk/news/article-14051189/trump-lanslide-florida-abortion-josh-hammer.html","image":"https://i.dailymail.co.uk/1s/2024/11/07/00/91782605-0-image-m-34_1730939027973.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/06/8234531159518236231/1024x576_MP4_8234531159518236231.mp4","publish_date":"2024-11-07 00:41:39","author":"Editor,Josh Hammer","authors":["Editor","Josh Hammer"],"language":"en","source_country":"gb","sentiment":-0.521},{"id":263199896,"title":"Mike Johnson Asks for Speakership Support in New Letter to Republicans","text":"House Speaker Mike Johnson on Wednesday formally asked his Republican colleagues to support his bid to resume the speakership and lead the conference, Politico reported.Johnson sent a letter detailing his request, even though control of the House of Representatives has not been determined, as several key races have yet to be called.Johnson congratulated President-elect Donald Trump and Vice President-elect JD Vance for winning, and he also congratulated Senate Republicans for retaking control of the upper chamber of Congress.\"As we have planned and expected, the latest data indicates that we will also hold—and likely grow—our Republican majority in the House, even though we faced a map with 18 Biden-won seats,\" Johnson said in the letter addressed to his colleagues.\"I'm ready to take the field with all of you, and I am humbly asking for your support to continue leading this Conference as your Speaker,\" he added. \"It has been the honor of my lifetime to serve with you thus far, and I look forward to playing the biggest offense of our lives.\"Johnson won his reelection battle for his House seat in Louisiana on Tuesday and predicted a \"good night\" for Republicans across the board.Trump defeated Vice President Kamala Harris in a race called by the Associated Press early Wednesday morning after he picked up the battleground state of Wisconsin and passed the 270-vote threshold to win the Electoral College.This story is developing. Check back for updates.","summary":"Johnson asked his colleagues to support his bid, even though control of the House of Representatives hasn't been determined.","url":"https://www.newsweek.com/mike-johnson-speakership-bid-letter-republicans-1981804","image":"https://d.newsweek.com/en/full/2513589/mike-johnson-wins-re-election.jpg","video":null,"publish_date":"2024-11-07 00:40:08","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"US","sentiment":0.058},{"id":263200464,"title":"Anthony Albanese has spoken with US President-elect Donald Trump","text":"Anthony Albanese has spoken to President-elect Donald Trump, following his victory in the US election.\n\nThe call took place on Thursday morning, following a press conference at Parliament House when the prime minister told reporters he was yet to make contact with Mr Trump.\n\nMr Albanese said it was good to speak to the president-elect and \"personally congratulate him on his election victory\" in a statement posted to social media. \n\n\"We talked about the importance of the alliance, and the strength of the Australia-US relationship in security, AUKUS, trade and investment,\" he said.\n\n\"I look forward to working together in the interests of both our countries.\"\n\nTrump had already spoken to a number of world leaders in the wake of his election victory.\n\nThe prime minister earlier dismissed a question about whether he needs to apologise to Trump for previously negative comments about the president-elect.\n\nIn a 2017 video taken at a music festival, Mr Albanese is asked about how he would deal with Mr Trump. \"With trepidation,\" he responded.\n\n\"He [Trump] scares the s**t out of me and I think it's of concern the leader of the Free World thinks that you can conduct politics through 140 characters on Twitter overnight.\"\n\nMr Albanese told reporters on Thursday he looks forward to working with President-elect Trump.\n\n\"I've demonstrated, I think, my ability to work with world leaders and to develop relationships with them, which are positive,\" Mr Albanese said.\n\nThe government is expected to release more information about the call shortly.","summary":"Prime Minister Anthony Albanese has spoken with Donald Trump, the day after he was elected to be the 47th president of the United States.","url":"https://www.abc.net.au/news/2024-11-07/albanese-speaks-with-us-president-elect-donald-trump/104571930","image":"https://live-production.wcms.abc-cdn.net.au/885e3af13d9c7c33f43db3a1490f5d00?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=345&width=862&height=485","video":null,"publish_date":"2024-11-07 00:39:12","author":"Jacob Greber","authors":["Jacob Greber"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.019}]}