{"offset":0,"number":50,"available":14199,"news":[{"id":303377000,"title":"Ivanka Trump breaks her silence on Tiger Woods' relationship with Vanessa","text":"Ivanka Trump breaks her silence on Tiger Woods' relationship with Vanessa\n\nREAD MORE: Tiger Woods and Vanessa Trump go public with their romance\n\nBy MAX WINTERS\n\nPublished: 00:34 GMT, 24 March 2025 | Updated: 01:00 GMT, 24 March 2025\n\nIvanka Trump has broken her silence after Tiger Woods and Vanessa Trump went public with their relationship on Sunday night.\n\nThe announcement came 10 days after DailyMail.com exclusively broke the news that the golf icon was dating Donald Trump Jr.'s ex-wife. \n\nAlongside two pictures of the loved-up couple, Woods wrote on Sunday night: 'Love is in the air and life is better with you by my side! We look forward to our journey through life together. \n\n'At this time we would appreciate privacy for all those close to our hearts.'\n\nIvanka, who was Vanessa's sister-in-law when she was married to Don Jr., commented on the post: 'So happy for you both.'\n\nShe also added a number of emojis with love hearts. \n\nIvanka Trump has broken her silence after Tiger Woods and Vanessa Trump went public \n\nDailyMail.com exclusively revealed that the golf icon was dating Donald Trump Jr.'s ex-wife\n\nIvanka, who was Vanessa's sister-in-law, commented on the post: 'So happy for you both'\n\nLeaked: Tiger Woods' humiliating phone call with ex-wife about his new lover Vanessa Trump\n\nIvanka and Vanessa were close when they were sisters-in-law and president Trump's daughter even referred to her once as 'Wonder Woman'.\n\nSpeaking to People in 2016, Ivanka said: 'My sister-in-law Vanessa is a machine. \n\n'She can take all of [my children] and not even notice. She has five children and she’s Wonder Woman to me.\n\n'She can be taking care of them all simultaneously, each pulling on her and have direct meaningful connections with each of them at one time. It’s remarkable.'\n\nWoods, 49, and Vanessa, 47, who both live in Florida, have been together since Thanksgiving, DailyMail.com confirmed with four sources.\n\nThey live 20 minutes apart in the wealthy southern Florida enclave of Palm Beach and were spotted together at a golf tournament last month. \n\nVanessa's eldest daughter Kai, 17, and Woods' children Charlie, 16, and Sam, 17, all attend the $38,595-a-year The Benjamin School together.\n\nWoods and Vanessa were absent from the junior golf tournament in South Carolina that both Kai and Charlie played in this week.\n\nDon Jr. was also absent from the contest, despite sources saying he is 'cool' with his ex-wife's new relationship. Woods's ex-wife Elin Nordegren was also a no-show at the event. \n\nIt comes after DailyMail.com revealed that Woods called Elin to tell her the news over fears that knowledge of their tryst would leak.\n\nHe called the 45-year-old shortly after they started dating, with a source revealing to DailyMail.com that the short and awkward call only lasted a few minutes.\n\n'Tiger and Elin are supportive of each other', they said. \n\n'Her response at first was like \"Seriously? A Trump? For real?\",' the insider says. 'She was more amused than anything. But she really quickly just accepted it.\n\n'They're not the type to give each other their \"blessing\" per se, but they keep each other in the loop with anyone who is going to spend any amount of time around the kids.' \n\nDailyMail.com exclusively reported the golf star and Donald Trump Jr.'s ex-wife have been dating since Thanksgiving\n\nKai Trump had a disastrous tournament at the Junior Invitational in South Carolina this week\n\nHow Trump-Tiger affair made golf great again! Female fans flock to see Kai and THAT power couple\n\nOther members of the Trump family, including all five of Vanessa and Don Jr.'s children, were already aware they are an item, one source said.\n\nA source said: 'Tiger and Vanessa have been seeing each other since just before Thanksgiving.\n\n'She comes to his place on Jupiter Island. They’re not living together. She comes over maybe a few nights a week.\n\n'They just love hanging out, having dinner and schmoozing together. They’re sticking close to home, have decided not to make it a thing and go out in public. Not just yet anyway.'\n\nThe former model and mother of five filed for an uncontested divorce from Don Jr. on March 15, 2018 in New York.\n\nSince they officially split she has not had a high-profile relationship.\n\nDon Jr. has remained a close adviser to his father and helped take over much of the business.\n\nThe two families appear to have become increasingly close. \n\nLast month, at the PGA Tour's Genesis Invitational at Torrey Pines in California, they were pictured arriving together.\n\nKai, who committed to playing golf at the University of Miami next year, wore an outfit from Woods' clothing line.\n\nSources say Don Jr. is 'cool' with his ex-wife's new relationship - pictured together in 2015\n\nEldest Trump grandchild Kai (center) arrived at The Genesis Invitational alongside Woods\n\nIn February, Vanessa took Kai to watch a round of the TGL, the golf league created by Woods and Rory McIlroy.\n\nMeanwhile, President Trump met up with Woods for a round of golf last month.\n\nWoods recently suffered a major setback in his plan to return to golf when he revealed he had ruptured his Achilles tendon.\n\nThe 15-time major winner was preparing for his latest comeback at home in Florida when he felt a ‘sharp pain’ in his left heel.\n\nHe underwent surgery on March 11 and is expected to make a full recovery, but has been ruled out of the Masters next month.\n\nShare or comment on this article:\nIvanka Trump breaks her silence on Tiger Woods' relationship with Vanessa\n\nAdd comment","summary":"Ivanka Trump has broken her silence after Tiger Woods and Vanessa Trump went public with their relationship on Sunday night.","url":"https://www.dailymail.co.uk/sport/golf/article-14529355/Ivanka-Trump-breaks-silence-Tiger-Woods-Vanessa-relationship.html","image":"https://i.dailymail.co.uk/1s/2025/03/23/23/96494291-0-image-m-31_1742771196563.jpg","video":null,"publish_date":"2025-03-24 01:01:50","author":"Editor,Max Winters","authors":["Editor","Max Winters"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.006},{"id":303376900,"title":"‘What is the national security adviser doing in Greenland?’","text":"Relations between Greenland and the United States have sunk further as the Greenlandic prime minister erupted over what he called a “highly aggressive” delegation of senior officials the Trump administration said it would send to the island this week.\n\nUsha Vance, the US second lady, and Michael Waltz, the national security adviser, are among the officials headed to the island, which is a semiautonomous territory of Denmark, though US President Donald Trump has vowed to make it part of America “one way or the other”.\n\nVance is scheduled to make a series of cultural stops after her arrival on Thursday, local time, separate from Waltz. The national security adviser is supposed to be travelling earlier in the week with US Energy Secretary Chris Wright.\n\nGreenland’s Prime Minister, Mute B. Egede, said Greenlanders’ effort to be diplomatic just “bounces off Donald Trump and his administration in their mission to own and control Greenland”.","summary":"Greenland’s PM is furious that Donald Trump is sending Mike Waltz and J.D. Vance’s wife to the island, which he has vowed to take over “one way or the other”.","url":"https://www.smh.com.au/world/europe/what-is-the-national-security-adviser-doing-in-greenland-20250324-p5llzv.html","image":"https://static.ffx.io/images/$zoom_0.1682%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_8%2C$y_277/t_crop_custom/q_86%2Cf_auto/28e134f3972407841a933ce573fb46fc79485891","video":null,"publish_date":"2025-03-24 00:53:50","author":"Jeffrey Gettleman,Maggie Haberman,Maya Tekeli","authors":["Jeffrey Gettleman","Maggie Haberman","Maya Tekeli"],"language":"en","source_country":"au","sentiment":-0.124},{"id":303374952,"title":"South Korean eggs arrive in US to combat rising prices","text":"The United States is importing South Korean eggs to ease an avian flu-fuelled supply crunch that has pushed up prices across the country.\nUS Agriculture Secretary Brooke Rollins told reporters in Washington that imports from South Korea – and Turkey – had already begun and that the White House was also in talks with other countries about temporarily importing their eggs.\n“We are talking in the hundreds of millions of eggs for the short term,” she added on Friday.\nThe cost of eggs has skyrocketed due to multiple bird flu outbreaks in the US, forcing farmers to cull at least 30 million birds and sharply constraining supply.\nEgg prices became a rallying point for US President Donald Trump in last year’s presidential election campaign as he sought to capitalise on voters’ frustrations with the rising cost of essential items during his predecessor Joe Biden’s presidency.\n\nAfter returning to office in January, Trump tasked Rollins with the job of boosting the supply of eggs, and bringing down prices.\nIn the weeks since, producers in several countries have reported American interest in their produce, with the Polish and Lithuanian poultry associations saying that they had been approached by US diplomatic staff on the hunt for fresh eggs.\n“There is a shortage of eggs in many countries,” Katarzyna Gawronska, director of Poland’s National Chamber of Poultry and Feed Producers, said recently.\n“The key question would be what financial conditions would be offered by the Americans.”\n\nThe US Department of Agriculture (USDA) recently noted that wholesale egg prices have fallen by almost 50 per cent since late February, which suggests that consumer prices could soon start to fall.\n“The downward trend underscores the effectiveness of USDA’s approach,” the agency said in a statement.\nSpeaking to reporters on Friday, Rollins said that the imports of eggs would stop once US poultry farmers were able to ramp up supply.\n“When our chicken populations are repopulated and we’ve got a full egg laying industry going again – hopefully in a couple of months – we then shift back to our internal egg layers and moving those eggs out onto the shelf,” she said.","summary":"The US is importing hundreds of millions of eggs from countries around the world – not just Korea – after avian flu forced a mass bird cull.","url":"https://www.scmp.com/news/asia/east-asia/article/3303560/south-korean-eggs-arrive-us-combat-rising-prices","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/24/20454ffc-7b70-4fb0-9315-87309eddec24_e8488eb2.jpg","video":null,"publish_date":"2025-03-24 00:42:57","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.464},{"id":303378636,"title":"Tiger Woods breaks silence on relationship with Vanessa Trump","text":"The golf world was busy lauding Viktor Hovland for his win at the Valspar Championship on Sunday night. After three consecutive missed cuts, the promising 27-year-old picked up his seventh win. But the Norwegian star did not have the spotlight for long. Tiger Woods took to social media with one of the most talked-about posts of the year. Woods confirmed his relationship with Vanessa Trump on Sunday night.\n\nView this post on Instagram\n\nA post shared by Tiger Woods (@tigerwoods)\n\n“Love is in the air and life is better with you by my side! We look forward to our journey through life together. At this time we would appreciate privacy for all those close to our hearts,” Woods posted\nThe Woods-Trump relationship was first reported earlier this month by the New York Post. Sources close to the couple say they are a good match because they have both been in public relationships and are parents.\nTrump shares two children with Donald Trump Jr., the son of the current president. Woods and his ex-wife Elin Nordegren have two children of their own, a daughter Sam, and a son Charlie.\nThis news comes just weeks after Woods tore his Achilles while training. There is no public timetable for his return to competitive golf. He spent this winter playing in the TGL but will not play at Augusta this April.\nFans react to wild Tiger Woods social media post\nGREG LOVETT/PALM BEACH POST / USA TODAY NETWORK via Imagn Images\nIt is safe to say that golf fans went wild after Woods and Trump confirmed their relationship. Considering Woods’ public relationship history and the scandal that shook the sports world in 2008, any relationship news is noteworthy.\n@SportsguyJeff could not believe his eyes after seeing the post, “Is this the real Tiger Woods?”\n@VampishBeef noted the irony of asking for privacy in a social media post, “Lol a public announcement asking for privacy seems so human.” While that is true, the news had leaked out before the announcement. Getting out in front of this type of relationship before being seen together in public should help their future.\nCBS Sports commentator Colt Knost posted, “Tiger let Viktor have the golf world’s attention for about 12 minutes!” Barstool Sports podcaster Trent Ryan said, “Nothing to see here. A very normal post. Find a new slant haters.” And his co-host Frankie Borrelli simply said, “Hell yea.”\nWoods and long-time girlfriend Erica Herman broke up in 2022. The golfer has not been in a public relationship since. This news also comes just months after his mother passed away.","summary":"The golf world was busy lauding Viktor Hovland for his win at the Valspar Championship on Sunday night. After three consecutive missed cuts, the promising 27-year-old picked up his seventh win. But the Norwegian star did not have the spotlight for long. Tiger Woods took to social media with one of the most talked-about posts [&#8230;]\n\n\nThe post Tiger Woods breaks silence on relationship with Vanessa Trump appeared first on ClutchPoints.","url":"https://clutchpoints.com/golf/tiger-woods-breaks-silence-relationship-vanessa-trump","image":"https://wp.clutchpoints.com/wp-content/uploads/2025/03/Tiger-Woods-breaks-silence-on-relationship-with-Vanessa-Trump.jpg","video":null,"publish_date":"2025-03-24 00:37:22","author":"Christopher Hennessy","authors":["Christopher Hennessy"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.14},{"id":303373610,"title":"Kyodo News Digest: March 24, 2025","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nTOKYO - Japan on Monday launched a new command for the Self-Defense Forces to better integrate its ground, maritime and air defenses, in a major revamp aimed at ensuring smoother coordination with the U.S. military at a time when tensions are heightened over potential contingencies involving Taiwan.\n\nThe SDF Joint Operations Command was established at the Defense Ministry in Tokyo with about 240 personnel. Gen. Kenichiro Nagumo, who has deep expertise in SDF joint operations, leads the permanent body.\n\nTOKYO - The approval rating for Japanese Prime Minister Shigeru Ishiba's Cabinet plunged to 27.6 percent, the lowest since he took office in October, following revelations that he handed out gift vouchers to rookie ruling party lawmakers, a Kyodo News survey showed Sunday.\n\nThe weekend telephone poll also found that 71.6 percent of respondents opposed Ishiba's distribution of cash-equivalent coupons worth 100,000 yen ($670) each to such lawmakers of his Liberal Democratic Party.\n\nChina's PM seeks dialogue in meeting with pro-Trump U.S. Sen. Daines\n\nBEIJING - Chinese Premier Li Qiang called for dialogue instead of confrontation during a meeting in Beijing on Sunday with U.S. Sen. Steve Daines, a known ally of President Donald Trump, according to The Associated Press.\n\nLi said relations between the two countries \"have come to an important juncture,\" AP reported. The premier met with the Republican senator from Montana and some American business representatives at the two-day China Development Forum, which opened in the Chinese capital earlier in the day, the official Xinhua News Agency said.\n\nMATSUYAMA, Japan - Wildfires broke out Sunday in mountainous areas of two western Japan prefectures, prompting some residents to evacuate, though no injuries have been reported, local authorities said.\n\nIn Okayama, around 15 fire trucks and a firefighting helicopter from the prefectural government have been working to extinguish the blaze, which was reported in an emergency call about 3 p.m., according to the local fire department.\n\nKOCHI, Japan - Cherry trees have begun to bloom in Kochi on Japan's western island of Shikoku, marking the opening of the season in 2025 and the second consecutive year the city has recorded the country's earliest bloom of the Somei Yoshino, the most common cherry variety, the weather agency said.\n\nAt around 2:30 p.m., the specimen tree in the Sannomaru, the largest terrace of Kochi Castle, was confirmed to have more than five blossoms -- the standard for declaring official flowering, the agency said, adding full bloom is expected in about a week.\n\nOSAKA - Ozeki Onosato clinched his third career Emperor's Cup with a championship-deciding playoff victory over rank-and-file opponent Takayasu at the Spring Grand Sumo Tournament on Sunday.\n\nThe 24-year-old Onosato and 35-year-old No. 4 maegashira Takayasu finished the scheduled component of the 15-day competition deadlocked at 12-3 after coming into the final day as joint leaders.\n\nBaseball: NPB preseason schedule concluded, Fighters finish 1st\n\nTOKYO - The Nippon Ham Fighters on Sunday finished at the top of the 12-team Japanese baseball preseason standings for the first time since 2010.\n\nFive days before Nippon Professional Baseball's season begins, the Fighters rallied to beat the Yakult Swallows 7-4 at Es Con Field Hokkaido outside Sapporo.\n\nSumo: 2 Ukrainian wrestlers make impression at Osaka tournament\n\nOSAKA - A pair of wrestlers from war-torn Ukraine made big strides at the Spring Grand Sumo Tournament, providing a captivating storyline for the 15-day event that finished Sunday in Osaka.\n\nYoungster Aonishiki made a stunning debut in the elite makuuchi division, racking up 11 wins against four losses, while fellow rank-and-file wrestler Shishi also impressed on his way to a 9-6 record.\n\nVideo: Tottori zone at Osaka Expo's Kansai Pavilion unveiled","summary":"Reflection on snow goggles shows Japan's Ikuma Horishima (L) being comforted by a Japan team offici...","url":"https://english.kyodonews.net/news/2025/03/0a9014059e91-kyodo-news-digest-march-24-2025.html","image":"https://img.kyodonews.net/english/public/images/posts/c5e3911a7808aee81298d403626fe865/cropped_image_l.jpg","video":null,"publish_date":"2025-03-24 00:35:51","author":null,"language":"en","category":"entertainment","source_country":"jp","sentiment":-0.117},{"id":303376588,"title":"Li urges states to open markets to combat ‘rising instability’","text":"BEIJING: Chinese Premier Li Qiang urged countries to open their markets to combat “rising instability and uncertainty” at a business forum in Beijing on Sunday, as China braces for further US tariffs.\n\n“In today’s increasingly fragmented world with rising instability and uncertainty, it is more necessary for countries to open up their markets and enterprises… to resist risks and challenges,” Li told dozens of foreign CEOs and visiting US Republican Senator Steve Daines at the China Development Forum, state media reported.\n\nForeign CEOs including Tim Cook of Apple, Cristiano Amon of Qualcomm, Pascal Soriot of AstraZeneca and Amin Nasser of Saudi Aramco are attending the forum on Sunday and Monday, and some are expected to meet President Xi Jinping on Friday, sources have told Reuters.\n\nBeijing is keen to attract foreign investment at a time of heightened geopolitical tensions, as policymakers try to boost domestic consumption to offset fresh US tariff headwinds.\n\n“We will focus on combining policy intensification with stimulating market forces,” Li said, according to a Xinhua report, without elaborating on specific stimulus measures.\n\n“We will implement more active and promising macroeconomic policies, further intensify counter-cyclical adjustments, and introduce new incremental policies when necessary.”\n\nLi expressed hope that entrepreneurs would be “staunch defenders and promoters of globalisation” and “resist unilateralism and protectionism”.\n\nThere were fewer American CEOs attending the summit than last year due to heightened geopolitical tensions between Beijing and Washington, according to one source. Li met with Daines and seven other American CEOs on Sunday afternoon, which Daines billed as a chance for them to share their views of the business environment in China.\n\nThe Montana lawmaker, a strong supporter of President Donald Trump, met with Vice Premier He Lifeng on Saturday in the first visit to China by a US politician since Trump took office in January.\n\nTrump has announced a wave of fresh “reciprocal” tariffs to take effect on April 2, targeting countries with trade barriers on US products, which could include China. He imposed 20% tariffs on Chinese exports this month, prompting China to retaliate with additional duties on American agricultural products.\n\nThe Trump administration is set to conclude a review by April 1 of Beijing’s compliance with a “phase one” US-China trade deal struck in his first term.\n\nDuring the forum, Chinese economic policymaker Han Wenxiu vowed further efforts to deepen supply-side reforms and promote self-reliance in science and technology, according to state media.\n\nIn recent weeks, Chinese commerce ministry officials have met with at least a dozen executives from foreign firms including Brazilian mining giant Vale, Airbus , PepsiCo, Procter & Gamble, Honeywell , and Swire. These meetings came as official data showed foreign direct investment last year plummeted the most since the 2008 global financial crisis.\n\nChina’s State Council unveiled an action plan to attract foreign investment last week, which promised measures such as smoothing cross-border data transfers.\n\nAs China concluded its annual parliamentary session this month, the government vowed to “vigorously boost” consumption in an economy facing sluggish consumer demand and a protracted property crisis.\n\nHowever, analysts have said policymakers will need to launch greater stimulus efforts if Beijing is caught up in a spiralling trade war with Washington this year.","summary":"BEIJING: Chinese Premier Li Qiang urged countries to open their markets to combat “rising instability and uncertainty” at a business forum in Beijing on Sunday, as China braces for further US tariffs.\n\n\n“In today’s increasingly fragmented world with rising instability and uncertainty, it is more necessary for countries to open up their markets and enterprises… to resist risks and challenges,” Li told dozens of foreign CEOs and visiting US Republican Senator Steve Daines at the China Development Forum, state media reported.\n\n\nForeign CEOs including Tim Cook of Apple, Cristiano Amon of Qualcomm, Pascal Soriot of AstraZeneca and Amin Nasser of Saudi Aramco are attending the forum on Sunday and Monday, and some are expected to meet President Xi Jinping on Friday, sources have told Reuters.\n\n\nBeijing is keen to attract foreign investment at a time of heightened geopolitical tensions, as policymakers try to boost domestic consumption to offset fresh US tariff headwinds.\n\n\n“We will focus on combining policy intensif","url":"https://www.brecorder.com/news/40354398/li-urges-states-to-open-markets-to-combat-rising-instability","image":"https://i.brecorder.com/large/2025/03/240405002c57033.jpg?r=040505","video":null,"publish_date":"2025-03-24 00:33:09","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.317},{"id":303376880,"title":"Pro-Trump senator meets Chinese Premier with US company executives","text":"BEIJING: US Republican Senator Steve Daines met Chinese Premier Li Qiang in Beijing with a group of executives from US companies on Sunday, following an annual business summit in the capital attended by CEOs from big foreign firms.\n\nDaines was accompanied by seven senior executives including Qualcomm CEO Cristiano Amon, Pfizer CEO Albert Bourla, Cargill CEO Brian Sikes and Boeing Global Senior Vice President Brendan Nelson in the talks at Beijing’s Great Hall of the People, a foreign media pool report said.\n\nDaines’ trip marks the first time an American politician has visited China since US President Donald Trump took office in January. Beijing is seeking high-level dialogue with the Trump administration, hoping to reach a deal to avert further pressure on tariffs from Washington.\n\nDaines, a staunch supporter of Trump and member of the Senate Foreign Relations Committee, was heavily involved in negotiations over US-China trade during Trump’s first term as president, and has made multiple trips to China as a senator.\n\nHe lived in Guangzhou and Hong Kong in the 1990s while working as an executive for Procter & Gamble, which he referenced in his opening speech.\n\n“Collectively, these seven companies have over 275 years of experience of doing business in China,” Daines said as he introduced the CEOs, according to a pool transcript.\n\nTARIFF PRESSURE\n\nBeijing has been trying to attract foreign investment to offset US tariff pressure and its slowing domestic economy.\n\nThe US executives were granted an audience with Li Qiang, who will not meet separately with other foreign CEOs at the China Development Forum for the second year in a row. The annual closed-door meeting with the premier was traditionally viewed as a summit highlight by foreign firms’ CEOs, who have long complained of an unequal playing field, regulatory hurdles and restricted market access in China. Relations between China and the US have come under new strain after Trump slapped additional tariffs on Chinese goods, accusing Beijing of not doing enough to stem the flow of fentanyl into the United States.\n\nIn early April, Trump is expected to unleash a round of tariffs on all countries that tax US imports, potentially including China. A US review of whether China has fulfilled promises made during the “phase one” trade deal from Trump’s first administration is set to conclude on April 1.\n\nIn his opening remarks, Daines pitched Sunday’s meeting as a chance for them to air their views on the business environment in China directly to Li. “There are no winners in a trade war,” Li told Daines in their meeting, stressing the importance of economic and trade ties in overall US-China relations. “China … will actively promote solutions to the legitimate demands of enterprises, treat domestic and foreign enterprises equally,” Li said, according to a Xinhua report. Other Chinese officials at the meeting included Commerce Minister Wang Wentao, Executive Vice Foreign Minister Ma Zhaoxu, and the director of China’s state planner, Zheng Shanjie.\n\nDaines met Chinese Vice Premier He Lifeng in Beijing on Saturday, and discussed with him the need for China to stop the flow of fentanyl precursors, according to a post by Daines on the X social media platform.","summary":"BEIJING: US Republican Senator Steve Daines met Chinese Premier Li Qiang in Beijing with a group of executives from US companies on Sunday, following an annual business summit in the capital attended by CEOs from big foreign firms.\n\n\nDaines was accompanied by seven senior executives including Qualcomm CEO Cristiano Amon, Pfizer CEO Albert Bourla, Cargill CEO Brian Sikes and Boeing Global Senior Vice President Brendan Nelson in the talks at Beijing’s Great Hall of the People, a foreign media pool report said.\n\n\nDaines’ trip marks the first time an American politician has visited China since US President Donald Trump took office in January. Beijing is seeking high-level dialogue with the Trump administration, hoping to reach a deal to avert further pressure on tariffs from Washington.\n\n\nDaines, a staunch supporter of Trump and member of the Senate Foreign Relations Committee, was heavily involved in negotiations over US-China trade during Trump’s first term as president, and has made multiple trips to China as ","url":"https://www.brecorder.com/news/40354397/pro-trump-senator-meets-chinese-premier-with-us-company-executives","image":"https://i.brecorder.com/large/2025/03/2404105013b0151.jpg?r=041102","video":null,"publish_date":"2025-03-24 00:33:09","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.21},{"id":303376858,"title":"US must change its approach for any talks: Iran’s top diplomat","text":"DUBAI: Talks with the US are impossible unless Washington changes its pressure policy, the Iranian foreign minister said on Sunday, as Iran prepares to respond to President Donald Trump’s letter proposing negotiations on a new nuclear deal.\n\nTrump said earlier this month that he had sent the letter to Iran’s top authority, Supreme leader Ayatollah Ali Khamenei, warning that “there are two ways Iran can be handled: militarily, or you make a deal”.\n\nKhamenei rejected the US offer for talks as “a deception”, saying negotiating with the Trump administration would “tighten the knot of sanctions and increase pressure on Iran”.\n\nHowever, Iran’s Foreign Minister Abbas Araqchi said on Thursday Tehran would soon reply to both the letter’s “threats and opportunities”.\n\nWhile leaving the door open for a nuclear pact with Tehran, Trump has reinstated the “maximum pressure” campaign he applied in his first term as president, including efforts to drive down the country’s oil exports to zero.\n\nThe US has issued four rounds of sanctions on Iran’s oil sales since Trump’s return to the White House.\n\n“Under these conditions, it is no longer possible to enter into talks with America. Unless certain approaches change,” Araqchi was quoted as saying by Iranian state media.\n\n“When we say no to negotiations with the US, it stems from a history and experience,” he said, referring to Trump’s withdrawal from Tehran’s 2015 nuclear pact with six major powers in his first term.\n\nAfter ditching the nuclear pact in 2018, Trump reimposed US sanctions that have crippled Iran’s economy. A year later, Tehran started breaching the pact’s curbs on Tehran’s nuclear programme and has far surpassed its limits.\n\nMonths of indirect talks between Tehran and Trump’s predecessor Joe Biden to revive the 2015 nuclear deal failed.\n\n“In my opinion, the 2015 pact in its current form cannot be revived. It would not be in our interest because our nuclear situation has advanced significantly and we can no longer return to previous conditions,” Araqchi said.\n\nBut he said the 2015 pact could still be “a basis and model for negotiations”.\n\nUN nuclear watchdog chief Rafael Grossi said last month time is running out for a deal to rein in Iran’s nuclear programme as Tehran continues to accelerate its enrichment of uranium to near weapons grade.\n\nTehran has long said the programme is only for peaceful purposes.","summary":"DUBAI: Talks with the US are impossible unless Washington changes its pressure policy, the Iranian foreign minister said on Sunday, as Iran prepares to respond to President Donald Trump’s letter proposing negotiations on a new nuclear deal.\n\n\nTrump said earlier this month that he had sent the letter to Iran’s top authority, Supreme leader Ayatollah Ali Khamenei, warning that “there are two ways Iran can be handled: militarily, or you make a deal”.\n\n\nKhamenei rejected the US offer for talks as “a deception”, saying negotiating with the Trump administration would “tighten the knot of sanctions and increase pressure on Iran”.\n\n\nHowever, Iran’s Foreign Minister Abbas Araqchi said on Thursday Tehran would soon reply to both the letter’s “threats and opportunities”.\n\n\nWhile leaving the door open for a nuclear pact with Tehran, Trump has reinstated the “maximum pressure” campaign he applied in his first term as president, including efforts to drive down the country’s oil exports to zero.\n\n\nThe US has issued four rou","url":"https://www.brecorder.com/news/40354341/us-must-change-its-approach-for-any-talks-irans-top-diplomat","image":"https://i.brecorder.com/large/2025/03/2402530115cfe66.jpg?r=025955","video":null,"publish_date":"2025-03-24 00:33:08","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.466},{"id":303376852,"title":"Trump awards Boeing much-needed win with F-47 fighter jet contract","text":"WASHINGTON: US President Donald Trump awarded Boeing on Friday the contract to build the US Air Force’s most sophisticated fighter jet yet, dubbed the F-47, handing the company a much-needed win.\n\nThe Next Generation Air Dominance program will replace Lockheed Martin’s F-22 Raptor with a crewed aircraft built to enter combat alongside drones.\n\nTrump, the 47th president, announced the new jet’s name, the F-47.\n\n“We’ve given an order for a lot. We can’t tell you the price,” Trump told reporters in the Oval Office.\n\n“Our allies are calling constantly,” Trump added, saying foreign sales could be an option. “They want to buy them also.”\n\nFor Boeing, the win marks a reversal of fortune for a company that has struggled on both the commercial and defense sides of its business. It is a major boost for its St. Louis, Missouri, fighter jet production business.\n\nThe engineering and manufacturing development contract is worth more than $20 billion. The winner will eventually receive hundreds of billions of dollars in orders over the contract’s multi-decade lifetime.\n\nShares of Boeing rose 4% after the news. The US company beat out Lockheed Martin for the deal. Lockheed’s shares fell nearly 7%.\n\nReuters reported Boeing’s victory before the official announcement.\n\nThe plane’s design remains a closely held secret, but would likely include stealth, advanced sensors, and cutting-edge engines.\n\n“Compared to the F-22, the F-47 will cost less and be more adaptable to future threats - and we will have more of the F-47s in our inventory,” said Chief of Staff of the Air Force General David Allvin.\n\nBoeing and Lockheed did not immediately respond to requests for comment.\n\nNGAD was conceived as a “family of systems” centered around a sixth-generation fighter to counter adversaries such as China and Russia.\n\nAllvin added the F-47 will have significantly longer range, more advanced stealth, and will be more sustainable and more easily supported than the F-22.\n\nBoeing’s commercial operations have struggled as it attempts to get its best-selling 737 MAX jet production back up to full speed, while its defense operation has been weighed down by underperforming contracts for mid-air refueling tankers, drones and training jets.\n\n“The win is a major boost for the company, which has struggled with cost overruns, schedule delays and execution on other DoD programs,” said Roman Schweizer, an analyst at TD Cowen.\n\nCost overruns at the KC-46 mid-air refueling tanker program have surpassed $7 billion in recent years, while another fixed-price contract to upgrade two Air Force One planes has created a $2-billion loss for the top 5 US defense contractor.\n\nBoeing has faced ongoing scrutiny since a series of crises including a mid-air emergency in January 2024 involving a new Alaska Airlines 737 MAX 9 missing four key bolts. In January, Boeing reported an $11.8-billion annual loss - its largest since 2020 - due to problems at its major units, along with fallout from a crippling strike that shuttered production of most of its jets.\n\nBoeing has ceded ground to rival Airbus in the delivery race and entered the crosshairs of regulators and customers following a series of missteps. The Federal Aviation Administration in early 2024 imposed a production cap of 38 MAX planes per month.","summary":"WASHINGTON: US President Donald Trump awarded Boeing on Friday the contract to build the US Air Force’s most sophisticated fighter jet yet, dubbed the F-47, handing the company a much-needed win.\n\n\nThe Next Generation Air Dominance program will replace Lockheed Martin’s F-22 Raptor with a crewed aircraft built to enter combat alongside drones.\n\n\nTrump, the 47th president, announced the new jet’s name, the F-47.\n\n\n“We’ve given an order for a lot. We can’t tell you the price,” Trump told reporters in the Oval Office.\n\n\n“Our allies are calling constantly,” Trump added, saying foreign sales could be an option. “They want to buy them also.”\n\n\nFor Boeing, the win marks a reversal of fortune for a company that has struggled on both the commercial and defense sides of its business. It is a major boost for its St. Louis, Missouri, fighter jet production business.\n\n\nThe engineering and manufacturing development contract is worth more than $20 billion. The winner will eventually receive hundreds of billions of dollars i","url":"https://www.brecorder.com/news/40354338/trump-awards-boeing-much-needed-win-with-f-47-fighter-jet-contract","image":"https://i.brecorder.com/large/2025/03/2402484939dac8a.jpg?r=025113","video":null,"publish_date":"2025-03-24 00:33:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.262},{"id":303376846,"title":"Expelled S.Africa envoy to US says back home ‘with no regrets’","text":"CAPE TOWN: The South African ambassador who was expelled from the United States in a row with President Donald Trump’s government arrived home on Sunday to a raucous welcome and struck a defiant tone over the decision.\n\n“It was not our choice to come home, but we come home with no regrets,” Ebrahim Rasool told hundreds of supporters in Cape Town after he was ousted from Washington on accusations of being “a race-baiting politician” who hates Trump.\n\nTies between Washington and Pretoria have slumped since Trump cut financial aid to South Africa over what he alleges is its anti-white land policy, its genocide case against Israel at the International Court of Justice and other foreign policy clashes.\n\nUS Secretary of State Marco Rubio said last week Rasool was expelled after he described Trump’s Make America Great Again movement as a supremacist reaction to diversity in the US.\n\nRasool, a former anti-apartheid campaigner, defended his remarks on Sunday, saying he was speaking to South African intellectuals, political leaders and others to tell them that the “old way of doing business with the US was not going to work.”","summary":"CAPE TOWN: The South African ambassador who was expelled from the United States in a row with President Donald Trump’s government arrived home on Sunday to a raucous welcome and struck a defiant tone over the decision.\n\n\n“It was not our choice to come home, but we come home with no regrets,” Ebrahim Rasool told hundreds of supporters in Cape Town after he was ousted from Washington on accusations of being “a race-baiting politician” who hates Trump.\n\n\nTies between Washington and Pretoria have slumped since Trump cut financial aid to South Africa over what he alleges is its anti-white land policy, its genocide case against Israel at the International Court of Justice and other foreign policy clashes.\n\n\nUS Secretary of State Marco Rubio said last week Rasool was expelled after he described Trump’s Make America Great Again movement as a supremacist reaction to diversity in the US.\n\n\nRasool, a former anti-apartheid campaigner, defended his remarks on Sunday, saying he was speaking to South African intellectuals, ","url":"https://www.brecorder.com/news/40354340/expelled-safrica-envoy-to-us-says-back-home-with-no-regrets","image":"https://i.brecorder.com/large/2025/03/2402505867ea14b.jpg?r=025101","video":null,"publish_date":"2025-03-24 00:33:08","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.034},{"id":303374690,"title":"Usha Vance plans to travel to Greenland while Trump considers buying the island","text":"Second lady Usha Vance is set to visit Greenland this week as President Donald Trump has continued to offer to make the Arctic island a part of the United States.\n\nIn a press release posted to the second lady’s X account, it was revealed that Vance would be visiting Greenland with one of her sons. National Security Adviser Mike Waltz, and Energy Secretary Chris Wright will also be traveling to Greenland, officials told the New York Times.\n\nWhile in Greenland, Vance will “visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland’s national dogsled race.”\n\n“On Thursday, March 27, 2025, Second Lady Usha Vance will travel to Greenland with her son and a United States delegation to visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland’s national dogsled race,” the press release said. “The race brings together approximately 37 mushers and 444 dogs in a remarkable display of speed, skill, and teamwork.”\n\nPer the New York Times, Waltz will “tour a U.S. military base,” and Wright “is expected to join him”:\n\nSeparately, Michael Waltz, the national security adviser, is expected to tour a U.S. military base, two U.S. officials said. Chris Wright, the energy secretary, is expected to join him, according to another person with knowledge of the visit, as the Trump administration increases its focus on Arctic security and the Western Hemisphere.\n\n“Ms. Vance and the delegation are excited to witness this monumental race and celebrate Greenlandic culture and unity,” the press release continued. “They will return to the United States on Saturday, March 29, 2025.”\n\nWATCH — Why Greenland? Trump Outlines Why Annexation of Greenland Is Crucial for United States:\n\nAs – News reported, in December 2024, Trump announced that Ken Howery was his pick to serve as the next U.S. Ambassador to the Kingdom of Denmark. Trump also announced that the U.S. taking control of Greenland was necessary “for purposes of National Security and Freedom throughout the World.”\n\nSince Trump’s announcement, several Danish officials have dismissed the idea of Greenland becoming a territory of the U.S. Greenland’s Prime Minister Múte Egede also responded to Trump’s offer of the U.S. taking control of the Arctic island, stating that Greenland is “not for sale” and would “never be for sale.”\n\nAt the beginning of March, in a post on Truth Social, Trump vowed to invest billions, and to “create new jobs” in Greenland if the people decided to join the U.S.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSecond lady Usha Vance is set to visit Greenland this week as&#8230;\n\n\nThis Post: Usha Vance plans to travel to Greenland while Trump considers buying the island first appeared on Internewscast Journal","url":"https://internewscast.com/news/usha-vance-plans-to-travel-to-greenland-while-trump-considers-buying-the-island/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Usha-Vance-to-Visit-Greenland-as-Trump.jpg","video":null,"publish_date":"2025-03-24 00:33:06","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.196},{"id":303379126,"title":"Trump meets with another N.J. GOP candidate in governor’s race at Bedminster golf club","text":"Not one but two of the top Republican candidates for New Jersey governor met briefly with President Donald Trump at his Bedminster golf club this weekend. \n\nFormer radio host Bill Spadea had a private chat with the Republican president at Trump National on Saturday, a day after his chief rival, former state Assemblyman Jack Ciattarelli, huddled with Trump there, three sources confirmed to the What Makes Jersey Run newsletter.","summary":"President Donald Trump's chat with Bill Spadea came a day after he huddled with his chief rival, Jack Ciattarelli.","url":"https://www.nj.com/politics/2025/03/trump-meets-with-another-nj-gop-candidate-in-governors-race-at-bedminster-golf-club.html","image":"https://www.nj.com/resizer/v2/SKKAORFTAJACTAX4LKPZ6DUXFE.png?auth=1586c2a7dac5a792564f388916c633b8a196a5179f450ee29466bf764449ca84&width=1280&quality=90","video":null,"publish_date":"2025-03-24 00:29:54","author":"Brent Johnson","authors":["Brent Johnson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.335},{"id":303374692,"title":"Usha Vance, the second lady, will travel to Greenland as part of President Trump’s efforts to acquire the Danish territory.","text":"Second lady Usha Vance will travel to Greenland this week, the White House announced Sunday, becoming the latest U.S. official to visit the Danish territory as President Donald Trump ramps up calls for U.S. ownership.\n\nEnergy Secretary Chris Wright and national security adviser Mike Waltz will join Vance, the vice president’s wife, as part of the U.S. delegation, two administration sources confirmed to NBC News.\n\nVance, who is taking one of her two sons, will visit historical sites, learn about Greenlandic heritage and attend a national dogsled race, the White House said. The trip will begin Thursday.\n\nThe officials will embark on the trip as Trump sharpens his yearslong proposal to take over Greenland, a mineral-rich island that houses a U.S. military base in a region of growing geopolitical importance.\n\nVance said in a video Sunday that her visit will double as an effort to celebrate and strengthen “the long history of mutual respect and cooperation between” the United States and Greenland.\n\nThe New York Times first reported Vance’s trip.\n\nThe U.S. delegation’s visit has drawn the ire of outgoing Greenlandic Prime Minister Múte B. Egede, who questioned whether the trip was a show of force meant to intimidate local leaders.\n\n“We are now at a level where it can in no way be characterized as a harmless visit from a politician’s wife,” Egede told the national newspaper Sermitsiaq on Sunday. “What is the security adviser doing in Greenland? The only purpose is to show a demonstration of power to us, and the signal is not to be misunderstood.”\n\nRepresentatives for the White House and the Energy Department did not immediately reply to requests for comment.\n\nTrump floated the idea of purchasing Greenland during his first term in office but has recently grown more aggressive in making the pitch. He has called ownership of Greenland “an absolute necessity” and has refused to rule out using military force to acquire it.\n\n“We need Greenland for national security. One way or the other we’re going to get it,” said in his address to a joint session of Congress this month.\n\nHe offered a similar rationale during an Oval Office meeting with NATO Secretary General Mark Rutte this month, when he suggested the military alliance may have to aid his effort to annex the territory.\n\n“We have a lot of our favorite players cruising around the coast, and we have to be careful,” Trump said. “I think that’s why NATO might be, have to get involved in a way, because we really need Greenland for national security.”\n\nGreenland is a semiautonomous territory of Denmark, which is a member of NATO.\n\nGreenlandic and Danish leaders have consistently rejected Trump’s proposal.\n\nIn January, Donald Trump Jr., accompanied by right-wing influencer Charlie Kirk, traveled to Greenland for a visit his father characterized as being in support of a “deal that must happen.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nSecond lady Usha Vance will travel to Greenland this week, the White&#8230;\n\n\nThis Post: Usha Vance, the second lady, will travel to Greenland as part of President Trump&#8217;s efforts to acquire the Danish territory. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/usha-vance-the-second-lady-will-travel-to-greenland-as-part-of-president-trumps-efforts-to-acquire-the-danish-territory/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2025-03/250323-usha-vance-wm-415p-54dc34.jpg","video":null,"publish_date":"2025-03-24 00:29:03","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.137},{"id":303378844,"title":"Conan O&#8217;Brien To Receive Mark Twain Prize For American Humor Amid Kennedy Center Controversy","text":"Conan O’Brien will be honored with the Mark Twain Prize for American Humor on Sunday at the John F. Kennedy Center for the Performing Arts. However, the celebration comes amid controversy following President Donald Trump’s recent overhaul of the institution’s leadership.\nA Career of Wit and Resilience\nO’Brien, 61, was named the recipient of the award in January, weeks before Trump dismissed the Kennedy Center’s leadership and replaced them with allies. Trump justified the move by stating that the previous board members “do not share our Vision for a Golden Age in Arts and Culture.” He has since suggested bringing more Broadway shows to the venue and floated granting Kennedy Center Honors status to Sylvester Stallone and Paul Anka.\nThough O’Brien generally avoids political commentary, he has taken stands on social issues. In 2011, he officiated a same-sex wedding on his show for his longtime costume designer, Scott Cronick, and his partner, David Gorshein.\nFrom Unknown to Comedy Icon\nO’Brien’s rise to fame was unexpected. In 1993, he was an obscure comedy writer when NBC chose him to replace David Letterman on “Late Night.” Over 16 years, he built a devoted fanbase with his quirky humor. However, his transition to “The Tonight Show” ended abruptly after seven months when NBC reinstated Jay Leno. Rather than accept a time slot change, O’Brien exited with a multimillion-dollar settlement.\nSince then, he has found success with his TBS talk show, popular podcasts, and the travel series “Conan O’Brien Must Go.” His well-received hosting of the Academy Awards has led producers to invite him back next year.\nCelebration Amid Controversy\nThe Kennedy Center shake-up has sparked backlash. The producers of “Hamilton” and actress Issa Rae have canceled appearances, while others, like comedian W. Kamau Bell and cellist Erin Murphy Snedecor, have voiced their discontent during performances.\nMark Twain Prize ceremonies traditionally feature star-studded tributes. With the Kennedy Center’s future in flux, some presenters may address the controversy. O’Brien joins past honorees including Letterman, Leno, George Carlin, Whoopi Goldberg, and Dave Chappelle. The ceremony will be streamed on Netflix later this year, though an exact date has not been announced.\nALSO READ: Jeff Bezos And Lauren Sanchez Wedding Plans Revealed, Couple To Marry In Venice: Report","summary":"Conan O’Brien will be honored with the Mark Twain Prize for American Humor on Sunday at the John F. Kennedy Center for the Performing Arts.","url":"https://www.newsx.com/entertainment/conan-obrien-to-receive-mark-twain-prize-for-american-humor-amid-kennedy-center-controversy/","image":"https://www.newsx.com/wp-content/uploads/2025/03/Conan.webp","video":null,"publish_date":"2025-03-24 00:28:36","author":"Ashish Rana","authors":["Ashish Rana"],"language":"en","source_country":"in","sentiment":0.239},{"id":303374718,"title":"‘Going postal’: USPS workers in Portland decry Trump reforms","text":"Chants of protest rang out across Pioneer Courthouse square early Sunday afternoon as more than 200 postal workers and their supporters rallied against the Trump administration’s efforts to slash the size of the U.S. Postal Service. \n\nPresident Donald Trump said last month that he’s considering moving oversight of the postal service, which is an independent entity, to the Department of Commerce. Critics say the move would lead to higher prices and reduced services across America. He has also previously floated the idea of privatizing the public service during his first term in office, and said in December 2024 that the idea was still under consideration. \n\nAttendees carried signs reading “fight like hell” and “hands off our postal service.” \n\n“I’m going postal!” read another sign held aloft as the gathered protesters listened to a series of speeches from postal workers and labor leaders. The Portland event coincided with others in Boston and Houston and Billings, Montana as mail carriers nationwide rallied against the proposed cuts. \n\nDavid Norton, president of the National Association of Letter Carriers branch 82, which represents many Portland postal workers, said he and many of the people gathering on Sunday took issue with the idea of privatization. \n\n“The Postal Service operates as a public service. It delivers to all residents in this country, regardless of where you live: hard to reach places, rural places. We have a universal mandate that says that we go everywhere,” he said. “Any postal service that doesn’t have universal service is not a service for the American people. It’s a private enterprise.”\n\nHe added that people in his post office were “nervous” about the downstream impacts to their jobs as the Elon Musk-led Department of Governmental Efficiency sets its sights on the 640,000-employee agency. \n\nEarlier this month, Postmaster General Louis DeJoy announced that he plans to cut 10,000 workers from the agency, which wielded a budget of $78 million in 2024. \n\nAt the edge of the crowd gathered on Sunday, post office clerk Amy Ruedinger harbored concerns about the newly-announced cuts and changes. She told The Oregonian/OregonLive that she worries that privatizing the post office would reduce rural service, and drive up delivery costs. \n\n“It’s not about making money, it’s about going to every single address in the nation,” she said of the agency’s longstanding mission. “It’s about giving every American their mail.” \n\n— Tatum Todd is a breaking news reporter who covers public safety, crime and community news. Reach them at ttodd@oregonian.com or 503-221-4313. \n\n– Reporter Austin De Dios contributed to this story.","summary":"Hundreds of postal workers and their supporters assembled in Pioneer Courthouse Square to protest Trump administration efforts to reduce the size and budget of the agency.","url":"https://www.oregonlive.com/news/2025/03/going-postal-usps-workers-in-portland-decry-trump-reforms.html","image":"https://www.oregonlive.com/resizer/v2/ARZR7DR3RJAJRKK5CESSFPSOFI.jpg?auth=cc3eb2ead89f92a34ec2d91f6b485616aadae749fcc1075ccb34b34a3e1a2bf5&width=1280&quality=90","video":null,"publish_date":"2025-03-24 00:22:53","author":"Tatum Todd","authors":["Tatum Todd"],"language":"en","category":"politics","source_country":"us","sentiment":-0.119},{"id":303378682,"title":"2027: Cloud Thickens Over Coalition APC, Opposition Trade Words Over Coalition Against Tinubu As Stakeholders Differ On Workability","text":"FELIX NWANERI writes on the disclosure by former Vice President Atiku that some leaders of the main opposition political parties have agreed to form a coalition that will unseat the ruling All Progressives Congress (APC) in the 2027 presidential election\n\nAs the build-up to the 2027 general election gradually gathers momentum, there are indications that history may repeat itself given the move by some chieftains of the opposition political parties to form an alliance that will confront the ruling All Progressives Congress (APC) in the presidential poll.\n\nFormer Vice-President Atiku Abubakar, who confirmed endorsement of the alliance by key opposition leaders like Mr. Peter Obi of the Labour Party (LP) and Nasir El-Rufai of the Social Democratic Party (SDP, while speaking during a press conference in Abuja, on Thursday last week, said they have kickstarted a movement aimed at defeating President Bola Tinubu of the APC in the 2027 election.\n\nThe press conference, organised by concerned political leaders and stakeholders in response to President Tinubu’s declaration of a state of emergency in Rivers State, was attended by key political figures, including El-Rufai, who recently resigned his membership of the APC and ex-governor of Imo State, Emeka Ihedioha.\n\nOthers are former Director General of Progressive Governors Forum (PGF), Dr. Salihu Lukman, erstwhile Secretary to the Government of the Federation (SGF), Babachir Lawal; National Secretary of the Coalition of United Political Parties (CUPP) Peter Ahmeh and the convener of The Alternative Political Movement, Segun Showunmi. Obi, who was absent, was represented by Dr. Yunusa Tanko, National Coordinator of the Obidient Movement.\n\nWhen asked whether the emerging coalition will serve as the main opposition against the APC in the 2027 elections, Atiku, who was the presidential candidate of the Peoples Democratic Party (PDP) in the 2023 elections, said:\n\n“Yes, this is the birth of the coalition of opposition ahead of 2027.” Atiku, who was the presidential candidate of the Peoples Democratic Party (PDP) in the 2023 elections, had in November last year, called on the opposition political parties to come together and create a more formidable front that will salvage Nigeria’s democracy.\n\nHe then pointed out that a formidable coalition is necessary to address the perceived decline in democratic values and to prevent Nigeria from becoming a de facto one-party system.\n\nHe also noted that the project of protecting democracy in the country is not about just one man. His words: “The project of protecting democracy in our country is not about just one man.\n\nYou have come here today to say that we should cooperate to promote democracy. But the truth of the matter is that our democracy is fast becoming a one-party system; and, of course, you know that when we have a one-party system, we should just forget about democracy. “We have all seen how the APC is increasingly turning Nigeria into a dictatorship of one party.\n\nIf we don’t come together to challenge what the ruling party is trying to create, our democracy will suffer for it, and the consequences of it will affect the generations yet unborn.” Atiku did not stop at his call for the opposition to close ranks; he later met with Obi.\n\nThe former vice-president had 6.9 votes in the 2023 presidential poll to place second to Tinubu, who had 8.7 million votes, while Obi, who came third, polled 6.1 million votes.\n\nAPC’s merger experience\n\nThe APC coming together of a number of political parties in 2013 to form the All Progressives Congress (APC) ahead of the 2015 general election re-enacted an existing trend in Nigeria’s politics referred to as politics of merger or politics of alliance.\n\nAPC’s emergence at the time was like a bolt out of the blues not because Nigerians were not aware of the party’s coming, but because nobody expected that the main opposition political parties at that time would close ranks and fuse into one platform.\n\nThe parties that dissolved into APC were Action Congress of Nigeria (ACN), Congress for Progressive Change (CPC), All Nigeria Peoples Party (ANPP) as well as factions of All Progressives Grand Alliance (APGA) and the Peoples Democratic Party (PDP) otherwise known as New PDP.\n\nWhile it was doubt in some political quarters then against the backdrop that most previous mergers never worked, founding members of the APC expressed optimism that their party will defeat the then ruling Peoples Democratic Party (PDP) in the 2015 presidential election.\n\nTheir dream turned to reality, when against expectations, the candidate of the then opposition party, Muhammadu Buhari, defeated the incumbent president, Goodluck Jonathan, by 15.4 million to 12.8 million votes.\n\nAPC’s victory not only cut shot of PDP’s dream of being at the helm of affairs for 60 years as its leaders boasted at a time, but marked the first time an incumbent president would lose election in Nigeria’s political history.\n\nOpposition on a familiar path\n\nWhile there is no doubt that most Nigerians are likely to welcome an alternative political platform that will give Tinubu a run for his money in the 2027 presidential election given the belief that his administration has not met expectations of the people, the move by the opposition to rally against the AP is not the first time such move would be made to turn the political table against the APC since it came to power in 2015.\n\nRecall that claims of dismal performance against the immediate past Buhari-led APC government prompted calls for a third force to unseat him in the 2019 general election. Consequently, political alliances were muted and big names flaunted.\n\nThe move got heightened, when former President Olusegun Obasanjo led the first set of coalition under the aegis of Coalition of Nigeria Movement (CNM). Obasanjo not only rallied some of his loyalists, including a former governor of Osun State, Prince Olagunsoye Oyinlola, he promised to be part of the struggle.\n\nHowever, at the inauguration of the CNM, the ex-president canvassed for a movement that is not necessarily a political party from the outset, but could later take the form of a party and lead the country to the Promised Land. The birth of CNM spurred other groups like the Nigerian Intervention Movement (NIM), led by a former President of the Nigeria Bar Association (NBA), Olisa Agbakob.\n\nWhat followed were merger talks between the respective groups and some political parties. One of the outcomes of the talks was CNM’s fusion with the African Democratic Congress (ADC). Expectedly, the alliance moves attracted a greater percentage of youths, who were buoyed by the passage of the Not Too Young To Run Bill and its assent to law.\n\nThe belief of most youths then was that new approaches are needed for the nation’s problems against emphasis on age and experience. But politics being a game of interest masquerading as a contest of principles; it did not take time before cracks appeared in the coalitions.\n\nWhile lack of cohesion and disagreement over choice of presidential candidates contributed to the crumbling of the coalitions, the last straw that broke the camel’s back was when Obasanjo made a detour and endorsed the candidacy of Atiku, who served as vice president during his reign and was nominated for the poll by the PDP.\n\nThe aftermath was that the much-anticipated hope of a break from the past never materialised hence Buhari and several other public office holders at that time, viewed by many as members of the old order, were re-elected with only a pocket of youths making it to the legislative houses.\n\nThere was another move against the APC ahead of the 2023 elections, when some notable politicians rallied under the aegis of Rescue Nigeria Project (RNP) to stop the party from returning to power.\n\nArrowheads of the move then were a former governor of Kwara State, Abdulfatah Ahmed; onetime presidential candidate, Prof. Pat Utomi; ex-Minister of Education, Prof. Tunde Adeniran; a former governor of Cross River State, Donald Duke and erstwhile National Chairman of the Independent National Electoral Commission (INEC), Prof. Attahiru Jega. However, like the 2019 move, nothing came out of the bid.\n\nQuestions over move\n\nWhile the opposition’s push for a coalition signals a significant challenge to the APC’s hold on power, the questions over the bid are:\n\nWill the opposition leaders close ranks this time given their respective ambitions to contest the presidential election? Even if they succeed in coming together, can they sustain the steam given the fact that it takes more than merger or alliance to unseat a ruling party?\n\nTo most analysts, the proposed alliance will hit the rocks if its arrowheads are looking at just a platform to actualise their individual presidential ambitions. While there are no declarations yet for the 2027 presidential election, key opposition figures like Atiku, Obi and El-Rufai are likely to contest the poll given their respective body languages.\n\nThe question against this backdrop is: Who will step down for the other among the trio if the propose alignment works, and on which platform will the candidate contest the election?\n\nThe belief that promoters of the coalition face a herculean task t is predicated on the divergent views being expressed by the leadership of the various camps, championing the alliance. For instance, it was a twist, when the National Chairman of the SDP, Alhaji Shehu Gabam, dismissed any political alliance with Atiku and ElRufai ahead of the 2027 general election.\n\nGabam, who spoke in an interview with a television station asserted that the SDP remains focused on strengthening its internal structures and presenting Nigerians with a credible political alternative. “There’s no alliance with anyone. As the chairman of the party, I have not engaged in any discussions about alliances.\n\nOur focus is on reviewing our strategies from 2024 and building a dynamic, inclusive platform,” he said. The SDP national chairman, who criticized the ruling APC and main opposition PDP, said both parties have failed to meet the expectations of Nigerians, making it imperative for citizens to consider alternatives.\n\nObi, on his part, has consistently maintained that he is not against the idea of a coalition ahead of the 2027 presidential poll, but insists that he will never join any alliance solely focused on seizing power without prioritising the welfare of citizens.\n\nHis words: “Let me set the record straight: I am not against coalition. In truth, I am for it not for power grab but to position Nigeria for greatness. I have not, and will never, advocate for any coalition or alliance that does not prioritize the welfare and progress of the ordinary Nigerian.\n\n“Any discussion about governance must centre on what it means for the everyday Nigerian, how it will address critical issues such as access to quality healthcare, education and pulling people out of poverty.\n\nToo often in our nation’s history, individuals and groups have come together solely for the purpose of taking power for power’s sake. “Such endeavours, devoid of genuine purpose and vision, have only deepened our challenges, leaving the ordinary Nigerian to bear the brunt of bad governance.\n\nThis is what I stand firmly against. “Leadership must be about service, not self-interest. It must be about building a nation where opportunities abound for all, where justice and equity are non-negotiable, and where governance works for the people, not against them.\n\n“As I have always maintained, the New Nigeria is possible. But it requires us to change the way we think about power. It is not about grabbing it; it is about using it responsibly to transform lives and secure a brighter future for generations to come.”\n\nFor El-Rufai, he recently noted his presidential political ambition in 2027, will depend on the party and the will of the people. “It is not for me to decide; it is the party and the people that will decide. Even when I was contesting for governor, it was people that met and convinced Buhari, and he called me and asked me to contest,” he said.\n\nPresidency, APC say coalition won’t fly\n\nReacting to the coalition move by the opposition leaders, the presidency boasted that no amount of gang-up will stop President Tinubu’s re-election in 2027.\n\nThe Special Adviser on Information and Strategy to the President, Mr, Bayo Onanuga, made the declaration, also said that his principal will not be distracted by the opposition politicians. He stated thisi n a statement on his X handle, titled:\n\n“My message to the coalition of Tinubu haters.” The statement read: “President Tinubu is focused on governance to build a prosperous country. He is on the way to achieving this. Two months to his midterm, he has many solid achievements to showcase. Intractable problems are being tackled headlong.\n\n“He cannot be distracted by the so-called coalition of politicians. They are not politicians after the public good. It’s all about their selfinterest. They are disgruntled. They are a frustrated lot. The leaders are sore losers. The coalition is an amalgam of Tinubu haters. Their agenda is to stop Tinubu.”\n\nSunday Dare, Special Adviser on Media and Public Communications to the President, had earlier advised the leading opposition figures – Atiku, Obi and Rabiu Kwankwaso of New Nigeria Peoples Party (NNPP) – as well as other critics like El-Rufai and Rotimi Amaechi (a former governor of Rivers State) to wait till the next general election before they flex muscles. Insisted that the activities of the opposition leaders are premature, he said: “This is 2025, not 2027. Let those who want to test their popularity with Nigerians wait for the next election.”\n\nHe emphasised that President Tinubu remains focused on his mandate to improve the lives of Nigerians and build a resilient economy, despite the distractions. “The only conversation he (Tinubu) wants to have now is how to improve the lives of Nigerian citizens and constructive discourse on building a resilient economy,” he said.\n\nNational Chairman of the APC, Abdullahi Ganduje, who also dismissed the opposition leaders, said no political gang-up will stop President Tinubu’s re-election in 2027. Ganduje, in a statement by his Senior Special Assistant on Public Enlightenment, Oliver Okpala, reiterated that any northerner interested in contesting in 2027 should suspend such ambition and wait till 2031.\n\nHe added that the North’s support for Tinubu’s reelection in 2027 is unshakable. “Tinubu will surely emerge victorious because of his unparallel performance since he assumed office as president. Forget the recent political gatherings and ranting by some politicians who presently do not have any identifiable political base.\n\n“Their gathering from the LP, PDP, SDP and others are people with different political ideologies and selfish political interests that can never agree on any issue politically. The gathering is an assemblage of people with divergent political interests. No amount of political arrangement or gang up can stop the good people of Nigeria from re-electing Tinubu as President in 2027,” Ganduje said.\n\nNational Vice Chairman of the APC (South-East), Dr Ijeoma Arodiogbu, on his part, said the ruling party is not worried over the moves by the opposition figures. His words: “As it is in the Bible; surely they shall gather and they shall scatter. We are not worried that they are gathering because they will definitely scatter. We are not worried about what ElRufai does next.\n\nWe know that his trajectory in politics is highly disturbed now. “After our election in 2023, he displayed himself as a man who cannot be trusted across the regions. The way he disparaged Christians in Nigeria, a secular society, has made him a leper. Nobody goes anywhere close to him. El-Rufai is just desperate for recognition now and I wonder why the media is giving him that attention.\n\n“We are not worried about the unholy alliance because it will amount to nothing. It is just a gathering of disgruntled people, trying to lick their wounds. Tinubu remains the president and there is nobody that can stop him in 2027.”\n\nArodiogbu noted that the reforms of the Tinubu administration, which the opposition may be planning to campaign with are currently yielding the desired results Nigerians, so the people cannot afford to surrender leadership to desperate politicians whose sole interest is state capture.\n\n“When 2027 comes, what will they use to campaign to Nigerians? Will they tell them that they plan to reintroduce fuel subsidy? Not possible! We are already bouncing back to the days of glory. They have seen that forex t is stabilised, and the people are beginning to see a light at the end of the tunnel.”\n\nStakeholders differ on coalition’s workability\n\nWhile it is dismissal of any possible threat the proposed coalition is likely to pose for Tinubu by the leadership of the APC, some opposition stakeholders, who spoke on the development, said the workability of the coalition will depend more on party structure rather than reliance on personalities.\n\nA former PDP National Vice Chairman (South-West), Eddy Olafeso, who said coalition is the only guarantee to defeat APC n 2027, advised his party to speak with Obi and leaders of other opposition parties.\n\n“Not only Peter Obi, every person, who is somebody in this country and can actually garner one or two votes must be spoken with,” he said, insisting that it will be difficult for any single political party to defeat the APC without a strong alliance. “It is not only here that you have alliances; you have people working together to be able to win an election.\n\nIt happened in Ghana not quite a long ago and that is exactly what we all should do at this moment, no single party can defeat the APC alone, don’t let us delude ourselves.\n\nWe must all come together to fight,” he said. Founder and Pioneer National Chairman of APGA, Chief Chekwas Okorie, in an interview with New Telegraph, expressed the feeling that the coalition poses a threat to Tinubu’s re-election bid.\n\nHis words: “The coalition looks like a very portent one that may turn out to be a very formidable challenge to President Tinubu come 2027 beyond the way those around him are reacting to it because I know that those behind the coalition are plotting to divide Southern Nigeria by bringing a candidate, who will do just four years in order to allow the region complete its eight years in line with the rotation agreement, so that power can go back to the North in 2031.\n\n“The trump card in this calculation is Peter Obi and the belief of that arrowheads of the plot is that Obi, unlike President Goodluck Jonathan, will not renege on any agreement he is likely to enter with the North given his antecedent.\n\nWhile Jonathan is said to have reneged on the agreement that he will complete Umar Yar’Adua’s first term, so that the North will replace him in 2011, promoters of the coalition believe that there is no reason to doubt Obi.\n\nSo, Atiku is likely to step down for Obi. Once that is done, 2027 will be a done deal. “So, expect serious realignment of political forces in the days ahead. You will see CPC elements in the APC and supporters of former President Buhari leaving the ruling party for the SDP or any other platform those behind the coalition will agree on.\n\nAnd, mark my words, APC will wake up to reality very soon. “Unfortunately, those around the President are busy attracting more political opponents for him rather than supporters.\n\nThey are not even looking at the numbers, which show that the North-West holds the ace given that the zone delivered bulk of the votes for Tinubu in 2023.\n\n“I am not saying that they will lose in 2027, but Tinubu and his men must return to the political drawing board to take a look at how they will survive because it is not going to be easy the way they are making it to look like as the 2027 presidency is going to be an epic democratic contest in Nigeria’s history.”\n\nHowever, a former governor of Kano State and Chairman of the League of Northern Democrats (LND), Malam Ibrahim Shekarau, who dismissed the opposition figures on the ground that the coalition they are pushing lacks the necessary political structure to challenge the APC, described their move as an informal gathering of presidential aspirants rather than a well-organized political merger.\n\nHe also noted that the coalition does not have the backing of the leadership of major opposition parties, particularly the Peoples Democratic Party (PDP) and the Labour Party (LP). According to him, the coalition is being driven by individuals rather than established political structures, making it unlikely to pose a serious threat to the APC’s dominance.\n\nHis words: “The coming together of some senior members of opposition parties is a welcome development, as seen recently under what they call a ‘coalition’ of opposition parties.\n\nBut unfortunately, most people do not realize that this so-called coalition has nothing to do with the major opposition parties; PDP and LP.”\n\nHe contrasted the current situation with the 2013 merger that led to the formation of the APC, which involved the unification of four registered parties, saying: “The first political merger in Nigeria happened in 2013 when four registered parties merged to form the APC. So, technically, the APC is not a ‘new party.’\n\nIt was an alliance of registered opposition political parties that were already well-established, with elected state governors, state and National Assembly members, and significant grassroots support.” Shekarau pointed to a similar coalition attempt in 2019, which brought together 10 political parties against the APC but eventually collapsed due to a lack of inclusiveness., said:\n\n“The 2019 ‘coalition’ was formally launched almost a year before the elections, yet none of the then-elected PDP leaders was in attendance.\n\nNo amount of noise-making or informal alliances by individual politicians in the name of opposition will have any impact in elections unless the full leadership structure of opposition parties at all levels is involved,” he warned.\n\nHe further argued that the recent ratification of President Tinubu’s emergency rule in Rivers State by the National Assembly exposed the coalition’s lack of influence over opposition lawmakers.\n\nAccording to him, if the coalition leaders had any real influence, the APC government would not have secured the required votes.\n\nDespite his criticisms, Shekarau maintained that the opposition still has a chance to reorganize itself before the 2027 elections if it focuses on genuine unity and strategic planning. “It is still not too late.\n\nI believe that with the right vision, mission, and focus, combined with a genuine sense of purpose, the opposition can change its narrative in 2025 and position itself for success in the 2027 elections,” he said.\n\nA former Deputy National Chairman o the PDP, Chief Bode George who also faulted the coalition move, said it is being driven by personal ambition as some of those pushing for the coalition have the ambition to become president.\n\nHe said: “All those people saying they are going to float a mega party, is there any of them who is not ambitious to be president of Nigeria? Is that the real approach to solving this problem?\n\nDo you think there is any nation or party that does not have a crisis? All these groups who are running around for their personal ambition, they are making a monumental mistake and they are all dancing on the graves of our founding fathers.”\n\nOlufemi Aduwo, the Permanent Representative of the Centre for Convention on Democratic Integrity (CCDI) at the United Nations, who also spoke on the coalition move, told New Telegraph that it will take more than coming together of opposition leaders to unseat Tinubu and his party in 2027.\n\nHis words: “I have heard calls for the opposition parties to come together to defeat Tinubu, but let us be honest, many of these parties are built around individuals, both the APC and PDP.\n\nTake the formation of the APC in 2013. It came about from the merger of Nigeria’s three largest opposition parties. The ACN, CPC and ANPP alongside a breakaway faction of APGA.\n\n“These parties had governors, which was crucial. In November 2013, five serving governors from the PDP defected to the APC. Rotimi Amaechi of Rivers, Abdulfatah Ahmed of Kwara, Rabiu Kwankwaso of Kano, Murtala Nyako of Adamawa and Aliyu Wamakko of Sokoto.\n\nUnknowingly to Atiku Abubakar, the walk-out led by him during PDP convention was the moment his political ambition hit a dead end. “In the 2015 presidential poll, the “New PDP” states delivered a massive 3.3 million votes to Buhari, who defeated Jonathan by 2.5 million votes.\n\nWithout this group, the APC and Buhari would have lost. So, it is not enough for the opposition to simply unite, they need to secure at least seven APC governors.\n\nAnything less, they are merely engaging in a game of musical chairs with no real substance. If they are serious about change, they need to win over key APC figures.”","summary":"ShareFELIX NWANERI writes on the disclosure by former Vice President Atiku that some leaders of the main opposition political parties have agreed to form a coalition that will unseat the ruling All Progressives Congress (APC) in the 2027 presidential election As the build-up to the 2027 general election gradually gathers momentum, there are indications that...\n\n\nThe post 2027: Cloud Thickens Over Coalition APC, Opposition Trade Words Over Coalition Against Tinubu As Stakeholders Differ On Workability appeared first on New Telegraph.","url":"https://newtelegraphng.com/2027-cloud-thickens-over-coalition-apc-opposition-trade-words-over-coalition-against-tinubu-as-stakeholders-differ-on-workability/","image":"https://i0.wp.com/newtelegraphng.com/wp-content/uploads/2025/03/Screenshot-2025-03-23-143828.png?fit=366%2C507&ssl=1","video":null,"publish_date":"2025-03-24 00:22:35","author":"FELIX NWANERI","authors":["FELIX NWANERI"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.151},{"id":303375050,"title":"World News | US-Ukraine Talks Underway in Saudi Arabia as Delegations Meet for Negotiations","text":"Riyadh [Saudi Arabia], March 24 (ANI): Delegations from the United States and Ukraine have engaged in discussions in Saudi Arabia as part of ongoing diplomatic efforts to negotiate a resolution to the Russia-Ukraine war, Al Jazeera reported.\nUkrainian Defence Minister Rustem Umerov confirmed the talks on Sunday, stating that the focus was on safeguarding energy infrastructure and critical sites amid ongoing hostilities. The discussions are taking place under the mediation of the administration of US President Donald Trump, as efforts continue to establish a framework for peace. Also Read | Canada Elections 2025: New Prime Minister Mark Carney, Opponent Kick Off Poll Campaign.\nThe negotiations come ahead of scheduled meetings between Russian and Ukrainian representatives on Monday. Umerov emphasised Ukraine's commitment to securing a \"just peace\" while reinforcing national security. \"We are implementing the President of Ukraine's directive to bring a just peace closer and to strengthen security,\" he wrote on X. Also Read | Israel-Hamas War: Israeli Forces Push Deeper Into Gaza, Surrounding Rafah Neighbourhood.\nUS Special Envoy Steve Witkoff expressed cautious optimism regarding the talks, telling Fox News that he believed Russian President Vladimir Putin was open to peace. \"I just don't see that he wants to take all of Europe,\" Witkoff said. While the US and Russian delegations are set to meet separately in Riyadh, the broader discussions reflect an effort to establish common ground amid persistent hostilities. As diplomatic engagements continue, the situation on the ground in Ukraine remains volatile. At least seven people were killed in Russian drone strikes overnight, with President Volodymyr Zelenskyy calling on Western allies to intensify pressure on Moscow to cease attacks. In Kyiv, a drone strike resulted in three deaths, including a five-year-old child, while injuring ten others, according to the city's military administration. Kyiv Mayor Vitali Klitschko reported fires and structural damage across multiple districts as emergency services responded. In the eastern Donetsk region, four more fatalities were reported, with regional Governor Vadym Filashkin confirming that three victims were killed in a strike on the front-line town of Dobropillya. Ukraine's Air Force reported that Russia had launched 147 drones overnight, targeting multiple regions. Of these, 97 drones were intercepted, while 25 failed to reach their targets. The scale of the strikes prompted Zelenskyy to highlight the increasing frequency of Russian attacks, noting that \"more than 1,580 guided aerial bombs, almost 1,100 strike drones and 15 missiles of various types\" had been used against Ukraine in a single week. He called for \"new solutions\" and greater international pressure to halt the strikes and bring an end to the conflict, reported Al Jazeera.\nIn response, Russia's Ministry of Defence reported that its forces had \"destroyed and intercepted\" 59 Ukrainian drones overnight, with operations concentrated over the regions of Rostov and Astrakhan. Meanwhile, Trump has suggested that efforts to de-escalate the war are progressing but remain complex. Speaking to Clay Travis, the founder of sports website Outkick, during an interview aboard Air Force One, Trump stated that \"rational discussions\" and maintaining strong relationships with both Putin and Zelenskyy were crucial to achieving peace. Trump recently held separate discussions with Putin and Zelenskyy, aiming to broker a ceasefire. While the talks did not result in a comprehensive 30-day truce, Putin agreed to halt attacks on Ukrainian energy infrastructure for the period, a condition Zelenskyy accepted. However, despite the temporary agreement, both sides have since accused each other of targeting energy facilities, further complicating the peace process. The Kremlin has downplayed expectations of an imminent resolution, emphasising that negotiations remain in the early stages. \"We are only at the beginning of this path,\" Kremlin spokesman Dmitry Peskov said on Russian state television, adding that challenging discussions lie ahead. Russia's primary interest in talks with the US includes revisiting the 2022 grain deal, which allowed safe passage for Ukrainian agricultural exports through the Black Sea. Moscow withdrew from the agreement in 2023, arguing that the West had not upheld its commitments to ease sanctions on Russian agricultural and fertiliser exports, as per reports by Al Jazeera.\nRussian delegation leader Senator Grigory Karasin expressed limited expectations for the upcoming talks but stated that some progress was possible. Speaking to the military-affiliated Zvezda TV channel, Karasin said he and fellow negotiator Sergey Beseda of the Federal Security Service (FSB) were approaching the discussions with a \"combative and constructive\" stance. \"We are going with the mood to fight for the solution of at least one issue,\" Karasin said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  US and Ukrainian delegations are holding talks in Riyadh, Saudi Arabia, as part of efforts to negotiate a resolution to the Russia-Ukraine war. The discussions, mediated by the Trump administration, focus on securing energy infrastructure and a possible ceasefire. Meanwhile, Russian drone strikes have killed at least seven people in Ukraine, prompting President Volodymyr Zelenskyy to call for increased pressure on Moscow.","url":"https://www.latestly.com/agency-news/world-news-us-ukraine-talks-underway-in-saudi-arabia-as-delegations-meet-for-negotiations-6730328.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250323193507.jpeg","video":null,"publish_date":"2025-03-24 00:22:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.028},{"id":303372322,"title":"Conan O'Brien to Receive Mark Twain Prize Amid Kennedy Center Drama","text":"Emmy-winning host Conan O'Brien is set to receive the prestigious Mark Twain Prize for lifetime achievement in comedy at the Kennedy Center on Sunday night, amid significant leadership upheaval at the cultural institution.Newsweek reached out to a press contact for O'Brien via email on Sunday for comment.Why It MattersEarlier this year, President Donald Trump fired much of the center's board of trustees, including chairman David M. Rubenstein, and subsequently named himself as the new chairman.The Kennedy Center, established in 1971 as the United States' national cultural center, is undergoing its most significant leadership change in decades. The situation has created tension in the arts community, with some artists canceling appearances while others have used their performances to make political statements.The controversy threatens to overshadow O'Brien's achievement as he joins the ranks of comedy legends like David Letterman, Jay Leno, and Carol Burnett.What To KnowO'Brien, 61, was named the recipient in January, shortly before Trump's takeover of the Kennedy Center board.The former Harvard Lampoon editor and writer for Saturday Night Live and The Simpsons rose to prominence in 1993 when he replaced David Letterman on Late Night. After 16 years, O'Brien briefly hosted The Tonight Show before an intensely public dispute with NBC led to his departure.He has since found success with shows on TBS, podcasts, and travel series, recently receiving acclaim for hosting the Academy Awards.What Is The Kennedy Center?The John F. Kennedy Center for the Performing Arts was opened in 1971, by then-President Nixon, in tribute to JFK, a lifelong advocate for the arts before his assassination.Serving as the United States' national cultural center, in Washington D.C. it is one of the country's premier destinations for the performing arts, featuring a wide range of performances, including theater, ballet, music, and opera.The Kennedy Center offers educational programs and hosts the annual Kennedy Center Honors to celebrate significant contributions to the arts in America.What People Are SayingPresident Donald Trump: \"The Kennedy Center is an American Jewel, and must reflect the brightest STARS on its stage from all across our Nation.\"Republicans against Trump: \"We're rapidly looking more and more like a totalitarian country. Trump just purged the Kennedy Center Board of Trustees...\"Mike Nellis, former senior advisor to Kamala Harris, posted on X: \"Trump appointing himself Chair of the Kennedy Center makes sense when you remember Musk is running the country and he's bored as hell.\"Collin Rugg, news personality and co-owner of Trending Politics, wrote on X, formerly Twitter: \" Trump terminates the chairman of the Kennedy Center in D.C., appoints himself as the new chairman then immediately bans drag shows targeting youth. One of the greatest trolls of all time.\"What Happens NextThe ceremony will be streamed on Netflix later this year, though no specific date has been announced.","summary":"The comedian's lifetime achievement honor occurs amid unprecedented leadership changes and artistic protests at the national cultural center.","url":"https://www.newsweek.com/conan-obrien-receive-mark-twain-prize-kennedy-center-drama-2049357","image":"https://d.newsweek.com/en/full/2613118/conan-obrien.jpg","video":null,"publish_date":"2025-03-24 00:18:06","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","source_country":"us","sentiment":0.031},{"id":303372712,"title":"Tiger Woods Goes Instagram Official with Vanessa Trump with Snuggled-Up Photo: 'Love Is in the Air'","text":"Tiger Woods and Vanessa Trump are Instagram official.\n\n On Sunday, March 23, the pro golfer, 49, confirmed his relationship with Vanessa, Donald Trump Jr.'s ex-wife, by sharing two snuggled-up photos of the pair on the social media platform.\n\n \"Love is in the air and life is better with you by my side! We look forward to our journey through life together,\" Woods wrote in the caption, adding, \"At this time we would appreciate privacy for all those close to our hearts.\"\n\n One of the two photos shows the couple standing side by side with their arms around each other, while the other captures them cuddled up in a lounge chair.\n\n PEOPLE first confirmed on March 13 that Woods and Vanessa, 47, had been quietly dating for several months. The Daily Mail was first to report the news.\n\n Vanessa was married to Donald Jr. for 12 years before she filed for divorce in 2018, and the former couple shares daughter Kai, 17, and son Donald III, 16. Her ex-husband is \"cool with\" her new relationship with Woods,\" a source told PEOPLE.\n\n Woods is father to son Charlie, 16, and daughter Sam, 17, with his ex-wife Elin Nordegren. The former couple split in 2010.\n\n Woods and Vanessa have been spotted at various golf events together, as their kids have played in the same junior competitions for the last several months. Earlier this week, Kai and Charlie both competed in the Junior Invitational in South Carolina.\n\n In February, Woods accompanied Vanessa and her daughter to the Genesis Invitational in San Diego, Calif. Kai is reported to be a top junior golfer in Florida who has committed to play for the University of Miami next year.\n\n Just a few days later, the five-time Masters champion was honored at the White House by Vanessa's former father-in-law, President Donald Trump, during a reception recognizing Black History Month.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories.\n\n A source close to both Woods and Vanessa previously told PEOPLE that they connected over their passion for their respective kids' golf careers.\n\n \"Their kids are going places in golf and both very disciplined about the sport. They have that in common,\" the insider said.\n\n A second source close to Vanessa told PEOPLE that her relationship with someone of Woods' status is unsurprising.\n\n \"Vanessa has always gone for guys who are either well known or have something big going for them,\" the source said. \"She is comfortable with that, but she's not a woman who wants to be in the limelight. She is not a shrinking violet but is discreet and smart and a good mother. That has come first in her life.\"","summary":"PEOPLE first confirmed on March 13 that the golf star and Vanessa had been quietly dating for several months","url":"https://people.com/tiger-woods-goes-instagram-official-with-vanessa-trump-with-snuggled-up-photo-11701948","image":"https://people.com/thmb/BMp7D15K81sw99FjRf3H-wEU3uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(713x293:715x295)/tiger-woods-vanessa-trump-032325-e5f4d81006f1467385b967fdf21b212f.jpg","video":null,"publish_date":"2025-03-24 00:15:38","author":"Charlotte Phillipp","authors":["Charlotte Phillipp"],"language":"en","source_country":"US","sentiment":0.45},{"id":303371338,"title":"Canada PM And His Opponent Kick Off Election, Calling For U.S. To Respect Sovereignty","text":"Canada’s newly appointed Prime Minister, Mark Carney, and his Conservative opponent, Pierre Poilievre, launched their election campaigns Sunday with a firm stance against U.S. President Donald Trump’s aggressive rhetoric and trade policies. With the election set for April 28, Trump’s threats and a trade war have reshaped the race.\nA Nation Under Threat?\nCarney wasted no time addressing what he called Canada’s most pressing issue: Trump’s hostility toward its sovereignty.\n“We are facing the most significant crisis of our lifetimes because of President Trump’s unjustified trade actions and his threats to our sovereignty,” Carney declared.\nTrump’s repeated claims that Canada “isn’t a real country” and should become the 51st U.S. state have fueled a wave of nationalism. Once facing electoral defeat, the governing Liberals have seen a resurgence in support.\n“They want our resources. They want our water. They want our land. They want our country. Never,” Carney said at a rally in Newfoundland.\nAn Election Rewritten by Trump’s Trade War\nOriginally, the election was expected to focus on the Liberals’ economic record under former Prime Minister Justin Trudeau. Rising food and housing prices and immigration concerns put the Liberals on the defensive. However, Trump’s trade policies and annexation rhetoric have shifted the focus.\nCarney framed the election as a choice between “a Canadian Trump or a government that unites.”\n“Canadians are always ready when someone else drops the gloves,” he added. “In this trade war, just like in hockey, we will win.”\nTrump’s 25% tariff on Canadian steel and aluminum, with threats of broader tariffs on all Canadian goods, has further heightened tensions. The tariffs are set to take effect on April 2.\nPoilievre’s Balancing Act\nPoilievre, Carney’s main challenger, was once poised for victory. However, Trump’s attacks on Canada have complicated his position. While critical of Trudeau’s policies, Poilievre faces scrutiny over his perceived closeness to Trump.\nAlberta Premier Danielle Smith, a key conservative ally, stated that Poilievre would be “very much in sync” with the “new direction in America.”\nPolitical analyst Daniel Béland noted, “The content of this interview is very bad news for the Conservatives because it reinforces the Liberals’ narrative about Pierre Poilievre and his perceived ideological proximity with Donald Trump.”\nPoilievre has sought to distance himself from Trump, stating, “I will insist the president recognizes the independence and sovereignty of Canada. I will insist he stops tariffing our nation.”\nCarney has yet to speak with Trump and isn’t expected to before the election. “Trump must recognize that Canada is a sovereign country,” Carney said. “He has to say that, he has to accept that, before we can have a discussion about a trade agreement.”\nA New Era of Canadian Leadership?\nAt 60, Carney is a political newcomer but brings financial expertise, having led the Bank of Canada and Bank of England. He has moved the Liberal Party rightward, announcing a middle-class tax cut, scrapping Trudeau’s carbon tax, and reversing a capital gains tax increase.\nPoilievre, 45, is a seasoned politician with populist appeal. He promotes “Canada first” policies and has been endorsed by Elon Musk, a key Trump ally.\nAs the election nears, Canadians must decide between Carney’s vision of unity or Poilievre’s populism in a race now defined by U.S. interference.\nALSO READ: New Mexico Park Shooting: Multiple Arrests Made After 3 Killed, 15 Injured","summary":"Canada’s newly appointed Prime Minister, Mark Carney, and his Conservative opponent, Pierre Poilievre, launched their election campaigns Sunday.","url":"https://www.newsx.com/world/canada-pm-and-his-opponent-kick-off-election-calling-for-u-s-to-respect-sovereignty/","image":"https://www.newsx.com/wp-content/uploads/2025/03/Mark-Carney-Donald-Trump.webp","video":null,"publish_date":"2025-03-24 00:13:14","author":"Ashish Rana","authors":["Ashish Rana"],"language":"en","category":"politics","source_country":"in","sentiment":-0.221},{"id":303376796,"title":"South Africa envoy expelled from US ‘has no regrets’","text":"The South African ambassador who was expelled from the US after a row with Donald Trump's government has said he has \"no regrets\".\n\nEbrahim Rasool arrived back home on Sunday and was welcomed by hundreds of raucous supporters at Cape Town International Airport.\n\nTensions between South Africa and the US have been on a downward spiral since Trump came into office in January.\n\nRasool, 62, was declared unwelcome in the US after Secretary of State Marco Rubio called him a \"race-baiting politician who hates America\". \n\nIt followed a statement by the ambassador that Trump was \"mobilising a supremacism\" as the States' white population faced becoming a minority.\n\nRasool defended his comments on Sunday morning after touching down in Cape Town.\n\nThe remarks, made during a webinar organised by a South African think tank, were meant to \"alert\" South African intellectuals and political leaders \"to a change of the way we live, to a change of the way we are positioned in the United States, that the old way of doing business with the US was not a good one\", Rasool said.\n\nWhile waiting for Rasool to arrive at the airport, members of the African National Congress, South African Communist Party and trade unionists sang and danced.\n\nSome held placards reading \"Ebrahim Rasool, you have served our country with honour!!!\"\n\nRasool's expulsion marked a rare move by the US - lower-ranking diplomats are sometimes expelled, but it is highly unusual for it to happen to a more senior official.\n\nBut ties with South Africa have been deteriorating for months.\n\nIn January, South African President Cyril Ramaphosa signed into law a bill allowing the state to seize land without compensation, provided it was in the \"public interest\".\n\nThe move followed years of calls for land reform, with activists and politicians seeking to redistribute farmland from the white minority.\n\nIn response to the law, Washington cut aid to South Africa. An executive order cited \"unjust racial discrimination\" against white Afrikaners - descendants of mainly Dutch settlers who first arrived in the 17th Century.\n\nSouth Africa has strongly denied this claim.\n\nOn Sunday, Rasool lamented that he had not been able to challenge the Trump administration's views.\n\nHe was appointed as ambassador to the US just last year, because of his experience and extensive network of Washington contacts.\n\nHe had previously served as US ambassador from 2010 to 2015 when Barack Obama was president.","summary":"The South African ambassador who was expelled from the US after a row with Donald Trump's government has said he has \"no regrets\".","url":"https://www.myjoyonline.com/south-africa-envoy-expelled-from-us-has-no-regrets/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/03/image-947.png","video":null,"publish_date":"2025-03-24 00:05:00","author":"Abubakar Ibrahim,Bbc 05am","authors":["Abubakar Ibrahim","Bbc 05am"],"language":"en","source_country":"gh","sentiment":0.031},{"id":303377410,"title":"Vanessa Trump And Tiger Woods Make Their Relationship Public, Share Photos | Watch","text":"Tiger Woods confirmed his relationship with Vanessa Trump on social media platform X. The golf legend shared pictures of him and Trump and captioned the post, \"Love is in the air and life is better with you by my side! We look forward to our journey through life together. At this time we would appreciate privacy for all those close to our hearts.\" The post comes after speculation over the last few weeks regarding a potential relationship between Trump and Woods. Vanessa Trump was previously married to Donald Trump Jr., the eldest son of President Donald Trump, for 12 years (2005 to 2018). Together they have five children: Donald Trump III (born in 2007), Kai Madison (born in 2009), Spencer Frederick (born in 2012), Chloe Sophia (born in 2014), and Tristan Milos (born in 2018). Kai, an aspiring golfer, has committed to play at the University of Miami and was a guest of Tiger Woods at the Genesis Invitational in February. She, along with Woods' children, Charlie and Sam, attends the Benjamin School in Palm Beach, Florida. Also read: Trump Is Inviting Kansas City Chiefs To The White House After Philadelphia Eagles | Here's Why Prior to her marriage to Don Jr, Vanessa dated actor Leonardo DiCaprio in 1998 and was in a relationship with Saudi prince Khalid bin Bandar bin Sultan Al Saud from 1998 to 2001. Tiger Woods was married to Elin Nordegren, a former Swedish model, from 2004 to 2010. They have two children together: a daughter named Sam Alexis Woods (born in 2007) and a son, Charlie Axel Woods (born in 2009). Get Latest News Live on Times Now along with Breaking News and Top Headlines from US Buzz, World and around the world.","summary":"Tiger Woods confirmed his relationship with Vanessa Trump on social media platform X. The golf legend shared pictures of him and Trump and captioned the post, \"Love is in the air and life is better with you by my side!\"","url":"https://www.timesnownews.com/world/us/us-buzz/vanessa-trump-and-tiger-woods-make-their-relationship-public-sharesphotoswatch-article-119397548","image":"https://static.tnn.in/thumb/msid-119397549,thumbsize-1447682,width-1280,height-720,resizemode-75/119397549.jpg","video":null,"publish_date":"2025-03-24 00:02:56","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":0.736},{"id":303374958,"title":"In Laos, 1 in 3 children has stunted growth despite surplus rice","text":"Laos is facing worsening child malnutrition, with experts warning that the country’s economic challenges and underfunding for agriculture are contributing to the crisis, leaving thousands of children at risk of experiencing stunted growth and other serious health complications.\nAt the 10th National Nutrition Forum in Vientiane, speakers from global agencies and academia said there was a need for comprehensive measures to tackle the crisis, as failure to do so would hurt the Laotian economy.\n“Adequate nutrition is essential for a child’s growth, intelligence and future earnings,” Alexander Kremer, the World Bank’s country manager in Laos, said at the forum on Tuesday. “Unfortunately, Laos faces extremely high rates of childhood malnutrition.”\nDeputy Prime Minister Kikeo Khaykhamphithoune said it was “important that we build on our past progress and recommit ourselves to ensuring every woman and child” in Laos had access to good nutrition “so they can thrive and fully contribute towards the nation’s development.”\nDespite years of efforts to tackle the problem, Laos continues to struggle with alarming levels of childhood malnutrition.\nStunted growth due to a chronic lack of nutrition affected nearly one in every three children under the age of five in Laos as of 2023, according to data from the Lao Social Indicator Survey. About 10.7 per cent of Laotian children were classified as wasting, meaning they were dangerously thin for their height, while 24.3 per cent of them were underweight for their age.\nChild malnutrition persists even though Laos has recorded a rice surplus annually since the late 1990s, according to World Bank data.\n\nExperts say the Southeast Asian country has not been able to bolster its food security due to poor infrastructure hampering the transport of rice to many of its provinces.\nApart from poor accessibility in these areas, worsening floods due to climate change have also curtailed agricultural production, according to Dirk Essink, an assistant professor in global health at Vrije Universiteit Amsterdam.\nSayvisene Boulom, deputy head of the Department of Rural Economics and Food Technology at the National University of Laos, told This Week in Asia that despite efforts to promote agricultural production with nutrition goals in mind, Laotians living in rural areas did not have enough resources to produce food. “Food insecurity is a big problem,” Boulom said.\nEssink and Boulom said the official data released in 2023 was likely an underestimation of the seriousness of child malnutrition in Laos, as remote areas might have been overlooked in the assessment.\nThey cited a survey conducted by a team led by them and published in 2020 that showed 72.8 per cent of children living in the Nong district, one of the poorest areas in the country, were stunted – more than double the national average.\nA key indicator of child malnutrition was that the overwhelming majority of Laotian children did not have a balanced diet, said Shanny Campbell, country director of the Asian Development Bank’s resident mission to Laos.\nThe country faces significant food security challenges due to limited dietary diversity\nShanny Campbell, Asian Development Bank\n“The country faces significant food security challenges due to limited dietary diversity, with only 2.5 per cent of the population meeting the minimum dietary diversity recommendations,” she said.\nEnhancing the nutrition of Laotians is a long-standing policy objective under Vientiane’s National Plan of Action on Nutrition, which is reviewed every five years.\nBut Vientiane’s commitment towards supporting the plan for the long term has been called into question.\nFrom 2016 to 2019, only 34.5 per cent of the budget for the 2016-2020 plan was allocated, despite 90 per cent of funding coming from international organisations, according to a review conducted by the Laotian government and Unicef.\nThe World Bank had been urging Vientiane to increase spending on public health, Kremer told This Week in Asia. He noted that the government had reduced the ratio of public health spending to gross domestic product by half since 2013.\n“This is partly because of the current economic situation, and partly because of the need to repay foreign debt. The current convergence programmes are just covering the poorest areas of Laos, but there are lots of opportunities to scale them up to reach a larger population,” Kremer said.\nLaos has worked with the World Bank on five different projects financed by the global institution to tackle malnutrition among very young children living in the poorest villages.\n\nBoulom said that high inflation in Laos was fuelling its economic slowdown, and this was hampering its goal to tackle malnutrition.\nWhile inflation slowed last year, it remained at an elevated 21.3 per cent with households incurring high expenses, particularly for healthcare and food, according to Laotian media reports.\nLaos is also facing a funding shortage to tackle its health problems, partly due to the policies of the administration of US President Donald Trump. On his first day in office, Trump ordered all US foreign aid to pause for 90 days, which caused disruptions to many programmes of the US Agency for International Development worldwide.\n“With the new policy [stance] of the United States, we cannot secure sufficient international funding for the school lunch intervention as well as other nutrition and agricultural activities,” Boulom said.\nIn a new initiative to tackle malnutrition, Laos announced earlier this month that it would undertake a major rice fortification project in partnership with the United Nations World Food Programme. The project is aimed at increasing Laotians’ intake of vitamins and minerals by blending the nutrients with rice during the production process.\nFor Laos to achieve success for this project, it would need more help from its global partners, Boulom said.\n“Laos will need to rely on the import of nutrients from overseas. When the government has money, and with donors’ support, you can do it,” he added.\nEssink said the project would be key to tackling malnutrition in Laos.\n“We have to put food fortification within a package of initiatives, and the most important thing is to ensure that people could produce food locally so that it could be sustainable.”","summary":"In some poorer areas, stunting is even more prevalent. Experts say a lack of dietary diversity is a big part of the problem.","url":"https://www.scmp.com/week-asia/health-environment/article/3303443/laos-1-3-children-has-stunted-growth-despite-surplus-rice","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/24/249d6202-b1d3-41c4-9e6e-12ece66bc56a_8a33d2aa.jpg","video":null,"publish_date":"2025-03-24 00:00:11","author":"Leopold Chen","authors":["Leopold Chen"],"language":"en","source_country":"cn","sentiment":-0.271},{"id":303369840,"title":"Disney’s Snow White falls flat with weak $43 million opening weekend","text":"The film’s opening puts it among the smaller ones for Disney live-action remakes, as other films like 2019’s The Lion King and 2017’s Beauty and the Beast grossed over $191 million and over $174 million in their respective opening weekends. The closest opening weekend comparison to Snow White’s would be 2019’s Dumbo remake, which opened to a little less than $46 million and went on to gross under $115 million in North America. \n\nAhead of the release of Snow White, which was delayed from its 2024 release in October 2023, the film generated controversy when Zegler, who plays the title character, expressed hope on social media that President Donald Trump and his supporters would “never know peace.” Zegler later apologized for those remarks, claiming she “let my emotions get the best of me.”\n\nZegler also drew attention in August 2024 when she said “free Palestine.” The actress’s co-star in the film, Gal Gadot, is Israeli and expressed support for Israel in October 2023 following Hamas’s attack on the country.\n\nBILL MAHER REFUSES TO PLAY ‘MEAN GIRLS’ GAME WITH CRITICS OF HIS TRUMP MEETING\n\nReviews for Disney’s latest offering, which only went public about a day before the film began playing in theaters on Thursday, were not particularly kind, as the film currently sits at 43% on movie review website Rotten Tomatoes as of Sunday evening. A little more than a week before release, Disney conducted a scaled back premiere for the film.\n\nShould Snow White continue to suffer at the box office, it will not be the first Disney flick of 2025 to underperform financially, as Captain America: Brave New World only just passed the $400 million mark globally.","summary":"Disney’s latest box office outing finally released over the weekend, though many audiences chose to pass up on the newest remake from the Mouse House. Snow White, a live-action remake of the classic 1937 animated flick Snow White and the Seven Dwarfs, ended its opening weekend on the lower end of box office projections, collecting [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3356451/disney-snow-white-falls-flat-weak-opening-weekend/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/Snow-White-and-Andrew-Burnap-scaled.webp","video":null,"publish_date":"2025-03-23 23:55:15","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":0.178},{"id":303368218,"title":"One million malnourished children in Nigeria and Ethiopia risk losing aid, UNICEF says","text":"The United Nations children's agency said on Friday it will run out of its supply of lifesaving food to treat children suffering from acute forms of malnutrition in Ethiopia and Nigeria within the next two months. due to a lack of funding exacerbated by Trump administration cuts to foreign aid.\n\nSome 1.3 million children under five suffering from severe acute malnutrition risk losing access to lifesaving support this year in Ethiopia and Nigeria, UNICEF says.\n\n\"Without new funding, we will run out of our supply chain of Ready-to-Use-Therapeutic-Food by May, and that means that 70,000 children in Ethiopia that depend on this type of treatment cannot be served,\" Kitty Van der Heijden, UNICEF's deputy executive director, told reporters in Geneva via video link from Abuja on Friday. \"Interruption to continuous treatment is life-threatening.\"\n\nIn Nigeria, UNICEF said it may run out of supplies to feed 80,000 malnourished children as soon as the end of this month. Van der Heijden described recently being in a hospital in Maiduguri with a child who was so malnourished that her skin was falling off.\n\nInternational donors have in recent years reduced contributions to UN agencies, including UNICEF. Its funding woes were accelerated when the United States, its top donor, imposed a 90-day pause on all U.S. foreign aid on the first day of President Donald Trump's return to the White House in January.\n\nThat action, and ensuing orders halting many programmes of the U.S. Agency for International Development worldwide, have jeopardised the delivery of lifesaving food and medical aid, throwing into chaos global humanitarian relief efforts.\n\n\"This funding crisis will become a child survival crisis,\" warned Van der Heijden, adding that the sudden nature of the cuts did not give the agency the ability to mitigate the risks.\n\nFunding cuts have also hit health programmes offering nutrition and malaria care for pregnant women and children in Ethiopia. \n\nTwenty-three mobile health clinics were taken out of operation in the region of Afar, with only seven left operating due to funding cuts, according to UNICEF.","summary":"The United Nations children's agency said on Friday it will run out of its supply of lifesaving food to treat children suffering from acute forms of malnutrition in Ethiopia and Nigeria within the next two months. due to a lack of funding exacerbated by Trump administration cuts to foreign aid.","url":"https://www.myjoyonline.com/one-million-malnourished-children-in-nigeria-and-ethiopia-risk-losing-aid-unicef-says/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/03/image-946.png","video":null,"publish_date":"2025-03-23 23:53:00","author":"Abubakar Ibrahim,Reuters 53pm","authors":["Abubakar Ibrahim","Reuters 53pm"],"language":"en","source_country":"gh","sentiment":-0.513},{"id":303371344,"title":"Expelled South African ambassador returns home, says US sanction is ‘badge of dignity’","text":"The South African ambassador who was expelled from the United States and declared persona non grata by the Trump administration was welcomed home at an airport on Sunday by hundreds of supporters who sang songs praising him.\nCrowds at Cape Town International Airport surrounded Ebrahim Rasool and his wife Rosieda as they emerged in the arrivals terminal in their hometown, and they needed a police escort to help them navigate their way through the building.\n“A declaration of persona non grata is meant to humiliate you,” Rasool told the supporters as he addressed them with a megaphone. “But when you return to crowds like this, and with warmth … like this, then I will wear my persona non grata as a badge of dignity.”\n“It was not our choice to come home, but we come home with no regrets.”\nRasool was expelled for comments he made on a webinar that included him saying that the Make America Great Again movement was partly a response to “a supremacist instinct”.\nRasool said on his return home it was important for South Africa to fix its relationship with the US after President Donald Trump punished the country and accused it of taking an anti-American stance even before the decision to expel him.\nThe US president issued an executive order last month cutting all funding to South Africa, alleging its government is supporting the Palestinian militant group Hamas and Iran, and pursuing anti-white policies at home.\n“We don’t come here to say we are anti-American,” Rasool said to the crowd. “We are not here to call on you to throw away our interests with the United States.”\nThey were the ex-ambassador’s first public comments since the Trump administration declared him persona non grata over a week ago, removed his diplomatic immunities and privileges, and gave him until this Friday to leave the US.\n\nIt is highly unusual for the US to expel a foreign ambassador. Rasool was declared persona non grata by US Secretary of State Marco Rubio in a post on social media on March 14. Rubio said Rasool was a “race-baiting politician” who hates the US and Trump.\nAlthough Rubio did not directly cite a reason, his post linked to a story by the conservative Breitbart news site that reported on a talk Rasool gave on a webinar organised by a South African think-tank.\nIn his talk, Rasool spoke in academic language of the Trump administration’s crackdowns on diversity and equity programmes and immigration and mentioned the possibility of a US where white people soon would no longer be in the majority.\n“The supremacist assault on incumbency, we see it in the domestic politics of the USA, the Maga movement, the Make America Great Again movement, as a response not simply to a supremacist instinct, but to very clear data that shows great demographic shifts in the USA in which the voting electorate in the USA is projected to become 48 per cent white,” Rasool said in the talk.\nOn Sunday, he said he stood by those comments, and characterised them as merely alerting intellectuals and political leaders in South Africa that the US and its politics had changed.\n“It is not the US of Obama, it is not the US of Clinton, it is a different US and therefore our language must change,” Rasool said.\n“I would stand by my analysis because we were analysing a political phenomenon, not a personality, not a nation, and not even a government.”\nHe also said South Africa would resist pressure from the US – and anyone else – to drop its case at the International Court of Justice accusing Israel of genocide against Palestinians in Gaza.\n\nThe Trump administration has cited that case against US ally Israel as one of the reasons it alleges South Africa is anti-American.\nThe Breitbart story Rubio cited when announcing Rasool’s expulsion was written by South African-born senior editor-at-large Joel Pollak, who is Jewish and an ally of the Trump administration.\nPollak is also a contender to be the new US ambassador to South Africa, according to South African media.\nSome of the supporters welcoming Rasool, who is Muslim, home to Cape Town waved Palestinian flags and chanted “free Palestine”.\n“As we stand here, the bombing [in Gaza] has continued and the shooting has continued, and if South Africa was not in the [International Court of Justice[, Israel would not be exposed, and the Palestinians would have no hope,” Rasool said.\n“We cannot sacrifice the Palestinians … but we will also not give up with our relationship with the United States. We must fight for it, but we must keep our dignity.”","summary":"Ebrahim Rasool was ejected over comments, including that ‘Make America Great Again’ movement was partly a response to ‘supremacist instinct’.","url":"https://www.scmp.com/news/world/africa/article/3303559/expelled-south-african-ambassador-returns-home-says-us-sanction-badge-dignity","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/24/826bbef8-ed0c-40e1-a1e2-642bc8586241_3ae836d4.jpg","video":null,"publish_date":"2025-03-23 23:52:52","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.167},{"id":303369566,"title":"Tiger Woods breaks silence on his romance with Vanessa Trump","text":"‘Love is in the air’ for Tiger Woods and Vanessa Trump (Picture: Instagram)\n\nTiger Woods has appeared to confirm his relationship with the ex-wife of Donald Trump Jr, Vanessa. \n\nIt has been a turbulent few weeks for the 15-times Major champion who had only just begun to come to terms with the death of his mother, before sustaining another career-threatening injury. \n\nSpeculation had been rife that Woods had been dating Vanessa Trump, whose marriage with the son of the current President ended in 2018.\n\nThe pair, who have three children between them who attend the same school in Florida, have reportedly been seeing each other since November.\n\nA source told DailyMail.com earlier this week: ‘Tiger and Vanessa have been seeing each other since just before Thanksgiving.\n\n‘She comes to his place on Jupiter Island. They’re not living together. She comes over maybe a few nights a week.\n\n‘They just love hanging out, having dinner and schmoozing together. They’re sticking close to home, have decided not to make it a thing and go out in public. Not just yet anyway.’\n\n Tiger Woods and Vanessa Trump have been dating since November (Picture: Instagram)\n\nWoods has clearly had a change of heart, however, and went public with the relationship on Sunday evening. \n\nPosting a picture of himself next to his new girlfriend, he wrote: ‘Love is in the air and life is better with you by my side! \n\n‘We look forward to our journey through life together. At this time we would appreciate privacy for all those close to our hearts.’\n\nWith his relationship now out in the open, Woods can now focus on his rehabilitation from the Achilles injury which has ruled him out of next month’s Masters at Augusta. \n\n Tiger Woods is dating the ex-wife of Donald Trump’s son (Picture: Getty)\n\n‘I’ve texted him as soon as it happened, he got back to me, I’ve texted him on a couple of other things – TGL, his daughter just won the state soccer thing,’ Woods’ close friend Fred Couples revealed earlier this month following confirmation of his injury setback.\n\n‘That was before he hurt himself, he was on cloud 20. He is in great spirits for a ruptured Achilles, he really is. He’ll be fine.\n\n‘It’s such a bummer because people think ‘when is he going to play?’. He was scheduled to play a few events, not a ton but a few events.\n\n‘And his mother passing away would slow anyone down but he is my man and texting him is a lot of fun.’ \n\n Tiger Woods will miss the upcoming Masters with an Achilles injury (Picture: Getty)\n\nWoods was preparing for his latest comeback at home in Florida when he felt a ‘sharp pain’ in his left heel that turned out to a devastating blow.\n\nIn a statement, Woods said: ‘As I began to ramp up my own training and practice at home, I felt a sharp pain in my left Achilles, which was deemed to be ruptured.\n\n‘This morning, Dr. Charlton Stucken of Hospital for Special Surgery in West Palm Beach, Florida performed a minimally-invasive Achilles tendon repair for a ruptured tendon.\n\n‘I am back home now and plan to focus on my recovery and rehab, thank you for all the support.’","summary":"","url":"https://metro.co.uk/2025/03/23/tiger-woods-breaks-silence-romance-vanessa-trump-22776660/","image":"https://metro.co.uk/wp-content/uploads/2025/03/image-7f25.png","video":null,"publish_date":"2025-03-23 23:50:27","author":"James Goldman","authors":["James Goldman"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.177},{"id":303370430,"title":"US and Ukraine hold talks in Saudi Arabia","text":"The US and Ukraine held talks in Riyadh, Saudi Arabia on Sunday, discussing a potential ceasefire between Moscow and Kiev. \n\nThe meeting took place as the White House is planning to arrange “indirect talks” between Russian and Ukrainian teams. The “technical” negotiations between Russia and the US will begin in Saudi Arabia on Monday, according to US President Donald Trump’s Ukraine envoy, Keith Kellogg. \n\n“The discussion was productive and focused – we addressed key points including energy,” Ukrainian Defense Minister Rustem Umerov wrote on X on Sunday. He added that Ukrainian leader Vladimir Zelensky was determined to reach “a just and lasting peace.”\n\nAccording to Umerov, the sides discussed “proposals to protect energy facilities and critical infrastructure.”\n\nEarlier this week, Russia and Ukraine agreed to Trump’s proposal to stop attacks on energy infrastructure for 30 days. \n\nThe Ukrainian troops have since struck an oil depot in Russia’s Krasnodar Region and, according to the Russian Defense Ministry, blew up a gas metering station near Sudzha in Kursk Region. Moscow accused Ukraine of violating the ‘energy truce’ and warned that it reserves the right to retaliate.\n\nTrump Middle East envoy, Steve Witkoff, told Fox News on Sunday that he remained optimistic about the upcoming meeting with the Russians. “I think that you’re going to see in Saudi Arabia on Monday some real progress, particularly as it affects a Black Sea ceasefire on ships between both countries,” he said. \n\nWitkoff told journalist Tucker Carlson in an interview published on Friday that the US intends to broker a 30-day full ceasefire that would be followed by a permanent truce.","summary":"The US and Ukraine held talks in Riyadh on Sunday as part of Trump’s shuttle diplomacy aimed at ending the conflict with Russia \nRead Full Article at RT.com","url":"https://www.rt.com/news/614673-us-ukraine-hold-talks/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67e078702030277cf31a5255.jpg","video":null,"publish_date":"2025-03-23 23:50:15","author":null,"language":"en","source_country":"ru","sentiment":0.016},{"id":303373166,"title":"Read the email Paul Weiss Chairman Brad Karp sent to staff after striking a deal with Trump: 'Clients perceived our firm as being persona non grata'","text":"Paul Weiss Chairman Brad Karp knows some employees feel uneasy about the law firm's deal with the Trump administration.So he sent an email.Paul Weiss is among several major firms that President Donald Trump has targeted this month with executive orders over their DEI policies and political affiliations. The orders revoked the security clearance of lawyers at Paul Weiss and called for the review of the firm's government contracts. The firm is associated with Trump's political rivals, including attorney Mark Pomerantz, who left the firm to join the Manhattan district attorney's investigation into Trump's finances.After the order, uncertainty gripped the law firm and it began losing clients. Then, Trump announced on Friday he had reached a resolution with Paul Weiss and withdrew the executive order. The resolution included specific stipulations, including providing $40 million in pro bono services to the administration.The deal shocked some in the legal community, which was alarmed by what some saw as a capitulation by the powerful firm. Karp attempted to address those concerns in an email to staffers on Sunday. The email was first reported by the legal publication Original Jurisdiction. A Paul Weiss representative confirmed the contents of the email to Business Insider.Here is a copy of the full email","summary":"Paul Weiss Chairman Brad Karp sent an email to employees on Sunday explaining why the law firm struck a deal with President Donald Trump last week.","url":"https://www.businessinsider.com/paul-weiss-brad-karp-email-staff-trump-deal-executive-order-2025-3","image":"https://i.insider.com/67e08c4163d72727e1980644?width=1200&format=jpeg","video":null,"publish_date":"2025-03-23 23:44:52","author":"Lauren Edmonds","authors":["Lauren Edmonds"],"language":"en","source_country":"us","sentiment":-0.654},{"id":303367996,"title":"Tiger Woods and Vanessa Trump Confirm Relationship with Surprise Announcement","text":"Tiger Woods and Vanessa Trump have gone public with their relationship by posting two pictures on social media, declaring ‘love is in the air’.\n\nIt comes 10 days after DailyMail.com exclusively broke the news that the golf icon was dating Donald Trump Jr.’s ex-wife. \n\nAlongside two pictures of the loved-up couple, Woods wrote on Sunday night: ‘Love is in the air and life is better with you by my side! We look forward to our journey through life together. \n\n‘At this time we would appreciate privacy to all those close to our hearts.’\n\nWoods, 49, and Vanessa, 47, who both live in Florida, have been together since Thanksgiving, DailyMail.com confirmed with four sources.\n\nThey live 20 minutes apart in the wealthy southern Florida enclave of Palm Beach and were spotted together at a golf tournament last month.\n\nVanessa’s eldest daughter Kai, 17, and Woods’ children Charlie, 16, and Sam, 17, all attend the $38,595-a-year The Benjamin School together.\n\nWoods and Vanessa were absent from the junior golf tournament in South Carolina that both Kai and Charlie played in this week.\n\nDon Jr. was also absent from the contest, despite sources saying he is ‘cool’ with his ex-wife’s new relationship. Woods’s ex-wife Elin Nordegren was also a no-show at the event. \n\nOther members of the Trump family, including all five of Vanessa and Don Jr.’s children, were already aware they are an item, one source said.\n\nA source said: ‘Tiger and Vanessa have been seeing each other since just before Thanksgiving.\n\n‘She comes to his place on Jupiter Island. They’re not living together. She comes over maybe a few nights a week.\n\n‘They just love hanging out, having dinner and schmoozing together. They’re sticking close to home, have decided not to make it a thing and go out in public. Not just yet anyway.’\n\nThe former model and mother of five filed for an uncontested divorce from Don Jr. on March 15, 2018 in New York.\n\nSince they officially split she has not had a high-profile relationship.\n\nDon Jr. has remained a close adviser to his father and helped take over much of the business.\n\nThe two families appear to have become increasingly close. \n\nLast month, at the PGA Tour’s Genesis Invitational at Torrey Pines in California, they were pictured arriving together.\n\nKai, who committed to playing golf at the University of Miami next year, wore an outfit from Woods’ clothing line.\n\nIn February, Vanessa took Kai to watch a round of the TGL, the golf league created by Woods and Rory McIlroy.\n\nMeanwhile, President Trump met up with Woods for a round of golf last month.\n\nWoods recently suffered a major setback in his plan to return to golf when he revealed he had ruptured his Achilles tendon.\n\nThe 15-time major winner was preparing for his latest comeback at home in Florida when he felt a ‘sharp pain’ in his left heel.\n\nHe underwent surgery on March 11 and is expected to make a full recovery, but has been ruled out of the Masters next month.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTiger Woods and Vanessa Trump have gone public with their relationship by posting&#8230;\n\n\nThis Post: Tiger Woods and Vanessa Trump Confirm Relationship with Surprise Announcement first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/tiger-woods-and-vanessa-trump-confirm-relationship-with-surprise-announcement/","image":"https://i.dailymail.co.uk/1s/2025/03/23/23/96494291-14529163-Tiger_Woods_and_Vanessa_Trump_have_gone_public_with_their_relati-m-34_1742771437221.jpg","video":null,"publish_date":"2025-03-23 23:42:45","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.278},{"id":303377226,"title":"Joe Rogan Breaking With Donald Trump? Star Podcaster Calls THIS POTUS Decision 'Dumb'","text":"Podcaster Joe Rogan recently broke with President Donald Trump on Canada, opposing the US President's stance on making Canada the 51st state. On the March 14 episode of The Joe Rogan Experience with comedian Mark Kosta, Rogan called the ongoing trade war between the US and Canada \"ridiculous\" and urged the two countries to \"get along.\" While Rogan has been a vocal supporter of Trump, who has repeatedly suggested the idea of Canada joining the US — even implementing 25% tariffs on the country — the 57-year-old took a firm stance against it. “I don’t really think they should be our 51st state. There. I said it,” he admitted with a laugh. He further elaborated, saying, \"I just want America and Canada to get along. This is so ridiculous. We have to become friends with Canada again. This is the dumbest f--king feud.\" Though Rogan rejected the idea of Canada becoming the 51st state, he did entertain the notion of adding Greenland to the US, joking that it might be \"more accessible\" and could even be bought. He added, “If we want a 51st state, it’s Greenland.” Rogan also made light of the situation, suggesting that global warming could eventually make Greenland a more habitable place, saying, \"It would be good to have a cold spot to eventually warm up.\" Also read: What Happened To Sunita 'Suni' Williams' Chin? Fact-Checking Viral Before And After Videos Meanwhile, Trump has continued to criticize Canada's trade practices, claiming that the US has been subsidizing the country for too long. On Truth Social, Trump recently threatened to implement more tariffs, calling Canada a \"tariff abuser\" ahead of new tariffs set to take effect on April 2. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News, World and around the world.","summary":"Joe Rogan rejected President Donald Trump's idea of Canada becoming the 51st US state, calling the trade feud between the two countries \"ridiculous.\" The podcaster, who is a staunch supporter of the President, jokingly suggested Greenland could be a better option to become the US' next state.","url":"https://www.timesnownews.com/world/us/us-news/joe-rogan-breaking-with-donald-trump-star-podcaster-calls-this-potusdecisiondumb-article-119395443","image":"https://static.tnn.in/thumb/msid-119395464,thumbsize-745128,width-1280,height-720,resizemode-75/119395464.jpg","video":null,"publish_date":"2025-03-23 23:41:12","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.187},{"id":303369508,"title":"Tiger Woods makes Vanessa Trump relationship official in heartfelt post: ‘Love is in the air’","text":"Tiger Woods is making it social media official.\n\nThe golfer made his first public comments about his romantic relationship with Vanessa Trump, the ex-wife of Donald Trump Jr., weeks after news of the romance became public.\n\n“Love is in the air and life is better with you by my side! We look forward to our journey through life together. At this time we would appreciate privacy to all those close to our hearts,” Woods posted across his social channels Sunday evening.\n\nVanessa also shared a similar post on her Instagram Story, in what appeared to be a coordinated release for the couple.\n\nThe Post had confirmed earlier this month that the pair had quietly started dating after a friendship developed into “something more,” a source had said.\n\nThe relationship had been described as “not too serious” but that it was “heading in that direction, though.”","summary":"Tiger Woods is making it social media official.","url":"https://nypost.com/2025/03/23/sports/tiger-woods-makes-vanessa-trump-relationship-official-in-heartfelt-post/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/newspress-collage-g4v34troq-1742772899616.jpg?quality=75&strip=all&1742758560&w=1200","video":null,"publish_date":"2025-03-23 23:40:22","author":"Christian Arnold","authors":["Christian Arnold"],"language":"en","source_country":"us","sentiment":0.177},{"id":303371728,"title":"Greenland PM furious at visits by US officials after Trump threatens takeover: ‘Highly aggressive’","text":"Greenland has accused the Trump administration of being “highly aggressive” by sending a delegation of senior officials to the territory this week. \n\nPresident Donald Trump’s national security adviser Mike Waltz is visiting Greenland early this week with the U.S. energy secretary Chris Wright, according to reports, in addition to a separate trip by Second Lady Usha Vance on Thursday. \n\nThe trips come after Trump’s repeated threats to annex the autonomous territory.\n\nGreenland’s prime minister Mute B. Egede was quoted in a Greenlandic newspaper Sunday furiously questioning why Waltz was visiting. \n\n“We are now at a level where it can in no way be characterized as a harmless visit from a politician's wife,” Egede said, according to Greenland’s Sermitsiaq newspaper. “What is the national security adviser doing in Greenland? The only purpose is to demonstrate power over us.” \n\n“He is Trump's confidential and closest advisor, and his presence in Greenland alone will certainly make the Americans believe in Trump's mission, and the pressure will increase after the visit,” Egede added.\n\nThe Independent has contacted the White House for comment. \n\nIt was announced Sunday that Vance would visit Greenland from Thursday until Saturday, accompanied by her son.\n\nVance will “visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland’s national dogsled race,” the White House said in a statement. \n\nThe race features 737 mushers and 444 dogs in a “remarkable display of speed, skill, and teamwork,” the statement said. Vance and “the delegation are excited to witness this monumental race and celebrate Greenlandic culture and unity,” it added.\n\nLess information is known about Walz’s trip, which has been reported by the New York Times and CBS News. \n\nThe planned visits follows Trump’s repeated threats to annex the autonomous territory and claim it for the U.S. The president claimed, “we need that for international security, not just national security.” \n\nA longstanding defense agreement between the United States and Denmark allows the U.S. to operate military facilities in Greenland, including Ptiuffik Space Base, formerly known as Thule Air Base.\n\nThe U.S. once offered to purchase the island in the wake of the Second World War but the Danish government declined the offer. The Danish government and the Greenlandic government have both said that the territory is not up for sale.\n\n“I think it’ll happen,” Trump told reporters earlier this month while he sat next to NATO Secretary-General Mark Rutte. Trump questioned whether Denmark still had a right to claim the world’s largest island as part of its kingdom.\n\n“A boat landed there 200 years ago or something. And they say they have rights to it,” Trump said. “I don’t know if that’s true. I don’t think it is, actually.”\n\nAll five parties in Greenland’s parliament issued a joint statement last week rejecting Trump’s remarks. Denmark has recognized Greenland’s right to independence at a time of its choosing.\n\nTrump’s son, Donald Trump Jr, traveled to Greenland in early January to explore his father's interest in purchasing the island but left very quickly.\n\n“Incredible experience,” he said of the trip that lasted less than a day. “By the way, they love America here. They love America. They love Trump,” he said in a video he posted to social media at the time.","summary":"Greenland’s prime minister hit out at the visits planned this week for Trump national security adviser Mike Waltz and Second Lady Usha Vance","url":"https://www.independent.co.uk/news/world/americas/us-politics/usha-vance-greenland-trump-b2720217.html","image":"https://static.independent.co.uk/2025/03/23/23/49/AP25074615972267.jpeg?trim=1,0,1,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/rq8FZooq-4VHSaSK0.mp4","publish_date":"2025-03-23 23:38:45","author":"Rhian Lubin","authors":["Rhian Lubin"],"language":"en","source_country":"gb","sentiment":0.06},{"id":303369160,"title":"Greenland PM furious at visits by US officials after Trump threatens takeover: ‘Highly aggressive’","text":"Greenland has accused the Trump administration of being “highly aggressive” by sending a delegation of senior officials to the territory this week.\n\nPresident Donald Trump’s national security adviser Mike Waltz is visiting Greenland early this week with the U.S. energy secretary Chris Wright, according to reports, in addition to a separate trip by Second Lady Usha Vance on Thursday.\n\nThe trips come after Trump’s repeated threats to annex the autonomous territory.\n\nGreenland’s prime minister Mute B. Egede was quoted in a Greenlandic newspaper Sunday furiously questioning why Waltz was visiting.\n\n“We are now at a level where it can in no way be characterized as a harmless visit from a politician's wife,” Egede said, according to Greenland’s Sermitsiaq newspaper. “What is the national security adviser doing in Greenland? The only purpose is to demonstrate power over us.”\n\n“He is Trump's confidential and closest advisor, and his presence in Greenland alone will certainly make the Americans believe in Trump's mission, and the pressure will increase after the visit,” Egede added.\n\nThe Independent has contacted the White House for comment.\n\nIt was announced Sunday that Vance would visit Greenland from Thursday until Saturday, accompanied by her son.\n\nVance will “visit historical sites, learn about Greenlandic heritage, and attend the Avannaata Qimussersu, Greenland’s national dogsled race,” the White House said in a statement.\n\nThe race features 737 mushers and 444 dogs in a “remarkable display of speed, skill, and teamwork,” the statement said. Vance and “the delegation are excited to witness this monumental race and celebrate Greenlandic culture and unity,” it added.\n\nLess information is known about Walz’s trip, which has been reported by the New York Times and CBS News.\n\nThe planned visits follows Trump’s repeated threats to annex the autonomous territory and claim it for the U.S. The president claimed, “we need that for international security, not just national security.”\n\nA longstanding defense agreement between the United States and Denmark allows the U.S. to operate military facilities in Greenland, including Ptiuffik Space Base, formerly known as Thule Air Base.\n\nThe U.S. once offered to purchase the island in the wake of the Second World War but the Danish government declined the offer. The Danish government and the Greenlandic government have both said that the territory is not up for sale.\n\n“I think it’ll happen,” Trump told reporters earlier this month while he sat next to NATO Secretary-General Mark Rutte. Trump questioned whether Denmark still had a right to claim the world’s largest island as part of its kingdom.\n\n“A boat landed there 200 years ago or something. And they say they have rights to it,” Trump said. “I don’t know if that’s true. I don’t think it is, actually.”\n\nAll five parties in Greenland’s parliament issued a joint statement last week rejecting Trump’s remarks. Denmark has recognized Greenland’s right to independence at a time of its choosing.\n\nTrump’s son, Donald Trump Jr, traveled to Greenland in early January to explore his father's interest in purchasing the island but left very quickly.\n\n“Incredible experience,” he said of the trip that lasted less than a day. “By the way, they love America here. They love America. They love Trump,” he said in a video he posted to social media at the time.","url":"https://uk.news.yahoo.com/greenland-pm-furious-visits-us-233845576.html","image":"https://media.zenfs.com/en/the_independent_577/ebbc26649e5f182b43aacaa741f4353a","video":"","publish_date":"2025-03-23 23:38:45","author":"Rhian Lubin","authors":["Rhian Lubin"],"language":"en","source_country":"gb","sentiment":0.06},{"id":303366876,"title":"Tiger Woods confirms Vanessa Trump relationship on social media: 'Love is in the air'","text":"Tiger Woods confirmed his relationship status on Sunday in a social media post. He’s clearly taken. Woods announced his relationship with Vanessa Trump on X and Instagram and shared some photos of the two together cozying next to each other. Trump is President Donald Trump’s former daughter-in-law. She was married to Donald Trump Jr. until 2018. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"Love is in the air and life is better with you by my side! We look forward to our journey through life together. At this time we would appreciate privacy for all those close to our hearts.,\" Woods wrote in his post. A source told The Daily Mail earlier this month the two had been dating for at least a year. Woods' son, Charlie, and Vanessa's daughter, Kai, are both competitive golfers. Kai has committed to play at the University of Miami, while Charlie has played alongside his father at tournaments. Charlie has also played at the U.S. Open qualifiers, and both Charlie and Kai played at the same tournament last month. GOLFER ADAM HADWIN SLAMS CLUB IN FRUSTRATION, ACCIDENTALLY SETS OFF SPRINKLER IN HILARIOUS MOMENT Woods was photographed with Kai at the Genesis Invitational. Vanessa and Kai also took in a TGL match last month, which was created by Woods and Rory McIlroy. After his highly publicized divorce from Elin Nordegren, Woods was linked to Olympic skier Lindsey Vonn in the 2010s. He was dating Erica Herman at the time he won the Masters in 2019, but they, too, had a very public breakup that included sexual harassment allegations and an NDA lawsuit filed by Herman. Woods and Nordegren have appeared to be amicable in recent years as they co-parent Charlie and Sam Woods. Woods announced earlier this week he had undergone surgery for a ruptured Achilles sustained while training at home, putting his entire 2025 golf season in jeopardy. CLICK HERE TO GET THE FOX NEWS APP He has played in just 18 events since the start of the new decade, and his best finish in a major during that span is a tie for 38th at the 2020 Masters. Fox News’ Ryan Morik contributed to this report. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Golf legend Tiger Woods announced on Sunday he and Vanessa Trump are dating. Woods revealed his relationship situation in posts across social media.","url":"https://www.foxnews.com/sports/tiger-woods-confirms-vanessa-trump-relationship-social-media-love-air","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/tiger-and-vanessa.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-23 23:37:24","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","source_country":"US","sentiment":0.612},{"id":303365930,"title":"Tiger Woods confirms romance with Vanessa Trump: ‘Life is better with you’","text":"He thinks she’s tee-rrific.\n\nTiger Woods has confirmed his new romance with Vanessa Trump, nearly two weeks after Page revealed the two were secretly dating.\n\n“Love is in the air and life is better with you by my side!” the pro golfer posted via X Sunday, along with two loved-up photos with Donald Trump Jr.’s ex-wife.\n\n“We look forward to our journey through life together,” he added. “At this time we would appreciate privacy to all those close to our hearts.”","summary":"A source exclusively told Page Six earlier this month that Woods and Trump were a \"good match.\"","url":"https://pagesix.com/2025/03/23/celebrity-news/tiger-woods-confirms-romance-with-vanessa-trump-life-is-better-with-you/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/03/101011883.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-23 23:22:56","author":"Gabi Duncan","authors":["Gabi Duncan"],"language":"en","category":"entertainment","source_country":"zm","sentiment":0.092},{"id":303369842,"title":"Trump administration sends first deportation flight to Venezuela after Maduro lifted pause","text":"It is unclear at this time how many migrants are on the flight, though two planes sent to El Salvador last weekend had roughly 250 suspected Tren de Aragua gang members onboard.\n\nMaduro and his regime stopped accepting deportation flights from the United States after the U.S. Treasury Department moved to cancel Chevron’s license to pump oil in the country past April 3. However, President Donald Trump is reportedly now open to extending the license, while also pushing for tariffs or other financial penalties on countries that buy oil from Venezuela.\n\nThe deal struck over the weekend lifting the pause did not include any new details about Chevron’s license and whether it will be canceled or extended.\n\nMaduro has been critical of Trump’s deportation efforts last weekend and signaled that he also wants those migrants sent to Venezuela, pinning blame on El Salvador’s president, Nayib Bukele.\n\n“You [Bukele] have to guarantee their health and sooner rather than later, you have to free them and hand them over,” he said.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nVenezuelan National Assembly President Jorge Rodriguez, who is Maduro’s chief negotiator with the U.S., also decried Trump’s previous deportations and urged the suspected gang members’ immediate return from El Salvador.\n\n“Migrating isn’t a crime, and we won’t rest until everyone who wants to return is back and we rescue our kidnapped brothers in El Salvador,” Rodriguez said.","summary":"The Trump administration directed a deportation flight to Venezuela on Sunday, just one day after the two countries struck a deal that included President Nicolas Maduro lifting his pause on accepting the planes. Venezuelan Interior Minister Diosdado Cabello signaled the plane would be arriving at 8 p.m. ET at an airport near the country&#8217;s capital, [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3356459/trump-administration-first-deportation-flight-venezuela-maduro-lifted-pause/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/venezuela-first-deportation-flight-lifting-pause.webp","video":null,"publish_date":"2025-03-23 23:22:12","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","category":"politics","source_country":"US","sentiment":0.002},{"id":303368002,"title":"Chairman explains deal with Trump after law firm faced potential destruction from his focus","text":"WASHINGTON – The chairman of a prominent law firm who cut a deal with President Donald Trump last week to avert the consequences of a White House executive order told colleagues in an email Sunday that he did so because the order “could easily have destroyed our firm” and put it out of business.\n\nIn his email, Brad Karp gives the most detailed public explanation yet about his decision to make significant concessions to the White House in the face of an executive order that targeted his firm, Paul, Weiss, Rifkind, Garrison & Wharton.\n\nThe order, the latest in a series of similar actions targeting law firms whose lawyers have performed legal work that Trump disagrees with, threatened the suspension of security clearances for Paul Weiss attorneys as well as the termination of any federal contracts involving the firm. It cited as an explanation the fact that a former Paul Weiss attorney, Mark Pomerantz, had been a central player in an investigation by the Manhattan district attorney’s office into Trump’s finances before Trump became president.\n\nOn Thursday evening, though, Trump announced that he had rescinded the order following a White House meeting with Karp. The White House said the firm had agreed to dedicate $40 million worth of free legal services to support the Trump administration agenda, including on countering antisemitism; to not pursue diversity, equity and inclusion considerations in its hiring practices; and to take on clients regardless of political affiliation.\n\nThe resolution triggered an intense backlash within the legal community, with lawyers criticizing the firm for capitulating to Trump rather than standing up to him, particularly at a time when he’s using the power of the presidency to threaten the livelihoods of attorneys and companies he believes have crossed him. The deal also reflected Trump’s recent success in extracting concessions from a broad swath of targets, in both academia and private industry, who have opted to compromise rather than fight.\n\nIn an email to Paul Weiss employees obtained by The Associated Press, Karp described the order as having presented an “existential crisis” for the firm. He said it was very likely the firm would not have been able to survive a protracted fight with the Trump administration.\n\n“The executive order could easily have destroyed our firm,” Karp wrote. “It brought the full weight of the government down on our firm, our people, and our clients. In particular, it threatened our clients with the loss of their government contracts, and the loss of access to the government, if they continued to use the firm as their lawyers. And in an obvious effort to target all of you as well as the firm, it raised the specter that the government would not hire our employees.”\n\nKarp wrote that the firm was initially prepared to challenge the executive order in court, something another law firm targeted with a Trump executive order, Perkins Coie, has done. Even as a team of attorneys prepared a complaint, he said, “it became clear that, even if we were successful in initially enjoining the executive order in litigation, it would not solve the fundamental problem, which was that clients perceived our firm as being persona non grata with the Administration.”\n\nHe also said that the support he hoped the firm would receive from other law firms never materialized.\n\n“Disappointingly, far from support, we learned that certain other firms were seeking to exploit our vulnerabilities by aggressively soliciting our clients and recruiting our attorneys,” he wrote.\n\nAgainst that backdrop, when the firm learned that the administration might be willing to cut a deal, it sought to do so and negotiated a settlement in a “matter of days.”\n\n“I know many of you are uncomfortable that we entered into any sort of resolution at all. That is completely understandable,” Karp wrote to his colleagues, adding that “there was no right answer to the predicament in which we found ourselves.”\n\nHe added: “It is very easy for commentators to judge our actions from the sidelines. But no one in the wider world can appreciate how stressful it is to confront an executive order like this until one is directed at you.”\n\nThe firm is one of numerous Trump targets that have recently reached agreements with the administration rather than further provoke the president’s ire.\n\nOn Friday, for instance, Columbia University agreed to put its Middle East studies department under new supervision and overhaul its rules for protests and student discipline, acquiescing to an ultimatum by the Trump administration to implement those changes or risk losing billions of dollars in federal funding.\n\nMeta and ABC made settlement payments to Trump’s future presidential library to end lawsuits filed by Trump. Other tech and financial firms have publicly rolled back DEI programs in line with Trump’s policy interests.\n\nAssociated Press writer Zeke Miller in Washington contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – The chairman of a prominent law firm who cut a&#8230;\n\n\nThis Post: Chairman explains deal with Trump after law firm faced potential destruction from his focus first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/chairman-explains-deal-with-trump-after-law-firm-faced-potential-destruction-from-his-focus/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/MISV743OPRACXJCIZW4YGNTEH4.jpg","video":null,"publish_date":"2025-03-23 23:20:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.336},{"id":303365008,"title":"Anduril is considering a UK factory as Europe beefs up military power","text":"Autonomous drone maker Anduril says it will consider manufacturing in the UK as Europe looks to bolster its military power.\"If we get enough orders, absolutely we are planning to open a facility in the UK,\" Rich Drake, the company's UK and Europe manager, told Bloomberg.The European Union earlier this month said it sought to boost defense spending during what it called a new \"era of rearmament.\" The announcement followed President Donald Trump's order to pause US military aid to Ukraine after a contentious televised meeting with President Volodymyr Zelenskyy.Anduril Industries, cofounded in 2017 by Oculus founder Palmer Luckey, is one of the defense industry's leaders in autonomous drone manufacturing. Over the past few years, Anduril has won hundreds of millions in defense contracts from the US government, including a $642 million deal this month to create anti-drone tech for Marine Corps bases.London-based logistics company Sifted first reported on March 18 that Anduril was considering building a factory, as well as a research and development center, near Oxford and Cambridge, which the UK government has said it wants to be the country's next \"Silicon Valley.\"On March 6, the UK government awarded Anduril £30 million to supply its Altius 600m and Altius 700m drones to Ukraine. The drones, which are known as \"loitering munitions,\" are designed to monitor an area before striking targets that enter it, the UK Ministry of Defence said in a press release.The ministry said Anduril continues to \"invest significantly\" in the UK, has a \"large footprint across the country,\" and plans to scale rapidly.\"Our focus on developing and deploying technology where and when it's needed is at the core of everything we do — from the rapid delivery of Altius to Ukraine to the expansion of our presence here in the UK,\" Drake said in the release. \"We look forward to strengthening our partnership with the Ministry of Defence to protect our nation and our allies.\"Anduril did not immediately return a request from Business Insider for comment.","summary":"The UK defence ministry said Anduril continues to \"invest significantly\" in the UK and plans to scale rapidly.","url":"https://www.businessinsider.com/anduril-uk-factory-drones-europe-military-power-ukraine-2025-3","image":"https://i.insider.com/67e08bcb63d72727e1980639?width=1200&format=jpeg","video":null,"publish_date":"2025-03-23 23:20:52","author":"Kenneth Niemeyer","authors":["Kenneth Niemeyer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.277},{"id":303366174,"title":"Talk-show host Conan O’Brien to receive Mark Twain humour prize at revamped Kennedy Centre","text":"Conan O’Brien takes home the Mark Twain Prize for American Humour on Sunday but the spotlight will be as much on the Kennedy Centre, where he will be accepting the prize, as the Emmy-winning comedian himself.\nO’Brien, who joins a long list of high-profile humorists who have received the award, will be celebrated at an evening show with tributes and jokes by a slew of comic greats that will be broadcast at a later date on Netflix.\nThe show is the first signature event at the Kennedy Centre since its takeover by US President Donald Trump, who last month announced he would become chairman of the institution, pushing out billionaire philanthropist David Rubenstein.\nTrump dismissed board members appointed by former US president Joe Biden and installed officials loyal to him.\nHe handed leadership reins for the facility to Richard Grenell, a close Trump ally and former ambassador to Germany who is serving as envoy for special missions in the current administration.\nThe new board, which includes White House chief of staff Susie Wiles and Usha Vance, wife of Vice-President J.D. Vance, fired its former president, Deborah Rutter. Trump visited the centre last week and declared it in “tremendous disrepair”.\n\nAlong with the annual Kennedy Centre Honours in December, the Mark Twain Prize is one of the main events at the renowned arts institution, complete with red-carpet arrivals for its performers and stars.\nIn the wake of Trump’s takeover of the Kennedy Centre, several artists, including the producers of Hamilton and actress and writer Issa Rae, announced they were cancelling appearances at the venue.\nOthers have chosen to perform while making their sentiments known from the stage. Leftist comic W Kamau Bell directly addressed the controversy in his performance just days after the shake-up. Earlier this month, cellist Erin Murphy Snedecor ended her set with a performance of the Woody Guthrie protest anthem All You Fascists Bound to Lose.\nTrump is not expected to attend the event on Sunday and did not attend any of the Honours performances during his first term as president. His presence, however, is likely to loom over the evening.\nO’Brien hosted the Oscars earlier this month and is scheduled to come back in the emcee role next year. He was the host of Late Night with Conan O’Brien and The Tonight Show with Conan O’Brien on NBC and Conan on TBS. He is a former writer for Saturday Night Live.\nMark Twain recipients typically receive tributes and testimonials from a star-studded collection of comics and celebrities. Given the nature of comedians, it seems likely that some of them on Sunday evening will address the issue of the institution’s uncertain future.\nPrevious winners of the Mark Twain Prize include Kevin Hart, Whoopi Goldberg, Adam Sandler, George Carlin, Jon Stewart, Julia Louis-Dreyfus, Carol Burnett, Bill Murray and Dave Chappelle.\nAdditional reporting by Associated Press","summary":"O’Brien was named latest recipient of lifetime achievement award in January, 3 weeks before Trump ousted Kennedy Centre’s president.","url":"https://www.scmp.com/news/world/united-states-canada/article/3303556/talk-show-host-conan-obrien-receive-mark-twain-humour-prize-revamped-kennedy-centre","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/24/5c2d44b8-a492-4dba-8a63-778deb4ae103_bfa3c5e3.jpg","video":null,"publish_date":"2025-03-23 23:20:17","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"cn","sentiment":0.115},{"id":303368228,"title":"Former US attorney for Eastern District of Virginia found dead","text":"Jessica Aber, the former US attorney for the Eastern District of Virginia, was found dead at a residence on Saturday morning.\n\nPolice in Alexandria, Virginia, responded to reports of an unresponsive woman at about 09:18 local time (13:00 GMT), the department said in a statement.\n\nOfficers then located a deceased woman, who they later identified as Ms Aber, police said.\n\nMs Aber, 43, was appointed by former President Joe Biden in 2021. She stepped down in January when Donald Trump took office.\n\nPolice said an investigation into her death was underway and Virginia's chief medical examiner will determine the cause.\n\nMs Aber graduated from the University of Richmond in Virginia in 2003, before attending William & Mary Law School in Williamsburg, Virginia. She clerked for then-Magistrate Judge M. Hannah Lauck of the US District Court for the Eastern District of Virginia from 2006 to 2007.\n\nShe started in the Eastern District of Virginia in 2009 as an assistant US attorney, and worked on cases involving financial fraud, public corruption, and child exploitation cases, according to the Department of Justice website.\n\nIn 2016, Ms Aber was promoted to the district's deputy chief of the criminal division.\n\nBiden nominated her to lead the Eastern District of Virginia in August 2021, and she was unanimously confirmed by the US Senate.\n\nAs the district's top prosecutor, she oversaw a staff about 300 prosecutors, litigators and support staff.\n\nShe stepped down from the position in early 2025 when Donald Trump took office.\n\nUS attorneys are appointed by the president. It is common for sitting US attorneys to step down when new presidential administration arrives, or for new presidents to later choose a new top prosecutor.\n\nIn statement, her successor, interim US Attorney Erik S Siebert said the office was \"heartbroken beyond words\".\n\n\"She was unmatched as a leader, mentor, and prosecutor, and she is simply irreplaceable as a human being,\" said Mr Siebert, who joined the division in 2010, the year after Ms Aber.\n\nUS Senator Tim Kaine, a Virginia Democrat, called Ms Aber an \"exceptional public servant who dedicated her life to serving her fellow Virginians\".","summary":"Jessica Aber, the former US attorney for the Eastern District of Virginia, was found dead at a residence on Saturday morning.","url":"https://www.myjoyonline.com/former-us-attorney-for-eastern-district-of-virginia-found-dead/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/03/image-943.png","video":null,"publish_date":"2025-03-23 23:16:00","author":"Abubakar Ibrahim,Bbc 16pm","authors":["Abubakar Ibrahim","Bbc 16pm"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.084},{"id":303369444,"title":"Tiger Woods confirms relationship with Donald Trump Jr’s ex-wife as golf icon says ‘love is in the air’ in statement","text":"TIGER Woods has confirmed his relationship with Donald Trump Jr's ex-wife Vanessa.\n\nGolf icon Woods posted two pictures of the happy couple on Instagram with an emotional caption.\n\nWoods wrote: \"Love is in the air and life is better with you by my side!\n\n\"We look forward to our journey through life together. \n\n\"At this time we would appreciate privacy to all those close to our hearts.\"\n\nWoods, 49, and Vanessa, 47, started out as friends before it became something more.\n\nThe pair had reportedly been seeing each other since before Thanksgiving, but their relationship was not yet public.\n\nWoods and Vanessa live 20 minutes apart in the wealthy southern Florida enclave of Palm Beach.\n\nThe golf legend, who was previously married to Elin Nordegren from 2004 until their split in 2010, has been linked to Vanessa for a while now.\n\nWoods' children, Charlie, 16, and Sam, 17, attend the same school as Vanessa's eldest daughter Kai, 17; the £30,000-a-year The Benjamin School.\n\nLast month, Woods and Vanessa were spotted together at a golf tournament, while Kai was seen wearing an outfit from Woods' clothing line.\n\nWoods was pictured walking and talking with Kai's entourage, including her mum, during the golfing event.\n\nVanessa filed for a divorce from Trump Jr. in 2018 in New York.\n\nFive-time Masters winner Woods is her first high-profile relationship since the divorce.\n\nThe athlete, widely considered one of the best golfers of all time, has long had links to the Trump family.\n\nWoods has been getting cosy with the Trump family for years, starting when he attended events at golf courses owned by Donald Trump in the early 2000s.\n\nDuring Trump's first presidency, Woods was often seen golfing with him at Trump International Golf Club in Florida.\n\nWoods has been an avid supporter of Trump as the President begins his second term in the White House.\n\nHowever, he still raised eyebrows when he was spotted spending time with the President's granddaughter and giving her some pointers on the range.\n\nWoods' love life has seen him date women before Vanessa \"who just weren't right for him\", according to a Page Six insider this month.\n\nThe source added: \"They have a lot in common. They’ve both gotten used to public scrutiny. They both know how to keep their private life private. They’re both parents...\n\n\"They’re a good match; they’re level-headed, they like to avoid drama, they share a lot of the same values. [Woods] Always tried to date girls who just weren’t right for him.\"\n\nThe source said of Vanessa: \"She’s not starstruck my him; she’d date him even if he weren’t famous. Fame doesn’t interest her; that’s what he likes best about her … We’ll see where it goes.\"\n\nWoods was recently pictured on the golf course at Mar-a-Lago with President Trump on February 9.\n\nAnd on February 20, Woods was honoured at a Black History Month reception at the White House.","summary":"","url":"https://www.thesun.ie/sport/14930884/tiger-woods-relationship-trump-jr-ex-wife/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2025/03/crop-34002199.jpg?strip=all&quality=100&w=702&h=467&crop=1","video":null,"publish_date":"2025-03-23 23:15:56","author":"Ethan Singh","authors":["Ethan Singh"],"language":"en","source_country":"ie","sentiment":0.444},{"id":303369242,"title":"Tiger Woods confirms relationship with Donald Trump Jr’s ex-wife as golf icon says ‘love is in the air’ in statement","text":"TIGER Woods has confirmed his relationship with Donald Trump Jr's ex-wife Vanessa.\n\nGolf icon Woods posted two pictures of the happy couple on Instagram with an emotional caption.\n\nWoods wrote: \"Love is in the air and life is better with you by my side!\n\n\"We look forward to our journey through life together. \n\n\"At this time we would appreciate privacy to all those close to our hearts.\"\n\nWoods, 49, and Vanessa, 47, started out as friends before it became something more.\n\nThe pair had reportedly been seeing each other since before Thanksgiving, but their relationship was not yet public.\n\nWoods and Vanessa live 20 minutes apart in the wealthy southern Florida enclave of Palm Beach.\n\nThe golf legend, who was previously married to Elin Nordegren from 2004 until their split in 2010, has been linked to Vanessa for a while now.\n\nWoods' children, Charlie, 16, and Sam, 17, attend the same school as Vanessa's eldest daughter Kai, 17; the £30,000-a-year The Benjamin School.\n\nLast month, Woods and Vanessa were spotted together at a golf tournament, while Kai was seen wearing an outfit from Woods' clothing line.\n\nWoods was pictured walking and talking with Kai's entourage, including her mum, during the golfing event.\n\nVanessa filed for a divorce from Trump Jr. in 2018 in New York.\n\nFive-time Masters winner Woods is her first high-profile relationship since the divorce.\n\nThe athlete, widely considered one of the best golfers of all time, has long had links to the Trump family.\n\nWoods has been getting cosy with the Trump family for years, starting when he attended events at golf courses owned by Donald Trump in the early 2000s.\n\nDuring Trump's first presidency, Woods was often seen golfing with him at Trump International Golf Club in Florida.\n\nWoods has been an avid supporter of Trump as the President begins his second term in the White House.\n\nHowever, he still raised eyebrows when he was spotted spending time with the President's granddaughter and giving her some pointers on the range.\n\nWoods' love life has seen him date women before Vanessa \"who just weren't right for him\", according to a Page Six insider this month.\n\nThe source added: \"They have a lot in common. They’ve both gotten used to public scrutiny. They both know how to keep their private life private. They’re both parents...\n\n\"They’re a good match; they’re level-headed, they like to avoid drama, they share a lot of the same values. [Woods] Always tried to date girls who just weren’t right for him.\"\n\nThe source said of Vanessa: \"She’s not starstruck my him; she’d date him even if he weren’t famous. Fame doesn’t interest her; that’s what he likes best about her … We’ll see where it goes.\"\n\nWoods was recently pictured on the golf course at Mar-a-Lago with President Trump on February 9.\n\nAnd on February 20, Woods was honoured at a Black History Month reception at the White House.","summary":"","url":"https://www.thescottishsun.co.uk/sport/14535029/tiger-woods-relationship-trump-jr-ex-wife/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/03/crop-34002199.jpg?strip=all&quality=100&w=702&h=467&crop=1","video":null,"publish_date":"2025-03-23 23:15:56","author":"Ethan Singh","authors":["Ethan Singh"],"language":"en","source_country":"gb","sentiment":0.444},{"id":303369734,"title":"Tiger Woods confirms relationship with Donald Trump Jr’s ex-wife as golf icon says ‘love is in the air’ in statement","text":"TIGER Woods has confirmed his relationship with Donald Trump Jr's ex-wife Vanessa.\n\nGolf icon Woods posted two pictures of the happy couple on Instagram with an emotional caption.\n\nWoods wrote: \"Love is in the air and life is better with you by my side!\n\n\"We look forward to our journey through life together. \n\n\"At this time we would appreciate privacy to all those close to our hearts.\"\n\nWoods, 49, and Vanessa, 47, started out as friends before it became something more.\n\nThe pair had reportedly been seeing each other since before Thanksgiving, but their relationship was not yet public.\n\nWoods and Vanessa live 20 minutes apart in the wealthy southern Florida enclave of Palm Beach.\n\nThe golf legend, who was previously married to Elin Nordegren from 2004 until their split in 2010, has been linked to Vanessa for a while now.\n\nWoods' children, Charlie, 16, and Sam, 17, attend the same school as Vanessa's eldest daughter Kai, 17; the £30,000-a-year The Benjamin School.\n\nLast month, Woods and Vanessa were spotted together at a golf tournament, while Kai was seen wearing an outfit from Woods' clothing line.\n\nWoods was pictured walking and talking with Kai's entourage, including her mum, during the golfing event.\n\nVanessa filed for a divorce from Trump Jr. in 2018 in New York.\n\nFive-time Masters winner Woods is her first high-profile relationship since the divorce.\n\nThe athlete, widely considered one of the best golfers of all time, has long had links to the Trump family.\n\nWoods has been getting cosy with the Trump family for years, starting when he attended events at golf courses owned by Donald Trump in the early 2000s.\n\nDuring Trump's first presidency, Woods was often seen golfing with him at Trump International Golf Club in Florida.\n\nWoods has been an avid supporter of Trump as the President begins his second term in the White House.\n\nHowever, he still raised eyebrows when he was spotted spending time with the President's granddaughter and giving her some pointers on the range.\n\nWoods' love life has seen him date women before Vanessa \"who just weren't right for him\", according to a Page Six insider this month.\n\nThe source added: \"They have a lot in common. They’ve both gotten used to public scrutiny. They both know how to keep their private life private. They’re both parents...\n\n\"They’re a good match; they’re level-headed, they like to avoid drama, they share a lot of the same values. [Woods] Always tried to date girls who just weren’t right for him.\"\n\nThe source said of Vanessa: \"She’s not starstruck my him; she’d date him even if he weren’t famous. Fame doesn’t interest her; that’s what he likes best about her … We’ll see where it goes.\"\n\nWoods was recently pictured on the golf course at Mar-a-Lago with President Trump on February 9.\n\nAnd on February 20, Woods was honoured at a Black History Month reception at the White House.","summary":"","url":"https://www.thesun.co.uk/sport/34002183/tiger-woods-relationship-trump-jr-ex-wife/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/03/crop-34002199.jpg?strip=all&quality=100&w=702&h=467&crop=1","video":null,"publish_date":"2025-03-23 23:15:56","author":"Ethan Singh","authors":["Ethan Singh"],"language":"en","source_country":"gb","sentiment":0.444},{"id":303371990,"title":"Who Is Jessica Aber? About the Former Prosecutor & Her Death","text":"Jessica Aber, the former U.S. Attorney for the Eastern District of Virginia, was found dead on March 22, 2025. She was 43 years old. Her death remains a mystery as authorities investigate the matter. Just two months prior to her death, Aber resigned from her position shortly before Donald Trump was about to be inaugurated.\n\n“I’ve had the privilege of spending my career as a prosecutor in the Eastern District of Virginia working alongside talented, hard-working public servants who manage matters affecting citizens here and across the world,” Aber said in a statement. “Concluding my service to the District as its U.S. Attorney has been an honor beyond measure. I am deeply grateful to Senators Mark Warner and Tim Kaine and to President [Joe] Biden for the opportunity to lead this office, and to Attorney General Garland for his steadfast leadership. I am proud of the work we have done with our federal, state, and local law enforcement partners to enforce the law and build community trust.”\n\nBelow, learn more about Aber, her career and death.\n\nFormer U.S. Attorney for the Eastern District of Virginia Jessica Aber, 43, was found dead Saturday morning, in Alexandria, Va.\nPolice said an investigation is underway surrounding the circumstances of her death. pic.twitter.com/mqdXYgPvUR\n— ABC News Live (@ABCNewsLive) March 23, 2025\n\nWho Is Jessica Aber?\n\nAber was a lawyer and former U.S. Attorney for the Eastern District of Virginia, a position she served from 2021 to 2025.\n\nThe Walnut Creek, California, native started her career as a law clerk for former Magistrate Judge M. Hannah Lauck of the District Court for the Eastern District of Virginia in 2006. She worked her way up to become the Deputy Chief of the Criminal Division for the Eastern District of Virginia in 2016, a position she held until she became the attorney in 2021.\n\nWhat Happened to Jessica Aber?\n\nOn March 22, 2025, the Alexandria Police Department of Virginia found Aber dead in her home. The current U.S. Attorney for the Eastern District of Virginia, Erik S. Siebert, reacted to Aber’s death in a statement, which read, “Her professionalism, grace, and legal acumen set the standard. Though we are devastated by this loss, each of us in the Eastern District of Virginia will look to her example and endeavor to live up to that standard,” per USA Today.\n\nJessica Aber’s Cause of Death\n\nAuthorities have not released a cause of death for Aber yet. At the time of publication, police have kept most of the details about Aber’s death away from the public eye.","summary":"Aber was found dead at the age of 43 in March 2025 two months after she resigned as the U.S. Attorney of the Eastern District of Virginia.","url":"https://hollywoodlife.com/feature/jessica-aber-death-5376285/","image":"https://hollywoodlife.com/wp-content/uploads/2025/03/GettyImages-1827676825_48bcd8-e1742770366810.jpeg?fit=4101%2C2317","video":null,"publish_date":"2025-03-23 23:15:47","author":"Elisabeth McGowan","authors":["Elisabeth McGowan"],"language":"en","source_country":"US","sentiment":-0.228},{"id":303369050,"title":"No injuries after man drives car into protesters outside Tesla dealership","text":"A man drove his car into protesters outside a Tesla dealership in Palm Beach County, Florida, but did not injure any of those who had gathered to demonstrate against billionaire Elon Musk and President Donald Trump over the weekend, according to law enforcement. The planned protest was one of a slew across the U.S. at businesses associated with Tesla, the company led by Musk, in response to the billionaire's work with the Trump administration in cutting federal funding and the workforce. Attacks on property carrying the logo of Elon Musk's electric car company are cropping up across the U.S. and overseas. Several more violent incidents include Cybertrucks being set on fire in Seattle and shots fired at a Tesla dealership in Oregon. The protest on Saturday was interrupted when Andrew Dutil drove his vehicle onto the sidewalk full of protesters at a slow speed, forcing people to scramble out of the way to avoid being hit, according to the Palm Beach County Sheriff's Office.Dutil was arrested and faces an assault charge, according to court records. An attorney who could speak on Dutil's behalf wasn't immediately listed in court records.Palm Beach County is also home to Trump's Mar-a-Lago resort, which the president has called the \"Center of the Universe\" on social media. Trump and Musk — through the Department of Government Efficiency — have begun dismantling government agencies and programs and laying off staff in the name of culling government waste, fraud and abuse.","summary":"A Florida sheriff's office says a man drove his car into protesters gathered outside a Tesla dealership in Palm Beach County, but nobody was injured.","url":"https://www.cbsnews.com/miami/news/man-drives-car-into-protesters-outside-a-tesla-dealership-nobody-hurt-sheriff-says/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/23/c927ec32-5691-4adc-b0e9-28c85f3113d0/thumbnail/1200x630/7b14f07d5c71404d0d3af2e01fbaa1f1/ap25082761028840.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89","video":"https://www.cbsnews.com/miami/live/","publish_date":"2025-03-23 23:15:43","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.271},{"id":303377010,"title":"1 killed, 15 wounded in US airstrike on Yemen’s capital","text":"Sanaa, March 24 (SocialNews.XYZ) At least one person was killed and 15 others wounded in a US airstrike targeting a residential building in Yemen's Houthi-held capital Sanaa, Houthi-run al-Masirah TV reported.\n\nA preliminary toll showed that \"three children and two women\" were among the injured due to the strike that took place in Asr, the western suburb of Sanaa, the television said o Sunday, citing a source from the Houthi-controlled health authorities.\n\nLocal residents described the strike as \"very violent,\" noting that rescue teams were still searching for possible survivors under the rubble, Xinhua news agency reported.\n\nThe US military has yet to issue a comment.\n\nHours earlier, the TV channel reported that the US military stationed in the Red Sea conducted fresh airstrikes on Yemen's northern province of Saada, targeting the areas around the province's namesake central city, a stronghold of the Houthis, without providing further details.\n\nThe airstrikes came a few hours after the Houthis claimed to have launched fresh attacks on the USS Harry S. Truman aircraft carrier in the northern Red Sea and the Ben Gurion airport in central Israel, with the latter attack reportedly intercepted by the Israeli army.\n\nEarlier in the day, the US military launched a series of airstrikes on Houthi-held areas, including the airport in the Red Sea port city of Hodeidah, according to al-Masirah TV. There were no reports of casualties.\n\nThe exchanges of fire took place amid an ongoing air campaign launched by US forces in mid-March against Houthi-controlled territories in Yemen.\n\nThe Houthi group, which controls much of northern Yemen after the onset of a civil war in 2014, has vowed to continue striking Israeli targets in solidarity with Palestinians in Gaza and to respond to what it describes as \"American aggression\".\n\nUS President Donald Trump justified the strikes, claiming Houthis had attacked US ships and disrupted international shipping and trade in the Red Sea.\n\nThe President ordered a “decisive and forceful military action\", further adding that the US would use “overwhelming and deadly force” to deter further attacks on the freedom of navigation.\n\nSource: IANS","summary":"Sanaa, March 24 (SocialNews.XYZ) At least one person was killed and 15 others wounded in a US airstrike targeting a residential building in Yemen's Houthi-held capital Sanaa, Houthi-run al-Masirah TV reported. A preliminary toll showed...\n\n\nThe post 1 killed, 15 wounded in US airstrike on Yemen&#8217;s capital appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/03/23/1-killed-15-wounded-in-us-airstrike-on-yemens-capital/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/03/24/202503243358449.jpg?fit=461%2C273&quality=80&zoom=1&ssl=1?v=1742775605","video":null,"publish_date":"2025-03-23 23:13:53","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.012},{"id":303364320,"title":"‘Tesla Takedown’ protest lines South Jersey highway","text":"Hundreds of people toting signs lined Route 70 in Cherry Hill Saturday to protest outside a Tesla dealership as part of the national movement nicknamed “Tesla Takedowns.”\n\nThe protest was another in the national movement that has emerged since President Donald Trump appointed Tesla CEO Elon Musk to lead the White House’s new Department of Government Efficiency, or DOGE.\n\nSome of the signs read “fire Musk,” “dump Elon” and “Trump picked Elon, not you.”\n\nThe protest took place for about 90 minutes starting at 12:30 p.m. and had more than 600 participants at its peak, according to Cooper River Indivisible, the non-profit organization that led the rally.\n\nAdam Sheridan, lead organizer for the group, said the protest demands that Musk be removed from his government role and also to call on Americans to boycott Tesla. \n\n“Given the daily drop in Tesla’s stock price and the frequent poor sales reports for their vehicles, it’s clear this message is resonating around the country,” Sheridan said.\n\nOne of the attendees, Janine Brown, of Delran, told NJ Advance Media that it was a well attended, “high energy” protest. \n\n“We are angry and we will fight peacefully for our rights,” Brown said. \n\nReports of vandalism to Tesla vehicles have also emerged across the country in recent weeks. \n\nMusk’s controversial DOGE has promised to cut between $1 trillion and $2 trillion from the annual federal budget by 2026.\n\nTesla shares closed on Friday at $248.71, a nearly 50 percent drop from its all-time high of just below $480 on December 17. Musk is still however considered the richest person in the world, with a net worth of about $334 billion, according to Forbes. \n\nOur journalism needs your support. Please subscribe today to NJ.com.\n\nNicolas Fernandes may be reached at nfernandes@njadvancemedia.com.","summary":"The protest had more than 600 participants at its peak.","url":"https://www.nj.com/camden/2025/03/tesla-takedown-protest-lines-south-jersey-highway.html","image":"https://www.nj.com/resizer/v2/XXA4T5YCD5D45K6DSSN5S7XFHM.jpg?auth=13d08343da7dc0fab0aca0c3d0da612f33c233dd3076b890ded8fc950fd1dfc0&width=1280&quality=90","video":null,"publish_date":"2025-03-23 23:12:55","author":"Nicolas Fernandes","authors":["Nicolas Fernandes"],"language":"en","source_country":"us","sentiment":0.123},{"id":303365006,"title":"Canadian Prime Minister Mark Carney says Trump won't 'break' Canada, blasts 'unjustified trade actions'","text":"Canadian Prime Minister Mark Carney on Sunday said President Donald Trump won't \"break\" his country and pushed back against what he said were \"unjustified trade actions\" from the United States.Carney, an economist who succeeded Justin Trudeau as both prime minister and leader of the Liberal Party earlier in March, made the remarks as he called for a snap election on April 28.The relationship between the two countries has continued to hit lows as Trump has put into place 25% tariffs against Canada and Mexico, with exceptions for goods traded under the United States-Mexico-Canada Agreement. Trump has also placed 25% tariffs on all steel and aluminum imports and has plans to issue a series of retaliatory tariffs on April 2.\"We are facing the most significant crisis of our lifetimes because of President Trump's unjustified trade actions and his threats to our sovereignty,\" Carney said, referencing Trump's calls for Canada to become the 51st US state.\"President Trump claims that Canada isn't a real country. He wants to break us so America can own us,\" he continued. \"We will not let that happen. We need to build the strongest economy in the G7.\"Carney's call for an election wasn't unexpected, as he lacks a seat in Parliament, and his Liberal Party lacks a majority in the legislature.However, Carney will run for a seat in the Nepean area of Ottawa. And the Liberal Party, which had sunk in popularity in recent years, has seen a significant turnaround in support for the upcoming election.Carney has now put into motion a five-week campaign where he'll compete against the Conservative Party and its leader, Pierre Poilievre.","summary":"Carney, who called a snap election on April 28, said Canadians need to \"build the strongest economy in the G7.\"","url":"https://www.businessinsider.com/canada-carney-trump-snap-election-trade-2025-3","image":"https://i.insider.com/67e08ee0b8b41a9673fb7a40?width=808&format=jpeg","video":null,"publish_date":"2025-03-23 23:10:49","author":"John L. Dorman","authors":["John L. Dorman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.109},{"id":303362514,"title":"Tiger Woods and Vanessa Trump go public with their relationship as golf star posts bombshell statement","text":"Tiger Woods and Vanessa Trump have gone public with their relationship with two pictures on social media.\n\nIt comes 10 days after DailyMail.com exclusively revealed that the golf icon was dating Donald Trump Jr.'s ex-wife. \n\nAlongside two pictures of the loved-up couple, Woods wrote: 'Love is in the air and life is better with you by my side! We look forward to our journey through life together. \n\n'At this time we would appreciate privacy to all those close to our hearts.'\n\nMore to follow.","summary":"Tiger Woods and Vanessa Trump have gone public with their relationship with two pictures on social media.","url":"https://www.dailymail.co.uk/sport/golf/article-14529163/Tiger-Woods-Vanessa-Trump-public-relationship-golf-star-posts-bombshell-statement.html","image":"https://i.dailymail.co.uk/1s/2025/03/23/23/96494291-0-image-m-31_1742771196563.jpg","video":null,"publish_date":"2025-03-23 23:09:37","author":"Editor,Max Winters","authors":["Editor","Max Winters"],"language":"en","source_country":"gb","sentiment":0.289}]}