{"offset":0,"number":50,"available":17760,"news":[{"id":297147198,"title":"Hamilton criticized for complaining about Trump’s aggressive control over Kennedy Center and declining to participate","text":"Republicans slammed the creators of the hit musical Hamilton after it canceled its upcoming run at the Kennedy Center, citing the ‘new culture’ of the institution following President Donald Trump’s takeover. \n\nThe play was to be part of the Kennedy Center’s plans to celebrate the 250th anniversary of American independence. Trump is hugely invested in having a big celebration next year in honor of America’s birthday.\n\nBut the decision to cancel the run has sparked a cultural revolution in the political world.\n\nRic Grenell, who Trump named the interim executive director, accused creator Lin-Manuel Miranda and producer Jeffrey Seller of a ‘publicity stunt’ that he said would backfire.\n\nHe called Miranda ‘intolerant of people who don’t agree with him politically’ and said the two men ‘don’t want Republicans going to their shows.’ \n\nThe hit musical was schedule to play its third run at the Kennedy Center in March and April 2026.\n\n‘Given the recent actions, our show simply cannot, in good conscience, participate and be part of this new culture that is being imposed on the Kennedy Center,’ Seller said in a post on social media announcing the cancellation.\n\nSeller also called it a ‘business decision’ noting the hundreds of employees of the play who would be hurt if the Kennedy Center suddenly cancelled the musical’s run. \n\nThe Kennedy Center has cancelled events in the wake of Trump’s takeover. Other artists have cancelled on their own in protest, including musician Rhiannon Giddens and actress Issa Rae.\n\n‘The actions of the new Chairman of the Board in recent weeks demonstrate that contracts and previous agreements simply cannot be trusted,’ Seller noted. \n\nTrump fired Kennedy Center staff, board members and declared himself chairman of the cultural institution. \n\nThe Tony- and Pulitzer Prize-winning musical by Miranda was performed at the Kennedy Center during Trump’s first administration, Seller noted.\n\n‘We are not acting against his administration, but against the partisan policies of the Kennedy Center as a result of his recent takeover,’ he wrote. \n\nSeller and Miranda first revealed their decision Wednesday in an interview with The New York Times.\n\n‘This latest action by Trump means it’s not the Kennedy Center as we knew it,’ Miranda told the newspaper.\n\nBut Grenell accused the two men of a publicity stunt by telling the newspaper before informing the center.\n\n‘Seller and @Lin_Manuel first went to the New York Times before they came to the Kennedy Center with their announcement that they can’t be in the same room with Republicans,’ Grenell said in a post on X.\n\n‘This is a publicity stunt that will backfire,’ he added.\n\n‘The Arts are for everyone – not just for the people who Lin likes and agrees with. The American people need to know that @Lin_Manuel is intolerant of people who don’t agree with him politically. It’s clear he and Sellers don’t want Republicans going to their shows,’ he noted.\n\nThe hugely popular musical about the life of founding father Alexander Hamilton is a sure-fire hit for whatever theater that hosts it. The previous runs at the Kennedy Center quickly sold out. On Broadway it has grossed more than $1 billion.\n\nThe Kennedy Center had announced the play’s run but it had not started selling tickets and no contract had been signed. \n\nMiranda and Seller told the Times the show would soon announce another venue in the Washington area so locals would still have an opportunity to see it.\n\nIn 2018, during the first Trump Administration, Miranda and other members of the ‘Hamilton’ creative team were among that year’s Kennedy Center honorees.\n\nTrump never attended the Kennedy Center Honors as president because several artists threatened to boycott the center if he was present. \n\nIt is tradition for the president to preside over the Honors, the center’s biggest event of the year. \n\nHe took over the center in early February. The contract of Kennedy Center President Deborah Rutter was terminated as was that of chairman David Rubenstein in the wake of Trump’s move.\n\nThe president has promised a ‘Golden Age in arts and culture,’ but has not given any more specifics. Grenell has promised the Kennedy Center would feature ‘a big, huge celebration of the birth of Christ at Christmas.’\n\nTrump, who is a huge fan of Broadway musicals, never saw Hamilton. \n\nIn 2016, shortly after the presidential election, then-Vice President-elect Mike Pence saw the show on Broadway. Afterward the cast made an unusual appeal, asking Pence to see that the Trump administration ‘uphold our American values’ and ‘work on behalf of all of us.’ \n\nTrump, at the time, called the ‘Hamilton’ cast had ‘harassed’ Pence by making the statement and had been ‘very rude.’ \n\n‘Apologize,’ he demanded. \n\nPresidents Barack Obama and Joe Biden were big fans. Barack and Michelle Obama hosted the cast at the White House to perform some songs. Joe and Jill Biden saw the hit musical on Broadway when Biden served as vice president.\n\nSeller noted in his post that ‘political disagreements and debate are vital expressions of democracy. These basic concepts of freedom are at the very heart of Hamilton. However, some institutions are sacred and should be protected from politics. The Kennedy Center is one such institution.’\n\nHe noted the Center was founded as a bipartisan place for the arts, coming to fruition under Dwight Eisenhower and named after John F. Kennedy.\n\n‘Politics have never affected the presentation of shows and the display of extraordinary visual arts. However in recent weeks we have sadly seen decades of Kennedy Center neutrality be destroyed,’ he said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nRepublicans slammed the creators of the hit musical Hamilton after it canceled&#8230;\n\n\nThis Post: Hamilton criticized for complaining about Trump&#8217;s aggressive control over Kennedy Center and declining to participate first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/hamilton-criticized-for-complaining-about-trumps-aggressive-control-over-kennedy-center-and-declining-to-participate/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Hamilton-blasted-for-whining-about-Trumps-hostile.jpg","video":null,"publish_date":"2025-03-06 01:09:44","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.062},{"id":297146636,"title":"More than ‘a little disturbance’: Trump and OPEC are sinking the oil price","text":"A decision by OPEC+ to increase production and Donald Trump’s latest tariffs blitz have combined to sink oil prices to three-year lows.\n\nThe oil price has fallen more than 3 per cent this week and more than 6 per cent over the past seven days, with the internal politics of OPEC+ and Trump’s tariffs helping to deliver the lower prices that Trump demanded from the oil cartel at the World Economic Forum in Davos earlier this year.\n\nThe sharp fall in the oil price this week to below $US70 a barrel is due to OPEC+’s announcement on Monday that, after three years of production cuts that removed about 6 million barrels a day (about 6 per cent) from global oil supplies, the cartel would start returning some of that withheld production to the market.\n\nFrom next month, OPEC+ producers will add 138,000 a barrels a day and then continue to lift output in monthly increments until September 2026, by which time about 2.2 million barrels a day of supply will have been brought back into the market. The group does, however, reserve the right to pause or reverse the increases, depending on market conditions.","summary":"This week, OPEC+ did what Donald Trump has demanded and announced it would start increasing production, pushing oil prices down to three-year lows. Trump may get more than he bargained for.","url":"https://www.theage.com.au/business/markets/more-than-a-little-disturbance-trump-and-opec-are-sinking-the-oil-price-20250306-p5lhc4.html","image":"https://static.ffx.io/images/$zoom_0.1924%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/e1a17417544fdaa831773944cd1f4f3822fcb6ec","video":null,"publish_date":"2025-03-06 01:06:26","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":-0.452},{"id":297147194,"title":"“Trump Asks for Understanding as Farmers and Consumers Prepare for Tariff Impact”","text":"OMAHA, Neb. — Farmers and meat producers across the U.S. can expect the new tariffs on Mexico, Canada and China and the retaliatory action from those countries to hurt their bottom lines by billions of dollars if they stay in place a while, and consumers could quickly see higher prices for produce and ground beef.\n\nBut some of the impact on farmers might not be felt until the next harvest and some products might actually get cheaper in the short run for consumers if exports suffer. And the price of corn, wheat and soybeans accounts for relatively little of the price of most products. Plus, President Donald Trump could offer farmers significant aid payments, as he did during the trade war with China during his first administration, to offset some of the losses.\n\nIn his address to Congress Tuesday night, Trump argued that agricultural imports hurt American farmers and asked them to “bear with me again” as he seeks to protect them. He didn’t mention any additional aid.\n\n“I love the farmer,” he said.\n\nIf the tariffs make farmers uneasy about investing in expensive tractors and consumers worry so much about groceries that they cut other spending, that would hurt the economy overall and could even lead to a recession. And consumers were already worried about record egg prices amid a bird flu outbreak.\n\n“Exactly how strong our economy is over time has a lot to do with U.S. consumers’ comfort with continuing to go out to restaurants and continuing to buy washers and dryers and just that general activity. And a lot of what we’re talking about here is probably going to slow some of that,” said Glynn Tonsor, an agricultural economist at Kansas State University.\n\nThe situation has some farmers stocking up on equipment and supplies in preparation for prices to go up, but it’s not like they can easily buy all their fertilizer ahead of time. And consumers might have a hard time stockpiling perishable products like avocados and ground beef.\n\nThe details of how the tariffs are implemented and whether any products are excluded will also matter.\n\nCorn and soybean prices for this year’s harvest already fell roughly 10% since the tariffs were first announced a couple of weeks ago.\n\nJoe Janzen, an agricultural economist with the University of Illinois, said that has “snuffed out” any profitability in those crops. He called Trump’s comments that farmers may be able to sell more of their products at home “at best tone deaf.”\n\n“There is no domestic market for the amount of corn, soybeans, wheat, and other agricultural products that we now export in significant quantities,” he said.\n\nMeanwhile, as crop prices decline, farmers might see their fertilizer bill jump because 85% of the potash American farmers use in fertilizer comes from Canada, which also supplies some nitrogen fertilizer as well. The Fertilizer Institute President and CEO Corey Rosenbusch said “an open, fair, predictable and transparent trade environment between the U.S. and Canada is vital.”\n\n“We need potash to raise healthier crops,” said Minnesota farmer Danny Lundell, who hosted Gov. Tim Walz on his corn and soybean farm near Cannon Falls on Tuesday. “And it doesn’t matter if you’re big, medium or small, it’s going to affect you.”\n\nBut Iowa State agricultural economist Chad Hart said many farmers applied fertilizer to their fields last fall and may not have to pay the higher fertilizer bills until later.\n\nThe United States imports a lot of lean beef to mix with fattier beef produced at American plants to make hamburger, and that imported beef will get more expensive because nearly half of it comes from Canada and Mexico. That’s likely to show up in grocery stores in six to eight weeks.\n\nAmerica exported more than $1.8 billion worth of chicken and another $8.4 billion in red meat to Mexico, Canada and China. These tariffs could easily lead to a 10% drop in exports, Tonsor said.\n\nIf farmers aren’t able to move that much meat overseas because of tariffs, they can seek to sell more domestically — but they’ll likely have to discount prices. Bad for farmers, but potentially good for consumers.\n\nThe impact will vary by product. For instance, demand for steaks and bacon may remain relatively steady because little of that is exported, but the price of hams could drop in the U.S. because Mexico is a major buyer of those. The price of specialty cuts like beef tongue that are almost entirely exported will plummet.\n\nLivestock producers will see a bit of relief because the cost of the feed they use will decline, but Tonsor said they will still lose money overall.\n\n“Farmers are very concerned,” said Steve Kuiper, a director at the Iowa Corn Growers Association. “People just aren’t buying stuff,” he said, which is hitting big companies like John Deere and local suppliers that sell their equipment.\n\nThat’s the case for farmers who grow table crops as well as commodities. Katy Rogers, who manages an organic farm outside Indianapolis, said that as soon as Trump started talking about tariffs she bought everything she thought would see a price hike in the coming months.\n\nKuiper hopes that the impacts of tariffs can be mitigated and eventually lead to a more level playing field that benefits farmers. He wants to see trade open with more countries. For instance, he said that for corn, China had already been favoring trade with Brazil, so he instead sees opportunity in places like India.\n\nBut Trump has threatened additional reciprocal tariffs on other countries on April 2, which could make it harder for farmers to shift their exports to other countries.\n\nTrump can do a lot to ease farmers’ pain with aid payments. He gave them more than $22 billion in aid payments in 2019 and nearly $46 billion in 2020, though that year also included aid related to the pandemic.\n\nBut Janzen notes that Trump is working to drastically slash spending across the federal government.\n\nWalz, who lost his bid to become vice president last fall, said the tariffs will hurt trading relationships and prompt buyers in China, Mexico and Canada to look elsewhere.\n\nSome trade experts question how long Trump’s tariffs will last as they boost prices for American consumers, including his base voters, who have long complained about inflation and rising food prices.\n\n“It is going to do nothing to help with the food inflation in the U.S,” said Timothy Wise, author of “Eating Tomorrow” and expert on agricultural trade between Mexico and the U.S. “I don’t see it as sustainable. I don’t find it plausible that corporate folks who surround Trump are going to sit back and allow him to destroy their foreign markets.”\n\nAssociated Press writers Steve Karnowski and Megan Janetsky contributed to this report. Walling reported from Chicago.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFarmers&#8217; profits could suffer due to the tariffs, possibly impacting produce and&#8230;\n\n\nThis Post: &#8220;Trump Asks for Understanding as Farmers and Consumers Prepare for Tariff Impact&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-asks-for-understanding-as-farmers-and-consumers-prepare-for-tariff-impact/","image":"https://media.tegna-media.com/assets/CCT/images/a29b0e3d-6b1d-408c-9f3c-061a989a7f00/20250306T004019/a29b0e3d-6b1d-408c-9f3c-061a989a7f00_750x422.jpg","video":null,"publish_date":"2025-03-06 01:03:46","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.06},{"id":297146878,"title":"More than 10.7 million viewers chose Fox News to watch Trump's address to Congress, trouncing all networks","text":"Fox News Channel was by far the most-watched network during President Donald Trump's joint address to Congress, ahead of all broadcast and cable news competitors. A whopping 10.7 million total viewers, including 1.9 million viewers in the advertiser-coveted demographic of adults aged 25-54, tuned in to Fox News' coverage of Trump's highly-anticipated address to the nation from 9:15-11 p.m. ET, which was the longest address to Congress by any president. Across all FOX linear platforms, including FOX Network and FOX Business, the total increases to roughly 13.8 million total viewers. The three major broadcast networks trailed in comparison, with ABC coming in second with 6.3 million total viewers, followed by CBS with four million and NBC with 3.9 million. TRUMP'S ‘WEAVING’ SKILLS ON FULL DISPLAY IN MADE-FOR-TV ADDRESS TO CONGRESS Both CNN and MSNBC failed to crack two million total viewers as they virtually tied at 1.9 million viewers each, with CNN edging out MSNBC in the key demo, 585,000 to 237,000 respectively. Fox News obtained a staggering 74% of the total cable news audience share, 70% among audience members in the key demo. Fox News maintained its dominance over its cable news competitors between 11-11:30 p.m., which included post-address analysis and the Democratic response given by Michigan Sen. Elissa Slotkin. Fox News led with 6.4 million total viewers, including more than one million in the key demo compared to MSNBC's 2.2 million total viewers and 233,000 in the demo and CNN's 1.4 million total viewers and 362,000 in the demo. Bret Baier and Martha MacCallum co-anchored Fox News' special coverage of Trump's address, along with \"The Five\" co-hosts Dana Perino and Harold Ford Jr., Fox News senior political analyst Brit Hume and FOX Business host Larry Kudlow. PRESIDENT DONALD TRUMP DECLARES 'AMERICA'S MOMENTUM IS BACK' IN JOINT ADDRESS TO CONGRESS Trump's address kicked off on an intense note when Rep. Al Green, D-Texas, was escorted out of the House chamber after he stood up and repeatedly shouted at the president. Moments later, Trump took a swipe at Democrats over their refusal to get on board with his agenda. \"This is my fifth such speech to Congress, and once again, I look at the Democrats in front of me, and I realize there is absolutely nothing I can say to make them happy, or to make them stand or smile or applaud, nothing I can do,\" Trump said. \"I could find a cure to the most devastating disease, a disease that would wipe out entire nations or announce the answers to the greatest economy in history, or the stoppage of crime to the lowest levels ever recorded,\" Trump continued. \"And these people sitting right here will not clap, will not stand, and certainly will not cheer for these astronomical achievements. They won't do it no matter what. Five- five times I've been up here! It's very sad, and it just shouldn't be this way.\" He then made a direct challenge to Democrats, telling them, \"For just this one night, why not join us in celebrating so many incredible wins for America? For the good of our nation. Let's work together and let's truly make America great again.\" 13-YEAR-OLD CANCER SURVIVOR EARNS STANDING OVATION AS HE BECOMES SECRET SERVICE AGENT DURING TRUMP SPEECH CLICK HERE TO GET THE FOX NEWS APP The address was filled with many memorable moments, like when he made 13-year-old brain cancer survivor DJ Daniel an honorary Secret Service agent and when he told Alexis Nungaray, the Angel Mom of 12-year-old Jocelyn Nungaray who was murdered by illegal immigrants, that his administration was renaming Texas' Anahuac National Wildlife Refuge in memory of her daughter. He also showcased Marc Fogel, the American teacher rescued by the Trump administration after being held captive in a Russian prison, and his 95-year-old mother Malphine, who pleaded with Trump to rescue her son on the campaign trail, and paid tribute to the wife and daughters of Corey Comperatore, the firefighter who lost his life while protecting his family at the Butler rally where Trump was nearly assassinated.","summary":"Fox News Channel trounced all other networks during President Trump&apos;s joint address to Congress, earning a whopping 10.7 million viewers Tuesday night.","url":"https://www.foxnews.com/media/more-than-10-7-million-viewers-chose-fox-news-watch-trumps-address-congress-trouncing-all-networks","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/bret-baier-and-martha-maccallum-joint-address.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:53:49","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.175},{"id":297147118,"title":"Hamilton blasted for whining about Trump's hostile takeover of Kennedy Center and refusing to perform","text":"Hamilton blasted for whining about Trump's hostile takeover of Kennedy Center and refusing to perform\n\nLISTEN: Trump’s State of the Union address, Elon on Joe Rogan, and the First Lady’s newest cause – on the Daily Mail’s Welcome to MAGAland podcast\n\nBy EMILY GOODIN, SENIOR WHITE HOUSE CORRESPONDENT\n\nPublished: 00:36 GMT, 6 March 2025 | Updated: 00:52 GMT, 6 March 2025\n\nRepublicans slammed the creators of the hit musical Hamilton after it canceled its upcoming run at the Kennedy Center, citing the 'new culture' of the institution following President Donald Trump's takeover. \n\nThe play was to be part of the Kennedy Center's plans to celebrate the 250th anniversary of American independence. Trump is hugely invested in having a big celebration next year in honor of America's birthday.\n\nBut the decision to cancel the run has sparked a cultural revolution in the political world.\n\nRic Grenell, who Trump named the interim executive director, accused creator Lin-Manuel Miranda and producer Jeffrey Seller of a 'publicity stunt' that he said would backfire.\n\nHe called Miranda 'intolerant of people who don't agree with him politically' and said the two men 'don't want Republicans going to their shows.' \n\nLin-Manuel Miranda as Hamilton in the hit musical during its Broadway run\n\nThe hit musical was schedule to play its third run at the Kennedy Center in March and April 2026.\n\n'Given the recent actions, our show simply cannot, in good conscience, participate and be part of this new culture that is being imposed on the Kennedy Center,' Seller said in a post on social media announcing the cancellation.\n\nSeller also called it a 'business decision' noting the hundreds of employees of the play who would be hurt if the Kennedy Center suddenly cancelled the musical's run. \n\nThe Kennedy Center has cancelled events in the wake of Trump's takeover. Other artists have cancelled on their own in protest, including musician Rhiannon Giddens and actress Issa Rae.\n\n'The actions of the new Chairman of the Board in recent weeks demonstrate that contracts and previous agreements simply cannot be trusted,' Seller noted. \n\nCaroline Kennedy forced to step in and 'meet with Trump' after Kennedy Center shake up\n\nTrump fired Kennedy Center staff, board members and declared himself chairman of the cultural institution. \n\nThe Tony- and Pulitzer Prize-winning musical by Miranda was performed at the Kennedy Center during Trump's first administration, Seller noted.\n\n'We are not acting against his administration, but against the partisan policies of the Kennedy Center as a result of his recent takeover,' he wrote. \n\nSeller and Miranda first revealed their decision Wednesday in an interview with The New York Times.\n\n'This latest action by Trump means it's not the Kennedy Center as we knew it,' Miranda told the newspaper.\n\nBut Grenell accused the two men of a publicity stunt by telling the newspaper before informing the center.\n\n'Seller and @Lin_Manuel first went to the New York Times before they came to the Kennedy Center with their announcement that they can't be in the same room with Republicans,' Grenell said in a post on X.\n\n'This is a publicity stunt that will backfire,' he added.\n\n'The Arts are for everyone - not just for the people who Lin likes and agrees with. The American people need to know that @Lin_Manuel is intolerant of people who don't agree with him politically. It's clear he and Sellers don't want Republicans going to their shows,' he noted.\n\nPresident Donald Trump installed himself as chairman of the Kennedy Center\n\nStatement from Hamilton producer Jeffrey Sellers on the cancellation\n\nLeslie Odom Jr., Phillipa Soo and Ariana DeBose with Lin-Manuel Miranda during their final performance curtain call of 'Hamilton' in July 2016\n\nThe hugely popular musical about the life of founding father Alexander Hamilton is a sure-fire hit for whatever theater that hosts it. The previous runs at the Kennedy Center quickly sold out. On Broadway it has grossed more than $1 billion.\n\nThe Kennedy Center had announced the play's run but it had not started selling tickets and no contract had been signed. \n\nMiranda and Seller told the Times the show would soon announce another venue in the Washington area so locals would still have an opportunity to see it.\n\nIn 2018, during the first Trump Administration, Miranda and other members of the 'Hamilton' creative team were among that year's Kennedy Center honorees.\n\nTrump named Ric Grenell the interim executive director of the Kennedy Center\n\nTrump never attended the Kennedy Center Honors as president because several artists threatened to boycott the center if he was present. \n\nIt is tradition for the president to preside over the Honors, the center's biggest event of the year. \n\nHe took over the center in early February. The contract of Kennedy Center President Deborah Rutter was terminated as was that of chairman David Rubenstein in the wake of Trump's move.\n\nThe president has promised a 'Golden Age in arts and culture,' but has not given any more specifics. Grenell has promised the Kennedy Center would feature 'a big, huge celebration of the birth of Christ at Christmas.'\n\nTrump, who is a huge fan of Broadway musicals, never saw Hamilton. \n\nIn 2016, shortly after the presidential election, then-Vice President-elect Mike Pence saw the show on Broadway. Afterward the cast made an unusual appeal, asking Pence to see that the Trump administration 'uphold our American values' and 'work on behalf of all of us.' \n\nTrump, at the time, called the 'Hamilton' cast had 'harassed' Pence by making the statement and had been 'very rude.' \n\n'Apologize,' he demanded. \n\nPresidents Barack Obama and Joe Biden were big fans. Barack and Michelle Obama hosted the cast at the White House to perform some songs. Joe and Jill Biden saw the hit musical on Broadway when Biden served as vice president.\n\nRic Grenell blasted the decision of Hamilton to cancel its Kennedy Center run\n\nLin Manuel Miranda arrives at the 2018 Kennedy Center Honors when he was an honoree\n\nJill Biden, Lin-Manuel Miranda and Vice President of the United States Joe Biden pose backstage at the hit new musical 'Hamilton' in July 2015\n\nSeller noted in his post that 'political disagreements and debate are vital expressions of democracy. These basic concepts of freedom are at the very heart of Hamilton. However, some institutions are sacred and should be protected from politics. The Kennedy Center is one such institution.'\n\nHe noted the Center was founded as a bipartisan place for the arts, coming to fruition under Dwight Eisenhower and named after John F. Kennedy.\n\n'Politics have never affected the presentation of shows and the display of extraordinary visual arts. However in recent weeks we have sadly seen decades of Kennedy Center neutrality be destroyed,' he said.\n\nDonald TrumpPoliticsRepublicans\n\nShare or comment on this article:\nHamilton blasted for whining about Trump's hostile takeover of Kennedy Center and refusing to perform\n\nAdd comment","summary":"Republicans slammed the creators of Hamilton after it canceled its upcoming run at the Kennedy Center, citing the 'new culture' of the institution following President Donald Trump's takeover. ","url":"https://www.dailymail.co.uk/news/article-14466691/hamilton-cancel-kennedy-center-publicity-stunt.html","image":"https://i.dailymail.co.uk/1s/2025/03/06/00/95891487-0-Lin_Manuel_Miranda_as_Hamilton_in_the_hit_musical_during_its_Bro-a-52_1741220767834.jpg","video":null,"publish_date":"2025-03-06 00:52:40","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","source_country":"gb","sentiment":0.084},{"id":297146988,"title":"Donald Trump's New Demand to Republicans on Funding the Government","text":"In a post on Truth Social on Wednesday night, President Donald Trump issued a new demand to Republicans as the U.S. government is operating under a continuing resolution set to expire next Friday.To avert a potential shutdown, House Speaker Mike Johnson has proposed a \"clean\" stopgap funding bill to maintain current federal spending levels through September 30, 2025.Trump posted, \"Government funding runs out next week, and Democrats are threatening to shut down the Government - But I am working with the GREAT House Republicans on a Continuing Resolution to fund the Government until September to give us some needed time to work on our Agenda. Conservatives will love this Bill, because it sets us up to cut Taxes and Spending in Reconciliation, all while effectively FREEZING Spending this year, and allowing us to continue our work to, MAKE AMERICA GREAT AGAIN. VERY IMPORTANT - Let's get this Bill done!\"This is a developing news story and will be updated as more information is available.","summary":"To avert a shutdown, Speaker Johnson has proposed a stopgap bill to maintain current federal spending levels through September.","url":"https://www.newsweek.com/donald-trumps-new-demand-republicans-funding-government-2040331","image":"https://d.newsweek.com/en/full/2450666/breaking-news.jpg","video":null,"publish_date":"2025-03-06 00:51:11","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"us","sentiment":-0.393},{"id":297146652,"title":"Trump reaches 36.6 million television viewers for first address to Congress in second term","text":"NEW YORK (AP) — President Donald Trump reached an estimated 36.6 million television viewers for his address to Congress on Tuesday night, the Nielsen company said.\n\nThat beat the 32.2 million people who watched former President Joe Biden’s final State of the Union address last year, but was smaller than any of Trump’s audiences for the annual address during his first term, Nielsen said.\n\nTrump’s first speech to Congress as president, in 2017, was seen by 47.7 million people. Television viewing in general has decreased since then. Nielsen measured viewing on 15 different television networks, including those whose feed was carried on streaming services.\n\nFox News Channel, the most popular network for Trump fans, dominated viewing, reaching 10.7 million people. ABC had 6.3 million, CBS had 4 million, NBC had 3.9 million, Fox broadcast had 2.7 million and both CNN and MSNBC had 1.9 million, Nielsen said.\n\nNielsen said 71% of Trump’s television viewers were 55 and older.","summary":"That beat the 32.2 million people who watched Biden’s final State of the Union address.","url":"https://www.ocregister.com/2025/03/05/trump-speech-ratings/","image":"https://www.ocregister.com/wp-content/uploads/2025/03/Trump_Speech_04916.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-06 00:49:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.252},{"id":297146906,"title":"Trump reaches 36.6 million television viewers for first address to Congress in second term","text":"NEW YORK (AP) — President Donald Trump reached an estimated 36.6 million television viewers for his address to Congress on Tuesday night, the Nielsen company said.\n\nThat beat the 32.2 million people who watched former President Joe Biden’s final State of the Union address last year, but was smaller than any of Trump’s audiences for the annual address during his first term, Nielsen said.\n\nTrump’s first speech to Congress as president, in 2017, was seen by 47.7 million people. Television viewing in general has decreased since then. Nielsen measured viewing on 15 different television networks, including those whose feed was carried on streaming services.\n\nFox News Channel, the most popular network for Trump fans, dominated viewing, reaching 10.7 million people. ABC had 6.3 million, CBS had 4 million, NBC had 3.9 million, Fox broadcast had 2.7 million and both CNN and MSNBC had 1.9 million, Nielsen said.\n\nNielsen said 71% of Trump’s television viewers were 55 and older.","summary":"That beat the 32.2 million people who watched Biden’s final State of the Union address.","url":"https://www.bostonherald.com/2025/03/05/trump-speech-ratings/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/Trump_Speech_04916.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-06 00:49:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.252},{"id":297144494,"title":"Trump voices ‘last warning’ to Hamas if they don’t release all hostages immediately","text":"WASHINGTON, March 6. /TASS/. US President Donald Trump has demanded Hamas immediately release all the hostages and it holds in the Gaza Strip and return all the bodies of those deceased, calling this the \"last warning.\"\n\n\"’Shalom Hamas’ means Hello and Goodbye - You can choose. Release all of the Hostages now, not later, and immediately return all of the dead bodies of the people you murdered, or it is over for you,\" he wrote on his Truth Social network. \"I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don’t do as I say.\"\n\n\"This is your last warning! For the leadership, now is the time to leave Gaza, while you still have a chance. Also, to the People of Gaza: A beautiful Future awaits, but not if you hold Hostages. If you do, you are dead! Make a smart decision. Release the hostages now, or there will be hell to pay later!\" he warned.\n\nWhite House Press Secretary Karoline Leavitt confirmed earlier that Washington was in direct talks with Hamas.\n\nIn mid-January, Israel and Hamas reached an Egypt-, Qatar-, and US-brokered three-stage agreement to release the hostages held in Gaza and declare a ceasefire in the enclave. The three-phase deal took effect on January 19. The initial 42-day phase of the ceasefire ended on March 1. All the living Israeli hostages and the bodies of those deceased that were supposed to be handed over in the first stage were returned to Israel. In exchange, Israel released over 1,500 Palestinian prisoners.\n\nOn March 2, Israel suspended humanitarian aid to the Gaza Strip and closed all checkpoints, citing Hamas’s refusal to accept US Special Presidential Envoy for the Middle East Steve Witkoff’s plan to continue Gaza ceasefire talks.","summary":"\"I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don’t do as I say,\" US President said","url":"https://tass.com/world/1923059","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-03-06 00:48:18","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.182},{"id":297147186,"title":"Trump Allows Car Manufacturers to Import from Canada and Mexico Without Tariffs for One Month","text":"With concerns about the potential impact of the trade war on domestic manufacturing, US President Donald Trump has decided to provide a one-month exemption on the recent tariffs imposed on imports from Mexico and Canada specifically for American car manufacturers.\n\nThe temporary halt in tariffs followed conversations Trump had with the key players in the industry, including Ford, General Motors, and Stellantis, collectively known as the “big 3” vehicle companies, as confirmed by White House press secretary Karoline Leavitt.\n\nWhen questioned about whether the 30-day period would be sufficient for the automotive sector to make necessary adjustments for the new tariffs, Leavitt disclosed that Trump delivered a clear message to the companies looking for an exemption: “He advised them to take action, begin investing, relocate operations to the United States where they will be exempt from tariffs.”\n\n“People are going to lose their jobs,” he said.\n\nAfter the White House announced the one month reprieve, shares of big US, Asian and European vehicle makers jumped as much as 6 per cent.\n\nBut pausing the 25 per cent taxes on autos traded through the North American trade pact USMCA would only delay a broader reckoning to take place on April 2, when Trump is set to impose broad “reciprocal” tariffs to match the taxes and subsidies that other countries charge on imports.\n\nOther industries are also likely to seek exemptions from the import taxes.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWith concerns about the potential impact of the trade war on domestic&#8230;\n\n\nThis Post: Trump Allows Car Manufacturers to Import from Canada and Mexico Without Tariffs for One Month first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/trump-allows-car-manufacturers-to-import-from-canada-and-mexico-without-tariffs-for-one-month/","image":"https://imageresizer.static9.net.au/gKmYKGYaBsqGNp19vhWaU3lzo2M=/500x0/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F767e5eab-bf12-40a4-bb9e-29ce928fd889","video":null,"publish_date":"2025-03-06 00:47:55","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.258},{"id":297146656,"title":"Scientists raise concerns as the US stops sharing air quality data from embassies worldwide","text":"By TAIWO ADEBAYO and SIBI ARASU, Associated Press\n\nNEW DELHI (AP) — The U.S. government will stop sharing air quality data gathered from its embassies and consulates, worrying local scientists and experts who say the effort was vital to monitor global air quality and improve public health.\n\nIn response to an inquiry from The Associated Press, the State Department said Wednesday that its air quality monitoring program would no longer transmit air pollution data from embassies and consulates to the Environmental Protection Agency’s AirNow app and other platforms, which allowed locals in various countries, along with scientists around the world, to see and analyze air quality in cities around the world.\n\nThe stop in sharing data was “due to funding constraints that have caused the Department to turn off the underlying network” read the statement, which added that embassies and consulates were directed to keep their monitors running and the sharing of data could resume in the future if funded was restored. The fiscal cut, first reported by The New York Times, is one of many under President Donald Trump, whose administration has been deprioritizing environmental and climate initiatives.\n\nThe U.S. air quality monitors measured dangerous fine particulate matter, known as PM2.5, which can penetrate deep into the lungs and lead to respiratory diseases, heart conditions, and premature death. The World Health Organization estimates that air pollution kills around 7 million people each year.\n\nNews of the data sharing being cut prompted immediate reaction from scientists who said the data were reliable, allowed for air quality monitoring around the world and helped prompt governments to clean up the air.\n\n‘A big blow’ to global air quality research\n\nBhargav Krishna, an air pollution expert at New Delhi-based Sustainable Futures Collaborative, called the loss of data “a big blow” to air quality research.\n\n“They were part of a handful of sensors in many developing countries and served as a reference for understanding what air quality was like,” Krishna said. “They were also seen to be a well-calibrated and unbiased source of data to cross-check local data if there were concerns about quality.”\n\n“It’s a real shame”, said Alejandro Piracoca Mayorga, a Bogota, Colombia-based freelance air quality consultant. U.S. embassies and consulates in Lima, Peru, Sao Paulo and Bogota have had the public air monitoring. “It was a source of access to air quality information independent of local monitoring networks. They provided another source of information for comparison.”\n\nKhalid Khan, an environmental expert and advocate based in Pakistan, agreed, saying the shutdown of air quality monitoring will “have significant consequences.”\n\nKhan noted that the monitors in Peshawar, Pakistan, one of the most polluted cities in the world, “provided crucial real-time data” which helped policy makers, researchers and the public to take decisions on their health.\n\n“Their removal means a critical gap in environmental monitoring, leaving residents without accurate information on hazardous air conditions,” Khan said. He said vulnerable people in Pakistan and around the world are particularly at risk as they are the least likely to have access to other reliable data.\n\nIn Africa, the program provided air quality data for over a dozen countries including Senegal, Nigeria, Chad and Madagascar. Some of those countries depend almost entirely on the U.S. monitoring systems for their air quality data.\n\nThe WHO’s air quality database will also be affected by the closing of U.S. program. Many poor countries don’t track air quality because stations are too expensive and complex to maintain, meaning they are entirely reliant on U.S. embassy monitoring data.\n\nMonitors strengthened local efforts\n\nIn some places, the U.S. air quality monitors propelled nations to start their own air quality research and raised awareness, Krishna said.\n\nIn China, for example, data from the U.S. Embassy in Beijing famously contradicted official government reports, showing worse pollution levels than authorities acknowledged. It led to China improving air quality.\n\nOfficials in Pakistan’s eastern Punjab province, which struggles with smog, said they were unfazed by the removal of the U.S. monitors. Environment Secretary Raja Jahangir said Punjab authorities have their own and plan to purchase 30 more.\n\nShweta Narayan, a campaign lead at the Global Climate and Health Alliance, said the shutdown of monitors in India is a “huge setback” but also a “critical opportunity” for the Indian government to step up and fill the gaps.\n\n“By strengthening its own air quality monitoring infrastructure, ensuring data transparency, and building public trust in air quality reporting, India can set a benchmark for accountability and environmental governance,” Narayan said.\n\nAdebayo reported from Abuja, Nigeria. Babar Dogar in Lahore, Pakistan, Riaz Khan in Peshawar, Pakistan, Aniruddha Ghosal in Hanoi, Vietnam, and Steven Grattan in Bogota, Colombia, contributed to this report.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Experts say the effort was vital to monitor global air quality and improve public health.","url":"https://www.ocregister.com/2025/03/05/trump-air-monitoring-shutdown/","image":"https://www.ocregister.com/wp-content/uploads/2025/03/Trump_Air_Monitoring_Shutdown_48904.jpg?w=1024&h=658","video":null,"publish_date":"2025-03-06 00:42:51","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.177},{"id":297146908,"title":"Scientists raise concerns as the US stops sharing air quality data from embassies worldwide","text":"By TAIWO ADEBAYO and SIBI ARASU, Associated Press\n\nNEW DELHI (AP) — The U.S. government will stop sharing air quality data gathered from its embassies and consulates, worrying local scientists and experts who say the effort was vital to monitor global air quality and improve public health.\n\nIn response to an inquiry from The Associated Press, the State Department said Wednesday that its air quality monitoring program would no longer transmit air pollution data from embassies and consulates to the Environmental Protection Agency’s AirNow app and other platforms, which allowed locals in various countries, along with scientists around the world, to see and analyze air quality in cities around the world.\n\nThe stop in sharing data was “due to funding constraints that have caused the Department to turn off the underlying network” read the statement, which added that embassies and consulates were directed to keep their monitors running and the sharing of data could resume in the future if funded was restored. The fiscal cut, first reported by The New York Times, is one of many under President Donald Trump, whose administration has been deprioritizing environmental and climate initiatives.\n\nThe U.S. air quality monitors measured dangerous fine particulate matter, known as PM2.5, which can penetrate deep into the lungs and lead to respiratory diseases, heart conditions, and premature death. The World Health Organization estimates that air pollution kills around 7 million people each year.\n\nNews of the data sharing being cut prompted immediate reaction from scientists who said the data were reliable, allowed for air quality monitoring around the world and helped prompt governments to clean up the air.\n\n‘A big blow’ to global air quality research\n\nBhargav Krishna, an air pollution expert at New Delhi-based Sustainable Futures Collaborative, called the loss of data “a big blow” to air quality research.\n\n“They were part of a handful of sensors in many developing countries and served as a reference for understanding what air quality was like,” Krishna said. “They were also seen to be a well-calibrated and unbiased source of data to cross-check local data if there were concerns about quality.”\n\n“It’s a real shame”, said Alejandro Piracoca Mayorga, a Bogota, Colombia-based freelance air quality consultant. U.S. embassies and consulates in Lima, Peru, Sao Paulo and Bogota have had the public air monitoring. “It was a source of access to air quality information independent of local monitoring networks. They provided another source of information for comparison.”\n\nKhalid Khan, an environmental expert and advocate based in Pakistan, agreed, saying the shutdown of air quality monitoring will “have significant consequences.”\n\nKhan noted that the monitors in Peshawar, Pakistan, one of the most polluted cities in the world, “provided crucial real-time data” which helped policy makers, researchers and the public to take decisions on their health.\n\n“Their removal means a critical gap in environmental monitoring, leaving residents without accurate information on hazardous air conditions,” Khan said. He said vulnerable people in Pakistan and around the world are particularly at risk as they are the least likely to have access to other reliable data.\n\nIn Africa, the program provided air quality data for over a dozen countries including Senegal, Nigeria, Chad and Madagascar. Some of those countries depend almost entirely on the U.S. monitoring systems for their air quality data.\n\nThe WHO’s air quality database will also be affected by the closing of U.S. program. Many poor countries don’t track air quality because stations are too expensive and complex to maintain, meaning they are entirely reliant on U.S. embassy monitoring data.\n\nMonitors strengthened local efforts\n\nIn some places, the U.S. air quality monitors propelled nations to start their own air quality research and raised awareness, Krishna said.\n\nIn China, for example, data from the U.S. Embassy in Beijing famously contradicted official government reports, showing worse pollution levels than authorities acknowledged. It led to China improving air quality.\n\nOfficials in Pakistan’s eastern Punjab province, which struggles with smog, said they were unfazed by the removal of the U.S. monitors. Environment Secretary Raja Jahangir said Punjab authorities have their own and plan to purchase 30 more.\n\nShweta Narayan, a campaign lead at the Global Climate and Health Alliance, said the shutdown of monitors in India is a “huge setback” but also a “critical opportunity” for the Indian government to step up and fill the gaps.\n\n“By strengthening its own air quality monitoring infrastructure, ensuring data transparency, and building public trust in air quality reporting, India can set a benchmark for accountability and environmental governance,” Narayan said.\n\nAdebayo reported from Abuja, Nigeria. Babar Dogar in Lahore, Pakistan, Riaz Khan in Peshawar, Pakistan, Aniruddha Ghosal in Hanoi, Vietnam, and Steven Grattan in Bogota, Colombia, contributed to this report.\n\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.","summary":"Experts say the effort was vital to monitor global air quality and improve public health.","url":"https://www.bostonherald.com/2025/03/05/trump-air-monitoring-shutdown/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/Trump_Air_Monitoring_Shutdown_48904.jpg?w=1024&h=658","video":null,"publish_date":"2025-03-06 00:42:51","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.177},{"id":297144076,"title":"Dem Rep compares reaction to Green’s outburst to 'racist yelling' from Jim Crow era","text":"Rep. Lateefah Simon, D-Calif., argued that Republicans criticizing Texas Rep. Al Green's outburst amid President Donald Trump's speech hearkens back to the Jim Crow era. As Trump addressed a joint session of Congress at the Capitol on Tuesday, Green stood up and shouted in an effort to deny the president has a mandate. The congressman made a visual spectacle by waving his walking cane as he shouted, as Republicans drowned him out with chants of \"USA! USA!\" While the sergeants-at-arms were eventually ordered to restore order by removing the long-serving congressman from the chamber, Green has since doubled down on his outburst. \"It is the best way to get that across to a person who uses his incivility, who uses his incivility against our civility,\" Green said of Trump. \"He is a person who has consistently used incivility against civility.\" Simon, who had both walked out of Trump’s address and delivered a response to it on behalf of the Working Families Party, condemned the entire Republican Party at the event. SOCIAL MEDIA ERUPTS AFTER HOUSE DEM AL GREEN INTERRUPTED TRUMP'S ADDRESS: ‘EMBARRASSING THEMSELVES’ \"We’re going back to a 1950s America,\" she warned. \"I want to be very clear about that. For those of us who have parents, who have aunts and uncles and communities that are still alive, who remembered what a Jim Crow America looks like tonight in the chamber, you could look easily to your right, and you could see essentially a monolithic group of folks who look just like one another. And then you went to the left side, and you would see what America truly looks like, a beautiful tapestry of all of us who pray differently, who look differently, who come from four corners of the globe to make this country what it is. We know what we all deserve.\" Simon then went on to condemn Green’s critics, arguing their \"racist yelling\" was like some segregation-era moment taught about in history classes. \"I got to say, as a new member of Congress, I was shocked at what seemed like a blatant disrespect for the House, and it wasn’t coming from Rep. Green. It was coming from the men behind him on the right side who were telling him and yelling, ‘Sit down!’ I mean, it felt like I was watching something in a history class of racist yelling at an elderly Black man challenging the President of the United States not to cut medical care for the sick,\" she said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"What have we become?\" Simon asked. \"Tomorrow means we organize, we enroll folks in continuous care because Medicare and MediCal and Medicaid are still ours in my state, we can’t lose those things. But again, 2026 is too far ahead, folks. Got to get on the ground. We got to get proximate. And I believe that that’s what we will do.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Rep. Simon blasted Republicans at Trumps recent address, arguing they are acting like politicians did during Segregation and bringing back visceral memories of &quot;Jim Crow America.&quot;","url":"https://www.foxnews.com/media/dem-rep-compares-reaction-greens-outburst-racist-yelling-from-jim-crow-era","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/rep-lateefah-simon-condemns-critics-of-al-green.png?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:42:40","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":-0.349},{"id":297147104,"title":"Tariffs on cars from Mexico, Canada delayed","text":"By Elisabeth Buchwald, CNN\n\n(CNN) — President Donald Trump has granted an exemption on auto tariffs on Mexico and Canada for one month, White House Press Secretary Karoline Leavitt announced Wednesday, issuing a major, albeit temporary, concession on a key part of his administration’s economic plan.\n\nAfter speaking with Ford, General Motors and Stellantis, Trump said he agreed to a reprieve to ensure America’s Big Three automakers aren’t harmed financially. But the tariffs are not off – not yet, anyway.\n\n“At the request of the companies associated with USMCA, the president is giving them an exemption for one month so they’re not at an economic disadvantage,” Leavitt said at the daily press briefing. (USMCA refers to the free-trade agreement that was signed during the first Trump administration among the US, Mexico and Canada.)\n\nAll the other across-the-board 25% tariffs on Mexico and Canada remain in effect. But Leavitt also said Trump would remain open to other tariff exemptions – days after saying there would be none. Stocks rallied on the news Wednesday.\n\nLeavitt said the automakers should use the monthlong reprieve to work toward the president’s goals of bringing America’s auto production back to the United States – an unlikely scenario, because that would mark a significant undertaking, requiring massive hiring, investment and strategic planning.\n\nIn response, Ford said it would continue speaking with the administration about issues facing the industry.\n\n“We appreciate President Trump’s work to support our industry and exempt auto companies complying with USMCA,” Ford said in a statement to CNN. “We will continue to have a healthy and candid dialogue with the Administration to help achieve a bright future for our industry and U.S. manufacturing.”\n\n“We thank President Trump for his approach, which enables American automakers like GM to compete and invest domestically,” a General Motors spokesperson said. “With more vehicle assembly plants in the U.S. than any other automaker, GM has invested over $60 billion since the USMCA took effect, and we continue to invest billions of dollars every year in our manufacturing base, supply chain, and U.S. jobs.”\n\nBut Canada is not cheering the one-month auto tariff reprieve, even though US Commerce Department data shows cars are Canada’s second-biggest export to the US.\n\nOntario Premier Doug Ford said he and Canadian Prime Minister Justin Trudeau are unwilling to accept any tariffs on their country’s goods. “We’re on the same page, zero tariffs and we are not going to budge,” he told reporters in a briefing Wednesday.\n\nTrump’s decision to grant the extension comes ahead of his plan for reciprocal tariffs across the globe, which are set to be announced on April 2. Unlike the tariffs on Mexican and Canadian goods, Trump won’t consider for any exemptions on the pending reciprocal tariffs, Leavitt told reporters.\n\nThey also could come on top of the 25% tariffs still in place on other Canadian and Mexican goods. For instance, last week on a Fox News interview, US Commerce Secretary Howard Lutnick called out Canada’s 5% national sales tax when discussing potential reciprocal tariffs Trump could be eyeing.\n\nMexico and Canada are essential to the auto supply chain\n\nLong gone are the days of 100% made-in-America cars. For the past several decades, the North American car industry has operated virtually without borders, thanks to free trade agreements that have been signed by various presidents, including Trump.\n\nAs a result, parts and whole vehicles have flowed freely across borders, sometimes multiple times, before they end up in an American dealership.\n\n“It gives free rein to South Korean and Japanese and European companies,” Ford CEO Jim Farley told investors at a conference last month. “They’re bringing 1.5 million to 2 million vehicles into the US that wouldn’t be subject to those Mexican and Canadian tariffs. It would be one of the biggest windfalls for those companies ever.”\n\nCanadian auto plants produced 1.3 million vehicles last year, according to data from S&P Global Mobility, while Mexican plants produced 4 million vehicles. About 70% of those cars were sold in US dealerships to American buyers. Meanwhile, US auto plants produced 10.2 million vehicles.\n\nLast year, the United States imported $217 billion worth of passenger vehicles, according to Commerce Department data. Over a fifth of those cars came from Mexico, the top source of auto imports last year. Behind Mexico were Japan, South Korea, Canada and Germany, which exported a total of $131 billion worth of passenger cars to the US last year.\n\nValued at $50 billion, passenger cars were Mexico’s top export to the US last year. Behind crude oil, passenger cars were Canada’s top export to the US last year, valued at $28 billion.\n\nAdditionally, Canada and Mexico shipped a combined $47 billion worth of car parts to the US last year, federal trade data shows.\n\nWithout an auto exemption, the 25% tariff on Mexican and Canadian imports could increase the cost of making cars throughout North America by between $3,500 and $12,000, according to analysis by Anderson Research Group, a Michigan-based think tank.\n\nBusinesses still in limbo\n\nThe administration’s swift about-face on auto tariffs adds to the trade chaos that has unfolded since Trump took office. Leavitt noted the president is “open to hearing about additional exemptions.”\n\nThat leaves many businesses in limbo.\n\nA new survey from the Institute for Supply Management released Wednesday showed that respondents noted “great uncertainty about future business activity due to the risk of tariffs and other potential government actions.” Others reported that “tariffs are going to have a ripple down effect that could severely harm our business.”\n\nUS stocks rallied Wednesday after the announcement, with the Dow rising to close 486 points higher, or 1.14%. The broader S&P 500 rose 1.12% and the Nasdaq Composite rose 1.46%. Auto stocks also closed higher, with Ford (F) up 5.75%, Stellantis (STLA) up 9.24% and GM (GM) up 7.22%.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\n\nAbout The Author","summary":"March 5, 2025","url":"https://www.cbc.bb/news/international-news/tariffs-on-cars-from-mexico-canada-delayed/","image":"https://www.cbc.bb/wp-content/uploads/2025/03/Workers-inspect-Mexico-auto-parts-manufacturer-Mauricio-Palos-Bloomberg-Getty-Images-via-CNN-Newsource-.jpg","video":null,"publish_date":"2025-03-06 00:42:32","author":"admin,Elisabeth Buchwald","authors":["admin","Elisabeth Buchwald"],"language":"en","source_country":"bb","sentiment":-0.252},{"id":297145102,"title":"Donald Trump's chilling 'last warning' for Hamas to release all remaining hostages","text":"Donald Trump has warned Hamas to release all remaining hostages held in Gaza - \"or it is over for you\".\n\nThe US President issued the chilling message after meeting eight former hostages at the White House. Writing on his Truth Social platform, Mr Trump said: \"Release all of the Hostages now, not later, and immediately return all of the dead bodies of the people you murdered, or it is OVER for you. Only sick and twisted people keep bodies, and you are sick and twisted!\"\n\nThe White House confirmed Mr Trump intends to hold unprecedented direct talks with the militant group. The move is bold as the US has for decades maintained a policy of not directly engaging with Hamas.\n\nIt’s the first known direct engagement between the US and Hamas since the State Department designated the group a foreign terrorist organisation in 1997.\n\nMr Trump, 78, last month said there would be \"all hell\" to pay if the group did not send home hostages. However, the Israel-Hamas ceasefire remains in the balance.\n\nBut now the President has authorised his envoys to \"talk to anyone\" in an attempt to halt Hamas. It is understood there are 24 living hostages — including Edan Alexander, an American citizen — as well as the bodies of at least 35 others still held in Gaza.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office said: \"Israel has expressed to the United States its position regarding direct talks with Hamas.\"\n\nAdam Boehler, Mr Trump’s nominee to be special envoy for hostage affairs, led the direct talks with Hamas. Mr Boehler, founder and CEO of Rubicon Founders, a healthcare investment firm, was a lead negotiator on the Abraham Accords team during Mr Trump’s first term that strove to win broader recognition of Israel in the Arab world.\n\nThe talks, which took place last month, focused mainly on the release of American hostages, and a potential end of the war without Hamas in power in Gaza, according to a Hamas official who was not authorised to comment publicly and spoke on the condition of anonymity.\n\nThe official added that no progress was made but “the step itself is promising” and more talks are expected. Egyptian and Qatari mediators helped arrange the talks.","summary":"Donald Trump directed the brusque message to Hamas after the White House confirmed on Wednesday the US President intends to hold unprecedented direct talks with the militant group","url":"https://www.mirror.co.uk/news/us-news/donald-trumps-chilling-last-warning-34804854","image":"https://i2-prod.mirror.co.uk/incoming/article34804858.ece/ALTERNATES/s1200/1_Trump-25062810382860.jpg","video":null,"publish_date":"2025-03-06 00:41:11","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.047},{"id":297144472,"title":"Macron says Russian aggression 'does not know borders', proposes French nuclear extension","text":"French President Emmanuel Macron announced on Wednesday (Mar 5) issued a warning, stating that Russia's aggressive behaviour did \"not seem to know borders\" after its invasion of Ukraine. France and its European allies had to react, said Macron, further adding that they must prepare for the worse in case Washington leaves them high and dry. Advertisment Macron's address came amid Washington's change of stance on the ongoing Russia-Ukraine war. In a shocking move, the US has even announced it will stop military aid and intelligence support to Ukraine as diplomatic efforts have accelerated to end the war. Also read: 'Scheduled a meeting': US, Ukraine to hold talks once again days after White House spat Macron also said that he wanted to open a debate on extending France's nuclear deterrent to other European nations amid rising security risks. Advertisment\"Russia has become, at the moment I am speaking to you and for the years to come, a threat to France and Europe... It would be madness to remain a spectator in this world of danger,\" he said in a televised address. Also read: Who is Mohammad Sharifullah, \"top terrorist\" involved in Kabul airport bombing apprehended by US? \"I have decided to open up the strategic debate on the protection of our allies on the European continent through our nuclear deterrent,\" he added. Advertisment Macron's plans for French nuclear deterrence extension came in response to comments by the likely next German chancellor Friedrich Merz on extending the nuclear umbrella, adding that any decision on nuclear weapons use would remain with the French head of state. Also read: Gene Hackman's death case: Investigators rule out gas leakage as cause of death The French president noted that Europe's future should not be decided in Washington or Moscow, as he said that the \"threat from the east is returning and the innocence of these 30 years since the fall of the Berlin Wall is over\". Macron also said that European military forces could be sent to Ukraine if a peace deal is signed to ensure that Russia does not invade its neighbour again. Also read: Indian EAM Jaishankar holds bilateral talks with UK PM Keir Starmer in London over Ukraine conflict A peace agreement for Ukraine would be backed \"perhaps, by the deployment of European forces,\" Macron said. \"They won't go to fight today, they won't go to fight on the front line, but they would be there once a peace deal is signed, to guarantee it is fully respected,\" he said during the address. Macron said that adding European chiefs of staffs would meet in Paris next week to discuss how to support Ukraine after a peace deal. Macron to visit Washington? The French president is considering a joint visit to the US alongside Ukrainian leader Volodymyr Zelensky and British Prime Minister Keir Starmer. \"It is being considered that President Macron could possibly go again to Washington, with President Zelensky and his English counterpart,\" Sophie Primas told reporters after a cabinet meeting. Macron of tariffs Macron on Wednesday called planned US tariffs on European products \"incomprehensible\", adding that he hoped to \"dissuade\" President Donald Trump from imposing them. \"We have to brace for the United States to decide on customs tariffs on European products, like they have just confirmed against Canada and Mexico. This incomprehensible decision, as much for the US economy as for ours, will have consequences on some of our sectors,\" Macron said. \"I hope to convince and dissuade the US president\" from such a move, he added. (With inputs from agencies)","summary":"French President Emmanuel Macron announced on Wednesday (Mar 5) issued a warning, stating that Russia's aggressive behaviour did \"not seem to know borders\" after its invasion of Ukraine. France and its European allies had to react, said Macron, further adding that they must prepare for the worse in case Washington leaves them high and dry. \n\n\nMacron's address came amid Washington's change of stance on the ongoing Russia-Ukraine war. In a shocking move, the US has even announced it will stop military aid and intelligence support to Ukraine as diplomatic efforts have accelerated to end the war. \n\n\nAlso read: 'Scheduled a meeting': US, Ukraine to hold talks once again days after White House spat\n\n\nMacron also said that he wanted to open a debate on extending France's nuclear deterrent to other European nations amid rising security risks. \n\n\n\"Russia has become, at the moment I am speaking to you and for the years to come, a threat to France and Europe... It would be madness to remain a spectator in this world of ","url":"https://www.wionews.com/world/macron-says-russian-aggression-does-not-know-borders-proposes-french-nuclear-extension-8821172","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/03/06/cvUapoUYVXlFJuYsSm6X.png","video":null,"publish_date":"2025-03-06 00:40:40","author":"Srishti Sisodia","authors":["Srishti Sisodia"],"language":"en","category":"politics","source_country":"in","sentiment":-0.308},{"id":297143320,"title":"Watch Trump’s awkward reaction to 13-year-old honorary Secret Service agent hugging him","text":"This is the awkward reaction Donald Trump had to a 13-year-old boy hugging him in the Oval Office.\n\nDuring his 100-minute address to Congress on Tuesday night (5 March), the president swore in DJ Daniel, a brain cancer survivor and aspiring police officer, as an honorary Secret Service agent.\n\nThe Texas teen, dressed in a police uniform, visited the Oval Office the next day with his family. In a video shared to X, Daniel could be seen standing beside Trump before telling him “There’s one more thing I got for you – a big hug.\" \n\nDaniel then embraced the president, who gave the boy’s arm a few stiff pats.","summary":"This is the awkward reaction Donald Trump had to a 13-year-old boy hugging him in the Oval Office.","url":"https://www.independent.co.uk/tv/news/trump-dj-daniel-awkward-hug-b2709850.html","image":"https://static.independent.co.uk/2025/03/06/0/24/Trumps-awkward-reaction-to-13-year-old-honorary-Secret-Service-agent-DJ-Daniel-hugging-him.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/0GTKrPYr-OhrQWqOm.mp4","publish_date":"2025-03-06 00:37:33","author":"Zack Palomo","authors":["Zack Palomo"],"language":"en","source_country":"gb","sentiment":-0.023},{"id":297146408,"title":"Big City Mayors Defend Policies Protecting Illegal Immigrants in Testimony to Congress","text":"Four major city mayors testified on Capitol Hill on March 5, defending their policies that protect illegal immigrants from federal immigration authorities, known as sanctuary policies.\n\nBoston Mayor Michelle Wu, Chicago Mayor Brandon Johnson, Denver Mayor Mike Johnston, and New York Mayor Eric Adams each fielded questions on their state and local laws from members of the House Oversight and Government Reform Committee.\n\nTheir common claim: Their cities are safe, and their policies do not violate federal law.\n\nWhile the Democratic mayors tiptoed around using the term “sanctuary city,” they pushed back on Republicans’ claim that their cities’ policies put criminal illegal immigrants before their constituents and the Constitution.\n\nAs Republican committee members questioned the cities’ cooperation with U.S. Immigration and Customs Enforcement (ICE), several Democrats sympathized with their dilemma of balancing public safety and the desire to provide a welcoming environment for illegal immigrants.\n\nThe hearing comes amid the Trump administration’s nationwide crackdown on illegal immigration, starting with those who have committed a crime. Several Democrat-run cities and states have made it known that they will not comply or cooperate with federal immigration officers conducting operations in their areas.\n\nAdams said the question was “way over” his head, while Johnson said Chicago follows all local, state, and federal laws.\n\nWu, meanwhile, said she was unfamiliar with the Supremacy Clause and pledged to follow all local, state, and federal laws. That prompted Gosar to question which laws she would follow if her local laws conflicted with federal law.\n\n“The Constitution, as I understand it, doesn’t require cities or police officers or anyone to follow … federal laws in conflict with local laws or state laws,” the Boston mayor said.\n\nGosar disagreed.\n\n“The Constitution is explicit that the federal government has jurisdiction and supremacy over all immigration laws,” he said.\n\nOther Republican members raised the same point, saying that sanctuary city policies are in direct violation of federal law.\n\nRep. Andy Biggs (R-Ariz.) noted that U.S. immigration law forbids state or local governments from prohibiting or restricting any official’s communications with federal immigration authorities.\n\nBiggs also pointed to statutes forbidding the shielding of illegal immigrants from detection and requiring the provision of “reasonable access” to evidence of an individual’s immigration status to immigration officers.\n\n“You’re all in violation of all three of these statutes. You’ve got criminal culpability,” he stated, displaying the laws on posters that declared: “Sanctuary Cities Are Illegal.”\n\nRep. Gary Palmer (R-Ala.) agreed, charging the mayors with violating their oath of office.\n\n“You’ve committed a crime,” Palmer said. “Mister Chairman, I don’t understand why we haven’t been discussing obstruction of justice.”\n\n“Over the last three years, federal law did not allow me to stop buses from entering New York City,” the mayor said. “State law required me to provide all in our city with housing and meals and to educate children. City law makes it unlawful to collaborate with ICE for civil enforcement.”\n\nAdams was an anomaly among Democrats as a vocal critic of the way the Biden administration managed the southern border.\n\nNonetheless, he agreed with his counterparts that “comprehensive immigration reform is long overdue” and vowed to work with federal officials “to go after violent gangs and those who harm residents of our city.”\n\nComer noted that Boston law bars the use of city resources and personnel for enforcing civil immigration detainers, “meaning Boston police and other departments cannot cooperate with ICE when it comes to detaining on civil warrants.”\n\nWu said, “Whenever someone commits a crime, whenever there’s a criminal warrant, we hold them accountable.”\n\nWhen pressed on whether that includes delivering those suspects into the hands of ICE, she did not provide a direct answer.\n\n“We follow the laws and make sure that everyone ...” she said before the congressman cut her off.\n\n“I think that is a no,” Comer said, moving on to Johnson.\n\nCiting the case of an illegal immigrant suspected of kidnapping and sexual assault, Comer asked the Windy City mayor if he would turn over that suspect—currently roaming free—to ICE.\n\nJohnson said, “Our local law enforcement works hard every day to get criminals off the streets of Chicago.”\n\nGonzalez, a suspected member of the Venezuelan Tren de Aragua gang, assaulted ICE officers as they were arresting him in the county jail’s parking lot, according to the agency’s Denver Field Office. Jordan said the officers had to use a stun gun on Gonzalez.\n\nThe congressman criticized Denver police for giving ICE one hour’s notice of Gonzalez’s release, noting that they had held him for 345 days prior to his release.\n\nJohnston said the official policy was to coordinate with ICE on a release time and date “so that ICE can come and pick them up from that location.”\n\nJordan said that instead of releasing illegal immigrants to ICE in public spaces like parking lots, it would be safer for local authorities to turn them over to ICE while they are still detained. However, local authorities are prevented from doing this due to sanctuary policies.\n\n“There’s no deal, no quid pro quo, and I did nothing wrong,” Adams said. “And anything dealing with this case had a deference to Judge [Dale] Ho, who’s now addressing it. I’m going to refer to his actions.”\n\nIt wasn’t the mayor’s first time addressing the accusations of a deal, and it wouldn’t be the last. Moments later he was asked the same question by Rep. Gerry Connolly (D-Va.), the committee’s top Democrat, and reiterated that no such deal was made.\n\nThe Justice Department announced the charges against Adams last September, accusing him of taking bribes and accepting illegal campaign contributions and improper benefits from foreign nationals, businessmen, and others.\n\nPresident Donald Trump has suggested that the New York mayor may have been politically targeted by the Biden administration for speaking out about the impacts of illegal immigration on his city.\n\nLast month, federal prosecutors asked Ho to dismiss the charges against Adams, sparking speculation of a potential quid-pro-quo arrangement between the mayor and the Trump administration.\n\nThe judge subsequently canceled the trial but has yet to rule on the requested dismissal.\n\nTrump said in February that he was not involved in the push to dismiss Adams’s case. He suggested in December that after returning to the White House he might pardon Adams in the event of a conviction.","summary":"The mayors of Boston, Chicago, and Denver defend their policies as legal and safe.","url":"https://www.theepochtimes.com/us/5-takeaways-from-city-mayors-congressional-testimony-on-sanctuary-policies-5820725","image":"https://img.theepochtimes.com/assets/uploads/2025/03/05/id5820722-Sanctuary-Cities-hearing-300x180.jpg","video":null,"publish_date":"2025-03-06 00:35:55","author":"Samantha Flom","authors":["Samantha Flom"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":297143606,"title":"Musk suggests privatizing Postal Service, Amtrak before meeting with Senate Republicans","text":"March 5 (UPI) -- Department of Government Efficiency Director Elon Musk met with GOP lawmakers Wednesday after suggesting the federal government privatize services as much as possible.\n\nMusk attended a closed-door luncheon with Senate Republicans Wednesday afternoon, the Washington Post and Politico reported.\n\nMusk also recently made a virtual appearance at a San Francisco technology conference hosted by Morgan Stanley on Wednesday and called Amtrak trains a \"sad situation\" when compared to high-speed rail services in Europe and Asia.\n\n\"If you're coming from another country, please don't use our national rail,\" Musk said, as reported by NBC News. \"It can leave you with a very bad impression of America.\"\n\nMusk told conference attendees Amtrak and the Postal Service are prime candidates for privatization and said that would be the best way to improve both.\n\n\"Something's got to have some chance of going bankrupt,\" he said, \"or there's not a good feedback loop for improvement.\"\n\nPresident Donald Trump also has expressed interest in privatizing the Postal Service and last month told media Commerce Secretary Howard Lutnick would look into putting the Commerce Department in charge of the Postal Service.\n\n\"We're losing so much money with the Postal Service, and we don't want to lose that kind of money,\" Trump said.\n\nThe Postal Service on Nov. 14 reported a loss of $1.8 billion for the 2024 fiscal year that ended in September, which was $434 million less than its fiscal year 2023 loss.\n\nMuch of that loss is due to retiree pension liability and compensation adjustments for non-cash workers.\n\nSen. Rick Scott, R-Fla., confirmed Musk attended the Senate GOP lunch a week after some Senate Republicans told Musk he needed to do better at communicating and coordinating with lawmakers while working to reduce the size and cost of the federal government.\n\nScott organizes the weekly Wednesday afternoon lunches among GOP Senators and had told his colleagues he would invite Musk to speak with them regarding DOGE activities and their effect on the federal government and lawmakers' constituents.\n\nMusk also is scheduled to meet with House GOP lawmakers Wednesday evening.\n\nRepublican lawmakers in both chambers of Congress aired concerns about how Musk and DOGE had been going about mass firings while cutting costs without seeking input from federal lawmakers.\n\nMany Republican senators and representatives have received complaints from constituents regarding the potential impact of the federal workforce reduction and the way in which it was occurring.","summary":"Department of Government Efficiency Director Elon Musk met with GOP lawmakers Wednesday after suggesting the federal government privatize services as much as possible.","url":"https://www.upi.com/Top_News/US/2025/03/05/musk-postal-service-amtrak-privatization/8311741218803/","image":"https://cdnph.upi.com/ph/st/th/8311741218803/2025/upi/d5c1c933cdc3fba933621c1ad4bacb15/v1.2/Before-meeting-with-Senate-Republicans-Musk-suggests-privatizing-US-rail-mail.jpg","video":null,"publish_date":"2025-03-06 00:33:14","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.105},{"id":297141470,"title":"Democrat Rep. Stansbury goes on profane tirade during sanctuary city hearing: 'total bulls***'","text":"Democrat Rep. Melanie Stansbury of New Mexico went off in a curse-laden tirade against the Trump administration and Republicans during a House Oversight Committee hearing on sanctuary cities, calling the hearing \"absolute bulls--t.\" Testifying at the hearing were mayors Eric Adams of New York City, Michelle Wu of Boston, Brandon Johnson of Chicago and Mike Johnston of Denver, all of whom are Democrats and lead cities with migrant \"sanctuary\" policies. These laws ban or restrict law enforcement from cooperating with federal immigration authorities to deport illegal immigrants, including those with criminal charges. Stansbury, who represents a heavily blue border state, came to the defense of the sanctuary mayors and bashed Republicans for what she said was an attempt to intimidate local elected officials. 'SANCTUARY' CITY MAYOR CONFRONTED AFTER GANG MEMBER ALLEGEDLY ASSAULTS FEDERAL OFFICERS \"I always think that we should sage this room after these hearings because we hear a lot of crazy stuff in here,\" she began. \"Our mayors are sitting here, enduring this ridiculous, ridiculous hearing as they’ve been threatened in front of the American people.\" CLICK HERE FOR MORE IMMIGRATION COVERAGE \"I want to reject the fundamental premise of this hearing,\" she went on. \"Because what this entire effort is about is intimidating state and local officials, attacking law-abiding immigrant families and spending millions of dollars of taxpayer dollars both in the administration and in Congress to make ads that are complete smoke and mirrors, trying to say that Donald Trump has somehow secured America’s safety.\" \"Its total bulls--t, absolute bulls--t,\" she yelled. \"They are not making America safer again, and what they are doing is terrorizing immigrant families. That is what they are doing.\" TOM HOMAN: MASSACHUSETTS GOVERNOR SHOULD BE 'BRINGING HELL' TO ILLEGAL IMMIGRANT RAPISTS WITH ME Stansbury also asserted that President Donald Trump \"failed to execute on the most basic thing that he said he would do, which was to pass immigration reform when he got into office.\" CLICK HERE TO GET THE FOX NEWS APP Throwing up her hands and looking around the room, Stansbury said: \"Here we are Donald Trump, where’s your immigration bill? Oh wait, you don’t have one, that’s right. Because none of this is actually about making America safer.\" Stansbury also caught the spotlight Tuesday night when she was spotted standing on the House floor shortly before Trump’s joint address to Congress, holding a sign reading: \"This is not normal.\"","summary":"Democrat Rep. Melanie Stansbury of New Mexico went off in a curse-laden tirade against Republicans during a House Oversight Committee hearing on sanctuary cities, calling the hearing “utter bulls--t.&quot;","url":"https://www.foxnews.com/politics/democrat-rep-stansbury-profane-tirade-sanctuary-city-hearing","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/stansbury-mayors.png?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:25:56","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.717},{"id":297143936,"title":"Dave Portnoy scolds Democrats for 'kindergarten skit' during Trump's address to Congress: 'Clown show'","text":"Dave Portnoy is weighing in on the Democratic Party's \"theatrics\" during President Donald Trump's joint address to Congress. \"You see something like last night, and it feels like a kindergarten skit. And I'm not sure if that is too dissimilar from a lot of State of the Union(s) where there's theatrics and stuff, but it's surreal. Like it's why I tuned in, to be totally honest. It's like you're watching reality TV, but it's also a little sickening that these are our elected officials,\" Portnoy said on \"The Will Cain Show\" Wednesday. \"It's hard to believe, like if you were an alien, and you landed on Earth and you were like, ‘hey, these are the elected... officials of the humans.’ The aliens would invade us in three seconds looking at this clown show that we've got going on. It's really a surreal thing to watch,\" he continued. DEMOCRATIC PROTESTS DURING PRESIDENT TRUMP'S SPEECH MOCKED BY LIBERAL MEDIA FIGURES Multiple Democratic lawmakers caused disruptions during Trump's address to a joint session of Congress Tuesday. Shortly after the president began speaking, Rep. Al Green, D-Texas, stood up and began shouting at the president. Speaker Mike Johnson ordered the sergeant at arms to remove Green from the chamber. Many Democrats held up paddles that read \"Musk steals\" and \"Save Medicaid,\" among other phrases. The progressive wing of the party turned their backs on the president and wore shirts that read \"Resist,\" according to reports. Some Democratic lawmakers avoided the address altogether. The president acknowledged the Democratic lawmakers during his address, saying, \"I look at the Democrats in front of me, and I realize there’s absolutely nothing I can say or do to make them happy or to make them stand and smile, or applaud.\" He invited the Democrats to join him and the GOP, \"Why not join us in celebrating so many incredible wins for America? For the good of our nation, let’s work together and truly make America great again.\" TRUMP EARNS LARGELY POSITIVE SPEECH REACTION, BUT EJECTED DEM'S BEHAVIOR WIDELY DEEMED INAPPROPRIATE: CNN POLL Portnoy said Trump was \"100% accurate\" with his characterization of the Democratic Party and their \"broken brain syndrome with Donald Trump.\" \"[Trump] could cure cancer, and they would say, 'well, you didn't get Aids, did you?' So that's how the people who don't like Trump, the Democrats, are going to act,\" Portnoy told Fox News host Will Cain. \"It doesn't matter what he did, what he said, what person was there, they're never going to clap. They're never going to stand. They're never going to acknowledge it. They hate his guts. And there's nothing he can do ever to change that.\" \"They're never going to give him any credit or acknowledgment or props. And that's really the sadness of American politics.\" Portnoy also chimed in on the way Democrats have \"handled themselves\" beyond last night's address, claiming the party is still in \"shambles\" since the 2024 election. \"[Democrats] don't acknowledge that they lost a fair election or that the will of the American people was Donald Trump. They pushed people like me to Trump because they are so adamant that they're right and the other side is wrong,\" Portnoy said. \"It's the Democrats who have pushed a majority of the middle, and people like myself, to vote Republican. I think the Democratic Party is in shambles because of that.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital's Hanna Panreck contributed to this report.","summary":"Barstool Sports president Dave Portnoy breaks down the Democratic Party&apos;s &apos;theatrics&apos; during President Donald Trump&apos;s joint address to Congress on &apos;The Will Cain Show.&apos;","url":"https://www.foxnews.com/media/dave-portnoy-scolds-democrats-kindergarten-skit-during-trumps-address-congress-clown-show","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/1200/675/dave-portnoy-dems-trump-address.png?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:22:24","author":"Madeline Coggins","authors":["Madeline Coggins"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":297140392,"title":"Jordon Hudson claims victory from Donald Trump after desperate plea over Maine fishing's 'existential crisis'","text":"BREAKING NEWSJordon Hudson claims victory from Donald Trump after desperate plea over Maine fishing's 'existential crisis'\n\nLISTEN: Trump’s State of the Union address, Elon on Joe Rogan, and the First Lady’s newest cause – on the Daily Mail’s Welcome to MAGAland podcast\n\nBy JACK BEZANTS\n\nPublished: 23:55 GMT, 5 March 2025 | Updated: 00:21 GMT, 6 March 2025\n\nJordon Hudson, the 24-year-old girlfriend of legendary football coach Bill Belichick, 72, has claimed victory from Donald Trump after her desperate plea for him to reinstate the Maine Sea Grant.\n\nThe former cheerleader issued an impassioned statement on Instagram this week where she underlined the 'existential fears' of families who depend on the fishing industry for their livelihoods after funding for the Maine Sea Grant was cut.\n\nBut on Wednesday night, she gleefully announced that the Trump administration have agreed to renegotiate the funding, posting on Instagram: The fisherman have been heard! The Trump administration has agreed to renegotiate the Maine Sea Grant Funding.\n\n'It is with a full, full heart that I share that this most wonderful news with you all. This effort could not have been achieved without Senator Susan Collins and her commitment to Maine’s fishing community. \n\n'Senator Collins, on behalf of all fishermen of Maine, I thank you for your continual support in preserving our heritage, tradition and economy.\n\nThank you to the U.S. Secretary of Commerce Howard Lutnik, for hearing our pleas. \n\nJordon Hudson issued a desperate plea to Donald Trump about Maine fishing this week\n\n'Thank you for your commitment to ensuring that hardworking Maine lobstermen and fishermen will continue to make a living and provide seafood for local, state, and national markets in a sustainable fashion.'\n\nShe ended her post with the hashtags 'TrumpDOESLoveFishermen' and 'TrumpLovesFisherman'.\n\nHudson previously addressed the plight during Super Bowl week when she donned a nautical themed mini dress and matching lobster purse for Sports Illustrated's The Party. \n\nShe had hand-bedazzled the purse with the message, 'Save Maine Fishermen,' which she said was inspired by her 'nautical family history.'\n\n'I have a message that pays homage to my family and a message that I'd like to put out there and give a little bit of recognition to the fishermen in Maine,' Hudson said, via PEOPLE.\n\n'They need help, and hopefully through fashion, we can bring awareness to the fact that fishermen and lobstermen in Maine are struggling,' Hudson added.\n\nHudson, who has said that she is working on producing a documentary about her family history and the ongoing struggles of Maine fishermen, previously took to Instagram to speak out on the issue. \n\n'The consequences of poor local and state legislation can be devastating. I would know, as my life has been severely altered by just that,' Hudson wrote.\n\n'During the early 2000's, a series of bills were passed by the Maine State Legislature (some of which were co-sponsored by local reps.) that were detrimental to Maine's entire fishing industry and wiped out many fishing communities; ultimately resulting in the closure of my family's multi-generational fishing business,' she continued.\n\nMORE TO FOLLOW \n\nSusan CollinsInstagramBill Belichick\n\nShare or comment on this article:\nJordon Hudson claims victory from Donald Trump after desperate plea over Maine fishing's 'existential crisis'\n\nAdd comment","summary":"Jordon Hudson, the 24-year-old girlfriend of Bill Belichick , 72, has claimed victory from Donald Trump a plea for him to reinstate the Maine Sea Grant.","url":"https://www.dailymail.co.uk/sport/othersports/article-14466681/Jordon-Hudson-victory-Donald-Trump-desperate-Maine-fishing-existential-crisis.html","image":"https://i.dailymail.co.uk/1s/2025/03/05/23/95890899-0-image-m-26_1741218903609.jpg","video":null,"publish_date":"2025-03-06 00:21:00","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","category":"politics","source_country":"gb","sentiment":0.119},{"id":297145530,"title":"India, China levies very high: Trump declares reciprocal tariffs from April 2","text":"US President Donald Trump on Tuesday night criticised the high tariffs charged by India, China and other countries, calling the practice “very unfair” and announced the imposition of “reciprocal tariffs” from April 2.He was addressing a joint session of the US Congress.This leaves India with less than four weeks to decide and, if needed, adjust the duties it levies on US goods entering India. Otherwise, the Trump administration will impose equal tariffs on Indian goods entering the US.New Delhi has already set up a multi-ministry committee to study the impact the reciprocal tariffs will have on the India-US trade.In February, after a bilateral meeting between Trump and Prime Minister Narendra Modi in Washington DC, the two countries had agreed to negotiate the first tranche of a mutually beneficial multi-sector bilateral trade agreement by September-October this year.Modi and Trump had also announced “Mission 500”, targeting a bilateral trade of $500 billion by 2030.India studying impact on tradeThe decision leaves India with less than four weeks to decide and, if needed, adjust the duties it levies on US goodsIn case it doesn’t, the Trump admn will impose equal tariffsNew Delhi has set up a multi-ministry panel to study the impact the reciprocal tariffs will have on India-US tradeChina: Ready, if war is what US wantsIn response to US tariffs, the Chinese foreign affairs ministry said, “If war is what the US wants, be it a tariff war, a trade war or any other type of war, we’re ready to fight till the end.”Spokesperson Lin Jian said, “Bullying does not work on us. Threats are not the right way of dealing with China.”Meanwhile, in his speech at the joint session of the US Congress, Trump pointed out India’s high tariff rates, stating, “India charges us tariffs — 100 per cent. The system is not fair to the US, it never was.”“Other countries have used tariffs against us for decades, and now it’s our turn to start using them against those countries,” Trump said, reinforcing his “America first” approach. Under the policy of reciprocal tariffs, the US plans to impose equivalent tariffs on countries that levy high duties on American goods. Trump said, “Whatever they tariff us, we will tariff them. Whatever they tax us, we will tax them. If they use non-monetary barriers to keep us out of their market, we will do the same.”The new tariffs, which will target a wide range of imports from key trading partners, including Canada, Mexico, China, the European Union and India, are part of Trump’s push to overhaul US trade policies. Trump argued that countries have long imposed higher duties on American products while benefiting from lower US tariffs, creating an uneven playing field.Trump’s push for reciprocal tariffs is in line with his long-standing belief that global trade rules disadvantage the US. During his first term, his administration considered similar measures but did not fully implement them. The new tariffs will be applied on a country-by-country basis, considering not just tariff rates but also non-tariff barriers like subsidies and regulatory hurdles.","summary":"US President Donald Trump on Tuesday night criticised the high tariffs charged by India, China and other countries, calling the practice “very unfair” and announced the imposition of “reciprocal tariffs” from April 2. He was addressing a joint session of the US Congress. This leaves India with less than four weeks to decide and, if [&#8230;]","url":"https://www.tribuneindia.com/news/india/india-china-levies-very-high-trump-declares-reciprocal-tariffs-from-april-2","image":"https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYWFjMGQ2MDcwLWZhMjAtMTFlZi1iNWU1LTAxNGU1NjQ3MjgyZS5qcGc=","video":null,"publish_date":"2025-03-06 00:19:01","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","source_country":"in","sentiment":0.047},{"id":297143000,"title":"What Donald Trump's Said About Tom Llamas, Lester Holt's Replacement","text":"Tom Llamas, set to replace Lester Holt as anchor of NBC's Nightly News this summer, was called a \"sleaze\" by former President Donald Trump during the 2016 campaign.Why It MattersNBC News announced Wednesday that Llamas will take over as anchor of Nightly News this summer, replacing Lester Holt.Trump has a tenuous relationship with the press, often using the phrase \"fake news\" to dismiss unfavorable coverage. He has been outspoken in his support for and criticism of specific outlets and journalists.Shortly after taking office again, Trump implemented media changes affecting the press pool and access. The media shake-up celebrated by Trump has raised concerns among some in the industry who fear that access to reporting the truth will become increasingly difficult as credentials are revoked and outlets too favorable of the president may not provide full coverage.What To KnowIn 2016, Llamas, who was a weekend anchor of ABC World News Tonight, asked then-presidential candidate Trump about conflicting Iowa fundraising reports.\"What I don't want is, when I raise millions of dollars, have people say – like this sleazy guy right over here from ABC; he's a sleaze in my book,\" Trump replied to Llamas' question.Llamas responded, \"Why am I a sleaze?\" To which Trump said, \"You're a sleaze because you know the facts and you know the facts well.\"The journalist posted on Twitter at the time that, \"Trump just called me a 'sleaze.' Should be an interesting week.\"Who Is Tom Llamas?Llamas, 45, is a Miami native and the son of Cuban immigrants. He lives in Purchase, New York, with his family.He has a journalism career spanning more than 20 years, with reporting roles at MSNBC, ABC, and NBC.Since joining NBC from ABC in 2021, he has served as Holt's primary fill-in on the broadcast and has become a de facto lead anchor for NBC News Now, where he hosts the one-hour Top Story with Tom Llamas.Janelle Rodriguez, NBC News' executive vice president of programming described Tom as possessing the \"winning combination of journalistic excellence, passionate storytelling and unyielding integrity—all characteristics that have long been trademarks of NBC 'Nightly News.'\"The journalist told The New York Times that he collects records, around 200 of them. Who Is Tom Llamas' Wife, Jennifer Llamas?Llamas and his wife, Jennifer, share three children, two daughters, Malena and Juju, and one son, Tomas, according to The New York Times.Jennifer is a native of New Orleans, and is also a journalist by training, having worked at MSNBC as an executive producer of NewsNation with Tamron Hall.She graduated from Loyola University New Orleans with a bachelor of arts in broadcast journalism in 2003, according to her LinkedIn profile.Both Tom and Jennifer are Catholic. They attend church in Rye, New York, per The New York Times. When Will Tom Llamas Replace Lester Holt?Holt announced in February that he will step down from his role this summer. It is unclear which summer month Llamas will take over yet.Llamas has called his new role a \"profound honor\" and said it carries \"tremendous responsibility.\"Holt said on Wednesday that he is \"happy for Tom and his family – and crush it my friend.\"","summary":"He has been outspoken in his support for and criticism of specific outlets and journalists.","url":"https://www.newsweek.com/donald-trump-tom-llamas-lester-holt-nbc-nightly-news-2040313","image":"https://d.newsweek.com/en/full/2601276/tom-llamas.jpg","video":null,"publish_date":"2025-03-06 00:17:33","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"US","sentiment":0.404},{"id":297145862,"title":"Trump warns Gaza 'you are dead' if hostages not freed","text":"US President Donald Trump on Wednesday threatened further destruction of Gaza if all remaining hostages are not released, and issued an ultimatum to Hamas leaders to flee.Strongly backing Israel as a ceasefire teeters, Trump said he was \"sending Israel everything it needs to finish the job\" as his administration expedites billions of dollars in weapons.\"Release all of the Hostages now, not later, and immediately return all of the dead bodies of the people you murdered, or it is OVER for you,\" he wrote on his Truth Social platform after meeting freed hostages.\"This is your last warning! For the leadership, now is the time to leave Gaza, while you still have a chance.\"Trump also made clear there would be repercussions for Gaza as a whole, where virtually the entire population has been displaced by Israel's relentless military campaign in response to the 7 October 2023 attacks by Hamas.\"To the People of Gaza: A beautiful Future awaits, but not if you hold Hostages. If you do, you are DEAD!\"His comments follow Israeli Prime Minister Benjamin Netanyahu's warning of \"consequences that you cannot imagine\" if Hamas does not hand over remaining hostages seized in the 7 October attack.The first phase of a ceasefire ended over the weekend after six weeks of relative calm that included exchanges of Israeli hostages for Palestinian prisoners held in Israeli jails.While Israel has said it wants to extend the first phase until mid-April, Hamas has insisted on a transition to the second phase, which should lead to a permanent end to the war.But Israel has ramped up pressure not just with threats by halting all entry of goods and supplies into Gaza, renewing a hardline approach to which the previous US administration of Joe Biden had objected.\"Hamas has indeed suffered a severe blow, but it has not yet been defeated. The mission is not yet accomplished,\" Israel's new military chief Eyal Zamir warned Wednesday.France, Britain and Germany jointly Wednesday called the humanitarian situation in Gaza \"catastrophic,\" and urged Israel to ensure the \"unhindered\" delivery of aid.South Africa said Israel's restriction of aid into Gaza since the weekend amounted to using starvation as a weapon of war.Talks with HamasTrump's hawkish language came after the United States confirmed unprecedented direct talks with Hamas, with the US envoy on hostage affairs, Adam Boehler, discussing American hostages.\"Look, dialogue and talking to people around the world to do what's in the best interest of the American people is something that the President\" believes is right, White House Press Secretary Karoline Leavitt said.The United States had refused direct contact with the Palestinian militants since banning them as a terrorist organization in 1997. But Leavitt said that the hostage envoy in his role \"has the authority to talk to anyone.\"Both the White House and Netanyahu's office confirmed Israel was consulted in advance on the talks.Five Americans are believed to remain among the hostages. Four of them have been confirmed dead and the other, Edan Alexander, is believed to be alive.The Hamas assault resulted in the deaths of 1,218 people, most of them civilians, while Israel's military retaliation in Gaza has killed at least 48,440 people, also mostly civilians, data from both sides show.Of the 251 captives taken during Hamas's attack, 58 remain in Gaza, including 34 the Israeli military has confirmed are dead.Doubts on Arab planTrump has floated a proposal to take over the Gaza Strip and displace its people, an idea that has drawn wide condemnation around the world.Arab leaders have sought support for an alternative plan they put forward that would finance Gaza's reconstruction through a trust fund.A draft of the plan seen by AFP outlined a five-year roadmap with a price tag of $53 billion — roughly the amount the United Nations estimated for Gaza's reconstruction — but the figure was not included in the summit's final statement.The summit also called for unified representation under the Palestine Liberation Organization to sideline Islamist Hamas.Hugh Lovatt, a senior policy fellow at the European Council on Foreign Relations, said the new plan was \"far more realistic than what the Trump administration is proposing in terms of being able to be operationalized.\"But Ghassan Khatib, a Palestinian political analyst and former Palestinian Authority minister, was skeptical whether it could realistically happen, noting the lack of details on financing and the political hurdles it would face.\"It doesn't make sense to expect Israel to drop the plan of Trump and to adopt the plan of the Arabs. There's no chance.\"","summary":"","url":"https://tribune.net.ph/2025/03/06/trump-warns-gaza-you-are-dead-if-hostages-not-freed","image":"https://media.assettype.com/tribune/2025-02-11/y839pscq/00036XK27E.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-03-06 00:16:16","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":-0.216},{"id":297144200,"title":"‘Hamilton’ Cancels Kennedy Center Show Run In Protest Of Trump’s ‘Purge’","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\n“Hamilton” producer Jeffrey Seller said Wednesday the popular musical created by Lin-Manuel Miranda is canceling its 2026 dates at the Kennedy Center in protest of President Donald Trump, who took over as the center’s chair last month, fired board members and canceled some of its programming.\n\nNEW YORK, NY - FEBRUARY 15: Actor, composer Lin-Manuel Miranda is seen on stage during \"Hamilton\" ... [+] GRAMMY performance for The 58th GRAMMY Awards at Richard Rodgers Theater on February 15, 2016 in New York City. (Photo by Theo Wargo/WireImage)\n\nSeller said the decision to cancel the show’s dates next year was not an act against the Trump administration, but a move made against “the partisan policies of the Kennedy Center” as a result of Trump’s takeover.\n\nKennedy Center President Richard Grenell—a Trump ally—responded on X by calling the move a “publicity stunt that will backfire.”\n\nSeller also called the cancellation a “business decision,” expressing concerns the show’s expensive production could have been abruptly cancelled or re-negotiated, impacting hundreds of employees who work on the show.\n\nMiranda told The New York Times the “latest action by Trump means it’s not the Kennedy Center as we knew it.”\n\n“Hamilton” will soon announce an alternative venue for the shows in the Washington area, the Times reported.\n\nThe Kennedy Center did not immediately respond to Forbes’ request for comment.\n\nThis is a developing story. Check back for updates.\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nAntonio Pequeño IV\n\nEditorial Standards\n\nForbes Accolades","summary":"President Donald Trump was appointed as the performing arts center’s chairman last month to combat its “woke” programming.","url":"https://www.forbes.com/sites/antoniopequenoiv/2025/03/05/hamilton-cancels-kennedy-center-show-run-in-protest-of-trumps-purge/","image":"https://imageio.forbes.com/specials-images/imageserve/67c8e8ad9574c3d712856c08/0x0.jpg?format=jpg&crop=3687,2456,x1,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-06 00:14:04","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.206},{"id":297139244,"title":"America the evil mastermind? Not so fast, Russians are told","text":"Five weeks ago, Russian Foreign Minister Sergey Lavrov delivered a routine speech blasting the “hegemonic, egoistic” United States at the helm of the “collective West”. The worldview of the 74-year-old veteran diplomat has since undergone some head-spinning changes.\n\nIn an interview on Russian state television on Sunday, Lavrov listed the ills that Europe – not America – had brought upon the world. The US, in his telling, had gone from evil mastermind to innocent bystander.\n\n“Colonisation, wars, crusaders, the Crimean War, Napoleon, World War I, Hitler,” Lavrov said. “If we look at history in retrospect, the Americans did not play any instigating, let alone incendiary, role.”\n\nAs President Donald Trump turns decades of US foreign policy upside down, another dizzying swing is taking place in Russia, both in the Kremlin and on state-controlled television: The United States, the new message goes, is not that bad after all.","summary":"As Donald Trump turns US foreign policy on its head, another dizzying swing is taking place in Russia: The US, the new message goes, is not that bad after all.","url":"https://www.theage.com.au/world/europe/america-the-evil-mastermind-not-so-fast-russians-are-told-20250305-p5lh8m.html","image":"https://static.ffx.io/images/$zoom_0.1536341215726099%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/b63be4f3b11fe628ad05e2ab4a07120a1a3f9edd","video":null,"publish_date":"2025-03-06 00:12:14","author":"Anton Troianovski","authors":["Anton Troianovski"],"language":"en","category":"politics","source_country":"au","sentiment":-0.045},{"id":297140558,"title":"America the evil mastermind? Not so fast, Russians are told","text":"Five weeks ago, Russian Foreign Minister Sergey Lavrov delivered a routine speech blasting the “hegemonic, egoistic” United States at the helm of the “collective West”. The worldview of the 74-year-old veteran diplomat has since undergone some head-spinning changes.\n\nIn an interview on Russian state television on Sunday, Lavrov listed the ills that Europe – not America – had brought upon the world. The US, in his telling, had gone from evil mastermind to innocent bystander.\n\n“Colonisation, wars, crusaders, the Crimean War, Napoleon, World War I, Hitler,” Lavrov said. “If we look at history in retrospect, the Americans did not play any instigating, let alone incendiary, role.”\n\nAs President Donald Trump turns decades of US foreign policy upside down, another dizzying swing is taking place in Russia, both in the Kremlin and on state-controlled television: The United States, the new message goes, is not that bad after all.","summary":"As Donald Trump turns US foreign policy on its head, another dizzying swing is taking place in Russia: The US, the new message goes, is not that bad after all.","url":"https://www.brisbanetimes.com.au/world/europe/america-the-evil-mastermind-not-so-fast-russians-are-told-20250305-p5lh8m.html","image":"https://static.ffx.io/images/$zoom_0.1536341215726099%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/b63be4f3b11fe628ad05e2ab4a07120a1a3f9edd","video":null,"publish_date":"2025-03-06 00:12:14","author":"Anton Troianovski","authors":["Anton Troianovski"],"language":"en","category":"politics","source_country":"au","sentiment":-0.045},{"id":297138560,"title":"FEC approves N660bn federal highway contracts","text":"The Federal Executive Council on Wednesday approved 13 contracts for the Ministry of Works, aimed at rehabilitating, rescoping and completing critical road infrastructure inherited from the previous administration.\n\nThe Minister of Works, Dave Umahi, disclosed this when briefing State House Correspondents after the 25th Federal Executive Council meeting at the Aso Rock Villa, Abuja.\n\nAmong the key projects is the rescoping and variation of the Alkaleri-Ukuk Road in Bauchi State, which has now been phased for completion in six months, with a contract sum of N11.28bn.\n\nSimilarly, the Uturu-Isikwato-Akara Road in Abia State was revised for phased completion, with phase one valued at N5.93bn.\n\nUmahi said that the adjustments are part of a broader plan to allocate resources strategically, ensuring that available funds are used effectively to complete sections of ongoing projects before committing to new ones.\n\nApproval was also granted for the construction of a new road spanning Zaria Hunkuyi, Kolmani, Danbali, Maraba, Kanya, Subawa, and Kasa in Kaduna and Katsina states. The project, awarded to Mothercat Nigeria Limited, was contracted at N198bn and will be executed over 36 months.\n\nAdditionally, a section of the Kano-Maiduguri Road, previously awarded to Dantata and Sawoe, was reassigned to Tracta Nigeria Limited after a competitive bidding process.\n\nThe project, covering the Kano-Wudil-Shuari axis, is valued at N128.40bn, with a construction period of 18 months.\n\nThe approvals also include the rehabilitation of Wukari-Akwana Road in Taraba State, rescoped to N12.62bn and scheduled for completion in 12 months.\n\nSimilarly, the Bida-Lambatta Road in Niger State was revised, with phase one now set at N39.49bn for a six-month completion period.\n\nIn Kebbi State, the FG approved N2.65bn for the 57-kilometre Bagudu Road project, focusing on protecting ongoing works, particularly the binder course, from environmental damage.\n\nOther projects include the Iyin-Ilawi-Ekiti Road (Section One), which was initially approved with an error, now corrected with a new contract value of N15.63bn.\n\n“And this project is being done by Kingly Global Venture Limited. It was procured for N15bn, but there was a mistake from the Ministry of Works. And so, what was presented to FEC was N13.74bn and it was approved.\n\n“So when we discovered the mistake, we had to now run back to BPP to obtain a fresh objection of N15.63bn, and FEC has withdrawn the previous approval and adopted the N15.63bn.\n\nThe Ilogu Road in Kwara and Osun States was also been rescoped with a six-month completion plan at N7.56bn.\n\nAdditionally, FEC approved the rescoping and variation of the Aba-Nnewi-Arisizogu-Okigwe Road, which cuts across Imo and Anambra States.\n\nThe contract was revised to ensure phase one is completed within six months, for N8.45bn, based on available funding.\n\nIn Lagos, the Outer Marina Shore Protection Project saw its contract sum increase from N144bn to N176bn, following a review that incorporated additional shoreline protection needs, particularly for Navy, Army, Police, and rail infrastructure along the coastline.\n\nThe minister emphasised that the project is crucial to safeguarding federal institutions and assets from further coastal erosion.\n\nUmahi said another intervention was the Cham-Numan Road and Bridge project, which suffered severe damage during flooding in October.\n\nHe noted that President Bola Tinubu personally intervened, directing that the project be completed as quickly as possible.\n\nHe said the road, which was broken into two due to extreme weather, is now undergoing reconstruction, with final approvals granted by FEC.\n\nThe Aba-Ikot Ekpene Road dualisation project was also revised, with its first phase valued at N30bn.\n\nThe minister noted that the FG hopes to prioritise funding for ongoing projects, ensuring that completed road sections are protected from deterioration, particularly from heavy rainfall.\n\nHe stressed that all projects have been rescoped based on available funding.\n\nMDAs procurement threshold\n\nMeanwhile, the Federal Government says it is considering raising the procurement threshold for ministries, departments, and agencies to reduce contract-related memos reaching the Federal Executive Council and allow for more policy discussions during council meetings.\n\nThe proposal was discussed during the latest FEC meeting, with President Bola Tinubu leading the deliberations, the Minister of Information and National Orientation, Mohammed Idris, told journalists at Wednesday’s briefing.\n\nHe said, “You will notice that so many of these memos coming to the council are related to procurement contracts at the FEC level. \n\n“So FEC thought that it would be good to review this so that more time will be given to policy discussions at the Federal Executive Council. In other words, increasing the threshold for ministers and other MDS to execute contracts or procurements at their ministerial, departmental levels, and agency levels.\n\n“So the idea is that it’s not yet conclusive what the final decisions are, but there is a very fruitful debate led by the chairman of Council, Mr President himself, to review this so that we can have more time for policy discussions at the council meetings.”\n\nBy raising the procurement limit at the ministerial and agency levels, Idris said the FG plans to fast-track decision-making, enhance efficiency, and ensure that FEC meetings prioritise national policy discussions.\n\nThe Council also approved N10.30bn to cover third-line antiretroviral drugs for HIV patients, locally manufactured diabetes diagnostic kits, essential medicines and advanced diagnostic equipment for a teaching hospital.\n\nThe Coordinating Minister of Health and Social Welfare, Prof. Ali Pate, disclosed this at the briefing with State House Correspondents in Abuja.\n\nPate revealed that N997m was allocated for the procurement of third-line antiretroviral drugs to support Nigerians living with HIV/AIDS who have developed resistance to first-line treatments.\n\nThe move follows an earlier approval of first-line ARVs, ensuring that patients receive uninterrupted treatment despite global health funding shifts occasioned by the dismantling of the USAID programme by President Donald Trump.\n\nPate explained that the latest approval includes third-line antiretroviral drugs such as Ritonavir and Darunavir, which are more advanced and expensive treatments reserved for patients who have developed resistance to earlier therapies.\n\nHe said “FEC approved a contract of N10.299bn for various products that are linked to enhancing the accessibility and affordability of health commodities and services by Nigerians.\n\n“The first category was the third-line antiretroviral drugs. A few weeks ago, we approved the first line of antiretroviral drugs. These are second and third-line for those who are resistant. Nigeria is putting forth resources almost N997m worth of contracts to procure the third-line antiretroviral drugs for those who are HIV infected.\n\n“I believe you will understand the importance of this, given the changes in the global health financing and moving towards domestic financing to allow Nigerians to continue on treatment that they require.”\n\nHe further noted that first and second-line antiretroviral drugs are already being manufactured locally in Nigeria through technology transfer partnerships with Indian firms. However, the newly approved third-line drugs will need to be imported, as no Nigerian company currently produces them.\n\nThe Council also approved N2bn for the procurement of locally manufactured diagnostic kits for diabetes, which Pate called a significant step in domestic healthcare production.\n\nHe noted that a Lagos-based private company would manufacture the test kits, making Nigeria one of the first countries on the continent to locally produce such essential diagnostic tools.\n\nThis also includes the distribution of blood glucose monitoring devices alongside the test kits, particularly targeting low-income and vulnerable Nigerians.\n\n“The second category is the procurement that was approved for locally manufactured diagnostic kits for diabetes. So the Federal Government is procuring N2bn worth of those diagnostic kits out of this total amount that I had mentioned.\n\n“Diabetes is a major issue in our country. It’s among the fastest-growing segments. We have lots of our population suffering from diabetes, and some are not even aware they have diabetes. In addition, we are having a local company for the first time, one of the first in the continent, who will manufacture these diagnostic test kits in Nigeria.\n\n“This is a company based out in Lagos, which we had commissioned. It’s a private company, but it is manufacturing here in Nigeria. So the government is procuring the diagnostic kits, the On-point Blood Glucose monitoring system that is manufactured here in Nigeria,” he noted.\n\nAdditionally, N4.5bn was allocated under the Medical Relief Programme to procure antibiotics, antihypertensives, and antidiabetic medications.\n\nPate said the initiative aims to reduce the cost of essential drugs, encourage local pharmaceutical manufacturing, and expand access to treatment for chronic conditions.\n\nHe argued that Nigeria’s 230 million population includes a large number of people suffering from hypertension and diabetes. However, the minister revealed that government funding cannot cover free medication for all Nigerians.\n\nInstead, the relief programme will prioritise the poorest and most vulnerable patients who rely on primary healthcare centers and public hospitals but cannot afford essential medications.\n\nThe Minister affirmed that the 2025 expansion of the Medical Relief Program will include enhanced monitoring mechanisms to prevent diversion and leakage.\n\nThe program will also feature branded medications to ensure that approved medicines reach those in genuine need, stating that no Nigerian should be forced to choose between buying food and purchasing life-saving medications.\n\nThe council also approved N2.1bn earmarked for the procurement of a mobile X-ray machine and rehabilitation of a 64-slice CT scan (computerised tomography) to improve diagnostic services at Abubakar Tafawa Balewa University Teaching Hospital in Bauchi.\n\nThe equipment was upgraded “so that the diagnostic services and the clinical care Nigerians will receive in that hospital will be of the highest quality that we can make it, and it serves as a referral, not only in the state where it is located but also in the region,” the minister explained.\n\nHe noted that the FG plans to support local pharmaceutical companies such as Jawa Pharmaceuticals, which has expanded into antibiotic production, and a Lagos-based manufacturer that is producing the first locally made blood glucose test kits in Sub-Saharan Africa.\n\nThrough the Presidential Initiative to Unlock the Healthcare Value Chain, he said over 77 investment cases have been identified, supporting the development of medical textiles, diagnostic kits and pharmaceuticals.","summary":"The Federal Executive Council on Wednesday approved 13 contracts for the Ministry of Works, aimed at rehabilitating, rescoping and completing critical road infrastructure inherited from the previous administration. The Minister of Works, Dave Umahi, disclosed this when briefing State House Correspondents after the 25th Federal Executive Council meeting at the Aso Rock Villa, Abuja. Among \n\n\n \n Read More","url":"https://punchng.com/fec-approves-n660bn-federal-highway-contracts/","image":"https://cdn.punchng.com/wp-content/uploads/2022/03/20031149/Umahi.jpg","video":null,"publish_date":"2025-03-06 00:11:00","author":"Stephen Angbulu","authors":["Stephen Angbulu"],"language":"en","source_country":"ng","sentiment":0.064},{"id":297141412,"title":"\"Identity fraud\": Proposed Texas state law would make identifying as transgender a felony","text":"The Texas state legislature may soon consider whether transgender Texans can be charged with a felony for identifying as their preferred gender. \n\nA bill proposed by Houston-area Rep. Tom Oliverson asks to amend the state penal code to create a new crime of \"gender identity fraud.\" Under the act, a person could be charged with a felony for \"identifying the person's biological sex as the opposite of the biological sex assigned to the person at birth\" while dealing with either government entities or employers. The charge carries a punishment of up to two years in prison and a $10,000 fine. \n\nOliverson's name is regularly affixed to some of the most hateful legislation coming out of the Lone Star State. He authored the state House's version of a bill to ban gender-affirming care for minors in the state. That bill was signed into law in the summer of 2023 and took effect later that year. Texas Attorney General Ken Paxton has since sued several doctors for allegedly providing care to transgender youth. \n\nWhile the bill doesn't have a co-sponsor or any planned hearings in the legislature as of this writing, it's one small piece of continued attacks on trans people in red states and nationally.\n\nLate last year, the Texas Department of Public Safety announced that it would not change sex markers on state-issued driver's licenses for any reason other than \"clerical errors.\" Upon taking office, President Donald Trump floated a raft of anti-trans executive orders that barred transgender people from the United States military and ordered the federal government to cease recognition of transgender and nonbinary identities.\n\nThat's not to say that conservatives are racking up easy wins. Trump's decrees have been countered with a barrage of lawsuits and judge's orders, and the removal of references to transgender people on Stonewall National Monument's webpage led to protests outside of the storied LGBTQ+ landmark.","summary":"The bill proposed by State Rep. Tom Oliverson would leave transgender Texans open to charges of fraud","url":"https://www.salon.com/2025/03/05/identity-fraud-proposed-texas-state-law-would-make-identifying-as-transgender-a-felony/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2023/05/texas-capitol-trans-protest-1477257390.jpg ?>","video":null,"publish_date":"2025-03-06 00:10:20","author":"Alex Galbraith,State Rep. Tom","authors":["Alex Galbraith","State Rep. Tom"],"language":"en","category":"politics","source_country":"US","sentiment":-0.461},{"id":297138946,"title":"Servicemembers Come Home Only To Find Themselves In A New Hell — The VA’s Cold Bureaucracy","text":"Stephen Fisher joined the United States Marine Corps after the September 11, 2001, terrorist attacks. After three tours in Iraq and surviving three roadside bombs, he suffered nerve damage, vision loss and post-traumatic stress disorder (PTSD) among many other injuries from his service.\n\nBut when he returned home to civilian life, he left one battle in Iraq and began to fight another against the Department of Veteran Affairs (VA) bureaucracy attempting to receive healthcare he needed. Fisher filed his first claim in September 2007. Since then, the VA has repeatedly dragged its feet because Fisher couldn’t make all his review appointments for his claims due to working a part-time job as a police dispatcher. His fight for benefits continues.\n\nFisher’s situation is unfortunately the reality for many military veterans who risked their lives fighting America’s enemies overseas.\n\nThe VA has a track record marred with a myriad of problems spanning multiple presidential administrations, such as long wait times, skimping on quality coverage and crumbling facilities that are unable to properly care for veterans. Numerous veterans told the Daily Caller News Foundation that the VA fundamentally misunderstands veterans, and needs major reform in order to stop leaving soldiers behind.\n\n“I’m just stuck in this cyclical loop of being asked to provide additional evidence for something that the VA have fallen short on,” Fisher told the DCNF. “This is something that should have been handled over a decade ago. This has been through four or five presidencies now.”\n\nThe Robert J. Dole VA Medical Center, where Fisher received care, told the DCNF that they could not comment on specifics of a patient’s care without Fisher signing a separate release form, which he declined to provide. The national VA also declined to discuss specifics without a release.\n\n“We didn’t question our leaders before going into battle, not knowing whether or not we would come out alive or whole. We just did it,” Montgomery Granger, former U.S. Army major serving for 28 years, told the DCNF. “If I could say something to Donald Trump and to [VA Secretary] Doug Collins, or to Pete Hegseth, or even Elon Musk doing the [Department of Government Efficiency] work: It’s your turn. Just do it. And when you do it, pay attention to the details.” (RELATED: Trump Backs ‘One Big Beautiful Bill’ In Battle Between Senate Republicans And House GOP Over How To Pass Agenda)\n\nWade Miller, former U.S. Marine and senior advisor at Center for Renewing America, suffered nerve damage during his deployment and received quick treatment while overseas through military hospitals. However, when he was discharged and used the VA Medical Center in Dallas to receive care, he quickly realized that VA care was a far cry from what he received overseas.\n\nThe North Texas VA also told the DCNF that they do not comment on the specifics of cases without patient consent, with Miller declining to sign a release form with his personal information.\n\n“We encourage any Veteran with concerns to contact us so we can swiftly act and deliver the high-quality care they deserve,” the North Texas VA told the DCNF.\n\nWhen he moved to the Washington, D.C., area he was forced to go to a VA hospital nearly an hour away, with little flexibility on appointment times.\n\n“My biggest ongoing complaint is not just the extraordinary amount of time in which it would take you to get seen at a VA hospital, but it’s also the VA hospitals that they assign you to,” Miller told the DCNF. “I live in Burke, Virginia, and they make me go to the VA hospital that’s on the east side of DC. So it’s like an hour plus away. I’ve got numerous hospitals within 10 to 15 minutes of me here.”\n\n“There’s already an existing hospital system around us all, and so we don’t need a duplicate VA system, or we at least don’t need to expand it,” Miller told the DCNF.\n\nMoreover, suicides continue to plague the ranks of veterans.\n\nVeteran suicides have remained relatively steady since 2001, hovering around 6,000 reported veteran suicides in 2022, according to 2024 data from the VA. Granger told the DCNF veterans end up taking their own lives in part because of the lack of understanding of veteran problems at the VA, and that disconnect could be the tipping point that sends some veterans over the edge.\n\n“Asking me to describe my PTSD or how many blasts I was exposed to…It’s degrading,” Granger told the DCNF. “The only two things that the VA gets right right now are the death benefit and burying the whole person.”\n\n“They wonder why there’s an epidemic of veteran suicide. Most guys can’t handle this process,” Granger told the DCNF.\n\nThe claims backlog has risen dramatically since 2019, going from under 100,000 claims before 2019 to over 250,000 in 2025, according to VA data. The VA denies nearly 30% of claims made without an attorney, and nearly 15% made with one, according to a 2020 VA report.\n\nDespite small improvements, wait times for primary care averaged 22 days in May 2024, exceeding the 20-day standard the VA sets for access to care.\n\nThe average age of a VA patient was 64 years old for men, and 49 years for women, according to 2021 VA statistics.\n\nA VA spokesperson told the DCNF that Collins is “focusing relentlessly on customer service and convenience,” highlighting its cuts to DEI policies, personnel changes saving $98 million a year, and its cooperation with the Department of Government Efficiency (DOGE) to curtail “waste.”\n\nThe VA requested $369.5 billion for fiscal year 2025 under the Biden administration, another increase in the already massive amount of tax dollars granted to the department. Despite the increases in funding, many veterans haven’t seen much progress on the ground.\n\nDuring Trump’s first term, he greenlit the Community Cares program under the VA MISSION Act, which allows veterans to get specific care from non-VA providers if the department approves the request. Often, veterans will use the provision to go to private practices to get faster, higher-quality care.\n\nHowever, a group of 24 veterans organizations wrote a letter to the VA in December 2024 alleging that the VA under President Joe Biden was stonewalling access to private providers by abusing a waiting period for inquiries into accessing community care. The VA blamed budgetary constraints within the department on the existence of community care options, despite the fact that a patient only becomes eligible if direct VA care is not available.\n\nCollins said in his confirmation hearing in January that the MISSION ACT was one of the most important pieces of legislation he will seek to fully enforce as secretary. He also pointed to the enforcement of other Trump-era legislation as critical to his new administration, such as the VA Accountability and Whistleblower Protection Act and the PACT Act.\n\nGranger told the DCNF that he is confident that the new administration can reform the VA, and reiterated that it shouldn’t be forgotten that the original mission of the VA was to simply care for veterans.\n\n“Abraham Lincoln didn’t say in the second inaugural address ‘care for him who bore the battle, but only if it’s service-related,’ right?” Granger told the DCNF. “He didn’t qualify the statement. If he had, the whole idea of a veterans administration would have been a complete failure from the beginning.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Humiliating'","url":"https://dailycaller.com/2025/03/05/servicemembers-bureaucracy-va-veterans-medical-care/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/GettyImages-2167038991-scaled-e1739980729438.jpg","video":null,"publish_date":"2025-03-06 00:09:25","author":"Wallace White","authors":["Wallace White"],"language":"en","category":"politics","source_country":"us","sentiment":-0.49},{"id":297147132,"title":"Trump: Why Zelensky has no better path to a peace deal","text":"By Lekan Olayiwola\n\nThe Oval Office grandstanding between presidents Donald Trump and Volodymyr Zelenskyy was an unfortunate punctuation in the Russia-Ukraine peace process. The question on the mind of many who have been following the three-year long conflict is why is Trump taking this contrarian approach?\n\nMany would argue that Russia is the aggressor waging an unjust war, and Ukraine is the hapless victim that deserves all the support it could get from the international community especially the European Union (EU) and the United States (US).\n\nIn what has become a cataclysmic war of attrition, the critical question to ask is: what is the path to peace? Surely, the Ukrainians would cling to their independence and right to self-determination to the death of the last man or so it seems. The Russians on their own part are prepared to drag the war on for as long as possible with China and North Korea as willing allies.\n\nIt’s easy for Zelenskyy to continue stoking the embers of war against Russia as long as the bill is picked up by the US-EU coalition.\n\nBut Trump feels the US cannot continue to carry the burden of a never-ending conflict that has no terminal date. His calculation is probably that winning a nuclear-ready power like Russia is a pipe dream. If the US pulls out its majority support in finance and weaponry, the EU (assuming it could continue to shoulder the burden – highly unlikely) could make mistakes as they have done in the past which resulted in the last two World Wars.\n\nZelenskyy, the European Union and much of rest of the world believe that justice is on the side of Ukraine and more existentially, winning the war against Russia is necessary for the salvation of the whole of Europe and the preservation of democratic principles worldwide. However, what many who think the path to peace is to roundly defeat Russia have not seriously considered is the extent to which Putin is willing to go to achieve his own objectives or denying Zelenskyy his. Meanwhile, city after city, village after village inside Ukrainian territory continue to burn and the casualty tolls continue on its steep climb year on year.\n\nIf the ballooning cost in Ukrainian (and Russian) lives, including financial and material resources does not and is not likely to pave the way to peace, what other path is there to follow? Clearly Ukraine is the underdog in this conflict and the only reason Zelenskyy has been able to hold out this long is his ability to widen the scope of the conflict to involve other world powers in the Eurozone and the United States. As things stands, it is Putin, rather than Zelenskyy who holds the lever of peace. The only leverage Zelenskyy has is the continued support of the EU and the US. But he seems to have lost sight of that key factor when he confronted the current leader of his major ally in this war in Washington recently.\n\nRead Also: Nigeria can earn $2.5billion annually from trades with Morocco – Abbas\n\nIf a powerful supporter says his priority has shifted and he cannot continue to help you, what do you do? Guilt-trip him or shame him into submission to continue to help you against his wish? The path to peace in a situation where the balance of power is clearly on the side of Russia (Ukraine is only propped by NATO members) is some form of appeasement. If the stronger party is not backing down, you have to concede something to him unless you are prepared to burn the whole house down. It is this appeasement approach that Trump’s critics interpret as a misplaced support for Putin. What was he supposed to do as a negotiator? (Forget about the economic quid pro quo part of the deal because that is just to defray United States financial outlay in the war so far).\n\nHow do you reconcile a Trump who is not interested in continuation of the war which he kept saying should never have happened in the first place with a Putin who is hell bent on achieving his objective of keeping NATO out of Ukraine and protecting his irredentist countrymen in parts of Ukraine close to Russia? Zelenskyy should have read between the lines and seen that with Biden-Harris out of the White House, its game over! This is the stuff that realism in international relations is made of. Now, it is no longer about justice. It’s about powerful interests. And if a weaker party insists on rights, they only get hurt further.\n\nIn this ongoing conflict, there is no justice unless it can be obtained with the force of arms which clearly is outside of Zelenskyy’s field of vision or scope of operation for now. All he could hope for is some compromise in his favour and that of the Ukrainian citizens. Rudely demanding “security guarantee” from Trump or anyone else shows that he still has illusions about his own importance, supposing that he has sufficient bargaining power. Apparently, he does not. At least, not with a Trump White House.\n\nWell, the Ukrainian president may choose to ignore Trump and his team and let the EU carry on with the bleeding of resources while he exposes more Ukrainian lives to their needless deaths. Of course, one could come to a painful acceptance that in the pursuit of peace, justice which is an essential ingredient may not always be complete. What is meant by this? Sometimes, we have to concede justice to procure peace , however unsatisfactory that may sound or look. Insisting on absolute justice in a realist world order amounts to chasing the wind. This is even more so where one is contending against an opponent that is more powerful.\n\nWhere does this leaves Ukraine then? Doesn’t following Trump’s path to peace mean that Zelenskyy entered a war that was doomed to be lost from the outset – a war that he should never have entered in the first place? That is exactly what Trump has said emphatically and is now prepared to let Zelenskyy realize its real consequence. Perhaps, if Zelenskyy and his European backers had looked farther over the horizon, they might have seen Trump looming large. Or did they conclude that Biden or Harris would return to help them finish what they had started?\n\nIn a nutshell, Trump is not interested in saving Zelenskyy from the consequences of choosing to defend against a war he could not win; a war that should not have started in the first place. Now that it has happened, sorry, the war has just got to be stopped anyway, however terrible it feels for the Ukrainian or European or even a global sense of justice. The alternative, Trump believes, is World War III which he is not interested in.\n\nIt is painful, but where power relationship is concerned, it is better to seek terms of peace with the one who holds the ace – Russia in this case. That sounds like one is in support of an aggressor or dictator like Putin. Those who think like this are probably not facing reality. Diplomacy ought to have been employed ab initio. Ironically, every war eventually ends on the negotiating table. Why not prevent it there?\n\nAs things stand, president Zelenskyy and all his supporters may have to outwait President Trump for another four years if they consider the latter’s position to be foolish. But where does that leave the people of Ukraine who are already suffering too much? Can the EU be counted upon to sustain the financial and material burden of the war without any help from the United States for that long?\n\n•Olayiwola is a peace and conflict researcher and practitioner and can be reached via lekanolayiwola@gmail.com","summary":"The Oval Office grandstanding between presidents Donald Trump and Volodymyr Zelenskyy was an unfortunate punctuation in the Russia-Ukraine peace process. The question on the mind of many who have been\n\n\nThe post Trump: Why Zelensky has no better path to a peace deal appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/trump-why-zelensky-has-no-better-path-to-a-peace-deal/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2024/05/20003146/Nation.jpg","video":null,"publish_date":"2025-03-06 00:09:23","author":"Our Reporter,The Nation","authors":["Our Reporter","The Nation"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.028},{"id":297147126,"title":"Bomb for Badenoch","text":"Leader of United Kingdom’s opposition with Nigerian roots, Kemi Badenoch, got a taste of the inherent limitation of nativity transplant last week. She was mocked by Prime Minister Keir Starmer as having appointed herself saviour of Western civilisation in desperate search for relevance. It was an underhand. And the message: no mater how hard you fight to belong in an adopted society, you can’t belong more – nor even as well – as the natives as to obliterate your own true origin.\n\nBadenoch is the leader of UK’s Conservative Party, which makes her effectively the shadow premier and locates her only an election away from the possibility of taking the reins. But she is controversial for her hardline stance in defence of British and, by extension, Western interests. She is notorious for talking down on Nigeria and repudiating her ancestral roots. She’s against payment of reparations to African nations by Britain and other colonial powers. She defends the British society against charges of racism and is seen by those who daily experience the ill as a tool in the hands of racist Britain to gaslight their concerns by conveying racism without having to deal with the baggage of being labelled racist, since the rhetoric has been outsourced to a Black person. Recently, she proposed prolonging years of residency required before anyone seeking British citizenship could qualify. In short, she’s been more conservatively British than ancestral Britons.\n\nRead Also: Nigeria can earn $2.5billion annually from trades with Morocco – Abbas\n\nAt the Prime Minister’s Questions (PMQ) time in the Commons, she sparred with Starmer on proposed increase in Britain’s defence budget. Speaking ahead of his visit to Washington to parley with US President Donald Trump, who has been pressing European leaders to increase their defence spending, Starmer announced that the UK will reallocate aid funds to boost military spending to 2.5 percent of GDP by 2027, amounting to £13.4billion. Badenoch questioned him on the exact amount that Defence Secretary John Healey said could be calculated as £6billion when inflation is factored in, to which the prime minister responded with a retort.\n\nUpon Starmer’s pitch, Badenoch suggested he took her advice on using international aid money for defence. “Over the weekend, I suggested to the prime minister that he cut the aid budget, and I am pleased that he accepted my advice. It’s the fastest response I’ve ever had from (him),” she said. In reply, the prime minister was subtly but brutally dismissive: “I’m going to have to let the leader of the opposition down gently… She didn’t feature in my thinking at all. I was so busy over the weekend I didn’t even see her proposal,” he said, adding: “She’s appointed herself saviour of the western civilisation in a desperate search for relevance.”\n\nStarmer has held British knighthood since 2014, even before he entered parliament. You could guess where he’s coming from with Badenoch’s alleged self-appointment as saviour of western civilisation. Cheeky nationalism!","summary":"Leader of United Kingdom’s opposition with Nigerian roots, Kemi Badenoch, got a taste of the inherent limitation of nativity transplant last week. She was mocked by Prime Minister Keir Starmer\n\n\nThe post Bomb for Badenoch appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/bomb-for-badenoch/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2024/02/11150125/Kemi-Badenoch.jpg","video":null,"publish_date":"2025-03-06 00:07:34","author":"Hardball,The Nation","authors":["Hardball","The Nation"],"language":"en","category":"politics","source_country":"ng","sentiment":0.137},{"id":297138114,"title":"Trump made a lot of claims in his address to Congress. Here are the facts","text":"President Donald Trump‘s Tuesday night address to a joint session of Congress highlighted several of the initiatives he’s started in his first six weeks in office, but many of his comments included false and misleading information.\n\nHere’s a look at the facts.\n\nHe overstated the numbers on his immigration crackdown\n\nTRUMP: “Illegal border crossings last month were by far the lowest ever recorded. Ever.”\n\nTHE FACTS: Trump wrote in a Truth Social post on Saturday that Border Patrol apprehended 8,326 people on the U.S.-Mexico border last month. But U.S. government data show that Border Patrol routinely averaged below that number in the 1960s.\n\nWhile February marked the lowest arrest total in decades, Border Patrol averaged less than February 2025 for the first seven years of 1960s. The government website does not track U.S.-Mexico border totals before 1960. Border Patrol’s monthly average was 1,752 arrests in 1961.\n\nHe inflated the number of people who entered the U.S. illegally under President Joe Biden\n\nTRUMP: “Over the past four years, 21 million people poured into the United States. Many of them were murderers, human traffickers, gang members.”\n\nTHE FACTS: That figure, which Trump cites regularly, is highly inflated. U.S. Customs and Border Protection reported more than 10.8 million arrests for illegal crossings from Mexico from January 2021 through December 2024.\n\nBut that’s arrests, not people. Under asylum restrictions during the COVID-19 pandemic, many people crossed more than once until they succeeded because there were no legal consequences for getting turned back to Mexico. So the number of people is lower than the number of arrests.\n\nThere is no evidence other countries are sending their criminals or people with mental illness across the border, despite this frequent line from Trump.\n\nHe overstated hotel costs for noncitizens in New York\n\nTRUMP: Citing alleged examples of what he described as “appalling waste” in the federal government, referenced “$59 million for illegal alien hotel rooms in New York City.”\n\nTHE FACTS: Trump appeared to be referencing a payment of $58.6 million — one of two the city received last month. The payment was a federal reimbursement under the Shelter and Services Program, which was created to support local governments and non-government organizations that provide support to noncitizens released by immigration authorities.\n\nLiz Garcia, a city spokesperson, said at the time that these reimbursements included $19 million in claims for hotel costs. The two payments totaled over $80.5 million for services delivered between November 2023 and October 2024.\n\nEconomists differ with Trump on tariffs\n\nTRUMP: “Tariffs are about making America rich again and making America great again. And it’s happening. And it will happen rather quickly. There’ll be a little disturbance, but we’re OK with that. It won’t be much.”\n\nTHE FACTS: Trump is banking on the idea that taxing imports is the road to riches for the United States. Most economists say Trump’s tariffs would hurt the country, as they’re tax increases that could raise the costs of goods in ways that could also harm economic growth. Trump suggests that the impact on inflation would be minimal.\n\nWhen the Yale University Budget Lab looked at the tariffs that Trump imposed Tuesday on Canada, Mexico and China, it found that inflation would increase a full percentage point, growth would fall by half a percentage point and the average household would lose about $1,600 in disposable income.\n\nThere’s no evidence Social Security money is being paid to many people over age 100\n\nTRUMP: “Believe it or not, government databases list 4.7 million Social Security members from people aged 100 to 109 years old. It lists 3.6 million people from ages 110 to 119. ... 3.47 million people from ages 120 to 129. 3.9 million people from ages 130 to 139. 3.5 million people from ages 140 to 149. And money is being paid to many of them, and we are searching right now.”\n\nTHE FACTS: The databases may list those people, but that does not mean they are getting paid benefits.\n\nPart of the confusion comes from Social Security’s software system based on the COBOL programming language, which doesn’t use a specific format for dates. This means that some entries with missing or incomplete birthdates will default to a reference point of more than 150 years ago. The news organization Wired first reported on the use of COBOL programming language at the Social Security Administration.\n\nAdditionally, a series of reports from the Social Security Administration’s inspector general in March 2023 and July 2024 state that the agency has not established a new system to properly annotate death information in its database, which included roughly 18.9 million Social Security numbers of people born in 1920 or earlier but were not marked as deceased. This does not mean, however, that these people were receiving benefits.\n\nThe agency decided not to update the database because of the cost to do so, which would run upward of $9 million. As of September 2015, the agency automatically stops payments to people who are older than 115 years old.\n\nTrump did not inherit an ‘economic catastrophe’\n\nTRUMP: “Among my very highest priorities is to rescue our economy and get dramatic and immediate relief to working families. As you know, we inherited from the last administration an economic catastrophe and an inflation nightmare.”\n\nTHE FACTS: Inflation peaked at 9.1% in 2022 under President Joe Biden, but Trump did not inherit a disastrous economy by any measure. The unemployment rate ticked down to a low 4% in January, the month he took office, while the economy expanded a healthy 2.8% in 2024. Inflation-adjusted incomes have grown steadily since mid-2023. And inflation, while showing signs of stickiness in recent months and still elevated at 3% in January, is down from its 2022 peak.\n\nStill, concern about the economy was a key driver behind support for Trump during the 2024 election. The average price of basic consumer goods in particular has seen major spikes in recent years. A dozen large eggs, for example, went from a low of $1.33 in August 2020 to $4.82 in January 2023. They decreased in price to $2.07 in September 2023, but are currently on the rise again, at $4.95 as of January.\n\nTrump’s reference to an ‘EV mandate’ is inaccurate\n\nTRUMP: “We ended the last administration’s insane electric vehicle mandate, saving our auto workers and companies from economic destruction.”\n\nTHE FACTS: There was no federal mandate to force the purchase of EVs, as Trump has falsely claimed many times before.\n\nBiden had set up a non-binding goal that EVs make up half of new cars sold by 2030. Trump issued an executive order on his first day in office revoking that goal.\n\nBiden’s policies tightened restrictions on pollution from gas-powered cars and trucks in an effort to encourage Americans to buy EVs and car companies to shift from gas-powered vehicles to electric cars.\n\nA closer look at Army recruitment numbers\n\nTRUMP: “I am pleased to report that in January, the U.S. Army had its single best recruiting month in 15 years.”\n\nTHE FACTS: Trump has repeatedly claimed that the Army’s recruiting turnaround is tied to his time in office.\n\nIn fact, according to Army data, recruiting numbers have been increasing steadily over the past year, with the highest total coming in August 2024 — before the November election. Army officials closely track recruiting numbers.\n\nA significant driver of the recruiting success was the Army’s decision to launch the Future Soldier Prep Course at Fort Jackson, South Carolina, in August 2022. That program gives lower-performing recruits up to 90 days of academic or fitness instruction to help them meet military standards and move on to basic training.\n\nAssociated Press writers Melissa Goldin in New York, Matthew Daly, Chris Rugaber, Will Weissert, Josh Boak and Rebecca Santana in Washington, Becky Bohrer in Juneau, Alaska, and Elliot Spagat in San Diego, contributed to this report.\n\nFind AP Fact Checks here: https://apnews.com/APFactCheck","summary":"President Trump's speech included false and misleading information.","url":"https://www.oregonlive.com/nation/2025/03/trump-made-a-lot-of-claims-in-his-address-to-congress-here-are-the-facts.html","image":"https://www.oregonlive.com/resizer/v2/CFCYUINROVATVFI4QY5Z36GI5I.jpg?auth=94dcc483538a081a18df0e8398c062a39cd3e702be82d894189afe122bcc9f71&width=1280&quality=90","video":null,"publish_date":"2025-03-06 00:06:28","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.466},{"id":297138906,"title":"Trump issues a serious last ultimatum to Hamas to free all hostages or face severe consequences.","text":"President Donald Trump has put out another dire threat to Hamas, after the White House confirmed direct talks with the group as part an of an effort to finally secure the release of American hostages and bodies of the deceased. \n\n‘Shalom Hamas’ means Hello and Goodbye – You can choose. Release all of the Hostages now, not later, and immediately return all of the dead bodies of the people you murdered, or it is OVER for you,’ Trump wrote on his Truth Social site.\n\n‘Only sick and twisted people keep bodies, and you are sick and twisted! I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don’t do as I say. I have just met with your former Hostages whose lives you have destroyed. This is your last warning!’\n\n‘For the leadership, now is the time to leave Gaza, while you still have a chance. Also, to the People of Gaza: A beautiful Future awaits, but not if you hold Hostages. If you do, you are DEAD! Make a SMART decision. RELEASE THE HOSTAGES NOW, OR THERE WILL BE HELL TO PAY LATER!’\n\nTrump issued similar warnings last month, saying there would be ‘all hell’ to pay if the group, which the U.S. government classified as a terrorist organization, did not send home hostages. \n\nTrump’s angry threat came hours after a report that the administration was conducting secret talks with Hamas in an effort to release American hostages seized during the bloody October 7 terror attack on Israel. \n\nThe White House said U.S. hostage affairs envoy Adam Boehler had the authority to talk directly with Hamas, despite longstanding policy against negotiating with designated terrorist organizations. \n\nThe two sides met in Doha, where prior cease fire and hostage talks had occurred, gut not directly between the parties. U.S. and Israeli negotiators had negotiated instead through third party Arab leaders. \n\nWhite House Press Secretary Karoline Leavitt confirmed those talks when asked about them.\n\n‘First of all, the special envoy who engaged in this negotiation does have the authority to talk to anyone. Israel was consulted on this matter. And look – dialog and talking to people around the world to do what’s in the best interest of the American people, is something that the American people,’ she said. \n\nShe wouldn’t answer directly when asked if the talks also related to Trump’s stated plan to rebuild and take over Gaza in a plan critics have called Gaza-lago.\n\n‘These are ongoing talks and discussions. I’m not going to detail them here, that are American lines at stake.’\n\nOn February 11, Trump warned ‘all hell is going to break loose’ if the group did not release all remaining hostages that week. \n\nA few days later, Hamas released American-Israeli Sagui Dekel-Chen, 36 and two other hostages. \n\nEdan Alexander of Tenafly, New Jersey, is thought to be the last living American hostage, in an ordeal that has extended beyond 500 days. He appeared in a Hamas propaganda video in November 2024. Israel says four other American hostages died in captivity.\n\n Israel says 24 living hostages remain, along with the bodies of 35 others. \n\nThe threats come days after Secretary of State Marco Rubio invoked ’emergency authority’ to send an additional $4 billion in security assistance to Israel.\n\nTrump also met with hostages released from captivity on Wednesday.\n\n‘Today, President Trump took time to meet with eight of the released hostages from Gaza. The President listened intently to their heartbreaking stories. The hostages thanked President Trump for his steadfast efforts to bring all of the hostages home,’ said Press Secretary Karoline Leavitt.\n\nThey were Iair Horn, Omer Shem Tov, Eli Sharabi, Keith Siegel, Aviva Siegel, Naama Levy, Doron Steinbrecher, and Noa Argamani.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump has put out another dire threat to Hamas, after&#8230;\n\n\nThis Post: Trump issues a serious last ultimatum to Hamas to free all hostages or face severe consequences. first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-issues-a-serious-last-ultimatum-to-hamas-to-free-all-hostages-or-face-severe-consequences/","image":"https://i.dailymail.co.uk/1s/2025/03/05/22/95851199-0-image-m-5_1741213343421.jpg","video":null,"publish_date":"2025-03-06 00:05:50","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.374},{"id":297143938,"title":"Alleged Abbey Gate plotter extradited to US to face 'justice for our 13,' FBI Director Kash Patel says","text":"The terrorist accused of plotting the 2021 Abbey Gate bombing that killed 13 U.S. military members and 160 civilians amid the chaotic withdrawal from Afghanistan landed on American soil Wednesday. ISIS-K member Mohammad Sharifullah was extradited Tuesday night to \"face American justice,\" FBI Director Kash Patel said. \"3 and 1/2 years later, justice for our 13,\" Patel wrote on X. He is charged with providing and conspiring to provide material support and resources to a designated foreign terrorist organization resulting in death and was expected to make his first federal court appearance in Virginia Wednesday. TRUMP PUSHES TO RECOVER ‘BILLIONS OF DOLLARS’ OF MILITARY EQUIPMENT LEFT BEHIND IN AFGHANISTAN WITHDRAWAL President Donald Trump announced Sharifullah’s capture and extradition on Tuesday night during his address to a joint session of Congress. \"Three and a half years ago, ISIS terrorists killed 13 American service members and countless others in the Abbey Gate bombing,\" Trump told lawmakers and a TV audience of millions. \"Tonight, I am pleased to announce that we have just apprehended the top terrorist responsible for that atrocity, and he is right now on his way here to face the swift sword of American justice.\" Sharifullah confessed to scouting the attack route and training gunmen involved in a terrorist attack near Moscow last year, according to a Justice Department affidavit. Abbey Gate was the main entry point as American and coalition forces were conducting an evacuation operation at Kabul’s Hamid Karzai International Airport. TRUMP REVEALS TOP TERRORIST BEHIND ABBEY GATE ATTACK APPREHENDED On Aug. 26, 2021, Abdul Rahman al-Logari — a member of the Islamic State of Iraq and ash-Sham-Khorasan Province (ISIS-K) — \"detonated a body-worn suicide bomb at Abbey Gate, killing 13 U.S. military service members and approximately 160 civilians,\" the Justice Department said. The U.S. withdrawal was completed a few days later, and the Taliban later claimed control of Afghanistan. FBI Special Agents interviewed Sharifullah this week, during which he revealed that he was in prison in Afghanistan from 2019 until approximately two weeks before the Abbey Gate attack, the Justice Department said. \"Upon Sharifullah’s release, an ISIS-K member contacted Sharifullah to arrange for his assistance in an upcoming attack,\" the affidavit cited Sharifullah as saying in an interview. CLICK HERE TO GET THE FOX NEWS APP \"ISIS-K members provided Sharifullah with a motorcycle, funds for a cell phone and a SIM card, and instructions to open an account on a particular social media platform to communicate with them during the attack operation. After making these preparations for the attack, Sharifullah was tasked with scouting a route near Hamid Karzai International Airport for an attacker,\" the affidavit said. \"Sharifullah conducted surveillance on a route, specifically checking for law enforcement and American or Taliban checkpoints.\" Fox News Digital's Greg Norman contributed to this report.","summary":"The mastermind behind the Abbey Gate bombing that killed scores of people, including 13 U.S. service members, has been brought back to the U.S.","url":"https://www.foxnews.com/us/alleged-abbey-gate-plotter-extradited-us-face-justice-our-13-fbi-director-kash-patel-says","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/abbeygate-copy.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:04:48","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","source_country":"US","sentiment":-0.268},{"id":297141474,"title":"Young father killed by illegal immigrant highlights 'betrayal' of sanctuary cities, says Republican","text":"Louisiana Rep. Clay Higgins, a Republican, said during a House Oversight Committee hearing on sanctuary cities that President Donald Trump has \"ripped the curtains from the rods,\" revealing the impact of the Biden administration’s illegal immigration policy and sanctuary policies across America. Testifying during the hearing were New York City Mayor Eric Adams, Boston Mayor Michelle Wu, Chicago Mayor Brandon Johnson and Denver Mayor Mike Johnston, all of whom are Democrats and oversee cities with sanctuary city policies. Higgins said that \"Americans are fed up with this betrayal of oath\" and that mayors will be \"held accountable\" for upholding sanctuary policies that ban or limit law enforcement from cooperating with ICE to deport dangerous criminal illegal immigrants. Higgins pointed to the case of Welsey Hayes, a young Louisiana husband and father, who he said was killed by an illegal immigrant in Texas, leaving behind his wife, Olivia Hayes, and daughter, Anne Marie. BOSTON'S MAYOR WU OFFERS CONDOLENCES TO FAMILY OF SUSPECT SHOT AFTER ALLEGEDLY TRYING TO STAB PEOPLE \"The policies of these mayors and our previous president have consequences, real-life consequences,\" said Higgins. \"I have a family here today, Mr. Chairman, who lost their beautiful loved one.\" CLICK HERE FOR MORE IMMIGRATION COVERAGE \"This young man was killed by an illegal immigrant in Texas that never should have been in our country,\" he continued. \"He'll never be here to raise his daughter, Anne Marie, and to love and cherish and honor and uphold his beautiful wife, Olivia.\" Raising his voice, Higgins took aim at the mayors, saying: \"You mayors, you have a responsibility not just to your communities and citizens you're sworn to serve but by extension to the entire republic.\" CHICAGO ALDERMAN SAYS MAYOR BRANDON JOHNSON CAN'T DEFEND SANCTUARY CITY POLICIES \"All you want to talk to the children, separation of children,\" he said. \"If you commit a felony in America, you get arrested and prosecuted and convicted and incarcerated. You can expect to be separated from your children. But let me say there's a sunset to that separation, because when you do your time, you'll be released. You can return to your family. This young man will never return to his family, and he should have never been removed from his family if we had a president and heads of our municipalities that were willing to uphold the federal law that exists.\" CLICK HERE TO GET THE FOX NEWS APP \"Three months ago we were at the tail end of four years of millions and millions of illegals coming into our country, [it] was out of control. The only thing that has happened since then is we had an election in November, and now we're not pulling the curtain back, we have ripped the curtain from the rods. We have revealed to America just how fast we could have secured our border if you had an executive that was willing to enforce the law,\" he said. \"America is moving into a new era of enforcement of our own laws. Welcome to it.\"","summary":"Louisiana Rep. Clay Higgins said that President Donald Trump has “ripped the curtains from the rods,&quot; revealing the impact of sanctuary policies across America.","url":"https://www.foxnews.com/politics/young-father-killed-illegal-immigrant-highlights-betrayal-sanctuary-cities-says-republican","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/higgins-hayes.png?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:04:41","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.258},{"id":297141472,"title":"Trump issues 'last warning' to Hamas terrorists, demands release of hostages: 'HELL TO PAY'","text":"President Donald Trump issued a stern warning to Hamas in a Truth Social post Wednesday, calling for the terrorist group to release all hostages immediately. The post came after Trump met with seven former Hamas hostages who traveled to Washington, D.C., this week. The group included Eli Sharabi, Doron Steinbrecher, Keith Siegel, Aviva Siegel, Naama Levy, Omer Shem Tov and Iair Horn, according to the Hostages and Missing Families Forum. \"‘Shalom Hamas’ means Hello and Goodbye - You can choose,\" the president's post began. \"Release all of the Hostages now, not later, and immediately return all of the dead bodies of the people you murdered, or it is OVER for you. \"Only sick and twisted people keep bodies, and you are sick and twisted!\" KAROLINE LEAVITT EXPLAINS US EFFORTS TO NEGOTIATE WITH HAMAS TO FREE AMERICAN HOSTAGES Trump added that he is \"sending Israel everything it needs to finish the job,\" and that \"not a single Hamas member will be safe if you don’t do as I say. \"I have just met with your former Hostages whose lives you have destroyed,\" Trump added. \"This is your last warning! For the leadership, now is the time to leave Gaza, while you still have a chance.\" \"Also, to the People of Gaza: A beautiful Future awaits, but not if you hold Hostages. If you do, you are DEAD! Make a SMART decision. RELEASE THE HOSTAGES NOW, OR THERE WILL BE HELL TO PAY LATER!\" Trump's post came hours after the White House was challenged by Fox News senior White House correspondent Peter Doocy on its decision to negotiate with the Palestinian terrorist group. ISRAEL AGREES TO TRUMP ENVOY'S TEMPORARY GAZA CEASEFIRE EXTENSION PROPOSAL AS FIRST PHASE EXPIRES: REPORTS \"If the U.S. has a long-standing policy that we do not negotiate with terrorists, then why is the U.S. now negotiating directly and for the first time ever with Hamas?\" Doocy asked. \"Well, when it comes to the negotiations that you're referring to, first of all, the special envoy who's engaged in these negotiations does have the authority to talk to anyone,\" White House press secretary Karoline Leavitt responded. Leavitt added that Israel was \"consulted on this matter,\" and that Trump believes in putting forth \"good-faith effort[s] to do what's right for the American people.\" CLICK HERE TO GET THE FOX NEWS APP \"These are ongoing talks and discussions. I'm not going to detail them here,\" she continued. \"There are American lives at stake.\" Fox News Digital's Landon Mion contributed to this report.","summary":"President Donald Trump delivered a firm warning to Hamas in a Truth Social post Wednesday, urging the terrorist group to release all hostages without delay.","url":"https://www.foxnews.com/politics/trump-issues-last-warning-hamas-terrorists-demands-release-hostages-hell-pay","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/trump-321.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:04:35","author":"Andrea Margolis","authors":["Andrea Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.144},{"id":297143618,"title":"These private companies seem eager to aid Trump's immigration crackdown","text":"Private companies hope to make a fortune off the Trump administration’s mass deportation plans. Last Thursday, a day after the Trump administration announced plans for a massive new immigrant detention center in New Jersey, executives from private prison company GEO Group — which has ties to Attorney General Pam Bondi — were apparently giddy over the prospects of Trump’s plans. According to the Ohio Capital Journal: In addition to GEO Group, several other private companies are vying for government contracts to aid President Donald Trump’s anti-immigrant crackdown, Politico reported last week. The outlet reported that \"a group of prominent military contractors, including former Blackwater CEO Erik Prince, has pitched the Trump White House on a proposal to carry out mass deportations through a network of 'processing camps' on military bases, a private fleet of 100 planes, and a 'small army' of private citizens empowered to make arrests,\" according to a copy of the proposal obtained by Politico. The pitch carried \"an estimated price tag of $25 billion,\" the outlet reported. Prince told NewsNation last week that there's “no indication so far” that the White House will pursue his group's proposal. “Eventually, if they’re going to hit those kinds of numbers and scale, they’re going to need additional private sector,\" he said. And as Mother Jones reported in early February, in an article titled “The Gleeful Profiteers of Trump’s Police State,” Palantir Technologies CEO Alex Karp, whose company specializes in data analysis software, sounded chipper about Palantir’s plans to help the Trump administration carry out mass deportations. As a 2020 report from The Guardian indicates, Palantir's software has already aided Trump officials in targeting immigrant families for deportation, according to a government document obtained through a Freedom of Information Act request. There's a lot of money to be made in Trump's cruel immigration crackdown — and it seems these private companies are hoping to wet their beaks.","summary":"The Trump administration's mass deportation plan is expensive — and several companies are trying to get in on the action.","url":"https://www.msnbc.com/the-reidout/reidout-blog/trump-mass-deportations-private-companies-rcna194949","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-03/250305-Erik-Prince-ch-1335-cd1c8b.jpg","video":null,"publish_date":"2025-03-06 00:04:34","author":"Ja'han Jones","authors":["Ja'han Jones"],"language":"en","category":"politics","source_country":"US","sentiment":-0.306},{"id":297138900,"title":"Melania looks beautiful in gray while accompanying Trump at his important political event.","text":"Melania Trump stunned the crowd on Capitol Hill Tuesday night when she entered the House chamber to a standing ovation.\n\nThe first lady was wearing a dark gray Dior skirt suit with a belted jacket. She wore a scarf and her signature stiletto heels. \n\nShe left the White House with President Donald Trump and rode with him in the Beast for the short trip to Capitol Hill. The couple exited the White House holding hands and Trump clung to her, leaving the first lady pulling herself free so she could get in on the other side of the presidential limo. \n\nShe was joined by her stepchildren: Ivanka Trump with husband Jared Kushner, Don Jr. with girlfriend Bettina Anderson, Eric and Lara Trump, and Tiffany Trump and husband Michael Boulos.\n\nHer father Viktor Knavs is also at the speech. Usha Vance, the second lady, sat in the first lady’s box. Next to Melania was fifteen-year-old Elliston Berry, who was a victim of deep fake porn.\n\nThe first couple’s son Barron, 18, is a freshman at New York University and has class this week so did not attend the speech.\n\nMelania Trump has been in a power suit mode of late. \n\nWhen she was on Capitol Hill Monday for an event tied to her Be Best initiative, she wore a three-piece brown Ralph Lauren pants suit with a crisp white shirt and dark tie.\n\nIn her official portrait as first lady, she wore a black pants suit by Dolce & Gabbana. And, at formal dinner at the White House last weekend for the nation’s governors, she wore a Dolce & Gabbana tuxedo black blazer with satin lapels and tapered black pants.\n\nThese past two weeks marked a return to the public eye for the first lady, who spent most of the first month of her second tenure in New York with Barron.\n\nShe’s been focused on wrapping up filming for her documentary that will air on Amazon this fall. And she’s been working on her private business initiatives, including her own crypto-currency.\n\nBut on Monday she was in the Capitol to relaunch her Be Best campaign. She joined lawmakers in speaking out against revenge porn and deep fakes generated by AI.\n\nIn her speech, she slammed Democrats for their lack of support on the issue.\n\n‘I expected to see more Democrat leaders with us here today to address this serious issue. Surely as adults, we can prioritize America’s children ahead of partisan politics,’ she said. \n\nDemocratic Rep. Ro Khanna of California was the only Democratic lawmaker at the event, which took place in the U.S. Capitol building. Republican Senator Ted Cruz hosted the event, in which lawmakers expressed support for his Take It Down Act.\n\nMeanwhile, the guests in her box range from families of victims of illegal immigrant crime to a former hostage in Russia and other ‘everyday Americans’ plagued by plights President Trump has vowed to fix over the next four years in Washington.\n\nNotably, the family of Corey Comperatore will sit in the first lady’s guest box at the Capitol. Helen Comperatore and her two daughters Allyson and Kaylee are the widow and children of the firefighter who died after he was shot by would-be assassin Thomas Matthew Crooks at Trump’s Butler, Pennsylvania rally in July.\n\nFifteen-year-old Elliston Berry from Aledo, Texas was the victim of deepfake bullying. Her attendance as a guest of Melania Trump’s is meant to bring awareness to the rise of these attacks using AI image generations.\n\nLaken Riley’s mother Allyson and sister Lauren are also special guests of Melania for the president’s remarks.\n\nRiley was a 22-year-old nursing student in Georgia who was murdered by an illegal immigrant during a morning run. The murderer was apprehended for illegally crossing the border but was released into the country under former President Joe Biden’s lax migrant policies.\n\nUnderscoring the importance of addressing the border crisis, the first lady is also bringing as a guest Houston, Texas native Alexis Nungaray, the mother of 12-year-old Jocelyn, who was murdered by two illegal immigrants during a walk to the store in her hometown.\n\nThese two individuals were also apprehended and released into the U.S. by Biden’s administration just weeks before they murdered Jocelyn.\n\nAdditionally, Roberto Ortiz from Weslaco, Texas is joining the box after he was shot multiple times by cartel members while performing his Border Patrol duties near the Rio Grande River.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMelania Trump stunned the crowd on Capitol Hill Tuesday night when she&#8230;\n\n\nThis Post: Melania looks beautiful in gray while accompanying Trump at his important political event. first appeared on Internewscast Journal","url":"https://internewscast.com/politics/melania-looks-beautiful-in-gray-while-accompanying-trump-at-his-important-political-event/","image":"https://i.dailymail.co.uk/1s/2025/03/05/02/95849535-0-image-m-14_1741140647500.jpg","video":null,"publish_date":"2025-03-06 00:03:48","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":297138508,"title":"Business Leaders Hit Capitol Hill to Defend Clean-Energy Tax Credits","text":"In his address to Congress Tuesday, President Donald Trump said he has done away with former President Joe Biden's policies to fight climate change.\"I terminated the ridiculous 'green new scam,'\" Trump said, using his term for Biden's mix of pollution-reducing regulations and federal loans and tax incentives to support clean energy. \"We ended all of Biden's environmental restrictions that were making our country far less safe and totally unaffordable.\"But like many of Trump's statements Tuesday, this was only partly true.Trump has pulled the U.S. out of international climate agreements, limited clean-energy development on public land and set in motion a radical reduction in staff at environmental agencies in a sharp turn away from climate action. The clean-energy tax credits expanded under Biden-era laws like the Inflation Reduction Act and Bipartisan Infrastructure Law, however, remain in place.Undoing those tax incentives will require action by Congress, where furious lobbying is underway to determine just how much of those policies will remain.Some voices rising to defend clean-energy tax credits do not come from environmental groups but rather from the C-suites of some major corporations.Eighty companies, including some household names such as Bayer, Ford and Ikea, joined a lawmaker outreach campaign on Capitol Hill this week to make the business argument for keeping clean-energy tax credits in place.\"When businesses use clean-energy incentives, they boost the economy through manufacturing and job creation,\" Mardi Ditze, country sustainability manager at Ikea U.S., said in a statement. \"We look forward to bringing this message to Capitol Hill.\"According to the climate action group Ceres, which works with companies and investors on sustainable business practices, the expanded tax incentives have triggered more than $420 billion in private sector investment, creating more than 400,000 jobs.As congressional Republicans sharpen their budget knives to meet their goals for deep cuts to government spending, party leaders have indicated that environmental programs and tax breaks will be a target.Business leaders on a Tuesday press call organized by Ceres said it is Republican\ncongressional districts and Trump-voting red states that would have the most to lose if the tax credits are eliminated.\"Most folks don't understand that a large portion, maybe even a majority, of the benefits created by the tax credits are in Republican districts and creating Republican jobs and growth,\" said Hugh Welsh, president and general counsel of DSM-Firmenich North America.The Dutch/Swiss multinational corporation supplies health and nutrition ingredients and materials, and Welsh said tax credits enabled the company to invest in wind and solar projects in deep red Oklahoma and Texas.Mandi McKay, head of sustainability and social impact for beer maker Sierra Nevada Brewing Company, said the $20 billion the company has invested in its operations in North Carolina required long-range planning, and dramatic changes to tax policy undermine the ability to make farsighted investment decisions.\"Oftentimes it takes multiple years to plan those things, so we need that certainty,\" McKay said.McKay said the clean-energy tax credits will be pivotal for the company's plan to double the solar capacity at its North Carolina brewery. \"We will likely not be able to do that without these tax credits, because they're that critical,\" she said.Kara Fulcher, director of sustainability at Michelin North America, said tax supports for clean-energy investment are part of a long tradition of policies designed to promote American innovation and global competitiveness. Without them, she said, the country risks losing out.\"There is a global competition for where this work will happen,\" Fulcher said. \"If we want to see innovation scale up in this market, we need certainty, we need time for those thoughtful investments.\"Welsh said the tax credits are a powerful incentive he uses to persuade his board to put money into U.S. projects, and losing those credits \"would certainly cause us to rethink our investment strategy here.\"Clean-energy tax credits have historically enjoyed bipartisan support, and last year a group of 18 Republican House members sent a letter to their party leadership making the argument for keeping those credits in place even as they target other parts of the Biden climate policies.Welsh said he has heard Republicans voicing support as he does his outreach on the Hill.\"These tax credits are pro-growth, pro-business, pro sustainable and durable power,\" Welsh said, building an argument that clean energy fits with a Republican agenda. \"Why wouldn't they continue to support this?\"","summary":"As congressional Republicans plan deep budget cuts, some of the loudest voices in defense of tax credits for clean energy are from business leaders.","url":"https://www.newsweek.com/clean-energy-tax-credits-budget-cuts-business-reactions-2040297","image":"https://d.newsweek.com/en/full/2601266/solar-panels-farm-wisconsin.jpg","video":null,"publish_date":"2025-03-06 00:03:41","author":"Jeff Young","authors":["Jeff Young"],"language":"en","source_country":"us","sentiment":-0.124},{"id":297144224,"title":"Why Altcoins Were Soaring on Wednesday","text":"That loud and clear, collective sigh of relief you heard Wednesday was the sound of thousands of cryptocurrency investors, who were happy their assets generally moved in the right direction. Since Monday, the top names in the asset class had been sluggish at best; on Hump Day, many seemed to wake up.\n\nMore than a few altcoins that day were not only trading higher, but posting double-digit gains. Bitcoin Cash (BCH 20.06%) was something of an outlier in a good way, with a more than 23% rise. Utility coins Chainlink (LINK 11.20%) and Aptos (APT 14.15%) were up a respective 12% and nearly 15%. Lagging behind but still well in positive territory was Cardano (ADA 1.83%), with an 4% rise.\n\nTrading on an exemption, and a meeting\n\nMuch of this had to do with the latest developments in the fast-moving U.S. trade spat with Canada, Mexico, and China.\n\nOn Wednesday, President Donald Trump elected to grant a one-month exemption to the freshly introduced tariffs on imports from those countries, specifically to automobile manufacturers. These will affect Canada and Mexico, as their auto industries are closely intertwined with ours. \n\nThe exemptions have raised hopes that the potential economic fallout from the dispute will be more muted than some assumed. A calmer global market and economy is beneficial for cryptocurrencies, as they are relatively risky assets -- market players tend to pull away from such investments in times of stress or conflict.\n\nOn top of that, anticipation is building for Friday's White House Crypto Summit -- the first of its kind in the (admittedly brief) history of cryptocurrencies. Rumors that the Trump administration would formally launch a U.S. crypto reserve -- an initiative talked about rather vaguely so far -- gathered strength, injecting another measure of optimism into the crypto market in midweek trading. \n\nIt's important to note that any potential crypto reserve remains largely speculation at this point. While the concept has been floated and discussed, so far we have gotten very few details about the composition of such an instrument, or how it would work.\n\nHope springs (somewhat) eternal\n\nSo what we had on Wednesday was largely a rally on hope, rather than concrete developments. Yet hope was needed by a largely downbeat market, and in the absence of major hard, positive news, many opted to trade on optimism.\n\nThis alone likely won't sustain much of a rally. Instead, that'll depend on how these latest moves develop. A sustained trade war will likely be damaging to many asset classes, especially cryptocurrencies; contrarily, a fast end to the dispute should juice their prices. And if a crypto reserve is indeed inaugurated, investors might pull back if they deem the launch hasty and not well thought out.","url":"https://www.fool.com/investing/2025/03/05/why-altcoins-were-soaring-on-wednesday/?source=askdougpancakes&utm_source=chromefollow&utm_medium=feed&utm_campaign=news&referring_guid=c80b3ffd-754a-4a10-ad05-9ed1efd39243","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F810145%2Ftwo-people-shake-hands-while-a-third-looks-on-happily-in-front-of-a-lapto-pc.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-03-06 00:03:21","author":"Eric Volkman","authors":["Eric Volkman"],"language":"en","source_country":"us","sentiment":0.028},{"id":297140838,"title":"Appeals court allows Trump administration to remove ethics watchdog Dellinger — for now","text":"A federal appeals court on Wednesday allowed the Trump administration to remove a top federal ethics watchdog from his office while a lawsuit challenging his termination plays out.\n\nThe order permitting the removal of Hampton Dellinger as head of the Office of Special Counsel came four days after a federal district court judge ruled that President Donald Trump's attempt to boot Dellinger was \"unlawful.\"\n\nHowever, the order by a unanimous three-judge panel on the U.S. Court of Appeals for the District of Columbia Circuit left open the question of whether Dellinger will be able to return to his position pending the outcome of the Trump administration's appeal in the case.\n\nThe panel, which said it would issue an opinion explaining its order \"in due course,\" also expedited the case, setting a briefing schedule that will end April 11.\n\n\"The Clerk is directed to calendar this case for oral argument this term on the first appropriate date following the completion of briefing,\" the panel wrote.\n\nSince being filed by Dellinger, the case has already landed in the lap of the Supreme Court once, albeit briefly. And the high court is likely to have the final say on whether Trump has the power to dismiss the special counsel.\n\nDellinger, who had a five-year term, was appointed as special counsel in March 2024 by then-President Joe Biden, and later confirmed by the Senate.\n\nTrump fired Dellinger by email last month as part of a wide-ranging effort to reduce the number of federal workers.\n\nDellinger's office is responsible for protecting federal employees who act as whistleblowers about illegal or unethical conduct.\n\nDellinger sued the Trump administration in U.S. District Court in Washington, D.C., over his termination.\n\nHe argued his dismissal was illegal because of a federal law that says special counsels can only be removed by the president \"for inefficiency, neglect of duty, or malfeasance of office.\"\n\nDistrict Court Judge Amy Berman Jackson on Feb. 10 issued an order barring Dellinger's removal as the case continued. \n\nThe Trump administration then appealed to the Court of Appeals, which in a 2-1 ruling declined to overturn Berman's order.\n\nThe Department of Justice then asked the Supreme Court to rule that Trump had the power to fire Dellinger. But the Supreme Court declined to do so, for now, letting the case wind its way through lower federal courts.\n\nBerman then ruled on Saturday that Trump's firing was unlawful.\n\n\"The Special Counsel's job is to look into and expose unethical or unlawful practices directed at federal civil servants, and to help ensure that whistleblowers who disclose fraud, waste, and abuse on the part of government agencies can do so without suffering reprisals,\" Jackson wrote in her ruling.\n\n\"It would be ironic, to say the least, and inimical to the ends furthered by the statute if the Special Counsel himself could be chilled in his work by fear of arbitrary or partisan removal,\" Jackson wrote.\n\nThe DOJ immediately asked the Court of Appeals in an emergency motion to stay Jackson's ruling pending the outcome of its appeal of that decision.\n\nIn its order Wednesday, the three judges on the appeals court panel said the Trump administration had \"satisfied the stringent requirements for a stay pending appeal.\"\n\n\"This order gives effect to the removal of appellee [Dellinger] from his position as Special Counsel of the U.S. Office of Special Counsel,\" the order noted.\n\nIn the weeks since Trump first tried to fire Dellinger, the special counsel had opposed the president's efforts to fire probationary employees across several federal agencies.","summary":"The Supreme Court is likely to determine whether President Donald Trump can fire Hampton Dellinger as head of the Office of Special Counsel.","url":"https://www.cnbc.com/2025/03/05/appeals-court-allows-trump-administration-to-remove-federal-ethics-watchdog.html","image":"https://image.cnbcfm.com/api/v1/image/108111685-1741216941794-108111685-17412167162025-02-26t205740z_72340328_rc2qtcaijmm2_rtrmadp_0_usa-trump-lawsuit-firing.jpeg?v=1741217016","video":null,"publish_date":"2025-03-06 00:02:02","author":"Dan Mangan","authors":["Dan Mangan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.407},{"id":297142890,"title":"Letters to the Editor: Tralee's Mary O’Connell was a wonderful, courageous woman","text":"There isn’t likely to be a huge amount of work to be done.\n\nThe 250th anniversary of Daniel O’Connell’s birthday is coming up in August, a time for great celebrations of his wonderful life, legacy, and his enormous contribution to Ireland’s progress towards independence. He is buried in a recently restored mausoleum in Glasnevin Cemetery.\n\nAs I researched Mary’s relatively short life — she died in 1836 aged 58 — the portrait of a truly wonderful, courageous woman emerges.\n\nCommencing with a difficult start in life; then a secret romance with Daniel (which had to be so, given his uncle’s demand that he marry a woman with a dowry, which Mary didn’t have); their subsequent marriage in secret; the arrival of the first of some 11 children; Daniel’s subsequent disinheritance when his uncle found out about the marriage; their early life together; stays in Dublin, England, and France; her later increasing time alone in Derrynane House — which Daniel’s uncle left him after all, after Daniel’s election to Westminster and growing political involvement and pressures in an increasingly volatile Ireland — where she ran the house, raised her large family, and became Daniel’s agent; faced some difficult financial problems and court cases, etc, and she stood by her husband through it all.\n\nA thoroughly wonderful modern woman whose memory needs to be cherished and respected.\n\n Paul Ryan, Tallow, Co Waterford\n\nIreland mustn’t join the ‘willing’ to war\n\nIn his column, Fergus Finlay tells us that “the world has changed irrevocably”. Europe is not “the world”. Even Europe, the US, and Russia together are not “the world”.\n\nBut the rest of the world might well be concerned about our behaviour in this part of the world right now, given our belligerent history.\n\nIt looks very much like we are preparing for “world war three”.\n\nAs there is a significant risk that this could turn out to be a nuclear war, the rest of the world should be worried. People in many other parts of the world are trying to cope with significant climate change as it is. Militarism and war are highly toxic to the natural environment, and they do not respect boundaries and borders.\n\nMr Finlay justifiably criticises US president Donald Trump because Mr Trump believes that “real power is fear” — that “you have to scare people”. But that is surely the modern definition of “defence”.\n\nArm yourself to the teeth with piles of massively destructive (and massively expensive) weapons, and point them at your neighbour.\n\nMr Finlay is rightly upset about the war in Ukraine. It is surprising then that, in his condemnation of strong-man aggression, he never once mentions Gaza.\n\nAt the end of his article, Mr Finlay expresses some regret that Ireland was not represented at “the security conference of the real leaders of democracy” in London last Sunday. In an interview on BBC, following that conference, I heard British prime minister Keir Starmer call the conference “a coalition of the willing”.\n\nThat is exactly what the parties involved called themselves when they invaded and destroyed Iraq in 2003, going against the advice of the Security Council of the United Nations. As we all know, that illegal invasion was based on a whole web of lies about weapons of mass destruction — and so many unfortunate innocent Iraqi people died.\n\nInnocent people died in London and Madrid too because of that illegal war.\n\nMr Finlay describes Mr Trump and US vice president JD Vance as “two school-yard bullies”.\n\nThey certainly did (and do) behave like school-yard bullies.\n\nI have been working in child welfare and education for more than 30 years. Never have I heard a responsible parent, guardian, or teacher tell children to “take sides” in a bullying situation and to “join the fight”. That is not the approach any of us would take. It should be no different for adults or in international relations. What we teach children in the school yard, we should model in our “grown-up” lives.\n\nNever, in my work with children and families, have I ever met parents who would want their children to be sent off to war to kill and, maybe, be killed. Never, in all my years of work with children and young people, have I met a child or young person I would send to war.\n\nThe real courage and the real strength will be for Ireland to maintain its neutrality — and the triple lock — and to be at the ready, not with vanity but with humility and compassion, to assist warring parties to come to resolution and to come to peace.\n\n Marian Naughton, Naas, Co Kildare\n\nTravellers' accommodation\n\nThe very first act the Government passed was to increase the number of ministers of state by a further three to 23. This, along with the retention of a travel allowance that a TD previously would have lost on elevation to a junior ministry. All this was justified by reference to a supposed increased volume of government priorities.\n\nSince 2007, the expansion in ministerial duties has stemmed from the growing complexity of policy issues, the challenges of steering vast government initiatives, and the heightened involvement with stakeholders at all levels — both nationally and internationally.\n\nOne month later, none of the 23 juniors given the brief for Traveller accommodation;\n\nIs there a game of pass the parcel at work here, with nobody willing to take on this important duty?\n\nWill it be retained by the housing minister, James Browne, by default? I doubt it somehow. Referring to Travellers during his last term, Taoiseach Micheál Martin said “basically, the stock approaches are not working”;\n\nNow back as Taoiseach, Mr Martin continues the old “stock approaches” by keeping Travellers and their accommodation needs at the bottom of the government’s priority list. Plus ça change.\n\n Thomas Erbsloh, Coolnahau, Co Kilkenny","summary":"A reader says we should cherish a Kerry woman who has long been in the shadow of her husband — The Liberator, Daniel O'Connell","url":"https://www.irishexaminer.com/opinion/yourview/arid-41587384.html","image":"https://www.irishexaminer.com/cms_media/module_img/9056/4528282_7_seoimage1x1_Mary_20O_27Connell_20.jpg","video":null,"publish_date":"2025-03-06 00:02:00","author":"Irishexaminer.com,John Gubbins. Picture","authors":["Irishexaminer.com","John Gubbins. Picture"],"language":"en","category":"politics","source_country":"ie","sentiment":0.094},{"id":297138138,"title":"As a lifelong Dem, I never thought I’d see my party embarrass itself so much","text":"As a lifelong Democrat, I never imagined I would watch my own party embarrass itself so thoroughly — and so publicly — as it did during Tuesday’s joint session of Congress.\n\nFrom obnoxious booing to childish protest signs to a sitting member of Congress having to be physically removed from the chamber, Democrats turned what should have been a solemn, dignified event into a bad reality show.\n\nAnd for what? \n\nTo go viral on TikTok? \n\nTo book a slot on MSNBC to brag about their “resistance”?\n\nNothing was more disgraceful than when my colleagues refused to stand or clap when 13-year-old DJ Daniel, a brain-cancer survivor, was made an honorary Secret Service agent.\n\nThis boy beat cancer and dreamed of protecting the president. \n\nThat dream came true when President Donald Trump honored him — a beautiful, human moment that should have transcended politics.\n\nDemocrats used to be the party of compassion — the party that stood up for the vulnerable and celebrated stories of triumph over adversity.\n\nNow? We can’t even clap for a kid who beat cancer if the “wrong” president is standing beside him.\n\nWhen Trump said biological men shouldn’t compete in women’s sports, Democrats acted like he’d proposed banning Little League.\n\nBut most Americans — including plenty of Democrats — agree that protecting women’s sports isn’t radical.\n\nIt’s common sense.\n\nThe same thing happened when Trump called for cutting waste, fraud, and abuse in the federal government.\n\nDemocrats stayed silent. \n\nAre we now the party that supports waste, fraud and abuse?\n\nWhen Trump honored families whose loved ones were killed due to reckless sanctuary policies — policies I’ve fought to reform in New York City — Democrats couldn’t even show basic respect.\n\nWhen he honored Stephanie Diller, the widow of murdered NYPD Officer Jonathan Diller, it should have been a moment of unity.\n\nYet many Democrats offered only lukewarm applause, if any at all.\n\nAnd when Trump called for the death penalty for cop killers, the silence was deafening.\n\nSince when did standing up for the families of fallen officers become controversial?\n\nAnother disappointing moment came when President Trump called for peace in Ukraine — a goal that should have brought both sides of the aisle to their feet.\n\nDemocrats were once the party of peace, but you wouldn’t know it from the silence.\n\nHave we really reached a point where even supporting peace is treated as partisan? \n\nIt’s a sad reflection of how far my party has drifted.\n\nThis isn’t principled resistance — it’s emotional immaturity.\n\nIt also reeks of hypocrisy: Democrats rightly condemned Republican Rep. Joe Wilson when he shouted, “You lie!” at President Barack Obama during a State of the Union.\n\nBack then, we said such outbursts were beneath the dignity of Congress.\n\nBut Democrats’ antics on Tuesday — waving signs, heckling and walking out — were just as bad, if not worse.\n\nDemocrat Rep. Al Green even had to be physically removed from the chamber.\n\nWhen we act like this, we embarrass ourselves and alienate the very voters we claim to champion.\n\nSen. John Fetterman (D-Pa.) called it “a sad cavalcade of self-owns and unhinged petulance” that only made Trump look “more presidential and restrained.”\n\nHe warned that Democrats are becoming the political equivalent of a car alarm — constantly blaring, and increasingly ignored.\n\nVoters want leaders who act like adults, who clap for good ideas, no matter who proposes them, and who show bipartisan respect for families who’ve suffered unimaginable loss.\n\nAmericans are exhausted by this nonsense. \n\nThey want leaders who solve problems, not politicians chasing retweets.\n\nThey want representatives who stand up for common sense — not political theater.\n\nUntil we get back to that, we don’t deserve to govern.\n\nI’m not saying we should agree with everything Trump says — far from it. \n\nHowever, there’s a way to disagree with dignity and class.\n\nMy fellow Democrats didn’t just miss that opportunity — they sprinted in the opposite direction.\n\nI’m embarrassed for my party. \n\nBut more importantly, I am worried for my country.\n\nIf Democrats can’t even applaud a kid beating cancer, grieving families, saving tax dollars, securing our borders or a call for peace — what does that say about us?\n\nCouncil Member Robert Holden (D) represents District 30 in Queens.","summary":"As a lifelong Democrat, I never imagined I would watch my own party embarrass itself so thoroughly— and so publicly — as it did during Tuesday’s joint session of Congress.","url":"https://nypost.com/2025/03/05/opinion/as-a-democrat-im-embarrassed-for-my-party-and-worried-for-the-nation/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/EMSLD.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-06 00:01:44","author":"Robert Holden","authors":["Robert Holden"],"language":"en","source_country":"us","sentiment":-0.352},{"id":297146682,"title":"‘Pass-fail’ fiscal rules mean UK economic policy exposed to global changes – IFS","text":"Rachel Reeves’ “pass-fail” fiscal rules leave Britain’s economic policy “entirely exposed” to global changes and could lead to a “costly distraction from the big issues”, economists have suggested.\n\nThe Chancellor is more likely to make cuts in her Spring Statement than to push through until the autumn budget if an updated forecast puts her on track to break her promises, a think tank has said.\n\nThe Treasury has committed to delivering only one major fiscal event a year but the prospect of missing her own targets at the first hurdle could see Ms Reeves intervene earlier, the Institute for Fiscal Studies said.\n\nThe Chancellor has set two self-imposed rules as she seeks to stabilise the public finances – firstly that day-to-day spending must be paid for by revenue, not borrowing, and secondly to have debt falling as a share of national income by 2028/29.\n\nAt the time of the budget in October, the Office for Budget Responsibility (OBR) said she had left herself £9.9 billion of headroom against the first rule.\n\nThe watchdog’s updated forecast next month is likely to see that wiped out because of higher borrowing costs and weak growth in Britain, as well as global factors such as trade tariffs following Donald Trump’s election.\n\nMeanwhile, IFS analysis of data on tax and spend suggests that expenditure is largely in line with October’s outlook, but borrowing for 2024-25 could be £16 billion above it at £143 billion.\n\nThis would also be £56 billion above last spring’s forecast, largely reflecting the £50 billion revision to planned spending this year announced last autumn.\n\nThe IFS said that if Ms Reeves was put on course to breach her fiscal rules, “it seems more likely than not that she will respond by altering tax or spending plans” than wait until the budget to announce policy changes in response.\n\nBreaking the rules “at first time of asking” could be seen as humiliating, dent her credibility in the markets and lead to months of politically damaging speculation about possible tax rises in the autumn, it said.\n\nFollowing her last budget, Ms Reeves told the Treasury Select Committee that “we are not going to be coming back with more tax increases” and later repeated a similar message to business leaders.\n\nIn a report published on Thursday, the think tank said: “While there is no such thing as an optimal fiscal framework, it is hard to believe that the UK’s could not be improved.\n\n“In an uncertain and volatile world, aiming to meet pass–fail fiscal rules with close to zero headroom leaves fiscal policy entirely exposed to global economic developments (or, more accurately, what the OBR judges the impact of those economic developments might be) and puts the Chancellor’s (sensible) promise to make fiscal policy changes only once a year at risk.\n\n“If there is a material change then policy should of course adjust. But the twice-yearly fine-tuning of policy in response to immaterial forecast revisions is an increasingly costly distraction from the big issues.”\n\nMs Reeves is expected to slash public spending by billions of pounds in an effort to balance the books when she delivers the statement on March 26.\n\nThe Treasury is putting its proposals to the watchdog on Wednesday as part of the forecast process, the BBC reported.\n\nA leaked early draft of the forecast indicates the watchdog is cutting its forecast for economic growth and the cost of Government borrowing will have been affected by the turbulence in the bond markets in January.\n\nCurbing the cost of welfare and a drive for greater efficiency across Whitehall are expected to contribute the bulk of the savings.\n\nReports suggest that the Government is seeking to save around £5 billion through changes in work requirements and cuts to the generosity of some payments, which the IFS said “would aid the Chancellor with her fiscal arithmetic”.\n\nThe Resolution Foundation said that restricting eligibility for incapacity or disability benefit would be “risky” as it would “concentrate all the income losses on a small group of claimants”.\n\nReforms should instead seek to close the financial gap between basic and health-related out-of-work support that incentivises health-related claims, the think tank said.\n\nA focus on the three areas that drive higher spending – entrances, entitlements and exits – could stem the increase of the benefits bill, on track to rise by £32 billion over the 2020s, and help more people into work, it argued.\n\nSenior economist at the think tank Louise Murphy said: “While the Government is keen to score short-term welfare savings ahead of the 26th March, truly effective reforms will take time to deliver.”\n\nMeanwhile, the Liberal Democrats called on the Chancellor to use the statement to exempt the health and social care sector from the planned increase in employer national insurance before it comes into force on April 6.\n\nThe Government has committed to covering the cost of the rise for the NHS but not other health and care providers such as care homes and dentists.","summary":"The think tank said updated forecasts are likely to see Rachel Reeves’ headroom disappear because of higher borrowing costs and weak growth.","url":"https://www.standard.co.uk/business/business-news/passfail-fiscal-rules-mean-uk-economic-policy-exposed-to-global-changes-ifs-b1214959.html","image":"https://static.standard.co.uk/2025/03/06/00/31ad1d8ba598a0a3df387a5fd9f4f8a8Y29udGVudHNlYXJjaGFwaSwxNzQxMjg2MzQ2-2.79271783.jpg?width=1200","video":null,"publish_date":"2025-03-06 00:01:39","author":"Nina Lloyd","authors":["Nina Lloyd"],"language":"en","category":"business","source_country":"GB","sentiment":-0.474},{"id":297138480,"title":"‘Pass-fail’ fiscal rules mean UK economic policy exposed to global changes – IFS","text":"Rachel Reeves’ “pass-fail” fiscal rules leave Britain’s economic policy “entirely exposed” to global changes and could lead to a “costly distraction from the big issues”, economists have suggested.\n\nThe Chancellor is more likely to make cuts in her Spring Statement than to push through until the autumn budget if an updated forecast puts her on track to break her promises, a think tank has said.\n\nThe Treasury has committed to delivering only one major fiscal event a year but the prospect of missing her own targets at the first hurdle could see Ms Reeves intervene earlier, the Institute for Fiscal Studies said.\n\nThe Chancellor has set two self-imposed rules as she seeks to stabilise the public finances – firstly that day-to-day spending must be paid for by revenue, not borrowing, and secondly to have debt falling as a share of national income by 2028/29.\n\nAt the time of the budget in October, the Office for Budget Responsibility (OBR) said she had left herself £9.9 billion of headroom against the first rule.\n\nThe watchdog’s updated forecast next month is likely to see that wiped out because of higher borrowing costs and weak growth in Britain, as well as global factors such as trade tariffs following Donald Trump’s election.\n\nMeanwhile, IFS analysis of data on tax and spend suggests that expenditure is largely in line with October’s outlook, but borrowing for 2024-25 could be £16 billion above it at £143 billion.\n\nThis would also be £56 billion above last spring’s forecast, largely reflecting the £50 billion revision to planned spending this year announced last autumn.\n\nThe IFS said that if Ms Reeves was put on course to breach her fiscal rules, “it seems more likely than not that she will respond by altering tax or spending plans” than wait until the budget to announce policy changes in response.\n\nBreaking the rules “at first time of asking” could be seen as humiliating, dent her credibility in the markets and lead to months of politically damaging speculation about possible tax rises in the autumn, it said.\n\nFollowing her last budget, Ms Reeves told the Treasury Select Committee that “we are not going to be coming back with more tax increases” and later repeated a similar message to business leaders.\n\nIn a report published on Thursday, the think tank said: “While there is no such thing as an optimal fiscal framework, it is hard to believe that the UK’s could not be improved.\n\n“In an uncertain and volatile world, aiming to meet pass–fail fiscal rules with close to zero headroom leaves fiscal policy entirely exposed to global economic developments (or, more accurately, what the OBR judges the impact of those economic developments might be) and puts the Chancellor’s (sensible) promise to make fiscal policy changes only once a year at risk.\n\n“If there is a material change then policy should of course adjust. But the twice-yearly fine-tuning of policy in response to immaterial forecast revisions is an increasingly costly distraction from the big issues.”\n\nMs Reeves is expected to slash public spending by billions of pounds in an effort to balance the books when she delivers the statement on March 26.\n\nThe Treasury is putting its proposals to the watchdog on Wednesday as part of the forecast process, the BBC reported.\n\nA leaked early draft of the forecast indicates the watchdog is cutting its forecast for economic growth and the cost of Government borrowing will have been affected by the turbulence in the bond markets in January.\n\nCurbing the cost of welfare and a drive for greater efficiency across Whitehall are expected to contribute the bulk of the savings.\n\nReports suggest that the Government is seeking to save around £5 billion through changes in work requirements and cuts to the generosity of some payments, which the IFS said “would aid the Chancellor with her fiscal arithmetic”.\n\nThe Resolution Foundation said that restricting eligibility for incapacity or disability benefit would be “risky” as it would “concentrate all the income losses on a small group of claimants”.\n\nReforms should instead seek to close the financial gap between basic and health-related out-of-work support that incentivises health-related claims, the think tank said.\n\nA focus on the three areas that drive higher spending – entrances, entitlements and exits – could stem the increase of the benefits bill, on track to rise by £32 billion over the 2020s, and help more people into work, it argued.\n\nSenior economist at the think tank Louise Murphy said: “While the Government is keen to score short-term welfare savings ahead of the 26th March, truly effective reforms will take time to deliver.”\n\nMeanwhile, the Liberal Democrats called on the Chancellor to use the statement to exempt the health and social care sector from the planned increase in employer national insurance before it comes into force on April 6.\n\nThe Government has committed to covering the cost of the rise for the NHS but not other health and care providers such as care homes and dentists.","summary":"Rachel Reeves’ “pass-fail” fiscal rules leave Britain’s economic policy “entirely exposed” to global changes and could lead to a “costly distraction from the big issues”, economists have suggested. The Chancellor is more likely to make cuts in her Spring Statement than to push through until the autumn budget if an updated forecast puts her on [&#8230;]\n\n\nThe post ‘Pass-fail’ fiscal rules mean UK economic policy exposed to global changes – IFS appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/06/pass-fail-fiscal-rules-mean-uk-economic-policy-exposed-to-global-changes-ifs/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.79271783-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-06 00:01:39","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"business","source_country":"gb","sentiment":-0.474},{"id":297146690,"title":"Healey to meet US counterpart as European leaders hold crisis talks on Ukraine","text":"The UK Defence Secretary is expected to discuss the US decision to pause intelligence-sharing with Ukraine with his counterpart in Washington as European leaders hold crisis talks in Brussels on support for Kyiv.\n\nJohn Healey will join Pete Hegseth on Thursday for a bilateral meeting on a possible peace plan while efforts continue to bridge a transatlantic rift over the country’s future security.\n\nMeanwhile, French President Emmanuel Macron said he would confer with allies about the prospect of using France’s nuclear deterrent to protect the continent in the face of threats from Russia at a summit of EU leaders.\n\nMr Healey’s trip was agreed last week after Sir Keir Starmer announced a rise in the UK’s defence spending to 2.5% of GDP, and comes as the US suspended intelligence-sharing with Ukraine.\n\nCIA director John Radcliffe told Fox Business Network on Wednesday there has been a “pause” on “the intelligence front” following Donald Trump’s fractious Oval Office confrontation with Volodymyr Zelensky last week.\n\nThe decision could affect Ukraine’s ability to effectively use long-range western weapons, such as US-made Himars launchers and deprive Kyiv of advance information about potential incoming threats.\n\nAs he arrived in the Capitol later in the day, Mr Healey was asked what he would say to his counterpart about the issue when they meet for talks.\n\n“Those are discussions for tomorrow, but it’s part of a two-day programme and we’re working hard for peace,” he said.\n\nUS national security adviser Mike Waltz said on Wednesday that Ukraine and America were still talking despite the pause.\n\n“I just got off the phone with my counterpart, the Ukrainian national security adviser,” he said.\n\n“We are having good talks on location for the next round of negotiations, on delegations, on substance.”\n\nHe added: “I think we’re going to see movement in very short order.”\n\nThe French government said on Wednesday that Mr Macron, Sir Keir and Mr Zelensky could potentially meet the US president as leaders seek to bridge the transatlantic rift, but suggested that was a “wish” at the moment and there had not been an invitation from the White House.\n\nDowning Street said details of any future travel by the Prime Minister would be set out in the usual way.\n\nIn a televised address later on Wednesday, the French president described Moscow as a “threat to France and Europe” and said he would “open the strategic debate on the protection of our allies on the European continent by our (nuclear) deterrent”.\n\nFrance is the only nuclear power in the European Union.\n\nEU leaders are set to address the issue of deterrence, among other topics, during the Thursday summit in the Belgian capital focusing on support for Ukraine and wider defence.\n\nMr Zelensky is also invited to the meeting.\n\nEuropean Nato allies have for decades counted on the powerful US deterrent.\n\n“Europe’s future does not have to be decided in Washington or Moscow,” Mr Macron said, warning that “the innocence of the last 30 years” which followed the 1989 fall of the Berlin Wall is “now over”.\n\nMr Macron said Russia is now spending 40% of its state budget in military spending, with plans to expand its army by 2030 with 300,000 additional soldiers, 3,000 tanks and 300 jet fighters.\n\n“Who can believe that today’s Russia will stop at Ukraine?” he asked.\n\n“I want to believe the US will stay by our side but we have to be ready if that isn’t the case.”\n\nMr Zelensky thanked the French president following his speech, saying “peace must be real, not just a word—it cannot mean Ukraine’s capitulation or collapse.”\n\n“It must be just, reliable, and lasting, and this can only be achieved through strong and long-term security guarantees — for Ukraine, Europe, and the entire world,” the leader said.\n\nUS-Ukraine relations reached a nadir last week when plans to sign a minerals agreement broke down following a dramatic row between Mr Trump, vice president JD Vance and Mr Zelensky.\n\nBut the US president used a wide-ranging speech in Congress to signal an easing of tensions, saying he had received a letter from the Ukrainian leader on Tuesday suggesting Kyiv is ready to sign a deal “at any time”.\n\n“I appreciate that he sent this letter,” Mr Trump said. “We’ve had serious discussions with Russia and have received strong signals that they are ready for peace. Wouldn’t that be beautiful?”\n\nBefore his trip, Mr Healey hailed the “special relationship” between the UK and the US and said it is “crucial that the UK and Europe step up further to take more responsibility for our security, and we are doing so”.\n\nHe added: “The Prime Minister was clear following his meetings over the past week that we will continue our dialogue with friends and allies to secure a path to a lasting peace in Ukraine.\n\n“We will advance that work in Washington over the coming days.”","summary":"John Healey will meet Pete Hegseth in Washington on Thursday as efforts continue to bridge a transatlantic rift over Kyiv’s future security.","url":"https://www.standard.co.uk/news/politics/john-healey-emmanuel-macron-volodymyr-zelensky-ukraine-european-b1214963.html","image":"https://static.standard.co.uk/2025/03/06/00/414949cc19e0f172e4b80da03fb38845Y29udGVudHNlYXJjaGFwaSwxNzQxMzAyMzQx-2.79220742.jpg?width=1200","video":null,"publish_date":"2025-03-06 00:01:16","author":"Nina Lloyd","authors":["Nina Lloyd"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.006},{"id":297138482,"title":"Healey to meet US counterpart as European leaders hold crisis talks on Ukraine","text":"The UK Defence Secretary is expected to discuss the US decision to pause intelligence-sharing with Ukraine with his counterpart in Washington as European leaders hold crisis talks in Brussels on support for Kyiv.\n\nJohn Healey will join Pete Hegseth on Thursday for a bilateral meeting on a possible peace plan while efforts continue to bridge a transatlantic rift over the country’s future security.\n\nMeanwhile, French President Emmanuel Macron said he would confer with allies about the prospect of using France’s nuclear deterrent to protect the continent in the face of threats from Russia at a summit of EU leaders.\n\nMr Healey’s trip was agreed last week after Sir Keir Starmer announced a rise in the UK’s defence spending to 2.5% of GDP, and comes as the US suspended intelligence-sharing with Ukraine.\n\nCIA director John Radcliffe told Fox Business Network on Wednesday there has been a “pause” on “the intelligence front” following Donald Trump’s fractious Oval Office confrontation with Volodymyr Zelensky last week.\n\nThe decision could affect Ukraine’s ability to effectively use long-range western weapons, such as US-made Himars launchers and deprive Kyiv of advance information about potential incoming threats.\n\nAs he arrived in the Capitol later in the day, Mr Healey was asked what he would say to his counterpart about the issue when they meet for talks.\n\n“Those are discussions for tomorrow, but it’s part of a two-day programme and we’re working hard for peace,” he said.\n\nUS national security adviser Mike Waltz said on Wednesday that Ukraine and America were still talking despite the pause.\n\n“I just got off the phone with my counterpart, the Ukrainian national security adviser,” he said.\n\n“We are having good talks on location for the next round of negotiations, on delegations, on substance.”\n\nHe added: “I think we’re going to see movement in very short order.”\n\nThe French government said on Wednesday that Mr Macron, Sir Keir and Mr Zelensky could potentially meet the US president as leaders seek to bridge the transatlantic rift, but suggested that was a “wish” at the moment and there had not been an invitation from the White House.\n\nDowning Street said details of any future travel by the Prime Minister would be set out in the usual way.\n\nIn a televised address later on Wednesday, the French president described Moscow as a “threat to France and Europe” and said he would “open the strategic debate on the protection of our allies on the European continent by our (nuclear) deterrent”.\n\nFrance is the only nuclear power in the European Union.\n\nEU leaders are set to address the issue of deterrence, among other topics, during the Thursday summit in the Belgian capital focusing on support for Ukraine and wider defence.\n\nMr Zelensky is also invited to the meeting.\n\nEuropean Nato allies have for decades counted on the powerful US deterrent.\n\n“Europe’s future does not have to be decided in Washington or Moscow,” Mr Macron said, warning that “the innocence of the last 30 years” which followed the 1989 fall of the Berlin Wall is “now over”.\n\nMr Macron said Russia is now spending 40% of its state budget in military spending, with plans to expand its army by 2030 with 300,000 additional soldiers, 3,000 tanks and 300 jet fighters.\n\n“Who can believe that today’s Russia will stop at Ukraine?” he asked.\n\n“I want to believe the US will stay by our side but we have to be ready if that isn’t the case.”\n\nMr Zelensky thanked the French president following his speech, saying “peace must be real, not just a word—it cannot mean Ukraine’s capitulation or collapse.”\n\n“It must be just, reliable, and lasting, and this can only be achieved through strong and long-term security guarantees — for Ukraine, Europe, and the entire world,” the leader said.\n\nUS-Ukraine relations reached a nadir last week when plans to sign a minerals agreement broke down following a dramatic row between Mr Trump, vice president JD Vance and Mr Zelensky.\n\nBut the US president used a wide-ranging speech in Congress to signal an easing of tensions, saying he had received a letter from the Ukrainian leader on Tuesday suggesting Kyiv is ready to sign a deal “at any time”.\n\n“I appreciate that he sent this letter,” Mr Trump said. “We’ve had serious discussions with Russia and have received strong signals that they are ready for peace. Wouldn’t that be beautiful?”\n\nBefore his trip, Mr Healey hailed the “special relationship” between the UK and the US and said it is “crucial that the UK and Europe step up further to take more responsibility for our security, and we are doing so”.\n\nHe added: “The Prime Minister was clear following his meetings over the past week that we will continue our dialogue with friends and allies to secure a path to a lasting peace in Ukraine.\n\n“We will advance that work in Washington over the coming days.”","summary":"The UK Defence Secretary is expected to discuss the US decision to pause intelligence-sharing with Ukraine with his counterpart in Washington as European leaders hold crisis talks in Brussels on support for Kyiv. John Healey will join Pete Hegseth on Thursday for a bilateral meeting on a possible peace plan while efforts continue to bridge [&#8230;]\n\n\nThe post Healey to meet US counterpart as European leaders hold crisis talks on Ukraine appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/06/healey-to-meet-us-counterpart-as-european-leaders-hold-crisis-talks-on-ukraine/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.79220742-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-06 00:01:16","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.006},{"id":297143940,"title":"Chicago resident slams Democrats' attempts to 'racialize' immigration issues amid sanctuary city hearings","text":"Sanctuary city mayors are facing intense scrutiny following their testimony before Congress, where they defended their resistance to federal immigration enforcement. Chicago resident P-Rae Easley, who traveled to Washington for the House Oversight Committee hearing, voiced frustration over her city’s handling of the migrant crisis, arguing that taxpayer money should not be spent on individuals who entered the country illegally. \"Our goal is to protect our families, not people who chose to skirt our U.S. immigration laws and sneak into our country,\" Easley said Wednesday on \"America Reports.\" \"It’s not fair that they’re held to a lesser standard than us. It’s like they’re special. And we want to know what makes these people so special that they can't be prosecuted, they get our tax dollars, they get free housing, they get free healthcare. It’s like we’re at a disadvantage because we’re citizens.\" She expressed gratitude to Congress for shedding light on what she sees as mismanagement by Democratic city leaders, including her own mayor. ‘SANCTUARY’ CITY MAYOR CONFRONTED AFTER GANG MEMBER ALLEGEDLY ASSAULTS FEDERAL OFFICERS \"We have been in a situation where our tax dollars, resources, and time have been allocated to illegal aliens because our city has been magnetized for illegal immigration through sanctuary policies,\" she said. The mayors of Chicago, New York, Denver, and Boston testified before the House Oversight Committee regarding their response to President Donald Trump’s immigration policies. Their testimony comes as many sanctuary cities struggle with growing financial and logistical challenges linked to the influx of migrants. Chicago Mayor Brandon Johnson defended his administration’s stance, arguing that deportation policies could increase crime by discouraging cooperation with law enforcement. \"Any actions that amplify fears of deportations makes Chicago more dangerous,\" Johnson said to lawmakers. \"Those fears cause witnesses and victims to avoid cooperating with police. The cooperation of all people, regardless of their immigration status, is essential to achieving the city’s goals of reducing crime and pursuing justice for victims.\" Johnson has repeatedly reaffirmed Chicago’s status as a sanctuary city, rejecting federal intervention. But residents like Easley say the policies place an unfair burden on taxpayers. TOM HOMAN TELLS MIGRANT TERROR GROUPS TRUMP WILL ‘WIPE YOU OFF THE FACE OF THE EARTH’ \"We don’t go to work to pay for illegal immigrants,\" she said. \"We don’t fight the snow, and the rain, and the heat to go out into this world to pay taxes in order to pay for the entire third world.\" Chicago has spent over $638 million on its \"New Arrivals Mission,\" which funds housing, healthcare, and other services for migrants. New York City is projected to spend $3.3 billion in fiscal year 2025 to support its migrant population. Easley, who identifies as an \"eighth-generation free American,\" said she finds the city’s priorities \"insulting.\" \"It’s not fair to us, especially me as an American Negro woman. I’m not an immigrant at all. So this is none of my business as a 100% eighth-generation free American,\" she said. \"The laws and our sovereignty are not being respected.\" CLICK HERE TO GET THE FOX NEWS APP Easley also pushed back against claims that opposition to sanctuary policies is racially motivated. \"They want to try to make this a racialized issue, they want to try to make this xenophobic,\" she said. \"But by doing that, it ignores people like myself who are not a part of the White majority but are 100% Americans. We can’t stand for this.\"","summary":"P-Rae Easley, a Chicago resident, says she feels Americans are at a &quot;disadvantage&quot; because of sanctuary city policies.","url":"https://www.foxnews.com/media/chicago-resident-slams-democrats-attempts-racialize-immigration-issues-amid-sanctuary-city-hearings","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/379cb133-156b-4a57-8ccd-d98d8bd1d6bb/d0a7889b-d43c-438c-b727-9506d2cda4e5/1280x720/match/896/500/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-06 00:00:39","author":"Madison Colombo","authors":["Madison Colombo"],"language":"en","category":"politics","source_country":"US","sentiment":-0.138}]}