{"offset":0,"number":50,"available":10792,"news":[{"id":329184014,"title":"Key Advantages Of Digital Home Loans","text":"HomeBusinessKey Advantages Of Digital Home Loans\n\nKey Advantages Of Digital Home Loans\n\nThe transition to online medium reflects a fundamental shift in consumer behaviour and expectations\n\nRahul KalyaniUpdated: Saturday, June 07, 2025, 07:08 PM IST\n\nThe Indian economy is becoming increasingly digital-first and the once complex and paperwork heavy journey of homeownership is being reimagined through seamless digital experiences.\n\nTraditionally, applying for a home loan involved multiple visits to bank branches, extensive documentation, and long waiting periods. For many, this acted as a deterrent, delaying the dream of owning a home. However, digital adoption has dramatically changed the landscape.\n\nAccording to a 2023 report by the RBI, digital lending in India has grown at a CAGR of 39% over the past 5 years, with home loans emerging as one of the fastest-growing segments. Furthermore, the number of home loan applications in urban India initiated through digital platforms are increasing, reflecting a fundamental shift in consumer behaviour and expectations.\n\n5 Amazing Benefits Of Home Loans You Don’t Know, Even Millionaires Take Loans To Buy Homes!\n\nGreater penetration\n\nThane: Animal Activist Serves Legal Notice To Housing Society After Being Fined ₹5.5 Lakh For Walking Dogs\n\nMumbai News: Police Files FIR After Actor Anuj Sachdeva Alleges Newborn Kitten Was Illegally Relocated From His Goregaon Housing Society\n\n'Will Face Very Serious Consequences': US President Donald Trump Warns Billionaire Elon Musk Over Funding Democratic Candidates\n\nFarah Khan Shares A Picture From Her Maldives Vacation; Malaika Arora And Other Netizens Ask, ‘Where Is Dilip?’\n\nOne of the key drivers behind the surge in digital home loans is the increased penetration of smartphones and internet access, with over 750 million internet users in India today. This widespread connectivity is empowering even tier 2 and tier 3 cities to adopt digital lending solutions.\n\nAlongside this, the introduction of e-KYC and digital documentation has eliminated the cumbersome need for physical paperwork, significantly speeding up the application process and improving customer experience. Moreover, advancements in AI and data-driven credit underwriting have enabled lenders to assess creditworthiness in real time using alternate data sources.\n\nStreamlined journey\n\nThis innovation is particularly beneficial for first-time borrowers and self-employed professionals who were often underserved by traditional systems. Finally, API-led integrations are streamlining the entire home loan journey by seamlessly connecting credit bureaus, property verification services, and financial platforms facilitating near instant approvals and redefining what borrowers can expect from the process.\n\nThe rise of digital home loans is particularly significant for young, tech-savvy millennials and Gen Z homebuyers, many of whom seek speed, transparency, and personalization. Industry studies also indicate that a significant majority of millennial borrowers in India prefer digital channels for home loan discovery and application, reflecting a broader shift towards digital financial services.\n\nEasier access\n\nAdditionally, women borrowers a rising demographic in home ownership are benefitting from digital platforms that provide easier access, tailored offers, and real-time tracking.\n\nDigital home loans aren’t just good for consumers but are equally beneficial for financial institutions. With reduced operational costs, faster turnaround times, and better fraud prevention tools, lenders are now able to serve more customers with greater efficiency. Moreover, digital footprints enable better risk profiling and customized loan offerings, leading to higher approval rates and improved portfolio quality.\n\nIndia’s urbanization is expected to reach 600 million people by 2031, according to the Ministry of Housing and Urban Affairs. Meeting this demand will require not only affordable housing, but also scalable credit delivery mechanisms and digital home loans are poised to play a critical role. With government support for initiatives like Digital India, PMAY, and the introduction of Account Aggre-gator frameworks, the ecosystem is ripe for transformation.\n\nFollow us on\n\nRECENT STORIES\n\nLiving Solo? 12 Hacks Every Woman Needs To Know\n\nHousing Policy For Maharashtra Receives Cabinet Approval\n\nKey Advantages Of Digital Home Loans\n\nIndia Delivers LPG To Over 33 Crore Consumers After Booking Within Hours: Hardeep Puri\n\nLate GST Returns Can’t Be Filed After 3 Years; GSTR-3B To Become Non-Editable From July","summary":"","url":"https://www.freepressjournal.in/business/key-advantages-of-digital-home-loans","image":"https://media.assettype.com/freepressjournal/2025-06-07/6jlojioz/Home-loans2-0106.jpg","video":null,"publish_date":"2025-06-08 01:30:00","author":"Rahul Kalyani","authors":["Rahul Kalyani"],"language":"en","category":"business","source_country":"in","sentiment":0.163},{"id":329183728,"title":"Letters: Railway’s starring Swiss role can offer Ireland some much-needed inspiration","text":"What struck me most of all was the amazing engineering feats regarding transport -infrastructure there.\n\nThe number of tunnels is unbelievable. You can drive from one valley to the next, not by going over the mountain but by going through it, and this is repeated time and again.\n\nThe railways are on another level, literally. We travelled on the Jungfraubahn, which tunnels its way through the mountains to the summit 3,454 metres above sea level. The station at the summit is actually in the mountain.\n\nOn another day we were driving and were informed by our GPS that a particular road was closed because of weather conditions.\n\nNo problem. We just drove to a railhead, drove the car on to a train, stayed in the car, travelled about 10km in a tunnel and drove off at the other end. Fantastic.\n\nAlas, like all good things the holiday came to an end. Arriving at Dublin Airport we waited in the open in cool weather for a bus to crawl through the city to our -destination.\n\nWe have a main line railway that is about 6km from Dublin Airport and a Luas line (Broombridge) about 7km from same. Bearing in mind the Swiss built the Jung-fraubahn over 100 years ago, is there any chance that our politicians could build the badly needed rail link?\n\nI hold my breath in anticipation.\n\nBrendan Langley, Ranelagh, Dublin 6\n\nLess talking and more action on Gaza, please\n\nMadam — The Government needs to stop merely condemn-ing the genocide that is happening in Gaza and take decisive action.\n\nPlanes carrying arms to Israel should not be allowed to land in Ireland or fly through Irish airspace. Draconian sanctions involving a unilateral ban on the import of all Israeli products should be activated immediately, even if this means breaking ranks with a sleepwalking Europe.\n\nWar crimes are happening in plain sight on a daily basis and the Irish Government is greatly shamed by its passive approach to this ever deteriorating situation.\n\nThe Government is not listening to its people on this issue.\n\nColman Collins, Galway\n\nTrump is helping to render Gaza a hell\n\nMadam — Home is where the heart is, and throughout its history the United States of America has been a home from home for the Irish and many other nationalities. But now I think this sentimental idea about the US is changing.\n\nDonald Trump and his government may extol the praises of the US through songs such as God bless America, my home sweet home, but that same government is, through its continuing support for the state of Israel, depriving the men, women and children of Gaza and the West Bank of their home sweet home — indeed, it is helping to make it a hell on earth.\n\nThis is a great disappointment to those of us who have admired the US in the past.\n\nOn his accession to office for the second time, the author of How to Get Rich and Think Big and Kick Ass: In business and life said Gaza could be the Riviera of the East, thus disclosing his mercenary way of thinking and his scant regard for the plight of others.\n\nTrump has the power to stop the war, first by ending the supply of arms to the Israelis. But he will not do that.\n\nWhither democracy when the great democratic institutions, the United Nations, the European Union, the international courts, have failed to impose their influence and authority on this interminable political catastrophe?\n\nPalestine should be home to Palestinians. Instead, it is a no man’s land. This is disgraceful.\n\nAnthony McDonagh, Carrickmacross, Co Monaghan\n\nWhy no coverage of Hamas terrorism?\n\nMadam — This country now has an obsession with Gaza to the point of mania. We are being inundated with accounts and stories about the Gaza Strip.\n\nMany of these are not balanced, garnishing legitimate criticism from the Israeli ambassador to Ireland Dana Erlich.\n\nCoverage and analysis of Hamas terrorist activity is hardly mentioned, which gives a highly unbalanced and biased view of what is going on.\n\nIt is important we have rout-ine objective coverage rather than campaigning journalism.\n\nMaurice Fitzgerald, Shanbally, Co Cork\n\nChilling programme on nursing homes\n\nMadam — As an 82-year-old man, I watched the RTÉ Investigates programme about nursing homes for the elderly with absolute horror.\n\nTwo words, “nursing” (the most caring of professions) and “home” (one’s sanctuary and most sacred of places) put together to create a hell for ourselves, our spouses, parents and grandparents at the end of our days.\n\nNursing homes are staffed by sons, daughters and grandchildren of elderly people, yet some choose to ignore the consequences of their actions.\n\nHow can management not keep a constant supply of sani-tary products and bed sheets for elderly residents they are being paid handsomely to care for? It beggars belief.\n\nJohn K Ryan, Tipperary\n\nMadam — The Poor House, the Magdalene Laundries, the psychiatric institutions and now the nursing homes. It is a modern-day scandal. Is this what is facing the elderly, sick, frail and vulnerable people needing care and those strugg-ling to find compassionate care for them in 2025?\n\nThis is happening at a time of so-called oversight, supported by increased technology and corporate-speak.\n\nExcellent journalists have highlighted this appalling scandal, clear for all to see, and it must be acted on. Shame on us for allowing this to happen.\n\nAlice Leahy, Alice Leahy Trust, Dublin 8\n\nAct has destroyed the rights of women\n\nMadam — Ciara Witts (Lett-ers, June 1) complains that John Boyne doesn’t explain what the problems are with the Gender Recognition Act 2015 (GRA). Allow me to explain.\n\nBy permitting a man to legally become a woman, the GRA destroyed the rights of women and girls to single-sex spaces (toilets and changing rooms), services (domestic violence refuges, rape crisis services) and sports (including contact sports). We’re now in the position of having to fight to regain these hard-won rights.\n\nIt takes just one man to make these spaces, services and sports mixed-sex, and all he needs to do is fill out a form and pay €10.\n\nImagine a law that allowed white people to declare they are black or adults to declare they are children. There would rightly be uproar. Yet women are supposed to accept that any man can say he’s a woman, or be called a bigot.\n\nIf that’s not misogynistic, I don’t know what is.\n\nE Bolger, Dublin 9\n\nDeclan Lynch is now king of columnists\n\nMadam — For quite some time before his departure, Gene Kerrigan was considered by many of us as the king of Sunday Independent columnists. But it’s time now, I think, for a new monarch to be crowned, so step forward Declan Lynch.\n\nEach week, he provides us with erudite and often witty musings on current affairs, both local and foreign; last week’s column on Elon Musk was another example of his wonderful writing skills.\n\nIt must be acknowledged that Declan foresaw — and wrote about — the massive danger that Donald Trump would present to democracy, both in the United States and worldwide, long before other commentators. Long may he reign.\n\nJim Hickey, Mount Pleasant, Waterford\n\nIrish people living in fear in US is so sad\n\nMadam — The piece by Ali Bracken recently on how many Irish immigrants who have lived in America for decades are now living in fear of being deported was a sad and upsetting read.\n\nIrish-American families are being torn apart and living in fear because of Donald Trump’s cruel and inhumane policies in the ‘land of the free’.\n\nIt is so sad to hear of Irish expats being treated like common criminals. These people go out to work every day and pay their taxes to the state, raise their families and contribute voluntarily to better the communities in which they live.\n\nThe Irish helped to build America by serving in its mili-tary and building railways, motorways and skyscrapers over many decades. This would never happen under presidents Eisenhower, Kennedy, Clinton, Bush or Biden, who knew the value of the Irish men and women who helped to build America to become the world leader it is today.\n\nTom Towey, Cloonacool, Co Sligo\n\nPut a bell on your bike to keep all safe\n\nMadam — It is wonderful to see the new greenways along our rivers and canals. As more and more people are using them, a public awareness campaign to encourage cyclists and pedestrians to “be sound” to each other is being considered by Dublin City Council. Possibly a “be heard” campaign would be more appropriate.\n\nThe growth in cycling is great, but I would implore bi-cycle owners to have a bell fitted to their machines. A lot of bikes and scooters, some of which can cost thousands of euro, are very fast and silent and do not have a bell or a buzzer to warn people of their approach.\n\nThe road traffic regulations of 1963 clearly state that “a bell which can be heard from a reasonable distance must be fitted to all bicycles”. So, cyclists, comply with the law and keep yourself and other people safe.\n\nBrian Lube, Co Meath\n\nAirbnbs did not cause Irish housing crisis\n\nMadam — Eoin O’Malley’s suggestion last Sunday that all Airbnbs should be taxed out of existence makes me worry for the hard-working hosts — the majority — who are only trying to keep a roof over their heads.\n\nIt isn’t just that we want some return on investment, but also on our weekly labour as we provide comfortable, reason-ably priced short-term accommodation for foreign tourists, contract workers, our neighbours’ relatives and Irish families on holiday.\n\nWe make use of available space in a flexible, sustainable way that benefits the local economy. Our annexes and cottages and remote holiday homes didn’t cause the housing crisis, and we can’t solve it.\n\nSusan Devane, New Ross, Co Wexford\n\nEilis O’Hanlon is one brave journalist\n\nMadam — In my view, Eilis O’Hanlon is the best and bravest female journalist in print media today.\n\nIn her insightful article last week she noted that Morning Ireland, Claire Byrne and Drive-time only briefly referred to the recent UK ruling that defined “woman” under equality law as a biological female.\n\nI was not surprised that this highly significant ruling was practically ignored by the news and current affairs programmes on RTÉ and in the print media.\n\nThe fact remains that a man with XY chromosomes can never change to be an XX chromosomal woman, and the UK Supreme Court was simply confirming this medical truth.\n\nDr Pat Mc Grath, Monkstown, Co Dublin\n\nJoni Mitchell said it best — let’s listen up\n\nMadam — The death of one of Ireland’s oldest breeding white-tailed eagles last week is another blow to efforts to save what is left of our disappearing biodiversity. Over the past five years, several white-tailed eagles have been poisoned or shot.\n\nThe reintroduction of this magnificent bird to Ireland was a cause for celebration, but the project appears to be floundering. The sad fact is that nature is held in contempt by a sizeable body of people on this island.\n\nSince the gorse fire ban officially came into force in March, fires have raged through at least five counties. Pollution is rampant and habitats are being destroyed at such a rate that you’d think we wanted to be rid of them. Pesticides are used with abandon, killing precious honey bees already battling to survive the ravages of climate change and modern agriculture.\n\nAnd then there’s the abhorrent example set by the State, which yearly licenses the capture of thousands of our native hares for coursing. What kind of message does that send out to the public about the value we place on wildlife conservation?\n\nDuring the Covid lockdown, many of us rediscovered the att-ractions of nature. We connected with a world that lay, largely unheeded, all around us. Some of us may need reminding that, in the words of the Joni Mitchell song, “You don’t know what you’ve got ’til it’s gone”.\n\nJohn Fitzgerald, Callan, Co Kilkenny\n\nHere is a confession: I don’t like Guinness\n\nMadam — I was intrigued to read Leslie Ann Horgan’s recent editor’s letter in Life Magazine (June 1), in which she recounted having her first pint of Guinness at the age of 24 — her very first alcoholic drink.\n\nAs a 70-year-old Irishman, I thought I might offer a contrasting tale: I have never had a pint of Guinness.\n\nAt 16, working on a building site in Birmingham, I bought a bottle of Guinness with my first pay — which, incidentally, was more than my father was earning at the time back home in Northern Ireland.\n\nI took a sip, found I didn’t like the taste, and I’ve never touched it since.\n\nA small, perhaps unremarkable fact, but in Ireland such abstinence from the national drink almost feels like a confession.\n\nEnda Cullen, Tullysaran, Co Armagh\n\nGive up demanding a capital M for mass\n\nMadam — Mary Lally requests ‘Again, please give us a capital M for mass’ (Letters, June 1).\n\nThe reason lower case is used when writing “mass” is that the original Latin word is “missa” from “mission” — sending out the faithful to be apostles. Mass is lower case, whereas Euchar-istic, meaning celebration, does have an upper case E.\n\nRules of grammar take precedence in the media. By no means is this, nor should it be taken, as demeaning in any way.\n\nDeclan Foley, Melbourne, Australia\n\nStudents are more than sum of results\n\nMadam — Now that this year’s Leaving Certificate exams have begun, may I offer some words of advice? These stud-ents have taken many lessons and now face tests. However, in life it is most often the other way around. The tests of life come first, followed, if we are lucky, by some lessons.\n\nThese tests — call them the slings and arrows of life — will reveal the individual character of each member of the class of 2025. Finally, they are all much more than the sum of their results. Good luck to them.\n\nStephen O’Hara, Carrowmore, Sligo","summary":"Madam — I have just ­returned from the holiday of a lifetime in Switzerland. To view the Matterhorn in ­brilliant sunshine was breathtaking.","url":"https://www.independent.ie/opinion/letters/letters-railways-starring-swiss-role-can-offer-ireland-some-much-needed-inspiration/a1970498815.html","image":"https://focus.independent.ie/thumbor/ZIfIQVCYTb6O5FRIiiB30SO02V4=/0x0:1023x682/550x550/prod-mh-ireland/8442d2e5-1c3d-4a12-b00d-8d55a760a7e4/e38410c1-d3b0-4dc1-b9db-20fdf2f75de8/SN%20%20Jungfraubahn%20Switzerla.jpg","video":null,"publish_date":"2025-06-08 01:30:00","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"ie","sentiment":-0.259},{"id":329183722,"title":"Brendan O’Connor: Ten questions about the Trump and Musk feud for the Junior Cert history paper","text":"Junior Certificate History paper 2055:\n\n1. Why did Donald Trump and Elon Musk fall out? Because Musk had a doggie (he spelt it Dog-e, cause he was really futuristic) in the White House, and Trump’s friend Big Beautiful Bill killed it, or something. Musk said mean things about Big Beautiful Bill.","summary":"Junior Certificate History paper 2055:","url":"https://www.independent.ie/opinion/brendan-oconnor-ten-questions-about-the-trump-and-musk-feud-for-the-junior-cert-history-paper/a625186298.html","image":"https://focus.independent.ie/thumbor/KQ6J0Fzgh1eljffpCTuLtBpGMlE=/0x0:960x640/550x550/prod-mh-ireland/12c38d54-233f-4d79-bfd0-eb2748074b05/245abb49-4836-454a-8e43-674f3ca49377/12c38d54-233f-4d79-bfd0-eb2748074b05.jpg","video":null,"publish_date":"2025-06-08 01:30:00","author":"Brendan O’connor","authors":["Brendan O’connor"],"language":"en","source_country":"ie","sentiment":-0.551},{"id":329183712,"title":"Naoise Dolan: Donald Trump’s cruel stance on immigration now has eerie echoes in our own far right","text":"We knew the break-up would be bad. Bad and public. \n\nEver since Elon Musk bankrolled -Donald Trump’s political comeback last year, the world has watched a psychological experiment unfold. Can two narcissists — not as in “self-absorbed individuals”, more like “people who would almost certainly meet the full diagnostic criteria for Narcissistic actual Personality Disorder” — be friends?","summary":"We knew the break-up would be bad. Bad and public.","url":"https://www.independent.ie/opinion/naoise-dolan-donald-trumps-cruel-stance-on-immigration-now-has-eerie-echoes-in-our-own-far-right/a1218347209.html","image":"https://focus.independent.ie/thumbor/TZEl7oKGesXrgUYEORqDTIXTy9g=/0x157:2795x2020/550x550/prod-mh-ireland/a48e22d2-df22-4e46-ac51-6c28ac5740f8/1f28a66c-af0f-4ea7-bb9a-c01177c842e4/a48e22d2-df22-4e46-ac51-6c28ac5740f8.jpg","video":null,"publish_date":"2025-06-08 01:30:00","author":"Naoise Dolan","authors":["Naoise Dolan"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.092},{"id":329182796,"title":"Second Day of Clashes in LA: Protesters Confront Immigration Authorities Following Arrests","text":"PARAMOUNT, Calif. (AP) — The air on the outskirts of southern Los Angeles became thick with tear gas and smoke on Saturday as clashes between immigration officials and protesters continued for a second consecutive day. President Trump indicated that the federal government might need to “step in and solve the problem.”\n\nGovernor Gavin Newsom stated that federal authorities were “moving to take over the California National Guard and deploy 2,000 soldiers,” cautioning that such actions could only worsen tensions. More specific information was not immediately provided.\n\n“This is the wrong mission and will erode public trust,” Newsom said. deployment.\n\nThe governor also mentioned that local agencies “can access law enforcement aid at any moment” and assured that “there is currently no unmet need.”\n\nOn his Truth Social platform, Trump said: “the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved” if Newsom and the Los Angeles mayor “can’t do their jobs, which everyone knows they can’t.”\n\nBorder Patrol personnel in riot gear and gas masks stood guard outside an industrial park in the city of Paramount, deploying tear gas as bystanders and protesters gathered on medians and across the street. Some jeered at officers while recording the events on smartphones. \n\n“ICE out of Paramount. We see you for what you are,” a woman said through a megaphone. “You are not welcome here.”\n\nOne handheld sign read, “No Human Being is Illegal.”\n\nSmoke rose from burning shrubbery and refuse in the street, and demonstrators kicked at a Border Patrol vehicle. A boulevard was closed to traffic as Border Patrol agents circulated through a community where more than 80% of residents identify themselves as Latino.\n\nHomeland Security Secretary Kristi Noem posted a message on social media addressing “LA rioters” and warning that interference with immigration enforcement will not be tolerated.\n\n“You will not stop us or slow us down,” Noem said on the X platform. Immigration and Customs Enforcement “will enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.”\n\nImmigration and Customs Enforcement officers executed search warrants at multiple locations Friday, including outside a clothing warehouse in the fashion district. The action came after a judge found probable cause that the employer was using fictitious documents for some of its workers, according to representatives for Homeland Security Investigations and the U.S. Attorney’s Office.\n\nA tense scene unfolded outside as a crowd tried to block agents from driving away.\n\nAdvocates for immigrants’ rights said there were also migration detentions outside Home Depot stores and a doughnut shop.\n\nDHS said in a statement that recent ICE operations in Los Angeles resulted in the arrest of 118 immigrants, including five people linked to criminal organizations and people with prior criminal histories.\n\nFollowing the Friday arrests, protesters gathered in the evening outside a federal detention center, chanting, “Set them free, let them stay!”\n\nSome held signs with anti-ICE slogans, and some some scrawled graffiti on the building. \n\nAmong those arrested at the protests was David Huerta, regional president of the Service Employees International Union. Justice Department spokesperson Ciaran McEvoy confirmed that he was being held Saturday at the Metropolitan Detention Center in Los Angeles ahead of a scheduled Monday court appearance. \n\nIt was not clear whether Huerta had legal representation. \n\nDemocratic Senate Minority Leader Chuck Schumer called for his immediate release. In a social media post, he cited a “disturbing pattern of arresting and detaining American citizens for exercising their right to free speech.” \n\nThe immigration arrests come as President Donald Trump and his administration push to fulfill promises of mass deportations across the country.\n\nMayor Karen Bass said the activity was meant to “sow terror” in the nation’s second-largest city.\n\nIn a statement Saturday, ICE Acting Director Todd Lyons chided Bass for the city’s response to the protests.\n\n“Mayor Bass took the side of chaos and lawlessness over law enforcement,” Lyons said. “Make no mistake, ICE will continue to enforce our nation’s immigration laws and arrest criminal illegal aliens.”\n\nLee reported from Santa Fe, New Mexico.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPARAMOUNT, Calif. (AP) — The air on the outskirts of southern Los&#8230;\n\n\nThis Post: Second Day of Clashes in LA: Protesters Confront Immigration Authorities Following Arrests first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/second-day-of-clashes-in-la-protesters-confront-immigration-authorities-following-arrests/","image":"https://internewscast.com/wp-content/uploads/2025/06/Protesters-and-immigration-authorities-face-off-for-a-second-day.jpeg","video":null,"publish_date":"2025-06-08 01:21:26","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.121},{"id":329180902,"title":"Inside key meeting to remove Trump tariffs","text":"Senator Farrell spoke to the US Trade Representative while in Paris last week and characterised the talk as “friendly”.\n\nDespite this, he maintained the tariffs were “simply unjustified”, highlighting Australia’s trade surplus with the US.\n\nFigures indicate Australia buys about $70bn worth of goods from the US, compared to the $30bn of exports Australia sells to America. \n\n“It wasn’t a difficult discussion in terms of the relationship between us, and I am certainly of the view that we have the opportunity to continue to talk with Jamieson and Commerce Secretary Lutnick to put our case across,” he said. \n\nSenator Farrell also said he was still determined to get the trade barriers slashed. \n\n“It’s only by open discussion, honest discussion, with our allies in the United States that I think we can do that, but I certainly haven’t given up on the prospect of getting these tariffs removed,” he said. \n\n“And every opportunity I get, I’ll continue to pursue that argument with the United States.”\n\nHowever, Senator Farrell said the decision will be ultimately made by Donald Trump, putting increased pressure on Mr Albanese’s upcoming meeting with the US President. \n\nHe said that while there were a “range of ways” in which Australia communicates with the US, the “most important … relationship between our prime minister and the president of the United States”.\n\n“Look every meeting, I think, between an Australian Prime Minister and the US president will always be a critical meeting and I have the greatest confidence in our prime minister to push the Australian point of view on this.” \n\nThe trade barriers currently include a 50 per cent levy on steel, a 25 per cent tariffs on aluminium and a blanket 10 per cent on other goods.\n\nWhile Mr Albanese maintained he won’t compromise on Australia’s biosecurity, he hinted Australia could review current settings which don’t allow the US to import beef which originates from Canada and Mexico. \n\nMr Albanese has also ruled out changes to the Pharmaceuticals Benefit Scheme, News Media Bargaining code and incoming ban on social media for under-16s, while highlighting Australia’s critical minerals industry as a potential bargaining chip. \n\n“If things can be sorted out in a way that protects our biosecurity – of course, we don’t just say no, we don’t want imports in here for the sake of it,” he told ABC radio on Friday.\n\n“But our first priority is biosecurity and there’ll be no compromise on that.”\n\nMr Albanese said Australia would not have a “subservient relationship to any nation”. \n\n“We’re a sovereign nation that stand on our own two feet,” he said. \n\nSenator Farrell also said he was “confident” Australia can secure a new trade deal with the European Union, with EU President Ursula von der Leyen expected to visit Australia in July or August. \n\n“We’ve got lots of things that we can sell to the to the Europeans. I believe now that there’s an appetite to reach an agreement on both sides,” he said.\n\n“The world has changed, those countries that believe in free and fair trade have to work together.”","summary":"Australia’s Trade Minister said he had a “friendly” meeting with US Trade Representative Jamieson Greer when the pair met in Paris last week.","url":"https://www.news.com.au/finance/economy/australian-economy/trade-minister-don-farrell-says-meeting-with-us-trade-rep-jamieson-greer-was-friendly-not-difficult/news-story/ae0220db403366f332e72b17f1103157?from=rss-basic","image":"https://content.api.news/v3/images/bin/eef656281c88aa2c6d6d79664db14f02","video":null,"publish_date":"2025-06-08 01:15:01","author":"Jessica Wang","authors":["Jessica Wang"],"language":"en","category":"politics","source_country":"au","sentiment":0.076},{"id":329183972,"title":"Trump says relationship over with Musk; warns of ‘serious consequences’ about supporting Democrats","text":"President Donald Trump is not backing off his battle with Elon Musk, saying Saturday (June 7, 2025) that he has no desire to repair their relationship and warning that his former ally and campaign benefactor could face “serious consequences” if he tries to help Democrats in upcoming elections.\n\nMr Trump told NBC’s Kristen Welker in a phone interview that he has no plans to make up with Mr Musk. Asked specifically if he thought his relationship with the mega-billionaire CEO of Tesla and SpaceX is over, Mr Trump responded, “I would assume so, yeah.”\n\n“I’m too busy doing other things,” Mr Trump continued. “You know, I won an election in a landslide. I gave him a lot of breaks, long before this happened, I gave him breaks in my first administration, and saved his life in my first administration, I have no intention of speaking to him.”\n\nThe President also issued a warning amid chatter that Mr Musk could back Democratic lawmakers and candidates in the 2026 midterm elections.\n\n“If he does, he’ll have to pay the consequences for that,” Mr Trump told NBC, though he declined to share what those consequences would be. Mr Musk’s businesses have many lucrative federal contracts.\n\nThe President’s latest comments suggest Mr Musk is moving from close ally to a potential new target for Mr Trump, who has aggressively wielded the powers of his office to crack down on critics and punish perceived enemies. As a major government contractor, Mr Musk’s businesses could be particularly vulnerable to retribution. Mr Trump has already threatened to cut Mr Musk’s contracts, calling it an easy way to save money.\n\nThe dramatic rupture between the President and the world’s richest man began this week with Mr Musk’s public criticism of Mr Trump’s “big beautiful bill” pending on Capitol Hill. Mr Musk has warned that the bill will increase the federal deficit and called it a “disgusting abomination.”\n\nMr Trump criticised Mr Musk in the Oval Office, and before long, he and Mr Musk began trading bitterly personal attacks on social media, sending the White House and GOP congressional leaders scrambling to assess the fallout.\n\nAs the back-and-forth intensified, Mr Musk suggested Mr Trump should be impeached and claimed without evidence that the government was concealing information about the President’s association with infamous paedophile Jeffrey Epstein. Mr Musk appeared by Saturday (June 7, 2025) morning to have deleted his posts about Epstein.\n\nVice-President J.D. Vance in an interview tried to downplay the feud. He said Mr Musk was making a “huge mistake” going after Mr Trump but called him an “emotional guy” getting frustrated.\n\n“I hope that eventually Elon comes back into the fold. Maybe that’s not possible now because he’s gone so nuclear,” Mr Vance said.\n\nMr Vance called Mr Musk an “incredible entrepreneur,” and said that Mr Musk’s Department of Government Efficiency, which sought to cut government spending and laid off or pushed out thousands of workers, was “really good.”\n\nMr Vance made the comments in an interview with “manosphere” comedian Theo Von, who last month joked about snorting drugs off a mixed-race baby and the sexuality of men in the U.S. Navy when he opened for Mr Trump at a military base in Qatar.\n\nThe Vance interview was taped Thursday as Mr Musk’s posts were unfurling on X, the social media network the billionaire owns.\n\nDuring the interview, Mr Von showed the Vice-President Mr Musk’s claim that Mr Trump’s administration hasn’t released all the records related to Epstein because Mr Trump is mentioned in them.\n\nMr Vance responded to that, saying, “Absolutely not. Donald Trump didn’t do anything wrong with Jeffrey Epstein.”\n\n“This stuff is just not helpful,” Mr Vance said in response to another post shared by Mr Musk calling for Mr Trump to be impeached and replaced with Mr Vance. “It’s totally insane. The president is doing a good job.”\n\nMr Vance also defended the bill that has drawn Mr Musk’s ire, and said its central goal was not to cut spending but to extend the 2017 tax cuts approved in Mr Trump’s first term. \n\nThe bill would slash spending and taxes but also leave some 10.9 million more people without health insurance and spike deficits by $2.4 trillion over the decade, according to the nonpartisan Congressional Budget Office.\n\n“It’s a good bill,” Mr Vance said. “It’s not a perfect bill.” \n\nThe interview was taped in Nashville at a restaurant owned by musician Kid Rock, a Trump ally.","summary":"Asked specifically if he thought his relationship with the mega-billionaire CEO of Tesla and SpaceX is over, Mr Trump responded, “I would assume so, yeah”","url":"https://www.thehindu.com/news/international/trump-says-relationship-over-with-musk-warns-him-of-serious-consequences-about-supporting-democrats/article69670607.ece","image":"https://th-i.thgim.com/public/news/national/95n8wp/article69670614.ece/alternates/LANDSCAPE_1200/AFP__20250606__49H47FH__v2__HighRes__FilesUsPoliticsTrumpMusk.jpg","video":null,"publish_date":"2025-06-08 01:10:33","author":"Mr Musk","authors":["Mr Musk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.319},{"id":329182698,"title":"Trump to send National Guard to Los Angeles after violent anti-ICE protests","text":"Donald Trump has ordered the National Guard onto the streets of Los Angeles after a second day of violent protests against his immigration policies.\n\nProtesters on Saturday confronted federal immigration officers who had been carrying out raids on local businesses in Paramount, on the outskirts of LA.\n\nBorder Patrol officers in riot gear and masks deployed tear gas and flash-bang grenades to disperse demonstrators outside an industrial park where federal vehicles were targeted.\n\nProtesters used cement blocks and shopping carts to block the road and jeered at officers, shouting at them to get Immigration and Customs Enforcement officers (ICE) “out of Paramount”.\n\n“We see you for what you are,” they shouted, and “You are not welcome here”.\n\nOne handheld sign read, “No Human Being is Illegal.”\n\nTom Homan, the White House’s border czar, told Fox News on Saturday that the National Guard will be sent to the city as the protests continued to escalate.\n\n“We are going to bring the National Guard in tonight,” Mr Homan said.\n\n“American people, this is about enforcing the law – and again, we’re not going to apologise for doing it.”\n\nIt follows a protest outside a detention centre in down-town LA on Friday night during which dozens of people were arrested as they demonstrated against a series of ICE raids on workplaces earlier in the day.\n\nLA’s mayor, Karen Bass, a Democrat, provoked fury from Republicans after she claimed that activity by ICE was meant to “sow terror” in the nation’s second-largest city.\n\nICE Acting Director Todd Lyons attacked Ms Bass for the city’s response to the protests.\n\n“Mayor Bass took the side of chaos and lawlessness over law enforcement,” Mr Lyons said.\n\n“Make no mistake, ICE will continue to enforce our nation’s immigration laws and arrest criminal illegal aliens.”\n\nICE had taken 40 people into custody earlier on Friday after searching multiple locations including a clothing warehouse in the city’s fashion district.\n\nA tense scene unfolded as a crowd tried to block agents from driving away.\n\nAdvocates for immigrants’ rights said people had also been taken into detention after being stopped by ICE officers outside Home Depot stores and a doughnut shop.\n\nThe action came after a judge found probable cause that an employer was using fictitious documents for some of its workers, according to representatives for Homeland Security Investigations and the US Attorney’s Office.\n\nKristi Noem, the Homeland Security Secretary, posted a message on social media addressing “LA rioters” and warning that interference with immigration enforcement would not be tolerated.\n\n“You will not stop us or slow us down,” Ms Noem said on X, adding that ICE “will enforce the law” and that “if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.”\n\nDan Bongino, the FBI Deputy Director, confirmed multiple arrests had been made on Friday.\n\nHe posted on X: “You bring chaos, and we’ll bring handcuffs. Law and order will prevail.”\n\nDHS said in a statement that recent ICE operations in LA resulted in the arrest of 118 immigrants.\n\nFollowing the Friday arrests, protesters gathered in the evening outside a federal detention centre, chanting, “Set them free, let them stay!”\n\nSome held signs with anti-ICE slogans, and some people scrawled graffiti on the building.\n\nAmong those arrested at the protests was David Huerta, regional president of the Service Employees International Union.\n\nJustice Department spokesperson Ciaran McEvoy confirmed that he was being held on Saturday at the Metropolitan Detention Centre in LA ahead of a court appearance on Monday.\n\nIt was not clear whether Mr Huerta had legal representation.\n\nChuck Schumer, the Democratic Senate Minority leader, called for his immediate release. In a social media post, Mr Schumer cited a “disturbing pattern of arresting and detaining American citizens for exercising their right to free speech.”\n\nThe immigration arrests come as Mr Trump and his administration push to fulfil promises of mass deportations across the country.","url":"https://uk.news.yahoo.com/trump-send-national-guard-los-010052087.html","image":"https://s.yimg.com/ny/api/res/1.2/kQMvZ54Pb4TotWZm9CsFFQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTE-/https://media.zenfs.com/en/the_telegraph_818/fdc8ab82b8aa6e3bed5dedee19e47393","video":null,"publish_date":"2025-06-08 01:00:52","author":"Our Foreign Correspondent","authors":["Our Foreign Correspondent"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.02},{"id":329181142,"title":"Musk, Bessent had fistfight in White House in April, WP says","text":"WASHINGTON, June 8. /TASS/. US Treasury Secretary Scott Bessent and entrepreneur Elon Musk who until recently was in charge of the US Department of Government Efficiency (DOGE) had a fistfight in the White House in April, the Washington Post reported, citing Stephen K. Bannon, the influential right-wing podcaster and longtime political adviser to US President Donald Trump.\n\nAccording to the newspaper, \"Musk’s brute-force tactics, lack of political acumen and ideological differences with the MAGA base eroded his relationship with top administration officials and eventually the president.\" However, \"despite the tension, Trump and his deputy chief of staff, Stephen Miller, stuck by Musk’s side.\"\n\nThat said, оn April 2, when Trump \"rolled out tariffs intended to remake the global economy, Musk took to X to express his displeasure with the levies,\" while \"in private, Musk made personal appeals to Trump to reverse the tariffs. Trump did not comply, only relenting days later after a steep decline in bond markets.\"\n\nIn mid-April, disagreements over their preferences for acting Internal Revenue Service (IRS) commissioner led to a fistfight between Musk and Bessent. After they left the Oval Office, where Trump supported Bessent’s choice, the two men started to exchange insults with Musk ramming his shoulder into Bessent’s rib cage and Bessent hitting him back and calling him \"a total fraud.\" According to Bannon, several people stepped in to break up the fight. Later, Trump commented on the incident, saying that \"this is too much.\"\n\nOn June 5, Musk and Trump traded sharp accusations on social networks, with Musk saying that without his support, Trump would never have won the election in November 2024. He also spoke in favor of impeaching Trump, criticized his initiatives on import duties and reduced state spending, and predicted a recession for the American economy in the second half of 2025.\n\nIn turn, Trump said that Musk had stopped fulfilling his duties effectively when he led the DOGE and \"just went crazy.\" He threatened to terminate government contracts with Musk’s companies, including SpaceX, and cancel all subsidies.","summary":"According to the Washington Post, \"Musk’s brute-force tactics, lack of political acumen and ideological differences with the MAGA base eroded his relationship with top administration officials\"","url":"https://tass.com/world/1970359","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-06-08 00:59:25","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.667},{"id":329183974,"title":"Morning Digest: Manipur imposes curfew, Internet ban in 5 districts; Rahul responds to ECI, says answer me if you have nothing to hide, and more","text":"Manipur government imposes curfew, Internet suspension in Bishnupur, four other districts\n\nAn Indefinite Curfew was imposed in Manipur’s Bishnupur district and orders prohibiting the assembly of four or more persons was implemented in four other valley districts — Kakching, Thoubal, Imphal East and Imphal West — late on Saturday (June 7, 2025), following the arrest of Arambai Tenggol (AT) member Kanan Meitei by a joint team of National Investigation Agency (NIA) and Manipur Police in Imphal West.\n\nAnswer my questions if you have nothing to hide: Rahul Gandhi to Election Commission\n\nHours after the Election Commission (EC) rejected Opposition leader Rahul Gandhi’s claim of “match-fixing” in the 2024 Maharashtra Assembly election, the Congress MP asked why the poll panel issued an “unsigned statement” in response. Mr. Gandhi, directly addressing the EC in a post on X, said that such “evasive” action will not protect the EC’s credibility.\n\nAbsurd to defame us after electoral loss in Maharashtra, says ECI\n\nOn a day when the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, levelled allegations of irregularities in the 2024 Maharashtra Assembly election yet again, the Election Commission of India (ECI) said it was completely “absurd” to “defame” the poll body after “any unfavourable verdict by the voters”.\n\nMHA to resume talks with Kuki-Zo insurgents, says camps near Meitei areas must be closed before renegotiating SoO pact\n\nThe Union Home Ministry (MHA) is all set to resume talks with Kuki-Zo insurgent groups in Manipur after a gap of two years. A senior government official told The Hindu that the suspension of operations pact (SoO) with the insurgent groups in Manipur will be “renegotiated with stringent ground rules”. The SoO framework has to be in existence before any “political solution” can be reached.\n\nIndia fifth largest economy: Canada PM Mark Carney argues in favour of India’s inclusion in G7 summit\n\nA day after inviting Prime Minister Narendra Modi to the upcoming G7 meeting in Alberta, Prime Minister Mark Carney of Canada said India is the fifth-largest market in the world and therefore had to be included in the summit, which will see the participation of the world’s leading economies.\n\nWhat is the COVID-19 situation in India?\n\nAfter a rise in COVID-19 numbers in Southeast Asia, India has started to show an uptick in the number of cases over the last couple of weeks. The numbers slowly grew to hit 5,755 cases (as of Saturday 5:30 pm) as per the Ministry of Health’s COVID-19 dashboard. As of now, the variants of COVID-19 doing the rounds in India are descendants of the Omicron variant, first reported in November 2021. The emerging sub-variants, NB.1.8.1 and LF.7, driving the current COVID-19 surge are descendants of JN.1, a sub-lineage of the Omicron BA.2.86 variant.\n\nPartners should understand India’s zero tolerance policy on terror, and not place India and Pakistan on par: Jaishankar tells Lammy\n\nIndia expects its partners to understand its “policy of zero tolerance” on terrorism, External Affairs Minister S. Jaishankar told visiting British Foreign Secretary David Lammy, adding that the country could not “countenance” equating “perpetrators of evil” with their victims.\n\nConfident in PM’s wisdom on delimitation: Andhra Pradesh CM Naidu\n\nAndhra Pradesh Chief Minister N. Chandrababu Naidu said he is confident that Prime Minister Narendra Modi will address the concern of the southern States that any delimitation based only on population would reduce their representation in Parliament.\n\nAmit Shah in Madurai: Home Minister arrives; security beefed up in and around Meenakshi temple\n\nAn elaborate security arrangement has been put in place in Madurai ahead of the two-day visit of BJP leader and Union Home Minister Amit Shah on Saturday (June 7, 2025). The BJP leader is scheduled to address party functionaries as part of the Tamil Nadu BJP’s core council meeting, at a private hotel on Sunday (June 8, 2025).\n\nMusk deletes post claiming Trump ‘in the Epstein files’\n\nTech billionaire Elon Musk has deleted an explosive allegation linking Donald Trump with disgraced financier Jeffrey Epstein that he posted on social media during a vicious public fallout with the U.S. President this week. Mr. Musk, who exited his role as a top White House advisor just last week, alleged on Thursday (June 5, 2025) that the Republican leader is featured in secret government files on former associates of Epstein, who died by suicide in 2019 while he faced sex trafficking charges.\n\nThousands of demonstrators march through Rome, calling for immediate end to war in Gaza\n\nTens of thousands of demonstrators marched through the streets of Rome on Saturday (June 7, 2025) against the war in Gaza in a protest called by Italy’s main opposition parties, who accuse the right-wing government of being too silent. Protesters held a banner reading “Stop the massacre, stop complicity!” at the start of the march, which moved peacefully through the center of Rome amid a massive display of rainbow, Palestinian and political party flags.\n\nInfosys gets huge relief on GST as DGGI closes ₹32,400-crore pre-show cause notice\n\nIn a major relief for Infosys, the Director General of GST Intelligence has closed pre-show cause notice proceedings against the company for financial years 2018-19 to 2021-22 involving a staggering ₹32,403 crore in GST dues. The latest move effectively ends nearly a year-long GST saga for India’s second-largest IT services firm.\n\nTagger, McDonald win French Open junior titles\n\nLilli Tagger of Austria has won the girls’ title at the French Open without dropping a set in the tournament. Making her junior Roland-Garros debut this year, the 17-year-old Tagger beat eighth-seeded Hannah Klugman of Britain 6-2, 6-0 in the final on Saturday (June 7, 2025). Niels McDonald won an all-German final against Max Schoenhaus 6-7 (5), 6-0, 6-3. McDonald became the first German boys’ Grand Slam singles champion since Alexander Zverev won the junior title at the Australian Open in 2014.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/morning-digest-june-08-2025/article69670605.ece","image":"https://th-i.thgim.com/public/incoming/vkj8l4/article69670604.ece/alternates/LANDSCAPE_1200/6744_19_3_2025_14_18_23_1_05_IMG_3703.JPG","video":null,"publish_date":"2025-06-08 00:58:43","author":"The Hindu Bureau","authors":["The Hindu Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":-0.523},{"id":329180250,"title":"World News | Colombian Presidential Candidate Miguel Uribe Shot  in Bogota","text":"Bogota [Colombia], June 8 (ANI): Miguel Uribe, a presidential candidate in Colombia, has been shot at an event in Bogota., CNN reported, citing a Colombian national police statement.\nThe mayor of Bogota, Carlos Galan, said Uribe was receiving emergency care after being attacked in the Fontibon district and that the \"entire hospital network\" of the Colombian capital was on alert in case he needed to be transferred.\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nThe mayor of Bogota confirmed that the suspected attacker has been arrested.\nThe Colombian government shared a statement condemning the Saturday attack on Uribe.\nAlso Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nThis is a developing story and will be updated. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Miguel Uribe, a presidential candidate in Colombia, has been shot at an event in Bogota., CNN reported, citing a Colombian national police statement.","url":"https://www.latestly.com/agency-news/world-news-colombian-presidential-candidate-miguel-uribe-shot-in-bogota-6912760.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250608003619.jpg","video":null,"publish_date":"2025-06-08 00:54:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.483},{"id":329180236,"title":"World News | PTI Cannot Afford to Launch Similar Movement Like in Past, Says Pak PM's Aide","text":"Islamabad [Pakistan], June 8 (ANI): Special Assistant to the Prime Minister on Public and Political Affairs Rana Sanaullah advised Pakistan Tehreek-e-Insaf (PTI) party founder Imran Khan to accept Prime Minister Shehbaz Sharif's offer of a meeting for negotiations and sit with the government to amend the election laws, Geo News reported.\nSanaullah emphasised that the opposition should engage in talks with the government to address the country's issues, particularly economic challenges that affect everyone. Also Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nHe warned that the government will not allow PTI to stage protests like those on May 9, 2023, or November 26, 2024, as per Geo News.\nHighlighting PTI's latest call for a protest movement, he stated that the politician stated that the government would not allow the rival party to do something like May 9, 2023, or November 26, 2024--the recent protest marches led by the former ruling party.\nAlso Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nMeanwhile, PTI founder Imran Khan has announced plans to lead a nationwide protest movement from prison against the Pakistan Muslim League-Nawaz (PML-N)--led coalition government at the Centre. Senator Ali Zafar quoted Khan as saying that the protests should be \"decisive.\" However, Sanaullah ruled out the success of any such movement in the country's current political environment.\n\"As per my belief as a political figure, PTI cannot afford to launch a similar movement like in the past in the light of the position of the government, establishment and those whom PTI has always tried to incite hate against. Even if they attempt to do something like that, it will be a failed attempt,\" maintained Sanaullah when commenting on the prospect of a protest movement.\nNotably, the government and PTI had agreed to hold consultations over the differences last year before the latter abruptly quit the dialogue process over the non-formation of judicial commissions to probe the May 9, 2023 and November 26 events, after attending three meetings with the government's delegation. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Special Assistant to the Prime Minister on Public and Political Affairs Rana Sanaullah advised Pakistan Tehreek-e-Insaf (PTI) party founder Imran Khan to accept Prime Minister Shehbaz Sharif's offer of a meeting for negotiations and sit with the government to amend the election laws.","url":"https://www.latestly.com/agency-news/world-news-pti-cannot-afford-to-launch-similar-movement-like-in-past-says-pak-pms-aide-6912758.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607230608.jpg","video":null,"publish_date":"2025-06-08 00:52:18","author":null,"language":"en","source_country":"in","sentiment":-0.476},{"id":329178658,"title":"White House warns Downing Street against letting China build 'super embassy' near sensitive financial sites","text":"The Oval Office has urged Downing Street against giving a Chinese embassy the green light to be built near London financial centres. \n\nPreviously, proposals for the 'super-embassy' were rejected by the Conservative government amid concerns from British intelligence. \n\nHowever, the plans have been reintroduced following lobbying from China's very own President Xi Jinping. \n\nBut fresh warning have since emerged, as due to the Royal Mint Court's locality to a sensitive hub of essential communication cables, it poses a great risk for an attack. \n\nThe suggested site is also situated between several major financial hubs in Canary Wharf and the City as well as three crucial data centres.\n\nIt is understood US President Donald Trump has warned Sir Keir Starmer against giving the embassy the go-ahead. \n\nThe matter is believed to have been discussed during trade talks, as Britain and its Atlantic allies discuss how they will implement a trade deal to avoid UK steel producers being lumbered with 50 percent import tariffs by July 9. \n\nAccording to the Times, US diplomats would be trepidatious about sharing intelligence with Britain if the embassy went ahead.\n\nA senior US official told the publication: 'The United States is deeply concerned about providing China with potential access to the sensitive communications of one of our closest allies.'\n\nIt comes after a claims 'dark cabling' running beneath the proposed site 'feeds the City of London' were given in a memo to the United States' National Security Council by members of the Inter-Parliamentary Alliance on China (Ipac). \n\nJohn Moolenaar, the Republican head of the House of Representatives' China committee said if these reports were 'accurate' that the site would 'pose an unacceptable risk' to both the UK and US. \n\n'The Chinese Communist Party has a clear track record of targeting critical infrastructure.' he said.\n\n'This development would raise serious concerns in the United States and could be viewed as an act of strategic overreach by Beijing and a curious error in judgment by London.'\n\nThe executive director of IPAC, Luke de Pulford dubbed the matter as a 'flashpoint' in US-UK trade talks, adding that it was 'staggering' the White House had to corroborate the cabling risk to 'defend its own financial system. \n\n'It's time to send Xi Jinping a clear message: no matter the pressure or coercion, the UK and US won't trade away national security, and this embassy isn't happening,' he said.\n\nChina has been attempting to revise plans for the Royal Mint building, which neighbour the Tower of London, since they were purchased in 2018. \n\nIt is believed the Chines foreign minister, Wang Yi, brought up the matter with foreign secretary, David Lammy, while visiting London last year. \n\nAccording to The Times, President Xi had also discussed the same issue with the Prime Minister in a phone conversation. \n\nThe proposal for the embassy, which would be China's largest in Europe, was previously rejected by Tower Hamlets council in 2022. \n\nBut two weeks after Labour Chancellor Rachel Reeves came back from a visit to China earlier this year, both the council's and Scotland Yard's objections were dropped.\n\nPriti Patel, the shadow foreign secretary, described China as a 'dangerous threat to the national and economic security of our country'. \n\nShe said the Conservative party continued to stand 'firmly' against the embassy proposals, stating her party would never put the UK's 'financial centre or country at risk.' \n\nNext Monday, three of Trump's aides are scheduled to meet with their Chinese peers in London for discussions in a bid to solve the current trade war between the two economic powerhouses. \n\nThe Treasury secretary Scott Bessent, the commerce secretary Howard Lutnick and the trade representative Jamieson Greer will act as representatives for the US, Trump has declared on Truth Social. \n\nYesterday, China 's foreign ministry confirmed vice-premier He Lifeng will be on British shores from June 8 until June 13, adding that talks would with the US would take place. \n\nPreviously, a Chinese embassy spokesperson has quashed spy allegations, stating: 'Anti-China elements are always keen on slandering and attacking China.'\n\nA government spokesman said: 'Applications for a new Chinese embassy in Tower Hamlets have been called in for ministers to decide. A final decision will be made in due course.","summary":"The Oval Office has urged Downing Street against giving a Chinese embassy the green light to be built near London financial centres. ","url":"https://www.dailymail.co.uk/news/article-14790931/white-house-downing-street-china-super-embassy-warned.html","image":"https://i.dailymail.co.uk/1s/2025/06/08/01/99146015-0-image-m-84_1749343143609.jpg","video":null,"publish_date":"2025-06-08 00:50:34","author":"Editor,Shannon McGuigan","authors":["Editor","Shannon McGuigan"],"language":"en","source_country":"gb","sentiment":-0.071},{"id":329180248,"title":"World News | 67-yr-old Woman Stabbed to Death in Northern Israel; Son Arrested","text":"Tel Aviv [Israel], June 8 (ANI/TPS): A 67-year-old woman was fatally stabbed Saturday evening in her home in Nahariya, northern Israel. MDA medics pronounced her dead at the scene.\nHer son, a mentally ill man in his 30s, was arrested on suspicion of murder.\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nAccording to the emergency call, \"the son stabbed his mother.\"\nMDA paramedic Adiel Zano said, \"We found a woman with penetrating injuries. We performed prolonged resuscitation efforts, but sadly had to pronounce her dead.\"\nAlso Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nWomen's Lobby Director-General Tal Hochman responded: \"Another woman murdered. Another shattered family. Four women have been killed in the past two weeks--16 since the start of 2025. This epidemic of domestic violence reflects a severe failure of prevention and political will.\" (ANI/TPS) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A 67-year-old woman was fatally stabbed Saturday evening in her home in Nahariya, northern Israel. MDA medics pronounced her dead at the scene. Her son, a mentally ill man in his 30s, was arrested on suspicion of murder.","url":"https://www.latestly.com/agency-news/world-news-67-yr-old-woman-stabbed-to-death-in-northern-israel-son-arrested-6912750.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607225539.jpg","video":null,"publish_date":"2025-06-08 00:44:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.358},{"id":329182302,"title":"Protesters and immigration authorities face off for a second day in LA area after arrests","text":"Tear gas and smoke filled the air on the southern outskirts of Los Angeles on Saturday as confrontations between immigration authorities and demonstrators extended into a second day and top Trump administration officials vowed to prosecute anyone who interferes with enforcement.Border Patrol personnel in riot gear and gas masks stood guard outside an industrial park in the city of Paramount, deploying tear gas as bystanders and protesters gathered on medians and across the street. Some jeered at officers while recording the events on smartphones.\"ICE out of Paramount. We see you for what you are,\" a woman said through a megaphone. \"You are not welcome here.\"One handheld sign read, \"No Human Being is Illegal.\"Smoke rose from burning shrubbery and refuse in the street, and demonstrators kicked at a Border Patrol vehicle. A boulevard was closed to traffic as Border Patrol agents circulated through the area.Homeland Security Secretary Kristi Noem posted a message on social media addressing \"LA rioters\" and warning that interference with immigration enforcement will not be tolerated.\"You will not stop us or slow us down,\" Noem said on the X platform. Immigration and Customs Enforcement \"will enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.\"Immigration and Customs Enforcement officers executed search warrants at multiple locations Friday, including outside a clothing warehouse in the fashion district. The action came after a judge found probable cause that the employer was using fictitious documents for some of its workers, according to representatives for Homeland Security Investigations and the U.S. Attorney's Office.A tense scene unfolded outside as a crowd tried to block agents from driving away.Advocates for immigrants' rights said there were also migration detentions outside Home Depot stores and a doughnut shop.DHS said in a statement that recent ICE operations in Los Angeles resulted in the arrest of 118 immigrants.Following the Friday arrests, protesters gathered in the evening outside a federal detention center, chanting, \"Set them free, let them stay!\"Some held signs with anti-ICE slogans, and some scrawled graffiti on the building.Among those arrested at the protests was David Huerta, regional president of the Service Employees International Union. Justice Department spokesperson Ciaran McEvoy confirmed that he was being held Saturday at the Metropolitan Detention Center in Los Angeles ahead of a scheduled Monday court appearance.It was not clear whether Huerta had legal representation.Democratic Senate Minority Leader Chuck Schumer called for his immediate release. In a social media post, he cited a \"disturbing pattern of arresting and detaining American citizens for exercising their right to free speech.\"The immigration arrests come as President Donald Trump and his administration push to fulfill promises of mass deportations across the country.Los Angeles Mayor Karen Bass said the activity was meant to \"sow terror\" in the nation's second-largest city.In a statement Saturday, ICE Acting Director Todd Lyons chided Bass for the city's response to the protests.\"Mayor Bass took the side of chaos and lawlessness over law enforcement,\" Lyons said. \"Make no mistake, ICE will continue to enforce our nation's immigration laws and arrest criminal illegal aliens.\"","summary":"Tear gas and smoke have filled the air on the southern outskirts of Los Angeles as confrontations between immigration authorities and demonstrators extended into a second day.","url":"https://www.scrippsnews.com/politics/immigration/protesters-and-immigration-authorities-face-off-for-a-second-day-in-la-area-after-arrests","image":"https://ewscripps.brightspotcdn.com/dims4/default/168fcad/2147483647/strip/true/crop/3812x2001+0+270/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F34%2Ff0%2Fb1f046d84231a733e4e7db33aaf5%2Fap25158717649103.jpg","video":null,"publish_date":"2025-06-08 00:41:35","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":0.085},{"id":329180268,"title":"World News | PM Netanyahu Condemns Vandalism at Supreme Court Amid Investigation","text":"Tel Aviv [Israel], June 8 (ANI/TPS): Prime Minister Benjamin Netanyahu issued a strong condemnation Saturday night following damage to a window at Israel's Supreme Court building in Jerusalem, discovered late Thursday night.\n\"I strongly condemn any sign of violence of any kind, certainly against representatives of the authorities,\" Netanyahu said. \"I call on public leaders and law enforcement to condemn and act firmly against all expressions of violence and incitement--without exception.\"\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nThe incident, which is under investigation by police and the Shin Bet, is believed to have been caused by an air gun or slingshot during a right-wing protest nearby.\nJudicial authorities described the attack as an \"unprecedented and troubling\" violation, while organizers of the protest accused the courts of attempting to delegitimize their movement. (ANI/TPS)\nAlso Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Benjamin Netanyahu issued a strong condemnation Saturday night following damage to a window at Israel's Supreme Court building in Jerusalem, discovered late Thursday night.","url":"https://www.latestly.com/agency-news/world-news-pm-netanyahu-condemns-vandalism-at-supreme-court-amid-investigation-6912746.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607225205.jpg","video":null,"publish_date":"2025-06-08 00:40:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.496},{"id":329180254,"title":"World News | Karachi: 32 Mild Tremors Recorded Since June 1, Says Chief Meteorologist","text":"Karachi [Pakistan], June 8 (ANI): The port city has been experiencing a series of mild earthquakes for over a week, with 32 tremors recorded since June 1, Geo News reported, citing Chief Meteorologist Amir Haider Laghari's statement.\nAccording to Chief Meteorologist Amir Haider Laghari, the earthquakes had magnitudes ranging from 1.5 to 3.6 on the Richter scale.\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nThe most recent tremor, recorded on Friday at 8:32 am, had a magnitude of 1.5. The earthquakes have been reported from various areas, including Quaidabad, Gadap, Malir, DHA, and Korangi. The depth of the tremors varied from 2 km to 188 km, as per Geo News.\nThe Pakistan Meteorological Department has confirmed the tremors, with the first recorded earthquake having a magnitude of 2.7 and a depth of 2 km, centered around 20 km south of the defense area. Also Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nMeanwhile, the second quake was at a depth of 8km and had an epicentre around 7km northwest of Malir.\nAccording to Geo News, explaining the reasons behind such continuous tremors, Laghari had earlier told Geo News that the Landhi Fault Line had become active after several decades and is currently going through a normalisation phase.\nHe had said that mild quakes may continue for up to a week due to the gradual release of energy, which helps prevent a major earthquake. The shallow depth of recent quakes makes them more noticeable.\nThe official advised that buildings on fault lines should withstand tremors up to magnitude 6.0. He also noted that the cracks reported in some houses are likely due to structural issues.\nAnother fault line near Thana Bula Khan is contributing to seismic activity.\nNotably, Pakistan is one of the most seismically active countries in the world, being crossed by several major faults. As a result, earthquakes in Pakistan often occur and are destructive.\nPakistan geologically overlaps both the Eurasian and Indian tectonic plates. Balochistan, the Federally Administered Tribal Areas, Khyber Pakhtunkhwa, and Gilgit-Baltistan provinces lie on the southern edge of the Eurasian plate on the Iranian Plateau. Sindh, Punjab, and Pakistan-occupied Jammu and Kashmir provinces lie on the northwestern edge of the Indian plate in South Asia.\nHowever, this region is prone to violent earthquakes, as the two tectonic plates collide. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The port city has been experiencing a series of mild earthquakes for over a week, with 32 tremors recorded since June 1, Geo News reported, citing Chief Meteorologist Amir Haider Laghari's statement.","url":"https://www.latestly.com/agency-news/world-news-karachi-32-mild-tremors-recorded-since-june-1-says-chief-meteorologist-6912744.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607222510.jpg","video":null,"publish_date":"2025-06-08 00:38:19","author":null,"language":"en","source_country":"in","sentiment":-0.277},{"id":329180276,"title":"World News | Russia Strikes Ukraine Again; Kharkiv Hit by Powerful Attack, Says Mayor","text":"Kharkiv [Ukraine], June 8 (ANI): At least five people were killed in a series of Russian attacks on Kharkiv, Ukraine's second-largest city, on Saturday. This comes after Moscow carried out a large-scale aerial assault on Ukraine the previous night, CNN reported.\nThe attacks on Kharkiv, which is located just 30 kilometers from the Russian border, were intense, with Mayor Igor Terekhov reporting \"at least 40 explosions\" in the early hours of Saturday.\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nThe recent wave of Russian attacks is believed to be retaliation for a drone operation by Ukraine that significantly damaged Russia's cruise missile carriers, as per CNN.\n\"Kharkiv is currently experiencing the most powerful attack since the start of the full-scale war,\" Terekhov said. \"The enemy is striking simultaneously with missiles, (drones) and guided aerial bombs. This is outright terror against peaceful Kharkiv.\"\nAlso Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nAccording to CNN, video released by emergency services showed a large fire burning in a multi-story apartment block in the Osnovyanskyi district in the city's southwest, where Terekhov said two people had died. One person was also killed in a strike that hit a house in the Kyivskyi district to the north, he said.\nAccording to Ukrainian officials, Russia resumed its assault on Saturday evening. It launched a fresh round of strikes using glide bombs, killing another two people and injuring at least 40 others.\nThose killed were a woman and a 62-year-old man, officials said. Two other victims of the attack are in intensive care in \"extremely serious condition,\" according to Oleh Syniehubov, the head of the Kharkiv region military administration.\nThe target of the second attack was a children's playground with a miniature railway, Terekhov said.\nUkraine's President Volodymyr Zelensky called the Saturday evening attack \"pure terrorism\" in a post on Telegram.\n\"Air bombs on civilians in the city - even a children's railway nearby. This makes no military sense. Pure terrorism,\" he said in the post. \"This cannot be ignored. We cannot turn a blind eye to this... Every day we lose our people just because Russia feels impunity. We need tough pressure on Russia to make peace.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  At least five people were killed in a series of Russian attacks on Kharkiv, Ukraine's second-largest city, on Saturday. This comes after Moscow carried out a large-scale aerial assault on Ukraine the previous night, CNN reported.","url":"https://www.latestly.com/agency-news/world-news-russia-strikes-ukraine-again-kharkiv-hit-by-powerful-attack-says-mayor-6912740.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607221311.jpg","video":null,"publish_date":"2025-06-08 00:34:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.183},{"id":329177082,"title":"Four Dead in Russian Attacks on Ukraine Amid Ongoing Retaliation for Kyiv’s Drone Strike","text":"Ukrainian authorities reported that at least four individuals lost their lives and over 24 were injured, including an infant and a teenager, when Russia unleashed a series of drone, missile, and bomb assaults in eastern Ukraine on Saturday. \n\nEarly Saturday morning saw Russia deploying 215 drones and missiles targeting Kharkiv, Ukraine’s second-largest city, resulting in the deaths of three people and injuries to more than 40, according to Ukrainian officials. \n\nLater in the day, Russia dropped bombs on Kharkiv’s city center, killing at least one more person and injuring five. \n\n“What the Russians want is the complete destruction of life,” Ukrainian President Volodymyr Zelenskyy said Saturday after the attacks. \n\nLast Sunday, Ukraine launched a surprise drone attack on Russian territory that destroyed 40 Russian planes, according to Kyiv. \n\nDuring his evening briefing, Zelenskyy mentioned that 117 drones were utilized in the attack. He alleged that the operation was directed from an office situated next to the local branch of the FSB, Russia’s intelligence organization.\n\nOn Friday, Russia launched another drone attack on six territories in Ukraine that killed six people, including a baby, and injured 80, according to Ukraine officials.\n\nThe attack came after President Donald Trump had a call with Russian President Vladimir Putin in which the Russian leader said he planned to retaliate. \n\nTrump responded to the attacks Friday, telling reporters on Air Force One, “Well, they gave Putin a reason to go in and bomb the hell out of them last night. … When I saw it, I said, ‘Here we go, now it’s going to be a strike.’”\n\nOn Thursday, Trump also compared the Russia-Ukraine war to children. \n\n“Sometimes you see two young children fighting like crazy. They hate each other, and they’re fighting in a park, and you try and pull them apart, they don’t want to be pulled,” Trump said in the Oval Office. “Sometimes you’re better off letting them fight for a while and then pulling them apart.”\n\nUkraine and Russia have so far held two rounds of peace talks with few tangible results.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEWYou can now listen to Fox News articles! Ukrainian authorities reported that&#8230;\n\n\nThis Post: Four Dead in Russian Attacks on Ukraine Amid Ongoing Retaliation for Kyiv&#8217;s Drone Strike first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/four-dead-in-russian-attacks-on-ukraine-amid-ongoing-retaliation-for-kyivs-drone-strike/","image":"https://internewscast.com/wp-content/uploads/2025/06/Four-killed-in-Russian-attacks-on-Ukraine-as-Moscow-continues.jpg","video":null,"publish_date":"2025-06-08 00:31:24","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.615},{"id":329177084,"title":"LA Protests Prompt National Guard Response Amid ‘Chaotic’ ICE Raids","text":"On Saturday local time, protesters gathered in Paramount, California. Assembly member JosÃ© Luis Solache said four people were arrested.\n\nThe FBI is investigating alleged instances of demonstrators obstructing immigration enforcement operations in Los Angeles Friday and Saturday, the bureau’s deputy director, Dan Bongino, said on social media Saturday.\n\nPolice detain a protester blocking the garage entrance of the Los Angeles Federal Building, following multiple detentions by Immigration and Customs Enforcement, in downtown Los Angeles on Friday. (Daniel Cole/Reuters via CNN)\n\nUS President Donald Trump’s “border czar” Tom Homan told Fox News the National Guard would be deployed to Los Angeles County.ï»¿\n\n“American people, this is about enforcing the law, and again, we’re not going to apologise for doing it,” Homan said.\n\nThe Department of Justice criticised California officials as protests over federal immigration enforcement operations entered a second day Saturday.\n\n“The violent targeting of law enforcement in Los Angeles by lawless rioters is despicable and Mayor Bass and Governor Newsom must call for it to end. The men and women of ICE put their lives on the line to protect and defend the lives of American citizens,” stated Assistant Secretary Tricia McLaughlin in a statement on Saturday.\n\nDepartment of Homeland Security Secretary Kristi Noem shared a “message to the LA rioters” via social media on Saturday. “You will not stop us or slow us down,” she asserted. “@ICEgov will continue to enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.”\n\nLos Angeles Police Department officers move to disperse a protest. (Jae C Hong/AP via CNN)\n\nThe Los Angeles County Sheriff’s Department said it was not involved in immigration enforcement and was working to ensure the safety of the public.\n\n“The Sheriff’s Department was not involved in any federal law enforcement operations or actions and responded solely for traffic and crowd control management,” said the LASD in a statement.\n\nThe protests started on Friday afternoon. Police on Friday night issued a citywide tactical alert nearly two hours after declaring protests across the downtown area unlawful assemblies. “The use of less lethal munitions has been authorised by the Incident Commander,” LAPD’s Central Division wrote in a post on X.\n\nVideos of the scene show law enforcement officers in riot gear, wielding batons, holding shields and throwing smoke bombs into the crowd. Protesters chanted “Free them all” and held signs with messages including “Full Rights for All Immigrants” and “Stop the Deportations.” Video shows several officers in riot gear pinning at least one person to the ground.\n\nThe protest came after at least 44 people were arrested by federal immigration agents earlier in the day, The Associated Press reported, after Immigration and Customs Enforcement officers executed search warrants at three locations, according to a spokesperson for Homeland Security Investigations. The arrests come amid President Donald Trump’s crackdown on immigration, which has involved waves of raids and deportations across the country.\n\nProtesters push a garbage cart as they try to block the garage entrance of the Los Angeles Federal Building. (Daniel Cole/Reuters via CNN)\n\nLos Angeles Mayor Karen Bass characterised the immigration arrests as “mass chaos,” according to CNN affiliate KABC. The mayor said she hadn’t been told about the raids in advance. “It sows a sense of terror throughout the community,” she said. “ICE was literally chasing people down the street.”\n\nThe federal law enforcement activity came on the same day multiple sources told CNN the Trump administration is preparing for “large-scale” cancellation of federal funds for California.\n\nCNN has reached out to DHS for further information.\n\nOne of the Friday raids was in the city’s Fashion District, where agents served a search warrant after a judge determined a business was allegedly using fictitious documents for some of its workers, US Attorney’s office spokesperson Ciaran McEvoy told CNN.\n\nProtesters hold placards as they gather around the Los Angeles Federal Building. (Daniel Cole/Reuters via CNN)\n\nDavid Huerta, the president of the Service Employees International Union California, was arrested by federal agents after allegedly attempting to obstruct their access at a worksite, US Attorney for the Central District of California Bill Essayli said in a post on X.\n\n“Let me be clear: I don’t care who you are â if you impede federal agents, you will be arrested and prosecuted,” Essayli said.\n\nAfter being treated for injuries from his arrest, Huerta released a statement condemning the citywide raids.\n\n“Hard-working people, and members of our family and our community, are being treated like criminals,” he said.\n\nPolice stand guard around the Los Angeles Federal Building during a clash with protesters. (Daniel Cole/Reuters via CNN)\n\n“We all collectively have to object to this madness because this is not justice. This is injustice. And we all have to stand on the right side of justice.”\n\n“No one should ever be harmed for witnessing government action,” California Governor Gavin Newsom said in a statement responding to Huerta’s arrest, describing the union president as a “respected leader, a patriot and an advocate for working people.”\n\nBass said Friday’s immigration arrests were different from previous, more organised actions.\n\nMan planning to live to 100 dies during TV interview\n\n“I’ve been really worried about this from the beginning, and as far as I know, this is the first time this has happened in our city like this,” she told KABC. “We know ICE has been here, but it’s been for targeted arrests; this was just mass chaos.\n\n“It sows a sense of chaos in our city, and a sense of terror, and it’s just unacceptable.”\n\nThe American Civil Liberties Union called on “elected officials to uphold their commitment to all Angelenos â immigrants and non-immigrants alike â by taking all action necessary to grind this oppressive and vile paramilitary operation to a halt and keep our city safe and whole” in a Friday statement.\n\nProtesters face off with police\n\nProtesters gathered outside the Federal Building in downtown Los Angeles at roughly 4pm Friday (9am Saturday AEST) , CNN affiliate KABC reported. At one point, hundreds of activists began marching toward a detention facility on Temple Street.\n\nOne video obtained by CNN shows protesters retreating from the building’s entrance after coming face-to-face with the police guarding it. Several projectiles are thrown at officers equipped with body armor and protective shields.\n\nOther videos show the detention centre sprayed with anti-ICE graffiti, with some protesters blocking LAPD vehicles close by.\n\nFamilies and friends who had loved ones taken by immigration authorities visited the detention centre to learn more about their status, KABC reported.\n\nA young woman who spoke with the outlet said she went to the building in tears after her father was taken by federal agents.\n\nThe LAPD declared an unlawful assembly around 7pm and warned demonstrators were subject to arrest if they remained in the area.\n\nAerial footage from KABC shows law enforcement throwing smoke bombs on a street to disperse people so they could make way for SUVs and military-style vehicles.\n\n“While the LAPD will continue to have a visible presence in all our communities to ensure public safety, we will not assist or participate in any sort of mass deportations, nor will the LAPD try to determine an individual’s immigration status,” Police Chief Jim McDonnell said in a statement about the immigration enforcement activities.\n\n“I want everyone, including our immigrant community, to feel safe calling the police in their time of need and know that the LAPD will be there for you without regard to one’s immigration status.”\n\nNewsom said in a Saturday statement, “Continued chaotic federal sweeps, across California, to meet an arbitrary arrest quota are as reckless as they are cruel.”\n\n“Donald Trump’s chaos is eroding trust, tearing families apart, and undermining the workers and industries that power America’s economy,” the governor said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn Saturday local time, protesters gathered in Paramount, California. Assembly member JosÃ©&#8230;\n\n\nThis Post: LA Protests Prompt National Guard Response Amid &#8216;Chaotic&#8217; ICE Raids first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/la-protests-prompt-national-guard-response-amid-chaotic-ice-raids/","image":"https://internewscast.com/wp-content/uploads/2025/06/National-Guard-to-respond-to-LA-protests-over-039chaotic039-ICE.au2Ffs2F9d44d4cd-9a54-494c-ba47-9f3b50b8784f.jpeg","video":null,"publish_date":"2025-06-08 00:31:21","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.297},{"id":329180280,"title":"World News | Russia-Ukraine Planned Exchange of Prisoners Turns into Dispute","text":"Moscow [Russia], June 8 (ANI): A planned exchange of prisoners of war between Russia and Ukraine did not happen on Saturday due to disagreements between the two sides, CNN reported.\nRussia claimed that Ukraine postponed the exchange at the last minute, while Ukraine denied this, saying that a date for the exchange of prisoners and bodies of dead soldiers had not been finalised.\nAlso Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term.\nUkraine described Russia's claims about the failed exchange as \"dirty games.\"\nAccording to Russia, over 1,200 frozen Ukrainian bodies were left waiting in refrigerated trucks at an exchange point. Also Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program.\nHowever, Ukraine stated that the two sides had agreed to exchange seriously wounded and young troops, but a specific date had not been set for the repatriation of soldiers' bodies, as per CNN.\nDespite the failed exchange, Russia and Ukraine agreed to hold another prisoner swap this weekend during peace talks in Istanbul. Vladimir Medinsky, head of Russia's delegation, said that this exchange would be the largest since the war began.\n\"In strict accordance with the Istanbul agreements, the Russian side began a humanitarian operation to transfer more than 6,000 bodies of killed Ukrainian servicemen,\" as well as badly wounded soldiers under the age of 25, Medinsky said Saturday afternoon on Telegram.\nHe claimed that 1,212 bodies of killed Ukrainian soldiers were at the exchange point, with the rest \"on their way.\"\nHe also said that Russia gave Ukraine the first list of 640 prisoners of war for exchange, listed as \"wounded, seriously ill and young people,\" in order to start the swap.\nIn a video posted by Russia's Defence Ministry on Telegram, two men wearing hazmat suits are seen opening the doors to the back of a truck parked on the side of a road. Inside the truck were dozens of sealed white bags, which the ministry said contained the bodies of Ukrainian soldiers.\nMedinsky said Russia's Defense Ministry contact group was waiting at the border with Ukraine, but alleged that Kyiv had \"unexpectedly postponed the transfer of bodies and the exchange of prisoners of war for an indefinite period\" and had given \"pretty weird reasons\" for doing so.\nUkraine swiftly rejected the accusations, saying Medinsky's claims \"do not correspond to reality.\" It said the exchange of prisoners of war and soldiers' bodies were separate processes.\n\"Unfortunately, instead of constructive dialogue, we are again faced with manipulations and attempts to use sensitive humanitarian issues for informational purposes,\" Ukraine's Coordination Headquarters for the Treatment of Prisoners of War wrote on Telegram.\n\"We call on the Russian side to stop playing dirty games,\" it added.\nUkraine's Defence Ministry said Russia was creating \"artificial obstacles\" and making \"false statements\" to obstruct the exchange of living prisoners, reneging on what had been agreed in Istanbul. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A planned exchange of prisoners of war between Russia and Ukraine did not happen on Saturday due to disagreements between the two sides.","url":"https://www.latestly.com/agency-news/world-news-russia-ukraine-planned-exchange-of-prisoners-turns-into-dispute-6912736.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/ANI-20250607210715.jpg","video":null,"publish_date":"2025-06-08 00:30:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.632},{"id":329176848,"title":"How radical California mayor's ingenious move to 'purge' homeless puts liberal hellholes to shame","text":"I don't know how many homeless centers you've been in, but this is the first one that doesn't stink,' Mayor Rex Parris bragged of his Southern California city's modern approach to homeless housing.\n\nParris, 73, the outspoken Republican leader of Lancaster in northern Los Angeles County, has given the Daily Mail a tour of his city's 14-acre 'campus' for the homeless on the edge of the Mojave Desert.\n\nEarlier this year the firebrand mayor called for a 'purge' of homeless people, blasting them as 'predators' and 'a dangerous blight on all of our lives.'\n\nHe also suggested a free giveaway of deadly fentanyl for drug addicts to clear them from the streets, and expressed his desire to employ armed drones to combat crime in his city of nearly 170,000. \n\nToday, Parris, who himself is a former drug addict, is happy to show off the jewel of his city's homeless services: a state-of-the art complex with more than 300 units. \n\nThe $59 million Kensington Campus in Antelope Valley opened in 2020 with 150 permanent housing units and 153 temporary housing beds. It feeds residents three meals a day and offers free counseling, psychiatry and job training. There's also a kennel for their pets.\n\nHousing each resident costs $11,500 per year and the complex is 'maintained by the people living here,' according to Parris. \n\nIt also seems that nobody wants to leave. Residents rave about everything from staff support to the quality of the food, and the center was recently near capacity.\n\nThe campus' success stands in stark contrast to deep-blue California's major cities, which have been struggling with a persistent homelessness crisis.\n\nKensington boasts a 2-percent eviction rate compared with between 10 and 20 percent at similar facilities, according to Deputy Mayor Heather Varden, who called it a place where 'individuals can transition from crisis to independence.'\n\n'People behave [here],' Parris said. 'They don't want to get kicked out.'\n\nParris, a trial attorney who has served as mayor since 2008, said of the campus: 'If I did nothing else, it would have been a life well lived.'\n\nLancaster sits at the end of the Metrolink commuter line, 70 miles north of downtown Los Angeles' Union Station. \n\nCelebrities including Kristen Wiig, Frank Zappa, Judy Garland and John Wayne grew up in the city, where tumbleweeds bounce along the high-desert terrain.\n\nIncorporated in 1977, the 96-square-mile community has a hopeful motto: 'Creating a better tomorrow. Together.'\n\nOf the 250,000 people experiencing homelessness in the Golden State, 48,000 live in LA County and about 2,000 in Lancaster itself.\n\nRoughly 20 homeless people arrive via Metrolink trains daily into Lancaster, said City Manager Trolis Niebla.\n\nHe told the Daily Mail there were initial complaints from locals when Kensington opened because the facility was housing some homeless people from out of town.\n\n'It was shortly after Kensington came online, but we spoke with the county and stopped that,' he said. 'This particular location was intended to be for our local residents only.'\n\nHomelessness numbers were lower in Lancaster until about 2015, but the city saw a gradual increase over the years before rates 'spiked' during Covid.\n\nSituated on the other side of the City of Angels by a stretch of mountains, Lancaster is the 'forgotten land of the county,' Niebla noted.\n\nHe said that LA County collects $14 million in tax revenue from Lancaster under Measure A, an initiative that brings in money from sales taxes to help with homelessness. But Lancaster gets back only $2.5 million from that fund.\n\n'We don't get our fair share up here,' he said. 'We're underfunded, but it makes us more resilient.'\n\nLast year city workers removed a staggering 550 tons of trash and waste from homeless encampments across the city, with 30 tons hauled from a single site in November. \n\nNiebla believes that 'nine out of 10' homeless people are 'not interested in hearing about services that could help because they want to be out there with their dogs, with their freedom and with their drugs.' \n\nThe US Interagency Council on Homelessness reports that between 40 and 60 percent of homeless Americans have jobs but cannot afford homes. The council also attributes high rates of outdoor living to restrictions and discriminatory policies at some shelters, such as limiting admittance to people who are sober or without criminal records.\n\nIn February, Parris controversially told attendees at a city council meeting that those who are both homeless and addicted to drugs should be given 'all the fentanyl they want,' leading to death threats against the mayor.\n\nHe insisted to the Daily Mail that the comment was merely 'a metaphor' and 'you'd have to be an idiot to think I was serious.'\n\nHe also suggested a 'purge' of the homeless at the same meeting, later clarifying: 'Yes, I want to purge them from our community. But no, I don't want to kill them.'\n\nHe nonetheless defends his abrasive stance. \n\n'There's nobody here that I haven't had a similar experience to,' said Parris, who was raised in Lancaster by his mother, dropped out of high school and is 40 years sober. 'Maybe that's why I'm not a sympathetic person.'\n\nInside the Kensington campus\n\nAccommodation at Kensington is a mixture of small cubicles in dorms for temporary residents, and 650-square-foot, one-bedroom, furnished apartments for longer-term residents.\n\nThe cubicles do not have doors, to comply with fire regulations, and each features a single bed, a shelf for personal belongings and a clothing rack. \n\nAlex Jones, 39, told the Daily Mail that he was living in his car before moving into a dorm in August 2023.\n\nHe described Kensington as an 'opportunity to have your own place' and hopes to move into a long-term apartment.\n\nThe former forklift driver said he lost his job at Ikea after getting injured and then became homeless amid a romantic breakup.\n\n'It was pretty decent until I hurt myself,' he said of the job, 'and then they kind of laid me off.'\n\nWilliam Deoacamara, 25, told the Daily Mail he had been staying at Kensington for two weeks after living in a trailer in the desert with no running water or regular electricity.\n\nThere were solar panels, he said, 'but it was only enough for my refrigerator.' \n\nDeoacamara previously worked with his uncle installing cables for security cameras, internet and TV, but 'we didn't get along.'\n\n'I didn't know how to love my family,' he said. 'I would get upset.\n\n'But nowadays I don't get upset, because I learn how to love my family.'\n\nJose Romero, 57, was a successful jockey in California and New York who won $5 million for horse owners until he developed an alcohol addiction.\n\n'I wouldn't wish alcoholism on anyone,' he told the Daily Mail, saying his previous sober living facilities cost $1,000 a month. \n\n'It could happen to anybody - lawyers, doctors.'\n\nToday, with help from Kensington staff, he is getting back on his feet and has found work as a security guard.\n\n'The food is excellent here and they treat us with a lot of respect,' Romero said.\n\nClearing encampments \n\nAndrew Noga heads up the the department clearing the city's homeless encampments, which has a $3.5 million annual budget.\n\nHe has lived in Lancaster since 1976. 'It was a beautiful little town, a little farm town, nice and clean,' he told the Daily Mail.\n\nNoga said that during his time on the job, he has seen underground 'shanties' and 'apartments' built in drainage tunnels, using electricity 'jumped' from street lights.\n\nOne setup featured a microwave oven, a radio, power tools and a toilet.\n\nNoga said his crews give occupants a seven-day warning before moving in on a site.\n\nWhile surveying one site, Noga pointed out a man and woman living on a patch of unshaded shrubland with three pit bulls. His team had ordered them to move within a week.\n\nThe woman declined to speak about her living situation, saying: 'That's my business.' Noga predicted it would take his team a day to remove the camp and fill in the holes left behind.\n\n'It's tough because you do feel the humanity,' Noga said. 'Most of them don't want us to help. They don't want to help themselves.'\n\nNiebla said the city aims to provide necessary services, including medical help and skills training, to the homeless, but not at the expense of the city's other residents.\n\n'If you don't want any of our help, then you need to move on to another location or another city,' he said. \n\n'But if you're local and you want our help, we have robust programs.' \n\nThose programs include inpatient and outpatient behavioral health and substance abuse treatments, 'living skills enhancement' to help individuals maintain sobriety, free job training, legal assistance and medical clinics.\n\nMeanwhile, city officials said they will make sure Los Angeles does not export their homeless to Lancaster amid predicted clean-ups ahead of the 2026 World Cup, 2027 Super Bowl and 2028 Olympics.\n\n'We'll take care of our challenges. You take care of yours,' Parris said.\n\n'I've already told [LA Mayor Karen Bass], we are not the solution to your homeless problem.'\n\nPolicing with drones\n\nTwo years ago the city introduced a new police department to 'augment' the LA County Sheriff's Department, calling it 'hybrid policing.'\n\nParris said that rival gangs like the infamous Bloods and Crips have teamed up to commit crimes in Lancaster, making law enforcement 'more challenging.'\n\nPolice Chief Rodrick Armalin said the city also faces problems with the Armenian mafia and Chinese gangs, as well as illegal marijuana growing in residential homes.\n\nParris said he wants to combat lawlessness with remote-operated drones hovering over the city. \n\nLancaster is investing in a fleet of advanced 'first responder' drones that Armalin said will be stationed at key locations around the city.\n\nWith the assistance of AI for navigation, they will hover over a crime scene and gather real-time intelligence, which will then be shared with responding officers via their cell phones.\n\nThe drones will be linked to the city's active 'shot spotter system,' launching and deploying at the sound of gunfire. They will also respond to license plate reader cameras searching for stolen vehicles, among other capabilities, Armalin said.\n\nHe called the drones 'excellent for de-escalation' and 'the wave of the future.' \n\n'We're going all in on them,' he said.\n\nMeeting the president \n\nIn speaking with the Daily Mail, Parris could not resist sharing his glowing admiration for President Donald Trump.\n\n‘People are in an uproar about Trump, but the one thing you have got to say about Trump: He sees a solution and he does not care what people think of it,' Parris said. 'If it is a viable solution, he goes for it.’\n\nIn 2020 he met Trump as he got off Air Force One in Los Angeles. 'It was an amazing experience for me, the mayor said. 'The Trump you see face-to-face is not the Trump you see on television. Totally different.'\n\nParris said the president was 'totally focused on me' during their three minutes together.\n\n‘I tell people: Don't pay attention to what Trump says,' the mayor added. 'Pay attention to what he does.","summary":"Mayor Rex Parris, 73, is an outspoken Republican and former drug addict who once said the homeless should get free fentanyl, is winning over critics with a radical new policy.","url":"https://www.dailymail.co.uk/news/article-14658007/lancaster-california-mayor-parris-homeless-purge-fentanyl.html","image":"https://i.dailymail.co.uk/1s/2025/06/06/18/97807507-0-A_homeless_man_stands_amid_a_collection_of_debris_in_an_illegal_-a-17_1749231246446.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/04/29/7570496534715974957/1024x576_MP4_7570496534715974957.mp4","publish_date":"2025-06-08 00:27:05","author":"David Thompson,Editor","authors":["David Thompson","Editor"],"language":"en","source_country":"gb","sentiment":0.24},{"id":329175602,"title":"Kyodo News Digest: June 8, 2025","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nBRUSSELS - Japan and the European Union are preparing to launch an \"alliance\" framework to beef up their companies' competitiveness by promoting trade and economic security cooperation, diplomatic sources said Saturday, facing concerns over U.S. President Donald Trump's tariffs and Chinese trade practices.\n\nThe creation of the \"Japan-EU Competitiveness Alliance\" is expected to be announced at a regular summit meeting being arranged for July, when Japanese Prime Minister Shigeru Ishiba is likely to host European Council President Antonio Costa and European Commission President Ursula von der Leyen, they said.\n\nTOKYO - A lawmaker of Japan's main opposition party said Saturday that government rice reserves recently put on sale are mostly consumed by chickens, doubling down on remarks that could be perceived as insensitive to people who have snapped up the old rice due to cheaper prices.\n\nKazuhiro Haraguchi of the Constitutional Democratic Party of Japan made the remarks at a gathering in southwestern Japan to shore up support ahead of the upper house election, even after Yuichiro Tamaki, leader of another opposition party, apologized a week ago for likening the stockpiles to \"animal feed.\"\n\nPARIS - Japan's Tokito Oda won his third consecutive French Open wheelchair tennis singles title Saturday, defeating Britain's Alfie Hewett 6-4, 7-6(6).\n\nEarlier in the day, Japanese compatriot Yui Kamiji claimed her fifth wheelchair singles title and first in five years with a 6-2, 6-2 victory over Aniek van Koot of the Netherlands.\n\nWASHINGTON - Japan and the United States have \"yet to find common ground\" on tariff issues, Tokyo's top negotiator said Friday, indicating that there remain many differences between the sides, but they still aim to clinch a win-win deal in mid-June.\n\nAfter holding talks with U.S. Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick in Washington, Ryosei Akazawa told reporters that he believes \"further progress\" was made.\n\nTOKYO - Over half of large-scale rice producers feel that store prices for rice are \"too high,\" a recent survey conducted by an association of agricultural corporations showed, indicating that many of them share concerns with consumers about the elevated cost of the staple food in Japan.\n\nAs households increasingly complain about rice prices that have doubled over the past year, more than 40 percent of respondents worried that consumers may start shunning the product.\n\nNew South Korea President Lee to make diplomatic debut at G7 summit\n\nSEOUL - Newly elected South Korean President Lee Jae Myung has accepted an invitation to the upcoming Group of Seven summit taking place in Canada later this month, the presidential office said Saturday.\n\nLee's attendance at the G7 meeting, to be held over three days from June 15 in Alberta, Canada, will mark his debut on the diplomatic stage. He took office on Wednesday following his victory in the country's 21st presidential election.\n\nVideo: Parade at Hyakumangoku Festival in Ishikawa Prefecture","summary":"Women dressed in kimono dance at the Hyakumangoku Festival in Kanazawa, Ishikawa Prefectu...","url":"https://english.kyodonews.net/news/2025/06/11c15b50c98d-kyodo-news-digest-june-8-2025.html","image":"https://img.kyodonews.net/english/public/images/posts/12a42a167358aae3f373bf1bac1b4175/image_l.jpg","video":null,"publish_date":"2025-06-08 00:21:38","author":null,"language":"en","source_country":"jp","sentiment":0.116},{"id":329178728,"title":"Kemenangan ini untuk rakyat Amerika seperti saya - Gauff","text":"PARIS: Juara baharu Terbuka Perancis, Coco Gauff, yang menjadi pemain Amerika Syarikat (AS) berkulit hitam pertama memenangi gelaran itu dalam sedekad, berkata kemenangan di Paris adalah untuk rakyat negaranya yang kelihatan sepertinya dan tertekan di tanah air sendiri.\n\nGauff bangkit daripada kekalahan di set pertama untuk menewaskan Aryna Sabalenka 6-7(5) 6-2 6-4 dan menjulang mahkota Terbuka Perancis pertamanya, serta gelaran Grand Slam kedua dirinya selepas Terbuka AS 2023.\n\nDia adalah pemain berkulit hitam AS pertama memenangi Terbuka Perancis sejak kemenangan Serena Williams pada tahun 2015.\n\n\"Ia sangat bermakna (memenangi gelaran Terbuka Perancis), dan jelas sekali banyak yang sedang berlaku di negara kami sekarang, saya pasti anda tahu.\n\n\"Tetapi dapat menjadi wakil kepada mereka yang kelihatan seperti saya di Amerika, yang mungkin rasa tidak mendapat sokongan ketika ini, ia seperti memberikan harapan dan sinar buat mereka,\" kata Gauff.\n\nSituasi politik di AS bergolak selepas Donald Trump kembali menjadi presiden negara itu tahun lalu.\n\n\"Saya masih ingat selepas pilihanraya, ia tempoh yang suram dan ibu saya berkata ketika di Riyadh (November 2024), 'hanya cuba menang kejohanan, berikan sesuatu untuk mereka senyum'.\n\n\"Jadi itu apa yang saya fikirkan hari ini. Melihat bendera dikibar penonton amat bermakna. Saya seorang yang patriotik dan bangga menjadi rakyat Amerika, saya bangga dapat mewakili warga Amerika yang kelihatan seperti saya dan orang yang menyokong perkara yang saya sokong,\" katanya. - REUTERS","summary":"PARIS: Juara baharu Terbuka Perancis, Coco Gauff, yang menjadi pemain Amerika Syarikat (AS) berkulit hitam pertama memenangi gelaran itu dalam sedekad, berkata kemenangan di Paris adalah untuk rakyat negaranya yang kelihatan sepertinya dan tertekan di tanah air sendiri.","url":"https://www.bharian.com.my/sukan/raket/2025/06/1405627/kemenangan-ini-untuk-rakyat-amerika-seperti-saya-gauff","image":"https://assets.bharian.com.my/images/articles/coco8625_BHfield_image_listing_featured.var_1749342028.jpg","video":null,"publish_date":"2025-06-08 00:20:35","author":null,"language":"en","source_country":"my","sentiment":0.583},{"id":329176802,"title":"Trump's Pardon Spree May Not Be Over Yet: What to Know","text":"President Donald Trump has continued to issue pardons months into his second administration, building on the hundreds of clemencies granted since he returned to office, including political allies, business figures, and high-profile celebrities.The White House announced a second round of pardons in late May, and some of the names included have given rise to concerns of lobbying around Trump to gain favor and obtain a pardon.Why It MattersUpon retaking office in January, Trump issued a spate of pardons, even vacating charges against some 1,500 individuals charged with offenses related to the January 6, 2021, riot at the U.S. Capitol—including those convicted of violent acts.The scale and nature of Trump's second-term pardons mark a significant shift in the use of presidential pardon, with many concerned that it is being used a political tool.What To KnowTrump issued several pardons between May 26 and 28, some of which were not announced but merely confirmed via reporting as outlets queried the White House on specific cases. These include:\nScott Jenkins, the former sheriff of Culpeper County, Virginia, who was convicted of accepting more than $75,000 in bribes in exchange for appointing individuals as auxiliary deputies. Jenkins had been sentenced to 10 years in federal prison in 2024. Trump criticized the prosecution as politically motivated and said Jenkins was the \"victim of an overzealous\" Justice Department under former President Joe Biden.\nTodd and Julie Chrisley, reality TV stars convicted in 2022 of several counts of fraud and tax evasion involving over $30 million. Todd was serving a 12-year sentence, and Julie was serving seven years. Their daughter, Savannah, a vocal Trump supporter, had lobbied for their release and received the news of their pardon in a phone call from the president.\n\nKentrell DeSean Gaulden, known as NBA YoungBoy, was cleared by pardon of a gun charge in Utah last year that landed him in prison, but he will now walk free in July thanks to Trump. In a statement posted to social media, the rapper thanked Trump's \"Pardon Czar,\" Alice Johnson and said, \"I want to thank President Trump for granting me a pardon and giving me the opportunity to keep building - as a man, as a father, and as an artist. This moment means a lot. It opens the door to a future I've worked hard for and I am fully prepared to step into this.\"\nFormer Representative Michael Grimm, a New York Republican who stepped down from office following a conviction for tax fraud, received a pardon on May 28, as confirmed by a White House official speaking anonymously as no formal announcement had been made at the time.\n- Grimm was reelected in 2014 even while facing a federal indictment for underreporting wages and revenue at a health food restaurant he owned. He later pleaded guilty to the charges, resigned in early 2015, and served an eight-month prison sentence.\n- In 2018, Grimm attempted a political comeback but failed to reclaim his seat. More recently, in a tragic turn of events, he was left paralyzed from the chest down after being thrown from a horse during a polo tournament last year.\nOthers: Additional commutations and pardons included Hunter Biden associate Jason Galanis, Ozy Media founder Carlos Watson, and former Arkansas state Senator Jeremy Hutchinson, according to CBS News.\nPossible Pardons: Who Could Be Next?\nTrump has said he may \"take a look\" at pardoning individuals convicted of plots against public officials, including two men convicted of plotting to kidnap Michigan Governor Gretchen Whitmer. The governor has expressed disappointment about these reports, particularly given that she has made great efforts to improve her working relationship with Trump.\nTrump is also considering pardons for high-profile political adversaries, including former Illinois House Speaker Michael Madigan, convicted of corruption and awaiting sentencing. No formal request from Madigan has been filed as of June, according to the Chicago Sun-Times.\nMost recently, reports have circulated that Trump may even consider a pardon for Sean \"Diddy\" Combs, who is on trial for a laundry-list of charges, including sex trafficking, racketeering conspiracy and transportation to engage in prostitution.\nHowever, when asked by Fox News' Peter Doocy if he would pardon Diddy, the president responded in part: \"Well, nobody's asked. You had to be the one to ask, Peter. I know people are thinking about it. First of all, I'd look at what's happening. I haven't spoken to him in years. He really liked me a lot.\"What People Are SayingLance Wilson, director of communications and policy for the Anti Police-Terror Project, posted on X, formerly Twitter, on May 27: \"The Chrisleys defrauded banks out of $36 million—and they're walking away after serving just a fraction of their time. Meanwhile, there are Black folks serving life for stealing a pack of gum. That's not justice. That's white privilege—and exactly who Trump protects.\"Conservative commentator George Behizy posted on X on May 28: \"I'm not necessarily supportive of pardoning thugs like YoungBoy, but he should now live like a normal, law-abiding human. His music should be wholesome. No more rapping about 'ops' and 'gangs.'\"In a separate post, Behizy wrote on May 28: \"We don't have to pardon rappers and gang leaders. We can pardon real heroes who deserve it. Pardon [Edward] Snowden. Pardon [Julian] Assange.\"Democratic Michigan Attorney General Dana Nessel recently told The Detroit News: \"When you take somebody who is clearly guilty of an offense, who shows no remorse of any kind, who does not demonstrate that they have been rehabilitated and, for political reasons, to either commute their sentence or to pardon them is the type of thing that really impacts of the morale of any prosecutor's office.\"What Happens Next?The Office of the Pardon Attorney and the White House continue to process thousands of applications, with the possibility of further high-profile pardons under active review.","summary":"Trump has pardoned hundreds of people, largely due to a widespread pardon for over 1,500 individuals charged in relation to the January 6, 2021, Capitol riot.","url":"https://www.newsweek.com/donald-trump-pardon-spree-ongoing-new-appeals-2082320","image":"https://d.newsweek.com/en/full/2658821/donald-trump-presidential-pardon-spree.jpg","video":null,"publish_date":"2025-06-08 00:14:44","author":"Alia Shoaib,Peter Aitken","authors":["Alia Shoaib","Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.064},{"id":329179526,"title":"Trump says Elon Musk could face ‘serious consequences’ if he backs Democratic candidates","text":"BRIDGEWATER, N.J. (AP) — President Donald Trump is not backing off his battle with Elon Musk, saying Saturday that he has no desire to repair their relationship and warning that his former ally and campaign benefactor could face “serious consequences” if he tries to help Democrats in upcoming elections.\n\nTrump told NBC’s Kristen Welker in a phone interview that he has no plans to make up with Musk. Asked specifically if he thought his relationship with the mega-billionaire CEO of Tesla and SpaceX is over, Trump responded, “I would assume so, yeah.”\n\n“I’m too busy doing other things,” Trump continued. “You know, I won an election in a landslide. I gave him a lot of breaks, long before this happened, I gave him breaks in my first administration, and saved his life in my first administration, I have no intention of speaking to him.”\n\nThe president also issued a warning amid chatter that Musk could back Democratic lawmakers and candidates in the 2026 midterm elections.\n\n“If he does, he’ll have to pay the consequences for that,” Trump told NBC, though he declined to share what those consequences would be. Musk’s businesses have many lucrative federal contracts.\n\nThe president’s latest comments suggest Musk is moving from close ally to a potential new target for Trump, who has aggressively wielded the powers of his office to crack down on critics and punish perceived enemies. As a major government contractor, Musk’s businesses could be particularly vulnerable to retribution. Trump has already threatened to cut Musk’s contracts, calling it an easy way to save money.\n\nThe dramatic rupture between the president and the world’s richest man began this week with Musk’s public criticism of Trump’s “big beautiful bill” pending on Capitol Hill. Musk has warned that the bill will increase the federal deficit and called it a “disgusting abomination.”\n\nTrump criticized Musk in the Oval Office, and before long, he and Musk began trading bitterly personal attacks on social media, sending the White House and GOP congressional leaders scrambling to assess the fallout.\n\nAs the back-and-forth intensified, Musk suggested Trump should be impeached and claimed without evidence that the government was concealing information about the president’s association with infamous pedophile Jeffrey Epstein. Musk appeared by Saturday morning to have deleted his posts about Epstein.\n\nVice President JD Vance in an interview tried to downplay the feud. He said Musk was making a “huge mistake” going after Trump, but called him an “emotional guy” getting frustrated.\n\n“I hope that eventually Elon comes back into the fold. Maybe that’s not possible now because he’s gone so nuclear,” Vance said.\n\nVance called Musk an “incredible entrepreneur,” and said that Musk’s Department of Government Efficiency, which sought to cut government spending and laid off or pushed out thousands of workers, was “really good.”\n\nVance made the comments in an interview with “ manosphere” comedian Theo Von, who last month joked about snorting drugs off a mixed-race baby and the sexuality of men in the U.S. Navy when he opened for Trump at a military base in Qatar.\n\nThe Vance interview was taped Thursday as Musk’s posts were unfurling on X, the social media network the billionaire owns.\n\nDuring the interview, Von showed the vice president Musk’s claim that Trump’s administration hasn’t released all the records related to Epstein because Trump is mentioned in them.\n\nVance responded to that, saying, “Absolutely not. Donald Trump didn’t do anything wrong with Jeffrey Epstein.”\n\n“This stuff is just not helpful,” Vance said in response to another post shared by Musk calling for Trump to be impeached and replaced with Vance.\n\n“It’s totally insane. The president is doing a good job.”\n\nVance also defended the bill that has drawn Musk’s ire, and said its central goal was not to cut spending but to extend the 2017 tax cuts approved in Trump’s first term.\n\nThe bill would slash spending and taxes but also leave some 10.9 million more people without health insurance and spike deficits by $2.4 trillion over the decade, according to the nonpartisan Congressional Budget Office.\n\n“It’s a good bill,” Vance said. “It’s not a perfect bill.”\n\nThe interview was taped in Nashville at a restaurant owned by musician Kid Rock, a Trump ally.","summary":"BRIDGEWATER, N.J. (AP) — President Donald Trump is not backing off his battle with Elon [...]","url":"https://www.thezimbabwemail.com/world-news/trump-says-elon-musk-could-face-serious-consequences-if-he-backs-democratic-candidates/","image":"https://www.thezimbabwemail.com/wp-content/uploads/2025/06/Trump.jpg","video":null,"publish_date":"2025-06-08 00:13:52","author":"Staff Reporter","authors":["Staff Reporter"],"language":"en","category":"politics","source_country":"zw","sentiment":-0.307},{"id":329178712,"title":"Trump umumkan hubungan dengan Musk sudah berakhir","text":"NEW JERSEY: Donald Trump semalam mengumumkan bahawa hubungannya dengan bilionair yang juga penyumbang dana kempennya, Elon Musk, sudah berakhir, sambil memberi amaran akan berlaku \"tindakan tegas\" sekiranya Musk membiayai calon Demokrat yang bertanding menentang parti Republikan. \n\nDalam satu temu bual telefon bersama NBC News, Presiden Amerika Syarikat (AS) itu enggan menjelaskan tindakan yang dimaksudkan serta memaklumkan bahawa tiada sebarang perbincangan dibuat setakat ini mengenai siasatan ke atas Musk.\n\nKetika ditanya sama ada beliau menganggap hubungannya dengan Ketua Pegawai Eksekutif Tesla dan SpaceX itu sudah berakhir, Trump berkata: \"Saya rasa begitu, ya.\"\n\nDitanya sama ada beliau berhasrat untuk memperbaiki hubungan dengan Musk, Trump menjawab: \"Tidak. Saya langsung tiada niat untuk bercakap dengannya.\" \n\nNamun begitu, Trump berkata beliau belum mempertimbangkan untuk menamatkan kontrak kerajaan AS dengan syarikat internet satelit Starlink atau pelancar roket SpaceX milik Musk. \n\nHubungan kedua-dua tokoh itu tegang sejak minggu lalu apabila Musk secara tegas mengkritik rang undang-undang yang dibawa Trump dengan menyifatkannya sebagai sesuatu yang menjijikkan. \n\nPenentangan Musk menyukarkan proses meluluskan rang undang-undang berkenaan di Kongres yang kini menyaksikan Republikan hanya memiliki majoriti tipis di Dewan Perwakilan dan Senat. \n\nRang undang-undang berkenaan diluluskan dengan margin kecil di Dewan Perwakilan bulan lalu dan kini dibahaskan di Senat, di mana sebahagian Republikan masih menimbang untuk melakukan pindaan. \n\nPenganalisis bebas menjangkakan langkah itu akan menambah AS$2.4 trilion (RM11.28 trillion) kepada hutang negara yang kini mencecah AS$36.2 trilion (RM170.14 trillion) dalam tempoh sedekad akan datang, sekaligus membimbangkan banyak ahli Kongres termasuk segelintir Republikan yang berhaluan fiskal konservatif. \n\nMusk turut menyeru supaya menubuhkan parti politik baharu di AS untuk mewakili 80 peratus rakyat yang berada di tengah-tengah. \n\nTrump dalam kenyataannya semalam menyatakan keyakinan bahawa rang undang-undang berkenaan akan diluluskan sebelum sambutan Hari Kemerdekaan AS pada 4 Julai.\n\n\"Malah, mereka yang pada mulanya tidak bersetuju kini amat bersemangat untuk menyokongnya. Kami jangka ia akan diluluskan,\" katanya kepada NBC. \n\nSejak memulakan penggal keduanya pada 20 Januari lalu, Trump terus menerima sokongan kukuh daripada Republikan. \n\nWalaupun beberapa ahli Parlimen Republikan pernah menyuarakan kebimbangan kepada media berhubung dasar tertentu, mereka masih belum menolak mana-mana dasar atau pencalonan yang dibawakan beliau. \n\nDalam perkembangan berkaitan, Musk dilaporkan memadam beberapa hantaran di media sosial yang mengkritik Trump, termasuk satu yang memberi bayangan sokongan terhadap usaha memecat presiden itu — dilihat sebagai cubaan meredakan ketegangan yang memuncak sejak Khamis lalu. \n\nSepanjang penggal pertamanya sebagai Presiden, Trump dua kali berdepan undian pemecatan oleh Dewan Perwakilan yang ketika itu dikuasai Demokrat, namun Senat menolak kedua-dua usaha berkenaan.\n\nSetakat ini, Rumah Putih dan pihak Musk belum memberikan sebarang maklum balas berhubung hantaran yang dipadam itu. \n\nMenurut individu yang rapat dengan Musk, kemarahannya dikatakan semakin reda dan ada kemungkinan beliau mahu memperbaiki hubungan dengan Trump.\n\nSalah satu hantaran di platform X yang dipercayai sudah dipadam adalah reaksi kepada satu soalan pengguna lain yang menulis: \"Presiden lawan Elon. Siapa menang? Saya pilih Elon. Trump patut dipecat dan (Naib Presiden) JD Vance patut ganti dia.\" \n\nMusk dilaporkan hanya menjawab: \"Ya.\" \n\nMusk, individu terkaya di dunia, adalah antara penyumbang dana terbesar kepada kempen pilihan raya Trump bagi tahun 2024. \n\nBeliau membelanjakan hampir AS$300 juta (RM1.41 billion) dalam pilihan raya AS tahun lalu dan mendakwa dirinya berperanan penting dalam membantu Republikan mengekalkan majoriti kerusi di Dewan Perwakilan serta merampas semula majoriti di Senat.\n\nTrump sebelum ini melantik Musk untuk mengetuai usaha mengecilkan saiz penjawat awam persekutuan dan mengurangkan perbelanjaan kerajaan, serta memuji peranannya dalam kapasiti sebagai Ketua Jabatan Kecekapan Kerajaan di Rumah Putih kira-kira seminggu lalu.\n\nNamun, setakat ini Musk hanya berjaya mengurangkan sekitar setengah peratus daripada jumlah keseluruhan perbelanjaan kerajaan — jauh daripada sasaran asalnya untuk memotong AS$2 trilion (RM9.4 trillion) daripada bajet persekutuan.","summary":"NEW JERSEY: Donald Trump semalam mengumumkan bahawa hubungannya dengan bilionair yang juga penyumbang dana kempennya, Elon Musk, sudah berakhir, sambil memberi amaran akan berlaku “tindakan tegas” sekiranya Musk membiayai calon Demokrat yang bertanding menentang parti Republikan.","url":"https://www.bharian.com.my/dunia/amerika/2025/06/1405624/trump-umumkan-hubungan-dengan-musk-sudah-berakhir","image":"https://assets.bharian.com.my/images/articles/BBH8over-o_BHfield_image_listing_featured.var_1749341413.jpg","video":null,"publish_date":"2025-06-08 00:10:23","author":"REUTERS","authors":["REUTERS"],"language":"en","category":"politics","source_country":"my","sentiment":0.407},{"id":329175790,"title":"Trump Deploys National Guard to Address Street Turmoil in Los Angeles","text":"Trump’s border chief has announced that the National Guard is gearing up to arrive in Los Angeles within hours due to ongoing confrontations between demonstrators and ICE officials.\n\n“We are enhancing safety in Los Angeles. Mayor (Karen) Bass should be expressing gratitude,” stated Tom Homan, President Trump’s lead on border matters, on X this Saturday night. “The National Guard will be deployed tonight.”\n\nReports indicate that federal agents have engaged in clashes with irate protesters around Los Angeles for the second consecutive day on Saturday, deploying flash-bang grenades into the gatherings and closing a section of a freeway during operations targeting undocumented immigrants.\n\nThe standoff took place in the suburb of Paramount, where demonstrators had gathered near a Home Depot that was being used as a staging area by federal immigration officials.\n\nThey were met by federal agents in riot gear and gas masks, who lobbed flash-bang grenades and tear gas at the crowd, according to news reports and social media posts.\n\nThe immigration raids are part of President Donald Trump’s ongoing crackdown on undocumented immigrants. \n\nFollowing the latest clashes in Los Angeles, authorities vowed to prosecute offenders and warned of an escalating security presence.\n\nTrump was elected to a second term largely on a promise to crack down hard on the entry and presence of undocumented migrants who he likened to ‘monsters’ and ‘animals.’\n\nFollowing the latest clashes in Los Angeles, authorities vowed to prosecute offenders and warned of an escalating security presence.\n\nFBI Deputy Director Dan Bongino said multiple arrests had been made following Friday’s clashes.\n\n‘You bring chaos, and we’ll bring handcuffs. Law and order will prevail,’ he said on X.\n\nOn Saturday, amid chants for ICE agents to get out, some protestors waved Mexican flags while others set a US flag on fire.\n\nCement blocks and overturned shopping carts served as crude roadblocks.\n\nA crowd swarmed a US Marshals Service bus exiting a nearby freeway, with authorities later closing on and off ramps to keep protesters from taking over the highway.\n\nThe tense standoff came a day after masked and armed immigration agents carried out high-profile workplace raids in separate parts of Los Angeles, attracting angry crowds and setting off hours-long standoffs.\n\n‘An insurrection against the laws and sovereignty of the United States,’ White House deputy chief of staff and anti-immigration hardliner Stephen Miller said on X, sharing a video of protesters marching Friday outside Los Angeles’s federal detention center.\n\nTrump has pledged to deport record numbers of people in the country illegally and lock down the US-Mexico border, with the White House setting a goal for ICE to arrest at least 3,000 migrants per day.\n\nBut the sweeping immigration crackdown has also included people legally residing in the country, including some with permanent residence, and has led to legal challenges.\n\nTelevision news footage earlier on Friday showed caravans of unmarked military-style vehicles and vans loaded with uniformed federal agents streaming through Los Angeles streets as part of the immigration enforcement operation.\n\nThe LAPD did not take part in the immigration enforcement. It was deployed to quell civil unrest after crowds protesting the deportation raids spray-painted anti-ICE slogans on the walls of a federal court building and gathered outside a nearby jail where some of the detainees were reportedly being held.\n\nLos Angeles Mayor Karen Bass in a statement condemned the immigration raids.\n\n‘I am deeply angered by what has taken place,’ Bass said. ‘These tactics sow terror in our communities and disrupt basic principles of safety in our city. We will not stand for this.’\n\nLos Angeles, the second-most populous city in the United States, is one of the most diverse metropolises in the country.\n\nThe suburb of Paramount, home to about 50,000 people, is 82 percent Hispanic or Latino, according to US Census data.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTrump&#8217;s border chief has announced that the National Guard is gearing up&#8230;\n\n\nThis Post: Trump Deploys National Guard to Address Street Turmoil in Los Angeles first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-deploys-national-guard-to-address-street-turmoil-in-los-angeles/","image":"https://internewscast.com/wp-content/uploads/2025/06/Trump-sends-National-Guard-to-Los-Angeles-amid-chaos-in.jpg","video":null,"publish_date":"2025-06-08 00:09:15","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.186},{"id":329179518,"title":"Trump admits Musk’s ‘craziness’ may be due to alleged drug use — newspaper","text":"NEW YORK,- US President Donald Trump does not rule out that American businessman Elon Musk decided to enter into a conflict with him while under the influence of drugs, The New York Times reported, citing sources.\n\nAccording to the newspaper, the US leader called Musk’s behavior “crazy” and “linked to his drug use” in a conversation with his aides. Trump had previously stated that he was not concerned about the press reports on Musk’s drug use.\n\nAccording to The New York Times, Musk actively used drugs during Trump’s election campaign. The newspaper’s sources said that the businessman regularly took ketamine, ecstasy, and psychedelic mushrooms. \n\nThe newspaper pointed out that its sources did not say whether Musk continued to use illegal substances while overseeing the Department of Government Efficiency (DOGE).","summary":"NEW YORK,- US President Donald Trump does not rule out that American businessman Elon Musk [...]","url":"https://www.thezimbabwemail.com/world-news/trump-admits-musks-craziness-may-be-due-to-drug-use-newspaper/","image":"https://www.thezimbabwemail.com/wp-content/uploads/2025/05/Elon-Musk-and-Trump.jpg","video":null,"publish_date":"2025-06-08 00:07:41","author":"Gdpr Cookie Consent,Staff Reporter","authors":["Gdpr Cookie Consent","Staff Reporter"],"language":"en","source_country":"zw","sentiment":-0.35},{"id":329175800,"title":"Trump Warns Elon Musk of Potential Repercussions for Supporting Democrats","text":"BRIDGEWATER, N.J. — President Donald Trump remains firm in his dispute with Elon Musk, stating on Saturday that he is not interested in mending their relationship and cautioned that his one-time supporter and campaign contributor may face “serious consequences” if he attempts to aid Democrats in the upcoming elections.\n\nDuring a phone conversation with NBC’s Kristen Welker, Trump mentioned that he does not intend to reconcile with Musk. When questioned whether he believes his connection with the influential CEO of Tesla and SpaceX is finished, Trump replied, “I would assume so, yeah.”\n\n“I’m preoccupied with other matters,” Trump added. “You know, I won an election by a large margin. I offered him considerable support in the past, during my first term, providing him breaks and essentially saving his life. I have no plans to converse with him again.”\n\nThe president also issued a warning amid chatter that Musk could back Democratic lawmakers and candidates in the 2026 midterm elections.\n\n“If he does, he’ll have to pay the consequences for that,” Trump told NBC, though he declined to share what those consequences would be. Musk’s businesses have many lucrative federal contracts.\n\nThe president’s latest comments suggest Musk is moving from close ally to a potential new target for Trump, who has aggressively wielded the powers of his office to crack down on critics and punish perceived enemies. As a major government contractor, Musk’s businesses could be particularly vulnerable to retribution. Trump has already threatened to cut Musk’s contracts, calling it an easy way to save money.\n\nThe dramatic rupture between the president and the world’s richest man began this week with Musk’s public criticism of Trump’s “big beautiful bill” pending on Capitol Hill. Musk has warned that the bill will increase the federal deficit and called it a “disgusting abomination.”\n\nTrump criticized Musk in the Oval Office, and before long, he and Musk began trading bitterly personal attacks on social media, sending the White House and GOP congressional leaders scrambling to assess the fallout.\n\nAs the back-and-forth intensified, Musk suggested Trump should be impeached and claimed without evidence that the government was concealing information about the president’s association with infamous pedophile Jeffrey Epstein. Musk appeared by Saturday morning to have deleted his posts about Epstein.\n\nVice President JD Vance in an interview tried to downplay the feud. He said Musk was making a “huge mistake” going after Trump, but called him an “emotional guy” getting frustrated.\n\n“I hope that eventually Elon comes back into the fold. Maybe that’s not possible now because he’s gone so nuclear,” Vance said.\n\nVance called Musk an “incredible entrepreneur,” and said that Musk’s Department of Government Efficiency, which sought to cut government spending and laid off or pushed out thousands of workers, was “really good.”\n\nVance made the comments in an interview with ” manosphere” comedian Theo Von, who last month joked about snorting drugs off a mixed-race baby and the sexuality of men in the U.S. Navy when he opened for Trump at a military base in Qatar.\n\nThe Vance interview was taped Thursday as Musk’s posts were unfurling on X, the social media network the billionaire owns.\n\nDuring the interview, Von showed the vice president Musk’s claim that Trump’s administration hasn’t released all the records related to Epstein because Trump is mentioned in them.\n\nVance responded to that, saying, “Absolutely not. Donald Trump didn’t do anything wrong with Jeffrey Epstein.”\n\n“This stuff is just not helpful,” Vance said in response to another post shared by Musk calling for Trump to be impeached and replaced with Vance.\n\n“It’s totally insane. The president is doing a good job.”\n\nVance also defended the bill that has drawn Musk’s ire, and said its central goal was not to cut spending but to extend the 2017 tax cuts approved in Trump’s first term.\n\nThe bill would slash spending and taxes but also leave some 10.9 million more people without health insurance and spike deficits by $2.4 trillion over the decade, according to the nonpartisan Congressional Budget Office.\n\n“It’s a good bill,” Vance said. “It’s not a perfect bill.”\n\nThe interview was taped in Nashville at a restaurant owned by musician Kid Rock, a Trump ally.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBRIDGEWATER, N.J. &#8212; President Donald Trump remains firm in his dispute with&#8230;\n\n\nThis Post: Trump Warns Elon Musk of Potential Repercussions for Supporting Democrats first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-warns-elon-musk-of-potential-repercussions-for-supporting-democrats/","image":"https://internewscast.com/wp-content/uploads/2025/06/Trump-says-Elon-Musk-could-face-serious-consequences-if-he.jpg","video":null,"publish_date":"2025-06-08 00:01:17","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.379},{"id":329176302,"title":"Japan grows restless for next-gen fighter jets as progress with UK, Italy stalls","text":"At an airbase outside Tokyo, engineers inspect the ageing F-2 fighters that have patrolled the Japanese skies for decades.\nBut with China’s newest stealth jets roaming ever closer, and the promised future of air defence still years away, Japan is growing restless.\nIts partnership with Britain and Italy to build a next-generation fighter has hit turbulence – and Tokyo may no longer be willing to wait.\nThe sixth-generation fighter, part of the Global Combat Air Programme (GCAP), is slated to enter service with all three nations by 2035. But development is reportedly lagging, with the first demonstrator flight now delayed until 2027 – a setback that has alarmed Japanese officials and defence analysts.\n\nUnlike the UK and Italy, which can continue to rely on the Eurofighter Typhoon well into the 2040s, Japan faces a far more immediate need to modernise its fleet, according to experts.\nJapan’s principal fighter force – more than 90 F-2 jets co-developed by Mitsubishi and Lockheed Martin between 1996 and 2011 – is based on the ageing F-16 platform, which first flew with the US military in the late 1970s.\nThough still capable, the F-2 is seen as increasingly outmatched by China’s latest combat aircraft, such as the stealthy Chengdu J-20. Beijing is also developing the J-36, a sixth-generation fighter projected to surpass even today’s most advanced jets.\nJapan lagging behind in modern air power is largely self-inflicted, analysts say.\n\n“This is due essentially to long-term delays by Japan in choosing to replace its fighters – remarkably, the Air Self-Defence Force was still flying F-4 Phantoms just four years ago,” said Garren Mulloy, an international relations professor at Daito Bunka University and a military affairs specialist.\nThe Phantom, introduced by the US Navy in 1961, was retired from American service in 1996. Japan clung on to it until 2021, and South Korea only retired its last Phantoms last year.\nJapan’s pivot to newer aircraft began in 2011 with the purchase of F-35 Lightning II jets – a decision Mulloy said was linked to “Operation Tomodachi”, the American military and humanitarian response to the March 2011 earthquake and tsunami.\nThe initial order expanded in 2019 under then-prime minister Shinzo Abe, who authorised the purchase of 105 more F-35s during Donald Trump’s first term as US president, bringing Japan’s total order to 147, including variants for short and vertical take-off to operate from Izumo-class carriers.\nBut deliveries of the F-35s are staggered over several years, leaving Japan’s air force stretched thin as it seeks to intercept Chinese incursions near the disputed Diaoyu Islands – administered by Japan as the Senkakus but claimed by China – and to monitor Russian long-range aircraft near its northern perimeter.\n“There is going to be a gap because the F-2s are getting old, so Japan has a decision to make,” Mulloy said. “They can spend more on improving the F-2s and F-15s that are in service to keep them operational for longer and until the GCAP can be delivered, or they can commit to buying more F-35s from the US.”\n\nAn expanded F-35 fleet may also strengthen Japan’s hand in trade negotiations with Washington. Each aircraft costs around US$100 million, and Reuters has reported that Japan is weighing additional purchases.\nPrime Minister Shigeru Ishiba is expected to raise the issue when he meets with Trump on the sidelines of this month’s G7 summit in Canada.\nAccording to Japan’s Asahi Shimbun newspaper, Trump referenced America’s planned F-47 sixth-generation fighter in a May 23 call with Ishiba, signalling his willingness to broker a deal once the aircraft is operational. But Ishiba reportedly offered no firm response – wary, analysts say, of undermining the GCAP partnership with Britain and Italy.\nDr Hideaki Watanabe, chairman of the Tokyo-based Defence Technology Foundation research agency, said the divergence in the three nations’ timelines had become a sticking point.\n“Japan needs this fighter sooner,” Watanabe said. “It is only after an initial flight that much of the work can be done, so this is a significant delay.”\nHe said Tokyo had wanted to have the new fighter jet by 2035 and was disappointed when the first demonstrator flight was delayed to 2027.\n\n“The differences in the approaches are going to become increasingly critical, of course, but this is also a very important project for Japan, so decisions need to be taken very soon about what is going to happen if [the] GCAP is late,” Watanabe added.\nThe trilateral partnership to jointly develop the jet was formally announced in December 2022, merging previously separate plans for a sixth-generation platform.\nHistorically, Japan has sourced its combat aircraft from the United States, often securing permission to produce customised variants suited to its unique defence requirements. That latitude does not extend to the F-35, however – prompting Tokyo to pursue domestically developed alternatives.\nJapan’s air defence posture, built around extended maritime operations, demands long-range fighters with heavy payloads. The F-35, with its single engine and limited range, falls short in this regard. The GCAP, by contrast, promises nearly double the weapons capacity and is designed to operate as a “mother ship” for autonomous drones providing strike and surveillance capabilities.\nMulloy rejected suggestions that the UK’s Ministry of Defence had been intentionally “dragging its feet” on the GCAP project. Instead, he pointed to Nato’s preoccupation with Ukraine and a broader strategic realignment under Trump.\n“Nato has been extremely focused on a defence augmentation shopping list that reflects its relationship with Ukraine during the war as well as the present US administration,” he said.\nAll projects – even if they are purely national – come up against issues involving delays and cost overruns\nGarren Mulloy, defence analyst\nJapan, he added, had largely remained insulated from the fallout of the Ukraine conflict and European defence recalibrations.\n“All projects – even if they are purely national – come up against issues involving delays and cost overruns if you are dealing with this sort of very complicated technology,” Mulloy said, adding that Japan would make the necessary decisions to address delivery delays.","summary":"At an airbase outside Tokyo, engineers inspect the ageing F-2 fighters that have patrolled the Japanese skies for decades.\nBut with China’s newest stealth jets roaming ever closer, and the promised future of air defence still years away, Japan is growing restless.\nIts partnership with Britain and Italy to build a next-generation fighter has hit turbulence – and Tokyo may no longer be willing to wait.\nThe sixth-generation fighter, part of the Global Combat Air Programme (GCAP), is slated to enter...","url":"https://www.scmp.com/week-asia/economics/article/3313407/japan-clamours-new-fighter-jets-uk-italy-gcap-delays-test-tokyos-patience","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/06/06/e1c88b48-ed46-463e-87e5-fb1e3e81f34d_922ad7b7.jpg","video":null,"publish_date":"2025-06-08 00:00:08","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":0.045},{"id":329176828,"title":"How Democrats Can Stop Alienating Young Men: Some Unsolicited Advice","text":"Last November, Donald Trump soundly defeated Kamala Harris among young men 18 to 29 years old, racking up about 56% of their votes according to the Associated Press. That represents a huge decline from 2008, the climax of the Barack Obama coalition, when the Democrat candidate won 62% of the young male vote against GOP challenger John McCain.\n\nClearly, Democrats have a young man problem—and they’ve vowed to do something about it. Accordingly, the party is spending $20 million on a special multiyear effort called “Speaking With American Men: A Strategic Plan.” The project, The New York Times recently reported, will “study the syntax, language and content that gains attention and virality in these spaces.”\n\nYes, really. Hold your laughter.\n\nIt’s true that leading Democrat figures could use some help on the “syntax” and “language” fronts. They might begin to right the ship, on that score, by ditching the infamous gobbledygook “gaffes” of Joe Biden and the “unburdened by what has been” word salads of Harris. But the rubber will meet the road for Democrats when it comes to the critical, elusive third category of concern for their new young male outreach effort: content.\n\nTo paraphrase a venerable saying, one can put lipstick on a pig, but the pig, at the end of the day, is still a pig. And something big has to change for the Democrats. Nor is their problem limited to young men; the party’s overall favorability ratings, in recent months, have hit record lows in public polling.\n\nHere, Democrats, is some (entirely) unsolicited advice on steps you might consider taking to become less catastrophically unpopular with young men—and many other Americans too.\n\nOn the issue of sexuality and the human person, you might consider beginning your vaunted young male outreach efforts by deigning to properly define what exactly a “man” is—and, by extension, what a “woman” is as well. Indeed, your party’s most recent Supreme Court nominee publicly struggled to crack this case. It is probably best, before attempting to devise pro-young-man public policy ideas, to familiarize yourselves with your target audience. The definition of “man” as it has existed since the Garden of Eden is a pretty good place to start.\n\nAfter successfully defining “man” and “woman,” you might consider not indulging recurring grievances levied against so-called toxic masculinity. It is generally a good idea, in political outreach, to not hold in dripping disdain the demographic group you are trying to reach. Sure, men have been killing each other since Cain slew Abel, but many of them have also been doing some pretty good things for humanity since around that same time period. One key to publicly rejecting misandry will be ditching support for “diversity, equity, and inclusion” initiatives, which, along with also now being illegal, invariably take a pretty dim view of the heterogametic sex.\n\nOn the issue of immigration, you might consider not opening up America’s borders to, well, pretty much the whole world—but especially young males in search of economic opportunity in the land of the free and the home of the brave. Democrats might not have gotten this impression from the Harvard faculty lounge, but over half of Americans these days live paycheck to paycheck. Far too many young men struggle to provide for their families; indeed, many delay marriage in the first place because of finances. Flooding the zone with more wage competition may please the wokerati, but it won’t help you regain credibility with American breadwinners.\n\nOn the issue of environmentalism, you might consider not so conspicuously sacrificing American energy on the altar of climate alarmism. The young male voter simply wants a fair shot to make a decent living and provide safety and security for his family. The ham-handed restriction of hydrocarbon extraction does more than anything else to spike the price of every good or service. You might think that Trump’s tariffs are a threat to price stability, but you’d be wrong—at least so far. The real threat to the fiscal well-being of the median American comes from the price of energy, from which all other prices flow. Maybe, just maybe, don’t sacrifice all that on the altar of “Mother Earth”?\n\nThe good news for Democrats is that there is a lot of potential upside from their efforts to reach young men. The bad news for Democrats is the same: There’s so much to gain precisely because of how unpopular they currently are with that cohort.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Last November, Donald Trump soundly defeated Kamala Harris among young men 18 to 29 years old, racking up about 56% of their votes according to... Read More\n\n\nThe post How Democrats Can Stop Alienating Young Men: Some Unsolicited Advice appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/07/how-democrats-can-stop-alienating-young-men-some-unsolicited-advice/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/250607-kamalaHarris.jpg","video":null,"publish_date":"2025-06-08 00:00:00","author":"Josh Hammer","authors":["Josh Hammer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.195},{"id":329177684,"title":"Trade Minister Don Farrell says meeting with US Trade Rep Jamieson Greer was ‘friendly,’ not ‘difficult’","text":"Trade Minister Don Farrell has detailed the discussion he had with his US counterpart Jamieson Greer, revealing he had the “greatest confidence” in Anthony Albanese during an expected meeting with Donald Trump next weekend.\n\nSenator Farrell spoke to the US Trade Representative while in Paris last week and characterised the talk as “friendly”.\n\nDespite this, he maintained the tariffs were “simply unjustified”, highlighting Australia’s trade surplus with the US.\n\nFigures indicate Australia buys about $70bn worth of goods from the US, compared to the $30bn of exports Australia sells to America.\n\n“It wasn’t a difficult discussion in terms of the relationship between us, and I am certainly of the view that we have the opportunity to continue to talk with Jamieson and Commerce Secretary Lutnick to put our case across,” he said.\n\nSenator Farrell also said he was still determined to get the trade barriers slashed.\n\n“It’s only by open discussion, honest discussion, with our allies in the United States that I think we can do that, but I certainly haven’t given up on the prospect of getting these tariffs removed,” he said.\n\n“And every opportunity I get, I’ll continue to pursue that argument with the United States.”\n\nHowever, Senator Farrell said the decision will be ultimately made by Donald Trump, putting increased pressure on Mr Albanese’s upcoming meeting with the US President.\n\nHe said that while there were a “range of ways” in which Australia communicates with the US, the “most important … relationship between our prime minister and the president of the United States”.\n\n“Look every meeting, I think, between an Australian Prime Minister and the US president will always be a critical meeting and I have the greatest confidence in our prime minister to push the Australian point of view on this.”\n\nThe trade barriers currently include a 50 per cent levy on steel, a 25 per cent tariffs on aluminium and a blanket 10 per cent on other goods.\n\nWhile Mr Albanese maintained he won’t compromise on Australia’s biosecurity, he hinted Australia could review current settings which don’t allow the US to import beef which originates from Canada and Mexico.\n\nMr Albanese has also ruled out changes to the Pharmaceuticals Benefit Scheme, News Media Bargaining code and incoming ban on social media for under-16s, while highlighting Australia’s critical minerals industry as a potential bargaining chip.\n\n“If things can be sorted out in a way that protects our biosecurity – of course, we don’t just say no, we don’t want imports in here for the sake of it,” he told ABC radio on Friday.\n\n“But our first priority is biosecurity and there’ll be no compromise on that.”\n\nMr Albanese said Australia would not have a “subservient relationship to any nation”.\n\n“We’re a sovereign nation that stand on our own two feet,” he said.\n\nSenator Farrell also said he was “confident” Australia can secure a new trade deal with the European Union, with EU President Ursula von der Leyen expected to visit Australia in July or August.\n\n“We’ve got lots of things that we can sell to the to the Europeans. I believe now that there’s an appetite to reach an agreement on both sides,” he said.\n\n“The world has changed, those countries that believe in free and fair trade have to work together.”","summary":"Australia’s Trade Minister said he had a “friendly” meeting with US Trade Representative Jamieson Greer when the pair met in Paris last week.","url":"https://thewest.com.au/business/trade-minister-don-farrell-says-meeting-with-us-trade-rep-jamieson-greer-was-friendly-not-difficult-c-18961509","image":"https://images.thewest.com.au/publication/C-18961509/dee115f094262c942bf83362cb02019221b47332-16x9-x0y790w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-06-07 23:59:15","author":"Donald Trump,Jessica Wang","authors":["Donald Trump","Jessica Wang"],"language":"en","source_country":"au","sentiment":0.063},{"id":329176988,"title":"Exclusive-US believes Russia response to Ukraine drone attack not over yet, expects multi-pronged strike","text":"By Phil Stewart and Idrees Ali\n\nWASHINGTON (Reuters) -The United States believes that Russian President Vladimir Putin's threatened retaliation against Ukraine over its drone attack last weekend has not happened yet in earnest and is likely to be a significant, multi-pronged strike, U.S. officials told Reuters.\n\nThe timing of the full Russian response was unclear, with one source saying it was expected within days. A second U.S. official said the retaliation was likely to include different kinds of air capabilities, including missiles and drones.\n\nThe officials spoke on condition of anonymity. They did not detail Russia's expected targets nor elaborate on intelligence matters. The first official said Moscow's attack would be \"asymmetrical,\" meaning that its approach and targeting would not mirror Ukraine's strike last weekend against Russian warplanes.\n\nRussia launched an intense missile and drone barrage at the Ukrainian capital Kyiv on Friday and Russia's Defense Ministry said the strike on military and military-related targets was in response to what it called Ukrainian \"terrorist acts\" against Russia. But the U.S. officials believe the complete Russian response is yet to come.\n\nA Western diplomatic source said that while Russia's response may have started, it would likely intensify with strikes against symbolic Ukrainian targets like government buildings, in an effort to send a clear message to Kyiv.\n\nAnother, senior, Western diplomat anticipated a further devastating assault by Moscow. \"It will be huge, vicious and unrelenting,\" the diplomat said. \"But the Ukrainians are brave people.\"\n\nThe Russian and Ukrainian embassies in Washington and the White House did not immediately respond to requests for comment.\n\nMichael Kofman, a Russia expert at the Carnegie Endowment for International Peace, said he expected Moscow might seek to punish Ukraine's domestic security agency, the SBU, for its role in last weekend's assault. To send a message, Russia could employ intermediate-range ballistic missiles for the attack, he said.\n\n\"Most likely, they will attempt to retaliate against (SBU) headquarters, or other regional intelligence administration buildings,\" Kofman said, adding Russia could also target Ukrainian defense manufacturing centers.\n\nStill, Kofman suggested Russia's options for retaliation may be limited as it is already throwing a lot of its military might at Ukraine.\n\n\"In general, Russia's ability to substantially escalate strikes from what they are already doing - and attempting to do over the past month - is quite constrained,\" he said.\n\nOPERATION 'SPIDER'S WEB'\n\nKyiv says Sunday's audacious attack employed 117 unmanned aerial vehicles launched deep from within Russian territory in an operation code-named \"Spider's Web.\"\n\nThe United States assesses that up to 20 warplanes were hit - around half the number estimated by Ukrainian President Volodymyr Zelenskiy - and around 10 were destroyed.\n\nThe Russian government on Thursday denied that any planes were destroyed and said the damage would be repaired, but Russian military bloggers have spoken of loss or serious damage to about a dozen planes, including those capable of carrying nuclear weapons.\n\nThe strikes, prepared over 18 months and conducted by drones smuggled close to the bases in trucks, dealt a powerful symbolic blow to Russia, which throughout the Ukraine war has frequently reminded the world of its nuclear might.\n\nPutin told President Donald Trump in a telephone conversation on Wednesday that Moscow would have to respond to attack, Trump said in a social media post.\n\nTrump later told reporters that \"it's probably not going to be pretty.\"\n\n\"I don't like it. I said: 'Don't do it. You shouldn't do it. You should stop it,'\" Trump said of his conversation with Putin. \"But, again, there's a lot of hatred.\"\n\n(Reporting by Phil Stewart and Idrees Ali; Editing by Don Durfee, William Mallard and Alistair Bell)","url":"https://www.yahoo.com/news/exclusive-us-believes-russia-response-235715893.html","image":"https://s.yimg.com/ny/api/res/1.2/Lkbs34trJll0K1teSNacjQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04NDU-/https://media.zenfs.com/en/reuters.com/90a2d36c0f8e6e61a585e100fbe7da3e","video":null,"publish_date":"2025-06-07 23:57:15","author":"Phil Stewart And Idrees Ali","authors":["Phil Stewart And Idrees Ali"],"language":"en","category":"politics","source_country":"us","sentiment":-0.328},{"id":329180232,"title":"World News | Protesters and Immigration Authorities Face off for a Second Day in LA Area After Arrests","text":"Paramount, Jun 8 (AP) Tear gas and smoke filled the air on the southern outskirts of Los Angeles on Saturday as confrontations between immigration authorities and demonstrators extended into a second day and top Trump administration officials vowed to prosecute anyone who interferes with enforcement. Border Patrol personnel in riot gear and gas masks stood guard outside an industrial park in the city of Paramount, deploying tear gas as bystanders and protesters gathered on medians and across the street. Some jeered at officers while recording the events on smartphones. Also Read | US Horror: Man Kills and Dismembers 19-Year-Old Girl on First Date Before Scattering Remains in Milwaukee; Faces Life Term. “ICE out of Paramount. We see you for what you are,” a woman said through a megaphone. “You are not welcome here.” One handheld sign read, “No Human Being is Illegal.” Also Read | US: Donald Trump Administration Shuts Down 'Quiet Skies' Passenger Surveillance Program. Smoke rose from burning shrubbery and refuse in the street, and demonstrators kicked at a Border Patrol vehicle. A boulevard was closed to traffic as Border Patrol agents circulated through the area. Homeland Security Secretary Kristi Noem posted a message on social media addressing “LA rioters” and warning that interference with immigration enforcement will not be tolerated. “You will not stop us or slow us down,” Noem said on the X platform. Immigration and Customs Enforcement “will enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.” Immigration and Customs Enforcement officers executed search warrants at multiple locations Friday, including outside a clothing warehouse in the fashion district. The action came after a judge found probable cause that the employer was using fictitious documents for some of its workers, according to representatives for Homeland Security Investigations and the U.S. Attorney's Office. A tense scene unfolded outside as a crowd tried to block agents from driving away. Advocates for immigrants' rights said there were also migration detentions outside Home Depot stores and a doughnut shop. DHS said in a statement that recent ICE operations in Los Angeles resulted in the arrest of 118 immigrants. Following the Friday arrests, protesters gathered in the evening outside a federal detention center, chanting, “Set them free, let them stay!” Some held signs with anti-ICE slogans, and some some scrawled graffiti on the building. Among those arrested at the protests was David Huerta, regional president of the Service Employees International Union. Justice Department spokesperson Ciaran McEvoy confirmed that he was being held Saturday at the Metropolitan Detention Center in Los Angeles ahead of a scheduled Monday court appearance. It was not clear whether Huerta had legal representation. Democratic Senate Minority Leader Chuck Schumer called for his immediate release. In a social media post, he cited a “disturbing pattern of arresting and detaining American citizens for exercising their right to free speech.” The immigration arrests come as President Donald Trump and his administration push to fulfil promises of mass deportations across the country. Los Angeles Mayor Karen Bass said the activity was meant to “sow terror” in the nation's second-largest city. In a statement Saturday, ICE Acting Director Todd Lyons chided Bass for the city's response to the protests. “Mayor Bass took the side of chaos and lawlessness over law enforcement,” Lyons said. “Make no mistake, ICE will continue to enforce our nation's immigration laws and arrest criminal illegal aliens.” (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Tear gas and smoke filled the air on the southern outskirts of Los Angeles on Saturday as confrontations between immigration authorities and demonstrators extended into a second day and top Trump administration officials vowed to prosecute anyone who interferes with enforcement.","url":"https://www.latestly.com/agency-news/world-news-protesters-and-immigration-authorities-face-off-for-a-second-day-in-la-area-after-arrests-6912709.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-07 23:54:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.006},{"id":329173946,"title":"Trump sends National Guard to Los Angeles amid chaos in the streets as protesters clash with ICE agents","text":"Trump's border czar has said the National Guard is mobilizing to enter the city of Los Angeles within hours amid tense standoffs between protesters and ICE agents. \n\n'We are making Los Angeles safer. Mayor (Karen) Bass should be thanking us,' Tom Homan, President Trump's point man on border security, said on X on Saturday evening. 'We are going to bring the National Guard in tonight.' \n\nFederal agents clashed with angry protestors in the Los Angeles area for a second day Saturday, shooting flash-bang grenades into the crowd and shutting part of a freeway amid raids on undocumented migrants, reports said.\n\nThe standoff took place in the suburb of Paramount, where demonstrators had gathered near a Home Depot that was being used as a staging area by federal immigration officials.\n\nThey were met by federal agents in riot gear and gas masks, who lobbed flash-bang grenades and tear gas at the crowd, according to news reports and social media posts.\n\nThe immigration raids are part of President Donald Trump's ongoing crackdown on undocumented immigrants.\n\nFollowing the latest clashes in Los Angeles, authorities vowed to prosecute offenders and warned of an escalating security presence.","summary":"Trump's border czar said the National Guard is mobilizing to enter the city of Los Angeles within hours amid tense standoffs between protesters and ICE agents.","url":"https://www.dailymail.co.uk/news/article-14790937/Trump-sends-National-Guard-Los-Angeles-amid-chaos-streets-protesters-clash-ICE-agents.html","image":"https://i.dailymail.co.uk/1s/2025/06/08/00/99145575-0-image-a-34_1749340089247.jpg","video":null,"publish_date":"2025-06-07 23:49:33","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","category":"politics","source_country":"gb","sentiment":0.267},{"id":329184224,"title":"French President Macron to visit Greenland on June 15","text":"Paris, June 8 (SocialNews.XYZ) French President Emmanuel Macron is expected to pay an official visit to Greenland on June 15, the French daily Le Monde reported, citing a French presidential office source.\n\nAt the invitation of Danish Prime Minister Mette Frederiksen, and Jens-Frederik Nielsen, prime minister of Greenland's self-government, French President Macron will be the first foreign head of state to visit Greenland since US President Donald Trump's threats of annexation, Xinhua news agency reported quoting Le Monde.\n\nAccording to the French presidential office, the Elysee, the three leaders will hold talks over security in the North Atlantic and the Arctic, as well as issues related to climate change, energy transition, and supply of critical minerals.\n\nThis visit aims to \"strengthen cooperation with Greenland in these areas and contribute to strengthening European sovereignty,\" Le Monde noted, citing the Elysee source.\n\nTrump has repeatedly expressed a desire to acquire Greenland, a strategically located and resource-rich autonomous territory of Denmark.\n\nEarlier in March, 2025, Danish Prime Minister Mette Frederiksen has reaffirmed that Greenland remains part of the Kingdom of Denmark, rejecting recent remarks by US President Donald Trump, who said the US would \"go as far as they have to\" to acquire the island.\n\nDanish Foreign Minister Lars Lokke Rasmussen also criticised what he called a \"false narrative\" in US political circles suggesting Greenland is eager to become American.\n\nDanish Defence Minister Troels Lund Poulsen described Trump's rhetoric as a \"veiled threat\" and \"deeply inappropriate,\" warning that the US was escalating tensions.\n\n\"It is the people of Greenland who determine Greenland's future,\" he said.\n\nMeanwhile, a demonstration has been planned in front of the US Embassy in Copenhagen to protest what organisers call \"unwanted pressure\" from Washington.\n\nGreenland, once a Danish colony, became an integral part of the Kingdom of Denmark in 1953. It was granted home rule in 1979, expanding its autonomy, although Denmark retains control over foreign affairs and defence.\n\nSource: IANS","summary":"Paris, June 8 (SocialNews.XYZ) French President Emmanuel Macron is expected to pay an official visit to Greenland on June 15, the French daily Le Monde reported, citing a French presidential office source. At the invitation...\n\n\nThe post French President Macron to visit Greenland on June 15 appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/06/07/french-president-macron-to-visit-greenland-on-june-15/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/06/08/202506083423504.jpg?fit=300%2C359&quality=80&zoom=1&ssl=1?v=1749344407","video":null,"publish_date":"2025-06-07 23:46:02","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.097},{"id":329175768,"title":"Obama’s doctor says Biden’s physician should have given him cognitive tests","text":"Former President Joe Biden's doctor should have given him more cognitive tests, according to the doctor of former President Barack Obama.\n\nJeffrey Kuhlman, who served as Obama's doctor between 2009 and 2013, told the New York Post on Saturday that Biden and any politician over the age of 70 should be given \"a few hours\" of annual mental exams that should be accessible to the public.\n\n“My position is that a 78-year-old candidate, Trump at the time, an 82-year-old president [Biden] would both benefit from neurocognitive testing,” Kuhlman said.\n\nHe went on to say that \"any politician over the age of 70 has normal age-related cognitive decline,\" and pointed out that he's been recommending annual mental exams for more than a year.\n\nBiden's doctor, Kevin O'Connor, oversaw three physicals for the president during his time in office, but Kuhlman says the physical reports did not include notes from a neurocognitive specialist.\n\nHe also pointed out that Biden did not take the Montreal Cognitive Assessment, which Donald Trump agreed to take during his first term. That test is a two-minute screening test of about 30 questions that probes for signs of dementia, according to Kuhlman.\n\nObama's doctor said that he had \"no doubts\" that Trump \"aced\" the Montreal Cognitive Assessment, but said he believes that the White House should also release the CT scans taken after Trump's attempted assassination last year.\n\nWhile the Montreal test is able to detect some basic signs of dementia, the doctor noted that it wasn't adequate for determining more serious cognitive issues.\n\nAccording to Kuhlman, mental processing speed and spacial visualization all begin to decline around the age of 60.\n\nKuhlman said he respected O'Connor's medical judgement, but added that \"sometimes those closest to the trees miss the forest.\"\n\nO'Connor told the New York Post in July 2024 — just days after the then-president announced he would not run for re-election — that Biden's cognitive health was \"excellent.\"\n\nThen-White House Press Secretary Karine Jean-Pierre insisted to the public that Biden didn't \"need a cognitive test\" because he \"passes a cognitive test every day.\"\n\nShe has since decided to leave the Democratic Party and write a tell-all book about her time in the White House, earning her a savaging by some Democrats.\n\nVisitor logs to the White House show that Biden did submit an evaluation form to an expert in Parkinson's Disease, but O'Connor said that the meeting was part of Biden's annual physical.\n\nKuhlman says that the doctor who evaluated Biden in that visit, Kevin Cannard, had been evaluating Biden for 14 years, and that he trusts the doctor's evaluation.\n\nO'Connor was subpoenaed by the Republican-led House Oversight Committee on Thursday to stand for questioning about Biden's mental abilities during a hearing on June 27.\n\nShortly after the House investigation was launched, the Trump administration issued a memo stating that it was issuing its own investigation into whether or not people other than Biden used an autopen signature device to sign off on executive actions during the late period of Biden's presidential term.\n\nBoth investigations follow the release of a book by Jake Tapper and Alex Thompson, titled Original Sin, that alleges a mass coverup of Biden's cognitive impairment by those closest to him.","url":"https://uk.news.yahoo.com/obama-doctor-says-biden-physician-234519186.html","image":"https://media.zenfs.com/en/the_independent_577/3ffd99464b2dc6a4cdf1d051ba7498c5","video":null,"publish_date":"2025-06-07 23:45:19","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","source_country":"gb","sentiment":-0.276},{"id":329180374,"title":"National Guard to be deployed in Los Angeles County as anti-ICE protests rage: border czar Tom Homan","text":"The National Guard will be deployed to Los Angeles County after anti-ICE protests continued to escalate Saturday afternoon, Trump administration border czar Tom Homan told Fox News Saturday. On Saturday, tear gas was deployed near Home Depot in Paramount, California, where Immigration and Customs Enforcement (ICE) officers were allegedly conducting a raid. Following the raid, a violent protest broke out and several arrests were made for assault on a federal agent, according to U.S. Border Patrol Chief Michael W. Banks. President Donald Trump took to Truth Social to call out state and local leadership's inaction. \"If Governor Favin Newscum, of California, and Mayor Karen Bass, of Los Angeles, can't do their jobs, which everyone knows they can't, then the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved!!!\" Trump wrote. FEDERAL OFFICIALS SLAM DEMOCRATS FOR 'DANGEROUS' RHETORIC AS ICE AGENTS FACE VIOLENT MOBS IN LA, NYC Newsom responded on X, claiming the federal government \"is moving to take over the California National Guard\" and deploy 2,000 soldiers. \"That move is purposefully inflammatory and will only escalate tensions,\" Newsom wrote. \"LA authorities are able to access law enforcement assistance at a moment’s notice. We are in close coordination with the city and county, and there is currently no unmet need. The Guard has been admirably serving LA throughout recovery. This is the wrong mission and will erode public trust.\" Videos and photos provided to Fox News by a federal source showed Border Patrol agents' perspective from inside their vehicle as they attempted to leave the protest area. Footage shows their vehicle being pelted with rocks, stones, and concrete, as the windshield shatters. Federal sources stressed the violence at the Paramount riot could have killed an agent or caused a crash. Banks shared a photo of a Border Patrol agent's bloody hand, which was injured by a rock flying through the windshield. \"ANY attack on our agents or officers will not be tolerated,\" Banks wrote on X. \"You will be arrested and federally prosecuted.\" SOCIAL MEDIA, TRUMP ADMIN ERUPTS OVER LA MAYOR'S REACTION TO ICE RAIDS: 'YOU'RE A CRIMINAL TOO' While protesters reportedly targeted law enforcement vehicles, they also allegedly damaged and robbed nearby property. FOX LA reporter Matthew Seedorff shared a video to X showing the station's SUV with its windows smashed with bricks. \"F*** ICE\" was spray painted in white on the passenger side of the car. \"So this is what's left of our work car,\" Seedorff said in the video. \"We had it parked near the scene. Obviously, we got here right at the beginning before we knew it was going to escalate to the situation that it got to. This is a brand-new news truck that we just got. Looks like the tires were slashed. They busted into the windows. Our personal bags were in the car [and] they stole all the stuff that was inside.\" In an interview with Fox News' \"The Big Weekend Show,\" Homan said authorities are \"stepping up\" and \"mobiliz[ing]\" to address violence and destruction occurring near raid locations where demonstrators are gathering. \"American people, this is about enforcing the law, and again, we're not going to apologize for doing it,\" Homan said. ICE operations in LA this week resulted in the arrest of 118 illegal immigrants, including five gang members and those with prior criminal histories of drug trafficking, assault, cruelty to children, domestic violence, robbery, and alien smuggling, according to the Department of Homeland Security (DHS). Nationwide, 2,000 illegal immigrants were arrested this week. The Paramount protest comes less than 24 hours after more than 1,000 Los Angeles rioters surrounded a federal law enforcement building and assaulted ICE agents, slashed tires, and defaced buildings. ICE SWEEPS THROUGH LA BUSINESSES AS LOCAL DEMOCRATS CRY FOUL OVER TRUMP ADMINISTRATION'S ENFORCEMENT ACTIONS DHS Secretary Kristi Noem took to X Saturday afternoon with a strong to protesters. \"A message to the LA rioters: you will not stop us or slow us down,\" Noem wrote in a post. \"@ICEgov will continue to enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.\" FBI Deputy Director Dan Bongino said the agency is seeking information regarding the identity of those throwing rocks at vehicles conducting critical law enforcement operations. \"One of the perpetrators in this video is wearing a helmet, and we’re going to use our investigative tools to locate the individual,\" Bongino wrote in an X post. \"I strongly suggest you turn yourself in, it’s only a matter of time.\" CLICK HERE TO GET THE FOX NEWS APP The Los Angeles Police Department (LAPD) and Los Angeles County Fire Department did not immediately respond to Fox News Digital's requests for comment.","summary":"Trump border czar Tom Homan announces National Guard deployment to Los Angeles County after anti-ICE demonstrations turned violent, stating authorities won&apos;t apologize for enforcing the law.","url":"https://www.foxnews.com/politics/national-guard-deployed-los-angeles-county-anti-ice-protests-rage-border-czar-tom-homan","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/homan-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-07 23:40:41","author":"Alexandra Koch,Bill Melugin","authors":["Alexandra Koch","Bill Melugin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.229},{"id":329173960,"title":"Dramatic move by Pentagon hint Trump could be siding with another billionaire amid Musk fallout","text":"The Pentagon appears to be contemplating pivoting away from Elon Musk's SpaceX following the almighty blowup between President Donald Trump and the world's richest man earlier this week.\n\nThe fallout appears to be impacting the nation's space program as the Trump administration looks toward another billionaire to replace Musk in the race to Mars.\n\nOfficials at NASA and the Pentagon quietly reached out to SpaceX's competitors, urging them to accelerate development of alternative rockets and spacecraft. \n\nDecisions appear to have been taken quickly after Musk made a defiant threat to pull SpaceX's Dragon spacecraft, a lifeline to the International Space Station, after Trump first threatened to cancel SpaceX's lucrative government contracts. \n\n'It turned really terrifying,' one NASA official admitted to the Washington Post after initially finding the feud 'entertaining.' \n\nAlthough Musk eventually walked back his threat, the damage was done.\n\nOfficials from NASA and the Pentagon, already uneasy with their reliance on SpaceX, were rattled to the core. \n\nSpaceX has become indispensable as it transports astronauts and cargo to the ISS, launches sensitive military satellites, and operates Starlink, the world's largest satellite constellation. \n\nThe flare-up served to remind officials of the risks of tying national interests to a mercurial billionaire.\n\n'When you realize that he's willing to shut everything down just on an impulse … that kind of behavior and the dependence on him is dangerous,' a former space agency official said. \n\nNASA insiders said Musk's threat 'crossed a line,' invoking memories of the 2018 episode when Musk smoked marijuana during a podcast interview, which prompted NASA to launch a safety investigation into SpaceX.\n\nThe clash was also inflamed by the White House's decision to abruptly withdraw Jared Isaacman's nomination as NASA Administrator. \n\nIsaacman, closely aligned with Musk, had twice flown to space aboard SpaceX vehicles.\n\nIn the aftermath, government officials reached out to Jeff Bezos's Blue Origin, RocketLab, and Stoke Space, querying when their rockets might be ready to shoulder critical missions. \n\nFatih Ozmen, CEO of Sierra Space, which is developing the Dream Chaser spaceplane, confirmed that NASA was 'working closely' with his company stating, 'NASA mentioned to us that they want diversity and do not want to rely on a single provider.'\n\nFor some insiders, it wasn't hard to connect the dots: Jeff Bezos, the founder of Blue Origin, has long been a rival to Musk. \n\nNow, with the Biden-era antagonism between Trump and Bezos thawing, some see a political recalibration.\n\nBezos' Blue Origin has lagged behind SpaceX for years, but its New Glenn rocket is finally gaining traction, albeit slowly. \n\nThe Pentagon's recent 'lanes' strategy to diversify launch providers now looks prescient, with officials seeking to avoid 'overreliance on any single provider or solution.'\n\nA source familiar with the Defense Department's strategy said the White House sees an opening to back Bezos as a counterweight to Musk's volatility. 'They want someone who's predictable,' the person said to The Post.\n\nEven Congress appeared to be spooked by the behavior. \n\nA key committee demanded updates on Boeing's long-delayed Starliner capsule, which has struggled to match the reliability of Musk's Dragon. \n\nNASA, under pressure, said Friday that Starliner's next mission could come 'early 2026,' though it remains unclear whether it will fly astronauts or cargo only.\n\nIndeed, just how reliant NASA were on SpaceX was illustrated last year when American astronauts Butch Wilmore and Suni Williams were left on the International Space Station by Boeing's troubled Starliner capsule.\n\nWilmore and Williams had set off for an eight-day Starliner test flight that swelled into a nine-month stay in space\n\nBoeing, which has taken $2 billion in charges on its Starliner development, faces a looming decision by NASA to refly the spacecraft uncrewed before it carries humans again. \n\nBoeing spent $410 million to fly a similar uncrewed mission in 2022 after a 2019 testing failure.\n\nReflying Starliner uncrewed 'seems like the logical thing to do,' Williams said, drawing comparisons with Elon Musk's SpaceX and Russian capsules that flew uncrewed missions before putting humans aboard. She and NASA are pushing for that outcome, Williams added.\n\n'I think that's the correct path,' said Williams, who is 'hoping Boeing and NASA will decide on that same course of action' soon.\n\nResults from Starliner testing planned throughout the summer are expected to determine whether the spacecraft can fly humans on its next flight, NASA officials have said. \n\nTodd Harrison, a defense analyst at the American Enterprise Institute, likened Musk's social media post to 'an embargo of the space station.' \n\n'Musk was saying he is going to cut NASA off from its own laboratory in space,' he added.\n\nHarrison also recalled Musk's refusal to activate Starlink Internet for a Ukrainian military strike in 2022, a decision that raised alarms about national defense being at the mercy of a single CEO. \n\n'The nation's missile defenses could be held hostage to the twittering whims of Elon Musk,' Harrison warned.\n\nFormer NASA astronaut Garrett Reisman, who worked at SpaceX, voiced the fears of many in the astronaut corps: 'When your hopes and dreams are tied up in this, you can't help but think, \"Oh my goodness, am I going to fly in space?\"'\n\nMeanwhile, Trump, who once championed Musk as a visionary, appears to be cooling. \n\nHis allies note that the president has no tolerance for perceived disloyalty and Musk's defiance has not gone unnoticed. \n\nSome aides believe Trump's sharp pivot is personal as much as political.\n\nRocketLab's CEO Peter Beck had previously warned how Musk's acquisition of Twitter, now rebranded as X, and his flirtation with politics could backfire. \n\n'It certainly makes people uncomfortable. At the end of the day, if you're delivering important national security missions, the buck stops with the CEO,' Beck said.\n\nPentagon officials remain wary, not least because few companies have rockets certified for critical national security missions. \n\nBlue Origin's New Glenn has flown once, and United Launch Alliance's Vulcan only twice. RocketLab's Neutron has yet to launch at all.\n\nSpaceX's Falcon 9 still dominates, launching with near clockwork precision. \n\nBut now, Trump's administration appears ready to gamble on fostering competition, even if it means leaning more heavily on Bezos.\n\n'Sierra Space stands ready,' Ozmen declared. Others in the sector are similarly jockeying for position, sensing that Musk's once-unshakable grip may be loosening.","summary":"The Pentagon is urgently courting rivals to SpaceX after Elon Musk's stunning threat to pull NASA's lifeline to the International Space Station.","url":"https://www.dailymail.co.uk/news/article-14790751/Pentagon-hint-Trump-billionaire-Bezons-Musk-fallout.html","image":"https://i.dailymail.co.uk/1s/2025/06/08/00/99144827-0-image-a-26_1749339609196.jpg","video":null,"publish_date":"2025-06-07 23:40:14","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","source_country":"gb","sentiment":-0.459},{"id":329173520,"title":"US agents, protesters clash again in Los Angeles over immigration raids","text":"LOS ANGELES: Federal agents clashed with angry protestors in the Los Angeles area for a second day Saturday (Jun 7), shooting flash-bang grenades into the crowd and shutting part of a freeway amid raids on undocumented migrants, reports said.\n\nThe standoff took place in the suburb of Paramount, where demonstrators had gathered near a Home Depot that was being used as a staging area by federal immigration officials, the Fox 11 news outlet reported.\n\nThey were met by federal agents in riot gear and gas masks, who lobbed flash-bang grenades and tear gas at the crowd, according to news reports and social media posts.\n\nThe immigration raids are part of US President Donald Trump's ongoing crackdown on undocumented immigrants.\n\nThe Republican was elected to a second term largely on a promise to crack down hard on the entry and presence of undocumented migrants - who he likened to \"monsters\" and \"animals.\"\n\nFollowing the latest clashes in Los Angeles, authorities vowed to prosecute offenders and warned of an escalating security presence.\n\n\"We are making Los Angeles safer. Mayor (Karen) Bass should be thanking us,\" Tom Homan, President Trump's point man on border security, said on X. \"We are going to bring the National Guard in tonight.\"\n\nFBI Deputy Director Dan Bongino said multiple arrests had been made following Friday's clashes.\n\n\"You bring chaos, and we'll bring handcuffs. Law and order will prevail,\" he said on X.","summary":"","url":"https://www.channelnewsasia.com/world/us-agents-protesters-clash-again-los-angeles-over-immigration-raids-5170231","image":"https://dam.mediacorp.sg/image/upload/s--oQA4LxnL--/c_crop,h_1237,w_2200,x_0,y_172/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2025/06/08/los_angeles_protests_im","video":null,"publish_date":"2025-06-07 23:38:26","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.142},{"id":329175798,"title":"Trump Signs Revolutionary Executive Order to Reintroduce Supersonic Travel","text":"President Donald Trump aims to address this issue, and on Friday, he took a step by signing an executive order to revive supersonic (faster than the speed of sound) commercial air travel. Named “President Donald J. Trump Takes Action to Lead the World in Supersonic Flight,” the order aims to eliminate restrictive regulations that had previously halted these high-speed flights.\n\nLEADING THE WORLD IN SUPERSONIC FLIGHT: Today, President Donald J. Trump endorsed an Executive Order to advance supersonic aviation in the United States.\n\nAmerica once led the world in supersonic aviation, but decades of stifling regulations grounded progress. This Order removes regulatory barriers so that U.S. companies can dominate supersonic flight once again.\nThe Order directs the Administrator of the Federal Aviation Administration (FAA) to repeal the prohibition on overland supersonic flight, establish an interim noise-based certification standard, and repeal other regulations that hinder supersonic flight.\n\nThe order further outlines various efforts to eliminate regulations and “restore the United States as the clear leader in high-speed aviation.”\n\nBurdensome regulations were why it takes five hours to fly cross-country.\n\nPresident Trump’s EO repeals the prohibition on supersonic flight – letting innovation soar to new heights ✈️https://t.co/s93iRVHspG\n— WHOSTP47 (@WHOSTP47) June 6, 2025","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump aims to address this issue, and on Friday, he&#8230;\n\n\nThis Post: Trump Signs Revolutionary Executive Order to Reintroduce Supersonic Travel first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-signs-revolutionary-executive-order-to-reintroduce-supersonic-travel/","image":"https://internewscast.com/wp-content/uploads/2025/06/Trump-Wants-to-Make-the-Skies-Supersonic-Again-Signs-Game-Changing.jpg","video":null,"publish_date":"2025-06-07 23:37:15","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.258},{"id":329174038,"title":"Trump says Elon Musk could face 'serious consequences' if he backs Democratic candidates","text":"BRIDGEWATER, N.J. -- President Donald Trump is not backing off his battle with Elon Musk, saying Saturday that he has no desire to repair their relationship and warning that his former ally and campaign benefactor could face \"serious consequences\" if he tries to help Democrats in upcoming elections.\n\nTrump told NBC's Kristen Welker in a phone interview that he has no plans to make up with Musk. Asked specifically if he thought his relationship with the mega-billionaire CEO of Tesla and SpaceX is over, Trump responded, \"I would assume so, yeah.\"\n\n\"I'm too busy doing other things,\" Trump continued. \"You know, I won an election in a landslide. I gave him a lot of breaks, long before this happened, I gave him breaks in my first administration, and saved his life in my first administration, I have no intention of speaking to him.\"\n\nThe president also issued a warning amid chatter that Musk could back Democratic lawmakers and candidates in the 2026 midterm elections.\n\n\"If he does, he'll have to pay the consequences for that,\" Trump told NBC, though he declined to share what those consequences would be. Musk's businesses have many lucrative federal contracts.\n\nThe president's latest comments suggest Musk is moving from close ally to a potential new target for Trump, who has aggressively wielded the powers of his office to crack down on critics and punish perceived enemies. As a major government contractor, Musk's businesses could be particularly vulnerable to retribution. Trump has already threatened to cut Musk's contracts, calling it an easy way to save money.\n\nThe dramatic rupture between the president and the world's richest man began this week with Musk's public criticism of Trump's \"big beautiful bill\" pending on Capitol Hill. Musk has warned that the bill will increase the federal deficit and called it a \"disgusting abomination.\"\n\nTrump criticized Musk in the Oval Office, and before long, he and Musk began trading bitterly personal attacks on social media, sending the White House and GOP congressional leaders scrambling to assess the fallout.\n\nAs the back-and-forth intensified, Musk suggested Trump should be impeached and claimed without evidence that the government was concealing information about the president's association with infamous pedophile Jeffrey Epstein. Musk appeared by Saturday morning to have deleted his posts about Epstein.\n\nVice President JD Vance in an interview tried to downplay the feud. He said Musk was making a \"huge mistake\" going after Trump, but called him an \"emotional guy\" getting frustrated.\n\n\"I hope that eventually Elon comes back into the fold. Maybe that's not possible now because he's gone so nuclear,\" Vance said.\n\nVance called Musk an \"incredible entrepreneur,\" and said that Musk's Department of Government Efficiency, which sought to cut government spending and laid off or pushed out thousands of workers, was \"really good.\"\n\nVance made the comments in an interview with \" manosphere\" comedian Theo Von, who last month joked about snorting drugs off a mixed-race baby and the sexuality of men in the U.S. Navy when he opened for Trump at a military base in Qatar.\n\nThe Vance interview was taped Thursday as Musk's posts were unfurling on X, the social media network the billionaire owns.\n\nDuring the interview, Von showed the vice president Musk's claim that Trump's administration hasn't released all the records related to Epstein because Trump is mentioned in them.\n\nVance responded to that, saying, \"Absolutely not. Donald Trump didn't do anything wrong with Jeffrey Epstein.\"\n\n\"This stuff is just not helpful,\" Vance said in response to another post shared by Musk calling for Trump to be impeached and replaced with Vance.\n\n\"It's totally insane. The president is doing a good job.\"\n\nVance also defended the bill that has drawn Musk's ire, and said its central goal was not to cut spending but to extend the 2017 tax cuts approved in Trump's first term.\n\nThe bill would slash spending and taxes but also leave some 10.9 million more people without health insurance and spike deficits by $2.4 trillion over the decade, according to the nonpartisan Congressional Budget Office.\n\n\"It's a good bill,\" Vance said. \"It's not a perfect bill.\"\n\nThe interview was taped in Nashville at a restaurant owned by musician Kid Rock, a Trump ally.","summary":"President Donald Trump is not backing off his battle with Elon Musk, saying that he has no desire to repair their relationship.","url":"https://abc7.com/post/trump-says-elon-musk-could-face-serious-consequences-he-backs-democratic-candidates/16688429/","image":"https://cdn.abcotvs.com/dip/images/16577361_052825-GMA-N1-Musk-Spending-Bill-Wed-PKG-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/kabc/060625-kabc-4a-N1-trump-musk-feud-vid.mp4","publish_date":"2025-06-07 23:32:56","author":"Michelle L. Price And Bill Barrow","authors":["Michelle L. Price And Bill Barrow"],"language":"en","category":"politics","source_country":"us","sentiment":-0.307},{"id":329173294,"title":"As a generation of gay and lesbian people ages, memories of worse — and better — times swirl","text":"By Ashraf Khalil | Associated Press\n\nWASHINGTON — David Perry recalls being young and gay in 1980s Washington, D.C., and having “an absolute blast.” He was fresh out of college, raised in Richmond, Virginia, and had long viewed the nation’s capital as “the big city” where he could finally embrace his true self.\n\nHe came out of the closet here, got a job at the National Endowment for the Arts where his boss was a gay Republican, and “lost my virginity in D.C. on August 27, 1980,” he says, chuckling.\n\nThe bars and clubs were packed with gay men and women — Republican and Democrat — and almost all of them deep in the closet.\n\n“There were a lot of gay men in D.C., and they all seemed to work for the White House or members of Congress. It was kind of a joke. This was pre-Internet, pre-Facebook, pre-all of that. So people could be kind of on the down-low. You would run into congresspeople at the bar,” Perry says. “The closet was pretty transparent. It’s just that no one talked about it.”\n\nHe also remembers a billboard near the Dupont Circle Metro station with a counter ticking off the total number of of AIDS deaths in the District of Columbia.\n\n“I remember when the number was three,” says Perry, 63.\n\nNow Perry, a public relations professional in San Francisco, is part of a generation that can find itself overshadowed amidst the after-parties and DJ sets of World Pride, which wraps up this weekend with a two-day block party on Pennsylvania Avenue. Advocates warn of a quiet crisis among retirement-age LGBTQ+ people and a community at risk of becoming marginalized inside their own community.\n\n“It’s really easy for Pride to be about young people and parties,” says Sophie Fisher, LGBTQ program coordinator for Seabury Resources for Aging, a company that runs queer-friendly retirement homes and assisted-living facilities and which organized a pair of Silver Pride events last month for LGBTQ+ people over age 55.\n\nThese were “the first people through the wall” in the battle for gay rights and protections, Fisher says. Now, “they kind of get swept under the rug.”\n\nLoneliness and isolation\n\nThe challenges and obstacles for elderly LGBTQ+ people can be daunting.\n\n“We’re a society that really values youth as is. When you throw in LGBTQ on top of that, it’s a double whammy,” says Christina Da Costa of the group SAGE — Services and Advocacy for Gay, Lesbian, Bisexual and Transgender Elders. “When you combine so many factors, you have a population that’s a lot less likely to thrive than their younger brethren.”\n\nOlder LGBTQ+ people are far more likely to have no contact with their family and less likely to have children to help care for them, Da Costa says. Gay men over 60 are the precise generation that saw their peer group decimated by AIDS. The result: chronic loneliness and isolation.\n\n“As you age, it becomes difficult to find your peer group because you don’t go out to bars anymore,” says Yvonne Smith, a 73-year-old D.C. resident who moved to Washington at age 14. “There are people isolated and alone out there.”\n\nThese seniors are also often poorer than their younger brethren. Many were kicked out of the house the moment they came out of the closet, and being openly queer or nonbinary could make you unemployable or vulnerable to firing deep into the 1990s.\n\n“You didn’t want to be coming out of a gay bar, see one of your co-workers or one of your students,” Smith says. “People were afraid that if it was known you were gay, they would lose their security clearance or not be hired at all.”\n\nIn April, founders cut the ribbon on Mary’s House, a new 15-unit living facility for LGBTQ+ seniors in southeast Washington. These kind of inclusive senior-care centers are becoming an increasing priority for LGBTQ+ elders.\n\nRayceen Pendarvis, a D.C. queer icon, performer and presenter, says older community members who enter retirement homes or assisted-living centers can face social isolation or hostility from judgmental residents.\n\n“As we age, we lose our peers. We lose our loved ones and some of us no longer have the ability to maintain our homes,” says Pendarvis, who identifies as “two-spirit” and eschews all pronouns. “Sometimes they go in, and they go back into the closet. It’s very painful for some.”\n\nA generation gap\n\nPerry and others see a clear divide between their generation and the younger LGBTQ+ crowd. Younger people, Perry says, drink and smoke a lot less and do much less bar-hopping in the dating-app age.\n\nOthers can’t help but gripe a bit about how these youngsters don’t know how good they have it.\n\n“They take all these protections for granted,” Smith says.\n\nThe younger generation “got comfortable,” Pendarvis says, and sometimes doesn’t fully understand the multigenerational fight that came before.\n\n“We had to fight to get the rights that we have today,” Pendarvis said. “We fought for a place at the table. We CREATED the table!”\n\nNow that fight is on again as President Donald Trump’s administration sets the community on edge with an open culture war targeting trans protections and drag shows, and enforcing a binary view of gender identity.\n\nThe struggle against that campaign may be complicated by a quiet reality inside the LGBTQ+ community: These issues remain a topic of controversy among some LGBTQ+ seniors.\n\nPerry said he has observed that some older lesbians remain leery of trans women; likewise, he said, some older gay men are leery of the drag-queen phenomenon.\n\n“There is a good deal of generational sensitivity that needs to be practiced by our older gay brethren,” he says. “The gender fluidity that has come about in the last 15 years, I would be lying if I said I didn’t have to adjust my understanding of it sometimes.”\n\nDespite the internal complexities, many are hoping to see a renewed sense of militancy and street politics in the younger LGBTQ+ generation. Sunday’s rally and March for Freedom, starting at the Lincoln Memorial, is expected to be particularly defiant given the 2025 context.\n\n“I think we’re going to see a whole new era of activism,” Perry says. “I think we will find our spine and our walking shoes – maybe orthopedic – and protest again. But I really hope that the younger generation helps us pick up this torch.”","summary":"Advocates warn of a quiet crisis among retirement-age LGBTQ+ people and a community at risk of becoming marginalized inside their own community.","url":"https://www.mercurynews.com/2025/06/07/as-a-generation-of-gay-and-lesbian-people-ages-memories-of-worse-and-better-times-swirl/","image":"https://www.mercurynews.com/wp-content/uploads/2025/06/World_Pride_The_Silver_Factor_12864-1.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-07 23:28:10","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.295},{"id":329173852,"title":"'Haven't given up': minister seeks tariff breakthrough","text":"Australia's trade minister remains confident tariffs imposed by the US will be removed, ahead of a likely meeting between Anthony Albanese and Donald Trump.\n\nThe two leaders could meet on the sidelines of the G7 summit in Canada next week, with the economic measures imposed by the US president around the world set to dominate discussions.\n\nAs Australia looks to negotiate for an exemption on tariffs, Trade Minister Don Farrrell was optimistic a deal could be reached.\n\n\"I certainly haven't given up on the prospect of getting these tariffs removed, and every opportunity I get, I'll continue to pursue that argument with the United States,\" he told Sky News on Sunday.\n\n\"There is no justification for the United States to impose tariffs on Australia ... we want all of the tariffs removed, not just some of them.\"\n\nMr Trump recently signed off on doubling tariffs on exports on steel and aluminium from 25 to 50 per cent.\n\nAll other Australian exports to the US have been slapped with a 10 per cent tariff.\n\nSenator Farrell met with US trade representative Jamieson Greer last week and said he pushed the case for all of the economic measures to be removed.\n\nThe minister was hopeful a similar approach that removed $20 billion worth of tariffs on Australian goods entering China could be used with America.\n\n\"We didn't retaliate on that occasion, and bit by bit, we managed to get all of those tariffs that had been applied on Australia by China removed. I'd like to do the same with the United States,\" he said.\n\n\"It's only by open discussion, honest discussion with out allies in the United States that I think we can do that.\"\n\nAs the US Defence Secretary Pete Hegseth urged Australia to increase its defence spending by billions of dollars to 3.5 per cent of GDP, Senator Farrell said the federal government had already proved its commitment through the AUKUS submarine deal.\n\nAustralia is looking to up its total spent on defence to 2.3 per cent.\n\n\"We are committed to the defence of this country, we are committed to a significant uplift in the amount of spending,\" Senator Farrell said.\n\n\"(AUKUS) is going to be a project that's worth more than $360 billion, so I think we've talked the talk.\"\n\nPrime Minister Anthony Albanese signalled on Friday negotiations on opening up access to US beef into Australia could be on the table as part of tariff negotiations.\n\nHowever, he said biosecurity would not be compromised in order to reach an agreement.","summary":"Don Farrell says he is still optimistic about an agreement with the US on removing tariffs, despite uncertainty surrounding trade.","url":"https://thewest.com.au/politics/havent-given-up-minister-seeks-tariff-breakthrough-c-18961340","image":"https://images.thewest.com.au/publication/C-18961340/8b90670489fbe6d5c240760b2c675652bcfd3c5f-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-06-07 23:25:57","author":"Andrew Brown,Andrew Brownaapsun","authors":["Andrew Brown","Andrew Brownaapsun"],"language":"en","source_country":"au","sentiment":-0.439},{"id":329171806,"title":"Bill Maher mocks Dems for trying to find ‘their Joe Rogan,’ suggests figuring out how they lost him","text":"“Real Time” host Bill Maher mocked the Democratic Party’s attempt to find “their Joe Rogan,” pointing out the irony that the podcaster had leaned left until he became disillusioned with the party.\n\nThe host explained, “One idea that’s getting a lot of attention is the Dems need to find their Joe Rogan, a liberal Joe Rogan.” Maher argued that rather than “conjuring up a new Joe Rogan,” Democrats should be asking themselves how they lost him in the first place.\n\nRogan previously endorsed Sen. Bernie Sanders, D-Vt., in the 2020 election. It wasn’t until 2024 that Rogan publicly endorsed President Donald Trump.\n\nThe “Real Time” host lampooned the idea that the real reason why former Vice President Kamala Harris lost the 2024 election is because “Republicans have a podcast.”\n\n“Okay, maybe. Or, you could consider this,” Maher jeered. “Instead of conjuring up a new Joe Rogan, ask yourself why you lost the old one, because he used to be on your side.”\n\nIn 2024, regarding the Democratic desire to find its own Rogan, the podcaster said, “They had me.” “I was on their side,” he added.\n\nMaher compared Rogan’s political transformation to Tesla CEO Elon Musk, who was also a liberal who ended up being “driven to the other camp by bad attitudes and bad ideas.”\n\nMaher noted that he’s watched the political evolution of both Rogan and Musk and their party affiliations didn’t switch “overnight.”\n\nMaher referenced a 2022 post on then-Twitter from Elon Musk in which he shared a chart depicting his feeling that the Democratic Party had moved too far to the left for him, rather than his ideology moving to the right.\n\nRogan said that Democrats have moved so far that it “left a basically liberal centrist like him — now labeled a conservative,” adding that he related to Musk’s post.\n\nMaher also highlighted attempts by the left to cancel Rogan and Musk as a key reason they abandoned the party.\n\n“They tried real hard to cancel Rogan a few years ago — and when Elon hosted ‘Saturday Night Live’ in 2021, well before he was a Trumper — some of the cast gave him the cold shoulder for the sin of being rich,” he recalled. “You think people don’t remember when you do this s— to them?”\n\nThe late-night host asserted that while he’s never left the party, Democrats need to work hard to get “all the guys in America like Joe and Elon” back on their side, but assured them that it’s still possible.","summary":"'Instead of conjuring up a new Joe Rogan, ask yourself why you lost the old one, because he used to be on your side,' the HBO host told Democrats.","url":"https://nypost.com/2025/06/07/media/bill-maher-mocks-dems-for-trying-to-find-their-joe-rogan/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-9xuij11hd-1749329597441.jpg?quality=75&strip=all&1749315212&w=1200","video":"https://cdn.jwplayer.com/videos/ZzrW394W-RyIcpnTz.mp4","publish_date":"2025-06-07 23:15:29","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.545},{"id":329180370,"title":"Four killed in Russian attacks on Ukraine as Moscow continues to retaliate for Kyiv's drone strike","text":"At least four people were killed in eastern Ukraine and more than two dozen were injured, including a baby and a 14-year-old, after Russia launched drone-and-missile and bomb attacks Saturday, Ukraine officials said. Russia launched 215 missiles and drones on Kharkiv, the war-torn nation’s second-largest city, in the early hours of Saturday, killing three people and wounding more than 40 others, Ukrainian officials said. Later in the day, Russia dropped bombs on Kharkiv’s city center, killing at least one more person and injuring five. \"What the Russians want is the complete destruction of life,\" Ukrainian President Volodymyr Zelenskyy said Saturday after the attacks. TRUMP SUGGESTS TAKING A STEP BACK FROM UKRAINE PEACE TALKS \"In more than 11 years of Russia’s war against Ukraine, they have brought only one new thing to our land, the most widespread Russian ‘legacy,’ ruins and death,\" Zelenskyy added. \"We must continue resisting this. I thank everyone around the world who is helping. The Russians are preparing to continue the war and are ignoring all peace proposals. They must be held accountable.\" Zelenskyy said Ukraine would work to strengthen its air defense, adding, \"We urgently need positive signals from the United States regarding air defense systems. We are still waiting for a response to our request to purchase systems that can help.\" He also thanked other European countries for sending supplies. \"We must also achieve results in joint production of air defense systems and missiles. This is absolutely essential for our whole Europe,\" he added. \"Only time separates us from that result, and what matters most is shortening that time.\" \"This is another savage killing,\" he wrote on X along with graphic photos of some of the injured. \"Aerial bombs were dropped on civilians in the city — there is even a children’s railway nearby. This makes no military sense.\" He called the attack \"pure terrorism. And this has been going on for more than three years of the full-scale war. This cannot be ignored. This cannot be turned a blind eye to. And this is not some kind of game. Every day, we lose our people only because Russia feels it can act with impunity. Russia must be firmly forced into peace.\" RUSSIA LAUNCHES LARGEST AERIAL ATTACK OF UKRAINE WAR, KILLING AT LEAST 12 Last Sunday, Ukraine launched a surprise drone attack on Russian territory that destroyed 40 Russian planes, according to Kyiv. In his evening address, Zelenskyy said 117 drones had been used in the operation. He claimed the operation was headquartered out of an office next to the local FSB, the Russian intelligence agency. On Friday, Russia launched another drone attack on six territories in Ukraine that killed six people, including a baby, and injured 80, according to Ukraine officials. The attack came after President Donald Trump had a call with Russian President Vladimir Putin in which the Russian leader said he planned to retaliate. Trump responded to the attacks Friday, telling reporters on Air Force One, \"Well, they gave Putin a reason to go in and bomb the hell out of them last night. … When I saw it, I said, ‘Here we go, now it’s going to be a strike.’\" On Thursday, Trump also compared the Russia-Ukraine war to children. \"Sometimes you see two young children fighting like crazy. They hate each other, and they're fighting in a park, and you try and pull them apart, they don't want to be pulled,\" Trump said in the Oval Office. \"Sometimes you're better off letting them fight for a while and then pulling them apart.\" CLICK HERE TO GET THE FOX NEWS APP Ukraine and Russia have so far held two rounds of peace talks with few tangible results.","summary":"Russia launched a massive attack on Ukraine&apos;s Kharkiv, killing four and injuring dozens. President Zelenskyy condemned the violence and appealed for urgent air defense assistance.","url":"https://www.foxnews.com/world/four-killed-russian-attacks-ukraine-as-moscow-continues-retaliate-kyiv-drone-strike","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/ukraine-1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-07 23:10:18","author":"Brie Stimson","authors":["Brie Stimson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.235},{"id":329174556,"title":"Why Republicans are allergic to apologies","text":"This past week, Republican Sen. Joni Ernst of Iowa came under intense criticism after she told a constituent “we all are going to die” in response to concerns about millions of Americans losing health insurance if President Donald Trump’s “One Big, Beautiful Bill Act” passes.\n\nBut Ernst didn’t apologize for her callous, flippant comment. In fact, she doubled down.\n\n“I made an incorrect assumption that everyone in the auditorium understood that yes, we are all going to perish from this Earth. So I apologize. And I’m really, really glad that I did not have to bring up the subject of the tooth fairy as well,” Ernst said in a video mocking her critics.\n\nIn refusing to back down, Ernst was following a playbook written by no other than Dear Leader Trump.\n\nWhen he first ran for president in 2016, Trump’s campaign was rocked right before the election by the release of the infamous “Access Hollywood” recording, which revealed Trump bragging about sexually assaulting women and joking about how he would “grab them by the pussy.”\n\nHe didn’t apologize for what he said, even after it was condemned by some Republicans—who would eventually rally around him anyway. His electoral college victory in the subsequent election appeared to validate the strategy.\n\nTrump has also refused to apologize for an 1989 series of advertisements he placed in several New York publications calling for the execution of the Exonerated Five, the five Black and Latino men who were wrongly accused of raping and assaulting a woman jogging in Central Park.\n\nMore recently, Trump said during an April town hall on NewsNation that he hadn’t made any mistakes in his presidency, despite negative approval ratings and a slew of indicators showing that his policies—like his tariffs—are hurting the economy.\n\n“I don’t really believe I’ve made mistakes,” he said.\n\nBut Trump isn’t alone in the annals of GOP leaders refusing to apologize.\n\nPresident George W. Bush repeatedly lied to the public, asserting that Iraq had weapons of mass destruction, to justify the 2003 invasion of Iraq. There were no weapons, but Bush never apologized. In fact, Bush gave a presentation at the 2004 Radio and Television Correspondents Dinner joking about the failure to find the weapons. Ultimately, more than 4,400 Americans died during the hunt for nonexistent weapons in Iraq.\n\nSimilarly, after the Watergate scandal was directly connected to President Richard Nixon, and a system of illegal campaign donations, payoff, and sabotage was exposed, Nixon also didn’t apologize. Instead, he asserted that he was “not a crook” and had done nothing wrong. Nixon ultimately became the only president to resign from office when it became clear that he would likely be impeached. He was later pardoned by his successor, President Gerald Ford.\n\nRepublicans have learned, particularly following Trump’s success, that they can simply hunker down and weather controversies. Inevitably, the media will stop asking about the offense and become obsessed with the next story of the day—often a false controversy generated by the right.\n\nRight-leaning media outlets, particularly Fox News, are a useful tool for the right to escalate misinformation and attacks while defending Republicans from fallout. By contrast, Democrats have a serial habit of issuing apologies.\n\nFor instance, then-Senator Barack Obama apologized in 2008 for saying that many rural Americans “cling to guns or religion.”\n\n“If I worded things in a way that made people offended, I deeply regret that,” he said.\n\nIn a similar vein, when Joe Biden was campaigning for the presidency in 2019, he issued a public apology after he appeared to praise segregationists in the Senate for working with him.\n\n“I’m sorry for any of the pain or misconception that I caused anybody,” he said.\n\nAnd back in 1998, when the scandal of his affair with White House intern Monica Lewinsky was unfolding, President Bill Clinton released a statement apologizing to the country for his sexual indiscretion.\n\nSometimes Republicans have paid a price for promoting lies and refusing to apologize. As the coronavirus pandemic escalated, Trump issued lie after lie about the virus, even claiming at one point that COVID-19 would melt away as temperatures increased.\n\nBiden, his opponent, relentlessly criticized him over the issue and kept his failed response in the news and a critical part of the campaign. Biden ultimately won the election, and exit polls showed that he won the support of 61% of voters who said the rise in COVID-19 cases was “the most important factor” in their vote.\n\nStill, failing to apologize has won out for Republicans so often that it’s become the default. And as Ernst has shown us, the strategy isn’t going away anytime soon.","summary":"This past week, Republican Sen. Joni Ernst of Iowa came under intense criticism after she told a constituent “we all are going to die” in response to concerns about millions of Americans losing health insurance if President Donald Trump’s “One Big, Beautiful Bill Act” passes.\n\n\n\nBut Ernst didn’t apologize for her callous, flippant comment. In fact, she doubled down.\n\n\n\n“I made an incorrect assumption that everyone in the auditorium understood that yes, we are all going to perish from this Earth. So I apologize. And I’m really, really glad that I did not have to bring up the subject of the tooth fairy as well,” Ernst said in a video mocking her critics.\n\n\n\n\n\n\n\n\nx\n\n\nx\nYouTube Video\n\n\n\n\n\n\nIn refusing to back down, Ernst was following a playbook written by no other than Dear Leader Trump.\n\n\n\nWhen he first ran for president in 2016, Trump’s campaign was rocked right before the election by the release of the infamous “Access Hollywood” recording, which revealed Trump bragging about sexually assaulting women and jok","url":"https://www.dailykos.com/story/2025/6/7/2326205/-Why-Republicans-are-allergic-to-apologies?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1440835/story_image/ETR_6.6.png?1749225987","video":null,"publish_date":"2025-06-07 23:00:02","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.398},{"id":329169138,"title":"Crunch talks with President Trump over a US-UK trade deal in doubt over new Chinese 'super-embassy' in London, with the White House said to be 'very concerned'","text":"Crunch talks over a UK trade deal with Donald Trump have been thrown into jeopardy by plans for a new Chinese ‘super- embassy’ in London, diplomatic sources have revealed.\n\nWhite House sources said the US Government was ‘very concerned’ about the risk the embassy posed to America’s interests in the City as a result of Beijing’s spies potentially tapping into sensitive financial cables.\n\nAs a result, Washington’s trade deal negotiators are understood to have asked for a ‘China lock’ as part of the talks, which would guarantee the development will not present a security threat to the US.\n\nAmerican officials are now also more concerned about the risk of sharing high-grade intelligence with Britain.\n\nA source said: ‘The issue has led to undoubted tension during the talks. The British have been desperate to play down the concerns, even though their own intelligence services have made their worries clear.’ \n\nIt comes as British negotiators are racing to implement the trade deal struck in principle between Mr Trump and Sir Keir Starmer, which would exempt the UK from crippling steel tariffs imposed by the US President.\n\nNo 10 controversially revived plans for the new development on the site of the Royal Mint buildings by the Tower of London, despite them being blocked by the previous government after warnings from MI5 and Scotland Yard.\n\nThe Bank of England has also warned No 10 about the risks of allowing it to be built close to sensitive financial centres in the City. Mapping data shows that the proposed site for the embassy lies directly between financial hubs in the City and Canary Wharf and close to three major data centres, including the Stock Exchange.\n\nEarlier this year, The Mail on Sunday revealed that planning documents for the embassy included ‘spy dungeons’ – two suites of anonymous basement rooms and a tunnel, with their purpose redacted for security reasons.\n\nThe Government has refused to disclose whether it is backing the plans in order to boost trading relations with the Chinese. Within a fortnight of Rachel Reeves returning from an official visit to China earlier this year, both Scotland Yard and Tower Hamlets Council mysteriously dropped their objections to the project.\n\nShadow levelling up secretary Kevin Hollinrake has said the lack of information about the ‘dungeons’ was ‘striking’, adding: ‘There is a chilling prospect that it could be used for the abduction, intimidation or torture of anti-Chinese dissidents living in the UK.’\n\nThe Chinese have dismissed claims the embassy could be an espionage hub, saying: ‘Anti-China elements are always keen on slandering and attacking China.’\n\nIntelligence activity by Chinese spies is said to be at an all-time-high in the UK, with agents believed to be eavesdropping on political figures by bugging buildings in Whitehall and park benches.","summary":"White House sources said the US Government was 'very concerned' about the risk the embassy posed to America's interests in the City as a result of Beijing's spies potentially tapping into sensitive cables.","url":"https://www.dailymail.co.uk/news/article-14790849/US-UK-trade-deal-Chinese-super-embassy-London.html","image":"https://i.dailymail.co.uk/1s/2025/06/07/23/99144677-0-image-m-132_1749336655877.jpg","video":null,"publish_date":"2025-06-07 22:57:37","author":"Editor,Glen Owen","authors":["Editor","Glen Owen"],"language":"en","category":"politics","source_country":"gb","sentiment":0.079},{"id":329170130,"title":"U.S. immigration authorities extend activity in Los Angeles area amid street protests","text":"U.S. immigration authorities extended activity in Los Angeles area on Saturday in the wake of protests at a federal detention facility and a police response that included tear gas, flash-bangs and the arrest of a union leader.\n\nBorder patrol personnel in riot gear and gas masks stood guard outside an industrial park in the city of Paramount, deploying tear gas as bystanders and protesters gathered on medians and across the street, some jeering at authorities while recording the events on smartphones.\n\n“ICE out of Paramount. We see you for what you are,” a woman announced through a megaphone. “You are not welcome here.”\n\nOne hand-held sign said, “No Human Being is Illegal.”\n\nThe boulevard was closed to traffic as U.S. Border Patrol circulated through the area. ICE representatives did not respond immediately to email inquiries about weekend enforcement activities.\n\nArrests by immigration authorities in Los Angeles come as U.S. President Donald Trump and his administration push to fulfil promises to carry out mass deportations across the country.\n\nOn Friday, Immigration and customs enforcement officers arrested more than 40 people as they executed search warrants at multiple locations, including outside a clothing warehouse where a tense scene unfolded as a crowd tried to block agents from driving away.\n\nLos Angeles Mayor Karen Bass said the activity was meant to “sow terror” in the nation’s second-largest city.\n\nIn a statement on Saturday, ICE’s acting director Todd Lyons chided Bass for the city’s response to protests.\n\n“Mayor Bass took the side of chaos and lawlessness over law enforcement,” Lyons said in a statement. “Make no mistake, ICE will continue to enforce our nation’s immigration laws and arrest criminal illegal aliens.”\n\nProtesters gathered Friday evening outside a federal detention centre in Los Angeles where lawyers said those arrested had been taken, chanting “set them free, let them stay!”\n\nOther protesters held signs that said “ICE out of LA!” and led chants and shouted from megaphones. Some scrawled graffiti on the building facade.\n\nFederal agents executed search warrants at three locations, including a warehouse in the fashion district of Los Angeles, after a judge found there was probable cause the employer was using fictitious documents for some of its workers, according to representatives for Homeland Security Investigations and the U.S. Attorney’s Office.\n\nAdvocates for immigrant rights say people were detained Friday by immigration authorities outside Home Depot stores and a doughnut shop.","summary":"Advocates for immigrant rights say people were detained Friday by immigration authorities outside Home Depot stores and a doughnut shop.","url":"https://globalnews.ca/news/11218431/los-angeles-protests-june-immigration/","image":"https://globalnews.ca/wp-content/uploads/2025/06/LAProtest.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-06-07 22:57:05","author":"Globalnews Digital,The Associated Press","authors":["Globalnews Digital","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.032}]}