{"offset":0,"number":50,"available":24189,"news":[{"id":397464200,"title":"Russia invites Zelensky to Moscow for Ukraine peace talks","text":"The Kremlin said on Thursday (January 29) that Russia has again invited Ukrainian President Volodymyr Zelensky to come to Moscow for peace talks, as US-led diplomatic efforts to end the nearly four-year war in Ukraine gather pace.Kremlin spokesman Dmitry Peskov said Moscow had yet to receive a response from Kyiv. “We have reiterated our invitation, but so far there has been no answer,” he was quoted as saying by Interfax.US-mediated talks add momentumThe comments came amid fresh diplomatic activity following Washington-mediated peace talks in Abu Dhabi last weekend, which officials say have injected new momentum into stalled negotiations.A further round of talks between Russian and Ukrainian delegations is scheduled for Sunday in Abu Dhabi. US President Donald Trump, who has pushed for a deal to end what he has called Europe’s biggest conflict since World War Two, said earlier this week that “very good things” were happening in the process.An unnamed US official told Axios that Zelensky and Russian President Vladimir Putin were “very close” to agreeing to a face-to-face meeting.Fighting continues despite diplomacyDespite the renewed diplomatic push, fierce fighting continues on the ground. Ukraine is grappling with widespread power outages following recent Russian missile strikes, while both sides on Thursday carried out another exchange of war dead.The Kremlin declined to comment on reports that Moscow and Kyiv may have agreed to halt strikes on each other’s energy infrastructure.Deep divisions over territoryMajor disagreements remain, particularly over territory. US Secretary of State Marco Rubio described the issue of “who gets what territory” as the central problem that is “very difficult” to resolve.Russia wants Ukrainian forces to withdraw from parts of the Donetsk region still under Kyiv’s control, while Ukraine has rejected any proposal to cede territory not taken by Russian forces on the battlefield.Kyiv has argued that conceding such land would only create a platform for future Russian advances.Security guarantees and nuclear plantOther sticking points include the possible deployment of international peacekeepers or monitors in post-war Ukraine and the fate of the Russian-controlled Zaporizhzhia nuclear power plant.Kremlin foreign policy aide Yuri Ushakov said any meeting between Putin and Zelensky would need to be “well prepared and results-oriented,” adding that Zelensky’s safety would be guaranteed if he travelled to Moscow.Zelensky rejected a similar invitation last year, saying he could not visit the capital of a country that was “firing missiles at Ukraine every day,” and instead suggested Putin come to Kyiv.Lavrov questions US guaranteesRussian Foreign Minister Sergei Lavrov cast doubt on the viability of US-backed security guarantees for Ukraine, suggesting they would not bring lasting peace if they were designed to keep Ukraine’s current leadership in power.Ushakov said he did not view territorial issues as the only key obstacle remaining in the talks.","url":"https://www.livemint.com/news/world/russia-invites-zelensky-to-moscow-for-ukraine-peace-talks-11769707773114.html","image":"https://www.livemint.com/lm-img/img/2026/01/29/1600x900/logo/RUSSIA-UAE--30_1769708257700_1769708263431.JPG","video":null,"publish_date":"2026-01-30 19:10:51","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","category":"politics","source_country":"in","sentiment":-0.062},{"id":397464210,"title":"Gold falls as investors take profits after record high","text":"By Anmol ChoubeyJan 29 (Reuters) - Gold fell on Thursday as investors took profits after a record high, yet prices remained on course for their best month since the 1980s amid heightened economic and geopolitical uncertainty.Spot gold was 1.3% lower at $5,330.20 an ounce by 01:30 p.m. ET (1830 GMT).The metal reversed course, falling more than 5% to a session low of $5,109.62 after touching a record high of $5,594.82 earlier in the session.U.S. gold futures for February delivery settled 0.3% lower at $5,318.40.\"We are seeing a dramatic sell-off after precious metals made new recent all-time highs,\" said David Meger, director of metals trading at High Ridge Futures.However, spot gold prices are still up about 24% for the month and 7% so far this week.UBS on Thursday raised its gold price forecast to $6,200 for the first three quarters of the year, while projecting it to decline to $5,900 by the end of 2026.From crypto money to central banks, demand for gold is widening as \"precious metals are well in the limelight and investors always like to go where they can get high returns,\" said GoldSilver Central managing director Brian Lan.Adding to geopolitical uncertainty, U.S. President Donald Trump on Wednesday pressed Iran to negotiate a nuclear deal, while Tehran threatened retaliation against the U.S., Israel, and allies. On Wednesday, crypto-group Tether's CEO said it plans to allocate 10%-15% of its investment portfolio to physical gold, while the world's largest gold-backed exchange-traded fund, SPDR Gold Trust, saw holdings at a nearly 4-year high.The U.S. Federal Reserve left rates unchanged on Wednesday, as investors awaited Trump's announcement of a replacement for central bank chair Jerome Powell, whose term ends in May. Markets expect the central bank to next trim rates in June.Spot silver lost 2.1% at $114.141 an ounce after reaching $121.64. It has surged more than 60% so far this month, fuelled by supply deficits and momentum buying.The silver, platinum and palladium markets are small relative to gold or the S&P 500, making them vulnerable to speculative inflows that have left prices \"totally detached from where physical demand is robust,\" said Guy Wolf, global head of market analytics at Marex.Spot platinum fell 3.2% to $2,602.85 an ounce, having hit a record high of $2,918.80 on Monday, while palladium dropped 3.7% to $1,996.65.(Reporting by Anmol Choubey, Ashitha Shivaprasad, Sarah Qureshi and Anushree Mukherjee in Bengaluru; Editing by Kirsten Donovan, Tasim Zahid and Leroy Leo)","url":"https://www.livemint.com/market/gold-falls-as-investors-take-profits-after-record-high-11769711777015.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/market_2_1733466021722_1733466033367.jpg","video":null,"publish_date":"2026-01-30 18:36:16","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"business","source_country":"in","sentiment":-0.154},{"id":397464196,"title":"Trump Says Putin Agreed to Halt Ukraine Bombing During Cold Snap","text":"US President Donald Trump said he had successfully appealed to Russian President Vladimir Putin to halt bombing of cities and towns in Ukraine as the country prepares for an extreme cold snap.“I personally asked President Putin not to fire into Kyiv and the various towns for a week, and he agreed to do that,” Trump said Thursday during a Cabinet meeting at the White House.Trump said leadership in Ukraine “almost didn’t believe it” but were “very happy” with the Russian leader’s pledge. “On top of everything else, that’s not what they need — is missiles coming into their towns and cities,” Trump said.The Russian embassy in Washington did not immediately respond to a request for comment. Russian attacks killed six people in Ukraine on Thursday, AFP reported, citing local authorities.Temperatures are expected to plunge far below freezing across Ukraine this week. Many people in the country are facing heating and electricity outages with infrastructure damaged by recent Russian attacks. President Volodymyr Zelenskiy said Wednesday he believed, based on intelligence, that Russia was preparing a large-scale drone and missile attack on the country’s energy infrastructure.“Everyone who truly wants peace must think about how to ensure that the Russians are preparing not for new massive attacks but for ending the war,” the Ukrainian leader said in a Telegram post.Trump special envoy Steve Witkoff expressed optimism on the status of ongoing talks to broker an end to the war between Russia and Ukraine, saying there were “lots of good things happening between the counterparties.”“We have a security protocol agreement that’s largely finished, a prosperity agreement that’s largely finished,” he said. “And I think the people of Ukraine are now hopeful and expectant that we’re going to deliver a peace deal sometime soon.”Those discussions are expected to resume early next month.©2026 Bloomberg L.P.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/politics/trump-says-putin-agreed-to-halt-ukraine-bombing-during-cold-snap-11769711588795.html","image":"https://www.livemint.com/lm-img/img/2026/01/29/1600x900/logo/Politics_1545994646567_1769711594237.jpg","video":null,"publish_date":"2026-01-30 18:33:08","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.271},{"id":397527880,"title":"Venezuela opens oil industry to greater private investment","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVenezuela is #1 in the world with respect to proven oil reserves.. \n\n Latest News, Regional \n\nJanuary 29, 2026\n\n\n\n\n Venezuela opens oil industry to greater private investment \n\n\n\n\n\n\n\nCARACAS, Venezuela (AFP) — Venezuela’s legislature on Thursday adopted a bill that throws its oil industry open to private investors, in line with United States (US) demands following the toppling of leader Nicolas Maduro.\n\nLawmakers in the South American country adopted reforms to a hydrocarbons bill that roll back decades of tight state control over foreign investment in the sector.\n\nIn order to lure private capital into an industry reeling from years of US sanctions, the bill also makes the royalties regime more flexible.\n\n“Only good things will come after the suffering,” vowed National Assembly president Jorge Rodriguez, brother of the country’s interim president Delcy Rodriguez.\n\nUnder the legislation, private companies can independently engage in oil exploration and extraction and commercialization without having to enter joint ventures with state oil company PDVSA.\n\nPDVSA was required to hold a majority stake under the previous arrangement.\n\nThe reform lays the ground for the triumphant return of US oil majors to the Caribbean country, less than a month after the US overthrow of Maduro.\n\nUS President Donald Trump had threatened a similar fate for Maduro’s former deputy-turned successor Delcy Rodriguez if she did not give Washington access to Venezuelan crude.\n\nVenezuela has the world’s largest proven reserves of oil but output has fallen from over three million barrels per day in the early 2000s to around 1.2 million today.\n\nThe country is still under a US oil embargo, imposed by Trump in 2019.\n\nSince toppling Maduro, the United States has also moved to take effective control of Venezuela’s oil exports — the backbone of the country’s economy.\n\nA first US-mediated sale of Venezuelan crude netted the South American country $300 million, with another $200 million held in a US-controlled account.\n\n\n\n\n\n\n\n\nTags: Oil Trump Venezuela \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Japan donates two school buses to Muschett High \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n KINGSTON, Jamaica — Students of Muschett High School in Trelawny will benefit from safer, more reliable transportation through a grant agreement with ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Sprinter Sha’Carri Richardson arrested for speeding \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n FLORIDA, United States — Olympic gold medallist Sha’Carri Richardson has been arrested for speeding in Florida, according to United States (US) media ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Dunbeholden beat Cavalier in JPL \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n KINGSTON, Jamaica — Defending champions Cavalier SC lost back-to-back games in the Jamaica Premier League after they were edged 1-0 by Dunbeholden FC ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n JFB reports 26.2 per cent rise in bush fires during 2025 \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n KINGSTON, Jamaica — Bushfires remained a major challenge in 2025, with the Jamaica Fire Brigade (JFB) reporting a 26.2 per cent increase in incidents ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Hidden camera catches alleged Bogue Hill theft, case settled in court \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n ST JAMES, Jamaica — After spending months before the St James Parish Court, the case involving Renae Fletcher, who was allegedly caught on covert vide... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Seven Jamaicans to compete in Millrose Games \n\n\n\n\n\n\n\nJanuary 29, 2026 \n\n\n KINGSTON, Jamaica — World leader in the women’s 60m hurdles, Danielle Williams, is among seven Jamaicans who are expected to compete at Sunday’s 118th... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man fatally shot after allegedly stoning cop in Mandeville \n\n\n\n\n Kasey Williams | Reporter \n\n\n\nJanuary 29, 2026 \n\n\n MANCHESTER, Jamaica — A man said to be of unsound mind was fatally shot after he reportedly hurled stones at the police, resulting in a cop nursing a ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/01/29/venezuela-opens-oil-industry-greater-private-investment/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/01/image_1-191-1024x599.jpg","video":null,"publish_date":"2026-01-30 05:36:19","author":null,"language":"en","source_country":"jm","sentiment":0.118},{"id":397533528,"title":"Trump warns UK about business with China after Starmer-Xi talks","text":"WASHINGTON/BEIJING, Jan 30 - U.S. President Donald Trump has warned the United Kingdom against getting into business with China after British Prime Minister Keir Starmer and Chinese leader Xi Jinping hailed a reset in relations.\n\nWith Western leaders reeling from the unpredictability of Trump, Starmer became the latest to head to China, where he called for a \"more sophisticated relationship\" with improved market access, lower tariffs and investment deals in three-hours of talks with Xi on Thursday.\n\nDuring the premiere of the \"Melania\" film at the Kennedy Center, Trump was asked about the UK pledging greater business cooperation with China, and he told reporters: \"Well, it's very dangerous for them to do that, and it's even more dangerous I think for Canada to get into business with China.\"\n\nStarmer, whose centre-left Labour government has struggled to deliver the economic growth it promised, has made improving relations with the world's second-largest economy a priority.\n\nHis visit comes amid Trump's on-off threats of trade tariffs and pledges to grab control of Greenland, an autonomous territory of Denmark, which have rattled long-standing U.S. allies, such as Britain.\n\nStarmer told reporters on the plane on the way to China that Britain could continue to strengthen economic ties with China - without angering Trump - because of his country's long history of working closely with the United States.\n\n\"The relationship we have with the U.S. is one of the closest relationships we hold, on defence, security, intelligence and also on trade and lots of areas,\" he said.\n\nStarmer said Britain would not have to choose between closer ties with the United States or China, highlighting Trump’s visit to Britain in September where they announced 150 billion pound of U.S investment into Britain.\n\nTrump has threatened to impose tariffs on Canada if it goes through with economic deals struck with China on a recent visit by its leader Mark Carney.\n\nGerman Chancellor Friedrich Merz is expected to travel to China soon and Trump himself has said he will visit in April. REUTERS","url":"https://www.straitstimes.com/asia/trump-warns-uk-about-business-with-china-after-starmer-xi-talks","image":"https://cassette.sphdigital.com.sg/image/straitstimes/d631d76cdd74713647296a0eac5c59cc0db8ec113a54b0a1353b5d70ef871cd6","video":null,"publish_date":"2026-01-30 01:45:23","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.256},{"id":397534788,"title":"Trump warns of 50% tariffs as he moves to decertify Canadian planes","text":"Washington, DC [US], January 30 (ANI): US President Donald Trump on Thursday announced plans to decertify all Canada-made aircraft and warned of imposing a 50 per cent tariff on such planes until American-made Gulfstream jets receive certification in Canada, signalling a fresh escalation in trade tensions between the two countries.In a post on Truth Social, Trump specified that the move would include Bombardier’s Global Express business jet, produced in Quebec. “Canada is effectively prohibiting the sale of Gulfstream products in Canada through this very same certification process,” Trump wrote. “If, for any reason, this situation is not immediately corrected, I am going to charge Canada a 50% Tariff on any and all Aircraft sold into the United States of America.”https://truthsocial.com/@realDonaldTrump/115980983698005555The warning marked another sharp turn in US-Canada relations following a series of trade and policy disputes since Trump returned to office last year.Just hours earlier, CNN reported that Canadian Prime Minister Mark Carney urged Trump to “respect Canadian sovereignty” following reports of meetings between Alberta separatists and US officials, adding to the growing diplomatic strain.Against this backdrop, Trump has also repeatedly threatened broader trade action. Days earlier, he warned that he would impose a 100 per cent tariff on Canada, the US’s second-largest trading partner, should Ottawa proceed with a trade agreement with China.Reiterating that stance on Saturday, Trump issued a fresh warning to Canada and Prime Minister Mark Carney against pursuing economic agreements with Beijing, again threatening steep trade penalties if Ottawa moves ahead.Referring to Carney as “Governor,” Trump said the United States would impose a 100 per cent tariff on Canadian goods should Canada deepen trade ties with China. In another Truth Social post, he wrote, “If Governor Carney thinks he is going to make Canada a ‘Drop Off Port’ for China to send goods and products into the United States, he is sorely mistaken.”Escalating his criticism further, Trump added, “China will eat Canada alive, completely devour it, including the destruction of their businesses, social fabric, and general way of life. If Canada makes a deal with China, it will immediately be hit with a 100% Tariff against all Canadian goods and products coming into the USA. Thank you for your attention to this matter!”Trump also accused Canada of opposing his proposed “Golden Dome” missile defence system over Greenland while expanding economic engagement with China. “Canada is against The Golden Dome being built over Greenland, even though The Golden Dome would protect Canada,” he wrote, adding, “Instead, they voted in favor of doing business with China, who will ‘eat them up’ within the first year!”These remarks followed Carney’s recent visit to Beijing aimed at reviving economic cooperation with China, Canada’s second-largest trading partner after the United States. During the visit, Carney also criticised US and Western policies while addressing the World Economic Forum in Davos.The China trip resulted in an understanding to lower tariffs on certain Canadian agricultural exports and introduce quotas on Chinese electric vehicles entering the Canadian market, with the framework also potentially opening the door to increased Chinese investment in Canada.Marking the first visit by a Canadian leader to China in nearly a decade, the talks were described by both sides as reflecting a changing global environment, with Chinese Premier Xi Jinping welcoming what he termed a “turnaround” in bilateral relations.Speaking earlier about the agreement, Carney appeared to allude to ongoing trade frictions with Washington, describing Canada’s engagement with China as more “predictable” and characterising discussions with Beijing as “realistic and respectful.” (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/trump-warns-of-50-tariffs-as-he-moves-to-decertify-canadian-planes-9865898.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2026-01-30 01:45:01","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":-0.078},{"id":397534858,"title":"President Trump sues IRS, Treasury for $10 billion over tax returns leak","text":"President Donald Trump, two of his sons and his namesake organization sued his own Internal Revenue Service and Treasury Department on Thursday over the unauthorized disclosure of his tax information during his first term, for which a former IRS contractor pleaded guilty in 2023.\n\nIn their suit, the president, Donald Trump Jr., Eric Trump and the Trump Organization accused the two government agencies of failing in their \"duty to safeguard and protect Plaintiffs' confidential tax returns and related tax return information from such unauthorized inspection and public disclosure.\"\n\nIn doing so, the government caused them \"reputational and financial harm, public embarrassment, unfairly tarnished their business reputations, portrayed them in a false light, and negatively affected President Trump, and the other Plaintiffs' public standing.\"\n\nThe plaintiffs are seeking $10 billion in damages. The suit was filed in a federal court in Florida.\n\nIn 2023, Charles Littlejohn, a government contractor with the IRS, pleaded guilty to stealing secret tax information associated with former President Donald Trump and thousands of the nation's wealthiest individuals and leaking the materials to two news organizations in 2019 and 2020.\n\nLittlejohn was sentenced to five years in prison. At his sentencing hearing in 2024, a federal judge characterized Littlejohn's disclosures as \"an attack on our constitutional democracy.\"\n\nThe Treasury and IRS did not immediately respond to requests for comment from ABC News.","url":"https://abc13.com/post/president-trump-sues-irs-treasury-department-10-billion-tax-returns-leak-during-first-term/18504316/","image":"https://cdn.abcotvs.com/dip/images/18504175_012726-cc-ap-trump-generic-img.jpg?w=1600","video":null,"publish_date":"2026-01-30 01:43:35","author":"Lucien Bruggeman And Elizabeth Schulze","authors":["Lucien Bruggeman And Elizabeth Schulze"],"language":"en","category":"politics","source_country":"us","sentiment":-0.633},{"id":397531646,"title":"Trump Threatens Canada With 50% Tariff On Aircraft Sold In US As Feud With Mark Carney Escalates","text":"US President Donald Trump on Thursday threatened Canada with 50% tariff on all aircraft sold in the United States, marking the latest escalation in his trade war with America’s neighbour amid a feud with Canadian Prime Minister Mark Carney.\nTrump said he was retaliating against Canada for refusing to certify jets from Savannah, Georgia-based Gulfstream Aerospace, calling the move “wrongful” and “illegal”. In response, the US would decertify all Canadian aircraft, including planes from its largest aircraft maker, Bombardier.\n“Based on the fact that Canada has wrongfully, illegally, and steadfastly refused to certify the Gulfstream 500, 600, 700, and 800 Jets, one of the greatest, most technologically advanced airplanes ever made, we are hereby decertifying their Bombardier Global Expresses, and all Aircraft made in Canada, until such time as Gulfstream, a Great American Company, is fully certified, as it should have been many years ago,” Trump said on Truth Social, a platform he owns.\n\n“Further, Canada is effectively prohibiting the sale of Gulfstream products in Canada through this very same certification process. If, for any reason, this situation is not immediately corrected, I am going to charge Canada a 50% Tariff on any and all Aircraft sold into the United States of America,” he added.\nThe US Commerce Department had previously imposed duties on a Bombardier commercial passenger jet in 2017 during the first Trump administration, claiming that the company was selling the planes in America below cost. However, the US International Trade Commission in Washington later ruled that Bombardier did not negatively impact the American industry.\nALSO READ: Trump Officials Secretly Met Group Pushing For Oil-Rich Alberta’s Independence From Canada: Report \nRelations between Canada and the US have been strained since Carney visited China earlier this month, and Trump threatened to impose a 100% tariff on goods imported from Canada if it went forward with a planned trade deal with Beijing. Trump has also criticised Canada for opposing his proposed ‘Golden Dome’ missile defence system linked to Greenland, accusing Ottawa of siding with Beijing instead of Washington.\nCarney has previously described China as a more “predictable” and “respectful” partner, underscoring Ottawa’s interest in diversifying its economic relationships even as tensions with the US rise due to Trump’s ’51st state’ rhetoric and his aggressive foreign policy.\nAt the World Economic Forum in Davos last week, Carney condemned economic coercion by great powers on smaller countries without mentioning Trump’s name. He received widespread praise and attention for his remarks, upstaging Trump at the gathering.","summary":"Trump said he was retaliating against Canada for refusing to certify jets from Savannah, Georgia-based Gulfstream Aerospace amid an escalating feud with Mark Carney.","url":"https://www.news18.com/world/trump-threatens-canada-with-50-tariff-on-aircraft-sold-in-us-as-feud-with-mark-carney-escalates-ws-kl-9865864.html","image":"https://images.news18.com/ibnlive/uploads/2025/10/trump-carney-2025-10-52ae832314678c233eaac8ad8aec0844.jpg","video":null,"publish_date":"2026-01-30 01:37:21","author":"Aveek Banerjee,News18","authors":["Aveek Banerjee","News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.048},{"id":397532226,"title":"Trump official says ICE deportation effort in Minneapolis will be more focused","text":"MINNEAPOLIS - U.S. border czar Tom Homan, newly installed as commander of U.S. President Donald Trump's immigration enforcement surge in Minneapolis, said on Thursday that federal agents would focus on targeted operations, shifting away from the broad street sweeps that have drawn widespread outrage.Homan also said he would reduce the 3,000-strong force of agents deployed to the city if he received 'cooperation' from state and local leaders, noting he has had productive meetings with Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey, both vocal critics of the surge.'We can do better,' he said at a news conference, in a rare acknowledgment from a Trump official ​that the operation has not been perfect. 'We made some significant gains, significant coordination and cooperation, and you're going to see some massive changes occurring here in this city.","summary":"U.S. border czar Tom Homan said he would reduce the 3,000-strong force of agents deployed to the city if he received \"cooperation\" from state and local leaders.","url":"https://www.japantimes.co.jp/news/2026/01/30/world/minnesota-deportation-scale-down/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2026/01/30/520224.jpg?v=3.1","video":null,"publish_date":"2026-01-30 01:37:00","author":"Brad Brooks,Ted Hesson,Web Master","authors":["Brad Brooks","Ted Hesson","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.154},{"id":397532080,"title":"Iran Threatens To Hit US Bases, Carriers in Event Of Attack","text":"Paris: Iran threatened Thursday to instantly strike US bases and aircraft carriers in response to any attack, after US President Donald Trump warned time was running out for Tehran and the EU blacklisted its Revolutionary Guards as a terror group. As Brussels and Washington dialled up their own rhetoric and Iran issued stark threats, UN chief Antonio Guterres called for nuclear negotiations to \"avoid a crisis that could have devastating consequences in the region\". An Iranian military spokesman warned Tehran's response to any US action would not be limited -- as it was in June last year when American planes and missiles briefly joined Israel's short air war against Iran -- but would be a decisive response \"delivered instantly\". Brigadier General Mohammad Akraminia told state television US aircraft carriers have \"serious vulnerabilities\" and that numerous American bases in the Gulf region are \"within the range of our medium-range missiles\". \"If such a miscalculation is made by the Americans, it will certainly not unfold the way Trump imagines -- carrying out a quick operation and then, two hours later, tweeting that the operation is over,\" he said. An official in the Gulf, where states host US military sites, told AFP that fears of a US strike on Iran are \"very clear\". \"It would bring the region into chaos, it would hurt the economy not just in the region but in the US and cause oil and gas prices to skyrocket,\" the official added. 'Protests crushed in blood' Qatar's leader Sheikh Tamim bin Hamad Al Thani and Iran's President Masoud Pezeshkian held a call to discuss \"efforts being made to de-escalate tensions and establish stability,\" the Qatar News Agency (QNA) reported. The European Union, meanwhile, piled on the pressure by designating the Islamic Revolutionary Guard Corps (IRGC) a \"terrorist organisation\" over a deadly crackdown on recent mass protests. \"'Terrorist' is indeed how you call a regime that crushes its own people's protests in blood,\" said EU chief Ursula von der Leyen, welcoming the \"overdue\" decision. Though largely symbolic, the EU decision has already drawn a warning from Tehran. Iran's military slammed \"the illogical, irresponsible and spite-driven action of the European Union\", alleging the bloc was acting out of \"obedience\" to Tehran's arch-foes the United States and Israel. Iranian officials have blamed the recent protest wave on the two countries, claiming their agents spurred \"riots\" and a \"terrorist operation\" that hijacked peaceful rallies sparked over economic grievances. Rights groups have said thousands of people were killed during the protests by security forces, including the IRGC -- the ideological arm of Tehran's military. In Tehran on Thursday, citizens expressed grim resignation. \"I think the war is inevitable and a change must happen. It can be for worse, or better. I am not sure,\" said a 29-year-old waitress, speaking on condition of anonymity for fear of reprisals. \"I am not in favour of war. I just want something to happen that would result in something better.\" Another 29-year-old woman, an unemployed resident of an upscale neighbourhood in northern Tehran, told AFP: \"I believe that life has highs and lows and we are now at the lowest point. \"Neither the economic situation, nor our livelihood is good. It is the lowest for me.\" Trump had threatened military action if protesters were killed in the anti-government demonstrations that erupted in late December and peaked on January 8 and 9. But his recent statements have turned to Iran's nuclear programme, which the West believes is aimed at making an atomic bomb. On Wednesday, he said \"time is running out\" for Tehran to make a deal, warning a US naval strike group that arrived in Middle East waters on Monday was \"ready, willing and able\" to hit Iran. Conflicting tolls The US-based Human Rights Activists News Agency (HRANA) said it has confirmed 6,479 people were killed in the protests, as internet restrictions imposed on January 8 continue to slow verification. But rights groups warn the toll is likely far higher, with estimates in the tens of thousands. Iranian authorities acknowledge that thousands were killed during the protests, giving a toll of more than 3,000 deaths, but say the majority were members of the security forces or bystanders killed by \"rioters\". Billboards and banners have gone up in the capital Tehran to bolster the authorities' messages. One massive poster appears to show an American aircraft carrier being destroyed.","summary":"Brigadier General Mohammad Akraminia told state television US aircraft carriers have \"serious vulnerabilities\" and that numerous American bases in the Gulf region are \"within the range of our medium-range missiles\"","url":"https://www.deccanchronicle.com/world/iran-threatens-to-hit-us-bases-carriers-in-event-of-attack-1933684","image":"https://www.deccanchronicle.com/h-upload/2026/01/30/2004819-ra.webp","video":null,"publish_date":"2026-01-30 01:33:21","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.085},{"id":397531200,"title":"Trump sues IRS for $10 billion","text":"President Donald Trump sued the IRS on Thursday for a whopping $10 billion, according to a new report. \n\nThe lawsuit claims the agency failed to prevent the president's tax returns from being leaked during his first administration, NBC News reported. The lawsuit, which was filed in Miami, also claims that Trump is suing the agency in his personal capacity, and not as President of the United States, according to the report. \n\n\"Defendants have caused Plaintiffs reputational and financial harm, public embarrassment, unfairly tarnished their business reputations, portrayed them in a false light, and negatively affected President Trump, and the other Plaintiffs’ public standing,\" NBC News quoted from the lawsuit.\n\nThe lawsuit was filed at a time when Trump was seeking retribution for the way he was treated during his first administration. He has already sued multiple political foes, including Sen. Adam Schiff (D-CA) and New York Attorney General Letitia James. \n\nThe lawsuit against James was dismissed because it was filed by a hand-picked Trump prosecutor who was illegally serving in her role, according to a court order. \n\nTrump's tax returns became a flashpoint during his first administration as Democrats and investigators sought to prove his ties to the Russian government. A former IRS contractor is serving a five-year sentence for leaking Trump's tax returns.","summary":"President Donald Trump sued the IRS on Thursday for a whopping $10 billion, according to a new report. \n\nThe lawsuit claims the agency failed to prevent the president's tax returns from being leaked during his first administration, NBC News reported. The lawsuit, which was filed in Miami, also claims that Trump is suing the agency in his personal capacity, and not as President of the United States, according to the report. \n\n\"Defendants have caused Plaintiffs reputational and financial harm, public embarrassment, unfairly tarnished their business reputations, portrayed them in a false light, and negatively affected President Trump, and the other Plaintiffs’ public standing,\" NBC News quoted from the lawsuit.\n\nThe lawsuit was filed at a time when Trump was seeking retribution for the way he was treated during his first administration. He has already sued multiple political foes, including Sen. Adam Schiff (D-CA) and New York Attorney General Letitia James. \n\nThe lawsuit against James was dismissed because it w","url":"https://www.rawstory.com/trump-2675060653/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-speaks-with-the-media-as-he-heads-to-marine-one-to-travel-to-iowa-from-the-white-house-in-washingto.jpg?id=63350886&width=1200&height=1200&coordinates=213%2C0%2C214%2C0","video":null,"publish_date":"2026-01-30 01:30:16","author":"Robert Davis","authors":["Robert Davis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.641},{"id":397532308,"title":"Inside JD Vance and Wife Usha's Marriage as the Vice Prez Desperately Shoots Down Rumors Their Relationship Is Falling Apart — 'There Are Some Sacrifices'","text":"JD Vance's marriage to his wife, Usha, has come under pressure due to swirling divorce rumors, and now RadarOnline.com can reveal the ins and outs of their longtime relationship.2010: JD Vance and Usha Meet at Law SchoolBefore they became the vice president and second lady of the U.S., JD and Usha were students at Yale Law School, where they first met.\n\n\"We were friends first, because – I mean, who wouldn't want to be friends with JD? He was then, as now, the most interesting person I knew. A working-class guy who had overcome childhood traumas that I could barely fathom,\" Usha said of meeting and falling in love with JD while at the Republican National Convention.\n\nShe added in her speech, \"Although he's a meat and potatoes kind of guy, he adapted to my vegetarian diet and learned to cook food from my mother, Indian food. Before I knew it, he'd become an integral part of my family, a person I could not imagine living without.\"\n\nJD shared a similar sentiment in his 2016 memoir, Hillbilly Elegy.\n\n\"She seemed some sort of genetic anomaly, a combination of every positive quality a human being should have: bright, hardworking, tall, and beautiful,\" he writes.\n\nHe also detailed Usha's role in his success and happiness: \"Even at my best, I'm a delayed explosion – I can be defused, but only with skill and precision. It's not just that I've learned to control myself but that Usha has learned how to manage me.\"2014: JD Vance and Usha Get MarriedJD and Usha exchanged vows at a June 2014 ceremony in Kentucky, months after graduating in 2013. They held both Christian and Hindu ceremonies.\n\nDuring a Turning Point USA event at the University of Mississippi on October 29, JD expressed his hopes that his wife would also convert one day.\n\n\"As I've told her and I've said publicly, and I'll say now in front of 10,000 of my closest friends: Do I hope eventually that she is somehow moved by the same thing that I was moved in by church?\" he shared at the time. \"Yeah, I honestly do. Because I believe in the Christian gospel and I hope eventually my wife comes to see it the same way.\"2017–2021: JD Vance and Usha Welcome Their 3 ChildrenJD and Usha welcomed their first child, Ewan, in June 2017. Their second and third child, Vivek and Mirabel, were born in February 2020 and December 2021, respectively.\n\nThey announced their fourth pregnancy in a joint statement on January 20.\n\n\"We're very happy to share some exciting news,\" the couple captioned the Instagram post. \"Our family is growing!\"\n\nThe statement read, \"We're very excited to share the news that Usha is pregnant with our fourth child, a boy. Usha and the baby are doing well, and we are all looking forward to welcoming him in late July.\"\n\n\"During this exciting and hectic time, we are particularly grateful for the military doctors who take excellent care of our family and for the staff members who do so much to ensure that we can serve the country while enjoying a wonderful life with our children,\" they added.2022: Usha Vance Supports JD's Congress RunA GOP star, JD won the nomination and general election for the U.S. Senate from Ohio in 2022. Usha remained by his side throughout the entire campaign and after he won the position.\n\nShe also supported him every step of the way when Donald Trump tapped JD for the vice presidency.\n\n\"My background is very different from JD's. I grew up in San Diego, in a middle-class community with two loving parents, both immigrants from India, and a wonderful sister,\" she said at the convention. \"That JD and I could meet at all, let alone fall in love and marry, is a testament to this great country.\"August 2024: Usha Vance Defends JD After His 'Childless Cat Ladies' RemarkMonths before the 2024 election, JD sparked controversy when he commented about the U.S. being run by \"childless cat ladies.\"\n\nUsha was quick to defend her husband, explaining during an interview with Fox News, \"The reality is, JD … made a quip in service of making a point that he wanted to make that was substantive. What he was really saying is that it can be really hard to be a parent in this country, and sometimes our policies are designed in a way that makes it even harder.\"November 2024: JD Vance Thanks His 'Beautiful Wife' After Winning the ElectionAfter winning the election, JD took to X to thank his \"beautiful wife.\"\n\n\"THANK YOU!\" he wrote. \"To my beautiful wife for making it possible to do this. To President Donald J. Trump, for giving me such an opportunity to serve our country at this level. And to the American people, for their trust. I will never stop fighting for ALL of you.\"January 2025: Usha Vance Stands by JD's Side As He's Sworn in as Vice PresidentUsha was present at the 2025 inauguration, holding the Bible when JD was sworn in by Supreme Court Justice Brett Kavanaugh.November 2025: JD Vance and Usha Spark Divorce RumorsJD and Usha's marriage was rocked by divorce rumors weeks after he shared an emotional hug with Charlie Kirk's widow, Erika Kirk, at a Turning Point USA event in October 2025.\n\nThe buzz intensified when the second lady was seen without her wedding ring during a November 2025 visit to Camp Lejeune.December 2025: JD Vance Addresss the Split RumorsFollowing weeks of silence, JD dismissed the divorce claims during an interview with NBC News, insisting their relationship was \"as strong as it's ever been.\"\n\n\"I think that we kind of get a kick out of it,\" he said of the speculation. \"With anything in life, you take the good with the bad. You accept that there are some sacrifices and there are some very good things that come along with it, too. But our marriage is as strong as it's ever been, and I think Usha's really taken to it, and it's been kind of cool to see how she's developed and evolved in this new role.\"","summary":"JD Vance and his wife, Usha, have been married since 2014 and share three children.","url":"https://radaronline.com/p/jd-vance-wife-usha-relationship-timeline-divorce-marriage/","image":"https://media.radaronline.com/brand-img/FH88ORp5Q/0x0/jd-vance-wife-usha-relationship-timeline-1769642276598.jpg","video":null,"publish_date":"2026-01-30 01:30:00","author":"Angilene Gacute","authors":["Angilene Gacute"],"language":"en","source_country":"us","sentiment":0.47},{"id":397529888,"title":"It's the MAGA Oscars! Melania Trump stuns at movie premiere alongside Donald... but there's one VERY notable absence on First Lady's big night","text":"Melania and Donald Trump have arrived at the First Lady's star-studded movie premiere as MAGA hosts its very own Oscars night in Washington, DC.\n\nThe First Lady donned a Dolce and Gabbana buttoned dress and black stilettos as she was joined by her husband who wore his signature navy blue suit at the newly renamed Trump-Kennedy Center on Thursday.\n\nThey were joined by a celebrity guestlist including influencers, athletes and pop stars. The President's political allies were also out in force including Defense Secretary Pete Hegseth, Health Secretary RFK Jr. and House Speaker Mike Johnson. \n\n'It really brings back the glamour,' Trump told reporters. 'This is like the good old days when the Academy Awards used to get ratings.' \n\nBut there was a notable absence. Homeland Security Secretary Kristi Noem, who was slated to attend, did not appear on the red carpet. It comes as she is under intense pressure to resign after the fatal shooting of a protester by Border Patrol agents in Minneapolis on Saturday.\n\nTrump showered praise on Noem's rival Tom Homan, newly installed to lead the immigration crackdown in Minnesota. 'I think he's terrific,' Trump said, adding 'But we have to get rid of the criminals.'\n\nThe documentary, titled Melania: Twenty Days to History, chronicles the dramatic lead up to Trump's second inauguration, following the First Lady from Mar-a-Lago to Manhattan. \n\nMelania, asked about her inspiration for the film, told reporters: 'Well it was my life.' \n\n'You will see humor, you will see grief, you will see fashion so I'm very proud of the film,' the 55-year-old told reporters. \n\nTrump mocked his predecessor's contract with Netflix when questioned by a reporter about Amazon's $40 million deal for the movie rights: 'Ask President Obama who got paid a lot of money and hasn't done anything. Melania really produced.' \n\nFormer Trump attorney Alina Habba donned a chic black pant suit and Agriculture Secretary Brooke Rollins wore a glitzy jacket over a dark evening gown as they were among the first luminaries to step out. \n\nShe was followed by Speaker Mike Johnson and his wife Kelly, who bucked the dark theme with a beige dress. The Speaker told the Mail there might be a short government shutdown as Congress battles over ICE funding. \n\nHegseth was joined by his wife Jennifer who wore a glittering midnight-blue jumpsuit, while Administrator of the US Environmental Protection Agency Lee Zeldin's wife Diana stunned in a daring white ensemble.\n\nIt was a family affair for Dr Oz who arrived with wife Lisa and their kids Oliver and Daphne.\n\nHealth Secretary RFK Jr., Special Envoy Steve Witkoff and Trump-Kennedy Center director Ric Grenell donned navy blue suits with white shirts.\n\nThe movie directed by Brett Ratner gives a behind-the-scenes look at one of the most private first ladies in modern history. \n\nThe President and First Lady also held a private screening at the White House the Saturday before release – controversially deciding to go forward with the event just hours after the country was rocked by a CBP agent shooting and killing ICU nurse Alex Pretti in Minneapolis, Minnesota.\n\nMelania told The Five as part of her promotion for the movie on Wednesday that she hopes people will 'know me a little bit more' by watching the film. \n\n'I'm a very private person and a very selective person. What I do, what I don't do; when I talk, when I don't talk. And that's my choice,' she told Fox.\n\n'Nobody is in charge of me and I'm not in charge of anybody else.'\n\nAmazon MGM Studios won a bidding war among Hollywood studios to produce Melania, in what many saw as a way from billionaire owner Jeff Bezos to curry favor with the President.\n\nDisney and Paramount both lost out to the $40 million offering from Amazon.","summary":"The first arrivals for Melania Trump's star-studded movie premiere have arrived on the red carpet.","url":"https://www.dailymail.co.uk/news/article-15510689/Trump-lawyer-Alina-Habba-leads-arrivals-Melania-premiere-star-studded-Kennedy-Center-red-carpet.html","image":"https://i.dailymail.co.uk/1s/2026/01/30/00/105951411-0-image-a-8_1769732161711.jpg","video":"https://video.dailymail.com/video/mol/2025/12/17/6459027646664624403/1024x576_MP4_6459027646664624403.mp4","publish_date":"2026-01-30 01:25:53","author":"Editor,Katelyn Caralle,Nikki Schwab,Phillip Nieto,Ross Ibbetson","authors":["Editor","Katelyn Caralle","Nikki Schwab","Phillip Nieto","Ross Ibbetson"],"language":"en","source_country":"gb","sentiment":0.084},{"id":397533530,"title":"Trump says Putin agreed to not fire on Kyiv for a week during cold","text":"WASHINGTON, Jan 29 - U.S. President Donald Trump said on Thursday that Kremlin leader Vladimir Putin had agreed to refrain from firing on Kyiv and other Ukrainian cities for a week because of cold winter weather.\n\nUkrainian President Volodymyr Zelenskiy said he thanked Washington for the initiative, which he described as halting Russian strikes on energy targets, which have left hundreds of apartments in Kyiv without power during freezing weather.\n\nThere was no immediate comment from Moscow, which had earlier issued a new invitation for Zelenskiy to hold talks in Moscow, an offer already long rejected by the Ukrainian leader.\n\n\"We asked President Putin if they could stop the shooting for a week,\" Trump told reporters at an event in the Oval office.\n\n\"They're being hit with, proportionately, the kind of cold that we're being hit. It's much colder in Ukraine to start off with, but it's really cold. He agreed to do that. We appreciated that very much.\"\n\nEmergency crews were still restoring heating and electricity in Kyiv knocked out by Russian air strikes last Saturday.\n\nKyiv Mayor Vitaly Klitschko said 454 apartment buildings remained without heat, with overnight temperatures dipping to -10 Celsius (18 Fahrenheit) on Friday and even lower next week.\n\n\"We expect the agreements to be implemented,\" Zelenskiy wrote on the X social media platform. \"De-escalation steps contribute to real progress toward ending the war.\" \n\nSpeaking afterwards in his nightly video address, Zelenskiy thanked the United States \"for their efforts in ensuring a stop to strikes on energy (targets) at this time and let's hope that America succeeds in ensuring this\".\n\n\"We shall see what the real situation is with our energy facilities and cities in the days and nights to come,\" he said.\n\nThe United States has been engaged in months of diplomatic activity to secure an accord to end the nearly four-year-old war, the deadliest conflict in Europe since World War Two.\n\nNegotiators from Ukraine, Russia and the United States held unusual three-way contacts last weekend in the United Arab Emirates.\n\nTrump's envoy Steve Witkoff said on Thursday the Russia and Ukraine were discussing the issue of territory and described the talks as having made progress. He said accords on security guarantees and post-war recovery were nearly complete.\n\nUkraine is resisting Russia's demands to cede all its eastern Donbas region, including areas Moscow's military has failed to capture.\n\nKremlin aide Yuri Ushakov said he did not regard the land issue as the only key matter left on the table. \n\nWitkoff said the discussions would resume in about a week, though the next meeting had been scheduled for Sunday.\n\nRussian Foreign Minister Sergei Lavrov cast doubt on the viability of any security guarantees that Washington might be able to provide Ukraine as part of a deal. He expressed doubt that they could lead to an enduring peace if they were designed to keep Ukraine's current political leadership in power. REUTERS","url":"https://www.straitstimes.com/asia/trump-says-putin-agreed-to-not-fire-on-kyiv-for-a-week-during-cold","image":"https://cassette.sphdigital.com.sg/image/straitstimes/3330e48ac5ed80eaa77632e018e865f348b5d2a9822e73ca8d3955feec52aafc","video":null,"publish_date":"2026-01-30 01:25:21","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.061},{"id":397530000,"title":"Donald Trump threatens tariffs on any country selling oil to Cuba","text":"Donald Trump has threatened tariffs on any country providing oil to Cuba.\n\nThe President on Thursday signed an executive order 'declaring a national emergency and establishing a process to impose tariffs on goods from countries that sell or otherwise provide oil to Cuba.'\n\nMexico is Cuba's number one supplier, providing roughly 44 percent of the island's crude in 2025.\n\nWhile the executive order did not specify any tariff rates or single out any countries, Trump has been urging Mexico to cut ties with the Communist-run island.\n\nVenezuela and Russia have historically supplied oil to Cuba, but are already subject to extensive sanctions and tariffs. \n\nFollowing the US military's seizure of ousted Venezuelan President Nicolas Maduro earlier this month, Trump has repeatedly spoken about taking action against Cuba. This week, he noted that 'Cuba will be failing pretty soon,' after Venezuela recently stopped supporting the country with money and oil.\n\nTrump said he had a 'productive' call on Thursday with Mexican President Claudia Sheinbaum.\n\nTrump and Sheinbaum spoke on Thursday about trade and security. It was unclear if the tariff threat was discussed.\n\nTrump, in a Truth Social post, praised Sheinbaum as Mexico's 'wonderful and highly intelligent leader.' He said the conversation went well.\n\nWhile the presidents did not go into detail about what they discussed regarding security, Sheinbaum said both agreed things are going 'very well.'\n\nSheinbaum said that two topics were not discussed on the call: Cuba and critical minerals. She stressed that the two governments are addressing the issues.\n\nThe oil shipments from Mexico have been scrutinized after Trump vowed to stop Cuba from receiving oil and money from Venezuela.\n\nPemex, Mexico’s state oil company, said that 20,000 barrels of oil where being shipped everyday to Cuba from January to September 30 2025, according to the company's most recent report as cited by the Associated Press. \n\nFollowing a visit from US Secretary of State Marco Rubio, Jorge Piñon, an expert at the University of Texas Energy Institute who tracks shipments using satellite technology, said the shipments dropped to 7,000 barrels.\n\nThis week, Sheinbaum described decisions about supplying Cuba with oil as a sovereign matter and appeared to acknowledge that Mexico had stopped some planned shipments to the island.\n\nHowever, she said the temporary pause was part of fluctuating oil supplies but still noted that Mexico would continue to provide humanitarian aid to Cuba in the form of oil.\n\nCuban President Miguel Díaz-Canel said this month the US had no moral authority to force a deal on his country after Trump suggested the island should come to an agreement with the US. \n\nThe US and Mexican government are preparing for high-stakes negotiations later this year on their trilateral trade deal with Canada.\n\n'There is nothing concrete, but it is coming along very well,' Sheinbaum said about the trade deal in her morning press conference. She noted progress on the Trump administration's demand that Mexico address what Washington calls 'non-tariff barriers' to trade.\n\nUnder the trilateral trade deal, negotiated during Trump's first term, the US, Mexico, and Canada must launch a joint review of the trade pact by July 1, its sixth anniversary, to confirm their intention to either renew it for 16 years or make modifications.\n\nThe USMCA deal is the backbone of Mexico's economy, and it replaced the North American Free Trade Agreement in 2020. The agreement has protected Mexico from most of Trump's tariffs.\n\nUS Trade Representative Jamieson Greer, however, has said the deal has 'shortcomings' and is not equipped to deal with surges in exports and investment from non-market economies, such as China, into the region.\n\nTrump this month said the USMCA was 'irrelevant' for the US despite a highly integrated North American economy.","summary":"Mexico is Cuba's number one supplier, providing roughly 44 percent of the island's crude in 2025.","url":"https://www.dailymail.co.uk/news/article-15511211/Donald-Trump-threatens-tariffs-country-selling-oil-Cuba.html","image":"https://i.dailymail.co.uk/1s/2026/01/29/23/105949893-0-image-m-17_1769728663184.jpg","video":null,"publish_date":"2026-01-30 01:24:27","author":"Editor,Ross Ibbetson","authors":["Editor","Ross Ibbetson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.044},{"id":397532208,"title":"Newsom describes calls with anguished rich as he continues opposing billionaire tax","text":"Gov. Gavin Newsom continued his vocal opposition to the proposed billionaire tax measure, saying at a Bloomberg forum event in San Francisco that it would ultimately degrade the state’s tax base as the ultrawealthy left the state.\n\nIt wasn’t a new argument for the governor, who has deep ties to the state’s ultra-wealthy tech barons and has emerged as a fierce opponent of the tax. But Newsom on Thursday described personal, almost intimate conversations with the state’s billionaires, whose concerns about the tax he said he has been fielding for months.\n\n“I’ve met with people who feel they’re being attacked because of it,” he said, “people that have no problem paying more income tax, people that literally are giving away all of their money but want to do it on the timeline that their family has approved.”\n\nNewsom did not name the individuals.\n\n“I’ve met with all of them, and they’re all in different stages of their lives, their careers and their abundance. Some will never give a penny away. Some I respect, some I don’t, some I never have,” he said. “But I met with them as well.”\n\nThe tax’s proponents accused Newsom of misleading voters, as he prepares to leave office next year with the state in a budget deficit that could lead to service cuts. Newsom is widely believed to be considering a presidential run in 2028.\n\n“Unfortunately, it appears that the governor is trying to distract voters and push this crisis onto the next administration – that’s deeply disappointing at a moment when our communities need leadership,” Suzanne Jimenez, the chief of staff for the SEIU-United Healthcare Workers West, the principle union behind the tax, said in a statement to The Sacramento Bee.\n\n“If Governor Newsom could see what frontline healthcare workers see every day—seniors, people with disabilities, and veterans at risk of losing care because of massive federal healthcare cuts in HR1—he wouldn’t be standing in the way of this ballot measure,” she added.\n\nOn Wednesday, a second major labor union, the California Teamsters, threw their weight behind the tax proposal. The billionaire tax campaign is currently in the signature gathering state, and it’s not totally clear if it will make it on the ballot.\n\n“They have the money,” to do so, Newsom noted in Thursday’s interview. If the measure does qualify, it will lead to a highly disputed and expensive fight, given the resources of labor unions and those of the ultrawealthy targeted by the tax.\n\nBut tax proponents say that in an era of soaring wealth inequality, and as Republicans and President Donald Trump continue to cut taxes for the ultrawealthy and corporations, they’re finding receptive ears among voters. In their announcement, the Teamsters cast their entry into the campaign as striking back at the artificial intelligence companies designing technologies that threaten the jobs of the union’s roughly 250,000 members.\n\n“The same Big Tech Billionaires shedding crocodile tears over the idea of paying their fair share of taxes while amassing sky-high piles of cash are exploiting a rigged system that makes delivery workers and bus drivers pay higher rates than the AI executives trying to wipe away our jobs,” Teamsters California Co-Chairs Peter Finn and Victor Mineros said in a statement.\n\nThe tax proposal as designed would apply to residents who had more than $1 billion in assets as of Jan. 1. Opponents, however, have argued the tax’s targets would use their resources to tie the measure up in court, and that it will also lead growing numbers of individuals to leave California. Tech billionaires Peter Thiel and David Sacks are among those who have opened offices and established ties in other states ahead of the Jan. 1 deadline.\n\nBloomberg editor Brad Stone asked Newsom specifically about Google cofounder Sergey Brin, with whom Newsom has a long friendship. Brin has in recent months cut business and personal ties with California, according to media reports. He has re-registered LLCs that control some of his assets to Nevada, according to The New York Times, and recently purchasing a $40 million home on the Nevada side of Lake Tahoe, according to SF Gate.\n\nNewsom said he was “disappointed” at the idea billionaires like Brin may be considering leaving the state, but added that he thinks “they’re disappointed in some respect as well. There’s just a lot of anxiety out there.”\n\nBecause the state has a progressive tax system that collects larger portions of its revenue from the wealthy, Newsom argued the flight of just small numbers of billionaires could significantly degrade the state’s budget pictures in the long run.\n\n“I’m very mindful as the guy who budgets for this state that we rely on a very small number of people that allow us to do very historic things,” he said. The governor is at work at alternative measures, he said.\n\nBut labor union officials disputed that, saying Newsom, whose budget did not include any suggestions to close gaps caused by the federal government’s steep cuts to Medi-Cal and a wide range of social services, isn’t coming up with other answers.\n\n“At no point has Governor Newsom’s office offered an alternative or compromise to address the looming healthcare collapse caused by $100 billion in healthcare cuts,” Jimenez said. “But the 120,000 frontline healthcare workers of SEIU-UHW aren’t waiting for the Governor to act — patients’ lives are at stake, and we are committed to seeing the Billionaire Tax approved by voters this November.”","url":"https://www.sacbee.com/news/politics-government/capitol-alert/article314507206.html","image":"https://www.sacbee.com/wps/source/images/sacbee/facebook.jpg","video":null,"publish_date":"2026-01-30 01:23:00","author":"Andrew Graham","authors":["Andrew Graham"],"language":"en","source_country":"us","sentiment":-0.425},{"id":397530216,"title":"ASEAN does not recognise Myanmar's elections, which military-backed party claims to have won","text":"The Philippines holds ASEAN’s rotating chair this year, taking what would have been Myanmar’s turn after the country was suspended from chairing the meeting after the military's seizure of power.\n\nFounded in 1967 in the Cold War era, ASEAN has an unwieldy membership of diverse countries that range from vibrant democracies like the Philippines, a longtime treaty ally of Washington, to authoritarian states like Laos and Cambodia, which are close to Beijing.\n\nThe regional bloc adopted the theme “Navigating our future, Together” this year but that effort to project unity faced its latest setback last year when deadly fighting erupted between two members, Thailand and Cambodia, over a longtime border conflict.\n\nAside from the Myanmar crisis and the deadly fighting that embroiled Thailand and Cambodia before both forged a US-backed ceasefire last year, the ministers also agreed to hold monthly meetings with China in an effort to conclude negotiations this year on a so-called “code of conduct” to manage disputes over long-unresolved territorial rifts in the South China Sea, Lazaro said.\n\nUnder growing pressure to conclude the talks on the nonaggression accord, the ministers announced the self-imposed deadline three years ago.\n\nChina has expansive claims in the waterway, a key global trade route, that overlap with those of four ASEAN members, the Philippines, Malaysia, Vietnam and Brunei.\n\nLazaro opened the meetings by calling on the regional bloc to steadfastly maintain restraint and adhere to international law as acts of aggression across Asia and “unilateral actions” elsewhere in the world threaten the rules-based global order.\n\nSeveral ASEAN members have expressed deep concern over the secretive US strike that resulted in the arrest of Venezuelan leader Nicolas Maduro on orders from US President Donald Trump. China’s intensifying aggressive stance on Taiwan and in the disputed South China Sea have also troubled the region for years.\n\nCalling out the US and China, among the largest trading and defence partners of ASEAN countries, have been a dilemma and a diplomatic tightrope.\n\n“Across our region, we continue to see tensions at sea, protracted internal conflicts and unresolved border and humanitarian concerns,” Lazaro said in her opening speech before ASEAN counterparts.\n\n“At the same time, developments beyond Southeast Asia, including unilateral actions that carry cross-regional implications, continue to affect regional stability and erode multilateral institutions and the rules- based international order,” Lazaro said.","url":"https://channelnewsasia.com/asia/asean-does-not-recognise-myanmar-elections-5895366","image":"https://dam.mediacorp.sg/image/upload/s--YJx_QnmN--/c_crop,h_1125,w_1999,x_1,y_65/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/30/ap26029268118011_mod.jpg?itok=y9M","video":null,"publish_date":"2026-01-30 01:21:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.048},{"id":397533532,"title":"Man accused of squirting US lawmaker Ilhan Omar with vinegar charged with assault","text":"MINNEAPOLIS – The man accused of \n\nHours later, the local prosecutor in Minneapolis said she was also charging the man, Anthony J. Kazmierczak, with assault and making a threat of violence, saying that she was doing so because of diminished trust in the federal government and because of concerns that the president might pardon the man of any federal charges if he were to be convicted. \n\nOn Jan 27, Kazmierczak sprayed Ms Omar with apple cider vinegar and water, an FBI agent wrote in an affidavit filed in federal court. \n\nMs Omar, a Democrat who has repeatedly criticised the Trump administration’s immigration crackdown in Minnesota, had just finished calling for the resignation of Mr Kristi Noem, the homeland security secretary, when Kazmierczak approached her and squirted her, the agent wrote. Afterward, Kazmierczak appeared to say, “You’re splitting Minnesotans apart,” the agent wrote.\n\nThe account by the agent Derek Fossi said that the liquid stained the Congress member’s clothes and may have reached her face and right eye. His affidavit included a photograph of the syringe that Kazmierczak, 55, is accused of using.\n\nIn the moments after she was sprayed, Ms Omar approached the man with one fist raised. He was then tackled by security guards. She was not injured, and she continued to speak at the event, waving off staff members who urged her to be evaluated medically.\n\n“An assault on a member of Congress is an assault on the democratic values that underpin this nation,” Mr Richard Evanchec, the interim special agent in charge of the FBI office in the Minneapolis area, said in a statement.\n\nThe criminal complaint filed by Ms Mary Moriarty, the Hennepin County attorney, said it was Ms Omar’s belief that the man had told her she should die before he was tackled.\n\nMr Fossi said in his affidavit that he had interviewed a “close associate” of Kazmierczak, who told him that Kazmierczak had said years ago that “somebody should kill” Omar.\n\nThe agent also referred to a political cartoon critical of Ms Omar that Kazmierczak, a Minneapolis resident, had shared on Facebook in October 2021. Kazmierczak posted frequently in recent years about his anger at Democratic lawmakers and policies.\n\nMs Moriarty’s decision to charge Kazmierczak with state crimes was a sign of how significantly trust has eroded between Minneapolis officials and the federal government in recent weeks, since the Trump administration sent a surge of immigration agents into the Twin Cities region.\n\n“While we have historically worked collaboratively with federal agencies to investigate crimes, that partnership has been damaged by political decisions coming from this administration,” Ms Moriarty said in a video posted online.\n\nShe noted that a conviction on state charges would not be subject to a presidential pardon. Ms Moriarty is among a group of liberal prosecutors who have created a coalition to help one another prosecute federal law enforcement officials who they believe to have broken the law but who will not be prosecuted by the federal government.\n\nPresident Donald Trump is a frequent and harsh critic of Ms Omar. He suggested this week, with no evidence, that the attack on her had been staged.\n\nOn Jan 29, Kazmierczak made an initial appearance in federal court in Minneapolis. Kazmierczak, who has Parkinson’s disease, shook visibly throughout the proceeding. His lawyer Jean Brandl, a public defender, said Kazmierczak was in between doses of medication to treat the symptoms of the disease at the time of the attack and that he had not been receiving those medications since he was jailed.\n\n“I am very concerned about his health,” she said.\n\nJudge Dulce J. Foster, who presided over the hearing, instructed US Marshals to make sure that he received the medications as soon as possible. She then ordered that Kazmierczak be held in jail until his next court appearance on Feb 3, when he is expected to enter a plea.\n\n“There are concerns here, not just about his physical health but his mental stability,” she said.\n\nAt least two other elected officials, state Senator Bobby Joe Champion and LaTrisha Vetaw of the Minneapolis City Council, said after Ms Omar’s speaking event that they, too, had been hit by the liquid. The Hennepin County attorney Moriarty said Jan 28 that her office was also investigating.\n\nThe federal crime that Kazmierczak was charged with relates specifically to the assault or intimidation of federal officers. The statute says that a conviction can lead to a maximum sentence of one year in prison, unless the assault involves “physical contact with the victim”, in which case the maximum sentence rises to eight years. A conviction on the state charge of making threats of violence carries a maximum sentence of five years in prison.\n\nMs Omar’s office did not respond to a request for comment. Shortly after the incident on Jan 27, she wrote on social media, “I don’t let bullies win.” NYTIMES","url":"https://www.straitstimes.com/world/united-states/man-accused-of-squirting-ilhan-omar-with-vinegar-is-charged-with-assault","image":"https://cassette.sphdigital.com.sg/image/straitstimes/f64cceb2bf6d994365e753f2544c62ec235341c53a96ce011f6c9af7d01bfd1d","video":null,"publish_date":"2026-01-30 01:20:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.543},{"id":397535046,"title":"Gold Just Passed $5,000 an Ounce. Should You Invest?","text":"The price of gold topped $5,000 per ounce for the first time ever this past week -- reach as high as $5,300. That's an increase of more than 20% so far in 2026 and 180% over the past five years.\n\nThe precious metal's current rise began soon after Russia invaded Ukraine in early 2022 and the U.S. froze Russia's foreign exchange reserves. Spooked by that sanction, the central banks of many countries, including Russia, China, and India, began massive purchases of gold in order to diversify away from the dollar -- and minimize the ability of the U.S. to weaponize the greenback.\n\nCentral banks were reportedly buying 80 metric tons of gold a month in 2025, and Goldman Sachs forecasts that buying will average 60 metric tons a month this year.\n\nTrump's policies have supported the gold rally\n\nThe policies of the Trump administration have only bolstered the gold rally. They include a dramatic new tariff regime, which has turned many international investors off dollar-based assets and caused the greenback to fall, and President Donald Trump's \"big, beautiful bill,\" which will significantly increase U.S. deficits and has sent many investors elsewhere. \n\nThe U.S. capture of Venezuelan President Nicholas Maduro in early January, the aggressive push to acquire Greenland, new threats of draconian tariffs on Canada, and the possibility of another government shutdown have also created geopolitical uncertainty in global markets and diminished global demand for dollar-based assets, sending more investors and banks to gold as a safe-haven asset.\n\nThe question for investors interested in gold now is: Can the rally continue through 2026? I think it can and will.\n\nGeopolitical uncertainties might even increase in 2026\n\nUncertainties stemming from the current U.S. administration don't look like they'll abate any time soon, and there may be others added to them. Among the most dangerous of these (and thus the best for the price of gold): A loss of Federal Reserve independence. The White House continues to try to influence monetary policy conducted by the Federal Reserve, including by trying to oust one Fed Board governor and opening a Justice Department investigation against Chair Jerome Powell.\n\nPowell's term as Chair ends in May, and Trump seems determined to replace him with a chair who will aggressively cut interest rates. Not only could that compromise the Fed's independence and further erode global trust in the dollar, a sharp reduction in interest rates poses a huge threat of inflation down the road, which would only increase purchases of gold -- and, thus, its price.\n\nTwo good ways to invest in gold are the SPDR Gold Shares ETF (GLD +0.27%), the world's largest physically backed gold fund , and the VanEck Gold Miners ETF (GDX 3.73%), an exchange-traded fund that tracks the overall performance of companies involved in the gold mining industry.\n\nGold could easily hit $6,000 an ounce by year-end. That makes it a good hedge to have in your portfolio right now.","summary":"The price of gold hit a new milestone this week.","url":"https://www.fool.com/investing/2026/01/29/gold-just-passed-5000-an-ounce-should-you-invest/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F852971%2Fgettyimages-483395699-1.jpg&w=1200&op=resize","video":null,"publish_date":"2026-01-30 01:20:00","author":"Matthew Benjamin","authors":["Matthew Benjamin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.063},{"id":397532050,"title":"Trump Threatens Tariffs on Nations Selling Oil To Cuba","text":"Washington: US President Donald Trump signed an executive order Thursday threatening to impose additional tariffs on countries that sell oil to Cuba, increasing pressure on the communist island nation. \"An additional ad valorem (estimated value) duty may be imposed on imports of goods that are products of a foreign country that directly or indirectly sells or otherwise provides any oil to Cuba,\" read in part the executive order released by the White House. The order invokes the International Emergency Economic Powers Act and calls the Cuban government an \"extraordinary threat\" to US national security. \"The regime aligns itself with -- and provides support for -- numerous hostile countries, transnational terrorist groups, and malign actors adverse to the United States,\" including Russia, China, and Iran, as well as the militant groups Hamas and Hezbollah. Cuba, which has largely been under a US embargo since 1962, until recently received most of its oil from Venezuela. But since the ouster of Venezuela's autocratic president Nicolas Maduro, Trump has taken the reins of the country's oil sector and has vowed to stop oil shipments to Cuba without an agreement. The Caribbean island has experienced severe fuel shortages in recent years, impacting its power grid and subjecting residents to widespread blackouts. Another Latin American country, Mexico, continues to provide oil to Cuba, with President Claudia Sheinbaum earlier this week denying reports she had ceased oil shipments to Havana.","summary":"The order invokes the International Emergency Economic Powers Act and calls the Cuban government an \"extraordinary threat\" to US national security","url":"https://www.deccanchronicle.com/world/trump-threatens-tariffs-on-nations-selling-oil-to-cuba-1933683","image":"https://www.deccanchronicle.com/h-upload/2026/01/30/2004818-aa-640216711zon.webp","video":null,"publish_date":"2026-01-30 01:19:52","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.004},{"id":397530102,"title":"Fed thinks ‘economic growth causes inflation,’ but that is not supported by the data, economist says","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Bottom Line January 29, 2026 07:47 \n\n Fed thinks ‘economic growth causes inflation,’ but that is not supported by the data, economist says \n Former Council of Economic Advisers acting chair Tomas Philipson discusses President Donald Trump's economic policies and his ongoing criticism of the Federal Reserve on ‘The Bottom Line.’ \n\nTags WHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODESV-VIDEOSPOLITICS","summary":"Former Council of Economic Advisers acting chair Tomas Philipson discusses President Donald Trump&apos;s economic policies and his ongoing criticism of the Federal Reserve on ‘The Bottom Line.’","url":"https://www.foxbusiness.com/video/6388509733112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/fa87d350-91b1-4ab6-90e9-406c76349e90/6a75b227-8f50-4d8a-b303-0d491fe6f667/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-01-30 01:18:44","author":null,"language":"en","source_country":"us","sentiment":-0.416},{"id":397528488,"title":"Pete Hegseth signals Donald Trump has military options ready","text":"US issues BIG warning to Iran on nuclear issue: Pete Hegseth signals Donald Trump has military options ready\n\nUS Secretary of War Pete Hegseth has issued a warning to Iran and underscored President Donald Trump’s forceful military stance during a Cabinet meeting.\n\n Published: January 30, 2026 6:39 AM IST \n\n US issues BIG warning to Iran on nuclear issue: Pete Hegseth signals Donald Trump has military options ready\nWashington, DC: Amid the escalating tensions between the United States and Iran, Washington on Thursday (local time) has again issued a stringent warning to Tehran against pursuing nuclear weapons. US Secretary of War Pete Hegseth stated that America is fully prepared to act under President Donald Trump’s orders. Hegseth’s remarks came at a time when the US continues to deploy warships and fighter jets across the Middle East.\n“They should not pursue nuclear capabilities, and we will be prepared to deliver whatever this president expects of the War Department,” he said.\nThe US Secretary of War boast about American military power pointing to the recent capture of former Venezuelan President Nicolas Maduro and his wife. He termed the operation as unparalleled in scale and execution.\n“No other military in the world could have executed the most sophisticated, powerful raid — not just in American history — I would say in world history,” Hegseth said.\nAdd India.com as a Preferred Source \nHe added that this feat demonstrated the unique empowerment given to US forces under the current administration: “No other president would have been willing to empower those warriors that way.”\nHegseth said such high-profile operations are intended to send a clear message about the US resolve globally.\n“That sends a message to every capital around the world that when President Trump speaks, he means business,” he added, stating that the War Department is “reestablishing deterrence” after years of perceived strategic ambiguity.\nTurning back to Iran, Hegseth referenced Operation Midnight Hammer, the Trump-ordered series of strikes against Iran’s nuclear infrastructure, as evidence of the administration’s commitment to preventing Tehran from acquiring nuclear weapons.\n“We’re having to rebuild how our enemies perceive us,” he said.\n“And when President Trump said, ‘We’re not getting a nuclear Iran — you won’t have a nuclear bomb,’ he meant it,” reinforcing the administration’s zero-tolerance stance on Tehran’s nuclear programme.\nHegseth’s remarks came at the time when US continues to deploy its naval and air power in the Middle East. This recent development has ignited speculation that US could take military action against Iran.\nThis military presence has included the deployment of the aircraft carrier USS Abraham Lincoln to the region, a move President Trump described as part of a “massive Armada is heading to Iran.”\n(With ANI Inputs)","summary":"Home News US issues BIG warning to Iran on nuclear issue: Pete Hegseth signals Donald Trump has military options ready US Secretary of War Pete Hegseth has issued a warning to Iran and underscored President Donald Trump&#8217;s forceful military stance during a Cabinet meeting. Published: January 30, 2026 6:39 AM IST US issues BIG warning [&#8230;]","url":"https://www.thetimesofbengal.com/international/pete-hegseth-signals-donald-trump-has-military-options-ready/","image":"https://www.thetimesofbengal.com/wp-content/uploads/2026/01/pakistan-pm-shehbaz-sharif-malaysia-visit-2025-export-meat-with-country.jpg","video":null,"publish_date":"2026-01-30 01:17:37","author":"admin","authors":["admin"],"language":"en","category":"politics","source_country":"in","sentiment":0.136},{"id":397529890,"title":"The battle that will expose just how frighteningly polarised Britain has become, revealed by ROBERT HARDMAN","text":"When by-elections deliver shocks – and there have been some humdingers in recent years – they usually come in a fetid sports hall at around 3am on the morning after.\n\nNot this one. Here in the Manchester seat of Gorton and Denton there have already been two seismic moments and the campaign has not even got its shoes on.\n\nFirst came the news that the Mayor of Greater Manchester, Andy Burnham was planning to defend the seat for Labour, the party he served as a Cabinet Minister during the Blair/Brown days.\n\nEven bigger news was Sir Keir Stamer's decision at the weekend to block Burnham's candidacy. The Prime Minister was well aware that Burnham's return to the House of Commons would be the first step in a bid to usurp the Labour leadership and, thereafter, take the keys to No 10.\n\nIn keeping Burnham off the ballot paper, Sir Keir may have obviated a leadership challenge - for now. But he has also ensured that the race to become the next MP for Gorton and Denton is now wide open, with three frontrunners. One is TV presenter Matt Goodwin, standing for Reform, and two are, as yet, unknown because their parties have yet to select their candidates.\n\nHowever, it is already accepted by all the parties here that it will be a three-way race between Reform, Labour and a resurgent Green Party, which has suddenly discovered - in a seat with a substantial Muslim population - that there are more votes in clobbering Israel than hugging trees.\n\nAnd during my time here this week, I find that supporters of all the parties (and of none at all) can all agree on one thing: Burnham's enforced absence has made things much easier for both Labour's main rivals in a seat that has given us two claims to fame - the phrase 'mad as a hatter' and also the Gallagher brothers of Oasis fame.\n\nThis by-election was triggered by the sudden resignation of former health minister Andrew Gwynne, who stood down on 'health grounds' last week.\n\nHis political career had already suffered irreparable damage following a series of abusive remarks circulated on a WhatsApp group and revealed in The Mail on Sunday a year ago. As well as writing a putative response to an irritating constitutent - 'F*** your bins. I'm re-elected and without your vote. Screw you' - he also complained that a psychologist sounded 'too Jewish'. He added: 'Is he in Mossad?'\n\nThe remarks were bad enough at the time, all the more so eight months later when a terrorist attack on Manchester's Heaton Park synagogue left three dead.\n\nIn the Gorton half of Gwynne's former constituency, Muslim voters account for more than 70 per cent in some council wards. And that is creating a fascinating dynamic which could do for Labour's chances here.\n\nThis week The Muslim Vote, a coalition of Muslim organisations, urged its followers to vote Green in the by-election. It would have gone for Labour if Burnham had been standing. \n\nNot now: 'We believe the Green Party offers the strongest opportunity to win and we urge them to work swiftly with local communities, while calling on all other progressive and independent alternatives to stand aside.' That is clearly going to inform the way the Greens fight their campaign in a seat where the poll suggest they could win a 5th MP - their first in the North.\n\nI attend this week's big Green rally to kickstart the by-election campaign. The location is no surprise: Gorton's Pakistan Community Centre. Party leader Zack Polanski has a boisterous welcome and wins a standing ovation for an oddly underwhelming speech, lasting just five minutes.\n\nIn it he attacks Reform as 'racist' and Labour as 'the party that wants to lick the boots of Donald Trump'. Some of the loudest cheers greet his attack on Israel: 'When we look around the world, we know that our Government is complicit - active participants in the selling of arms to Israel and the sharing of intelligence. And it is time to end the genocide.'\n\nFormer leader, Baroness Bennett doing the introductions, says much the same. Try as I might, I didn't hear anything about Net Zero all night. There is the odd mention of sewage but nothing about the Green staples of climate change or carbon emissions.\n\nThere is a lot of 'hit the billionaires' stuff and warm words for the old Labour leadership of Jeremy Corbyn. However the other speakers - all drawn from Muslim communities - have a great deal to say about 'genocide' in Gaza (the Greens are the only party that formally accuses Israel of the crime).\n\nAt one point Birmingham activist Salma Yaqoob gets a round of laughter as she declares: 'The Green Party is no longer this tree-hugging party just for the graduates and the middle class.' And she has a point.\n\nThis room may be full of stereotypical Greens - the usual student/pensioner combo with as many pink, blue and purple heads as grey ones - but the voters who will make all the difference are those in the streets round here. They do not share the party's southern obsessions with banning flights, oil and cars, let alone all that LGBTQ+ stuff.\n\nYet I go for a wander through Gorton and find that the support for the Greens is genuine and widespread. 'We always used to vote Labour but not after the Government's double standards on Palestine,' says driving instructor Abdul Hakim, 37. 'They do nothing for the people here... only the Greens say it as it is.' \n\nThis, he assures, me is the unanimous family view. 'We're Asian. We vote as an extended family so that means 20 votes for Green.'\n\nThe latest poll puts Reform just ahead of Labour with the Greens in third but the bookies favour Reform just ahead of Polanski's party with Labour third. To stop Reform there will have to be a squeeze on the Left and momentum is now with the Greens.\n\nMuch will depend on whom they choose as their candidate when the local party votes today. If they go for a blue-haired graduate eco-warrior, they may struggle here. But I meet one of those in the running for the Green nomination who would certainly give Nigel Farage a headache.\n\nFesl Reza-Khan is ex-Parachute Regiment, runs his own finance company, had a grandfather who fought for the British in the Second World War and is the only person in the room in a blazer.\n\nAn articulate, softly-spoken father of one, he tells me that he grew up in nearby Oldham, where he stood as a Green candidate at the last election. He is also co-chair of the Muslim Greens. 'I just despair of the labels and the abuse in public life now,' he tells me. 'I hate the way Muslims are demonised, just as I don't believe that all Reform voters are bad people either. We need politics to be more civilised.' One to watch.\n\nThis is very much a seat of two halves. The Denton end is still largely what would be called old white working class, built up around the hat industry (locals claim 'mad as a hatter' originated here - derived from the mind-altering effects of the mercury used in hat production).\n\nThe outgoing MP used to do well here. 'He was quite a good MP actually,' says Lauren Hill, owner of Denton's Red Lion pub. 'He did a competition for small business and we won it three times. But then the WhatsApp thing happened.'\n\nWayne Bennett, sitting at the bar, chips in: 'He was nice enough - he bought one of my puppies, actually.' So will he be voting for Mr Gwynne's replacement? 'Oh no. It's Reform all the way,' says Mr Bennett, a retired maintenance man. He has already signed up to the party.\n\nAcross the road, I am waiting to be allowed into a pub called The Vault. It had been hired by Reform UK to unveil their new candidate, Matt Goodwin, at an earlier Press conference. \n\nNow, the media have been ejected and very jumpy minders are manning the door, allowing reporters in one at a time to conduct interviews. Mr Goodwin, 44, is an experienced performer, having been a presenter on GB News and previously an academic, author and commentator on modern politics.\n\nHe once ate a page of one of his books live on air having promised to eat his words if Jeremy Corbyn polled more than 38 per cent of the vote in the 2017 General Election (he got 40), so his supporters would argue that he delivers on his promises.\n\nLabour's crack team of internet archaeologists were out of the traps just moments after his nomination, replaying his past comments including a dig at this place.\n\n'I was unfortunate enough to be in Manchester a few days ago,' he said in one of them. Reform's attack dogs were equally quick off the mark, reporting Labour to the police for alleged 'dissemination of false statements'. The clip in question, Mr Goodwin points out, was a comment on the Tory conference taking place in the city, not on the city itself.\n\nHe went to the University of Salford and points to strong family roots in the area, including a grandfather who worked in a steel factory a few miles down the road. He says he knows the southern end of the constituency especially well from his student days selling pizzas (he claims he was the fastest pizza deliverer in Burnage). \n\nHe speaks fluently but earnestly, more of the academic he used to be than a fledgling Farage.\n\n'Historically, this is a safe Labour seat but tribal allegiances are dead.' He says this will be 'a referendum on Starmer' and that immigration is a top issue here. Well aware that his opponents are going to play the racism card with some of his past comments - 'it takes more than a piece of paper to make somebody 'British',' he said after last year's Huntingdon train stabbings - he insists that he is anti-'sectarianism'.\n\n'Minority ethnic communities have expressed just as much outrage as white working class voters about broken borders because they all play by the rules. And the worst is when you hear Keir talking about fairness in a system that is so obviously unfair and biased towards rule-breakers.'\n\nHere in Denton is where he expects his vote to be strongest. It seems that way on the streets. I meet Claire, 49, a mother of two and civil servant, walking her dog. She says that what will tip her vote is the way Labour has run the local Tameside Council - 'a disaster' - and immigration. She and her husband will both be for Reform.\n\nSo where is the Labour vote? The only glimmer of hope I find is down in Burnage, the part of town where the Gallagher boys grew up.\n\nI visit the leafy road where they lived in a semi with Mum.\n\nIt's hardly a pocket of deprivation. Two doors down, there's a Range Rover outside.\n\nThe area is proud of the Oasis connection, with a huge mural of Liam and Noel round the corner from Burnage station. I meet property developer, Sarah, who usually votes Tory but says she'll probably vote Labour 'just to keep Reform out'.\n\n'Don't look back in anger,' might be the most famous Oasis line of them all. Unfortunately for Sir Keir, it seems that most voters on Feburary 26 are going to be looking back with a lot of anger indeed.","summary":"ROBERT HARDMAN: When by-elections deliver shocks - and there have been some humdingers in recent years - they usually come in a fetid sports hall at around 3am on the morning after.","url":"https://www.dailymail.co.uk/news/article-15510957/Gaza-Greens-Reforms-migration-Britain-ROBERT-HARDMAN.html","image":"https://i.dailymail.co.uk/1s/2026/01/30/01/105950745-0-image-m-44_1769735521590.jpg","video":null,"publish_date":"2026-01-30 01:16:50","author":"Editor,Robert Hardman","authors":["Editor","Robert Hardman"],"language":"en","source_country":"gb","sentiment":0.161},{"id":397532228,"title":"Israel releases 15 Palestinian bodies as truce deal shifts to next phase","text":"CAIRO - Israel released 15 bodies of Palestinians killed during its war in Gaza, three days after recovering the remains of the last hostage, in moves mediators hope will pave the way to carrying out the next stage of U.S. President Donald Trump's peace plan.Police ​officer Ron Gvili was one of 251 hostages seized and taken to Gaza by Palestinian Hamas militants ‍during their October ⁠7, 2023, cross-border attack that triggered the war.At the time of a ceasefire deal ‍that Israel and Hamas agreed to in October, 48 hostages remained in Gaza, 28 of whom were believed to be dead, including Gvili.","summary":"Subsequent stages of the ceasefire deal remain to be fulfilled, with deep splits over what comes next, including Hamas disarmament.","url":"https://www.japantimes.co.jp/news/2026/01/30/world/gaza-truce-next-phase/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2026/01/30/520223.jpg?v=3.1","video":null,"publish_date":"2026-01-30 01:16:00","author":"Nidal Al-Mughrabi,Web Master","authors":["Nidal Al-Mughrabi","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.579},{"id":397531052,"title":"Trump says Putin agreed to not fire on Kyiv for a week during cold","text":"WASHINGTON, Jan 29 (Reuters) - U.S. President ‌Donald Trump said on Thursday that Kremlin leader Vladimir Putin had agreed to refrain from firing on Kyiv and ‌other Ukrainian cities for a week because of cold winter weather.\n\nUkrainian President Volodymyr Zelenskiy said he thanked ‌Washington for the initiative, which he described as halting Russian strikes on energy targets, which have left hundreds of apartments in Kyiv without power during freezing weather.\n\nThere was no immediate comment from Moscow, which had earlier issued a new invitation for Zelenskiy to hold talks in Moscow, an offer already long ‍rejected by the Ukrainian leader.\n\n\"We asked President Putin if they could stop the ‍shooting for a week,\" Trump told reporters at ‌an event in the Oval office.\n\n\"They're being hit with, proportionately, the kind of cold that we're being hit. It's much colder ‍in ​Ukraine to start off with, but it's really cold. He agreed to do that. We appreciated that very much.\"\n\nEmergency crews were still restoring heating and electricity in Kyiv knocked out by Russian air strikes last Saturday.\n\nKyiv Mayor Vitaly ⁠Klitschko said 454 apartment buildings remained without heat, with overnight temperatures dipping to -10 ‌Celsius (18 Fahrenheit) on Friday and even lower next week.\n\n\"We expect the agreements to be implemented,\" Zelenskiy wrote on the X social media platform. \"De-escalation steps ⁠contribute to real progress ‍toward ending the war.\" \n\nSpeaking afterwards in his nightly video address, Zelenskiy thanked the United States \"for their efforts in ensuring a stop to strikes on energy (targets) at this time and let's hope that America succeeds in ensuring this\".\n\n\"We shall see what the real situation is with our energy ‍facilities and cities in the days and nights to come,\" he said.\n\nThe ‌United States has been engaged in months of diplomatic activity to secure an accord to end the nearly four-year-old war, the deadliest conflict in Europe since World War Two.\n\nNegotiators from Ukraine, Russia and the United States held unusual three-way contacts last weekend in the United Arab Emirates.\n\nTrump's envoy Steve Witkoff said on Thursday the Russia and Ukraine were discussing the issue of territory and described the talks as having made progress. He said accords on security guarantees and post-war recovery were nearly complete.\n\nUkraine is resisting Russia's demands to cede all its eastern Donbas region, including areas Moscow's military has failed to capture.\n\nKremlin aide Yuri Ushakov said he ‌did not regard the land issue as the only key matter left on the table. \n\nWitkoff said the discussions would resume in about a week, though the next meeting had been scheduled for Sunday.\n\nRussian Foreign Minister Sergei Lavrov cast doubt on the viability of any security guarantees that Washington might ​be able to provide Ukraine as part of a deal. He expressed doubt that they could lead to an enduring peace if they were designed to keep Ukraine's current political leadership in power.\n\n (Reporting by Steve Holland and Bo Erickson; Editing by Doina Chiacu, Ron Popeski and Michael Perry)","url":"https://www.thestar.com.my/news/world/2026/01/30/trump-says-putin-agreed-to-not-fire-on-kyiv-for-a-week-during-cold","image":"https://apicms.thestar.com.my/uploads/images/2026/01/30/3745485.jpg","video":null,"publish_date":"2026-01-30 01:15:00","author":"Steve Holland","authors":["Steve Holland"],"language":"en","category":"politics","source_country":"my","sentiment":-0.019},{"id":397531202,"title":"MAGA official's 'economically illiterate' boast Trump secured $18 trillion torn apart","text":"President Donald Trump's Small Business Administration chief, Kelly Loeffler, heaped praise on him during this week's Cabinet meeting — but she made a particularly outlandish economic claim that had experts doing a double-take.\n\n\"The $18 trillion you brought is creating an economic boom,\" Loeffler said. \"We will have 7 percent GDP growth. It’s probably being underestimated right now.\"\n\nLoeffler is presumably referring to the amount of foreign investment that other countries have pledged to make into the U.S. economy since Trump took office, a figure that never seems consistent and that various administration officials have valued anywhere between $10-20 trillion. In reality, these numbers are essentially guesses; the vast majority has not yet been invested, and some of it would have happened regardless of who was president.\n\nNonetheless, her insinuation that the U.S. economy is already being infused with trillions of dollars earned ridicule from commenters on social media.\n\n\"It's giving North Korea,\" wrote conservative Washington Examiner analyst Brad Polumbo. \"There is no $18 trillion, and we are absolutely not going to have 7% GDP growth. Why debase yourself like this?\"\n\n\"You have to completely economically illiterate to believe that there has been an $18 trillion influx of foreign investment,\" wrote Jessica Reidl of the Brookings Institution. \"(Which would have created 60% GDP growth and required filling 100 million new jobs out of the 7.5 million unemployed workers).\"\n\n\"Future historians will tell fascinating stories about this administration coming down to a president, however ill-qualified for the job, being spoon fed bogus data and reports from sycophantic staff — leaving him totally blind to what’s actually happening in the country,\" wrote author Joel Miller.","summary":"President Donald Trump's Small Business Administration chief, Kelly Loeffler, heaped praise on him during this week's Cabinet meeting — but she made a particularly outlandish economic claim that had experts doing a double-take.\n\n\"The $18 trillion you brought is creating an economic boom,\" Loeffler said. \"We will have 7 percent GDP growth. It’s probably being underestimated right now.\"\n\nLoeffler is presumably referring to the amount of foreign investment that other countries have pledged to make into the U.S. economy since Trump took office, a figure that never seems consistent and that various administration officials have valued anywhere between $10-20 trillion. In reality, these numbers are essentially guesses; the vast majority has not yet been invested, and some of it would have happened regardless of who was president.\n\nNonetheless, her insinuation that the U.S. economy is already being infused with trillions of dollars earned ridicule from commenters on social media.\n\n\"It's giving North Korea,\" wrote co","url":"https://www.rawstory.com/trump-investment/","image":"https://www.rawstory.com/media-library/gop-senator-accuses-trump-of-having-poor-bedtime-manners-after-he-s-caught-napping.jpg?id=62299905&width=1200&height=1200&coordinates=166%2C0%2C167%2C0","video":null,"publish_date":"2026-01-30 01:12:12","author":"Matthew Chapman","authors":["Matthew Chapman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.268},{"id":397534574,"title":"Trump sues IRS and Treasury Department for $10BN over leak of his tax returns","text":"President Donald Trump and several of his family members sued the Treasury Department and the Internal Revenue Service for $10 billion, alleging the government agencies failed to prevent his tax returns from being leaked.\n\nThe lawsuit, filed at a federal courthouse in Florida on Thursday, said Trump is bringing the suit in “his personal capacity.” The other plaintiffs include the Republican president’s eldest sons — Donald Trump Jr. and Eric Trump — as well as the Trump organization.\n\nThe civil complaint argues that the IRS and Treasury Department fell short on their obligation to stop the leak of the president’s tax records by Charles Littlejohn, a former IRS contractor, in 2019 and 2020.\n\nLittlejohn pleaded guilty in 2023 to leaking the president’s tax records to The New York Times, and he was sentenced to five years in prison the following year. In 2020, the newspaper published a report showing the billionaire president paid just $750 in federal income taxes in 2016 and 2017 — and no federal income taxes for most of the prior 15 years.\n\nAt the time, Trump described the story as “Totally fake news. Made up. Fake.”\n\nThe suit alleges that the defendants “willfully, knowingly, and/or by gross negligence” illegally accessed the president’s confidential tax information. \n\n“Defendants have caused Plaintiffs reputational and financial harm, public embarrassment, unfairly tarnished their business reputations, portrayed them in a false light, and negatively affected President Trump, and the other Plaintiffs’ public standing,\" the complaint said. It requested at least $10 billion in damages.\n\nSpokespeople for the Treasury Department and the IRS did not immediately respond to requests for comment from The Independent.\n\nIt is highly unusual for a president to sue their own administration, but Trump has pursued similar tactics in the past.\n\nIn October, the president reportedly demanded that the Department of Justice pay him $230 million in compensation for the multiple federal investigations into him. \n\n“I guess they probably owe me a lot of money,” Trump said at the time when asked about a potential settlement.\n\nThis is a developing story...","summary":"The lawsuit was filed by the president and members of his family on Thursday","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-lawsuit-irs-treasury-tax-return-b2910601.html","image":"https://static.independent.co.uk/2026/01/30/00/EEUU-CUBA_01934.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/2TdfAORa-4VHSaSK0.mp4","publish_date":"2026-01-30 01:11:26","author":"Brendan Rascius","authors":["Brendan Rascius"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.663},{"id":397533348,"title":"How Democrats want to reform DHS – and why some Republicans are open to their demands","text":"With the government on the brink of a partial shutdown, the Senate is scrambling to keep funding flowing and address bipartisan distress over President Trump's immigration enforcement tactics.\n\nBut even with an agreement to fund the government, a short-term partial shutdown appears all but inevitable. The Senate still needs to vote on a plan announced by Senate Democrats, and then the House, which is in recess until Monday, needs to sign off, too.\n\nThe agreement reached Thursday night and endorsed by President Trump will fund much of the government through the end of September and temporarily fund the Department of Homeland Security for two weeks while lawmakers negotiate provisions to rein in federal immigration agents.\n\nJust a week ago, Congress was on track to approve nearly $1.3 trillion in spending for defense, health, transportation, housing and more before government funding expires Friday at midnight.\n\nBut the second deadly shooting of a U.S. citizen in Minneapolis by federal immigration officers on Saturday upended those plans, as Democrats pledged to withhold support for the funding package without policy changes on immigration enforcement.\n\nAnd unlike the shutdown standoff last fall over expiring health insurance subsidies, more Republicans acknowledged that what was unfolding in Minneapolis was an inflection point that could not be ignored.\n\nDemocrats are demanding changes to how immigration officers carry out arrests and incidents are investigated, as well as mandating the use of body cameras and other reforms.\n\nSome of the recommendations could attract Republican support. But there is still an arduous road ahead for any of them becoming law.\n\nWhy some Republicans are alarmed\n\nIn an era when congressional Republicans rarely criticize the Trump Administration, the killing of 37- year-old Alex Pretti in Minneapolis sparked unease from unexpected corners of the caucus.\n\n\"Initial rushes to judgment did not meet the standard that Americans should expect from their government officials,\" Sen. Ted Budd, R-N.C., wrote on social media, referring to remarks by Homeland Security Secretary Kristi Noem and others who had swiftly labeled Pretti a \"domestic terrorist.\"\n\n\"Enforcing our immigration laws makes our streets safer. It also protects our national security,\" Sen. Pete Ricketts, R-Neb., wrote in a statement the day after the shooting. \"But we must also maintain our core values as a nation, including the right to protest and assemble.\"\n\nSeveral Republicans called for hearings and an independent investigation; DHS leaders are expected to testify in back-to-back oversight hearings next month and Noem is now due to testify in March. Sens. Lisa Murkowski, R-Alaska, and Thom Tillis, R-N.C., more frequent Trump critics, have called for her resignation.\n\nTillis told reporters that the images coming out of Minneapolis were souring the public on the Trump administration's handling of immigration more broadly.\n\n\"It is regrettable that the issue that Republicans always lead on, we're losing on,\" Tillis told NPR.\n\nAnd despite initially resisting Democrats' demands to split the homeland security funding bill from the overall spending package, key Republicans eventually softened to the idea.\n\n\"If the pathway exists that we get these five bills done and then we have time to continue to review Homeland [Security], I'm here for it,\" said Sen. Katie Britt, R-Ala., an appropriations committee member.\n\nBut divides continue to persist within the Republican party.\n\n\"We're not going to keep ICE from doing their job,\" said Sen. Markwayne Mullin, R-Okla. \"The American people wanted the president to enforce law and order and ICE is doing their job.\"\n\nSen. James Lankford, an Oklahoma Republican who sits on the homeland security committee, said he did not see a need for any further policy changes. He noted that the current DHS funding bill awaiting a vote already includes additional funding for body cameras and oversight.\n\n\"I don't see one that's needed above and beyond what's already there,\" Lankford said.\n\nWhat Democrats want: judicial warrants, masks off and cameras on\n\nDemocrats secured a handful of wins in the current version of the spending bill, such as reducing funding for immigration enforcement and reducing capacity at detention centers. But in the wake of Pretti's death, they say further reforms are needed.\n\nSenate Democrats have outlined three buckets of policy changes they are pursuing.\n\nDemocrats want rules around the kinds of warrants immigration officers can use to enter homes and an end to so-called \"roving patrols\" when officers conduct broad searches and stops of people they suspect of being in the country illegally.\n\nAn ICE memo unveiled in a whistleblower complaint first reported by the Associated Press last week, detailed how Immigration and Customs Enforcement officers were using administrative warrants as opposed to judicial warrants, which are signed by a judge.\n\nThese administrative warrants, according to the whistleblower report, are signed by immigration agents and deportation officers.\n\nIn a letter to DHS, Sen. Richard Blumenthal, D-Conn., said these kinds of warrants are an unlawful method of entering private residences. Administration officials, including Vice President JD Vance, have defended the approach as lawful, saying administrative warrants are still warrants.\n\nThe broad authority DHS is using has alarmed some Republicans.\n\n\"I am not a big fan of administrative warrants. I think warrants to enter someone's house should be Fourth Amendment warrants,\" said Senate Homeland Security Committee Chair Rand Paul, R-Ky.\n\nSen. Susan Collins, R-Maine, had called for an end to the large-scale operation in her state, which resulted in the arrest of over 100 people in what ICE dubbed, \"Operation Catch of the Day.\"\n\n\"I have been urging Secretary Noem and others in the Administration to get ICE to reconsider its approach to immigration enforcement in the state,\" Collins said in a statement, writing that she had spoken to Noem and the operation there was no longer ongoing.\n\nBut Democrats want guardrails to prevent similar \"roving\" operations in other places.\n\nDemocrats want to make it easier to pursue legal action against immigration officers and \"independent investigations\" into ICE and other federal enforcement misconduct.\n\nDemocrats have previously raised questions about the efficacy of DHS oversight mechanisms to investigate employee misconduct and critics have pointed out that the department, which houses ICE, is investigating itself in the most recent deadly incidents.\n\nIn the aftermath of the shooting of Renee Macklin Good, the 37-year-old killed by an ICE officer earlier this month, the Federal Bureau of Investigations and ICE announced they would run parallel investigations and not conduct a joint investigation with state officials.\n\nThe move prompted backlash from local officials, like Minnesota's Democratic Gov. Tim Walz, who argue that the investigation may not be fair since agency leaders were already defending the officers' conduct.\n\nDemocrats want to mandate that agents display clearer identification, not cover their faces and wear body cameras.\n\nDHS leaders have defended the use of masks arguing that there is an increased threat of doxxing and physical threats to identified agents and their families.\n\nBody camera requirements have also come into focus after the two shootings in Minneapolis. DHS has long said it does not have enough body cameras for every single agent.\n\nTo address concerns about the lack of body cameras, the current version of the DHS spending bill, which has already passed the House, includes $20 million for cameras for ICE and Customs and Border Protection. But the bill only mandates the money be spent -- it does not mandate the use of the cameras.\n\n\"Funding them without wearing them means nothing,\" Blumenthal told NPR.\n\nWhy Democrats feel emboldened \n\nAfter a record 43-day shutdown last fall, many Democrats were weary of even a short funding lapse.\n\nBut that environment changed this week. Even five of six Democrats who broke with their party to end the last stalemate now said the risk of another shutdown was something they were willing to take on.\n\n\"ICE is out of control, Donald Trump is out of control,\" said one of those Democrats, Sen. Jacky Rosen of Nevada. \"Our Constitution, not a suggestion, our Bill of Rights, not a suggestion.\"\n\n\"I think if we're fighting for these reforms, we're exactly where the American people want us to be,\" said Sen. Chris Murphy, D-Conn., who early on urged his colleagues to oppose homeland security funding.\n\nDrew Hammill, who worked for former House Speaker Nancy Pelosi, who as the House minority leader helped direct Democrats' strategy during the 2018-2019 shutdown over border wall funding, said the debate over ICE tactics cuts much closer to home for most Americans.\n\n\"From a debate about a distant wall to your own neighborhood, your own backyard, the safety of your community — that's a different scenario,\" Hammill said. \"Voters want and expect a fight. And I think this is one of the few opportunities with a lawless president to have any impact.\"\n\nRepublican Capitol Hill veteran Antonia Ferrier says her old boss, former Senate Majority Leader Mitch McConnell, used to describe shutdown standoffs as box canyons — narrow gorges with no exit on the other end. \"You're making demands and there is no way out,\" Ferrier said.\n\nBut she says Democrats may feel emboldened because this moment is spurring anger and passion on both sides of the aisle that strikes at something more fundamental about the direction of the country in a way that the health subsidies debate did not.\n\n\"What I think we're seeing right now is markedly different,\" she said. \"It was a very significant inflection point, and I think now there is just so much attention and outrage that many Republicans agree there has to be some kind of changes made.\"","summary":"A spending agreement under consideration in the Senate would temporarily fund the Department of Homeland Security while lawmakers negotiate provisions to rein in federal immigration agents.","url":"https://www.npr.org/2026/01/29/nx-s1-5693050/trump-minneapolis-government-shutdown-funding-immigration-republicans","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5222x3480+0+0/resize/5222x3480!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F84%2Fad%2Fac9994744ef0a5f763e592d632c0%2Fap26028780542293.jpg","video":null,"publish_date":"2026-01-30 01:10:23","author":"Ximena Bustillo","authors":["Ximena Bustillo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.318},{"id":397529628,"title":"Donald Trump threatens Canada with 50% tariff on aircraft sold in US, expanding trade war ","text":"President Donald Trump on Thursday threatened Canada with a 50% tariff on any aircraft sold in the US, the latest salvo in his trade war with America’s northern neighbor as his feud with Prime Minister Mark Carney expands. Trump’s threat posted on social media came after he threatened over the weekend to impose a 100% tariff on goods imported from Canada if it went forward with a planned trade deal with China. But Trump’s threat did not come with any details about when he would impose the import taxes, as Canada had already struck a deal. In Trump’s latest threat, the Republican president said he was retaliating against Canada for refusing to certify jets from Savannah, Georgia-based Gulfstream Aerospace. (This is a developing story..)","url":"https://indianexpress.com/article/world/donald-trump-threatens-canada-with-50-tariff-on-aircraft-sold-in-us-10502564/","image":"https://images.indianexpress.com/2026/01/US-3-27.jpg","video":null,"publish_date":"2026-01-30 01:09:03","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.02},{"id":397531008,"title":"$10 billion lawsuit: IRS, Treasury department faces Trump's wrath over tax return leak","text":"US President Donald Trump on Thursday (local time) filed a $10 billion lawsuit against the Internal Revenue Service and the Treasury Department, accusing them of unlawfully disclosing his tax returns to the media in 2019 and 2020, Reuters reported.According to Reuters, in a complaint filed in Miami federal court, Trump, his adult sons and his namesake company said the agencies failed to take “mandatory precautions” to prevent former IRS contractor Charles Littlejohn from leaking their tax returns to “leftist media outlets” including the New York Times and ProPublica.(With inputs from Reuters)(This is a developing story; check later for updates)","url":"https://www.livemint.com/news/us-news/10-billion-lawsuit-irs-treasury-department-faces-donald-trumps-wrath-over-tax-return-leak-11769734495582.html","image":"https://www.livemint.com/lm-img/img/2026/01/30/1600x900/Melania-Trump-Movie-60_1769735203897_1769735220575.jpg","video":null,"publish_date":"2026-01-30 01:07:55","author":"Mausam Jha","authors":["Mausam Jha"],"language":"en","category":"politics","source_country":"in","sentiment":-0.318},{"id":397529926,"title":"Tim Walz says political career is OVER after Minnesota fraud fallout and ICE shootings: 'Never again'","text":"Tim Walz said he will never run for elected office again, confirming his political career is over following months of unrest in Minnesota. \n\nWalz made the decision after weeks of scandal that led to his decision to end a run for a third term as governor. \n\nHowever, Walz said that after the fallout from the Minnesota daycare fraud scandal and trying to fight back Donald Trump over ICE's presence in Minneapolis, he's quitting politics.\n\n'I will never run for an elected office again. Never again,' he emphatically told MS Now, shutting down a potential run for Senate in the future. \n\nThe Democrats will put up Senator and former presidential candidate Amy Klobuchar, who Walz has endorsed. Minnesota's other Senate seat is also open and will be determined in the midterm elections.\n\nIt marks a stunning downfall for Walz, who had launched his quest for a third term just this past September. \n\nWalz was previously expected to run for a third consecutive term as Governor, despite his previous failed national campaign as Kamala Harris' vice-presidential running mate in the 2024 presidential election. \n\nYet, a growing number of elected officials inside Walz's party expressed concerns about the viability of him winning the gubernatorial election, according to the Minnesota Star Tribune reports ahead of his announcement.\n\nNearly a dozen Democrats who have spoken to the newspaper in recent weeks said they thought Walz should not seek re-election - with some even comparing his run for a third term to former President Joe Biden's doomed 2024 campaign.\n\nThe governor has been mired in a deepening scandal over scams involving state welfare, including payments to daycares and COVID-era loans. \n\nOver 90 people have been charged, with the majority of the defendants indicted so far coming from the Somali community. \n\nWalz, who was Kamala Harris' running mate on the Democratic presidential ticket in 2024, also noted that he 'came to the conclusion' he could not give his all to a political campaign after conversations with his family. \n\nWalz previously appeared to acknowledge some degree of fraud that existed in his state in a statement made last month.\n\n'This is on my watch. I am accountable for this. And more importantly, I am the one that will fix it,' Walz said at the time. \n\nIndependent journalist Nick Shirley conducted a series of visits to Minnesota daycares that serve the Somali community, attempting to interview the operators, and published his findings on X last month.\n\nShirley took a victory lap during Walz's presser, posting on X Monday that he 'ended Tim Walz.'\n\nShirley alleged that a Hennepin County daycare appeared closed when he visited, even though he claims it has received about $4 million in state childcare subsidies — a charge the center disputes and which has not been independently verified.\n\nThe shocking film sparked an immediate federal response including by FBI Director Kash Patel and Department of Homeland Security chief Kristi Noem who then announced investigations into the loans.\n\nProsecutors now say at least 57 people connected with the Feeding Our Future program billed the federal government $250 million, claiming to buy meals for children during the COVID pandemic.\n\nInstead, the defendants allegedly used the stolen money to buy Lamborghinis, Porsche SUVs, beachfront property in Kenya and private villas in the Maldives. The vast majority of those convicted in the case are Somali.\n\nInvestigators then found that around $9 billion in federal Medicaid funds supporting 14 Minnesota programs since 2018 may have been stolen, US Attorney Joe Thompson announced on December 18.\n\nEighty-two of the 92 defendants in the child nutrition, housing services and autism program scams are Somali, prosecutors say.\n\nIt was later revealed that Walz had connections with at least some of the refugees charged in the fraudulent scheme.\n\nWalz has also feuded with Trump until recently over ICE's presence in Minneapolis, including the fatal shootings of Renee Good and Alex Pretti.\n\nHowever, relations between the two have seemingly cooled this week, with a phone call leading to Border Czar Tom Homan's presence in the city over Border Patrol Commander Greg Bovino.\n\nWalz praised protesters who had confronted members of ICE and Border Patrol in recent weeks during the interview.\n\n'They’re never going to run for office, and those grass-tops leaders brought this administration to their knees this week to do something about it. So there’s other ways to serve, and I’ll find them,' he said. \n\nKlobuchar's entry into the Minnesota gubernatorial race is formidable for both Democrats and Republicans alike.\n\nNow in her fourth term as senator, Klobuchar won her last election in 2024 with over 56 percent of the vote despite President Donald Trump driving GOP turnout that year.\n\nShe also won her 2018 election with over 60 percent of the vote, and another statewide run in 2012 by over 65 percent.","summary":"The failed vice presidential nominee started 2026 trying to run for a third term as governor of the reliably Democrat-leaning state but said 'never again' to running for elected office.","url":"https://www.dailymail.co.uk/news/article-15511167/Tim-Walz-political-career-over.html","image":"https://i.dailymail.co.uk/1s/2026/01/29/23/105949617-0-image-m-13_1769728768152.jpg","video":"https://video.dailymail.com/video/mol/2025/12/29/3477422222171391650/1024x576_MP4_3477422222171391650.mp4","publish_date":"2026-01-30 01:06:09","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.372},{"id":397527708,"title":"Stay informed, daily","text":"Responding to ‘Heart of the arts’: Libs promise millions for heritage facelift\n\nMany thanks for your article regarding this election promise, and for highlighting the iconic Regal Theatre.\n\nThe Regal has “cat-like” survival, recently celebrating its first century. The tenacity of the Regal is documented in the recently published history book: With Love to the Princess – a celebration of a century of entertainment.\n\nThe proposed upgrading of the Regal will ensure its continuation as a viable, relevant and sustainable entertainment and community service venue.\n\nWe, Friends of the Regal Theatre – an apolitical group – urge the Government to support the funding of the proposed upgrading, which will pay handsome dividends to the community for many years to come. – John Fitzpatrick\n\nIt will be great if Labor agrees to match or even better surpass the Libs commitment to this iconic building. – Aidan Leahy\n\nNot sure why the Liberals think that the cultural centre for the arts is in the eastern suburbs. Is it because their offices are in those suburbs? It is because their friends and family live in the eastern suburbs? I would think that the Art Gallery might beg to differ on location; meanwhile, we have the Fringe in the city, a walking art collection at the Brighton Jetty Sculptures, which has been around for a few years. We have the historic Thebarton Theatre and the State Festival Theatre in the city. How about spending money on the visual arts instead? As an artist, I really don’t have anywhere to show off my art, simply because the galleries are expensive and limited in size, resorting to online only. Arts should be accessible to everyone, not just those in the eastern suburbs. – Ersu \n\nResponding to Smithson: Ley’s sneak SA visit a ‘move over chaps’ moment for Libs\n\nIt was Mike Rann who defeated Isabel Redmond in the 2010 state election – not Jay Weatherill. I would be grateful if you would acknowledge this fact. It was Mike’s third election win, as I’m sure you will now recall. – Michele Virgo\n\nSmitho, Sussan Ley’s visit was hardly quiet. Her photo ops were all over social media with Anne Ruston, including a trip to Port Lincoln for the Tunarama. She would have been better served by reading and understanding the new hate law legislation and not complaining about not having enough time to read it. After all, she was the one who demanded parliament return early!\n\nAshton Hurn appears to be a breath of fresh air for the Liberal Party and is very articulate; however, I don’t think that’s enough to save them. Someone will have to be the “fall guy”, and as much as it shouldn’t be her, it will be. That appears to be the Liberal Party’s modus operandi. Unfortunately, it seems the One Nation bandwagon is in hot pursuit of, it would appear, Liberal seats, particularly as it appears SA Best are not at its best with Connie Bonaros’s term expiring this year. Ashton Hurn’s seat is not immune, but I hope voters listen to her, not the policy-free zone called One Nation. You are right, however, federal Liberals need to stay away from the SA election for Ashton Hurn’s sake, although even that won’t be enough, I suspect. – Di Martin\n\nResponding to Top authors signing up for alt Adelaide Writers’ Week\n\nGood news! – Ann Gorey \n\nDo the authors signing up for the alt Adelaide Writers’ Week include people from all walks of life and faiths? That would be meaningful, bringing everyone together for constructive talks and eliminate narrow mindedness to portray only one side of a story. – Judith McKinnon\n\nWould be interesting to see if they invite any pro-Israel Jewish or conservative writers to provide balance and opportunities for the public to hear alternative views. – Peter Jackson\n\nSteven Streeter argues that Writers’ Week (and Guerilla Writers’ Week) is “elitist,” then says he was “greatly disappointed” that “politics had entered Writers’ Week,” adding: “I believe our personal opinions have no place in open public events.” That position collapses on contact with itself.\n\nFirst, calling a festival “elitist” is already a political judgement about power, access, culture and status. You don’t get to throw that grenade and then declare the room must be politics-free. “No politics” is not neutrality; it’s a demand for silence – usually from everyone except those already comfortable with how things are run.\n\nSecond, “open public events” are not those where opinions are suppressed. They’re those where disagreement can be aired without intimidation, with basic standards of respect, moderation and right of reply. A Writers’ Week that bans “personal opinions” becomes a lifestyle product: panels as polite entertainment, literature reduced to branding.\n\nThird—and this is the irony—Streeter writes horror. Horror is one of the most political genres in the modern canon: it is where societies stage their fears, denials and consequences. Outback horror, in particular, is soaked in public questions about land, belonging, ecological disruption, violence, myth and the return of what has been ignored. If you write stories of what’s underground, what’s invasive, what erupts from the margins, you understand better than most that the repressed doesn’t disappear—it comes back louder. – Stewart Sweeney\n\nResponding to Fresh Eyre Peninsula plan to tackle worrying feral deer and fox numbers\n\nI would like to see fleabane registered as a noxious weed, please. It is very hard to control, and I have been told it is starting impact grain-growing areas on Eyre Peninsula. It is very hard to kill and comes back every summer, twice as much as the previous year! – Alison Goddard\n\nResponding to ‘Extremely concerning’: Australia Day terror plot claim\n\nIt will be interesting to follow the role of the new Ambassador to the USA, career diplomat Greg Moriarty, who has served as Defence secretary for nearly a decade and was previously chief of staff to former prime minister Malcolm Turnbull.\n\nAustralians who are concerned over the origins of the AUKUS alliance, the expansion of US bases in Australia and the belligerent statements of Donald Trump, will hope the Ambassador still hears the warnings of AUKUS danger from Malcolm Turnbull and former Australian Foreign Minister Gareth Evans.\n\nOn the home front, the same concerned Australians will be watching the newly formed command in our Australian Federal Police, which focuses on security for AUKUS and includes ‘Public Order Management.’\n\nLet’s hope our new ambassador will not abandon our capacity for independent sovereign judgment under the pressure of Washington. – Julanne Sweeney\n\nResponding to Team reveals TDU champ’s injuries after kangaroo collision\n\nWhile it’s distressing to read about the rider’s injuries, why no mention of the fate of the kangaroos? – Dr David Ness","url":"https://www.indailysa.com.au/news/opinion/2026/01/30/letters-to-the-editor-on-an-alternative-writers-week","image":"https://wp.solsticemedia.com.au/wp-content/uploads/2026/01/finizio-batty-regal-theatre.jpg?w=1024","video":null,"publish_date":"2026-01-30 01:05:41","author":null,"language":"en","category":"politics","source_country":"au","sentiment":0.332},{"id":397529560,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - Antigua Tribune – Daily","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://antiguatribune.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://antiguatribune.com/app/uploads/2026/01/AP26029819730071-1769730382-XMtL6r.jpg","video":null,"publish_date":"2026-01-30 01:05:39","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ag","sentiment":0.127},{"id":397527964,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - Haiti Gazette – Daily Haiti News","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://haitigazette.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://haitigazette.com/app/uploads/2026/01/AP26029819730071-1769730382-5h2ZcL.jpg","video":null,"publish_date":"2026-01-30 01:05:28","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":0.127},{"id":397528244,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - Dominican Republic Post –","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://dominicanrepublicpost.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://dominicanrepublicpost.com/app/uploads/2026/01/AP26029819730071-1769730382-kwVpz7.jpg","video":null,"publish_date":"2026-01-30 01:05:28","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":0.127},{"id":397528410,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  | Barbados Gazette – Barbados &amp;","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://barbadosgazette.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://barbadosgazette.com/app/uploads/2026/01/AP26029819730071-1769730382-B8DB5I.jpg","video":null,"publish_date":"2026-01-30 01:05:20","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"bb","sentiment":0.127},{"id":397531206,"title":"Trump building 'white supremacist army' inside gov that will outlast him: Ta-Nehisi Coates","text":"Acclaimed author and essayist Ta-Nehisi Coates claimed Thursday that President Donald Trump is building a \"white supremacist army\" inside the U.S. government that will last long after he's gone.\n\nCoates joined former GOP operative Tim Miller on \"The Bulwark Podcast\" to discuss the Trump administration and propaganda. During the discussion, the two discussed a \"reality shift\" with Trump's Department of Homeland Security, which has come under enormous criticism for the killings of two U.S. citizens in Minneapolis, Minnesota.\n\nMiller said what he found most striking of all the \"gross s---\" was Secretary Kristi Noem standing in front of a \"concentration camp\" in El Salvador, referring to CECOT.\n\n\"That's probably the worst,\" he said. \n\nBut Miller was also aghast at the Trump administration's moves to push propaganda on Americans using ASMR videos and memes, which Coates noted wasn't possible in decades past.\n\n\"A lot of the memes they're putting out are just old 1950s posters reupped. Like you could've done that in Photoshop,\" he quipped. While that isn't \"acutely harming\" people akin to hurling someone into a detention center, he flagged the \"perniciousness\" of the campaign that has long term ramifications.\n\nCoates called it \"armed identity politics.\" While all politics is \"identity politics,\" Coates stressed it's not all this brand of identity politics.\n\n\"As you pointed out, the memes, the 1950s stuff, the white supremacist stuff, where I get a New York Times article where the Times reporter calls up and says, 'Hey, uh, this is clearly a white supremacist anthem.' They deny it and the guy goes and checks it. They they act like he's lying and secretly take it down.\"\n\nCoates stressed this is \"something new.\"\n\n\"I've said some pretty harsh things in my time but I don't know that I've seen before the President of the United States attempt to build what I can only call a white supremacist army that'll outlast him. That is new. And I don't know what else to call it! Given the propaganda and the recruiting. I don't know what anybody else would want me to say.\"","summary":"Acclaimed author and essayist Ta-Nehisi Coates claimed Thursday that President Donald Trump is building a \"white supremacist army\" inside the U.S. government that will last long after he's gone.\n\nCoates joined former GOP operative Tim Miller on \"The Bulwark Podcast\" to discuss the Trump administration and propaganda. During the discussion, the two discussed a \"reality shift\" with Trump's Department of Homeland Security, which has come under enormous criticism for the killings of two U.S. citizens in Minneapolis, Minnesota.\n\nMiller said what he found most striking of all the \"gross s---\" was Secretary Kristi Noem standing in front of a \"concentration camp\" in El Salvador, referring to CECOT.\n\n\"That's probably the worst,\" he said. \n\nBut Miller was also aghast at the Trump administration's moves to push propaganda on Americans using ASMR videos and memes, which Coates noted wasn't possible in decades past.\n\n\"A lot of the memes they're putting out are just old 1950s posters reupped. Like you could've done that in","url":"https://www.rawstory.com/trump-white-supremacy-2675060611/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-reacts-while-delivering-remarks-at-the-u-s-treasury-department-s-trump-accounts-summit-in-washingt.jpg?id=63522746&width=1200&height=1200&coordinates=835%2C0%2C835%2C0","video":null,"publish_date":"2026-01-30 01:05:19","author":"Daniel Hampton","authors":["Daniel Hampton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.509},{"id":397533178,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - St. Lucia Chronicle – Daily St","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://stluciachronicle.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://stluciachronicle.com/app/uploads/2026/01/AP26029819730071-1769730382-sSBtlJ.jpg","video":null,"publish_date":"2026-01-30 01:04:58","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"lu","sentiment":0.127},{"id":397530460,"title":"Trump and 2 of his sons sue IRS, US Treasury for $10 billion over tax return leak","text":"US President Donald Trump, his two eldest sons and his family business have filed a sweeping lawsuit against the Internal Revenue Service and the US Treasury Department, alleging that federal authorities failed to prevent the unlawful disclosure of their confidential tax information.According to court records cited by CNBC, the civil suit was filed in federal court in Miami and seeks at least $10 billion in damages. The plaintiffs include Trump, his sons Donald Trump Jr. and Eric Trump, and the Trump Organisation, which is run by the two brothers.The complaint alleges that the IRS and the Treasury Department breached their legal duty by failing to safeguard sensitive taxpayer data, allowing a former IRS contractor to leak the information during 2019 and 2020.ALLEGED LEAK BY FORMER IRS CONTRACTORAt the centre of the case is Charles \"Chaz\" Littlejohn, a former IRS employee who later worked as a contractor. The lawsuit claims that Littlejohn was able to access and disclose the Trump family’s tax records because of systemic failures within federal agencies tasked with protecting such information..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}Littlejohn, now 40, is currently serving a five-year prison sentence after pleading guilty in October 2023 to one count of unlawful disclosure of tax return information. He admitted leaking Trump’s tax records to The New York Times and also acknowledged disclosing tax information about other wealthy individuals to ProPublica.A spokesman for Trump’s legal team said the case shows a serious breach of trust by federal authorities.\"The IRS wrongly allowed a rogue, politically-motivated employee to leak private and confidential information about President Trump, his family, and the Trump Organization to the New York Times, ProPublica and other left-wing news outlets, which was then illegally released to millions of people,\" the spokesman said in a statement to CNBC.\"President Trump continues to hold those who wrong America and Americans accountable,\" the spokesman added.The lawsuit was filed just days after Treasury Secretary Scott Bessent announced that he had cancelled all Treasury Department contracts with consulting firm Booz Allen Hamilton. The move followed revelations that Littlejohn, who leaked the records, had been employed by the firm as a contractor.CLAIMS AGAINST MEDIA REPORTINGThe suit also takes aim at ProPublica’s reporting, noting that Littlejohn admitted in a 2024 deposition to disclosing \"Trump information (that) included all businesses that he had owned\" to the investigative outlet. The complaint argues that ProPublica’s subsequent coverage falsely claimed the records showed \"versions of fraud,\" an assertion the plaintiffs strongly deny.The case adds a new legal front to Trump’s long-running battles over his tax records, raising broader questions about data security within US federal agencies and the consequences of unauthorised disclosures of confidential taxpayer information.- EndsWith inputs from inputsPublished By: Satyam SinghPublished On: Jan 30, 2026","url":"https://www.indiatoday.in/world/us-news/story/trump-and-sons-sue-irs-us-treasury-department-for-10-billion-tax-record-breach-glbs-2860109-2026-01-30","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/donald-trump-300216231-16x9_0.png?VersionId=3YlU3EtJtyZFYb9rbTfNRO5j0urvsaWc?size=1280:720","video":null,"publish_date":"2026-01-30 01:03:11","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.282},{"id":397528342,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - Guyana Inquirer – Daily Guyana News","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://guyanainquirer.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://guyanainquirer.com/app/uploads/2026/01/AP26029819730071-1769730382-03buvr.jpg","video":null,"publish_date":"2026-01-30 01:02:01","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":0.127},{"id":397530118,"title":"President Trump says he'll pick Fed chair within next day","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics January 29, 2026 00:30 \n\n President Trump says he'll pick Fed chair within next day \n President Donald Trump makes a special announcement from the red carpet of the 'Melania' premiere.\n\nTags POLITICSWHAT TO WATCHSHOWS","summary":"President Donald Trump makes a special announcement from the red carpet of the &apos;Melania&apos; premiere.","url":"https://www.foxbusiness.com/video/6388513222112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8017734f-0ca6-4e46-a90f-4c6656237514/f583404a-3d4b-446a-b204-3c6e5b7431e0/1280x720/match/1024/512/image.jpg?pubId=854081161001?ve=1&tl=1","video":null,"publish_date":"2026-01-30 01:01:52","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.18},{"id":397532096,"title":"President Trump says he'll pick Fed chair within next day","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle January 29, 2026 00:30 \n\n President Trump says he'll pick Fed chair within next day \n President Donald Trump makes a special announcement from the red carpet of the 'Melania' premiere.\n Tags POLITICSV-VIDEOTHE INGRAHAM ANGLESHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIR","summary":"President Donald Trump makes a special announcement from the red carpet of the &apos;Melania&apos; premiere.","url":"https://www.foxnews.com/video/6388511653112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8017734f-0ca6-4e46-a90f-4c6656237514/f583404a-3d4b-446a-b204-3c6e5b7431e0/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-01-30 01:01:32","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.158},{"id":397531610,"title":"Trump says Putin agreed to halt strikes on Ukraine amid extreme cold","text":"United States President Donald Trump said that Russian President Vladimir Putin has agreed to a week-long pause in fighting in the Ukraine war.Speaking at a Cabinet meeting focused on the US government shutdown, Trump also addressed developments in the Gaza ceasefire and the Ukraine conflict, noting that the pause was agreed upon because of extremely cold weather in the region.Because of the cold, extreme cold... I personally asked President Putin not to fire on Kyiv and the cities and towns, said Trump, adding that Putin has agreed to this pause.It was very nice. Because on top of everything else, its not what they need, missiles coming to their towns [when it is this cold], said Trump. I thought It was a very good thing. Ukraine almost did not believe it and they were very happy to hear it as they are struggling very badly, Trump added further. What is a cold snap?The cold snap refers to the severe cold wave currently affecting Ukraine and Russia. According to local reports, temperatures in Ukraine have dropped as low as minus 27°C.Ukraine’s State Emergency Service has warned of a sharp decline in temperatures in February. The Ukrainian Hydrometeorological Centre forecasts that overnight temperatures across most regions between February 1 and 3 will fall to minus 20 to minus 27°C.Local media reported that temperatures in the Kyiv, Chernihiv, Zhytomyr, Rivne, Sumy, Poltava, and Kharkiv regions, as well as in the capital Kyiv, are expected to drop to minus 20–25°C, with daytime highs ranging between minus 15 and 22°C.In Russia, temperatures continue to fall, with the Far East experiencing its heaviest snowfall in 60 years after a winter storm swept across Asia last week.According to a Reuters report, scientists said the extreme weather is linked to waves of cold Arctic air, one impacting eastern Russia and Asia, and another affecting eastern Europe.","url":"https://zeenews.india.com/world/trump-says-putin-agreed-to-halt-strikes-on-ukraine-amid-extreme-cold-3011802.html","image":"https://english.cdn.zeenews.com/sites/default/files/2026/01/30/1898503-mixcollage-30-jan-2026-06-31-am-3180.jpg?im=Resize=(1200,900)","video":null,"publish_date":"2026-01-30 01:01:29","author":"Zee Media Bureau","authors":["Zee Media Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":-0.376},{"id":397529718,"title":"Would you trust the Trump family with all your money?","text":"Not content to con people with a vaporware smartphone or get investors involved in a complicated scammy crypto thing or start a shady fintech company, the Trump family has a great new idea: Let the Trump family geniuses—none of whom have ever held an actual job that wasn’t thanks to Daddy—open a bank. \n\nAnd even better, let Trump’s regulators oversee it—or, well, not oversee it.\n\nBut wait for the cherry on top … White House envoy Steve Witkoff will run the bank! That’s a recipe for success, right? \n\nWell, probably for the Trump and Witkoff families, but maybe not so much for actual consumers. Under President Donald Trump, financial regulations have fallen by the wayside, often in the service of lining the pockets of himself, his family, his donors, and his cronies.\n\nIn February 2025, the Securities and Exchange Commission gave the Trump family’s shady crypto efforts a big boost, saying that meme coins are not securities, so it cannot regulate Trump’s dumb meme coins like $TRUMP or $MELANIA. \n\nThat’s pretty helpful for Trump, as these worthless things have nonetheless given his family and business cronies hundreds of millions in fees. It’s also a helpful way to hand Trump a few extra million bucks, as evinced by his bribe-tastic crypto dinner. \n\nSure, the meme coins are basically worthless, but fake-investing in them can pay off handsomely. \n\nJust ask Justin Sun, who pumped $40 million into $TRUMP to attend that dinner. In return, Trump dropped the SEC’s fraud lawsuit against Sun. Isn’t it nice when friends can help each other out?\n\nDid I mention that the same company that ran the dinner, World Liberty Financial, is going to open the bank?\n\nOne of World Liberty’s rationales for being allowed to do this is that the Office of the Comptroller of the Currency—the federal regulator reviewing its application—already gave five other crypto companies conditional approval. \n\nSure, but those crypto companies are not run by the president’s family … \n\nRelated | Trump family proves grift does not skip a generation\n\nBut no sweat, as Jonathan Gould, the head of the OCC, has declined the request of Democratic Sen. Elizabeth Warren of Massachusetts to delay reviewing World Liberty’s charter application until Trump and his family divest. Sure, no extra scrutiny needed there!\n\nDo we really even need securities or banking regulations if everything is just a vehicle for Trump family grifts that can’t be stopped?\n\nWell, yes, because Trump needs the SEC to exist in order to punish anyone who shorts his stock. No, really. When a hedge fund shorted Trump Media—a perfectly legal thing to do—the company—which is owned by the Trump family—asked the SEC—which is run by a Trump appointee—to investigate the hedge fund.\n\nBut how dare you imply that all of this is corrupt? \n\nHere’s White House press secretary Karoline Leavitt getting very touchy about being asked if it’s problematic that the Trump family’s bank that will be overseen by Trump regulators: “The media’s continued attempts to fabricate conflicts of interest are irresponsible and reinforce the public’s distrust in what they read.”\n\nMa’am, Trump issued an executive order last February declaring that he would make federal agencies, including the SEC, “truly accountable to the American people.” \n\nOf course, according to Trump, being truly accountable means that all agencies are subject to “presidential supervision and control of the entire executive branch.” \n\nLet’s not kid ourselves: This bank will be nothing but a state-sanctioned, barely regulated grift—a vehicle to drive profits directly into the pockets of Trump and his family. \n\nBut don’t you dare call that a conflict of interest.","summary":"Not content to con people with a vaporware smartphone or get investors involved in a complicated scammy crypto thing or start a shady fintech company, the Trump family has a great new idea: Let the Trump family geniuses—none of whom have ever held an actual job that wasn’t thanks to Daddy—open a bank. \n\n\n\nAnd even better, let Trump’s regulators oversee it—or, well, not oversee it.\n\n\n\nBut wait for the cherry on top … White House envoy Steve Witkoff will run the bank! That’s a recipe for success, right? \n\n\n\n\nEric Trump, Don Hendrickson, Eric Thomas, Patrick O'Brien and Donald Trump Jr. announce the Trump Mobile on June 16, 2025.\n\n\nWell, probably for the Trump and Witkoff families, but maybe not so much for actual consumers. Under President Donald Trump, financial regulations have fallen by the wayside, often in the service of lining the pockets of himself, his family, his donors, and his cronies.\n\n\n\nIn February 2025, the Securities and Exchange Commission gave the Trump family’s shady crypto efforts a big boost","url":"https://www.dailykos.com/story/2026/1/29/2366191/-Would-you-trust-the-Trump-family-with-all-your-money?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1522442/story_image/AP20241153898619.jpg?1769724011","video":null,"publish_date":"2026-01-30 01:01:06","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","source_country":"US","sentiment":-0.503},{"id":397533354,"title":"Trump blames boredom, not sleep, for closed eyes during cabinet meeting","text":"WASHINGTON - Sleeping or bored? For U.S. President Donald Trump, it's in the eye of the beholder.Trump on Thursday said he was not asleep, just bored, during his cabinet meeting in December, when he shut his eyes for several extended periods.'Some people said, he ​closed his eyes. Look, it got pretty boring,' Trump told laughing officials in the ‍White House Cabinet ⁠Room on Thursday. 'I didn't sleep. I just closed them because I wanted ‍to get the hell outta here.","summary":"Trump on Thursday said he was not asleep, just bored, during his cabinet meeting in December, when he shut his eyes for several extended periods.","url":"https://www.japantimes.co.jp/news/2026/01/30/world/trump-eyes-closed-cabinet-meeting/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2026/01/30/520235.jpg?v=3.1","video":null,"publish_date":"2026-01-30 01:01:00","author":"Steve Holland,Trevor Hunnicutt,Web Master","authors":["Steve Holland","Trevor Hunnicutt","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-1},{"id":397529454,"title":"Iran threatens to hit US bases, carriers in event of attack","text":"PARIS: Iran threatened Thursday to instantly strike US bases and aircraft carriers in response to any attack, after US President Donald Trump warned time was running out for Tehran and the EU blacklisted its Revolutionary Guards as a terror group.\n\nAs Brussels and Washington dialled up their own rhetoric and Iran issued stark threats, UN chief Antonio Guterres called for nuclear negotiations to “avoid a crisis that could have devastating consequences in the region”. An Iranian military spokesman warned Tehran’s response to any US action would not be limited — as it was in June last year when American planes and missiles briefly joined Israel’s short air war against Iran — but would be a decisive response “delivered instantly”.\n\nREAD MORE: Trump says Iran wants talks as US aircraft carrier deploys\n\nBrigadier General Mohammad Akraminia told state television US aircraft carriers have “serious vulnerabilities” and that numerous American bases in the Gulf region are “within the range of our medium-range missiles”. “If such a miscalculation is made by the Americans, it will certainly not unfold the way Trump imagines — carrying out a quick operation and then, two hours later, tweeting that the operation is over,” he said.\n\nAn official in the Gulf, where states host US military sites, told AFP that fears of a US strike on Iran are “very clear”.\n\n“It would bring the region into chaos, it would hurt the economy not just in the region but in the US and cause oil and gas prices to skyrocket,” the official added.\n\nQatar’s leader Sheikh Tamim bin Hamad Al Thani and Iran’s President Masoud Pezeshkian held a call to discuss “efforts being made to de-escalate tensions and establish stability,” the Qatar News Agency (QNA) reported.","summary":"PARIS: Iran threatened Thursday to instantly strike US bases and aircraft carriers in response to any attack, after US President Donald Trump warned time was running out for Tehran and the EU blacklisted its Revolutionary Guards as a terror group.\n\n\nAs Brussels and Washington dialled up their own rhetoric and Iran issued stark threats, UN chief Antonio Guterres called for nuclear negotiations to “avoid a crisis that could have devastating consequences in the region”. An Iranian military spokesman warned Tehran’s response to any US action would not be limited — as it was in June last year when American planes and missiles briefly joined Israel’s short air war against Iran — but would be a decisive response “delivered instantly”.\n\n\nREAD MORE: Trump says Iran wants talks as US aircraft carrier deploys\n\n\nBrigadier General Mohammad Akraminia told state television US aircraft carriers have “serious vulnerabilities” and that numerous American bases in the Gulf region are “within the range of our medium-range missile","url":"https://www.brecorder.com/news/40404836/iran-threatens-to-hit-us-bases-carriers-in-event-of-attack","image":"https://i.brecorder.com/large/2026/01/3006001777faae9.webp","video":null,"publish_date":"2026-01-30 01:00:29","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.073},{"id":397527870,"title":"Venezuela’s Rodriguez signs oil reform law while the US eases sanctions  - Trinidad Tribune – Latest","text":"Venezuela’s interim President Delcy Rodriguez has signed into law a reform bill that will pave the way for increased privatisation in the South American country’s nationalised oil sector, fulfilling a key demand from her United States counterpart, Donald Trump.\n\nOn Thursday, Rodriguez held a signing ceremony with a group of state oil workers. She hailed the reform as a positive step for Venezuela’s economy.\n\n“We’re talking about the future. We are talking about the country that we are going to give to our children,” Rodriguez said.\n\nThe ceremony came within hours of the National Assembly – dominated by members of Rodriguez’s United Socialist Party – passing the reform.\n\n“Only good things will come after the suffering,” said Jorge Rodriguez, the assembly’s head and brother of the interim president.\n\nSince the US military’s abduction of Venezuela’s former leader Nicolas Maduro and his wife Cilia Flores on January 3, the Trump administration has sought to pressure President Rodriguez to open the country’s oil sector to outside investment.\n\nTrump has even warned that Rodriguez could “pay a very big price, probably bigger than Maduro”, should she fail to comply with his demands.\n\nThursday’s legislation will give private firms control over the sale and production of Venezuelan oil.\n\nIt would also require legal disputes to be resolved outside of Venezuelan courts, a change long sought by foreign companies, who argue that the judicial system in the country is dominated by the ruling socialist party.\n\nThe bill would also cap royalties collected by the government at 30 percent.\n\nWhile Rodriguez signed the reform law, the Trump administration simultaneously announced it would loosen some sanctions restricting the sale of Venezuelan oil.\n\nThe Department of the Treasury said it would allow limited transactions by the country’s government and the state oil company PDVSA that were “necessary to the lifting, exportation, reexportation, sale, resale, supply, storage, marketing, purchase, delivery, or transportation of Venezuelan-origin oil, including the refining of such oil, by an established US entity”.\n\nPreviously, all of Venezuela’s oil sector was subject to sweeping US sanctions imposed in 2019, under Trump’s first term as president.\n\nThursday’s suite of changes is designed to make Venezuela’s oil market more appealing to outside petroleum firms, many of whom remain wary of investing in the country.\n\nUnder Maduro, Venezuela experienced waves of political repression and economic instability, and much of his government remains intact, though Maduro himself is currently awaiting trial in a New York prison.\n\nHis abduction resulted in dozens of deaths, and critics have accused the US of violating Venezuelan sovereignty.\n\nVenezuela nationalised its oil sector in the 1970s, and in 2007, Maduro’s predecessor, Hugo Chavez, pushed the government to increase its control and expropriate foreign-held assets.\n\nFollowing Maduro’s abduction, Trump administration officials have said that the US will decide to whom and under what conditions Venezuelan oil is sold, with proceeds deposited into a US-controlled bank account.\n\nConcerns about the legality of such measures or the sovereignty of Venezuela have been waved aside by Trump and his allies, who previously asserted that Venezuelan oil should “belong” to the US.","url":"https://trinidadtribune.com/venezuelas-rodriguez-signs-oil-reform-law-while-the-us-eases-sanctions/","image":"https://trinidadtribune.com/app/uploads/2026/01/AP26029819730071-1769730382-XBcCOK.jpg","video":null,"publish_date":"2026-01-30 01:00:27","author":"Cb_usr","authors":["Cb_usr"],"language":"en","source_country":"tt","sentiment":0.127},{"id":397530466,"title":"Melania Trump documentary debuts at Kennedy Center before worldwide release","text":"Melania Trump is capping her first year back as first lady with the global release of a documentary she produced about the 20 days leading up to husband Donald Trump’s return to the White House.A private person, Melania Trump remains a bit of a mystery to the public in her husband’s second term. “Melania” premieres Thursday at the Kennedy Center, where the Trumps are expected to walk a charcoal-colored runway during VIP arrivals before the film opens in theaters worldwide Friday.The first lady said she got the idea for the documentary after her husband won the 2024 election and said it will give viewers a rare, behind-the-scenes look at her life.The documentary, which was produced by AmazonMGM Studios and is said to have cost $40 million, will stream exclusively on the Amazon Prime Video streaming service after its theatrical run in approximately 1,600 screens worldwide Friday, including about 1,500 in the United States..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}But director Brett Ratner said he won't be measuring success by how it does at the box office. “It’s a documentary and documentaries historically have not been huge box office smashes,” he told reporters on his way into the premiere. “You can’t expect a documentary to play in theaters.”Government officials and conservative commentators were on hand for the event. Alina Habba, a former personal lawyer to President Donald Trump who now works as an adviser to Attorney General Pam Bondi, said the first lady is “the epitome of a boss lady\" and said she was wearing tall stiletto heels to the event in tribute.“She’s also very private and I think the fact that she allowed the cameras to come around and follow her at a critical time when we were going into this administration, it was amazing,” Habba told reporters.Second lady Usha Vance, Speaker Mike Johnson, and Robert Kraft, owner of the Super Bowl-bound New England Patriots, were expected at the event, along with FIFA President Gianni Infantino, according to a list from AmazonMGM Studios.Melania Trump said the film shows what it takes to step into the high-profile role as she juggles being a businessperson, a wife and a mother, as well as the coordinator of her family's move back to the Executive Mansion.“Everyone wants to know. So here it is,” she says in the trailer for the nearly two-hour film.‘HERE WE GO AGAIN’In another scene from the trailer, it is Inauguration Day and Melania Trump is inside the Capitol, waiting to be escorted into the Rotunda for the ceremony. She turns her head, looks directly into the camera that had been documenting her every move and says, “Here we go again.”She wrote in her self-titled memoir published in 2024 about how much she values her privacy. She is not as frequently seen or heard from as often as some of her recent predecessors, which may be influencing the public's perceptions of her. But she also likes to do things her way.The US public is divided on their views of the first lady, but a significant number — about 4 in 10 adults — had no opinion or had not heard of her, according to a CNN poll from January 2025. About 3 in 10 adults saw her favorably while roughly the same share had an unfavorable opinion.Her standing among Republicans was higher, with about 7 in 10 saying in the poll that they viewed her favorably, but around one-quarter did not have an opinion.“I think it’s an attempt, in a way, to really augment or tailor or really refine her image for the American public,” said Katherine Sibley, who teaches history at Saint Joseph’s University in Philadelphia. “She’s a mystery to the American people.”FIRST LADY CITES IMPACTFUL FIRST YEAR Melania Trump, 55, said she's honored to execute the traditional duties of first lady, such as planning state dinners, hosting the annual Easter Egg Roll and decorating for Christmas. But she also has suggested she wants to leave her mark in other ways, too.She spent chunks of time away from Washington last year working on the documentary and was deeply involved in every aspect of its development, according to Marc Beckman, her longtime senior adviser.The well-being and safety of children remains one of her top priorities, and she used her influence to lobby Congress to pass the “Take It Down Act,” making it a federal crime to publish intimate images online without consent. The president signed the bill into law and had her sign it, too.Her advocacy for foster children was enshrined in an executive order creating a “Fostering the Future” program. It's part of the “Be Best” child-focused initiative she launched in the first term.She also wrote to Russian President Vladimir Putin last year for help reuniting children who had been separated from their families because of his war against Ukraine. She had her husband hand-deliver the letter when the leaders met in Alaska, and she later announced that eight children had been reunited with their families.The first lady has a prominent role in the Republican administration's efforts on artificial intelligence and education and recently launched a global version of the foster child program.She told guests at a White House Christmas reception that she is working on a new legislative effort for 2026, but has not yet shared details.‘MELANIA’ MORE THAN A YEAR IN THE MAKING It was unclear how much money Melania Trump stands to earn or what her plans are for any film proceeds. Experts said it was unusual for a first lady to pursue a project of this kind from the White House — but not unusual for the Trumps.“As far as I know, she’s the first first lady to be paid a lot of money to have a documentary made about her and it is unprecedented in terms of the Trumps because they are always breaking precedent,” said Katherine Jellison, professor emerita of history at Ohio University.Presidents and first ladies generally refrain from pursuing outside business ventures while in office to avoid potential conflicts of interest or raising ethical concerns.Both Trumps participate in numerous business ventures, selling everything from watches, fragrances and Bibles for him to jewelry, Christmas ornaments and digital collectibles for her.The movie also marks another link between the Trumps and Amazon founder Jeff Bezos, who has worked to improve a once-tense relationship with the president. Amazon has declined to comment on the financial arrangements for the documentary.The movie is the first project by Ratner since he was accused of sexual misconduct in the early days of the #MeToo reckoning. Ratner's lawyer has denied the allegations.He shares producer credits with the first lady, Beckman and Fernando Sulichin of New Element Media. Filming began in December 2024.- EndsPublished By: Nitish SinghPublished On: Jan 30, 2026Must Watch","url":"https://www.indiatoday.in/world/story/melania-trumps-documentary-premieres-at-the-kennedy-center-ahead-of-global-release-2860110-2026-01-30","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/donald-trump-and-his-wife-melania-222643354-16x9_1.jpg?VersionId=1Su2H9KbWfALQW6pe2b4tTz4F_Xg1UZq?size=1280:720","video":null,"publish_date":"2026-01-30 01:00:01","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":0.042},{"id":397531640,"title":"Trump signs executive order launching US-wide drug recovery initiative","text":"Washington, DC [US], January 30 (ANI): US President Donald Trump on Thursday signed an executive order launching a nationwide effort to address drug addiction, announcing a government-wide programme to strengthen recovery, treatment, and prevention measures across the country.Speaking from the Oval Office alongside Health and Human Services Secretary Robert F. Kennedy Jr., Trump said the initiative would bring together efforts across federal, state and local governments as well as the private sector.“The Great American Recovery Initiative will bring together federal, state, local and private sector resources to support addiction recovery, treatment and prevention, and it will help mobilize the full resources and authority of the federal government to help stop this tremendous plague,” the president said.According to a White House fact sheet, the order establishes a “White House Great American Recovery Initiative,” which will advise federal agencies on directing grants to support addiction recovery and increasing awareness around drug dependence, while guiding departments on integrating programmes focused on prevention, early intervention, treatment, recovery support and re-entry.The initiative will be co-chaired by Health and Human Services Secretary Robert F. Kennedy Jr. and Kathryn Burgum, the spouse of Interior Secretary Doug Burgum. A White House official said Kathryn Burgum, who has spoken publicly about her own recovery journey, was expected to attend Trump’s announcement of the programme.The move comes amid continued concern over overdose deaths in the US. CNN reported that fatalities surged during the COVID-19 pandemic, driven largely by fentanyl, although Centers for Disease Control and Prevention data show deaths have declined since 2022 and recently returned to pre-pandemic levels. Despite the drop, more than 70,000 people in the US died from overdoses in the past year.CNN also cited survey data from the Substance Abuse and Mental Health Services Administration showing that in 2024, around 17 per cent of Americans aged 12 and older — more than 48 million people — were living with a substance use disorder, a proportion that has remained relatively steady in recent years.Federal funding for addiction recovery is overseen by the Substance Abuse and Mental Health Services Administration, and earlier this month, the Trump administration reversed plans to cut approximately USD 2 billion from mental health and addiction treatment programmes administered by the agency.Government figures cited by the White House showed that in 2024, more than 74 per cent of adults who believed they had problems with drugs or alcohol considered themselves to be in recovery or recovered. The data also indicated that among 40.7 million adults with a substance use disorder who did not receive treatment, 95.6 per cent did not recognise they needed help.The administration said the initiative forms part of broader efforts to coordinate resources nationwide and strengthen public health responses, alongside a wider White House campaign targeting alleged drug trafficking networks in the Caribbean and eastern Pacific. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/trump-signs-executive-order-launching-us-wide-drug-recovery-initiative-9865834.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2026-01-30 01:00:01","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":0.002},{"id":397531198,"title":"Trump hurls border czar under the bus at 'Melania' premiere","text":"President Donald Trump appeared to throw his border czar under the bus on the black carpet of the first lady's documentary premiere at the Kennedy Center on Thursday. \n\nAs the Trumps walked the carpet, a reporter asked Trump if he planned to start \"pulling back\" in Minneapolis. Trump shook his head and said, \"No, not at all,\" and walked away. \n\nThe comments come at a time when the Trump administration has signaled it is willing to shift gears in Minneapolis following the deaths of two U.S. citizens. Most recently, a 37-year-old ICU nurse named Alex Pretti was gunned down by a swarm of immigration agents during a protest, which has sparked a firestorm of outrage toward the administration. \n\nIn response, Trump removed Customs and Border Patrol commander Greg Bovino from the city and replaced him with border czar Tom Homan. \n\nReports indicate Homan has struck a \"conciliatory\" tone with local leaders like Minneapolis Mayor Jacob Frey and Minnesota Gov. Tim Walz, which suggests the Trump administration may de-escalate the situation. \n\nHoman told reporters earlier in the day the federal government is working on a plan to reduce the number of federal immigration enforcement officers in Minnesota.","summary":"President Donald Trump appeared to throw his border czar under the bus on the black carpet of the first lady's documentary premiere at the Kennedy Center on Thursday. \n\nAs the Trumps walked the carpet, a reporter asked Trump if he planned to start \"pulling back\" in Minneapolis. Trump shook his head and said, \"No, not at all,\" and walked away. \n\nThe comments come at a time when the Trump administration has signaled it is willing to shift gears in Minneapolis following the deaths of two U.S. citizens. Most recently, a 37-year-old ICU nurse named Alex Pretti was gunned down by a swarm of immigration agents during a protest, which has sparked a firestorm of outrage toward the administration. \n\nIn response, Trump removed Customs and Border Patrol commander Greg Bovino from the city and replaced him with border czar Tom Homan. \n\nReports indicate Homan has struck a \"conciliatory\" tone with local leaders like Minneapolis Mayor Jacob Frey and Minnesota Gov. Tim Walz, which suggests the Trump administration may de-esca","url":"https://www.rawstory.com/trump-2675060582/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-and-first-lady-melania-arrive-for-the-premiere-of-the-documentary-film-melania-at-the-john-f-kenn.jpg?id=63522736&width=1200&height=1200&coordinates=780%2C0%2C781%2C0","video":null,"publish_date":"2026-01-30 00:59:39","author":"Robert Davis","authors":["Robert Davis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.553}]}