{"offset":0,"number":50,"available":10946,"news":[{"id":274982978,"title":"Latest stopgap funding bill, sans debt limit, passes House","text":"The House finally passed a stopgap funding extension Friday, hours before the midnight deadline to avert a partial government shutdown, after Democrats moved off their opposition to anything but the larger bipartisan package that President-elect Donald Trump and Elon Musk killed earlier this week.\n\nThe 366-34 vote was enough to top the two-thirds majority threshold required under suspension of the rules. GOP leaders’ decision to drop a two-year suspension of the statutory debt ceiling that was in a version rejected the previous night was the catalyst for Friday’s dramatic turn of events.\n\nAlmost all Democrats voted “no” Thursday along with 38 Republicans. On the do-over Friday night sans debt limit, all Democrats except for one, Texas Rep. Jasmine Crockett, backed the bill while 34 Republicans voted against it.\n\nBefore the vote, House Democrats called a caucus meeting to discuss the new version of the bill, which was posted with minor changes from Thursday night’s bill as well as the big, substantive change that cut the debt limit provision Trump wanted. After the meeting, Democrats said they’d come around and were likely to support the measure in enough numbers to pass via suspension.\n\nHouse Minority Leader Hakeem Jeffries, D-N.Y., endorsed the measure after a party caucus meeting, saying that “it’s a win for the American people” because it would provide needed aid without touching the debt limit. “Everything else [in the bill] is a win for the American people, and the debt limit is out,” he said.\n\nDemocrats opposed inclusion of the debt limit provision, arguing it would make it easier on Republicans next year to cut taxes and ram through other partisan priorities. Cutting the debt limit language was enough to persuade Democrats to go along with the stripped-down bill, even though it excluded a host of their priorities contained in the earlier, 1,547-page bipartisan measure.\n\nThe decision to scrap the earlier version came at the behest of Musk, Democrats charged, arguing the Tesla did it in part to protect his company’s Chinese investments from restrictions in the broader bill.\n\n“The world’s richest man … is calling the shots in the Republican Party,” House Appropriations ranking member Rosa DeLauro, D-Conn., said during debate. “Who is in charge?”\n\nBut in the end, opposition to the stripped-down bill was too difficult for many Democrats. It’s a relatively “clean” bill that would extend current federal spending levels through March 14 with certain targeted increases, including for Trump’s inaugural festivities and submarines that the Navy wants to buy.\n\nIt contains a $100 billion aid package for victims of natural disasters; $10 billion in financial assistance to farmers suffering from low commodity prices and high costs, plus a one-year extension of expiring farm bill programs; and a bipartisan package of health care provisions that would renew Medicare payment policies, block Medicaid cuts to certain hospitals and extend funding for community health centers, among others.\n\nThe 118-page bill is vastly reduced from the initial package that Speaker Mike Johnson, R-La., negotiated with Jeffries and Senate Majority Leader Charles E. Schumer, D-N.Y.\n\nGone are hundreds of pages of additional health care policies; the China outbound investment language; provisions that would clamp down on pharmacy benefit manager practices; set the stage for the Washington Commanders to move back to the District of Columbia; allow the first annual member pay raise since 2009, and much, much more.\n\nAll of that will have to wait for next year, when even Trump has allowed he might sign off on members’ pay boost — as long as it’s on his watch.\n\nThe bill now heads to the Senate, which could clear the measure by late Friday night and ensure that the government could stay open for business Monday morning. President Joe Biden will sign the measure when it reaches his desk, White House press secretary Karine Jean-Pierre said in a statement.\n\nThe plan that House Republican leaders rolled out Friday included a sidecar arrangement for Trump and other Republicans concerned about the debt limit situation. House GOP leaders agreed to take up a budget reconciliation bill early next year that would combine a $1.5 trillion debt limit increase with a border security package, which Trump wants on his desk before he’s sworn in Jan. 20.\n\nBut to win over the party’s right flank, House Republicans also made an informal agreement to seek $2.5 trillion in spending cuts over 10 years through one or more reconciliation bills. While those bills would avoid the risk of a Democratic filibuster, passing cuts of that magnitude would be no easy task as Republicans struggle to govern next year with razor-thin majorities in both chambers.\n\nPaul M. Krawzak contributed to this report.","url":"https://rollcall.com/2024/12/20/latest-stopgap-funding-bill-sans-debt-limit-passes-house/","image":"https://rollcall.com/app/uploads/2024/12/cr_meeting_295_122024.jpg","video":null,"publish_date":"2024-12-21 01:10:23","author":"Paul M. Krawzak","authors":["Paul M. Krawzak"],"language":"en","source_country":"us","sentiment":-0.344},{"id":274982480,"title":"Drama eclipses Trudeau’s cabinet shuffle amid sabre rattling over election","text":"Political drama eclipsed Prime Minister Justin Trudeau’s move to rejuvenate his cabinet with fresh faces following a tumultuous week, underscoring questions about how much gas he has left in the tank as Liberal leader.\n\nThe shuffle came five days after Chrystia Freeland abruptly resigned as finance minister Monday after Trudeau had told her he was going to demote her to a different job. The move prompted a new uprising against Trudeau, with more than a dozen Liberal MPs now openly calling for him to resign.\n\nTrudeau said in brief remarks Friday after a cabinet meeting that it’s exactly one month until president-elect Donald Trump takes office and his cabinet’s focus must be to prepare for that.\n\n“We know how important it is for Canadians that we be there to protect not just the Canadian economy, but their jobs, the cost of living challenge that they’re facing that could get even worse,” he told reporters camped outside of his office in parliament. “We have a lot of work to do and that’s what we’re focused on.”\n\nThe typical excitement and celebratory vibes of a cabinet shuffle were absent earlier Friday, as eight backbench Liberals were promoted to cabinet and four existing ministers got new or additional roles.\n\nThey wanted to talk about being united in the face of tariff threats from Trump. But the only real questions for them were about why they’d join cabinet now, whether they still support the prime minister and how much longer the government can survive.\n\nMontreal MP Rachel Bendayan, the new minister of official languages and associate minister of public safety, said her decision to join the cabinet came because her decision to enter politics was to serve Canadians, not focus on partisan fights.\n\n“I have an incredible opportunity to help protect Canadians’ safety and I will do that with every ounce of my being,” she said, shortly after being sworn into cabinet.\n\nBut being in cabinet long enough to do that seems in doubt, after NDP Leader Jagmeet Singh declared just ahead of the shuffle that he is now ready to vote down the government and will attempt to trigger an election in the new year.\n\nTrudeau, who did not take questions after the cabinet shuffle, had told his caucus he would reflect on his leadership following an emergency caucus meeting following Freeland’s resignation on Dec. 16. None of the ministers seemed to know how long that reflection would take, and at least one — new Public Safety Minister David McGuinty, said he hadn’t even asked Trudeau about it when they spoke about the cabinet job.\n\nBendayan, a lawyer before she was elected in a byelection in 2019, appeared to acknowledge the road is a bit tricky for the prime minister right now.\n\n“Politics is about choices, very often those are difficult choices,” she said. “I think the prime minister was quite clear that he has a choice that he’s reflecting on.”\n\nCrown-Indigenous Relations Minister Gary Anandasangaree, at the shuffle because he had northern affairs added to his portfolio, suggested the reflection will happen “over the next few weeks.”\n\nMost ministers who stepped up to the microphone after the ceremony tried to focus on a need to be prepared for the tariff battle expected to play out when Trump takes office on Jan. 20.\n\n“I believe this is a moment where we need to stand united,” said Transport Minister Anita Anand.\n\n“I would ask at this time, this very critical juncture, that we all push in the same direction,” implored new Veterans Affairs Minister Darren Fisher. “It’s time that we all get on the same track.”\n\nFriday’s shuffle plugged gaps in Trudeau’s front bench and reassigned roles, after several cabinet ministers decided not to run in the election next year. Though, he did not move the major players on his team.\n\nDominic LeBlanc was sworn in as finance minister Monday night, and his public safety portfolio was given to McGuinty on Friday.\n\nIn addition to Bendayan, Fisher and McGuinty, Brampton, Ont. MP Ruby Sahota, becomes minister of democratic institutions and responsible for the Federal Economic Development Agency for southern Ontario, St. John’s, N.L. MP Joanne Thompson becomes minister for seniors, Winnipeg MP Terry Duguid is sport minister, and Toronto MP Nate Erskine-Smith becomes housing minister.\n\nAbout a year ago, Erskine-Smith said after his failed provincial leadership bid that he would not seek re-election so he can spend more time with his family. Now he says he thinks he can make a difference in his new role dealing with the country’s housing crisis, even if he has a short runway with the next election just around the corner.\n\nUpward of 17 Liberals have called for Trudeau to step down.\n\nNepean, Ont. MP Chandra Arya made a post on social media calling for Trudeau to step aside and for caucus to rally behind Freeland as a “credible and stable” alternative to Trudeau as leader.\n\nToronto MP Rob Oliphant, who held an emergency meeting in his riding with constituents this week to hear their thoughts, also said Friday it’s time for Trudeau to step aside for the good of the party and the country. In a letter posted to social media Friday Oliphant said party faithful in his riding told him Trudeau has “become a key obstacle” to progress on the government’s progressive agenda and its “record of achievements is now at risk.”\n\nSingh vowed he will attempt to bring down the government in a vote of non-confidence once Parliament resumes in the new year, although he waited until the House of Commons had adjourned for the holidays to take this position and had prevented the government from being defeated throughout the fall sitting.\n\nConservative Leader Pierre Poilievre sought to up the ante on Singh’s move Friday by saying Parliament should immediately reconvene for a non-confidence vote to bring an end to what he called a “chaotic clown show” of a government.\n\nBlocQuébécoisLeader Yves-François Blanchet recently said he believes Canadians should go to the polls in the new year as the country faces president-elect Trump’s tariff threats.\n\nParliament is not scheduled to return until Jan. 27, but opposition parties may not get a chance to pose non-confidence votes for weeks after that.\n\nTrudeau has several options to delay such a vote that could bring down his government, including by pausing parliament through proroguing. That could buy his party time to hold a quick leadership race, or reset the agenda while the governing party waits out the threat as long as possible until parliament has to return to pass spending measures.","url":"https://www.campbellrivermirror.com/national-news/drama-eclipses-trudeaus-cabinet-shuffle-amid-sabre-rattling-over-election-7723757","image":"https://www.bpmcdn.com/f/files/shared/feeds/gps/2024/12/web1_241220-cwp-trudeau-drama-cabinet-shuffle-bendayan_1.jpg","video":null,"publish_date":"2024-12-21 01:06:24","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.418},{"id":274980314,"title":"Trump taps critic of Pope Francis for Vatican ambassadorship - Live Updates - POLITICO","text":"President-elect Donald Trump said Friday that he is picking the head of a right-wing Catholic advocacy group and critic of Pope Francis to serve as ambassador to the Holy See, potentially teeing up tensions with the Vatican. In a post on Truth Social, Trump said that Brian Burch, head of the group Catholic Vote, “loves his Church and the United States — He will make us all proud.” Trump also praised Burch for advocating for him and encouraging Catholics to vote for him in 2024. Burch will face a Senate confirmation process, but it is unlikely he will encounter stiff resistance from Republicans, as his views aren’t considered controversial in the party. Burch would be far from the first ambassador to the Holy See with a political background. Presidents from both parties have selected former elected officials who are practicing Catholics such as President Joe Biden picking Sen. Joe Donnelly of Indiana. Trump picked political activist Callista Gingrich in his first term. He also wouldn't be the first to have ideological or theological disagreements with the church. But none of the picks to helm the Vatican to date would come into the role with as much a digital record of criticizing church leadership. On social media, Burch has criticized Francis’ leadership and shared the writings of some right-wing clerics who are critical of him. In 2023, he insinuated that church leaders were collaborating with controversial U.S. law enforcement probes into parishes that celebrated the Catholic Mass in Latin, a practice that was phased out decades ago for liturgy in local languages. Writing on X, Burch said he is “committed to working with leaders inside the Vatican and the new Administration to promote the dignity of all people and the common good.” Catholic Vote has engaged in tactics that have prompted criticism from more progressive factions of the U.S. church. In 2020, the organization used “geofencing” to identify Catholic voters who attended Mass in swing states and target them with ads boosting Trump. At the time, Burch defended geofencing as needed to “reach our fellow Catholics in the pews” and “ensure that our fellow Catholic voters get the facts and hear the truth — not the latest lies peddled by the media.”","url":"https://www.politico.com/live-updates/2024/12/20/congress/trumps-man-in-the-vatican-00195673","image":"https://www.politico.com/dims4/default/f9a8382/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F6e%2F14%2Fb8e80f7a490fad86351ee9be2b0b%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F687572520","video":null,"publish_date":"2024-12-21 00:47:24","author":"Eric Bazail-Eimil","authors":["Eric Bazail-Eimil"],"language":"en","category":"politics","source_country":"us","sentiment":0.415},{"id":274980310,"title":"Presidential transition would be ‘restricted’ during a government shutdown - Live Updates - POLITICO","text":"Hours ahead of the expiration of government funding, the White House warned that a shutdown would disrupt the presidential transition process, hampering preparations for next month’s handoff to President-elect Donald Trump. “Transition activities will be restricted,” press secretary Karine Jean-Pierre told reporters Friday during a White House briefing. “We’re doing everything to ensure a smooth transition, but the choice to allow a transition to move forward is in the hands of Republicans in Congress.” Jean-Pierre did not offer specifics on those restrictions. But she said the only transition efforts that would be left untouched by a potential shutdown are those needed to “prevent imminent threats to the safety of human life or the protection of property.” Congressional Republicans are scrambling to pass a spending bill before funding runs out later tonight, after Trump tanked a bipartisan agreement earlier this week that would have kept the government open through March. Federal agencies began notifying employees at noon on Friday that they may be put on furlough if the government does shut down, Jean-Pierre said. But the White House has largely stayed out of efforts to solve the funding crisis, blaming Republicans for creating the problem and brushing off questions over whether President Joe Biden should play a more public role in preparing Americans for the possibility of a shutdown. “This is something that Republicans should own here,” Jean-Pierre said. “This is not for the president to fix. This is not for us to fix.” Biden did speak on Friday with Senate Majority Leader Chuck Schumer and top House Democrat Hakeem Jeffries, Jean-Pierre said. But she did not offer any details on the president’s message to the Democratic congressional leaders.","url":"https://www.politico.com/live-updates/2024/12/20/congress/restricted-transition-00195647","image":"https://www.politico.com/dims4/default/fc2e033/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff5%2F06%2Ff192c60b40fe883040e91de40be7%2Fbiden-62662.jpg","video":null,"publish_date":"2024-12-21 00:47:24","author":"Adam Cancryn","authors":["Adam Cancryn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.671},{"id":274980306,"title":"House GOP picks new funding plan that will need wide Democratic support - Live Updates - POLITICO","text":"House Republicans have landed on their fourth plan to fund the government: Relying on Democrats to pass a bill that doesn’t include a debt limit measure pushed by Donald Trump. House Republicans voted in their closed-door conference meeting on Friday on the strategy, according to more than a dozen Republicans leaving the meeting. In addition to funding the government until March 14, the plan will also include a one-year farm bill extension and the $110 billion disaster aid package Republicans negotiated with Democrats. Republicans expect they will vote on the package on Friday, with less than 12 hours remaining until a shutdown deadline. Majority Whip Tom Emmer (R-Minn.) told reporters after the meeting that “there is a path that has been agreed to.” Majority Leader Steve Scalise (R-La.) told reporters that there would “very likely” be a vote on Friday afternoon. Johnson was cagier than other GOP lawmakers as he left the meeting, saying that he had “one more little detail to work out.” It’s unclear if he’s gotten Trump’s blessing on the latest plan. “We will not have a government shutdown, and we will meet our obligations for our farmers who need aid, for the disaster victims all over the country, and for making sure that military and essential services and everyone who relies upon the federal government for a paycheck,” Johnson told reporters. It’s also not clear whether Democrats will support the new package while they wait to see the details. Text has not been released yet. One Democrat, granted anonymity to speak candidly, told POLITICO that they will support the plan shortly after Republicans agreed to it. House Minority Leader Hakeem Jeffries and his leadership team held a closed-door meeting with purple-district lawmakers Friday afternoon to see how long they could hold the line against Republicans — inquiring whether they faced constituent pressure to cut a deal, according to a person familiar with the meeting who was granted anonymity to detail private conversations. Johnson laid out two options to avert a shutdown during a closed-door GOP meeting, asking Republicans to indicate which plan they preferred. The other proposal involved holding separate votes on a government funding bill, farm aid and money for natural disasters. Johnson would then have brought the three-bill package up under a so-called rule, which would require him to get near unified GOP support. That option had the buy-in of members of the ultra-conservative Freedom Caucus, in particular, who wanted to vote on each bill individually, according to three members of the group. But farm district Republicans vocally opposed that route during the meeting, according to three Republicans in the room. Those farm district Republicans worried the farm aid wouldn’t pass on the House floor by itself and wanted it merged into the disaster package, according to the three Republicans. Neither plan deals with the debt ceiling. Instead, GOP leaders indicated they have reached an agreement to deal with raising the debt ceiling under reconciliation next year, though one member called that a “handshake” deal. Nicholas Wu and Daniella Diaz contributed.","url":"https://www.politico.com/live-updates/2024/12/20/congress/house-gop-moves-forward-on-new-funding-plan-00195660","image":"https://www.politico.com/dims4/default/a7942e2/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F64%2F01%2F57c05b1542efa9779c98a7b93ff0%2Fpolitico-inside-congress-live-cms-update-shared-graphic.png","video":null,"publish_date":"2024-12-21 00:47:24","author":"Anthony Adragna,Jordain Carney","authors":["Anthony Adragna","Jordain Carney"],"language":"en","category":"politics","source_country":"us","sentiment":-0.351},{"id":274980304,"title":"House passes government spending package after Trump, Musk fueled chaos - Live Updates - POLITICO","text":"The House passed a stopgap package Friday evening that pushes the government funding deadline to March, as Congress races to avoid a looming deadline that would shut down the government in six hours. The package passed 366-34, with the support of 196 Democrats and 170 Republicans. It now moves to the Senate, where leaders are hoping to lock in an agreement to fast-track final passage of the measure, racing against the midnight government shutdown deadline. The package’s passage seemingly ends a chaotic 48 hours, after Elon Musk and President-elect Donald Trump worked to spike a previously-negotiated bipartisan funding agreement. The package that passed the House includes more than $110 billion in disaster aid and a one-year farm bill extension but is stripped of Trump’s demand: a debt limit extension. Musk weighed in just before the vote, commending Speaker Mike Johnson for having done “a good job here, given the circumstances,” while noting that many previously agreed upon policies were left out of the measure the House ultimately passed. “It went from a bill that weighed pounds to a bill that weighed ounces,” Musk posted on X, his social media platform. Across the Capitol, leaders in the Senate will need agreement from all 100 senators in order to clear the stopgap quickly, but at least one Republican senator is seeking a promise of votes on offsets before they'll agree to fast-tracking the bill. House leaders needed to clear a two-thirds majority threshold to advance the measure, because Johnson brought it to the floor under a process meant to get around conservatives who have blocked spending bills brought up under simple majority threshold. The progress comes after a week of chaos and House Republican infighting after a previous stopgap spending agreement brokered by Johnson and Senate Majority Leader Chuck Schumer collapsed under pressure from Trump and Musk. A stripped down Trump-backed proposal with a debt limit increase failed dramatically on the floor Thursday night. House Majority Leader Steve Scalise said Friday night that Johnson showed “tremendous leadership this week through very difficult times.” “At the end of the day, I think everybody recognizes it makes sense to keep government open, but also to take care of those disaster victims who have been waiting for months for this relief and the farmers who are struggling,” Scalise said. “There's a lot of good that's going to be done in this bill.” Johnson has repeatedly had to rely on overwhelming Democratic support to pass funding bills, a fact that could haunt him in his bid to keep the speakership on Jan. 3. Rep. Thomas Massie (R-Ky.) has already pledged that he will vote against Johnson, who will have a razor-thin majority next year, which means every defection is a legitimate threat to his leadership. The House GOP conference rejected a proposal backed by Massie to hold separate votes on a government funding bill, farm aid and money for natural disasters. Johnson would then have brought the three-bill package up under a so-called rule, which would require him to get near unified GOP support. Under the House-passed stopgap, government funding will again run dry on March 14. Lawmakers hope to clear a spending package before then with new funding levels for fiscal 2025, which will be half over by then. The March deadline will allow the incoming Trump administration to get involved in a final funding deal.","url":"https://www.politico.com/live-updates/2024/12/20/congress/house-passes-funding-package-government-shutdown-00195737","image":"https://www.politico.com/dims4/default/06d522f/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F0d%2Ffa%2F25693eec4a5fa4d86ad5b6dde953%2Fu-s-congress-42547.jpg","video":null,"publish_date":"2024-12-21 00:47:24","author":"Jennifer Scholtes,Katherine Tully-McManus","authors":["Jennifer Scholtes","Katherine Tully-McManus"],"language":"en","category":"politics","source_country":"us","sentiment":-0.291},{"id":274980300,"title":"Lewandowski is helping Noem with DHS transition - Live Updates - POLITICO","text":"Corey Lewandowski, Donald Trump’s former campaign manager, is helping Kristi Noem with transition planning for the Department of Homeland Security, according to four people familiar with the Trump transition. In recent weeks, Lewandowski has sat in on transition meetings with Noem, Trump’s pick to head DHS, and consulted with her on political appointees for the sprawling agency, said three of the people, who were granted anonymity as a condition of sharing details on the transition. It is not clear if Lewandowski has an official role yet in the transition or is helping in a personal capacity, according to two of the people. Lewandowski has also told people on the transition team that he’s part of the DHS transition and is believed to be leading personnel hiring, according to two of the people. One person said he’s been doing interviews with potential DHS appointees, both with Noem and independently. He’s not on the DHS landing team, which is being led by Robert Law. In one sense, Lewandowski’s involvement does not come as a surprise. As a close friend and former adviser to the South Dakota governor, he vouched for her to get the DHS role. Still, he has never worked at DHS, and his proximity to Noem in the transition process indicates that the political operative could have a hand in key personnel decisions at an agency that will oversee a cornerstone of Trump’s second term: the mass deportation of illegal immigrants. Asked multiple times for clarification on Lewandowski’s role, Brian Hughes, a spokesperson for the Trump Transition, said only that “As per the Transition MOU with the Biden Administration, the White House is receiving the names of those serving on landing teams.” He also added: “The landing team members are connecting with their counterparts at the departments and agencies.” In a text in response to POLITICO’s reporting, Lewandowski said: “It’s all Fake News and no one cares.” A spokesperson for Noem offered no comment in response to an inquiry about Lewandowski's involvement. Lewandowski’s work with Noem provides the latest sign he is wielding influence again inside Trump’s orbit. The former campaign chief was ousted in the middle of the 2016 campaign, when he was blamed for running a political operation that appeared to be sputtering. Trump advisers and Noem also briefly cut ties with Lewandowski over allegations that he made unwanted sexual advances towards a Republican donor in 2021. Lewandowski cut a deal with Las Vegas prosecutors after he was charged with misdemeanor battery, and the case was dismissed. He later mended fences with Noem, and rejoined the Trump campaign this fall as an adviser.","url":"https://www.politico.com/live-updates/2024/12/20/congress/lewandowski-helping-dhs-transition-00195690","image":"https://www.politico.com/dims4/default/9d14fdf/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd7%2Fb4%2F22de2dd047e384f2040cee9e6428%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2162038582","video":null,"publish_date":"2024-12-21 00:47:24","author":"Daniel Lippman,John Sakellariadis","authors":["Daniel Lippman","John Sakellariadis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.22},{"id":274980296,"title":"House Republicans float a debt limit, spending pact deal — with themselves - Live Updates - POLITICO","text":"House GOP leaders laid out a plan Friday to avert the upcoming debt cliff on their own next year, despite President-elect Donald Trump’s insistence that Congress handle it before he takes office. During a closed-door conference meeting Friday afternoon, House Republican leaders proposed a commitment to raising the debt ceiling by $1.5 trillion early in 2025. GOP leaders would pair that with a $2.5 trillion cut in “mandatory” spending, the category of government funding that largely runs on autopilot and bankrolls benefits programs like Medicaid, Social Security, SNAP nutrition assistance, Medicare and welfare payments to the poorest Americans. Under the proposed plan, hiking the debt limit and cutting spending would be done through the filibuster-skirting process Republicans hope to use next year to pass major bills on a simple-majority vote in the Senate. The plan would defy Trump’s demands, as the president-elect insisted this week that Democrats get roped into immediate action to lift the nation’s borrowing cap before he takes office in January. It would also heighten pressure on congressional Republicans to quickly clear a party-line reconciliation bill next year, despite their ongoing struggles to unite around a basic strategy for harnessing the special budget power to enact priorities like more border security funding and tax cuts. The debt limit is unpredictable, and delaying action is risky, a hazard Trump has made clear he doesn’t want to inherit. “Congress must get rid of, or extend out to, perhaps, 2029, the ridiculous Debt Ceiling,” Trump posted on social media early Friday. “Remember, the pressure is on whoever is President.” But House Democrats remain united in opposition to lifting the debt limit before Trump takes office. After Speaker Mike Johnson abandoned a bipartisan deal this week to prevent a government shutdown at midnight Friday, Democrats — and a sizable number of conservatives — overwhelmingly voted against a Trump-backed bill that would have also suspended the debt ceiling for two years. Now Republican leaders are planning a vote Friday on a funding patch without the language to avert the debt cliff, as they grasp for a new plan to prevent a funding lapse ahead of Christmas. As the U.S. national debt sits at more than $36 trillion, the nation’s borrowing limit will be turned back on Jan. 1, just before Republicans take control of Congress and ahead of Trump’s inauguration. Then starts months of guessing as to when the U.S. might default on its debt, as the Treasury Department does its best to stay under the new debt ceiling by using so-called “extraordinary measures” to shift cash. When the U.S. hit the debt limit last year, it took just over four months for the U.S. to approach the X-date, the Treasury secretary’s prediction for the day the nation would default on its loans. By deciding to act alone on the debt limit next year, rather than involving Democrats in a bipartisan negotiation, congressional Republicans would be adding an extra time constraint to that usually drawn-out process of making sure a reconciliation package meets the Senate’s rules and whipping near-unified Republican support with slim GOP majorities in both chambers. While a debt default has never occurred, many economists predict that it would cause irreparable harm across the global economy. Even congressional brinkmanship over the debt limit has degraded confidence in the U.S. as a borrower, resulting in recent downgrades in the nation’s credit score. Those risks will only increase the onus on Republicans to unite next year around a reconciliation plan, a challenging feat considering divisions among GOP lawmakers over fiscal issues, including whether to target mandatory funding or the discretionary spending Congress controls each year through regular funding bills.","url":"https://www.politico.com/live-updates/2024/12/20/congress/gop-debt-limit-deal-details-00195671","image":"https://www.politico.com/dims4/default/fa149b8/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fc3%2F60%2F12d3c9e542bb8c6bc61b64a5e259%2Fu-s-congress-67062.jpg","video":null,"publish_date":"2024-12-21 00:47:24","author":"Jennifer Scholtes","authors":["Jennifer Scholtes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.104},{"id":274980290,"title":"Biden to back eleventh-hour funding bill - Live Updates - POLITICO","text":"The White House has endorsed a revised bill funding the government, pledging to back the stopgap measure even as it blasted Republicans for reneging on an earlier bipartisan deal. “President Biden supports moving this legislation forward and ensuring that the vital services the government provides for hardworking Americans,\" press secretary Karine Jean-Pierre said in a statement Friday evening, \"from issuing Social Security checks to processing benefits for veterans.” The administration’s support came as the bill was poised to sail through the House, after House Democrats agreed to vote for the three-month funding package that includes disaster aid and a one-year farm bill extension. That proposal was trimmed down significantly from an earlier bipartisan agreement, which President-elect Donald Trump tanked on Wednesday, triggering a scramble to avoid a government shutdown. The White House and congressional Democrats maintained throughout the crisis that it was Republicans’ responsibility to resolve the impasse and keep the government open — and refused to back an earlier deal that would have stripped many provisions negotiated over the last few weeks. But after the GOP abandoned an effort to raise the debt limit as part of the funding effort, something President-elect Donald Trump pushed for, Democrats opted to support Friday’s revised bill. “While it does not include everything we sought, it includes disaster relief that the President requested for the communities recovering from the storm, eliminates the accelerated pathway to a tax cut for billionaires, and would ensure that the government can continue to operate at full capacity,” Jean-Pierre said in her statement.","url":"https://www.politico.com/live-updates/2024/12/20/congress/biden-funding-bill-shutdown-00195773","image":"https://www.politico.com/dims4/default/ddefa14/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F66%2F7c%2F92435aae48d992595ef0e27d9862%2Fwhite-house-01420.jpg","video":null,"publish_date":"2024-12-21 00:47:24","author":"Adam Cancryn","authors":["Adam Cancryn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.498},{"id":274980292,"title":"Johnson lays out two paths to avert a government shutdown - Live Updates - POLITICO","text":"Speaker Mike Johnson laid out two potential paths to avert a government shutdown in a closed-door meeting with the House GOP Friday morning, according to a slide presented in the closed-door House GOP conference and shared with POLITICO. There's less than 12 hours left before a shutdown deadline. Option one was moving a stopgap bill that funds the government through March that largely matches the package endorsed by Donald Trump that failed in the House on Thursday evening, except it wouldn't include raising the debt limit. Johnson said that package would pass via suspension, meaning it would need a two-thirds majority to pass and therefore a lot of Democratic votes. It would include a one-year extension of the farm bill and $110 billion in disaster aid. The second plan he laid out would involve three separate votes: one a stopgap funding bill into March, another on money for natural disasters and a third on aid for farmers. Johnson would try to pass that plan through the Rules Committee, meaning it would have to clear a couple of tough hurdles before a simple majority passage vote. No decision has been made about which path Johnson will choose, according to multiple Republicans leaving the meeting, including House Majority Leader Steve Scalise (R-La.). “There’s still a possibility of a vote today,\" Scalise added. Two Republican lawmakers who spoke with Johnson on Friday said they do not expect House Minority Leader Hakeem Jeffries to help pass the second option, though it's unclear if Democrats would back the first plan. Some Democrats indicated they wouldn't make a decision until they saw bill text. “We’ll see what they put on the floor. We want a bipartisan solution. We had a bipartisan solution,” said the No. 3 House Democrat Rep. Pete Aguilar (D-Calif.) as he left a closed-door meeting with purple-district Democratic lawmakers. The GOP meeting is ongoing, as members openly discuss the best path forward. “The speaker is not telling people how it’s going to be,\" said Rep. Dusty Johnson (R-S.D.) as he briefly left the meeting. \"There’s not been a play call yet.” “I think they are a long ways away from deciding anything,\" said Rep. Jim Banks (R-Ind.), who added he looks forward to joining the Senate in January. Meanwhile, neither option will address the debt ceiling, a demand Trump made on Wednesday when he tanked the original bipartisan spending plan. But House GOP leaders said they have an agreement tackle the issue next year when they pass major, party-line bills through the reconciliation process. They would use either one or two reconciliation bills — which will also focus on taxes, energy and the border — to both raise the debt limit by $1.5 trillion as well as cut $2.5 trillion in mandatory spending. One House Republican, granted anonymity to speak frankly, said the theory is that Johnson’s debt-ceiling-in-reconciliation plan is part of a gentleman’s agreement that helps unlock the speaker's proposal to keep the government funded. Nicholas Wu contributed to this report.","url":"https://www.politico.com/live-updates/2024/12/20/congress/johnson-lays-out-two-spending-paths-00195638","image":"https://www.politico.com/dims4/default/a7942e2/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F64%2F01%2F57c05b1542efa9779c98a7b93ff0%2Fpolitico-inside-congress-live-cms-update-shared-graphic.png","video":null,"publish_date":"2024-12-21 00:47:24","author":"Jordain Carney,Olivia Beavers","authors":["Jordain Carney","Olivia Beavers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.22},{"id":274980172,"title":"Kyodo News Digest: Dec. 21, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nTOKYO - Taiwan's electronics giant Foxconn is in talks with Renault SA, the largest shareholder of Nissan Motor Co., to acquire the French company's shareholding in the Japanese automaker, a Foxconn source said Friday.\n\nThe move comes as Nissan and Honda Motor Co. have reportedly begun discussions on a merger to create the world's third-biggest auto group by volume. Foxconn's move may impact the course of the talks between the two automakers.\n\nTOKYO - Bank of Japan Governor Kazuo Ueda's unexpectedly dovish position on interest rate hikes expressed at a recent press conference puzzled many market players, calling further into question the central bank's communication style that it has previously admitted needs to be improved.\n\nExplaining the bank's latest decision to forego a rate hike, Ueda cited the \"extremely slow\" underlying pace of inflation and noted that the rise in import costs from a weaker yen is \"calming down.\" He suggested the bank is in no hurry for another hike.\n\nTOKYO - The ruling coalition losing its majority in Japan's House of Representatives election has been selected as the top domestic news story of 2024 by senior editors of Kyodo News and its member or subscriber newspapers and broadcasters.\n\nJapan's ruling coalition of the Liberal Democratic Party and the Komeito party lost its majority in the lower house election in October, dealing a heavy blow to Prime Minister Shigeru Ishiba.\n\nTOKYO - Donald Trump's victory in the U.S. presidential elections has been selected by senior editors of Kyodo News and its member or subscriber newspapers and broadcasters as the top international news story of 2024.\n\nTrump was elected U.S. president in November after a decisive victory over his Democratic opponent, Vice President Kamala Harris. He secured all seven battleground states and became the first Republican candidate in 20 years to win the popular vote.\n\nScandal-hit Taiwan opposition leader offers resignation\n\nTAIPEI - The founder of Taiwan's second-largest opposition party who has been detained on suspicion of corruption expressed his intention to resign as leader of the Taiwan People's Party, a Taipei court said Friday.\n\nThe Taipei District Court permitted Ko Wen-je, who is banned from communicating with other people, to submit his resignation to party officials, deeming it unrelated to allegations against him and that it posed no threat with regards to collusion with alleged accomplices, witness tampering or destroying evidence.\n\nKADOMA, Japan - Beijing Olympics men's silver medalist Yuma Kagiyama and three-time defending women's world champion Kaori Sakamoto won Friday's short programs on the first day of the national figure skating championships.\n\nThe 21-year-old Kagiyama, who finished second at the Grand Prix Final behind U.S. \"Quad God\" Ilia Malinin earlier this month, scored 92.05 points, 1.74 ahead of second-place Rio Nakata, 16.\n\nVideo: Monkeys warm by fire in Aichi","summary":"Monkeys warm themselves by a fire at the Japan Monkey Centre in Inuyama in the centra...","url":"https://english.kyodonews.net/news/2024/12/65528c562e90-kyodo-news-digest-dec-21-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/111063530b4e28439f09fa3ddec037d9/photo_l.jpg","video":null,"publish_date":"2024-12-21 00:47:23","author":null,"language":"en","source_country":"jp","sentiment":0.121},{"id":274979948,"title":"Reporter Makes 4-Year Apology on Biden's Condition, and the Press Is Supremely Bothered by a Funding Bill","text":"In what has to be among the most emblematic examples of the press being forced to admit they hid Joe Biden’s mental decline, deposed former CNN reporter Chris Cillizza comes out with a confession that he should maybe have looked into the details of Biden’s sliding mental faculties sooner. Chris makes the admission that he could have explored this reality further, but that the insistence of the White House staff was among the influences preventing his curiosity from taking things further.\n\nAn apology: As a journalist, I should have pushed harder on the very real questions about Joe Biden's physical and mental health as president.I talked about it here:https://t.co/Pob4Lka1C8— Chris Cillizza (@ChrisCillizza) December 19, 2024\n\nTo this we assess our professional critique of this coming-to-ethics moment – It is a complete pile of steaming bat guano. \n\nCillizza is only coming out with this neutered mea culpa now because it will not be detrimental to a Biden term any longer, and now he can be positioned as newly responsible just in time for a new Trump administration.\n\nBut worse than that, while Chris should have “pushed harder” to get the facts, in truth, he behaved much like most of the press at the time: He pushed back against those who were pointing out Biden’s condition and accusing them of acting in bad faith, or worse.\n\n“I should have pushed harder”Utter garbage, Chris. Journalists did push, including yourself — AGAINST those pointing out the facts about Biden.Those mentioning it were castigated, and evidence being shown was lied about and described as “fake”.You get no pass on this matter. https://t.co/IycsLk4KPF pic.twitter.com/1gfTgp85ov— Brad Slager: CNN+ Lifetime Subscriber (@MartiniShark) December 20, 2024\n\nPresentation Paradox – MSNBC\n\nUm, sorry, but…aren’t you the same people belly-aching about democracy on an hourly basis…?!\n\nSometimes the obliviousness seen from our betters in the media complex is just so darned precious. Jen Psaki displays the quintessential example of sounding absolutely firm in her convictions while also being 100% incorrect. You have to marvel at this.\n\nSo the ongoing budget battle and looming government shutdown has most in the media in a state of distemper, because for them the thought of going without government involvement is an unthinkable nightmare. (Contrast that with conservatives, who consider the government to be the nightmare.) Jen Psaki was commenting on the fact that Elon Musk and – worse – the American voting public were exerting their influence over politicians in D.C. and causing the “emergency” budget bills filled with new non-emergency spending to be spiked. She is dismayed that voters dare to tell the politicians they elected how to vote and worse – they have the temerity to say that if they vote against their wishes, the politicians might get replaced!\n\nUh-huh, Jen – you mean that is how it is supposed to work, right? To see how unspun this has her, note the number of times she references how this is considered an unacceptable “threat.”\n\n🚨The propaganda press meltdowns continue over the ill-fated Omnibus bill:Jen Psaki laments the fact that the GOP was reminded by Trump, Elon and millions of Americans that they face accountability at the ballot box should they ignore their voters.How dare they.The fact… pic.twitter.com/X4mOLE46EG— Western Lensman (@WesternLensman) December 19, 2024\n\nDNC PR Firm – NBC NEWS\n\nWhen a majority carries less influence than a divided chamber.\n\nAnother example of the perturbed press getting pissy over a possible government shutdown is the growing ever-cranky Chuck Todd. Here we see Chuckles getting very upset at the notion that Donald Trump is coming back to D.C. with the concept that he has a mandate.\n\nMr. Todd’s Mild Tirade explains that Trump won with “only” a mild majority, and this is somehow supposed to mean the GOP is required to compromise with Democrats. It feels odd to have to explain recent history to a journalist, but we apparently need to remind Chuckles that, with no majority but a 50/50 split in the Senate, we saw Dems ramrod into law the massive Inflation Reduction Act as well as the omnibus infrastructure bill, to the tune of trillions of dollars.\n\nThere are a ton of delusional folks who think a bare majority gives them absolute power. If you want more leverage, win more elections, otherwise, deal with reality and compromise. It’s called a democracy, deal with it.— Chuck Todd (@chucktodd) December 19, 2024\n\nDemo-lition Project – MSNBC\n\nFirst signs of the Purge have been sighted.\n\nAs MSNBC continues to founder in the ratings while being spun off by parent company NBC-Universal, the initial indicators of change may be sighted.\n\nFollowing Rachel Maddow taking a pay cut at the network now comes the report that two other “stars” are facing a similar truncated contract offer. Joy Reid and Stephanie Ruhle:\n\nThe left-leaning news channel has been negotiating with Reid and Ruhle on new deals at reduced salaries.\n\nMSNBC reportedly offers Joy Reid, Stephanie Ruhle pay cuts to stay in anchor chairs https://t.co/jjhl0GxEYz pic.twitter.com/ipXWjFHWnF— New York Post (@nypost) December 19, 2024\n\nAnti-Social Media – ASSOCIATED PRESS\n\nWas the Saudi national an innocent passenger?\n\nThe devastating report out of Germany is that there were at least 11 people killed and 70 more injured when a foreign national plowed into a crowded Christmas marketplace. This was a clear terrorist act according to most – with the exception of the Associated Press.\n\nOnce again, according to the news syndicate, this was a case where the car seemingly acted alone.\n\nWe are pleased to report that the car has been taken into custody, and a number of charges will be drawn up against the vehicle. pic.twitter.com/RHY7cg571W— Brad Slager: CNN+ Lifetime Subscriber (@MartiniShark) December 20, 2024\n\nReporting on the Mirror – WASHINGTON POST\n\nSeems a harder position to fill than the head coach position for the New York Jets.\n\nAt the Washington Post, the new leadership installed by Jeff Bezos is having a tough go of it. When he installed British tabloid veteran Will Lewis to head the paper as CEO, it rankled many on staff. Then, the initial decision to bring over Robert Winnett at the UK’s Telegraph to serve as Executive Editor led to a small revolt. Many balked loudly at that move, saying it would turn the paper into a Murdoch/Fox News-like outlet. \n\nSo, Winnett was not given the post, but in the interim, there has been no ability to fill the position. It was expected that by year’s end, a new Editor in Chief would be placed, but Axios details that a number of prominent figures were brought in as possible hires, only to consistently withdraw their names after seeing the plans of Lewis. \n\n🚨NEW: @washingtonpost is getting stiffed by outside candidates for the top newsroom jobSeveral people familiar w/ the search were baffled by the seeming lack of editorial vision or business strategy\"I'm not sure it's salvageable,\" one of them told us https://t.co/3njTmFCUMl— Mike Allen (@mikeallen) December 17, 2024\n\nLow-Octane Gaslighting – THE EVERETT LEADER HERALD\n\nInteresting how we are not seeing reports of how this is a threat to democracy.\n\nIn another successful defamation suit against a news outlet, we see things come to a dramatic end, and it appears to be fully justified. The Everett Leader Herald has been operational in New England for 139 years, but it is now closing shop after losing a $1.1 million settlement with the mayor of Everett, Massachusetts. \n\nCourt documents and items revealed in the disclosure phase showed how the owner and the publisher worked to fabricate evidence for a number of false stories, all done in an effort to drive Mayor Carlo DeMaria out of office. This was even admitted in court:\n\nThe newspaper, led by owner Matthew Philbin and publisher/editor Joshua Resnek, admitted to making up quotes and faking reporters’ notes about interviews that never occurred. The mayor also alleged that the newspaper was purchased with the express purpose of attacking his reputation.\n\nEverett mayor awarded more than $1 million in settlement with local newspaperhttps://t.co/4dOWyl04In— 7News Boston WHDH (@7News) December 17, 2024","url":"https://townhall.com/columnists/bradslager/2024/12/20/reporter-makes-4-year-apology-on-bidens-condition-and-the-press-is-supremely-bothered-by-a-funding-bill-n2649409","image":"https://media.townhall.com/cdn/hodl/2021/196/9aa693c0-a853-49b3-a150-e214037ecb98.png","video":null,"publish_date":"2024-12-21 00:46:23","author":"Brad Slager","authors":["Brad Slager"],"language":"en","source_country":"us","sentiment":-0.452},{"id":274979740,"title":"Trump’s war on the press is straight out the Putin playbook","text":"The pen may not be mightier than the sword, but it still has the power to wound. How else to explain the extraordinary remarks of the former Russian president, Dmitry Medvedev, this week in which he revealed how stung he’d been by an editorial in the Times?\n\nYou’d think Russia’s elite had enough problems on their hands at the moment. Roaring inflation and interest rates. Sanctions. Labour shortages. The spiralling cost of war. The mounting casualties in Ukraine. But, no, it was an editorial penned by an unknown hand in London that really got under the skin of Putin’s close ally, who now serves as deputy chairman of Russia’s security council.\n\nPerhaps Medvedev didn’t get through the entire leader column, but just glanced at the headline, which was in response to the assassination of Lieutenant General Igor Kirillov on the streets of Moscow. It read: “The targeted killing is a legitimate act of defence by a threatened nation.”\n\nWhatever, it sent him into a spasm of rage, describing the editors of the Times as “legitimate military targets.” The anonymous editorial team at the Times were “miserable jackals who cowardly hid behind their editorial. That means the entire leadership of the publication.”\n\nDrawing himself up to his full 5 feet 6 inches he warned them: “So be careful. After all, a lot of things happen in London.”\n\nIndeed, they do. In 2017 Buzzfeed, then a muscular investigative website, probed no fewer than 14 suspicious Russian-related deaths in which assorted critics of the state variously dropped dead from “heart attacks” or “suicide”. Others fell out of windows or suffered from malfunctioning helicopters. Poisoning and strangling were other options, while we may never know the truth of the man who died inside a red sports bag that had been padlocked from the outside.\n\nSo, yes, a lot of “things” happen in London and no doubt the senior management of the Times are taking the best security advice as to how seriously they should take the scarcely veiled threat from the man who served as Russia’s president between 2008 and 2012.\n\nIn this, Medvedev has something in common with Adolf Hitler, who was similarly obsessed with the British press. The cartoonist David Low, who regularly lampooned the dictator, was asked by the then foreign secretary, Lord Halifax, to go easy on Hitler in 1937 because it was upsetting the little fellow. The suggestion came from Dr Goebbels.\n\nThreatening to knock off British journalists for writing upsetting things is novel, but it is hardly breaking news that Russia’s leaders have never been in love with the notion of a free press. What is news is that America—once a shining beacon of a noisy, messy and troublesome fourth estate—is inching towards the same view of journalism.\n\nGranted, Donald Trump and his allies have not directly suggested that American journalists should be topped. But he has frequently insulted, attacked or threatened the press in assorted public addresses. That has included apparently welcoming the idea of journalists being shot; praising physical aggression towards reporters (“it’s actually a beautiful sight”); and joking that the prospect of prison rape would encourage journalists to shop their sources.\n\nWe have come a long way from Thomas Jefferson’s preference for “newspapers without government” over “government without newspapers”. So far, in fact, that Trump’s pick to head the FBI, Kash Patel, has explicitly warned: “We’re going to come after the people in the media who lied about American citizens who helped Joe Biden rig presidential elections. We’re going to come after you, whether it’s criminally or civilly.”\n\nThat quote came from an interview with Trump’s former henchman, Steve Bannon, who appears to be back in favour and who has been making similarly menacing noises about the incoming administration’s intentions towards the media.\n\nAt a recent gala dinner for conservatives on Wall Street in New York Bannon threatened: “We want retribution and we’re going to get retribution. You have to. It’s not personal, it’s not personal,” Bannon told a cheering audience. “They need to learn what populist, nationalist power is on the receiving end.\n\n“I need investigations, trials and then incarceration. And I’m just talking about the media. Should the media be included in the vast criminal conspiracy against President Trump?” He named checked liberal commentators and broadcasters “Andrew Weissmann on MSNBC and Rachel Maddow and all of them.”\n\nBannon gave some clue as to what could lie ahead for “unfriendly” American media when he announced: “We want all your emails, all your text messages, everything you did.”\n\nIf the idea is to get the American media worried it seems to be working, despite Yale professor Timothy Snyder’s memorable exhortation: “Do not obey in advance.” Newspapers have fallen silent rather than upset Trumpy by not endorsing his presidency. The owner of one of them, the LA Times, has devised a ludicrous AI “bias meter” to warn sensitive readers about the possible political leanings of its columnists.\n\nIn the past week we’ve seen ABC News agreeing to pay $15m towards Donald Trump’s presidential library to settle a libel lawsuit over its anchor George Stephanopoulos’s assertion that the president-elect had been found civilly liable for raping writer E Jean Carroll. In fact he was found liable of sexually assaulting and defaming her.\n\nIn the past any broadcaster would have fought such a case on the assumption that the US First Amendment, along with other laws protecting free speech, would have protected them. But with a Supreme Court packed with Trump acolytes it would take a brave news organisation to test the historic guarantees of free speech.\n\nNot content with humbling ABC, Trump has now announced he is suing the Des Moines Register newspaper, along with its parent company and its former pollster for “brazen election interference” over what turned out to be a rogue poll suggesting Kamala Harris might win Iowa, published days before the election.\n\nLegal experts now predict that the 1917 Espionage Act—weaponised against Julian Assange by former Trump Attorney General Bill Barr—will now be deployed in the manner Bannon suggested, to get at all reporters’ communications and sources.\n\nThe Act prohibits the sharing or unauthorised retention of “information relation to the national defense.” It seems likely that Trump will argue that practically all presidential communications qualify as national defence information. So the White House press corps could face prosecution for reporting on what Trump and his team are up to.\n\nMedvedev’s threats to target Times journalists in London represent something new and ugly, even if we are wearily used to the Russian state inflicting violence on anyone it deems to be an enemy.\n\nBut what is unrolling in America at the moment is equally alarming, if only because it threatens to unravel a deeply ingrained idea of what a free press was and should be. Watch this space for who will bend the knee and who will resist.","url":"https://www.prospectmagazine.co.uk/ideas/media/68927/trumps-war-on-the-press-is-straight-out-the-putin-playbook","image":"https://media.prospectmagazine.co.uk/prod/images/gm_preview/766741730d3f-onlineimg2023-1-copy.jpg","video":null,"publish_date":"2024-12-21 00:44:23","author":"Alan Rusbridger","authors":["Alan Rusbridger"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.07},{"id":274979660,"title":"Keir Starmer Gives Life Peerage To Former Chief Of Staff Sue Gray","text":"This site requires JavaScript for certain functions and interactions to work. Please turn on JavaScript for the best possible experience.\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\nSat, 21 December 2024\r\n\r\n\r\nPoliticsHome\r\n\r\n\r\n\n\r\n\n\r\n\r\n\nNewsletter sign-up\r\nSubscribe now\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\nCost of Living\nCommunities\n\nEnvironment\nForeign Affairs\nHealth & Care\nHome Affairs\nPolitical Parties\nSocial Affairs\n\nThe House Live\n\nThe House Magazine\n\nWomen in Westminster\n\nIn Conversation With\nMembers Directory\nPartner Content\n\nThe Path To Net Zero\nGreening the Nation\nConnecting Communities\nEngineering a Better World\nBecome a Member\n\nMembers Directory\n\nAbout PoliticsHome\nMarketing Opportunities\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCost of Living\r\n\nCommunities\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nEnvironment\r\n\nForeign Affairs\r\n\nHealth & Care\r\n\nHome Affairs\r\n\nPolitical Parties\r\n\nSocial Affairs\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nNewsletter Signup\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\nCost of Living\nCommunities\n\nEnvironment\nForeign Affairs\nHealth & Care\nHome Affairs\nPolitical Parties\nSocial Affairs\n\nThe House Live\n\nThe House Magazine\n\nWomen in Westminster\nMembers Directory\nPartner Content\n\nMembers Directory\n\nAbout PoliticsHome\nMarketing Opportunities\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nThe House Live\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nThe Professor Will See You Now: Scum\r\n\r\n\nBy Professor Philip Cowley\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nWhy are young women so unlikely to support Reform?\r\n\r\n\nBy Sophie Stowers\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nAdrian Ramsay: 'We need less of the horrific yah-boo style approach we see in the Chamber'\r\n\r\n\nBy Sophie Church\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nThe 'serious challenge' to Matt Wrack as Fire Brigades Union general secretary\r\n\r\n\nBy Sienna Rodgers\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nThe Professor Will See You Now: Whatever\r\n\r\n\nBy Professor Philip Cowley\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nPress releases\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nCharity calls Government-backed ‘eat more red meat’ campaign ‘reckless self-sabotage on Labour’s national health and climate policy ambitions’\r\n\r\n\nBy Humane Society International UK\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nCIOB reacts to UK General Election result\r\n\r\n\nBy Chartered Institute of Building\r\n\n\r\n\n\r\n06 Sep 2023\r\n\r\n\n\r\nRIA welcomes new Shadow Rail Minister Stephen Morgan MP\r\n\r\n\nBy Railway Industry Association\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nKeir Starmer Gives Life Peerage To Former Chief Of Staff Sue Gray\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nSue Gray, the civil servant who investigated Partygate and went on to become Sir Keir Starmer's chief of staff, who has been made a life peer, Downing Street said\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\nMatilda Martin\r\n\r\n\r\n\r\n\n\r\n\r\n@matilda__martin\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n5 min read20 December\r\n\r\n\r\n\n\r\n\nKeir Starmer has nominated former chief of staff Sue Gray for a life peerage, Downing Street announced on Friday.\r\n\r\n\nGray, the former senior civil servant who led an investigation into parties held in Downing Street during the pandemic, played a key role in Labour's preparations for government.\r\n\r\n\nShe resigned as the Prime Minister's chief of staff in October, however, before being replaced by Morgan McSweeney.\r\n\r\n\nIt emerged prior to her resignation that her £170,000 annual salary was larger than the PM's.\r\n\r\n\nGray was one of thirty people to be nominated for peerages by Starmer.\r\n\r\n\nThe Prime Minister put forward former Welsh first minister Carwyn Jones, ex-Labour shadow cabinet minister Thangam Debbonaire and Labour's former general secretary David Evans to join the House of Lords. \r\n\r\n\nFormer Labour MPs Luciana Berger, Kevin Brennan and Lyn Brown are also on the list.\r\n\r\n\nStarmer has previously set out a long-term commitment to abolish the unelected chamber.\r\n\r\n\nTory party leader Kemi Badenoch nominated six people for a life peerage, including Dame Thérèse Coffey – the former MP who serrved as deputy to former prime minister Liz Truss – and her director of strategy Rachel Maclean, a former Conservative minister.\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nToby Young – founder and director of the Free Speech Union – was also nominated by the leader of the Conservative party. \r\n\r\n\nFull list of those nominated for a life peerage:\r\n\r\n\nNominations from the Leader of the Labour Party:\r\n\r\n\nProfessor Wendy Alexander FRSE – Vice Chair of the British Council, former Member of the Scottish Parliament for Paisley North and previously Labour Leader in the Scottish Parliament.\r\n\r\n\nSir Brendan Barber – former General Secretary of the Trades Union Congress and former chair of the Advisory, Conciliation and Arbitration Service.\r\n\r\n\nLuciana Berger – former Member of Parliament for Liverpool Wavertree and current Chair of the Maternal Mental Health Alliance.\r\n\r\n\nMary Bousted – formerly the Joint General Secretary of the National Education Union (NEU), and education policy adviser.\r\n\r\n\nKevin Brennan – former Member of Parliament for Cardiff West and former Minister of State at the Department for Business, Innovation and Skills and Parliamentary Under Secretary of State at the Department for Children, Schools and Families.\r\n\r\n\nLyn Brown – former Member of Parliament for West Ham and former Shadow Minister.\r\n\r\n\nDinah Caine OBE CBE – Chair of Camden STEAM, formerly Chair of Goldsmiths University and CEO and Chair of Creative Skillset.\r\n\r\n\nKay Carberry CBE – former Assistant General Secretary of the British Trades Union Congress (TUC).\r\n\r\n\nMargaret Curran – former Member of Parliament for Glasgow East and formerly Minister within the Scottish Executive.\r\n\r\n\nThangam Debbonaire – former Member of Parliament for Bristol West and former Shadow Secretary of State.\r\n\r\n\nJulie Elliott – former Member of Parliament for Sunderland Central and former Shadow Minister.\r\n\r\n\nDavid Evans – former Labour Party Regional Director, Assistant General Secretary and General Secretary of the Labour Party 2020-2024.\r\n\r\n\nSue Gray – former Chief of Staff to Prime Minister and former Cabinet Office Second Permanent Secretary.\r\n\r\n\nTheresa Griffin – former Member of the European Parliament (MEP) for North West England.\r\n\r\n\nAnji Hunter – Senior Advisor at Edelman, and former Head of Government Relations in Downing Street.\r\n\r\n\nCarwyn Jones – former Member of the Senedd (MS) for Bridgend and First Minister of Wales.\r\n\r\n\nMike Katz – National Chair of Jewish Labour Movement and a former Camden Councillor.\r\n\r\n\nGerard Lemos CMG CBE – Social Policy expert and Chair of English Heritage, Chair of National Savings & Investments (NS&I), and Chair of London Institute of Banking and Finance.\r\n\r\n\nAlison Levitt KC – Master of the Bench of the Inner Temple. Previously Principal Legal Advisor to the Director of Public Prosecutions and a Circuit Judge specialising in serious crime, including rape.\r\n\r\n\nAnne Longfield CBE – Campaigner for children and formerly served as the Children’s Commissioner for England. Founder and Executive Chair of the Centre for Young Lives.\r\n\r\n\nDeborah Mattinson – former Director of Strategy to Sir Keir Starmer. Co-founder of BritainThinks.\r\n\r\n\nSteve McCabe – former Member of Parliament for Birmingham Hall Green and Birmingham Selly Oak, and former Government Whip.\r\n\r\n\nClaude Moraes OBE – former Member of the European Parliament (MEP) for London and chair of the Civil Liberties, Justice and Home Affairs Committee.\r\n\r\n\nWendy Nichols – UNISON Yorkshire and Humberside Regional Convenor and Branch Secretary and Labour Councillor.\r\n\r\n\nSimon Pitkeathley – Currently the Chief Executive of Camden Town Unlimited and Euston Town, formerly the Mayor of London’s ‘Champion for Small Business’.\r\n\r\n\nDame Anne Marie Rafferty DBE FRCN – Professor of nursing policy and former President of the Royal College of Nursing.\r\n\r\n\nKrish Raval OBE – Founding Director of Faith in Leadership.\r\n\r\n\nMarvin Rees OBE – former Mayor of Bristol and Head of Bristol City Council. Former journalist, voluntary sector manager and NHS public health manager.\r\n\r\n\nRevd Dr Russell David Rook OBE – Partner at the Good Faith Partnership and Anglican priest.\r\n\r\n\nPhil Wilson – former Member of Parliament for Sedgefield, and former Opposition Assistant Whip.\r\n\r\n\nNominations from the Leader of the Conservative Party:\r\n\r\n\nNigel Biggar CBE – Regius Professor Emeritus of Moral Theology at the University of Oxford and Anglican priest.\r\n\r\n\nJoanne Cash – Co-founder of Parent Gym and barrister serving as the Southeastern Circuit Junior and a member of the Bar Human Rights Committee.\r\n\r\n\nRt Hon Dame Thérèse Coffey PhD – former Deputy Prime Minister and former Member of Parliament for Suffolk Coastal.\r\n\r\n\nRoger Evans – former Deputy Mayor of London and former member of the London Assembly for Havering and Redbridge.\r\n\r\n\nRachel Maclean – former Member of Parliament for Redditch and former Minister of State for Housing and Planning.\r\n\r\n\nToby Young – founder and director of the Free Speech Union, and an associate editor of The Spectator.\r\n\r\n\nNominations from the Leader of the Liberal Democrat Party:\r\n\r\n\nCllr Shaffaq Mohammed MBE – former Sheffield City Councillor and chair of the Liberal Democrat Carers Commission.\r\n\r\n\nDr Mark Pack – former President of the Liberal Democrats.\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nOutgoing Hereditary Peers Criticise \"Nasty\" Plans To Abolish Them\r\n\r\n\r\n\n\r\nBy Tom Scotson\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nPoliticsHome Newsletters\r\n\nPoliticsHome provides the most comprehensive coverage of UK politics anywhere on the web, offering high quality original reporting and analysis: Subscribe\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\nKeir Starmer\r\n\r\nHouse of Lords\r\n\r\nKemi Badenoch\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\nYoung Tories Set Up Campaign To Help Party Avoid \"Terminal\" Decline\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nCan Donald Trump Help Reform UK Win The 'Bro Vote'?\r\n\r\n\r\n\n\r\n\r\nForeign affairs\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nKeir Starmer Says His Six Milestones Will Let Voters \"Hold Our Feet To The Fire\"\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nSir Chris Wormald Named As Next Cabinet Secretary\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nNorthern Labour MPs Set Up 'Red Wall Caucus' To Fight Reform UK\r\n\r\n\r\n\n\r\n\r\nHome affairs\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nLouise Haigh Resigns As Transport Secretary Over Mobile Phone Offence\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nKeir Starmer Has Promised Long-Term Missions. Can He Achieve Them?\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nLabour MP Calls For Electoral Reform After \"Most Disproportionate\" General Election Result Ever\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nWho's Who In Kemi Badenoch's Inner Circle?\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nKemi Badenoch Gives All 26 New Tory MPs Jobs In Opposition\r\n\r\n\r\n\n\r\n\r\nPolitical parties\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\nFind out more about our events\r\n\nPoliticsHome & The House Magazine organise a number of industry leading political events throughout the year.\r\n\nFind out more \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nSign up for our newsletters\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\nGet daily news alerts and weekend round-ups straight to your inbox.\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nSign up to the PoliticsHome\n newsletter today!\r\n\nFind out more\r\n\r\n\r\n\n\r\n\nRegistered in England & Wales under No. 07291783\r\n\n© Political Holdings Limited \r\n\r\n\r\n\r\n\n\r\n\n\r\n\nQuick links\r\n\n\r\n\n\r\n\n\r\n\nThe House Live\r\n\r\n\n\r\n\nMembers' Directory\r\n\nCommercial Opportunities\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nMore from Total Politics\r\n\n\r\n\n\r\n\nThe Parliament\r\n\nCivil Service World\r\n\nPublicTechnology.net\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nTotal Politics Group\r\n\nPrivacy Policy\r\n\nTerms & Conditions","url":"https://www.politicshome.com/news/article/sue-gray-nominated-life-peerage","image":"https://res.cloudinary.com/dyw8mv3b0/image/upload/q_85,w_1200,h_1200,c_limit/v1/news/2024_12/2YY99PG_k495gh.jpg","video":null,"publish_date":"2024-12-21 00:43:23","author":null,"language":"en","source_country":"gb","sentiment":0.316},{"id":274979736,"title":"House Approves Spending Bill Hours Before Government Shutdown, Scraps Trump's Debt Ceiling Raise","text":"After a tumultuous week of rejections, the House approved a stopgap spending bill on Friday evening that moves the government funding deadline to March. The bill is now on its way to the Senate, where senators will rush to vote before a midnight deadline to avoid a government shutdown.The stopgap bill was approved 366-34 with bipartisan support from 196 Democrats and 170 Republicans in Congress. The new proposal includes disaster relief and farm assistance, but does not include the debt ceiling raise suggested by President-elect Donald Trump. It comes after a turbulent week on Capitol Hill that saw two previous versions of the bill fail to secure enough support.Earlier versions of the spending bill were derailed by disagreements within Congress and unexpected demands from President-elect Donald Trump and Elon Musk. Trump urged GOP lawmakers to oppose the initial bipartisan deal, calling instead for a debt ceiling hike to be included—a move that caught many lawmakers off guard.Although a revised plan that included Trump's request for a debt ceiling hike was introduced Thursday, it failed to pass the House. Most Democrats and 38 Republicans voted against the proposal, citing concerns that it would pave the way for tax cuts and increased spending under Trump's administration.Originally published by Latin Times.","summary":"The new proposal includes funding through March, disaster relief and farm assistance.","url":"https://www.ibtimes.com/house-approves-spending-bill-hours-before-government-shutdown-scraps-trumps-debt-ceiling-raise-3756447","image":"https://d.ibtimes.com/en/full/4570784/house-approves-spending-bill-hours-before-government-shutdown-scraps-trumps.jpg","video":null,"publish_date":"2024-12-21 00:43:21","author":"Morgan Music","authors":["Morgan Music"],"language":"en","category":"politics","source_country":"US","sentiment":-0.305},{"id":274979408,"title":"Guilfoyle: Greece-US relations will deepen under Trump presidency","text":"Kimberly Guilfoyle has told national broadcaster ERT that she was very honored to be named by president-elect Donald Trump as US ambassador to Greece.\r\nGuilfoyle told ERT she could not wait to secure the approval of the relevant US Senate committee for the post and expressed enthusiasm over working with the Greek government to ensure that the strong Greek-US relations will continue to deepen under the leadership of president-elect Trump.\r\nAs a valuable NATO ally, Greece plays a key role in the European Union, she added, while pointing out that her appointment in Athens underlined the regard Trump has for Greece and reflected the deep and dynamic relationship between the two countries.\r\nGuilfoyle referred to Greece as one of the fastest-growing economies in Europe, with a society that showed resilience despite the important challenges the country faced. She said that her agenda would focus on strong economic development, education, energy security, and collaboration in the defense sector.\r\nThe nominee expressed her appreciation to Archbishop Elpidophoros of America, to businessman and close friend of president-elect Trump John Catsimatidis and to leaders of the Greek American community for their support and good wishes. She also said she was in the process of preparing to leave for Greece and wished to express her deep appreciation to Ambassador George Tsunis for his support and decisive role in securing a smooth transition.\r\nGuilfoyle told ERT she looked forward to starting her mission as US ambassador to Greece, adding that she was enthusiastically looking forward to meeting the Greek people and visiting their beautiful country with a rich history. She also underlined that she would try to meet President-elect Donald Trump's expectations, serving both the American people and the people of Greece to the best of her ability. [AMNA]","url":"https://www.ekathimerini.com/politics/foreign-policy/1256955/guilfoyle-greece-us-relations-will-deepen-under-trump-presidency/","image":"https://www.ekathimerini.com/wp-content/uploads/2024/12/Guilfoyle_AP-960x600.jpg?v=1734719515","video":null,"publish_date":"2024-12-21 00:41:23","author":null,"language":"en","category":"politics","source_country":"gr","sentiment":0.546},{"id":274982606,"title":"US govt shutdown averted: House passes emergency funding bill","text":"The House of Representatives approved a government funding bill Friday evening in a 366-34 vote, aiming to prevent a partial shutdown. The bill’s passage came after intense negotiations and objections from President-elect Donald Trump and Elon Musk, the incoming chief of the Department of Government Efficiency, who criticized the initial version as overly \"bloated.\"Speaker Mike Johnson (R-La.) announced, “We will not have a government shutdown, and we will meet our obligations for our farmers who need aid, for disaster victims all over the country, and for making sure that military and essential services and everyone who relies upon the federal government for a paycheck is paid over the holidays.”— MarioNawfal (@MarioNawfal) Details of the 118-page billThe legislation, trimmed from 1,547 to 118 pages, funds the government at current levels through March 14, 2025. It includes $100 billion in disaster relief for hurricane-hit states and farmers, extends agricultural subsidies for a year, and allocates $25 million for the US Marshals Service and Supreme Court security. A peculiar $3 million provision for inspecting molasses at U.S. ports also survived.Republicans largely supported the measure, with just 34 voting against it. No Democrats opposed the final version, and one voted “present.” This marks a stark contrast to Thursday night, when 38 GOP members rejected a similar bill.Negotiation highlightsHouse Minority Leader Hakeem Jeffries (D-NY) played a key role in breaking the impasse. Jeffries supported the final version and praised the decision to reject Trump’s proposal to abolish the federal debt ceiling, which he argued would have triggered recurring crises.Musk, who initially pressured Republicans to reject the earlier version, endorsed the revised package. “The Speaker did a good job here, given the circumstances. It went from a bill that weighed pounds to a bill that weighed ounces. Ball should now be in the Dem court,” he tweeted.Scrapped provisionsThe revised bill removed contentious proposals, including a 4% pay raise for Congress, a provision restricting pharmacy benefit managers, and funding for Robert F. Kennedy Stadium renovations. It also struck measures against AI-generated non-consensual pornography.Political tensions and falloutRep. Thomas Massie (R-Ky.) criticized Speaker Johnson’s decision to work with Democrats, claiming, “Johnson flipped his decision after the meeting when he spoke to [Hakeem Jeffries] and realized he could get Democrat votes to pass all the legislation as one bill.”Massie and Rep. Marjorie Taylor Greene (R-Ga.) had previously attempted to oust Johnson as Speaker. Musk also fueled tensions, questioning on X, “So is this a Republican bill or a Democrat bill?”Rep. Alexandria Ocasio-Cortez (D-NY) fired back, “How about the House add campaign finance reform to the CR so Republicans and Democrats alike can stop being so scared about what a billionaire man-child thinks before they vote on anything around here.”Looking aheadWhile the House avoided a shutdown, uncertainty looms as the Senate faces time constraints to consider the bill. A senior Democratic aide noted Johnson’s challenges: “He was juggling all that with wanting to keep the gavel while being hit with asteroids launched by Elon Musk.”","summary":"The House narrowly averted a government shutdown by passing a trimmed-down funding bill.  The legislation, supported by both parties, includes disaster relief and agricultural subsidies, but removed contentious provisions like a congressional pay raise.  The Senate now faces a tight deadline to approve the bill before the March 14th deadline.","url":"https://timesofindia.indiatimes.com/world/us/us-govt-shutdown-averted-house-passes-emergency-funding-bill-to-keep-government-running-just-hours-before-deadline/articleshow/116520880.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116521048/116521048.jpg","video":null,"publish_date":"2024-12-21 00:40:22","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":0.082},{"id":274979038,"title":"European Stocks Close Lower Again","text":"Latest Headlines\r\n\nTop Stories\r\n\nBreaking News\r\n\n\r\n\n\r\n\n\r\n\nStock Alerts\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nWallstreet Events\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nIndustry News\r\n\r\n\r\n\n\r\n\n\r\n\nIndustry News\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nCorp. Calendars\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nStock Splits\r\n\n\r\n\nConference Calls\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nEarnings Calendar\r\n\r\n\r\n\n\r\n\n\r\n\nEarnings Calendar\r\n\nPos Pre-announcements\r\n\nProfit Warnings\r\n\nPositive Surprise\r\n\nNegative Surprise\r\n\nLatest Earnings\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nFDA Calendars \r\n\r\n\r\n\n\r\n\n\r\n\nDrug Approvals\r\n\nClinical Trial Calendar\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nRatings Changes\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nCov Initiations\r\n\nCov. Reiterated\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nEconomic News\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nEconomic Calendar\r\n\nEconomic Scorecard\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nCryptocurrency\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nCryptocurrency\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nMorning Mkt Analysis\r\n\nUS Commentary\r\n\nEuropean Commentary\r\n\nAsian Commentary\r\n\nCanadian Commentary\r\n\nIndian Commentary\r\n\nCommodities\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nWhite House\r\n\n\r\n\nGeneral News\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nFX Top Stories\r\n\nCurrency Analysis\r\n\nCurrency Alerts\r\n\nEconomic Calendar\r\n\nEconomic Scorecard\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nCoronavirus\r\n\nCOVID-19 Calendar\r\n\nDiet & Fitness\r\n\n\r\n\nKids Health\r\n\nMen's Health\r\n\nWomen's Health\r\n\nCancer News\r\n\nDrug Development\r\n\nMental Health\r\n\r\n\r\n\r\n\n\r\n\n\r\nSlide Shows\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nEntertainment\r\n\r\n\r\n\n\r\n\n\r\n\nEntertainment\r\n\nTop Stories\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nClassic Rock\r\n\nRap/Hip-Hop\r\n\n\r\n\nAlternative\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nContent Licensing\r\n\r\n\r\n\n\r\n\n\r\n\nContent Licensing\r\n\nNewswires & Feeds\r\n\nContent Syndication\r\n\nDigital Signage Services\r\n\nRadio News Services\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nPremium Services\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nIntelligent Investor\r\n\nBiotech Investor NEW\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nLatest News Videos\r\n\nFree Content\r\n\n\r\n\nPress Releases\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\nLatest Headlines\r\n\n\r\n\n\r\n\nStock Alerts\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\nTop Stories\r\n\nBreaking News\r\n\n\r\n\n\r\n\n\r\n\nWallstreet Events\r\n\r\n\r\n\r\n\n\r\nIndustry News\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\nCorp. Calendars\r\n\n\r\n\n\r\n\nStock Splits\r\n\n\r\n\nConference Calls\r\n\r\n\r\n\n\r\nEarnings Calendar\r\n\n\r\n\nEarnings Calendar\r\n\nPos Pre-announcements\r\n\nProfit Warnings\r\n\nPositive Surprise\r\n\nNegative Surprise\r\n\nLatest Earnings\r\n\r\n\r\n\n\r\nFDA Calendars\r\n\n\r\n\nDrug Approvals\r\n\nClinical Trial Calendar\r\n\r\n\r\nRatings Changes\r\n\n\r\n\n\r\n\n\r\n\nCov Initiations\r\n\nCov. Reiterated\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nEconomic Calendar\r\n\nEconomic Scorecard\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nCryptocurrency\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nMarket News\r\n\n\r\n\n\r\n\nMorning Mkt Analysis\r\n\nUS Commentary\r\n\nEuropean Commentary\r\n\r\n\r\n\n\r\n\n\r\n\nAsian Commentary\r\n\nCanadian Commentary\r\n\nIndian Commentary\r\n\r\n\r\n\n\r\n\n\r\n\nCommodities\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nWhite House\r\n\n\r\n\nGeneral News\r\n\r\n\r\n\n\r\n\n\r\n\nFX Top Stories\r\n\nCurrency Analysis\r\n\nCurrency Alerts\r\n\nEconomic Calendar\r\n\nEconomic Scorecard\r\n\r\n\r\n\n\r\n\n\r\n\n\r\nHealth News\r\n\n\r\n\n\r\n\nCoronavirus\r\n\nCOVID-19 Calendar\r\n\nDiet & Fitness\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nKids Health\r\n\nMen's Health\r\n\nWomen's Health\r\n\r\n\r\n\n\r\n\n\r\n\nCancer News\r\n\nDrug Development\r\n\nMental Health\r\n\r\n\r\n\r\n\r\n\r\n\nSlide Shows\r\n\nEntertainment\r\n\n\r\n\n\r\n\n\r\nEntertainment News\r\n\n\r\n\nTop Stories\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nClassic Rock\r\n\nRap/Hip-Hop\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\nAlternative\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nContent Licensing\r\n\n\r\n\nNewswires & Feeds\r\n\nContent Syndication\r\n\nDigital Signage Services\r\n\nRadio News Services\r\n\r\n\r\n\n\r\n\n\r\n\nIntelligent Investor\r\n\nBiotech Investor\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nLatest News Videos\r\n\nFree Content\r\n\n\r\n\nPress Releases\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nEuropean Stocks Close Lower Again \r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\nBy RTTNews Staff Writer ✉\r\n | Published: 12/20/2024 1:28 PM ET\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n European stocks closed lower on Friday, extending losses from the previous session, as concerns about political uncertainty in some major European countries, fears of a U.S. government shutdown, and potential tariffs on the European Union weighed on sentiment.\nU.S. President-elect Donald Trump warned of potential tariffs on the European Union if the bloc does not cut its growing deficit with the United States by making large oil and gas trades with the world's largest economy.\nIn economic releases, the declining trend in German producer prices unexpectedly ceased in November, data from Destatis showed today.\nProducer prices rose 0.1% year-on-year in November, reversing a 1.1% fall in the prior month.\nData out of U.K. showed British retail sales rose by a weaker-than-expected 0.2% in November as consumers hold back spending in the final months of the year.\nThe pan European Stoxx 600 fell 0.88%. The U.K.'s FTSE 100 closed down 0.26%, Germany's DAX and France's CAC 40 closed lower by 0.43% and 0.27%, respectively. Switzerland's SMI ended lower by 0.26%.\nAmong other markets in Europe, Denmark's OMXC20 tanked more than 13%. Greece, Iceland, Ireland, Netherlands, Norway, Poland, Portugal, Sweden and Turkiye closed weak.\nBelgium and Spain posted modest gains, while the Russian market rose sharply. Austria and Finland ended flat.\nBank stocks were among the notable losers. Shares of automakers also traded mostly weak.\nIn the UK market, Severn Trent, JD Sports Fashion, Hiscox, United Utilities, ICG, Standard Chartered, Natwest Group and BT Group were the notable losers.\nSynairgen shares plummeted nearly 47%. The biopharmaceutical company has announced plans to raise up to £25 million to fund the phase 2 trials of its antiviral treatment.\n\n\r\n\r\n\r\n\nFrasers Group climbed 2.8%. B&M European Value Retail, Rentokil Initial, Vistry Group, Segro, Endeavour Mining Plc, Antofagasta, IAG, Unite Group, Land Securities, Fresnillo and British Land gained 1 to 2.2%.\nIn the German market, Deutsche Bank closed more than 2% down. Commerzbank, Munich RE, Infineon, Rheinmetall, Hannover Rueck, Zalando and Fresenius lost 0.9 to 1.7%.\nVonovia rallied about 2.5%. Siemens Energy and Volkswagen both gained nearly 2%.\nIn the French market, Thales, Airbus Group, ArcelorMittal, AXA, Pernod Ricard, Dassault Systemes and Carrefour closed notably lower.\nCrdit Agricole ended lower by about 0.5% after the bank announced the acquisition of Santander's 30.5% stake in CACEIS, its asset servicing subsidiary.\nVivendi gained nearly 2.5%. Renault climbed about 1.5%, while Unibail Rodamco, Teleperformance, Hermes International, LVMH and Accor gained 0.6 to 1%.\nUK budget deficit narrowed notably in November as the interest payable on government debt decreased, while tax receipts increased from a year ago, the Office for National Statistics said.\nPublic sector net borrowing decreased GBP 3.4 billion to GBP 11.2 billion in November. This was the lowest November borrowing since 2021.\nFrance's producer prices in the domestic market fell 5.2% on a yearly basis, though slower than the 6% decline in October. Further, prices decreased for the twelfth successive month. Month-on-month, producer prices in the home market increased at a faster pace of 3.2% in November versus a 0.9% gain in October.\nUK car production posted its sharpest decline for the month of November since 1980 largely reflecting weaker global demand, data published by the Society of Motor Manufacturers and Traders showed on Friday. Car production declined 30.1% on a yearly basis in November. This was the ninth consecutive decline. \nFor comments and feedback contact: editorial@rttnews.com\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\nSlide Shows\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBiotech Stocks Facing FDA Decision In August 2024\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBiotech Stocks Facing FDA Decision In June 2024\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBiotech Stocks Facing FDA Decision In April 2024\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n Previous Story\r\n\nNext Story \r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\nGlobal Economics Weekly Update - December 16 - 20, 2024\r\n\r\n\n\r\n\n\r\n\r\n\r\n\nDecember 20, 2024 12:34 ET \nA busy week for economics news with several central banks announcing interest rate decisions and many countries releasing key economic data ahead of the holidays. The Federal Reserve policy announcement was the highlight as well as the latest set of GDP figures for the U.S. economy. Central banks of Japan and the U.K. were also in focus as they revealed their policy decisions and future rate paths. On the data front, several indicators out of China threw light on the state of the economy. \r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\nView More Videos\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nLatest Updates on COVID-19\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\nNew Rule Allows Organ Transplant Between HIV-Positive Persons \r\n\r\nNovember 27, 2024 15:04 ET \r\n\r\n\r\n\n\r\n\r\nCDC Reports Vaccination Coverage Rates Among US Adults \r\n\r\nNovember 22, 2024 16:08 ET \r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nEditor's Pick\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\nMost Emailed\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\nFedEx Stock Up On Freight Spin Off, Despite Weak Earnings, Outlook Cut \r\nDecember 20, 2024 05:31 ET \r\n\r\n\r\n\n\r\n\r\nDarden Restaurants Lifts FY25 Sales Forecast After Q2 Beats Market; Stock Climbs \r\nDecember 19, 2024 09:04 ET \r\n\r\n\r\n\n\r\n\r\nPepsiCo's Frito-Lay Recalls Lay's Classic Potato Chips \r\nDecember 19, 2024 02:14 ET \r\n\r\n\r\n\n\r\n\r\nGeneral Mills Cuts FY25 View Despite Q2 Above Market; Stock Drops \r\nDecember 18, 2024 08:25 ET \r\n\r\n\r\n\n\r\n\r\nSoftBank's $100 Bln Pledge In US To Create 100K AI, Infrastructure Jobs \r\nDecember 17, 2024 08:26 ET \r\n\r\n\r\n\n\r\n\r\nAlibaba Sees $1.3 Bln Loss On Sale Of Intime Store Chain \r\nDecember 17, 2024 05:08 ET \r\n\r\n\r\n\n\r\n\r\nConnie's Thin Crust Cheese Frozen Pizzas Recalled \r\nDecember 16, 2024 09:14 ET \r\n\r\n\r\n\n\r\n\r\nHSBC Sued By Australian Regulator For Failures Against Scams \r\nDecember 16, 2024 06:44 ET \r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\nEdgewise Therapeutics Announces Positive Topline Results From CANYON Phase 2 Trial Of Sevasemten \r\nDecember 16, 2024 08:51 ET \r\n\r\n\r\n\n\r\n\r\nNovo Nordisk's CagriSema Shows Superior, But Lower-than-expected Weight Loss In Obesity; Stock Drops \r\nDecember 20, 2024 07:21 ET \r\n\r\n\r\n\n\r\n\r\nJazz Pharma CEO Bruce Cozadd To Retire \r\nDecember 16, 2024 20:29 ET \r\n\r\n\r\n\n\r\n\r\nTenaya Reports Early Data From First Cohort Of Patients In MyPEAK-1 Trial Of TN-201 \r\nDecember 17, 2024 08:04 ET \r\n\r\n\r\n\n\r\n\r\nPepGen Says FDA Issues Clinical Hold On Phase 2 Study For PGN-EDO51 In Duchenne Muscular Dystrophy \r\nDecember 16, 2024 08:53 ET \r\n\r\n\r\n\n\r\n\r\nApplied Therapeutics CEO Steps Down, Les Funtleyder Appointed As Interim CEO \r\nDecember 20, 2024 08:45 ET \r\n\r\n\r\n\n\r\n\r\nWhy Is Galectin Stock Falling In Pre-market? \r\nDecember 20, 2024 08:33 ET \r\n\r\n\r\n\n\r\n\r\nMarker Therapeutics Updates APOLLO Study In Relapsed Lymphoma, Announces $16.1 Mln Private Placement \r\nDecember 19, 2024 11:25 ET \r\n\r\n\r\n\n\r\n\r\nFibroGen Appoints David DeLucia As Chief Financial Officer \r\nDecember 16, 2024 08:34 ET \r\n\r\n\r\n\n\r\n\r\nBD Agrees To Pay $175 Mln To Settle With SEC Over Alaris System Investigation \r\nDecember 16, 2024 19:47 ET \r\n\r\n\r\n\n\r\n\r\nMerck Enters Into Exclusive Global License Agreement With Hansoh Pharma For HS-10535 \r\nDecember 18, 2024 07:28 ET \r\n\r\n\r\n\n\r\n\r\nPhillips 66 To Sell DCP GCX Pipeline To ArcLight Capital Partners For Up To $865 Mln Cash \r\nDecember 16, 2024 07:48 ET \r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\nPerformance Food Group Promotes Scott McPherson To Succeed Craig Hoskins As President & COO \r\nDecember 16, 2024 07:32 ET \r\n\r\n\r\n\n\r\n\r\nPharming Group Offers To Acquire Abliva For SEK 0.45/shr In Cash \r\nDecember 15, 2024 20:05 ET \r\n\r\n\r\n\n\r\n\r\nShyft, Aebi Schmidt To Merge In All-stock Deal To Drive Specialty Vehicle Growth Plans \r\nDecember 16, 2024 07:41 ET \r\n\r\n\r\n\n\r\n\r\nApple Plans Thinner And Foldable IPhones : Report \r\nDecember 15, 2024 20:36 ET \r\n\r\n\r\n\n\r\n\r\nPhillips 66 To Sell DCP GCX Pipeline To ArcLight Capital Partners For Up To $865 Mln Cash \r\nDecember 16, 2024 07:48 ET \r\n\r\n\r\n\n\r\n\r\nNorthern Trust And National University Of Singapore Partner To Innovate In Green Finance \r\nDecember 15, 2024 22:22 ET \r\n\r\n\r\n\n\r\n\r\nSteel Dynamics Guides Q4 Earnings Well Below Estimates \r\nDecember 16, 2024 08:03 ET \r\n\r\n\r\n\n\r\n\r\nBasilea Collaborates With Innoviva Specialty Therapeutics For Commercialization Of Zevtera In The US \r\nDecember 16, 2024 01:25 ET \r\n\r\n\r\n\n\r\n\r\nDelta Galil Submits Draft Registration Statement For Proposed IPO \r\nDecember 16, 2024 08:12 ET \r\n\r\n\r\n\n\r\n\r\nAkoustis Technologies Files For Chapter 11 Bankruptcy \r\nDecember 16, 2024 01:49 ET \r\n\r\n\r\n\n\r\n\r\nInnoviva In Deal With Basilea Pharma To Buy U.S. Marketing Rights For Zevtera \r\nDecember 16, 2024 08:24 ET \r\n\r\n\r\n\n\r\n\r\nSkanska Invests EUR 90 Mln In Commercial Construction Project \r\nDecember 16, 2024 02:11 ET \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nEditors Pick\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\nFedEx Stock Up On Freight Spin Off, Despite Weak Earnings, Outlook Cut \r\nDecember 20, 2024 05:31 ET\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\nDarden Restaurants Lifts FY25 Sales Forecast After Q2 Beats Market; Stock Climbs \r\nDecember 19, 2024 09:04 ET\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\nPepsiCo's Frito-Lay Recalls Lay's Classic Potato Chips \r\nDecember 19, 2024 02:14 ET\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\nGeneral Mills Cuts FY25 View Despite Q2 Above Market; Stock Drops \r\nDecember 18, 2024 08:25 ET\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\nCopyright © 2024 RTTNews. All rights reserved.By using this site, you agree to the \r\nTerms of Service.\r\n\r\n\r\nAbout Us | \r\nContact Us","url":"https://www.rttnews.com/3498979/european-stocks-close-lower-again.aspx","image":"https://cdn.rttnews.com/images/v2/RTTNews-Main_logo.jpg","video":null,"publish_date":"2024-12-21 00:38:23","author":null,"language":"en","source_country":"us","sentiment":0.212},{"id":274978938,"title":"House Passes Bill to Avert Government Shutdown on 3rd Attempt, Senate to Vote Ahead of Saturday Deadline | Capitol Report","text":"Dec-20-2024\n\nJust hours from a midnight government shutdown, the House passes a stopgap measure to temporarily fund federal operations and disaster aid—but the bill doesn’t include President-elect Donald Trump’s demands for a debt limit increase.\n\nWhat does the back-and-forth about the Trump-backed funding bill—which was rejected Thursday ni...","url":"https://www.theepochtimes.com/epochtv/house-passes-bill-to-avert-government-shutdown-on-3rd-attempt-senate-to-vote-ahead-of-saturday-deadline-capitol-report-5780043","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5780063-Captiol_1220_v1.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":274978932,"title":"Trump Nominates CatholicVote President Brian Burch for Ambassador to The Vatican","text":"President-elect Donald Trump has nominated CatholicVote president Brian Burch to be the U.S. Ambassador to The Holy See in Rome.\n\nDescribing Burch as “a devout Catholic,” Trump said, “He has received numerous awards and demonstrated exceptional leadership, helping build one of the largest Catholic advocacy groups in the Country.”\n\n“Brian loves his Church and the United States. He will make us all proud.”\n\nThe Holy See is the name of the governing body of the Catholic Church located in Vatican City, currently led by Pope Francis I.\n\nVatican City—an independent city-state within Rome, Italy—is the heart of a faith held by more than one billion people worldwide.\n\nBurch, a husband and father of nine children, accepted the nomination and thanked his wife, children, late father, and team at CatholicVote.org.\n\nFounded by Burch in 2005, CatholicVote.org is a nonprofit advocacy organization for Catholic lay people—those who are not priests, nuns, or hold another celibate-bound role in a religious order. Its website describes it as “a community of patriotic Americans who believe that the timeless truths of the Catholic faith are good for America.”\n\n“We make it our mission to inspire every Catholic in America to live out the truths of our faith in public life,” the website states.\n\nBurch has received the Cardinal John O’Connor Defender of the Faith Award from Legatus and the St. Juan Diego Leadership Award from The Catholic Professional Global Network.\n\nBurch’s appointment will require Senate approval.\n\nThe Epoch Times has reached out to the United States Conference of Catholic Bishops for comment on Trump’s nomination.\n\nThis decision followed President Joe Biden’s announcement that he will make one last trip to The Vatican in January before the end of his term.","url":"https://www.theepochtimes.com/us/trump-nominates-catholicvote-president-brian-burch-for-ambassador-to-the-vatican-5779845?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/09/20/id5727501-GettyImages-1722544817-0-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"T.j. Muscaro","authors":["T.j. Muscaro"],"language":"en","category":"politics","source_country":"us","sentiment":0.517},{"id":274978934,"title":"Jelly Roll Responds to Criticisms After Meeting Donald Trump: ‘I’m Not Political’","text":"Jelly Roll has addressed the backlash he received after meeting President-elect Donald Trump at a UFC event last month.\n\nThe Grammy-nominated singer, whose legal name is Jason DeFord, discussed the interaction during a recent appearance on the “Dumb Blonde” podcast, hosted by his wife, Alyssa DeFord, 44.\n\n“Meeting President Trump was cool,” the 40-year-old singer said during the Dec. 16 episode.\n\n“Ultimately, I don’t really care about any blowback I get about it. The truth is, it was really cool to meet the president ... I was honored.”\n\nThe “Save Me” crooner can also be seen greeting Donald Trump Jr. and billionaire businessman Elon Musk at the UFC fight, which took place less than two weeks after the presidential election.\n\nSome social media users offered their support for the exchange online.\n\nOthers expressed their disapproval.\n\nSpeaking to his wife of eight years, Jelly Roll said he wouldn’t have missed the opportunity to meet a president-elect, regardless of their political affiliation.\n\n“If I would have gotten a call to go meet with Joe Biden at any point, I would have stopped what I was doing to go meet him. That’s the active president. I wouldn’t have cared what people thought, even what I think about his policies,” the musician said.\n\n“I don’t hide behind the ‘I’m not political’ stuff. I’m not political,” he continued.\n\n“I didn’t grow up in a voting culture. My father didn’t push voting on me. My mother didn’t push voting on me.”\n\nHe said that his parents did instill respect for what he called “the hardest job in the world.”\n\n“When I look back at my relationship with politics, like, we didn’t watch election night. I don’t have one memory of us, like, as a family, really [caring] who was getting elected.”\n\nThe rapper-turned-country star remarked that he has acquired much of the political knowledge he has today by listening to podcasts.\n\n“I watched quite a few hours of Trump podcasts, and I still didn’t have enough information about his policies, frankly, to be like, ‘I’m going to vote for this guy,’” he said.\n\nIn addition to Musk and Trump’s eldest son, the president-elect’s other cabinet picks were present at the UFC fight.\n\nVivek Ramaswamy, who was tapped alongside Musk to help lead the department of government efficiency, was in attendance, joined by Tulsi Gabbard, Trump’s nominee for director of national intelligence, and Robert F. Kennedy Jr., his pick for secretary of health and human services.\n\nJelly Roll said he thought it was “cool” that Kennedy had been selected to helm the federal health agency role.\n\n“I liked Robert Kennedy because he was really for addicts, and he was really for changing food, and he was really for like broken America, my people, our people,” the singer said.\n\n“He works the steps. He sponsors people. I mean, this dude’s a real recovery story.”\n\nJelly Roll, who released his latest album, “Beautifully Broken,” on Oct. 11, has been open about his past struggles with drug and alcohol addiction, including multiple arrests for drug-related offenses.","url":"https://www.theepochtimes.com/entertainment/jelly-roll-responds-to-criticisms-after-meeting-donald-trump-im-not-political-5779791?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/03/15/id5608046-GettyImages-2046393750-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Audrey Enjoli","authors":["Audrey Enjoli"],"language":"en","category":"politics","source_country":"us","sentiment":-0.052},{"id":274978930,"title":"Congress Scrambles to Avert Shutdown; White House Starts Scrapping Student Debt Cancellation","text":"Dec-20-2024\n\nCongress was scrambling to avert a partial government shutdown on Friday, hours after more than three dozen Republicans rejected a demand by President-elect Donald Trump to use the measure to lift the nation’s debt ceiling.\n\nThe White House is abandoning its plan to cancel student loans for more than 38 million Americans. This i...","url":"https://www.theepochtimes.com/epochtv/johnson-says-house-will-vote-friday-morning-top-us-diplomats-to-meet-new-syrian-leaders-5779729?ea_src=frontpage&ea_med=lead-story-epochtv-4&ea_cnt=a","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5779797-PLAN-C-TO-AVERT-SHUTDOWN-.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.251},{"id":274978926,"title":"Trump Threatens EU With Tariffs If It Doesn’t Buy More American Oil and Gas","text":"President-elect Donald Trump has issued a warning to the European Union (EU), threatening to impose tariffs on the bloc unless it buys large enough quantities of American oil and gas to make up for its trade deficit with the United States.\n\n“I told the European Union that they must make up their tremendous deficit with the United States by the large-scale purchase of our oil and gas. Otherwise, it is tariffs all the way!!!” Trump wrote in his post.\n\nEU Commission spokesperson Olof Gill said that the EU–U.S. trade relationship is highly integrated and complementary, adding that the bloc is prepared to hold discussions with the incoming Trump administration on how to address concerns and further strengthen ties.\n\n“The EU and U.S. have deeply integrated economies, with overall balanced trade and investment. We are ready to discuss with President-elect Trump how we can further strengthen an already strong relationship, including by discussing our common interests in the energy sector,” Gill told The Epoch Times in an emailed statement.\n\n“The EU is committed to phasing out energy imports from Russia and diversifying our sources of supply,” Gill said, indicating that the EU’s focus on diversifying energy sources may align with Trump’s push for increased purchases of American oil and gas.\n\nTop EU officials have indicated their intention to increase purchases of U.S. energy. Ursula von der Leyen, president of the European Commission, said in November that liquefied natural gas (LNG) imports from the United States could replace the bloc’s remaining imports of Russian LNG.\n\n“We still get a whole lot of LNG via Russia, from Russia,” von der Leyen told reporters at a summit in Budapest, Hungary, on Nov. 8. “And why not replace it with American LNG, which is cheaper, and brings down our energy prices.”\n\nDuring his first term, Trump frequently wielded tariffs—or the threat of them—as a bargaining chip to renegotiate trade deals he deemed unfavorable to American businesses.\n\n“The following year, he announced plans for escalating tariffs on all Mexican imports to pressure Mexico into taking stronger measures against illegal immigration. Once he achieved his objectives, the tariffs were suspended.”\n\nMost recently, Trump warned Canada and Mexico of impending 25 percent tariffs unless they took decisive steps to curb the flow of fentanyl and illegal immigrants across their borders into the United States.\n\nCritics of Trump’s proposed tariffs say that they could lower America’s economic output and raise prices for U.S. consumers of imported goods—such as Canadian lumber—as well as of products that use those imports as inputs, such as houses.\n\nSupporters contend that the longer-term benefits of strengthened domestic production and reduced dependence on foreign imports justify the short-term economic costs of tariffs. Others, like Geza, say that Trump’s threat of tariffs is more of a negotiating tactic to achieve certain policy outcomes.","url":"https://www.theepochtimes.com/us/trump-threatens-eu-with-tariffs-if-it-doesnt-buy-more-american-oil-and-gas-5779794?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/11/04/id5753653-GettyImages-2182696099-Donald-Trump-OP-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","category":"politics","source_country":"us","sentiment":0.243},{"id":274978918,"title":"House Passes Bill to Avert Government Shutdown on 3rd Attempt, Senate to Vote Ahead of Saturday Deadline | Capitol Report","text":"Dec-20-2024\n\nJust hours from a midnight government shutdown, the House passes a stopgap measure to temporarily fund federal operations and disaster aid—but the bill doesn’t include President-elect Donald Trump’s demands for a debt limit increase.\n\nWhat does the back-and-forth about the Trump-backed funding bill—which was rejected Thursday ni...","url":"https://www.theepochtimes.com/epochtv/house-passes-bill-to-avert-government-shutdown-on-3rd-attempt-senate-to-vote-ahead-of-saturday-deadline-capitol-report-5780043?ea_src=frontpage&ea_med=lead-story-epochtv-2&ea_cnt=a","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5780063-Captiol_1220_v1.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":274978914,"title":"Peter Menzies: Liberal MPs Shot Themselves in the Foot When They Voted Against Having Power to Oust Leader","text":"That disgruntled Liberal members of Parliament lack the ability to remove their leader is entirely their own fault. It is they who decided to deny themselves the ability to do so.\n\nIt also, unfortunately, made signing on to the provisions optional for all parties. Only the Conservatives chose to do so and, indeed, they used it to remove their previous leader, Erin O’Toole, following the 2021 election. The bill allows for MPs to petition for a confidence vote on their leader which, in Mr. O’Toole’s case, resulted in a thumbs down, the appointment of an interim, and a vote by party members for a new leader—in this case Pierre Poilievre.\n\nIt is a sensible and necessary check on the power of the Prime Minister’s Office, prevents the prime minister and his staff from running amok, and ensures MPs must be treated as something more than garden gnomes whose sole function is to show up, stay out of trouble, and vote as the party whip instructs them.\n\nA small group of Liberal MPs, alarmed by their government’s unprecedented lack of popularity, tried in October to force Mr. Trudeau to resign. The same group, with perhaps a few more adherents, spoke out again following the shock resignation of Chrystia Freeland from cabinet in response to Mr. Trudeau’s decision to remove her as finance minister.\n\nBut their options are extremely limited.\n\nWithout access to the rights they denied themselves within the Reform Act, their only option is to vote against their own government in a confidence vote and force Mr. Trudeau to call an election. With the Conservatives enjoying a lead of more than 20 points in the polls, such a move would be the political equivalent of strapping on a suicide vest because most of them would lose their seats.\n\nSo all they can do is be angry. Or they can be frustrated. They can even protest by voting against some of their government’s legislation that doesn’t involve a confidence vote, but if they do so they risk being removed from caucus by Trudeau and would then most certainly not retain their seats.\n\nOther than moral suasion, they have no power whatsoever. And they are ineffectual because they voted to be so.\n\nWe could all enjoy the irony were it not for the fact the nation may now suffer the consequences of their obsequious behaviour. Their decisions to happily adopt the role of garden gnomes have given Mr. Trudeau and his Chief of Staff Katie Telford what amount to dictatorial powers within an allegedly democratic parliamentary system.\n\nThey could have put a check on the powers of their leader. They didn’t, and the bed they now lie in is the one they made.\n\nSo now, the jobs of many thousands of people are at risk from the 25 percent tariffs on Canadian exports threatened by U.S. President-elect Donald Trump, who has turned Canada into a sort of running gag through his social media posts, referring to it as the great (51st) state of Canada and to its prime minister as a mere governor. Mr. Trump is well known for his brash presentation, but he has never so freely mocked any nation as he has Canada in recent weeks.\n\nClearly, he senses weakness. Despite efforts by provincial premiers to appeal to the Americans for reason, Mr. Trudeau, who is struggling to maintain the respect of his own nation, remains the target.\n\nThe prime minister may yet choose, after reflecting on his dilemma, to step aside and let a replacement lead the Liberals into an election that will give whoever wins a mandate to negotiate with Mr. Trump. But even then it will be too late. The president-elect takes office in a matter of weeks and he is clearly in a hurry. Even a resignation by Mr. Trudeau at this stage—and the evidence to date indicates he is disinclined to make that move—means it will be months before Canada is equipped to deal with what amounts to an existential threat to its economy.\n\nHad Liberal MPs not so enthusiastically emasculated themselves, the story might have been very different. But they did and the country will pay dearly for their subservience.","url":"https://www.theepochtimes.com/opinion/peter-menzies-liberal-mps-shot-themselves-in-the-foot-when-they-voted-against-having-power-to-oust-leader-5779240","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5779930-CP173383327-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Peter Menzies","authors":["Peter Menzies"],"language":"en","source_country":"us","sentiment":-0.08},{"id":274978910,"title":"Elon Musk Says He Plans to Fund Moderate Democratic Primary Challengers","text":"In a flurry of X posts in recent days, the tech mogul said he was against a sweeping 1,547-page bill that would have extended government funding through March 2025, telling his 200-plus million followers on the platform to “Stop the steal of your tax dollars” while adding that any lawmaker who votes for the spending bill deserves to be voted out in the 2026 mid-term election.\n\nPresident-elect Donald Trump also expressed his opposition to the bill, which was ultimately voted down. A second version of the measure also failed to pass while House lawmakers passed a third version in bipartisan fashion on Dec. 20, sending it to the Senate and moving a crucial step closer towards averting a looming government shutdown that was set to take place at 12:01 a.m. ET on Dec. 21.\n\n“Can you imagine what the next two years are going to be like if every time that Congress works its will and then there’s a tweet? Or from an individual who has no official portfolio, who threatens members on the Republican side with a primary? And they succumb?” Neal said in a clip re-posted by the Wall Street Mav account on X.\n\nRelated StoriesRepublicans Float Elon Musk for Speaker Amid Funding Deal Collapse12/19/2024Musk Rebuts Claims That Terrorists Are Using Starlink in India12/18/2024\n\n“Forgot to mention that I’m also going to be funding moderate candidates in heavily Democrat districts, so that the country can get rid of those who don’t represent them,” Musk wrote in the Dec. 19 post on X.\n\nFollowing the failure of the 1,547-page bill to pass, a pared-down, Trump-backed proposal was put forward—and then voted down.\n\nHouse Speaker Mike Johnson (R-La.) announced on Friday morning that a third “Plan C” bill had been put together. It funds the government until mid-March and includes $110 billion in disaster aid, $30 billion in farm aid, and a one-year extension to the farm bill.","url":"https://www.theepochtimes.com/us/elon-musk-says-he-plans-to-fund-moderate-democratic-primary-challengers-5779944?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/03/id5769866-GettyImages-2184585949.jpg-LSedit-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","category":"politics","source_country":"us","sentiment":-0.182},{"id":274978898,"title":"Cory Morgan: How Will Canada’s US Negotiations Amid Tariff Threats Shape Up in 2025?","text":"The Canadian crystal ball is as muddy as it gets in predicting who will lead Canada through 2025.\n\nOne certainty, though, is that a top priority for Canada’s prime minister will be dealing with incoming U.S. President Donald Trump firmly while managing to avoid a trade war. Who is better placed to negotiate with the new American administration? Or perhaps the question is, who will be leading Canada through 2025—Trudeau, an interim Liberal leader, or Poilievre (if an early election is called)?\n\nDonald Trump has never made a secret of his support for trade protectionism. He has always campaigned on an America-first platform, and imposing tariffs upon incoming goods has been his preferred tactic. When Trump threatens tariffs as high as 25 percent across the board on Canadian trade goods, he must be taken seriously.\n\nTrump is also a master negotiator who knows how to put himself in a position of strength. Although he has not formally assumed the presidency, he has deftly managed to completely overshadow the outgoing Biden administration and dominate the news cycle in Canada. He knows how to stay in the headlines and manipulate public opinion on both sides of the border. Trump’s teasing of Trudeau through social media isn’t a form of casual entertainment for himself, though he does appear to take pleasure from it. His social media postings are calculated to set Canada on its heels and keep Canadian leaders divided and confused about how to react to him.\n\nThough his political future is tenuous at best, Justin Trudeau is still the most likely to be sitting in the prime minister’s chair when Trump is inaugurated on Jan. 20. Despite the pressure he is now facing, Trudeau has managed to stay in power for nine years.\n\nWhen negotiating with provinces on federal policies, Trudeau has sometimes used manipulative tactics, and he has been successful many times. Like Trump, Trudeau often bypasses local governments and appeals to the public on policy issues. He dangles federal money for programs such as dental care and daycare, but always attaches strings to them. Provincial leaders then find themselves mousetrapped as they look heartless and overly partisan if they refuse to play ball with Trudeau. It’s an infuriating strategy, but an effective one indicating Trudeau’s governing skills may be more nuanced than he is given credit for.\n\nTrudeau is also highly motivated. His back is against the political wall, and he desperately needs a win to try and recover political strength. His Hail Mary opportunity may be presenting itself with a trade dispute, if he can negotiate it. The odds are tough for him considering the lack of affection shown by the incoming president. Trudeau seems to have a cat-like political nine lives, though, as he has managed to slip out of numerous challenges and scandals to stay in power for nearly a decade. He can never be counted out.\n\nIf an election presents itself, Pierre Poilievre will most likely become the prime minister with a massive majority government. He would be a fresh face and present a new adversary for Trump in trade negotiations. Poilievre is a blunt speaker and negotiates from a position of strength. When pressured by industry lobby groups, Poilievre slapped back and told them to speak to the people of Canada rather than him if they wanted their policy agenda considered. He made it clear the relationship dynamic won’t be one of deference to business groups from a Poilievre government. It was a bold approach to a lobby with clout.\n\nLikewise, Poilievre doesn’t take slights from the media lightly or quietly. When CTV released an unfairly edited video damaging to him, he didn’t just ask for a retraction, he demanded corrective measures lest the network lose all access to him. He got his demands. The clip of Poilievre eating an apple instead of answering loaded questions from a reporter infuriated some people with its arrogance, but it also signalled to the media he won’t play ball with biased media members. It’s the sort of approach Donald Trump respects.\n\nThe other variable Canadians must consider is an interim Liberal leader trying to negotiate with Trump while a leadership race is conducted. It’s about as weak a position as Canada could be put into. Poilievre could use the lame-duck period as an opportunity to present himself as the next leader and bypass the transitional period of leadership by approaching Trump. Much like Trump has all but assumed the presidency despite Biden still technically being in charge.\n\nThe coming year will be pivotal for Canada. Trade deals can set the tone for the economy for years and must be negotiated carefully, but it’s going to be tough to negotiate anything with the national leadership being in flux. Let’s hope that whether it’s Trudeau or Poilievre or a mix of both running the nation, they bring their best game to the table. The importance of these negotiations eclipses partisanship.","url":"https://www.theepochtimes.com/opinion/cory-morgan-how-will-canadas-us-negotiations-amid-tariff-threats-shape-up-in-2025-post-5779929","image":"https://img.theepochtimes.com/assets/uploads/2024/11/11/id5757964-GettyImages-1234594504-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Cory Morgan","authors":["Cory Morgan"],"language":"en","category":"politics","source_country":"us","sentiment":0.31},{"id":274978894,"title":"5 Expert-Recommended Solutions to Restore America’s Health and Trust","text":"America is confronting a growing health crisis. Chronic diseases affect more than half the population, and public trust in health institutions is low. Rising health care costs and system inefficiencies have compounded the challenges for families.\n\nHosted by The Heritage Foundation, the “Restoring American Wellness: How Can Policy Help Make America Healthy Again?” event brought together health leaders, including Sen. Ron Johnson (R-WI) and nutrition expert Nina Teicholz. The panel proposed reforms centered on revising dietary guidelines, improving transparency in public health institutions, and enhancing accountability measures.Top 5 Ways to Restore American HealthAt the core of the discussion were five critical areas identified by panelists as requiring urgent reforms to address the chronic disease epidemic and rebuild trust in America’s health systems.\n\nThe event explored health reform, with sessions focusing on policy issues and patient empowerment, which offered insights into what it will take to restore wellness in America, summarized through five key themes.Restore Trust in Public HealthThe panel began by addressing one of the most pressing issues: the erosion of trust in public health institutions. The panel participants pointed to missteps during the COVID-19 pandemic as significant factors contributing to this decline, emphasizing a lack of transparency and accountability.\n\nRelated StoriesTrump Picks Former CIA Official Ron Johnson as US Ambassador to Mexico12/11/2024Senate Republicans Create ‘Make America Healthy Again’ Caucus As RFK Jr. Continues Capitol Hill Tour12/20/2024\n\nThese concerns have also been raised in court rulings. On Dec. 6, U.S. district judge Mark Pittman ordered the U.S. Food and Drug Administration to disclose additional records related to Pfizer’s vaccine authorization, stating there was no “legitimate reason for concealing” this information now that the pandemic had ended.\n\nBroader trends illustrate a significant decline in trust in public health institutions. Only two in 10 Americans trust the federal government to do what is right most of the time, according to an April Pew Research survey.\n\nRedfield argued that a lack of transparency damages public confidence in science itself. Suppressing diverse viewpoints during the pandemic only deepened skepticism, saying, “We’ve lost trust in science,” he noted.Bring Back Evidence-Based ScienceBuilding on the theme of trust, the panel stressed the need to restore evidence-based science as the foundation of public health policy. They pointed to the pandemic as a time when key scientific principles were often disregarded. Dr. Martin Kulldorff, a Harvard epidemiologist, described policies like school closures and lockdowns as lacking rigorous scientific backing and open debate.\n\n“What we need to do is to get back to evidence-based medicine and the basic principles of public health,” Kulldorff said.Revitalize America’s DietShifting the focus to nutrition, the panel identified outdated dietary guidelines as a significant driver of America’s chronic disease crisis. Despite decades of official advice to reduce saturated fats and cholesterol, the prevalence of obesity and diabetes has continued to rise. A 2015 Open Heart study stated that the guidelines were not based on randomized controlled trials and lacked evidence to support claims of reducing heart disease or death. Panelists argued for a need to revise nutritional recommendations.\n\n“We can reverse Type 2 diabetes” in more than 50 percent of cases in as little as 10 weeks—just by changing what people eat, she said, citing clinical trials.Empower Patients and DoctorsA key message from the panel was the need to shift the health care system’s focus from managing symptoms to promoting wellness and addressing root causes of illness.\n\nBoth speakers highlighted the importance of patient education and informed consent. Huizenga said that helping patients understand their treatment options through accurate, evidence-based information empowers them to make choices that improve long-term health outcomes.Make Health A Shared Bi-Partisan GoalThe panel concluded that health reform provides an opportunity to transcend political divisions. Johnson cited the collaboration between President-elect Donald Trump and Robert F. Kennedy Jr. as a model of bipartisan cooperation and a way to “heal and unify a nation.”","url":"https://www.theepochtimes.com/health/five-point-plan-to-address-us-health-care-crisis-panel-5779294?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5779918-Heritatge-Foundation-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Sheramy Tsai","authors":["Sheramy Tsai"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":274978896,"title":"Elon Musk Says He Plans to Fund Moderate Democratic Primary Challengers","text":"In a flurry of X posts in recent days, the tech mogul said he was against a sweeping 1,547-page bill that would have extended government funding through March 2025, telling his 200-plus million followers on the platform to “Stop the steal of your tax dollars” while adding that any lawmaker who votes for the spending bill deserves to be voted out in the 2026 mid-term election.\n\nPresident-elect Donald Trump also expressed his opposition to the bill, which was ultimately voted down. A second version of the measure also failed to pass while House lawmakers passed a third version in bipartisan fashion on Dec. 20, sending it to the Senate and moving a crucial step closer towards averting a looming government shutdown that was set to take place at 12:01 a.m. ET on Dec. 21.\n\n“Can you imagine what the next two years are going to be like if every time that Congress works its will and then there’s a tweet? Or from an individual who has no official portfolio, who threatens members on the Republican side with a primary? And they succumb?” Neal said in a clip re-posted by the Wall Street Mav account on X.\n\nRelated StoriesRepublicans Float Elon Musk for Speaker Amid Funding Deal Collapse12/19/2024Musk Rebuts Claims That Terrorists Are Using Starlink in India12/18/2024\n\n“Forgot to mention that I’m also going to be funding moderate candidates in heavily Democrat districts, so that the country can get rid of those who don’t represent them,” Musk wrote in the Dec. 19 post on X.\n\nFollowing the failure of the 1,547-page bill to pass, a pared-down, Trump-backed proposal was put forward—and then voted down.\n\nHouse Speaker Mike Johnson (R-La.) announced on Friday morning that a third “Plan C” bill had been put together. It funds the government until mid-March and includes $110 billion in disaster aid, $30 billion in farm aid, and a one-year extension to the farm bill.","url":"https://www.theepochtimes.com/us/elon-musk-says-he-plans-to-fund-moderate-democratic-primary-challengers-5779944","image":"https://img.theepochtimes.com/assets/uploads/2024/12/03/id5769866-GettyImages-2184585949.jpg-LSedit-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Tom Ozimek","authors":["Tom Ozimek"],"language":"en","category":"politics","source_country":"us","sentiment":-0.182},{"id":274978890,"title":"Jelly Roll Responds to Criticisms After Meeting Donald Trump: ‘I’m Not Political’","text":"Jelly Roll has addressed the backlash he received after meeting President-elect Donald Trump at a UFC event last month.\n\nThe Grammy-nominated singer, whose legal name is Jason DeFord, discussed the interaction during a recent appearance on the “Dumb Blonde” podcast, hosted by his wife, Alyssa DeFord, 44.\n\n“Meeting President Trump was cool,” the 40-year-old singer said during the Dec. 16 episode.\n\n“Ultimately, I don’t really care about any blowback I get about it. The truth is, it was really cool to meet the president ... I was honored.”\n\nThe “Save Me” crooner can also be seen greeting Donald Trump Jr. and billionaire businessman Elon Musk at the UFC fight, which took place less than two weeks after the presidential election.\n\nSome social media users offered their support for the exchange online.\n\nOthers expressed their disapproval.\n\nSpeaking to his wife of eight years, Jelly Roll said he wouldn’t have missed the opportunity to meet a president-elect, regardless of their political affiliation.\n\n“If I would have gotten a call to go meet with Joe Biden at any point, I would have stopped what I was doing to go meet him. That’s the active president. I wouldn’t have cared what people thought, even what I think about his policies,” the musician said.\n\n“I don’t hide behind the ‘I’m not political’ stuff. I’m not political,” he continued.\n\n“I didn’t grow up in a voting culture. My father didn’t push voting on me. My mother didn’t push voting on me.”\n\nHe said that his parents did instill respect for what he called “the hardest job in the world.”\n\n“When I look back at my relationship with politics, like, we didn’t watch election night. I don’t have one memory of us, like, as a family, really [caring] who was getting elected.”\n\nThe rapper-turned-country star remarked that he has acquired much of the political knowledge he has today by listening to podcasts.\n\n“I watched quite a few hours of Trump podcasts, and I still didn’t have enough information about his policies, frankly, to be like, ‘I’m going to vote for this guy,’” he said.\n\nIn addition to Musk and Trump’s eldest son, the president-elect’s other cabinet picks were present at the UFC fight.\n\nVivek Ramaswamy, who was tapped alongside Musk to help lead the department of government efficiency, was in attendance, joined by Tulsi Gabbard, Trump’s nominee for director of national intelligence, and Robert F. Kennedy Jr., his pick for secretary of health and human services.\n\nJelly Roll said he thought it was “cool” that Kennedy had been selected to helm the federal health agency role.\n\n“I liked Robert Kennedy because he was really for addicts, and he was really for changing food, and he was really for like broken America, my people, our people,” the singer said.\n\n“He works the steps. He sponsors people. I mean, this dude’s a real recovery story.”\n\nJelly Roll, who released his latest album, “Beautifully Broken,” on Oct. 11, has been open about his past struggles with drug and alcohol addiction, including multiple arrests for drug-related offenses.","url":"https://www.theepochtimes.com/entertainment/jelly-roll-responds-to-criticisms-after-meeting-donald-trump-im-not-political-5779791","image":"https://img.theepochtimes.com/assets/uploads/2024/03/15/id5608046-GettyImages-2046393750-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Audrey Enjoli","authors":["Audrey Enjoli"],"language":"en","category":"politics","source_country":"us","sentiment":-0.052},{"id":274978892,"title":"What’s Ahead for Trudeau as He Faces Internal and External Pressure","text":"Pressure is mounting from all sides for Prime Minister Justin Trudeau, who faces a divided caucus, the NDP joining other opposition parties to vote no confidence, and the incoming president of the world’s superpower promising economy-crushing tariffs while dubbing him the “governor” of a 51st U.S. state.\n\nWhere can the prime minister take it from here?\n\nTrudeau has had to make decisions about his political future a number of times in recent months, following repeated setbacks in byelections, the ensuing mini-caucus revolt in October, and declining numbers in the polls. Each time he chose to stay on, saying he is best placed to lead the Liberal Party in the next election despite facing very challenging odds, counting on his past campaign successes.\n\nBut things escalated quickly this week.\n\nThe last days before the House of Commons holiday break were eventful, to say the least. The cascade of events started when Trudeau apparently miscalculated by telling his finance minister Chrystia Freeland on Dec. 13 that she would lose her post after delivering the fall economic statement on Dec. 16.\n\nFreeland instead pulled the pin before presenting the mini-budget. She made her resignation letter to Trudeau public for maximum damage, accusing him of using unspecified “costly political gimmicks” when the country should be making responsible decisions with budget and prepare for a trade war.\n\nCracks had already appeared in caucus prior to that, and they started showing in cabinet afterwards. On Dec. 19, when asked repeatedly by reporters on Dec. 19 where he stands on the prime minister’s leadership, Justice Minister Arif Virani did not directly say he supports Trudeau.\n\nAdditionally, following Freeland’s resignation, more Liberal MPs began to more openly call for Trudeau’s resignation, although the number willing to speak publicly so far is below the 23 who signed an internal letter in October asking him to leave.\n\nBy all accounts, there are still a sizeable number of MPs who support Trudeau, and no cabinet member other than Virani has shown signs of not being fully supportive.\n\nEarlier this week, Singh had said Trudeau should resign, and NDP House Leader Peter Julian had signalled that the party could pull its support for the government. With the Bloc Québécois pledging to bring down the government earlier this fall when it didn’t support two of the BQ’s bills, there’s no one left to support the minority Liberals.\n\nThe odds of a spring election have now increased, which moves up the timelines for the Liberals who want to go to the polls with a different leader.\n\nIf Trudeau cedes to pressure and resigns, an interim leader will be named as the party organizes a leadership race. This exercise, which usually takes many months, would have to be compressed into a shorter time frame to be ready for the election.\n\nMeanwhile, the messaging from Trudeau’s supporters is that Canada needs stability as Donald Trump will return to the White House on Jan. 20.\n\nThe work facing the government is also how newly promoted Minister of Democratic Institutions Ruby Sahota explained was the reason for Trudeau not speaking to reporters after the shuffle. The prime minister hasn’t held a press conference since Freeland’s resignation. He has also cancelled all of his traditional year-end interviews with media outlets, only talking briefly to reporters as he was walking out of a Dec. 20 cabinet meeting, saying he’s focused on the the issue of U.S. tariffs.\n\n“The prime minister is working hard to make sure that we lead this government and we deal with the pressing issues of today,” Sahota told reporters at Rideau Hall on Dec. 20.\n\nAn option Trudeau has if he chooses to stay on and wants to avoid a spring election would be to ask the Governor General to prorogue Parliament. Such a move at a time when his all-round popularity is not strong would likely result in backlash and not improve his electoral odds.\n\nTrudeau previously used the tool in 2020 at the time of the WE Charity scandal. Stephen Harper also prorogued Parliament twice.\n\nConservative Leader Pierre Poilievre is pushing to have a non-confidence vote immediately and is putting pressure on Singh to follow through with his non-confidence motion instead of waiting for the next House sitting in late January.\n\nPoilievre’s request likely falls outside the powers of the Governor General, who cannot establish the House of Commons agenda or recall MPs.","url":"https://www.theepochtimes.com/world/whats-ahead-for-trudeau-as-he-faces-internal-and-external-pressure-5779950","image":"https://img.theepochtimes.com/assets/uploads/2024/12/17/id5777976-CP173698452-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Noé Chartier","authors":["Noé Chartier"],"language":"en","source_country":"us","sentiment":-0.548},{"id":274978874,"title":"What’s Ahead for Trudeau as He Faces Internal and External Pressure","text":"Pressure is mounting from all sides for Prime Minister Justin Trudeau, who faces a divided caucus, the NDP joining other opposition parties to vote no confidence, and the incoming president of the world’s superpower promising economy-crushing tariffs while dubbing him the “governor” of a 51st U.S. state.\n\nWhere can the prime minister take it from here?\n\nTrudeau has had to make decisions about his political future a number of times in recent months, following repeated setbacks in byelections, the ensuing mini-caucus revolt in October, and declining numbers in the polls. Each time he chose to stay on, saying he is best placed to lead the Liberal Party in the next election despite facing very challenging odds, counting on his past campaign successes.\n\nBut things escalated quickly this week.\n\nThe last days before the House of Commons holiday break were eventful, to say the least. The cascade of events started when Trudeau apparently miscalculated by telling his finance minister Chrystia Freeland on Dec. 13 that she would lose her post after delivering the fall economic statement on Dec. 16.\n\nFreeland instead pulled the pin before presenting the mini-budget. She made her resignation letter to Trudeau public for maximum damage, accusing him of using unspecified “costly political gimmicks” when the country should be making responsible decisions with budget and prepare for a trade war.\n\nCracks had already appeared in caucus prior to that, and they started showing in cabinet afterwards. On Dec. 19, when asked repeatedly by reporters on Dec. 19 where he stands on the prime minister’s leadership, Justice Minister Arif Virani did not directly say he supports Trudeau.\n\nAdditionally, following Freeland’s resignation, more Liberal MPs began to more openly call for Trudeau’s resignation, although the number willing to speak publicly so far is below the 23 who signed an internal letter in October asking him to leave.\n\nBy all accounts, there are still a sizeable number of MPs who support Trudeau, and no cabinet member other than Virani has shown signs of not being fully supportive.\n\nEarlier this week, Singh had said Trudeau should resign, and NDP House Leader Peter Julian had signalled that the party could pull its support for the government. With the Bloc Québécois pledging to bring down the government earlier this fall when it didn’t support two of the BQ’s bills, there’s no one left to support the minority Liberals.\n\nThe odds of a spring election have now increased, which moves up the timelines for the Liberals who want to go to the polls with a different leader.\n\nIf Trudeau cedes to pressure and resigns, an interim leader will be named as the party organizes a leadership race. This exercise, which usually takes many months, would have to be compressed into a shorter time frame to be ready for the election.\n\nMeanwhile, the messaging from Trudeau’s supporters is that Canada needs stability as Donald Trump will return to the White House on Jan. 20.\n\nThe work facing the government is also how newly promoted Minister of Democratic Institutions Ruby Sahota explained was the reason for Trudeau not speaking to reporters after the shuffle. The prime minister hasn’t held a press conference since Freeland’s resignation. He has also cancelled all of his traditional year-end interviews with media outlets, only talking briefly to reporters as he was walking out of a Dec. 20 cabinet meeting, saying he’s focused on the the issue of U.S. tariffs.\n\n“The prime minister is working hard to make sure that we lead this government and we deal with the pressing issues of today,” Sahota told reporters at Rideau Hall on Dec. 20.\n\nAn option Trudeau has if he chooses to stay on and wants to avoid a spring election would be to ask the Governor General to prorogue Parliament. Such a move at a time when his all-round popularity is not strong would likely result in backlash and not improve his electoral odds.\n\nTrudeau previously used the tool in 2020 at the time of the WE Charity scandal. Stephen Harper also prorogued Parliament twice.\n\nConservative Leader Pierre Poilievre is pushing to have a non-confidence vote immediately and is putting pressure on Singh to follow through with his non-confidence motion instead of waiting for the next House sitting in late January.\n\nPoilievre’s request likely falls outside the powers of the Governor General, who cannot establish the House of Commons agenda or recall MPs.","url":"https://www.theepochtimes.com/world/whats-ahead-for-trudeau-as-he-faces-internal-and-external-pressure-5779950?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/17/id5777976-CP173698452-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Noé Chartier","authors":["Noé Chartier"],"language":"en","source_country":"us","sentiment":-0.548},{"id":274978876,"title":"Replay: AmericaFest 2024 Held by Turning Point USA","text":"AmericaFest 2024, an annual event held by conservative group Turning Point USA, takes place in Phoenix, Arizona, from Dec. 19 to Dec. 21.\n\nThe event on Dec. 19 features Charlie Kirk, Donald Trump Jr, Tucker Carlson, Ben Shapiro, Matt Walsh, among others.","url":"https://www.theepochtimes.com/epochtv/americafest-2024-held-by-turning-point-usa-2-post-5779889?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2023/12/26/id5553345-AMFEST2023.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Turning Point Usa","authors":["Turning Point Usa"],"language":"en","source_country":"us","sentiment":-0.311},{"id":274978862,"title":"House Passes Bill to Avert Government Shutdown on 3rd Attempt, Senate to Vote Ahead of Saturday Deadline | Capitol Report","text":"Dec-20-2024\n\nJust hours from a midnight government shutdown, the House passes a stopgap measure to temporarily fund federal operations and disaster aid—but the bill doesn’t include President-elect Donald Trump’s demands for a debt limit increase.\n\nWhat does the back-and-forth about the Trump-backed funding bill—which was rejected Thursday ni...","url":"https://www.theepochtimes.com/epochtv/house-passes-bill-to-avert-government-shutdown-on-3rd-attempt-senate-to-vote-ahead-of-saturday-deadline-capitol-report-5780043?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5780063-Captiol_1220_v1.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.008},{"id":274978858,"title":"Trump Nominates CatholicVote President Brian Burch for Ambassador to The Vatican","text":"President-elect Donald Trump has nominated CatholicVote president Brian Burch to be the U.S. Ambassador to The Holy See in Rome.\n\nDescribing Burch as “a devout Catholic,” Trump said, “He has received numerous awards and demonstrated exceptional leadership, helping build one of the largest Catholic advocacy groups in the Country.”\n\n“Brian loves his Church and the United States. He will make us all proud.”\n\nThe Holy See is the name of the governing body of the Catholic Church located in Vatican City, currently led by Pope Francis I.\n\nVatican City—an independent city-state within Rome, Italy—is the heart of a faith held by more than one billion people worldwide.\n\nBurch, a husband and father of nine children, accepted the nomination and thanked his wife, children, late father, and team at CatholicVote.org.\n\nFounded by Burch in 2005, CatholicVote.org is a nonprofit advocacy organization for Catholic lay people—those who are not priests, nuns, or hold another celibate-bound role in a religious order. Its website describes it as “a community of patriotic Americans who believe that the timeless truths of the Catholic faith are good for America.”\n\n“We make it our mission to inspire every Catholic in America to live out the truths of our faith in public life,” the website states.\n\nBurch has received the Cardinal John O’Connor Defender of the Faith Award from Legatus and the St. Juan Diego Leadership Award from The Catholic Professional Global Network.\n\nBurch’s appointment will require Senate approval.\n\nThe Epoch Times has reached out to the United States Conference of Catholic Bishops for comment on Trump’s nomination.\n\nThis decision followed President Joe Biden’s announcement that he will make one last trip to The Vatican in January before the end of his term.","url":"https://www.theepochtimes.com/us/trump-nominates-catholicvote-president-brian-burch-for-ambassador-to-the-vatican-5779845","image":"https://img.theepochtimes.com/assets/uploads/2024/09/20/id5727501-GettyImages-1722544817-0-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"T.j. Muscaro","authors":["T.j. Muscaro"],"language":"en","category":"politics","source_country":"us","sentiment":0.517},{"id":274978856,"title":"5 Expert-Recommended Solutions to Restore America’s Health and Trust","text":"America is confronting a growing health crisis. Chronic diseases affect more than half the population, and public trust in health institutions is low. Rising health care costs and system inefficiencies have compounded the challenges for families.\n\nHosted by The Heritage Foundation, the “Restoring American Wellness: How Can Policy Help Make America Healthy Again?” event brought together health leaders, including Sen. Ron Johnson (R-WI) and nutrition expert Nina Teicholz. The panel proposed reforms centered on revising dietary guidelines, improving transparency in public health institutions, and enhancing accountability measures.Top 5 Ways to Restore American HealthAt the core of the discussion were five critical areas identified by panelists as requiring urgent reforms to address the chronic disease epidemic and rebuild trust in America’s health systems.\n\nThe event explored health reform, with sessions focusing on policy issues and patient empowerment, which offered insights into what it will take to restore wellness in America, summarized through five key themes.Restore Trust in Public HealthThe panel began by addressing one of the most pressing issues: the erosion of trust in public health institutions. The panel participants pointed to missteps during the COVID-19 pandemic as significant factors contributing to this decline, emphasizing a lack of transparency and accountability.\n\nRelated StoriesTrump Picks Former CIA Official Ron Johnson as US Ambassador to Mexico12/11/2024Senate Republicans Create ‘Make America Healthy Again’ Caucus As RFK Jr. Continues Capitol Hill Tour12/20/2024\n\nThese concerns have also been raised in court rulings. On Dec. 6, U.S. district judge Mark Pittman ordered the U.S. Food and Drug Administration to disclose additional records related to Pfizer’s vaccine authorization, stating there was no “legitimate reason for concealing” this information now that the pandemic had ended.\n\nBroader trends illustrate a significant decline in trust in public health institutions. Only two in 10 Americans trust the federal government to do what is right most of the time, according to an April Pew Research survey.\n\nRedfield argued that a lack of transparency damages public confidence in science itself. Suppressing diverse viewpoints during the pandemic only deepened skepticism, saying, “We’ve lost trust in science,” he noted.Bring Back Evidence-Based ScienceBuilding on the theme of trust, the panel stressed the need to restore evidence-based science as the foundation of public health policy. They pointed to the pandemic as a time when key scientific principles were often disregarded. Dr. Martin Kulldorff, a Harvard epidemiologist, described policies like school closures and lockdowns as lacking rigorous scientific backing and open debate.\n\n“What we need to do is to get back to evidence-based medicine and the basic principles of public health,” Kulldorff said.Revitalize America’s DietShifting the focus to nutrition, the panel identified outdated dietary guidelines as a significant driver of America’s chronic disease crisis. Despite decades of official advice to reduce saturated fats and cholesterol, the prevalence of obesity and diabetes has continued to rise. A 2015 Open Heart study stated that the guidelines were not based on randomized controlled trials and lacked evidence to support claims of reducing heart disease or death. Panelists argued for a need to revise nutritional recommendations.\n\n“We can reverse Type 2 diabetes” in more than 50 percent of cases in as little as 10 weeks—just by changing what people eat, she said, citing clinical trials.Empower Patients and DoctorsA key message from the panel was the need to shift the health care system’s focus from managing symptoms to promoting wellness and addressing root causes of illness.\n\nBoth speakers highlighted the importance of patient education and informed consent. Huizenga said that helping patients understand their treatment options through accurate, evidence-based information empowers them to make choices that improve long-term health outcomes.Make Health A Shared Bi-Partisan GoalThe panel concluded that health reform provides an opportunity to transcend political divisions. Johnson cited the collaboration between President-elect Donald Trump and Robert F. Kennedy Jr. as a model of bipartisan cooperation and a way to “heal and unify a nation.”","url":"https://www.theepochtimes.com/health/five-point-plan-to-address-us-health-care-crisis-panel-5779294","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5779918-Heritatge-Foundation-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Sheramy Tsai","authors":["Sheramy Tsai"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":274978850,"title":"Cory Morgan: How Will Canada’s US Negotiations Amid Tariff Threats Shape Up in 2025?","text":"The Canadian crystal ball is as muddy as it gets in predicting who will lead Canada through 2025.\n\nOne certainty, though, is that a top priority for Canada’s prime minister will be dealing with incoming U.S. President Donald Trump firmly while managing to avoid a trade war. Who is better placed to negotiate with the new American administration? Or perhaps the question is, who will be leading Canada through 2025—Trudeau, an interim Liberal leader, or Poilievre (if an early election is called)?\n\nDonald Trump has never made a secret of his support for trade protectionism. He has always campaigned on an America-first platform, and imposing tariffs upon incoming goods has been his preferred tactic. When Trump threatens tariffs as high as 25 percent across the board on Canadian trade goods, he must be taken seriously.\n\nTrump is also a master negotiator who knows how to put himself in a position of strength. Although he has not formally assumed the presidency, he has deftly managed to completely overshadow the outgoing Biden administration and dominate the news cycle in Canada. He knows how to stay in the headlines and manipulate public opinion on both sides of the border. Trump’s teasing of Trudeau through social media isn’t a form of casual entertainment for himself, though he does appear to take pleasure from it. His social media postings are calculated to set Canada on its heels and keep Canadian leaders divided and confused about how to react to him.\n\nThough his political future is tenuous at best, Justin Trudeau is still the most likely to be sitting in the prime minister’s chair when Trump is inaugurated on Jan. 20. Despite the pressure he is now facing, Trudeau has managed to stay in power for nine years.\n\nWhen negotiating with provinces on federal policies, Trudeau has sometimes used manipulative tactics, and he has been successful many times. Like Trump, Trudeau often bypasses local governments and appeals to the public on policy issues. He dangles federal money for programs such as dental care and daycare, but always attaches strings to them. Provincial leaders then find themselves mousetrapped as they look heartless and overly partisan if they refuse to play ball with Trudeau. It’s an infuriating strategy, but an effective one indicating Trudeau’s governing skills may be more nuanced than he is given credit for.\n\nTrudeau is also highly motivated. His back is against the political wall, and he desperately needs a win to try and recover political strength. His Hail Mary opportunity may be presenting itself with a trade dispute, if he can negotiate it. The odds are tough for him considering the lack of affection shown by the incoming president. Trudeau seems to have a cat-like political nine lives, though, as he has managed to slip out of numerous challenges and scandals to stay in power for nearly a decade. He can never be counted out.\n\nIf an election presents itself, Pierre Poilievre will most likely become the prime minister with a massive majority government. He would be a fresh face and present a new adversary for Trump in trade negotiations. Poilievre is a blunt speaker and negotiates from a position of strength. When pressured by industry lobby groups, Poilievre slapped back and told them to speak to the people of Canada rather than him if they wanted their policy agenda considered. He made it clear the relationship dynamic won’t be one of deference to business groups from a Poilievre government. It was a bold approach to a lobby with clout.\n\nLikewise, Poilievre doesn’t take slights from the media lightly or quietly. When CTV released an unfairly edited video damaging to him, he didn’t just ask for a retraction, he demanded corrective measures lest the network lose all access to him. He got his demands. The clip of Poilievre eating an apple instead of answering loaded questions from a reporter infuriated some people with its arrogance, but it also signalled to the media he won’t play ball with biased media members. It’s the sort of approach Donald Trump respects.\n\nThe other variable Canadians must consider is an interim Liberal leader trying to negotiate with Trump while a leadership race is conducted. It’s about as weak a position as Canada could be put into. Poilievre could use the lame-duck period as an opportunity to present himself as the next leader and bypass the transitional period of leadership by approaching Trump. Much like Trump has all but assumed the presidency despite Biden still technically being in charge.\n\nThe coming year will be pivotal for Canada. Trade deals can set the tone for the economy for years and must be negotiated carefully, but it’s going to be tough to negotiate anything with the national leadership being in flux. Let’s hope that whether it’s Trudeau or Poilievre or a mix of both running the nation, they bring their best game to the table. The importance of these negotiations eclipses partisanship.","url":"https://www.theepochtimes.com/opinion/cory-morgan-how-will-canadas-us-negotiations-amid-tariff-threats-shape-up-in-2025-post-5779929?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/11/11/id5757964-GettyImages-1234594504-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Cory Morgan","authors":["Cory Morgan"],"language":"en","category":"politics","source_country":"us","sentiment":0.31},{"id":274978842,"title":"Replay: AmericaFest 2024 Held by Turning Point USA","text":"AmericaFest 2024, an annual event held by conservative group Turning Point USA, takes place in Phoenix, Arizona, from Dec. 19 to Dec. 21.\n\nThe event on Dec. 19 features Charlie Kirk, Donald Trump Jr, Tucker Carlson, Ben Shapiro, Matt Walsh, among others.","url":"https://www.theepochtimes.com/epochtv/americafest-2024-held-by-turning-point-usa-2-post-5779889","image":"https://img.theepochtimes.com/assets/uploads/2023/12/26/id5553345-AMFEST2023.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Turning Point Usa","authors":["Turning Point Usa"],"language":"en","source_country":"us","sentiment":-0.311},{"id":274978962,"title":"US Military Bases, Sensitive Sites Targeted by Drones for Years","text":"The Federal Aviation Administration (FAA) announced on Dec. 17 that it is banning drone flights over 22 critical infrastructure locations in response to the incidents, though the White House maintains that there is no credible threat to public safety.\n\nIn all, the FBI said it has received more than 5,000 reports of drone sightings in the last month; of which the agency said about 100 warrant further investigation.\n\nBelow is a timeline of the most notable confirmed sightings.Dec. 16 - Hill Air Force Base, UtahSeveral drone sightings are confirmed at Hill Air Force Base in Utah on Dec. 16. One drone flies close to the fuel storage at the facility.\n\nA spokesperson for the base told local media that the base is undertaking measures to safeguard personnel, equipment, and infrastructure but that the incidents have not impacted operation.\n\nF-35A's of Hill Air Force Base's 388th and 419th fighter wings land and taxi after a training exercise at Hill Air Force Base, Utah, on Nov. 19, 2018. George Frey/Getty Images\n\nDec. 13–17 - Wright-Patterson Air Force Base, Ohio\n\nPremium PicksFAA Issues Temporary Flight Ban on Drones in Areas Across New JerseyIn Secret Meeting, Xi Jinping Ordered New Strategy to Attack Falun Gong Globally\n\nWhite House National Security Council spokesperson John Kirby tells reporters that drones had penetrated the restricted airspace around several military complexes, including Wright-Patterson Air Force Base in Ohio, which houses the Air and Space Forces’ national intelligence centers.\n\nThe number of drones, their type, and formation fluctuated from Dec. 13 through 17, a base spokesperson tells Stars and Stripes, a Department of Defense-managed publication.\n\nNo damage or threat is reported, but at least one incident forces the facility to close its airfields for four hours.Dec. 14 - Logan International Airport, MassachusettsLocal police in Boston arrest two men for allegedly operating a drone “dangerously close” to Logan International Airport.\n\nAn aerial view of Logan Aiport in Boston on Sept. 9, 2012. David Wilson/CC\n\nDec. 13 - Stewart International Airport, New YorkThe Stewart International Airport is forced to close its runways for an hour while an unidentified drone flies around the facility.\n\nNew York Gov. Kathy Hochul urges Congress to pass a bill that would give state authorities the legal authority to shoot drones down, saying that a “state-of-the-art drone detection system” loaned out by the federal government is not enough.Dec. 9–15 - Camp Pendleton, CaliforniaUnidentified drones violated the restricted airspace six times in a six-day period at Camp Pendleton, one of the U.S. Marine Corps’ largest bases and a center of its training activities.\n\nA view of the main entrance to Camp Pendleton in Oceanside, Calif., on July 26, 2019. Sandy Huffaker/Getty Images\n\nDec. 3 - Ramstein Air Base, GermanyUnauthorized drones fly over the sprawling Ramstein Air Base in western Germany. The facility is a major hub for the U.S. military and houses NATO’s central command for all allied air and space forces.\n\nLocal police tell Stars and Stripes that the drones had previously been tracked flying over the site of a major multinational chemical corporation, and anonymous sources have said the drones were not of a type associated with hobby use.\n\nRamstein Air Base in Germany. U.S. Army Corps of Engineers photo by Justin Ward/CC BY 2.0\n\nNov. 30 - Vandenberg Space Force Base, CaliforniaChinese national Yinpiao Zhou allegedly flies an unregistered drone over Vandenberg Space Force Base in California.\n\nOn Dec. 6, federal agents arrest Zhou at San Francisco International Airport as he prepared to board a China-bound flight, according to the U.S. Attorney’s Office in Los Angeles.\n\nA United Launch Alliance Delta IV-Heavy rocket carrying a National Reconnaissance Office payload launches from Space Launch Complex-6 at Vandenberg Air Force Base, Calif., on Aug. 28, 2013. Public Domain\n\nNov. 22 - Trump National Golf Club, New JerseyThe FAA closes the airspace over the Trump National Golf Club Bedminster after reports of several drones and a fixed-winged aircraft flying along the 70-mile Raritan River in Somerset and Middlesex counties in New Jersey.\n\nPresident-elect Donald Trump, who owns the golf course and maintains a home in nearby Bedminster, later said he had canceled a trip to the area because of the continued presence of the drones.\n\nThe evening sky and points of light near Lebanon Township, N.J., on Dec. 5, 2024. Trisha Bushey via AP\n\nNov. 20 - RAF Lakenheath, UKDrones are tracked around three separate military bases in the UK: Royal Air Force Lakenheath, Mildenhall, Feltwell, and Fairford.\n\nAn aerial view of a miltary facility at R.A.F. Lakenheath in the UK on Aug. 25, 2017. R.A.F. Lakenheath and Thetford Forest: aerial 2017 by Chris/CC BY-SA 2.0\n\nNov. 13 - Picatinny Arsenal, New JerseyDrones violated the airspace of Picatinny Arsenal at least 11 times in November, a local commander says. The facility serves as the U.S. Army’s primary center for arms and munitions research and development.\n\n“While the source and cause of these aircraft operating in our area remain unknown, we can confirm that they are not the result of any Picatinny Arsenal-related activities,” Lt. Col. Craig Bonham said in a statement shared with The Epoch Times.Aug. 20 - Air Force Plant 42, CaliforniaMilitary officials confirm to online news site The War Zone that numerous unidentified drones were flying over Plant 42 near Palmdale, California.\n\nAn aerial view of United States Air Force Plant 42 near Palmdale, Calif. Public Domain\n\n2023 - Langley Air Force Base, VirginiaAn unidentified swarm of drones reportedly fly in restricted airspace around Langley Air Force Base over the course of several nights.\n\nFengyun Shi, a Chinese student at the University of Minnesota, is later arrested before boarding a flight to China. Shi pleaded guilty to flying his drone over a classified naval installation to photograph U.S. military vessels, according to local media.\n\nAn aerial view of Langley Air Force Base in Hampton, Virginia, on Dec. 3, 2011. Public Domain\n\n2020 - Colorado and NebraskaA swarm of large drones is sighted in the skies over rural Colorado and Nebraska for several weeks, near the storage site of some of the nation’s Minuteman III nuclear missiles.\n\nSimilarly, the FBI, FAA, and local authorities never publicly identify who was operating the drones and suggest most of the sightings were attributable to hobby drones and people misidentifying planets and stars as aircraft.2020 - Joint Base Andrews, MarylandFederal authorities launch an investigation into a report that a drone came within close range of then-President Donald Trump’s aircraft while he was traveling to Maryland from New Jersey.\n\nFederal officials never publicly identify the operator of the drone nor publicly acknowledge the conclusion of the investigation.2019 - US Navy Group, CaliforniaGroups of large drones are reported off the coast of California, stalking and surveilling several Navy and Coast Guard ships, including the technically advanced missile destroyer USS Zumwalt.\n\nAircraft carrier the USS Theodore Roosevelt (CVN 71) leaves its San Diego homeport on Jan. 17, 2020. U.S. Navy via Getty Images\n\nInvestigative reports published by The War Zone in 2021 and 2022, however, revealed that ship logs from one of the Navy vessels involved had identified the source of the drones as the MV Bass Strait, a Hong Kong-flagged bulk carrier.Drones Present Weakness in US SecurityThough government officials have said the drones pose no imminent threat to public safety, the lack of a response has raised concerns that the United States is unprepared to deter the use of drones for espionage or in the event of attacks on its military bases.\n\nHomeland Security Secretary Alejandro Mayorkas testified earlier this week that the federal government doesn’t have the legal authority to engage drones that are not within restricted airspace and suggested that local law enforcement should take the lead “under federal supervision.”\n\nU.S. Homeland Security Secretary Alejandro Mayorkas speaks during the daily briefing in the Brady Briefing Room of the White House on July 15, 2024. Samuel Corum/AFP via Getty Images\n\nThe chairman of the House Foreign Affairs Committee, however, has warned that some drones that were spotted flying near military installations could be “adversarial” and deployed by the Chinese Communist Party (CCP).","url":"https://www.theepochtimes.com/article/drone-sightings-at-us-military-facilities-sensitive-sites-a-timeline-5779234","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5780016-Drone-Timeline-6-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Andrew Thornebrooke","authors":["Andrew Thornebrooke"],"language":"en","source_country":"us","sentiment":0},{"id":274978958,"title":"RFK Jr.’s Food Fight: Can He Change America’s Diet?","text":"With the new dietary guidelines for Americans still being finalized, President-elect Donald Trump has urged Robert F. Kennedy Jr., nominee for secretary of the Department of Health and Human Services (HHS), to “go wild on the food,” signaling the potential for major shifts in national nutrition policy.\n\n​​But the guidelines don’t appear out of thin air. Behind them is the DGAC, a panel of nutrition scientists and public health experts. Over two years, the committee reviews research, gathers public input, and compiles a report that informs the final recommendations.\n\nThe DGAC’s role is advisory.\n\n“The Dietary Guidelines Advisory Committee reviews the science and makes recommendations,” Richard Mattes, a nutrition scientist and member of the 2020 DGAC panel, told The Epoch Times. Its report goes to the HHS and the U.S. Department of Agriculture (USDA), which finalize the guidelines.\n\nAmericans are also advised to limit overall red meat consumption. For those eating 2,200 or more calories daily, the DGAC suggests further cutting weekly meat, poultry, and egg intake by an additional 3.5 to 4 ounces compared with previous recommendations—roughly the size of a deck of cards or the palm of a hand.\n\n“This advice does not consider that plant-based proteins are not as complete as animal proteins—and therefore, not as digestible to people,” Nina Teicholz, a nutrition expert and author, wrote on her Substack, Unsettled Science. She added that plant proteins often contain extra carbohydrates, which could complicate efforts to combat obesity and diabetes.\n\nThe committee recommends six daily servings of grains, limiting refined grains to three. Despite health concerns about refined carbohydrates, the DGAC retained them in the guidelines for their nutrients such as iron and folate.\n\nTeicholz questioned this decision, pointing out that red meat, a natural source of bioavailable heme iron and folate, is simultaneously being reduced.\n\nThe committee emphasizes a diet centered on whole foods—vegetables, fruits, legumes, whole grains, nuts, and fish—while also recommending water as the primary beverage and continuing to suggest low-fat or nonfat dairy products.\n\nAlthough the food pyramid was officially retired in 2011 and replaced by MyPlate, its legacy persists, as the broad messaging it promoted about grains, fats, and sugars continues to influence dietary habits.\n\n“Even though it meant to encourage consumption of whole grains and small portion sizes, the pyramid’s putting grains as the foundation of a healthy diet inadvertently induced the food industry to vigorously market highly processed grain products,” Marion Nestle, a food policy expert and former DGAC member, told The Epoch Times in an email.\n\n“The problem with the food pyramid is not the emphasis on grains and grain products,” Monteiro told The Epoch Times in an email. “It is the failure to distinguish whole grains from processed and ultra-processed products.”\n\nWhile refined carbohydrates, such as sugars and sweets, are placed at the top to be consumed sparingly, the pyramid’s wide base for grains does not differentiate between whole and refined options. Monteiro added that this oversight extends to other categories such as meat, dairy, and fruits and persists in newer models, such as MyPlate, that also overlook food processing.\n\n“The guidelines were based on weak science—namely, epidemiological studies,” Teicholz told The Epoch Times. “With these studies, it’s easy to get a desired result.”\n\nThe DGAC declined to make specific recommendations against ultra-processed foods, citing limited research.\n\n“To set national policy, you need robust evidence,” Mattes said. “Right now, there’s only one small randomized controlled trial on this issue; it’s just not enough.”\n\nTeicholz highlighted the challenges of focusing on ultra-processed foods, calling the term “poorly defined.” She cautioned that sweeping changes, such as removing processed meats—a key protein source in school lunches—based on limited science could backfire without addressing the more pressing problems of excess sugars and refined grains.\n\nCountries such as Brazil, France, and Israel have adopted dietary guidelines that explicitly advise reducing ultra-processed foods. Advocates view these policies as models for the United States to follow in combating diet-related chronic diseases. However, the DGAC’s cautious stance indicates the United States may lag behind in adopting similar measures.\n\nKennedy has been vocal about addressing what he calls the “corporate capture” of federal health agencies.\n\nHe pledged to overhaul the system, adding, “We’re going to remove conflicts of interest from the USDA dietary panels and commissions.”\n\n“We don’t follow the dietary guidelines well at all,” Mattes said.\n\n“Americans have made pretty large shifts in all food groups in the way that we’ve been advised,” she said. She also questioned the Healthy Eating Index’s accuracy, noting that it offers only snapshots in time and may overlook broader historical trends.\n\nAlthough many Americans don’t follow the guidelines perfectly, the influence of the guidelines on food production, marketing, and public perception has shaped what’s widely available and affordable. Trends such as the rise of low-fat diets and increased carbohydrate consumption reflect their broader impact.\n\nAnother concern is systemic accountability.\n\n“Agencies like the USDA have little accountability for the chronic diseases linked to the dietary advice they give,” Teicholz said, adding that health care systems ultimately bear the cost of poor nutrition.\n\nComplexity also hampers the guidelines’ effectiveness. With some editions exceeding 900 pages, they can be challenging to translate into actionable advice.\n\n“The longer the guidelines have become, the worse our health outcomes are,” Mattes said, noting that improving adherence requires practical, relatable advice.\n\nNestle said she believes Kennedy has significant influence over the guidelines, as their finalization rests with HHS and USDA leadership.\n\n“The Secretaries appoint a joint committee to do the writing, and Congress can also weigh in,” she wrote in an email to The Epoch Times, adding that Kennedy would work with the USDA secretary to shape the direction of the guidelines.\n\nHowever, Nestle cautioned that food industry lobbying and the demand for unreasonable levels of evidence have long obstructed reform efforts. She acknowledged the difficulty of relying on incomplete or evolving science to drive policy change.\n\nNestle admitted uncertainty about how Kennedy will approach his role.\n\n“I have absolutely no idea what he might do if appointed,” she said, noting the slow pace and resistance often accompanying federal processes.\n\nOn whether Kennedy’s ideas align with evidence-based solutions, she offered a nuanced view. “Some are, and some are not,” she wrote. “My plan is to support the ones that have some science behind them, and oppose the ones that don’t.”\n\nKennedy’s exact plans for the guidelines remain unclear. His outspoken criticism of corporate influence suggests he may push for significant reform. Still, it remains to be seen whether he will work within the existing framework or chart an entirely new course.\n\nWhile Kennedy’s reforms could take years to materialize, there are steps individuals can take now to improve their diets and reduce disease risk. Focusing on whole, minimally processed foods while cutting back on sugary drinks and ultra-processed snacks is a practical starting point. Small, consistent changes such as cooking more meals at home or swapping sodas for water can significantly reduce diet-related health risks.\n\nThe 2025 Dietary Guidelines may be a critical measure of Kennedy’s ability to influence federal nutrition policy. Will he succeed in reshaping federal nutrition policy and fulfilling his promise to make America healthier, or will he be constrained by the entrenched forces he seeks to challenge?\n\nAs Teicholz put it in her Substack article, “The health of our nation depends on it.”","url":"https://www.theepochtimes.com/health/rfk-jr-s-food-fight-can-he-change-americas-diet-5766696?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2025/12/09/id5773472-RFK_blue_new-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Sheramy Tsai","authors":["Sheramy Tsai"],"language":"en","category":"politics","source_country":"us","sentiment":0.149},{"id":274978960,"title":"US Military Bases, Sensitive Sites Targeted by Drones for Years","text":"The Federal Aviation Administration (FAA) announced on Dec. 17 that it is banning drone flights over 22 critical infrastructure locations in response to the incidents, though the White House maintains that there is no credible threat to public safety.\n\nIn all, the FBI said it has received more than 5,000 reports of drone sightings in the last month; of which the agency said about 100 warrant further investigation.\n\nBelow is a timeline of the most notable confirmed sightings.Dec. 16 - Hill Air Force Base, UtahSeveral drone sightings are confirmed at Hill Air Force Base in Utah on Dec. 16. One drone flies close to the fuel storage at the facility.\n\nA spokesperson for the base told local media that the base is undertaking measures to safeguard personnel, equipment, and infrastructure but that the incidents have not impacted operation.\n\nF-35A's of Hill Air Force Base's 388th and 419th fighter wings land and taxi after a training exercise at Hill Air Force Base, Utah, on Nov. 19, 2018. George Frey/Getty Images\n\nDec. 13–17 - Wright-Patterson Air Force Base, Ohio\n\nPremium PicksFAA Issues Temporary Flight Ban on Drones in Areas Across New JerseyIn Secret Meeting, Xi Jinping Ordered New Strategy to Attack Falun Gong Globally\n\nWhite House National Security Council spokesperson John Kirby tells reporters that drones had penetrated the restricted airspace around several military complexes, including Wright-Patterson Air Force Base in Ohio, which houses the Air and Space Forces’ national intelligence centers.\n\nThe number of drones, their type, and formation fluctuated from Dec. 13 through 17, a base spokesperson tells Stars and Stripes, a Department of Defense-managed publication.\n\nNo damage or threat is reported, but at least one incident forces the facility to close its airfields for four hours.Dec. 14 - Logan International Airport, MassachusettsLocal police in Boston arrest two men for allegedly operating a drone “dangerously close” to Logan International Airport.\n\nAn aerial view of Logan Aiport in Boston on Sept. 9, 2012. David Wilson/CC\n\nDec. 13 - Stewart International Airport, New YorkThe Stewart International Airport is forced to close its runways for an hour while an unidentified drone flies around the facility.\n\nNew York Gov. Kathy Hochul urges Congress to pass a bill that would give state authorities the legal authority to shoot drones down, saying that a “state-of-the-art drone detection system” loaned out by the federal government is not enough.Dec. 9–15 - Camp Pendleton, CaliforniaUnidentified drones violated the restricted airspace six times in a six-day period at Camp Pendleton, one of the U.S. Marine Corps’ largest bases and a center of its training activities.\n\nA view of the main entrance to Camp Pendleton in Oceanside, Calif., on July 26, 2019. Sandy Huffaker/Getty Images\n\nDec. 3 - Ramstein Air Base, GermanyUnauthorized drones fly over the sprawling Ramstein Air Base in western Germany. The facility is a major hub for the U.S. military and houses NATO’s central command for all allied air and space forces.\n\nLocal police tell Stars and Stripes that the drones had previously been tracked flying over the site of a major multinational chemical corporation, and anonymous sources have said the drones were not of a type associated with hobby use.\n\nRamstein Air Base in Germany. U.S. Army Corps of Engineers photo by Justin Ward/CC BY 2.0\n\nNov. 30 - Vandenberg Space Force Base, CaliforniaChinese national Yinpiao Zhou allegedly flies an unregistered drone over Vandenberg Space Force Base in California.\n\nOn Dec. 6, federal agents arrest Zhou at San Francisco International Airport as he prepared to board a China-bound flight, according to the U.S. Attorney’s Office in Los Angeles.\n\nA United Launch Alliance Delta IV-Heavy rocket carrying a National Reconnaissance Office payload launches from Space Launch Complex-6 at Vandenberg Air Force Base, Calif., on Aug. 28, 2013. Public Domain\n\nNov. 22 - Trump National Golf Club, New JerseyThe FAA closes the airspace over the Trump National Golf Club Bedminster after reports of several drones and a fixed-winged aircraft flying along the 70-mile Raritan River in Somerset and Middlesex counties in New Jersey.\n\nPresident-elect Donald Trump, who owns the golf course and maintains a home in nearby Bedminster, later said he had canceled a trip to the area because of the continued presence of the drones.\n\nThe evening sky and points of light near Lebanon Township, N.J., on Dec. 5, 2024. Trisha Bushey via AP\n\nNov. 20 - RAF Lakenheath, UKDrones are tracked around three separate military bases in the UK: Royal Air Force Lakenheath, Mildenhall, Feltwell, and Fairford.\n\nAn aerial view of a miltary facility at R.A.F. Lakenheath in the UK on Aug. 25, 2017. R.A.F. Lakenheath and Thetford Forest: aerial 2017 by Chris/CC BY-SA 2.0\n\nNov. 13 - Picatinny Arsenal, New JerseyDrones violated the airspace of Picatinny Arsenal at least 11 times in November, a local commander says. The facility serves as the U.S. Army’s primary center for arms and munitions research and development.\n\n“While the source and cause of these aircraft operating in our area remain unknown, we can confirm that they are not the result of any Picatinny Arsenal-related activities,” Lt. Col. Craig Bonham said in a statement shared with The Epoch Times.Aug. 20 - Air Force Plant 42, CaliforniaMilitary officials confirm to online news site The War Zone that numerous unidentified drones were flying over Plant 42 near Palmdale, California.\n\nAn aerial view of United States Air Force Plant 42 near Palmdale, Calif. Public Domain\n\n2023 - Langley Air Force Base, VirginiaAn unidentified swarm of drones reportedly fly in restricted airspace around Langley Air Force Base over the course of several nights.\n\nFengyun Shi, a Chinese student at the University of Minnesota, is later arrested before boarding a flight to China. Shi pleaded guilty to flying his drone over a classified naval installation to photograph U.S. military vessels, according to local media.\n\nAn aerial view of Langley Air Force Base in Hampton, Virginia, on Dec. 3, 2011. Public Domain\n\n2020 - Colorado and NebraskaA swarm of large drones is sighted in the skies over rural Colorado and Nebraska for several weeks, near the storage site of some of the nation’s Minuteman III nuclear missiles.\n\nSimilarly, the FBI, FAA, and local authorities never publicly identify who was operating the drones and suggest most of the sightings were attributable to hobby drones and people misidentifying planets and stars as aircraft.2020 - Joint Base Andrews, MarylandFederal authorities launch an investigation into a report that a drone came within close range of then-President Donald Trump’s aircraft while he was traveling to Maryland from New Jersey.\n\nFederal officials never publicly identify the operator of the drone nor publicly acknowledge the conclusion of the investigation.2019 - US Navy Group, CaliforniaGroups of large drones are reported off the coast of California, stalking and surveilling several Navy and Coast Guard ships, including the technically advanced missile destroyer USS Zumwalt.\n\nAircraft carrier the USS Theodore Roosevelt (CVN 71) leaves its San Diego homeport on Jan. 17, 2020. U.S. Navy via Getty Images\n\nInvestigative reports published by The War Zone in 2021 and 2022, however, revealed that ship logs from one of the Navy vessels involved had identified the source of the drones as the MV Bass Strait, a Hong Kong-flagged bulk carrier.Drones Present Weakness in US SecurityThough government officials have said the drones pose no imminent threat to public safety, the lack of a response has raised concerns that the United States is unprepared to deter the use of drones for espionage or in the event of attacks on its military bases.\n\nHomeland Security Secretary Alejandro Mayorkas testified earlier this week that the federal government doesn’t have the legal authority to engage drones that are not within restricted airspace and suggested that local law enforcement should take the lead “under federal supervision.”\n\nU.S. Homeland Security Secretary Alejandro Mayorkas speaks during the daily briefing in the Brady Briefing Room of the White House on July 15, 2024. Samuel Corum/AFP via Getty Images\n\nThe chairman of the House Foreign Affairs Committee, however, has warned that some drones that were spotted flying near military installations could be “adversarial” and deployed by the Chinese Communist Party (CCP).","url":"https://www.theepochtimes.com/article/drone-sightings-at-us-military-facilities-sensitive-sites-a-timeline-5779234?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2024/12/20/id5780016-Drone-Timeline-6-300x180.jpg","video":null,"publish_date":"2024-12-21 00:37:23","author":"Andrew Thornebrooke","authors":["Andrew Thornebrooke"],"language":"en","source_country":"us","sentiment":0},{"id":274981596,"title":"What’s next for the man charged with killing UnitedHealthcare’s CEO?","text":"The man accused of gunning down United Healthcare’s CEO outside a Manhattan hotel is now jailed in New York, awaiting arraignment Monday on a state murder indictment after he was returned to the city in dramatic fashion to face charges in multiple courts.Shackled and wearing an orange prison jumpsuit, 26-year-old Luigi Mangione was escorted Thursday by heavily armed police officers and whisked by air from Pennsylvania to Manhattan, where he appeared in a packed courtroom on federal charges that could bring the death penalty.The Ivy League graduate, who prosecutors say inveighed against the health insurance industry and wealthy executives in his writings, was not required to enter a plea to federal charges of murder, stalking and firearms charges in the Dec. 4 killing of Brian Thompson. The state indictment charges Mangione with murder as a terrorist act.Here’s what’s next in the cases:Mangione is being held without bail at Metropolitan Detention Center, the same federal jail where hip-hop mogul Sean “Diddy” Combs and cryptocurrency fraudster Sam Bankman-Fried are currently detained.The notorious Brooklyn facility, the only federal lockup in the city, has been variously described as “hell on earth” and an “ongoing tragedy” because of deplorable conditions, rampant violence, dysfunction and multiple deaths.The federal Bureau of Prisons has said it is increasing staffing to make up for staggering shortfalls, but conditions have been so stark at the jail, which houses about 1,100 inmates, that some judges have refused to send people there.Besides the federal charges filed Thursday, Mangione must still answer to a state murder indictment.Manhattan District Attorney Alvin Bragg’s office charged Mangione with murder as an act of terrorism, which carries a maximum sentence of life in prison without parole. He is also charged with state weapons offenses and possession of a fake ID.Prosecutors have said the two cases will proceed on parallel tracks, with the state charges expected to go to trial first.Mangione’s lawyer, Karen Friedman Agnifilo, argued in court Thursday that the terrorism allegations in the state case and stalking charges in the federal complaint appear to be at odds.“Those are two completely different theories,” she said. “These seem like different cases.”The U.S. Supreme Court in 2019 upheld a longstanding constitutional rule allowing state and federal governments to prosecute someone for the same crime.RELATED STORY | Appearing in NY court, CEO murder suspect Luigi Mangione doesn't seek bailMangione is set to be arraigned Monday in Manhattan on the state indictment, according to Bragg's office.The University of Pennsylvania alum, who hailed from a prominent Maryland family and had also lived in Hawaii, had been expected to be arraigned Thursday on the state charges before the federal charges preempted that appearance.In the federal case, Mangione could next return to court for a bail hearing or for a preliminary hearing if prosecutors don’t obtain a grand jury indictment by mid-January.New York effectively effectively abolished its death penalty by 2007 and the last execution in the state was in 1963. But the federal death penalty remains in effect.The federal complaint filed against Mangione includes a count of murder by firearm, which carries the possibility of the death penalty if he is convicted.Federal prosecutors have not said if they will seek the death penalty. That decision will be made in coming months by Justice Department officials in Washington, likely after President-elect Donald Trump is sworn in on Jan. 20.President Joe Biden's administration put a moratorium on federal executions soon after he took office in 2021, but that hasn't stopped federal prosecutors from seeking the death penalty.In contrast, Trump's administration carried out 13 executions in the last six months of his first term.Mangione also faces forgery and firearms charges in Pennsylvania stemming from his arrest last week, but those will likely not be addressed until the New York charges are resolved.He initially fought attempts to be returned to New York, but ultimately waived extradition and a preliminary hearing on the Pennsylvania charges on Thursday.“He is now in their custody,” Blair County District Attorney Peter Weeks said after Mangione was extradited to New York. “We intend to keep our case active and we intend to essentially revisit the case when the defendant is available for prosecution in Blair County.”","summary":"Luigi Mangione, accused of gunning down United Healthcare’s CEO outside a Manhattan hotel, is now jailed in New York, awaiting arraignment Monday on a state murder indictment.","url":"https://www.scrippsnews.com/us-news/whats-next-for-the-man-charged-with-killing-unitedhealthcares-ceo","image":"https://ewscripps.brightspotcdn.com/dims4/default/8c88940/2147483647/strip/true/crop/2784x1462+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F32%2Fd8%2Fedea07214a4389f9f5748740fb94%2Fap24354678796267.jpg","video":null,"publish_date":"2024-12-21 00:34:21","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","source_country":"us","sentiment":-0.297},{"id":274982822,"title":"EXCLUSIVE: Joe Exotic Hints at 'Moving to Mexico' With New Fiancé as Jailed Reality Star 'Prays' Donald Trump Can Pardon Him","text":"Joe Exotic has big plans if he ever gets released from prison early – and they may involve leading the country.\n\nRadarOnline.com can reveal the former reality star, real name Joseph Maldonado, wants a happy ending with his new man and he wants to make sure Donald Trump helps him get there.The 61-year-old shared his holiday plea with RadarOnline.com, which read: \"Before I get busy or something happens, Jorge and I would just like to tell everyone Merry Christmas and we hope you have safe travels if you go anywhere.\"\n\nMaldonado recently proposed to a 33-year-old inmate named Jorge Marquez, after being engaged for four years to another man – who he made sure to completely rip on his way to a new relationship.The ex Netflix star's message continued: \"All we can do is pray Trump makes this right in January and allows me to go home. Depending on if the lawyers working on Jorge's case can keep him in America will determine if I stay in America or move to Mexico. Either way life will be better than this.\"\n\n\"Roger and John are working hard on my appeal and I don't see how we can lose that, so say a prayer for me please,\" Maldonado concluded referring to his lawyers, John M Pierce and Rodger Roots.\n\nThe former exotic zoo owner has been reaching out to anyone who will listen in hopes of being given a pardon, including outgoing president, Joe Biden.He told the 82-year-old earlier this month: \"... Is this the end of what your administration stands for? Or will you find it within your power to make it right and allow me to go home based on the evidence of my case that I am innocent and have served 7 years for nothing.\"\n\nMeanwhile, Maldonado has already reached out to president-elect Trump's Attorney General, Pam Bondi, claiming he's behind bars due to a government conspiracy theory. He's also pleaded with Donald Jr. as well as Trump himself to help him become a free man again.\n\nDays after the 78-year-old beat Kamala Harris in the election, the ex TV personality penned in a letter: \"A lot of people went to bat for you in 2021 who have been living in hell ever since then.\n\n\"Everyone hopes you keep the promises you made during your campaign, which include pardoning everyone sooner than later in January 2025.\"He added: \"Some of those very people have been stuck in solitary confinement, forced to live like rats, have killed themselves in prison, or have died.\n\n\"Some, like myself, have fought like hell to hang on, hoping for you to win this election.\"\n\nWhile he continues to await a potential release, Maldonado is keeping busy with his new man, previously revealing he's \"doing good\".He gushed over his future husband in October, saying: \"He is so amazing and is from Mexico. Now, the quest of getting married in prison and getting him asylum or we be leaving America when we both get out. Either way, I wish I would have met him long ago.\"\n\nHe continued: \"Whether it helps his immigration status or not, we love each other enough to get married. We even got tattooed matching wedding bands already on. What it would do is, it would assure him, and it would show the court, that he has a little bit of financial stability to stay in America.\n\n\"It's gonna look better for his asylum case to be married. We're just hoping that the prison will allow us to get married and stay in the same prison.\"Maldonado concluded: \"He gets out in May of next year so that gives us seven months to get my appeal done and find out where I'm at. We're hoping to be able to walk out the door close to the same time.\"\n\nThe Tiger King star is serving a 21-year sentence after he was convicted for a murder-to-hire plot against his rival, animal rights activist rival, Carole Baskin.","summary":"Joe Exotic may move to Mexico depending on how his new new fiancé's future shapes out – and if the former reality star is finally pardoned.","url":"https://radaronline.com/p/joe-exotic-moving-to-mexico-with-new-fiance-donald-trump-pardon/","image":"https://media.radaronline.com/brand-img/4_VHZQTMB/0x0/joe-exotic-moving-to-mexico-with-new-fiance-donald-trump-pardon-pp-1734732347971.jpg","video":null,"publish_date":"2024-12-21 00:30:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","category":"politics","source_country":"us","sentiment":-0.108},{"id":274977908,"title":"Mike Johnson jokingly asks Elon Musk: ‘You want to be speaker of the House?’","text":"WASHINGTON — House Speaker Mike Johnson said that he jokingly asked Elon Musk if he wanted to take over his job — after the billionaire helped torpedo a major government spending bill on Thursday, resulting in a pared-down version that passed Friday night after two days of intense wrangling.\n\n“Elon Musk and I talked within about an hour ago and we talked about the extraordinary challenges of this job,” Johnson (R-La.) told reporters after the House overwhelmingly passed the final package.\n\n“And I said, ‘Hey, you want to be speaker of the House? I don’t know.’ He said this may be the hardest job in the world. I think it is.”\n\nMusk, the incoming chief of President-elect Donald Trump’s cost-cutting Department of Government Efficiency, took on a leading role in tanking an earlier 1,547-page bill, with Johnson then whittling it down to 118 pages with Trump too joining in criticizing the initial version.\n\nHouse Democrats took to calling the SpaceX and Tesla CEO “President Musk” during debate on the bill.\n\nMusk praised Johnson on Friday evening, tweeting: “The Speaker did a good job here, given the circumstances. It went from a bill that weighed pounds to a bill that weighed ounces. Ball should now be in the Dem court.”\n\nThe role of House speaker doesn’t require that person to be a member of the House, though all occupants to date have been, meaning that Musk technically could assume the job if members were to select him. \n\nJohnson’s own fate is in doubt due to Republicans’ extremely narrow majority next year and anger from fiscal hawks over even the pared-down spending bill.\n\nJohnson said that he was in close touch with Trump during the final stages of debate on the bill, which still must be passed by the Senate and signed by retiring President Biden to avoid a partial government shutdown at midnight.\n\n“I was in constant contact with President Trump throughout this process,” Johnson said. “I spoke with him most recently about 45 minutes ago. He knew exactly what we were doing and why and this is a good outcome for the country. I think he certainly is happy about this outcome as well.”\n\nThe House speaker argued that Republicans would be more free to shake up federal spending come January when they will control both chambers of Congress and the White House.\n\n“Things are going to be very different around here. This was a necessary step to bridge the gap, to put us into that moment where we can put our fingerprints on the final decisions on spending for 2025,” Johnson said.","summary":"WASHINGTON — House Speaker Mike Johnson said that he jokingly asked Elon Musk if he wanted to take over his job — after the billionaire helped torpedo a major government spending bill on Thursday, resulting in a pared-down version that passed Friday night after two days of intense wrangling. &#8220;Elon Musk and I talked within...","url":"https://nypost.com/2024/12/20/us-news/mike-johnson-jokingly-asks-elon-musk-you-want-to-be-speaker-of-the-house/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/Johnson-Musk-SOH.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/z3YQzDJ2-RyIcpnTz.mp4","publish_date":"2024-12-21 00:29:34","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.042},{"id":274980528,"title":"U.S. bill to avert midnight shutdown sent to Senate after House approval","text":"WASHINGTON - The Republican-controlled U.S. House of Representatives passed legislation on Friday that would avert a midnight government shutdown, defying President-elect Donald Trump's demand to also green light trillions of dollars in new debt.Next, the Democratic-controlled Senate would need to pass the bill to ensure the government will be funded beyond midnight Saturday, when current funding expires. The White House said President Joe Biden intends to sign it into law if they do.The legislation would extend government funding until March 14, provide $100 billion for disaster-hit states and $10 billion for farmers. It would not raise the debt ceiling — a difficult task Trump has pushed Congress to do before he takes office on Jan. 20.","summary":"The Republican-controlled House also defied President-elect Donald Trump's demand to green light trillions of dollars in new debt.","url":"https://www.japantimes.co.jp/news/2024/12/21/world/politics/us-government-spending-bill-house/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/12/21/441617.JPG?v=3.1","video":null,"publish_date":"2024-12-21 00:26:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.464},{"id":274977360,"title":"Johnson merges shelter programs, closes migrant 'landing zone'","text":"Mayor Brandon Johnson’s administration closed the city’s landing zone for newly arrived asylum seekers slightly ahead of schedule, announcing Friday a new shelter intake center on the Lower West Side open to anyone experiencing homelessness.\n\nThe closure of the landing zone – at 800 S. Desplaines St. in the West Loop – is part of a plan to merge two shelter systems for the unhoused. In October, Johnson announced the city would end shelters specifically designated for newly arrived asylum seekers by the end of the year.\n\nFormer Mayor Lori Lightfoot developed a separate shelter system for immigrants in 2022 in response to Texas Gov. Greg Abbott busing thousands of asylum seekers to Chicago and other liberal-leaning cities.\n\n“We definitely started in the crisis response mode, and many, many of you remember having people sleeping in police stations and at the airports and the city working very diligently to keep up and open shelters,” said Beatriz Ponce de León, deputy mayor of immigrant, migrant and refugee rights. “But we knew that that response was not going to be sustainable, and that we had to also build toward other types of support that put people on the path to resettlement.”\n\nAnyone seeking a shelter bed will have to make a request through 311 under the city’s new One System Initiative. \n\nOn Friday, the city opened a new intake center at 2241 S. Halsted St. that will be open 24 hours a day seven days a week with capacity for 200 beds and available for single adults, said Maura McCauley, first deputy commissioner of the Department of Family and Support Services.\n\nThere wasn’t much activity outside of the brick Halsted building Friday afternoon. Two white doors were marked “entry” in red. \n\nThe building connects to a former warehouse that once served as a makeshift and overcrowded shelter for migrants. \n\nAt that shelter, a 5-year-old boy, Jean Carlos Martinez, became ill last December and later died from sepsis and a bacterial infection that causes strep throat.\n\nAsked if conditions will improve at shelters in Chicago, the city said it is working on better training and is moving away from hiring contractors and instead working with local social service agencies to manage the spaces moving forward, McCauley said.\n\nAs of Friday, there were an estimated 2,476 migrants living in the city-run shelters, though the city will stop creating a daily census of this population as it moves toward a merged system, said Harley Jones, who is helping coordinate the city’s response to migrants.\n\nThe city plans to close by the end of the month a shelter at 1310 N. Elston Ave., which housed about 135 single men and women. \n\nTwo shelters serving migrants, located at 4900 S. DuSable Lake Shore Dr., and 7353 S. Cicero Ave., are operated by the state and will become part of the merged system, Ponce de León said. The state is providing funding to help immigrants in shelters find stable housing.\n\nThe three other shelters that had housed migrants will now become part of the One Shelter System, she said. Those shelters are located at 640 W. Irving Park Road, 3034 W Foster Ave. and 2641 S. Calumet Ave.\n\nThe merger of shelter systems comes as the city’s department overseeing them loses its leader, Brandie Knazze, the commissioner for the department who recently announced her resignation.\n\nThe changes also come weeks before Donald Trump starts a second term as president. The president-elect promised his supporters to ramp up deportations of immigrants. \n\nPonce de León said Johnson is committed to upholding the city’s welcoming city stance.\n\n“We are working on guidance that will go to all departments and agencies so that they know what to do in the case of any federal agents coming and, you know, requesting assistance with deportation raids,” Ponce de León said.\n\nContributing: Adriana Cardona-Maguigad, Tyler Pasciak LaRiviere","url":"https://chicago.suntimes.com/immigration/2024/12/20/chicago-homeless-shelter-migrants-closure-brandon-johnson-trump-deportations-immigration","image":"https://cst.brightspotcdn.com/dims4/default/cdc2bad/2147483647/strip/true/crop/3000x1713+0+144/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F3d%2Fd7%2F2f999d544fc6ac9ebd24f3583f5d%2Fshel","video":null,"publish_date":"2024-12-21 00:23:31","author":"Elvia Malagón","authors":["Elvia Malagón"],"language":"en","category":"politics","source_country":"us","sentiment":-0.105},{"id":274976652,"title":"Can Trump save dollar hegemony?","text":"By Jeffrey Frankel In 2023, the leaders of Brazil and the other BRICS countries at the time — China, India, Russia, and South Africa — discussed collaboration on a new shared currency. Brazilian President Luiz Inácio Lula da Silva has been a vocal proponent of an alternative to the US dollar, the dominant global currency for the past 75 years, and Russian President Vladimir Putin publicly promoted the idea during the BRICS summit in October by brandishing a symbolic BRICS banknote. The bloc’s new members — Egypt, Ethiopia, Iran, and the United Arab Emirates — would presumably also be included in the new joint currency. The proposed challenge to the dollar has already drawn the ire of US President-elect Donald Trump, who has threatened to impose punitive tariffs of 100% on countries that move away from the greenback. Two weeks ago, Trump warned BRICS countries against creating or supporting an alternative reserve currency. “We require a commitment from these countries that they will neither create a new BRICS currency nor back any other currency to replace the mighty US dollar, or they will face 100% tariffs,” he declared on Truth Social, his social media platform. This ultimatum follows Trump’s threats to impose a 25% tariff on Mexico and Canada if they fail to curb fentanyl smuggling into the United States, a 60% tariff on Chinese goods, and a 10-20% tariff on other trade partners. Despite Trump’s bluster, these increasingly extreme threats will not result in one of his self-proclaimed successful “deals”. While Trump’s rhetoric suggests he views a BRICS currency as a serious threat, such a project is likely to fail anyway, regardless of his actions or ultimatums. If the proposed currency is intended to exist alongside BRICS countries’ national currencies, it will not gain traction. A successful international currency requires a home base. That is why English, not Esperanto, became the world’s lingua franca, and why the special drawing right (SDR) — the International Monetary Fund’s reserve asset, whose value is based on a basket of major currencies — has not been successful as an international currency. For a BRICS unit to compete with the US dollar, then, member countries would need to form a full-fledged monetary union, relinquishing their national currencies and establishing a unified central bank to oversee the new money. But the BRICS econ-omies differ too much from each other for a monetary union to function effectively. Successful monetary unions are typically formed by small, interconnected economies that trade extensively with one another and share common goals, cultural ties, correlated business cycles, and relatively integrated labour markets. When member economies are too dissimilar, one may enter a recession while another overheats. In a monetary union, member states must give up control over their money supply, interest rates, and the exchange rate, limiting their ability to respond to cyclical economic fluctuations. In the absence of alternative adjustment mechanisms such as increased labour mobility and a strong political commitment, these disparities can lead to significant discord and needless macroeconomic instability. Examples of successful monetary unions include the CFA franc zones, comprising West African and Central African states that use a common currency pegged to the euro, and the Eastern Caribbean Currency Union, which consists of English-speaking islands like Anguilla, Antigua, and Barbuda. These work because their members are small neighbouring countries that share cultural and historical roots. The largest member of the CFA, for example, is Côte d’Ivoire, whose GDP is smaller than that of Buffalo, New York. The notable exception, of course, is the eurozone. But although it consists of relatively large economies, its 20 members also share borders, maintain integrated economies, and are bound by a shared commitment to the vision of a peaceful, unified Europe. Even so, European countries like the United Kingdom, Sweden, and Norway have chosen to remain outside the eurozone, and peripheral members such as Greece have struggled to adapt to the constraints of the euro’s monetary straitjacket. Some regional blocs have long discussed adopting a common currency but made little progress. In 2001, the six-member Gulf Cooperation Council announced plans to establish a currency union by 2010, but the plan failed to materialise. If even the small, culturally aligned, and cyclically correlated GCC countries have been unwilling to relinquish their monetary sovereignty, the proposed BRICS currency stands little chance. Many of the BRICS+ countries are large. They span four continents. They speak different languages. And their borders have historically been sources of conflict rather than economic integration. China and India, for example, were locked in a protracted military standoff along their shared Himalayan border before reaching a fragile truce in October. There is also little correlation among the BRICS economies’ business cycles. Rising world energy prices benefit oil-producing countries like Russia, Brazil, Iran, and the UAE, while putting pressure on energy-importing countries such as China and India. This dynamic makes the BRICS far less suited for a monetary union than the GCC countries. To be sure, a gradual global shift away from the dollar is already underway. This process, while slow, has gained momentum in recent years, driven partly by the US’s increasingly frequent use of financial sanctions. But if the Trump administration were to retaliate against the BRICS with 100% tariffs, the move could backfire, prompting central banks to turn to the renminbi, smaller currencies, or even gold for their international reserves. Trump’s clumsy efforts to enforce the international use of the dollar are at odds with his other stated objectives, such as improving the US trade balance by devaluing the dollar against the renminbi and the currencies of other countries that run bilateral surpluses with the US. Talking down the dollar aligns with other inflationary Trump promises, such as his threats to weaken the Federal Reserve’s independence and his proposed mass deportations. But an international reserve currency that is prone to inflation and depreciation is hardly attractive. Trump’s tariff threats won’t resolve that contradiction. Copyright: Project Syndicate, 2024. The writer is professor of capital formation and growth, Harvard University and research associate, US National Bureau of Economic Research. Disclaimer: Views expressed are personal and do not reflect the official position or policy of FinancialExpress.com. Reproducing this content without permission is prohibited.","url":"https://www.financialexpress.com/opinion/can-trump-save-dollar-hegemony/3696676/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/dollar.reuters.jpg","video":null,"publish_date":"2024-12-21 00:22:24","author":"Guest","authors":["Guest"],"language":"en","category":"politics","source_country":"in","sentiment":0.056},{"id":274976572,"title":"BREAKING: House Passes Spending Bill to Fund Government Through March","text":"The House passed a spending bill Friday night that will fund the government through March 14, avoiding a shutdown. The bill passed by a vote of 366-34-1.\n\nBREAKING: The House passes a short term spending bill, with a 366-34 vote. Some of the bill’s contents:- Extends funding for government til 3/14/25.- No debt limit increase.- $100 billion for disaster aid & $30 billion for farmers. @KALBtv5 pic.twitter.com/bytxbgKkZS— Colin Vedros (@colinpvedros) December 20, 2024\n\nThe House approved legislation to avert a government shutdown hours before the deadline on Friday, sending the bill to the Senate for consideration after a whirlwind week on Capitol Hill.The chamber voted 366-34-1 in support of the legislation, clearing the two-thirds threshold needed for passage, since GOP leadership brought the bill to the floor under the fast-track suspension of the rules process. All Democrats except one — Rep. Jasmine Crockett (D-Texas), who voted present — joined 170 Republicans in voting yes.\n\nIt was a marked contrast to the first bill on Wednesday, which clocked in at 1,547 pages and failed. Another 116-page bill also failed on Thursday. The bill that passed was 118 pages long.\n\n\"In lieu of the debt ceiling hike, Republicans entered into an agreement to increase the borrowing limit by $1.5 trillion in exchange for $2.5 trillion in net cuts to spending, done through a reconciliation package in the next Congress,\" The Hill added.\n\nThe Senate should vote on the bill Friday night. The deadline to avoid a government shutdown is midnight.\n\n\"The bill notably did not include provisions to address the debt limit sought by President-elect Donald Trump,\" Just the News reports. \"Both sides, however, are likely to claim a victory, as Republicans may point to the final version's vastly reduced size while Democrats may highlight its exclusion of a Trump-desired provision.\"\n\nReaction to the bill was mixed.\n\n“We’re legislating by Braille here,” said Rep. Thomas Massie (R-Ky.), a vocal critic of House Speaker Mike Johnson (R-La.). “I think this wasn’t handled well, and then I still have all the grievances from last at the beginning of this year, FISA, Ukraine, all of those things. I think there’s going to be a reckoning eventually.”\n\nTonight the country saw representative democracy in action. Thank you to everyone of you involved in this process.Now onto the Senate!— Rep. Mike Collins (@RepMikeCollins) December 20, 2024\n\nOn this third “funding” CR - progress having been made on future cuts/debt ceiling notwithstanding - I must vote no. $110bb unpaid-for, extension of food stamps with no reform, gimmicks to pay for health extenders, breaks 72 hour rule… More of the same.— Chip Roy (@chiproytx) December 20, 2024\n\nTrue https://t.co/j7eyQPSoFk— Elon Musk (@elonmusk) December 20, 2024\n\n🚨THE HOUSE HAS PASSED a bill to avert a midnight shutdown.THE BILL passed 366-34-1170 Republicans voted yes, 196 Democrats voted yes. 34 Republicans voted no. A total ofZERO Democrats voted no. Dems saved Republicans here.NO DEBT CEILING -- House Republicans weren't at…— Jake Sherman (@JakeSherman) December 20, 2024\n\nThis is a developing story. We'll have updates as they become available.","url":"https://pjmedia.com/chris-queen/2024/12/20/breaking-house-passed-spending-bill-to-fund-government-through-march-n4935327","image":"https://media.townhall.com/cdn/hodl/2024/109/8283ec71-60fd-4a4e-8114-bd3c6b32052f.jpg","video":null,"publish_date":"2024-12-21 00:21:23","author":"Chris Queen","authors":["Chris Queen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.217},{"id":274979152,"title":"Senate approves 235th judge of Biden’s term, beating Trump’s tally","text":"WASHINGTON (AP) — President Joe Biden secured the 235th judicial confirmation of his presidency Friday, an accomplishment that exceeds his predecessor’s total by one after Democrats put extra emphasis on the federal courts following Donald Trump’s far-reaching first term, when he filled three seats on the Supreme Court.\n\nSenate Majority Leader Chuck Schumer, D-N.Y., teed up votes on two California district judges, and they were likely to be the last judicial confirmations this year before Congress adjourns and makes way for a new, Republican-led Senate.\n\nThe confirmation of Serena Raquel Murillo to be a district judge for the Central District of California broke Trump’s mark. Come next year, Republicans will look to boost Trump’s already considerable influence on the makeup of the federal judiciary in his second term.\n\nBiden and Senate Democrats placed particular focus on adding women, minorities and public defenders to the judicial rank. About two-thirds of Biden’s appointees are women and a solid majority of appointees are people of color. The most notable appointee was Supreme Court Justice Ketanji Brown Jackson, the first African American woman to serve on the nation’s highest court.\n\n“Prior to our effort, the number of women on the federal bench was really diminished. It was overwhelmingly white males,” said Sen. Dick Durbin, the Democratic chairman of the Senate Judiciary Committee. “We consciously moved forward to bring more women to the bench, and believe me, we had a great talent pool to work with. So I think it’ll enhance the image of the court and its work product to bring these new judges on.”\n\nBiden also placed an emphasis on bringing more civil rights lawyers, public defenders and labor rights lawyers to expand the professional backgrounds of the federal judiciary. More than 45 appointees are public defenders and more than two dozen served as civil rights lawyers.\n\nWhile Biden did get more district judges confirmed than Trump, he had fewer higher-tier circuit court appointments than Trump — 45 compared to 54 for Trump. And he got one Supreme Court appointment compared with three for Trump. Republicans, much to Democrats’ frustration, filled Justice Ruth Bader Ginsburg’s seat on the court the week before the 2020 presidential election. Ginsburg had passed away in September.\n\nDemocrats also faced the challenge of confirming nominees during two years of a 50-50 Senate. Rarely a week went by in the current Congress when Schumer did not tee up votes on judicial confirmations as liberal groups urged Democrats to show the same kind of urgency on judges that Republicans exhibited under Trump.\n\nSome Senate Republicans were harshly critical of Biden’s choices. Sen. Ted Cruz, R-Texas, said talk of diversity did not extend to the views of the nominees.\n\n“One of the consequences of the age of Trump is that it drove Democrats insane and it drove them to the extreme left, so they put people on the bench who were selected because they were extreme partisans,” Cruz said.\n\nLiberal-leaning advocacy groups said they are delighted with the number of judges Democrats secured, but even more so with the quality of the nominees. They said diversity in personal and professional backgrounds improves judicial decision-making, helps build public trust and inspires people from all walks of life to pursue legal careers.\n\n“For our federal judiciary to actually deliver equal justice for all, it really has to be for all, and that is one reason why we certainly applaud this administration for prioritizing both professional but also demographic diversity,” said Lena Zwarensteyn, senior director of the fair courts program at The Leadership Conference on Civil and Human Rights.\n\nSen. Charles Grassley, R-Iowa, and the next chairman of the Senate Judiciary Committee, said Democrats showed newfound resolve on judicial confirmations.\n\n“They learned a lesson from the first Trump administration,” Grassley said. “Paying attention to the number of judges you get and the type of judges you put on the court is worth it.”\n\nPart of the urgency from Democrats came as they watched the nation’s highest court overturn abortion protections, eliminate affirmative action in higher education and weaken the federal government’s ability to protect the environment, public health and workplace safety through regulations. The cases showed that the balance of power in Washington extends to the judicial branch.\n\nTrump will inherit nearly three dozen judicial vacancies, but that number is expected to rise because of Republican-appointed judges who held off on retirement in hopes that a Republican would return to office and pick their replacements.\n\nSen. Richard Blumenthal, D-Conn., acknowledged that the sense of accomplishment for Democrats is muted somewhat knowing that Trump will have another term to continue shaping the federal judiciary.\n\n“I’m not ready to uncork the champagne just because we’ve done some really good work over the last four years,” Blumenthal said. “We need to be prepared to work, hope for the best and try to defeat nominees who are simply unqualified. We have our work cut out for us. The prospects ahead are sobering.”\n\nGrassley promised that he’ll work to best Biden’s number.\n\n“Let me assure you, by January 20th of 2029, Trump will be bragging about getting 240 judges,” Grassley said.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — President Joe Biden secured the 235th judicial confirmation of his presidency Friday, an accomplishment that exceeds his predecessor&#8217;s total by one after...","url":"https://whdh.com/news/senate-approves-235th-judge-of-bidens-term-beating-trumps-tally/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/07/image-1-16.jpg?quality=60&strip=color","video":null,"publish_date":"2024-12-21 00:16:57","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":0.308},{"id":274977452,"title":"Senate confirms 2 Biden judicial nominees, boosting total over Trump","text":"The Senate on Friday confirmed President Joe Biden’s last two judicial nominees to lifetime seats on the federal bench, surpassing Donald Trump’s first-term total of 234 judges even as the president-elect’s second term will afford him the chance to make many more judicial appointments.\n\nBenjamin J. Cheeks was confirmed to a seat in the Southern District of California by a vote of 49-47. Serena R. Murillo was confirmed to the Central District of California by the same vote count. Cheeks and Murillo are the 234th and 235th judges confirmed under Biden.","summary":"President Joe Biden’s diverse cohort of judges includes more women, people of color and LGBTQ individuals than those tapped by any other U.S. president.","url":"https://www.washingtonpost.com/politics/2024/12/20/biden-judges-trump-record/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MIWTTJ4VFSR7D4W3V472ES7U7Y_size-normalized.jpg&w=1440","video":null,"publish_date":"2024-12-21 00:15:10","author":"Tobi Raji","authors":["Tobi Raji"],"language":"en","source_country":"us","sentiment":0.574}]}