{"offset":0,"number":50,"available":13202,"news":[{"id":279402128,"title":"More Americans jailed in Venezuela pose a test of Trump&#039;s deal-making foreign policy","text":"MIAMI: Venezuelan President Nicolas Maduro will be sworn in for a third term Friday while hundreds of government opponents arrested since his disputed reelection last summer languish in the country’s packed prisons.Sharing cells with them are as many as 10 Americans.One is David Estrella, who was last heard from in September, when the 62-year-old native New Yorker was about to take a taxi from Colombia to Venezuela with a bag of perfume, clothes and shoes to gift to friends he made on a previous trip.“It’s like mourning someone in life,” said Margarita Estrella, his ex-wife and mother of three of his children, the youngest of whom just turned 18. “We don’t know anything about where he is, or how he’s doing. Without being able to talk to him, to hear his voice, so he knows all we’re trying to do for him, makes it a lot worse.” The circumstances around the arrest of David Estrella and the other Americans are not well known. Most have not had access to a lawyer and only limited contact with family members, who worry they could be subject to torture, as past American detainees have alleged.None has been declared wrongfully detained by the State Department, a designation that would give their cases more attention. Because the U.S. has no diplomatic presence in Venezuela, their families can face a long process pushing for their release.The Americans’ detentions add another complication to the many Venezuela challenges that await President-elect Donald Trump when he returns to the White House on Jan. 20. For senior foreign policy roles in his administration, Trump has picked several architects of the “maximum pressure” campaign he pursued during his first term when he tried to oust Maduro. They include Florida Sen. Marco Rubio for secretary of state and Mauricio Claver-Carone, a former White House National Security Council aide, as special envoy to Latin America.But the failure of those policies is readily apparent, and it’s not clear whether Trump will pursue the same course this time.For one, Maduro enjoys the backing of the armed forces, the traditional arbiter of disputes in Venezuela. The military has stuck by Maduro even as the U.S. and other foreign governments recognized his opponent, Edmundo Gonzalez, as the winner of last year’s vote. Also, crippling oil sanctions that Trump previously promoted have inadvertently strengthened American adversaries such as China, Russia and Iran in the strategic energy sector.Meanwhile, Trump’s campaign promise of mass deportations depends on Maduro’s willingness to take back migrants from the United States. So far, Maduro has been reluctant to do so without concessions from Washington.“To come in and take the same failed approach seems misguided,” said Brian Fonseca, a former Pentagon expert on Latin America who heads a national security think tank at Florida International University.He said Trump would be wiser to engage with Maduro in a more pragmatic way, similar to how the U.S. has long dealt with Saudi Arabia, where human rights abuses are also a major concern.“The U.S. must adopt a realistic approach that requires short-term compromises to gain long-term leverage where it can advance human rights and democratic governance,” Fonseca said.The Trump transition team did not respond to a request for comment on its plans for Venezuela.Maduro congratulated Trump after his victory in November and called for a fresh start in relations with the U.S. Venezuela’s state-owned oil company contributed $500,000 to Trump’s inauguration committee in 2016 and hired several lobbyists in an ultimately unsuccessful campaign to draw close to the White House.But Trump hasn’t shown any signs of softening his hawkish stance.“They’ll take them back,” he said last month when asked whether Venezuelans could be deported to a country without diplomatic relations with the U.S. “If they don’t, they’ll be met very harshly economically.”Analysts don’t see American prisoners as an insurmountable obstacle to rebuilding ties, but they have no illusion about Maduro’s intentions in targeting Americans.In December 2023, the Biden administration swapped a close Maduro ally who was awaiting trial on corruption charges in Miami for 10 Americans jailed in Venezuela. At the time, the White House said it secured commitments that Maduro’s government would not arrest additional Americans.The arrests since then, however, indicate Maduro has broken that pledge.The detentions fit into a worrisome pattern of Maduro targeting foreigners with passports from countries at odds with Maduro, activists say.Foro Penal, a Caracas-based legal assistance group, has counted 47 foreign or dual nationals from 13 countries among the nearly 1,800 people imprisoned for political reasons in Venezuela. That compares with barely 300 before the July election.One is a national guardsman from Argentina who was arrested coming to visit his Venezuelan wife’s family. Authorities accused him of terrorism, linking him to five opposition activists who have been sheltering in the Argentine ambassador’s residence for 10 months. Other prisoners hail from Ecuador, Spain and the Czech Republic.Maduro is playing up the arrest of foreigners — something he has been reluctant to do in the past. On Tuesday, he said two more Americans had been captured as part of a group of “mercenaries” that also included men from Colombia and Ukraine.“I am sure in the next few hours they will confess,” Maduro said, adding that the men, whom he didn’t name, “came to carry out terrorist activities against the fatherland.”Before that announcement, Venezuelan officials have given the names of seven American detainees, and human rights groups identified an additional one. The State Department has declined to provide a number, citing privacy and security concerns.“The Maduro regime does not notify the U.S. government of the detention of U.S. citizens, and the U.S. government is not granted access to those citizens,” a State Department spokesperson said.One American detainee, Wilbert Castaneda, is a Navy SEAL. His mother told The Associated Press that he was on vacation when he traveled to Venezuela to visit a girlfriend.Venezuelan Interior Minister Diosdado Cabello announced Estrella’s detention in September, alleging Estrella was part of a plot led by Castaneda to assassinate Maduro. The two Americans have never met, according to their families.Estrella had been working as an auditor at a pharmaceutical company in the New York area when he relocated to Ecuador — where he met his wife decades earlier — during the coronavirus pandemic. The same adventure-seeking lifestyle drew him to Venezuela, where he first traveled in 2023, says his former spouse.“You could talk to him, and within a few minutes, he was calling you his brother,” Margarita Estrella said. “He was always talking about how he was looking forward to retiring and enjoying the rest of his life.”Published By: indiatodayglobal Published On: Jan 9, 2025","url":"https://www.indiatoday.in/world/us-news/story/more-americans-jailed-in-venezuela-pose-a-test-of-trumps-deal-making-foreign-policy-glbs-2661924-2025-01-09","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202501/maduro-095607518-16x9_0.jpg?VersionId=6yFGBqejrVzn5ts1J3OU1Mwoq6iqMuY7?size=1280:720","video":null,"publish_date":"2025-01-09 01:04:13","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":-0.278},{"id":279402106,"title":"Girl, you&#039;re no longer Governor: Elon Musk trolls Trudeau for rejecting merger call","text":"Tech titan Elon Musk roasted Canadian Prime Minister Justin Trudeau after he asserted that there was no chance that Canada would become part of the US, as pitched by President-elect Donald Trump on several occasions. Picking a leaf from Trump's playbook, Musk referred to Trudeau as the \"governor of Canada\", saying his views do not matter now as he has decided to step down as Prime Minister.\"Girl, you're not the governor of Canada anymore, so doesn't matter what you say,\" Musk tweeted, referring to Trudeau's recent announcement to step down as leader of the Liberal Party and Prime Minister amid deteriorating approval ratings.The US President-elect has been teasing Trudeau by calling him the \"governor\" after he emphasised during a recent meeting with him that Canada should become the 51st US state if it can't handle aggressive tariffs.Musk has been breathing down Trudeau's neck ever since Trump emerged victorious in the US election. Apart from predicting Trudeau's ouster, he has also labelled him \"an insufferable tool\".After Trudeau resigned as Prime Minister earlier this week, Musk's pointed remark grabbed attention. \"2025 is looking good,\" he said.On Tuesday, Donald Trump escalated his attack on Canada amid the prospect of a trade war, saying he would use \"economic force\" to make Canada a part of the United States.When asked by reporters if he was considering military action to annex Canada, Trump replied with a firm \"no\". However, he indicated that using \"economic force\", meaning hefty tariffs on Canadian goods, was on the cards.\"You get rid of that artificially drawn line, and you take a look at what that looks like, and it would also be much better for national security. Don't forget, we basically protect Canada,\" Trump said.Trudeau sharply hit back at Trump, saying, \"There isn't a snowball's chance in hell that Canada will become part of the United States. Workers and communities in both our countries benefit from being each other's biggest trading and security partner.\"Published By: Abhishek DePublished On: Jan 8, 2025Must Watch","url":"https://www.indiatoday.in/world/story/elon-musk-trolls-justin-trudeau-governor-donald-trump-us-canada-merger-threat-2661615-2025-01-08","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202501/elon-musk-and-justin-trudeau-085422601-16x9_0.jpg?VersionId=P12TA_zuB8vTSJhneJcfVsnQTK7PJ.oY?size=1280:720","video":null,"publish_date":"2025-01-09 01:04:13","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.046},{"id":279402102,"title":"No water in fire hydrants: Trump blames Biden for California wildfire","text":"President-elect Donald Trump criticised California Governor Gavin Newsom and outgoing President Joe Biden on Thursday, holding them responsible for the failure to contain wildfires sweeping parts of Southern California. He accused President Biden of leaving him without the necessary resources to combat the ongoing wildfire crisis. Trump is slated to take over the Oval Office on January 20. In a series of posts on his social media platform, Truth Social, Trump wrote, \"No water in the fire hydrants, no money in FEMA. This is what Joe Biden is leaving me. Thanks, Joe!\" Trump accused the state’s Democratic leadership of prioritising environmental concerns over residents safety. “He (Governor Gavin Newsom) wanted to protect an essentially worthless fish called a smelt, by giving it less water (it didn’t work!), but didn’t care about the people of California,” Trump wrote. The remarks came as three wildfires continued to force evacuations in the Los Angeles area. Authorities confirmed two deaths and urged residents to prepare for immediate evacuation.In his criticism, Trump accused Governor Newsom of rejecting a proposal to redirect water to Southern California. “Governor Gavin Newscum refused to sign the water restoration declaration put before him that would have allowed millions of gallons of water, from excess rain and snow melt from the North, to flow daily into many parts of California,” Trump wrote.He also said that the fires might become the most expensive in the country’s history. “The fires in Los Angeles may go down, in dollar amount, as the worst in the history of our country. In many circles, they’re doubting whether insurance companies will even have enough money to pay for this catastrophe,\" he wrote. He criticised the Biden administration, calling the situation a result of mismanagement. \"Let this serve, and be emblematic, of the gross incompetence and mismanagement of the BidenNewscum Duo. January 20th cannot come fast enough!,” he added. Published By: Akhilesh NagariPublished On: Jan 9, 2025Must Watch","url":"https://www.indiatoday.in/world/us-news/story/donald-trump-blames-joe-biden-for-california-wildfire-most-expensive-in-us-history-2661919-2025-01-09","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202501/donald-trump-082519818-16x9_0.png?VersionId=SQawHb1hZwwYbX4LS4DW8nY5KiW9kSh3?size=1280:720","video":null,"publish_date":"2025-01-09 01:04:13","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","source_country":"in","sentiment":-0.5},{"id":279402098,"title":"Trump back in power, Mark Zuckerberg uses it to throw facts under the bus","text":"Facts are never convenient. Just take a look around you, at your friends and family members, at people who you see, or just have a closer look at your thoughts, and you will realise that facts are almost always inconvenient. Because facts are inconvenient, everyone tries to avoid them. Silicon Valley, full of vaunted and utopian-sounding tech companies, never cared much for facts. That is until 2015-16 when the misinformation and this apathy for facts became such a big problem that it erupted in a number of scandals. The biggest of these was the Facebook-Cambridge Analytica scandal. Mark Zuckerberg, the Facebook founder and CEO, moved to contain the damage around the same time Donald Trump entered the White House. He declared that facts were important because lies, which spread through Facebook, might have helped some politicians. This was the beginning of institutional \"fact-checking\" at Facebook. On January 8, as Trump is on the verge of starting his second term as the US president, Facebook is now officially ending its \"fact-checking.\" What a turnaround in just 8 short years! Mark Zuckerberg announced the change in a quick video. To ensure that people get the message, Meta chief global affairs officer Joel Kaplan then went on Fox & friends to reiterate everything that Zuckerberg said. The times are changing, said Zuckerberg as he highlighted that facts are no longer as important as speech. \"The recent elections feel like a cultural tipping point towards, once again, prioritising speech,\" he said. \"So, we're restoring free expression on our platforms (and) going to get rid of fact-checkers.\" It is quite clear why Zuckerberg is doing so. There are two aspects to it — both fairly evident. The move to downgrade facts comes just two weeks before Trump re-enters the White House. When Trump lost elections in 2020, the tech industry which had spent the previous four years fighting him, heaved a sigh of relief and moved quickly to de-platform him. Both Twitter and Facebook banned Trump in the subsequent months. Twitter aka X lifted the ban after Elon Musk bought it. Facebook restored his account in January 2023, but with added surveillance. Then, in the middle of the last year, when it became apparent that Trump might win, the account was restored fully. Donald Trump was banned on FaceBook in 2021 and reinstated in 2023. (Photo credit: Reuters) Now, with Trump set to take oath as the next US president, big tech is trying to get back into his good books for a variety of reasons. Everyone is sweating and working hard. Some tech CEOs have pledged to donate money for Trump's inauguration ceremony. Some are making all the \"right\" noises. Zuckerberg, in the manner of extending an olive branch, is simply getting rid of \"fact checking\" across his platform, the kind of fact checking that would often target outlandish claims made by Trump supporters.\"After Trump first got elected in 2016, the legacy media wrote nonstop about how misinformation was a threat to democracy,\" Zuckerberg said on January 8. \"We tried in good faith to address those concerns without becoming the arbiters of truth, but the fact-checkers have just been too politically biased and have destroyed more trust than they've created, especially in the US.\"Read between the lines and you will realise that Zuckerberg, by getting rid of \"fact checking,\" is simply moving to give the sort of blank check to Trump supporters as far as sharing information — or misinformation — is concerned on Meta platforms like Facebook and Instagram. Well, to Trump supporters as well as to everyone else. But it is also self-serving in another wayHowever, getting into the good books of Trump is only half the story here. Mark Zuckerberg by any measure is a smart person. He is near genius if you look at what he has accomplished and achieved. He is also extremely savvy. Zuckerberg, like most other founders and CEOs in Silicon Valley, is not a fan of regulations. Whether necessary or unnecessary, regulations always irk tech big-wigs like Zuckerberg, Musk and Bezos. They want to create and do things with minimal restrictions and regulations. They believe that many rules, or tasks like fact-checking every bit of information that flows on their platforms, do nothing more than slow them down. Regulating something costs time, people and money. At the same time, people and money can be better used, or so the tech founders argue, in creating and building something. When Facebook started its fact-checking program, and created Facebook Content Oversight Board with people like Alan Rusbridger in it, Zuckerberg did so under tremendous pressure. He was facing serious heat from the media and from regulators across the world in the wake of the Cambridge Analytica scandal. The fact-checking program was not really meant to \"fact check\" but was instead an attempt to ride the tough times.That moment of difficulty has passed. Facts no longer matter anymore and we truly are, as Zuckerberg says, at a \"cultural tipping point.\" In other words, this is an opportune moment for Zuckerberg to get out of doing something he was never comfortable with. By getting rid of the fact-checking program, and forcing this checking business back on users by means of Community Notes, just like Elon Musk over at Twitter does, Meta is not just going to save money but also going to avoid the headache that comes by taking responsibility for something. You see, facts are facts. The problem Zuckerberg cites — \"the fact-checkers have just been too politically biased and have destroyed more trust than they've created\" — can be solved differently. It doesn't require getting rid of facts or fact-checking units. Instead, the solution could be to double down on facts and have teams and mechanisms robust enough to overcome political bias fact-checkers might have, whether that bias is left-leaning or right. But that is not what Zuckerberg is deciding. He is going back to the classic Silicon Valley adage that is we are not the \"arbiters of truth.\" In 2020, even while Facebook had an institutionalised fact-checking programme, Zuckerberg was not in favour of it. In an interview with CNBC, he said, \"I don't think that Facebook or internet platforms in general should be arbiters of truth... Political speech is one of the most sensitive parts of a democracy, and people should be able to see what politicians say.\" Unfortunately for him and Facebook until now it was nearly impossible to get out of the fact-checking that the website was forced to start 8 years ago. Such a move would have angered government regulators and would have given the media a chance to again go after Meta. But now with Trump back in power, there is an opportunity. Zuckerberg is seizing it gleefully.Published By: Ankita GargPublished On: Jan 8, 2025Tune In","url":"https://www.indiatoday.in/technology/talking-points/story/trump-back-in-power-mark-zuckerberg-uses-it-to-throw-facts-under-the-bus-2661700-2025-01-08","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202501/mark-zuckerberg-010151571-16x9.jpg?VersionId=QYhgrUB_jAJzONmCiSo9PZsvJskkpqKd?size=1280:720","video":null,"publish_date":"2025-01-09 01:04:13","author":"Javed Anwer","authors":["Javed Anwer"],"language":"en","category":"politics","source_country":"in","sentiment":-0.325},{"id":279402094,"title":"US schools gear up for likely immigration raids as Trump to assume office: Report","text":"Schools in the US are worried about what to do if immigration agents come to inspect them as President-elect Donald Trump is set to take office on January 20 and his pledge to deport millions of illegal immigrants. Several schools have spoken up for the rights of immigrant students who fear deportation under the Trump administration. The schools have discussed the right of these students to attend school irrespective of whether they entered the country legally or not, reported the Associated Press.This fear of potential deportation is not just limited to schools; several universities across the US have asked students to return before Trump's inauguration on January 20.Around 7.3 lakh children of school-going age are living in the US without legal documentation, according to data by the Migration Policy Institute.The schools have also stated that they will not cooperate with the Immigration and Customs Enforcement agents when they come in for raids. Several officials in California even guided school administrations on state laws limiting locals from participating in immigration enforcement.“I know there is a lot of fear and anxiety around the incoming administration’s anticipated changes to immigration policy,\" California Attorney General Bonta told the Associated Press. \"I want to make sure students, their parents, and their teachers and school administrators are prepared\".The 54-page California guide outlines state and federal protections for students and how to respond to law enforcement requests from documentation stage to interviewing students.While US immigration and Customs Enforcement and Customs and Border Protection agents have steered clear of arresting such students so far, now many fear what would happen under Trump 2.0. \"Although the protected area policy remains in effect... it may be modified, superseded, or withdrawn at any time with little notice,\" the California guide said. \"Because of this, and because exceptions to the policy exist, local educational agencies should have plans in place in the event that a law-enforcement officer requests information or access to a school site or a student for immigration-enforcement purposes.\"Educators are also concerned about immigrant families and their children.\"We understand that fear and uncertainty, especially concerning the potential deportation of family members, can significantly impact our students’ well-being, their attendance, and their ability to learn,” said Des Moines of the Iowa Public Schools, where only one of four students are English language learners.A resolution was passed by the Chicago Public Schools’ Board of Education in November 2024 stating that schools will not assist the immigration department in enforcing immigration laws.The agents would not be able to enter without a criminal warrant, the resolution added.Published By: Priyanjali NarayanPublished On: Jan 8, 2025Must Watch","url":"https://www.indiatoday.in/world/us-news/story/us-donald-trump-president-elect-schools-immigration-children-chicago-california-worried-educators-2661632-2025-01-08","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202501/educators-in-the-us-are-worried-about-immigration-checks-in-their-schools-and-the-impact-it-would-ha-08185219-16x9_0.jpg?VersionId=FwlYDzP4v9fx.7WiXBFFq8Wreh_HQA5Z?size=1280:720","video":null,"publish_date":"2025-01-09 01:04:13","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0},{"id":279401990,"title":"13 Civilians Killed, Several Injured After Russian Missile Attacks Zaporizhzhia","text":"A deadly missile strike in Zaporizhzhia, southern Ukraine on Jan 8, claimed the lives of at least 13 civilians and left around 30 others injured, Ukrainian officials confirmed.\r\n\r\nThe attack, which occurred during daylight hours, saw Russian forces firing glide bombs at residential areas in the city. Footage shared by Ukrainian President Volodymyr Zelenskyy on his Telegram channel showed the aftermath: civilians lying in the streets surrounded by debris, with emergency responders attending to the wounded and evacuating them.\r\n\r\nZaporizhzhia Governor Ivan Fedorov reported that Russian missiles hit residential buildings, exacerbating the damage to the already war-torn city. He had warned earlier in the day of a high threat from Russian missiles and glide bombs targeting the region. Following the assault, Fedorov announced Thursday as a day of mourning for the victims.\r\n\r\nZelenskyy expressed outrage over the brutality of the attack, describing aerial bombings on civilian areas as one of the most cruel forms of warfare. “There is nothing more brutal than aerial bombing of a city, knowing that ordinary civilians will suffer,” he wrote.\r\nZelenskyy's Call for Stronger Security Guarantees\r\nIn the aftermath of the attack, President Zelenskyy also reiterated Ukraine’s need for stronger security guarantees. He stressed that any peace negotiations or ceasefire would need to ensure Ukraine’s future defense, fearing that such deals could give Russia time to rearm and continue its aggressive actions.\r\n\r\nSpeaking during a press conference in Kyiv, Zelenskyy pointed to comments made by U.S. President-elect Donald Trump, who had voiced understanding of Russia's opposition to Ukraine’s NATO aspirations. Zelenskyy insisted that countries seeking to end the conflict should offer serious security assurances to Ukraine, acknowledging that the country is on an \"irreversible path\" to NATO membership, despite opposition from some nations, including the United States, Germany, Hungary, and Slovakia.\r\nUkraine Strikes Russian Fuel Depot\r\nMeanwhile, Ukrainian military forces launched a counterattack, striking a critical fuel storage facility deep within Russian territory. The explosion at the depot, located in Russia's Saratov region, caused a massive fire. The storage site supplied a nearby Russian airbase that is used to launch missile strikes on Ukraine. Ukrainian officials confirmed the attack, and Russian authorities acknowledged the incident, stating that emergency services were deployed to contain the blaze.\r\n\r\nThe targeted facility was situated approximately 600 kilometers (370 miles) east of the Ukrainian border and is considered vital to Russia’s ongoing military operations in the region.\r\n\r\nAs the war continues to intensify, the conflict between Ukraine and Russia shows no signs of easing, with both sides engaged in continued military strikes across borders. The situation remains fluid, with Ukraine urging the international community to provide unwavering support for its defense and sovereignty.","summary":"A deadly missile strike in Zaporizhzhia, southern Ukraine on Jan 8, claimed the lives of at least 13 civilians and left around 30 others injured, Ukrainian officials confirmed.","url":"https://www.newsx.com/world/13-civilians-killed-several-injured-after-russian-missile-attacks-zaporizhzhia/","image":"https://www.newsx.com/wp-content/uploads/2025/01/missile.png","video":null,"publish_date":"2025-01-09 01:04:13","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","category":"politics","source_country":"in","sentiment":0.157},{"id":279401108,"title":"Monedha kineze arrin nivelin m&euml; t&euml; ul&euml;t n&euml; 16 muaj nga frika e tarifave t&euml; Trump","text":"Renminbi gjendet nën presionin e dollarit më të fortë dhe shqetësimet për planet tregtare të presidentit të ardhshëm amerikan\n\nMonedha e Kinës është dobësuar dhe ka rënë nivelin më të ulët 16-mujor, pas të dhënave të forta ekonomike të SHBA-së dhe pasi potenciali për rritje të mprehta të tarifave nga administrata e ardhshme e Trump, nxit shqetësimin mbi perspektivat e rritjes për ekonominë e dytë më të madhe në botë.\n\nRenminbi brenda kufirit të Kinës ra 0.1 % në 7.33 Rmb kundrejt dollarit, niveli më i dobët që nga shtatori 2023, pavarësisht nga mbajtja e një norme fikse të qëndrueshme nga Banka Popullore e Kinës (PBoC) përpara marrjes së detyrës së Donald Trump më 20 janar.\n\nPresioni reflekton pjesërisht frikën, se tarifat e larta për produktet kineze të propozuara nga Trump do ta detyronin PBoC të dobësonte renminbi-n për të kompensuar ndikimin e tyre në eksporte, të cilat e kanë ndihmuar vendin të ruajë rritjen ekonomike mes kërkesës së dobët konsumatore brenda vendit.\n\nTë dhënat e forta të punësimit dhe shërbimeve në SHBA të martën forcuan gjithashtu pritshmëritë, që Rezerva Federale do të ulte normat më ngadalë sesa pritej më parë, në kontrast me Kinën, e cila po lehtëson politikën monetare për të luftuar presionet deflacioniste. Indeksi i dollarit amerikan është rritur me 0.5 % që nga të dhënat e së martës.\n\nPBoC ka deklaruar vendosmërinë e saj për të ruajtur “stabilitetin bazë” të renminbit dhe për të mos lejuar “tejkalimin” e kursit të këmbimit në tregje.\n\nPekini, i cili po përballet me thellimin e presioneve deflacioniste në ekonomi, që rrjedhin nga besimi i ulët i familjeve dhe investitorëve, është kthyer gradualisht drejt më shumë masave stimuluese për të nxitur rritjen. Të mërkurën, qeveria zgjeroi një program për të subvencionuar konsumatorët që tregtojnë pajisje të vjetra si kondicionerët dhe lavatriçet.\n\nPor shumë ekonomistë besojnë se qeveria kineze po vonon të shpallë më shumë plane shpenzimesh ndërsa pret marrjen e detyrës nga Trump, për të marrë më shumë qartësi mbi tarifat e mundshme. Presidenti i zgjedhur ka thënë se do të vendosë tarifa deri në 60 % ndaj Kinës.\n\nPBoC njoftoi të mërkurën një normë fikse ditore prej 7,1887 Rmb kundrejt dollarit, pothuajse e pandryshuar nga norma e së martës prej 7,1879 Rmb. Por presioni mbi kursin e këmbimit u rrit pasi të dhënat e forta ekonomike të SHBA-së çuan në rritje dollarit një ditë më parë.\n\nAnalistët vërejnë se megjithëse renminbi është nën presionin dollarit, monedha është forcuar në krahasim me monedhat e tjera.\n\nBahti tajlandez, rupia indoneziane, pesoja e Filipineve, dollari i Tajvanit, won koreane u dobësuan me 0.4 % kundrejt dollarit.\n\nNë Hong Kong, kostot e financimit për renminbin off-shore janë rritur ditët e fundit, si një shenjë që PBoC po përpiqet të mbrojë kursin e këmbimit kundër spekulatorëve.\n\nNdërsa renminbi brenda vendit nuk mund të tregtohet jashtë brezit 2 % të vendosur nga PBoC, nuk ekziston një kufizim i tillë për renminbin off-shore.\n\nAksionet kineze pësuan gjithashtu rënie, me indeksin CSI 300 të Kinës kontinentale që ra 0.2 % dhe standardin Hang Seng të Hong Kongut ra me 0.9 %. / FT","url":"https://monitor.al/monedha-kineze-arrin-nivelin-me-te-ulet-ne-16-muaj-nga-frika-e-tarifave-te-trump/","image":"https://monitor.al/wp-content/uploads/2025/01/monedha-kineze.jpg","video":null,"publish_date":"2025-01-09 00:54:14","author":"Eralda Zito","authors":["Eralda Zito"],"language":"en","source_country":"al","sentiment":-0.839},{"id":279401918,"title":"What to know about Trump's latest legal cases and his meeting with GOP Senators","text":"What to know about Trump's latest legal cases and his meeting with GOP Senators\n The Justice Department is pushing for the release of special counsel Jack Smith's final report on the investigation into President-elect Donald Trump's alleged efforts to overturn the 2020 election. CBS News political reporter and attorney Katrina Kaufman reports. Then, CBS News political correspondent Caitlin Huey-Burns has more on Trump's meeting with Republican Senators on Wednesday.","summary":"The Justice Department is pushing for the release of special counsel Jack Smith's final report on the investigation into President-elect Donald Trump's alleged efforts to overturn the 2020 election. CBS News political reporter and attorney Katrina Kaufman reports. Then, CBS News political correspondent Caitlin Huey-Burns has more on Trump's meeting with Republican Senators on Wednesday.","url":"https://www.cbsnews.com/video/what-know-trumps-latest-legal-cases-meeting-gop-senators/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/01/09/4899d8ef-48dd-4bc2-9037-7d200415520a/thumbnail/1200x630/325bd1a5cacc0a478abf39cb5cf4e793/cbsn-fusion-what-know-trumps-latest-legal-cases-meeting-gop-senators-thumbnail.jpg?v=6ffea931a1e284729a23a55e2e39","video":null,"publish_date":"2025-01-09 00:54:11","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.054},{"id":279400988,"title":"Jonathan J. Cooper, The Associated Press","text":"Jonathan J. Cooper, The Associated Press\nA new book alleges that someone at Fox News gave Trump's team an early look at town hall questionsWASHINGTON (AP) -- Someone inside Fox News gave Donald Trump's presidential campaign the questions he would face ahead of a...2025-01-08 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nThe DNC chair candidates discuss Joe Biden, Kamala Harris and winning Latino votersSCOTTSDALE, Ariz. (AP) -- Four people are running to be the next Democratic National Committee chair, looking to take on...2024-12-07 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nOutgoing DNC chair Jaime Harrison pushes back against critics of 'identity politics'SCOTTSDALE, Ariz. (AP) -- Democratic National Committee Chairman Jaime Harrison delivered a steadfast defense of his party's commitment to racial...2024-12-05 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRuben Gallego did better than most Democrats. He says his party needs to stoke working class rootsPHOENIX (AP) -- Building authentic connections with working-class voters can help Democrats find their way back to power in Washington...2024-11-15 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nDemocrat Ruben Gallego wins Arizona US Senate race against Republican Kari LakePHOENIX (AP) -- Democrat Ruben Gallego has been elected Arizona's first Latino U.S. senator, defeating Republican Kari Lake and preventing...2024-11-12 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump called Megyn Kelly 'nasty' 9 years ago. She just helped deliver his closing messageConservative podcaster Megyn Kelly delivered a fiery speech supporting Donald Trump during an event billed as his \"closing message\" on...2024-11-04 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRFK Jr. says Trump would push to remove fluoride from drinking water. 'It's possible,' Trump saysPHOENIX (AP) -- Robert F. Kennedy Jr., a prominent proponent of debunked public health claims whom Donald Trump has promised...2024-11-03 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. says Donald Trump would push to remove fluoride from drinking waterPHOENIX (AP) -- Robert F. Kennedy Jr., a prominent proponent of debunked public health claims whom Donald Trump has promised...2024-11-02 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nDemocrats go after Jill Stein, Cornel West in digital ads aimed at young votersPHOENIX (AP) -- Democrats are spending about $500,000 for a last-minute push to persuade voters in battleground states to reject...2024-10-28 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nWho does Trump see as 'enemies from within'?TEMPE, Ariz. (AP) -- Donald Trump's allies have tried in vain to persuade him to stop venting his rage against...2024-10-26 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump couldn't pronounce 'Assyrians.' The community is happy to be in the spotlightPHOENIX (AP) -- It was Donald Trump's mispronunciation that first caught attention.2024-10-18 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRuben Gallego divorce records unsealed but reveal little about Democratic Senate candidatePHOENIX (AP) -- Divorce records for Arizona Democratic Senate candidate Ruben Gallego and his ex-wife, Phoenix Mayor Kate Gallego, were...2024-10-17 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRuben Gallego and Kari Lake face off in debate for Arizona SenatePHOENIX (AP) -- Ruben Gallego and Kari Lake met Wednesday for the only debate of the Arizona Senate race, a...2024-10-09 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRuben Gallego and Kari Lake to face off in debate for Arizona SenatePHOENIX (AP) -- Ruben Gallego and Kari Lake meet Wednesday for the only debate of the Arizona Senate race, a...2024-10-09 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump's campaign says he raised $160 million in September, ended month with $283 million bankedPHOENIX (AP) -- Former President Donald Trump raised $160 million for his campaign in September and entered October with $28...2024-10-03 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKey Senate race in Arizona could hinge on voters who back Trump and the Democratic candidatePHOENIX (AP) -- If Ruben Gallego is going to give Democrats their fourth straight U.S. Senate victory in Arizona, he's...2024-09-30 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump says Ukraine is 'demolished' and dismisses its defense against Russia's invasionFormer President Donald Trump described Ukraine in bleak and mournful terms Wednesday, referring to its people as \"dead\" and the...2024-09-25 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump says Ukraine is 'dead' and dismisses its defense against Russia's invasionFormer President Donald Trump described Ukraine in bleak and mournful terms Wednesday, referring to its people as \"dead\" and the...2024-09-25 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump allies make another push to change Nebraska's Electoral College lawA top Donald Trump ally is pressuring Nebraska Republicans to award all of their state's Electoral College votes to the...2024-09-22 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKamala Harris to skip Al Smith dinner, a traditional event for major presidential candidatesPHOENIX (AP) -- Vice President Kamala Harris will skip this year's Al Smith charity dinner in New York, breaking with...2024-09-21 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. is being investigated for collecting dead whaleGLENDALE, Ariz. (AP) -- A federal law enforcement agency confirmed it's opened an investigation into Robert F. Kennedy Jr. after...2024-09-19 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKamala Harris steps up outreach to Mormon voters in battleground ArizonaPHOENIX (AP) -- Vice President Kamala Harris is stepping up her efforts to win over voters who belong to the...2024-09-19 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. becomes a frequent campaigner for Donald TrumpGLENDALE, Ariz. (AP) -- Three weeks after dropping his independent presidential campaign, Robert F. Kennedy Jr. has become a ubiquitous...2024-09-16 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nJD Vance says he laments that school shootings are a 'fact of life' and calls for better securityPHOENIX (AP) -- Republican vice presidential nominee JD Vance said Thursday that he lamented that school shootings are a \"fact...2024-09-05 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nJD Vance says school shootings are a 'fact of life,' calls for better securityPHOENIX (AP) -- School shootings are a \"fact of life,\" so the U.S. needs to harden security to prevent more...2024-09-05 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nJimmy McCain, a son of the late Arizona senator, registers as a Democrat and backs HarrisPHOENIX (AP) -- Jimmy McCain, a son of former Arizona senator and 2008 Republican presidential nominee John McCain, said this...2024-09-04 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\n'That's my dad!': Gus Walz tearfully cheers on his father as he accepts Democratic VP nominationGus Walz sat in the front row for the biggest moment of his father's life, and his pride exploded out...2024-08-22 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\n\"That's my dad!\": Gus Walz tearfully cheers on his father as he accepts Democratic VP nominationGus Walz sat in the front row for the biggest moment of his father's life, and his pride exploded out...2024-08-22 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nParents of American held by Hamas appeal for hostages' release during Democratic conventionThe parents of a 23-year-old American taken hostage by Hamas during the Oct. 7 attack on Israel gave a moving...2024-08-21 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. says he left a dead bear in Central Park as a prankWILMINGTON, Del. (AP) -- Independent presidential candidate Robert F. Kennedy Jr. once retrieved a bear that was killed by a...2024-08-04 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nDemocrat Ruben Gallego promotes Republican support in his Arizona Senate campaign against Kari LakeWILMINGTON, Del. (AP) -- Arizona Democrat Ruben Gallego is promoting Republican backing for his Senate campaign as the congressman works...2024-08-04 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nSecond gentleman Doug Emhoff acknowledges affair contributed to breakup for first marriageWILMINGTON, Del. (AP) -- Second gentleman Doug Emhoff acknowledged Saturday that he had an extramarital affair years ago that contributed...2024-08-03 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKari Lake wins GOP primary for closely watched Arizona Senate race, will face Gallego in NovemberPHOENIX (AP) -- Kari Lake won the Republican nomination for U.S. Senate in Arizona on Tuesday, setting up a fierce...2024-07-31 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKari Lake aims to win GOP primary for closely watched Arizona Senate racePHOENIX (AP) -- Kari Lake is looking to easily win the Republican nomination for U.S. Senate in Arizona on Tuesday...2024-07-30 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nHarris is endorsed by border mayors in swing-state Arizona as she faces GOP criticism on immigrationPHOENIX (AP) -- Vice President Kamala Harris highlighted endorsements from mayors of border towns in swing-state Arizona Monday as she...2024-07-29 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nFormer first lady Melania Trump makes a rare appearance on the Republican convention's last nightMILWAUKEE (AP) -- Melania Trump and Ivanka Trump were at the Republican National Convention Thursday, making a rare appearance in...2024-07-19 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKennedy apologizes after a video of him speaking to Trump leaksPHOENIX (AP) -- Robert F. Kennedy Jr. apologized Tuesday after a video was posted online showing part of a private...2024-07-16 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump and Biden mix it up over policy and each other in a debate that turns deeply personalPHOENIX (AP) -- They passed on a handshake at the start, and from there President Joe Biden and former President...2024-06-28 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump and Biden mix it up over policy and each other in a debate that turns deeply personal at timesPHOENIX (AP) -- They passed on a handshake at the start, and from there President Joe Biden and former President...2024-06-28 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump and Biden spar on economy and abortion at their presidential debatePHOENIX (AP) -- President Joe Biden and former President Donald Trump opened their first 2024 president debate without shaking hands...2024-06-27 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump and Biden spar on economy after skipping handshake at start of debatePHOENIX (AP) -- President Joe Biden and former President Donald Trump opened their first 2024 president debate without shaking hands...2024-06-27 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. didn't make the debate stage. He faces hurdles to stay relevantPHOENIX (AP) -- Independent presidential candidate Robert F. Kennedy Jr., won't be with his better-known rivals, President Joe Biden and...2024-06-27 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\n'Biden Bingo': The president's campaign adapts a classic game to include malarkey and aviatorsPHOENIX (AP) -- DeAnna Mireau reached into a container and fished out a scrap of paper.2024-06-14 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRepublicans echo Trump in response to Hunter Biden convictionPHOENIX (AP) -- Republicans responded to Hunter Biden's conviction on federal gun charges Tuesday with some version of, \"That's it?\"2024-06-12 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump is holding outdoor Las Vegas rally in scorching heat. His campaign has extra medics and waterLAS VEGAS (AP) -- Former President Donald Trump 's campaign hired extra medics, loading up on fans and water bottles...2024-06-09 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump will hold outdoor Las Vegas rally in scorching heat. His campaign has extra medics and waterLAS VEGAS (AP) -- Former President Donald Trump 's campaign is hiring extra medics, loading up on fans and water...2024-06-09 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKennedy says he has secured ballot access in enough states to win. That's not yet truePHOENIX (AP) -- Robert F. Kennedy Jr., claimed Friday that he's qualified for the ballot in enough states to win...2024-06-07 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump will campaign in Arizona following his hush money convictionPHOENIX (AP) -- Donald Trump returns to the campaign trail Thursday with a trip to Arizona, his first appearance in...2024-06-06 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nTrump to campaign in Arizona following hush money convictionPHOENIX (AP) -- Donald Trump returns to the campaign trail Thursday with a trip to Arizona, his first appearance in...2024-06-06 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nRobert F. Kennedy Jr. files complaint over rules for CNN's presidential debate next monthPHOENIX (AP) -- Independent presidential candidate Robert F. Kennedy Jr. filed an election complaint Wednesday alleging CNN is colluding with...2024-05-29 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKennedy condemns the removal of Confederate monumentsPHOENIX (AP) -- Independent presidential candidate Robert F. Kennedy Jr. has condemned the removal of Confederate statues, saying he had...2024-05-28 — Canadian Press\n\n Jonathan J. Cooper, The Associated Press\nKennedy blasts Biden, Trump over pandemic measures in pitch at Libertarian conventionIndependent presidential candidate Robert F. Kennedy Jr. accused Joe Biden and Donald Trump Friday of trampling on personal liberties in...2024-05-25 — Canadian Press","url":"https://www.nationalnewswatch.com/author/jonathan-j-cooper-the-associated-press","image":"https://assets-nnw.nationalnewswatch.com/_1200x630_crop_center-center_82_none/NNW-WEBSITE_CARD-GENERIC.jpg?mtime=1697406739","video":null,"publish_date":"2025-01-09 00:53:13","author":"Jonathan J. Cooper","authors":["Jonathan J. Cooper"],"language":"en","source_country":"ca","sentiment":-0.038},{"id":279400984,"title":"National Newswatch","text":"Just before the meeting got underway, Finance Minister Dominic LeBlanc posted a statement to social media thanking supporters for their encouragement and saying he's decided not to run in the upcoming race.\n\nThe New Brunswick MP wrote that Canada is \"at a critical juncture in its relationship with its most important ally and trading partner, the United States.\"\n\nSpeaking to reporters before the meeting, LeBlanc said he was genuinely touched that caucus colleagues encouraged him to seek the leadership.\n\n\"I decided that the most important thing I should do over the next few months is my job as minister of finance and intergovernmental affairs,\" he said, adding he will be \"solely focused on the real economic threat that American tariffs represent.\"\n\nIncoming U.S. president Donald Trump threatened in November to impose a 25 per cent tariff on all goods from Canada and Mexico when he takes office, unless both countries act to stop migrants and illegal drugs from crossing the border into the United States.\n\nIn December Canada announced a $1.3-billion plan to beef up the border. That did not deter Trump, who has ramped up his rhetoric in recent days insisting the tariffs are coming and threatening to use \"economic force\" to annex Canada and make it the 51st state.\n\nLeBlanc has travelled to Florida twice since Trump won the U.S. election in November to meet with the president-elect and key members of his team.\n\nHe first accompanied Prime Minister Justin Trudeau to Trump's Mar-a-Lago estate for dinner, where a small Canadian delegation tried to make the case that tariffs would hurt American citizens and Canada's economy. It was in response to that argument that Trump reportedly first made the quip that Canada ought to join the United States -- something LeBlanc told reporters at the time was \"clearly a joke.\"\n\nThe Liberals are meeting for the first time since Trudeau announced Monday he plans to step down as leader once a successor is chosen.\n\nThe national meeting, set to take place both in person and online, was originally set to last six hours to give MPs time to discuss Trudeau's previous refusal to resign.\n\nNow, the focus will be on next steps for the party as it begins a national search for a leader who can hold their own against popular Conservative Leader Pierre Poilievre.\n\nSome from the party caucus, including cabinet ministers Jonathan Wilkinson, Steven MacKinnon and Karina Gould, are fielding calls from members of the party rank-and-file and seriously considering leadership bids.\n\nWilkinson told reporters Wednesday he's speaking with his family about the possibility.\n\n\"I would also say that the conversations with my colleagues are very important. I want to ensure that I have a sufficient amount of support to be competitive in the race if I'm going to enter it, but I do think I have some important things to say,\" he said.\n\nOther ministers, including Chrystia Freeland, Anita Anand and Francois-Philippe Champagne, are making the rounds with MPs and party members to gauge their support.\n\nTop Liberal brass are gathering behind closed doors all week to get the leadership contest underway.\n\nThe national party board has to assemble a leadership vote committee to organize and set rules for the coming race. Those rules could take days to produce once the committee is struck.\n\nThis report by The Canadian Press was first published Jan. 8, 2025.","url":"https://nationalnewswatch.com/2025/01/08/cp-newsalert-dominic-leblanc-says-he-wont-run-for-liberal-leadership","image":"https://assets-nnw.nationalnewswatch.com/articles/_1200x630_crop_center-center_82_none/dom-cp.jpg?mtime=1736350445","video":null,"publish_date":"2025-01-09 00:53:13","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.005},{"id":279400508,"title":"Merrick Garland Still Plans to Release One of Jack Smith's Reports While Withholding Another","text":"With President-elect Donald Trump to be inaugurated in less than two weeks, Attorney General Merrick Garland is still planning on releasing Special Counsel Jack Smith's report in the criminal case he brought against Trump for the events on and leading up to January 6, 2021. Garland, however, plans on holding onto a report to do with other criminal charges brought against Trump over classified documents at Mar-a-Lago. \n\nWhile Garland won't be releasing the report on classified documents, it's not exactly out of the goodness of his heart. Reporting from The Hill earlier on Wednesday covered how Trump's co-defendants, driver Walt Nauta and property manager Carlos De Oliveira, still face trial. \n\nAs The Hill mentioned:\n\nAttorney General Merrick Garland plans to release only the volume of special counsel Jack Smith’s report dealing with Donald Trump’s plans to subvert the transfer of power after his loss in the 2020 election, holding back on sharing the Mar-a-Lago report while the president-elect’s two co-defendants still face trial.\n\nFederal prosecutors made Garland’s plans clear in a Wednesday morning filing urging an appeals court to reject a bid from Trump valet Walt Nauta and property manager Carlos De Oliveira to bar the attorney general from releasing the report in its entirety.Garland made the determination at Smith’s recommendation “to avoid any risk of prejudice.”“The Attorney General determined that he will not make a public release of Volume Two while defendants’ cases remain pending. That should be the end of the matter,” prosecutors wrote.The filing says the top members of the House and Senate Judiciary committees will be able to review the Mar-a-Lago report at the Department of Justice (DOJ).Nauta and de Oliveira opposed that in a later filing, citing risk the lawmakers could leak details of the report....The filing comes amid a broader legal battle by Trump and his co-defendants to block Smith from releasing both sections of his two-volume report.The trio first went to U.S. District Judge Aileen Cannon, who agreed Tuesday to block release of the whole report without waiting for a promised filing by Smith’s team....Cannon also enjoined Smith from releasing the portion of the report dealing with Jan. 6, 2021, a matter that was overseen by a Washington, D.C.-based federal judge.Trump, meanwhile, sent a letter to Garland urging him to fire Smith and leave the decision of whether to release the report to his own attorney general in the incoming administration.Nauta, De Oliveira and the president-elect made nearly identical filings before the 11th Circuit, which is now weighing the matter.\n\nNauta's name should especially sound familiar, as Townhall has covered the intimidation tactics prosecutors used to get to such a defendant. It was a move that certainly drew the ire of House Judiciary Chairman Jim Jordan (R-OH) over the years, ever since this legal battle has been going on since the summer of 2023. \n\nThere's been news about Garland's plans to release Smith's report for months now, even after Trump won the election. Although Smith moved to drop all charges against Trump weeks after last November's election, he did so with prejudice, meaning another prosecutor could theoretically bring the charges back once Trump finishes his second term in 2029.\n\nSuch cases aren't the only ones brought against Trump, though. Judge Juan Merchan meanwhile scheduled Trump's sentencing in the hush money case brought by Manhattan DA Alvin Bragg, for which he was convicted of 34 felony cases on May 30 of last year, for this Friday, on January 10. Trump asked the U.S. Supreme Court earlier on Wednesday to block that, as Leah covered.","url":"https://townhall.com/tipsheet/rebeccadowns/2025/01/08/heres-the-report-from-jack-smith-that-merrick-garland-still-plans-to-release-n2650232","image":"https://media.townhall.com/cdn/hodl/2024/248/e6694c4a-bcba-47cc-b250-8cd958ebf788.jpg","video":null,"publish_date":"2025-01-09 00:49:13","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.297},{"id":279401272,"title":"Trump meets with Republicans on Capitol Hill as GOP struggles to agree on legislative strategy","text":"WASHINGTON (AP) — President-elect Donald Trump is meeting privately on Capitol Hill late Wednesday with Republican senators as House and Senate GOP leaders are straining to come up with a strategy for tackling his legislative priorities as the party takes power in Washington.\n\nTrump said it “feels great” to be back inside the U.S. Capitol for the first time since he left office four years ago, after the Jan. 6, 2021, riot by his supporters. With his wife, Melania, he also paid tribute to the late President Jimmy Carter lying in state in the Rotunda ahead of funeral services Thursday.\n\nWith Trump taking the oath of office on Jan. 20, Republicans have no time to waste.\n\n“We’re looking at the one bill versus two bills, and whatever it is, it doesn’t matter,” Trump said about the conflicting strategies as he arrived. “We’re going to get the result.”\n\nTrump’s return to Capitol Hill marked a changed era in Washington as he strode through the corridors where four years ago a mob of his supporters had laid siege to the U.S. Capitol as senators fled to safety in a failed attempt to salvage Trump’s election defeat to President Joe Biden.\n\nInside the lengthy meeting, Trump received applause and bursts of laughter from the Republican senators staying late into the evening to confer with him behind closed doors. The session stretched past an hour. He also met with Senate Majority Leader John Thune, R-S.D., and is also expected to huddle over the weekend with House GOP lawmakers at his private club Mar-a-Lago.\n\nPolitical capital is almost always at its peak at the start of a new presidential term, even more so because this is Trump’s second and he is prevented under the Constitution from a third. Moving swiftly is all the more important because the GOP majorities are slim, particularly in the House, where House Speaker Mike Johnson can’t afford to lose hardly any votes.\n\nJohnson, who greeted Trump at the Capitol, has said he sees himself operating as the GOP quarterback with Trump as their coach calling plays. But Republicans are quickly finding themselves in a dilemma: What happens when the coach changes his mind?\n\nTrump has given Republicans on Capitol Hill mixed signals, flip-flopping over what is the best approach. Over the weekend, he said he wanted “one big, beautiful bill.” By Monday, he had reopened the door to two. House Republicans want a single package. Senate GOP leaders are proposing at least two.\n\nAt stake are tax cuts, border security, money to deport immigrants and efforts to boost oil and gas energy production — priorities for Republicans coming to the White House, House and Senate.\n\n“You all heard me say over the last year we were developing — using my football metaphors — we were developing a playbook,” Johnson, R-La., said Tuesday.\n\n“We have very well-designed plays. Now we are working out the sequence of those plays, working with a new head coach, in that metaphor, President Trump,” he said. “We are excited about how all of that is rolling out.”\n\nBudget reconciliation carries high risk, but potentially high reward\n\nRepublicans are relying on perhaps the most complicated legislative tool at their disposal, the budget reconciliation process, as the vehicle to advance Trump’s priorities.\n\nIt’s a strategy with high risk, but also potentially high reward.\n\nReconciliation allows Congress to pass bills on a majority basis, without the threat of a filibuster in the Senate that could delay or kill action. But it is also a difficult, strict and time-consuming process that can fall apart at any moment.\n\nDemocrats used the same tool during the Obama era to approve the Affordable Care Act in 2010 without any Republican support. Republicans used it during Trump’s first term to pass the 2017 Tax Cuts and Jobs Act without Democrats.\n\nUsing reconciliation is a herculean task. Doing it twice could prove doubly difficult.\n\nDemocrats are trying to stand their ground\n\nHouse Democratic Caucus Chairman Pete Aguilar of California said what’s at stake is that Trump and the Republicans are proposing a tax giveaway to the wealthy and budget cuts that will cut social services and other programs that Americans rely on.\n\nRepublicans are “huddling behind closed doors” focused on “how they provide tax cuts to millionaires and billionaires and how they cut programs that hurt people,” he said.\n\nRepublicans want to all get on the same page\n\nWyoming Sen. John Barrasso, the second-ranking Republican, said Wednesday’s meeting will help determine “how we all get on the same page with the House.”\n\nMany GOP senators preferred the strategy Thune proposed, which would break Trump’s priorities into two bills.\n\nThune said one could be approved within the first 30 days of the new administration with provisions for border security and mass deportations, energy development and military funds. The tax cuts would come later, in a second package.\n\nSen. Shelley Moore Capito of West Virginia, a member of GOP leadership who invited the president-elect to meet with senators, said she could go with one or two bills.\n\n“But I still think the two-bill strategy is better simply because I think we can get a victory in early, which will show the American people and the president we mean business,” she said.\n\nTrump plans meetings this weekend at Mar-a-Lago with House Republicans\n\nRep. Kevin Hern, R-Okla., among those House Republicans headed to Florida for this weekend’s meetings, said he supports the House’s one-bill approach.\n\n“You’re not going to get everything that you want,” he said. “So how do we put something together that everybody can get something?”\n\nOnce back in Florida on Thursday, Trump is hosting Republican governors for dinner at Mar-a-Lago.\n\nNevada Gov. Joe Lombardo is one of the governors headed to South Florida, according to an official who spoke on condition of anonymity because the details were not public. Utah Gov. Spencer Cox is also expected to attend the dinner, according to a schedule released by the governor’s office earlier this week.\n\nDuring his first term, Trump was known for changing his mind, a habit that members of Congress became accustomed to as they navigated his presidency.\n\nTrump ally Sen. Markwayne Mullin, R-Okla., said Trump just “wants all of it done.”\n\n“He supports the one bill, but he also wants both,” he said. “Either one. If it takes two, it takes two.”\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President-elect Donald Trump is meeting privately on Capitol Hill late Wednesday with Republican senators as House and Senate GOP leaders are straining to come...","url":"https://wsvn.com/news/politics/trump-meets-with-republicans-on-capitol-hill-as-gop-struggles-to-agree-on-legislative-strategy/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/11/111524-Trump-photo.png","video":null,"publish_date":"2025-01-09 00:48:54","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.14},{"id":279399858,"title":"The British Parliament Votes Against The New National Inquiry Into The Rape Gangs","text":"A Conservative attempt to establish a new national inquiry into grooming gangs was rejected in the House of Commons on Tuesday. The proposed amendment to the Children’s Wellbeing Bill was voted down by 364 votes to 111, a majority of 253.\r\nThe Controversial Proposal\r\nThe amendment sought to initiate a fresh investigation into grooming gangs, a contentious issue that has garnered significant attention in recent years. However, critics argued that the move was largely symbolic and accused the Tories of using the issue for political leverage rather than genuine reform.\r\n\r\nEven if the amendment had passed, it would not have mandated the government to launch the proposed inquiry. Instead, it would have derailed the broader Children’s Wellbeing Bill, which aims to reform children’s care services and improve educational standards.\r\n\r\nBREAKING: The British Parliament has voted against a National inquiry into the r*pe gangs (Pakistani Grooming Gangs), with the motion defeated by 364 votes to 111.\r\n\r\nMajority 364 MPs chose national disgrace and shame. pic.twitter.com/S6y1X8DgdQ\r\n— Megh Updates 🚨™ (@MeghUpdates) January 8, 2025\r\n\r\nLabour and Opposition Responses\r\nLabour MPs unanimously opposed the amendment, with party leaders maintaining that inquiries into child sexual exploitation should be conducted locally rather than at the national level. Safeguarding minister Jess Phillips defended the government’s stance, emphasizing that addressing these cases on a local level ensures targeted and actionable outcomes.\r\n\r\nLabour has also committed to implementing the recommendations from a prior seven-year national inquiry into child sexual abuse, led by Professor Alexis Jay, which concluded in 2022. The Conservatives, despite commissioning that inquiry, have not acted on its recommendations during their time in office.\r\nTory and Reform Party Support\r\nAmong the 111 MPs who supported the amendment were 101 Conservative MPs and all five members of the Reform Party. Notably, some senior Tory figures, including former Prime Minister Rishi Sunak and ex-Home Secretaries James Cleverly and Suella Braverman, abstained from the vote.\r\nLiberal Democrats’ Position\r\nThe Liberal Democrats abstained from the vote, expressing concerns about blocking the bill's broader measures aimed at child safeguarding. However, they announced plans to propose their own amendment at the committee stage, focusing on fully implementing the recommendations from the Alexis Jay inquiry.\r\nRenewed Attention on Grooming Gangs\r\nThe debate was reignited following comments by tech mogul Elon Musk, who criticized Labour leader Sir Keir Starmer and Jess Phillips for their handling of the issue. Musk’s remarks, shared widely on social media, have brought grooming gangs back into the political spotlight.\r\nWhat’s Next for the Bill?\r\nThe Children’s Wellbeing Bill will now proceed to the committee stage, where further amendments may be introduced. While the Conservatives’ bid for a new inquiry was unsuccessful, the vote highlights the ongoing political sensitivity surrounding grooming gangs and child safeguarding issues.\r\n\r\nAs the debate continues, calls for action—whether through new inquiries or implementing existing recommendations—underscore the urgent need to address these deeply troubling crimes.\r\n\r\nAlso Read: Mismanagement Of Biden...': Donald Trump Slams US President For LA Wildfires","summary":"A Conservative attempt to establish a new national inquiry into grooming gangs was rejected in the House of Commons on Tuesday.","url":"https://www.newsx.com/world/the-british-parliament-votes-against-the-new-national-inquiry-into-the-rape-gangs/","image":"https://www.newsx.com/wp-content/uploads/2025/01/The-british-parliament.png","video":null,"publish_date":"2025-01-09 00:44:13","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","category":"politics","source_country":"in","sentiment":0.115},{"id":279399860,"title":"&#8216;Mismanagement Of Biden&#8230;&#8217;: Donald Trump Slams US President For LA Wildfires","text":"The devastating wildfires sweeping through Los Angeles and surrounding areas have claimed lives, destroyed thousands of structures, and forced mass evacuations. Amid the chaos, U.S. President-elect Donald Trump has directed sharp criticism at California Governor Gavin Newsom, accusing him of mismanagement and prioritizing environmental concerns over residents' safety.\r\nTrump's Accusations on Water Management\r\nIn a series of posts on Truth Social, Trump alleged that Newsom refused to sign a water restoration declaration that could have redirected excess rain and snowmelt to California. He claimed this decision was made to protect a fish species, the Delta smelt, rather than ensuring sufficient water supplies for the state.\r\n\r\nQuoting it on X, Trump said, \"The fires in Los Angeles may go down, in dollar amount, as the worst in the History of our Country. In many circles, they’re doubting whether insurance companies will even have enough money to pay for this catastrophe. Let this serve, and be emblematic, of the gross incompetence and mismanagement of the Biden/Newscum Duo. January 20th cannot come fast enough!\"\r\n\r\n\r\n\r\nThe fires in Los Angeles may go down, in dollar amount, as the worst in the History of our Country. In many circles, they’re doubting whether insurance companies will even have enough money to pay for this catastrophe. Let this serve, and be emblematic, of the gross incompetence…\r\n— Donald J. Trump Posts From His Truth Social (@TrumpDailyPosts) January 8, 2025\r\n\r\n\r\n“Governor Gavin Newscum refused to sign the water restoration declaration... He wanted to protect an essentially worthless fish called a smelt, but didn’t care about the people of California. Now the ultimate price is being paid,” Trump wrote.\r\n\r\nHe also blamed Newsom for inadequate firefighting resources, stating, “NO WATER IN THE FIRE HYDRANTS, NO MONEY IN FEMA. THIS IS WHAT JOE BIDEN IS LEAVING ME. THANKS JOE!”\r\nImpact of the Wildfires\r\nThe fires have wreaked havoc across the region, with the Palisades Fire consuming over 5,000 acres and destroying approximately 1,000 structures in the Pacific Palisades neighborhood. Meanwhile, the Eaton Fire in Altadena has burned 2,227 acres, and the Hurst Fire northeast of San Fernando has scorched at least 500 acres.\r\n\r\nLos Angeles County Fire Chief Anthony Marrone confirmed two fatalities and multiple injuries due to the Eaton Fire. Approximately 100 structures have been destroyed in this blaze alone.\r\nEmergency Response and Challenges\r\nFire officials have acknowledged the unprecedented scale of the crisis. LAPD Chief James McDonnell stated, “Los Angeles County and all 29 fire departments in the county are not prepared for this type of widespread disaster. The sustained winds and low humidity levels have created a firestorm we were not fully equipped to combat.”\r\n\r\nMcDonnell noted that prepositioned resources from northern California were insufficient to address the magnitude of four simultaneous fires.\r\nGovernor Newsom’s Defense\r\nIn response to the escalating crisis, Governor Newsom declared a state of emergency and visited affected areas to support firefighting efforts. During a press conference, he commended first responders for their rapid action and urged residents to follow evacuation orders.\r\n\r\n“This is a highly dangerous windstorm creating extreme fire risk, and we’re not out of the woods yet,” Newsom said. He emphasized the urgency of adhering to emergency protocols and expressed gratitude to firefighters battling the infernos.\r\nDivided Opinions on Accountability\r\nWhile Trump has laid the blame squarely on Newsom and the state’s water policies, critics argue that federal resource limitations and climate change also play a significant role in exacerbating wildfires. Newsom’s supporters maintain that the governor has been proactive in addressing fire risks but faces challenges due to the sheer scale of the disaster and federal inaction.\r\n\r\nContinue Reading: LA Is Burning! How Can One Help ? Barack Obama Shares","summary":"The devastating wildfires sweeping through Los Angeles and surrounding areas have claimed lives, destroyed thousands of structures, and forced mass evacuations.","url":"https://www.newsx.com/world/mismanagement-of-biden-donald-trump-slams-us-president-for-la-wildfires/","image":"https://www.newsx.com/wp-content/uploads/2025/01/la-2.png","video":null,"publish_date":"2025-01-09 00:44:13","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","category":"politics","source_country":"in","sentiment":-0.304},{"id":279399826,"title":"Israeli attacks kill 46 in Gaza as ceasefire talks continue","text":"At least 46 Palestinians have been killed in Israeli attacks across Gaza, as international mediators continued talks aimed at securing a truce and captives-for-prisoners exchange.\n\nMedical sources provided Al Jazeera with Wednesday’s death toll in Gaza as Israeli forces also conducted several raids across the occupied West Bank, killing three people.\n\nAt least 45,936 people have been killed in Gaza, according to Palestinian officials, with another 109,274 wounded since Israel began its war in the wake of the October 7, 2023 attack by Hamas fighters on southern Israel. That attack killed at least 1,139 people, according to an Al Jazeera tally based on Israeli statistics, and around 250 others were taken captive.\n\nReporting from Deir el-Balah, Al Jazeera’s Tareq Abu Azzoum said the majority of Israeli attacks on Wednesday were concentrated in the north of the Gaza Strip, particularly around Gaza City.\n\nAn Israeli strike on a Gaza City park killed five people and an attack on a school sheltering displaced people in Jabalia killed four, he said. In central Gaza, at least 10 people were killed in a strike on a family home in the Bureij refugee camp, including women and children, survivors said.\n\n“There has been an intensification of air strikes since the early hours of this morning,” Abu Azzoum said, adding that Israeli attacks also injured four telecommunications employees who were working in maintaining internet landlines in Gaza City.\n\n“What we saw in the past few hours is very devastating situation, especially in Gaza City, which has been the epicentre of military attacks, especially in densely populated areas,” he said.\n\nHospitals out of service\n\nRawya Taboura, a nurse at the Indonesian Hospital in Beit Lahiya, northern Gaza, told Al Jazeera the health facility is subject to direct Israeli shelling “targeting the hospital walls and its surroundings” and preventing aid deliveries.\n\nGaza’s Health Ministry said earlier this week that all three major hospitals in Gaza’s north remain out of service due to the fighting, with the director of the Kamal Adwan Hospital, Abu Safia, remaining detained by Israeli forces.\n\n“Unfortunately, so far, no one has been able to provide aid due to the difficulty of the situation outside the hospital and the difficulty of coordinating with the relevant parties,” Taboura said.\n\n“We have not been able to provide aid to the hospital,” she added. “The situation in the hospital is very dire.”\n\nFurther south, Nasser Hospital in Khan Younis announced it would shut down operations at 5pm (15:00 GMT) on Wednesday due to a lack of fuel, with the Al-Aqsa Hospital in central Deir el-Balah reporting it was out of basic medicine and supplies.\n\nOn Wednesday, the International Federation of Red Cross and Red Crescent Societies (IFRC) was among the international aid groups calling for unhindered access to Gaza. Aid groups have repeatedly accused Israel of stifling aid access.\n\nThe IFRC said that dire winter weather conditions were “exacerbating the unbearable conditions” in Gaza, with many families left “clinging on to survival in makeshift camps, without even the most basic necessities, such as blankets”.\n\nThe United Nations Children’s Fund (UNICEF), meanwhile, reported that at least 74 children had been killed in Gaza in the first week of 2025, “suffering from attacks, deprivation, and increasing exposure to the cold”.\n\nThe figure included eight infants and newborns who have died from hypothermia in recent days.\n\nMore than a million children are among Gaza’s displaced, with many living in makeshift tents with little protection from the elements, the agency said.\n\n‘Heinous crimes’\n\nAs the fighting rages in Gaza, Israeli raids have continued across the occupied West Bank.\n\nOn Wednesday, the Commission of Detainees and Ex-Detainees Affairs and the Palestinian Prisoner’s Society (PPS) said 45 Palestinians have been arrested since Tuesday night across the governorates of Hebron, Nablus, Tubas, Tulkarem, Ramallah, and Jerusalem.\n\nIn Bethlehem, several teachers and students suffered injuries after inhaling tear gas that Israeli soldiers launched at the Kisan School east of Bethlehem, the official Palestinian news agency Wafa reported.\n\nThe tear gas was reportedly a response to some students throwing stones at Israeli military vehicles.\n\nMeanwhile, three Palestinians, including two children, were killed by an Israeli air strike on the town of Tammun on Wednesday in Tubas governorate.\n\nThe killed children were identified as nine-year-old Rida Bisharat and 10-year-old Hamza Bisharat by the Palestinian Foreign Ministry. It described the strike as a “heinous crime”.\n\nThe ministry further said Israel’s “application of its aggressive policies in the West Bank” was “in flagrant violation of international law and the Geneva Conventions”.\n\nCeasefire talks continuing\n\nAs the fighting continued, mediators from Qatar, Egypt, and the United States were pushing forward with efforts to broker an agreement between Israel and Hamas that would see a ceasefire and exchange of Israeli captives held in Gaza for Palestinian prisoners held in Israeli jails. \n\nSpeaking from Paris, France on Wednesday, US Secretary of State Antony Blinken maintained that an agreement was “very close”.\n\nHowever, past efforts to secure a trace have repeatedly failed, with both Hamas and Israel accusing each other of changing the terms.\n\nWashington has also been criticised for not imposing more leverage on its “ironclad” ally Israel, to which it provides billions of dollars in military aid.\n\nMeanwhile, US President-elect Donald Trump’s Middle East envoy appointee, Steve Witkoff, on Tuesday said he would travel to Doha, Qatar to join the negotiations. He expressed hope that an agreement would be reached before Trump takes office on January 20.\n\nFor his part, speaking at a news conference on Tuesday, Trump told reporters that “all hell will break out” if a deal is not reached by the time he takes office. He declined to define what that means, or if it could spell increased US involvement in the conflict.\n\nLater on Wednesday, Israeli Defence Minister Israel Katz said the bodies of two captives, Youssef and Hamza Ziyadne, had been recovered in Gaza.","url":"https://stkittsgazette.com/israeli-attacks-kill-46-in-gaza-as-ceasefire-talks-continue/","image":"https://stkittsgazette.com/app/uploads/2025/01/AFP__20250108__36T63HB__v1__HighRes__PalestinianIsraelConflict-1736358097-zt65Y1.jpeg","video":null,"publish_date":"2025-01-09 00:43:14","author":null,"language":"en","category":"politics","source_country":"kn","sentiment":-0.523},{"id":279399820,"title":"Russian strike kills 13 in Ukraine’s Zaporizhzhia","text":"A Russian guided bomb attack on the southern Ukrainian city of Zaporizhzhia has killed at least 13 civilians and injured about 30 others, officials said.\n\nGraphic footage posted on Ukrainian President Volodymyr Zelenskyy’s Telegram page on Wednesday showed bloodied civilians lying in a city street being treated by emergency services.\n\n“There is nothing more brutal than aerial bombing of a city, knowing that ordinary civilians will suffer,” Zelenskyy wrote on X.\n\nHigh-rise residential blocks, an industrial facility and other infrastructure were damaged in the attack, Ukraine’s Prosecutor General’s Office said on Telegram on Wednesday. The debris hit a tram and a bus with passengers inside, it added.\n\nRegional Governor Ivan Fedorov said Russian forces launched guided bombs at a residential area in the city in the middle of the afternoon, and at least two residential buildings were struck in the attack.\n\nMoscow has frequently launched aerial attacks on civilian infrastructure during its almost three-year war on Ukraine. It has consistently denied targeting civilians.\n\nAl Jazeera’s Jonah Hull, reporting from Kharkiv in Ukraine, said that “strikes were aimed at what has been described as an ‘industrial site’.”\n\nHull described “scenes of devastation outside a factory, in a multi-storey apartment building opposite … in addition to a passing tram and minibus, which would have been carrying passengers.”\n\nMarina Miron, a military analyst at King’s College London, told Al Jazeera that “the plant had already been targeted in November, as the Russians say Ukrainians were using it to assemble drones”.\n\n“Owing to the deaths of civilians, however, there is a possibility that Russian navigation systems were jammed,” said Miron.\n\nThe attack comes as both Russia and Ukraine seek to project strength before US President-elect Donald Trump’s inauguration on January 20.\n\nEarlier in the day, the Ukrainian military said it had struck a fuel storage depot inside Russia, causing a huge blaze at a facility that supplies missiles to a Russian air base.\n\nUkraine’s General Staff said that the assault hit the storage facility near Engels, in Russia’s Saratov region, about 600km (373 miles) east of the Ukrainian border.\n\nAs Ukraine faces certain restrictions in using Western-supplied missiles, Kyiv has been developing its own long-range arsenal capable of reaching targets behind its front line.\n\nThe attacks have disrupted Russian logistics in the war, which began on February 24, 2022.\n\nEarlier on Wednesday, Zelenskyy said that countries wanting to end the war should offer Ukraine assurances about its future defence.\n\n“To be honest, I believe that we have a right to demand serious security guarantees from countries that aim for the peace in the world,” Zelenskyy said.\n\nUkraine’s leader was speaking at a news conference in Kyiv, responding to comments from US President-elect Donald Trump that he understood Russia’s opposition to neighbouring Ukraine joining NATO.\n\nSpeaking to reporters from his Mar-a-Lago estate in a wide-ranging media conference late on Tuesday, Trump said “Russia has somebody right on their doorstep, and I could understand their feelings about that.”\n\nThe United States, Germany, Hungary and Slovakia have stood in the way of Ukraine immediately joining the 32-nation NATO alliance, Zelenskyy noted.","url":"https://stkittsgazette.com/russian-strike-kills-13-in-ukraines-zaporizhzhia/","image":"https://stkittsgazette.com/app/uploads/2024/12/12259175-1734167042-Q55EQ9.jpeg","video":null,"publish_date":"2025-01-09 00:43:14","author":null,"language":"en","category":"politics","source_country":"kn","sentiment":-0.382},{"id":279399822,"title":"US Justice Department to release only part of Trump investigation report","text":"United States officials have announced plans to release only part of a report detailing federal investigations into President-elect Donald Trump, following a court decision to block some of the findings.\n\nOn Wednesday, the Department of Justice indicated that the published report would focus on Special Counsel Jack Smith’s probe into Trump’s efforts to undo the results of the 2020 election.\n\nIt would not, however, delve into a second federal investigation that looked at Trump’s alleged mishandling of classified documents while out of office, following the end of his first term in 2021.\n\nThe announcement means that certain insight into classified documents investigation is unlikely to reach the public in the foreseeable future.\n\nTrump is set to take office for his second term in less than two weeks, on January 20, at which point the Justice Department will fall under his control.\n\nThe classified documents investigation was once considered the most threatening to Trump, who has been embroiled in a sprawling web of legal cases. He is the first US president to be convicted of felony crimes.\n\nTrump, however, has denied wrongdoing in all the cases. He has repeatedly criticised the investigations as politically motivated and “fake”.\n\nWhile the classified documents section of the report will not be unveiled to the public, the Justice Department has indicated it would make its contents available to the chairmen and ranking members of the House and Senate Judiciary Committees.\n\nThose members must agree not to make the section public while legal proceedings over the classified documents case continue.\n\n“This limited disclosure will further the public interest in keeping congressional leadership apprised of a significant matter within the Department while safeguarding defendants’ interest,” the Justice Department wrote in its court filings.\n\nThose proceedings were at the crux of the decision to nix the publication of the classified documents section of the report.\n\nOn Tuesday, a federal judge, Aileen Cannon, temporarily blocked its release, citing the continuing legal fight.\n\nWhile the charges against Trump in the classified documents case were dropped in November, his two co-defendants — Trump employees Walt Nauta and Carlos De Oliveira — continue to face the possibility of a criminal trial.\n\nNauta, an aide, and De Oliveira, a maintenance employee at Trump’s Mar-a-Lago estate, have been accused of helping the president-elect withhold and conceal the classified documents, despite a subpoena to turn them over.\n\nDefence lawyers have argued that releasing the report would improperly interfere with their right to a fair hearing.\n\nThe Justice Department has not yet indicated when it would publish the other volume of the report, which focused on the allegations of election interference.\n\nSmith filed to drop the charges in that case in November as well, citing Trump’s impending return to office. He cited Justice Department policy against prosecuting a sitting president.\n\nThat case centred on Trump’s actions in the lead-up and after the November 2020 election, when the Republican incumbent faced Democrat Joe Biden for the presidency.\n\nTrump ultimately lost. But Smith and his team of federal prosecutors have argued Trump entered into a conspiracy to defraud the US by overturning his defeat and disrupting official proceedings to certify the correct result.\n\nTrump has continued to falsely claim that he won the 2020 race and that his victory was denied by widespread voter fraud.\n\nIn Wednesday’s court filing, the Justice Department said that Attorney General Merrick Garland had a “clear” authority to release the volume of the report centred on the election interference charges.\n\n“Indeed, with respect to Volume One of the Final Report, defendants are hardly differently situated than any other member of the public,” the department said.\n\nGarland, a member of the administration of outgoing President Biden, appointed Smith as special counsel in 2022 to avoid any conflict of interest a political appointee might have leading the case.\n\nJustice Department regulations require Smith to submit a final report to Garland.\n\nThe attorney general has said he will make public any special counsel reports he receives: He previously released a report written by Special Counsel Robert Hur into Biden’s handling of classified documents outside of public office.\n\nTrump and his defence team, however, have fought to stop the release. At a Tuesday news conference at Mar-a-Lago, Trump blasted Smith as a “disgrace”.\n\n“He wanted to do a report just before I take office probably, so he’ll do like a 500-page report, and it’ll be a fake report, just like the investigation was a fake investigation,” Trump said. “Why should he be allowed to write a fake report?”","url":"https://stkittsgazette.com/us-justice-department-to-release-only-part-of-trump-investigation-report/","image":"https://stkittsgazette.com/app/uploads/2024/12/AFP__20241216__36QG37Y__v1__HighRes__SyriaConflictMassGrave-1734354601-56m2Qv.jpeg","video":null,"publish_date":"2025-01-09 00:43:14","author":null,"language":"en","category":"politics","source_country":"kn","sentiment":-0.24},{"id":279399818,"title":"Israeli attacks kill 46 in Gaza as ceasefire talks continue","text":"At least 46 Palestinians have been killed in Israeli attacks across Gaza, as international mediators continued talks aimed at securing a truce and captives-for-prisoners exchange.\n\nMedical sources provided Al Jazeera with Wednesday’s death toll in Gaza as Israeli forces also conducted several raids across the occupied West Bank, killing three people.\n\nAt least 45,936 people have been killed in Gaza, according to Palestinian officials, with another 109,274 wounded since Israel began its war in the wake of the October 7, 2023 attack by Hamas fighters on southern Israel. That attack killed at least 1,139 people, according to an Al Jazeera tally based on Israeli statistics, and around 250 others were taken captive.\n\nReporting from Deir el-Balah, Al Jazeera’s Tareq Abu Azzoum said the majority of Israeli attacks on Wednesday were concentrated in the north of the Gaza Strip, particularly around Gaza City.\n\nAn Israeli strike on a Gaza City park killed five people and an attack on a school sheltering displaced people in Jabalia killed four, he said. In central Gaza, at least 10 people were killed in a strike on a family home in the Bureij refugee camp, including women and children, survivors said.\n\n“There has been an intensification of air strikes since the early hours of this morning,” Abu Azzoum said, adding that Israeli attacks also injured four telecommunications employees who were working in maintaining internet landlines in Gaza City.\n\n“What we saw in the past few hours is very devastating situation, especially in Gaza City, which has been the epicentre of military attacks, especially in densely populated areas,” he said.\n\nHospitals out of service\n\nRawya Taboura, a nurse at the Indonesian Hospital in Beit Lahiya, northern Gaza, told Al Jazeera the health facility is subject to direct Israeli shelling “targeting the hospital walls and its surroundings” and preventing aid deliveries.\n\nGaza’s Health Ministry said earlier this week that all three major hospitals in Gaza’s north remain out of service due to the fighting, with the director of the Kamal Adwan Hospital, Abu Safia, remaining detained by Israeli forces.\n\n“Unfortunately, so far, no one has been able to provide aid due to the difficulty of the situation outside the hospital and the difficulty of coordinating with the relevant parties,” Taboura said.\n\n“We have not been able to provide aid to the hospital,” she added. “The situation in the hospital is very dire.”\n\nFurther south, Nasser Hospital in Khan Younis announced it would shut down operations at 5pm (15:00 GMT) on Wednesday due to a lack of fuel, with the Al-Aqsa Hospital in central Deir el-Balah reporting it was out of basic medicine and supplies.\n\nOn Wednesday, the International Federation of Red Cross and Red Crescent Societies (IFRC) was among the international aid groups calling for unhindered access to Gaza. Aid groups have repeatedly accused Israel of stifling aid access.\n\nThe IFRC said that dire winter weather conditions were “exacerbating the unbearable conditions” in Gaza, with many families left “clinging on to survival in makeshift camps, without even the most basic necessities, such as blankets”.\n\nThe United Nations Children’s Fund (UNICEF), meanwhile, reported that at least 74 children had been killed in Gaza in the first week of 2025, “suffering from attacks, deprivation, and increasing exposure to the cold”.\n\nThe figure included eight infants and newborns who have died from hypothermia in recent days.\n\nMore than a million children are among Gaza’s displaced, with many living in makeshift tents with little protection from the elements, the agency said.\n\n‘Heinous crimes’\n\nAs the fighting rages in Gaza, Israeli raids have continued across the occupied West Bank.\n\nOn Wednesday, the Commission of Detainees and Ex-Detainees Affairs and the Palestinian Prisoner’s Society (PPS) said 45 Palestinians have been arrested since Tuesday night across the governorates of Hebron, Nablus, Tubas, Tulkarem, Ramallah, and Jerusalem.\n\nIn Bethlehem, several teachers and students suffered injuries after inhaling tear gas that Israeli soldiers launched at the Kisan School east of Bethlehem, the official Palestinian news agency Wafa reported.\n\nThe tear gas was reportedly a response to some students throwing stones at Israeli military vehicles.\n\nMeanwhile, three Palestinians, including two children, were killed by an Israeli air strike on the town of Tammun on Wednesday in Tubas governorate.\n\nThe killed children were identified as nine-year-old Rida Bisharat and 10-year-old Hamza Bisharat by the Palestinian Foreign Ministry. It described the strike as a “heinous crime”.\n\nThe ministry further said Israel’s “application of its aggressive policies in the West Bank” was “in flagrant violation of international law and the Geneva Conventions”.\n\nCeasefire talks continuing\n\nAs the fighting continued, mediators from Qatar, Egypt, and the United States were pushing forward with efforts to broker an agreement between Israel and Hamas that would see a ceasefire and exchange of Israeli captives held in Gaza for Palestinian prisoners held in Israeli jails. \n\nSpeaking from Paris, France on Wednesday, US Secretary of State Antony Blinken maintained that an agreement was “very close”.\n\nHowever, past efforts to secure a trace have repeatedly failed, with both Hamas and Israel accusing each other of changing the terms.\n\nWashington has also been criticised for not imposing more leverage on its “ironclad” ally Israel, to which it provides billions of dollars in military aid.\n\nMeanwhile, US President-elect Donald Trump’s Middle East envoy appointee, Steve Witkoff, on Tuesday said he would travel to Doha, Qatar to join the negotiations. He expressed hope that an agreement would be reached before Trump takes office on January 20.\n\nFor his part, speaking at a news conference on Tuesday, Trump told reporters that “all hell will break out” if a deal is not reached by the time he takes office. He declined to define what that means, or if it could spell increased US involvement in the conflict.\n\nLater on Wednesday, Israeli Defence Minister Israel Katz said the bodies of two captives, Youssef and Hamza Ziyadne, had been recovered in Gaza.","url":"https://barbadosgazette.com/israeli-attacks-kill-46-in-gaza-as-ceasefire-talks-continue/","image":"https://barbadosgazette.com/app/uploads/2024/12/2024-03-06T115559Z_1983331690_RC23P09JP3XC_RTRMADP_3_SUDAN-POLITICS-HUNGER-1734330878-M1SbcP.jpeg","video":null,"publish_date":"2025-01-09 00:43:13","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.523},{"id":279399808,"title":"‘We must stand together’: European leaders warn Trump over Greenland threat","text":"European officials have warned Donald Trump against threatening “sovereign borders” after the US President-elect refused to rule out military action to seize Greenland.\n\nThe rebukes on Wednesday were led by German Chancellor Olaf Scholz, who said the principle of inviolability of borders applies to every country, no matter how powerful.\n\nHe added Trump’s statements a day earlier had sparked “notable incomprehension” among other European Union leaders he had spoken with.\n\n“Borders must not be moved by force. This principle applies to every country, whether in the East or the West,” Scholz later wrote on X.\n\n“In talks with our European partners, there is an uneasiness regarding recent statements from the US. It is clear: We must stand together.”\n\nFrance’s foreign minister, Jean-Noel Barrot, also weighed in on Wednesday, saying Greenland was “European territory” and there was “no question of the EU letting other nations in the world, whoever they may be … attack its sovereign borders”.\n\nEU officials, meanwhile, largely sought to avoid wading into the morass, although a spokesperson did confirm to reporters that Greenland was covered by a mutual defence clause binding its members to assist one another in case of attack.\n\n“But we are indeed speaking of something extremely theoretical on which we will not want to elaborate,” EU Commission spokesperson Paula Pinho said.\n\n‘We need Greenland’\n\nThe disquiet comes after Trump on Tuesday again floated his desire for the US to take control of Greenland as well as the Panama Canal, an arterial Latin American water route that the US ceded control of to Panama in 1999.\n\nWhen asked by a reporter if he would rule out using military force or economic coercion to gain that control, Trump replied, “I’m not going to commit to that.”\n\n“We need Greenland for national security purposes,” Trump later said, nodding to the island’s strategic position in the Arctic, where Russia, China and the US have jockeyed for control in recent years.\n\nSpeaking to reporters on Wednesday, French government spokesperson Sophie Primas warned there was a “form of imperialism” in Trump’s statements.\n\n“Today, we are seeing the rise in blocs, we can see this as a form of imperialism, which materialises itself in the statements that we saw from Mr Trump on the annexation of an entire territory,” she said.\n\n“More than ever, we and our European partners need to be conscious, to get away from a form of naivety, to protect ourselves, to rearm,” she added.\n\nFor his part, Greenland’s Prime Minister, Mute Bourup Egede has not weighed in on the US president-elect’s most recent comments. However, Mute, who supports full independence from Denmark, has previously opposed Trump’s past suggestions of purchasing the island.\n\nOfficials in Denmark, meanwhile, struck a more conciliatory tone than their European counterparts.\n\nForeign minister Lars Lokke Rasmussen said Copenhagen is “open to a dialogue with the Americans on how we can cooperate, possibly even more closely than we already do, to ensure that American ambitions are fulfilled”.\n\nHowever, he also ruled out the island becoming part of the US.\n\n‘Mexican America’\n\nEuropeans were not the only ones rankled by the broad expansionist vision laid out by Trump, who takes office on January 20.\n\nOn Wednesday, Canadian Finance Minister Dominic LeBlanc condemned the president-elect for repeatedly saying he would seek to make Canada the “51st” state. On Wednesday, Trump said he was open to using economic coercion to make that happen.\n\n“The joke is over,” said LeBlanc, who serves as the point person for US-Canada relations.\n\n“It’s a way for him, I think, to sow confusion, to agitate people, to create chaos knowing this will never happen.”\n\nMeanwhile, Mexico responded to Trump’s stated desire to rename the Gulf of Mexico to the “Gulf of America”.\n\nPresident Claudia Sheinbaum suggested the whole of North America – including the United States – should be renamed “Mexican America”, referencing an historical name used in an early map of the region.\n\n“Mexican America, that sounds nice,” Sheinbaum chided.","url":"https://barbadosgazette.com/we-must-stand-together-european-leaders-warn-trump-over-greenland-threat/","image":"https://barbadosgazette.com/app/uploads/2024/12/AFP__20241217__36QJ9WQ__v1__HighRes__VanuatuEarthquakeDamage-1-1734482463_8a8e29-1734487818-6hLM5E.jpeg","video":null,"publish_date":"2025-01-09 00:43:13","author":"German Chancellor Olaf","authors":["German Chancellor Olaf"],"language":"en","category":"politics","source_country":"bb","sentiment":-0.104},{"id":279399802,"title":"US Justice Department to release only part of Trump investigation report","text":"United States officials have announced plans to release only part of a report detailing federal investigations into President-elect Donald Trump, following a court decision to block some of the findings.\n\nOn Wednesday, the Department of Justice indicated that the published report would focus on Special Counsel Jack Smith’s probe into Trump’s efforts to undo the results of the 2020 election.\n\nIt would not, however, delve into a second federal investigation that looked at Trump’s alleged mishandling of classified documents while out of office, following the end of his first term in 2021.\n\nThe announcement means that certain insight into classified documents investigation is unlikely to reach the public in the foreseeable future.\n\nTrump is set to take office for his second term in less than two weeks, on January 20, at which point the Justice Department will fall under his control.\n\nThe classified documents investigation was once considered the most threatening to Trump, who has been embroiled in a sprawling web of legal cases. He is the first US president to be convicted of felony crimes.\n\nTrump, however, has denied wrongdoing in all the cases. He has repeatedly criticised the investigations as politically motivated and “fake”.\n\nWhile the classified documents section of the report will not be unveiled to the public, the Justice Department has indicated it would make its contents available to the chairmen and ranking members of the House and Senate Judiciary Committees.\n\nThose members must agree not to make the section public while legal proceedings over the classified documents case continue.\n\n“This limited disclosure will further the public interest in keeping congressional leadership apprised of a significant matter within the Department while safeguarding defendants’ interest,” the Justice Department wrote in its court filings.\n\nThose proceedings were at the crux of the decision to nix the publication of the classified documents section of the report.\n\nOn Tuesday, a federal judge, Aileen Cannon, temporarily blocked its release, citing the continuing legal fight.\n\nWhile the charges against Trump in the classified documents case were dropped in November, his two co-defendants — Trump employees Walt Nauta and Carlos De Oliveira — continue to face the possibility of a criminal trial.\n\nNauta, an aide, and De Oliveira, a maintenance employee at Trump’s Mar-a-Lago estate, have been accused of helping the president-elect withhold and conceal the classified documents, despite a subpoena to turn them over.\n\nDefence lawyers have argued that releasing the report would improperly interfere with their right to a fair hearing.\n\nThe Justice Department has not yet indicated when it would publish the other volume of the report, which focused on the allegations of election interference.\n\nSmith filed to drop the charges in that case in November as well, citing Trump’s impending return to office. He cited Justice Department policy against prosecuting a sitting president.\n\nThat case centred on Trump’s actions in the lead-up and after the November 2020 election, when the Republican incumbent faced Democrat Joe Biden for the presidency.\n\nTrump ultimately lost. But Smith and his team of federal prosecutors have argued Trump entered into a conspiracy to defraud the US by overturning his defeat and disrupting official proceedings to certify the correct result.\n\nTrump has continued to falsely claim that he won the 2020 race and that his victory was denied by widespread voter fraud.\n\nIn Wednesday’s court filing, the Justice Department said that Attorney General Merrick Garland had a “clear” authority to release the volume of the report centred on the election interference charges.\n\n“Indeed, with respect to Volume One of the Final Report, defendants are hardly differently situated than any other member of the public,” the department said.\n\nGarland, a member of the administration of outgoing President Biden, appointed Smith as special counsel in 2022 to avoid any conflict of interest a political appointee might have leading the case.\n\nJustice Department regulations require Smith to submit a final report to Garland.\n\nThe attorney general has said he will make public any special counsel reports he receives: He previously released a report written by Special Counsel Robert Hur into Biden’s handling of classified documents outside of public office.\n\nTrump and his defence team, however, have fought to stop the release. At a Tuesday news conference at Mar-a-Lago, Trump blasted Smith as a “disgrace”.\n\n“He wanted to do a report just before I take office probably, so he’ll do like a 500-page report, and it’ll be a fake report, just like the investigation was a fake investigation,” Trump said. “Why should he be allowed to write a fake report?”","url":"https://barbadosgazette.com/us-justice-department-to-release-only-part-of-trump-investigation-report/","image":"https://barbadosgazette.com/app/uploads/2024/12/2024-12-18T104945Z_680515696_RC25RBA1KMPD_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-1735366881-D7lUGX.jpeg","video":null,"publish_date":"2025-01-09 00:43:13","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.24},{"id":279399792,"title":"Russian strike kills 13 in Ukraine’s Zaporizhzhia","text":"A Russian guided bomb attack on the southern Ukrainian city of Zaporizhzhia has killed at least 13 civilians and injured about 30 others, officials said.\n\nGraphic footage posted on Ukrainian President Volodymyr Zelenskyy’s Telegram page on Wednesday showed bloodied civilians lying in a city street being treated by emergency services.\n\n“There is nothing more brutal than aerial bombing of a city, knowing that ordinary civilians will suffer,” Zelenskyy wrote on X.\n\nHigh-rise residential blocks, an industrial facility and other infrastructure were damaged in the attack, Ukraine’s Prosecutor General’s Office said on Telegram on Wednesday. The debris hit a tram and a bus with passengers inside, it added.\n\nRegional Governor Ivan Fedorov said Russian forces launched guided bombs at a residential area in the city in the middle of the afternoon, and at least two residential buildings were struck in the attack.\n\nMoscow has frequently launched aerial attacks on civilian infrastructure during its almost three-year war on Ukraine. It has consistently denied targeting civilians.\n\nAl Jazeera’s Jonah Hull, reporting from Kharkiv in Ukraine, said that “strikes were aimed at what has been described as an ‘industrial site’.”\n\nHull described “scenes of devastation outside a factory, in a multi-storey apartment building opposite … in addition to a passing tram and minibus, which would have been carrying passengers.”\n\nMarina Miron, a military analyst at King’s College London, told Al Jazeera that “the plant had already been targeted in November, as the Russians say Ukrainians were using it to assemble drones”.\n\n“Owing to the deaths of civilians, however, there is a possibility that Russian navigation systems were jammed,” said Miron.\n\nThe attack comes as both Russia and Ukraine seek to project strength before US President-elect Donald Trump’s inauguration on January 20.\n\nEarlier in the day, the Ukrainian military said it had struck a fuel storage depot inside Russia, causing a huge blaze at a facility that supplies missiles to a Russian air base.\n\nUkraine’s General Staff said that the assault hit the storage facility near Engels, in Russia’s Saratov region, about 600km (373 miles) east of the Ukrainian border.\n\nAs Ukraine faces certain restrictions in using Western-supplied missiles, Kyiv has been developing its own long-range arsenal capable of reaching targets behind its front line.\n\nThe attacks have disrupted Russian logistics in the war, which began on February 24, 2022.\n\nEarlier on Wednesday, Zelenskyy said that countries wanting to end the war should offer Ukraine assurances about its future defence.\n\n“To be honest, I believe that we have a right to demand serious security guarantees from countries that aim for the peace in the world,” Zelenskyy said.\n\nUkraine’s leader was speaking at a news conference in Kyiv, responding to comments from US President-elect Donald Trump that he understood Russia’s opposition to neighbouring Ukraine joining NATO.\n\nSpeaking to reporters from his Mar-a-Lago estate in a wide-ranging media conference late on Tuesday, Trump said “Russia has somebody right on their doorstep, and I could understand their feelings about that.”\n\nThe United States, Germany, Hungary and Slovakia have stood in the way of Ukraine immediately joining the 32-nation NATO alliance, Zelenskyy noted.","url":"https://barbadosgazette.com/russian-strike-kills-13-in-ukraines-zaporizhzhia/","image":"https://barbadosgazette.com/app/uploads/2025/01/breaking-news@2x-5O027M.png","video":null,"publish_date":"2025-01-09 00:43:13","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.382},{"id":279400056,"title":"How years of corruption and mismanagement led to LA running out of water in the middle of the Palisades wildfire","text":"As Los Angeles firefighters faced down the most destructive blaze in the city’s history, they ran out of water. \n\n“The hydrants are down,” a firefighter said over the radio, according to the Los Angeles Times.\n\nAnother chipped in: “Water supply just dropped.” \n\nFire crews were forced to watch as entire blocks of the Pacific Palisades — one of the most scenic and celeb-packed neighborhoods in LA — were incinerated in a matter of hours late Tuesday and early Wednesday.\n\n“There’s no water in the fire hydrants,” Rick Caruso, who owns the Palisades Village mall in the heart of the devastated area, fumed to local media. “The firefighters are there, and there’s nothing they can do — we’ve got neighborhoods burning, homes burning, and businesses burning. … It should never happen.”\n\nThe water shortage was the result of years of mismanagement of LA’s water system — including a federal indictment of a leader and high profile resignations — as well as major operational problems that drained reserves too quickly.\n\nThe Pacific Palisades fire, whipped up by hurricane-force Santa Ana winds, destroyed more than 1,000 homes and businesses. By Wednesday night, it had spread to 16,000 acres, bigger than the island of Manhattan in New York — and crews had not managed to contain any of it.\n\nLA residents voiced their outrage over the conditions that allowed the fire — and two other blazes in Los Angeles County — to rage out of control. Five people died as of Wednesday night, several others were injured and at least 70,000 were told to evacuate their homes across the LA area.\n\nAdding insult, Democratic Mayor Karen Bass was 7,400 miles away in Africa, and months earlier she had approved an $18 million cut to the fire department. \n\n“RESIGN! WHY ARE YOU IN GHANA?!,” one person commented on an X post by Bass’ office giving an update on the wildfires.\n\nOne angry Angelino told Fox News: “I’m born and raised in Los Angeles, I spend my life worrying about when the earthquakes come, when the Santa Ana Winds come. I plan my trips around this. For someone to be in charge of my town… where were you?”\n\nA legacy of terrible fire management by the state of California and Gov. Gavin Newsom also hangs over the smoky skies of LA.\n\nLA’s water system simply could not handle the demand of the multiple blazes — which was four times normal and last for 15 hours, Janisse Quiñones, the head of the Los Angeles Department of Water and Power, told the LA Times.\n\nThe city has 114 massive water tanks that store water for and help ensure consistent flow. All were full when the fire started Tuesday. Three 1 million-gallon tanks supply the hydrants in the Pacific Palisades. \n\nThe first was empty before 5 p.m. The last was trained by 3 a.m. Wednesday, Quiñones said. \n\nWithout the water tanks, the city’s system was simply not able to maintain pressure to the hydrants. \n\nThe problem was not isolated to the city of LA. \n\nMalcom Stewart, who lives near Pasadena, had not seen a single fire truck on his street as he watched the Eaton fire — a huge blaze east of Los Angeles — swallow his neighbors’ houses one by one, creeping closer to his childhood home.The water supply to his house had been cut, leaving him and his brother without so much as a garden hose to douse spot fires and keep the flames from spreading to their property.“The county did nothing. He’s literally out there with dirt and a shovel and hope,” his wife Charlene Stewart told The Post, hours after she had lost contact with him.\n\nWhen the same thing happened in neighboring Ventura County in November, humiliated officials blamed damaged pumps and overall lack of water — despite backup systems and protocols that allow firefighters to draw water from other sources, the LA Times reported.\n\nIn LA, those fail-safes should have been working, the hydrants should have stayed full, and a water shortage on this scale “should never happen,” Caruso, a former utility commission head and candidate for LA mayor, told the newspaper.\n\nThe failure of LA’s water system comes after years of criticism from President-Elect Donald Trump and others that California’s leaders are not managing their water — or their fire risk properly.\n\nTrump pinned blame for the water shortage on Democratic Gov. Newsom — who derailed a 2020 Trump admin order redirecting water from the verdant north of the state to parched SoCal. \n\nNewsom’s excuse, a tiny endangered fish that has already been declared functionally extinct. \n\n“He wanted to protect an essentially worthless fish called a smelt… but didn’t care about the people of California,” the incoming president ranted on his Truth Social Platform.\n\nTrump has also slammed Newsom for failure to clean up underbrush and dead trees that can fuel forest fires — though it’s not yet clear whether that is a factor in these latest blazes. \n\n“I told him from the first day we met that he must ‘clean’ his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers,” Trump posted to X in 2019.\n\nTrump was referring to measures such as prescribed burns and fuel breaks, or firebreaks, which help keep wildfires from spreading.\n\nNewsom has bragged about his forestry accomplishments, but a 2021 investigation by CapRadio and NPR’s California Newsroom found that he overstated the number of acres treated with fuel breaks and prescribed burns by a whopping 690%.\n\nBut LA’s utility system has its own massive institutional problems. \n\nBass, who has touted her DEI appointments, ousted Cynthia Ruiz, the department’s first-ever Native American commissioner, after less than a year of service.Two out of the last three general managers of the utility have resigned in disgrace: One allegedly mismanaged $40 million in funding. Another, David Wright, was sentenced to six years in prison for taking bribes.\n\nMost of the public backlash, however, has centered on Bass, who rushed home from attending the inauguration of Ghana’s new president when the blaze broke out Tuesday night. She was overseas despite warnings about the Santa Ana winds days earlier.\n\nIn addition to Bass, the city’s fire chief Kristin Crowley — the first woman in that role — is also taking heat, including from ex Fox News host Meghan Kelly, who flamed her for putting virtue signaling and woke branding above doing her job.\n\n“In recent years LA’s fire chief has made not filling the fire hydrants top priority, but diversity,” Kelly said on her eponymous show, referencing Crowley’s stated goal to bring more women and LGBTQ+ people into the fire department.","summary":"The water shortage was the result of years of mismanagement of LA's water system — including a federal indictment of a leader and high profile resignations — as well as major operational problems that drained reserves too quickly.","url":"https://nypost.com/2025/01/08/us-news/how-la-ran-out-of-water-in-the-middle-of-the-palisades-fire/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/0mayor-bass-fire-department-funding-comp.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-01-09 00:41:33","author":"Jared Downing","authors":["Jared Downing"],"language":"en","source_country":"us","sentiment":-0.527},{"id":279400174,"title":"California Slapped with Lawsuit Over ‘Unconstitutional’ Sanctuary Law","text":"DAILY CALLER NEWS FOUNDATION—A major California city is suing the state over its sanctuary law, arguing that it violates the Constitution and prevents local officials from protecting their community.\n\nThe City of Huntington Beach filed a lawsuit on Tuesday against SB 54, otherwise known as the California Values Act, which dramatically restricts how local and state law enforcement can cooperate with Immigration and Customs Enforcement. The lawsuit argues that the policy not only violates the Constitution, but also directs city officials to violate federal immigration laws.\n\n“We are fighting the Sanctuary State Law because it obstructs our ability to fully enforce the law and keep our community safe,” Huntington Beach Mayor Pat Burns said in a public statement. “When the stakes are currently so high, with reports of increases in human trafficking, increases in foreign gangs taking over apartment buildings in the U.S., killing, raping, and committing other violent crimes against our citizens, we need every possible resource available to fight crime, including federal resources.”\n\n“Huntington Beach will not sit idly by and allow the obstructionist Sanctuary State Law to put our 200,000 residents at risk of harm from those who seek to commit violent crimes on U.S. soil.,” Burns continued.\n\nThe California Values Act was signed into law by then-Gov. Jerry Brown in 2017, which into effect the following year and has since remained controversial. The law—which was viewed at the time as an act of resistance by California Democrats against President Donald Trump’s first administration—placed limitations on state and local law enforcement’s ability to help deportation officers enforce immigration violations.\n\n“As a matter of law, the State’s ‘Sanctuary State Law’ is unconstitutional and violates other Federal laws; as a matter of enforcement policy, it is a clear and present danger to the health, safety and welfare of the City of Huntington Beach,” reads a section of the city’s lawsuit, which went into on to identify rising crime in the state since 2018, the year the statewide sanctuary law went into effect.\n\nThis isn’t the first time California has been sued over the law. The Trump administration filed a lawsuit against the state in 2018, also arguing that the sanctuary law violated the Constitution’s supremacy clause, which would render invalid any state law that conflicts with federal law. However, that challenge was ultimately struck down in court.\n\n“The Attorney General is committed to protecting and ensuring the rights of California’s immigrant communities and upholding vital laws like SB 54,” a spokesperson for California Attorney General Rob Bonta stated to the Voice of OC. “Our office successfully fought back against a challenge to SB 54 by the first Trump administration, and we are prepared to vigorously defend SB 54 again.”\n\nThe California Attorney General’s Office did not immediately respond to a request for comment from the Daily Caller News Foundation.\n\nBrown, now retired from public office, defended SB 54 during a sit-down interview in December, noting that it made a number of exceptions for heinous criminals. However, the former governor also distanced himself from a number of sanctuary cities in the state that, he suggested, have taken anti-ICE policies too far since he signed his original state-wide bill into law.\n\nOriginally published by the Daily Caller News Foundation.","summary":"DAILY CALLER NEWS FOUNDATION—A major California city is suing the state over its sanctuary law, arguing that it violates the Constitution and prevents local officials... Read More\n\n\nThe post California Slapped with Lawsuit Over ‘Unconstitutional’ Sanctuary Law appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/01/08/california-slapped-with-lawsuit-over-unconstitutional-sanctuary-law/","image":"https://www.dailysignal.com/wp-content/uploads/2025/01/sanctuarylaw.jpg","video":null,"publish_date":"2025-01-09 00:36:01","author":"Jason Hopkins","authors":["Jason Hopkins"],"language":"en","source_country":"us","sentiment":-0.341},{"id":279402898,"title":"Elon Musk helped Trump win. Now he’s looking at Europe, and many politicians are alarmed","text":"Fresh from pouring his money and energies into helping Donald Trump win reelection, Elon Musk has trained his sights on Europe, setting off alarm bells among politicians across the continent.\n\nThe Tesla and SpaceX chief executive has endorsed the far-right Alternative for Germany, demanded the release of jailed U.K. anti-Islam extremist Tommy Robinson and called British Prime Minister Keir Starmer an evil tyrant who should be in prison.\n\nMany European politicians have been left concerned by the attention. Musk’s feed on his social network X is dotted with abusive language — labeling politicians “stupid cretin” and “sniveling cowards” — as well as retweets of far-right and anti-immigrant accounts.\n\nAndrew Chadwick, professor of political communication at Loughborough University, said Musk is using X “a bit like an old-style newspaper mogul,” to promulgate his political views.\n\n“We’ve seen Musk start to align himself much more obviously with an international movement of the far right,” Chadwick said. “If you look at the kinds of people who Musk himself is boosting on his platform … he’s increasingly started to assemble a group of different right-wing influencers, many of them with large followings, and presenting their evidence as a basis for his interventions into European politics.”\n\nMusk has inserted himself into politics in Germany, which is headed for a Feb. 23 election after center-left Chancellor Olaf Scholz’s fractious three-party coalition government collapsed.\n\nOn Dec. 20, Musk wrote on X: “Only the AfD can save Germany,” a reference to the Alternative for Germany party, which is under observation by the domestic intelligence agency for suspected extremism.\n\nHe doubled down on support for the AfD in an article for the Welt am Sonntag newspaper, claiming Germany is “teetering on the edge of economic and cultural collapse.” Later this week Musk is due to hold a live chat on X with AfD co-leader Alice Weidel.\n\nScholz’s response embodies the dilemma faced by European politicians — should they ignore and let Musk’s comments go unchallenged, or engage and risk amplifying them?\n\nScholz has said it’s important to “stay cool” over personal attacks, but called Musk’s involvement in German politics worrying. In a new year message, Scholz pointedly noted that Germany’s way forward “will not be decided by the owners of social media channels” but by German voters.\n\nFrench President Emmanuel Macron warned Monday about the risks posed by unchecked power in the hands of tech billionaires and the destabilizing impact they could have on democratic institutions.\n\n“Who could have imagined, 10 years ago, that the owner of one of the world’s largest social networks would intervene directly in elections, including in Germany?” Macron said.\n\nGreek Health Minister Adonis Georgiadis said Musk’s behavior was “troubling and far from amusing.”\n\n“Someone cannot simply use their platform, wealth and connections to try to dictate how governments are formed in each nation,” he told Parapolitika Radio. “This is becoming increasingly dangerous.”\n\nMusk has increasingly focused on British politics since the center-left Labour Party was elected in July, calling Starmer an “evil” leader presiding over a “tyrannical police state.”\n\nMusk’s recent focus is on child sexual abuse, particularly a series of cases that rocked northern England towns several years ago, in which groups of men, largely from Pakistani backgrounds, were tried for grooming and abusing dozens of mostly white girls. The cases have been used by far-right activists to link child abuse to immigration and Islam.\n\nMusk has accused Starmer of failing to bring perpetrators to justice when he was England’s director of public prosecutions between 2008 and 2013 — a charge Starmer strongly denies.\n\n“Starmer must go and he must face charges for his complicity in the worst mass crime in the history of Britain,” Musk tweeted.\n\nChadwick said “there’s been a hesitancy on the part of the political elite in the U.K. to engage” with Musk’s “incredibly inflammatory remarks.” But Starmer changed tack Monday, condemning “lies and misinformation” and accusing U.K. Conservative politicians who have echoed some of Musk’s points of “amplifying what the far right are saying.”\n\n“I enjoy the cut and thrust of politics, the robust debate that we must have, but that’s got to be based on facts and truth, not on lies,” the prime minister said.\n\nStarmer is facing calls to tighten Britain’s laws on foreign interference, and governments around the world are under pressure to leave X. Both the U.K. and German governments say they have no plans to quit the platform.\n\nMusk’s X is under investigation by European authorities attempting to curb hatred, disinformation and other toxic content on social media. The European Union has launched infringement proceedings against X under the bloc’s Digital Services Act, and EU spokesman Thomas Regnier said it will look at whether Musk’s livestream interview Thursday with the AfD’s Weidel gives inappropriate “preferential treatment” to the party during a preelection period.\n\nMusk, a self-styled free-speech advocate, is critical of efforts to regulate social media. He has compared British attempts to weed out online misinformation through the Online Safety Act to censorship in the Soviet Union.\n\nMusk clearly enjoys baiting mainstream politicians on social media, but Chadwick said it “remains to be seen” whether his posting changes public attitudes or helps the causes he champions. JILL LAWLESS, LONDON, MDT/AP","summary":"Fresh from pouring his money and energies into helping Donald Trump win reelection, Elon Musk has trained his sights on Europe, setting off alarm bells among politicians across the continent. The Tesla and SpaceX chief executive has endorsed the far-right Alternative for Germany, demanded the release of jailed U.K. anti-Islam extremist Tommy Robinson and called [&#8230;]\n\n\nThe post Elon Musk helped Trump win. Now he’s looking at Europe, and many politicians are alarmed appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/elon-musk-helped-trump-win-now-hes-looking-at-europe-and-many-politicians-are-alarmed.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/01/AP25007589472392.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-01-09 00:34:19","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.092},{"id":279401848,"title":"Trump and Justice Alito spoke just hours before urging Supreme Court to block hush money sentencing","text":"Donald Trump spoke with Supreme Court Justice Samuel Alito hours before the president-elect urged the nation’s high court to block his imminent sentencing date in his hush money trial.\n\nThe conservative justice told ABC News he agreed to take a call from the incoming president to recommend a law clerk for a position in his administration.\n\n“I agreed to discuss this matter with President-elect Trump, and he called me yesterday afternoon,” Alito confirmed to ABC.\n\n“We did not discuss the emergency application he filed today, and indeed, I was not even aware at the time of our conversation that such an application would be filed,” according to Alito. “We also did not discuss any other matter that is pending or might in the future come before the Supreme Court or any past Supreme Court decisions involving the President-elect.”\n\nTrump — desperate to return to the White House with a clear record with the defeat of his criminal prosecutions — is set to enter office as the first criminally convicted president in U.S. history, unless the Supreme Court intervenes.\n\nHe is scheduled to be sentenced by New York Justice Juan Merchan in Manhattan criminal court on January 10, more than eight months after a unanimous jury convicted him on 34 felony counts of falsifying business records.\n\nThe president-elect will be inaugurated 10 days later on January 20.\n\nThe Supreme Court is also hearing oral arguments on Friday in a case to determine whether the federal government can ban the immensely popular social media app TikTok from operating in the United States. Trump asked the court to delay the impending ban, with his attorneys arguing that Trump “alone possesses the consummate dealmaking expertise, the electoral mandate, and the political will” to resolve the issue.\n\nIn a filing on Wednesday, attorneys for the president-elect argued the Supreme Court must stop his hush money proceedings “to prevent grave injustice and harm to the institution of the Presidency and the operations of the federal government.”\n\nThe court — which includes three conservative justices appointed by Trump — was asked to consider whether a landmark decision on presidential “immunity” also extends to Trump as a private citizen.\n\nIn May, a jury of 12 New Yorkers found Trump guilty of falsifying business records to cover up his reimbursement payments to then-attorney Michael Cohen, who paid “hush money” to adult film star Stormy Daniels, whose story about having sex with Trump threatened to derail his 2016 presidential campaign.\n\nTrump’s attorneys contend that evidence used against him at trial should have been shielded by the Supreme Court’s “immunity” decision as part of the protected “official” acts of the presidency, and that the high court’s decision should block any criminal prosecution of a president-elect.\n\nAttorneys for Justice Merchan and Manhattan District Attorney Alvin Bragg are expected to respond to Trump’s filing on January 9.\n\nAlito has drawn intense criticism for joining Supreme Court decisions that have sided with Trump and right-wing interests, including July’s “immunity” decision that upended the criminal cases against the president-elect. Alito also authored the Supreme Court decision that overturned Roe v Wade and revoked a constitutional right to abortion care.\n\nHe also rebuffed demands from Congressional Democrats to recuse himself from matters involving the president-elect, who has repeatedly sought the Supreme Court’s intervention in his path to the presidency.\n\nAlito was also at the center of a series of investigative reports detailing his alliance with right-wing figures representing Republican interests.\n\nAlito resisted calls for his resignation after an upside-down U.S. flag and an “Appeal to Heaven” flag — banners waved during the Capitol riots and by supporters of the “stop the steal” movement supporting Trump’s false claims of election fraud — were discovered at his properties following the 2020 presidential election.","summary":"The president-elect called the conservative justice the night before a last-ditch demand to stop his sentencing in New York","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-alito-supreme-court-hush-money-b2676178.html","image":"https://static.independent.co.uk/2025/01/08/23/2192374757.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/X7nFOcJD-4VHSaSK0.mp4","publish_date":"2025-01-09 00:33:05","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.214},{"id":279398674,"title":"California wildfires: Donald Trump blames Governor Gavin Newsom, failure to pump water to south for blaze","text":"Close navigation menu\n\nSubscriber Exclusive\n\nToday's Paper\n\nWest Rewards\n\nVanishing Cousins\n\nThe West Live\n\nCourt in the Act\n\nReveal sub navigationChevron Down Icon\n\nCourts & Justice\n\nReveal sub navigationChevron Down Icon\n\nWest Coast Eagles\nFremantle Dockers\n\nRugby Union\nHorse Racing\n\nReveal sub navigationChevron Down Icon\n\nHerd On The Terrace\n\nAgriculture\nBulls N’ Bears\n\nReveal sub navigationChevron Down Icon\n\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\n\nReveal sub navigationChevron Down Icon\n\nGreat Southern\n\nPeel/Rockingham\n\nReveal sub navigationChevron Down Icon\n\nJessica Page\n\nKatina Curtis\nBasil Zempilas\nEmma Garlett\nKim MacDonald\nPaul Murray\nJustin Langer\nBelle Taylor\nLaura Newell\nAnxiety Aunt\n\nReveal sub navigationChevron Down Icon\n\nHealth & Wellbeing\n\nReal Estate\nHouse That!\n\nEntertainment\nReveal sub navigationChevron Down Icon\n\nCelebrity Gossip\n\nCompetitions & Puzzles\n\nReveal sub navigationChevron Down Icon\n\nWestern Australia\n\nWest Travel Club\nPhotography\nTravel Tips\n\nReveal sub navigationChevron Down Icon\n\nSmartphones\n\nTelecommunications\n\nThe West Australian\nToday's PaperPlace an Ad\n\nCourts and Crime\n\nSubscriber Exclusive\n\nSomething Went Wrong\n\nOops! Something went wrong.\nThe West Australian\nError: 500 \n\nOur Network\n\nWest Rewards\nWest Regional Network\nWest Announcements \nWest Classifieds\nWestBusiness Events \nWest Travel Club\n\nMedia Education\nThe Nightly\n\nOur Partners\n\nReal Estate View\nHealthengine\nHuddle Insurance\n\nRaiz Invest\n\nStarts at 60\n\nSubscribe To\n\nThe West Australian Newspaper\nThe West Email Newsletters\n\nConnect with usMessenger IconSend us a message\nShare to FacebookShare to TwitterShare to InstagramShare to YoutubeRSS FeedEmail Us\n\nFrequently Asked Questions\nEditorial Policy\nEditorial Complaints\nPlace an ad in the Classifieds\nAdvertise in The West Australian\n\n© West Australian Newspapers Limited 2025\nPrivacy Policy\nTerms of Use\nCookie Settings\nThe West Australian","summary":"President-elect Donald Trump has laid the blame for the deadly California wildfires that have so far killed five people and destroyed over 1100 structures at the feet of one man.","url":"https://thewest.com.au/politics/world-politics/california-wildfires-donald-trump-blames-governor-gavin-newsom-failure-to-pump-water-to-south-for-blaze-c-17330867","image":"https://thewest.com.au/static/share-images/share-400x400.png","video":null,"publish_date":"2025-01-09 00:32:58","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":0.645},{"id":279397848,"title":"Jamaica U17 into quarter-finals of Mexico tourney","text":"Latest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nLatest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\nThe starting 11 of Jamaica’s Under-17 Reggae Boyz pose for a team photo ahead of their exhibition match against Jamaica Premier League club Arnett Gardens at the Anthony Spaulding Sports Complex, in December 2024. \n\r\n Football, Latest News, News, Sports \r\n\nJanuary 8, 2025\r\n\n\r\n\r\n\n\r\n Jamaica U17 into quarter-finals of Mexico tourney \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nKINGSTON, Jamaica – Jamaica’s Under -17 men’s team will play Seleccion Metropolitana in the quarter-finals of the Torneo del Sol in Mexico on Thursday, starting at 1:30 pm (Jamaica time) after winning their second game in the first round on Wednesday.\n\nFollowing their win in the opening game on Monday, a 3-2 victory over Seleccion Bajio, Jamaica were beaten 2-0 by Selection North U-19 on Tuesday; but rebounded with a 3-1 win over Liga Premier on Wednesday.\n\nSeymour Reid, who had scored a brace in Monday’s win, scored a second half hat-trick on Wednesday, to lead the team that is using the tournament to prepare for next month’s Concacaf Under -17 World Cup qualifying tournament.\n\nThe other quarter-final games set for Thursday are: hosts Mexico vs Seleccion Centro; Panama vs Seleccion Occidente and Seleccion Liga Premier vs Seleccion Liga TDP.\n\n– Paul Reid\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nTags: Mexico Reggae Boyz U-17 Football \r\n\r\n\n\r\n\r\n\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n0 Comments · Make a comment\n\n\r\n\n\r\n ALSO ON JAMAICA OBSERVER\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nFootball, Latest News, News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Barcelona defeat Bilbao without Olmo to reach Spanish Super Cup final \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n JEDDAH, Saudi Arabia {AFP) - Young starlets Gavi and Lamine Yamal fired Barcelona, without Dani Olmo after his licence to play was revoked, into the S... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Astronauts stuck in space since June remain upbeat \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n WASHINGTON, United States (AFP) - Two US astronauts who have been stuck for months on the International Space Station (ISS) said Wednesday they have p... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nEntertainment, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Award-winning author, Colleen Wint Bond, to present “Arthur Series” at prestigious Jamaica Brew Festival \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n FLORIDA, USA - Award-winning Jamaican author, Colleen Wint Bond, will join 23 other exceptional writers and filmmakers at the Jamaica Brew Festival, s... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Gas prices up $1.31, $1.78, diesel up $2.87 \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica — Motorists should see an increase at the pumps in the price of gasoline effective Thursday, January 9, according to the latest ex-r... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nEntertainment, Latest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Veteran guitarist Rupert Bent III dies at 57 \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n Rupert Bent III, the veteran guitarist who died on January 4, is remembered by colleague Michael Fletcher as, “A full-fledged musician who was always ... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n WATCH: 5 y-o perishes in Whitehall house fire \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica -- A five-year-old girl died in a house fire on Whitehall Avenue in St Andrew on Wednesday afternoon. Police are currently processin... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.78 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n The US dollar on Wednesday, January 8, ended at $156.78 down by 50 cents according to the Bank of Jamaica’s daily exchange trading summary. Meanwhile,... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nHOUSE RULES\r\n\n\r\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \r\n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \r\n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \r\n\nPlease do not write in block capitals since this makes your comment hard to read. \r\n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \r\n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \r\n\nLastly, read our Terms and Conditions and Privacy Policy \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Former MP, racehorse aficionado Vincent ‘Vin’ Edwards passes \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 6, 2025 \r\n\n\r\n THE People’s National Party (PNP) has paid tribute to former Member of Parliament for St Mary Western Vincent “Vin” Edwards, with Dr Deborah Hickling ... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News, Regional \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n PAHO launches interactive dashboard to monitor avian influenza in the Americas \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 7, 2025 \r\n\n\r\n WASHINGTON, United States (CMC) — The Pan American Health Organization (PAHO) has launched an interactive dashboard to monitor avian influenza A(H5N1)... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Trump refuses to rule out military force to seize Greenland, Panama Canal \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n PALM BEACH, United States (AFP) — Donald Trump threatened military action to secure the Panama Canal and economic force against neighbouring Canada, i... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nFootball, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Jamaica U17 into quarter-finals of Mexico tourney \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica - Jamaica’s Under -17 men’s team will play Seleccion Metropolitana in the quarter-finals of the Torneo del Sol in Mexico on Thursday... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nFootball, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Barcelona defeat Bilbao without Olmo to reach Spanish Super Cup final \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n JEDDAH, Saudi Arabia {AFP) - Young starlets Gavi and Lamine Yamal fired Barcelona, without Dani Olmo after his licence to play was revoked, into the S... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Astronauts stuck in space since June remain upbeat \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n WASHINGTON, United States (AFP) - Two US astronauts who have been stuck for months on the International Space Station (ISS) said Wednesday they have p... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nEntertainment, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Award-winning author, Colleen Wint Bond, to present “Arthur Series” at prestigious Jamaica Brew Festival \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n FLORIDA, USA - Award-winning Jamaican author, Colleen Wint Bond, will join 23 other exceptional writers and filmmakers at the Jamaica Brew Festival, s... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Gas prices up $1.31, $1.78, diesel up $2.87 \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica — Motorists should see an increase at the pumps in the price of gasoline effective Thursday, January 9, according to the latest ex-r... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nFootball, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Jamaica U17 into quarter-finals of Mexico tourney \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica - Jamaica’s Under -17 men’s team will play Seleccion Metropolitana in the quarter-finals of the Torneo del Sol in Mexico on Thursday... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nFootball, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Barcelona defeat Bilbao without Olmo to reach Spanish Super Cup final \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n JEDDAH, Saudi Arabia {AFP) - Young starlets Gavi and Lamine Yamal fired Barcelona, without Dani Olmo after his licence to play was revoked, into the S... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Astronauts stuck in space since June remain upbeat \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n WASHINGTON, United States (AFP) - Two US astronauts who have been stuck for months on the International Space Station (ISS) said Wednesday they have p... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nEntertainment, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Award-winning author, Colleen Wint Bond, to present “Arthur Series” at prestigious Jamaica Brew Festival \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n FLORIDA, USA - Award-winning Jamaican author, Colleen Wint Bond, will join 23 other exceptional writers and filmmakers at the Jamaica Brew Festival, s... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Gas prices up $1.31, $1.78, diesel up $2.87 \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nJanuary 8, 2025 \r\n\n\r\n KINGSTON, Jamaica — Motorists should see an increase at the pumps in the price of gasoline effective Thursday, January 9, according to the latest ex-r... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n \n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n \n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\nFeatured Tags\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nEntertainment\n\n\r\n\nEntertainment\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nJamaica Observer,© All Rights Reserved\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nPrivacy Policy\r\n\r\n\n\r\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/01/08/jamaica-u17-quarter-finals-mexico-tourney/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/01/2f012c44525e4863ee8475ec498ad029.jpg","video":null,"publish_date":"2025-01-09 00:29:13","author":null,"language":"en","source_country":"jm","sentiment":0.621},{"id":279397524,"title":"U.S. stocks close mixed as investors digest Fed minutes","text":"Fierce firestorms rage through parched Southern CaliforniaTrump hints at using military force to take Greenland, PanamaVermont sued over law asking firms to pay for climate change damageHundreds of animals killed in fire at Dallas mall\n\n U.S. stocks close mixed as investors digest Fed minutesNEW YORK, Jan. 8 (Xinhua) -- U.S. stocks ended mixed on Wednesday, after widely-expected minutes from the Federal Reserve's December meeting released in the afternoon. The Dow Jones Industrial Average rose 106.84 points, or 0.25 percent, to 42,635.2. The S&P 500 added 9.22 points, or 0.16 percent, to 5,918.25. The Nasdaq Composite Index shed 10.80 points, or 0.06 percent, to 19,478.88. Eight of the 11 primary S&P 500 sectors ended in green, with health and materials leading the gainers by adding 0.53 percent and 0.49 percent, respectively. Meanwhile, communication services and energy led the laggards by dropping 0.74 percent and 0.10 percent, respectively. The Fed's interest rate trajectory remained a key focus. The Fed opted to cut interest rates by 25 basis points at its final meeting of 2024 in December. The minutes from that meeting, released on Wednesday, revealed that many Fed officials supported a gradual pace of interest rate cuts in 2025. \"Many participants suggested that a variety of factors underlined the need for a careful approach to monetary policy decisions over coming quarters,\" the minutes read. \"These factors included recent elevated inflation readings, the continuing strength of spending, reduced downside risks to the outlook for the labor market and economic activity, and increased upside risks to the outlook for inflation.\" Meanwhile, data issued by Automatic Data Processing (ADP) on Wednesday morning showed 122,000 U.S. private payrolls were added in December, down from the 144,000 additions seen in November. The latest reading of initial jobless claims from the Department of Labor showed 201,000 claims for unemployment benefits were filed in the week ending Jan. 4, a drop of 10,000 from the previous week and below the 215,000 expected by economists. Reports on Wednesday morning that President-elect Donald Trump might declare a national economic emergency to impose tariffs added to investor anxiety. The combination of potential trade policy shifts and uncertainty over Fed actions has created a cautious environment for investors, with markets bracing for further clarity on economic direction and central bank decisions. Despite the cautious tone, the minutes offered no major surprises for markets. Fed Governor Chris Waller said Wednesday that he still supports cutting interest rates this year, believing inflation will continue to drift lower despite promises of sweeping tariffs from the new Trump administration. \"I believe that inflation will continue to make progress toward our 2 percent goal over the medium term and that further reductions will be appropriate,\" Waller said. \n\n U.S. stocks close mixed as investors digest Fed minutesU.S. stocks close mixed as investors digest Fed minutesXinhua 9th January 2025, 10:45 GMT+11NEW YORK, Jan. 8 (Xinhua) -- U.S. stocks ended mixed on Wednesday, after widely-expected minutes from the Federal Reserve's December meeting released in the afternoon. The Dow Jones Industrial Average rose 106.84 points, or 0.25 percent, to 42,635.2. The S&P 500 added 9.22 points, or 0.16 percent, to 5,918.25. The Nasdaq Composite Index shed 10.80 points, or 0.06 percent, to 19,478.88. Eight of the 11 primary S&P 500 sectors ended in green, with health and materials leading the gainers by adding 0.53 percent and 0.49 percent, respectively. Meanwhile, communication services and energy led the laggards by dropping 0.74 percent and 0.10 percent, respectively. The Fed's interest rate trajectory remained a key focus. The Fed opted to cut interest rates by 25 basis points at its final meeting of 2024 in December. The minutes from that meeting, released on Wednesday, revealed that many Fed officials supported a gradual pace of interest rate cuts in 2025. \"Many participants suggested that a variety of factors underlined the need for a careful approach to monetary policy decisions over coming quarters,\" the minutes read. \"These factors included recent elevated inflation readings, the continuing strength of spending, reduced downside risks to the outlook for the labor market and economic activity, and increased upside risks to the outlook for inflation.\" Meanwhile, data issued by Automatic Data Processing (ADP) on Wednesday morning showed 122,000 U.S. private payrolls were added in December, down from the 144,000 additions seen in November. The latest reading of initial jobless claims from the Department of Labor showed 201,000 claims for unemployment benefits were filed in the week ending Jan. 4, a drop of 10,000 from the previous week and below the 215,000 expected by economists. Reports on Wednesday morning that President-elect Donald Trump might declare a national economic emergency to impose tariffs added to investor anxiety. The combination of potential trade policy shifts and uncertainty over Fed actions has created a cautious environment for investors, with markets bracing for further clarity on economic direction and central bank decisions. Despite the cautious tone, the minutes offered no major surprises for markets. Fed Governor Chris Waller said Wednesday that he still supports cutting interest rates this year, believing inflation will continue to drift lower despite promises of sweeping tariffs from the new Trump administration. \"I believe that inflation will continue to make progress toward our 2 percent goal over the medium term and that further reductions will be appropriate,\" Waller said. \n\n Read This Next U.S. stocks end mixed, Dow Jones gains 107 pointsJetBlue fined for flight delays, and passengers may see refundsEven before US alcohol warning, younger Americans turning to mocktailsUS new car sales rose to five-year high in 2024, helped by hybridsDow Jones dives 78 points, Nasdaq loses nearly 2% \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274923080/us-stocks-close-mixed-as-investors-digest-fed-minutes","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2025-01-09 00:27:17","author":"Automatic Data Processing","authors":["Automatic Data Processing"],"language":"en","source_country":"us","sentiment":-0.065},{"id":279397526,"title":"Returning inflation to 2 pct \"could take longer than previously anticipated\": U.S. Fed minutes","text":"Fierce firestorms rage through parched Southern CaliforniaTrump hints at using military force to take Greenland, PanamaVermont sued over law asking firms to pay for climate change damageHundreds of animals killed in fire at Dallas mall\n\n Returning inflation to 2 pct \"could take longer than previously anticipated\": U.S. Fed minutesWASHINGTON, Jan. 8 (Xinhua) -- The process of returning inflation to the Federal Reserve's 2-percent long-term goal \"could take longer than previously anticipated,\" according to the latest minutes released on Wednesday. Participants noted that although inflation had eased substantially from its peak in 2022, \"it remained somewhat elevated,\" said the minutes of the Federal Open Market Committee (FOMC)'s Dec. 17-18 meeting. Participants commented that the overall pace of disinflation had slowed over 2024 and that some \"recent monthly price readings had been higher than anticipated,\" it noted. Nevertheless, most remarked that disinflationary progress continued to be apparent across a broad range of core goods and services prices. With regard to the outlook for inflation, participants expected that inflation would continue to move toward 2 percent, \"although they noted that recent higher-than-expected readings on inflation, and the effects of potential changes in trade and immigration policy, suggested that the process could take longer than previously anticipated,\" the minutes showed. At its Dec. 17-18 meeting, the FOMC reduced the target range for the federal funds rate by 25 basis points to 4.25 percent to 4.5 percent -- marking the third consecutive rate cut in this easing cycle. The Fed also indicated there would be fewer cuts in the new year, as it braces for uncertainty stemming from the incoming Donald Trump administration's policies. \"In discussing the outlook for monetary policy, participants indicated that the Committee was at or near the point at which it would be appropriate to slow the pace of policy easing,\" the minutes said. The minutes noted that almost all participants judged that \"upside risks to the inflation outlook had increased.\" Participants cited recent stronger-than-expected readings on inflation and the likely effects of potential changes in trade and immigration policy as reasons. Other reasons mentioned included possible disruptions in global supply chains due to geopolitical developments, a larger-than-anticipated easing in financial conditions, stronger-than-expected household spending, and more persistent shelter price increases. In discussing labor market developments, participants viewed recent readings on a range of indicators as consistent with \"an ongoing gradual easing in labor market conditions\" even as the unemployment rate remained low. Earlier in the day, the Automatic Data Processing (ADP) reported in the latest National Employment Report that the U.S. private sector added 122,000 jobs in December, fewer than the 146,000 in November and 184,000 in October. The report also showed that year-over-year pay growth for job-stayers slowed to 4.6 percent, the slowest pace of gains since July 2021. According to the Fed minutes, some participants noted that the labor market \"could soften further,\" as the recent pace of payroll growth had been below the rate that would likely keep the unemployment rate constant, given a stable labor force participation rate. The minutes also noted that several participants cautioned that low- and moderate-income households continued to experience financial strains, which could damp their spending. A couple of participants cited continued increases in rates of delinquencies on credit card borrowing and automobile loans as signs of such strains. \n\n Returning inflation to 2 pct \"could take longer than previously anticipated\": U.S. Fed minutesReturning inflation to 2 pct \"could take longer than previously anticipated\": U.S. Fed minutesXinhua 9th January 2025, 10:45 GMT+11WASHINGTON, Jan. 8 (Xinhua) -- The process of returning inflation to the Federal Reserve's 2-percent long-term goal \"could take longer than previously anticipated,\" according to the latest minutes released on Wednesday. Participants noted that although inflation had eased substantially from its peak in 2022, \"it remained somewhat elevated,\" said the minutes of the Federal Open Market Committee (FOMC)'s Dec. 17-18 meeting. Participants commented that the overall pace of disinflation had slowed over 2024 and that some \"recent monthly price readings had been higher than anticipated,\" it noted. Nevertheless, most remarked that disinflationary progress continued to be apparent across a broad range of core goods and services prices. With regard to the outlook for inflation, participants expected that inflation would continue to move toward 2 percent, \"although they noted that recent higher-than-expected readings on inflation, and the effects of potential changes in trade and immigration policy, suggested that the process could take longer than previously anticipated,\" the minutes showed. At its Dec. 17-18 meeting, the FOMC reduced the target range for the federal funds rate by 25 basis points to 4.25 percent to 4.5 percent -- marking the third consecutive rate cut in this easing cycle. The Fed also indicated there would be fewer cuts in the new year, as it braces for uncertainty stemming from the incoming Donald Trump administration's policies. \"In discussing the outlook for monetary policy, participants indicated that the Committee was at or near the point at which it would be appropriate to slow the pace of policy easing,\" the minutes said. The minutes noted that almost all participants judged that \"upside risks to the inflation outlook had increased.\" Participants cited recent stronger-than-expected readings on inflation and the likely effects of potential changes in trade and immigration policy as reasons. Other reasons mentioned included possible disruptions in global supply chains due to geopolitical developments, a larger-than-anticipated easing in financial conditions, stronger-than-expected household spending, and more persistent shelter price increases. In discussing labor market developments, participants viewed recent readings on a range of indicators as consistent with \"an ongoing gradual easing in labor market conditions\" even as the unemployment rate remained low. Earlier in the day, the Automatic Data Processing (ADP) reported in the latest National Employment Report that the U.S. private sector added 122,000 jobs in December, fewer than the 146,000 in November and 184,000 in October. The report also showed that year-over-year pay growth for job-stayers slowed to 4.6 percent, the slowest pace of gains since July 2021. According to the Fed minutes, some participants noted that the labor market \"could soften further,\" as the recent pace of payroll growth had been below the rate that would likely keep the unemployment rate constant, given a stable labor force participation rate. The minutes also noted that several participants cautioned that low- and moderate-income households continued to experience financial strains, which could damp their spending. A couple of participants cited continued increases in rates of delinquencies on credit card borrowing and automobile loans as signs of such strains. \n\n Read This Next U.S. stocks end mixed, Dow Jones gains 107 pointsJetBlue fined for flight delays, and passengers may see refundsEven before US alcohol warning, younger Americans turning to mocktailsUS new car sales rose to five-year high in 2024, helped by hybridsDow Jones dives 78 points, Nasdaq loses nearly 2% \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274923081/returning-inflation-to-2-pct-could-take-longer-than-previously-anticipated-us-fed-minutes","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2025-01-09 00:27:17","author":null,"language":"en","source_country":"us","sentiment":-0.276},{"id":279397536,"title":"At least 13 people killed, 30 others injured in Russian strike in Ukraine's Zaporizhzhia","text":"Fierce firestorms rage through parched Southern CaliforniaTrump hints at using military force to take Greenland, PanamaVermont sued over law asking firms to pay for climate change damageHundreds of animals killed in fire at Dallas mall\n\n At least 13 people killed, 30 others injured in Russian strike in Ukraine's ZaporizhzhiaKyiv [Ukraine], January 9 (ANI): At least 13 people were killed and 30 others injured in a Russian-guided bomb attack on Ukraine's Zaporizhzhia, according to officials, Al Jazeera reported. Ukrainian President Volodymyr Zelenskyy said that 13 people were killed in the attack and offered condolences to the families of the victims.Zelenskyy shared a video on X (formerly Twitter) which showed bloodied civilians lying on the street being treated by emergency services and firefighters trying to contain the fire.While sharing a video on X, Zelenskyy stated, \"Russians struck Zaporizhzhia with aerial bombs. It was a deliberate strike on the city. As of now, dozens of people are reported wounded. All are receiving the necessary assistance. Tragically, we know of 13 people killed.\"\"My condolences to their families and loved ones. Regrettably, the number of casualties may increase. There is nothing more cruel than launching aerial bombs on a city, knowing that ordinary civilians will suffer. Russia must be put under pressure for its terror. The protection of lives in Ukraine must be supported. Only through strength can such a war be ended with a lasting peace,\" he added.On Wednesday, the Ukraine Prosecutor General's Office said that high-rise residential blocks, an industrial facility and other infrastructure were damaged in the attack. It further said that the debris hit a tram and a bus which was carrying passengers, according to Al Jazeera report.Regional Governor Ivan Fedorov said that Russian forces launched guided bombs at a residential area in the city during the afternoon and at least two residential buildings were hit in the attack. The attacks come at a time when both Russia and Ukraine want to showcase strength before US President-elect Donald Trump's swearing-in ceremony on January 20.Earlier in the day, the Ukrainian military announced that it had targeted a fuel storage depot in Russia, causing a fire at a facility that provides missiles to a Russian air base. Ukraine's General Staff announced that the attack hit the storage facility near Engels in Russia's Saratov region.Ukraine has been developing its own long-range arsenal capable of reaching targets behind its front line as Kyiv continues to have certain restrictions in using Western-supplied missiles. Earlier on Wednesday, Zelenskyy said that nations who seek to end the war should offer assurance to Ukraine regarding its future defence, Al Jazeera reported.He said, \"To be honest, I believe that we have a right to demand serious security guarantees from countries that aim for peace in the world.\" Zelenskyy made these remarks while addressing a press conference in Kyiv, responding to Trump's statement that he understood Russia's opposition to Ukraine becoming part of NATO.While addressing a press conference at his Mar-a-Lago estate on Tuesday, Trump said, \"Russia has somebody right on their doorstep, and I could understand their feelings about that.\" Zelenskyy said that the US, Germany and Slovakia have been in the way of Ukraine immediately joining the NATO alliance. (ANI) \n\n At least 13 people killed, 30 others injured in Russian strike in Ukraine's ZaporizhzhiaAt least 13 people killed, 30 others injured in Russian strike in Ukraine's ZaporizhzhiaANI 9th January 2025, 10:27 GMT+11Kyiv [Ukraine], January 9 (ANI): At least 13 people were killed and 30 others injured in a Russian-guided bomb attack on Ukraine's Zaporizhzhia, according to officials, Al Jazeera reported. Ukrainian President Volodymyr Zelenskyy said that 13 people were killed in the attack and offered condolences to the families of the victims.Zelenskyy shared a video on X (formerly Twitter) which showed bloodied civilians lying on the street being treated by emergency services and firefighters trying to contain the fire.While sharing a video on X, Zelenskyy stated, \"Russians struck Zaporizhzhia with aerial bombs. It was a deliberate strike on the city. As of now, dozens of people are reported wounded. All are receiving the necessary assistance. Tragically, we know of 13 people killed.\"\"My condolences to their families and loved ones. Regrettably, the number of casualties may increase. There is nothing more cruel than launching aerial bombs on a city, knowing that ordinary civilians will suffer. Russia must be put under pressure for its terror. The protection of lives in Ukraine must be supported. Only through strength can such a war be ended with a lasting peace,\" he added.On Wednesday, the Ukraine Prosecutor General's Office said that high-rise residential blocks, an industrial facility and other infrastructure were damaged in the attack. It further said that the debris hit a tram and a bus which was carrying passengers, according to Al Jazeera report.Regional Governor Ivan Fedorov said that Russian forces launched guided bombs at a residential area in the city during the afternoon and at least two residential buildings were hit in the attack. The attacks come at a time when both Russia and Ukraine want to showcase strength before US President-elect Donald Trump's swearing-in ceremony on January 20.Earlier in the day, the Ukrainian military announced that it had targeted a fuel storage depot in Russia, causing a fire at a facility that provides missiles to a Russian air base. Ukraine's General Staff announced that the attack hit the storage facility near Engels in Russia's Saratov region.Ukraine has been developing its own long-range arsenal capable of reaching targets behind its front line as Kyiv continues to have certain restrictions in using Western-supplied missiles. Earlier on Wednesday, Zelenskyy said that nations who seek to end the war should offer assurance to Ukraine regarding its future defence, Al Jazeera reported.He said, \"To be honest, I believe that we have a right to demand serious security guarantees from countries that aim for peace in the world.\" Zelenskyy made these remarks while addressing a press conference in Kyiv, responding to Trump's statement that he understood Russia's opposition to Ukraine becoming part of NATO.While addressing a press conference at his Mar-a-Lago estate on Tuesday, Trump said, \"Russia has somebody right on their doorstep, and I could understand their feelings about that.\" Zelenskyy said that the US, Germany and Slovakia have been in the way of Ukraine immediately joining the NATO alliance. (ANI) \n\n Read This Next U.S. stocks end mixed, Dow Jones gains 107 pointsJetBlue fined for flight delays, and passengers may see refundsEven before US alcohol warning, younger Americans turning to mocktailsUS new car sales rose to five-year high in 2024, helped by hybridsDow Jones dives 78 points, Nasdaq loses nearly 2% \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274923070/at-least-13-people-killed-30-others-injured-in-russian-strike-in-ukraine-zaporizhzhia","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2025-01-09 00:27:17","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.32},{"id":279397350,"title":"Stock Market Today: Stocks end mixed as Treasury yields gain, tech struggles","text":"Updated at 5:05 PM by Rob Lenihan\n\nStocks finished mixed Wednesday as investors looked to recoup some of yesterday's selloff that was tied to surging inflation risks.\n\nThe Dow Jones Industrial Average gained 106.84 points, or 0.25%, to finish the session at 42,635.20, while the S&P 500 added 0.16% to close at 5,918.25 and the tech-heavy Nasdaq lost 0.06% to end the day 19,478.88. \n\nFollowing the release of minutes of the December Fed meeting, Jeffrey Roach, chief economist for LPL Financial, said “markets could get choppy if there is a surprise in Friday’s payroll release.”“A softer job market could lift the unemployment rate, giving the Fed reason to cut rates later this quarter,” he said. “Some industry data are hinting at softer hiring across the economy.”\n\nUpdated at 2:08 PM EST\n\nFed minutes\n\nThe Federal Reserve's December rate cut was the subject of tense debate among officials, minutes of the meeting indicated, suggesting further reductions will be data dependent and likely focused on the implications of new tax and tariff policies from the White House.\n\nThe Fed lowered its benchmark lending rate by a quarter of a point, to 4.375%, on December 18, but at the same time lifted their year-ahead inflation forecasts amid a resilient economy and the prospect of higher debt burdens and protectionist tariffs under President-elect Donald Trump.\n\n \"Participants expected that inflation would continue to move toward 2%, although they noted that recent higher-than-expected readings on inflation, and the effects of potential changes in trade and immigration policy, suggested that the process could take longer than previously anticipated,\" the minutes read.\n\nUpdated at 1:10 PM EST\n\nThird time's the charm\n\nForeign investors were active at the final of three Treasury coupon auctions from the Treasury this week, a highly-anticipated sale of 30-year bonds amid the sharp move higher in global government bond yields. \n\nThe $22 billion sale drew overall bids worth around $55.5 billion, a level that generated a so-called bid-to-cover, or demand ratio of 2.52. That was higher than the 2.39 ratio generated in December and included solid participation from foreign buyers, who took down just 66.6% of the sale, bang in line with the six-auction average of 66.5%.\n\nThe overall auction yield was 4.913%, the highest since August of 2007.\n\nBenchmark 10-year yields, meanwhile, eased to 4.671% following the 30-yera bond sale, a move that could support stocks into the final hours of trading\n\nUpdated at 11:42 AM EST\n\nCalifornia wildfires\n\nJPMorgan has estimated that the cost of the wildfires spreading through Southern California, the worst in more than a decade, could be as high as $10 billion, with losses for the insurance industry \"high but manageable\".\n\nThe fires, which are being spread by hurricane-forced winds through the greater Los Angeles area, with the largest hitting the Pacific Palisades suburb just west of Santa Monica. \n\nCalifornia Governor Gavin Newsom declared a state of emergency late Tuesday, Los Angeles Mayor Karen Bass has urged residents to evacuate the area.\n\nUpdated at 9:35 AM EST\n\nThe S&P 500 was marked 9 points lower, or 0.14% in the opening minutes of trading, with the Nasdaq down 25 points, or 0.1%. The Dow fell 62 points while the mid-cap Russell 2000 slumped 22 points, or 0.99%.\n\nBenchmark 10-year Treasury yields were last marked at 4.712% while the U.S. dollar index was marked 0.6% higher against a basket of its global peers at 109.196.\n\nUpdated at 8:35 AM EST\n\nSliding claims\n\nAround 201,000 Americans filed for first-time unemployment benefits last week, the Labor Department reported, a smaller-than-expected total that could offset the impact of the ADP Employment report.\n\nThe headline figure compares with a Wall Street forecast of 218,000 and the prior week-period tally of 211,000. \n\nBenchmark 10-year-note yields were last marked at 4.703% while rate-sensitive 2-year notes were trading at 4.283%, putting the yield difference between the two at around 42 basis points.\n\nStocks were little changed following the data release, with futures indicating a 5 point decline for the S&P 500 and a 31 point pullback for the Nasdaq.\n\nUpdated at 8:19 AM EST\n\nSolid, but slowing\n\nPayroll processing group ADP said 122,000 new jobs were created in the private sector last month, a smaller-than-expected reading that could tame some of the market's near-term inflation concerns.\n\nThe headline tally was down 24,000 from November, ADP said, with service sector hiring, particularly in trade and transportation, leading the hiring pace.\n\n“While overall growth for the month was healthy, industry performance was mixed,” said the group's chief economist, Nela Richardson. “Manufacturing was the weakest we've seen since spring. Financial services and leisure and hospitality were also soft.” \n\nUpdated at 7:42 AM EST\n\nTrump tariff threat\n\nPresident-elect Donald Trump is planning to use the International Economic Emergency Powers Act to justify the use of tariffs across a range of goods from rivals around the world, CNN reported, suggesting a sharper focus on trade deficits and protectionism heading into his second term in office.\n\nThe news hit stocks hard, with the S&P 500 reversing a premarket gain to be called around 13 points lower at the start of trading. Futures put the Dow in line for a 98-point opening-bell decline and the Nasdaq was priced for a 90-point pullback.\n\nBenchmark 10-year Treasury note yields, meanwhile, hit a fresh cycle high of 4.726%.\n\nStock Market Today\n\nStocks finished sharply lower on Tuesday, with the S&P 500 falling more than 66 points, or 1.1%, amid a notable mover higher in Treasury yields that followed stronger-than-expected jobs and activity data as well as a mixed auction of $39 billion in 10-year notes.\n\nA big pullback for Nvidia (NVDA) , alongside declines in megacap names such as Apple (AAPL) and Tesla (TSLA) , pulled the Nasdaq into a 378-point tailspin in a heavy-volume trading day saw 20.5 billion shares change hands across all markets. \n\nTreasury yields have remained the market's focus this week following a series of moves that have underscored investors' inflation concerns as well as the uncertainty tied to the new administration of President-elect Donald Trump.\n\n Benchmark 10-year note yields hit a late-April high of 4.699% yesterday after the Labor Department posted a stronger-than-expected reading for November job openings and foreign buyers backed away from a second consecutive coupon auction from the Treasury.\n\nThe Atlanta Fed's GDPNow tracker, meanwhile, upgraded its assessment of fourth quarter growth to 2.7% from 2.4%, adding further pressure on bond prices and paring bets on a spring Federal Reserve rate cut.\n\nOn Wall Street, the inflation concerns, as well as the market's broader uncertainty over tax, tariff and immigration policies from the White House, continue to linger into the Wednesday session.\n\nKey stretch for markets\n\n\"With the next couple of weeks ushering in the first jobs report, inflation data, and earnings season of the year, we’re entering a stretch that could determine whether bulls regain their footing after the December dip,\" said Daniel Skelly, head of Morgan Stanley's Wealth Management Market Research & Strategy Team. \n\n\"From a seasonal perspective, January has been more mixed in recent decades, with the S&P 500 positive for the month in only 10 of the past 20 years,\" he added.\n\nHeading into the start of the trading day, futures contracts tied to the S&P 500, however, suggest an opening bell gain of around 21 points, with ADP's National Employment Report slated for 8:30 am Eastern time.\n\nThe Dow Jones Industrial Average, meanwhile, is priced for a 131 point advance while the Nasdaq is looking at a 92 point gain from last night's close.\n\nIn other markets, global oil prices are trading at the highest levels in three months, with U.S. crude topping the $75 per barrel mark, following a surprise decline in OPEC production over the month of December and renewed demand tied to the resilient domestic economy.\n\nMore Wall Street Analysis:\n\nVeteran trader picks battered stock as top stock to buyVeteran trader who correctly picked Palantir as top stock in ‘24 reveals best stock for ‘25Veteran fund manager reveals shocking Nvidia stock price target for 2025\n\nOverseas, Europe's Stoxx 600 was marked 0.33% higher in Frankfurt, with the FTSE 100 gaining 0.21% in midday trading in London.\n\nOvernight in Asia, the Nikkei 225 followed Wall Street lower with a 0.26% decline while the regional MSCI ex-Japan benchmark fell 0.57% into the close of trading.","url":"https://www.thestreet.com/investing/stock-market-today-stocks-bounce-as-treasury-yields-steady-tech-gains","image":"https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MTk0MTQwODA5NDU1NDc4Mjc3/nyse_trader_kl_120122.jpg","video":null,"publish_date":"2025-01-09 00:24:18","author":"Martin Baccardax","authors":["Martin Baccardax"],"language":"en","source_country":"us","sentiment":-0.094},{"id":279397344,"title":"Academy makes major change in supply amid Trump tariffs","text":"From social issues to the economy, any change in the presidency leads to major shifts in how a country is run, no matter who wins. \n\nHowever, the outcome of the latest U.S. presidential election might cause one of the biggest shifts in retailers' business models if they want to continue making profits and keep their finances in check. \n\n🎁 Don’t Miss This Amazing Holiday Move! Buy 1 Year and Get 1 Year FREE on TheStreet Pro. Act now before it’s gone ⏰\n\nFor years, the U.S. has heavily relied on China as its largest import market, primarily because of its low-cost manufacturing that allows for far more affordable consumer goods and huge supply chain capacity. \n\nAccording to the Office of the U.S. Trade Representative, in 2022, around $758.4 billion in U.S. goods and services were traded with China, with $562.9 billion of that total being Chinese imports into the U.S.\n\nPresident Donald Trump proposes higher tariffs on imported goods \n\nDuring his presidential campaign, President Donald Trump said he planned to impose significantly greater tariffs on goods imported from China, which could be 60% or higher. He added that a tariff of up to 20% would be implemented on all foreign-made goods and threatened a 100% tariff on all goods imported from Mexico.\n\nIn Trump's view, heavy tariffs would return manufacturing to the U.S., create more jobs, reduce the federal deficit, and boost the nation's economy. Although tariffs are intended to protect domestic industries, economists warn they could also damage foreign relationships between the U.S. and the rest of the world, leading to potential retaliation by those affected and a pricing war that could increase costs. \n\nAcademy cuts down on its China-sourced inventory amid potential Trump tariffs\n\nAcademy Sports + Outdoors, the American sporting goods chain store, revealed it has reduced the percentage of goods it obtains from its China suppliers to lessen its reliance on the country amid the potential Trump tariffs that could be implemented now that the new presidential term has begun.\n\n\"Over the last several years, as part of our normal course of business, we have taken proactive steps diversifying our sourcing base to reduce our direct import exposure from a single country, which we believe best positions our business in 2025 and beyond,\" said Academy CFO Carl Ford during its latest earnings call.\n\nThe sporting goods company has been making these changes slowly but effectively since 2019 when it relied on its Chinese suppliers for over 70% of its inventory. \n\nMore Retail News:\n\nCostco issues recall for essential medication over concerning contamination2024 domestic box office falls to $8.7 billion for first time since COVID-19Walmart issues major recall in 20 states over alarming issue\n\nCurrently, Academy only relies on around 50% of its China-sourced inventory, reflecting a 20% cut from previously. As for other international suppliers, the company said none of its inventory comes from Mexico or Canada. \n\nFor the rest of its inventory, Ford said during the earnings call that a large portion of its firearms and ammunition business is manufactured domestically, posing no exposure to the potential foreign-made tariffs. \n\nAlthough private brands represent approximately 21% of Academy's total business, these partner brands are also diversifying their sourcing as a cautionary measure for the potential upcoming tariffs, actively reducing exposure.\n\n\"If and when changes occur, we will take the appropriate actions to serve our customers and preserve the profitability of the company while continuing to deliver everyday value,\" said Ford.","url":"https://www.thestreet.com/retail/academy-makes-major-change-in-supply-amid-trump-tariffs","image":"https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjExOTUzMjI4MjY5NDk2Mjk2/houston-chronicle.jpg","video":null,"publish_date":"2025-01-09 00:24:18","author":"Fernanda Tronco","authors":["Fernanda Tronco"],"language":"en","source_country":"us","sentiment":0.054},{"id":279397392,"title":"Veteran analyst early to quantum computing stocks revamps outlook after stocks get clobbered","text":"Was it something I said?\n\nWell, if you're Jensen Huang, CEO of AI chipmaking empire Nvidia (NVDA) , yeah, actually, it was.\n\nSpecifically, Huang's choice of words during a talk with analysts nuked the shares of a group of quantum computing companies.\n\nWith just a couple of sentences, the top executive and co-founder of the world's second-most valuable company behind Apple (AAPL) deep-fried the Next Big Thing to cinders and sent investors screaming for the exits.\n\nSome names on the wrong side of the slaughter were Rigetti Computing (RGTI) , down 40% at last check. IonQ (IONQ) , lost 38%, D-Wave Quantum (QBTS) tumbled 31%, and Defiance Quantum ETF (QTUM) , slipped 4.4%, a relative slap on the wrist compared with the other companies' double-digit drubbing.\n\nIn case you didn't know, quantum computing is a field of computer science that uses quantum mechanics to solve problems that are too difficult for classical computers. \n\nWhile today’s computers use binary electrical signals to represent ones or zeros, quantum computers employ quantum bits or qubits, which are subatomic particles.\n\nIt is being touted in many circles as the future of tech with powers and abilities far beyond those of mortal machines.\n\nSo what exactly did Huang say to make the quantum crowd melt like a snowman in Singapore? \n\n“If you said 15 years for very useful quantum computers, that would probably be on the early side,” Huang declared. “If you said 30, it’s probably on the late side. But if you picked 20, I think a whole bunch of us would believe it.”\n\nAnd that was enough to paint the town 50 very ugly shades of red.\n\nNvidia CEO's comments spark selling in quantum computing stocks\n\nHuang, who gave a keynote address at the CES 2025 trade show in Las Vegas, added that he believes Nvidia will play a “very significant part” in creating the computers and helping the industry “get there as fast as possible.”\n\nD-Wave Quantum CEO Alan Baratz responded by saying that Huang is “dead wrong” and noted that his company is “commercial today” and its services are being used by companies like Mastercard (MA) today, “not 30 years from now, today.”\n\nIn all fairness, Huang is not the only one to suggest that quantum computing's day in the sun won't be any day soon.\n\nThe Boston Consulting Group said in a July study that \"quantum computing today provides no tangible advantage over classical computing in either commercial or scientific applications.\"\n\n\"Though experts agree that there are clear scientific and commercial problems for which quantum solutions will one day far surpass the classical alternative, the newer technology has yet to demonstrate this advantage at scale,\" the report said.\n\nBSG said classical computing continues to raise the bar thanks to the big strides it has taken in hardware, algorithms, and AI libraries and frameworks.\n\n\"At the same time, we are seeing undeniable progress and momentum in qubit counts, investment, and government support,\" the report said. \n\nBSG said it still had confidence in its projection that quantum computing will create $450 billion to $850 billion of economic value—sustaining a $90 billion to $170 billion market for hardware and software providers—by 2040, which matches Huang's early side projection.\n\nAn earlier McKinsey survey of tech executives, investors, and academics in quantum computing found that they believe that by 2035, there will be a fully fault-tolerant quantum computer, which is a system that will still function correctly even in the presence of errors or faults.\n\nThe remaining 28% of respondents believe this milestone won’t be reached until 2040 or later.\n\nTheStreet Pro's Stephen Guilfoyle surveyed the damage of Huang's comments and saw an opportunity.\n\nGuilfoyle, also known as Sarge, told readers that the quantum computing group had scored huge gains in mid-December and “then did a wild Celtic-style dance through a semi-volatile couple of weeks where the general direction was sideways.”\n\nThe veteran trader, whose career goes back to the New York Stock Exchange floor in the 1980s, had correctly gone long some of these stocks ahead of their December surge.\n\nWall Street veteran goes bargain hunting trades\n\nHe said he was still long three-digit gains, \"even after this morning as the entire group...is catching a severe backyard beating.\"\n\n\"One must ask oneself. ... Self, does Nvidia stand to gain if the quantum computing craze is pushed out a bit?\" he asked. \"I really am not smart enough nor educated enough on the subject to answer that question with any kind of authority.\"\n\n\"I do know that technological development only seems to accelerate,\" he added, \"and I have surmised that a legacy tech company that has not been a leader in the last two crazes, the cloud/data center and generative AI runs, might make an aggressive move and try to acquire growth through a merge into this space rather than try to get there organically.\"\n\nThe Sarge acknowledged that \"Jensen Huang clearly is more knowledgeable than I on the matter.\"\n\n\"But we already knew that the industry that will be quantum computing is highly speculative and that valuations are more an expression of potential rather than of cash flows and profitability,\" he continued. \n\n\"We already 'get' that quantum computing, which makes use of quantum mechanical formula to quickly solve highly complex questions or problems, is not just in its early innings, it's still in the batting cage and the game won't start for a couple of hours,\" Guilfoyle said.\n\nThe Wall Street veteran observed that most of the media seems to have missed another of Huang's comments during the same appearance.\n\nHe also said, \"just about every quantum computing company in the world is working with us now.\" \n\nMore Tech Stocks:\n\n5 quantum computing stocks investors are targeting in 2025Fierce technology battle erupts within Donald Trump's fanbase5 potential tech IPOs that may supercharge markets in 2025\n\n\"Maybe the iron is hot, but Huang, who can barely keep up with AI-focused demand, just does not need the next big thing to explode just yet ... and does not want these players to shop elsewhere,\" Guilfoyle said. \n\n\"These are not conclusions,\" he added. \"They are merely the thoughts that are rattling around my cranium as I try to excel in a changing environment.\"\n\nHe explained that he is limiting his entire exposure to quantum computing as an industry to a cap of 1.5% of his most often traded portfolio.\n\n\"I'll be adding to QUBT as it trades below $12.25 this morning. I will probably rebuild my long position in QBTS as well and I may even pick up an odd lot's worth of RGTI just to broaden my exposure to the industry,\" said Guilfoyle.\n\n\"This is speculative and we don't know who the players will be in Huang's 20 years (or less, maybe a lot less), nor do we know if one of the more tired legacy tech firms does something aggressive in the space,\" he said.\n\nAnd if you think there's any fear happening here, you don’t know the Sarge.\n\n\"We've been through too much,\" Guilfoyle said. \"We make educated choices based on what we know and what we see in an ever-changing environment. No, you can't frighten me by taking me down a notch. That only makes the fire burn brighter. Rock on, my friends. Rock on.\"","url":"https://www.thestreet.com/investing/stocks/veteran-analyst-who-was-early-to-quantum-computing-revamps-outlook-after-stocks-get-clobbered","image":"https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjExNzY3MTMzNTEwNTc1NjUx/quantum_computers_stocks_kl.jpg","video":null,"publish_date":"2025-01-09 00:24:18","author":"Rob Lenihan","authors":["Rob Lenihan"],"language":"en","source_country":"us","sentiment":-0.211},{"id":279397388,"title":"Fund manager who forecast Nvidia’s rally makes surprising move after CES keynote","text":"\"The ChatGPT moment for general robotics is just around the corner,\" Nvidia just said at CES.\n\nInvestors, however, weren't impressed.\n\n💰💸 Don’t miss the move: SIGN UP for TheStreet’s FREE Daily newsletter 💰💸\n\nNvidia (NVDA) shares tumbled roughly 6% on Tuesday, marking the biggest drop in months, after they'd touched a record $153.13. \n\nThe decline followed CEO Jensen Huang’s keynote at the tech industry’s annual Consumer Electronics Show in Las Vegas, where he unveiled the next big wave of artificial intelligence.\n\nWhile Huang’s vision for AI sparked gains for other tech stocks like Marvell (MRVL) , it wasn’t enough to sustain Nvidia’s rally, as investors probably expected more from the No. 1 company in the AI industry.\n\nHere's what Nvidia said at CES\n\nOne of the biggest news at the event was Nvidia’s progress in robotics and industrial AI.\n\nHuang highlighted the company’s new Cosmos platform, a foundation model designed to enable more efficient development of physical AI for the robotics industry, further expanding Nvidia’s reach into AI for business.\n\nSo far, Tesla (TSLA) has dominated the spotlight in robotics, but that might be about to change. Analysts say this could mark the ChatGPT moment for the entire industry and further cement Nvidia's position as a leader in AI.\n\nHuang also mentioned that Blackwell, its current flagship chip platform, is in full production, but he did not talk about Nvidia's next-generation design on chips following Blackwell — an update many investors are eagerly awaiting.\n\n“Many investors were hoping for more concrete progress updates on the ramp of Blackwell and some input as to the company’s progress with its next-generation GPU platform, Rubin,” Benchmark Research analyst Cody Acree wrote in a note, MarketWatch reported.\n\n\"There was zero mention of Rubin, although to be fair, this next-generation design is not expected until 2026.”\n\nVeteran portfolio manager sold Nvidia shares\n\nChris Versace, a veteran portfolio manager for TheStreet Pro, sold some of his shares in Nvidia after the move higher. \n\nVersace's career began in the 1990s. He first bought NVDA shares last February in TheStreet Pro's portfolio, and added to the position five times, with the last one in May.\n\nHis average gain on Nvidia shares is nearly 70%.\n\nOn Jan. 7, Versace sold some 8% of his Nvidia holdings at $144.54 per share. He also trimmed 7.6% of his Marvell stake at $116.31 a share. \n\nFollowing the sales, each of the two stocks accounts for about 4% of TheStreet Pro's total portfolio.\n\nVersace said Huang's speech was \"triggering some prudent portfolio management on our part, which also happens to lock in a slice of tremendous gains in both positions given their gains since bottoming in early August.\" \n\nNvidia stock has gained about 50% since last August, while Marvell has nearly doubled.\n\n\"We culled back the position sizes by less than 10% of the overall position size. The why behind that is we recognize there is more room to run, but we don't want to be overly exposed especially after such a big run in both stocks,\" Versace added.\n\nAnalysts from Bank of America share that opinion, that NVDA shares might have more room to grow. \n\nMore Tech Stocks:\n\n5 quantum computing stocks investors are targeting in 2025Fierce technology battle erupts within Donald Trump's fanbase5 potential tech IPOs that may supercharge markets in 2025\n\nThe investment firm affirmed a buy rating and $190 price target on Nvidia and continues to identify the stock as the firm's \"top sector pick\" after Nvidia's CES keynote.\n\n\"Nvidia continues to expand its well-optimized and targeted lineup of AI services for enterprise customers,\" said Bank of America analyst Vivek Arya.\n\nNvidia closed at $140.14 on Jan. 7.","url":"https://www.thestreet.com/investing/fund-manager-who-forecast-nvidias-rally-makes-surprising-move-after-ces-keynote","image":"https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjExOTUzMjE0NTc5Mjg4MDQw/us-computers-internet-technology-ces.jpg","video":null,"publish_date":"2025-01-09 00:24:18","author":"Silin Chen","authors":["Silin Chen"],"language":"en","source_country":"us","sentiment":-0.362},{"id":279397390,"title":"Veteran analyst who forecast 2024's rally offers blunt take on recent selling","text":"It wasn't the best way to start a new year.\n\nOn Jan. 2, the Dow Jones Industrial Average, the S&P 500, and the Nasdaq all ended in the red on the first day of 2025.\n\nStocks ended down last week, continuing a slide that began before the New Year.\n\nIs this a sign of things to come for the next 12 months or just a bad day at the office? \n\nWe could be heading into a tumultuous year as Donald Trump returns to the White House promising to impose tariffs and vowing to repeal 10 US federal statutes for every new one imposed.\n\nLooking back on 2024, Jennifer Timmerman, an investment strategy analyst with Wells Fargo, said, \"U.S. economic growth once again surprised to the upside while overseas economies saw another challenging year.\"\n\n\"Turning ahead to 2025, we expect the U.S. to sustain its leading-edge role in global growth, supporting our preferred tilt toward U.S. assets in diversified portfolios,\" Timmerman said. \n\nEconomist expects stocks to be less upbeat\n\n\"We believe the U.S. economy and markets will continue to outperform the rest of the world due to relatively stronger demographics, more potent fiscal stimulus, less regulation, and a more dynamic technology sector fueling greater investment spending growth,\" she added.\n\nJeremy Siegel, Wharton emeritus professor of finance, said during the Wharton Business Daily radio show on SiriusXM he expected the stock market to be less upbeat in the coming year.\n\nMore 2025 stock market forecasts\n\nStocks face correction risk as Santa Claus Rally fails to deliverVeteran trader who correctly picked Palantir as top stock in ‘24 reveals best stock for ‘255 quantum computing stocks investors are targeting in 2025Goldman Sachs picks top sectors to own in 2025\n\n\"We’ve had two really fantastic stock market years,” he said. “They exceeded my expectation this year with another 20% plus gain on top of what we had in 2023.\"\n\nSiegel said he expects 2025 to be more muted, forecasting growth in equities from zero to 10%. A correction—a 10% drop—is certainly a possibility.\n\nHe saw the possibility of “some cool off” with tech stocks. Siegel noted that even as AI is trending strong, “there seems to be possibilities of more competition and some slowdown in that area” in 2025.\n\nHe said tech companies led by the Magnificent Seven—a septet of tech titans including Nvidia (NVDA) , Tesla (TSLA) , Microsoft (MSFT) , and Apple (AAPL) —have “brought home the bacon.”\n\n “They produced earnings growth of 25% to 30%,\" Siegel said. But they’re one-third of the market. I could see them cooling in 2025 to maybe being flat on the whole.”\n\nAnd then we have Tom Lee, head of research for Fundstrat and the equity research firm's founder.\n\nLee, a Wharton graduate who predicted the market rally in 2024, has been analyzing stocks on Wall Street since the early 1990s. \n\nHe took a significant amount of flak in December 2023 for his bullishness, yet stocks continued gaining momentum, rising by double-digit percentages in 2024. \n\nVeteran analyst says buying the dip makes sense\n\nLee believes the tailwinds that helped 2024 gain more than 20% for a second straight year remain in place.\n\nIn fact, those tailwinds “are arguably stronger in 2025 than they were in 2024,” he added.\n\nLast month, Lee said that the S&P 500 will likely advance to around 7,000 by this summer before ending the year at around 6,600.\n\nIn the near term, Lee acknowledged that 2024 “ended on a whimper,” but historical precedent suggests that this lackluster year-end could set up a strong January. \n\nThe last trading week of 2024 saw four straight daily declines, and when the Fundstrat Data Science team looked at historically similar precedents, they found reason for constructiveness.\n\nSince 1928, there have been 10 previous instances of three or more consecutive daily declines in the final trading week of the year. \n\nStocks were up one month later 80% of the time, with a median gain of 3.6%.\n\nLooking further out, Fundstrat said in a Jan. 5 research note that stocks were up 12 months later 80% of the time as well, with median gains of 12.4%. That doesn’t mean this coming week will necessarily see a bounce, however. \n\nMark Newton, Fundstrat's head of technical strategy, observed, \"while I expect that this consolidation should be complete by mid-January, it’s hard to claim technically just yet that lows are in place.”\n\nLee said this means that a continued pullback might be possible, but that would represent a buying opportunity.\n\n “Buying the dip continues to make sense, in our view,” he said.","url":"https://www.thestreet.com/investing/veteran-analyst-who-forecast-2024s-rally-offers-blunt-take-on-recent-selling","image":"https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MTk5NjE2ODcwNzQ2MTcxMDA4/tom-lee-fundstrat.jpg","video":null,"publish_date":"2025-01-09 00:24:18","author":"Rob Lenihan","authors":["Rob Lenihan"],"language":"en","source_country":"us","sentiment":0.041},{"id":279397006,"title":"Joe Biden To Announce To Deliver 500 Million Dollar Weapons To Ukraine","text":"The United States is preparing to send an additional $500 million in military aid to Ukraine, pulling from existing stockpiles to expedite delivery. The move comes as the Biden administration aims to bolster Kyiv's defenses before President-elect Donald Trump assumes office, according to two U.S. officials.\r\nDefense Secretary’s Final Meeting with Ukraine Support Group\r\nThe announcement is expected during Defense Secretary Lloyd Austin’s last scheduled meeting with the Ukraine Defense Contact Group, a coalition of roughly 50 nations established shortly after Russia’s invasion of Ukraine in February 2022. This group has coordinated international efforts to provide weapons and military support to Ukraine.\r\n\r\nAddressing reporters, Austin emphasized the importance of continued solidarity with Ukraine. “Our focus will be on maintaining momentum, delivering results, and sending a clear message: The international community stands resolute in its support for Ukraine,” he said.\r\n\r\nThe upcoming meeting marks the 25th gathering of the U.S.-led group, though its future under the Trump administration remains uncertain.\r\nUrgent Delivery of Aid\r\nThe military aid package, funded through presidential drawdown authority, will be drawn directly from U.S. stockpiles. This mechanism allows for the rapid deployment of weapons and equipment to meet Ukraine’s immediate needs. A senior defense official noted that the goal is to deliver the munitions before the end of the month.\r\nScope of U.S. Support\r\nSince Russia's invasion nearly three years ago, the U.S. has provided approximately $66.5 billion in military aid to Ukraine. This latest package will be among the final allocations made under the Biden administration.\r\n\r\nCurrently, less than $4 billion in congressionally approved funding for Ukraine remains available. Decisions about the continuation of weapons support are expected to roll over to the Trump administration.\r\nUncertain Future for Ukraine Aid\r\nThe transition in U.S. leadership introduces questions about the long-term commitment to Ukraine. While the Biden administration has prioritized military aid to strengthen Ukraine's position in its ongoing conflict with Russia, Trump’s stance on future support remains unclear.\r\n\r\nAlso Read: Why Don't We Call It Mexican America?': Mexico President Responds To Donald Trump On Renaming The Gulf Of Mexico","summary":"The United States is preparing to send an additional $500 million in military aid to Ukraine, pulling from existing stockpiles to expedite delivery.","url":"https://www.newsx.com/world/joe-biden-to-announce-to-deliver-500-million-dollar-weapons-to-ukraine/","image":"https://www.newsx.com/wp-content/uploads/2025/01/weapons.png","video":null,"publish_date":"2025-01-09 00:24:14","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","category":"politics","source_country":"in","sentiment":0.029},{"id":279396940,"title":"&#8216;Why Don&#8217;t We Call It Mexican America?&#8217;: Mexico President Responds To Donald Trump On Renaming The Gulf Of Mexico","text":"Mexico’s president responded sharply to Donald Trump’s recent remarks about renaming the Gulf of Mexico, suggesting that the United States itself could be called \"Mexican America.\" The comments were made during President Claudia Sheinbaum’s morning press conference, where she addressed Trump’s controversial proposal to rename the Gulf of Mexico as the \"Gulf of America.\"\r\n\r\nThe video is translated to english:\r\n\r\nMexico's President Claudia Sheinbaum claps back at Trump using a map from 1607 to say that parts of the United States should be renamed 'Mexican America' (voice translated with AI) pic.twitter.com/qdWeO443dT\r\n— MeidasTouch (@MeidasTouch) January 8, 2025\r\n\r\n\r\nIn Spanish:\r\n\r\nWowww ‼️ Mexican President Claudia Sheinbaum responds to Trump on his proposal to change the name of the Gulf of Mexico — and points to a 17th century map of greater México.\r\n\r\n“We are going to call it América Mexicana. It sounds pretty, no?”\r\n\r\npic.twitter.com/VBQQkQbO2l\r\n— David Adler (@davidrkadler) January 8, 2025\r\n\r\nTurning the Tables\r\nSheinbaum showcased a 17th-century world map that referred to North America as \"Mexican America\" to underscore her point. \"Why don’t we call it Mexican America? It sounds nice, doesn’t it?\" she quipped, emphasizing that the Gulf of Mexico is the internationally recognized name, acknowledged by the United Nations.\r\n\r\nHer remarks were a direct response to Trump’s assertion earlier this week that renaming the Gulf to \"the Gulf of America\" was a suitable move. Trump claimed the name change was “appropriate” and tied it to his calls for Mexico to stem the flow of migrants and drugs into the U.S.\r\nPushback Against Criticism\r\nSheinbaum rejected Trump’s claims that Mexico was controlled by drug cartels, stating firmly, \"In Mexico, the people rule.\" She expressed confidence in maintaining good relations with Trump’s incoming administration but stood by Mexico’s sovereignty and its right to self-determination.\r\nTrump’s Renewed Focus on Mexico\r\nAs he prepares to begin his second term on January 20, Trump has reignited his criticism of Mexico. He has threatened to impose heavy tariffs on Mexican imports unless the country acts more aggressively to curb illegal immigration and drug trafficking. These statements echo his hardline stance during his first term, which saw the implementation of policies like the construction of a border wall.\r\nDiplomatic Tensions Loom\r\nTrump’s remarks and Sheinbaum’s sharp rebuttal highlight the ongoing tensions between the two neighboring nations. While Trump’s rhetoric appeals to his base, it risks straining one of the United States’ most significant trading relationships.\r\n\r\nAlso Read: Brazil Condemns Meta's Decision To Halt Fact Checking In United States Calls It 'Bad For Democracy","summary":"Mexico’s president responded sharply to Donald Trump’s recent remarks about renaming the Gulf of Mexico, suggesting that the United States itself could be called &#8220;Mexican America.&#8221;","url":"https://www.newsx.com/world/why-dont-we-call-it-mexican-america-mexico-president-responds-to-donald-trump-on-renaming-the-gulf-of-mexico/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Mexican-America.png","video":null,"publish_date":"2025-01-09 00:24:14","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","category":"politics","source_country":"in","sentiment":-0.108},{"id":279396910,"title":"Canada FM Dominic LeBlanc Backs Out From Liberal Party Leader Race, Says ‘US Tariff Threat Needs My Full Attention’","text":"Canadian Finance Minister Dominic LeBlanc has announced that he will not run for the leadership of the Liberal Party, saying he needs to focus on addressing the economic challenges posed by U.S. tariffs under Donald Trump’s administration.\r\n\r\nLeBlanc’s decision comes as the Liberal caucus gathers in Ottawa to discuss the process of replacing Prime Minister Justin Trudeau, who announced on Monday his plan to step down once the party selects a new leader.\r\n\r\n“Serving Canadians is an immense privilege,” LeBlanc said in a statement posted on X. “At a moment when Canada is at a crucial juncture in its relationship with its most important ally and trading partner, the United States, I firmly believe that at this time, the best way for me to serve our country is to direct my full attention to my job.”\r\n\r\nPlease see my statement regarding the Liberal Party of Canada’s upcoming leadership race: pic.twitter.com/WaqciWRsrC— Dominic LeBlanc (@DLeBlancNB) January 8, 2025 \r\n\r\n\r\n‘Tariff threats needs my full attention’\r\nLeBlanc, who has served as a Member of Parliament for New Brunswick for over two decades, emphasized the seriousness of the tariff threat. Trump recently escalated his rhetoric, suggesting “economic force” could be used to pressure Canada.\r\n\r\n“The threat these tariffs pose to our nation’s economic well-being and to the livelihood of a countless number of Canadian families cannot be understated,” LeBlanc said. “It requires nothing less than my full attention.”\r\n\r\nLeBlanc, a key figure in Trudeau’s cabinet, became finance minister after Chrystia Freeland’s resignation in December.\r\n\r\nWhile he was seen as a strong contender for the leadership, his close ties to the outgoing prime minister and his focus on combating tariffs likely influenced his decision.\r\n\r\n“I intend to work with my cabinet colleagues, provincial premiers, business leaders, and union officials to make the case against the unjust use of tariffs by Trump,” he added.\r\n\r\nLeBlanc confirmed he would continue to serve as a Liberal MP under the party’s new leader, though he won’t be part of the leadership race.\r\n\r\nThe race to replace Trudeau is expected to include several high-profile figures, including former Bank of Canada governor Mark Carney and cabinet ministers such as Francois-Philippe Champagne, Melanie Joly, and Jonathan Wilkinson.\r\n\r\nMeanwhile, the Liberal caucus is also set to discuss whether cabinet ministers should resign their posts while seeking party leadership, alongside other rules for the upcoming contest. Parliament is currently suspended until March 24, with an election likely to follow soon after.\r\n\r\nALSO READ: Canada Will Never Join The US, Trudeau Rebuffs Trump’s 51st State Remarks","summary":"Canada Prime Minister Justin Trudeau announced on Monday, January 6, his intent to step down once the party selects a new leader, and LeBlanc was a strong contender.","url":"https://www.newsx.com/world/canada-fm-dominic-leblanc-backs-out-from-liberal-party-leader-race-says-us-tariff-threat-needs-my-full-attention/","image":"https://www.newsx.com/wp-content/uploads/2025/01/IMG_0061.webp","video":null,"publish_date":"2025-01-09 00:24:14","author":"Vanshika Tyagi","authors":["Vanshika Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":0.088},{"id":279396936,"title":"Elon Musk Reacts To Donald Trump Jr&#8217;s Greenland Visit, Says, ‘Greenland People Most Welcome’ Amid Trump’s Plan To Acquire ‘Beautiful’ Island","text":"Billionaire Elon Musk has shown his support to President-elect Donald Trump’s renewed plans to acquire Greenland.\r\n\r\nRecently, Trump’s eldest son, Donald Trump Jr. made a ‘controversial’ visit to the icy Danish territory, Greenland. In a post on X, he shared images with a caption, “Greenland is beautiful!!!”\r\n\r\nGreenland is beautiful!!! 🇬🇱 pic.twitter.com/PKoeeCafPz— Donald Trump Jr. (@DonaldJTrumpJr) January 7, 2025 \r\n\r\nReposting it, Musk praised Greenland and stated that its people would be “welcome” as U.S. citizens if the island were to become part of the United States.\r\n\r\nIf the people of Greenland want to be part of America, which I hope they do, they would be most welcome! 🇺🇸 🇬🇱 https://t.co/lgzbVDpYOG— Elon Musk (@elonmusk) January 7, 2025 \r\n\r\n“If the people of Greenland want to be part of America, which I hope they do, they would be most welcome!” Musk wrote on X .\r\n\r\n\r\n\r\nSharing pictures from the visit, Trump called Greenland “beautiful” and reiterated his vision for the U.S. to acquire the autonomous territory.\r\n\r\nDonald Trump also posted on X, an image of Trump Jr. in Nuuk and a caption reading, “Don Jr and my Reps landing in Greenland. The reception has been great. They, and the Free World, need safety, security, strength, and PEACE!”\r\n\r\nDon Jr. and my Reps landing in Greenland. The reception has been great. They, and the Free World, need safety, security, strength, and PEACE! This is a deal that must happen. MAGA. MAKE GREENLAND GREAT AGAIN!Donald Trump Truth Social 09:40 AM EST 01/07/25— Donald J. Trump Posts From His Truth Social (@TrumpDailyPosts) January 7, 2025 \r\nHow was Trump Jr’s visit?\r\nDonald Trump Jr.’s arrived to Nuuk, aboard “Trump Force One,” the family’s private jet. The visit was intended as a personal trip, garnered a lukewarm response. He distributied red caps with the slogan “Make Greenland Great Again.”\r\n\r\nEpic day!!!!🇺🇸🇺🇸🇺🇸 https://t.co/wxI2WpozSz— Donald Trump Jr. (@DonaldJTrumpJr) January 8, 2025 \r\n\r\nPromised a large turnout at the airport, he was greeted by only a small crowd of curious locals, where MAGA T-shirts, however many of whom came to witness the moment rather than express support.\r\n\r\nVideos showed around 20 people at the airport terminal, with more gathering as Trump Jr.’s team departed.\r\n\r\nLocal officials declined to meet with Trump Jr., reiterating that his visit held no official purpose. However, he described the trip as an opportunity to “talk to people and see what they think about America.”\r\n\r\nFull throttle takeoff out of Greenland after an epic day. Big plane short runway in Nuuk. Send it. pic.twitter.com/TYCYjIEJTG— Donald Trump Jr. (@DonaldJTrumpJr) January 7, 2025 \r\n\r\nWhile the event was described as low-key, Trump Jr. shared his excitement about the reception in social media posts and emphasizing the “great” welcome he had received.\r\n\r\nGreenland loves America and Trump!!! Incredible people with an equally awesome reception. They just want to be able to utilize some of the incredible resources that they have and allow themselves, their country, and their kids to flourish. pic.twitter.com/7TPz0DACKX— Donald Trump Jr. (@DonaldJTrumpJr) January 7, 2025 \r\nTrump’s Ambitions to Acquire Greenland\r\nPresident-elect Trump has revived his interest in Greenland, first expressed in 2019 when he floated the idea of purchasing the island from Denmark. On Tuesday, he described Greenland as vital to U.S. national security, even suggesting he would not rule out military or economic measures to secure it.\r\n\r\n“This is a deal that must happen,” Trump stated at Mar-a-Lago. “Greenland and the Panama Canal are essential to America’s dominance, safety, and strength.”\r\n\r\nDespite Trump’s enthusiasm, Greenland’s leaders have been clear: the island is not for sale. Greenland Premier Mute Egede and Danish Prime Minister Mette Frederiksen have repeatedly dismissed Trump’s ambitions. “We are not for sale and will never be for sale,” Egede said.\r\n\r\nDiscussions around how much Greenland would cost have resurfaced. Experts have compared the potential acquisition to the U.S.’s 1867 purchase of Alaska from Russia for $7.2 million, equivalent to $153.5 million today.\r\n\r\nGiven Greenland’s larger size, approximately 836,000 square miles compared to Alaska’s 586,000, the price could exceed $230 million.\r\n\r\nALSO READ: Greenland PM Says, ‘Not For Sale’ Rejecting Donald Trump’s Desire To Acquire; Germany, France Issue Warnings To US President-Elect","summary":"Donald Trump Jr.’s arrived to Greenland, aboard “Trump Force One,” the family’s private jet. The visit was intended as a personal trip, garnered a lukewarm response.","url":"https://www.newsx.com/world/elon-musk-reacts-to-donald-trump-jrs-greenland-visit-says-greenfland-people-most-welcome-amid-trumps-plan-to-acquire-beautiful-island/","image":"https://www.newsx.com/wp-content/uploads/2025/01/IMG_0057.webp","video":null,"publish_date":"2025-01-09 00:24:14","author":"Vanshika Tyagi","authors":["Vanshika Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":0.27},{"id":279396938,"title":"Los Angeles Wildfires Leave Two Dead, Thousands Evacuated Amid Devastation","text":"At least two people have died as fast-moving wildfires wreak havoc in the Los Angeles area, forcing over 80,000 people to evacuate. The blazes, fueled by dry conditions and fierce winds, have burned through thousands of acres, destroyed homes, and plunged parts of California into chaos.\r\nFires Rage Across Southern California\r\nThe Palisades Fire has scorched more than 5,000 acres, obliterating over 1,000 structures. Meanwhile, the Eaton Fire has consumed 2,227 acres, and the Hurst Fire has spread across 500 acres, causing widespread destruction. These fires, combined with hazardous air quality and widespread power outages, are straining resources in the region. According to PowerOutage.com, nearly 300,000 energy customers were without power as of this morning. The Environmental Protection Agency has flagged neighborhoods in Los Angeles and Pasadena as having air quality levels hazardous due to heavy smoke.\r\nPolitical Fallout Amid Crisis\r\nIn the wake of the fires, President-elect Donald Trump has reignited his feud with California Governor Gavin Newsom. On Truth Social, Trump criticized Newsom for failing to address water shortages, claiming it hampers firefighting efforts.\r\n\r\n“I will demand that this incompetent governor allow beautiful, clean, fresh water to FLOW INTO CALIFORNIA!” Trump wrote. He accused Newsom of blocking measures to pump water from Northern to Southern California, worsening the drought's impact.\r\n\r\nNewsom has yet to respond but has clashed with Trump on wildfire issues in the past. In 2018 and 2019, Trump threatened to withhold federal funds over alleged poor forest management, while Newsom argued that the administration ignored climate change as a contributing factor.\r\nChallenges Ahead\r\nEmergency responders continue to battle the blazes under challenging conditions, as high winds and dry weather persist. With thousands displaced, local authorities are urging residents to heed evacuation orders for their safety. Meanwhile, environmental and political tensions add another layer of complexity to the unfolding crisis in Southern California.\r\n\r\nAlso Read: How Much Could Greenland Cost? When Once U.S. Paid 7.2 Million Dollar For Alaska In 1867","summary":"The blazes, fueled by dry conditions and fierce winds, have burned through thousands of acres, destroyed homes, and plunged parts of California into chaos.","url":"https://www.newsx.com/world/los-angeles-wildfires-leave-two-dead-thousands-evacuated-amid-devastation/","image":"https://www.newsx.com/wp-content/uploads/2025/01/wildfire.png","video":null,"publish_date":"2025-01-09 00:24:14","author":"Swastika Sruti","authors":["Swastika Sruti"],"language":"en","source_country":"in","sentiment":-0.213},{"id":279397592,"title":"Ex-FBI informant who fabricated bribery story about Biden and his son Hunter gets 6 years in prison","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n 8 Pairs Of Touchscreen Gloves That'll Actually Keep Your Fingers Warm While You Text\n\n If You Have A Small Kitchen, You Probably Need These 17 Space-Saving Products\n\n Dry January: Here Are All The Best Mocktails, Non-Alcoholic Beers, And Faux Spirits For Your Alcohol-Free Month\n\n 19 Little Indulgences To Treat Yourself To In 2025\n\n The Best Toy Storage Solutions to Keep Your Kid's Stuff From Taking Over Your Home\n\n 17 Products That'll Help You Stay Organized While Working From Home\n\n The Best Birthday Gifts To Give In January 2025\n\n The Clock Is Ticking — Shop These 25 Last-Minute Amazon Prime Gifts Now\n\n If You Have An Amazon Prime Account, These 70+ Crowd-Pleasing Gifts Will Still Arrive Before Christmas\n\n 14 Bath Products To Treat Yourself To This Winter\n\n 20 Products Your Dry, Dehydrated Skin Will Thank You For Ordering\n\n 14 Hydrating Face Masks That’ll Save Your Skin This December\n\n Flight Centre's Sun Sale Is Officially On, And You Can Save Big On Trips To Mexico, Jamaica, And More\n\n Therabody Is Ringing In 2025 With A Huge Sale — Here's What To Add To Your Cart\n\n The Best Fitness Deals, Steals, And Sales You'll Find Online This Week\n\n CTVNews.ca Top Stories\n\n Can the U.S. really make Canada the 51st state?\n\n Talk of Canada becoming the 51st American state has raised an existential question on this side of the border: Could it be done? Could the maple leaf make way to the stars and stripes? According to several experts, it may be possible, but not painless.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n 'Terrifying' L.A. fires at 0% containment, 5 deaths reported\n\n A series of wildfires are searing through the Los Angeles area, forcing many to evacuate their homes. Follow along here for the latest updates.\n\n Ontario Premier Doug Ford says he is 'OK' after OPP vehicle he was in was 'sideswiped' in Highway 401 collision\n\n Ontario Premier Doug Ford was uninjured after an OPP vehicle he was travelling in was involved in a collision on Highway 401 earlier today.\n\n At least 60 University of Guelph students sick as 'cluster of illness' hits residence\n\n The University of Guelph is dealing with what they are calling a ‘cluster of illness’ among students living in residence.\n\n Hollywood stars react to devastating Los Angeles wildfires\n\n Large parts of Los Angeles County are under evacuation orders Wednesday as massive wildfires spread through the megacity's hilltop suburbs. Here is what some of the stars are seeing from their backyards.\n\n Canada among 'top 5 losers' in new passport ranking\n\n A new global ranking may raise doubts about Canada's reputation of being open to other countries.\n\n Donald Trump visits Jimmy Carter's casket in Capitol Rotunda after criticizing him\n\n U.S. president-elect Donald Trump, who has alternated among praising, criticizing and even mocking Jimmy Carter, came Wednesday to the Capitol Rotunda to pay his respects as the 39th president lay in state ahead of his funeral Thursday in the nation's capital.\n\n Mexico's president offers sarcastic retort to Trump's 'Gulf of America' comment\n\n Mexico's President Claudia Sheinbaum responded sarcastically on Wednesday to U.S. president-elect Donald Trump's proposal to change the name of the Gulf of Mexico to the Gulf of America.\n\n Police in Cornwall, Ont. arrest 4 in connection with attempt to smuggle people into U.S.\n\n Ontario Provincial Police say four people have been arrested and charged in connection with an apparent human smuggling scheme after a vehicle bound for the United States was found to have several people hidden inside of it.\n\n Ontario's so-called 'crypto king' faces new criminal charges in intimate partner violence case\n\n Ontario's self-proclaimed 'crypto king,' Aiden Pleterski is facing charges in an alleged case of intimate partner violence in Vaughan last week.\n\n 'You're killing them inside': Sask. hockey referee blows the whistle on verbal abuse of young officials\n\n A Saskatchewan hockey referee is gaining widespread attention after posting a video on social media telling coaches and parents to “do better.”\n\n Police in Cornwall, Ont. arrest 4 in connection with attempt to smuggle people into U.S.\n\n Ontario Provincial Police say four people have been arrested and charged in connection with an apparent human smuggling scheme after a vehicle bound for the United States was found to have several people hidden inside of it.\n\n 'Extremely triggering': Facebook drug ads cause concern for Calgarian in recovery\n\n A Calgary man who struggled with addiction for more than two decades is questioning why his Facebook account has been showing advertisements for drugs.\n\n Ontario Premier Doug Ford says he is 'OK' after OPP vehicle he was in was 'sideswiped' in Highway 401 collision\n\n Ontario Premier Doug Ford was uninjured after an OPP vehicle he was travelling in was involved in a collision on Highway 401 earlier today.\n\n Ontario has 'strong list' to counter possible Trump tariffs: Ford\n\n Ontario Premier Doug Ford says his government has a “strong list” of possible retaliatory measures if U.S. president-elect Donald Trump moves ahead with imposing tariffs on Canadian goods.\n\n Donald Trump visits Jimmy Carter's casket in Capitol Rotunda after criticizing him\n\n U.S. president-elect Donald Trump, who has alternated among praising, criticizing and even mocking Jimmy Carter, came Wednesday to the Capitol Rotunda to pay his respects as the 39th president lay in state ahead of his funeral Thursday in the nation's capital.\n\n At least 2 dead, thousands flee as wildfires burn out of control and destroy homes across the Los Angeles area\n\n Multiple massive wildfires tore across the Los Angeles area with devastating force early Wednesday, destroying more than 1,000 structures and killing at least two people as desperate residents escaped through flames, ferocious winds and towering clouds of smoke.\n\n Gold-plated watches and electoral map sneakers: Trump’s newest merchandise raises conflict of interest questions\n\n In the two months since the election, President-elect Donald Trump has urged his nearly 8.5 million followers on Truth Social to buy limited edition guitars that bear his signature and Trump-themed fragrances that “represent winning.”\n\n Here's the advice Biden's top health official has for Robert F. Kennedy Jr.\n\n Thousands of people were dying from COVID-19 every day. Americans were still being ordered to stay-at-home or mask in public. Millions of people were eager to line up for jabs of the newly-released COVID-19 vaccines.\n\n Leader of Japanese crime syndicate pleads guilty to conspiring to traffic nuclear materials to Iran\n\n The purported leader of a Japan-based crime syndicate pleaded guilty Wednesday to charges alleging that he conspired to traffic uranium and plutonium from Myanmar in the belief that Iran would use it for nuclear weapons.\n\n Stowaways on planes and inside landing gear raise worries about aviation security\n\n People have been found dead hiding in the wheel wells of planes, two stowaways were arrested on different flights last year and a passenger recently opened an emergency door while a plane was taxiing in Boston.\n\n Can the U.S. really make Canada the 51st state?\n\n Talk of Canada becoming the 51st American state has raised an existential question on this side of the border: Could it be done? Could the maple leaf make way to the stars and stripes? According to several experts, it may be possible, but not painless.\n\n Minister LeBlanc says not running for Liberal leadership, as caucus meets to discuss process to replace Trudeau\n\n Longtime cabinet minister Dominic LeBlanc will not be running to replace Prime Minister Justin Trudeau as head of the Liberals. He announced his decision in a statement posted to social media on Wednesday.\n\n Cabinet ministers say take Trump threats seriously, but don't overreact\n\n Canada should not overreact to U.S. president-elect Donald Trump's comments about annexing Canada, but should still take them seriously, several federal cabinet ministers said Wednesday.\n\n U.S. hospital workers charged in death of non-verbal patient left in scalding bath for nearly an hour\n\n Two workers at a state-run hospital in West Virginia have been charged in connection with the death of a 61-year-old non-verbal man who investigators said was left in a scalding hot bath for nearly an hour.\n\n 'Extremely triggering': Facebook drug ads cause concern for Calgarian in recovery\n\n A Calgary man who struggled with addiction for more than two decades is questioning why his Facebook account has been showing advertisements for drugs.\n\n At least 60 University of Guelph students sick as 'cluster of illness' hits residence\n\n The University of Guelph is dealing with what they are calling a ‘cluster of illness’ among students living in residence.\n\n Calling women ‘household objects’ now permitted on Facebook after Meta updated its guidelines\n\n Meta announced sweeping changes to how it moderates content that will roll out in the coming months, including doing away with professional fact checking.\n\n ByteDance's Lemon8 gains traction amid TikTok ban threat as creators push the app\n\n Amid a looming U.S. ban on TikTok, content creators have been pushing the platform's sister app. Lemon8 resembles an amalgamation of the types of short-form videos found on TikTok and the picture-perfect aesthetic of Instagram and Pinterest.\n\n This alien plant is lethal for the environment. Now it’s being turned into a plastic to regrow forests\n\n Lake Naivasha, northwest of Nairobi, Kenya is becoming increasingly unnavigable. Water hyacinth, the world's most widespread invasive species, is blanketing the lake, choking its fish and leaving people stranded.\n\n Entertainment \n\n Hollywood stars react to devastating Los Angeles wildfires\n\n Large parts of Los Angeles County are under evacuation orders Wednesday as massive wildfires spread through the megacity's hilltop suburbs. Here is what some of the stars are seeing from their backyards.\n\n Pamela Anderson says she was confronted on plane by angry passenger who thought she was someone else\n\n Pamela Anderson has recounted how she was confronted on board a flight after being mistaken for a member of the country band The Chicks, formerly known as the Dixie Chicks.\n\n Expected guilty plea for man in 'Wizard of Oz' ruby slippers case postponed due to hospitalization\n\n A hearing where a Minnesota man was expected to plead guilty to hiding a stolen pair of ruby slippers that Judy Garland wore in 'The Wizard of Oz' was postponed indefinitely Wednesday after his attorney told the court that the man is hospitalized.\n\n These are the jobs in demand this year\n\n As 2025 gets into full swing, gaps in Canada's job market offer new opportunities to start fresh -- in some sectors, more than others.\n\n 'What are we talking about?' Trump's 'economic force' comments cause worry, disbelief\n\n Incoming U.S. president Donald Trump's escalating rhetoric around implementing tariffs on Canadian products are sparking worry and disbelief, though some of the companies potentially most affected are staying quiet.\n\n Ricki's and cleo retail brands closing, Bootlegger restructuring\n\n Several Canadian fashion retailers will be closing their doors after ownership company Comark Holdings announced it has filed for creditor protection.\n\n Lifestyle \n\n Canada among 'top 5 losers' in new passport ranking\n\n A new global ranking may raise doubts about Canada's reputation of being open to other countries.\n\n If there's a 'Father of Craft Beers,' it might be former President Jimmy Carter\n\n In 1978, President Carter signed into law a bill that legalized homebrewing. Like most inventions, this new style of ale didn't stay inside garages for long.\n\n Walmart's version of the Hermes Birkin has taken over the internet\n\n Budget-conscious buyers looking for luxury alternatives have flocked to Walmart's Birkin bag look-alike, nicknamed the 'Wirkin.'\n\n Outdoor hockey is coming to Florida. The NHL will have games in Miami and Tampa next season\n\n The NHL announced that the Stanley Cup champion Florida Panthers will play host to the New York Rangers at loanDepot Park in Miami and the Tampa Bay Lightning playing host to the Boston Bruins at Raymond James Stadium.\n\n Oilers fine-tune details to become hottest NHL team since U.S. Thanksgiving\n\n The Edmonton Oilers have been the hottest NHL team since American Thanksgiving, that often-accurate divining rod applied to the standings at the season's quarter pole to predict which teams will and won't make the playoffs.\n\n Calgary Flames game postponed in L.A. as wildfires burn nearby\n\n The Calgary Flames game in Los Angeles on Wednesday night has been postponed due to the wildfires raging through the area.\n\n From AI assistants to holographic displays, automakers showcase in-cabin experiences at CES\n\n Automakers pulled out all the stops to showcase their latest advances for in-vehicle experiences at CES, the Consumer Technology Association’s annual trade show of all things tech, in Las Vegas this week.\n\n U.S. probing about 2.6 million Tesla vehicles over 'Actually Smart Summon' feature\n\n The National Highway Traffic Safety Administration said on Tuesday it has opened a probe into 2.6 million Tesla vehicles in the United States over reports of crashes involving a feature that allows users to move their cars remotely.\n\n Waterloo Regional Police Service helps recover 20 stolen vehicles in Hamilton, Ont.\n\n Waterloo Regional Police Services helped recover 20 stolen vehicles in Hamilton, Ont.\n\n Local Spotlight \n\n 4 generations on 1 lot: One family's creative response to B.C.'s housing crisis\n\n A single lot in Delta, B.C., that used to be home to a single rancher built in the 80s is the site of four separate homes, housing four generations of the same family.\n\n 'Unacceptable': Removal of beaver dam in Manitoba community sends surge downstream\n\n The removal of a beaver dam in a rural Manitoba community is having some unintended consequences, sending a small flood downstream, catching residents off-guard.\n\n Project Linus: Moncton group marks 15 years of handing out blankets to thousands of children\n\n For 15 years, those who volunteer for the Greater Moncton chapter of Project Linus have been making blankets for children who need comfort at challenging time in their lives.\n\n Social media-famous corgi from Kitchener, Ont. rescues owner\n\n A captivating canine is being hailed as a hero after one of his owners took a terrifying fall.\n\n These 90-year-old identical twins were born on a Saskatchewan farm, but grew to love the city\n\n Rose Worona and Anne Skwarchuk were born in 1935 on a farm near Hafford. Now, they’re celebrating their 90th birthday together.\n\n 'Crawl bearers' carry mosaic bar top 2 km to new home\n\n In a move signalling the beginning of a new era, staff and patrons carried Phog Lounge’s approximately 400-pound mosaic bar top through the downtown.\n\n Elvis Gratton actor Julien Poulin has died at 78\n\n Actor Julien Poulin passed away at the age of 78 on Saturday.. Born in Montreal on April 20, 1946, Poulin appeared in some 100 films. His most memorable role was certainly that of Bob Gratton in the cult classic trilogy 'Elvis Gratton', directed by his friend Pierre Falardeau.\n\n Maritime hockey teams go head-to-head in 'blood feud' for good cause\n\n Three teams in the Quebec Maritime Junior Hockey League (QMJHL) are battling for a cause greater than hockey this January in the Battle of the Bridge – an annual blood donation challenge.\n\n Sellers' market: Average Edmonton home prices jumped in 2024 in each residential category\n\n Fewer homes for sale in Edmonton resulted in higher year-over-year prices for them as 2024 ended, according to the Realtors Association of Edmonton.\n\n Vancouver \n\n B.C. RMT banned from treating female patients who are not 'fully clothed' from waist down\n\n A massage therapist in Surrey, B.C., is not allowed to treat female patients unless they are \"fully clothed\" from the waist down, according to the professional regulator.\n\n B.C. child killer denied parole\n\n Child killer Shane Ertmoed has been denied day parole. He is serving a life sentence for the murder of 10-year-old Heather Thomas in Cloverdale, B.C., in 2000.\n\n 'Passenger overboard' prompts BC Ferries cancellations\n\n BC Ferries crews arriving at the Tsawwassen terminal Wednesday morning responded to a report of a passenger overboard, according to the company.\n\n Ontario Premier Doug Ford says he is 'OK' after OPP vehicle he was in was 'sideswiped' in Highway 401 collision\n\n Ontario Premier Doug Ford was uninjured after an OPP vehicle he was travelling in was involved in a collision on Highway 401 earlier today.\n\n Toronto police arrest one of Canada's most wanted fugitives\n\n One of Canada’s most wanted fugitives, who is the suspect in a fatal double shooting in south Etobicoke more than two years ago, has been arrested.\n\n Ontario's so-called 'crypto king' faces new criminal charges in intimate partner violence case\n\n Ontario's self-proclaimed 'crypto king,' Aiden Pleterski is facing charges in an alleged case of intimate partner violence in Vaughan last week.\n\n 'Extremely triggering': Facebook drug ads cause concern for Calgarian in recovery\n\n A Calgary man who struggled with addiction for more than two decades is questioning why his Facebook account has been showing advertisements for drugs.\n\n Calgary Flames game postponed in L.A. as wildfires burn nearby\n\n The Calgary Flames game in Los Angeles on Wednesday night has been postponed due to the wildfires raging through the area.\n\n ATA warns standardized testing will cause 'stress and anxiety' for kindergarteners\n\n Kindergarteners in the province will receive standardized testing for the first time this month, something the Alberta Teachers’ Association (ATA) says will negatively impact both teachers and students.\n\n 'Not for sale': pushback as Trump's rhetoric escalates\n\n Pushback to Donald Trump's escalating rhetoric continued Wednesday following the president-elect's threat to use economic force to acquire Canada as the 51st state.\n\n Canada as the 51st State: Americans in Watertown, N.Y. react\n\n Watertown, N.Y. is a border city where opinions on Canada potentially becoming the 51st U.S. state are as diverse as the people themselves. New Yorkers living in the city about an hour south of the border are weighing in on the idea, with many sharing mixed emotions.\n\n Police in Cornwall, Ont. arrest 4 in connection with attempt to smuggle people into U.S.\n\n Ontario Provincial Police say four people have been arrested and charged in connection with an apparent human smuggling scheme after a vehicle bound for the United States was found to have several people hidden inside of it.\n\n Two Quebec planes and their crews helping fight devastating L.A. wildfires\n\n A pair of Quebec water bombers and their crews are in California helping fight the massive wildfires tearing through the Los Angeles area\n\n Quebec increases funding for mining institute\n\n The province is increasing funding for the Quebec mining institute (INMQ) from $1 million to $1.5 million for the 2024-2025 financial year.\n\n Police in Cornwall, Ont. arrest 4 in connection with attempt to smuggle people into U.S.\n\n Ontario Provincial Police say four people have been arrested and charged in connection with an apparent human smuggling scheme after a vehicle bound for the United States was found to have several people hidden inside of it.\n\n 'This isn't just my mom's story,' says daughter of woman allegedly killed by partner\n\n Abigail Robson says she moved from Nova Scotia to Alberta as a young girl with her mother 10 years ago for a fresh start.\n\n ATA warns standardized testing will cause 'stress and anxiety' for kindergarteners\n\n Kindergarteners in the province will receive standardized testing for the first time this month, something the Alberta Teachers’ Association (ATA) says will negatively impact both teachers and students.\n\n Woman dies after being hit by 2 cars in north Edmonton\n\n Alcohol is believed to be a factor in the death of a pedestrian who was hit by multiple vehicles in Eastwood on Tuesday.\n\n Police arrest suspect in two N.S. homicides\n\n Police have arrested a New Brunswick man wanted for the deaths of two people in Nova Scotia last month.\n\n Longtime friend mourns the death of N.S. woman killed in Edmonton\n\n Kenda Hayman from Pictou County, N.S., is mourning the death of her long-time friend, Ashley Burke, who was killed in Edmonton, Alta, in an act of intimate partner violence.\n\n Victim’s friend testifies in Halifax mall murder trial\n\n A second-degree murder trial in the death of Ahmad Al Marrach heard from one of the victim’s friends Wednesday.\n\n Winnipeg hospital death to be investigated as critical incident\n\n The recent death of a man waiting for care in a Winnipeg hospital’s emergency department is being investigated as a critical incident.\n\n Protesters block heavy equipment from entering Lemay Forest; trees still being cut down\n\n It's full-blown Lemayhem in St. Norbert. On Wednesday morning, protesters blocked the road to Lemay Forest in an effort to stop more tree cutting in the area.\n\n Worker no longer with Interlake-Eastern Regional Health Authority following 'deeply hurtful' social media post\n\n An employee is no longer with the Interlake-Eastern Regional Health Authority following a post on social media about the landfill search for two murdered Indigenous women.\n\n Regina murder suspect who appeared on national most wanted list arrested\n\n The Regina Police Service (RPS) has arrested a suspect that appeared on Canada's Top 25 Most Wanted list – in relation to a homicide that occurred in May of 2024.\n\n Saskatchewan town sees flurry of construction with $30K housing cheque program\n\n An official with a town in southeastern Saskatchewan says its plan to offer $30,000 cheques to anyone building homes in the community is paying off.\n\n Yorkton school crafts ice sculpture for family literacy program\n\n An ice sculpture of a well-known book character has been crafted at an elementary school in Yorkton in support of a literacy initiative.\n\n Kitchener \n\n Pedestrian dies after crash involving Guelph city bus\n\n A pedestrian has died after a crash involving a city bus in Guelph.\n\n At least 60 University of Guelph students sick as 'cluster of illness' hits residence\n\n The University of Guelph is dealing with what they are calling a ‘cluster of illness’ among students living in residence.\n\n Faculty strike averted at Ontario colleges as both sides agree to binding arbitration\n\n A strike by faculty at Ontario’s 24 public colleges was averted Wednesday, with both sides reaching an agreement on key points and a promise to resolve outstanding issues in mediation and arbitration.\n\n Saskatoon \n\n 'You're killing them inside': Sask. hockey referee blows the whistle on verbal abuse of young officials\n\n A Saskatchewan hockey referee is gaining widespread attention after posting a video on social media telling coaches and parents to “do better.”\n\n Sask. man missing since Christmas found dead\n\n A 50-year-old man from Prince Albert, reported missing on Christmas Eve, was found dead Wednesday.\n\n 'Call it a career': Another landmark Saskatoon restaurant has sold\n\n After serving meals for over 50 years, the locally owned and operated Cave Restaurant on 8th Street has been sold.\n\n Northern Ontario \n\n Ontario Premier Doug Ford says he is 'OK' after OPP vehicle he was in was 'sideswiped' in Highway 401 collision\n\n Ontario Premier Doug Ford was uninjured after an OPP vehicle he was travelling in was involved in a collision on Highway 401 earlier today.\n\n Motorist was driving 168 km/h on Hwy. 69, northern Ont. police say\n\n A 21-year-old from Sturgeon Falls has been charged with stunt driving and is accused of exceeding the speed limit by 58 km/h.\n\n Ontario has 'strong list' to counter possible Trump tariffs: Ford\n\n Ontario Premier Doug Ford says his government has a “strong list” of possible retaliatory measures if U.S. president-elect Donald Trump moves ahead with imposing tariffs on Canadian goods.\n\n Why hasn’t London opened warming centres for the homeless?\n\n Warming centres are welcoming people experiencing homelessness in Toronto, but a much lower temperature criteria in London means the temporary spaces are not operating here.\n\n Snowmobile collision claims the life of 58-year-old near Brucefield\n\n OPP say that they responded to a collision on Mill Road just west of the town of Brucefield just before 4:00 p.m.\n\n Attempted robbery of London jewellery store has LPS on the hunt for four suspects\n\n According to police, at roughly 4:15 p.m., four men arrived in a white SUV, and entered a jewellery store in the 400-block Wharncliffe Road South.\n\n Over $65,000 in stolen goods seized during Alliston raid: OPP\n\n Ontario Provincial Police executed a search warrant at a Boyne Street property in New Tecumseth, uncovering over $65,000 worth of allegedly stolen items, including a Kubota diesel side-by-side and various tools, dirt bikes, and equipment.\n\n Alleged serial ticket scammer 'Todd the Fraud' seeks resolution in case\n\n A Collingwood man nicknamed ‘Todd The Fraud’ by people who say they were defrauded by him in the sale of fake music concert and VIP NHL All-Star Game tickets in Toronto could soon be resolving his Barrie case.\n\n Wasaga Beach man plans to live mortgage-free after life-changing lottery win\n\n A Wasaga Beach man is celebrating a life-changing lottery win after saying yes to Encore.\n\n Would updated MPAC assessments lead to skyrocketing property tax hikes?\n\n Some residents may assume that a sharp rise in property values would lead to an equivalent increase in property taxes, but that's not the case. Here’s how it works.\n\n Ontario Premier Doug Ford says he is 'OK' after OPP vehicle he was in was 'sideswiped' in Highway 401 collision\n\n Ontario Premier Doug Ford was uninjured after an OPP vehicle he was travelling in was involved in a collision on Highway 401 earlier today.\n\n Fourth suspect arrested after east Windsor armed robbery\n\n All the suspects wanted after an east end armed robbery have now been arrested.\n\n Vancouver Island \n\n B.C. child killer denied parole\n\n Child killer Shane Ertmoed has been denied day parole. He is serving a life sentence for the murder of 10-year-old Heather Thomas in Cloverdale, B.C., in 2000.\n\n 'Passenger overboard' prompts BC Ferries cancellations\n\n BC Ferries crews arriving at the Tsawwassen terminal Wednesday morning responded to a report of a passenger overboard, according to the company.\n\n Mask requirement returning to B.C. health-care facilities\n\n In an effort to curb respiratory illnesses, medical masks will once again be required in B.C. health-care settings for staff and patients in most circumstances, effective immediately, CTV News has learned.\n\n 1 hospitalized, residents displaced after Kelowna apartment fire\n\n Firefighters knocked down a blaze on the third floor of a low-rise apartment building near downtown Kelowna Monday afternoon.\n\n Lost skiers rescued off B.C. mountain\n\n Search and rescue volunteers in B.C.’s Okanagan successfully reunited two skiers with their family Friday evening.\n\n Charges laid after child porn investigation that 'spanned several different countries,' Kelowna RCMP say\n\n Police in Kelowna say an international investigation has led to child pornography charges against a 46-year-old man.\n\n Lethbridge \n\n Lethbridge seeing less-than-average snowfall while Rockies return to average\n\n Lethbridge and much of southern Alberta have seen a relatively dry winter.\n\n Coaldale man charged in Lethbridge County break-and-enters\n\n A Coaldale man is facing a number of charges after a string of break-ins at rural properties in Lethbridge County were reported.\n\n Lethbridge motel murder suspect appears in court\n\n One of three suspects in a Boxing Day murder at a Lethbridge motel appeared in court Wednesday.\n\n Sault Ste. Marie \n\n Provincial police investigating suspicious death on St. Joseph Island, near Sault Ste. Marie\n\n Provincial police are investigating what they are calling \"a suspicious death\" on St. Joseph Island, near Sault Ste. Marie, Ont.\n\n Sault man charged in weekend stabbing\n\n A 26-year-old man from Sault Ste. Marie has been charged with aggravated assault and assault with a weapon following a stabbing in the city over the weekend.\n\n Northern Ontario-based comedy series Shoresy announces Season 4 premiere date\n\n The premiere date for Season 4 of Jared Keeso's original hit comedy series Shoresy has been announced along with the show's renewal for a fifth season.\n\n Adviser says Quebec-N.L. energy deal is 'very good,' as Opposition vows not to vote\n\n Newfoundland and Labrador's Opposition Progressive Conservatives vowed Wednesday that they will not vote on a draft energy deal with Quebec's hydro utility until it is scrutinized by independent experts.\n\n Newfoundland and Labrador energy deal with Quebec under scrutiny as debate opens\n\n Newfoundland and Labrador politicians are digging into the details of the province's draft energy deal with Quebec as four days of debate begin today in St. John's, N.L.\n\n Part of street washed away and state of emergency declared in N.L. town after storm\n\n Damaging winds and pounding surf that washed away part of a street in a small northeastern town in Newfoundland on Sunday triggered a state of emergency in the coastal community.\n\n Stay Connected","summary":"A former FBI informant who fabricated a story about President Joe Biden and his son Hunter accepting bribes that became central to Republicans’ impeachment effort was sentenced Wednesday to six years in prison.","url":"https://www.ctvnews.ca/world/ex-fbi-informant-who-fabricated-bribery-story-about-biden-and-his-son-hunter-gets-6-years-in-prison-1.7169277","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2025/1/8/alexander-smirnov-1-7169285-1736381914400.jpg","video":null,"publish_date":"2025-01-09 00:24:09","author":"Alanna Durkin Richer,The Associated Press","authors":["Alanna Durkin Richer","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.376},{"id":279397314,"title":"Who Is Joseph Aoun? Lebanon's Potential Next President","text":"As Lebanon will move to fill the presidential vacancy left unoccupied since 2022 on Thursday, the Hezbollah-endorsed candidate has dropped out with the odds favoring Joseph Aoun, leader of the Lebanese Army.Newsweek has reached out to the Lebanese Parliament and several subject matter experts for comment via email on Wednesday.Why It Matters Before the late-November ceasefire between Israel and Hezbollah—which has been violated multiple times—Lebanon faced an economic and political crisis, worsened by the conflict.Lebanon's last president, Michel Aoun, left office two years ago, and the position has remained vacant since. He bears no relation to Joseph Aoun.On Thursday, the country is set to hold elections to fill the top post, potentially ushering in a new era of leadership.What To Know Lebanon's nuanced internal politics are impacted by shifting factions and alliances largely consisting of leaders who participated in the country's devastating 15-year civil war that ended in 1990, making presidential elections difficult.These complications are compounded by Lebanon's confessional system mandating that the president be Maronite Christian, the prime minister Sunni Muslim and the speaker of parliament Shiite Muslim.The president of Lebanon is elected in a first round by a two-thirds majority of the parliament or via a second round by a simple majority. Seats in Lebanon's parliament are allocated by religion.Lebanon's Parliament currently has 128 members, requiring the next president to secure at least 86 votes in the first round. If no candidate achieves this, a simple majority of 65 votes is needed in subsequent rounds. It is not guaranteed a president will be elected, as was the case in June 2023.Who Is Running for President? On Wednesday, Lebanese politician Suleiman Frangieh, leader of the Marada Movement, who was backed by Hezbollah withdrew from the race, largely leaning Aoun as the top candidate.Frangieh is a member of the Lebanese Christian political family who shares close ties with former Syrian President Bashar al-Assad, with Frangieh having openly backed him in 2011. Frangieh is a former minister of interior and public health.In 2023, Hezbollah leader Hassan Nasrallah endorsed Frangieh's candidacy, saying, \"The natural candidate we support in the presidential elections is (former) minister Suleiman Frangieh.\" Nasrallah was killed by an Israeli airstrike on Beirut in late September.Aoun, 60, is the current leader of the Lebanese Armed Forces, who are influential in ensuring the Israel-Hezbollah ceasefire is intact, serving as patrol buffers in the south of the country.Nearly a year after Hamas' October 7, 2023, attacks on Israel, Israel invaded southern Lebanon to dismantle Hezbollah's military capabilities, significantly escalating the Middle East war. In late November, a ceasefire was agreed upon, though it has been violated several times.Aoun has served in the post since 2017, having first joined the Lebanese army in 1983. He was set to retire in January, however, the ongoing conflict has extended his term. The U.S. provides financial support to the Lebanese army.Lebanese Broadcasting Corporation International reported that Aoun has the support of 74 parliamentary members, giving him a clear edge in the race.Newsweek reached out to Dr. Massoud Boulos, who is serving as President-elect Donald Trump's Middle East adviser, via email on Wednesday.What People Are SayingFiras Maksad, a senior fellow at the Middle East Institute, wrote in a series of X, formerly Twitter, posts on Wednesday: \"[Aoun] is the preferred US candidate & late breaking info has it that he will get added support from a weakened Hezbollah & House Speaker Berri...visits by US, Saudi, French & Qatari envoys pushed fence sitters to Aoun, getting him to 74. Hezbollah probably understood the message, preferring to bank credit with Aoun rather than oppose the inevitable.\" In a third post, he wrote: \"The coordinated message delivered to Beirut by foreign envoys was clear, 'we see Aoun as having the characteristics needed for the coming period.' This was understood to mean crucial reconstruction & humanitarian aid is unlikely if Aoun is not president.\"Timour Azhari, Reuter's Iraq Bureau Chief, wrote in an X post on Wednesday: \"It's looking increasingly likely Lebanon's parliament will elect army commander Joseph Aoun to the presidency tomorrow after a 26-month vacancy. It's another sign of how much Iran's axis has been weakened after Hezbollah's battering by Israel and the fall of Assad.\"Michael Young, Senior Editor at the Carnegie Middle East Center in Beirut, wrote in an article on Wednesday: \"There is no doubt that the main contender, who is apparently supported by the five-nation group of states that has been meeting over Lebanon for almost two years—the United States, France, Saudi Arabia, Qatar, and Egypt—is the army commander Joseph Aoun.\"What Happens NextLebanon's parliament will vote on the next president on January 9.","summary":"Lebanon's Parliament will convene tomorrow to vote on the country's next president.","url":"https://www.newsweek.com/joseph-aoun-lebanon-potential-next-president-2012076","image":"https://d.newsweek.com/en/full/2560098/joseph-aoun.jpg","video":null,"publish_date":"2025-01-09 00:22:56","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"US","sentiment":0.042},{"id":279397712,"title":"Princess Kate set to 'spend more time’ by Prince William's side in 2025","text":"As the Princess of Wales turns 43 on Thursday January 9, the much loved royal’s life is world ’s away from where it was at the same time last year. In 2024, Princess Kate had started the year not knowing that the next twelve months would involve major surgery and a devastating cancer diagnosis - but now, a year on, she is finally able to embrace 2025 with a welcome return to normality having completed her treatment. \n\n Approaching her birthday with a new lease on life and a positive and gracious outlook, many royal experts have predicted that this year will see the Princess at her husband Prince William ’s side far more often as they resume their place on the world stage. With King Charles still undergoing treatment for his own cancer, Prince William and Princess Kate will be acutely aware of their future roles as King and Queen of the country - particularly as it means 2025 will likely hold far more international travel. \n\n As his father continues to recover, William is far more likely to be called in to represent the monarch at various state and official occasions, such as when he headed to Paris in December to meet with US-President Elect Donald Trump at the reopening of Notre-Dame cathedral. Which means having Princess Kate for support at his side, will now be more crucial than ever.\n\nREAD MORE: Princess Beatrice steps up for royal family ahead of welcoming second child\n\n \"Last year was an exceptional year, and William stepped up into a solo global-statesman role, but going forward, I think Catherine will spend more time at his side,\" Kate’s biographer Robert Jobson told HELLO!.\n\nHe added: \"They will both be mindful of their children's education and will make sure they're around if anything crucial happens, but there will be situations where they have to put the country and duty before their children. Once Trump becomes President, there will be another state visit, and William and Catherine will play a key role, just as the King did the last time, when the late Queen was alive. This is all part of William becoming a global figure.”\n\n Since announcing the successful competition of her treatment, Kate has been making a slow but steady return to her official duties, such as when she hosted her Together at Christmas concert last December. However, while the Princess has shown no hesitation in doing her duty, her health is still the priority - as is her young family. \n\n\"What we saw last year was her prioritising her recovery, and there hasn't been a step-change in that,\" a friend told the publication. \"There’s no press of a reset button as such.”","summary":"With the Princess of Wales set to celebrate her 43rd birthday on Thursday, one royal expert has weighed in on what the future holds now she is finally able to embrace 2025 with a welcome return to normality having completed her treatment","url":"https://www.mirror.co.uk/news/royals/princess-kate-set-spend-more-34446123","image":"https://i2-prod.mirror.co.uk/incoming/article34446140.ece/ALTERNATES/s1200/0_GettyImages-2187492448.jpg","video":null,"publish_date":"2025-01-09 00:22:08","author":"Phoebe Tonks","authors":["Phoebe Tonks"],"language":"en","category":"politics","source_country":"gb","sentiment":0.035},{"id":279396332,"title":"Liberals urge LeBlanc to reconsider decision not to run for leadership","text":"Liberal MPs are asking Finance Minister Dominic LeBlanc to reconsider his decision to not pursue the party leadership.\n\nLeBlanc posted on social media that he was “extremely grateful” for the support he received from caucus colleagues, but his attention was best directed towards fulfilling his duties as finance minister and addressing U.S. president-elect Donald Trump’s threat of imposing a blanket 25 per cent tariff on all Canadian goods.\n\nHowever, some of LeBlanc’s colleagues are holding out hope that he will change his mind.","url":"https://www.ipolitics.ca/news/liberals-urge-leblanc-to-reconsider-decision-not-to-run-for-leadership","image":"https://old.ipolitics.ca/wp-content/uploads/2025/01/CP173807722-scaled.jpg","video":null,"publish_date":"2025-01-09 00:20:13","author":"Davis Legree Repor","authors":["Davis Legree Repor"],"language":"en","category":"politics","source_country":"ca","sentiment":0.443},{"id":279396438,"title":"'Unrecognizable': Katy Tur details devastation in her hometown of LA from deadly wildfires","text":"IE 11 is not supported. For an optimal experience visit our site on another browser.\n\n'Unrecognizable': Katy Tur details devastation in her hometown of LA from deadly wildfiresJan. 8, 202510:28Now Playing'Unrecognizable': Katy Tur details devastation in her hometown of LA from deadly wildfires10:28UP NEXT'Entire neighborhood is basically gone': Katy Tur's childhood friend describes impact of wildfire07:59Jimmy Carter’s diplomatic success in the Middle East ‘was quite extraordinary’: David Miller08:12If there was ever president in need of checks and balances 'it’s Donald Trump’: Leibovich09:47Will Trump uphold his vow to pardon Capitol rioters on Day 1? ‘Trickier than it seems’07:25'No doubt' there's 'a lot of emotion' on Capitol Hill four years after riot: Rep. Crow06:17Johnson avoiding prolonged vote shows 'Donald Trump owns the party': Rep. Riggleman06:34'Major agenda in front of us': Rep. Donalds reacts to Johnson being re-elected as Speaker01:58Merchan orders Trump to attend sentencing on Jan 1002:47What led to New Orleans attack? Investigators looking into what made attacker ‘radicalized’04:29New Orleans Update: Bourbon Street reopens after deadly attack05:32'Pall of dread' looming over New Orleans after deadly attack02:53New Orleans ramping up security for Sugar Bowl, Super Bowl and Mardi Gras after deadly attack05:09American investigators probe cause of deadly South Korean plane disaster03:12Thank you to our MSNBC Reports editorial staff for an extraordinary year!05:12NYPD ramps up security for New Year's Eve in Times Square04:55Jimmy Carter 'put his faith into action’ by building homes with Habitat for Humanity05:25'Shock & awe' campaign: What Trump's plans are for Day 110:37Extreme weather coast-to-coast impacting holiday travel rush06:29Trump's 'unpredictability' is 'his foreign policy style’: Fmr. Homeland Security Advisor09:00Katy Tur'Unrecognizable': Katy Tur details devastation in her hometown of LA from deadly wildfires10:28Share this -CopiedKaty Tur, who grew up in Los Angeles, describes the devastating impact of the out of control wildfires raging on in Southern California. NBC News' Jacob Soboroff and former chief pilot and reporter for KCAL News Larry Welk, who also grew up in the area, weigh in on the apocalyptic scenes.Jan. 8, 2025Now Playing'Unrecognizable': Katy Tur details devastation in her hometown of LA from deadly wildfires10:28UP NEXT'Entire neighborhood is basically gone': Katy Tur's childhood friend describes impact of wildfire07:59Jimmy Carter’s diplomatic success in the Middle East ‘was quite extraordinary’: David Miller08:12If there was ever president in need of checks and balances 'it’s Donald Trump’: Leibovich09:47Will Trump uphold his vow to pardon Capitol rioters on Day 1? ‘Trickier than it seems’07:25'No doubt' there's 'a lot of emotion' on Capitol Hill four years after riot: Rep. Crow06:17MSNBC HIGHLIGHTS (BEST OF MSNBC)Play AllThe Beat with Ari'This is who we are - now': Jeff Daniels on election, 'good' characters, film & theater: Melber IntvMorning JoeChris Matthews: Jimmy Carter lived an extraordinary lifeMorning Joe'A journey of creativity': Marianne Jean-Baptiste on reuniting with Mike Leigh for 'Hard Truths'Morning Joe'Everywhere you look there are homes on fire': Reporter surveys Pacific PalisadesMorning JoeTrump asks Supreme Court to block sentencing in hush money caseMorning Joe'Truly mass destruction': Reporter details catastrophic wildfires in LA CountyPlay All","url":"https://www.msnbc.com/katy-tur/watch/-unrecognizable-katy-tur-details-devastation-in-her-hometown-of-la-from-deadly-wildfires-228803653908","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_01/1736370972115_n_tur_welk_soboroff_los_angeles_southern_california_wildfires_250108_1920x1080-rcykbk.jpg","video":null,"publish_date":"2025-01-09 00:19:13","author":"Msnbc","authors":["Msnbc"],"language":"en","source_country":"us","sentiment":0.03},{"id":279396432,"title":"Billionaires Zuckerberg, Bezos and Musk form tech oligarchy around Trump","text":"This is an adapted excerpt from the Jan. 7 episode of \"All In with Chris Hayes.\" With less than two weeks until Donald Trump takes office, an actual real-life — not metaphorical — oligarchy is coalescing around the president-elect. It’s pretty unprecedented in the context of the United States and ominous in many respects, but it is also a genuinely clarifying development for the pro-democracy coalition, especially as it prepares its opposition to the second Trump administration. I think there’s a recent historical parallel for this that could be instructive: The George W. Bush years after 9/11. It’s easy to forget now that before Sept. 11, 2001, Bush was not an especially popular president. He had lost the popular vote but won the election, in large part thanks to his brother’s government in Florida and a Republican Supreme Court that his father had helped put together. But all that changed on a dime after the attacks on America. Days after 9/11, Bush’s approval had skyrocketed to nearly 90%. All of a sudden, everyone seemed to decide this guy was a great, brilliant, courageous hero and the country was willing to get behind him. You saw the whole of American society falling in line behind him, from the media to the corporate boardrooms to the country music charts. In some ways, there was something clarifying about being in that dissident minority at that time. All the powerful people were on one side and you were on the other. That minority, which I was a part of, was convinced Bush and all the powerful people siding with him were wrong and we were right. History bore that out and, eventually, people would come around to that view. By the time he imploded the economy in the Great Recession, Bush’s approval rating bottomed out at 25% and everyone would pretend they had nothing to do with him. I think we are witnessing a similar moment after Trump’s election — though, thankfully it’s not quite as bad as post-9/11 America. There is something clarifying about the Trump tech oligarchy coalescing around him. Even before the election, the world’s richest man, billionaire Elon Musk, was inseparable from Trump. There’s also Musk’s one-time PayPal colleague, Peter Thiel, who has been a longtime benefactor to incoming Vice President JD Vance. But things shifted into top gear after November. This week, Apple CEO Tim Cook went out of his way to donate $1 million of his personal money to Trump’s inauguration. That was an unprecedented donation for Cook but it matches the amounts given to Trump’s inauguration by Amazon, Meta, the CEO of Uber, and the founder of OpenAI. And now, The Washington Post, owned by billionaire Amazon founder Jeff Bezos, has found itself in some controversy. Last week, Ann Telnaes, a political satirist at the paper drew up a cartoon lampooning all the tech billionaires prostrating themselves before Trump. That cartoonist ultimately quit her job after she says the paper refused to publish it. In a statement, David Shipley, the Post's opinions editor, said that he respected Telnaes but \"must disagree with her interpretation of events.” Shipley went on to say his decision was “guided by the fact that we had just published a column on the same topic as the cartoon and had already scheduled another column — this one a satire — for publication. The only bias was against repetition.” The next day, it was reported that the other part of the Bezos empire, Amazon, was paying a whopping $40 million to license and stream a vanity documentary about Melania Trump. All of that is insane. But then came an announcement from Facebook billionaire Mark Zuckerberg. On Tuesday, the founder of one of the world’s biggest social media empires declared he is ending content fact-checking, a practice they have done for years on Facebook, Instagram and Threads. Separately, Zuckerberg also just promoted Joel Kaplan, a Republican operative who served as George W. Bush’s deputy chief of staff, to global policy director for Meta. Zuckerberg also added a new member to the Meta board of directors, UFC CEO Dana White, a longtime Trump supporter and friend. That did not sit well with a lot of Facebook employees, who criticized the move internally. Those employees said the free speech platform deleted their comments, according to new reporting by 404 Media. It seems pretty obvious why you’d make all these moves, to curry favor with the big guy and his political partisans. But it’s also worth recalling why Meta had to institute its soon-to-be-former fact-checking policy in the first place. They didn’t do all this fact-checking stuff out of nowhere. They did it because starting in 2016, Facebook was used to promote violence against the Rohingya Muslim minority by the military government of Myanmar. Tens of thousands of people were murdered. Hundreds of thousands were left homeless. An in-depth Reuters investigation found the hateful language and the calls for violence that fueled the massacres were systematically promoted by bad actors: “The poisonous posts call the Rohingya or other Muslims dogs, maggots and rapists, suggest they be fed to pigs, and urge they be shot or exterminated.” “A United Nations investigator said Facebook was used to incite violence and hatred against the Muslim minority group. The platform, she said, had ‘turned into a beast,’” Reuters reported. Imagine having to tweak your product because you realized that libelous, violent incitement on your platform spurred the mass slaughter of an ethnic minority. It was big news at the time. Zuckerberg was raked across the coals by senators in open hearings on Capitol Hill. That was when the Facebook billionaire realized content moderation was good or, at least, necessary. Something he had to reiterate again after Jan. 6, 2021, when it became obvious that Trump and his allies used Facebook to spread election lies and organize the rallies that would become a Capitol insurrection. After that, Meta banned Trump from its platforms — a move Zuckerberg openly defended at the time, saying that Trump had used their platforms to incite a violent insurrection. But now, Zuckerberg is rolling it all back to placate the incoming president he once banned. An incoming president who, just months ago, wrote that Zuckerberg plotted against him in the 2020 election and said the Meta CEO would “spend the rest of his life in prison” if he crossed Trump again. Do you think that swayed Zuckerberg? I don’t know. But Trump has a theory. On Tuesday, a reporter asked Trump whether he believed Zuckerberg was directly responding to his threats. “Probably,” Trump responded. “Yeah. Probably.” There is no question that Zuckerberg, Bezos and Cook all want to avoid the ire of Trump but that is only part of the story. They have empires of their own to preserve and expand. They see an opportunity to cement a tech oligarchy in which the leader’s favorite billionaires run the country. It worked for Musk, why shouldn’t it work for them? I think that’s a wildly dystopian vision, one that most Americans reject. These are the anti-democratic forces of concentrated power and they are all aligning in the open, in front of our faces. It’s chilling in its own way, but also it’s very clarifying to have them all standing on the same side. Allison Detzel contributed.","url":"https://www.msnbc.com/top-stories/latest/trump-musk-zuckerberg-bezos-oligarchy-rcna186818","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-01/250108-chris-hayes-mark-zuckerberg-split-vl-244p-461c98.jpg","video":null,"publish_date":"2025-01-09 00:19:13","author":"Chris Hayes","authors":["Chris Hayes"],"language":"en","source_country":"us","sentiment":-0.118},{"id":279396434,"title":"Joe: Trump shows signature vagueness with Greenland and Panama Canal talk","text":"IE 11 is not supported. For an optimal experience visit our site on another browser.\n\nJoe: Trump shows signature vagueness with Greenland and Panama Canal talkJan. 8, 202510:04Thousands evacuated as strong winds fuel at least 3 blazes in LA area05:21Chris Matthews: Jimmy Carter lived an extraordinary life04:31'A journey of creativity': Marianne Jean-Baptiste on reuniting with Mike Leigh for 'Hard Truths'05:14'Everywhere you look there are homes on fire': Reporter surveys Pacific Palisades04:40Biden says he could have won re-election in new interview09:40Trump asks Supreme Court to block sentencing in hush money case02:22'Truly mass destruction': Reporter details catastrophic wildfires in LA County06:04'Severe wind warnings everywhere': Santa Monica mayor on wildfires05:41Thousands evacuated as strong winds fuel at least three blazes in LA area04:01Is Trump benefiting from a pre-Covid nostalgia?08:46Now PlayingJoe: Trump shows signature vagueness with Greenland and Panama Canal talk10:04UP NEXTSteve Rattner: Trump says he's inheriting 'difficult' economy but opposite is true05:47'Where's the leadership?' Author slams Zuckerberg over ending Meta's fact-checking program12:04'A fascinating journey': Carol Kane on starring in 'Between the Temples'06:15Molly Jong-Fast: We have to cut through the noise of Trump's second term14:12Meta is ending its fact-checking program in favor of a 'community notes' system06:18How to overcome self-limiting beliefs, achieve goals in 202507:22'This is historic': New York City's congestion pricing is now in effect12:50Joe: GOP is inheriting a strong economy; they need to be careful with it13:06Trump sees the country as a 'disaster', but the numbers tell a different story: NYT10:33Morning JoeJoe: Trump shows signature vagueness with Greenland and Panama Canal talk10:04Share this -CopiedPresident-elect Donald Trump suggested Tuesday he would consider using military force to gain control of the Panama Canal and Greenland, and \"economic force\" to acquire Canada. The Morning Joe panel discusses.Jan. 8, 2025UP NEXTThousands evacuated as strong winds fuel at least 3 blazes in LA area05:21Chris Matthews: Jimmy Carter lived an extraordinary life04:31'A journey of creativity': Marianne Jean-Baptiste on reuniting with Mike Leigh for 'Hard Truths'05:14'Everywhere you look there are homes on fire': Reporter surveys Pacific Palisades04:40Biden says he could have won re-election in new interview09:40Trump asks Supreme Court to block sentencing in hush money case02:22MSNBC HIGHLIGHTS (BEST OF MSNBC)Play AllThe Beat with Ari'This is who we are - now': Jeff Daniels on election, 'good' characters, film & theater: Melber IntvMorning JoeChris Matthews: Jimmy Carter lived an extraordinary lifeMorning Joe'A journey of creativity': Marianne Jean-Baptiste on reuniting with Mike Leigh for 'Hard Truths'Morning Joe'Everywhere you look there are homes on fire': Reporter surveys Pacific PalisadesMorning JoeTrump asks Supreme Court to block sentencing in hush money caseMorning Joe'Truly mass destruction': Reporter details catastrophic wildfires in LA CountyPlay All","url":"https://www.msnbc.com/morning-joe/watch/joe-trump-shows-signature-vagueness-with-greenland-and-panama-canal-talk-228761157821","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_01/1736342950343_n_mj_first_250108_1920x1080-6ng3as.jpg","video":null,"publish_date":"2025-01-09 00:19:13","author":"Msnbc","authors":["Msnbc"],"language":"en","source_country":"us","sentiment":0.125},{"id":279396108,"title":"Opinion | Australia&apos;s delayed climate targets raise concerns","text":"It is looking likely that Australia will delay the announcement of its next big climate target - the 2035 emissions reduction goal - amidst the political uncertainty following Donald Trump&apos;s election. But while all eyes are on the 2035 target within the Nationally Determined Contributions (NDC), one opportunity for a stronger NDC is quietly being sidelined: the 2030 emissions reduction target. Remember the much-hyped \"critical decade\" for global climate action? It was supposed to end in 2030. As recently as 2023, governments agreed at the Dubai climate conference to realign their 2030 climate targets with the 1.5-degree temperature goal. Arguably, the 2030 target is just as important as the 2035 target. Yet, 2035 is stealing the spotlight, and this shift could have serious consequences for the 1.5-degree global temperature goal and increase the costs of achieving it. Other countries, like the UK, UAE, Brazil, Japan, and the US, have rushed to announce their updated 2035 targets for their NDCs, which were not due until February. Conveniently, they have all skipped the option to make their 2030 targets more ambitious. This five-year delay risks pushing climate action beyond the point of no return, leaving us with worsening droughts, wildfires, floods, and more. The United Nations Environment Program (UNEP) has been clear: countries must enhance their 2030 and 2035 targets. Acting sooner rather than later isn&apos;t just about urgency - it also reduces the overall cost of climate action. UNEP argues that failing to strengthen the 2030 targets will make the 1.5-degree goal almost impossible, exposing the world to even more devastation. UNEP&apos;s latest recommendations on NDCs say global emissions need to drop 42 per cent below 2019 levels by 2030 to stay on track. Australia&apos;s current goal - 42 per cent below 2005 levels - sounds similar, but when measured against 2019 levels, it translates to just a 26 per cent reduction, too far off the mark. The respected research organisation Climate Analytics says Australia&apos;s 2030 goal should be 57-67 per cent below 2005 levels to align with the 1.5-degree target. Chris Bowen, the Minister for Climate Change and Energy, has requested the Climate Change Authority (CCA) to provide advice on a 2035 target. The CCA has previously suggested upping the 2030 target to 45-63 per cent below 2005 levels. People will watch with interest to see which CCA advice the government takes. One hopes Australia will fully incorporate the CCA advice on both the 2030 target and the 2035 target into its final NDC. New tools to hit these targets sooner are emerging. For example, international emissions trading under Article 6 of the Paris Agreement is now operational. This mechanism allows countries to collaborate with wealthier nations, supporting cost-effective emissions reductions in developing countries. It&apos;s a win-win: global emissions decrease at a lower cost, and developing nations get much-needed funding for clean development. But Australia has painted itself into a corner on Article 6 by ruling out its use until 2035, missing a low-cost, timely and ethically just solution for global climate action. READ MORE: Australia is campaigning to host the 2026 Climate Conference (COP31) in partnership with Pacific nations. Winning the bid would give the government a key leadership role in global climate negotiations. But to clinch it, Australia needs to show it&apos;s serious about tackling climate change. Strengthening its 2030 target would send a strong message that Australia is ready to lead. Delaying stronger climate targets might be politically convenient, but the planet doesn&apos;t work on election cycles. Waiting until 2035 to act risks pushing us past the point where we can avoid the worst effects of climate change. It&apos;s time for Australia - and other governments - to step up, not step back. Let&apos;s hope Australia uses this moment to set an example and prove that real leadership means taking bold, decisive action now rather than taking a five-year breather.","url":"https://www.canberratimes.com.au/story/8861019/opinion-australias-delayed-climate-targets-raise-concerns/?cs=14258","image":"/images/transform/v1/crop/frm/pMXRnDj3SUU44AkPpn97sC/3a9cf585-1218-4774-8f2b-37c6adef9347.jpg/r460_0_5541_3387_w6000_h4000_fmax.jpg","video":null,"publish_date":"2025-01-09 00:17:26","author":"Fiona Ryan","authors":["Fiona Ryan"],"language":"en","source_country":"au","sentiment":-0.069},{"id":279396078,"title":"Opinion | The looming culture war: Trans rights in 2025 election","text":"The 20th anniversary of John Howard&apos;s ban on marriage equality ahead of the 2004 Australian election is a reminder that another LGBTQIA+ culture war is likely to taint the 2025 election. In 2004 John Howard amended the Marriage Act to make it clear marriage could only be between a man and a woman. It was a move designed to wedge Labor and stir up homophobia for electoral gain. It was a tactic adopted directly from the US where George W. Bush promised to ban same-sex marriages ahead of the 2004 presidential election. A generation later the conditions are right for a similar election war over the rights of trans and gender-diverse people. Attacks on trans rights figured prominently in the 2024 American election with conservative commentators convinced those attacks helped win Donald Trump a second term and deliver Republican control of Congress. In Australia parties to the right of the Coalition will inevitably seek to replicate Trump&apos;s success by also attacking trans and gender-diverse people. To diffuse this challenge to its voter base, the Coalition is likely to promise its own trans rights rollback. The Coalition knows Labor is unlikely to push back because the ALP needs to win anti-LGBTQIA+ seats in western Sydney and regional Queensland - the seats that voted \"no\" to marriage equality in 2017 - to retain majority government. I know some Labor figures would contest my prediction and declare the ALP is on the side of trans people, but let&apos;s be serious. In 2004 Labor supported Howard&apos;s marriage equality ban to keep or win seats in Western Sydney. Since winning government in 2022, Labor hasn&apos;t once publicly defended trans people from attack for the same reason. That&apos;s very unlikely to change when an election is declared and the Coalition rolls out its anti-trans fear campaign. I fervently hope I&apos;m wrong. I hope the Coalition takes the high road, and Labor stands firm should it not. But I was intimately involved in advocating for marriage equality in 2004 and I correctly predicted Howard&apos;s ban months before it was unveiled. I feel it would be irresponsible not to point to the likelihood that history is about to repeat. Should there be transgender election fear campaigns in 2025, what would they focus on? A national review of healthcare for young transgender people is likely, as well as a ban on puberty blockers and hormones until the review is completed. The likelihood of this has increased since the UK&apos;s Labour government put a permanent ban in place following a review commissioned by the previous Tory government. Other possible election fear campaigns could focus on amending the Sex Discrimination Act to make it harder for trans women to play women&apos;s sport, and attempts to ban school courses, resources and groups that affirm young trans and gender-diverse people. Such fear campaigns will be amplified by groups opposed to trans rights, including the so-called \"GLB Alliance\" and trans exclusionary feminists. In the US, these relatively small groups have suddenly found themselves with far more resources in the lead up to elections where trans rights figured, and the same may happen in Australia. Amplification is also likely from trans-sceptical media like Sky News and The Australian newspaper, as well as serial election meddler, Elon Musk. If Labor is unlikely to contest fearmongering about these issues it will fall to the LGBTQIA+ community, non-government human rights groups and everyday Australians to stand up for trans and gender-diverse people. Naturally, we should make the case that transgender Australians already experience high levels of discrimination, hate and suicide which fear campaigns make worse. I believe another important argument, especially against a Liberal Party fear campaign, is personal freedom from government meddling. READ MORE: Young trans people, together with their parents and doctors, should decide what treatment is best. The government has no role dictating a one-size-fits-all response to the healthcare of young trans Australians. The 2004 same-sex marriage ban eventually had the opposite effect to the one intended. It led to a determined, persistent campaign for marriage equality that delivered a strong majority of Australians in support for reform in 2017. I have no doubt trans fearmongering in the 2025 election would eventually have the same positive effect, fostering greater respect for the humanity of trans and gender-diverse people. But before then, the nation faces a likely attack on some of our most vulnerable young people. The more of us stand with these young people, the quicker Australia will evolve to embrace gender diversity.","url":"https://www.canberratimes.com.au/story/8860912/opinion-the-looming-culture-war-trans-rights-in-2025-election/?cs=14258","image":"/images/transform/v1/crop/frm/pMXRnDj3SUU44AkPpn97sC/48b7b294-6982-42da-be06-ba73b8104bbf.jpg/r345_230_4155_2770_w4500_h3000_fmax.jpg","video":null,"publish_date":"2025-01-09 00:17:26","author":"Rodney Croome","authors":["Rodney Croome"],"language":"en","category":"politics","source_country":"au","sentiment":-0.003},{"id":279396080,"title":"The risks of Zuckerberg&apos;s move to unregulated Meta are great","text":"While it would be premature to suggest Mark Zuckerberg&apos;s belated efforts to curry favour with Donald Trump will cost him dearly, his decision to take Meta down the \"free-for-all\" rabbit hole pioneered by Elon Musk at Twitter/X comes with a degree of commercial risk. Since Mr Musk acquired Twitter in October 2022 the platform, which was rebranded as X in July 2023, has shed about 10 per cent of its regular users. Twitter had peaked at 368 million active monthly users just before the takeover. That is understood to have fallen to 335 million or less at the end of 2024. This is in stark contrast to Meta&apos;s Facebook and Instagram, which count their users in the billions, not millions, and which continue to grow; albeit not at the same heady rate of increase it recorded between 2006 and 2022. In 2022 Facebook, Meta&apos;s premium brand, had 2.936 billion users. That grew by 3 per cent to 3.07 billion users at the end of last year. Facebook&apos;s slowing growth - it was expanding its user base by more than 10 per cent a year at the peak of its trajectory - is understandable given the almost peak market penetration. It is now relying at least in part on population increase for new users. So why is Mr Zuckerberg, one of the wealthiest and arguably most powerful men on the planet, embracing a flawed business model pioneered with disappointing results by a relatively minor social media competitor? The most obvious answer is that he is running scared of what President-elect Trump and his new bestie, Mr Musk, might do after the inauguration on January 20. President Trump is obviously still smarting from Mr Zuckerberg&apos;s decision to ban him from Facebook and Instagram after January 6, 2020. He has accused Mr Zuckerberg of election interference in the 2020 election and warned that the Meta boss would \"spend the rest of his life in prison\" if he interfered in the 2024 poll. Mr Trump, who welcomed Meta&apos;s decision to axe fact checking, believes the company - and its boss - are reacting to his threats and intimidation. This is the way Vladimir Putin speaks to and treats errant oligarchs in Russia. It is also the way President Xi handles intransigent billionaires in China. It has not, up until now, been par for the course in any Western democracy; let alone the land of the free and the home of the brave. Leaving aside for a moment the very serious implications of turning Facebook and Instagram into truth-free zones, one has to wonder what is in store for the average person in a world when even the richest and most powerful - including Amazon&apos;s Jeff Bezos - are lining up to kiss the ring of the \"dictator for a day\". The decision itself, which Mr Zuckerberg said was recognition Mr Trump&apos;s election was a \"cultural tipping point\", is catastrophic. Some of the most popular social media platforms in the world will soon be effectively unregulated. This is completely at odds with what governments in Australia and elsewhere have been trying to achieve. Mr Musk and Mr Zuckerberg do not believe they need a social licence to operate. They want to open their platforms to bad actors to say what they want, about who they want, whenever they want. Millions of people left Twitter/X after Mr Musk dumped the fact checkers and replaced them with a \"community notes\" feedback process. This led to an explosion in fake news and abusive posts, often directed at women, which saw X morph into one of the most misogynistic sites on the Internet. Today only one in three users is a woman. The largest demographic is men aged between 25 and 34. It seems a matter of time before Meta is also an unsafe web of lies.","url":"https://www.canberratimes.com.au/story/8862089/the-risks-of-zuckerbergs-move-to-unregulated-meta-are-great/?cs=27763","image":"/images/transform/v1/crop/frm/LLBstgPA4H8EG9DTTGcXBL/df8bfbd3-64a9-4cc0-bf6d-95ebdeed9a35.jpg/r62_124_3564_1850_w4000_h1971_fmax.jpg","video":null,"publish_date":"2025-01-09 00:17:26","author":"The Canberra Times","authors":["The Canberra Times"],"language":"en","category":"politics","source_country":"au","sentiment":-0.298}]}