{"offset":0,"number":50,"available":11400,"news":[{"id":348835618,"title":"'You're Going To See...': Donald Trump Signals More Secondary Sanctions On Russian Oil Buyers","text":"Donald Trump has indicated there would be more secondary sanctions on other countries buying Russian oil, hours after he announced an additional 25 per cent against India. His remark came in response to a question of singling out India for these additional sanctions.\nOn being asked, ‘Indian officials have said that there are other countries that are buying Russian oil, like China, for instance. Why are you singling India out for these additional sanctions’, the US President said, “It’s only been 8 hours. So let’s see what happens.”\n“You’re going to see a lot more. You’re going to see so much secondary sanctions, ” Trump told reporters during a press briefing in the White House.\nHe also hinted that the US administration could impose “more” similar sanctions on China.\nOn being asked, ‘On the Indian penalties, do you have any similar plans to enact more tariffs on China’, US President Donald Trump says, “Could happen. Depends on how we do. Could happen.”","summary":"Donald Trump signaled more secondary sanctions on countries purchasing Russian oil, hours after announcing a 25 per cent tariff on India, also hinting that China could be next.","url":"https://www.news18.com/world/donald-trump-hints-at-more-secondary-sanctions-other-countries-buying-russian-oil-india-tariffs-9489737.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/MixCollage-07-Aug-2025-06-39-AM-5717-2025-08-1a913cc7ef9827bb6b8b622d93e74e42.jpg","video":null,"publish_date":"2025-08-07 01:18:50","author":"News18,Vani Mehrotra","authors":["News18","Vani Mehrotra"],"language":"en","category":"politics","source_country":"in","sentiment":-0.311},{"id":348836440,"title":"Trump threatens takeover of Washington, D.C., with National Guard to fight crime","text":"APPresident Donald Trump \n\nPresident Donald Trump on Wednesday suggested he may use the National Guard to police the streets of Washington, D.C., in his latest threat to take over running the city that serves as the seat of the U.S. government. \"We have a capital that's very unsafe,\" Trump told reporters at the White House. \"We have to run D.C. This has to be the best-run place in the country.\"Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh Mehra Trump, who has threatened a federal takeover of the city multiple times, renewed those threats after a young staffer who was part of Elon Musk's Department of Government Efficiency was assaulted over the weekend. Musk, the billionaire former adviser to Trump who once spearheaded the DOGE effort, said the man was beaten and received a concussion. \"It is time to federalize DC,\" he wrote. Asked if he was considering taking over the D.C. police, Trump responded affirmatively.Live Events \"We just almost lost a young man, beautiful handsome guy that got the hell knocked out of him,\" Trump said. The president posted a picture of the victim, Edward Coristine, known by the nickname \"Big Balls,\" on social media, with blood on his face, arms, torso and legs. \"We're going to beautify the city. We're going to make it beautiful. And what a shame, the rate of crime, the rate of muggings, killings and everything else. We're not going to let it. And that includes bringing in the National Guard, maybe very quickly, too,\" Trump said. A spokesman for D.C. Mayor Muriel Bowser declined to comment. Violent crime in the first seven months of 2025 was down by 26% in D.C. compared to last year while overall crime was down about 7%, according to records on the police department's website. Overall crime was down 15% in 2024, compared to 2023, the website showed. The District of Columbia was established in 1790 with land from neighboring Virginia and Maryland. Congress has control of its budget, but resident voters elect a mayor and city council, thanks to a law known as the Home Rule Act. For Trump to take over the city, Congress likely would have to pass a law revoking that act, which Trump would have to sign. The president said on Wednesday that lawyers were already looking at overturning the Home Rule Act. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump National Guard Washingtonfederal takeover Washington D.C.D.C. crime ratesassault on stafferElon Musk DOGEDonald TrumpElon Musk\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump National Guard Washingtonfederal takeover Washington D.C.D.C. crime ratesassault on stafferElon Musk DOGEDonald TrumpElon Musk(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Trump is considering deploying the National Guard to address what he perceives as unsafe conditions in Washington, D.C., following an assault on a staffer. He has threatened a federal takeover, citing high crime rates, despite data showing a decrease in violent and overall crime in the city. Overturning the Home Rule Act, which grants D.C.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-threatens-takeover-of-washington-d-c-with-national-guard-to-fight-crime/articleshow/123153362.cms","image":"https://img.etimg.com/thumb/msid-123153373,width-1200,height-630,imgsize-77672,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-07 01:13:14","author":"Metla Sudha Sekhar","authors":["Metla Sudha Sekhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.184},{"id":348836444,"title":"Trump open to meeting Putin over Ukraine as soon as next week, official says","text":"ANIDonald Trump, Vladimir Putin\n\nPresident Donald Trump is open to meeting Vladimir Putin as soon as next week, a White House official said on Wednesday, as the U.S. maintained plans to impose secondary sanctions on Friday in an effort to pressure Moscow to end the war in Ukraine. The New York Times reported that Trump would hold a trilateral meeting with Putin and Ukrainian President Volodymyr Zelenskiy after meeting with the Russian leader.Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh Mehra The report said the plans were disclosed to European leaders, including Zelenskiy, on Wednesday. \"The Russians expressed their desire to meet with President Trump, and the President is open to meeting with both President Putin and President Zelenskiy,\" White House press secretary Karoline Leavitt said, responding to the report. A Trump-Putin meeting could take place as soon as next week, the White House official said.Live Events The details emerged following a meeting on Wednesday between Putin and U.S. special envoy Steve Witkoff that Trump said had achieved \"great progress.\" It comes two days before a deadline set by Trump for Russia to agree to peace in Ukraine or face new sanctions. Trump has been increasingly frustrated with Putin over the lack of progress towards peace and has threatened to impose heavy tariffs on countries that buy Russian exports. The White House official said that while the meeting had gone well and Moscow was eager to continue engaging with the United States, secondary sanctions that Trump has threatened against countries doing business with Russia were still expected to be implemented on Friday. No details were provided. \"My Special Envoy, Steve Witkoff, just had a highly productive meeting with Russian President Vladimir Putin. Great progress was made!\" Trump said in a post on Truth Social. \"Everyone agrees this War must come to a close, and we will work towards that in the days and weeks to come,\" he added. A Kremlin aide earlier said Witkoff held \"useful and constructive\" talks with Putin on Wednesday. The two met for around three hours on a last-minute mission to seek a breakthrough in the 3-1/2-year war that began with Russia's full-scale invasion of Ukraine. Kremlin foreign policy aide Yuri Ushakov said the two sides had exchanged \"signals\" on the Ukraine issue and discussed the possibility of developing strategic cooperation between Moscow and Washington, but declined to give more details until Witkoff had reported back to Trump. Ukrainian President Volodymyr Zelenskiy said he believed pressure had worked on Russia and Moscow was now more amenable to a ceasefire. \"It seems that Russia is now more inclined to a ceasefire. The pressure on them works. But the main thing is that they do not deceive us in the details - neither us nor the U.S.,\" Zelenskiy said in his nightly address. Writing separately on the X social media platform, Zelenskiy said he had discussed Witkoff's visit to Russia with Trump, adding that he had reiterated Ukraine's support for a just peace and its continued determination to defend itself. \"Ukraine will definitely defend its independence. We all need a lasting and reliable peace. Russia must end the war that it itself started,\" Zelenskiy said, adding that European leaders had joined the call with Trump. Trump on Truth Social said he had updated some of Washington's European allies following Witkoff's meeting. PRESSURE ON INDIA Trump took a key step toward punitive measures on Wednesday when he imposed an additional 25% tariff on imports from India, citing New Delhi's continued imports of Russian oil. No similar order was signed for China, which also imports Russian oil. The new measure raises tariffs on some Indian goods to as high as 50% - among the steepest faced by any U.S. trading partner. The Kremlin says threats to penalise countries that trade with Russia are illegal. It was not clear what Russia might have offered to Witkoff to stave off Trump's threat. Ushakov, who was present at the meeting, told Russian news outlet Zvezda: \"We had a very useful and constructive conversation.\" He added: \"On our part, in particular on the Ukrainian issue, some signals were transmitted. Corresponding signals were also received from President Trump.\" Bloomberg and independent Russian news outlet The Bell reported that the Kremlin might propose a moratorium on airstrikes by Russia and Ukraine - an idea mentioned last week by Belarusian President Alexander Lukashenko during a meeting with Putin. Such a move, if agreed, would fall well short of the full and immediate ceasefire that Ukraine and the U.S. have been seeking for months. But it would offer some relief to both sides. AIR ATTACKS Since the two sides resumed direct peace talks in May, Russia has carried out its heaviest air attacks of the war, killing at least 72 people in the capital Kyiv alone. Trump last week called the Russian attacks \"disgusting.\" Ukraine continues to strike Russian refineries and oil depots, which it has hit many times. Andriy Yermak, chief of staff to Zelenskiy, said on Wednesday that a full ceasefire and a leaders' summit were required. \"The war must stop and for now this is on Russia,\" he posted on Telegram. Putin is unlikely to bow to Trump's sanctions ultimatum because he believes he is winning the war and his military goals take precedence over his desire to improve relations with the U.S., three sources close to the Kremlin have told Reuters. The Russian sources told Reuters that Putin was sceptical that yet more U.S. sanctions would have much of an impact after successive waves of economic penalties during 3-1/2 years of war. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumpzelenskiyputinwhite housetruth socialtelegramkremlin\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumpzelenskiyputinwhite housetruth socialtelegramkremlin(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Donald Trump may meet Vladimir Putin and Volodymyr Zelenskiy soon. The U.S. plans more sanctions against Russia. This follows talks between Putin and Trump's envoy, Steve Witkoff. Trump is unhappy with the slow progress towards peace. He has also imposed tariffs on India for buying Russian oil. Zelenskiy believes Russia is now more open to a ceasefire.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-open-to-meeting-putin-over-ukraine-as-soon-as-next-week-official-says/articleshow/123153303.cms","image":"https://img.etimg.com/thumb/msid-123153321,width-1200,height-630,imgsize-21946,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-07 01:08:54","author":"Metla Sudha Sekhar","authors":["Metla Sudha Sekhar"],"language":"en","category":"politics","source_country":"in","sentiment":0.073},{"id":348835384,"title":"Oil Holds Drop As Traders Dismiss Impact Of US Moves Over Russia","text":"Oil held a five-day decline — the longest losing run since January — as investors looked beyond US efforts to punish buyers of Russian crude, while tracking a diplomatic push by President Donald Trump to halt the war in Ukraine.West Texas Intermediate was little changed below $65 a barrel after slumping to the lowest close since early June, while Brent settled just shy of $67. On Wednesday, Trump doubled tariffs on Indian goods to 50% due to the nation’s purchases of Russian energy, with implementation set to begin in three weeks. Still, there’s been no similar US move against China, another major importer of Moscow’s oil.On the diplomatic front, Trump said there was a “very good chance” he would meet soon with Russian President Vladimir Putin and his Ukrainian counterpart, Volodymyr Zelenskiy, in another bid to broker peace between the two countries. He also said there would be “a lot more” penalties related to purchases of Russian oil, without giving details.Crude has moved sharply lower so far in August after a run of three monthly gains. Traders are positioning for a potential glut later this year after OPEC+ returned millions of barrels of shuttered capacity to the market. In addition, there are concerns about a slowdown in economic growth — and potentially weaker energy consumption — as Trump’s broader trade tariffs exact a toll.Prices:WTI for September delivery was little changed at $64.39 a barrel at 7:34 a.m. in Singapore.Brent for October settlement closed 1.1% lower at $66.89 a barrel on Wednesday..Crude Oil Rebounds From Five-Week Low, WTI Hits Intraday High After Trump Doubles Tariff On India To 50%","summary":"West Texas Intermediate was little changed below $65 a barrel after slumping to the lowest close since early June, while Brent settled just shy of $67.","url":"https://www.ndtvprofit.com/markets/oil-holds-drop-as-traders-dismiss-impact-of-us-moves-over-russia","image":"https://media.assettype.com/bloombergquint/2025-01-27/fuzyrqtq/424962296.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-08-07 01:05:03","author":null,"language":"en","category":"business","source_country":"in","sentiment":-0.058},{"id":348836436,"title":"'I won't humiliate myself': Brazil's president sees no point in tariff talks with Trump","text":"ANIBrazil President Lula Da Silva\n\nAs U.S. tariffs on Brazilian goods jumped to 50% on Wednesday, Brazil's President Luiz Inacio Lula da Silva told Reuters in an interview that he saw no room for direct talks now with U.S. President Donald Trump that would likely be a \"humiliation.\" Brazil is not about to announce reciprocal tariffs, he said. Nor will his government give up on cabinet-level talks. But Lula himself is in no rush to ring the White House.Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh Mehra \"The day my intuition says Trump is ready to talk, I won't hesitate to call him,\" Lula said in an interview from his presidential residence in Brasilia. \"But today my intuition says he doesn't want to talk. And I won't humiliate myself.\" Despite Brazil's exports facing one of the highest tariffs imposed by Trump, the new U.S. trade barriers look unlikely to derail Latin America's largest economy, giving Lula more room to stand his ground against Trump than most Western leaders. Lula described U.S.-Brazil relations at a 200-year nadir after Trump tied the new tariff to his demands for an end to the prosecution of right-wing former President Jair Bolsonaro, who is standing trial for plotting to overturn the 2022 election.Live Events The president said Brazil's Supreme Court, which is hearing the case against Bolsonaro, \"does not care what Trump says and it should not,\" adding that Bolsonaro should face another trial for provoking Trump's intervention, calling the right-wing former president a \"traitor to the homeland.\" \"We had already pardoned the U.S. intervention in the 1964 coup,\" said Lula, who got his political start as a union leader protesting against the military government that followed a U.S.-backed ouster of a democratically elected president. \"But this now is not a small intervention. It's the president of the United States thinking he can dictate rules for a sovereign country like Brazil. It's unacceptable.\" The Brazilian president said he had no personal issues with Trump, adding that they could meet at the United Nations next month or U.N. climate talks in November. But he noted Trump's track record of dressing down White House guests such as South African President Cyril Ramaphosa and Ukrainian President Volodymyr Zelenskiy. \"What Trump did with Zelenskiy was humiliation. That's not normal. What Trump did with Ramaphosa was humiliation,\" Lula said. \"One president can't be humiliating another. I respect everyone and I demand respect.\" Lula said his ministers were struggling to open talks with U.S. peers, so his government was focused on domestic policies to cushion the economic blow of U.S. tariffs, while maintaining \"fiscal responsibility.\" The president declined to elaborate on pending measures to support Brazilian companies, which are expected to include credit lines and other export assistance. He also said he was planning to call leaders from the BRICS group of developing nations, starting with India and China, to discuss the possibility of a joint response to U.S. tariffs. \"There is no coordination among the BRICS yet, but there will be,\" Lula said, comparing multilateral action to the strength of collective bargaining in his union days. \"What is the negotiating power of one little country with the United States? None.\" Separately, he said Brazil was looking at lodging a collective complaint with other countries at the World Trade Organization. \"I was born negotiating,\" said Lula, who was raised in poverty and rose through union ranks to serve two terms as president from 2003 to 2010, then re-entered politics in the 2022 election to defeat the incumbent Bolsonaro. But he said he was in no rush to strike a deal or retaliate against U.S. tariffs: \"We need to be very cautious,\" he said. Asked about countermeasures targeting U.S. companies, such as greater taxation of big technology companies, Lula said his government was studying ways to tax U.S. firms on equal standing with Brazilian companies. Lula also described plans to create a new national policy for Brazil's strategic mineral resources, treating them as a matter of \"national sovereignty\" to break with a history of mining exports that added little value in Brazil. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBrazil President LulaUS tariffs on Brazilian goodsTrump Brazil relationsBolsonaro trialBRICS leaders meetingLula Trump U.N. meetingBrazilian economytariff talks with TrumpBraziltrump\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBrazil President LulaUS tariffs on Brazilian goodsTrump Brazil relationsBolsonaro trialBRICS leaders meetingLula Trump U.N. meetingBrazilian economytariff talks with TrumpBraziltrump(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Brazilian President Lula da Silva expressed reluctance to engage in direct talks with U.S. President Trump following increased U.S. tariffs, deeming it potentially humiliating. He emphasized Brazil's focus on domestic policies to mitigate the economic impact and exploring joint responses with BRICS nations.","url":"https://economictimes.indiatimes.com/news/international/world-news/i-wont-humiliate-myself-brazils-president-sees-no-point-in-tariff-talks-with-trump/articleshow/123153239.cms","image":"https://img.etimg.com/thumb/msid-123153247,width-1200,height-630,imgsize-13132,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-07 01:04:31","author":"Metla Sudha Sekhar","authors":["Metla Sudha Sekhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.024},{"id":348835446,"title":"Apple to invest additional $100 billion in U.S.","text":"Apple will invest an additional $100 billion in the United States, taking its total pledge to $600 billion over the next four years, U.S. President Donald Trump said Wednesday.\n\nTrump announced the increased commitment at the White House alongside the tech giant's CEO Tim Cook, calling it \"the largest investment Apple has made in America.\"\n\n\"Apple will massively increase spending on its domestic supply chain,\" Trump added, highlighting a new production facility for the glass used to make iPhone screens in Kentucky.\n\nIn February, Apple said it would spend more than $500 billion in the United States and hire 20,000 people, with Trump quickly taking credit for the decision.\n\nIt builds on plans announced in 2021, when the company founded by Steve Jobs said it would invest $430 billion in the country and add 20,000 jobs over the next five years.\n\n\"This year alone, American manufacturers are on track to make 19 billion chips for Apple in 24 factories across 12 different states,\" Cook said in the Oval Office.\n\nTrump, who has pushed U.S. companies to shift manufacturing home by slapping tariffs on trading partners, claimed that his administration was to thank for the investment.\n\n\"This is a significant step toward the ultimate goal of... ensuring that iPhones sold in the United States of America also are made in America,\" Trump said.\n\nCook later clarified that, while many iPhone components will be manufactured in the United States, the complete assembly of iPhones will still be conducted overseas.\n\n\"If you look at the bulk of it, we're doing a lot of the semiconductors here, we're doing the glass here, we're doing the Face ID module here... and we're doing these for products sold elsewhere in the world,\" Cook said.\n\nTrump has repeatedly said he plans to impose a \"100 percent\" tariff on imported semiconductors, a major export of Taiwan, South Korea, China and Japan.\n\n\"We're going to be putting a very large tariff on chips and semiconductors,\" he told reporters Wednesday at the White House.\n\nWhile he did not offer a timetable for enactment of the new tech levies, on Tuesday he said fresh tariffs on imported pharmaceuticals and semiconductors and chips could be unveiled within the coming week.\n\nThe U.S. is \"going to be very rich and it's companies like Apple, they're coming home,\" Trump said.\n\nTrump specified further that \"Apple will help develop and manufacture semiconductors and semiconductor equipment in Texas, Utah, Arizona and New York.\"\n\nHe noted that if tech companies commit to manufacturing their wares in the U.S., \"there will be no charge.\"\n\nApple reported a quarterly profit of $23.4 billion in late July, topping forecasts despite facing higher costs due to Trump's sweeping levies.\n\nThe tariffs are essentially a tax paid by companies importing goods to the United States. This means Apple is on the hook for tariffs on iPhones and other products or components it brings into the country from abroad.","summary":"Apple will invest an additional $100 billion in the United States, taking its total pledge to $600 billion over the next four years, U.S. President Donald Trump said…","url":"https://japantoday.com/category/tech/apple-to-invest-additional-100-bn-in-us","image":"https://media.japantoday.com/img/store/18/d4/0be7216b368455777a31046c6d68ca8fda6c/ab265284203cf93d8539c227de8a28de53af342b/_w1700.jpeg","video":null,"publish_date":"2025-08-07 01:03:11","author":"Japan Today Editor,Steve Jobs","authors":["Japan Today Editor","Steve Jobs"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.231},{"id":348834948,"title":"How to Watch South Park Episode 2 Season 27: Live Stream Premiere, New Episodes, Time, TV Channel","text":"The 27th season of South Park kicked off with a bang last week, sparking conversation among fans of the show, who are claiming it is back and as great as ever.How to Watch South Park - Season 27, Episode 2\nDate: Wednesday, August 6, 2025\nTime: 10:00 PM ET\nChannel: Comedy Central, Paramount+\nStream: Fubo - Episode 2 Premiere (WATCH NOW), Paramount - Live Stream Every Episode After Premiere (WATCH NOW)\nTrey Parker and Matt Stone crushed the opener of South Park season 27, as Stan, Kyle, Kenny, and Cartman had an encounter with Jesus himself at their school and came to the realisation that \"woke is dead\", causing Cartman to fall into a dead depression.The star of the first episode, however, was the president himself, Donald Trump. It appears Trump may be a recurring character in this season, and that is something all the fans will be here for, as his portrayal in episode one stole the show.There are likely to be many more storylines and pop culture references throughout the entirety of the season, with every episode tackling a new, relevant subject.This should be another fantastic episode that you will not want to miss; make sure to tune in and catch all the drama.New episodes will air every Wednesday night on Comedy Central, which is available through Fubo. The day after new episodes air, they will be available to stream on Paramount+.Stream new episodes live as they premiere on Comedy Central with Fubo: Start your subscription now!Live stream episodes after the release date with Paramount+: Start your subscription now!Regional restrictions may apply. If you purchase a product or register for an account through one of the links on our site, we may receive compensation.","summary":"The 27th season of South Park kicked off with a bang last week, sparking conversation among fans of the show, who said it is back and as great as ever.","url":"https://www.newsweek.com/entertainment/streaming/how-watch-south-park-episode-2-season-27-live-stream-premiere-new-episodes-time-tv-channel-2106131","image":"https://d.newsweek.com/en/full/2692784/south-park.jpg?w=1600&h=900&q=88&f=c58b1afafaf4b0b59e9535edfbbbd078","video":null,"publish_date":"2025-08-07 01:00:01","author":"Ben Verbrugge","authors":["Ben Verbrugge"],"language":"en","source_country":"us","sentiment":-0.082},{"id":348836150,"title":"DG ISPR dismisses presidency chatter about COAS","text":"RAWALPINDI: Pakistan Army spokesperson Lieutenant General Ahmed Sharif Chaudhry has firmly denied the swirling rumours that Field Marshal Syed Asim Munir plans to become the next president of Pakistan, calling them “completely baseless” in an interview with The Economist.\n\nSpeaking to the renowned British magazine, the Director General of the Inter-Services Public Relations (ISPR) dismissed political speculation that surfaced after the “Marka-e-Haq”, saying such commentary is detached from reality and aims to embroil the military in unnecessary political discourse.\n\nLt Gen Ahmed Sharif made it clear that Field Marshal Asim Munir has shown no interest in the presidency and no such proposal is under consideration. “These claims are irresponsible and purely fictional. Dragging the military into politics is dangerous and misleading,” he stated.\n\nThis statement aligns with earlier remarks from Prime Minister Shehbaz Sharif, who had categorically denied any such development. Similarly, PML-N Senator Irfan Siddiqui had clarified that neither Nawaz Sharif nor his party had discussed the idea of making the Field Marshal president.\n\nFederal Interior Minister Mohsin Naqvi also weighed in last month, saying on social platform X that “there has been no discussion nor any proposal for the president to resign or the COAS to assume that office.” He suggested that those spreading these rumours are part of a “nefarious campaign” against top state figures, including President Asif Ali Zardari.\n\nIt may be recalled that Indian rumour machines started circulating news that Field Marshal Asim Munir would soon take over Pakistan as president. \n\nThe Indian media frenzy was based on an article in the British magazine The Economist published on August 3, in which Field Marshal Munir’s leadership qualities were acknowledged for “giving a new direction to US-Pakistan relations” and his private meeting with President Donald Trump at the White House on June 18. \n\nPakistan Army chief Field Marshal Syed Asim Munir’s leadership has been acknowledged at the global level for his role in improving the country image in the comity of nations and “strengthening ties with the United States.”\n\nWhen asked about rising tensions with India, DG ISPR warned of a robust and potentially unconventional response if India launches military aggression.\n\n“This time we will start from the east,” he warned, adding that Pakistan would strike deep inside Indian territory. “India needs to understand that they too can be targeted anywhere.”\n\nHe said Pakistan would no longer remain reactive and that future provocations from India could be met with preemptive, full-spectrum retaliation.\n\nThe already strained relations between Pakistan and India worsened after the April 22, 2025, Pahalgam incident, which India blamed on Pakistan without evidence.\n\nIndia retaliated by suspending the Indus Waters Treaty, scaling back diplomatic relations, canceling Pakistani visas, and expelling patients undergoing treatment in India. Pakistan responded in kind—declaring the treaty’s suspension an act of war, reducing Indian diplomatic staff, closing airspace to Indian flights, and halting all trade.\n\nOn the night of February 6–7, India launched missile attacks on multiple Pakistani cities, including Kotli, Bahawalpur, Muridke, Bagh, and Muzaffarabad, resulting in 26 civilian deaths and 46 injuries. Pakistan retaliated by shooting down six Indian warplanes, including three Rafale jets.\n\nIndia launched another strike on February 10, targeting three airbases. In response, Pakistan initiated Operation Banyan Marsus (Iron Wall) in the early hours, targeting Indian military infrastructure such as Udhampur, Pathankot, Adampur airbases, and strategic locations like the BrahMos missile storage and S-400 defence systems.\n\nA ceasefire was eventually brokered by the Trump administration, although the Indian government has not officially acknowledged the US role.\n\nMeanwhile, President Trump has reportedly referenced this ceasefire effort over 30 times in public statements, highlighting the severity of the conflict and the diplomatic efforts required to contain it.","summary":"RAWALPINDI: Pakistan Army spokesperson Lieutenant General Ahmed Sharif Chaudhry has firmly denied the swirling rumours that Field Marshal Syed Asim Munir plans to become the next president of Pakistan, calling them “completely baseless” in an interview with The Economist.\n\n\n\nSpeaking to the renowned British magazine, the Director General of the Inter-Services Public Relations (ISPR) dismissed political speculation that surfaced after the “Marka-e-Haq”, saying such commentary is detached from reality and aims to embroil the military in unnecessary political discourse.\n\n\n\nLt Gen Ahmed Sharif made it clear that Field Marshal Asim Munir has shown no interest in the presidency and no such proposal is under consideration. “These claims are irresponsible and purely fictional. Dragging the military into politics is dangerous and misleading,” he stated.\n\n\n\nThis statement aligns with earlier remarks from Prime Minister Shehbaz Sharif, who had categorically denied any such development. Similarly, PML-N Senator Irfan Sid","url":"https://www.brecorder.com/news/40376762/dg-ispr-dismisses-presidency-chatter-about-coas","image":"https://i.brecorder.com/large/2025/08/6893e51e024cc.png","video":null,"publish_date":"2025-08-07 00:56:09","author":"NNI","authors":["NNI"],"language":"en","category":"politics","source_country":"pk","sentiment":0.162},{"id":348834908,"title":"Gold prices fall on profit-taking","text":"LONDON: Gold prices fell on Wednesday as investors booked profits after prices hit a near two-week high in the previous session, while the market’s focus shifted to US President Donald Trump’s upcoming Federal Reserve nominations. \n\nSpot gold eased 0.3% at $3,371.31 per ounce by 0956 a.m. ET (1356 GMT). US gold futures fell 0.2% to $3,427.10. “We view this as a bit of a pullback... a little profit-taking from the recent move higher in the midst of a quieter time on the economic front, and a little lesser need for that safe-haven demand,” said David Meger, director of metals trading at High Ridge Futures. \n\nGold logged gains for three consecutive sessions after weaker-than-expected US employment growth data on Friday. Market participants now see an over 87% chance of a September rate cut, up from 63% earlier, as per CME FedWatch. Gold tends to perform well during economic uncertainty and a low-interest environment further supports the non-yielding asset. \n\nTrump said on Tuesday he will name a Fed Board nominee by the end of the week and has narrowed options to replace Chair Jerome Powell. Elsewhere, spot silver added 0.1% to $37.86 per ounce. Meanwhile, platinum edged up 1% to $1,334.05 and palladium dropped 2.2% to $1,147, reaching its lowest level since July 11. \n\n“The concern about sanctions on Russia has been one of the factors that had supported platinum and palladium over the course of the last several weeks. So, the prospects for decreased tensions between the US and Russia most certainly has allowed for prices to come down in recent sessions,” Meger said. \n\nRussia is a major supplier of palladium and platinum. US envoy Steve Witkoff held “useful and constructive” talks with Russian President Vladimir Putin, a Kremlin aide said, two days before the expiry of a deadline set by Trump for Russia to agree to peace in Ukraine or face new sanctions.","summary":"LONDON: Gold prices fell on Wednesday as investors booked profits after prices hit a near two-week high in the previous session, while the market’s focus shifted to US President Donald Trump’s upcoming Federal Reserve nominations.  \n\n\n\nSpot gold eased 0.3% at $3,371.31 per ounce by 0956 a.m. ET (1356 GMT). US gold futures fell 0.2% to $3,427.10.  “We view this as a bit of a pullback... a little profit-taking from the recent move higher in the midst of a quieter time on the economic front, and a little lesser need for that safe-haven demand,” said David Meger, director of metals trading at High Ridge Futures.  \n\n\n\nGold logged gains for three consecutive sessions after weaker-than-expected US employment growth data on Friday. Market participants now see an over 87% chance of a September rate cut, up from 63% earlier, as per CME FedWatch.  Gold tends to perform well during economic uncertainty and a low-interest environment further supports the non-yielding asset.  \n\n\n\nTrump said on Tuesday he will name a Fed Bo","url":"https://www.brecorder.com/news/40376659/gold-prices-fall-on-profit-taking","image":"https://i.brecorder.com/large/2025/08/6893b06d28d8d.jpg","video":null,"publish_date":"2025-08-07 00:56:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.109},{"id":348834910,"title":"Palm oil falls on sluggish demand","text":"KUALA LUMPUR: Malaysian palm oil futures fell on Wednesday as sluggish demand from key markets pressured prices, although gains in Dalian soyoil helped cap losses. \n\nThe benchmark palm oil contract for October delivery on the Bursa Malaysia Derivatives Exchange slid 23 ringgit, or 0.54%, to 4,267 ringgit ($1,009.46) a metric ton at the close. The contract rose 2.46% on Tuesday. \n\n“Destination demand remains fragmented at the moment, which could result in further downward pressure on palm oil prices going forward,” said Anilkumar Bagani, research head of Mumbai-based vegetable oil broker Sunvin Group. \n\nHowever, a bullish momentum in Dalian soyoil and rapeseed oil due to a slower crush is helping offset some bearish sentiments, thus preventing a larger decline, he said. \n\nDalian’s most active soyoil contract rose 1.35%, while its palm oil contract added 0.27%. Soyoil prices on the Chicago Board of Trade were up 0.8%. \n\nPalm oil tracks the price movements of rival edible oils, as it competes for a share of the global vegetable oils market. Oil prices climbed, rebounding from a five-week low the previous day, as traders focused on US President Donald Trump threatening India with higher tariffs over its Russian crude purchases and a larger-than-expected US crude draw. \n\nStronger crude oil futures make palm a more attractive option for biodiesel feedstock. The ringgit, palm’s currency of trade, weakened 0.05% against the dollar, making the commodity slightly cheaper for buyers holding foreign currencies. \n\nEuropean Union’s soybean imports for the 2025/26 season that began in July had reached 0.97 million metric tons by August 3, down 26% from the same period a year earlier, European Commission data showed. Palm oil imports were at 0.16 million tons, down 56%.","summary":"KUALA LUMPUR: Malaysian palm oil futures fell on Wednesday as sluggish demand from key markets pressured prices, although gains in Dalian soyoil helped cap losses.  \n\n\n\nThe benchmark palm oil contract for October delivery on the Bursa Malaysia Derivatives Exchange slid 23 ringgit, or 0.54%, to 4,267 ringgit ($1,009.46) a metric ton at the close. The contract rose 2.46% on Tuesday.  \n\n\n\n“Destination demand remains fragmented at the moment, which could result in further downward pressure on palm oil prices going forward,” said Anilkumar Bagani, research head of Mumbai-based vegetable oil broker Sunvin Group.  \n\n\n\nHowever, a bullish momentum in Dalian soyoil and rapeseed oil due to a slower crush is helping offset some bearish sentiments, thus preventing a larger decline, he said.  \n\n\n\nDalian’s most active soyoil contract rose 1.35%, while its palm oil contract added 0.27%. Soyoil prices on the Chicago Board of Trade were up 0.8%.  \n\n\n\nPalm oil tracks the price movements of rival edible oils, as it competes for ","url":"https://www.brecorder.com/news/40376662/palm-oil-falls-on-sluggish-demand","image":"https://i.brecorder.com/large/2025/08/6893aecc6132d.jpg","video":null,"publish_date":"2025-08-07 00:56:08","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.018},{"id":348834900,"title":"Copper lifted by rate cut hopes, Chile supply worries","text":"LONDON: Copper prices edged higher on Wednesday, supported by hopes for US rate cuts and persistent supply concerns following the suspension of a mine in top producer Chile. \n\nThree-month copper on the London Metal Exchange rose 0.3% at $9,670 per metric ton in official open-outcry trading after slipping by 0.6% in the previous session. \n\n“A weaker dollar as Fed rate cuts bets intensify is buoying metals this morning,” said Ewa Manthey, commodities strategist at ING. Following weak US jobs data on Friday, traders are pricing in an 86.5% chance of a Fed rate cut in September, with about 56 basis points worth of easing expected by year-end. \n\nUS Comex copper futures gained 0.8% to $4.42 a lb by 1205 GMT, bringing the premium of Comex over LME copper to $58 a ton. Investors are also eyeing developments in Chile, the world’s largest copper producer, after the collapse at its El Teniente copper mine that killed six people due to a tremor last week. \n\nMiner Codelco must produce four reports before it can restart its underground operations at the mine, which produced 356,000 tons of copper last year. “It has been a mixed picture. Copper has been holding well throughout this week. Of course, the Codelco news got the micro story bringing some support to prices,” said research analyst Yuting Du at broker Marex. \n\nAt the same time, some investors are placing bets on lower prices through puts in the option market, Du added. The most-traded copper contract on the Shanghai Futures Exchange lost 0.3% to 78,280 yuan ($10,889.01) a ton. \n\nAlso helping the market were hopes for easing in a US-China trade war after President Donald Trump said they were close to a trade deal with China, the world’s biggest metals consumer. \n\nAmong other metals, LME aluminium rose 1.1% in official activity to $2,591 a ton, zinc advanced 1.1% to $2,787.50, nickel added 0.8% to $15,140, lead gained 1% to $1,993 and tin climbed 1% to $33,590.","summary":"LONDON: Copper prices edged higher on Wednesday, supported by hopes for US rate cuts and persistent supply concerns following the suspension of a mine in top producer Chile.  \n\n\n\nThree-month copper on the London Metal Exchange rose 0.3% at $9,670 per metric ton in official open-outcry trading after slipping by 0.6% in the previous session.  \n\n\n\n“A weaker dollar as Fed rate cuts bets intensify is buoying metals this morning,” said Ewa Manthey, commodities strategist at ING.  Following weak US jobs data on Friday, traders are pricing in an 86.5% chance of a Fed rate cut in September, with about 56 basis points worth of easing expected by year-end.  \n\n\n\nUS Comex copper futures gained 0.8% to $4.42 a lb by 1205 GMT, bringing the premium of Comex over LME copper to $58 a ton.  Investors are also eyeing developments in Chile, the world’s largest copper producer, after the collapse at its El Teniente copper mine that killed six people due to a tremor last week.  \n\n\n\nMiner Codelco must produce four reports before it ","url":"https://www.brecorder.com/news/40376661/copper-lifted-by-rate-cut-hopes-chile-supply-worries","image":"https://i.brecorder.com/large/2025/08/6893aea73ede4.jpg","video":null,"publish_date":"2025-08-07 00:56:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.015},{"id":348836428,"title":"Trump hints at more secondary sanctions on Russia oil buyers after fresh tariffs on India","text":"ANI\"You're going to see so much secondary sanctions\": Trump after additional 25 pc tariff move\n\nWashington: US President Donald Trump on Wednesday hinted that more \"secondary sanctions\" could be imposed shortly after US President announced an additional 25 percent against India in response to India being singled out for these additional sanctions.On being asked, 'Indian officials have said that there are other countries that are buying Russian oil, like China, for instance. Why are you singling India out for these additional sanctions', US President Donald Trump said, \"It's only been 8 hours. So let's see what happens. You're going to see a lot more...You're going to see so much secondary sanctions, \" Trump told reporters during a press briefing in White House.Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh MehraHe also hinted that US administration could impose \"more\" similar sanctions on China.On being asked, 'On the Indian penalties, do you have any similar plans to enact more tariffs on China', US President Donald Trump says, \"Could happen. Depends on how we do. Could happen.\"On Wednesday, US President Donald Trump signed an Executive Order imposing an additional 25 per cent tariff on imports from India.Live EventsAccording to the order issued by the White House, Trump cited matters of national security and foreign policy concerns, as well as other relevant trade laws, for the increase, claiming that India's imports of Russian oil, directly or indirectly, pose an \"unusual and extraordinary threat\" to the United States.After the order, the total tariff on Indian goods will be 50 per cent. While the initial duty comes into effect on August 7, the additional levy will come into effect after 21 days and will be imposed on all Indian goods imported into the US, except for goods already in transit or those meeting specific exemptions.Following this announcement, the Ministry of External Affairs (MEA), in its response, termed the US's move as \"unfair, unjustified and unreasonable\", declaring that New Delhi will take \"all actions necessary to protect its national interests.\"In an official statement, the MEA said, \"The United States has in recent days targeted India's oil imports from Russia. We have already made clear our position on these issues, including the fact that our imports are based on market factors and done with the overall objective of ensuring the energy security of 1.4 billion people of India.\"\"It is therefore extremely unfortunate that the US should choose to impose additional tariffs on India for actions that several other countries are also taking in their own national interest,\" the statement added.\"We reiterate that these actions are unfair, unjustified and unreasonable. India will take all actions necessary to protect its national interests,\" the MEA stressed.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onUS tariffs on IndiaTrump sanctions India25 percent tariffMEA response to US tariffsIndia Russian oil importsIndia national interestsDonald Trump\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onUS tariffs on IndiaTrump sanctions India25 percent tariffMEA response to US tariffsIndia Russian oil importsIndia national interestsDonald Trump(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Trump hinted at more secondary sanctions shortly after announcing a 25% tariff increase on Indian goods due to India's Russian oil imports, which he deems a national security threat. India's Ministry of External Affairs responded strongly, calling the US's actions unfair and unjustified.","url":"https://economictimes.indiatimes.com/news/international/global-trends/youre-going-to-see-so-much-secondary-sanctions-trump-after-additional-25-tariff-move/articleshow/123153085.cms","image":"https://img.etimg.com/thumb/msid-123153108,width-1200,height-630,imgsize-23558,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-07 00:53:20","author":"Metla Sudha Sekhar","authors":["Metla Sudha Sekhar"],"language":"en","source_country":"in","sentiment":-0.219},{"id":348835444,"title":"Trump plans 100% tariff on computer chips, unless companies build in U.S.","text":"President Donald Trump said Wednesday that he will impose a 100% tariff on computer chips, raising the specter of higher prices for electronics, autos, household appliances and other essential products dependent on the processors powering the digital age.\n\n“We’ll be putting a tariff of approximately 100% on chips and semiconductors,” Trump said in the Oval Office while meeting with Apple CEO Tim Cook. \"But if you’re building in the United States of America, there’s no charge.\"\n\nThe announcement came more than three months after Trump temporarily exempted most electronics from his administration's most onerous tariffs.\n\nThe Republican president said companies that make computer chips in the U.S. would be spared the import tax. During the COVID-19 pandemic, a shortage of computer chips increased the price of autos and contributed to higher inflation.\n\nInvestors seemed to interpret the potential tariff exemptions as a positive for Apple and other major tech companies that have been making huge financial commitments to manufacture more chips and other components in the U.S..\n\nBig Tech already has made collective commitments to invest about $1.5 trillion in the U.S. since Trump moved back into the White House in January. That figure includes a $600 billion promise from Apple after the iPhone maker boosted its commitment by tacking another $100 billion on to a previous commitment made in February.\n\nNow the question is whether the deal brokered between Cook and Trump will be enough to insulate the millions of iPhones made in China and India from the tariffs that the administration has already imposed and reduce the pressure on the company to raise prices on the new models expected to be unveiled next month.\n\nWall Street certainly seems to think so. After Apple's stock price gained 5% in Wednesday regular trading sessions, the shares rose by another 3% in extended trading after Trump announced some tech companies won't be hit with the latest tariffs while Cook stood alongside him.\n\nThe shares of AI chipmaker Nvidia, which also has recently made big commitments to the U.S., rose slightly in extended trading to add to the $1 trillion gain in market value the Silicon Valley company has made since the start of Trump's second administration.\n\nThe stock price of computer chip pioneer Intel, which has fallen on hard times, also climbed in extended trading.\n\nInquiries sent to chip makers Nvidia and Intel were not immediately answered. The chip industry's main trade group, the Semiconductor Industry Association, declined to comment on Trump's latest tariffs.\n\nDemand for computer chips has been climbing worldwide, with sales increasing 19.6% in the year-ended in June, according to the World Semiconductor Trade Statistics organization.\n\nTrump's tariff threats mark a significant break from existing plans to revive computer chip production in the U.S. that were drawn up during the administration of President Joe Biden.\n\nSince taking over from Biden, Trump has been deploying tariffs to incentivize more domestic production. Essentially, the president is betting that the threat of dramatically higher chip costs would force most companies to open factories domestically, despite the risk that tariffs could squeeze corporate profits and push up prices for mobile phones, TVs and refrigerators.\n\nBy contrast, the bipartisan CHIPS and Science Act that Biden signed into law in 2022 provided more than $50 billion to support new computer chip plants, fund research and train workers for the industry. The mix of funding support, tax credits and other financial incentives were meant to draw in private investment, a strategy that Trump has vocally opposed.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"President Donald Trump said Wednesday that he will impose a 100% tariff on computer chips, raising the specter of higher prices for electronics, autos, household appliances and other…","url":"https://japantoday.com/category/world/trump-says-he-plans-to-put-a-100-tariff-on-computer-chips-likely-pushing-up-cost-of-electronics","image":"https://media.japantoday.com/img/store/bb/8e/3ecaa2a2f1bcfd087f515f77e55d3b3a802b/download/_w1700.jpeg","video":null,"publish_date":"2025-08-07 00:53:19","author":"Japan Today Editor,Josh Boak","authors":["Japan Today Editor","Josh Boak"],"language":"en","source_country":"jp","sentiment":-0.248},{"id":348834868,"title":"Trump says mulling federal takeover of Washington DC","text":"Police statistics showed violent crime in Democratic-led Washington dropped 26% in the first half of 2025 compared with a year earlier. (EPA Images pic)\nWASHINGTON: President Donald Trump on Wednesday mused again about the possibility of taking federal control of the US capital Washington, including by using soldiers, to counter what he falsely suggested was rising crime in the city.\nUnder a more-than 50-year agreement, governance of Washington rests with the locally elected government of the District of Columbia - including its mayor - with Congress having an oversight role.\nTrump has long chafed at that arrangement and has repeatedly suggested he would like to federalise the city, giving the White House the final say in how it is run.\n\"We're considering it, yeah, because the crime is ridiculous,\" he told reporters in response to a question about whether he should be in charge of the city's police force.\n\"We want to have a great safe capital - and we're going to have it.\n\"The rate of crime, the rate of muggings, killings and everything else; we're not going to let it - and that includes bringing in the National Guard, maybe very quickly too,\" he said.\nThe comments come a day after the billionaire president took to his social media platform to threaten city leaders.\n\"If DC doesn't get its act together, and quickly, we will have no choice but to take Federal control of the City, and run this City how it should be run,\" he wrote.\nViolent crime in Democratic-controlled Washington fell in the first half of 2025 by 26% compared with a year earlier, police statistics show.\nThe city's crime rates in 2024 were already their lowest in three decades, according to figures produced by the justice department before Trump took office.\nTrump's threat to send the National Guard into the capital comes weeks after he deployed California's military reserve force into Los Angeles to quell protests over immigration raids, despite objections from local leaders and law enforcement.\nThe president has frequently mused about using the military to control America's cities, many of which are under Democratic control and hostile to his nationalist impulses.\nOn Wednesday Washington's non-voting congressional delegate, Eleanor Holmes Norton, rejected Trump's claim that violent crime was rising, and his threat to federalise the capital.\n\"Presidents have no authority to unilaterally take control of DC. Congress would have to pass a law, and I won't let the current effort get that far,\" she said on X.","summary":"The US president has long considered taking control of the US capital, citing falsely claimed rising crime in the city.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/07/trump-says-mulling-federal-takeover-of-washington-dc","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=85,format=auto,fit=scale-down,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/08/e2bcab77-washington-dc-1.jpg","video":null,"publish_date":"2025-08-07 00:50:18","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.352},{"id":348836430,"title":"Trump says US will levy 100% tariff on some chip imports","text":"IANSDonald Trump \n\nThe United States will impose a tariff of about 100% on semiconductor chips imported from countries not producing in America or planning to do so, President Donald Trump said. Trump told reporters in the Oval Office on Wednesday the new tariff rate would apply to \"all chips and semiconductors coming into the United States,\" but would not apply to companies that had made a commitment to manufacture in the United States or were in the process of doing so.Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh Mehra \"If, for some reason, you say you're building and you don't build, then we go back and we add it up, it accumulates, and we charge you at a later date, you have to pay, and that's a guarantee,\" Trump added. The comments were not a formal tariff announcement, and Trump offered no further specifics. It is not clear how many chips, or from which country, would be impacted by the new levy. Taiwanese chip contract manufacturer TSMC - which makes chips for most U.S. companies - has factories in the country, so its big customers such as Nvidia are not likely to face increased tariff costs.Live Events The AI chip giant has itself said it plans to invest hundreds of billions of dollars in U.S.-made chips and electronics over the next four years. An Nvidia spokesperson declined to comment for this story. \"Large, cash-rich companies that can afford to build in America will be the ones to benefit the most. It's survival of the biggest,\" said Brian Jacobsen, chief economist at investment advisory firm Annex Wealth Management. Congress created a $52.7 billion semiconductor manufacturing and research subsidy program in 2022. The Commerce Department under President Joe Biden last year convinced all five leading-edge semiconductor firms to locate chip factories in the U.S. as part of the program. The department said the U.S. last year produced about 12% of semiconductor chips globally, down from 40% in 1990. Any chip tariffs would likely target China, with whom Washington is still negotiating a trade deal. \"There's so much serious investment in the United States in chip production that much of the sector will be exempt,\" said Martin Chorzempa, senior fellow at the Peterson Institute for International Economics. Since chips made in China won't be exempt, chips made by SMIC or Huawei would not be either, Chorzempa said, noting that chips from these companies entering the U.S. market were mostly incorporated into devices assembled in China. \"If these tariffs were applied without a component tariff, it might not make much difference,\" he said. Chipmaking nations South Korea and Japan, as well as the European Union, have reached trade deals with the U.S., potentially giving them an advantage. The EU said it agreed to a single 15% tariff rate for the vast majority of EU exports, including cars, chips and pharmaceuticals. South Korea and Japan said separately that U.S. agreed not to give them worse tariff rates than other countries on chips, suggesting a 15% levy as well. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump tariff announcementUS chip imports tariffTSMC exemption tariffimpact on China chipsNvidia US investmentsemiconductor industry newssemiconductor manufacturing subsidytrade deals EU South Korea JapanNvidia\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump tariff announcementUS chip imports tariffTSMC exemption tariffimpact on China chipsNvidia US investmentsemiconductor industry newssemiconductor manufacturing subsidytrade deals EU South Korea JapanNvidia(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Trump announced a potential 100% tariff on semiconductor chips imported from countries not manufacturing in the U.S. or committed to doing so. Exemptions would apply to companies investing in American chip production, like TSMC and potentially Nvidia.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-will-levy-100-tariff-on-some-chip-imports/articleshow/123153029.cms","image":"https://img.etimg.com/thumb/msid-123153045,width-1200,height-630,imgsize-7768,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-07 00:48:20","author":"Metla Sudha Sekhar","authors":["Metla Sudha Sekhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.317},{"id":348834852,"title":"Brazil’s Bolsonaro appeals house arrest order","text":"Brazil's former president Jair Bolsonaro allegedly courted US President Donald Trump's interference in his Supreme Court case. (AP pic)\nBRASILIA: Lawyers for former Brazilian president Jair Bolsonaro appealed on Wednesday a house arrest order imposed against him earlier this week, a document sent to the Supreme Court and seen by Reuters showed.\nBolsonaro was placed under house arrest on Monday after an order was issued by Supreme Court justice Alexandre de Moraes against him.\nMoraes' decision cited a failure to comply with restraining orders he had imposed on Bolsonaro for allegedly courting US President Donald Trump's interference in the case.\nBolsonaro's lawyers had already said that they would appeal the decision to place him under house arrest.\nIn the document sent on Wednesday, the lawyers said that Bolsonaro did not breach the restraining orders. They also asked for the house arrest order to be voted on by a wider panel of Supreme Court justices.","summary":"The former president was placed under house arrest for failing to comply with restraining orders.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/07/brazils-bolsonaro-appeals-house-arrest-order","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=85,format=auto,fit=scale-down,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/03/e7e6ec3e-brazil-jair-bolsonaro-160325.webp","video":null,"publish_date":"2025-08-07 00:34:23","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.428},{"id":348826892,"title":"World News | Pakistan Suspends Internet Services Across Balochistan Due to Security Concerns","text":"Islamabad [Pakistan], August 7 (ANI): Mobile internet services have been suspended across Balochistan following an order from the Pakistan Telecommunication Authority (PTA), reportedly due to security-related reasons, The Balochistan Post reported.\nThe sudden shutdown has affected millions of people in the region, disrupting daily life, education, online business activities, and access to social media. The decision has caused widespread frustration, especially among students and workers who rely on the internet for studies and income.\nAlso Read | Mass Deportation of Afghan Refugees: Pakistan to Begin Deportation of Afghan Nationals With Expired Residency Cards From September 1.\nThe Balochistan Post has reported that the suspension was enforced due to possible security threats, but the government has not shared any official details about the nature of those threats. There is also no clarity on when internet services will be restored, leaving residents uncertain and cut off from the digital world.\nThe disruption comes at a time when the Government of Balochistan has already imposed a ban on public gatherings under Section 144.\nAlso Read | India Points Finger at China, Turkey After Donald Trump Slaps Additional 25% Tariff Due to Russian Oil Imports.\nAccording to The Balochistan Post, the Home Department issued a notification on Friday announcing a 15-day ban from August 1. The order prohibits groups of four or more people from assembling in public places. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The sudden shutdown has affected millions of people in the region, disrupting daily life, education, online business activities, and access to social media. The decision has caused widespread frustration, especially among students and workers who rely on the internet for studies and income.","url":"https://www.latestly.com/agency-news/world-news-pakistan-suspends-internet-services-across-balochistan-due-to-security-concerns-7046128.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806233057.jpg","video":null,"publish_date":"2025-08-07 00:32:20","author":null,"language":"en","source_country":"in","sentiment":-0.199},{"id":348830350,"title":"Trump says US will levy 100% tariff on some chip imports - Reuters","text":"SummaryCompaniesTrump says tariffs to target non-US chip producers, excludes those building in AmericaTSMC likely exempt due to US factories, aiding NvidiaChip tariffs may impact China, SMIC, Huawei products\n\nWASHINGTON, Aug 6 (Reuters) - The United States will impose a tariff of about 100% on semiconductor chips imported from countries not producing in America or planning to do so, President Donald Trump said.\n\nTrump told reporters in the Oval Office on Wednesday the new tariff rate would apply to \"all chips and semiconductors coming into the United States,\" but would not apply to companies that had made a commitment to manufacture in the United States or were in the process of doing so.\n\nAdvertisement · Scroll to continue\n\n\"If, for some reason, you say you're building and you don't build, then we go back and we add it up, it accumulates, and we charge you at a later date, you have to pay, and that's a guarantee,\" Trump added.\n\nThe comments were not a formal tariff announcement, and Trump offered no further specifics.\n\nIt is not clear how many chips, or from which country, would be impacted by the new levy. Taiwanese chip contract manufacturer TSMC (2330.TW), opens new tab - which makes chips for most U.S. companies - has factories in the country, so its big customers such as Nvidia (NVDA.O), opens new tab are not likely to face increased tariff costs.\n\nAdvertisement · Scroll to continue\n\nThe AI chip giant has itself said it plans to invest hundreds of billions of dollars in U.S.-made chips and electronics over the next four years. An Nvidia spokesperson declined to comment for this story.\n\n\"Large, cash-rich companies that can afford to build in America will be the ones to benefit the most. It’s survival of the biggest,\" said Brian Jacobsen, chief economist at investment advisory firm Annex Wealth Management.\n\nCongress created a $52.7 billion semiconductor manufacturing and research subsidy program in 2022. The Commerce Department under President Joe Biden last year convinced all five leading-edge semiconductor firms to locate chip factories in the U.S. as part of the program.\n\nThe department said the U.S. last year produced about 12% of semiconductor chips globally, down from 40% in 1990.\n\nAny chip tariffs would likely target China, with whom Washington is still negotiating a trade deal.\n\n\"There's so much serious investment in the United States in chip production that much of the sector will be exempt,\" said Martin Chorzempa, senior fellow at the Peterson Institute for International Economics.\n\nSince chips made in China won't be exempt, chips made by SMIC or Huawei would not be either, Chorzempa said, noting that chips from these companies entering the U.S. market were mostly incorporated into devices assembled in China.\n\n\"If these tariffs were applied without a component tariff, it might not make much difference,\" he said.\n\nChipmaking nations South Korea and Japan, as well as the European Union, have reached trade deals with the U.S., potentially giving them an advantage.\n\nThe EU said it agreed to a single 15% tariff rate for the vast majority of EU exports, including cars, chips and pharmaceuticals. South Korea and Japan said separately that U.S. agreed not to give them worse tariff rates than other countries on chips, suggesting a 15% levy as well.\n\nReporting by Andrea Shalal, Kanishka Singh and David Shepardson in Washington, Arsheeya Bajwa in Bengaluru; Additional reporting by Akash Sriram in Bengaluru and Hyunjoo Jin in Seoul; Editing by Leslie Adler, Chris Reese, Sayantani Ghosh and Lincoln Feast.\n\nPurchase Licensing Rights","summary":"Trump says US will levy 100% tariff on some chip imports  Reuters","url":"https://www.reuters.com/world/china/trump-says-us-will-levy-100-tariff-some-chip-imports-2025-08-06/","image":"https://www.reuters.com/resizer/v2/DYGRQKCFXFLHRDMFZZFSZQU2WE.jpg?auth=f700e7cf24b302a94b11f930c4508ba3cd582b008075f78c10b3acd71074e80d&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-08-07 00:32:00","author":"Andrea Shalal,Arsheeya Bajwa,David Shepardson","authors":["Andrea Shalal","Arsheeya Bajwa","David Shepardson"],"language":"en","source_country":"gb","sentiment":-0.202},{"id":348829256,"title":"Trump announces Apple to invest another $100 billion in U.S. manufacturing","text":"Apple CEO Tim Cook joined U.S. President Donald Trump at the White House on Wednesday (August 6, 2025) to announce a commitment by the tech company to increase its investment in US manufacturing by an additional $100 billion over the next four years.\n\n\"This is a significant step toward the ultimate goal of ensuring that iPhones sold in the United States of America also are made in America,\" Mr. Trump said at the press conference. \"Today's announcement is one of the largest commitments in what has become among the greatest investment booms in our nation's history.\" \n\nAs part of the Apple announcement, the investments will be about bringing more of its supply chain and advanced manufacturing to the United States as part of an initiative called the American Manufacturing Programme, but it is not a full commitment to build its popular iPhone device domestically.\n\n\"This includes new and expanded work with 10 companies across America. They produce components — semiconductor chips included — that are used in Apple products sold all over the world, and we're grateful to the President for his support,\" Cook said in a statement announcing the investment.\n\nThe new manufacturing partners include Corning, Coherent, Applied Materials, Texas Instruments and Broadcom among others.\n\nApple had previously said it intended to invest $500 billion domestically, a figure it will now increase to $600 billion. Mr. Trump in recent months criticised the tech company and Mr. Cook for efforts to shift iPhone production to India to avoid the tariffs his Republican administration had planned for China.\n\nWhile in Qatar earlier this year, Mr. Trump said there was \"a little problem\" with the Cupertino, California, company and recalled a conversation with Mr. Cook in which he said he told the CEO, \"I do not want you building in India.\" \n\nTargetting India\n\nIndia has incurred Trump's wrath, as the president signed an order on Wednesday to put an additional 25% tariff on the world's most populous country for its use of Russian oil. The new import taxes to be imposed in 21 days could put the combined tariffs on Indian goods at 50%.\n\nApple's new pledge comes just a few weeks after it forged a $500 million deal with MP Materials, which runs the only rare earths producer in the country. That agreement will enable MP Materials to expand a factory in Texas to use recycled materials to produce magnets that make iPhones vibrate.\n\nSpeaking on a recent investors call, Mr. Cook emphasised that \"there is a load of different things done in the United States\". As examples, he cited some of the iPhone components made in the U.S. such as the device's glass display and module for identifying people's faces and then indicated the company was gearing to expand its production of other components in its home country.\n\n\"We are doing more in this country, and that is on top of having roughly 19 billion chips coming out of the U.S. now, and we will do more,\" Cook told analysts last week, without elaborating.\n\nNews of Apple's latest investment in the US caused the company's stock price to surge by 5 per cent in Wednesday's midday trading. That gain reflects investors' relief that Cook \"is extending an olive branch\" to the Trump administration, said Nancy Tengler, CEO of money manager Laffer Tengler Investments, which owns Apple stock.\n\nDespite Wednesday's upturn, Apple's shares are still down by 15% this year, a reversal of fortune that has also been driven by the company's botched start in the pivotal field of artificial intelligence.","summary":"Mr. Trump in recent months criticised the tech company and CEO Tim Cook for efforts to shift iPhone production to India to avoid the tariffs his administration had planned for China","url":"https://www.thehindu.com/news/international/trump-announces-apple-to-invest-another-100-billion-in-us-manufacturing/article69903896.ece","image":"https://th-i.thgim.com/public/incoming/zi4fru/article69903897.ece/alternates/LANDSCAPE_1200/2025-08-06T224338Z_348731871_RC2Y1GASPVPK_RTRMADP_3_USA-TRUMP-INVESTMENT.JPG","video":null,"publish_date":"2025-08-07 00:30:46","author":null,"language":"en","source_country":"in","sentiment":-0.267},{"id":348826886,"title":"India News | Over 246 Handloom Cooperative Societies in Gujarat Recorded Handloom Product Sales Worth over Rs 290 Cr in 2024-25","text":"Gandhinagar (Gujarat) [India], August 7 (ANI): Under the leadership of Chief Minister Bhupendra Patel, the State Government has taken meaningful steps to uplift Gujarat's handloom weavers by supporting their skills and preserving their rich cultural legacy.\nAccording to a release, as part of the ongoing efforts to strengthen handloom cooperative societies, the Department of Cottage and Rural Industries, Government of Gujarat, is implementing a package scheme that supports industrial cooperative societies registered under the Cooperatives Act.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nThrough this initiative, these societies receive rebates on the sale of handloom products. In the year 2024-25, over 246 handloom cooperative societies across Gujarat benefited from the initiative, leading to handloom product sales worth over Rs 290 crore. This progress is a sign of the growing strength and resilience of the handloom sector in the state.\nIt is worth noting that the Centre, under the leadership of Prime Minister Narendra Modi, declared August 7 as National Handloom Day in 2015, to honour handloom weavers and promote the handloom industry nationwide. The day highlights the cultural, traditional, and economic importance of handlooms.\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nAs per the release, Prime Minister Narendra Modi has stated, \"The government is working with a clear strategy to provide the world's largest market to its weavers.\" Since then, National Handloom Day has been observed every year on August 7 to acknowledge the invaluable contributions of weavers and celebrate the role of handlooms in preserving India's rich heritage and sustaining rural livelihoods.\nTo boost the sale of handloom products during festivals and improve their market competitiveness, the Government of Gujarat has introduced a rebate (package) scheme. Designed to increase the accessibility and appeal of handloom goods, the initiative offers a rebate on sales made by handloom cooperative societies.\nUnder the scheme, handloom cooperative societies receive a 5% rebate on the sale of handloom products, while women's cooperative societies are provided a 15% rebate. Additionally, for 120 days each year, women's cooperative societies receive a special rebate of 15% and 20% on sales. As a result of these consistent efforts, over 246 handloom cooperative societies recorded sales worth over Rs 290 crore in the year 2024-25. On this sale, the Government of Gujarat provided a rebate on handloom product sales amounting to Rs 73.82 crore to these cooperative societies, reflecting its commitment to the upliftment of handloom weavers.\nThe Government of Gujarat has launched several schemes to support handloom weavers, improve the production quality, market competitiveness, and generate employment opportunities. The key initiatives under these schemes include:\nSupport for Leading Handloom Institutions in Advertising and Promotion: Under this scheme, the Government of Gujarat provides assistance to prominent handloom institutions across the state, along with Gujarat State Handloom & Handicrafts Development Corporation Ltd., to participate in exhibitions within and outside Gujarat and to carry out advertising and promotional activities.\nInstitutions can receive up to Rs 70,000 for participating in exhibitions within the state and up to Rs 1,50,000 for organising exhibitions outside the state. Additionally, the government offers Rs 1,00,000 per year for advertising and Rs 25,000 for participation in fairs and exhibitions. This initiative promotes handloom products and accelerates employment generation for weavers.\nMill Gate Price Scheme: The scheme supports weavers in producing high-quality handloom products, improving their market value and expanding employment opportunities. Under this scheme, a 15% subsidy is offered on the purchase of quality yarn through approved depots in the state.\nTo strengthen the skills of weavers and enhance the market competitiveness of handloom products, the Gujarat State Handloom and Handicraft Development Corporation offers both short-term and long-term training programmes, along with a monthly stipend of Rs 4,500 per trainee. The Corporation also works in collaboration with the Weavers Service Centre, NID, and NIFT to develop value-added products, new designs, and prototypes, helping handloom products stand strong against mill and powerloom alternatives.\nIn addition to training and product development, focused marketing efforts are undertaken to increase the visibility of handloom products. These include promotional campaigns through hoardings, kiosks, wall paintings, road shows, fashion shows, and other platforms. Marketing is carried out both within Gujarat and across India under 'Garvi-Gurjari' brand, supported by e-commerce channels and a network of Emporia.\nThe reach of these products is further expanded through various exhibitions and expos organised by Industrial Extension Cottages (iNDEXT-c). (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  According to a release, as part of the ongoing efforts to strengthen handloom cooperative societies, the Department of Cottage and Rural Industries, Government of Gujarat, is implementing a package scheme that supports industrial cooperative societies registered under the Cooperatives Act.","url":"https://www.latestly.com/agency-news/india-news-over-246-handloom-cooperative-societies-in-gujarat-recorded-handloom-product-sales-worth-over-rs-290-cr-in-2024-25-7046126.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806232037.jpg","video":null,"publish_date":"2025-08-07 00:30:33","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.275},{"id":348835630,"title":"Trump plans 100 pc tariff on computer chips, unless companies build in US","text":"Washington, Aug 7 (AP) President Donald Trump said on Wednesday that he will impose a 100 per cent tariff on computer chips, raising the spectre of higher prices for electronics, autos, household appliances and other essential products dependent on the processors powering the digital age.\n“We will be putting a tariff of approximately 100 per cent on chips and semiconductors,” Trump said in the Oval Office while meeting with Apple CEO Tim Cook. “But if you are building in the United States of America, there is no charge.” The announcement came more than three months after Trump temporarily exempted most electronics from his administration’s most onerous tariffs.\nThe Republican president said companies that make computer chips in the US would be spared the import tax. During the COVID-19 pandemic, a shortage of computer chips increased the price of autos and contributed to higher inflation.\nInvestors seemed to interpret the potential tariff exemptions as a positive for Apple and other major tech companies that have been making huge financial commitments to manufacture more chips and other components in the US.\nBig Tech already has made collective commitments to invest about USD 1.5 trillion in the US since Trump moved back into the White House in January. That figure includes a USD 600 billion promise from Apple after the iPhone maker boosted its commitment by tacking another USD 100 billion on to a previous commitment made in February.\nNow the question is whether the deal brokered between Cook and Trump will be enough to insulate the millions of iPhones made in China and India from the tariffs that the administration has already imposed and reduce the pressure on the company to raise prices on the new models expected to be unveiled next month.\nWall Street certainly seems to think so. After Apple’s stock price gained 5 per cent in Wednesday regular trading sessions, the shares rose by another 3 per cent in extended trading after Trump announced some tech companies will not be hit with the latest tariffs while Cook stood alongside him.\nThe shares of AI chipmaker Nvidia, which also has recently made big commitments to the US, rose slightly in extended trading to add to the USD 1 trillion gain in market value the Silicon Valley company has made since the start of Trump’s second administration.\nThe stock price of computer chip pioneer Intel, which has fallen on hard times, also climbed in extended trading.\nInquiries sent to chip makers Nvidia and Intel were not immediately answered. The chip industry’s main trade group, the Semiconductor Industry Association, declined to comment on Trump’s latest tariffs.\nDemand for computer chips has been climbing worldwide, with sales increasing 19.6 per cent in the year-ended in June, according to the World Semiconductor Trade Statistics organisation.\nTrump’s tariff threats mark a significant break from existing plans to revive computer chip production in the US that were drawn up during the administration of President Joe Biden.\nSince taking over from Biden, Trump has been deploying tariffs to incentivise more domestic production. Essentially, the president is betting that the threat of dramatically-higher chip costs would force most companies to open factories domestically, despite the risk that tariffs could squeeze corporate profits and push up prices for mobile phones, TVs and refrigerators.\nBy contrast, the bipartisan CHIPS and Science Act that Biden signed into law in 2022 provided more than USD 50 billion to support new computer chip plants, fund research and train workers for the industry. The mix of funding support, tax credits and other financial incentives were meant to draw in private investment, a strategy that Trump has vocally opposed. (AP) RC","summary":"","url":"https://www.news18.com/agency-feeds/trump-plans-100-pc-tariff-on-computer-chips-unless-companies-build-in-us-9489729.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_Business_Section_Default_Image_1600x900-2025-07-454f4d093355309283e1b9f3be42698a.jpg","video":null,"publish_date":"2025-08-07 00:30:02","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":-0.29},{"id":348833814,"title":"Diddy's Legal Team Didn't Request a Pardon from Trump — But Others in His Circle Did (Exclusive)","text":"With less than two months before his sentencing, one of Sean “Diddy” Combs' attorneys claimed that efforts have been made to secure a pardon from President Donald Trump.\n\n “It’s my understanding that we’ve reached out and had conversations in reference to a pardon,” Nicole Westmoreland, a member of Combs’ legal team, told CNN in an interview that aired on Tuesday, Aug. 5.\n\n However, behind the scenes, that narrative is being disputed. Multiple sources with knowledge of the situation tell PEOPLE that Combs’ legal team has not made any formal contact with Trump or his administration.\n\n “People in Diddy’s world and orbit are reaching out to his administration for a pardon, but not his legal team,” one source close to the rap mogul tells PEOPLE. “They have nothing to do with it — but they are aware it’s happening.”\n\n As for how Combs feels about the possibility of a pardon from the former president, Westmoreland told CNN, “He is a very hopeful person, and I believe that he remains hopeful.”\n\n A White House official told CNN they “will not comment on the existence or nonexistence of any clemency request.”\n\n PEOPLE has reached out to Westmoreland for comment, but has not heard back.\n\n On July 31, Rolling Stone reported that longtime allies of Combs have approached political operatives, lobbyists and others with close ties to Trump’s circle and government officials, allegedly offering large sums of money in exchange for help securing a presidential pardon. Three people familiar with the discussions told the magazine that at least one of the offers reached the mid-six-figure range. However, the sources also noted that some of these offers came with strings attached — namely, that most of the money wouldn’t be paid until after a pardon was granted.\n\n “This is such bulls---,” another Diddy source told PEOPLE. “I don’t think any of this is true.” Two other knowledgeable sources claim they also don't believe it's true.\n\n Westmoreland also told Piers Morgan on Wednesday, Aug 6, \"We're laser focused on preparing for October 3... You want to do what is right and fair,\" later adding, \"I think being pardoned would be the right thing to do. We're hopeful.\"\n\n After a nearly two-month-long federal trial that gripped New York and dominated headlines, Combs was convicted on two felony counts of transporting individuals across state lines for the purpose of prostitution on July 2. He was acquitted on the more explosive charges of racketeering and sex trafficking — a partial win in a case that has shadowed one of hip-hop’s most iconic moguls.\n\n Combs, who has maintained his innocence and pleaded not guilty to all charges, has been locked up at Brooklyn’s Metropolitan Detention Center since his arrest in September 2024. His legal team has filed five unsuccessful motions for bail. The most recent rejection came on Monday, Aug. 4, when U.S. District Judge Arun Subramanian again ruled that Combs posed too great a flight risk.\n\n His sentencing is now set for Oct. 3, and he faces up to 20 years in federal prison. Westmoreland told CNN his lawyers are preparing an appeal \"as soon as possible.\"\n\n When the president was asked in May whether he’d consider issuing a pardon for the embattled rapper, Trump told reporters, “[I] would certainly look at the facts. If I think someone was mistreated, it wouldn’t matter whether they like me or not.”\n\n During an Aug. 1 interview with Newsmax’s Rob Finnerty, Trump remained ambiguous when pressed again on the Combs case.\n\n \"Well, he was essentially, I guess, sort of half-innocent,\" Trump said. \"I don't know what they do, still in jail or something. But he was celebrating a victory, but I guess it wasn't as good of a victory.\"\n\n Trump and Combs go way back, often crossing paths during the 1990s. In one particularly iconic moment, Trump posed alongside Combs at the grand opening of Justin’s, the rapper’s upscale Atlanta restaurant.\n\n “We were very friendly,” Trump recalled in the Newsmax interview, saying he \"got along great\" with Combs.\n\n Want to keep up with the latest crime coverage? Sign up for PEOPLE's free True Crime newsletter for breaking crime news, ongoing trial coverage and details of intriguing unsolved cases. \n\n That relationship soured when Trump entered the political arena. Combs, once a flashy fixture in Trump’s social orbit, became a vocal critic during Trump's presidency, something the president hasn’t forgotten.\n\n \"We're human beings. We don't like to have things cloud our judgment, right? But when you knew someone and you were fine and then you run for office and he made some terrible statements,” Trump told Newsmax. “So, I don't know. It's more difficult. Makes it more, I'm being honest, makes it more difficult to do.\"\n\n “More likely a ‘no’ for Combs?” Finnerty asked Trump.\n\n “I would say so,\" Trump replied.\n\n If you or someone you know has been a victim of sexual abuse, text \"STRENGTH\" to the Crisis Text Line at 741-741 to be connected to a certified crisis counselor.","summary":"Multiple insider sources tell PEOPLE that Sean Combs' legal team did not reach out to President Trump for clemency — though others in his orbit did","url":"https://people.com/diddy-legal-team-didnt-request-pardon-from-trump-but-others-in-his-circle-did-exclusive-11786352","image":"https://people.com/thmb/CsBMcH-nawQBYsOVzSKuTVOJVyc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(742x334:744x336)/Nicole-Westmoreland-Manhattan-Federal-Court-2025-diddy-sean-combs-2018-Vanity-Fair-Oscar-Party-080625-f86762da2dc24aae98e","video":null,"publish_date":"2025-08-07 00:28:51","author":"Danielle Bacher","authors":["Danielle Bacher"],"language":"en","source_country":"US","sentiment":-0.286},{"id":348826884,"title":"India News | Himachal: CM Sukhvinder Singh Sukhu Condoles Loss of Three Lives in Car Accident","text":"Shimla (Himachal Pradesh) [India], August 7 (ANI): Chief Minister Sukhvinder Singh Sukhu has expressed grief over the death of three persons in a car accident in the Chirgaon area of Shimla district on Wednesday. One person has sustained injuries in the accident, a release said.\nThe Chief Minister directed the district administration to provide all possible assistance to the next of kin of the deceased and wished speedy recovery to the injured.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nHe prayed to the Almighty to grant peace to the departed souls and strength to the bereaved families to bear this irreparable loss.\nCM Sukhu termed the incident extremely \"sad\" and \"painful\".\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nhttps://x.com/CMOFFICEHP/status/1953024598733180962\n\"The news of the death of three youths and injury to one person due to a car falling into a river in Rohru, Shimla is extremely sad and extremely painful. I pray to God to grant peace to the souls of the departed and give strength to the bereaved family to bear this unbearable loss,\" the Chief Minister's Office said in hindi on social media platform.\nMeanwhile, Himachal Pradesh has reported a total of 199 deaths and a cumulative loss of over Rs 1905.5 crore during the monsoon season from June 20 to August 6 this year, according to a report by the State Disaster Management Authority (SDMA).\nThe State Disaster Management Authority (SDMA) said that the death toll from June 20 to August 6, 2025, has reached 199, with 108 fatalities caused by rain-related disasters such as landslides, flash floods, cloudbursts, and electrocutions. An additional 91 people have died in road accidents during the same period.\nThe scale of infrastructural disruption is also alarming.\nMeanwhile, the India Meteorological Department (IMD) has forecast more rain till August 12, and the administration remains on high alert.\nAs per the latest Public Utility Status Report (5 PM, August 6) by the State Emergency Operation Centre, 533 roads are blocked across the state, including National Highways NH-3, NH-5, NH-21, and NH-305.\nAdditionally, 635 power transformers (DTRs) are non-functional, and 266 water supply schemes have been disrupted, severely impacting public life.\nDistricts like Mandi, Kullu, and Kangra are among the worst hit, with Mandi alone recording the highest number of rain-related deaths (23) and massive infrastructure damage. Rescue and restoration operations continue amid difficult terrain and ongoing rainfall.\nThe SDMA has also reported 304 injuries due to disaster-related incidents and confirmed 36 people still missing.\nThe estimated cumulative loss to public and private property stands at a staggering Rs 1,90,550.45 lakh (Rs 1905.5 crore), affecting roads, houses, agriculture, horticulture, power, and water sectors.\nThe citizens have been advised to avoid travel through vulnerable areas and stay updated through official channels.\nThe Himachal State Disaster Management Authority continues to reel under the impact of an unrelenting monsoon, with extensive damage to life and infrastructure. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  The Chief Minister directed the district administration to provide all possible assistance to the next of kin of the deceased and wished a speedy recovery to the injured.","url":"https://www.latestly.com/agency-news/india-news-himachal-cm-sukhvinder-singh-sukhu-condoles-loss-of-three-lives-in-car-accident-7046124.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806232857.jpg","video":null,"publish_date":"2025-08-07 00:28:31","author":null,"language":"en","source_country":"in","sentiment":-0.646},{"id":348826890,"title":"World News | Israeli President Demands Truth After German Media Exposes Fake Gaza Photography","text":"Tel Aviv [ Israel], August 7 (ANI/TPS): During a visit to Tallinn on Wednesday, President Isaac Herzog of Israel used a joint press appearance with Estonian President Alar Karis to call out what he described as Hamas-led propaganda efforts, citing recent investigative reports from leading German newspapers that revealed staged images from Gaza. Herzog contrasted these fabricated scenes with the very real suffering of Israeli hostages, exposing what he called Hamas' \"hypocrisy and manipulation.\"\nStanding alongside President Karis at the Estonian Presidential Palace, Herzog held up two photos: one of Israeli hostage Eviatar David, a Nova music festival attendee now emaciated after months in captivity; and another of Rom Breslavsky, who appeared in a recent Hamas video. Herzog juxtaposed these with a now-controversial image from Gaza showing Palestinians holding empty pots in front of a food distribution center. \"It was all staged,\" Herzog said. \"There was food in the next room -- the hostages who escaped from tunnels told us this. The captors are not starving. Our people are.\"\nAlso Read | Mass Deportation of Afghan Refugees: Pakistan to Begin Deportation of Afghan Nationals With Expired Residency Cards From September 1.\nHis remarks follow revelations from the Suddeutsche Zeitung, which published an expose showing how Hamas uses staged imagery to sway international opinion. According to the investigation, professional photographers -- some working with international news agencies -- were found directing civilians to pose with empty pots and in fabricated scenarios meant to convey starvation. \"At least some of the images were presented in a false or misleading context,\" the paper concluded.\nOne such photographer, identified by Bild as Anas Zayed Fatiyeh, was hired by Turkey's state-run Anadolu Agency. Fatiyeh, according to the report, regularly posts anti-Israel content on social media, including expletive-laden messages and calls to \"Free Palestine.\" His photographs have been published in major outlets such as the BBC and CNN despite their questionable authenticity.\nAlso Read | India Points Finger at China, Turkey After Donald Trump Slaps Additional 25% Tariff Due to Russian Oil Imports.\n\"Why are German and international news agencies continuing to use his images when many are clearly biased or staged?\" Bild asked.\nThe manipulation of war photography triggered alarm within Germany's press circles. The German Journalists' Association (DJV) issued a statement warning of \"manipulation attempts through professionally produced press photography.\" DJV Chair Mika Beuster noted that \"all parties involved in this war -- including media and intelligence services -- are using the power of imagery like never before to shape public perception.\"\nA historian and visual documentation expert interviewed by Suddeutsche Zeitung added that while not all such images are outright fakes, they are often \"positioned a certain way or paired with misleading captions that tap into our visual memory and emotions.\"\nHerzog urged the international community to resist falling for such distortions. \"We do not deny the humanitarian need in Gaza,\" he said, \"but we ask the world not to fall for Hamas' lies. Condemn Hamas and tell them: You want to move forward? Release the hostages.\"\nHe emphasized that Israel has drastically increased its humanitarian aid efforts, saying, \"In the last week alone, we've brought in 30,000 tons of aid -- 30 tons by air yesterday alone. The UN has almost 800 trucks they could distribute -- and failed to do so. So a lot could have been done.\"\nA special report by The Press Service of Israel on Thursday found that according to the UN's own numbers, a staggering 85% of the aid entering the Gaza Strip by truck since May 19 has been stolen. The investigation found that a combination of black market profiteers and inflation have made much of the aid in Gaza markets unaffordable for most Palestinians.\nPalestinian sources inside Gaza told TPS-IL that much of the food in the markets originated from international aid for months -- including American shipments -- but is resold at inflated prices, sometimes 300%. Basic staples like flour and rice, originally meant for free distribution, are reportedly diverted to private vendors.\nOne Palestinian in Gaza City told TPS-IL, \"The flour -- when it enters Gaza, they steal it. And now they're going to raise the price from 30 to 60 shekels [$8.80 to $17.70]. It's unbelievable.\"\nProfessor Eytan Gilboa an expert in international relations and media at Reichman University in Herzliya, told TPS-IL, \"There is some hunger in Gaza, and it exists only in places Hamas is pursuing it, not in other areas.\"\nIn 2024, experts told TPS-IL that two Gaza-based Palestinian freelance photojournalists comitted war crimes by entering Israel during Hamas's October 7 massacres.\nHonestReporting, a Jerusalem-based media watchdog, found that freelance photographers Mohammed Fayq Abu Mostafa and Ashraf Amra entered Israel to photograph the attacks. They then returned to Khan Yunis and went on Amra's Instagram Live account and excitedly shared a video of a mob pulling an Israeli soldier out of a tank, urging Palestinians to join the attack. Mostafa's photos were published by Reuters while Amra's were credited to \"Ashraf Amra/Anadolu Agency via Getty Images.\"\nApproximately 1,200 people were killed, and 252 Israelis and foreigners were taken hostage in Hamas's attacks on Israeli communities near the Gaza border on October 7. Of the 50 remaining hostages, around 30 are believed to be dead. (ANI/TPS) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  His remarks follow revelations from the Suddeutsche Zeitung, which published an expose showing how Hamas uses staged imagery to sway international opinion. According to the investigation, professional photographers -- some working with international news agencies -- were found directing civilians to pose with empty pots and in fabricated scenarios meant to convey starvation. &quot;At least some of the images were presented in a false or misleading context,&quot; the paper concluded.","url":"https://www.latestly.com/agency-news/world-news-israeli-president-demands-truth-after-german-media-exposes-fake-gaza-photography-7046122.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806232816.jpg","video":null,"publish_date":"2025-08-07 00:26:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.124},{"id":348835720,"title":"'AS akan kenakan tarif 100 peratus ke atas semua import cip, semikonduktor kecuali...' - Trump","text":"WASHINGTON: Amerika Syarikat (AS) akan mengenakan tarif sekitar 100 peratus ke atas cip semikonduktor diimport dari negara yang tidak menghasilkannya di AS ataupun tidak merancang untuk berbuat sedemikian, kata Presiden Donald Trump.\n\nBeliau berkata, kadar tarif baharu itu akan dikenakan ke atas 'semua cip dan semikonduktor yang memasuki AS, namun tidak terpakai terhadap syarikat yang telah membuat komitmen untuk mengeluarkannya di AS.\n\n\"Jadi, tarif 100 peratus akan dikenakan ke atas semua cip dan semikonduktor yang masuk ke AS.\n\n\"Bagaimanapun jika anda telah membuat komitmen untuk membina (kilang di AS) atau jika anda sedang dalam proses membina (di AS) seperti yang dilakukan oleh banyak pihak, maka tiada tarif akan dikenakan,\" katanya kepada pemberita di Pejabat Oval, semalam.\n\nNamun, tidak jelas berapa bilangan cip yang akan terbabit bawah pelaksanaan tarif itu.\n\nPada 2022, Kongres telah meluluskan program subsidi bernilai AS$52.7 bilion bagi pengeluaran dan penyelidikan cip semikonduktor. \n\nTahun lalu, Jabatan Perdagangan bawah pentadbiran Presiden terdahulu, Joe Biden, berjaya meyakinkan kelima-lima syarikat utama semikonduktor berteknologi tinggi untuk membina kilang cip mereka di AS sebagai sebahagian daripada inisiatif itu.\n\nSebelum ini, jabatan itu melaporkan AS hanya menghasilkan kira-kira 12 peratus daripada cip semikonduktor global berbanding 40 peratus pada 1990.\n\nTrump turut memberi amaran jika mana-mana syarikat mendakwa sedang membina kilang tetapi gagal melaksanakannya, kerajaan akan mengira semula jumlah tarif tertunggak dan mengenakannya pada kemudian hari.\n\n\"Anda tetap perlu membayar dan ia pasti akan dilakukan,\" katanya.","summary":"WASHINGTON: Amerika Syarikat (AS) akan mengenakan tarif sekitar 100 peratus ke atas cip semikonduktor diimport dari negara yang tidak menghasilkannya di AS ataupun tidak merancang untuk berbuat sedemikian, kata Presiden Donald Trump.","url":"https://www.bharian.com.my/dunia/amerika/2025/08/1429820/akan-kenakan-tarif-100-peratus-ke-atas-semua-import-cip-semikonduktor","image":"https://assets.bharian.com.my/images/articles/BH7TRUMPET-O_BHfield_image_listing_featured.var_1754526091.jpg","video":null,"publish_date":"2025-08-07 00:21:37","author":"REUTERS","authors":["REUTERS"],"language":"en","source_country":"my","sentiment":-0.283},{"id":348826882,"title":"India News | Monsoon Rain to Continue in Himachal Till August 12","text":"Shimla (Himachal Pradesh) [India], August 7 (ANI): The India Meteorological Department (IMD) has issued a fresh alert warning that monsoon rains are likely to persist across Himachal Pradesh till August 12, with several districts expected to witness heavy to hefty rainfall due to the combined impact of the active southwest monsoon and a western disturbance.\nSpeaking to ANI on Wednesday, Sandeep Kumar Sharma, Senior Scientist at the IMD Centre in Shimla, said that rainfall activity has been widespread across the state over the last 24 hours.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\n\"The intensity of rain over Himachal Pradesh and Uttarakhand in the past 24 hours was due to the convergence of an active monsoon system and a western disturbance. This combination led to strong winds and localised cloud formation, which resulted in heavy to hefty rainfall in the hilly regions,\" Sharma explained.\nAccording to Sharma, heavy rainfall was recorded at isolated locations in Solan, Mandi, Kangra, Bilaspur, Sirmaur, and Chamba districts.\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\n\"Kasauli in Solan recorded the highest rainfall at 145 mm, followed by Gohar in Mandi with 120 mm. Several parts of Bilaspur also received significant rain,\" Sharma said.\nThe IMD has issued yellow alerts for heavy rainfall in districts including Bilaspur, Kangra, and Solan on August 6, while on August 7 and 8, isolated heavy rainfall is expected in Sirmaur, Solan, Shimla, and Kullu. From August 9 to 12, rainfall is expected to continue, though its intensity may slightly reduce after the 9th.\n\"The monsoon will remain active in Himachal Pradesh till August 12, with scattered rainfall continuing in different regions. Rain intensity is likely to dip marginally after the 9th, but precipitation will persist statewide,\" Sharma said.\nHe further highlighted that visibility in areas like Shimla, Solan, and Sirmaur continues to remain low due to cloud cover and ongoing rainfall.\n\"Visibility conditions in regions such as Shimla and Sirmaur have already been poor, and due to continuous rainfall and lookout cloud formation, these are expected to remain affected between August 6 and 12,\" Sharma added.\nAccording to IMD data, rainfall recorded till August 6 in Himachal Pradesh has been 77% above normal for this time of the month.\n\"Districts like Bilaspur, Solan, Una, Hamirpur, and Mandi have received up to 1.5 times more rainfall than usual so far in August,\" Sharma reported.\nOnly Lahaul-Spiti district has recorded below-normal rainfall, whereas the rest of the state has either received normal or surplus precipitation. Since the beginning of the monsoon season on June 1, the state overall has received 18% more rainfall than the seasonal average.\nFlash flood warnings were also issued recently, especially for parts of Mandi and nearby regions, due to the continuous heavy rain and increasing risk of landslides and water logging in low-lying areas. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Speaking to ANI on Wednesday, Sandeep Kumar Sharma, Senior Scientist at the IMD Centre in Shimla, said that rainfall activity has been widespread across the state over the last 24 hours.","url":"https://www.latestly.com/agency-news/india-news-monsoon-rain-to-continue-in-himachal-till-august-12-7046118.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806224750.jpg","video":null,"publish_date":"2025-08-07 00:20:31","author":null,"language":"en","source_country":"in","sentiment":-0.335},{"id":348834834,"title":"AS rancang tarif sekitar 100% terhadap import semikonduktor, kata Trump","text":"Sebelum ini, Kongres AS telah mewujudkan program subsidi USD52.7 bilion bagi pengeluaran dan penyelidikan semikonduktor pada 2022. (Gambar Pixabay)\nWASHINGTON: Amerika Syarikat (AS) akan mengenakan tarif kira-kira 100% ke atas cip semikonduktor, kata Presiden Donald Trump.\nTrump memberitahu pemberita di Pejabat Oval pada Rabu, bahawa kadar tarif baharu itu akan dikenakan ke atas 'semua cip dan semikonduktor yang memasuki AS', namun tidak terpakai kepada syarikat yang telah membuat komitmen menjalankan pembuatan di negara berkenaan.\n“Jadi, tarif 100% akan dikenakan ke atas semua cip dan semikonduktor yang masuk AS. Tetapi, jika anda telah membuat komitmen untuk membina (di AS), atau sedang dalam proses pembinaan (di AS), seperti dilakukan ramai pihak, maka tiada tarif dikenakan,” kata Trump.\nMasih belum jelas jumlah sebenar cip yang akan termasuk skop pengenaan tarif tersebut.\nSebelum ini, Kongres telah mewujudkan program subsidi USD52.7 bilion bagi pengeluaran dan penyelidikan semikonduktor pada 2022. Tahun lalu, di bawah pentadbiran Presiden Joe Biden, Jabatan Perdagangan berjaya meyakinkan kelima-lima syarikat semikonduktor termaju menempatkan kilang cip mereka di AS menjadi sebahagian program tersebut.\nTahun lalu, jabatan itu menyatakan AS hanya menghasilkan sekitar 12% cip semikonduktor di peringkat global, menurun 40% sejak 1990.\nTrump menambah: “Jika, atas apa-apa sebab, anda mengatakan sedang membina tetapi tidak membinanya, maka kami akan mengira semula, ia akan terkumpul, dan kami akan mengenakan caj pada tarikh kemudian — anda tetap perlu membayar, dan itu adalah jaminan.”","summary":"Tarif itu akan dikenakan kepada cip diimport dari negara yang tidak menghasilkannya di AS atau tidak merancang berbuat demikian.","url":"https://www.freemalaysiatoday.com/category/bahasa/tempatan/2025/08/07/as-rancang-tarif-sekitar-100-terhadap-import-semikonduktor-kata-trump","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=85,format=auto,fit=scale-down,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/08/a1f0a08b-semiconductors-chip-board-resize-pixabay-pic-040825.webp","video":null,"publish_date":"2025-08-07 00:20:27","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"my","sentiment":-0.174},{"id":348830982,"title":"Trump orders India tariff hike to 50% for buying Russian oil","text":"US President Donald Trump has issued an executive order hitting India with an additional 25% tariff over its purchases of Russian oil.\n\nThat will raise the total tariff on Indian imports to the United States to 50%, among the highest rates imposed by the US.\n\nThe new rate will come into effect in 21 days, so on 27 August, according to the executive order.\n\nA response from India's foreign ministry on Wednesday said Delhi had already made clear its stance on imports from Russia, and reiterated that the tariff is \"unfair, unjustified and unreasonable\".\n\n\"It is therefore extremely unfortunate that the US should choose to impose additional tariffs on India for actions that several other countries are also taking in their own national interest,\" the brief statement read.\n\n\"India will take all actions necessary to protect its national interests,\" it added.\n\nThe US president had earlier warned he would raise levies, saying India doesn't \"care how many people in Ukraine are being killed by the Russian War Machine\".\n\nOn Wednesday, the White House said in a statement that the \"Russian Federation's actions in Ukraine pose an ongoing threat to US national security and foreign policy, necessitating stronger measures to address the national emergency\".\n\nIt said India's imports of Russian oil undermine US efforts to counter Russia's activities in Ukraine.\n\nIt added that the US will determine which other countries import oil from Russia, and will \"recommend further actions to the President as needed\".\n\nOil and gas are Russia's biggest exports, and Moscow's biggest customers include China, India and Turkey.\n\nSpeaking later at an event in the White House, Trump took a question from the BBC on the subject and said the tariff on India was just the start - \"You're going to see a lot more, so much secondary sanctions,\" he said.\n\nThe threatened tariff hike follows meetings on Wednesday by Trump's top envoy Steve Witkoff in Moscow, aimed at securing peace between Russia and Ukraine.\n\nThe additional tariff would mean a steep 50% duty on key Indian exports like textiles, gems and jewellery, auto parts, and seafood, hitting major job-creating sectors.\n\nElectronics, including iPhones, and pharma remain exempt for now.\n\nDelhi has previously called Trump's threat to raise tariffs over its purchase of oil from Russia \"unjustified and unreasonable\".\n\nIn an earlier statement, a spokesperson for India's foreign ministry said the US had encouraged India to import Russian gas at the start of the conflict, \"for strengthening global energy markets stability\".\n\nHe said India \"began importing from Russia because traditional supplies were diverted to Europe after the outbreak of the conflict\".\n\nThe latest threatened tariff demonstrates Trump's willingness to impose sanctions related to the war in Ukraine even against nations that the US considers to be important allies or trading partners.\n\nThis could be a warning that other countries could feel a real bite if Trump ramps up those kind of sanctions once Friday's deadline passes, when the US president has threatened new sanctions on Russia and to place 100% tariffs on countries that purchase its oil.\n\nThis would not be the first time the Trump administration has imposed secondary tariffs, which are also in place to punish buyers of Venezuelan oil.\n\nIndia has previously criticised the US - its largest trading partner - for introducing the levies, when the US itself is still doing trade with Russia.\n\nLast year, the US traded goods worth an estimated $3.5bn (£2.6bn) with Russia, despite tough sanctions and tariffs.\n\nTrump and Indian Prime Minister Narendra Modi have in the past referred to each other as friends and, during Trump's first term, attended political rallies in each others' countries.\n\nBut that has not stopped Trump from hitting India with the levies, suggesting diverging interests between New Delhi and Washington.\n\nThe Federation of India Exports Organisations has called the decision to impose additional tariffs \"extremely shocking\", adding that it will hit 55% of India's exports to America.\n\nThe tariffs are expected to make Indian goods far costlier in the US, and could cut US-bound exports by 40–50%, according to the Global Trade Research Initiative (GTRI), a Delhi-based think tank.\n\n\"India should remain calm, avoid retaliation for at least six months, and recognise that meaningful trade negotiations with the US cannot proceed under threats or mistrust,\" former Indian trade official and head of GTRI, Ajay Srivastava, said.","summary":"US President Donald Trump has issued an executive order hitting India with an additional 25% tariff over its purchases of Russian oil.","url":"https://www.myjoyonline.com/trump-orders-india-tariff-hike-to-50-for-buying-russian-oil/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/08/image-492.png","video":null,"publish_date":"2025-08-07 00:18:00","author":"Abubakar Ibrahim,Bbc 18am","authors":["Abubakar Ibrahim","Bbc 18am"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.168},{"id":348826898,"title":"India News | 16 Persons Missing from Maharashtra's Jalgaon After Cloudburst in Uttarkashi","text":"Jalgaon (Maharashtra) [India], August 7 (ANI): Following the cloudburst triggered by flash floods in Uttarkashi's Dharali region in Uttarakhand earlier in the week, 16 persons from Maharashtra's Jalgaon district remain untraceable, according to Jalgaon Collector Ayush Prasad.\nProviding an update on the situation, Prasad said, \"It has been reported that 19 people from Jalgaon district are in Uttarkashi, of which contact has been established with three people. Contact has not yet been made with 16 people.\"\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nHe added that both the Maharashtra government and Jalgaon district administration are actively coordinating with the Uttarakhand government and Uttarkashi district authorities to trace the missing individuals.\nHe added, \"The Maharashtra government and district administration have tried to contact the Uttarakhand government and the Uttarkashi district administration. We are receiving full support from the Uttarakhand government.\"\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nThe flash floods, triggered by a cloudburst in the hilly region of Dharali in Uttarkashi, caused sudden surges in water levels, damaging infrastructure and disrupting road connectivity in the affected areas.\nMeanwhile, around 190 people have been rescued from Dharali following a devastating cloudburst that triggered massive flash floods and landslides in the area, with the Indian Army, Indian Air Force (IAF), along with ITBP, NDRF, SDRF, BRO and local volunteers engaged in a joint rescue and relief operation to search the missing.\nThe rescue and relief operations in the affected areas are in full swing.\nAs of 3 pm on Wednesday, there are a total of three confirmed fatalities, while 50 people are reportedly missing, according to a statement from the Indian Army.\nOver 225 Army personnel including infantry and engineering teams are on ground for search, rescue, and relief tasks. Combat engineers have reached Dharali to aid in clearing debris and restoring mobility.\nChief Minister Dhami, who visited the area earlier on Wednesday, reaffirmed that both the Centre and the state government are fully committed to making arrangements for the victims of the incident, adding that Prime Minister Narendra Modi has also assured to provide all possible help. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Providing an update on the situation, Jalgaon Collector Ayush Prasad said, &quot;It has been reported that 19 people from Jalgaon district are in Uttarkashi, of which contact has been established with three people. Contact has not yet been made with 16 people.&quot;","url":"https://www.latestly.com/agency-news/india-news-16-persons-missing-from-maharashtras-jalgaon-after-cloudburst-in-uttarkashi-7046115.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806215827.jpg","video":null,"publish_date":"2025-08-07 00:16:31","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.393},{"id":348826900,"title":"India News | BJP Stages Protest in Howrah over Alleged Attack on Suvendu Adhikari's Convoy","text":"Howrah (West Bengal) [India], August 7 (ANI): BJP leaders and workers on Wednesday held a 'slipper protest' in Howrah, West Bengal, to register their anger over the alleged attack on the convoy of Leader of the Opposition Suvendu Adhikari in Cooch Behar.\nThe protesters, carrying slippers in hand, marched to the local police station, accusing the Bengal Police of inaction and bias under the Mamata Banerjee-led government.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nBJP leader Pramod Singh, speaking at the protest, said, \"Bengal police is Mamata Banerjee's 'hawai chappal'. They kept standing there silently while the Rohingyas and Bangladeshi Muslims kept on creating a ruckus. That is why we are taking slippers with us to the police station, because we want to show them these slippers as a mirror\".\nMeanwhile, reacting to the alleged attack BJP leader Ashok Dinda on Wednesday termed the arrests made so far as \"an eyewash\" and blamed Trinamool Congress (TMC) leaders for orchestrating the violence.\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nSpeaking to ANI in Kolkata, Dinda accused TMC MLA Udayan Guha of leading the mob that targeted Adhikari's convoy and alleged that the police had deliberately refrained from arresting him.\nHe said, \"The seven people who have been arrested are just an eyewash. This is a complete failure of the police administration. Udayan Guha, who is an MLA, was leading it; he has not been arrested yet. The police do not have the courage, even the SP there does not have the courage because Udayan Guha is Mamata's special man... All these are TMC people and Rohingyas. Some people have been brought from Bangladesh...\"\nThe protest comes a day after Suvendu Adhikari's convoy was reportedly attacked in Cooch Behar.\nAdhikari on Tuesday alleged that his convoy was attacked in Cooch Behar district, and claimed the situation was grave enough that he might not have survived had he not been travelling in a bulletproof vehicle. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  The protesters, carrying slippers in hand, marched to the local police station, accusing the Bengal Police of inaction and bias under the Mamata Banerjee-led government.","url":"https://www.latestly.com/agency-news/india-news-bjp-stages-protest-in-howrah-over-alleged-attack-on-suvendu-adhikaris-convoy-7046113.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806215646.jpg","video":null,"publish_date":"2025-08-07 00:14:31","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.489},{"id":348826888,"title":"World News | 'Great Progress' Made, Says Trump After US Envoy Holds Talks with Russia","text":"Washington [US], August 7 (ANI): US President Donald Trump on Wednesday said \"great progress\" was made during a meeting between his Special Envoy, Steve Witkoff, and Russian President Vladimir Putin in Moscow in an effort to to reach a peace deal with Ukraine.\n\"My Special Envoy, Steve Witkoff, just had a highly productive meeting with Russian President Vladimir Putin. Great progress was made! Afterwards, I updated some of our European Allies. Everyone agrees this War must come to a close, and we will work towards that in the days and weeks to come,\" Trump posted on Truth Social.\nAlso Read | Mass Deportation of Afghan Refugees: Pakistan to Begin Deportation of Afghan Nationals With Expired Residency Cards From September 1.\nhttps://truthsocial.com/@realDonaldTrump/posts/114982898525988419\nUnited States special envoy Steve Witkoff held \"useful and constructive\" talks with Russian President Vladimir Putin in Moscow, days before the White House's deadline for Russia to reach a peace deal with Ukraine or face economic penalties, Al Jazeera reported.\nAlso Read | India Points Finger at China, Turkey After Donald Trump Slaps Additional 25% Tariff Due to Russian Oil Imports.\nWitkoff met Putin for about three hours on Wednesday in an effort to break the deadlock in the more than three-year war that began with Russia's full-scale invasion of Ukraine, according to Al Jazeera.\nKremlin foreign policy aide Yuri Ushakov said the two sides had exchanged \"signals\" on the Ukraine issue and discussed the possibility of developing strategic cooperation between Moscow and Washington, but declined to give further details until Witkoff had reported back to US President Donald Trump.\nRussian presidential special representative Kirill Dmitriev, who earlier greeted Witkoff and walked with him in a park, posted on social media: \"Dialogue will prevail,\" Al Jazeera reported.\nTrump has warned that he would impose sanctions on Russia if Moscow does not agree to a ceasefire in its war on Ukraine before Friday. While the White House has not specified the measures it might take, Trump has previously threatened \"secondary tariffs\" against Russia's trade partners, including India and China.\nShortly after the meeting, Trump signed an executive order imposing an additional 25 per cent tariff on goods from India over its purchase of Russian oil. The order stated that the \"actions and policies of the Government of the Russian Federation continue to pose an unusual and extraordinary threat to the national security and foreign policy of the United States,\" Al Jazeera reported.\nWhen asked on Monday what Witkoff's message to Moscow would be, and whether there was anything Russia could do to avoid sanctions, Trump told reporters, \"Yeah, get a deal where people stop getting killed.\"\nWitkoff, a real estate billionaire with no prior diplomatic experience before joining Trump's team in January, has held several lengthy meetings with Putin. Critics have portrayed him as ill-equipped for such sensitive tasks, according to Al Jazeera.\nThree previous rounds of peace talks between Russia and Ukraine in Istanbul have failed to achieve progress.\nPutin, who has consistently rejected calls for a ceasefire, said on Friday that he wants peace but that his demands for ending the nearly three-and-a-half-year offensive remain unchanged. Moscow has called for Ukraine to cede more territory and renounce Western support, including NATO membership.\nKyiv is calling for an immediate ceasefire, and Ukrainian President Volodymyr Zelenskyy last week urged allies to push for \"regime change\" in Moscow, Al Jazeera reported. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Three previous rounds of peace talks between Russia and Ukraine in Istanbul have failed to achieve progress.","url":"https://www.latestly.com/agency-news/world-news-great-progress-made-says-trump-after-us-envoy-holds-talks-with-russia-7046111.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806205413.jpg","video":null,"publish_date":"2025-08-07 00:12:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.321},{"id":348831270,"title":"Trump seeks sway over LA Olympics with new task force","text":"WASHINGTON: Donald Trump on Tuesday established a task force that he will lead on the 2028 Olympic Games in Los Angeles, a Democrat-run city that has frequently clashed with the Republican US president.\n\nThe group will engage the federal government to “ensure the Games are safe, seamless and historically successful,” potentially offering Trump and his allies greater influence over the sporting event.\n\nTrump will serve as chairman and Vice President JD Vance will be vice-chair of the task force, which will encompass several other leaders in his administration.\n\nOther members include Attorney General Pam Bondi, Homeland Security Secretary Kristi Noem and White House chief of staff Susie Wiles, who appeared alongside Trump on Tuesday.\n\nAlso present were Olympic champion gymnast Nastia Liukin and Brad Snyder, a swimmer who competed at the 2012 Paralympic Games.\n\nSigning an order to establish the group Tuesday, Trump said “we’ll do anything necessary to keep the Olympics safe” — including potentially deploying “our National Guard or military.”\n\nHe enraged Los Angeles and state officials in June with his highly unusual decision to deploy California’s National Guard against the wishes of Governor Gavin Newsom.\n\nTrump claimed the deployment was necessary to quell protests that had flared up against federal immigration raids in Los Angeles, which has a huge migrant population.\n\nOn Tuesday he doubled down on his feud with Karen Bass, the city’s Democratic mayor, by labeling her “not very competent.”\n\nTrump has previously criticized her response to wildfires that impacted Los Angeles in January.\n\nHowever, Casey Wasserman, the chairman of the 2028 LA Olympics organizing committee, gave no hints of animosity as he joined Trump for the task force announcement at the White House.\n\n“You’ve been supportive and helpful every step of the way. And we wouldn’t be here without you,” Wasserman said.\n\nLos Angeles was awarded the 2028 Olympic and Paralympic Games in September 2017, during Trump’s first term.\n\nWasserman also flattered the president with examples of gold, silver and bronze medals that were given to athletes the last time Los Angeles hosted the Games in 1984.\n\nAnd he offered Trump a chance to carry the Olympic flame — something he has already done in New York ahead of the Athens Games in 2004.\n\n“For the first time in history, we are going to take the Olympic torch relay to all 50 states,” Wasserman said.\n\n“And sir, if you’d like to run on Park Avenue again to revisit history, you’re more than welcome,” he told Trump.\n\nTrump’s second term will coincide with the 2026 FIFA World Cup and the 2028 Olympics — two major global sporting events taking place in the United States.\n\nTrump praised Gene Sykes, chair of the US Olympic and Paralympic Committee board of directors, for the USOPC’s move to effectively bar transgender women from competing in women’s sports.\n\n“The United States will not let men steal trophies from women at the 2028 Olympics,” Trump said.\n\nHe questioned why he didn’t hear applause from the room when he praised Sykes for it, and then received some claps from some people in the room.\n\nAsked about genetic testing for participating athletes, Trump said: “There will be a very, very strong form of testing and if the test doesn’t come out appropriately, they won’t be in the Olympics.” \n\nTrump “considers it a great honour to oversee this global sporting spectacle,” White House press secretary Karoline Leavitt said in a statement, calling sports one of the president’s “greatest passions.”\n\nAlong with the 2028 Summer Games, Trump has said that the 2026 World Cup being hosted by the US, Canada and Mexico is among the events he’s most looking forward to in his second term.\n\nIn preparation for next year’s competition, the governments of all three countries on Tuesday said they had held the first meeting of a trilateral coordinating council of government officials, industry leaders and security professionals discussing a variety of issues including preparedness for any security threats ahead of the World Cup.\n\nPublished in Dawn, August 7th, 2025","summary":"WASHINGTON: Donald Trump on Tuesday established a task force that he will lead on the 2028 Olympic Games in Los Angeles, a Democrat-run city that has frequently clashed with the Republican US president.\n\n\n\nThe group will engage the federal government to “ensure the Games are safe, seamless and historically successful,” potentially offering Trump and his allies greater influence over the sporting event.\n\n\n\nTrump will serve as chairman and Vice President JD Vance will be vice-chair of the task force, which will encompass several other leaders in his administration.\n\n\n\nOther members include Attorney General Pam Bondi, Homeland Security Secretary Kristi Noem and White House chief of staff Susie Wiles, who appeared alongside Trump on Tuesday.\n\n\n\nAlso present were Olympic champion gymnast Nastia Liukin and Brad Snyder, a swimmer who competed at the 2012 Paralympic Games.\n\n\n\nSigning an order to establish the group Tuesday, Trump said “we’ll do anything necessary to keep the Olympics safe” — including potentially dep","url":"https://www.dawn.com/news/1929193/trump-seeks-sway-over-la-olympics-with-new-task-force","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-08-07 00:11:17","author":"Agencies","authors":["Agencies"],"language":"en","source_country":"pk","sentiment":0.416},{"id":348831284,"title":"Putin, Witkoff hold ‘constructive’ talks ahead of US deadline","text":"MOSCOW: Russian Pres-ident Vladimir Putin held “constructive” talks with US envoy Steve Witkoff in Moscow on Wednesday, the Kremlin said, two days ahead of a US deadline for Russia to halt its Ukraine offensive or face fresh sanctions.\n\nUS President Donald Trump, who had boasted he could end the conflict within 24 hours of taking office, has given Russia until Friday to make progress towards peace or face new penalties. \n\nAfter the Moscow meeting, Trump said Witkoff made “great progress” in his meeting with Putin, and the US president updated some of Washington’s European allies after the meeting. \n\n“My Special Envoy, Steve Witkoff, just had a highly productive meeting with Russian President Vladimir Putin,” Trump said in a post on Truth Social. “Everyone agrees this War must come to a close, and we will work towards that in the days and weeks to come.” \n\nMeanwhile, Ukrainian President Volodymyr Zelensky spoke by phone with President Trump on Wednesday, a source familiar with the matter told Reuters. \n\n“A quite useful and constructive conversation took place,” Putin’s aide Yuri Ushakov told journalists after the three-hour meeting. \n\nThe Kremlin released video of Putin shaking hands with Witkoff at the start of the meeting. \n\nSanctions threat \n\nThe White House has not outlined what action it would take against Russia, but Trump has previously threatened to impose “secondary tariffs” targeting Russia’s key trade partners, such as China and India. \n\nTrump said on Tuesday that he would await the outcome of the Moscow talks before ordering any economic sanctions. “We’re going to see what happens,” he told reporters. “We’ll make that determination at that time.” \n\nWithout explicitly naming Trump, the Kremlin on Tuesday slammed “threats” to hike tariffs on Russia’s trading partners as “illegitimate”.\n\nPublished in Dawn, August 7th, 2025","summary":"MOSCOW: Russian Pres­ident Vladimir Putin held “constructive” talks with US envoy Steve Witkoff in Moscow on Wednesday, the Kremlin said, two days ahead of a US deadline for Russia to halt its Ukraine offensive or face fresh sanctions.\n\n\n\nUS President Donald Trump, who had boasted he could end the conflict within 24 hours of taking office, has given Russia until Friday to make progress towards peace or face new penalties. \n\n\n\nAfter the Moscow meeting, Trump said Witkoff made “great progress” in his meeting with Putin, and the US president updated some of Washington’s European allies after the meeting. \n\n\n\n“My Special Envoy, Steve Witkoff, just had a highly productive meeting with Russian President Vladimir Putin,” Trump said in a post on Truth Social. “Everyone agrees this War must come to a close, and we will work towards that in the days and weeks to come.” \n\n\n\nMeanwhile, Ukrainian President Volodymyr Zelensky spoke by phone with President Trump on Wednesday, a source familiar with the matter told Reuters. ","url":"https://www.dawn.com/news/1929138/putin-witkoff-hold-constructive-talks-ahead-of-us-deadline","image":"https://i.dawn.com/large/2025/08/6893d4b209b20.jpg","video":null,"publish_date":"2025-08-07 00:11:00","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":-0.2},{"id":348831274,"title":"Modi to visit China for first time in seven years","text":"NEW DELHI: Indian Prime Minister Narendra Modi will visit China for the first time in over seven years, a government source said on Wednesday, in a further sign of a diplomatic thaw with Beijing as tensions with the US rise.\n\nModi will go to China for a summit of the multilateral Shanghai Coop-eration Organisation that begins on Aug 31, the government source, with direct knowledge of the matter, said. \n\nIndia’s foreign ministry did not immediately res-pond to a request for comment.\n\nHis trip will come at a time when India’s relationship with the US faces its most serious crisis in years after President Donald Trump imposed the highest tariffs among Asian peers on goods imported from India, and has threatened an unspecified further penalty for New Del-hi’s purchases of Russian oil.\n\nModi’s visit to the Chinese city of Tianjin for the summit of the SCO will be his first since June 2018. \n\nSubsequently, Sino-Indian ties deteriorated sharply after a military clash along their disputed Himalayan border in 2020.\n\nModi and Chinese President Xi Jinping held talks on the sidelines of a BRICS summit in Russia in October that led to a thaw. \n\nMeanwhile, India’s National Security Adviser Ajit Doval is in Russia on a scheduled visit and is expected to discuss India’s purchases of Russian oil in the wake of Trump’s pressure on India to stop buying Russian crude, according to another government source, who also did not want to be named.\n\nPublished in Dawn, August 7th, 2025","summary":"NEW DELHI: Indian Prime Minister Narendra Modi will visit China for the first time in over seven years, a government source said on Wednesday, in a further sign of a diplomatic thaw with Beijing as tensions with the US rise.\n\n\n\nModi will go to China for a summit of the multilateral Shanghai Coop­eration Organisation that begins on Aug 31, the government source, with direct knowledge of the matter, said. \n\n\n\nIndia’s foreign ministry did not immediately res­pond to a request for comment.\n\n\n\nHis trip will come at a time when India’s relationship with the US faces its most serious crisis in years after President Donald Trump imposed the highest tariffs among Asian peers on goods imported from India, and has threatened an unspecified further penalty for New Del­hi’s purchases of Russian oil.\n\n\n\nModi’s visit to the Chinese city of Tianjin for the summit of the SCO will be his first since June 2018. \n\n\n\nSubsequently, Sino-Indian ties deteriorated sharply after a military clash along their disputed Himalayan border i","url":"https://www.dawn.com/news/1929136/modi-to-visit-china-for-first-time-in-seven-years","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-08-07 00:11:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.046},{"id":348826878,"title":"India News | National Handloom Day 2025 at Bharat Mandapam Today; President Murmu Will Be Chief Guest","text":"New Delhi [India], August 7 (ANI): the Ministry of Textiles will celebrate India's vibrant handloom sector on the occasion of the 11th National Handloom Day on Thursday.\nAccording to a release from the Ministry of Textiles, President, Droupadi Murmu, will grace the occasion as the Chief Guest. The Textile Minister Giriraj Singh, Union Minister of State for External Affairs & Textiles, Pabitra Margherita, Neelam Shami Rao, Secretary (Textiles) and M Beena, Development Commissioner (Handlooms) will be attending the function.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nBesides them, foreign buyers, eminent personalities, exporters, Senior Government Officers, etc., will attend the above function. Approximately 650 weavers from across the country will be attending the function.\nThe Ministry will present the Sant Kabir Handloom Award and the National Handloom Awards to recognise exceptional contributions in handloom weaving and innovation. The Sant Kabir Award, considered the highest honour in the sector, includes a cash prize of Rs 3.5 lakh, a gold coin (mounted), tamrapatra (plaque), shawl, and certificate of recognition.\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nThe National Handloom Award carries a cash prize of Rs 2 lakh, along with a tamrapatra, shawl, and certificate, and aims to honour craftsmanship, dedication, and creativity in the sector.\nAmong this year's awardees are six women weavers, one receiving the prestigious Sant Kabir Award and five the National Handloom Awards, as well as one Divyang weaver recognised for their contribution.\nThe event will also feature an exclusive exhibition showcasing award-winning weaves, the unveiling of a coffee table book by NIFT Mumbai, and a facilitation desk on various government schemes for the handloom sector.\nAccording to the release, the Handloom sector continues to be a pillar of India's rural economy and cultural identity. Employing over 35 lakh people, with more than 70% of them women, the sector is a beacon of sustainable development, women empowerment, and eco-friendly production.\nThe Swadeshi Movement launched on 7th August 1905 had encouraged indigenous industries and, in particular, handloom weavers. In 2015, Government declared the 7th of August as the National Handloom Day, commemorating the momentous occasion.\nThe first National Handloom Day was celebrated on 7th August 2015 by Prime Minister Narendra Modi in Chennai. On this day, the handloom weaving community was honoured, underlining the contribution of this sector in India's socio-economic development.\nNational Handloom Day is a celebration of the skilled hands and creative spirit that make Indian handlooms a timeless legacy. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  According to a release from the Ministry of Textiles, the President of India, Droupadi Murmu, will grace the occasion as the Chief Guest. The Textile Minister Giriraj Singh, Union Minister of State for External Affairs &amp; Textiles, Pabitra Margherita, Neelam Shami Rao, Secretary (Textiles) and M Beena, Development Commissioner (Handlooms) will be attending the function.","url":"https://www.latestly.com/agency-news/india-news-national-handloom-day-2025-at-bharat-mandapam-today-president-murmu-will-be-chief-guest-7046108.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806202719.jpg","video":null,"publish_date":"2025-08-07 00:08:30","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.542},{"id":348828376,"title":"'What if he is arrested?' GOP lawmakers worried new allegations may sink rep's reelection","text":"Some Republican lawmakers are privately weighing whether Rep. Cory Mills' (R–Fla.) latest controversy has become too politically risky to ignore, Politico reported Wednesday.\n\nThese concerns stem from a string of allegations against the Florida Republican, including an eviction notice, assault claims and now an alleged threat to release nude videos of his former partner. One of three unnamed GOP lawmakers told Politico: \"What if he is arrested for real?\"\n\nThe report further noted that President Donald Trump carried Mills’ district by about 12 percentage points in the last election, and Mills himself won reelection by an even slightly larger margin. Since national GOP strategists consider his seat secure, there’s currently little incentive for leaders to intervene as the allegations circulate, per the report.\n\nREAD MORE: 'Very jealous': Trump ally says White House secretly 'can't stand' this MAGA congresswoman\n\nMills has denied any impropriety regarding a contracting issue, which is currently under review by the House Ethics Committee. He has also rejected the newer allegations of personal threats — first surfaced in a July police report and made public this week. The third allegation was eventually dropped after the ex‑girlfriend who initially claimed assault in February withdrew her statements.\n\nAccording to the report, although GOP leaders seem willing to give Mills some space, others see a potential political quagmire developing — especially House Democrats. \n\nThe Democratic Congressional Campaign Committee (DCCC) has recently added his seat to its “Districts in Play” list for the midterms despite his strong 2024 showing, and at least three Democratic candidates have already declared their intention to run, per the report.\n\n“Floridians deserve leaders who protect people, not threaten them,” campaign challenger Noah Widmann, one of the three, told Politico.\n\nREAD MORE: 'Major trouble': Memo claims House Republicans being 'eaten alive' selling Trump's new law\n\n “Cory Mills is unfit to serve,\" he added.\n\nAlterNet reached out to Mills' office for comment.","summary":"Some Republican lawmakers are privately weighing whether Rep. Cory Mills' (R–Fla.) latest controversy has become too politically risky to ignore, Politico reported Wednesday.\n\nThese concerns stem from a string of allegations against the Florida Republican, including an eviction notice, assault claims and now an alleged threat to release nude videos of his former partner. One of three unnamed GOP lawmakers told Politico: \"What if he is arrested for real?\"\n\nThe report further noted that President Donald Trump carried Mills’ district by about 12 percentage points in the last election, and Mills himself won reelection by an even slightly larger margin. Since national GOP strategists consider his seat secure, there’s currently little incentive for leaders to intervene as the allegations circulate, per the report.\n\nREAD MORE: 'Very jealous': Trump ally says White House secretly 'can't stand' this MAGA congresswoman\n\nMills has denied any impropriety regarding a contracting issue, which is currently under review by t","url":"https://www.alternet.org/gop-mills-flordia/","image":"https://www.alternet.org/media-library/image.jpg?id=55369056&width=1200&height=600&coordinates=0%2C444%2C0%2C445","video":null,"publish_date":"2025-08-07 00:07:47","author":"Ailia Zehra","authors":["Ailia Zehra"],"language":"en","category":"politics","source_country":"us","sentiment":-0.326},{"id":348824500,"title":"PBS update amid US pressure","text":"Medicines Australia has repeatedly highlighted that Australia lags behind comparable countries in listing new medicines on the Pharmaceutical Benefits Scheme (PBS) – a list of federally subsidised medicines.\n\nIt takes an average of 466 days from when the Therapeutic Goods Administration approves a medicine to when it becomes affordable on the PBS, according to the peak body.\n\nThis is much longer than in the UK and Canada, for example.\n\nThe lengthy timeline has also angered the Pharmaceutical Research and Manufacturers of America (PhRMA), which has framed the PBS as a “non-tariff trade barrier” that harms American companies in representations to the Trump administration.\n\nLengthy PBS listing times is among PhRMA’s core criticisms.\n\nMr Butler said on Thursday he would look at Medicines Australia’s recommendations to make the “approvals system quicker”. \n\n“We’re getting an enormous number of new medicining coming on to the market,” he told the ABC. \n\n“We’re living through a turbocharged period of discovery bringing more and more new medicine, so making sure that we can assess them and approve them very quickly to get them into patients as quickly as possible is something I’ve said is a real priority for us this term.”\n\nBecause the PBS compels drugmakers to negotiate prices with the federal government, PhRMA has accused Australia of “freeloading” on US-funded research and development.\n\nMeanwhile, American consumers pick up the bill, according to the lobby group.\n\n“The medicines industry, understandably, given their interest, want to make prices higher as well, so there will be a bit of a debate about how we do that,” Mr Butler said.\n\n“But I’m very much on the page of getting medicines more quickly into our system, our PBS system.\n\n“It’s a terrific system and we’re trying to make medicines cheaper at the same time for Australians.”\n\nPhRMA has explicitly urged the Trump administration to “leverage ongoing trade negotiations” to influence Australia’s PBS policies.\n\nMr Butler has echoed Anthony Albanese and fellow senior government ministers in ruling out any “compromise” on the system as part of tariff talks.\n\nFor the moment, Donald Trump’s concern with the sector appears to be largely focused on bringing down prices in the US rather than punishing allies for having cheaper medicines.\n\nA RAND Corporation report found that Americans pay nearly four times more than Australians for medicines and about three times more than the average in other developed economies.\n\nThe answer, according to the US President, is to make pharmaceuticals in the US.\n\nIn a warning shot to firms, Mr Trump this week threatened to slap tariffs of up to 250 per cent on foreign-made products.\n\nWith Australian pharma exports to the US worth more than $2bn in 2024, it would hit producers Down Under hard.\n\nExports are mostly blood products and vaccines but also include packaged medicines and miscellaneous products, such as bandages.\n\n“We’ll be putting (an) initially small tariff on pharmaceuticals,” Mr Trump told US business news channel CNBC.\n\n“In one year, 1½ years maximum, it’s going to go to 150 per cent and then it’s going to go to 250 per cent because we want pharmaceuticals made in our country.”\n\nHe did not say what the initial rate would be, but earlier in the year he said duties on the sector would start from 25 per cent.\n\nMr Trump last week wrote to 17 major pharmaceutical companies demanding they lower their prices for American consumers and bring them in line with prices overseas.","summary":"The Albanese government is looking to make changes to a scheme Australians rely on amid pressure from lobbyists.","url":"https://www.news.com.au/lifestyle/health/health-problems/labor-looks-to-speed-up-pbs-listings-amid-calls-from-lobby-groups/news-story/55d6d81178d20c66b7d40041494e402e?from=rss-basic","image":"https://content.api.news/v3/images/bin/b170da16d8a6d7ff32f99d7427eeb4d7","video":null,"publish_date":"2025-08-07 00:07:15","author":"Joseph Olbrycht","authors":["Joseph Olbrycht"],"language":"en","category":"politics","source_country":"au","sentiment":-0.188},{"id":348826880,"title":"India News | AAP MP Ashok Kumar Mittal Calls Additional Tariffs 'illogical', Says, Will Find 'alternate Ways to Sell Products'","text":"New Delhi [India], August 7 (ANI): Aam Aadmi Party (AAP) MP Ashok Kumar Mittal on Wednesday strongly criticised United States President Donald Trump's announcement of a 25% additional tariff on Indian products, calling it \"illogical\" and accusing Washington, DC, of applying \"double standards\" in its trade policies.\nMittal defended India's purchase of oil from Russia and questioned the legitimacy of US criticism.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nMittal said, \"Yes, we are purchasing oil from Russia. Who is he to stop us? He himself is purchasing uranium, certain critical metals from Russia. His allies, European countries, are purchasing oil from Russia. China is purchasing oil from Russia...You can't have double standards, double policies. He will have to withdraw his illogical orders, illogical tariffs.\"\nMittal asserted that Indian industry is \"competent enough\" and will find \"alternative ways to sell the products.\"\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nHe said, \"The US has imposed a 50% total tariff on Indian products. Of course, this will hurt the Indian industry in the short term. But our entrepreneurs, our businessmen, our industrialists are competent enough, strong enough. They will find alternative ways to sell the products.\"\nHe suggested that the current situation could also open up new avenues for the Indian economy.\n\"We may increase consumption in India, we are 1.4 billion populations and we can find some more markets. Rather, it may give us opportunities. Indian economy is growing 6 to 8 % per year, and its effect on GDP will be maximum 0.2, meaning nothing as per our growth, and we will easily absorb this deficiency in our growth and find other ways.\"\nHis reaction comes after, US President Donald Trump on Wednesday signed an Executive Order imposing an additional 25 per cent tariff on imports from India.According to the order issued by the White House, Trump cited matters of national security and foreign policy concerns, as well as other relevant trade laws, for the increase, claiming that India's imports of Russian oil, directly or indirectly, pose an \"unusual and extraordinary threat\" to the United States.After the order, the total tariff on Indian goods will be 50 per cent.\nWhile the initial duty becomes effective on August 7, the additional levy will come into effect after 21 days and will be imposed on all Indian goods imported into the US, except for goods already in transit or those meeting specific exemptions.\nThe Executive Order also allows for modifications based on changing circumstances, including potential retaliation by other countries or steps taken by Russia or India to address the national emergency.\"\nAccordingly, and as consistent with applicable law, articles of India imported into the customs territory of the United States shall be subject to an additional ad valorem rate of duty of 25 per cent,\" the order stated.\nIndia has termed the United States' move to impose additional tariffs on India over its oil imports from Russia as \"unfair, unjustified and unreasonable.\"\nMinistry of External Affairs said New Delhi will take \"all actions necessary to protect its national interests.\"\nIn an official statement, the MEA said, \"The United States has in recent days targeted India's oil imports from Russia. We have already made clear our position on these issues, including the fact that our imports are based on market factors and done with the overall objective of ensuring the energy security of 1.4 billion people of India.\"\n\"It is therefore extremely unfortunate that the US should choose to impose additional tariffs on India for actions that several other countries are also taking in their own national interest,\" the statement added. We reiterate that these actions are unfair, unjustified and unreasonable. India will take all actions necessary to protect its national interests,\" the MEA stressed. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  While the initial duty becomes effective on August 7, the additional levy will come into effect after 21 days and will be imposed on all Indian goods imported into the US, except for goods already in transit or those meeting specific exemptions.","url":"https://www.latestly.com/agency-news/india-news-aap-mp-ashok-kumar-mittal-calls-additional-tariffs-illogical-says-will-find-alternate-ways-to-sell-products-7046106.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806203200.jpg","video":null,"publish_date":"2025-08-07 00:06:36","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.008},{"id":348824254,"title":"Trump Hikes India Levy Over Russian Oil As Tariff Deadline Looms","text":"US President Donald Trump on Wednesday ordered steeper tariffs on Indian goods over New Delhi's continued purchase of Russian oil, opening a new front in his trade wars hours before another wave of duties takes effect.The additional 25-percent tariff on Indian goods, coming into place in three weeks, stacks atop a separate 25-percent duty entering into force Thursday, taking the level to 50 percent for many products.Trump's order also threatens penalties on other countries who \"directly or indirectly\" import Russian oil, a key revenue source for Moscow's war in Ukraine.Exemptions remain however for goods targeted under sector-specific duties such as steel and aluminum, and categories that could be hit later, like pharmaceuticals and semiconductors.Smartphones are in this list of exempted products for now, shielding Apple from a major hit as the US tech titan shifts production from China to India.India's foreign ministry condemned Trump's announcement Wednesday, calling the move \"unfair, unjustified and unreasonable.\"The ministry previously said India began importing oil from Russia as traditional supplies were diverted to Europe over the war -- noting that Washington had \"actively encouraged\" such imports to strengthen \"global energy market stability.\"But Trump recently raised pressure on India over the oil purchases, threatening new tariffs as part of a campaign to force Moscow into ending its devastating invasion of Ukraine.India's national security adviser was in Moscow on Wednesday, media in New Delhi reported, coinciding with US envoy Steve Witkoff's visit.The 25-percent additional tariff is lower than the 100 percent Trump floated last month when he told Russia to end the war in Ukraine within 50 days or face massive new economic sanctions.The Republican said at the time that these would be \"secondary tariffs\" targeting Russia's remaining trade partners, seeking to impede Moscow's ability to survive already sweeping Western sanctions.\"This marks a low point in US-India relations,\" said Farwa Aamer, the Asia Society Policy Institute's director of South Asia Initiatives.She expects domestic pressure for India to accede to US demands, but said \"this will be a tough road to navigate.\"Trump has separately taken aim at Brazil over the trial of his right-wing ally, former president Jair Bolsonaro -- who is accused of planning a coup.US tariffs on various Brazilian goods surged from 10 percent to 50 percent Wednesday, although broad exemptions including for orange juice and civil aircraft are expected to soften the blow.Brazil took the first formal step Wednesday at the World Trade Organization to begin dispute proceedings against the tariffs, government sources told AFP.And come Thursday, a new wave of tariffs impacting dozens of other economies, from the European Union to Taiwan, is set to kick in.These updated \"reciprocal\" tariffs, meant to address trade practices Washington deems unfair, go up to 41 percent for Syria.US trading partners face varying increases from a current 10-percent level, starting at 15 percent for economies like the EU, Japan and South Korea.Countries not targeted by these \"reciprocal\" tariff hikes continue facing a 10-percent levy Trump imposed in April.Trump's plans have sparked a rush to avert steeper duties, with Switzerland's President Karin Keller-Sutter hurrying to Washington ahead of the Thursday deadline. It was unclear if she would meet Trump or any top economic officials.While Switzerland's key pharmaceutical sector has been spared from the incoming 39-percent duty for now, Trump has warned that future pharma tariffs could eventually rise to 250 percent.Many of Trump's sweeping tariffs also face legal challenges over his use of emergency economic powers, with the cases likely to ultimately reach the Supreme Court.Tokyo's tariffs envoy Ryosei Akazawa was also in Washington, pressing for clarity on when promised cuts to tariffs on Japan's auto imports from 25 to 15 percent would take effect.A US official said meanwhile that, unlike for the European Union, tariffs on other Japanese imports would not be capped at 15 percent but that these \"reciprocal\" levies would be added to existing ones.Japan averted threatened extra tariffs of 25 percent in a deal struck in July, but the two sides appear at odds over key details, including over Japanese investments of $550 billion into the United States.\"That's like a signing bonus that a baseball player would get,\" Trump told CNBC on Tuesday. \"It's our money to invest as we like.\"","summary":"US President Donald Trump on Wednesday ordered steeper tariffs on Indian goods over New Delhi's continued purchase of Russian oil, opening a new front in his trade wars hours before another wave of duties takes effect.","url":"https://www.ibtimes.com.au/trump-hikes-india-levy-over-russian-oil-tariff-deadline-looms-1860011","image":"https://d.ibtimes.com.au/en/full/1886645/us-president-donald-trump-signed-order-impose-added-25-percent-tariff-indian-goods-over-its.jpg?w=1600&h=900&q=88&f=af4bc7f194689c38ade6b572470590d5","video":null,"publish_date":"2025-08-07 00:06:14","author":"Beiyi Seow","authors":["Beiyi Seow"],"language":"en","source_country":"au","sentiment":-0.157},{"id":348836886,"title":"អាមេរិក ត្រៀមដាក់ប្រព័ន្ធឃ្លាំមើល តាមអាកាស ដើម្បីឲ្យមានសន្តិភាព ពិតប្រាកដរវាង កម្ពុជា-ថៃ","text":"ភ្នំពេញ ៖ អាមេរិក ត្រៀមដាក់ប្រព័ន្ធឃ្លាំមើលតាមអាកាស និងសម្ភារបច្ចេកទេសទំនើបជាច្រើនទៀត ដើម្បីចូលរួមឲ្យមានសន្តិភាព ពិតប្រាកដរវាង កម្ពុជា-ថៃ។\n\nតាមរយៈបណ្ដាញសង្គមផ្លូវការ នៅយប់ថ្ងៃទី៦ ខែសីហា ឆ្នាំ២០២៥ នាយឧត្តមសេនីយ៍ ទៀ សីហា ឧបនាយករដ្ឋមន្ត្រី រដ្ឋមន្ត្រីក្រសួងការពារជាតិកម្ពុជា បានឱ្យដឹងថា ថ្ងៃនេះ លោក បានជួបជាមួយ នាយឧត្តមនាវី Samuel Paparo មេបញ្ជាការ បញ្ជាការដ្ឋានឥណ្ឌូប៉ាស៊ីហ្វិក សហរដ្ឋអាមេរិក (USINDOPACOM) និងលោក Edgard Kagan ឯកអគ្គរដ្ឋទូតសហរដ្ឋអាមេរិក ប្រចាំនៅប្រទេសម៉ាឡេស៊ី ។\n\nក្នុងកិច្ចជំនួប លោក បានបញ្ជាក់ពីជំហរ របស់សហរដ្ឋអាមេរិក ក្នុងការគាំទ្របទឈប់បាញ់ ដែលលោកប្រធានាធិបតី Donald Trump (ដូណាល់ ត្រាំ) បានផ្តួចផ្តើម ដោយដឹកនាំពីភាគីម៉ាឡេស៊ី ជាប្រធានអាស៊ានប្តូរវេណ ក្នុងការអនុវត្តបទឈប់បាញ់ ។\n\nលោកទាំងពីរ ក៏បានបញ្ជាក់ថា «នឹងតាមដានឲ្យការអនុវត្តនេះប្រកបដោយភាពជោគជ័យ និងមានប្រសិទ្ធភាព។ លោកនឹងចូលរួមគាំទ្រ ផ្នែកភស្តុភា និងបច្ចេកទេសសំខាន់ៗ ដើម្បីបង្កើតក្រុមការងារអ្នកសង្កេតការណ៍អាស៊ាន (AMT) ឲ្យបានលឿនបំផុត»។\n\nថែមទាំង បានបង្ហាញពីអ្វីដែលជាការអនុវត្តបន្តរបស់សហរដ្ឋអាមេរិក រួមមាន៖ ការធ្វើផែនការយោធា, គ្រឿងបរិក្ខារ, ប្រព័ន្ធបញ្ជូនកម្លាំង, ប្រព័ន្ធឃ្លាំមើលតាមអាកាស និងសម្ភារបច្ចេកទេសទំនើបជាច្រើនទៀត។ ទាំងនេះបង្ហាញពីការត្រៀមខ្លួនរបស់ពួកគាត់ ក្នុងការចូលរួមឲ្យមានសន្តិភាពពិតប្រាកដ។\n\nសូមរំលឹកថា នាយឧត្តមសេនីយ៍ ទៀ សីហា បានដឹកនាំគណៈប្រតិភូយោធាជាន់ខ្ពស់ នៃកងយោធពលខេមរភូមិន្ទ ទៅចូលរួមកិច្ចប្រជុំវិសាមញ្ញ គណៈកម្មាធិការព្រំដែនទូទៅ កម្ពុជា-ថៃ (GBC) ដែលមានតំណាងមកពីប្រទេសម៉ាឡេស៊ី សហរដ្ឋអាមេរិក និងប្រទេសចិន ចូលរួមសង្កេតការណ៍ ក្នុងប្រជុំវិសាមញ្ញគណៈកម្មាធិការព្រំដែនទូទៅ (GBC) ដែលប្រព្រឹត្តទៅនៅទីក្រុង កូឡាឡាំពួរ ប្រទេសម៉ាឡេស៊ី៕\n\nRelated Items","summary":"ភ្នំពេញ ៖ អាមេរិក ត្រៀមដាក់ប្រព័ន្ធឃ្លាំមើលតាមអាកាស និងសម្ភារបច្ចេកទេសទំនើបជាច្រើនទៀត ដើម្បីចូលរួមឲ្យមានសន្តិភាព ពិតប្រាកដរវាង កម្ពុជា-ថៃ។ តាមរយៈបណ្ដាញសង្គមផ្លូវការ នៅយប់ថ្ងៃទី៦ ខែសីហា ឆ្នាំ២០២៥ នាយឧត្តមសេនីយ៍ ទៀ សីហា ឧបនាយករដ្ឋមន្ត្រី រដ្ឋមន្ត្រីក្រសួងការពារជាតិកម្ពុជា បានឱ្យដឹងថា ថ្ងៃនេះ លោក បានជួបជាមួយ នាយឧត្តមនាវី Samuel Paparo មេបញ្ជាការ បញ្ជាការដ្ឋានឥណ្ឌូប៉ាស៊ីហ្វិក សហរដ្ឋអាមេរិក (USINDOPACOM) និងលោក Edgard Kagan ឯកអគ្គរដ្ឋទូតសហរដ្ឋអាមេរិក ប្រចាំនៅប្រទេសម៉ាឡេស៊ី ។ ក្នុងកិច្ចជំនួប លោក បានបញ្ជាក់ពីជំហរ របស់សហរដ្ឋអាមេរិក ក្នុងការគាំទ្របទឈប់បាញ់ ដែលលោកប្រធានាធិបតី Donald Trump (ដូណាល់ ត្រាំ) បានផ្តួចផ្តើម ដោយដឹកនាំពីភាគីម៉ាឡេស៊ី ជាប្រធានអាស៊ានប្តូរវេណ ក្នុងការអនុវត្តបទឈប់បាញ់ ។ លោកទាំងពីរ ក៏បានបញ្ជាក់ថា «នឹងតាមដានឲ្យការអនុវត្តនេះប្រកបដោយភាពជោគជ័យ និងមានប្រសិទ្ធភាព។ លោកនឹងចូលរួមគាំទ្រ ផ្នែកភស្តុភា [&#8230;]","url":"https://dap-news.com/national/2025/08/07/527602/","image":"https://dap-news.com/wp-content/uploads/2025/08/photo_2025-08-07_07-03-05-1000x600.jpg","video":null,"publish_date":"2025-08-07 00:05:08","author":"PH104","authors":["PH104"],"language":"en","source_country":"kh","sentiment":-0.182},{"id":348826902,"title":"World News | \"Philippines and India Must Continue to Work to Strengthen Resilience of Our World Community: President Marcos","text":"New Delhi [India], August 7 (ANI): President Ferdinand Romualdez Marcos Jr. of the Philippines, on a state visit to India from August 4-8, said that that the Philippines and India must continue to work to \"strengthen the resilience\" of our world community.\nHe also emphaised global importance of India's role as \"Vishwa Bandhu\" (World's friend) and its impact on the people of Filipino.\nAlso Read | Mass Deportation of Afghan Refugees: Pakistan to Begin Deportation of Afghan Nationals With Expired Residency Cards From September 1.\n\"When Prime Minister Modi assures the world that India intends to be 'Vishwa Bandhu', a friend to the world, we Filipino people feel his and the Indian people's sincerity. Looking ahead, the Philippines and India must continue to work to strengthen the resilience of our world community. Our diplomatic initiatives must buttress the current structures of global governance. These structures must withstand geopolitical shocks, remain incredible as providers of global goods and meaningful venues for nations to find common ground.\"\nPresident Marcos on Wednesday expressed sympathy for the victims of the Uttarakhand flash floods and reaffirmed the centuries-old friendship between the two nations.\nAlso Read | India Points Finger at China, Turkey After Donald Trump Slaps Additional 25% Tariff Due to Russian Oil Imports.\n\"The Philippines is on the cusp of upper-middle income status attainable as early as next year. India, of course, can be proud of its spectacular rise under the leadership of Prime Minister Modi and the intellectual gravitas, innate talent, and industry of the Indian people rising to become the world's fourth-largest economy, and the country wielding enormous global influence as an emerging middle power,\" Marcos said.\nHe said, \"First Lady and I are elated visiting this country. As President, it is an honour to visit the largest democracy,\" while extending condolences, he said, \"Allow me to express my deepest sympathy to the Indian Nation, especially to those bereaved who lost loved ones in the flash floods in Uttarakhand yesterday.\"\nOver the past two days, the Philippines' President said that he paid his respects to Mahatma Gandhi, \"father of the nation, whose powerful ideas continue to resonate with the world over and continue to guide our lives.\"\nHighlighting his meetings with the Indian leadership, Marcos said, \"I had insightful discussions with your President and, of course, with Prime Minister Modi and other eminent officials. We expressed support and solidarity in confronting terrorism and our grief over innocent lives lost to this scourge.\"\nHe added, \"We discussed our cooperation in defense and security, and more importantly, we explored with the capital civilian businesses the path towards mutual growth and new opportunities between the Philippines and India.\"\nCalling it a fitting way to conclude the visit, he noted, \"This opportunity to share further reflections is the most fitting way to conclude this visit on the centuries-old and enduring friendship of the Philippines and the Indian people, the state of our Indo-Pacific region, and its complex challenges and uncertainties against which we must, as nations and as partners, propel forward.\"\nMarcos stressed that both nations remain \"bastions of democracy\" and are now \"amongst the most ascendant economies,\" adding, \"The Philippines is likewise determined to be a force for good.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;When Prime Minister Modi assures the world that India intends to be 'Vishwa Bandhu', a friend to the world, we Filipino people feel his and the Indian people's sincerity. Looking ahead, the Philippines and India must continue to work to strengthen the resilience of our world community. Our diplomatic initiatives must buttress the current structures of global governance. These structures must withstand geopolitical shocks, remain incredible as providers of global goods and meaningful venues for nations to find common ground.&quot;","url":"https://www.latestly.com/agency-news/world-news-philippines-and-india-must-continue-to-work-to-strengthen-resilience-of-our-world-community-president-marcos-7046104.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806193244.jpg","video":null,"publish_date":"2025-08-07 00:04:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.275},{"id":348826904,"title":"India News | Women Found Dead in Delhi's Ranhola, Estranged Husband Prime Suspect","text":"New Delhi [India], August 7 (ANI): A 50-year-old woman was found murdered in her home in Delhi's Ranhola area in the early hours of Wednesday. Police have identified her estranged husband, Parmod Jha (60), as the prime suspect in the case.\nThe police have identified the deceased as Kiran Jha.\nAlso Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nAccording to the Delhi Police, a PCR call reporting the murder was received around 4:09 am. The deceased, who worked as a caretaker for patients, had been living with her daughter-in-law Kamal Jha, granddaughter, and son Durgesh Jha.\nInitial investigation revealed that the accused, Parmod Jha, had arrived in Delhi on August 1 after nearly a decade, having been away in his native village, Chidiabad in Jamalpur city, Munger district, Bihar. Police said Kiran and Parmod had been living separately for the past ten years.\nAlso Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nDurgesh, the couple's son, currently works with a Micro Finance Company in Darbhanga, Bihar. During inquiry, Kamal, the daughter-in-law of the deceased, informed police that the accused had not been in contact with the family for years and was unemployed.\nCCTV footage from the Delhi government's camera installed outside the residence reportedly captured the accused leaving the premises at approximately 12:50 am, hours before the murder was discovered.\nCrime and forensic teams were promptly dispatched to the scene. The crime scene has been secured, and the weapon of offence has been recovered from the room where the incident occurred.\nPolice have launched a manhunt to trace the accused and have deployed teams to major railway stations and bus terminals across the city. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  According to the Delhi Police, a PCR call reporting the murder was received around 4:09 am. The deceased, who worked as a caretaker for patients, had been living with her daughter-in-law, Kamal Jha, granddaughter, and son, Durgesh Jha.","url":"https://www.latestly.com/agency-news/india-news-women-found-dead-in-delhis-ranhola-estranged-husband-prime-suspect-7046102.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806192054.jpg","video":null,"publish_date":"2025-08-07 00:02:32","author":null,"language":"en","source_country":"in","sentiment":-0.228},{"id":348830252,"title":"Trump team keeps finding new ways to turn the world against the US","text":"There’s a new development in the Trump administration’s full-court press to bar foreigners from coming to the United States: Why not charge foreign tourists an exorbitant amount of money to visit here? The State Department announced this grand plan on Tuesday, calling it a “pilot” program that will be in effect for one year. \n\nOstensibly, this is targeted at countries with high visa overstay rates. The notion is that visitors will pay a bond of no less than $5,000 and as high as $15,000. Consular officers get to set the bond based on “any information provided by the visa applicant on the visa application or in the visa interview regarding the alien’s purpose of travel, current employment, income, skills, and education.” \n\nThis new extortion racket isn’t grounded in any law. The official publication of the rule in the Federal Register justifies this only by referencing President Donald Trump’s numerous executive orders as if they were law. So, when Trump popped off with his racist “Protecting the American People Against Invasion” executive order on Day 1 of his second term, the whole of the federal government tilted toward restricting immigration. Now, apparently, those efforts have turned to restricting visitors. \n\nRelated | Trump’s disastrous trade war is killing US tourism\n\nThe first two countries that the administration has arbitrarily decided will be included in the pilot program are Malawi and Zambia. According to the administration, this is based on their overstay rate from DHS’s 2023 report. Except, as NBC pointed out, those two countries are not the top overstayers noted in that report—that would be Laos. Haiti, and Chad. However, people from those countries are already barred from coming here thanks to Trump’s travel ban 2.0, so apparently Secretary of State Marco Rubio had to go down the list to find other countries to target. \n\nOf course, like all things immigration-related in the Trump administration, the countries that will be included in this pay-for-play arrangement can change at any time. Another fun fact: If someone here on a tourist visa decides to apply for asylum or any other nonimmigrant status, that’s a breach of the bond conditions and the government gets to keep the bond money. \n\nAll of this fits with Trump’s other isolationist, nativist actions. He’s tried to bar Harvard from enrolling international students. The courts have blocked those efforts, but never fear: the administration’s “settlement” with Columbia University requires the school to decrease international student enrollment. \n\nThis push to drive out international students is catastrophically bad for higher education and the economy. Over 1.1 million international students contributed $44 billion to the economy during the 2023-2024 school year. That’s on top of the hit the economy is taking from Trump’s haphazard and capricious trade war and tariffpalooza. There’s already a significant decline in international tourism, and we’re on track to lose $29 billion from that. \n\nRubio continues to be one of Trump’s most loyal foot soldiers, helping him isolate the United States and withdraw us from the global community. The secretary of state stepped up to keep America safe by refusing to issue visas to a Venezuelan Little League team and the Cuban national women’s volleyball team. But at least we’re letting in white South Africans, the only “refugees” Trump acknowledges. \n\nAs for the administration’s latest xenophobic ploy, which countries are subject to the bond requirement can change at any time—and everyone knows full well that countries will be added to and removed from this list based on how much they do or do not suck up to Trump. Meanwhile, foreign visitors of all stripes are going to keep passing us by, because who wants to deal with any of this?","summary":"There’s a new development in the Trump administration’s full-court press to bar foreigners from coming to the United States: Why not charge foreign tourists an exorbitant amount of money to visit here? The State Department announced this grand plan on Tuesday, calling it a “pilot” program that will be in effect for one year. \n\n\n\nOstensibly, this is targeted at countries with high visa overstay rates. The notion is that visitors will pay a bond of no less than $5,000 and as high as $15,000. Consular officers get to set the bond based on “any information provided by the visa applicant on the visa application or in the visa interview regarding the alien’s purpose of travel, current employment, income, skills, and education.” \n\n\n\nThis new extortion racket isn’t grounded in any law. The official publication of the rule in the Federal Register justifies this only by referencing President Donald Trump’s numerous executive orders as if they were law. So, when Trump popped off with his racist “Protecting the American ","url":"https://www.dailykos.com/story/2025/8/6/2336980/-Trump-team-keeps-finding-new-ways-to-turn-the-world-against-the-US?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1464525/story_image/AP25192346128619.jpg?1754439068","video":null,"publish_date":"2025-08-07 00:01:17","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","source_country":"US","sentiment":0.111},{"id":348826896,"title":"India News | Uttarkashi Flash Floods: 190 People Rescued from Dharali; Centre Assures Help as Multi Agency Op Underway","text":"Uttarkashi (Uttarakhand) [India], August 7 (ANI): Around 190 people have been rescued from Dharali following a devastating cloudburst that triggered massive flash floods and landslides in the area, with the Indian Army, Indian Air Force (IAF), along with ITBP, NDRF, SDRF, BRO and local volunteers engaged in a joint rescue and relief operation to search the missing. The rescue and relief operations in the affected areas are in full swing. Also Read | Donald Trump Imposes Additional 25% Tariff on India: Industrialist Anand Mahindra Says 'India Must Seize This Moment to Become Greater Than Ever'.\nAs of 3 pm on Wednesday, there are a total of three confirmed fatalities, while 50 people are reportedly missing, according to a statement from the Indian Army. Over 225 Army personnel including infantry and engineering teams are on ground for search, rescue, and relief tasks. Combat engineers have reached Dharali to aid in clearing debris and restoring mobility. Also Read | Betting App Case: Tollywood Actor Vijay Deverakonda Appears Before ED, Says 'I Just Endorsed Gaming App'.\nChief Minister Dhami, who visited the area earlier on Wednesday, reaffirmed that both the Centre and the state government are fully committed to making arrangements for the victims of the incident, adding that Prime Minister Narendra Modi has also assured to provide all possible help. He stated that the disaster has hit the entire Dharali. Notably, Dharali is the main stopover on way to Gangotri and is home to lots of hotels and restaurants. The Chief Minister said, \"The disaster has completely hit the entire Dharali, and after yesterday's incident, debris has come there in several phases. I went there today and met the people, talked to them and took information about the incident. The disaster destroyed everything. Along with this, until evening, the army personnel have rescued about 190 people from Dharali. They have been taken to safe places. Right now the injured are also being rescued from there and brought to Uttarkashi...\"\nChief Minister Dhami further stated that the road connecting several areas has also been affected by landslides. He added that the administration is working to restore the facilities in the area.\nHe said, \"The entire connecting road has been completely affected by landslides at many places... We also have to restore the electricity and mobile networks in the area. Because of the bad weather, restoring the facilities completely is a challenge for us. Earlier today (Wednesday), I attempted to go there two times and on the third time, I finally went to meet the victims. The government is fully committed to making all the arrangements. The Prime Minister has also assured us to provide all possible help, and under his guidance, we will help the disaster victims properly...\" Chief Minister Dhami visited the affected region and reviewed ongoing relief and rescue efforts. He reached the site and met with affected families and directed officials to ensure the timely delivery of relief material and assistance.\nA CMO statement stated that both central and state agencies are working on a war footing to carry out relief and rescue operations in the area. Prime Minister Narendra Modi spoke to Chief Minister Dhami to take stock of the situation. He also assured all possible support from the central government. Prime Minister Modi assured all possible assistance from the central government. The CMO statement posted on X, said, \"Prime Minister Shri Narendra Modi also spoke with Chief Minister Shri Pushkar Singh Dhami over the phone this morning to gather updated information on the natural disaster in the Dharali area and the ongoing relief and rescue operations.\" \"The Chief Minister informed the Prime Minister that the state government is fully committed to the relief and rescue operations with utmost diligence. Continuous heavy rainfall is causing difficulties in some areas, but all relevant agencies are working in coordination to ensure prompt assistance to the affected people. The Prime Minister assured all possible support from the central government,\" the post added. CM Dhami also held a disaster management meeting at the State Emergency Operations Centre (EOC) to assess the cloudburst and flash flood in Uttarkashi's Dharali on Wednesday. The Chief Minister met disaster victims of Dharali at Uttarkashi PWD Guest House. CM Dhami emphasised that all possible efforts are being made to airlift people to safer locations safely. Mahendra Chauhan, a victim of the Dharali cloudburst, shared that his sister, her husband, and their child have been missing since the incident, and he has been unable to contact them. Mahendra Chauhan said, \"CM Dhami has assured that very soon, heli services will be started so that people can be rescued from the spot. My sister, her husband and their child have been missing since yesterday. After this incident, I have not been able to speak to them...\" Another victim from Dharali village reported that his younger brother and his family are also missing, \"I am from Dharali village and my younger brother and his family have been missing since yesterday. CM Dhami stated that we are awaiting an improvement in the weather to airlift people to safer locations. CM has assured us that all possible efforts are being made to rescue the people safely...\" As per the Indian Army, military helipad at Harsil is operational. Three civil helicopters launched from Sahastradhara in coordination with SDRF have successfully landed at Bhatwari and Harsil for casualty evacuation and relief material delivery. As of 3 pm, 7 teams of the Indian Army are operating with Reeco Radar near Tekla while search and rescue dogs are deployed at Harsil; more are en route from Remount and Veterinary Centres.\nChinook, Mi-17, ALH helicopters are on standby at Jolly Grant, Chandigarh, and Sarsawa for troop and material airlift - awaiting tasking clearance.\nA total of 9 personnel are also missing, including one Junior Commissioned Officer (JCO) and 8 jawans. In a significant infrastructural damages, key road stretches near Bartwari, Linchigad, and Gangrani have been washed away, severely affecting movement. Civil helipad at Dharali remains non-functional due to a mudslide.\nAccording to the Indian Air Force, Mi-17 helicopters and ALH Mk-III aircraft stationed at Bareilly have been placed on high alert. Additionally, An-32 and C-295 transport aircraft from Agra have landed in Dehradun to support the mission in the flood-affected areas.\nThe statement read, \"The Indian Air Force has swung into action in response to the flash flood in Harsil, which has isolated the valley. Mi-17s and ALH Mk-III, at Bareilly, are on high alert and An-32s, C-295s, from Agra, have landed at Dehradun for the mission in the affected areas.\"\nAir Force stations in Agra and Bareilly were activated overnight to load relief and rescue material and to coordinate with Indian Army personnel for deployment in the rescue missions.\nDespite dense fog and persistent rainfall hampering flight operations in the morning hours, the IAF stated that a brief improvement in visibility is being utilised to conduct sorties.\n\"Air Force stations at Agra and Bareilly were activated during the night for loading relief and rescue material, along with preparing the IAF and Indian Army, for the rescue missions. Though the dense fog and rain were restricting flying in the morning, the small window of improved visibility is being exploited by the IAF for this joint civil-military operation to address the disaster,\" the statement added.\nMeanwhile, the district administration of Uttarkashi has announced a holiday for all government and private schools and Anganwadi centre in the district in the wake of prediction of heavy rainfall in the district on August 7. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Around 190 people have been rescued from Dharali following a devastating cloudburst that triggered massive flash floods and landslides in the area, with the Indian Army, Indian Air Force (IAF), along with ITBP, NDRF, SDRF, BRO and local volunteers engaged in a joint rescue and relief operation to search the missing.","url":"https://www.latestly.com/agency-news/india-news-uttarkashi-flash-floods-190-people-rescued-from-dharali-centre-assures-help-as-multi-agency-op-underway-7046100.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250806183521.jpg","video":null,"publish_date":"2025-08-07 00:00:37","author":null,"language":"en","source_country":"in","sentiment":-0.15},{"id":348835214,"title":"Inside the Trump Family’s Money-Making Machine","text":"Massa: There’s a sense that many are overwhelmed or kind of inured almost to the scale of the money-making happening. And the question that I have is whether the resistance that’s out there — and there is some, there have been democratic lawmakers who’ve, for example, spoken out against the meme coin — but has there been a unified front to shut it down in some way? Would that even be viable? So, I guess the lingering question is whether there’s any force that could really resist a money-making machine with this many different arms.Abelson: My mind is going to the changes that are happening in the United States government where a fellow billionaire, Elon Musk, was called in by Trump to help reshape the government. And that’s like, it’s not an abstract thing. And it includes the agencies and offices that oversee Trump’s own public company. And it includes the agencies and offices that oversee his crypto projects. It even includes the people who oversee the actual conflicts of interest themselves. So, we’re not necessarily in the business of predicting the future, but I’m betting that it’s going to become harder and not easier to understand what people in power are doing and how people in power are making money. And I am not specifically referring to Donald Trump. I think it’s going to be true of Republicans and Democrats, and I think it will take a kind of concerted effort to reverse some of the things that have happened in these past few months.","summary":"On today’s Big Take podcast: How President Trump has more than doubled his net worth since announcing his reelection campaign in 2022.","url":"https://financialpost.com/pmn/business-pmn/inside-the-trump-familys-money-making-machine","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/776362016.jpg","video":null,"publish_date":"2025-08-06 23:57:54","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.381},{"id":348833248,"title":"Trump admin axes Biden approval of ‘irresponsible’ wind farm in Idaho","text":"The Trump administration on Wednesday canceled a major wind farm development in Idaho, a project approved late in former President Joe Biden’s term that had drawn criticism for its proximity to a historic site where Japanese Americans were incarcerated during World War II.\n\nThe Bureau of Land Management in December signed off on a scaled-down plan for the Lava Ridge Wind Project northeast of Twin Falls, with 241 wind turbines instead of 400. But the development had been on hold since the first day of President Donald Trump’s second term, when he issued an executive order halting the permitting of wind power projects across the country and telling the Interior Department to review the Lava Ridge decision.\n\n“By reversing the Biden administration’s thoughtless approval of the Lava Ridge Wind Project, we are protecting tens of thousands of acres from harmful wind policy while shielding the interests of rural Idaho communities,” Interior Secretary Doug Burgum said in a statement. “This decisive action defends the American taxpayer, safeguards our land, and averts what would have been one of the largest, most irresponsible wind projects in the nation.”\n\nThe project, five years in the works, faced opposition from local residents concerned about the height of the turbines — up to 660 feet (201 meters), or more than twice the height of the Statue of Liberty. It also drew concerns it would spoil views from the Minidoka National Historic Site, where thousands of Japanese Americans were imprisoned during World War II.\n\nUnder the plan, the closest turbine to the historic site would have been 9 miles (14 kilometers) away.\n\nRobyn Achilles, executive director of the nonprofit Friends of Minidoka, said in a text message her organization was reviewing the announcement.\n\n“We must protect Minidoka from future development, so we continue to seek long term protections for the BLM land in Minidoka’s cultural viewshed,” Achilles wrote.\n\nThe Interior Department’s statement rescinding Lava Ridge’s approval did not mention Minidoka. A spokeswoman for the company that proposed the development, Magic Valley Energy, did not immediately return messages seeking comment.\n\nThe Bureau of Land Management said when it approved the project that it could power up to 500,000 homes and that its decision reflected “a careful balance of clean energy development with the protection of natural, cultural, and socioeconomic resources on this historically significant landscape.”\n\nOnshore wind is one of the cheapest sources of electricity generation. New wind farms cost less to build and operate than new natural gas plants on average in most regions of the United States, even without tax credits.\n\nThe Trump administration and congressional Republicans have targeted wind and solar projects as expensive and unreliable while taking steps to support the burning of fossil fuels, which is dangerously heating the planet.\n\nRenewable energies such as wind and solar provide an intermittent supply of electricity when it is windy or sunny. Increasingly, batteries are getting paired with solar and wind projects to allow renewables to replace fossil fuels like oil, gas and coal, while keeping a steady flow of power when sources such as wind and solar are not producing.\n\nThe tax-and-spending legislation signed by Trump last month phases out tax credits and other subsidies for clean energy, and an executive order issued by Trump a few days later further restricts subsidies for what he calls “the Green New Scam.”\n\nSince then, Burgum has issued a series of memos targeting wind and solar power, including a July 17 memo that requires his personal approval of all solar and wind energy projects on federal lands and waters. The order authorizes Burgum to conduct “elevated review” of activities ranging from leases to rights of way, construction and operational plans, grants and biological opinions.\n\nThe restrictions on clean-energy projects are aimed at “ending preferential treatment for unreliable, subsidy-dependent wind and solar energy,” the Interior Department said in a statement.\n\nLate last month, Burgum canceled plans to use millions of acres of federal waters for new offshore wind development.\n\nAnd earlier this week, he issued a new secretarial order requiring that Interior agencies evaluating new wind and solar consider “capacity density,” or how much area the projects cover. Commercial-scale solar and wind projects typically require a much greater amount of land and water than other energy sources such as oil and natural gas.\n\n“This isn’t oversight,” said Jason Grumet, CEO of the American Clean Power Association, which represents the renewable industry. “It’s obstruction that will needlessly harm the fastest growing sources of electric power.”","summary":"The Bureau of Land Management in December signed off on a scaled-down plan for the Lava Ridge Wind Project northeast of Twin Falls, with 241 wind turbines instead of 400.","url":"https://nypost.com/2025/08/06/us-news/trump-admin-axes-biden-approval-of-irresponsible-wind-farm-in-idaho/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-jrp1f56ch-1754524032742.jpg?quality=75&strip=all&1754509662&w=1200","video":"https://cdn.jwplayer.com/videos/qkFcqvGv-RyIcpnTz.mp4","publish_date":"2025-08-06 23:57:45","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"zm","sentiment":-0.373},{"id":348825046,"title":"US is auctioning a seized $325M Russian yacht with 8 state rooms, a helipad, a gym and a spa","text":"By FATIMA HUSSEIN\n\nWASHINGTON (AP) — The United States is auctioning off the $325 million yacht Amadea, its first sale of a seized Russian luxury ship since the start of Moscow’s invasion of Ukraine.\n\nThe auction, which closes Sept. 10, comes as President Donald Trump seeks to increase pressure on Russian President Vladimir Putin to end the war. The U.S. has said it’s working with allies to put pressure on Russian oligarchs, some of whom are close to Putin and have had their yachts seized, to try to compel him to stop the war.\n\nThe 348-foot-long yacht, seized three years ago and currently docked in San Diego, was custom built by the German company Lürssen in 2017. Designed by François Zuretti, the yacht features an interior with extensive marble work, eight state rooms, a beauty salon, a spa, a gym, a helipad, a swimming pool and an elevator. It accommodates 16 guests and 36 crew members.\n\nDetermining the real ownership of the Amadea has been an issue of contention because of an opaque trail of trusts and shell companies. The yacht is registered in the Cayman Islands and is owned by Millemarin Investments Ltd., also based in the Cayman Islands.\n\nThe U.S. contends that Suleiman Kerimov, an economist and former Russian politician, who was sanctioned by the U.S. in 2018 for alleged money laundering, owns the yacht. Meanwhile, Eduard Khudainatov, a former chairman and chief executive of the state-controlled Russian oil and gas company Rosneft, who has not been sanctioned, claims to own it.\n\nU.S. prosecutors say Khudainatov is a straw owner of the yacht, intended to conceal the yacht’s true owner, Kerimov. Litigation over the true ownership of the yacht is ongoing.\n\nA representative of Khudainatov said in an emailed statement Wednesday that the planned sale of the yacht is “improper and premature” since Khudainatov is appealing a forfeiture ruling.\n\n“We doubt it will attract any rational buyer at fair market price, because ownership can, and will, be challenged in courts outside the United States, exposing purchasers to years of costly, uncertain litigation,” said the representative, Adam Ford.\n\nThe yacht has been virtually untouched since the National Maritime Services took custody of it in 2022. To submit a sealed bid on it, bidders must put in a 10 million euro deposit, the equivalent of roughly $11.6 million, to be considered.\n\nFord said Khudainatov would go after any proceeds from the sale of the yacht, estimated to be worth $325 million.\n\n“Should the government press ahead simply to staunch the mounting costs it is imposing on the American taxpayer, we will pursue the sale proceeds, and any shortfall from fair market value, once we prevail in court,” Ford said.\n\nA U.S. aid package for Ukraine signed into law in May 2024 gave the U.S. the ability to seize Russian state assets located in the U.S. and use them for the benefit of Kyiv, which was attacked by Russia in February 2022.","summary":"The Amadea was seized three years ago and is docked in San Diego.","url":"https://www.sandiegouniontribune.com/2025/08/06/us-superyacht-russia/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/Superyacht_Russia_60036.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-06 23:57:42","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.022},{"id":348825316,"title":"US is auctioning a seized $325M Russian yacht with 8 state rooms, a helipad, a gym and a spa","text":"By FATIMA HUSSEIN\n\nWASHINGTON (AP) — The United States is auctioning off the $325 million yacht Amadea, its first sale of a seized Russian luxury ship since the start of Moscow’s invasion of Ukraine.\n\nThe auction, which closes Sept. 10, comes as President Donald Trump seeks to increase pressure on Russian President Vladimir Putin to end the war. The U.S. has said it’s working with allies to put pressure on Russian oligarchs, some of whom are close to Putin and have had their yachts seized, to try to compel him to stop the war.\n\nThe 348-foot-long yacht, seized three years ago and currently docked in San Diego, was custom built by the German company Lürssen in 2017. Designed by François Zuretti, the yacht features an interior with extensive marble work, eight state rooms, a beauty salon, a spa, a gym, a helipad, a swimming pool and an elevator. It accommodates 16 guests and 36 crew members.\n\nDetermining the real ownership of the Amadea has been an issue of contention because of an opaque trail of trusts and shell companies. The yacht is registered in the Cayman Islands and is owned by Millemarin Investments Ltd., also based in the Cayman Islands.\n\nThe U.S. contends that Suleiman Kerimov, an economist and former Russian politician, who was sanctioned by the U.S. in 2018 for alleged money laundering, owns the yacht. Meanwhile, Eduard Khudainatov, a former chairman and chief executive of the state-controlled Russian oil and gas company Rosneft, who has not been sanctioned, claims to own it.\n\nU.S. prosecutors say Khudainatov is a straw owner of the yacht, intended to conceal the yacht’s true owner, Kerimov. Litigation over the true ownership of the yacht is ongoing.\n\nA representative of Khudainatov said in an emailed statement Wednesday that the planned sale of the yacht is “improper and premature” since Khudainatov is appealing a forfeiture ruling.\n\n“We doubt it will attract any rational buyer at fair market price, because ownership can, and will, be challenged in courts outside the United States, exposing purchasers to years of costly, uncertain litigation,” said the representative, Adam Ford.\n\nThe yacht has been virtually untouched since the National Maritime Services took custody of it in 2022. To submit a sealed bid on it, bidders must put in a 10 million euro deposit, the equivalent of roughly $11.6 million, to be considered.\n\nFord said Khudainatov would go after any proceeds from the sale of the yacht, estimated to be worth $325 million.\n\n“Should the government press ahead simply to staunch the mounting costs it is imposing on the American taxpayer, we will pursue the sale proceeds, and any shortfall from fair market value, once we prevail in court,” Ford said.\n\nA U.S. aid package for Ukraine signed into law in May 2024 gave the U.S. the ability to seize Russian state assets located in the U.S. and use them for the benefit of Kyiv, which was attacked by Russia in February 2022.","summary":"The Amadea was seized three years ago and is docked in San Diego.","url":"https://www.ocregister.com/2025/08/06/us-superyacht-russia/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/Superyacht_Russia_60036.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-06 23:57:42","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":-0.022},{"id":348831554,"title":"US is auctioning a seized $325M Russian yacht with 8 state rooms, a helipad, a gym and a spa","text":"By FATIMA HUSSEIN\n\nWASHINGTON (AP) — The United States is auctioning off the $325 million yacht Amadea, its first sale of a seized Russian luxury ship since the start of Moscow’s invasion of Ukraine.\n\nThe auction, which closes Sept. 10, comes as President Donald Trump seeks to increase pressure on Russian President Vladimir Putin to end the war. The U.S. has said it’s working with allies to put pressure on Russian oligarchs, some of whom are close to Putin and have had their yachts seized, to try to compel him to stop the war.\n\nThe 348-foot-long yacht, seized three years ago and currently docked in San Diego, was custom built by the German company Lürssen in 2017. Designed by François Zuretti, the yacht features an interior with extensive marble work, eight state rooms, a beauty salon, a spa, a gym, a helipad, a swimming pool and an elevator. It accommodates 16 guests and 36 crew members.\n\nDetermining the real ownership of the Amadea has been an issue of contention because of an opaque trail of trusts and shell companies. The yacht is registered in the Cayman Islands and is owned by Millemarin Investments Ltd., also based in the Cayman Islands.\n\nThe U.S. contends that Suleiman Kerimov, an economist and former Russian politician, who was sanctioned by the U.S. in 2018 for alleged money laundering, owns the yacht. Meanwhile, Eduard Khudainatov, a former chairman and chief executive of the state-controlled Russian oil and gas company Rosneft, who has not been sanctioned, claims to own it.\n\nU.S. prosecutors say Khudainatov is a straw owner of the yacht, intended to conceal the yacht’s true owner, Kerimov. Litigation over the true ownership of the yacht is ongoing.\n\nA representative of Khudainatov said in an emailed statement Wednesday that the planned sale of the yacht is “improper and premature” since Khudainatov is appealing a forfeiture ruling.\n\n“We doubt it will attract any rational buyer at fair market price, because ownership can, and will, be challenged in courts outside the United States, exposing purchasers to years of costly, uncertain litigation,” said the representative, Adam Ford.\n\nThe yacht has been virtually untouched since the National Maritime Services took custody of it in 2022. To submit a sealed bid on it, bidders must put in a 10 million euro deposit, the equivalent of roughly $11.6 million, to be considered.\n\nFord said Khudainatov would go after any proceeds from the sale of the yacht, estimated to be worth $325 million.\n\n“Should the government press ahead simply to staunch the mounting costs it is imposing on the American taxpayer, we will pursue the sale proceeds, and any shortfall from fair market value, once we prevail in court,” Ford said.\n\nA U.S. aid package for Ukraine signed into law in May 2024 gave the U.S. the ability to seize Russian state assets located in the U.S. and use them for the benefit of Kyiv, which was attacked by Russia in February 2022.","summary":"The Amadea was seized three years ago and is docked in San Diego.","url":"https://www.twincities.com/2025/08/06/us-superyacht-russia/","image":"https://www.twincities.com/wp-content/uploads/2025/08/Superyacht_Russia_60036.jpg?w=1024&h=682","video":null,"publish_date":"2025-08-06 23:57:42","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.022},{"id":348823684,"title":"US is auctioning a seized $325M Russian yacht with 8 state rooms, a helipad, a gym and a spa","text":"By FATIMA HUSSEIN\n\nWASHINGTON (AP) — The United States is auctioning off the $325 million yacht Amadea, its first sale of a seized Russian luxury ship since the start of Moscow’s invasion of Ukraine.\n\nThe auction, which closes Sept. 10, comes as President Donald Trump seeks to increase pressure on Russian President Vladimir Putin to end the war. The U.S. has said it’s working with allies to put pressure on Russian oligarchs, some of whom are close to Putin and have had their yachts seized, to try to compel him to stop the war.\n\nThe 348-foot-long yacht, seized three years ago and currently docked in San Diego, was custom built by the German company Lürssen in 2017. Designed by François Zuretti, the yacht features an interior with extensive marble work, eight state rooms, a beauty salon, a spa, a gym, a helipad, a swimming pool and an elevator. It accommodates 16 guests and 36 crew members.\n\nDetermining the real ownership of the Amadea has been an issue of contention because of an opaque trail of trusts and shell companies. The yacht is registered in the Cayman Islands and is owned by Millemarin Investments Ltd., also based in the Cayman Islands.\n\nThe U.S. contends that Suleiman Kerimov, an economist and former Russian politician, who was sanctioned by the U.S. in 2018 for alleged money laundering, owns the yacht. Meanwhile, Eduard Khudainatov, a former chairman and chief executive of the state-controlled Russian oil and gas company Rosneft, who has not been sanctioned, claims to own it.\n\nU.S. prosecutors say Khudainatov is a straw owner of the yacht, intended to conceal the yacht’s true owner, Kerimov. Litigation over the true ownership of the yacht is ongoing.\n\nA representative of Khudainatov said in an emailed statement Wednesday that the planned sale of the yacht is “improper and premature” since Khudainatov is appealing a forfeiture ruling.\n\n“We doubt it will attract any rational buyer at fair market price, because ownership can, and will, be challenged in courts outside the United States, exposing purchasers to years of costly, uncertain litigation,” said the representative, Adam Ford.\n\nThe yacht has been virtually untouched since the National Maritime Services took custody of it in 2022. To submit a sealed bid on it, bidders must put in a 10 million euro deposit, the equivalent of roughly $11.6 million, to be considered.\n\nFord said Khudainatov would go after any proceeds from the sale of the yacht, estimated to be worth $325 million.\n\n“Should the government press ahead simply to staunch the mounting costs it is imposing on the American taxpayer, we will pursue the sale proceeds, and any shortfall from fair market value, once we prevail in court,” Ford said.\n\nA U.S. aid package for Ukraine signed into law in May 2024 gave the U.S. the ability to seize Russian state assets located in the U.S. and use them for the benefit of Kyiv, which was attacked by Russia in February 2022.","summary":"The Amadea was seized three years ago and is docked in San Diego.","url":"https://www.bostonherald.com/2025/08/06/us-superyacht-russia/","image":"https://www.bostonherald.com/wp-content/uploads/2025/08/Superyacht_Russia_60036.jpg?w=1024&h=682","video":null,"publish_date":"2025-08-06 23:57:42","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.022}]}