{"offset":0,"number":50,"available":4600,"news":[{"id":260127118,"title":"Elon Musk hosts his inaugural independent event backing Trump in Philadelphia’s suburban area","text":"FOLSOM, Pa. – Elon Musk held his first solo event in support of Donald Trump for president on Thursday, encouraging voters in the Philadelphia suburbs to register to cast their ballots and vote early, though some attendees shouted back, “Why?”\n\nThe America PAC event at Ridley High School’s auditorium in Folsom featured the world’s richest man speaking onstage in front of a large U.S. flag for roughly 15 minutes before taking questions from the crowd, many of whom wore “Make America Great Again” hats.\n\nThe event was billed as a call to action to vote early in the crucial battleground state of Pennsylvania, where Trump and Democratic Vice President Kamala Harris are fiercely contesting the election. Some in the crowd questioned Musk’s entreaties to vote early, reflecting the possibility that Republicans are still persuading their supporters to embrace early voting after Trump spent years demonizing the method.\n\nThe crowd rose to its feet and took cellphone videos as Musk, the billionaire founder of Tesla and Space X and owner of the social media platform X, walked onstage. They remained standing during his remarks and cheered loudly after he said the U.S. Constitution needs to be upheld.\n\n“This is literally the fundamental values that made America what it is today. And anyone who is against those things is fundamentally anti-American and to hell with them,” said Musk, who was born in South Africa. The crowd erupted.\n\nHe exhorted the crowd to make sure they and their friends and family were registered to vote and to “pester” those who weren’t. Toward the end of the question period, which included more than a dozen from those in the audience, he was asked to explain whether people should vote early in Pennsylvania. Musk was momentarily distracted by a fan waving a hat, which he appeared to sign, and then by a child whom he brought onstage for a photo.\n\nRedirected to the question, he said people should vote immediately.\n\nSome in the crowd cupped their hands and shouted, “Why?” He did not answer. A spokesperson said after the event that he didn’t have additional comment.\n\nTrump for years has sowed doubt about mail and early voting by claiming it was rife with fraud, though voter fraud is rare in the United States. This year, Republicans are making a renewed push to encourage their supporters to vote early and lock in their ballots, though they acknowledge skepticism from those conditioned by Trump’s false claims.\n\nJohn and Linda Bird, a couple who attended the event, said they had concerns about the integrity of the voting system and worried about voting early.\n\nJohn Bird said he planned to vote on Election Day. Linda pointed to a sign given out at the event that said Trump called for early voting and worried about the possibility of not getting to the polls on Nov. 5.\n\nStill, she said she’d cast her ballot on Election Day, too.\n\n“Anything can happen, you know, you wake up that morning, some catastrophe happens or whatever,” she said. “But, you know, we’re planning on voting on Nov. 5.”\n\nOne of the questioners asked about fraud in elections — something Trump has falsely insisted cost him the 2020 race. An Associated Press review of every potential case of voter fraud in the six battleground states disputed by Trump found fewer than 475, a number that would have made no difference in the outcome.\n\nMusk said sarcastically that it must be a coincidence that Dominion voting machines, which had been at the center of conspiracy theories in the 2020 election, were used in Pennsylvania and Arizona, two battleground states won by Democrat Joe Biden. In 2023, Fox News agreed to pay Dominion Voting Systems $787 million to avoid a trial in a defamation lawsuit the voting machine company brought against the network for lies told about their company switching ballots.\n\nMusk has become a major booster of Trump this campaign season. On Thursday evening, he cast the election in dire terms.\n\n“I haven’t been politically active before. I’m politically active now because I think the future of America and the future of civilization is at stake,” he said.\n\nPeople were lined up to attend before 3 p.m. as school was letting out. A few people began to leave early when it became clear that not everyone who had lined up to ask a question would have a chance to ask one.\n\nThe event was livestreamed on X, formerly Twitter, and was at times glitchy and difficult to follow, even as it drew hundreds of thousands of viewers.\n\nMusk is undertaking much of the get-out-the-vote effort for Trump through his America PAC, a super PAC that can raise and spend unlimited sums of money. He has committed more than $70 million to the super PAC to help Trump and other Republicans win in November.\n\nTrump and the Republican National Committee he controls opted for an unorthodox strategy of sharing canvassing duties in key regions with groups like Musk’s. They’ve also focused their efforts not on independent or moderate voters, but on those who already support Trump but usually don’t vote.\n\nRepublican activists in swing states said in September that they had seen little activity from the PAC’s get-out-the-vote efforts.\n\nAssociated Press writer Stephen Groves in Washington contributed to this report.","summary":"FOLSOM, Pa. – Elon Musk held his first solo event in support&#8230;","url":"https://internewscast.com/local-news/elon-musk-hosts-his-inaugural-independent-event-backing-trump-in-philadelphias-suburban-area/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Elon-Musk-holds-his-first-solo-event-700x430.jpg","video":null,"publish_date":"2024-10-18 00:59:55","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.109},{"id":260127588,"title":"Dave Bautista Mocks Donald Trump’s Masculinity, Calls Him a ‘Weak, Tubby Toddler’ | Video","text":"Dave Bautista mocked Donald Trump’s masculinity, calling him a “weak, tubby toddler,” on “Jimmy Kimmel Live!” in a clip that’s gone viral. \n\nThe “Guardians of the Galaxy” star and former professional wrestler ticked off his reasons for not taking Trump — or his supposed machismo — seriously, while alternating boxing and other traditionally manly workouts.\n\nKimmel first set up the clip after noting Trump’s odd love of The Village People’s disco anthem “YMCA.” “No matter how gay his music is, young, straight white men love Donald Trump. They see him as a ‘macho, macho man,’ if you will. He eats red meat. He pretends to follow UFC. He’s into crypto and sneakers and NFTs. He’s a dude, a bro and a boss, all thrown into one.”\n\nThe late-night host cited a recent poll from the New York Times that Trump is leading Kamala Harris among male voters by 17 points. “But is he the strong alpha man these men believe him to be? Not according to one of the toughest guys I know, he isn’t.”\n\nBautista’s insults came as fast as his fists in the video:\n\nHe wears more makeup than Dolly Parton. \n\nGuy’s afraid of birds. \n\nDonald Trump and his daddy paid a doctor to say his widdle feet hurt so he could dodge the draft. \n\nHe sells imaginary baseball cards pretending to be a cowboy fireman, but he isn’t strong enough to hold an umbrella.\n\nHe cheats at golf. \n\nHe creeps around beauty pageant dressing rooms. \n\nHe’s moody, he pouts, he throws tantrums. He acts like a five-year-old. \n\nThe guy needs help walking downhill. \n\nAfter all that, Bautista delivers the final punch: “This November, let’s stop kidding ourselves. Donald Trump is afraid. Of rain. Of dogs. Of windmills. Of Meryl f–king Streep and being laughed at. And mostly, he’s terrified that real red-blooded American men will find out that he’s a weak, tubby toddler.”\n\nAfter playing a clip in which Trump says in a childish voice, “Mommy, take me home,” Bautista asks, “What’s the matter, tough guy? Did someone grab you by the [bleep]?”\n\nYou can watch the comedy bit from Jimmy Kimmel and Dave Bautista in the video above.","summary":"\"He's afraid of dogs, windmills and Meryl f--king Streep,\" says the \"Guardians of the Galaxy\" star \n\n\nThe post Dave Bautista Mocks Donald Trump&#8217;s Masculinity, Calls Him a &#8216;Weak, Tubby Toddler&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/dave-bautista-mocks-donald-trump-jimmy-kimmel-live-video/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/dave-bautista-trump.jpg","video":null,"publish_date":"2024-10-18 00:55:37","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":260127486,"title":"Melania Joins Donald Trump at Al Smith Dinner","text":"Taegan Goddard is the founder of Political Wire, one of the earliest and most influential political web sites. He also runs Political Job Hunt, Electoral Vote Map and the Political Dictionary.\n\nGoddard spent more than a decade as managing director and chief operating officer of a prominent investment firm in New York City. Previously, he was a policy adviser to a U.S. Senator and Governor.\n\nGoddard is also co-author of You Won - Now What? (Scribner, 1998), a political management book hailed by prominent journalists and politicians from both parties. In addition, Goddard's essays on politics and public policy have appeared in dozens of newspapers across the country.\n\nGoddard earned degrees from Vassar College and Harvard University. He lives in New York with his wife and three sons.\n\nGoddard is the owner of Goddard Media LLC.","summary":"&#8220;Donald Trump and Melania Trump were all smiles as they made a rare public appearance together at the Al Smith charity dinner in New York City,&#8221; The Independent reports. ABC [&#8230;]","url":"https://politicalwire.com/2024/10/17/melania-joins-trump-at-al-smith-dinner/","image":"https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg","video":null,"publish_date":"2024-10-18 00:51:28","author":"Joe Biden,Taegan Goddard","authors":["Joe Biden","Taegan Goddard"],"language":"en","category":"politics","source_country":"US","sentiment":0.196},{"id":260126628,"title":"Mark Robinson's Chances Against Josh Stein in North Carolina: Poll","text":"Republican North Carolina Lieutenant Governor Mark Robinson's chances of defeating Democrat Josh Stein in the state's gubernatorial election appear to be slim, according to new polling results.Stein, North Carolina's attorney general, was supported by 49.3 percent of likely North Carolina voters in a poll released by Carolina Journal on Thursday, while Robinson was backed by only 35.8 percent. The 13.5 percentage point deficit was a major reversal for Robinson, who was leading Stein in the same poll by 5 points in May.The Carolina Journal survey was not the worst recent poll result for Robinson. A Morning Consult survey from this week showed the Republican trailing the Democrat by 22 points. The poll of likely North Carolina voters found that 54 percent supported Stein, while just 32 percent supported Robinson.Newsweek reached out for comment to the Robinson and Stein campaigns via email on Thursday evening.Support for Robinson collapsed following a CNN report that last month uncovered a series of posts he purportedly made to a porn website. The posts included Robinson allegedly calling himself a \"Black Nazi,\" praising Adolf Hitler's Nazi manifesto Mein Kampf and fondly recalling \"peeping\" on women in bathrooms.Only one publicly-released poll conducted since the scandal erupted has shown anything other than a double-digit lead for Stein—a survey from The Telegraph/Redfield & Wilton Strategies that showed Robinson down by 7 points earlier this week.Robinson has refused calls to drop out of the gubernatorial race and continues to deny making any of the posts, despite CNN extensively documenting evidence that appears to link him to posts made under the username \"minisoldr\" more than a decade ago on the \"Nude Africa\" website.The lieutenant governor, who has described CNN's reporting as \"tabloid trash,\" sued the network for defamation earlier this week. The lawsuit complains that CNN published the allegations \"despite known or recklessly disregarding\" that information linking Robinson to the posts was \"previously compromised by multiple data breaches.\"Robinson has also sued the singer of a North Carolina punk band who alleged prior to the CNN report that the then-future lieutenant governor purchased pornography at a store the singer worked at in the 1990s and early 2000s.While Stein was already leading in polls for months before the CNN report was published, the emergence of the scandal has expanded his lead significantly. It has also prompted concerns about negatively impacting the chances of other Republicans running for office in North Carolina this year.Former President Donald Trump, the Republican nominee for president, enthusiastically endorsed Robinson and previously praised him as \"Martin Luther King on steroids.\" However, Robinson has been conspicuously absent from Trump campaign events in North Carolina since the scandal broke.","summary":"The Trump-endorsed GOP gubernatorial candidate allegedly called himself a \"Black Nazi\" in past posts to a porn website.","url":"https://www.newsweek.com/mark-robinsons-chances-against-josh-stein-north-carolina-poll-1970968","image":"https://d.newsweek.com/en/full/2498320/mark-robinson-josh-stein-polls-election.jpg","video":null,"publish_date":"2024-10-18 00:49:34","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":260127022,"title":"The Apprentice film review: This tale is a masterclass in storytelling, with leads giving career defining performances","text":"THE APPRENTICE\n\n(15), 122mins \n\nHE is one of the most divisive characters in the world, but how did Donald Trump become the man he is today?\n\nIt would seem he copied it from someone else. That someone was lawyer Roy Cohn.\n\nOne dark night in the late 1970s a young, naive wannabe businessman, Trump (Sebastian Stan), meets Cohn (Jeremy Strong) in an underground nightclub full of the top movers and shakers in New York.\n\nTrump is entranced by Cohn, with his cold stare, flat tone and relentless cut-throat ambition. He wants to be just like him.\n\nHe soon asks for guidance from the top lawyer on some legal issues his dad’s business is having with the government. They don’t like the way Trump senior is overtly racist by not renting to black people.\n\nHe also wants to get some building projects off the ground, including his radical super-skyscraper, Trump Towers. Cohn negotiates for him on both — and wins.\n\nMost think Trump is a bad joke in an even worse suit, but Cohn sees the potential in him, taking him under his wing.\n\nHe teaches him the tricks of the trade, which involves a lot of bribery and blackmail.\n\nAs Trump’s success rises to meteoric heights, so does his ego.\n\nHe stops at nothing to get what he wants.\n\nThat includes his first wife, Ivana (Maria Bakalova) who he woos with expensive gifts and luxury holidays.\n\nYou watch as she goes from admiring him to despising him.\n\nBut director Ali Abbasi and writer Gary Sherman are careful not to just paint Trump and Cohn as unrelenting bullies.\n\nThey’re far more human than that and cliché tropes are avoided.\n\nWhile they are, undoubtedly, monsters in their own field, they also have to deal with real life: a sudden death in the family and terminal illness.\n\nTrump shows himself to be the more emotionally stunted of the two, with even Cohn — who is close to the devil himself — being shocked by his lack of empathy.\n\nThe cinematography is spectacular, with incredible 70s and 80s detail — it often feels like watching a grainy documentary.\n\nTrump morphs into the hairspray-loving, perma-orange glow of the man he is today.\n\nThe Apprentice is a masterclass in storytelling, with both Stan and Strong giving the performances of their career.\n\nWatch and learn.\n\n(18) 127mins\n\nPOP sensation Skye Riley is preparing for her world tour, but she begins experiencing terrifying paranormal events.\n\nOverwhelmed, Skye (Naomi Scott) must confront her painful past as she sinks into a darkness that threatens to consume her.\n\nSmile 2 cranks up the horror dial with even more blood, guts and jump scares than the first one from 2022.\n\nDirector Parker Finn pulls no punches in this nightmare-fuelled sequel, taking us on a ride that’s even more intense and disturbing.\n\nScott ditches her Disney roots for a wild, hair-raising perform-ance – think Taylor Swift on acid.\n\nShe spirals into madness as she encounters some seriously freaky supernatural forces.\n\nBut the film feels at times a bit too showy, with tricks and tech-niques borrowed from far superior horror offerings – the repeated upside down camera shots are lifted straight out of 2019’s Mid-sommar.\n\nBesides Scott, there are decent performances from Lukas Gage as drug dealer Lewis and a hugely impressive turn from Ray Nicholson – son of Jack – as Skye’s former boyfriend Paul.\n\nThis is a perfectly serviceable sequel, but it’s just nothing special.\n\nTHE WILD ROBOT\n\n(U) 102mins\n\nFILMMAKER, voice actor and animator Chris Sanders (Lilo & Stitch, The Call Of The Wild) returns with this exciting adventure from the DreamWorks studios.\n\nAdapted from Peter Brown’s novel of the same name, The Wild Robot features a star-studded voice cast including Lupita Nyong’o, Pedro Pascal, Bill Nighy and Heartstopper’s Kit Connor.\n\nThe story follows Roz (Nyong’o), a robot stranded on a deserted island who accidentally causes the demise of a family of geese.\n\nSo she adopts the sole surviving gosling, Brightbill (Connor).\n\nWith the help of cunning fox Fink (Pascal), Roz must navigate the challenges of the wild and protect her new charge from dangers.\n\nSanders knocks it out of the park with a thrilling and heartwarming adaptation that’s packed with action and laughs.\n\nThe movie tackles big themes like family and identity, and delivers stunning visuals and sharp storytelling.\n\nNyong’o shines as Roz, while Pascal’s sly take on Fink adds plenty of charm and humour. Connor as Brightbill delivers heart and a whole load of teenage angst.\n\nIt’s emotional and exciting – and it’s impossible not to fall in love with its positive outlook.","summary":"","url":"https://www.thesun.co.uk/tv/31152986/the-apprentice-film-review/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/10/sebastian-stan-donald-trump-see-940659348.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-10-18 00:48:53","author":"Dulcie Pearce","authors":["Dulcie Pearce"],"language":"en","source_country":"gb","sentiment":0.035},{"id":260126418,"title":"MWC commish: SJSU situation 'breaks my heart'","text":"LAS VEGAS -- Mountain West Conference commissioner Gloria Nevarez said Thursday the forfeitures that volleyball teams are willing to take to avoid playing San Jose State is \"not what we celebrate in college athletics\" and that she is heartbroken over what has transpired this season surrounding the Spartans and their opponents.\n\nFour teams have canceled games against San Jose State: Boise State, Southern Utah, Utah State and Wyoming, with none of the schools explicitly saying why they were forfeiting.\n\nA group of Nevada players issued a statement saying it will not take the floor when the Wolf Pack are scheduled to host the Spartans on Oct. 26. The players cited their \"right to safety and fair competition,\" though their school reaffirmed Thursday that the match is still planned and that state law bars forfeiture \"for reasons related to gender identity or expression.\"\n\nAll those schools, except Southern Utah, are in the Mountain West. New Mexico, also in the MWC, was going ahead with a home match Thursday night against the Spartans.\n\n\"It breaks my heart because they're human beings, young people, student-athletes on both sides of this issue that are getting a lot of national negative attention,\" Nevarez said in an interview with The Associated Press at Mountain West basketball media days. \"It just doesn't feel right to me.\"\n\nRepublican governors of Idaho, Nevada, Utah and Wyoming have made public statements in support of the cancellations, citing a need for fairness in women's sports. Former President Donald Trump, the GOP nominee in this year's presidential race, this week referenced an unidentified volleyball match when he was asked during a Fox News town hall about transgender athletes in women's sports.\n\n\"I saw the slam, it was a slam. I never saw a ball hit so hard, hit the girl in the head,\" Trump replied before he was asked what can be done. \"You just ban it. The president bans it. You just don't let it happen.\"\n\nAfter Trump's comment, San Diego State issued a statement that said \"it has been incorrectly reported that an San Diego State University student-athlete was hit in the face with a volleyball during match play with San Jose State University. The ball bounced off the shoulder of the student-athlete, and the athlete was uninjured and did not miss a play.\"\n\nSan Jose State has not made any direct comments about the politicians' \"fairness\" references, and Nevarez did not go into details.\n\n\"I'm learning a lot about the issue,\" Nevarez said. \"I don't know a lot of the language yet or the science or the understanding nationally of how this issue plays out. The external influences are so far on either side. We have an election year. It's political, so, yeah, it feels like a no-win based on all the external pressure.\"\n\nThe cancellations could mean some teams will not qualify for the conference tournament Nov. 27-30 in Las Vegas, where the top six schools are slated to compete for the league championship.\n\n\"The student-athlete (in question) meets the eligibility standard, so if a team does not play them, it's a forfeit, meaning they take a loss,\" Nevarez said.","summary":"Gloria Nevarez said the forfeitures that volleyball teams are willing to take to avoid playing San Jose State is \"not what we celebrate in college athletics\" and that she is heartbroken over what's transpired with the Spartans and their opponents.","url":"https://www.espn.com/college-sports/story/_/id/41856234/mwc-nevarez-heartbroken-san-jose-st-volleyball-situation","image":"https://a.espncdn.com/photo/2019/0319/r516753_1296x729_16-9.jpg","video":null,"publish_date":"2024-10-18 00:46:34","author":"San Jose St","authors":["San Jose St"],"language":"en","category":"politics","source_country":"US","sentiment":-0.447},{"id":260126436,"title":"Mark Cuban Mocks Trump’s Economic Plan While Rallying With Harris","text":"Earlier this week, America got a clear view of how little Donald Trump understands — or cares about — the mechanics and potentially devastating consequences of the economic agenda he’s running on. \n\n On Thursday, businessman Mark Cuban joined Vice President Kamala Harris on the campaign trail in Wisconsin, and took the opportunity to mock Trump’s widespread tariff proposals on all imported goods. \n\n “I’ve learned a lot about business, including how tariffs work,” the billionaire investor said to Democratic supporters at a rally for Harris in La Crosse, Wisconsin. “Now let me just ask you a question, do you all know anyone who doesn’t know how tariffs work?” Cuban said, before referencing Trump: “All right I’ll give you a hint — that other guy.”\n\n “This man has so little understanding of tariffs, he thinks that China pays for them. This is the same guy who also thought that Mexico would pay for the wall,” Cuban quipped.\n\n On Tuesday, Bloomberg Editor-In-Chief John Micklethwait interviewed Trump at the Economic Club of Chicago. However, the former president became increasingly frustrated when pressed with questions about his policies should he serve another term in the White House. During the sit-down, Trump avoided giving straight answers while also insulting autoworkers, claiming the Jan. 6 riot was filled with “love and peace,” and claiming his incoherent ramblings were a strategic “weave.”\n\n At Thursday’s event, Cuban said that he believes Trump “used to understand how tariffs work” in the Nineties, adding, “But I don’t know what happened to him.”\n\n If reelected in November, Trump has vowed to put a 10 percent tariff on all imports and raise the tariff rate on Chinese-made goods to 60 percent or more. The former president has also indicated that he may pressure the Federal Reserve to lower interest rates. In June, 16 Nobel-prize winning economists released a grave warning in a joint letter, detailing a potential economic fallout should Trump implement his plan for the U.S. economy. \n\n Throughout her campaign, Harris has laid out an “opportunity economy” and has proposed policies to improve the cost of housing, including the construction of 3 million affordable new homes and apartments, expanded protections against corporate landlords, and a $25,000 credit for first-time homebuyers. The vice president has also called to expand the child tax credit and the earned income tax credit for low-income workers.","summary":"The self-made billionaire called out Trump's glaring lack of understanding of how tariffs work","url":"https://www.rollingstone.com/politics/politics-news/mark-cuban-mocks-trump-economic-plan-1235136727/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/mark-cuban-harris-rally.jpg","video":null,"publish_date":"2024-10-18 00:33:07","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","source_country":"us","sentiment":0.061},{"id":260126518,"title":"North Carolina judge tosses half of RNC election suit","text":"U.S. District Judge Richard E. Meyers, an appointee of former President Donald Trump, dismissed the RNC’s claim that election officials failed to comply with a federal law known as the Help America Vote Act, or HAVA, and mishandled the registrations of more than 225,000 voters.\n\nThe RNC argued the violations were spurred in part by the North Carolina State Board of Elections failing to collect the last four digits of Social Security numbers or driver’s license numbers, but ultimately Meyers found private litigants lack the right to sue under HAVA, according to his 44-page decision.\n\nMore courtroom battles on the way\n\nRepublicans are still litigating three other high-profile lawsuits in the key swing state of North Carolina that could have implications for the election. The suits target rules concerning absentee ballots, alleged noncitizen voting, and a dispute concerning the eligibility of certain overseas voters.\n\nThe overseas voting challenge surrounds the state constitution, which plaintiffs say forbids anyone from voting in the state if they have never resided there. The RNC contends the federal Uniformed and Overseas Citizens Absentee Voting Act has been abused by state officials to allow anyone to register to vote online without providing valid identification information.\n\nRepublican challengers fear that overseas ballots could be wrongly counted as votes that originated from swing states, prompting concerns that there will be no clear indication that the overseas voters actually have ties to North Carolina and other swing states.\n\nMeyers stayed his decision to remand half of the lawsuit to state court pending any appeals from either party.\n\nThe Washington Examiner contacted a representative for the RNC, and it is not immediately clear whether it will appeal the decision.\n\nThe lawsuit followed the North Carolina election board pulling more than 747,000 people off of voter registration rolls in September. The state has nearly 7.7 million registered voters on file.\n\nEarly voting began in the Tar Heel State on Thursday, and the presidential race there is exceedingly close, according to recent surveys.\n\nSimilar case awaits ruling in battleground Michigan\n\nMeanwhile, a state court judge in Michigan on Thursday was wary of a similar challenge brought by the RNC in Michigan.\n\nDuring a hearing before the Court of Claims, Judge Sima Patel pushed back when Michigan GOP lawyer Brandon Debus argued Michigan law does not permit overseas nonresidents of the state from voting in the general election, according to CNN.\n\n“Isn’t that contrary to what the statute actually says?” Patel asked, later asking, “Doesn’t your interpretation penalize the children of overseas servicepeople?”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThe Michigan hearing ended Thursday afternoon without a ruling from the judge.\n\nDemocratic presidential candidate Vice President Kamala Harris started her campaign in the summer with wider margins in the Wolverine State, while recent polls indicate she is neck and neck with Trump.","summary":"A federal judge on Thursday tossed out half of the Republican National Committee&#8216;s lawsuit alleging that North Carolina election officials engaged in improper procedures and allowed noncitizens to register to vote, but sent a challenge targeting overseas voting rules to state court. U.S. District Judge Richard E. Meyers, an appointee of former President Donald Trump, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3194078/north-carolina-judge-tosses-half-of-rnc-election-suit/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Rust-Belt-Voting-scaled.webp","video":null,"publish_date":"2024-10-18 00:22:50","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","category":"politics","source_country":"US","sentiment":-0.314},{"id":260126214,"title":"Elon Musk holds his first solo event in support of Trump in the Philadelphia suburbs - The Associated Press","text":"FOLSOM, Pa. (AP) — Elon Musk held his first solo event in support of Donald Trump for president on Thursday, encouraging voters in the Philadelphia suburbs to register to cast their ballots and vote early, though some attendees shouted back, “Why?”\n\nThe America PAC event at Ridley High School’s auditorium in Folsom featured the world’s richest man speaking onstage in front of a large U.S. flag for roughly 15 minutes before taking questions from the crowd, many of whom wore “Make America Great Again” hats. \n\nThe event was billed as a call to action to vote early in the crucial battleground state of Pennsylvania, where Trump and Democratic Vice President Kamala Harris are fiercely contesting the election. Some in the crowd questioned Musk’s entreaties to vote early, reflecting the possibility that Republicans are still persuading their supporters to embrace early voting after Trump spent years demonizing the method.\n\nThe crowd rose to its feet and took cellphone videos as Musk, the billionaire founder of Tesla and Space X and owner of the social media platform X, walked onstage. They remained standing during his remarks and cheered loudly after he said the U.S. Constitution needs to be upheld.\n\n“This is literally the fundamental values that made America what it is today. And anyone who is against those things is fundamentally anti-American and to hell with them,” said Musk, who was born in South Africa. The crowd erupted. \n\nHe exhorted the crowd to make sure they and their friends and family were registered to vote and to “pester” those who weren’t. Toward the end of the question period, which included more than a dozen from those in the audience, he was asked to explain whether people should vote early in Pennsylvania. Musk was momentarily distracted by a fan waving a hat, which he appeared to sign, and then by a child whom he brought onstage for a photo.\n\nRedirected to the question, he said people should vote immediately.\n\nSome in the crowd cupped their hands and shouted, “Why?” He did not answer. A spokesperson said after the event that he didn’t have additional comment. \n\nTrump for years has sowed doubt about mail and early voting by claiming it was rife with fraud, though voter fraud is rare in the United States. This year, Republicans are making a renewed push to encourage their supporters to vote early and lock in their ballots, though they acknowledge skepticism from those conditioned by Trump’s false claims. \n\nJohn and Linda Bird, a couple who attended the event, said they had concerns about the integrity of the voting system and worried about voting early.\n\nJohn Bird said he planned to vote on Election Day. Linda pointed to a sign given out at the event that said Trump called for early voting and worried about the possibility of not getting to the polls on Nov. 5.\n\nStill, she said she’d cast her ballot on Election Day, too. \n\n“Anything can happen, you know, you wake up that morning, some catastrophe happens or whatever,” she said. “But, you know, we’re planning on voting on Nov. 5.”\n\nOne of the questioners asked about fraud in elections — something Trump has falsely insisted cost him the 2020 race. An Associated Press review of every potential case of voter fraud in the six battleground states disputed by Trump found fewer than 475, a number that would have made no difference in the outcome.\n\nMusk said sarcastically that it must be a coincidence that Dominion voting machines, which had been at the center of conspiracy theories in the 2020 election, were used in Pennsylvania and Arizona, two battleground states won by Democrat Joe Biden. In 2023, Fox News agreed to pay Dominion Voting Systems $787 million to avoid a trial in a defamation lawsuit the voting machine company brought against the network for lies told about their company switching ballots.\n\nMusk has become a major booster of Trump this campaign season. On Thursday evening, he cast the election in dire terms.\n\n“I haven’t been politically active before. I’m politically active now because I think the future of America and the future of civilization is at stake,” he said. \n\nPeople were lined up to attend before 3 p.m. as school was letting out. A few people began to leave early when it became clear that not everyone who had lined up to ask a question would have a chance to ask one.\n\nThe event was livestreamed on X, formerly Twitter, and was at times glitchy and difficult to follow, even as it drew hundreds of thousands of viewers.\n\nMusk is undertaking much of the get-out-the-vote effort for Trump through his America PAC, a super PAC that can raise and spend unlimited sums of money. He has committed more than $70 million to the super PAC to help Trump and other Republicans win in November.\n\nTrump and the Republican National Committee he controls opted for an unorthodox strategy of sharing canvassing duties in key regions with groups like Musk’s. They’ve also focused their efforts not on independent or moderate voters, but on those who already support Trump but usually don’t vote.\n\nRepublican activists in swing states said in September that they had seen little activity from the PAC’s get-out-the-vote efforts.\n\nAssociated Press writer Stephen Groves in Washington contributed to this report.","summary":"Elon Musk holds his first solo event in support of Trump in the Philadelphia suburbs  The Associated Press","url":"https://apnews.com/article/elon-musk-america-pac-donald-trump-344f1ecc9770c4e394fceb7bbbe2b237","image":"https://dims.apnews.com/dims4/default/eaca9b8/2147483647/strip/true/crop/4706x2647+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F44%2F7ca03c11dd04d378f5938c07a9cd%2F510713025c4c499698184d1a7816e8c1","video":null,"publish_date":"2024-10-18 00:21:00","author":"Mike Catalini","authors":["Mike Catalini"],"language":"en","source_country":"us","sentiment":0.109},{"id":260125396,"title":"Melania and Donald are all smiles as they make rare public outing together at Al Smith dinner in NYC","text":"Donald Trump and Melania Trump are all smiles as they make a rare public appearance together at the Al Smith charity dinner in New York City.\n\nThe former president and former first lady appeared at the dinner both dressed in black-tie outfits on Thursday night Trump smiled, raised his fist and shook hands as he made his way to his seat.\n\nTrump will speak at the event later on Thursday evening. \n\nMelania has been notably absent from the campaign trail. Over the last year, she has attended only a handful of rallies and events, often avoiding the spotlight while there. She also broke a long-running tradition by attending but not speaking at the Republican National Convention in July.\n\nHowever, the former first lady has been in the public eye in recent weeks as she promotes her memoir, Melania. \n\nThe Al Smith dinner is an annual event to raise money for Catholic charities. Attending the dinner has been a tradition among major party presidential candidates since the 1960s.\n\nBut, Kamala Harris’s team confirmed last month that the vice president will not be attending. This makes her the first presidential candidate for a major party to do so in decades.\n\nInstead, Harris spent the day campaigning in Wisconsin, a key swing state.\n\nMore to come...","summary":"Melania Trump has been notably absent from the campaign trail this year","url":"https://www.independent.co.uk/news/world/americas/us-politics/melania-donald-trump-al-smith-dinner-together-b2631338.html","image":"https://static.independent.co.uk/2024/10/18/01/newFile.jpg?width=1200","video":null,"publish_date":"2024-10-18 00:17:20","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.084},{"id":260124772,"title":"Watch Live: Trump speaks at Al Smith Dinner","text":"New York Post\n\n See All Videos \n\nBreaking News\n\n Hamas leader tried to take out Israeli drone moments before he was killed \n\nWatch Live: Trump speaks at Al Smith Dinner\n\nOctober 17, 2024 | 8:09pm\n\nFormer President Donald Trump is set to speak tonight at the Alfred E. Smith Memorial Foundation dinner held annually in Manhattan. The white tie event benefits Catholic charities.\n\nLive coverage is scheduled for 9:15 ET.\n\n Share thison","summary":"Former President Donald Trump is set to speak tonight at the Alfred E. Smith Memorial Foundation dinner held annually in Manhattan. The white tie event benefits Catholic charities. Live coverage is scheduled for 9:15 ET.","url":"https://nypost.com/video/watch-live-trump-speaks-at-al-smith-dinner/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/trump_al_smith_19b820.png?w=1200","video":null,"publish_date":"2024-10-18 00:09:35","author":"New York Post Video","authors":["New York Post Video"],"language":"en","category":"politics","source_country":"us","sentiment":0.077},{"id":260124928,"title":"Musk warns 'fate of Western civilization' depends on Trump returning to office","text":"Elon Musk warned Thursday that the \"fate of Western civilization\" depends on Donald Trump returning to office as the tech billionaire launched five nights of campaign events for the White House candidate in the key swing state of Pennsylvania.\n\nThe Tesla and SpaceX CEO has emerged as a major voice in U.S. politics but is accused of turning the social media platform X into a megaphone for right-wing conspiracy theories since acquiring it in 2022.\n\n\"I can't emphasize enough that Pennsylvania is, I think, the lynchpin in this election,\" he said at a town hall event in Folsom, on the outskirts of Philadelphia. \"And this election, I think, is going to decide the fate of America and, along with the fate of America, the fate of Western civilization.\"\n\nMusk, the world's richest man, announced that his events would be free to attend for anyone who had voted early in the presidential election and signed a petition \"supporting free speech & right to bear arms.\"\n\nTrump is in a knife-edge election against Democratic Vice President Kamala Harris, less than three weeks ahead of Election Day.\n\nMusk, who endorsed Trump in July, is one of the Biden administration's fiercest critics and frequently spreads far-right misinformation about undocumented immigrants and voter fraud.\n\nDescribing himself as \"pro-immigrant\", Musk spent much of his opening night in Pennsylvania complaining about crime and border security, saying the southern frontier \"looks like World War Z, okay -- it's like zombie apocalypse.\"\n\nRepublicans have complained for years about anti-conservative bias on social media, often citing Trump's 2021 suspensions and pre-Musk X -- then known as Twitter -- blocking users from linking to a newspaper article critical of Joe Biden's son.\n\nMusk, though, has taken an increasingly visible role in Trump's campaign, accompanying him on stage at a recent rally in Pennsylvania and frequently lambasting Harris.\n\nThe billionaire has donated almost $75 million to his political organization America PAC, set up to help Trump back into office, and has promised residents in swing states $47 for each registered voter who signs his petition.\n\nTrump has made a point of praising the 53-year-old during multiple campaign events this week, after tapping the tycoon to run a committee tasked with slashing government bureaucracy and waste if the Republican nominee wins the election.\n\nTrump has largely handed off his grassroots \"get-out-the-vote\" push to Musk's America PAC in Pennsylvania and the other swing states expected to determine the election.\n\nRolling Stone reported this week that Republicans have voiced fears that the organization is making a mess of the job, with a relatively small presence on the ground despite its massive spending.","summary":"Elon Musk warned Thursday that the &quot;fate of Western civilization&quot; depends on Donald Trump returning to office as the tech billionaire launched five nights of campaign events for…","url":"https://japantoday.com/category/world/musk-stumps-for-trump-in-key-us-swing-state","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/f2/b1/3e238ea2211477763fcf31e530f6e652fbd0/f2b13e238ea2211477763fcf31e530f6e652fbd0/_w1700.jpg","video":null,"publish_date":"2024-10-18 00:09:21","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":0.206},{"id":260124756,"title":"Panel finds Secret Service has \"deep flaws\" in Trump assassination attempt probe","text":"Panel finds Secret Service has \"deep flaws\" in Trump assassination attempt probe\n An independent panel investigating the July assassination attempt against former President Donald Trump found that the Secret Service has \"deep flaws\" and needs \"fundamental reform.\" CBS News homeland security and justice reporter Nicole Sganga has more.","summary":"An independent panel investigating the July assassination attempt against former President Donald Trump found that the Secret Service has \"deep flaws\" and needs \"fundamental reform.\" CBS News homeland security and justice reporter Nicole Sganga has more.","url":"https://www.cbsnews.com/video/panel-finds-secret-service-deep-flaws-in-trump-assassination-attempt-probe/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/17/a7c3598a-8b3b-41f6-9d5e-e49783f6aa20/thumbnail/1200x630/65055c34ca921f17071c80f844e634d7/cbsn-fusion-panel-finds-secret-service-deep-flaws-in-trump-assassination-attempt-probe-thumbnail.jpg?v=edba3a63b5","video":null,"publish_date":"2024-10-17 23:57:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.608},{"id":260124344,"title":"Independent report outlines several failures by Secret Service in Trump rally shooting","text":"Independent report outlines several failures by Secret Service in Trump rally shooting\n An independent bipartisan panel released a report Thursday that examined the Secret Service failures that led up to the attempted assassination attempt on former President Donald Trump during a July campaign rally in Butler, Pennsylvania. The panel also said the Secret Service has become bureaucratic, complacent and static. Nicole Sganga has more.","summary":"An independent bipartisan panel released a report Thursday that examined the Secret Service failures that led up to the attempted assassination attempt on former President Donald Trump during a July campaign rally in Butler, Pennsylvania. The panel also said the Secret Service has become bureaucratic, complacent and static. Nicole Sganga has more.","url":"https://www.cbsnews.com/video/independent-report-outlines-several-failures-by-secret-service-in-trump-rally-shooting/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/17/d4259d23-d5e1-4c02-af56-55ef953164fa/thumbnail/1200x630/62daaa724fbeeb3f51a5cec04270ac99/1017-en-sganga.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":null,"publish_date":"2024-10-17 23:56:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.61},{"id":260124530,"title":"Mark Cuban blames social media algorithms for Trump's 'gangsta' appeal to young men","text":"Harris campaign surrogate and \"Shark Tank\" investor Mark Cuban derided social media for popularizing former President Trump with young male voters. On Thursday, Cuban spoke to MSNBC’s Nicolle Wallace about the state of the race between Vice President Kamala Harris and Trump, shortly after giving a speech at a Harris rally in Wisconsin. \"You spend a lot of time in what Sarah Longwell calls ‘the manosphere,’\" Wallace observed. \"Let’s just take us through the pitch you’re making to men who are sort of disaffected from politics, don’t really see themselves as a traditional Democrat or Republican but think there’s something in Donald Trump for them.\" Cuban replied by mocking how many men are drawn to Trump through the machismo of his style, rather than his platform. TRUMP MOCKS BIDEN'S BEACH NAPS: 'SOMEBODY CONVINCED HIM HE LOOKS GREAT IN A BATHING SUIT' \"Yeah, I mean, I have talked to people who said they like Trump because he’s a ‘gangsta.’ Not a gangster, a ‘gangsta,’\" he said. \"I’m like, that’s why you’re going to vote for him?\" Cuban argued that the world is different from how it was 8 years ago and even 4 years ago in terms of how \"we’re truly addicted to our social media. I have had three kids, 15, 18, and 21, and it’s just that scroll, scroll, scroll.\" This process, he says, is a pipeline for men to be fed \"aggressive,\" Trump content. \"For guys, in particular, you start with football, you go to another sport, you see women, and then all of a sudden you’re seeing something that is aggressive. It could be an Andrew Tate, it could be whoever, and that leads you to getting content, memes in particular, for Donald Trump,\" he said. \"When you see those memes repeated hundreds and hundreds of times a day, you can’t expect them to all of a sudden start reading to find out if it’s true, to find out if the information is accurate.\" TRUMP CALLS FOR CBS TO LOSE ITS BROADCASTING LICENSE AMID ‘60 MINUTES’ CONTROVERSY: ‘UNPRECEDENTED SCANDAL!’ He underlined his point, \"It’s just nonstop repetition and that influences their decision-making, and so the campaign, and we have talked about it, has got to come up and reverse-engineer these algorithms and come up with a response.\" \"One of the purveyors of those algorithms,\" Wallace noted, is X owner Elon Musk, recalling that Cuban has sparred with him online. \"I think he’s one of the most brilliant entrepreneurs ever. He’s an amazing engineer, but he’s the world’s biggest troll,\" Cuban said. Cuban's Wisconsin campaign appearance on Thursday came as Musk stumped for Trump in Pennsylvania. CLICK HERE TO GET THE FOX NEWS APP","summary":"Billionaire entrepreneur Mark Cuban warned that social media is a slippery slope for young men that quickly goes from sports content to right-wing political rhetoric.","url":"https://www.foxnews.com/media/mark-cuban-blames-social-media-algorithms-trumps-gangsta-appeal-young-men","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/mark-cuban-on-trump-appeal.png?ve=1&tl=1","video":null,"publish_date":"2024-10-17 23:54:53","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"US","sentiment":0.139},{"id":260125328,"title":"Republicans say they’re appealing a Georgia judge’s ruling that invalidates seven election rules","text":"By KATE BRUMBACK and JEFF AMY\n\nATLANTA (AP) — National and state Republicans on Thursday appealed a judge’s ruling that said seven election rules recently passed by Georgia’s State Election Board are “illegal, unconstitutional and void.”\n\nThe Republican National Committee and the Georgia Republican Party are appealing a ruling from Fulton County Superior Court Judge Thomas Cox, who ruled Wednesday that the State Election Board did not have the authority to pass the rules and ordered it to immediately inform all state and local election officials that the rules are void and not to be followed.\n\nThe rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.\n\n“By overturning the Georgia State Election Board’s commonsense rules passed to safeguard Georgia’s elections, the judge sided with the Democrats in their attacks on transparency, accountability, and the integrity of our elections,” Whatley said. “We have immediately appealed this egregious order to ensure commonsense rules are in place for the election — we will not let this stand.”\n\nThe ruling came in a lawsuit filed by Eternal Vigilance Action, an organization founded and led by former state Rep. Scot Turner, a Republican. The suit argued that the State Election Board overstepped its authority in adopting the rules.\n\nThe ruling was hailed as a victory by Democrats and voting rights groups, who say rules the State Election Board has passed in recent months could be used by allies of Donald Trump to cast doubt on results if the former president loses the presidential election to Democratic Vice President Kamala Harris. Recent appointments to the five-member board have put three Trump-endorsed Republicans in the majority. They have passed new rules over the objections of the board’s lone Democrat and the nonpartisan chair.\n\nCounty election officials from around the state — the people who run the elections — have voiced concerns over the flood of new rules taking effect so close to Election Day.\n\nThe other rules Cox said are illegal and unconstitutional are ones that: require someone delivering an absentee ballot in person to provide a signature and photo ID; demand video surveillance and recording of ballot drop boxes after polls close during early voting; expand the mandatory designated areas where partisan poll watchers can stand at tabulation centers; and require daily public updates of the number of votes cast during early voting.","summary":"The rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.","url":"https://www.sandiegouniontribune.com/2024/10/17/republicans-appeal-georgia-election-ruling/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/10/Election_2024_Georgia_63924_ae5a33.jpg?w=1024","video":null,"publish_date":"2024-10-17 23:54:37","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.063},{"id":260124544,"title":"Republicans say they’re appealing a Georgia judge’s ruling that invalidates seven election rules","text":"By KATE BRUMBACK and JEFF AMY\n\nATLANTA (AP) — National and state Republicans on Thursday appealed a judge’s ruling that said seven election rules recently passed by Georgia’s State Election Board are “illegal, unconstitutional and void.”\n\nThe Republican National Committee and the Georgia Republican Party are appealing a ruling from Fulton County Superior Court Judge Thomas Cox, who ruled Wednesday that the State Election Board did not have the authority to pass the rules and ordered it to immediately inform all state and local election officials that the rules are void and not to be followed.\n\nThe rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.\n\n“By overturning the Georgia State Election Board’s commonsense rules passed to safeguard Georgia’s elections, the judge sided with the Democrats in their attacks on transparency, accountability, and the integrity of our elections,” Whatley said. “We have immediately appealed this egregious order to ensure commonsense rules are in place for the election — we will not let this stand.”\n\nThe ruling came in a lawsuit filed by Eternal Vigilance Action, an organization founded and led by former state Rep. Scot Turner, a Republican. The suit argued that the State Election Board overstepped its authority in adopting the rules.\n\nThe ruling was hailed as a victory by Democrats and voting rights groups, who say rules the State Election Board has passed in recent months could be used by allies of Donald Trump to cast doubt on results if the former president loses the presidential election to Democratic Vice President Kamala Harris. Recent appointments to the five-member board have put three Trump-endorsed Republicans in the majority. They have passed new rules over the objections of the board’s lone Democrat and the nonpartisan chair.\n\nCounty election officials from around the state — the people who run the elections — have voiced concerns over the flood of new rules taking effect so close to Election Day.\n\nThe other rules Cox said are illegal and unconstitutional are ones that: require someone delivering an absentee ballot in person to provide a signature and photo ID; demand video surveillance and recording of ballot drop boxes after polls close during early voting; expand the mandatory designated areas where partisan poll watchers can stand at tabulation centers; and require daily public updates of the number of votes cast during early voting.","summary":"The rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.","url":"https://www.twincities.com/2024/10/17/republicans-appeal-georgia-election-ruling/","image":"https://www.twincities.com/wp-content/uploads/2024/10/Election_2024_Georgia_63924_ae5a33.jpg?w=1024","video":null,"publish_date":"2024-10-17 23:54:37","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.063},{"id":260124414,"title":"Maxim makes an endorsement for the 2024 presidential election: 'You just lost zero fans'","text":"Maxim magazine endorsed Donald Trump in the 2024 presidential election in a post via X on Thursday.The post, which currently has over 23,000 likes, writes \"Maxim endorses Donald J. Trump for President.\"The magazine has not yet released any more details behind its decision to endorse the former president.TRUMP SAYS THREE NICE THINGS ABOUT HARRIS AT UNIVISION TOWN HALL AFTER SHE STRUGGLED WITH SAME QUESTION ON HIM One top comment reads, \"And you just lost zero fans. Probably gained some.\"Maxim, launched in 1998 by Felix Dennis, describes itself as \"catering to the modern man with content that promises to seduce, entertain and continuously surprise readers.\"COMEDIAN SAYS TRUMP WENT FROM NO CHANCE TO 'WINNING BY A LANDSLIDE' AFTER PODCAST INTERVIEWAt its peak in the early 2000s, Maxim's subscription circulation reached over 2.5 million readers. It is currently owned by American company Biglari Holdings.Maxim's current editor-in-chief is Sardar Biglari. Also during Maxim's peak, competitors like GQ tailored their content to younger audiences. It has since changed hands several times, with founder Felix Dennis first selling the magazine for $250 million.Maxim is currently mainly a digital publication, with bi-monthly print copies for subscribers. Maxim's \"Hot 100\" was released around two weeks ago and features names like Sydney Sweeney and Elizabeth Hurley. CLICK HERE TO GET THE FOX NEWS APPRepresentatives for Maxim did not immediately return Fox News Digital's request for comment.","summary":"Maxim magazine, catered primarily toward men, shared which candidate they have chosen to endorse for 2024&apos;s presidential election in a post via X on Thursday.","url":"https://www.foxnews.com/media/maxim-magazine-makes-endorsement-2024-presidential-election-you-just-lost-zero-fans","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trumpunivision.png?ve=1&tl=1","video":null,"publish_date":"2024-10-17 23:53:49","author":"Jasmine Baehr","authors":["Jasmine Baehr"],"language":"en","category":"politics","source_country":"us","sentiment":0.137},{"id":260124354,"title":"Harris briefly pauses campaigning to react to Hamas leader's death","text":"Harris briefly pauses campaigning to react to Hamas leader's death\n Vice President Kamala Harris reacted to the killing of Hamas chief Yahya Sinwar Thursday after Israel said its military killed the top leader. CBS News reporters Olivia Rinaldi and Zak Hudak join to discuss Harris' and former President Donald Trump's latest campaign moves.","summary":"Vice President Kamala Harris reacted to the killing of Hamas chief Yahya Sinwar Thursday after Israel said its military killed the top leader. CBS News reporters Olivia Rinaldi and Zak Hudak join to discuss Harris' and former President Donald Trump's latest campaign moves.","url":"https://www.cbsnews.com/video/harris-briefly-pauses-campaigning-react-hamas-leaders-death/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/17/7484a39e-67d6-4cbd-81e3-269e1ac4f3be/thumbnail/1200x630/c61071a21ee633875e5aabb6d786a423/cbsn-fusion-harris-briefly-pauses-campaigning-react-hamas-leaders-death-thumbnail.jpg?v=edba3a63b5392b4c81ae19d89","video":null,"publish_date":"2024-10-17 23:51:15","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.762},{"id":260124734,"title":"Megyn Kelly Says Kamala Harris Should Have Called Her for Fox News Advice: ‘This, Madam Vice President, Was the Wrong Strategy’","text":"Megyn Kelly said that Kamala Harris should have asked for her advice before going on Fox News Wednesday and also should have refrained from “bashing” Donald Trump during her combative conversation with Bret Baier.\n\nThe SiriusXM host, who worked at Fox News from 2oo4 to 2017, dubbed the appearance a “total failure” that “did not move the needle at all” on Thursday, while dismissing Harris’ “small-ball plans for the economy.”\n\nAs Kelly explained on her podcast, “This, Madam Vice President, was the wrong strategy … you do not win Fox viewers over by bashing Donald Trump. They love Trump or they’re at least open-minded to Trump.” She added that Harris should have instead demonstrated how she is a “better option” to the GOP candidate and that she isn’t “as radical as they have been hearing every day, all day on Fox News for a year.”\n\n“She spent the majority of her time bashing Trump. That’s what, obviously, this was about for her. She wanted to go on Fox News, into the belly of the beast, and just bash Donald Trump,” Kelly said. She unwittingly admitted, however, that some of Harris’ critiques of the ex-president were justified, saying, “It was one long game of Trump the piñata with a bunch of attacks that, in many cases, were utterly baseless.”\n\nShe went on to add that Harris “lied over and over and over on her positions, on her policies. She denied her own record. And the worst thing was — and we saw it over and over — she dodged question after question after question after question after question and then played the victim.”\n\nKelly also said that Harris and President Joe Biden are “the chief sufferers of Trump Derangement Syndrome,” the term used by Trump fans to mock their critics.\n\nKelly previously said in July that she would “walk over broken glass” to vote for Trump, praising him for his “strength, resilience and ability literally under fire,” following his being grazed by a would-be assassin’s bullet at a rally in Butler, Pennsylvania. The incident left one spectator dead, but did not seriously wound the former president.\n\nOther right-leaning outlets like The Hill dubbed the interview a “disaster.” Meanwhile, the New York Times assessed the interview as a win for Harris, noting that the VP “largely steered the conversation in her preferred direction.”\n\nPer Nielsen, the interview drew 7.8 million viewers, while Trump’s town hall on women’s issues for the same network failed to crack half that viewership at just 3 million, as TheWrap reported on Thursday.","summary":"The former Fox News anchor points out that bashing Donald Trump is not the way to win over the network's viewers\n\n\nThe post Megyn Kelly Says Kamala Harris Should Have Called Her for Fox News Advice: ‘This, Madam Vice President, Was the Wrong Strategy’ appeared first on TheWrap.","url":"https://www.thewrap.com/megyn-kelly-kamala-harris-fox-news-interview-advice/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/megyn-kelly-10-17-24.jpg","video":null,"publish_date":"2024-10-17 23:47:22","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","category":"politics","source_country":"US","sentiment":-0.516},{"id":260125640,"title":"After Sinwar death, Biden faces big obstacles","text":"Joe Biden is expected to use Israel’s killing of Hamas leader Yahya Sinwar to pressure Prime Minister Benjamin Netanyahu to wind down the war in Gaza.\n\nBut in the waning months of his term the U.S. president may lack leverage to bend the Israeli leader to his will.\n\nThe demise of Sinwar, mastermind of Hamas’ Oct. 7, 2023 attack on Israel that started the latest bloody chapter in the Israeli-Palestinian conflict, raised hopes that it might spur resumption of long-stalled negotiations for a Gaza ceasefire-and-hostage deal that Biden has long sought.\n\nBut such an outcome is far from certain as Biden faces a cascade of interlocking Middle East crises.\n\nHis efforts to bring peace to Gaza will be complicated by Israel’s parallel fight against Hezbollah in Lebanon as well as Israeli preparations to retaliate against Iran, which backs both the Lebanese militant group and Hamas, for its ballistic-missile barrage this month.\n\n“Sinwar’s death would provide a renewed opening for President Biden to again push for the first phase of the ceasefire deal to be implemented and it would increase pressure on Netanyahu to do so,” said Jonathan Panikoff, the former deputy U.S. national intelligence officer on the Middle East.\n\n“Whether a deal could be struck for a cessation of hostilities will depend on the new Hamas leader — and on Netanyahu’s willingness to finally declare victory and make a deal,” said Panikoff, now at the Atlantic Council think-tank.\n\nWith the clock ticking down on his presidency and the Nov. 5 U.S. election looming, Biden may struggle to get Netanyahu to fully heed his entreaties.\n\nThough the Biden administration this week told Israel it must improve Gaza’s humanitarian situation or face potential restrictions on U.S. military aid, it remains unclear how strongly the U.S. is prepared to act on this warning.\n\nNetanyahu, some analysts say, may prefer to wait out the end of Biden’s term in January and take his chances with the next president, whether the Democratic candidate, Vice President Kamala Harris, or Republican rival Donald Trump, with whom the Israeli leader has had close ties.\n\nThe White House did not immediately respond to a request for comment on the challenges Biden faces.\n\nJon Alterman, a former State Department official now at the Center for Strategic & International Studies think-tank in Washington, expressed pessimism that Netanyahu would respond to renewed pressure from Biden to resume Gaza talks brokered by Egypt and Qatar.\n\n“Bibi’s like a gambler with a hot hand, and in his mind, all the big risks he’s taken in the last six months, which people said were crazy, have paid off, and most spectacularly in killing Yahya Sinwar,” said Alterman, referring to Netanyahu by his nickname.\n\nSHIFTING DEMANDS\n\nThe Biden administration had long blamed Sinwar, Hamas’ top political and strategic thinker, as the main obstacle to a truce and exchange of hostages held by the group for prisoners held by Israel.\n\nBut even as they cited Sinwar’s refusal to compromise, some U.S. officials had privately criticized Netanyahu for intransigence and shifting demands as he sought to placate far-right members of his governing coalition.\n\nNetanyahu wasted little time declaring that the killing of Sinwar “settled the score” with the “evil” Hamas leader while also insisting that the war in Gaza was not over and Israel would continue fighting until its hostages were returned.\n\nIn a statement issued a short time later, Biden backed Israel’s right to eliminate Hamas’ leadership but pivoted to saying he would discuss with Netanyahu a pathway “for ending this war once and for all.”\n\nThe contrasts between Biden’s and Netanyahu’s words reflected some of the differences between them over the Israeli leader’s prosecution of the war in Gaza and could foreshadow further tensions.\n\nSinwar was named Hamas’ leader following the assassination of political chief Ismail Haniyeh in Tehran in July.\n\nThat was followed by Israel’s assassination of Hezbollah leader Hassan Nasrallah in Beirut last month.\n\nWhile some analysts suggest Sinwar’s death could give Netanyahu political cover to negotiate with more flexibility, any move to strike a deal with Hamas is likely to face fierce resistance from far-right cabinet members who have opposed the previously proposed terms for an agreement.\n\nIsraeli officials did not immediately respond to a request for comment.\n\nAlso dimming prospects for Biden to reinvigorate Gaza peace efforts are questions about who will replace Sinwar, who had unrivalled influence within Hamas.\n\nNone of his potential successors has the same standing.\n\nIt is unknown who might negotiate for Hamas and have the authority to make decisions. Hamas officials could not immediately be reached for comment.\n\n“As a practical matter, how one executes a ceasefire or achieves a ceasefire with the command-and-control structures of Hamas in disarray is really a challenge,” said Brian Katulis, a senior fellow at the Middle East Institute think-tank in Washington.\n\nFrom the Israeli perspective, some analysts say, now might be the time to hit leader-less Hamas harder instead of backing off, raising the prospects that the war could intensify.\n\n“With Israel’s revenge account still open with Iran and proxy rockets dropping on Tel Aviv, it will be hard for PM Netanyahu to pivot to peace,” said Laura Blumenfeld, a Middle East analyst at the Johns Hopkins School for Advanced International Studies in Washington.","summary":"Joe Biden is expected to use Israel’s killing of Hamas leader Yahya Sinwar to pressure Prime Minister Benjamin Netanyahu to wind down the war in Gaza. But in the waning months of his term the U.S. president may lack leverage to bend the Israeli leader to his will. The demise of Sinwar, mastermind of Hamas&#8217; [&#8230;]","url":"https://www.fbcnews.com.fj/world/after-sinwar-death-biden-faces-big-obstacles/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2024/10/Biden-2.jpg","video":null,"publish_date":"2024-10-17 23:40:35","author":"Fredrica Nagan,Reuters]","authors":["Fredrica Nagan","Reuters]"],"language":"en","source_country":"fj","sentiment":-0.101},{"id":260123262,"title":"Republicans say they’re appealing a Georgia judge’s ruling that invalidates seven election rules","text":"ATLANTA (AP) — National and state Republicans on Thursday appealed a judge’s ruling that said seven election rules recently passed by Georgia’s State Election Board are “illegal, unconstitutional and void.”\n\nThe Republican National Committee and the Georgia Republican Party are appealing a ruling from Fulton County Superior Court Judge Thomas Cox, who ruled Wednesday that the State Election Board did not have the authority to pass the rules and ordered it to immediately inform all state and local election officials that the rules are void and not to be followed.\n\nThe rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.\n\nIn a statement Thursday announcing the appeal. RNC Chairman Michael Whatley accused Cox of “the very worst of judicial activism.”\n\n“By overturning the Georgia State Election Board’s commonsense rules passed to safeguard Georgia’s elections, the judge sided with the Democrats in their attacks on transparency, accountability, and the integrity of our elections,” Whatley said. “We have immediately appealed this egregious order to ensure commonsense rules are in place for the election — we will not let this stand.”\n\nThe ruling came in a lawsuit filed by Eternal Vigilance Action, an organization founded and led by former state Rep. Scot Turner, a Republican. The suit argued that the State Election Board overstepped its authority in adopting the rules.\n\nThe ruling was hailed as a victory by Democrats and voting rights groups, who say rules the State Election Board has passed in recent months could be used by allies of Donald Trump to cast doubt on results if the former president loses the presidential election to Democratic Vice President Kamala Harris. Recent appointments to the five-member board have put three Trump-endorsed Republicans in the majority. They have passed new rules over the objections of the board’s lone Democrat and the nonpartisan chair.\n\nCounty election officials from around the state — the people who run the elections — have voiced concerns over the flood of new rules taking effect so close to Election Day.\n\nThe other rules Cox said are illegal and unconstitutional are ones that: require someone delivering an absentee ballot in person to provide a signature and photo ID; demand video surveillance and recording of ballot drop boxes after polls close during early voting; expand the mandatory designated areas where partisan poll watchers can stand at tabulation centers; and require daily public updates of the number of votes cast during early voting.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"ATLANTA (AP) — National and state Republicans on Thursday appealed a judge&#8217;s ruling that said seven election rules recently passed by Georgia&#8217;s State Election Board...","url":"https://wsvn.com/news/politics/republicans-say-theyre-appealing-a-georgia-judges-ruling-that-invalidates-seven-election-rules/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240828Democrats-sue-to-block-Georgia-rules-that-they-warn-will-block-finalization-of-election-results-1.png","video":null,"publish_date":"2024-10-17 23:35:13","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","category":"politics","source_country":"us","sentiment":-0.089},{"id":260123332,"title":"How Trump’s 'dangerous game of chicken' puts the 'security of the country' at risk: expert","text":"Former Donald Trump officials, such as ex-Secretary of Defense Mark Esper, and ex-White House aide Cassidy Hutchinson, have called the 2024 GOP nominee a \"threat to democracy,\" according to nationalsecurityaction.org.\n\nIn an op-ed published by Rolling Stone Thursday, Heath Brown, an assistant professor of public policy at John Jay College of Criminal Justice and the Graduate Center, City University of New York, sounded the alarm on Trump's \"dangerous game\" that will risk \"the safety an security of the country.\" \n\nBrown writes, \"Ominous signs right now suggest Trump’s plan for this transition is chaotic and risky, flouting rules established to keep the country safe and secure,\" but \"most worrisome about the Trump planning, though, is the dangerous game of chicken he is playing with the outgoing Biden White House.\" \n\nREAD MORE: 'Almost loved me to death': Officer who defended Capitol slams Trump Over J6 'Day of Love'\n\nThe public policy expert noted, \"We recently learned that the Trump transition team has not yet signed a memorandum of understanding (MOU) with the General Services Administration or the White House, missing deadlines established to ensure careful planning and cooperation occurs before and after the election (the Harris-Walz transition team signed its MOU in mid-September).\"\n\nBrown then lays out what exactly this means.\n\n \"The Trump transition team — should he win in November — will not receive the assistance the government offers to major party candidates, including millions of dollars in federal assistance, free office space and information technology, and access to federal experts,\" he writes. \"Any transition team choosing to opt out of these services is at best foolish. At worst, it’s risking the safety and security of the country, and depriving the president-elect of the information needed to effectively govern on day one.\n\nREAD MORE: 'Especially problematic': Trump lawyers want evidence hidden from public until after election\n\nBrown's full commentary is available at this link (subscription required).","summary":"Former Donald Trump officials, such as ex-Secretary of Defense Mark Esper, and ex-White House aide Cassidy Hutchinson, have called the 2024 GOP nominee a \"threat to democracy,\" according to nationalsecurityaction.org.\n\nIn an op-ed published by Rolling Stone Thursday, Heath Brown, an assistant professor of public policy at John Jay College of Criminal Justice and the Graduate Center, City University of New York, sounded the alarm on Trump's \"dangerous game\" that will risk \"the safety an security of the country.\" \n\nBrown writes, \"Ominous signs right now suggest Trump’s plan for this transition is chaotic and risky, flouting rules established to keep the country safe and secure,\" but \"most worrisome about the Trump planning, though, is the dangerous game of chicken he is playing with the outgoing Biden White House.\" \n\nREAD MORE: 'Almost loved me to death': Officer who defended Capitol slams Trump Over J6 'Day of Love'\n\nThe public policy expert noted, \"We recently learned that the Trump transition team has not ye","url":"https://www.alternet.org/trump-national-security-threat/","image":"https://www.alternet.org/media-library/image.jpg?id=23476255&width=1200&height=600&coordinates=0%2C15%2C0%2C15","video":null,"publish_date":"2024-10-17 23:35:02","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":-0.302},{"id":260123198,"title":"Trump says Apple’s Tim Cook called him — here were the CEO’s  concerns","text":"Republican presidential candidate Donald Trump said he received a call from Apple CEO Tim Cook over concerns about the financial penalties that have been imposed by the European Union on the iPhone maker.\n\nApple did not respond to a request seeking confirmation of the authenticity of the phone call.\n\nEuropean regulators have launched a series of investigations into Big Tech firms in recent years, with the aim of curbing their power and ensuring a level playing field for smaller rivals.\n\n“Two hours ago, three hours ago, he (Cook) called me,” Trump said, while speaking with podcaster Patrick Bet-David in a program that was released on Thursday. “He said the European Union has just fined us $15 billion. … Then on top of that they got fined by the European Union another $2 billion,” Trump added, quoting his call with Cook.\n\nLast month, Apple lost a long-running court battle with the European Union, resulting in Apple’s being forced to pay 13 billion euros ($14.08 billion) in back taxes to Ireland, as part of a wider crackdown. Earlier this year, the company was hit with a $2 billion EU antitrust fine for thwarting competition from music streaming rivals via restrictions on its App Store.\n\n“Tim, I got to get elected first. … But I’m not going to let them take advantage of our companies. That won’t be happening,” Trump quoted himself as saying to Cook, during the nearly 90-minute podcast appearance.\n\nTrump and Democrat Kamala Harris are locked in a close race to win the Nov. 5 presidential election.","summary":"Republican presidential candidate Donald Trump said he received a call from Apple CEO Tim Cook over concerns about the financial penalties that have been imposed by the European Union on the iPhone maker. Apple did not respond to a request seeking confirmation of the authenticity of the phone call. European regulators have launched a series of investigations into Big &#8230;\n\n\nThe post Trump says Apple’s Tim Cook called him — here were the CEO’s  concerns appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/trump-says-apples-tim-cook-called-him-here-were-the-ceos-concerns/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-1kdfk4dsq-1729205467430.jpg?quality=75&strip=all&1729191089&w=1024","video":null,"publish_date":"2024-10-17 23:34:36","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.596},{"id":260124380,"title":"Trump lashes out at Harris for missing traditional NYC Catholic charity event","text":"A presidential election tradition dating back to 1960 is set to bring some laughs in New York City on Thursday night, but for the first time in 40 years, only one candidate will be on the dias.\n\nFormer President Donald Trump will attend the New York Archdiocese's annual Alfred E. Smith Memorial Foundation Dinner at the New York Hilton along with his wife Melania. Vice President Kamala Harris announced last month that she could not attend due to a conflicting campaign event.\n\n\"She is going to be campaigning in a battleground state that day, and the campaign wants to maximize her time in the battlegrounds this close to the election,\" a campaign official told ABC News on Sept. 23.\n\nThe vice president attended several campaign events in Wisconsin Thursday, however, there were reports she could still make her mark at the New York gala.\n\nTrump claimed in a Truth Social post Thursday evening that Harris was going to post a video message at the event and chastised her for the alleged move.\n\n\"They didn’t give me the option of a video message, nor would I have done it. This is very disrespectful to everyone involved,\" he said adding that Harris should lose the Catholic vote over this.\n\nThe Harris campaign did not immediately return requests for comment to ABC News about possibly appearing at the dinner via video.\n\nSince 1960, the black-tie event has hosted both the Democratic and Republican presidential candidates and allowed them to \"share self-deprecating humor\" and raise money for the archdiocese's charitable organizations.\n\nIt is named in honor of Alfred E. Smith, the former New York governor who was the first Catholic to be nominated to a major party's presidential ticket.\n\nThe last time a presidential candidate could not attend the dinner was in 1984, when Democratic nominee Walter Mondale bowed out.\n\nThis year's event will be hosted by comedian Jim Gaffigan, who currently plays Gov. Tim Walz on \"Saturday Night Live.\"\n\nPrior to the gala, Trump visited a barbershop in the Bronx.\n\nTrump confirmed his attendance in a Truth Social post on Sept. 23, not long after Harris' campaign announced she would not show up.\n\n\"It's sad, but not surprising, that Kamala has decided not to attend,\" he said in the post.\n\nIn the same post, Trump accused Harris of being anti-Catholic and repeated past claims, without evidence, that the administration was persecuting Catholics. President Joe Biden is the second Catholic president in American history and attends mass weekly.\n\nIn the past, the presidential candidates have roasted each other and appeared to be in good spirits throughout the night. However, things were different in 2016, the last time both of the presidential candidates attended the event in person.\n\nTrump was booed during his 2016 Al Smith dinner speech for repeatedly attacking Sec. of State Hilary Clinton.\n\nDuring Clinton's remarks, the Democratic nominee made some self-deprecating jokes about her stamina and paid speeches, before turning her attention to Trump, where she jabbed him on everything from his temperament to his ties to Russia.\n\nTrump did not laugh or appear to be amused by his opponent's jokes.\n\nABC News' Soo Rin Kim, Fritz Farrow, Gabriella Abdul-Hakim and Will McDuffie contributed to this report.","summary":"The New York Archdiocese's star-studded gala has been a staple in election years since 1960. But only one candidate is showing up in person this year.","url":"https://abcnews.go.com/Politics/trump-lashes-harris-missing-traditional-nyc-catholic-charity/story?id=114906682","image":"https://i.abcnewsfe.com/a/673198db-7f2c-47bb-b98b-91db31c005b0/trump-3-gty-er-241017_1729200915295_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-10-17 23:33:40","author":"Ivan Pereira","authors":["Ivan Pereira"],"language":"en","source_country":"us","sentiment":-0.318},{"id":260122888,"title":"Letters: EVs’ emissions | Fremont school board | Acalanes board | Measure S | Climate voter | Better off","text":"EVs aren’t a panacea\nfor CO2 emissions\n\nRe: “It’s time for Californians to go all in on fully electric vehicles” (Page A6, Oct. 15).\n\nWhile completely electric cars create less carbon emissions than hybrids and gasoline vehicles, converting to EVs may be better for the environment but we must consider the claim in full before going all in.\n\nThe intensive manufacturing of today’s EVs can produce around 80% more emissions during production compared to building gasoline vehicles, due to the main component of the battery being lithium, and the extensive process of mining the material. Although electric vehicles emit less CO2 than other cars over their life cycle, lithium-ion batteries wind up in landfills since recycling them is harder than creating new ones.\n\nIf carbon emissions were the only factor to consider, then it’s safe to go all in. However, if a more holistic approach were to be taken, considering the water and soil contamination seen during the lithium-mining process, then there are serious concerns to consider about electric vehicles.\n\nKasey Nguyen\n\nNair offers fresh voice\nfor Fremont board\n\nIn a district craving fresh energy, 18-year-old Rinu Nair is emerging as a dynamic candidate in the Fremont Unified School District Area 4 trustee race. A former student and wellness advocate, Rinu brings an often-overlooked perspective — one from inside the classroom. Having just graduated, she intimately understands the pressures students face, especially in mental health and academics.\n\nWith the current board lacking a student voice, Rinu’s candidacy is a breath of fresh air. Her focus on wellness, education and student needs sets her apart from traditional candidates. For those seeking true student representation, Rinu is the bold, new voice FUSD needs.\n\nKeep Wendy Reicher\non Acalanes board\n\nWendy Reicher is a believer, a caring, smart energizing force, and a champion for our teens.\n\nAs a parent, friend and counselor, she teaches kids to advocate for themselves, to get summer jobs, to take charge of their future. She’s guided me and other frustrated parents through 504s, IEPs, SATs, ACTs, WUE, APs and every other set of numbers and initials flung our way. She’s keenly aware of our budget challenges and ready to face them head-on. Wendy has a pragmatic way of acknowledging what is and a sharp mind for creative problem-solving to determine what could be.\n\nI call Wendy my “spark plug,” and I know I’m just one of many who feel this way about her, who have benefited from her care, tenacity and fire. Our board needs its spark plug. Vote for Wendy Reicher.\n\nBeverly Jane Peatross\n\nGive Pleasant Hill’s\nMeasure S a no vote\n\nPlease vote no on Measure S, a $77 million bond to further fund the Pleasant Hill Recreation and Park District, already one of the best-funded districts of its size in California.\n\nThe bonds, if approved, will increase property taxes for everyone in the district, at a time when many of us are challenged, and require a repayment of $126 million over 30 years — 30 years of tax increases.\n\nThe district already has two outstanding bonds and the voters said “no” to a similar measure, the 2020 Measure A that would have burdened taxpayers with $63.5 million of new debt. After a strong no vote on Measure A, the district is so out of line with its constituents that it actually asked for more.\n\nThe district has an insatiable appetite for spending that needs to stop.\n\nDavid Martinez\nPleasant Hill\n\nOn Nov. 5, be a\nvoter for the climate\n\nMy patient George suffered acute kidney failure from working outside during a weeklong heat wave. He recovered, but not everyone will be so lucky. Over 600 people died of heat in Phoenix in 2023. Hurricanes like Helene and Milton — supercharged by the same trapped heat — killed hundreds, devastating lives and property. The American Medical Association calls climate change a public health crisis. Everyone is at risk.\n\nThe remedy: leaders and policies to rapidly reduce carbon emissions. We already have the technology, and transitioning to clean energy will provide immediate health benefits by cleaning the air we breathe. But progress is stymied by fossil fuel-funded denial and delay. “Drill baby drill” is a poisonous prescription.\n\nWe as voters have the power to change that. Act now. Confirm, register and make a voting plan. Share your concerns with friends. On Nov. 5, be a voter for climate and health.\n\nCynthia Mahoney\n\nJoe Biden’s America\nbetter than 4 years ago\n\nAre we better off today than we were four years ago?\n\nWhen Donald Trump left office, the nation was in chaos. People were dying and the economy was tanking due to Trump’s mishandling of the COVID epidemic and giveaways to the wealthiest Americans that blew up the national debt. NATO and other international alliances were in shambles, leading to Vladimir Putin’s invasion of Ukraine. Immigrant families were separated and living in cages at the border. And Trump threw the Palestinians under the bus, leading directly to the terror of Oct. 7.\n\nJoe Biden re-established the rule of law, rebuilt our alliances, stood up for Ukraine, negotiated strong immigration legislation (which Trump blocked), and invested in our country’s infrastructure, preventing a recession. As a result, the economy is doing better and inflation is decreasing. Clearly, we are better off now than four years ago.\n\nAndrew Scharlach","summary":"East Bay Times Letters to the Editor for Oct. 18, 2024","url":"https://www.mercurynews.com/2024/10/17/letters-1906/","image":"https://www.mercurynews.com/wp-content/uploads/2024/01/OCR-L-RECYCLINGREENTECH-0120-24-1.jpg?w=1024","video":null,"publish_date":"2024-10-17 23:30:58","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.122},{"id":260122966,"title":"How Trump’s Radical Tariff Plan Could Wreck Our Economy","text":"Donald Trump has flip-flopped on many issues: Today, he says he’s pro-life; in 1999, he said, “I’m very pro-choice.” Last year, he said Republicans should “never give up!” on trying to repeal Obamacare; during September’s presidential debate, he said, “I saved it.” Three years ago, he said Bitcoin “seems like a scam”; now he wants to make America the “crypto capital of the planet.”\n\nBut Trump’s desire for high tariffs has been consistent. In an interview on Tuesday at the Economic Club of Chicago, he said, “To me, the most beautiful word in the dictionary is ‘tariff.’” As president, he called himself “a Tariff Man.” In fact, he imposed substantial tariffs when in office. Those actions were, however, mild compared with the tariffs he is proposing now. He initially suggested a 10 percent tariff on all imports, but now he talks about tariffs as high as 20 percent. (In Chicago, he even mused about 50 percent.) He wants a 60 percent tariff on imports from China.\n\nMost economists believe that this would be a terrible idea, and I share that view. I’m not a free-trade purist; I opposed the Obama administration’s proposed Trans-Pacific Partnership and have been generally supportive of the much tougher line the Biden-Harris administration has taken on trade.\n\nBut there’s a big difference between sophisticated, limited deviations from free trade and Trump’s desire to put what he called a “ring around the collar” of our economy.","summary":"There’s no upside to the former president’s pet economic plan.","url":"https://www.nytimes.com/2024/10/17/opinion/trump-tariffs-economy.html","image":"https://static01.nyt.com/images/2024/10/17/opinion/17krugman1/17krugman1-facebookJumbo.jpg","video":null,"publish_date":"2024-10-17 23:30:07","author":"Paul Krugman","authors":["Paul Krugman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.073},{"id":260125706,"title":"Republicans say they're appealing a Georgia judge’s ruling that invalidates seven election rules - The Associated Press","text":"ATLANTA (AP) — National and state Republicans on Thursday appealed a judge’s ruling that said seven election rules recently passed by Georgia’s State Election Board are “illegal, unconstitutional and void.”\n\nThe Republican National Committee and the Georgia Republican Party are appealing a ruling from Fulton County Superior Court Judge Thomas Cox, who ruled Wednesday that the State Election Board did not have the authority to pass the rules and ordered it to immediately inform all state and local election officials that the rules are void and not to be followed.\n\nThe rules that Cox invalidated include three that had gotten a lot of attention — one that requires that the number of ballots be hand-counted after the close of polls and two that had to do with the certification of election results.\n\nIn a statement Thursday announcing the appeal. RNC Chairman Michael Whatley accused Cox of “the very worst of judicial activism.”\n\n“By overturning the Georgia State Election Board’s commonsense rules passed to safeguard Georgia’s elections, the judge sided with the Democrats in their attacks on transparency, accountability, and the integrity of our elections,” Whatley said. “We have immediately appealed this egregious order to ensure commonsense rules are in place for the election — we will not let this stand.”\n\nAlex Kaufman, a lawyer for the state Republican Party, said Thursday that the party filed an emergency notice of appeal with the Georgia Supreme Court.\n\nThe ruling came in a lawsuit filed by Eternal Vigilance Action, an organization founded and led by former state Rep. Scot Turner, a Republican. The suit argued that the State Election Board overstepped its authority in adopting the rules.\n\n“Seeing the Republican Party argue that unelected bureaucrats should have the power to make new law is certainly a departure from traditional conservative values,” Turner wrote in a text to The Associated Press. “But we expected them to appeal and are prepared to fight on behalf of reining in this administrative-state power grab as long as we need to.”\n\nThe ruling was hailed as a victory by Democrats and voting rights groups, who say rules the State Election Board has passed in recent months could be used by allies of Donald Trump to cast doubt on results if the former president loses the presidential election to Democratic Vice President Kamala Harris. Recent appointments to the five-member board have put three Trump-endorsed Republicans in the majority. They have passed new rules over the objections of the board’s lone Democrat and the nonpartisan chair.\n\nCounty election officials from around the state — the people who run the elections — have voiced concerns over the flood of new rules taking effect so close to Election Day. \n\nThe other rules Cox said are illegal and unconstitutional are ones that: require someone delivering an absentee ballot in person to provide a signature and photo ID; demand video surveillance and recording of ballot drop boxes after polls close during early voting; expand the mandatory designated areas where partisan poll watchers can stand at tabulation centers; and require daily public updates of the number of votes cast during early voting.\n\nOne rule that the judge overturned required that three separate poll workers count the number of Election Day ballots by hand to make sure the number of paper ballots matches the electronic tallies on scanners, check-in computers and voting machines. \n\nGeorgia voters make selections on a touchscreen voting machine that prints a paper with a human-readable list of the voter’s choices as well as a QR code. The voter puts that ballot in a scanner, which records votes. The hand-count would be of the paper ballots — not the votes. \n\nCritics, including many county election officials, argued that a hand-count could slow the reporting of results and burden poll workers at the end of an already long day. They also said there isn’t enough time for adequate training.\n\nThe rule’s supporters argued the count would take extra minutes, not hours. They also noted that scanner memory cards with vote tallies could be sent to county offices while the hand-count is completed so reporting of results wouldn’t be slowed.\n\nCox wrote that the rule “is nowhere authorized” by Georgia laws, which “proscribe the duties of poll officers after the polls close. Hand counting is not among them.”\n\nTwo other new rules that Cox invalidated were passed by the State Election Board in August and have to do with certification. One provides a definition of certification that includes requiring county officials to conduct a “reasonable inquiry” before certifying results, but it does not specify what that means. The other includes language allowing county election officials “to examine all election related documentation created during the conduct of elections.”\n\nSupporters argued those rules are necessary to ensure the accuracy of the vote totals before county election officials sign off on them. Critics said they could be used to delay or deny certification.","summary":"Republicans say they're appealing a Georgia judge’s ruling that invalidates seven election rules  The Associated Press","url":"https://apnews.com/article/georgia-election-rules-invalidated-appeal-f5a6fd0ca2dffb13eed3d2a89494b25f","image":"https://dims.apnews.com/dims4/default/795808e/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F52%2Ffbe35c51c593e12a6ffe07316dbd%2F00efd72332ca4fb5a9192aa991b9927b","video":null,"publish_date":"2024-10-17 23:30:00","author":"Jeff Amy,Kate Brumback","authors":["Jeff Amy","Kate Brumback"],"language":"en","category":"politics","source_country":"us","sentiment":-0.176},{"id":260126048,"title":"Harris campaign tacks as anxiety rises over Trump gains","text":"Vice President Kamala Harris is shifting her campaign strategy to win over more men and Republicans, and sharpening her attacks on Donald Trump as Democratic anxieties rise over polls showing her rival making strong gains.\n\nThe Democratic nominee is in a statistical dead heat in crucial states with Trump, the Republican former president, according to public and internal campaign polls cited by Democratic sources, sparking a round of finger-pointing and second-guessing from some corners.\n\nIt is a frustrating moment for a whirlwind campaign that opened with a huge jump in enthusiasm and cash when she replaced President Joe Biden in July, put on a robust Democratic convention and was widely hailed as the winner of her only debate with Trump.\n\n“This was always going to be a tight race…That doesn’t mean we’re not losing sleep over it,” said a senior Democratic campaign aide, reflecting what interviews with donors, aides and advisers show is the mood at the White House and the Wilmington, Delaware-based campaign headquarters.\n\nAfter weeks of focusing on policy and trying to define herself on the national stage, Harris is going back to her prosecutorial posture of July, an adviser said, hoping to demonstrate strength to voters who might be attracted to Trump’s strongman image.\n\nAt her Monday night rally in Erie, Pennsylvania, she took the rare step of showing clips of Trump’s remarks about an “enemy within” America to underscore her argument that he poses a danger to the country.\n\nThis week, she sat down with Charlamagne tha God to reach Black men and followed up with a confrontational interview with Fox News to address conservatives. Popular podcaster Joe Rogan and his young, male followers could be next.\n\nNationally, Harris’ edge has narrowed from a late September lead of seven points over Trump to just three, Reuters/Ipsos polling shows. More concerning for Democrats: she and Trump are statistically tied in the seven crucial battleground states that will decide the race.\n\nThe narrowing polls come as high food and rent prices continue to worry Americans and Trump capitalizes on fears related to migrants crossing the southern border with increasingly extreme rhetoric.\n\nStock markets just hit record highs and some prominent analysts say Harris’ policies would create less debt and spur more economic growth than Trump’s would, but polls suggest voters trust Trump more on one of the top election issues – the economy.\n\n“Kamala Harris is the underdog, like she’s been saying all along,” said Democratic strategist Anthony Coley. “Many folks thought that language was just political posturing … But it was true when she first said it in July and true now three weeks out.”\n\nThree Trump donors told Reuters in recent days that they were feeling increasingly confident about Trump’s chances, chalking the shift up to Americans’ focus on immigration and Trump’s flurry of recent rallies and events.\n\n“I was on the phone with the campaign. They’re guardedly optimistic,” said one donor.\n\n“We just need to win one of the blue wall states, it’s very doable,” he said, referring to Michigan, Wisconsin and Pennsylvania, which would give Trump the White House if he also wins Arizona, Nevada, Georgia and North Carolina.\n\nAsked about the close race on Wednesday, Harris said: “This is an election for president of the United States. It’s not supposed to be easy.”\n\nMARGIN OF ERROR RACE\n\nNationally, Harris has comfortably won back the suburbs and middle-class voters that had slipped to Trump in the final months of Biden’s campaign, Ipsos/Reuters polling shows.\n\nBut internal Harris campaign polls show her within the margin of error in each of the seven battleground states that will help determine the winner, two sources with direct knowledge of the matter said. In the latest batch, she is tied in Pennsylvania, up slightly in Wisconsin and down in Michigan, one source said.\n\nSupport from men of all races – where Harris’ numbers lag Biden’s – is a major weakness. The campaign’s strategy of aiming toward the center and its failure to fully engage with local Democrats is another, some Democrats say.\n\nVoter outreach in Michigan has been subpar, said Byron Nolen, mayor of Inkster, a Detroit suburb, and president of the local Democratic club. He said he had to ask the campaign for yard signs and other basic supplies for local voters.\n\n“In my brain, they could have done Michigan better,” he said. “We’re still trying to get people excited.”\n\nHarris’ focus on Republicans, even as she ignores some Democrats’ demands to differentiate herself from Biden’s policy of staunch support to Israel, is a concern for others.\n\nAaron Regunberg, a progressive Democratic politician and former Rhode Island representative, questioned the campaign shift from saying “Republicans are weird,” a summertime message about Trump and his running mate JD Vance, to “Republicans are great, I want them in my cabinet.”\n\nHe argues that instead of touting endorsements from Republicans like Alberto Gonzales, a former attorney general under President George W. Bush, Harris should have publicly broken from Biden’s Gaza policy to win more support.\n\nWith plenty of cash in their coffers, Democrats plan to continue their ground game operation in all seven battleground states and to outspend Trump on digital and television ads. There are no plans right now for Harris to narrow her public appearances to the most critical states.\n\n“Our strategy is to compete everywhere, expand the map, and maximize the number of pathways to victory,” campaign chair Jen O’Malley Dillon wrote in a recent email staff and volunteers.\n\nThis week Harris makes stops in Pennsylvania, Michigan, and Wisconsin, while her running mate, Minnesota Governor Tim Walz, holds events in Wisconsin, western Pennsylvania, North Carolina and Nebraska’s second congressional district, where a win could provide a potentially crucial single electoral vote for Harris.\n\n“It’s the final stretch in a close election similar to 2016 and 2020,” said Democratic strategist Donna Brazile. “I remain cautiously optimistic.”","summary":"Vice President Kamala Harris is shifting her campaign strategy to win over more men and Republicans, and sharpening her attacks on Donald Trump as Democratic anxieties rise over polls showing her rival making strong gains.","url":"https://www.staradvertiser.com/2024/10/17/breaking-news/harris-campaign-tacks-as-anxiety-rises-over-trump-gains/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241017_brk_ele01.jpg","video":null,"publish_date":"2024-10-17 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":0.009},{"id":260123784,"title":"Amid worries that Democrats' blue wall may be cracking, governors hit the road for Kamala Harris - The Associated Press","text":"FLINT, Mich. (AP) — The Democratic governors of Michigan, Pennsylvania and Wisconsin this week embarked on a swiftly organized bus tour, rolling through the autumn landscape to press the urgency of the case for Vice President Kamala Harris in must-win states where some Democrats worry that she’s struggling.\n\nMichigan Gov. Gretchen Whitmer, Pennsylvania Gov. Josh Shapiro and Wisconsin Gov. Tony Evers all descended on Flint Thursday afternoon, joined by the chairman of the national Democratic Party, Jaime Harrison. In a joint interview with The Associated Press, all three acknowledged the enormity of the stakes but dismissed any suggestion that their effort reflected anything other than the need to have all hands engaged in the fight. \n\n“All three of us know what it’s like to compete and win really tough, close races,” said Shapiro. “So I think the more we can get out there and not only thank volunteers for being here today, we can also maybe calm some nerves too.”\n\nDespite these reassurances, some Michigan Democrats have voiced concerns about Harris’ chances in the state against former President Donald Trump. Rep. Debbie Dingell has remarked that “no one” is currently winning Michigan, while Rep. Elissa Slotkin, running for the U.S. Senate, has said that she’s seen signs that Harris is trailing in the state.\n\nAt an indoor farmer’s market in Flint, signs of an event that came together quickly were hard to miss. Music blared from an iPhone after the venue’s sound system failed. One attendee, Debbie McIntosh, said she received a “last-minute invitation yesterday.”\n\n“I was surprised, I just thought Gov. Whitmer was going to be here. I didn’t know Shapiro and the governor of Wisconsin were going to be here,” said McIntosh, from the nearby city of Grand Blanc. \n\nWhile winning the three “blue wall” states — so named because they have long represented crucial elements of the Democratic Party’s path to victory — isn’t Harris’ only way to win, it is her clearest based on recent elections. But she faces challenges in each, including concerns about Black voter turnout in the largest cities — Detroit, Milwaukee and Philadelphia — and growing frustration over the Israel-Hamas war, which has angered both Arab American and Jewish voters.\n\nHarris has worked hard to address the concerns, and she is intensifying her campaign schedule in the region. She plans to spend nearly the entire week in the blue wall states, ending with multiple events in Michigan on Friday and Saturday.\n\nNo one knows how to win these states better than their Democratic governors, all of whom won reelection in 2022. \n\nWhitmer, the co-chair of Harris’ campaign, said that the idea came up on a call between the governors and Harris’ campaign. Whitmer is funding and organizing the tour. \n\n“When it became clear that the whole world’s going to be focused on our three states, I said what can we do that’s going to be helpful, that’s going to motivate people?” she said. “And I said, hey, what do you think of the bus tour?”\n\nThe tour kicked off Monday in Wausau, Wisconsin, before making its way across the state and arriving in Michigan on Wednesday. It will continue to Pennsylvania over the weekend. \n\nAddressing the Michigan crowd, the three governors emphasized the high stakes of the 2024 presidential race, each in their own style: Whitmer and Shapiro took a flashier approach, while Evers commanded the room in quieter tones.\n\nLess spoken but not well hidden was the fact that each was staking a lot on the outcome. They know the importance of delivering their states for Harris, and the possible consequences of serving as governor under a president who has vowed to seek retribution against his political opponents looms over the campaign.\n\nWhitmer and Shapiro, both once considered potential vice presidential picks before Harris chose Minnesota Gov. Tim Walz, also have their own political futures at stake, win or lose. Both have been mentioned as future presidential contenders themselves, though their prospects could be diminished by defeat in the states they preside over.\n\n“When we ask the question, how did you beat back the red wave in 2022? You’re looking at it,” said Harrison, the DNC chair. “These three governors right here had three of the toughest races in that midterm election in the three battleground states that will determine this presidential election.”\n\nWinning these states depends on reuniting a Democratic coalition that has been strained, particularly among Jewish and Arab American communities over the Israel-Hamas war. While Harris can address these issues on a national scale, the governors have strong connections within their communities.\n\nWhitmer has kept close ties with Arab American and Jewish leaders in metro Detroit, working to ease tensions amid the ongoing war. While some Arab American leaders have cut off contact with Democrats over the tensions, Whitmer’s long-standing relationships in Dearborn have kept dialogue open on both state and national issues, says Osama Siblani, publisher of Arab American News.\n\nShapiro, who is Jewish, also said he has remained in close contact with Jewish and Arab Americans and is hopeful that each community “is able to have enough capacity in our hearts to hold everyone’s pain and understand that this hurts everyone, and that we all want to see an end to this war.’'\n\n“There’s all sorts of thorny things going on in the world today,” Evers said. “Absolutely. Those things don’t stop because the U.S. is having an election. \n\n“But who’s best to take care of those problems? It’s Kamala Harris. It is not somebody that’s going to come in shooting from the hip, thinking he’s is going to come in like a bull moose and take care of all problems.”","summary":"Amid worries that Democrats' blue wall may be cracking, governors hit the road for Kamala Harris  The Associated Press","url":"https://apnews.com/article/governors-whitmer-shapiro-evers-harris-democrats-9b23fedbfd7dcb3fe1e6b1909e08cc4c","image":"https://dims.apnews.com/dims4/default/8910ccb/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F59%2Fe182490b1a4b7ea1d7cb1f511679%2F7922920b81f347819ef05e000df6fdc1","video":null,"publish_date":"2024-10-17 23:21:00","author":"Joey Cappelletti","authors":["Joey Cappelletti"],"language":"en","source_country":"us","sentiment":-0.092},{"id":260122884,"title":"Canadian cannabis laws show six years of evolution","text":"No one expected Canada’s cannabis laws to be perfect from the get-go.\n\nWhen Canada legalized cannabis for adult use six years ago this week, politicians built in a timeline that ensured that it would be a work in progress.\n\nEdibles and drinks were not made legal until late 2019, and then took a while to find their way to shelves due to regulatory hurdles.\n\nBaby-step changes for things such as online ordering and delivery were walked out provincially with no advance warnings.\n\nFederal laws and regulations were supposed to be re-examined five years later, in 2023.\n\nHealth Canada is now finally getting around to changing dozens of regulations governing the sector. It halted consultation on these changes in July, and bureaucrats are readying to “gazette” the new regulations, which is the final process for changing regulations, given that there is no need for Parliament to pass a bill.\n\nThe department has estimated that its changes will provide the industry $41 million in administrative and compliance cost savings.\n\nIndustry insiders told BIV that they tend to like the changes, though in some cases they said that they would have liked bigger thinking, and a more substantial overhaul.\n\nThey doubt that the changes will be done in time for the sixth anniversary of legalization, on October 17. Instead, they estimate the tweaks are likely to occur within the next six months—barring a snap federal election.\n\nWhen Canada legalized cannabis for non-medical use in 2018, its plan was to tightly regulate the sector and to tax it heavily.\n\nThat dual burden was enough to dash many entrepreneurs’ dreams, and force countless closures and bankruptcies as companies entered creditor protection.\n\nPlenty of investors saw their capital go up in smoke.\n\nDays before legalization, units in the Global X Marijuana Life Sciences Index ETF (TSX:HMMJ) closed at what would have been $104.20, adjusted for future consolidation. The fund traded earlier this month for less than $10 per unit.\n\nThe good news is that many business executives in the sector remain positive and have told BIV that their ventures are profitable.\n\nOne wild card that gets many people excited is the chance of the U.S. legalizing cannabis countrywide.\n\nB.C. cannabis producers would be poised to capitalize on that prospect, and U.S. Democratic Party presidential candidate Kamala Harris said on September 30 that she supports nationwide legalization.\n\n“I just think we have come to a point where we have to understand that we need to legalize it and stop criminalizing this behaviour,” she said on the sports podcast “All The Smoke.”\n\nRepublican Party presidential candidate Donald Trump has suggested that he supports reforming cannabis laws but has been less clear on exactly how.\n\nBig changes down south could mean B.C. producers would at least be able to export cannabis to the U.S. for medical use. Right now, cannabis can only be exported to the U.S. for research purposes, ASDA Consultancy Services principal Deepak Anand told BIV.\n\nMedical cannabis may soon be dispensed at stores\n\nOne of the biggest planned changes to cannabis regulations, and one that Anand likes, would allow pharmacists to dispense medical cannabis to consumers at stores.\n\nShoppers Drug Mart has long been an advocate for this change.\n\nThe regulatory obstacle to this so far has been that cannabis has no drug identification number (DIN), and therefore pharmacists are unable to enter product orders into their systems.\n\nShoppers Drug Mart has operated as though it is a licensed producer, in that it has been able to accept patients’ authorizations from medical professionals to provide cannabis, but it has then been required to ship those orders to patients via mail, Anand explained.\n\n“Pharmacies are expected to be able to work with the provinces to issue something called a pseudo-DIN, which is awarded to products that are unlicensed or that are not necessarily prescription drugs, but act in the same way as prescription drugs,” he said.\n\nA bigger change that Anand would like to see is the removal of the goods and services tax (GST) and provincial sales taxes (PST) from medical cannabis.\n\nImage: ASDA Consultancy Services principal Deepak Anand has been advocating for a number of changes to Canadian cannabis laws\n\nIf the federal government declares a substance as a pharmaceutical product, PST is automatically removed, he explained.\n\n“That is not in the proposed regulatory changes, but it is something I would like to see,” he said.\n\nThe biggest tax change that the industry has been clamouring for is for the federal government to change its excise tax formula—a change not included in the proposed regulatory changes.\n\nThe excise tax formula was put in place to be either $1 per gram, or 10 per cent of the price of the cannabis sold, whichever is higher. The formula assumed a gram would sell for about $10.\n\nCannabis retailers, such as Muse Cannabis CFO and director of real estate Mike McKee, have told BIV that the wholesale price of legal cannabis has plunged in Canada because of over-supply. That has meant that McKee and other retailers could be paying $1 per gram in excise tax on a $4 price for a wholesale gram, or a rate of 25 per cent.\n\nAnother industry gripe is that Ottawa levies a 2.3-per-cent regulatory fee on cannabis, which is something that it does not do on alcohol. Health Canada does not yet have a plan to change the regulatory fees.\n\nAnand said that he believes the black market for cannabis remains strong in Canada because of the extra taxes that legal producers and retailers must bundle into their sale prices.\n\n“We have probably shifted 50 per cent from the black market in six years, which is pretty good,” said Anand who has been advocating to Health Canada officials. “There could be more of a shift.”\n\nMany smaller regulatory changes on the way\n\nLikely Health Canada regulatory changes include how cannabis products can be packaged, and that has some retailers excited.\n\nGone is expected to be the requirement that opaque packaging must cover entire packages.\n\n“Being able to have a clear window on cannabis packaging will go a long way from a sales perspective,” said Jaclynn Pehota, executive director at the Licensed Retail Cannabis Council of B.C.\n\nChanges would allow customers to see the product they’re buying.\n\n“Right now, you’re buying blind until you get home and open the bag up,” she said.\n\nA second likely big retail change is that Ottawa will allow producers to package multiple products together if the package remains under a 30-gram limit.\n\nThis means producers would be able to sell more edibles in one outer package, Pehota said.\n\n“Let’s say you have a pack of three pre-rolls,” she said. “Right now, they all must be the same flavour. With this change, the producer will be able to create a true variety pack of pre-rolls so there are multiple different cultivars in one package. That will be exciting.”\n\nStrict packaging limitations that restrict imagery and celebrity endorsements are expected to remain. Producers will, however, likely be allowed to put on packaging QR codes that link to websites with more information.\n\nGood news for micro-producers is that the federal government is likely to allow them to farm bigger plots, and grow products in spaces up to 800 metres, from the current 200 metres, Anand said.\n\nB.C. micro-producers still have beefs with fees.\n\nThe provincial government in 2022 started allowing craft or micro-producers to sell directly to customers, but the program has had little up-take because of high fees.\n\nIn addition to refundable fees for allowing bureaucrats to assess paperwork, licensing fees and ongoing renewal fees, the British Columbia Liquor Distribution Branch (BCLDB) charges micro-producers a 15-per-cent fee on products sold directly to customers, and has a 15-per-cent warehousing fee.\n\nIt is the same cost, therefore, for the micro-producer to sell directly to the customer as it would be for it to sell the product through the BCLDB and have the BCLDB incur some warehousing and other costs.\n\nIndustry has had upheaval\n\nBankruptcies, insolvencies and creditor protection applications have defined the legalization landscape, as regulatory and cost challenges dashed the big dreams of entrepreneurs.\n\nTake B.C.’s Dan Sutton for example.\n\nAfter founding licensed producer Tantalus Labs in 2012 to sell cannabis to medical patients, he took the company to the brink of profitability in early 2023, he told BIV at the time.\n\nHis venture in mid-2023 entered bankruptcy and insolvency proceedings, and in August had Newfoundland’s Atlantic Cultivation buy its assets for an undisclosed amount.\n\nOttawa’s excise tax structure was largely what killed the venture, he said.\n\nSutton has since left the cannabis sector, and is CEO at Synergetic, which claims to be leading the global transition from fossil fuels to synthetic ones.\n\nHe told BIV last year that he was looking for a job that involved “anything but” cannabis work.\n\nImage: Muse Cannabis CFO and director of real estate Mike McKee told BIV that his five stores are profitable and that is is positive about the future\n\nMany retail ventures have struggled.\n\nThe Donnelly Group’s cannabis arm Lightbox Enterprises Ltd. went into creditor protection in late 2022, when it had eight Dutch Love stores in B.C., as well as about a dozen stores in Ontario and several in Alberta, the company’s chief growth officer Harrison Stoker told BIV. It then started selling the stores.\n\nRegulatory hurdles, Stoker said, were the cause of the downfall.\n\nThe B.C. government enjoyed a 34-month monopoly on cannabis delivery within the province after legalization.\n\nThe only place that B.C. customers during that time could order legal cannabis online and get home delivery was from the government’s online store.\n\nIllicit cannabis sellers flourished online, and Solicitor General Mike Farnworth told BIV at the time that there could be police stings.\n\nThe B.C. government in March 2020 then took the step of allowing private legal cannabis retailers to conduct sales transactions online, but it required customers to go to stores to complete payments, show identification and pick up purchases. \n\nFive months later, in August 2020, the B.C. government started to allow licensed private cannabis retailers to sell products and collect payments online, but it still required customers to pick up their purchases at bricks-and-mortar stores. \n\nIt took until July 2021 for the B.C. government to allow legal private cannabis sellers to deliver products directly to consumers.\n\nEven then, onerous restrictions were placed on the sector, such as that the retailers had to own the vehicles that they were using to deliver the cannabis, and that their staff had to undergo police screening and get licensed by the province—restrictions that have since been dropped.\n\nGiven the cost of insuring vehicles for cannabis delivery, many stores do not offer that service.\n\nB.C. cannabis retailers can use Canada Post to deliver cannabis, McKee said. But customers must go to Canada Post offices to pick up the mailed product.\n\n“You don’t want to wait for that type of delivery,” he said of cannabis.\n\n“You want it delivered within the hour, or very shortly after. Mailing it and having to pick up the purchase is not the way consumers want to order the products.”\n\nMcKee said his five cannabis stores are profitable and that he is positive about the future. He said he is scouting for strong locations to expand with new stores.\n\nGary Karbar is another optimistic cannabis retailer.\n\nHe bought four Dutch Love stores out of creditor protection, and he said he plans to keep the name of the chain.\n\n“We’ve owned pharmacies,” he said to explain why he thought he had the expertise to be able to turn around the businesses.\n\n“We already have a really good understanding of retail, and how to deal with sensitive products. We are profitable.”","summary":"Swathe of new regulations expected soon, although industry insiders want bigger changes","url":"https://www.biv.com/news/economy-law-politics/canadian-cannabis-laws-show-six-years-of-evolution-9672345","image":"https://www.vmcdn.ca/f/files/biv/jaclynn-pehota-rk.jpg","video":null,"publish_date":"2024-10-17 23:20:00","author":"Glen Korstrom","authors":["Glen Korstrom"],"language":"en","source_country":"ca","sentiment":-0.413},{"id":260122660,"title":"'No-one from the Secret Service' told Donald Trump's protection detail about potential assassin, report finds","text":"Secret Service personnel displayed a \"troubling\" lack of critical thinking as to the risk posed to Donald Trump in the lead-up to a Pennsylvania assassination attempt, according to a new report.\n\nOne man was killed in the attack in Butler this year, and two others were critically injured. All three were civilians attending the rally.\n\nGunman Thomas Matthew Crooks, a 20-year-old nursing aide, was shot dead by a Secret Service sniper at the scene.\n\nAn independent panel tasked with investigating the July attack has now handed down its review of the Secret Service failures that allowed the incident to occur.\n\nThe 51-page report outlined multiple communications breakdowns and accused the organisation of becoming \"bureaucratic, complacent and static\" even as risks and technology evolved.\n\n\"The Secret Service must be the world's leading governmental protective organisation,\" the report said.\n\nThe review panel, which includes a former deputy attorney-general, former law enforcement officers and former homeland security personnel, was commissioned by Homeland Security Secretary Alejandro Mayorkas.\n\nThe report also provided an in-depth timeline of the communication breakdowns on the day, which allowed Crooks to launch his attack.\n\nThe ABC has previously reported on this timeline, which was also included in a House of Representatives committee interim report.\n\nIn its final report, the panel noted \"no-one from the Secret Service\" told the Trump detail about the suspicious person seen at the rally.\n\nThere were also not enough people protecting the American Glass Research (AGR) building Crooks climbed on top of to use as a vantage point, and a \"critical\" drone detection system was inoperable for hours on the day of the shooting.\n\n\"In addition to [these failures], the panel has identified a number of deeper concerns that also contributed to … enabling the assassination attempt,\" the report said.\n\n\"It is particularly disturbing that so many senior Secret Service agents were involved in this operation, and none of them were aware of the ambiguity at play regarding who the specific leaders with final authority were.\n\n\"The lack of such definition in practice should have been concerning to all of them.\"\n\nPart of the ambiguity, according to the report, may have been \"well-intentioned\" by Mr Trump's security detail, attempting to integrate their own staff into the security process.\n\nCultural attitudes regarding resourcing from inside the Secret Service were also noted as a concern.\n\nThe review panel said it had encountered \"repeated evidence\" that the Secret Service viewed themselves \"as operating under an informal mantra of, effectively, 'do more with less'\".\n\n\"The detrimental effects of such thinking, particularly when personnel are exposed to it over sustained periods of time, can be subtle but significant,\" their report said.\n\n\"[The panel] has encountered repeated instances of Secret Service personnel associated with the July 13 rally failing to demonstrate … critical thinking skill.\n\n\"[A] prominent instance of this is the fact that personnel [were informed] of significant intelligence regarding a long-range threat by a foreign state actor … but failed to ensure that the AGR building was secured despite its proximity to the rally stage and the obvious high angle line of sight issues it presented.\"\n\nThe panel said the attack represented a \"historic security failure\" by the Secret Service, adding it had tried to find out the origins of the organisation's lack of critical thinking.\n\n\"Lack of critical thinking can stem from many issues and there may be a multi-causal explanation,\" the report said.\n\n\"Regardless of the cause, it is unacceptable for Secret Service personnel to be unable, or unwilling, to think critically given the 'no fail' nature of the service's protective mission.\"\n\nA lack of \"ownership\" by senior officials, a lack of cohesion between local, state and federal personnel, a lack of improvement, a lack of training facilities, a lack of budget and an ineffective culture were also listed as concerns.\n\nThe panel made nine specific recommendations for future events, including mandatory and explicit situation reports and sight risk mitigations and more cohesive local, state and federal leadership practices.\n\nSome broader recommendations also called on the Secret Service to \"re-focus\" on its protective mission, look for \"fresh leadership perspectives\" and find long-term communications solutions.\n\n\"Certain individuals attract more attention and emotion — from the public, from the media, on social media and the internet, and so forth,\" the report said.\n\n\"Allocation of resources must be risk-based, with dynamic assessments, in practice.\n\n\"There were various enhanced measures put in place to protect former President Trump and others in the wake of the Butler shooting, but those measures fairly should have been expected and deployed before the tragic events that occurred there.\"\n\nFormer Secret Service director Kim Cheatle resigned in the aftermath of the attack amid intense scrutiny.\n\nIn the wake of her departure, former deputy director Ronald Rowe has stepped in as acting director.\n\nMr Rowe said in a statement following the report's release that the service was \"developing a comprehensive plan\" to drive \"fundamental transformation\" within the organisation.\n\n\"We acknowledge that July 13 did not occur because of a lack of resources, however, our enhanced protective model implemented after July 13 requires additional people, equipment, and asset capabilities.\n\n\"The men and women of the US Secret Service answer the call to protect our nation's leaders and major candidates while operating in a heightened and increasingly dynamic threat environment.\"","summary":"Secret Service personnel displayed a \"troubling\" lack of critical thinking as to the risk posed to the former president in the lead-up to the July assassination attempt, an independent review finds.","url":"https://www.abc.net.au/news/2024-10-18/secret-service-independent-review-panel-butler/104488126","image":"https://live-production.wcms.abc-cdn.net.au/4fd4f063fac10e6d4c025c005846c47f?impolicy=wcms_crop_resize&cropH=1303&cropW=2317&xPos=0&yPos=121&width=862&height=485","video":null,"publish_date":"2024-10-17 23:16:39","author":"Brianna Morris-Grant","authors":["Brianna Morris-Grant"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.451},{"id":260123242,"title":"First day of early voting in North Carolina could set new record despite Helene","text":"The North Carolina State Board of Elections Executive Director Karen Brinson Bell told reporters in Asheville, Thursday afternoon that turnout had been “terrific” thus far statewide.\n\nVOTER REGISTRATION AND EARLY VOTING: KEY DATES AND DEADLINES IN THE 2024 ELECTION\n\n“It is anticipated that this may actually be our best early voting day ever, or at least for the opening day, which is what we experienced in 2020. So, we’ll see,” said Brinson Bell.\n\nEarly voting hours at locations statewide fluctuate depending on the day and week. As of Thursday, the state had early voting open in all 100 counties, including 76 early voting sites in the 25 counties severely hit by the hurricane.\n\nEarly voting has started in North Carolina! There’s a pretty long line here at the Hemby Bridge Volunteer Fire Dept. in Union County. Let me know if you have any questions about the process or voting that we can help answer. #votingmatters #Election2024 #earlyvoting… pic.twitter.com/pdAzTAMz9Q— Jason Puckett (@JasonPWBTV) October 17, 2024\n\nNot far away in Georgia, early voting commenced Tuesday with a record-high number of early voters casting ballots on the first day of an election in a presidential race year.\n\nThe high turn-out in both states comes after greater excitement in the Democratic Party for the campaign of Vice President Kamala Harris following President Joe Biden’s stepping aside, as well as efforts by former President Donald Trump and the Republican National Committee to encourage early voting. Republicans have generally preferred to vote on Election Day rather than voting ahead of time.\n\nGov. Roy Cooper (D-NC) encouraged residents to vote and thanked people who had helped people out west recover from the historic storm in late September and put them in a better position to be able to vote now.\n\n“Today is the first day of early voting in NC. Thank you to the North Carolina Board of Elections for your hard work helping ensure people can exercise their right to vote, especially in WNC following Helene. Find your county’s early voting locations at http://vt.ncsbe.gov,” Cooper wrote in a post to X on Thursday.\n\nToday is the first day of early voting in NC. Thank you to the North Carolina Board of Elections for your hard work helping ensure people can exercise their right to vote, especially in WNC following Helene. Find your county’s early voting locations at https://t.co/jK3ZBss5vO— Governor Roy Cooper (@NC_Governor) October 17, 2024\n\nRep. Chuck Edwards (R-NC) told CNN in an interview Thursday morning that he did not believe false information spread online over the past three weeks since the storm had had a significant impact on voters.\n\nIn the weeks since Helene swept through North Carolina on Sept. 28, misinformation and disinformation have circulated online that falsely claim that the Federal Emergency Management Agency is not sending in resources to the affected area; that the Federal Aviation Administration has restricted airspace to prevent air rescues; that the government geoengineered the hurricane; and that FEMA was short of funding to respond to further hurricanes because it had diverted money to cover costs related to the southern border crisis.“I don’t think that the misinformation, the rumors that have been out there are going to affect voting at all,” Edwards said. “I believe that while here in Western North Carolina we’ve been very busy, not necessarily paying attention to politics but trying to dig out from underneath this storm and help people put their lives back together. And now that early voting has kicked off today, it is clear, it’s apparent that the political season is here.”\n\n.@RepChuckEdwards on the first day of early, in-person voting in North Carolina: \"I don't think that the misinformation, the rumors that have been out there are going to affect voting at all… The political season is here and I'll just encourage everyone to make a plan…\" pic.twitter.com/As2LklyL3M— CNN This Morning with Kasie Hunt (@CNNThisMorning) October 17, 2024\n\nBoth campaigns have hammered North Carolina in recent days with voter events and rallies across the state. On Wednesday evening, Trump running mate Sen. J.D. Vance (R-OH) rallied voters in the southeastern beach town of Wilmington.\n\nOn Thursday afternoon, Harris running mate, Gov. Tim Walz (D-MN) joined former President Bill Clinton in Durham for a campaign event then was slated to be in Winston Salem later in the day with rapper Common.\n\nELECTION 2024: WHAT TO KNOW ABOUT MAIL-IN VOTING\n\nThe Trump campaign has pushed elected officials in the state to expand voter access across Western North Carolina, a stronghold region for Republicans. Although the region includes the Democratic-majority city of Asheville, the suburban and rural areas are largely Republican and the region.\n\nThe Trump campaign has pushed for 10 actions from Cooper and the North Carolina General Assembly, which have the power to change voting policies.\n\n“These 10 improvements in voting access in North Carolina will ensure the people who have already suffered from the storm don’t lose their right to participate in this important election,” said Trump-Vance campaign managers Susie Wiles and Chris LaCivita in a statement issued Oct. 8.\n\nTrump’s team called for all voters in impacted counties to be able to vote anywhere in the county, not just the local precinct they were assigned.\n\nDemands included giving election teams the ability to deliver absentee ballots to the county boards; allowing displaced voters to deliver their ballots to a different county or to the state election board, as well as to turn in provisional ballots on Election Day to neighboring counties; and providing emergency funding for additional communication to reach voters by digital, radio, broadcast, and text.\n\nThe Republican candidate also pushed for early voting site times in the impacted counties to include Sunday and expanded in other ways in the region; temporary structures to be set up for early voting and on Election Day; and waiving the residency requirement for poll workers, poll observers, and election officials in affected counties.\n\nIt remained unclear as of Thursday if the state has bent to the Trump campaign and Republican National Committee’s demands to make broad accommodations for voters in the state’s western region.\n\nEarly voting has gotten underway in a number of states, including in battleground states Arizona and Georgia.","summary":"Voter turnout on the first day of early voting in the critical battleground state of North Carolina is on track to surpass all previous records despite the horrific toll that Hurricane Helene has taken on the state&#8217;s western region. The North Carolina State Board of Elections Executive Director Karen Brinson Bell told reporters in Asheville, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3193233/first-early-voting-north-carolina-record-helene/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/early-voting-north-carolina.webp","video":null,"publish_date":"2024-10-17 23:13:31","author":"Anna Giaritelli","authors":["Anna Giaritelli"],"language":"en","source_country":"US","sentiment":-0.222},{"id":260124378,"title":"Trump again questions Harris' racial, ethnic identity in podcast interview","text":"Former President Donald Trump once again falsely questioned Vice President Kamala Harris' racial and ethnic identity during an interview with the \"PBD Podcast\" that aired on Thursday.\n\nTrump -- who spoke with the podcast's host, Patrick Bet-David, on Wednesday -- said that a lot of people were not aware that Harris is Black.\n\n\"They have a woman who is Black, although you would say she's Indian, but she is Black, but she really -- a lot of people didn't know, which is true,\" Trump said.\n\nBet-David responded that he wasn't aware until recently that Harris was Black.\n\n\"I learned about it only a couple of months ago,\" Bet-David said.\n\nHarris is the daughter of a Jamaican father and an Indian mother.\n\nBoth Trump and Bet-David continued to joke about Harris' racial and ethnic identity, comparing her to baseball player Sammy Sosa, whose complexion had allegedly gotten lighter after he said he applied bleaching cream every night to soften his skin.\n\n\"You sometimes have to respect people, right? So I thought maybe she was doing a Sammy Sosa the other way,\" Bet-David said, to which Trump agreed, saying, \"Yeah Sammy's changed. And people change.\"\n\nTrump's comments come at a time that his campaign is working to appeal to voters of color including Black voters -- a voting bloc where Harris leads, according to recent polling. Harris is polling ahead of Trump with Black voters who are registered to vote, 82-13%, according to the latest ABC News/Ipsos poll.\n\nThis isn't the first time Trump has discussed Harris' racial identity -- making false claims in the process.\n\nTrump falsely claimed that Harris has not identified as both Black and Indian during an interview at the National Association of Black Journalists conference in July.\n\n\"I didn't know she was Black until a number of years ago when she happened to turn Black and now, she wants to be known as Black. So, I don't know, is she Indian or is she Black?\" Trump said during the NABJ interview.\n\nHe went on to wrongly say that \"she was Indian all the way, and then all of a sudden she made a turn, and she went -- she became a Black person.\"\n\nTrump doubled down on the false claims during ABC's presidential debate in September.\n\nAsked by moderators about his previous comments on Harris' race, the former president said he \"couldn't care less\" about her racial identity.\n\n\"I don't care what she is. I don't care,\" Trump said Tuesday. \"Whatever she wants to be is OK with me.\"\n\nHarris responded, saying Trump has made comments about race to divide the country.\n\n\"Honestly, I think it's a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people,\" Harris said during the debate. \"I think the American people want better than that, want better than this.\"\n\nABC News reached out to the Harris campaign for a comment on Trump's mention of her race in the podcast, but did not receive a response by the time of publication.\n\nTrump's campaign responded to his remarks on the podcast, with its Black Media Director Janiyah Thomas telling ABC News in a statement that \"at the end of the day, it doesn't matter to President Trump how Kamala Harris chooses to identify herself today, yesterday, or tomorrow.\"\n\n\"What does matter to President Trump is the fact that she is making this country less safe and less affordable,\" Thomas added.","summary":"Former President Donald Trump once again falsely questioned Vice President Kamala Harris' racial and ethnic identity during an interview.","url":"https://abcnews.go.com/Politics/trump-questions-harris-racial-ethnic-identity-podcast-interview/story?id=114906094","image":"https://i.abcnewsfe.com/a/c18d353e-0415-48df-b56f-f2492ecfc765/trump-1-rt-er-241017_1729195852150_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-10-17 23:10:50","author":"Kelsey Walsh,Lalee Ibssa","authors":["Kelsey Walsh","Lalee Ibssa"],"language":"en","category":"politics","source_country":"us","sentiment":-0.185},{"id":260121942,"title":"Mountain West commissioner says she's heartbroken over turmoil surrounding San Jose State volleyball","text":"Mountain West Conference Commissioner Gloria Nevarez said Thursday the forfeitures that volleyball teams are willing to take to avoid playing San Jose State is “not what we celebrate in college athletics” and that she is heartbroken over what has transpired this season surrounding the Spartans and their opponents.\n\nFour teams have canceled games against San Jose State: Boise State, Southern Utah, Utah State and Wyoming, with none of the schools explicitly saying why they were forfeiting. \n\nA group of Nevada players issued a statement saying they will not take the floor when the Wolf Pack are scheduled to host the Spartans on Oct. 26. They cited their “right to safety and fair competition,” though their school reaffirmed Thursday that the match is still planned and that state law bars forfeiture “for reasons related to gender identity or expression.”\n\nAll those schools, except Southern Utah, are in the Mountain West. New Mexico, also in the MWC, was going ahead with a home match Thursday night against the Spartans.\n\n“It breaks my heart because they’re human beings, young people, student-athletes on both sides of this issue that are getting a lot of national negative attention,\" Nevarez said in an interview with The Associated Press at Mountain West basketball media days. “It just doesn’t feel right to me.”\n\nRepublican governors of Idaho, Nevada, Utah and Wyoming have made public statements in support of the cancellations, citing a need for fairness in women’s sports. Former President Donald Trump, the GOP nominee in this year's presidential race, this week referenced an unidentified volleyball match when he was asked during a Fox News town hall about transgender athletes in women's sports.\n\n“I saw the slam, it was a slam. I never saw a ball hit so hard, hit the girl in the head,” Trump replied before he was asked what can be done. “You just ban it. The president bans it. You just don’t let it happen.”\n\nAfter Trump's comment, San Diego State issued a statement that said “it has been incorrectly reported that an San Diego State University student-athlete was hit in the face with a volleyball during match play with San Jose State University. The ball bounced off the shoulder of the student-athlete, and the athlete was uninjured and did not miss a play.”\n\nSan Jose State has not made any direct comments about the politicians’ “fairness” references, and Nevarez did not go into details.\n\n“I’m learning a lot about the issue,” Nevarez said. \"I don’t know a lot of the language yet or the science or the understanding nationally of how this issue plays out. The external influences are so far on either side. We have an election year. It’s political, so, yeah, it feels like a no-win based on all the external pressure.”\n\nThe cancellations could mean some teams will not qualify for the conference tournament Nov. 27-30 in Las Vegas, where the top six schools are slated to compete for the league championship.\n\n“The student-athlete (in question) meets the eligibility standard, so if a team does not play them, it’s a forfeit, meaning they take a loss,” Nevarez said.\n\nAhead of the Oct. 26 match in Reno. Nevada released a statement acknowledging that “a majority of the Wolf Pack women’s volleyball team” had decided to forfeit against San Jose State. The school said only the university can take that step but any player who decides not to play would face no punishment.\n\nAP college sports: https://apnews.com/hub/college-sports","summary":"Mountain West Commissioner Gloria Nevarez says she is heartbroken over turmoil surrounding San Jose State volleyball this season","url":"https://www.independent.co.uk/news/world/americas/ap-donald-trump-wolf-pack-las-vegas-nevada-b2631334.html","image":"https://static.independent.co.uk/2024/10/15/20/San_Jose_St_Canceled_Games_Volleyball_23785.jpg?width=1200","video":null,"publish_date":"2024-10-17 23:09:06","author":"Mark Anderson","authors":["Mark Anderson"],"language":"en","source_country":"gb","sentiment":-0.468},{"id":260122362,"title":"Kamala Harris Flames Hecklers, Tells Them to Go to 'Smaller' Trump Rally","text":"Of course, crowd size has been a contentious issue between the two candidates ... with Donald Trump claiming he pulls in much larger crowds than Kamala. The war of words got so big, even former President Barack Obama had to weigh in -- using NSFW hand gestures.","summary":"Kamala Harris isn't too proud to compare sizes ... roasting some unruly hecklers at her rally -- telling them she thinks they're looking for a former prez's much smaller crowd. The Vice President appeared at a rally in La Crosse, Wisconsin Thursday&hellip;","url":"https://www.tmz.com/2024/10/17/kamala-harris-roasts-wisconsin-hecklers-go-to-smaller-trump-rally/","image":"https://imagez.tmz.com/image/cf/4by3/2024/10/17/cf5751edb0dd4419b856e2a5dc559161_xl.jpg","video":null,"publish_date":"2024-10-17 23:07:05","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.167},{"id":260121752,"title":"Larry Donnelly: Why are Kamala Harris and Donald Trump neck and neck?","text":"WHEN LAST I wrote specifically about the top of the ticket in the campaign to be the next President of the United States, I ventured that Democrats had the advantage in the wake of a debate in which Kamala Harris defeated Donald Trump. I was not wrong then, but the momentum of Harris and her running mate, Minnesota Governor Tim Walz, has apparently dissipated.\n\nIn late summer, after the vice president had replaced her boss, Joe Biden, as the Democratic Party’s chosen one, progressives were hugely enthused. There was a massive infusion of cash and thousands of volunteers signed up. The aggregated polling data moved slowly, yet surely, in the direction of Harris/Walz in the crucial battlegrounds. Those in America and internationally who fear Trump’s returning to the White House were daring, albeit prematurely, to breathe a shared sigh of relief.\n\nThe Harris/Walz energy and buzz have waned. Their gains have evaporated and, it can be cogently argued, the figures are receding to where they were when the beleaguered President Biden was presumed to be the Democrats’ standard bearer. Harris did not do a Fox News interview or float the idea of being a guest on Joe Rogan’s podcast because her strategists are confident of her position. This fight is, looked at in a light most favourable to Harris/Walz, a 50/50 proposition. It’s a toss-up with merely a couple of weeks to go.\n\nThe cult of Trump\n\nA vast audience of astonished spectators, who fret that it is eminently possible that Donald Trump will again be elected the leader of the Western world, ask why? They refer to a litany of despicable past and present words and actions, and what they perceive to be proof of his mental decline. Hence, they cannot fathom how the people of the US could still say “Yes, he’s our man.”\n\nWhat follows is an attempt to explain, in relatively short shrift, the complex state of play that has led us to where we are. That entails an examination, first, of the sources of and reasons behind Trump’s persistent appeal and, second, of Harris’s failings and weaknesses as a contender.\n\n Trump on the campaign trail. Alamy Stock Photo\n\n Alamy Stock Photo\n\nAs for the bombastic billionaire, he came down a Trump Tower escalator in 2015 to announce what the commentariat dismissed as a quixotic ego trip in possession of an acute awareness of the widespread negative, forlorn mood and a willingness to capitalise on it for political profit.\n\nHis opponents must give the devil his due: he knew how seriously countless were hurting; he copped that the optimistic rhetoric of the major parties was off the mark in myriad respects; and he was prepared to offer simple solutions to a citizenry enamoured of celebrity and soundbites.\n\nThe wounds inflicted by globalisation and technology, deepened by tax and trade policies which were endorsed by Democrats and Republicans alike and which exacerbated inequality – together with a simmering racial divide and resentment at the gradual darkening of the average American’s skin complexion precipitated by immigration across the Mexican border – were ripe for manipulating. Millions wanted the radical surgery advocated by “Doctor” Trump.\n\n Trump in 2015 declaring his intention to run for president. Alamy Stock Photo\n\n Alamy Stock Photo\n\nAnd even if they didn’t fully accept that he could do what he pledged – for example, “build that wall” – they agreed with the sentiments buttressing the mantras and appreciated that Trump was talking to, not at, them. When all of this was supplemented by a persuasive pitch to social and religious conservatives that he would do what his predecessors had promised, yet did not prioritise, the foundation for a potent political movement was laid.\n\nThe more traditional conservative enemies of its goals have long tried to demonise it and allege that Trumpism has been the path to ruin for a GOP that has been the victim of a hostile takeover. The only route to redemption, they cry out, is to restore normality and the “decent Republicanism” embodied by Ronald Reagan, George Bush Sr and Jr, John McCain and Mitt Romney. They are vocal and they have untrammelled access to important platforms to espouse their criticisms, but they are a tiny minority and they are wrong, politically at least.\n\n FILE - Jan. 6, 2021, Trump supporters stand outside the U.S. Capitol in Washington. Alamy Stock Photo\n\n Alamy Stock Photo\n\nOpinion surveys consistently show that most grass-roots conservatives are firmly in Donald Trump’s corner. Lots had come to reject the elitism and intellectualism of the Washington, DC-based right and voted dispassionately for those embraced by the hierarchy, such as McCain and Romney, who were the lesser of two evils in their hearts. They are far more enamoured of Trump’s admittedly impure “turn back the clock” brand of conservatism and its tactically brilliant sloganeering: “Make America Great Again” and “America First.”\n\nDetractors from an array of ideological perspectives describe prominent Republicans as “cowards” for not standing up to Trump and Trumpism. They are appalled by the individual in private. That said, US Senate Minority Leader Mitch McConnell and his ilk refuse to condemn him when the microphone is on because of the extraordinary personal loyalty he commands from their faithful and how lucrative their party’s pivoting since his improbable rise has proven.\n\nIt was once inconceivable that the GOP would be the home of the white working class; that it would make such inroads with the fastest growing constituency in the US, Latinos, as well as with other new immigrant communities; and that a surprisingly sizeable cohort of Black Americans would opt to give the party a chance. Simultaneously, a large swathe of the “old school” have stayed onside on economic, tax and related grounds, even as they lament Trump’s lack of moral character and are not fans of his number two, Ohio Senator JD Vance.\n\nFactoring in all of these considerations, Trump and Trumpism – regardless of one’s attitude toward him and the style and substance of his messaging – constitute a political juggernaut, especially in a contest where the result is dictated by Electoral College maths. To beat their foe in 2024, the Democrats had to send forward their best.\n\nCan Kamala do this?\n\nThat’s why Nancy Pelosi, Barack Obama et al pushed hard for Biden to abandon his bid for another term. They were cognisant that the fading octogenarian wasn’t up to the task. At this juncture, though, similar doubts are surfacing as to whether Kamala Harris can pull off a victory. Some influential Democrats are reportedly voicing concerns that the accomplished woman of colour is not faring well under the media glare and that she should have picked Pennsylvania Governor Josh Shapiro to bolster her odds of prevailing in that vital state.\n\n Financial support for Kamala's campaign flew in via powerful backers in the early stages but this has slowed. Alamy Stock Photo\n\n Alamy Stock Photo\n\nThere are a few inconvenient truths here. First, the biggest quandaries facing the US – inflation and immigration – work against Harris. The cost of goods and services has exploded during the tenure of this administration. Plenty of Americans are legitimately pissed off and aren’t swayed by the contentions that this has affected everyone, everywhere and is easing in the US. They are not better off than they were four years ago and believe the incumbent president’s deputy is blameworthy.\n\nIn the same vein, the numbers entering the country illegally have surged dramatically with Biden/Harris in office, straining some communities and leading very many to desire a halt to immigration, temporarily or permanently. They think she is partly responsible. It is tough for Harris, who was delegated the border as an aspect of her brief, to deny all political culpability for what is objectively a mess.\n\n Kamala Harris waves after delivering remarks at a campaign rally in Washington Crossing, Pa., Oct. 16, 2024. Alamy Stock Photo\n\n Alamy Stock Photo\n\nShe definitely didn’t aid her cause on either quagmire by commenting on ABC’s “The View” that she’d have done “not a thing” differently than President Biden. The experienced erstwhile prosecutor’s dreadful reply to a query that is unavoidably tricky for her, but to which she should have a stock response, is symptomatic of what is inescapable: Harris is just not a strong candidate.\n\nShe is poor on her feet. She struggles to answer probing questions. There is an authenticity deficiency, compounded by her flip-flops on key issues. Harris is not the nominee because she emerged from a competitive primary process in which she vanquished a field of qualified, impressive rivals. She instead benefitted from unprecedented, time-sensitive circumstances.\n\nAnd regrettably for Democrats, Harris’s greatest success to date – a solid, winning performance in the debate with Trump – paid scant dividends. That any bounce was insignificant and fleeting must be incredibly deflating for liberal activists who have rallied to her and were initially ecstatic that she would be the person to finally eliminate the threat to democracy they see in Trump.\n\n Alamy Stock Photo\n\n Alamy Stock Photo\n\nThird, on a range of topics, particularly when it comes to the culture wars, Harris is way to the left of the consensus of those who inhabit the territory that means most on 5 November. Whether it is Black Lives Matter, gender identity, what should and should not be taught in the public schools, the holiday originally intended to celebrate Christopher Columbus or a host of additional “hot button” stuff – all of which feature uniquely centrally on the agenda when ballots are cast in the US – Harris is of her hometown, San Francisco. That’s readily exploitable, to her grave detriment. Democrats more broadly are also feeling the heat on this front.\n\nAll to play for\n\nIn a nutshell, then, that’s my assessment of why Harris vs Trump is on a knife edge. Harris’s acolytes and defenders may immediately retort that the above analysis is profoundly unfair to her. In a vacuum, that critique is not wholly lacking in merit. It neglects, however, certain facts. Remember: we live in the world as it is, not as we wish it were.\n\nYes, Harris is held to a higher standard. Yes, there are elements of racism and sexism lurking there. Yes, Trump is a bad guy, totally amoral, a convicted felon, not someone fit to occupy any elected office, never mind the presidency.\n\nConversely, the incontrovertible evidence is that it doesn’t matter a damn politically what Trump says or does; he plays the game by a set of rules he makes up as he goes; he has the unwavering fidelity of disciples who would literally jump from a cliff if he asked them to; and loads of quieter, self-interested, ruthlessly transactional Americans who don’t attend his rallies support him, too.\n\n Former President Barack Obama and Sen. Bob Casey, D-Pa., appear on stage at a rally for Vice President Kamala Harris and her running mate Gov. Tim Walz on 10 Oct. Alamy Stock Photo\n\n Alamy Stock Photo\n\nThe evaluations of the polls from the two camps are fascinating. Team Trump/Vance maintain robustly that they are ahead, citing the extent to which the popularity of the ex-star of “The Apprentice” is typically underestimated, as is the unknown quantity of shy Trump voters. They are hoping that, among other demographics, an abundance of comfortable suburbanites fall into this category.\n\nHarris/Walz allies assert that they alone have the capacity to expand the electorate and to get young, heretofore apolitical people to do their civic duty with the assistance of invaluable surrogates like former Presidents Obama and Clinton and the pop sensation, Taylor Swift. The Democrats have a superior get out the vote operation. Further, they claim that the fury of women stemming from the reversal of Roe v Wade by a US Supreme Court majority with three Trump-sponsored justices is not captured and will propel their duo over the line.\n\nThe contrasting interpretations are equally plausible. Which of them is closest to reality may tell the tale in an absolutely enthralling, immensely consequential race that seems destined for a photo finish.\n\nLarry Donnelly is a Boston lawyer, a law lecturer at the University of Galway and a political columnist with The Journal.","summary":"It may surprise some that the two are still tied, but Harris will find it difficult to stop Trump’s momentum, writes Donnelly.","url":"https://www.thejournal.ie/readme/trump-harris-elections-6517461-Oct2024/","image":"https://img2.thejournal.ie/article/6517461/river/?height=400&version=6517490","video":null,"publish_date":"2024-10-17 23:05:27","author":"View All Articles","authors":["View All Articles"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.253},{"id":260122762,"title":"VP Harris, former President Trump keep focus on battleground states in election's final weeks","text":"WASHINGTON -- Both presidential candidates are keeping their eyes on battleground states in the final weeks of their election campaigns.\n\nWith three weeks left in the presidential campaign, Harris is spending most of her days trying to shore up support in the \"blue wall\" states of Pennsylvania, Michigan and Wisconsin as she tries to avoid a repeat of Hillary Clinton's collapse there eight years ago.\n\nHer schedule reflects the Democratic nominee's focus on her most likely path to victory over Republican candidate Donald Trump.\n\nHarris is in Milwaukee on Thursday seeking support from college-age voters.\n\nShe dropped by a business class at the University of Wisconsin-Milwaukee and is holding a student rally at the University of Wisconsin-La Crosse. She closes out the day with a rally in Green Bay.\n\nTrump visited a barber shop in New York ahead of the Alfred Smith dinner Thursday night, which raises money for Catholic charities. Harris is expected to attend virtually. Wednesday, Trump took questions during a town hall held by Spanish-speaking network Univision, in which he disparaged Chicago several times.\n\n\"And when you say, Chicago, immediately, we have to think about the crime because it's so dangerous in Chicago. And some of these people came from other countries. Many of them came from other countries,\" he claimed. \"So what we're going to do is we have to be much tougher on crime.\"\n\nTrump's comments came in response to a question from Streamwood, Ill. resident Guadalupe Ramirez, who had asked about his immigration reform plans, and why he scuttled a bipartisan bill to address the border situation.\n\n\"Well, I was very disappointed in the fact that he did not actually address my question. I feel like he kind of went off on a tangent and started talking about the crime of Chicago and Governor Pritzker,\" Ramirez said.\n\nMark Cuban campaigned with Harris Thursday, and told her rally attendees Donald Trump used to be \"a little bit coherent.\"\n\n\"But I don't know what happened to him,\" said Cuban, an owner of the NBA's Dallas Mavericks and celebrity investor on \"Shark Tank.\"\n\nCuban warned the crowd that if Trump was elected in November, his tariffs proposal would make holiday gifts cost 60% more than they are now.\n\n\"You won't be able to afford the presents you want for your family and friends,\" he said. The choice, he said, is to elect Harris.\n\nOne woman from the Chicago suburbs who has been campaigning frequently in Wisconsin for Harris and is headed back there this weekend said she's encouraged to see the vice president returning there so often.\n\n\"I think she has a pretty good chance. We just need to keep going, keep knocking doors, making calls. I think she has a pretty good chance,\" Loretta Jackson said.\n\nHarris is reportedly returning to Madison, Wis., for a rally next Tuesday. Trump is planning another town hall in Pennsylvania Sunday, the same day Harris' running mate Gov. Tim Walz will be in Chicago for a fundraiser.\n\nABC News and the Associated Press contributed to this report","summary":"Both Vice President Kamala Harris and former president Donald Trump kept their focus on battleground states Thursday in the final weeks of their campaigns.","url":"https://abc7news.com/post/vice-president-kamala-harris-former-donald-trump-both-get-comfort-zones-campaigning/15437419/","image":"https://cdn.abcotvs.com/dip/images/15437524_101724-wabc-harris-trump-AP-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/101724-wls-craig-kamala-trump-thurs-430-vid.mp4","publish_date":"2024-10-17 23:03:36","author":"Craig Wall,WLS","authors":["Craig Wall","WLS"],"language":"en","category":"politics","source_country":"US","sentiment":-0.133},{"id":260121562,"title":"VP Harris, former President Trump keep focus on battleground states in election's final weeks","text":"WASHINGTON -- Both presidential candidates are keeping their eyes on battleground states in the final weeks of their election campaigns.\n\nWith three weeks left in the presidential campaign, Harris is spending most of her days trying to shore up support in the \"blue wall\" states of Pennsylvania, Michigan and Wisconsin as she tries to avoid a repeat of Hillary Clinton's collapse there eight years ago.\n\nHer schedule reflects the Democratic nominee's focus on her most likely path to victory over Republican candidate Donald Trump.\n\nHarris is in Milwaukee on Thursday seeking support from college-age voters.\n\nShe dropped by a business class at the University of Wisconsin-Milwaukee and is holding a student rally at the University of Wisconsin-La Crosse. She closes out the day with a rally in Green Bay.\n\nTrump visited a barber shop in New York ahead of the Alfred Smith dinner Thursday night, which raises money for Catholic charities. Harris is expected to attend virtually. Wednesday, Trump took questions during a town hall held by Spanish-speaking network Univision, in which he disparaged Chicago several times.\n\n\"And when you say, Chicago, immediately, we have to think about the crime because it's so dangerous in Chicago. And some of these people came from other countries. Many of them came from other countries,\" he claimed. \"So what we're going to do is we have to be much tougher on crime.\"\n\nTrump's comments came in response to a question from Streamwood, Ill. resident Guadalupe Ramirez, who had asked about his immigration reform plans, and why he scuttled a bipartisan bill to address the border situation.\n\n\"Well, I was very disappointed in the fact that he did not actually address my question. I feel like he kind of went off on a tangent and started talking about the crime of Chicago and Governor Pritzker,\" Ramirez said.\n\nMark Cuban campaigned with Harris Thursday, and told her rally attendees Donald Trump used to be \"a little bit coherent.\"\n\n\"But I don't know what happened to him,\" said Cuban, an owner of the NBA's Dallas Mavericks and celebrity investor on \"Shark Tank.\"\n\nCuban warned the crowd that if Trump was elected in November, his tariffs proposal would make holiday gifts cost 60% more than they are now.\n\n\"You won't be able to afford the presents you want for your family and friends,\" he said. The choice, he said, is to elect Harris.\n\nOne woman from the Chicago suburbs who has been campaigning frequently in Wisconsin for Harris and is headed back there this weekend said she's encouraged to see the vice president returning there so often.\n\n\"I think she has a pretty good chance. We just need to keep going, keep knocking doors, making calls. I think she has a pretty good chance,\" Loretta Jackson said.\n\nHarris is reportedly returning to Madison, Wis., for a rally next Tuesday. Trump is planning another town hall in Pennsylvania Sunday, the same day Harris' running mate Gov. Tim Walz will be in Chicago for a fundraiser.\n\nABC News and the Associated Press contributed to this report","summary":"Both Vice President Kamala Harris and former president Donald Trump kept their focus on battleground states Thursday in the final weeks of their campaigns.","url":"https://abc13.com/post/vice-president-kamala-harris-former-donald-trump-both-get-comfort-zones-campaigning/15437419/","image":"https://cdn.abcotvs.com/dip/images/15437524_101724-wabc-harris-trump-AP-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/101724-wls-craig-kamala-trump-thurs-430-vid.mp4","publish_date":"2024-10-17 23:03:36","author":"Craig Wall,WLS","authors":["Craig Wall","WLS"],"language":"en","category":"politics","source_country":"us","sentiment":-0.133},{"id":260121324,"title":"Ramsey County opens four more voting locations amid high statewide turnout for early voting","text":"Ramsey County opened four more early voting locations on Friday, in advance of a closely watched Nov. 5 election.\n\nIn-person, absentee voting began Sept. 20 at the Ramsey County Elections office at 90 Plato Boulevard in St. Paul. Additional voting sites were scheduled to open Friday at the Arlington Hills Community Center, 1200 Payne Ave., the Frogtown Community Center at 230 Como Ave., the Ramsey County Library in Roseville at 2180 Hamline Ave. N., and the Ramsey County Library in Shoreview at 4560 Victoria St. N.\n\nWith the exception of Maplewood City Hall, Ramsey County voters may vote before Election Day at any absentee voting site in the county, regardless of their home address. Ballots do not need to be requested in advance.\n\nVoters can submit their absentee ballots from 10 a.m. to 4 p.m. through Nov. 4. Locations will also be open from 9 a.m. to 3 p.m. on two Saturdays — Oct. 26 and Nov. 2 — and on Nov. 3, a Sunday.\n\nPolling places are open from 7 a.m. to 8 p.m. on Election Day. Mail and absentee ballots must be received by local election officials by 8 p.m. on Election Day.\n\nStatewide, local election officials had distributed more than 716,000 absentee and mail-in ballots in the four weeks since early voting began on Sept. 20. More than 337,000 ballots have been completed and returned, according to the Minnesota Secretary of State’s office.\n\nThat puts “turnout” to date ahead of absentee acceptance totals in the 2016 general election, which Republican and Democratic nominees Donald Trump and Hillary Clinton vied for the presidency. The numbers fall short of the record high absentee voting totals from 2020, when many voters chose to participate by mail-in ballot during the pandemic.\n\nMinnesotans can vote by mail, early in-person and in-person on Election Day. Beginning Friday, some local election offices statewide will offer direct balloting, replicating the Election Day experience by allowing voters to put their ballots directly into ballot tabulators. The machines are tested before every election, certified by the state and federal elections experts and maintained in secure locations.\n\nThe deadline to register to vote before Election Day was Oct. 15. Minnesotans can still register to vote on Election Day, if needed. Learn more at sos.state.mn.us/elections-voting.","summary":"Absentee returns are coming in faster than in 2016, though still below the 2020 record.","url":"https://www.twincities.com/2024/10/17/ramsey-county-opens-four-more-voting-locations-amid-high-statewide-turnout-for-early-voting/","image":"https://www.twincities.com/wp-content/uploads/2022/11/AP22311835934622.jpg?w=1024","video":null,"publish_date":"2024-10-17 23:00:47","author":"Frederick Melo","authors":["Frederick Melo"],"language":"en","source_country":"us","sentiment":-0.203},{"id":260121200,"title":"Letters: Torres out | WVMCCD board | Infrastructure needed | Conversion unaffordable | Ignorant on tariffs","text":"Omar Torres should not\ncontinue on City Council\n\nRe: “Mayor, peers call for Torres’ resignation” (Page A1, Oct. 17).\n\nAs a District 3 resident, I am demanding that Omar Torres resign from the City Council.\n\nHe has admitted to reckless private behavior that led to a successful extortion scheme. This alone disqualifies him from continuing. Why?\n\n1. He repeatedly engaged in behavior that made him a target for extortion. This calls into question the integrity of his decision-making and he will always be under the cloud of blackmail.\n\n2. Worse, he submitted to and validated the blackmail by paying money to the blackmailer. As such, he cannot be trusted with any financial decisions.\n\n3. In any serious enterprise including public service, this behavior would result in immediate dismissal.\n\nRegardless of how the criminal investigation plays out, Omar Torres should be censured by his colleagues and he should resign his office immediately.\n\nSan Jose City Council District 3 deserves to be served by someone who has high ethical standards.\n\nJeff Levine\n\nCollege board needs\nexperienced educators\n\nThe West Valley-Mission Community College District Board of Trustees needs trustees with teaching experience. The board has not had an experienced educator as a trustee in decades.\n\nWe need trustees who know from experience what works best for students, ensuring that our tax dollars meet students’ needs now.\n\nFortunately, in this election, educators are running for trustee positions in Areas 2, 5 and 6:\n\n• Paul Fong in Area 2 has taught political science, Asian American studies and history at De Anza College, Evergreen Valley College and San Jose State University.\n\n• Dr. Diane Lamkin in Area 5 has over 28 years teaching experience in biological sciences at Mission College.\n\n• Dr. Rebecca Wong in Area 6 has over 40 years of teaching experience in math at West Valley College and Independence High School.\n\nVote educators to the board.\n\nAnn Marie Wasserbauer\nWalnut Creek\n\nInfrastructure isn’t\nready EV conversion\n\nRe: “It’s time for Californians to go all in on fully electric vehicles” (Page A6, Oct. 15).\n\nJane Gould and Sue Saunders left out some very important points.\n\nWhile I am 100% in favor of a move to electric vehicles, significant obstacles exist. Most people who own expensive electric cars charge them at home in their garage. Charging them at a charging station is still far less convenient, even for a quick charge. It is just as easy to forget charging an all-electric vehicle as a plug-in hybrid, but at least forgetting to charge a plug-in hybrid does not leave you stranded.\n\nFinally, a complete conversion requires massive investment in upgrading infrastructure, and we are already competing with fast-growing demand for electricity to power AI and BlockChain in many areas of the country. For now, “all of the above” is better than expecting a complete conversion any time soon.\n\nThomas Scott\nMorgan Hill\n\nCalifornia can’t afford\nto go all in on EVs\n\nRe: “It’s time for Californians to go all in on fully electric vehicles” (Page A6, Oct. 15).\n\nIt is clear that there is a recurring conversation like this one about whether or not there should be a complete switch to the use of all-electric cars.\n\nI completely understand the reasons why there should be a complete switch to electric cars to help combat the amount of carbon emissions. However, transitioning to the use of only electric cars would not be great for people because there are many people who cannot afford to buy a fully electric car. Some people only have one car on which they rely because it is all they have.\n\nYes, switching to fully electric cars can help reduce carbon emissions, but I believe it will do more harm than good. Not everyone has the money for a new car.\n\nGabriel De La Torre\n\nTrump is ignorant\nof what tariffs are\n\nDonald Trump says tariff is his “favorite word,” but he apparently doesn’t know what it means.\n\nA tariff is a tax imposed on imported goods which is added to the price of goods entering this country. Trump insists that foreign countries will pay the tariff, but the United States has no power to levy taxes on foreign countries, and tariffs will be paid by Americans as a new sales tax.\n\nTrump is either so ignorant that he has no business being in elected office or he is knowingly lying to the American people hoping we are too lazy to discover the lie.\n\nLarry Guernsey","summary":"Mercury News Letters to the Editor for  Oct. 18, 2024","url":"https://www.mercurynews.com/2024/10/17/letters-1905/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/SJM-L-SJBUDGET-0517-10-copy.jpg?w=1024","video":null,"publish_date":"2024-10-17 23:00:17","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.085},{"id":260122964,"title":"Why Isn’t Kamala Harris Running Away With the Election?","text":"Two big things baffle me about this election. The first is: Why are the polls so immobile? In mid-June the race between President Biden and Donald Trump was neck and neck. Since then, we’ve had a blizzard of big events, and still the race is basically where it was in June. It started out tied and has only gotten closer.\n\nWe supposedly live in a country in which a plurality of voters are independents. You’d think they’d behave, well, independently and get swayed by events. But no. In our era the polling numbers barely move.\n\nThe second thing that baffles me is: Why has politics been 50-50 for over a decade? We’ve had big shifts in the electorate, college-educated voters going left and non-college-educated voters going right. But still, the two parties are almost exactly evenly matched.\n\nThis is not historically normal. Usually we have one majority party that has a big vision for the country, and then we have a minority party that tries to poke holes in that vision. (In the 1930s the Democrats dominated with the New Deal, and the Republicans complained. In the 1980s the Reagan revolution dominated, and the Democrats tried to adjust.)","summary":"After huge shifts in the electorate, it’s baffling that the two parties are still almost exactly evenly matched.","url":"https://www.nytimes.com/2024/10/17/opinion/harris-trump-close-race.html","image":"https://static01.nyt.com/images/2024/10/18/multimedia/17brooks1-jwmg/17brooks1-jwmg-facebookJumbo.jpg","video":null,"publish_date":"2024-10-17 23:00:09","author":"David Brooks","authors":["David Brooks"],"language":"en","category":"politics","source_country":"us","sentiment":-0.465},{"id":260121130,"title":"Trump blames Zelensky instead of Putin for starting Russia’s war on Ukraine","text":"Ex-President Donald Trump (right) called Ukrainian President Volodymyr Zelensky (left) ‘ the greatest salesmen I’ve ever seen’. (Picture: Rex Features)\n\nFormer US President Donald Trump cast blame on Ukrainian President Volodymyr Zelensky – not Russian President Vladimir Putin – for the latter’s invasion of smaller European country.\n\nTrump brought up Zelensky while attacking President Joe Biden’s leadership on the conservative PBD Podcast. \n\n‘I think Zelensky is one of the greatest salesmen I’ve ever seen,’ said Trump in the podcast released on Thursday.\n\n‘Every time he comes in, we give him $100billion. Who else got that kind of money in history? There’s never been. And that doesn’t mean I don’t want to help him, because I feel very badly for those people.’\n\nTrump then twisted the facts on the beginning of the conflict. \n\n‘But he should never have let that war start,’ Trump said of Zelensky.\n\n‘That war is a loser.’\n\nTrump said that Biden ‘instigated’ that war and reiterated his claim that it ‘would never have happened’ if he were still in the White House. \n\nIn a hit on Biden, Trump also said that if a smarter president were in charge, the war ‘would have been easy to settle’.\n\nThe Trump campaign did not immediately respond to a request for comment from Metro on the ex-president blaming Zelensky. \n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Ex-President Donald Trump said that Ukrainian President Volodymyr Zelensky 'should never have let that war start'.","url":"https://metro.co.uk/2024/10/17/trump-blames-zelensky-putin-russia-war-ukraine-21818262/","image":"https://metro.co.uk/wp-content/uploads/2024/10/SEI_223533677-3ce4.jpg?quality=90&strip=all","video":null,"publish_date":"2024-10-17 22:59:25","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.582},{"id":260121018,"title":"Ex-Univision President Rips Network's Donald Trump Town Hall: 'Infomercial'","text":"Former President Donald Trump's Univision town hall was a failed \"propaganda project,\" according to Joaquin Blaya, the network's former president.In an effort to appeal to a potentially crucial voting bloc in this year's presidential election, the former president on Wednesday fielded several questions from undecided Hispanic voters at the Univision event in Florida.Trump struggled to answer tough questions during the town hall and repeated several falsehoods throughout the event, with video clips of seemingly unimpressed audience members quickly going viral on social media.During a Thursday morning interview on MSNBC's Morning Joe, Blaya blasted his former network for displaying a lack of \"integrity\" by allowing Trump to speak uninterrupted without fact-checking any of the false claims that he made.\"It was really not a town hall, it was an infomercial in where they brought in audience as props,\" Blaya said. \"They did ask tough questions, but of course he went on to recite his concert of lies without any journalism integrity on the part of the network, without any fact-checking.\"\"Univision did not distinguish themselves as being a true news organization and served as a platform for close to an hour of [Trump's] continuing recital of lies,\" he added.Blaya went on to argue that Univision's town hall was a \"propaganda project\" in part because it was moderated by Mexican journalist Enrique Acevedo instead of Univision anchor Jorge Ramos.\"The main anchor of the Univision network is Jorge Ramos, one of the most respected journalists in America,\" Blaya said. \"If the network was serious about conducting this in a journalistic manner, you would have thought that Jorge would have to be the person doing the interview and the town hall.\"\"Yet, they again decided to put on someone who they brought from Mexico, and the results are what you saw last night,\" he continued. \"Where they allow Trump to go freely [presenting] his traditional list of lies.\"Newsweek reached out for comment to Univision and the Trump campaign via email on Thursday.Acevedo previously faced heavy criticism for his Univision interview with Trump at Mar-a-Lago in November. Critics accused him of allowing Trump to lie unchecked during the interview and called for a boycott of Univision.Vice President Kamala Harris participated in her own Univision town hall event last week. The event, which the Trump campaign criticized as a display of \"non-sensical word salads\" by the vice president, was also moderated by Acevedo.Polls suggest that Hispanic voters have shifted slightly toward Trump and Republicans in recent years, although Harris continues to maintain a solid lead over the former president in the demographic in most recent polls.A poll released earlier this week by the Hispanic Federation and Latino Victory Foundation found that Harris had a massive 28 point lead over Trump among Hispanics in the critical battleground states of Pennsylvania, Michigan, North Carolina, Nevada, Arizona, Wisconsin and Georgia.","summary":"Trump on Wednesday fielded questions from undecided Hispanic voters at the Univision town hall event in Florida.","url":"https://www.newsweek.com/ex-univision-president-rips-networks-donald-trump-town-hall-infomercial-1970923","image":"https://d.newsweek.com/en/full/2498277/donald-trump-univision-town-hall-informercial-criticism.jpg","video":null,"publish_date":"2024-10-17 22:57:06","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.374},{"id":260120812,"title":"Hot real estate topics: Rates, high payments, all-cash buyers","text":"What is on the mind of real estate stakeholders? I checked in with consumers, mortgage loan originators and real estate industry professionals to find out.\n\nHere are some of their hotly discussed topics.\n\nRates, rates, rates\n\nFront and center is the interest rate spike shortly after the Fed dropped short-term rates. The Freddie Mac 30-year fixed rate averaged 6.20% on Sept. 19, one day after the Fed move. This week, the Freddie rate is at 6.44%. Yes, you are reading this correctly. The Fed drops short-term rates, and long-term (mortgage) rates spiked. Go figure.\n\nWhat caused the spike? The only thing I can think of is the larger than anticipated hiring revealed in the jobs report Oct. 4.\n\nMortgage rates have gone up for the third consecutive week. \n\n“The recent uptick in rates has put a damper on applications,” said Joel Kan, deputy chief economist at Mortgage Bankers Association, which reported applications plunged 17% from one week earlier.\n\nLocally, many homebuyers are pausing until the 30-year mortgage rate drops. Besides homebuyers getting psyched out, we are entering what is traditionally the slowest homebuying season of the year.\n\nPresidential election\n\nFolks are mesmerized by the race between Vice President Kamala Harris and former President Donald Trump. For the record, there is no empirical data about real estate or mortgage rates that suggest either the Democratic or Republican parties are better or worse.\n\nSome years ago, I researched and wrote a column going back several presidential election cycles. I found it didn’t make a hill of beans difference which party was elected as to where mortgage rates went. Rates went both higher and lower when both a Republican won the presidency, as well as when a Democrat won. The Federal Reserve maintains it is an apolitical central bank.\n\nReal estate insiders agree. “There is no historical data to show elections affect real estate markets,” said Steven Thomas, chief economist, Reports on Housing.\n\nHomeowners insurance\n\nHomeowners are seeing their insurance rates double or triple, in some cases. Others aren’t so lucky. They get completely canceled by their carriers. Oftentimes, it’s because of claims made, or the property is sits in a high-fire hazard area. I advise you to think very hard before you make a claim. If it’s a small amount of damage, you might be better off just covering it yourself. Better than to see your skyrocket insurance or get canceled.\n\nOther hot topics\n\nHouse payments: How can folks possibly afford to make payments of say $8,000 a month on a $1,250,000 home with 20% down? More or less, you’ll need to make $216,000 annually to qualify for that home and mortgage.\n\nCash buyers: Where is all the money coming from? According to Thomas, 30% of Orange County homebuyers are paying cash. I think a lot of it comes from generational wealth in the form of inheritances.\n\nRelocations: There’s much chatter over Los Angeles and Bay Area residents who are selling their homes and moving south. Why? Orange County has less crime, a smaller homeless population and no taxes on buying or selling mansions.\n\nCondo sales: The high cost of getting property management companies to fill out the Fannie Mae condo questionnaire during a sale or refinance. In case you didn’t know it, only property management companies can fill out these crucial forms needed to complete a loan. I recently learned about a rush order for which a management company charged more than $900. I oftentimes see fees in the $500-$700 range.\n\nAccessory dwelling units: Investors seeking to squeeze more income from their rental properties (and homeowners) are adding ADUs to their properties. Owner-occupied property owners are also showing a lot of interest in building a place for an elderly parent to live, for example.\n\nBuyer broker representation agreement: Some homebuyers aren’t comfortable signing these new forms, part of an agreement by the National Association of Realtors to be more clear about who’s paying what for commissions. Others have no problem with it. Any real estate professional should be able to simply and clearly explain his or her value add to the consumer, ultimately making the home shopper more comfortable.\n\nCredit report changes: The Homebuyers Privacy Protection Act of 2024 is an amendment tacked onto the U.S. defense bill in Congress. Briefly stated, if it passes, credit bureaus will no longer be able to sell your information to mortgage lenders when you are shopping for a mortgage.\n\nHere’s a little more context: When a mortgage lender pulls credit on a borrower, the three major credit bureaus then turn around and sell that information to competing mortgage companies. Those mortgage companies almost immediately contact the mortgage applicant via email, text or phone calls. Most applicants hate the invasion of privacy. Mortgage loan originators hate it because these competing lenders are trying to get that business and because many borrowers mistakenly blame their lender for giving out their information.\n\nFreddie Mac rate news\n\nThe 30-year fixed rate averaged 6.44%, 12 basis points higher than last week. The 15-year fixed rate averaged 5.63%, 22 basis points higher than last week.\n\nThe Mortgage Bankers Association reported a 17% mortgage application decrease compared to one week ago.\n\nBottom line: Assuming a borrower gets the average 30-year fixed rate on a conforming $766,550 loan, last year’s payment was $613 more than this week’s payment of $4,815.\n\nWhat I see: Locally, well-qualified borrowers can get the following fixed-rate mortgages with one point: A 30-year FHA at 5.375%, a 15-year conventional at 5.25%, a 30-year conventional at 5.875%, a 15-year conventional high balance at 6% ($766,551 to $1,149,825 in LA and OC and $766,551 to $1,006,250 in San Diego), a 30-year-high balance conventional at 6.25% and a jumbo 30-year fixed at 6.5%.\n\nNote: The 30-year FHA conforming loan is limited to loans of $644,000 in the Inland Empire and $766,550 in LA, San Diego, and Orange counties.\n\nEye-catcher loan program of the week: A 30-year mortgage, with 30% down locked for the first 5 years at 5.875 with 1 point cost.\n\nJeff Lazerson, president of Mortgage Grader, can be reached at 949-322-8640 or jlazerson@mortgagegrader.com .","summary":"Will homebuying take another pause as mortgage rates rise?","url":"https://www.ocregister.com/2024/10/17/hot-real-estate-topics-rates-high-payments-all-cash-buyers/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/OCR-L-Realtor-Settlement-0804-003-1.jpg?w=1024","video":null,"publish_date":"2024-10-17 22:52:51","author":"Jeff Lazerson","authors":["Jeff Lazerson"],"language":"en","source_country":"US","sentiment":-0.232},{"id":260120808,"title":"Trump says Apple’s Tim Cook called him — here were the CEO’s  concerns","text":"Republican presidential candidate Donald Trump said he received a call from Apple CEO Tim Cook over concerns about the financial penalties that have been imposed by the European Union on the iPhone maker.\n\nApple did not respond to a request seeking confirmation of the authenticity of the phone call.\n\nEuropean regulators have launched a series of investigations into Big Tech firms in recent years, with the aim of curbing their power and ensuring a level playing field for smaller rivals.\n\n“Two hours ago, three hours ago, he (Cook) called me,” Trump said, while speaking with podcaster Patrick Bet-David in a program that was released on Thursday. “He said the European Union has just fined us $15 billion. … Then on top of that they got fined by the European Union another $2 billion,” Trump added, quoting his call with Cook.\n\nLast month, Apple lost a long-running court battle with the European Union, resulting in Apple’s being forced to pay 13 billion euros ($14.08 billion) in back taxes to Ireland, as part of a wider crackdown. Earlier this year, the company was hit with a $2 billion EU antitrust fine for thwarting competition from music streaming rivals via restrictions on its App Store.\n\n“Tim, I got to get elected first. … But I’m not going to let them take advantage of our companies. That won’t be happening,” Trump quoted himself as saying to Cook, during the nearly 90-minute podcast appearance.\n\nTrump and Democrat Kamala Harris are locked in a close race to win the Nov. 5 presidential election.","summary":"Trump made the comment while speaking with podcaster Patrick Bet-David in a program that was released on Thursday.","url":"https://nypost.com/2024/10/17/business/trump-says-apples-tim-cook-called-with-concerns-about-eu-penalties/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-1kdfk4dsq-1729205467430.jpg?quality=75&strip=all&1729191089&w=1200","video":null,"publish_date":"2024-10-17 22:52:28","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.596},{"id":260120732,"title":"Ukraine Pushes Back on Weapons of Mass Destruction Report","text":"The Ukrainian Foreign Ministry (MFA) has poured cold water over reports that the country is planning on building weapons of mass destruction.Heorhii Tykhyi, a spokesperson for the ministry, said in a statement issued Thursday that the MFA refutes a recent report from the German tabloid BILD that claimed Kyiv was closing in on plans to build a nuclear bomb. The allegations came out in a report from BILD published earlier in the day, and the outlet cited an unnamed senior Ukrainian official \"specializing in weapons procurement.\"Tykhyi emphasized in his statement that Ukraine \"remains a committed party\" to the 1994 Budapest Memorandum, in which Kyiv agreed to dismantle its nuclear stockpile in exchange for security assurances from the United States, the United Kingdom and Russia.He added that Ukraine, \"which has made the greatest contribution in history to international peace, security and nuclear non-proliferation, is now facing nuclear blackmail from the terrorist state of Russia.\" Russian President Vladimir Putin has repeatedly said he would consider using nuclear weapons amid his invasion of Ukraine if other countries interfered in the war.\"Moscow not only resorts to irresponsible and dangerous rhetoric on the topic of weapons of mass destruction, but also creates unacceptable threats to nuclear facilities on the territory of Ukraine...We call on the international community to increase pressure on Moscow to prevent the realization of its aggressive plans,\" Tykhyi said.Ukraine's Presidential Communications Advisor Dmytro Lytvyn also dismissed BILD's report in a statement to Interfax Ukraine, telling the outlet, \"Yes, this is not the first time that Bild has spread something that has no connection to reality, but plays into the hands of Russian propaganda.\"Newsweek reached out to Russia's foreign ministry via email on Thursday for comment.The MFA's statement comes the same day that Ukrainian President Volodymyr Zelensky appeared to give an ultimatum to the NATO alliance, saying at the European Council summit in Brussels that he told former President Donald Trump that Kyiv would either join \"some king of alliance\" or be \"forced to pursue nuclear weapons.\"Zelensky walked back his comments during a press conference later in the day with NATO Secretary-General Mark Rutte, saying Thursday that Ukraine is not \"building nuclear weapons.\"\"What I meant is that today, there is no stronger security guarantee for us besides NATO membership,\" Zelensky added, according to Politico's report on the matter.NATO has said that it's committed to Ukraine's future in the alliance, although Rutte refrained from endorsing Ukraine's request for an \"accelerated\" membership application during the press conference Thursday.Zelensky also announced his long-awaited \"victory plan\" this week, which outlines Kyiv's goals of joining NATO and securing further support from its Western allies in order to reach an end to its war with Russia. While presenting the plan to Ukraine's parliament on Thursday, Zelensky said that the plan could finish the war by next year.","summary":"German tabloid \"BILD\" reported that Ukraine was closing in on plans to build a nuclear weapon. Kyiv adamantly denies the report.","url":"https://www.newsweek.com/ukraine-pushes-back-weapons-mass-destruction-report-1970957","image":"https://d.newsweek.com/en/full/2498287/ukraine-pushes-back-nuclear-weapon-reports.jpg","video":null,"publish_date":"2024-10-17 22:52:01","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"us","sentiment":0.321},{"id":260120956,"title":"X Looks to Steer Lawsuits to Musk’s Favorite Tesla-Investor Judge","text":"By one major investor’s estimate, Elon Musk‘s X Corp. — the social media business that most prolific users will probably never stop calling “Twitter” — has plummeted some 80 percent in value since the world’s richest man purchased it for $44 billion two years ago. That may not currently bother Musk, who seems more focused on leveraging the platform to help Donald Trump win the election than turning a profit.\n\n Yet the chaotic transformation of Twitter into the increasingly extremist and conspiracist X has also opened up a new set of legal battles — so far mostly instigated by Musk himself. X has already sued two different non-profit watchdogs, the Center for Countering Digital Hate and Media Matters for America, for reporting on how the site serves white supremacist and pro-Nazi content alongside posts from advertisers. While the CCDH suit was dismissed by a California judge as an attempt to stifle free speech, a Texas judge is allowing the similar complaint against Media Matters to proceed next year. X attempted to bring another suit before this same judge, this one against advertisers who left the platform amid rising hate speech, but he recused himself from the case without offering a reason for stepping aside. (A former FTC policy director described that lawsuit as a “hideous joke” to Rolling Stone.)\n\n The jurist in question, U.S. District Judge Reed O’Connor of the Northern District of Texas, has apparently become a favorite of Musk and X: in the company’s current Terms of Service, updated on Wednesday, the company now stipulates that all legal disputes over its terms “will be brought exclusively in the U.S. District Court for the Northern District of Texas or state courts located in Tarrant County, Texas.” While this doesn’t guarantee that all such litigation will be steered to O’Connor, it’s a clear attempt to get more cases in front of him and likewise right-leaning judges in the Northern District, whereas X Corp. is actually headquartered in the Western District of Texas. The practice of seeking a more favorable court is known as “forum-shopping,” and in launching their lawsuits to date, X’s lawyers have been able to file in O’Connor’s district by noting that the platform has users there. X did not respond to a request for comment about this legal strategy.\n\n A conservative activist on the bench, O’Connor was appointed by George W. Bush and is best known for unsuccessfully attempting to overturn the Affordable Care Act as unconstitutional. He has also declined to recuse himself from the Media Matters case despite the organization filing a motion that points out a potential conflict of interest: O’Connor had as much as $50,000 invested in Tesla, a company whose fortunes are tied to Musk’s other ventures, including X. Other legal ethics experts called on O’Connor to recuse himself in light of his investment in a Musk company; this week, new financial records showed he did not sell his Tesla stock after taking on the Media Matters case. A court deputy for O’Connor did not respond to a request for comment.\n\n Though O’Connor may have ruled that there’s “no evidence that shows Tesla has a direct financial interest in the outcome of this case,” regulators in Europe appear more inclined to take Musk’s entire web of businesses into consideration when considering X’s corporate responsibilities. The European Commission is investigating the website for potential violations of the Digital Services Act, the European Union’s tough new standards for online platforms, including requirements to identify and combat the spread of illegal content, disinformation, and hate speech. Failure to curb such threats to user safety can result in fines of up to 6 percent of a company’s annual global revenue, and the EU has signaled that it could multiply such penalties against X by including sales from Musk’s other companies in its calculations.\n\n Other potential changes at X could have legal and financial consequences. One tweak has to do with the collection of user content and data for the training of artificial intelligence products, such as X’s chatbot, Grok. While users may currently opt out of sending their data to Grok, the latest Terms of Service does not mention any such option or setting, and X may simply remove it in the future. Then there’s the modification of the “block” feature, which Musk has been promising for more than a year. This week, users received an alert that read: “Block is changing soon. If your posts are set to public, accounts you have blocked will be able to view them, but they will not be able to engage.”\n\n Many users have blasted both ideas, and the block overhaul may run afoul of guidelines for the Apple and Google app stores, both of which require products to have a block feature. It’s not clear whether either company would delist X from their stores if the change goes into effect, but critics have nonetheless argued that the move would increase abuse and harassment, and even facilitate stalking. The discontent has led to another surge of sign-ups for Bluesky, a decentralized social network originally developed at Twitter, which on Thursday announced that it had welcomed half a million new users in the past day alone, for a total of more than 11 million. The platform touted its block function as it celebrated the milestone, tweeting, “you can block people on bluesky, and they won’t be able to see your posts or interact with you.”\n\n It remains to be seen whether anyone in the U.S. will bother to challenge Musk and X in their preferred district court as the billionaire continues to remodel the splintering site according to his whims. It could be, as the data indicates, that people will simply continue to leave in droves, rendering the social network little more than a dysfunctional right-wing echo chamber. And there’s not much a friendly judge can do about that.","summary":"As the social media company makes changes to its terms of service, it seeks to keep legal disputes in a friendly forum","url":"https://www.rollingstone.com/culture/culture-features/elon-musk-twitter-x-lawsuit-tesla-judge-1235136514/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/Elon-2151277367.jpg","video":null,"publish_date":"2024-10-17 22:50:00","author":"Miles Klee","authors":["Miles Klee"],"language":"en","source_country":"us","sentiment":-0.285},{"id":260121410,"title":"Harris campaign features less talk of joy and more head-on digs at Trump as Election Day nears - The Associated Press","text":"LA CROSSE, Wis. (AP) — Joy Olson proudly wore a “Make America Joyful Again” button Thursday as she waited in line to attend a Kamala Harris rally. But that doesn’t mean the 70-year-old retiree with the happiest of names wants the Democratic nominee to shy away from taking the heat to Republican Donald Trump.\n\n“I’m tired of her being so nice sometimes,” said Olson, who called Trump “evil and scary.” She added: “I hope she calls him out.”\n\nThat’s exactly what the vice president is doing as the campaign enters its final days.\n\nLess than three weeks from Election Day, Harris is closing out her campaign painting a dark vision of the country if Trump is sent back to the White House, including airing video clips at her own rallies of the Republican nominee’s more alarming rhetoric.\n\n“Donald Trump is increasingly unstable and unhinged and will stop at nothing to claim unchecked power for himself,” Harris said Thursday in La Crosse, Wisconsin.\n\nIt’s a far cry from the “joy” that swirled around her elevation to the top of the Democratic ticket this summer. As that surge of enthusiasm has eased, Harris is staking her campaign on increasingly sharp attacks on Trump meant to get her supporters to turn out and to win over the tiny universe of persuadable voters left in exceedingly tight battleground states.\n\nAt her La Crosse rally, she noted that Trump falsely claimed this week that the violent Capitol riot on Jan. 6, 2021, was “a day of love.”\n\n“There were attacks on law enforcement,” she said, recalling the insurrection where Trump supporters tried to block the counting of electoral votes that formalized President Joe Biden’s victory. “The American people are exhausted with his gaslighting. Enough! We are ready to turn the page!”\n\n“Roll the clip,” she said a week earlier, directing a rally audience to watch a video of the former president calling for rooting out an “enemy within” the country.\n\nAnd she told radio host Charlamagne Tha God during a radio town hall this week that “Yes, we can say” that Trump was threatening to bring fascism to the country.\n\nSince taking over the top of the Democratic ticket in late July, Harris and her team have been torn between the competing priorities of introducing the vice president to voters and turning the race into a referendum on the former president after Biden’s debate flop put Democrats in the spotlight.\n\nIn the opening weeks of her campaign, she tried to thread the needle by sharing with voters her background as a prosecutor, telling stories about her upbringing and laying out her vision of how she would govern if elected.\n\nHarris has been no stranger to criticizing Trump, but the urgency and vividness of her warnings about him have noticeably ramped up in recent days.\n\n“He wants to send the military after American citizens. He wants to prevent women from making decisions about their own bodies,” Harris said in La Crosse. “He wants to threaten fundamental freedoms and rights like the freedom to vote, the freedom to be safe from gun violence, to breathe clean air and drink clean water, and the freedom to love who you love openly and with pride.”\n\nIt marks a return to the guiding strategy that was first outlined by Biden aides a year ago, when he was planning his reelection bid, and that is now being deployed by his hand-picked successor.\n\n“People go negative because it works,” said Republican strategist Brendan Buck, a former top aide to GOP House Speaker Paul Ryan. “Harris needed to make herself an acceptable alternative but ultimately the coalition was always going to be more of an anti-Trump one than anything affirmatively pro-Harris.”\n\nSome of the attacks on Trump are part of Harris’ explicit outreach urging Republican voters to cross party lines, like her rally Wednesday in Pennsylvania with dozens of anti-Trump Republican political figures. Her team views it as a unique opportunity for Harris to increase her base of support and tap into a collection of voters who’ve already rejected Trump in the past.\n\nFormer Biden communications director Kate Bedingfield said attacking Trump gives Harris an opening with independent and even moderate Republican voters, and shifts the political conversation to ground where she is stronger — protecting American democracy — and away from issues where Republicans are often seen as stronger, such as immigration and the economy.\n\n“Putting the stakes of this election front and center in the final few weeks may help motivate a slice of voters who are otherwise tired of the process,” she said.\n\nGreg Swagel, a 76-year-old retired yacht builder from Sturgeon Bay, Wisconsin, showed up to Harris’ rally Thursday in Green Bay wearing a Green Bay Packers sweatshirt and said he “most definitely” agrees with Harris becoming more aggressive in her rhetoric.\n\n“She has to put (Trump) in his place,” Swagel said. “He tells lies. He calls people names. Just as long as she doesn’t become him in the sense of lowering herself.”\n\nMiller reported from Washington. Associated Press writers Chris Megerian in La Crosse, Wisconsin, Todd Richmond in Green Bay, Wisconsin, and Colleen Long in Washington contributed to this report.","summary":"Harris campaign features less talk of joy and more head-on digs at Trump as Election Day nears  The Associated Press","url":"https://apnews.com/article/harris-trump-wisconsin-negative-political-attacks-fccd9cb11d304c59e6c8119d7e1e9b54","image":"https://dims.apnews.com/dims4/default/2c9ee0a/2147483647/strip/true/crop/2403x1352+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Fc2%2F34bd11a52f381116dc4087ad29ed%2F2c73d6ab25744362a9d289331a6c23fc","video":null,"publish_date":"2024-10-17 22:50:00","author":"Steve Karnowski,Zeke Miller","authors":["Steve Karnowski","Zeke Miller"],"language":"en","source_country":"us","sentiment":-0.199},{"id":260120834,"title":"Israel Confirms Hamas Leader Yahya Sinwar Killed; Biden Says Good Day for Israel and World | Capitol Report","text":"Oct-17-2024\n\nIsrael says the leader of Hamas is dead. He planned the Oct. 7 attack on Israel, among other crimes. What does the United States say about the next steps Israel should take?\n\nVice President Kamala Harris rallies in the key battleground state of Wisconsin, and former President Donald Trump attends the Al Smith charity dinner.","summary":"Israel says the leader of Hamas is dead. He planned the Oct. 7 attack on Israel, among other crimes. What does the United States say about the next steps Israel should take? Vice President Kamala Harris rallies in the key battleground state of Wisconsin, and former President Donald Trump attends the Al Smith charity dinner. [&#8230;]","url":"https://www.theepochtimes.com/epochtv/israel-confirms-hamas-leader-yahya-sinwar-killed-biden-says-good-day-for-israel-and-world-capitol-report-5743265","image":"https://img.theepochtimes.com/assets/uploads/2024/10/17/id5743278-CR_241017_HDtn_EN.jpg","video":null,"publish_date":"2024-10-17 22:47:30","author":"Steve Lance","authors":["Steve Lance"],"language":"en","category":"politics","source_country":"us","sentiment":-0.075}]}