{"offset":0,"number":50,"available":10657,"news":[{"id":343923092,"title":"Marcos to meet Trump in high-stakes trade talks as US tariff looms","text":"Philippine President Ferdinand Marcos Jnr will meet his US counterpart Donald Trump for high-stakes talks on Tuesday that analysts say could see him trade military access and mineral rights for a lower tariff on his country’s exports.\n“I intend to convey to President Trump and his cabinet officials that the Philippines is ready to negotiate a bilateral trade deal that will ensure strong, mutually beneficial, and future-oriented collaborations that only the United States and the Philippines will be able to take advantage of,” Marcos Jnr said before departing for Washington on Sunday.\nHe added that his “top priority for this visit is to push for greater economic engagement, particularly through trade and investment between the Philippines and the United States”.\nMarcos is scheduled to meet Trump at the White House following discussions with Secretary of Defence Pete Hegseth and Secretary of State Marco Rubio on Monday.\nThe agenda was hinted at on July 10, when US Department of State spokeswoman Tammy Bruce said potential deals included private sector investment in the Luzon Economic Corridor, an agreement on “the Philippines’ wealth in critical minerals” and “trilateral cooperation in the Philippines on cybersecurity, energy [including nuclear energy] and investments in reliable and secure telecommunications networks”.\nThe Philippines could end up granting the US more access to military facilities under their Enhanced Defence Cooperation Agreement (EDCA), as well as offering favourable terms on mining concessions, potentially including rare earth minerals, analysts told This Week in Asia.\nIn return, the Philippines is expected to seek a lower tariff on its exports, a larger share of US foreign investment – especially in defence and security industries – and immigration safeguards for Filipinos living in the US, such as protection from forced deportation and reduced fees on remittances.\n\nThe trip comes with a sense of urgency, just days before Marcos delivers his annual State of the Nation Address next Monday, amid growing domestic criticism over the higher US tariff on Philippine goods.\nIn April, the US announced a so-called “reciprocal tariff” of 17 per cent for imports from the Philippines, which came barely weeks after Hegseth visited Manila to reaffirm Washington’s “ironclad commitment” to the alliance. A temporary suspension delayed implementation for 90 days, but the levy was raised to 20 per cent on July 8, just ahead of Marcos Jnr’s visit, despite ongoing trade negotiations.\nThe International Coalition for Human Rights in the Philippines (ICHRP) called Trump’s tariff “punitive” and a form of “naked bullying” that would harm the poorest Filipinos, while “turning the Philippines into a massive military base for war with China”.\nJonathan Ravelas, a financial risk analyst, described the situation over the trade talks as being “between a rock and a hard place”.\nSince Washington might request the use of additional EDCA sites, Manila could leverage that demand to secure funding for its military modernisation programme, said Ravelas, managing director of eManagement for Business and Marketing Services.\nThe Philippines should offer zero tariffs on US agricultural imports in exchange for getting “most favoured nation” status for trade and technical help to help stabilise domestic food prices, he added.\nIt’s the art of the deal\nJonathan Ravelas, financial risk analyst\nAsked why the US would impose a higher tariff on a long-standing security ally, Ravelas replied: “It’s the art of the deal. They need something. For us, taking advantage of the US supply chain of food and feeds, for them [it] could be minerals and bases access.”\nRonald Acoba, founder and chief investment strategist at Trading Edge Training & Consultancy, said the US would likely ask for zero or lower tariffs on its goods, particularly agriculture. In response, the Philippines could reduce tariffs to zero on some US goods, Acoba told This Week in Asia.\nThe US would also look to expand EDCA sites, especially in Luzon, and seek greater access to Philippine mineral resources, Acoba said.\n“Since the Philippines has pivoted away from China, it has no choice but to lean on the US in terms of defence,” Acoba said. Without Washington’s backing, Manila would run the risk of being pushed back by Beijing as it was in the Spratly Islands some years ago, he added.\nWhile the Philippines is an exporter of raw minerals like nickel to China, it could feasibly sell them to the US as well, according to Acoba.\n“As part of the deal, we can ask [the US] for investments in refining facilities so down the line we can also export finished goods rather than just ore,” he said.\n“The US is essentially treating Asean as a block. As for the tariffs involved, it’s more on a transactional basis, not whether a country is a military ally or not.”\n\nSemiconductor industry leaders in the Phllippines warned last week that the US tariff could stunt growth.\nDanilo Lachica, president of the Semiconductor and Electronics Industries in the Philippines Foundation, Inc. (SEIPI), said in a television interview that the 20 per cent tariff was “disappointing”, especially as the deficit posted by the US in its trade with the Philippines was “much, much less” than that for its trade with Vietnam.\nTwo-way goods trade between the US and the Philippines totalled US$23.5 billion last year, with Washington posting a deficit of US$4.9 billion, according to data from the Office of the United States Trade Representative (USTR). In comparison, the US posted a deficit of US$123.5 billion in its goods trade with Vietnam last year, separate data from the USTR shows.\nLachica pointed out that if the US tariff for the Philippines were to remain at 20 per cent – the same level for Vietnam after negotiations between Washington and Hanoi – Manila would lose out to “one of our biggest competitors”.\nAccording to Fermin Adriano, a former agriculture undersecretary serving then president Rodrigo Duterte, the tariff would have less of an impact on Philippine agriculture as coconut oil was the only major item exported to the US for the sector.\nIn contrast, US agricultural exports to the Philippines such as soybeans, chicken, pork and wheat might surge if Trump were to succeed in seeking lower tariffs from Manila, Adriano said. Many American farmers – many of whom were Trump’s supporters – could not sell to China due to Beijing’s retaliatory move over Washington’s tariffs, prompting the US to seek alternative markets, he added.\n“It is on the agri import side that we will have a greater impact as we import a lot of soybeans, chicken, pork and partly wheat from the US.”","summary":"Philippine President Ferdinand Marcos Jnr will meet his US counterpart Donald Trump for high-stakes talks on Tuesday that analysts say could see him trade military access and mineral rights for a lower tariff on his country’s exports.\n“I intend to convey to President Trump and his cabinet officials that the Philippines is ready to negotiate a bilateral trade deal that will ensure strong, mutually beneficial, and future-oriented collaborations that only the United States and the Philippines will...","url":"https://www.scmp.com/week-asia/economics/article/3319058/philippines-marcos-meet-trump-high-stakes-trade-talks-us-tariff-looms","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/07/21/c1357d83-818a-49f8-b602-12327e52251a_a4d1d2c6.jpg","video":null,"publish_date":"2025-07-22 01:30:19","author":"Raissa Robles","authors":["Raissa Robles"],"language":"en","category":"politics","source_country":"cn","sentiment":0.146},{"id":343921324,"title":"Trump rages as Jewish judge rips administration apart for stripping 'antisemitic' Harvard of its funding in blistering courtroom showdown","text":"Donald Trump has fired off a furious missive at a Jewish judge who holds power in his war with Harvard.\n\nJudge Allison Burroughs is presiding over the tense lawsuit to determine whether the Trump administration can legally defund Harvard for not taking a strong enough stance against antisemitism on campus.\n\nWhile she did not issue a ruling in Monday's hearing, her barrage of questions toward the administration's lawyer and her status as an Obama-era appointee was enough for Trump to find fault with her handling of the case.\n\n'The Harvard case was just tried in Massachusetts before an Obama appointed Judge. She is a TOTAL DISASTER, which I say even before hearing her ruling,' he wrote in a Truth Social post. \n\n'She has systematically taken over the various Harvard cases, and is an automatic 'loss' for the people of our country!\n\n'How did this Trump-hating Judge get these cases? When she rules against us, we will IMMEDIATELY appeal, and WIN.'\n\nTrump argued Harvard 'has $52 billion dollars sitting in the bank, and yet they are anti-Semitic, anti-Christian, and anti-America.'\n\n'Much of this money comes from the USA, all to the detriment of other schools, colleges, and institutions,' he wrote, adding, 'we are not going to allow this unfair situation to happen any longer.'\n\nTrump vowed to 'not stop until there is victory', promising to cut funding to Harvard no matter how much effort it took. \n\nBut if Judge Burroughs rules in Harvard's favour, it could make Trump's promise hard to deliver on.\n\nSteven Lehotsky, representing Harvard, said at Monday's hearing the case is about the government trying to control the 'inner workings' of the institution. \n\nAt Monday's hearing, Harvard asked to reverse funding freezes in an effort to revive Harvard's sprawling scientific and medical research operation and hundreds of projects that lost federal money.\n\nA lawyer for the government, Michael Velchik, said the Trump administration has authority to cancel the grants after determining the funding did not align with its priorities, namely Trump's executive order combating antisemitism.\n\nHe argued Harvard allowed antisemitism to flourish at the university following the October 7, 2023, Hamas-led attacks on Israel.\n\nHe said protesters had camped out on campus chanting antisemitic slogans and cited attacks on Jewish students.\n\n'Harvard claims the government is anti-Harvard. I reject that,' Velchik, a Harvard alumnus, said. \n\n'The government is pro-Jewish students at Harvard. The government is pro-Jewish faculty at Harvard.'\n\nJudge Burroughs pushed back, at one point describing the government's assertions as 'mind-boggling.'\n\n'What I'm wrestling with is this idea that the executive branch can decide what is discriminatory or racist,' she said.\n\n'You're saying you can terminate a contract for any and all reasons, even if the reason you're giving is a violation of the Constitution? I don't think you can justify a contract action based on impermissible suppression of speech.' \n\nVelchik said the case comes down to the government's choosing how best to spend billions of dollars in research funding.\n\nJudge Burroughs said: 'Let's assume for the sake of argument that Harvard has not covered itself in glory on the topic of antisemitism.'\n\nNoting her own Jewish faith, the judge asked what the relationship was between antisemitism and cutting funding to cancer research.\n\n'You're not taking away grants from labs that have been antisemitic,' she noted.\n\nDespite her strongly worded rebuke, Judge Burroughs did not deliver a verdict at the bench, and is instead expected to issue a written decision at a later date. \n\nHarvard's lawsuit accused the Trump administration of waging a retaliation campaign against the university after it rejected a series of demands from a federal antisemitism task force in April. \n\nThe task force's demands included sweeping changes related to campus protests, academics and admissions. \n\nHarvard was told to audit the viewpoints of students and faculty and admit more students or hire new professors if the campus was found to lack diverse points of view.\n\nHarvard President Alan Garber says the university has made changes to combat antisemitism but said no government 'should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue.","summary":"Judge Allison Burroughs is presiding over the lawsuit to determine whether the Trump administration can legally defund Harvard for not taking a strong enough stance against antisemitism on campus.","url":"https://www.dailymail.co.uk/news/article-14926939/trump-Harvard-lawsuit-Judge-Allison-Burroughs.html","image":"https://i.dailymail.co.uk/1s/2025/07/22/01/100509397-0-image-m-59_1753143425131.jpg","video":null,"publish_date":"2025-07-22 01:26:49","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.347},{"id":343921338,"title":"RFK Jr. 'feels duped' by Cheryl Hines after buying $4.3M DC love nest she refuses to move into","text":"Robert F. Kennedy Jr. is reportedly bamboozled after spending millions on a love nest in Washington, only to learn that wife Cheryl Hines wants nothing to do with living in the capitol. \n\nThe pair has been in the spotlight since Kennedy reportedly had a 'digital affair' with journalist Olivia Nuzzi.\n\nRFK Jr., 70, was eventually named Secretary of Health and Human Services after Donald Trump won the election and relocated to Washington.\n\nEarlier this year, he purchased a $4.34million town house in the city's Georgetown area in hopes that it could be a place for them to mend fences while Kennedy got to work 'Making America Healthy Again.'\n\nThe home - billed as 'the epitome of ritzy Georgetown elegance' – made sources believe Hines, 59, could see an end to Kennedy's 'lust demons' which led to his self-admitted past of pursuing other women. \n\nHowever, sources told The New York Post that Hines has 'no plans' to be 'a full-time political wife.' \n\n'Bobby felt the house in Georgetown would mend their marital bridges,' an anonymous Kennedy ally said, with hopes of 'keeping their marriage alive and that the two could become Washington’s latest power couple.'\n\nThe son of the former presidential candidate even 'swore to Cheryl there would be no more playing around with other women, and he restored Cheryl’s trust in him to keep it in his pants.' \n\nHowever, Hines has no aspirations of becoming a 'political wife' and considers Washington a 'deadbeat town,' leading Kennedy to reportedly say he's 'been taken for a ride.'\n\nThe liberal actress also is 'still not convinced Bobby should be working in the right-wing Republican Trump administration.' \n\nRobert F. Kennedy Jr. feels “he’s been taken for a ride” by wife Cheryl Hines — after he bought a home in Washington, DC, to please her and the actress now has “no plans” to leave Hollywood or “become a full-time political wife,” according to sources.\n\nIt's a change from what many believed was Hines' insistence on buying property in Washington. \n\nEven before Kennedy was confirmed as head of HHS, when the longtime Democrat was running as an Independent for president, Cheryl had begun hunting for a real estate agent in the nation's capital who handled upscale properties.\n\nWhen this spectacular row home came on the market about three months ago, she said she wanted it.\n\n'She ordered Bobby to sign the papers for it,' the insider revealed.\n\nOn the first floor of the grandiose colonial home is 'a dignified reception foyer housing the classic staircase and adjacent is the open concept formal living and dining room,' realtor Daniel Heider gushed in his description of the home.\n\nIt has a chef's dream kitchen of royal proportions featuring furniture-grade glass inset cabinetry, granite countertops and commercial-grade appliances including an industrial strength range.\n\nThe great room, which usually serves as a multi-purpose communal room, has a wall of arched windows and twin arched glass doors that lead to the rear terrace, providing sanctuary away from its urban location.\n\nThe second level is dedicated to the master suite, spanning the home's entire width, and overlooks 31st Street.\n\nThe master suite has a fireplace, one of six in the home, with the suite having a 'fabulous' bath steam shower and cast iron tub.\n\nOn the top level are two additional bedrooms, featuring private fireplaces and a shared bath.\n\nIn the lower level, there's an additional bedroom suite, a wine cellar, a wet bar and a second laundry room.\n\nThe seller, according to public records, agreed to pay for one year of Kennedy's parking on the lot of a nearby CVS, a block away from his new crib.\n\nKennedy purchased the home for the full listing price of $4.34million, which had dropped from the previous listing price of $4.695million, as the home had been on the market for almost three months.\n\nAccording to DC real estate records, the three-story, semi-detached home with parking on the 'verdant, tree-lined,' but heavily-trafficked Georgetown street is considered the 'embodiment of luxury city living'.\n\nThe home, originally constructed at the turn of the 20th century, is just a block from the chic restaurants and trendy clothing shops on Wisconsin Avenue, and is just 15 minutes away from the White House.\n\nLast year, Kennedy, who had cheated on his first two wives, Emily Black and Mary Richardson – who later committed suicide – got caught up in a bizarre sexting scandal with a gorgeous New York magazine political reporter, half Kennedy's age, Olivia Nuzzi, 31.\n\nThe Nuzzi affair was 'the last straw' for the Curb Your Enthusiasm star, who seemingly 'lost all trust in Bobby ever being monogamous', had threatened divorce and had been spotted without her wedding ring in the wake of the scandal, according to insiders.\n\nNuzzi was last seen publicly in mid-October, just days before parting ways with the magazine, at a star-studded fashion event that honored 'trailblazing women.' \n\nInsiders told the New York Post the pair had engaged in 'sexting' despite RFK Jr. being married and Nuzzi being engaged to Politico's chief Washington correspondent Ryan Lizza, 50, at the time.\n\nNuzzi said that in early 2024, the nature of some communication between herself and a former reporting subject turned personal. \n\n'Earlier this year, the nature of some communication between myself and a former reporting subject turned personal,' Nuzzi said. \n\n'During that time, I did not directly report on the subject nor use them as a source,' she said.\n\n'The relationship was never physical but should have been disclosed to prevent the appearance of a conflict. I deeply regret not doing so immediately and apologize to those I've disappointed, especially my colleagues at New York.'\n\nNew York magazine acknowledged an inappropriate relationship in a statement about Nuzzi's hiatus, deeming it 'a violation of the magazine's standards around conflicts of interest and disclosures'.\n\n'Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,' the statement read.\n\nKennedy has adamantly denied any sort of relationship with Nuzzi.\n\n'Mr. Kennedy only met Olivia Nuzzi once in his life for an interview she requested, which yielded a hit piece,' his spokesman told CNN. A source added that the nature of the relationship was 'emotional and digital in nature, not physical'.\n\nIn her profile Nuzzi, described meeting the former presidential candidate at the $7 million California home he shares with his wife.\n\nShe painted a picture of RFK Jr. as an anti-establishment candidate, 'turning the presidential election upside down'.\n\n'Fear — and denial — is what Kennedy seems to inspire among the staid Washington Establishment supporting the incumbent president and the gangland anti-Establishment Establishment supporting the former president,' she wrote.\n\nShe touched on conflict in RFK Jr.'s marriage over his appearance on Steve Bannon's show and those of other right-wing personalities.\n\n'Bannon was only the beginning. Poor Cheryl,' Nuzzi wrote.\n\nAt the time the piece was published, RFK Jr. was in the election race as an independent candidate, but later dropped out, endorsed Trump and became HHS Secretary after he won.\n\nNuzzi's last article, in which she described examining Trump's ear following the Butler assassination attempt, was published by the magazine on September 9.\n\nSince the exposure of the affair, Nuzzi and her ex-fiance Lizza, have entered a bitter court battle, in which Nuzzi accused her former partner of threatened violence and attempted to blackmail her. \n\nLizza has adamantly denied the allegations made against him. \n\nIn a statement shared with DailyMail.com, Lizza claimed: 'These allegations are disgraceful lies that Ms. Nuzzi has used to harass me for weeks in a coordinated defamation campaign. \n\n'Her own catastrophic recklessness is solely responsible for the humiliation and ridicule she claims she has suffered. She is abusing protections meant for survivors of domestic violence to ruin my reputation in a last-ditch effort to salvage her own.","summary":"The pair has been in the spotlight since Kennedy reportedly had a 'digital affair' with journalist Olivia Nuzzi.","url":"https://www.dailymail.co.uk/news/article-14927079/RFK-Jr-duped-Cheryl-Hines-buying-DC-love-nest.html","image":"https://i.dailymail.co.uk/1s/2025/07/22/02/100510207-0-image-m-26_1753146361093.jpg","video":null,"publish_date":"2025-07-22 01:24:56","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":-0.157},{"id":343921864,"title":"Iran: Enrichment to continue despite damage to nuclear sites; Trump threatens more attacks","text":"U.S. President Donald Trump on Monday threatened further military action against Iran and demanded an apology from CNN, asserting that last month's attacks successfully destroyed the Islamic Republic's nuclear facilities.\n\nWriting on his social media platform Truth Social, Trump quoted Iranian Foreign Minister Abbas Araghchi regarding the damage to Iran's nuclear sites.\n\n\"Iran's Foreign Minister, Abbas Araghchi, on the Iran Nuclear Sites: 'Damages are very severe, they are destroyed.' Of course they are, just like I said, and we will do it again, if necessary!\" Trump wrote. He continued, \"Fake News CNN should immediately fire their phony 'reporter' and apologize to me and the great pilots who 'OBLITERATED' Iran's nuclear sites. CNN is a major ratings loser, as is MSDNC!\"\n\nEarlier Monday, Araghchi told Fox News that Tehran could not abandon its uranium enrichment program, despite severe damage incurred during last month's Israel-Iran conflict.\n\n\"It is stopped because, yes, damages are serious and severe. But obviously we cannot give up (on) enrichment because it is an achievement of our own scientists. And now, more than that, it is a question of national pride,\" Araghchi told a Fox News program.\n\nThe foreign minister confirmed the damage to Iran's nuclear facilities after U.S. and Israeli strikes was serious and undergoing further evaluation.\n\nAraghchi also stated that Iran's Supreme Leader Ayatollah Ali Khamenei was in \"good health\" and that Tehran was open to indirect talks with Washington \"for the time being.\"","summary":"","url":"https://www.haaretz.com/israel-news/2025-07-22/ty-article-live/iran-enrichment-to-continue-despite-damage-to-nuclear-sites-trump-threatens-more-attacks/00000198-2fa8-dce9-abfd-6fae5c3e0000","image":"https://img.haarets.co.il/bs/00000198-2ed0-d5d4-a9fd-6ef7ea940000/22/cb/f2de1f194e48a2f60ed063d56728/500741.jpg","video":null,"publish_date":"2025-07-22 01:22:06","author":"Haaretz","authors":["Haaretz"],"language":"en","category":"politics","source_country":"il","sentiment":-0.72},{"id":343920744,"title":"Iran admits direct talks with US in future on equality basis — foreign minister","text":"NEW YORK, July 22. /TASS/. Tehran admits the possibility of holding direct talks with Washington on the Iranian nuclear program in the future if the US deals with Iran on an equal footing, the republic’s Foreign Minister Abbas Araghchi said in an interview with Fox News.\n\n\"Not for the time being, but maybe in the future,\" he said when asked whether any direct contacts between the Iranian side and the administration of US President Donald Trump could take place at some point. \"Everything depends on whether the United States is ready to deal with Iran on an equal footing, on mutual respect and on mutual interests,\" the minister added.\n\nIran is \"very skeptical with Americans right now\" after the Joint Comprehensive Plan of Action (JCPOA) on the Iranian nuclear program \"didn't become a successful story, didn't become a successful experience for us,\" Araghchi said. \"This is why we are not ready to engage with them [US administration] directly. But the moment we feel that everything is in a right order, then everything is possible,\" he stressed.\n\nIn 2015, Iran, along with the UK, China, France, Germany, Russia, and the United States, signed the Joint Comprehensive Plan of Action (JCPOA), resolving a crisis that began in 2002 amid Western accusations that Tehran was seeking nuclear weapons. However, in 2018, Trump announced the US exit from the JCPOA and reinstated all sanctions against Iran. In response, Iran declared in 2020 that it would scale back its commitments under the JCPOA and restrict access for International Atomic Energy Agency (IAEA) inspectors. Negotiations aimed at reviving the nuclear deal, held in Vienna from 2021 to 2022, ended without a resolution. Upon returning to the White House in 2025, Trump signed an executive order to reintroduce a policy of maximum pressure on Iran, threatening military action if Tehran did not agree to a new deal with Washington.","summary":"Iran is \"very skeptical with Americans right now\", Abbas Araghchi said","url":"https://tass.com/world/1992353","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-22 01:20:09","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.479},{"id":343919438,"title":"Federal judge blocks Trump administration from defunding Planned Parenthood","text":"A judge on Monday temporarily blocked the Trump administration from stripping Medicaid funds from Planned Parenthood after Congress and President Donald Trump agreed to partially defund the nonprofit through passage of the One Big Beautiful Bill Act. Judge Indira Talwani of the U.S. District Court for the District of Massachusetts said in her order partially granting a preliminary injunction that the bill unconstitutionally punishes Planned Parenthood member organizations that do not provide abortions. The injunction will risk \"at most minimal harm—financial or otherwise—to\" the Trump administration while the lawsuit proceeds,\" Talwani, an Obama appointee, wrote. SENATE PARLIAMENTARIAN OKS BAN ON PLANNED PARENTHOOD FEDERAL FUNDING IN TRUMP MEGABILL Talwani’s order arose from a lawsuit brought by Planned Parenthood, the nation's largest abortion vendor, over the One Big Beautiful Bill Act, a massive budget bill that passed Congress this month with no Democrat support. Trump signed the bill into law on July 4. A provision in the bill stripped Medicaid funding from Planned Parenthood, which the nonprofit said could force it to close about 200 of its 600 facilities and deprive about half of its customers, more than one million people, of services that do not include abortion. Planned Parenthood attorneys noted in court filings that Medicaid does not cover abortion. JUDGE TORCHED FOR PLANNED PARENTHOOD ORDER: HER COURT LOOKS ‘LIKE A FAST FOOD DRIVE-THRU’ The attorneys argued that cancer and sexually transmitted infections would go undetected, especially for low-income people, and that more unplanned pregnancies would occur because of a lack of contraception access. They said the consequences of losing Medicaid funding \"will be grave.\" Department of Justice (DOJ) attorneys had previously argued in court filings that the purpose of the budget provision was to stop \"federal subsidies for Big Abortion\" by freezing federal funds for certain Medicaid recipients who provide abortions. Weakening Planned Parenthood has been one of the pro-life movement's leading priorities since the Supreme Court overturned Roe v. Wade. Talwani granted a temporary restraining order two weeks ago in favor of Planned Parenthood. The judge initially offered no explanation for her decision, a move that led to widespread backlash among Republicans who described it as judicial overreach. Days later, Talwani offered more context in a subsequent order. PLANNED PARENTHOOD USING 'LOOPHOLE' TO GET MINORS GENDER TRANSITIONS WITHOUT PARENTS' OK: WATCHDOG The preliminary injunction will leave in place the pause on defunding Planned Parenthood indefinitely, but the Trump administration is likely to appeal the order to the U.S. Court of Appeals for the First Circuit. DOJ attorneys had previously argued to the court that blocking a measure that was passed by Congress and signed by the president was an extraordinary move and unjustified. CLICK HERE TO GET THE FOX NEWS APP \"Beyond the futility of the claims on the merits, Planned Parenthood fails to demonstrate imminent irreparable harm to justify an injunction, asserting only classically reparable economic injury and irrelevant potential harm to patients, who are third parties not before this Court,\" DOJ attorneys wrote.","summary":"A judge blocked the Trump administration from stripping Medicaid funds from Planned Parenthood after Congress and President Donald Trump agreed to defund the nonprofit through passage of the One Big Beautiful Bill Act.","url":"https://www.foxnews.com/politics/federal-judge-blocks-trump-administration-from-defunding-planned-parenthood","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/supreme-court-planned-parenthood-photo-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-22 01:02:39","author":"Ashley Oliver","authors":["Ashley Oliver"],"language":"en","category":"politics","source_country":"US","sentiment":-0.316},{"id":343922770,"title":"Japan PM hangs on after election debacle","text":"TOKYO: Japanese Prime Minister Shigeru Ishiba clung on Monday even after an election debacle left his coalition without a majority in the upper house, as painful new US tariffs loom.\n\nIn Sunday’s election Ishiba’s Liberal Democratic Party (LDP), which has governed almost continuously since 1955, and its partner Komeito fell a projected three seats short of retaining a majority in the upper house.\n\nVoters angry at inflation turned to other parties, notably the “Japanese first” Sanseito, which made strong gains with its “anti-globalist” drive echoing the agenda of populist parties elsewhere.\n\n“I even think (the LDP) should have lost more,” 25-year-old Kazuyo Nanasawa, who voted for a small ultra-conservative party, told AFP, adding that Ishiba should quit.\n\nThe debacle comes only months after Ishiba’s coalition was forced into a minority government in the more powerful lower house, in the LDP’s worst result in 15 years.\n\nBut asked late Sunday if he intended to remain in office, Ishiba told local media: “That’s right.”\n\n“Although I’m acutely aware of our grave responsibility for the election results, in order to not let politics become stagnant, I believe I must fulfil my responsibility as the party with the most votes and to the people of the country, while listening carefully and sincerely to the voices of the local people,” Ishiba told a news conference on Monday.\n\nHe called the election result “extremely regrettable”. \n\nIt was unclear in any case who might step up to replace Ishiba given the LDP’s frequent changes of leader in recent years.\n\nLDP supporter Takeshi Nemoto, 80, told AFP that a new leadership contest “would be a losing battle” for the party, further complicating tariff talks with US President Donald Trump’s administration.\n\n“Diplomacy is under pressure at the moment,” agreed Shuhei Aono, 67. “Who is going to take care of it? I think (Ishiba) cannot easily withdraw.”\n\nThe election saw 125 seats in the 248-seat upper house contested. \n\nThe coalition needed 50 of those but local media reported they only won 47, with the LDP winning 39 and Komeito eight, giving them 122 deputies.\n\nSecond-placed was the Constitutional Democratic Party of Japan (CDP), which won 22 contested seats, followed by the Democratic Party For the People (DPP) with 17.\n\nThe right-wing Sanseito party won 14 seats.\n\nSanseito wants “stricter rules and limits” on immigration, opposes “radical” gender policies, and wants a rethink on decarbonisation and vaccines.\n\nIt was forced last week to deny any links to Moscow — which has backed populist parties elsewhere — after a candidate was interviewed by Russian state media.","summary":"TOKYO: Japanese Prime Minister Shigeru Ishiba clung on Monday even after an election debacle left his coalition without a majority in the upper house, as painful new US tariffs loom.\n\n\n\nIn Sunday’s election Ishiba’s Liberal Democratic Party (LDP), which has governed almost continuously since 1955, and its partner Komeito fell a projected three seats short of retaining a majority in the upper house.\n\n\n\nVoters angry at inflation turned to other parties, notably the “Japanese first” Sanseito, which made strong gains with its “anti-globalist” drive echoing the agenda of populist parties elsewhere.\n\n\n\n“I even think (the LDP) should have lost more,” 25-year-old Kazuyo Nanasawa, who voted for a small ultra-conservative party, told AFP, adding that Ishiba should quit.\n\n\n\nThe debacle comes only months after Ishiba’s coalition was forced into a minority government in the more powerful lower house, in the LDP’s worst result in 15 years.\n\n\n\nBut asked late Sunday if he intended to remain in office, Ishiba told local media","url":"https://www.brecorder.com/news/40373771/japan-pm-hangs-on-after-election-debacle","image":"https://i.brecorder.com/large/2025/07/687edfc28fbce.jpg","video":null,"publish_date":"2025-07-22 00:56:51","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.236},{"id":343922744,"title":"Ahead of new talks, Iran blames Europeans for nuclear deal collapse","text":"TEHRAN: Tehran on Monday blamed European powers for the failure of the 2015 nuclear deal, accusing them of breaking commitments ahead of renewed talks in Istanbul with Britain, France and Germany.\n\nThe 2015 agreement — reached between Iran and UN Security Council permanent members Britain, China, France, Russia and the United States, plus Germany — imposed curbs on Iran’s nuclear programme in exchange for sanctions relief.\n\nHowever, it unravelled in 2018 when the United States, during Donald Trump’s first term as president, unilaterally withdrew from the accord and reimposed sweeping sanctions.\n\nThough Europe pledged continued support, the mechanism to offset US sanctions never effectively materialised, forcing many Western firms to exit Iran and deepening its economic crisis.","summary":"TEHRAN: Tehran on Monday blamed European powers for the failure of the 2015 nuclear deal, accusing them of breaking commitments ahead of renewed talks in Istanbul with Britain, France and Germany.\n\n\n\nThe 2015 agreement — reached between Iran and UN Security Council permanent members Britain, China, France, Russia and the United States, plus Germany — imposed curbs on Iran’s nuclear programme in exchange for sanctions relief.\n\n\n\nHowever, it unravelled in 2018 when the United States, during Donald Trump’s first term as president, unilaterally withdrew from the accord and reimposed sweeping sanctions.\n\n\n\nThough Europe pledged continued support, the mechanism to offset US sanctions never effectively materialised, forcing many Western firms to exit Iran and deepening its economic crisis.","url":"https://www.brecorder.com/news/40373770/ahead-of-new-talks-iran-blames-europeans-for-nuclear-deal-collapse","image":"https://i.brecorder.com/large/2025/07/687ee08a23414.jpg","video":null,"publish_date":"2025-07-22 00:56:51","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.031},{"id":343921832,"title":"Oil prices decline","text":"HOUSTON: Oil prices fell on Monday, as the latest European sanctions on Russian oil are expected to have minimal impact on supplies, while US tariffs stoked demand concerns. \n\nBrent crude futures dropped 26 cents, or 0.4%, to $69.02 a barrel by 11:08 a.m. EDT (1508 GMT), while US West Texas Intermediate crude slipped by 24 cents, or 0.4%, to $67.10. The European Union on Friday approved the 18th package of sanctions against Russia over the war in Ukraine, which also targeted India’s Nayara Energy, an exporter of oil products refined from Russian crude. \n\n“The market right now thinks that supply will still make it to market in one way, shape or another, there is not too much concern,” said John Kilduff, a partner at Again Capital in New York. \n\nKremlin spokesperson Dmitry Peskov said on Friday that Russia had built up a certain immunity to Western sanctions. The EU sanctions followed US President Donald Trump’s threats last week to impose sanctions on buyers of Russian exports unless Russia agrees to a peace deal within 50 days. \n\nING analysts said the part of the package likely to have an effect is the EU import ban on refined products processed from Russian oil in third countries, though it said it could prove difficult to monitor and enforce. Iran, another sanctioned oil producer, is due to hold nuclear talks with Britain, France and Germany in Istanbul on Friday, an Iranian foreign ministry spokesperson said on Monday. \n\nThat follows warnings by the three European countries that a failure to resume negotiations would lead to international sanctions being reimposed on Iran. In the United States, the number of operating oil rigs fell by two to 422 last week, the lowest total since September 2021, Baker Hughes said on Friday. \n\n“Oil-focused drilling is expected to remain at subdued levels through the balance of the year,” StoneX analyst Alex Hodes said in a note on Monday. “We aren’t anywhere close to prices that merit a significant pullback in investment though,” Hodes added. \n\nMeanwhile, US tariffs on EU imports are set to kick in on August 1, though US Commerce Secretary Howard Lutnick said on Sunday that he was confident the United States could secure a trade deal with the bloc. \n\n“The US tariffs are potentially negative for oil demand and economic activity. We haven’t seen it yet, but it is in the cards,” Again Capital’s Kilduff said. While tariff concerns will continue to add pressure in the lead up to the August 1 deadline, some support may come from oil inventory data if it shows tight supply, said IG market analyst Tony Sycamore. \n\n“It feels very much like a $64-$70 range in play for the week ahead.” Brent crude futures have traded between a low of $66.34 a barrel and a high of $71.53 after a ceasefire deal on June 24 halted the 12-day Israel-Iran war.","summary":"HOUSTON: Oil prices fell on Monday, as the latest European sanctions on Russian oil are expected to have minimal impact on supplies, while US tariffs stoked demand concerns. \n\n\n\nBrent crude futures dropped 26 cents, or 0.4%, to $69.02 a barrel by 11:08 a.m. EDT (1508 GMT), while US West Texas Intermediate crude slipped by 24 cents, or 0.4%, to $67.10. The European Union on Friday approved the 18th package of sanctions against Russia over the war in Ukraine, which also targeted India’s Nayara Energy, an exporter of oil products refined from Russian crude.  \n\n\n\n“The market right now thinks that supply will still make it to market in one way, shape or another, there is not too much concern,” said John Kilduff, a partner at Again Capital in New York.  \n\n\n\nKremlin spokesperson Dmitry Peskov said on Friday that Russia had built up a certain immunity to Western sanctions. The EU sanctions followed US President Donald Trump’s threats last week to impose sanctions on buyers of Russian exports unless Russia agrees to a","url":"https://www.brecorder.com/news/40373822/oil-prices-decline","image":"https://i.brecorder.com/large/2025/07/687ebeb49b45b.gif","video":null,"publish_date":"2025-07-22 00:56:50","author":"Reuters","authors":["Reuters"],"language":"en","category":"business","source_country":"pk","sentiment":-0.154},{"id":343919442,"title":"Thomas Fugate, 22-year-old Trump DHS appointee, addresses backlash over age, inexperience","text":"FIRST ON FOX: Thomas Fugate, a 22-year-old Trump appointee, spoke with Fox News Digital after being cast into the spotlight and criticized over his young age, inexperience and role in President Donald Trump’s administration. Fugate's official title at the Department of Homeland Security (DHS) is Special Assistant. However, several outlets reported that Fugate was the head of DHS’s Center for Prevention Programs and Partnerships (CP3). CP3 is DHS' lead office for terrorism and targeted violence prevention. The young appointee and DHS denied those claims to Fox News Digital. \"All decisions came down from policy leadership, [the] undersecretary, deputy secretary, and chief of staff,\" Fugate emphasized. SECOND SUSPECT ARRESTED IN CBP OFFICER SHOOTING HAS LENGTHY CRIMINAL PAST, DHS SAYS Fugate went on to say that CP3, a program which was gutted by an $18.5 million cut last week, has a heavily reduced role compared to previous administrations as Trump’s DHS has downsized the division. \"Before I got there, [CP3] was already flagged for waste, fraud, and abuse,\" Fugate explained. \"We’re not talking about a massive office of 80 people with a wide range of functions. We’re talking about a very niche and small, specialized office.\" Fugate said the office is mainly focused on administering a grant program. \"It’s only when you take it out of context and blow it out of proportion that it then becomes a massive problem where people think I’m practically running the FBI,\" Fugate continued. DHS also told Fox News Digital that Fugate was never in a position of leadership within the program, and even referred to him as a \"low-level\" staffer. NOEM BLAMES 'SANCTUARY' POLICIES FOR MIGRANT ACCUSED OF SHOOTING OFF-DUTY CBP OFFICER \"This entire smear campaign around Thomas Fugate is a smokescreen to bury the rampant grift and waste festering in the CP3 program under the Biden Administration’s watch,\" DHS Assistant Secretary Tricia McLaughlin told Fox. \"Fugate never held the director role at CP3, and to imply that he had operational control or exercised leadership over CP3 is simply untrue, as we have consistently told them.\" \"The fact a low-level 22-year-old staffer was able to identify the misappropriated spending and the subsequent violent reaction to defend this woke, partisan spending by those on the left tells you exactly what this program was really being used for,\" McLaughlin said. As for his young age and experience, Fugate noted that he started out with DHS at Border and Immigration when the Undersecretary of Policy asked him to temporarily assist at CP3. CLICK HERE TO GET THE FOX NEWS APP Prior to that, he interned at the Heritage Foundation before graduating from the University of Texas at San Antonio with a degree in Politics and Law last May.","summary":"Thomas Fugate, a 22-year-old DHS staffer, said claims he is leading a terrorism prevention division are untrue and that he is focused on eliminating waste, fraud and abuse.","url":"https://www.foxnews.com/politics/thomas-fugate-22-year-old-trump-dhs-appointee-addresses-backlash-over-age-inexperience","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/thomas-fugate-dhs-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-22 00:54:23","author":"Preston Mizell","authors":["Preston Mizell"],"language":"en","source_country":"US","sentiment":-0.151},{"id":343916528,"title":"Court Denies Request to Clear Record of Man Cleared of Jan. 6 Charges","text":"A man from New Mexico, who was acquitted of criminal charges related to the January 6th incident at the U.S. Capitol, is not allowed to have the records of his arrest and trial expunged, as ruled by a federal judge in Washington, D.C.\n\nU.S. District Judge Trevor McFadden, on Friday, dismissed the request to remove Matthew Martin’s records, who had previously described the Capitol riot as a “magical day.”\n\nMcFadden found Martin not guilty of multiple misdemeanors following a bench trial three years ago.\n\nIn a nine-page opinion, McFadden, appointed by President Donald Trump during his first term, explained that even though Martin was “fully acquitted” of the January 6 charges, federal appellate courts have established that an individual needs to demonstrate evidence of rights violations before a district court can consider expungement. In this case, Martin did not even “allege a violation of a statutory or constitutional right,” according to the judge.\n\nInstead, Martin asserted that his record was clean before and after the trial, he was acquitted after an adjudication on the merits, his case is associated with the “most highly publicized criminal prosecution in the country”s history,” and his FBI background check information is now “inaccurate and prejudicial without serving any proper purpose.”\n\nHe argued that previous cases had established a “right not to be adversely affected by government records when their information is “inaccurate,” “acquired by fatally flawed procedures,” or “prejudicial without serving any proper purpose.”\n\nBut none of those reasons met the legal threshold for his record to be expunged, McFadden found.\n\n“In sum, Martin has not attempted to show a statutory or constitutional violation during his arrest, trial, or conviction,” McFadden wrote. “So this Court has no violation on which to rest the equitable remedy of expungement. His motion is denied.”\n\nThe court also noted that while Martin claimed he was fired from his job immediately after being charged “because of his association with Jan. 6th events,” he previously indicated that he was “not requesting expungement for employment reasons.”\n\nAs Law&Crime previously reported, McFadden in April 2022 found Martin not guilty on charges that included entering a restricted building and disorderly conduct in a Capitol building. The judge said federal prosecutors failed to prove the “requisite scienter” for the crimes “in large part because a Capitol police officer arguably appeared to allow Martin into the building.”\n\nFollowing the two-day trial, McFadden reportedly said that despite multiple clues that the Capitol grounds and building were restricted, Martin’s belief that he had permission enter the building was “plausible” because police officers didn’t try to stop him.\n\nIn a trial brief, prosecutors said that Martin went to the Capitol from his hotel room at some point after the first breach of the building had occurred. On his way there, he passed a line of police cars, signs announcing that areas of the Capitol grounds were closed, and smashed windowpanes at the Rotunda doors. Alarms that prosecutors described as “piercingly loud” could be heard on video recordings Martin made on his phone.\n\nNevertheless, Martin walked into the Rotunda, passing police officers who were standing on either side of the doorway. According to prosecutors, Martin was inside the building for around 10 minutes. He recorded footage on his cellphone, and although he didn’t engage in any violence, he did join a crowd that was “facing down officers” before he left, prosecutors said.\n\nThat evening, Martin texted with his supervisor.\n\n“You can’t overrun the capital [sic] building,” the supervisor said, according to court filings.\n\n“Actually you can, rather easily I might add,” Martin responded. “Not as much security as you think. Our numbers were freaking huge. They were not prepared.”\n\nIn announcing his verdict, McFadden reportedly described Martin’s conduct at the Capitol as “minimal and non-serious,” noting that he didn’t try to crowd police, protest, or wave his Trump flag inside the building. The judge appears to have weighed the fact that Martin didn’t interfere with officers fighting back rioters as a factor in the defendant’s favor, and not as yet another indication to Martin that he shouldn’t have been there.\n\nMartin was reportedly unapologetic at trial, describing Jan. 6 as “magical” and stating that he did not regret traveling to Washington, D.C., for the pro-Trump rally.\n\nMartin was the first accused Capitol rioter to be fully acquitted of charges in connection to Jan. 6.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMatthew Martin at the U.S. Capitol on Jan. 6, 2021 (DOJ). A&#8230;\n\n\nThis Post: Court Denies Request to Clear Record of Man Cleared of Jan. 6 Charges first appeared on Internewscast Journal","url":"https://internewscast.com/crime/court-denies-request-to-clear-record-of-man-cleared-of-jan-6-charges/","image":"https://internewscast.com/wp-content/uploads/2025/07/Judge-refuses-to-expunge-record-of-man-exonerated-for-Jan.jpg","video":null,"publish_date":"2025-07-22 00:53:10","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.527},{"id":343918106,"title":"Tulsi Gabbard’s Files Release Raises Question About Claim From Obama Deputy National Security Advisor","text":"Former Deputy National Security Advisor to President Barack Obama Ben Rhodes’ claim of ignorance about the Federal Bureau of Investigation’s (FBI) “Russiagate” probe seemingly contradicted by newly released documents.\n\nRhodes said in a 2019 interview that neither he nor the White House were involved in the FBI’s investigation into President Donald Trump’s 2016 campaign. However, he was present during a Dec. 9, 2016, meeting of Obama’s National Security Council’s (NSC) Principals Committee where alleged Russian election interference was discussed, according to documents released by Director of National Intelligence (DNI) Tulsi Gabbard on Friday.\n\n“Obama directed the IC to create a new intelligence assessment that detailed Russian election meddling, even though it would contradict multiple intelligence assessments released over the previous several months,” Gabbard wrote on X.\n\n The next day, top national security officials including FBI Dir James Comey, CIA Dir John Brennan and DNI James Clapper gathered at the Obama White House to discuss Russia. Obama directed the IC to create a new intelligence assessment that detailed Russian election meddling, even… pic.twitter.com/b7ly73h12t — DNI Tulsi Gabbard (@DNIGabbard) July 18, 2025\n\nThat directive followed preparation for the President’s Daily Brief on Dec. 8, 2016 based on an assessment “finding that Russia ‘did not impact recent U.S. election results’ by conducting cyber attacks on infrastructure,” according to Gabbard. The DNI said this brief was pulled “based on new guidance” and remained unpublished.\n\nThe day of the meeting, The Washington Post published an article sourcing “White House officials” titled “Secret CIA assessment says Russia was trying to help Trump win White House.”\n\nThe article, Gabbard’s tweet thread claimed, was the product of leaks from “anonymous IC sources.”\n\nGabbard’s claim that Obama directed his NSC to create an assessment that detailed Russian meddling seemingly contradicts what Rhodes said in 2019.\n\n“We didn’t even know that there was an FBI investigation of Trump. I didn’t. President Obama didn’t,” he told journalist Nicholas Ballasy in 2019. “We actually abided by the firewalls. If there were any investigations that took place, those decisions were made in the Justice Department, in the FBI, not in the White House.”\n\nThe FBI began investigating Trump’s campaign in July 2016 as part of their Crossfire Hurricane investigation. (RELATED: Clinton Email Investigation Omitted Crucial Piece Of Evidence)\n\n“They will find nothing that suggests that there was any political or White House involvement in any of that. Literally, I learned about the FBI investigation into Trump as a private citizen in the freaking Washington Post,” Rhodes also told Ballasy.\n\nObama’s directive was followed by the infamous 2017 Intelligence Community Assessment (ICA), according to another post from Gabbard. The ICA concluded that Russian President Vladimir Putin sought “to undermine public faith in the US democratic process, denigrate Secretary Clinton, and harm her electability” with a “clear preference for President-elect Trump.”\n\nThe 2017 ICA’s conclusions run in stark contrast to an August 2016 report that, according to a tweet from Gabbard, was from a Department of Homeland Security (DHS) official to then-DNI James Clapper.\n\n For months preceding the 2016 election, the Intelligence Community shared a consensus view: Russia lacked the intent and capability to hack U.S. elections. But weeks after President Trump’s historic 2016 victory defeating Hillary Clinton, everything changed. pic.twitter.com/ss6A20yZ7k — DNI Tulsi Gabbard (@DNIGabbard) July 18, 2025\n\n“The thrust of the analysis is that there is no indication of a Russian threat to directly manipulate the actual vote count through cyber means,” the report read.\n\n“We assess that foreign adversaries did not use cyber attacks on election infrastructure to alter the US Presidential election outcome this year. We have no evidence of cyber manipulation of election infrastructure intended to alter results,” a Dec. 7, 2016 DNI document Gabbard’s tweet labeled “DNI Clapper talking points” also read.\n\nA recent Central Intelligence Agency (CIA) analysis of the 2017 ICA found that the document was predicated on shoddy tradecraft and the inclusion of details from the now-discredited Steele Dossier “ultimately undermined the credibility of a key judgment.”\n\nThe Daily Caller reached out to Ben Rhodes for clarification but did not hear back by time of publication.","summary":"'Those decisions were made in the Justice Department, in the FBI, not in the White House'","url":"https://dailycaller.com/2025/07/21/obama-ben-rhodes-russiagate-tulsi-gabbard-james-clapper-trump/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/GettyImages-453964628-scaled-e1753130745910.jpg","video":null,"publish_date":"2025-07-22 00:49:37","author":"Robert McGreevy","authors":["Robert McGreevy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.465},{"id":343921150,"title":"Kirk LaPointe: Trump’s tariff tactics rely more on psychology than economics (Opinion)","text":"Much has been written, spoken and thought about U.S. President Donald Trump’s approach to trade with our country—specifically, what the hell to make of it. Prime Minister Mark Carney may look cool and collected, but more and more I wouldn’t want to be drywall near his fist.\n\nGuesswork galore about trade discussions is the best any of us can do as the Aug. 1 deadline nears—if indeed any deal itself will be reached by that deadline.\n\nBut Trump’s tactics are hardly novel. They are slices of well-trodden psychological warfare that just so happen to be how he’s pursuing economic policy. Far from chaotic improvisation, the elements are rooted in classical negotiation theory, behavioural economics, social identity theory, and the psychology of authoritarian leadership.\n\nMore than any U.S. president he has applied the language of business to the language of statecraft. In his hands, tariffs aren’t actually instruments to balance economies as much as they are ripped from the psychology playbook aimed at dominance, disruption and loyalty.\n\nPeering into his mind might be beyond the pale, but he is using three psychological frameworks: a personal negotiating style, a populist political script, and behavioural biases he exploits or embodies. Carney, one would hope, has appreciated and adjusted to these as he defines the country’s economic destiny; if not, we’re in more trouble than we think.\n\nFor instance, it is well known that Trump’s worldview is deeply transactional. Every relationship—whether with an individual, company or nation—is a deal to be won or lost. Tariffs, in this framework, are not complex means of global economic calibration but blunt-force bargaining chips. He calls them “a beautiful thing,” probably because they are simple, unilateral and easily understood by supporters. They convey strength and decisiveness.\n\nHe possesses what is known academically as a zero-sum worldview—for one party to win, another must lose, so there is never a win-win. Social research has shown that inexperienced or competitive negotiators default to this model, leading to suboptimal outcomes. Trump’s obsession with bilateral trade deficits—even if economists overwhelmingly view them as incomplete measures of national economic health—fit perfectly within this. A trade deficit is a sign the U.S. was being “ripped off,” so tariffs are the retaliation, along with a pretension that we in Canada—and not American importers and consumers—ultimately pay for them.\n\nThis deal psychology also reflects how Trump sees himself as a self-made, self-branded businessman. To walk away from a deal or punish a trading partner isn’t a technical adjustment—it is an assertion of personal dominance. In this view, America isn’t merely a country; it is a brand under his stewardship.\n\nTariffs serve as a powerful tool of political psychology in offering Trump a tangible, easily communicable way to demonstrate he is fighting for the American worker and to maintain support in swing states like Michigan, Ohio and Pennsylvania among disaffected, working-class voters.\n\nThey function as symbolic aggression. Even when they wreak economic disruption or spur retaliatory measures from trading partners, they communicate toughness to his base. Trump repeatedly casts global trade as an arena of exploitation, in which elite technocrats and multilateral institutions sell out U.S. interests. In this narrative, he alone had the courage to stand up to foreign cheaters, particularly China—and countries like us that he considers unfair allies taking advantage of his country and people.\n\nForget any nuanced discussion of supply chains or long-term inflationary effects. Instead, tariffs offer a binary moral logic: good because they punished bad actors and helped “our” side. The psychological resonance of this narrative reinforces in-group versus out-group dynamics, status resentment, collective esteem, and the desire for retribution. Look it up: this social identity theory was first defined by Henri Tajfel and John Turner (not the former prime minister) in the 1970s, and by what sociologists Theodor Adorno, Bob Altemeyer, and others have termed the authoritarian personality.\n\nTrump's use of tariffs also mirrors the psychology of a high-stakes gambler. His approach echoed game theory’s “madman strategy,” in which an actor (former U.S. president Richard Nixon was notoriously one) behaves unpredictably to create leverage. Trump announces sudden tariff hikes on social media or as an aside to reporters, destabilizing markets and throwing trade partners off-balance. This unpredictability made it difficult for allies and rivals alike to negotiate in good faith or to forecast American trade policy.\n\nThis element either reflected a misunderstanding of basic economics or a calculated decision to exploit cognitive biases like the “money illusion,” where people focus on nominal changes rather than real costs. The psychological appeal of tariffs is their simplicity: they give the impression of action and control, even if the underlying effects are diffuse or negative.\n\nPsychologists Daniel Kahneman and Amos Tversky pioneered key concepts in behavioural economics that explain these dynamics. Tariff threats by Trump activate what they termed loss aversion, framing global trade as a series of losses America has suffered—jobs lost, factories closed, dignity eroded. Tariffs are positioned as a way to stop the bleeding, even when economists argue they could cause further harm. Behavioural economists have shown that what they term cognitive fluency—how easily something is understood—increases its believability. Trump excels at using this to his advantage.\n\nThis behaviour overall reflects elements of what researchers term “trait narcissism and impulsivity,” hardly new among presidents. The mention of tariffs gives Trump immediate feedback—stock market reactions, media coverage, applause at rallies—which feed a cycle of risk-taking and media gratification. This is less about long-term planning than about asserting will in the moment, often over the objections of advisers and experts.\n\nThe unpredictability can serve a strategic function. By keeping opponents guessing and freaking, Trump hopes to extract better terms.\n\nIn the end, Donald Trump’s approach is less about trade than about narrative, identity and domination. They are expressions of strength, loyalty tests for allies and tools for signalling resolve. Economists may doubt their efficacy, but their psychological utility—as mechanisms for rallying support, asserting identity and disrupting norms—is undeniable. Immediate optics of dominance outweigh long-term strategic coherence.\n\nAnd it is nothing new, sad to say.\n\nKirk LaPointe is a Lodestar Media columnist with an extensive background in journalism. He is vice president in the office of the chair at Fulmer & Company.","summary":"Much has been written, spoken and thought about U.S. President Donald Trump's approach to trade with our country-specifically, what the hell to make of it. Prime Minister Mark Carney may look cool and collected, but more and more I wouldn't want to be drywall near his fist. Guesswork galore about tr...","url":"https://www.castanet.net/news/Opinion/562150/Kirk-LaPointe-Trump-s-tariff-tactics-rely-more-on-psychology-than-economics","image":"https://www.castanet.net/content/2025/7/donald_trump_credit_gage-skidmore_wikimedia-commons.jpgw960._p4220231.jpg","video":null,"publish_date":"2025-07-22 00:49:00","author":"Contributed,Kirk Lapointe","authors":["Contributed","Kirk Lapointe"],"language":"en","source_country":"ca","sentiment":0.118},{"id":343917936,"title":"Pentagon withdraws 700 Marines from Los Angeles","text":"The Pentagon ordered the U.S. Marines to leave Los Angeles on Monday, more than a month after President Donald Trump deployed them to the city against the objections of local leaders.The 700 Marines were deployed June 9 on the fourth day of protests in downtown LA over the administration’s crackdown on immigration. Four thousand National Guard soldiers were also deployed.Their presence in the city had been limited to two locations with federal buildings in Los Angeles, including the U.S. Immigration and Customs Enforcement office and detention facility downtown. During their deployment outside a federal complex in west LA, the Marines temporarily detained a man who said he was rushing to get to a Veterans Affairs appointment.The decision to pull back the Marines comes after half of the National Guard troops were ordered to leave the city last week. The rest remain.Pentagon spokesman Sean Parnell said the military presence “sent a clear message: lawlessness will not be tolerated.”Mayor Karen Bass held a press conference Monday morning ahead of the announcement with several leaders of veteran groups who raised concerns about the deployment of military troops on domestic soil. They called for the remainder of troops to be withdrawn from Los Angeles.“This is another win for Los Angeles but this is also a win for those serving this country in uniform,” Bass said in a statement. “Los Angeles stands with our troops, which is why we are glad they are leaving.”RELATED STORY | Pentagon ends deployment of 2,000 National Guard troops in Los AngelesCalifornia Gov. Gavin Newsom sued the federal government in June over the deployment of the National Guard, arguing that Trump violated the law when he activated the troops without notifying him. Newsom also asked the judge for an emergency stop to troops helping carry out immigration raids.While a lower court ordered Trump to return control of the Guard to California, the 9th U.S. Circuit Court of Appeals last month temporarily blocked the judge's order.Newsom originally included the Marines in the lawsuit, but the case has primarily focused on the Guard since.In response to the Pentagon's announcement pulling back the Marines, Newsom reiterated his call for the remaining Guard troops to be sent home as well.“The women and men of the California National Guard deserve more than to continue serving as puppets in Trump and Stephen Miller’s performative political theater,\" Newsom said in a statement. “There was never a need for the military to deploy against civilians in Los Angeles.\"Local authorities have disputed the Trump administration’s characterization of the city as a “war zone.”The protests in Los Angeles have been largely limited to a few blocks downtown containing City Hall, federal buildings and an immigration detention facility. Demonstrations in the city and the region in recent weeks have been largely small impromptu protests around arrests.In one of the most raucous days of protest, thousands of people took to the streets June 8 in response to Trump’s deployment of the Guard, blocking off a major freeway as law enforcement used tear gas, rubber bullets and flash bangs to control the crowd. Photos captured several Waymo robotaxis set on fire.A day later, police officers used flash bangs and shot projectiles as they pushed protesters through Little Tokyo, where bystanders and restaurant workers rushed to get out of their way.Bass set a curfew in place for about a week that she said had successfully protected businesses and helped restore order.","summary":"The Pentagon ordered the U.S. Marines to leave Los Angeles on Monday, more than a month after President Donald Trump deployed them to the city.","url":"https://www.scrippsnews.com/politics/the-president/pentagon-withdraws-700-marines-from-los-angeles","image":"https://ewscripps.brightspotcdn.com/dims4/default/9fa1b40/2147483647/strip/true/crop/3936x2066+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fcd%2F1e%2F6999bb4b46c9889bf3c06703d141%2Fap25164751519766.jpg","video":null,"publish_date":"2025-07-22 00:48:28","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","source_country":"us","sentiment":-0.12},{"id":343918984,"title":"World News | Kremlin Signals Openness to Putin-Trump Talks in Beijing","text":"Moscow [Russia], July 22 (ANI): Russia is open to discussing the possibility of holding talks between President Vladimir Putin and US President Donald Trump, should the latter attend the upcoming commemorative events in Beijing this September, Kremlin spokesman Dmitry Peskov said on Monday, according to RT.\nThe Chinese capital is set to host a military parade on September 3 to commemorate the 80th anniversary of the end of World War II. Putin has already accepted an invitation to attend the event, as per RT.\nAlso Read | US: Alaska Airlines Restores Operations After Equipment Failure at Data Centre Grounds All Planes.\nAmid speculation about a potential high-level meeting involving Putin, Trump, and Chinese President Xi Jinping, RT cited a report from Japan's Kyodo News suggesting that China has extended an invitation to Trump. The Times also reported that Beijing may be positioning itself to host a trilateral summit, though Chinese officials have not confirmed any such plans.\n\"If it so happens that [Trump] is there, then, of course, we cannot rule out that the question of the expediency of holding a meeting will be raised,\" Peskov told reporters, as quoted by RT. He added that the Kremlin has not yet received confirmation regarding Trump's attendance in Beijing.\nAlso Read | US: Appeals Court Orders New Trial for Man Convicted in 1979 Etan Patz Case.\nOn Sunday, Peskov noted that while a future meeting between Putin and Trump is expected, \"it would require a lot of preparation, and the time has not yet come,\" RT reported.\nThe renewed speculation comes after a phone call between Trump and Xi Jinping in June. During the call, Trump reportedly said he had received an invitation to visit China, though no specific date was provided, RT said.\nPutin and Trump have also held several phone conversations in recent months, primarily focused on the Ukraine conflict. Trump recently criticized the Russian president for resisting a settlement, a remark that drew a calm response from the Kremlin. \"It viewed the criticism calmly and intended to maintain dialogue with Washington,\" RT reported.\nChina, meanwhile, continues to project itself as a neutral party in the Ukraine conflict. According to RT, Chinese Foreign Minister Wang Yi has called for a \"fair, lasting, and binding\" peace agreement and urged all parties to prioritize a ceasefire and political dialogue. Beijing has also voiced support for renewed direct talks between Moscow and Kiev.\nThe last in-person meeting between Putin and Trump took place in 2018 during the Russia-US summit held in Helsinki, Finland. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Russia is open to talks between Putin and Trump if Trump attends a World War II event in Beijing in September, Kremlin spokesperson Dmitry Peskov said. The Kremlin awaits confirmation of Trump's visit. China is also positioning itself as a neutral mediator in the Ukraine conflict, according to RT.","url":"https://www.latestly.com/agency-news/world-news-kremlin-signals-openness-to-putin-trump-talks-in-beijing-7012294.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721221645.jpg","video":null,"publish_date":"2025-07-22 00:48:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.016},{"id":343917248,"title":"Day 1 of Texas special session starts with Democrats signaling they could flee over redistricting","text":"AUSTIN, Texas (KTRK) -- There are nearly 20 items on a special session agenda, but day one focused on one issue that Texas Democrats said could force them to flee the state.\n\nTEXAS LAWMAKERS RETURN TO AUSTIN FOR A SPECIAL SESSION\n\nJust weeks after ending the regular session, Texas lawmakers are back in Austin. Texas Governor Greg Abbott made lawmakers return.\n\nRice University political science professor Mark Jones said a special session was a given after Abbott took action last month. \"The moment the governor vetoed the THC bill, there was going to be a special session,\" Jones explained.\n\nTHC is on the agenda, but it's not the only one. There are 18 items.\n\nLawmakers have 30 days to tackle them.\n\nONE ISSUE DOMINATED THE DISCUSSION ON DAY ONE\n\nBefore lawmakers even started the special session, House Democrats held a news conference. The focus of it was to discuss redistricting.\n\n\"I'm disappointed that this is already becoming this partisan special session,\" State Rep. Christina Morales (D-Houston) said.\n\nState leaders said they received a letter from the Department of Justice to review Congressional maps. ABC13 confirmed President Donald Trump told state GOP leaders he wants to see five seats flipped in the 2026 election.\n\nIn the Senate, much of the discussion was over redistricting. Democrats asked Republican leaders questions about why they're doing it.\n\nSenator Borris Miles (D-Houston) told ABC13 he wasn't happy to see the item on the governor's call.\n\n\"I understand we need to get together to work on some flood issues,\" Miles explained. \"I can accept that one. I can even kind of tolerate THC, but this redistricting issue, it's just disgusting to be here.\"\n\nSenate Republicans said they plan to start redistricting hearings on Friday. The House schedule shows there will be redistricting committee meetings on Thursday, Saturday, and Monday.\n\nDEMOCRATS THREATEN TO FLEE, WHILE SOME REPUBLICANS AREN'T BUYING IT\n\nTo combat redistricting legislation, Democrats said all options are on the table, including doing something they did four years ago. In 2021, Democrats fled to Washington D.C. during a special session over election integrity legislation.\n\nIt is a move Democrats in both the House and Senate said they're considering again. This time over redistricting.\n\n\"We need to break quorum so that Governor Abbott does not pass this Trump racially discriminatory map,\" State Rep. Ron Reynolds (D-Missouri City) said.\n\nIf it comes down to it to save our voices and save our communities that I represent, everything's an option,\" Miles said.\n\nRepublicans aren't so sure it'll happen. After lawmakers fled four years ago, they created financial penalties for future quorum breaks.\n\n\"I think it's a complete bluff,\" State Rep. Briscoe Cain (R-Baytown) said. \"They don't want to have to pay the fees if they do break quorum.\"\n\nNO WORD ON WHAT WILL HAPPEN WITH THC\n\nThe issue that political experts said sent lawmakers back to Austin wasn't discussed much on day one. There isn't even a committee hearing scheduled on it yet.\n\nHowever, there are a lot of eyes waiting to see what happens to THC.\n\n\"That's a big boy fight,\" Miles said. \"I'll be sitting back and watching it and eating popcorn and watching how it comes out.\"\n\nAbbott vetoed a THC ban sent to him during the regular session. He wants lawmakers to send him legislation to regulate it.\n\nThe Texas Hemp Business Council said a hemp ban would impact $5.5 billion dollars across the state and could put more than 53,000 Texans out of work.\n\nLieutenant Governor Dan Patrick pushed for the ban. Jones believes he'll send the governor legislation that puts strict rules on the industry.\n\n\"He is determined that if he can't slam that door shut, like he did during the regular session, he's going to make it as close to closed as he can,\" Jones explained.\n\nSo far, there's no hearing set on THC legislation. Lawmakers have until mid-August, when the special session ends.\n\nFor updates on this story, follow Nick Natario on Facebook, X and Instagram.","summary":"There are nearly 20 items on a special session agenda, but day one focused on one issue that Texas Democrats said could force them to flee the state.","url":"https://abc13.com/post/day-1-texas-special-session-starts-democrats-signaling-could-flee-redistricting/17232225/","image":"https://cdn.abcotvs.com/dip/images/17233047_072125-ktrk-texas-special-session-img.png?w=1600","video":"https://vcl.abcotv.net/video/ktrk/072125-ktrk-ewn-texas-special-session-NNA-6pm-justin-vid.mp4","publish_date":"2025-07-22 00:48:06","author":"Nick Natario","authors":["Nick Natario"],"language":"en","category":"politics","source_country":"US","sentiment":-0.326},{"id":343918970,"title":"World News | Trump Administration Releases FBI Files on Martin Luther King Jr. Despite Family Objections","text":"Washington [US], July 22 (ANI): The Trump administration has released more than 240,000 pages of FBI surveillance records on civil rights icon Martin Luther King Jr., despite strong opposition from his family and the Southern Christian Leadership Conference (SCLC), CNN reported.\nThe records had been under a court-imposed seal since 1977, when the FBI first gathered the documents and handed them to the National Archives and Records Administration. King's family, including his two living children, Martin Luther King III and Bernice King, were informed in advance and had teams reviewing the documents ahead of the public release, CNN stated.\nAlso Read | US: Alaska Airlines Restores Operations After Equipment Failure at Data Centre Grounds All Planes.\nIn a statement released on Monday, the siblings described the case as one that has sparked \"captivating public curiosity for decades.\" However, they urged the public to approach the files with sensitivity and care. \"As the children of Dr. King and Mrs. Coretta Scott King, his tragic death has been an intensely personal grief-a devastating loss for his wife, children, and the granddaughter he never met-an absence our family has endured for over 57 years,\" they said. \"We ask those who engage with the release of these files to do so with empathy, restraint, and respect for our family's continuing grief.\"\nCNN noted that Bernice King was five and Martin III was ten years old when their father was assassinated in 1968. President Donald Trump, who had previously pledged to release documents related to historical assassinations, signed an executive order earlier this year to declassify the JFK, RFK, and MLK records. The government released the JFK records in March and some RFK files in April.\nAlso Read | US: Appeals Court Orders New Trial for Man Convicted in 1979 Etan Patz Case.\nThe release of the King records also comes amid public criticism of the administration's handling of records tied to the Jeffrey Epstein case. Trump recently directed the Justice Department to release grand jury testimony related to Epstein but did not unseal the entire file, CNN reported.\nThe FBI documents were initially meant to remain sealed until 2027. However, the Department of Justice requested a federal judge to lift the sealing order ahead of schedule. According to CNN, historians and journalists have been preparing to comb through the documents in search of new details surrounding King's assassination on April 4, 1968, in Memphis.\nThe SCLC, which King co-founded in 1957, opposed the release, echoing the King family's concerns that the files emerged from an illegal surveillance effort. The group and the family allege that the FBI monitored King and other civil rights leaders with the intent to \"discredit\" them and their movement.\nIn their statement, King's children declared, \"He was relentlessly targeted by an invasive, predatory, and deeply disturbing disinformation and surveillance campaign orchestrated by J. Edgar Hoover through the Federal Bureau of Investigation (FBI).\" They further added, \"The intent of the government's COINTELPRO campaign was not only to monitor, but to discredit, dismantle and destroy Dr. King's reputation and the broader American Civil Rights Movement. These actions were not only invasions of privacy, but intentional assaults on the truth -- undermining the dignity and freedoms of private citizens who fought for justice, designed to neutralize those who dared to challenge the status quo.\"\nCNN reported that opposition to King from law enforcement and intelligence agencies only increased after the passage of the Civil Rights Act of 1964 and the Voting Rights Act of 1965. As King focused more on economic justice and international peace, including opposition to the Vietnam War, he was increasingly seen as a threat by figures like Hoover.\nKing was assassinated in Memphis while supporting a strike by sanitation workers, a campaign consistent with his focus on economic rights. James Earl Ray pleaded guilty to the assassination but later recanted, claiming innocence until his death in 1998. Coretta Scott King pushed for a new probe into the murder, leading then-Attorney General Janet Reno in 1998 to order the Civil Rights Division of the Justice Department to revisit the case. However, the department found \"nothing to disturb the 1969 judicial determination that James Earl Ray murdered Dr. King.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Trump administration has released over 240,000 sealed FBI files on Martin Luther King Jr., despite opposition from his family and civil rights groups. King's children urged respectful engagement, citing past government efforts to discredit their father through illegal surveillance and disinformation. The records were unsealed ahead of schedule.","url":"https://www.latestly.com/agency-news/world-news-trump-administration-releases-fbi-files-on-martin-luther-king-jr-despite-family-objections-7012292.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721220313.jpg","video":null,"publish_date":"2025-07-22 00:46:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.12},{"id":343916330,"title":"Dartmouth president accused of cowardice for staying neutral as Trump targets elite schools","text":"The president of Dartmouth is winning praise from conservatives, while her critics in academia accuse her of cowardice and conformity for her stance on viewpoint diversity. A piece from the New Yorker details the embattled president, Sian Beilock, vowing to uphold institutional neutrality amid the federal government’s feud with higher education and rampant antisemitism on college campuses. Dartmouth declined to join a coalition of over 600 universities, including its Ivy League counterparts, in signing a letter in defense of Harvard University as it fights the Trump administration's attempts to freeze billions in funding. In an email to the Dartmouth community explaining her decision not to join the coalition, Beilock reportedly wrote that \"receivership, censorship, and external pressures about what can and cannot be taught or studied hamper the free exchange of ideas on our campus and across institutions. Dartmouth will never relent on these values.\" HARVARD PRESIDENT URGES THE SCHOOL TO ADDRESS LACK OF CONSERVATIVES ON CAMPUS Yale professor Jeffrey Sonnenfeld slammed Beilock’s decision to decline to sign the letter. \"This is a mix of cowardice, hypocrisy, and naïveté,\" Sonnenfeld said. \"This is Trump’s classic playbook: divide and conquer.\" \"Everyone is entitled to their opinion,\" Beilock told the New Yorker when asked her about the criticism she has received for her decisions. \"People ask, ‘Why aren’t you suing Trump like Harvard?’ Well, [the Administration hasn’t] made those kinds of demands.\" President Donald Trump has suspended federal funding to every Ivy League school, except for Penn and Dartmouth, over investigations into anti-Israel protests that have taken place on their campuses since October 2023. Beilock maintains that the university’s position is \"saving the idea of the university,\" the New Yorker noted, citing a piece she wrote in the outlet last year explaining her approach. Beilock was the first female president appointed to Dartmouth in 2022. She formerly served as president of Barnard College. The New Yorker noted that the Dartmouth president’s primary objective was to take \"aim at the perceived censoriousness of campus discourse.\" Beilock created \"brave spaces,\" a subversive play on the common phrase \"safe spaces.\" Building upon that sentiment, Beilock launched \"Dartmouth Dialogues\" to facilitate free speech and debate. Beilock introduced a policy of \"institutional restraint,\" mandating that Dartmouth officials, employees and staff refrain from issuing \"institutional statements\" in order to \"provide space for diverse viewpoints to be raised and fully considered …\" The New Yorker reported further that \"Beilock clashed with Wesleyan’s president, Michael Roth, over her adherence to what he called 'a new form of conformism.' Roth went on, 'As a heterodox person, and as a Jew, I’m very suspicious when my compatriots find a new religion, be it viewpoint diversity or be it institutional neutrality.'\" GEORGETOWN REFUSES TO CUT TIES WITH ISRAEL, STANDS UP TO PRESSURE FROM STUDENTS Beilock’s handling of campus protests in the wake of the Gaza conflict was condemned by students and faculty members. After police clashed with Dartmouth affiliates in a protest in May 2024 where an encampment was constructed, Beilock defended the actions of the police, adding that the encampments were a violation of the school’s policy and that their presence was necessary to prevent further violence. Following the events, a motion to censure Beilock was introduced by religion professor Christopher MacEvitt and history professor Annelise Orleck who were both arrested during the protest. Beilock was censured in a 183-163 vote. As of publication, more than 2,700 people signed an alumni petition to urge Dartmouth College to fight federal government attacks on higher education. The petition claims that \"our institutions of higher learning face an unparalleled and thoroughgoing assault from the federal government,\" without directly mentioning the Trump administration. On the other hand, Beilock's convictions have been praised by conservatives. \"Her ideas have earned praise from free-speech advocates, conservative publications, and members of the Trump Administration, along with furious condemnation from academic leaders convinced that universities must stand united against Trump,\" the New Yorker reported. Harmeet Dhillon, assistant Attorney General for Civil Rights at the US Department of Justice, whic is currently investigating most Ivy League institutions for antisemitism, was noted by the New Yorker as praising Beilock's efforts: \"I was so impressed to learn how Dartmouth (my alma mater) is getting it right, after all these years. Kudos to Dartmouth! I heard Jewish student applications are way up!\" \"I like my president,\" Jeff Immelt, the former CEO of GE, reportedly wrote on LinkedIn. CLICK HERE TO GET THE FOX NEWS APP Beilock did not immediately respond to Fox News Digital's request for comment.","summary":"Dartmouth&apos;s first female president Sian Beilock implemented &apos;institutional restraint&apos; policies, distinguishing the university from other Ivy League schools including Harvard.","url":"https://www.foxnews.com/media/dartmouth-president-accused-cowardice-staying-neutral-trump-targets-elite-schools","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/931/523/college-students-istock.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-22 00:40:05","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":0.166},{"id":343916540,"title":"Ex-Louisville Police Officer Sentenced for Breonna Taylor Civil Rights Violation","text":"A federal judge has given former Louisville police officer Brett Hankison a 33-month prison sentence for breaching Breonna Taylor’s civil rights. Taylor was killed during a failed drug raid by law enforcement in 2020.\n\nHankison, aged 49, was found guilty last year of infringing on Taylor’s civil rights, which could have led to a life sentence. U.S. District Court Judge Rebecca Grady Jennings, appointed by President Donald Trump, delivered the sentence on Monday afternoon.\n\nThe previous week, the U.S. Justice Department recommended to a federal judge that Hankison receive just a one-day prison term and three years of supervised probation. The department highlighted in court documents that Hankison “did not shoot Ms. Taylor and is not otherwise responsible for her death.”\n\n“It is unfathomable that, after finally securing a conviction, the Department of Justice would seek a sentence so drastically below the federal guidelines,” a statement from national civil rights attorneys Ben Crump, Lonita Baker and Sam Aguiar, who represent the family of Taylor, said in a statement.\n\nHer death, as well as the police killing of George Floyd in Minneapolis, sparked mass racial justice protests around the country.\n\nThe Civil Rights Division during former Democratic President Joe Biden’s tenure brought criminal charges against the officers involved in both Taylor and Floyd’s death.\n\nA separate jury deadlocked on federal charges against Hankison in 2023, and he was acquitted on state charges of wanton endangerment in 2022.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA federal judge has given former Louisville police officer Brett Hankison a&#8230;\n\n\nThis Post: Ex-Louisville Police Officer Sentenced for Breonna Taylor Civil Rights Violation first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/ex-louisville-police-officer-sentenced-for-breonna-taylor-civil-rights-violation/","image":"https://internewscast.com/wp-content/uploads/2025/07/Former-Louisville-police-officer-sentenced-for-violating-Breonna-Taylors-civil.jpg","video":null,"publish_date":"2025-07-22 00:39:55","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.577},{"id":343915218,"title":"Trump thinks Canadians are ‘mean and nasty’ for boycotting U.S. travel, booze: Ambassador","text":"Are Canadians “mean and nasty” for refusing to travel to the U.S. and pulling American booze from liquor store shelves amid tariff and annexation threats?\n\nThat’s the view of U.S. President Donald Trump, his ambassador to Canada told a Washington state audience on Monday morning — comments that drew a rebuke from B.C. Premier David Eby.\n\nPete Hoesktra was speaking at the PNWER summit in Bellevue, Wash., when an audience member asked him about Canadians eschewing travel south of the border in the context of the upcoming FIFA 2026 World Cup.\n\n“That’s their business — I don’t like it, but if that’s what they want to do, that’s fine. They want to ban American alcohol; that’s fine. It doesn’t necessarily send real positive signals in terms of their treating us well,” Hokestra responded.\n\n“There are reasons why the president and some of his team refer to Canada as being mean and nasty to deal with, OK, because of some of those steps.”\n\nHoekstra then drew laughs from the crowd when he said he has no problem getting U.S. liquor into Canada, as border officers don’t check his vehicle when he crosses the border.\n\nIn a statement, Eby urged British Columbians to double down on their efforts to buy and travel within Canada in response.\n\n“Clearly, our efforts are having an impact,” Eby said. “So, I say to my fellow Canadians: Keep it up. Keep buying Canadian. Keep your vacations Canadian. We won’t take these attacks our jobs, our economy and our sovereignty, lying down. We’ll stand strong together.”\n\nA number of Canadian provinces, including British Columbia and Ontario, have pulled U.S. liquor from their shelves amid the trade dispute and Trump’s repeated musings about making Canada the 51st state, potentially through the use of “economic force.”\n\nCanadian travel to the U.S. has also plummeted, with the number of visits by land and air falling for six consecutive months.\n\nEarlier on Monday, a bipartisan delegation of U.S. senators travelled to Ottawa to plead with tourists to return to the U.S. and tell Canadians “we miss you.”\n\nCanada remains locked in intense negotiations with the United States over a new trade and security deal, and on Sunday, U.S. Commerce Secretary Howard Lutnick vowed that the tariffs on Canada were here to stay.\n\n“The president understands that we need to open the markets. Canada is not open to us. They need to open their market. Unless they’re willing to open their market, they’re going to pay a tariff,” Lutnick told CBS’s Face the Nation.\n\nTrump has threatened a new 35 per cent tariff on Canadian products that would take effect on Aug. 1, along with a new 50 per cent tariff on copper and a 200 per cent tariff on pharmaceuticals.\n\nCanada is already dealing with 25 per cent U.S. tariffs on steel and aluminum.","summary":"'There are reasons why the President and some of his team refer to Canada as being mean and nasty to deal with,' said U.S. ambassador to Canada Pete Hoesktra on Monday.","url":"https://globalnews.ca/news/11297549/us-ambassador-canada-mean-nasty/","image":"https://globalnews.ca/wp-content/uploads/2025/06/c81e2a099d6c73af8887a3c5e11771c707e06eb63ca9b930e57b5077d668b20b.jpg?quality=65&#038;strip=all","video":null,"publish_date":"2025-07-22 00:33:47","author":"Simon Little","authors":["Simon Little"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.144},{"id":343920476,"title":"Rare earths shortage hits Foxconn unit; Apple AirPods production in India faces hurdles","text":"Production of Apple AirPods has been hampered at Foxconn’s Telangana plant due to shortage of dysprosium, a direct result of China’s clampdown on the export of rare earth metals, said people aware of the matter.The Foxconn Interconnect Technology (FIT) factory is located at Kongara Kalan, about 45 km from Hyderabad. FIT, listed on the Hong Kong Stock Exchange, is a core subsidiary of Hon Hai Technology Group (Foxconn), Taiwanese multinational electronics contract manufacturer.The Apple vendor said production hasn’t been disrupted. It had begun making AirPods at the India plant in April last year, as part of Apple’s broader strategy to diversify manufacturing from China.The earbuds contain neodymium and dysprosium, among other rare earth metals. Neodymium, used as a magnet, is mined in China and elsewhere.Foxconn brought the supply issue to the notice of the Telangana government, said one of the people cited.The Telangana government, in turn, raised the matter with the Department for Promotion of Industry and Internal Trade (DPIIT), said the person. “Foxconn has sought the state government’s help to get the end user certificate (EUC) certified and attested by central ministries,” the person said.The EUC verifies the recipient and intended use of goods, especially those with a potential for misuse or diversion.“Foxconn got the end user certificate from the ministry of external affairs and the Chinese embassy, as part of the process,” said another person. “After that, Foxconn’s supplier submitted it for approval (of dysprosium exports) to the Chinese government. But it is still pending, and the (Chinese) government has not given approval yet. Once that is done, the supplier will export the rare earth metal.”Apple didn’t respond to queries. Foxconn said it “has no comment on the issue,” adding, “There is no disruption to production.”In India, Apple counts Foxconn and Tata Electronics as its major suppliers. Foxconn is Apple’s biggest contract maker globally.“There was indeed some slowdown in production at the Foxconn AirPods plant, but it seems to have improved now,” said another industry official. “The supply chain for the metal is a bit longer, but the company is managing the situation now.”“The Foxconn logistics team is expecting approval by the end of this month,” said the second person quoted earlier. “The stipulated time frame from the date of application for approval is 45-50 days. Foxconn is working with whatever rare earth metals and dysprosium are already available with them to extend the product cycle before they get the additional material.”Also Read: Why is Foxconn pulling out over 300 Chinese employees from India?China’s WallSeven categories of medium and heavy rare earths — samarium, gadolinium, terbium, dysprosium, lutetium, scandium and yttrium-related items — were placed on an export control list by China early in April in retaliation to US President Donald Trump’s tariff threats.ET reported on July 18 that the India Cellular and Electronics Association (ICEA) lobby group had informed the government that the curbs were leading to delays and inflating costs. Apple and Foxconn are among ICEA’s members.It was reported earlier this month that Foxconn had recalled over 300 Chinese engineers, reportedly at the behest of Beijing, from its Indian iPhone manufacturing plants. Experts said at that time that while Chinese engineers can possibly be replaced by Taiwanese professionals, the bigger concern was machinery and metals. Curbs on those make it harder to sustain operations, they had said.China issued its first rare earth mining and smelting quotas for the year on July 18, according to Reuters. The quotas are closely monitored as a barometer of the global supply of rare earths, a group of 17 elements used in electric vehicles, wind turbines, robots and missiles, the news agency said. China is the world's largest producer of the minerals.“The ministry of commerce said they’ve heard the same (complaints) from automotive manufacturers and have alerted the Indian embassy in Beijing to find out how to tackle this issue and sort it out,” said the first person cited earlier.Apart from electronics, dysprosium is used in laser targeting systems and military communications. It also enhances the temperature resistance of neodymium magnets. The input is also critical for maintaining equipment performance in extreme conditions.","summary":"The Apple vendor said production hasn’t been disrupted. It had begun making AirPods at the India plant in April last year, as part of Apple’s broader strategy to diversify manufacturing from China. The earbuds contain neodymium and dysprosium, among other rare earth metals. Neodymium, used as a magnet, is mined in China and elsewhere.","url":"https://economictimes.indiatimes.com/tech/technology/rare-earths-shortage-hits-foxconn-unit-apple-airpods-production-in-india-faces-hurdles/articleshow/122821120.cms","image":"https://img.etimg.com/thumb/width-1200,height-900,imgsize-105752,resizemode-75,msid-122821120/tech/technology/rare-earths-shortage-hits-foxconn-unit-apple-airpods-production-in-india-faces-hurdles.jpg","video":null,"publish_date":"2025-07-22 00:31:00","author":"Suraksha P","authors":["Suraksha P"],"language":"en","source_country":"in","sentiment":-0.447},{"id":343916326,"title":"Republican fundraising outpaces Democrats by nearly double, June numbers show","text":"As the Democratic Party continues to reel from its 2024 losses and deals with internal strife, Republican fundraising nearly doubled that of the Democrats in June, according to reporting by The Hill and a Fox News Digital review. The Hill reported that the Republican National Committee raised a grand total of $16.2 million in the month of June, far outstripping the Democratic National Committee’s $8.6 million during the same period. The RNC currently has a war chest totaling $80.78 million, while the DNC has $15.22 million on hand, according to the outlet. This comes as the Democratic Party had to deal with internal turmoil in June, including drama over former vice-chair David Hogg, a progressive activist, who decided to not seek reelection just months after being elevated to the role. Hogg had sparked considerable internal rifts with his push to primary older incumbent Democrats. ONE YEAR AFTER BIDEN'S UNPRECEDENTED EXIT FROM 2024 RACE, DEMOCRATS POLL NUMBERS AT ROCK BOTTOM At the time, DNC vice-chair Malcolm Kenyatta told Fox News Digital the process was \"frustrating\" and felt like a \"slap in the face.\" \"We haven't been able to be singularly focused,\" Kenyatta said. \"We've spent a lot of time talking about procedural nonsense within the DNC. I promise you nobody cares about that, and nobody wants to talk about it as little as I do. I want us to get refocused.\" This comes after Vice President Kamala Harris spent a whopping $1.5 billion during her 15-week campaign that ended in defeat to President Donald Trump, including burning through millions of dollars on star-studded events on the eve of the election, according to a report. Despite this seemingly dire situation, Democratic Party leadership is taking an optimistic tone, saying in a Monday statement that this June was the \"best-ever\" for grassroots donations in an off-year in the committee’s history. DEMOCRATIC PARTY CATAPULTED INTO 'NEW PHASE OF A COLD WAR' IN ONE-YEAR WAKE OF BIDEN’S UNPRECEDENTED DROPOUT The statement said the party has raised a total of over $50 million since the start of the year. DNC Chair Ken Martin commented that \"around the country, people are energized, ready to fight back, and empowering Democrats to win elections.\" \"The DNC is breaking grassroots fundraising records, bringing on more volunteers than ever, and raising record-setting funds to beat Republicans,\" said Martin. \"Democrats are back in the ring thanks to grassroots energy across all 50 states, and together, we’re going to defeat the toxic Republican agenda and put this country back on track for hard-working families.\" Meanwhile, The Hill also reported the National Republican Congressional Committee (NRCC) outraised its counterpart, the Democratic Congressional Campaign Committee, $32.3 million to $29.1 million in the second quarter of the year and $18.1 million to $12.7 million in June. The outlet noted that despite the fundraising, the DCCC reported having $39.7 million on hand, while the NRCC has $37.6 million. However, this is the first time in four years that the NRCC outraised the DCCC in the first six months of an election cycle. WATCH: NANCY PELOSI SILENT ON WHY BIDEN DID NOT RELEASE EPSTEIN FILES A Fox News Digital review of NRCC fundraising numbers found that on average, Republican congressional candidates in swing districts outraised vulnerable House Democrats in the second quarter $1.1 million to $661,000 and have more money on hand by over $848,000. CLICK HERE TO GET THE FOX NEWS APP In a statement emailed to Fox News Digital, NRCC Spokesman Mike Marinella said the committee was building a \"historic\" war chest. \"While House Republicans build a historic war chest to grow the majority, House Democrats are broke, divided, and hijacked by socialists,\" said Marinella. \"Donors are slamming the brakes because they know this party is pathetic, aimless, and has no chance of taking back the majority.\" Fox News Digital reached out to the RNC, DNC and DCCC for comment but did not immediately receive a response.","summary":"As the Democratic Party continues to reel from its 2024 losses and deals with internal strife, Republican fundraising nearly doubled that of the Democratic Party in June.","url":"https://www.foxnews.com/politics/republican-fundraising-outpaces-democrats-nearly-double-june-numbers-show","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/trump-johnson-schumer-aoc.png?ve=1&tl=1","video":null,"publish_date":"2025-07-22 00:31:00","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.423},{"id":343915396,"title":"'Total disaster': Trump slams Obama appointed judge in Harvard case hearing; vows to appeal again if loses","text":"US President Donald Trump launched an attack on a federal judge presiding over a high-stakes legal battle between his administration and Harvard University.He accused her of bias and vowed to appeal in case of an unfavourable ruling.Taking to his Truth Social platform, Trump wrote, “The Harvard case was just tried in Massachusetts before an Obama appointed Judge. She is a TOTAL DISASTER, which I say even before hearing her Ruling. She has systematically taken over the various Harvard cases, and is an automatic “loss” for the People of our Country!”He went on to claim, “Harvard has $52 Billion Dollars sitting in the Bank, and yet they are anti-Semitic, anti-Christian, and anti-America. Much of this money comes from the U.S.A., all to the detriment of other Schools, Colleges, and Institutions, and we are not going to allow this unfair situation to happen any longer.”Questioning how Judge Allison Burroughs came to oversee the matter, the US President further added, “How did this Trump-hating Judge get these cases? When she rules against us, we will IMMEDIATELY appeal, and WIN.”He also signalled a broader move to cut off federal support to the Ivy League institution, saying, “The Government will stop the practice of giving many Billions of Dollars to Harvard, much of which had been given without explanation. It is a longtime commitment to Fairness in Funding Education, and the Trump Administration will not stop until there is VICTORY.”During a two-hour hearing on Monday, Judge Burroughs seemed doubtful of the administration’s case and suggested that the IVY might prevail in the legal battle against the Trump administration. She didn’t give a ruling but questioned the government’s arguments as both sides asked for a quick decision, as per the New York Times.In the hearing that took place in a Boston court, Burroughs questioned the justice department's efforts to cut off billions in medical research funding, pressing for explanations on how such funding withdrawal decisions were linked to civil rights of Jewish people.She challenged the rationale behind the move, warning of “staggering” constitutional implications if the executive branch could penalise a university without proper process. “What I'm wrestling with is this idea that the executive branch can decide what is discriminatory or racist,” she said, “these ad hoc decisions without any procedure around it.these ad hoc decisions without any procedure around it.”The battle between the IVY and Trump administration that has lasted almost since his term in office. Harvard sued the Trump administration two months ago, alleging that the government violated its First Amendment rights by conditioning federal funding on the university’s compliance with politically driven demands. At the centre of the dispute is whether the administration bypassed established rules in a rush to defund the school.Justice department lawyer Michael Velchik defended the administration’s stance, arguing that the government has the authority to determine where taxpayer money goes.But Harvard has rejected claims that it supports discrimination. Steven Lehotsky, representing the university, told the court the administration’s actions were a “blatant, unrepentant violation of the First Amendment.”He also pointed out the government's departure from normal procedures in its attempt to punish Harvard.Judge Burroughs also indicated that the case may hinge not only on constitutional principles but also on whether due process was followed.","summary":"Donald Trump has attacked a federal judge overseeing a legal dispute between his administration and Harvard University, alleging bias and promising to appeal any unfavorable ruling. He accused the judge, an Obama appointee, of being a \"disaster\" and claimed Harvard is anti-Semitic and anti-American despite its vast wealth.","url":"https://timesofindia.indiatimes.com/world/us/total-disaster-trump-slams-obama-appointed-judge-in-harvard-case-hearing-vows-to-appeal-again-if-loses/articleshow/122824385.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-122824567/122824567.jpg","video":null,"publish_date":"2025-07-22 00:29:41","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.439},{"id":343916368,"title":"Fury as Donald Trump releases records of FBI's surveillance of Martin Luther King Jr","text":"The Trump administration has released records of the FBI’s surveillance of Martin Luther King Jr - despite opposition from the slain Nobel laureate’s family and the civil rights group which he led until his 1968 assassination. The digital document dump includes more than 240,000 pages of records that had been under a court-imposed seal since 1977, when the FBI first gathered the records and turned them over to the National Archives and Records Administration. In a lengthy statement released Monday, King's two living children, Martin III, 67, and Bernice, 62, said their father’s assassination has been a “captivating public curiosity for decades.” But the pair emphasized the personal nature of the matter, urging that “these files must be viewed within their full historical context.” The Kings got advance access to the records and had their own teams reviewing them. Those efforts continued even as the government granted public access. It was not immediately clear Monday whether the documents would shed any new light on King's life, the Civil Rights Movement or his murder. “As the children of Dr. King and Mrs. Coretta Scott King, his tragic death has been an intensely personal grief — a devastating loss for his wife, children, and the granddaughter he never met -- an absence our family has endured for over 57 years,” they wrote. “We ask those who engage with the release of these files to do so with empathy, restraint, and respect for our family’s continuing grief.” They also repeated the family's long-held contention that James Earl Ray, the man convicted of assassinating King, was not solely responsible, if at all. Bernice King was five-years old when her father was killed at the age of 39. Martin III was 10. A statement from the office of Director of National Intelligence Tulsi Gabbard called the disclosure “unprecedented” and said many of the records had been digitized for the first time. She praised President Donald Trump for pushing the issue. Trump promised as a candidate to release files related to President John F. Kennedy’s 1963 assassination. When Trump took office in January, he signed an executive order to declassify the JFK records, along with those associated with Robert F. Kennedy’s and MLK's 1968 assassinations. The announcement from Gabbard's office included a statement from Alveda King, Martin Luther King Jr.'s niece, who is an outspoken conservative and has broken from King's children on various topics — including the FBI files. Alveda King said she was “grateful to President Trump” for his “transparency.\" Separately, Attorney General Pam Bondi’s social media account featured a picture of the attorney general with Alveda King. Besides fulfilling Trump's order, the latest release means another alternative headline for the president as he tries to mollify supporters angry over his administration’s handling of records concerning the sex trafficking investigation of Jeffrey Epstein , who killed himself behind bars while awaiting trial in 2019, during Trump’s first presidency. Trump last Friday ordered the Justice Department to release grand jury testimony but stopped short of unsealing the entire case file.","summary":"The digital document dump includes more than 240,000 pages of records that had been under a court-imposed seal since 1977 - when the FBI first gathered the records","url":"https://www.mirror.co.uk/news/us-news/fury-donald-trump-releases-records-35594152","image":"https://i2-prod.mirror.co.uk/article35594155.ece/ALTERNATES/s1200b/1_President-Trump-Holds-Signing-Ceremony-For-GENIUS-Act-At-White-House.jpg","video":null,"publish_date":"2025-07-22 00:28:25","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","category":"politics","source_country":"gb","sentiment":0.043},{"id":343919264,"title":"White House Restricts WSJ Access To Trump Over Epstein Story","text":"The White House on Monday barred The Wall Street Journal from traveling with US President Donald Trump during his upcoming visit to Scotland, after the newspaper reported that he wrote a bawdy birthday message to his former friend, alleged sex trafficker Jeffrey Epstein. The move comes after Trump on Friday sued the WSJ and its media magnate owner Rupert Murdoch for at least $10 billion over the allegation in the article, which Trump denies.The Trump administration's handling of the Epstein case has threatened to split the Republican's far-right Make America Great Again (MAGA) base, with some of his supporters calling for a full release of the so-called \"Epstein Files.\"The punishment of the Wall Street Journal marks at least the second time the Trump administration has moved to exclude a major news outlet from the press pool over its reporting, having barred Associated Press journalists from multiple key events since February.\"As the appeals court confirmed, The Wall Street Journal or any other news outlet are not guaranteed special access to cover President Trump in the Oval Office, aboard Air Force One, and in his private workspaces,\" said Press Secretary Karoline Leavitt.\"Due to The Wall Street Journal's fake and defamatory conduct, they will not be one of the thirteen outlets on board (Air Force One).\"Trump departs this weekend for Scotland, where he owns two golf resorts and will meet with UK Prime Minister Keir Starmer. Earlier this month, the US Department of Justice, under Trump-appointed Attorney General Pam Bondi, said there was no evidence suggesting disgraced financier Epstein had kept a \"client list\" or was blackmailing powerful figures before his death in 2019.In its story on Thursday, the WSJ reported that Trump had written a suggestive birthday letter to Epstein in 2003, illustrated with a naked woman and alluding to a shared \"secret.\"Epstein, a longtime friend of Trump and multiple other high-profile men, was found hanging dead in a New York prison cell in 2019 while awaiting trial on charges that he sexually exploited dozens of underage girls at his homes in New York and Florida.The case sparked conspiracy theories, especially among Trump's far-right voters, about an alleged international cabal of wealthy pedophiles. Epstein's death -- declared a suicide -- before he could face trial supercharged that narrative.Since returning to power in January, Trump has moved to increase control over the press covering the White House.In February, the Oval Office stripped the White House Correspondents' Association (WHCA) of its nearly century-old authority to oversee which outlets have access to certain restricted presidential events, with Trump saying that he was now \"calling the shots\" on media access.In a statement, the WHCA president urged the White House to \"restore\" the Journal to the pool.\"This attempt by the White House to punish a media outlet whose coverage it does not like is deeply troubling, and it defies the First Amendment,\" said WHCA President Weijia Jiang.\"Government retaliation against news outlets based on the content of their reporting should concern all who value free speech and an independent media.\"","summary":"The White House on Monday barred The Wall Street Journal from traveling with US President Donald Trump during his upcoming visit to Scotland, after the newspaper reported that he wrote a bawdy birthday message to his former friend, alleged sex trafficker Jeffrey Epstein.","url":"https://www.ibtimes.com/white-house-restricts-wsj-access-trump-over-epstein-story-3779063","image":"https://d.ibtimes.com/en/full/4612001/trump-administrations-handling-epstein-case-has-threatened-split-republicans-far-right-make.jpg?w=1600&h=900&q=88&f=7484a063039e3eb7ec4d527442eff145","video":null,"publish_date":"2025-07-22 00:27:12","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.101},{"id":343915424,"title":"‘Big Bang Theory’s Jim Parsons Slams Trump Administration for Ending LGBTQ Crisis Hotline: “It’s Quite Literally Criminal”","text":"Skip to main content\n\nJuly 21, 2025 5:26pm\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nJim Parsons\n\nDimitrios Kambouris/Getty Images\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nJim Parsons is blasting President Donald Trump‘s administration for shutting down one of the nation’s crisis hotlines, which offered tailored support for LGBTQ youth and young adults.\n\nThe Big Bang Theory star made a recent appearance on MSNBC’s The Weekend, where he criticized the decision to end the 988 National Suicide & Crisis Lifeline’s LGBTQ service on July 17.\n\n“I think it’s quite literally criminal,” Parsons said. “It’s one of the kinds of decisions that you’re like, ‘There’s no good reason for it.’ It doesn’t matter what reason you ever put towards it or say it’s the reason it’s happening, it’s never going to be justified.”\n\nRelated Stories\n\nDonald Trump Won't Absolutely Love That He May Have Just Handed an Emmy to Stephen Colbert\n\nHow Hollywood Is Feeding the Frenzy Around the Epstein Files\n\nThe openly gay actor, who is married to Todd Spiewak, continued, “It is only hurtful and it feels like it’s only being done in order to make a point, we’re getting rid of this because we want to make sure certain people understand they’re not welcome here.”\n\nAccording to Substance Abuse and Mental Health Services Administration (SAMHSA), the LGBTQ youth program served more than 1.4 million callers since it launched in September 2022. Callers now don’t have the option to “Press 3” for specialized LGBTQ support.\n\nSAMHSA wrote in a statement after it was announced that the Trump administration would be shutting down the specialized service, “Everyone who contacts the 988 Lifeline will continue to receive access to skilled, caring, culturally competent crisis counselors who can help with suicidal, substance misuse, or mental health crises, or any other kind of emotional distress. Anyone who calls the Lifeline will continue to receive compassion and help.”\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nTracee Ellis Ross\n\nMalcolm-Jamal Warner Remembered by Questlove, Tracee Ellis Ross, Magic Johnson, More: “You Made the World a Brighter Place”\n\nSocial Impact Summit\n\nDolores Huerta, Bradley Whitford, Elaine Welteroth and Diego Mariscal Join Lineup of 2025 Social Impact Summit, Hosted by THR and Social Impact Fund\n\nMariah Carey Confirms Release Date For 16th Album ‘Here For it All’\n\nBruce Springsteen Joins Zach Bryan for Surprise Appearance at New Jersey Concert\n\nChris Martin Jokes About Kiss-Cam Scandal at First Coldplay Concert Since Video Went Viral\n\nTravis Scott\n\nTravis Scott’s ‘JackBoys 2’ Tops Chart, Ends Justin Bieber’s Six-Album Streak of No. 1 Debuts\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"The 988 National Suicide &#38; Crisis Lifeline's \"Press 3\" option was shut down on July 17.","url":"https://www.hollywoodreporter.com/news/politics-news/jim-parsons-slams-trump-ending-lgbtq-crisis-hotline-1236325178/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/07/Jim-Parsons-getty-H-2025.png","video":null,"publish_date":"2025-07-22 00:26:18","author":"Carly Thomas","authors":["Carly Thomas"],"language":"en","category":"politics","source_country":"US","sentiment":0.212},{"id":343922176,"title":"Should You Buy Nio Stock While It's Below $5?","text":"Nio (NIO 2.62%) is making huge strides. The Chinese automaker projects it will sell a staggering 450,000 units this year, more than double its sales from last year. With such explosive growth, investors may be wondering if it's time to get on board and invest in the automaker.\n\nWhile Nio is charging ahead in the electric vehicle race, it faces fierce competition in its home market and has to navigate the complex landscape of global geopolitical tensions. With the stock priced under $5 -- $4.47 at 9:30 a.m. ET on Monday -- is now the time to buy? Let's explore the business and investment opportunity ahead.\n\nNio's sales growth has been excellent\n\nNio continues to increase its vehicle deliveries and expand its market presence. Last year, the company achieved record deliveries of 221,970 vehicles, representing a 39% increase over the previous year. It recently reported sales of 72,056 units in the second quarter, representing a 26% increase from the same period last year.\n\nA unique aspect of Nio's business is its battery-as-a-service offering, which addresses a common concern for many electric vehicle (EV) drivers: charging time. With its battery swapping technology, at designated locations, Nio can replace a depleted battery with a fully charged one in just 3 to 5 minutes.\n\nWith this system, customers pay less upfront cost when purchasing a vehicle, instead paying a fee over time, which provides Nio with a steady stream of recurring income. Analysts at Western Securities, a Chinese investment bank, believe that this segment of Nio's business could break even by 2026.\n\nIt faces some serious headwinds\n\nThe electric vehicle market is highly competitive, particularly in China, and Nio faces significant challenges in this environment. Analysts have noted that competition in China's battery electric vehicle sector is \"fierce.\" This intense competition ultimately impacts Nio's ability to increase sales volume, maintain favorable pricing, and achieve profitability.\n\nIn the first quarter, revenue fell short of estimates and missed the company's guidance. The decline was primarily attributed to lower selling prices and increased promotions aimed at clearing out the inventory of older Nio models, as well as a higher proportion of sales from the Onvo brand, which targets the \"mainstream family market, ultimately impacting its profit margins.\n\nThe manufacturer also faces several geopolitical headwinds. For instance, last year, the European Commission imposed duties on imports of battery electric vehicles (BEVs) from China, effective Oct. 30, 2024, for a period of five years. This decision was driven by concerns over substantial government subsidies that benefit Chinese EV makers. Additionally, former U.S. President Joe Biden raised tariffs on Chinese EVs to 100%, while current President Donald Trump announced additional tariffs on goods imported from China.\n\nNio's cost-cutting efforts\n\nAnother criticism of Nio lies in its growing losses. Since its inception, the company has consistently struggled to turn a profit due to its capital-intensive business model, which requires substantial investments in research and development, expansion of production capacity, and the establishment of its power and service networks.\n\nLast year, Nio reported a net loss of RMB 22,402 million (approximately $3 billion). In the first quarter of this year, the company's losses increased to RMB 6,750 million (approximately $930 million), representing a 30% rise compared to the same quarter last year. \n\nNIO Revenue (TTM) data by YCharts\n\nThe company is taking steps to improve profitability. In the first quarter, its vehicle margin increased to 10.2%, up from 9.2% in the same period a year earlier. Nio has taken steps to control costs by reducing spending, including restructuring and improving efficiency across research and development, the supply chain, and sales and services.\n\nGoldman Sachs has upgraded the automaker to a neutral rating, citing the company's cost reduction efforts, and anticipates a 4%-10% improvement in profit levels over the next three years. Looking ahead, Nio CEO William Bin Li is optimistic about achieving profitability by the fourth quarter of 2025, thanks to the cost-cutting and restructuring initiatives. The company also projects doubling sales to 450,000, but Goldman analysts estimate sales could be closer to 337,000.\n\nIs Nio stock a buy?\n\nNio is experiencing significant growth in China, with increasing deliveries and rising revenue. The company has a unique battery-as-a-service offering that differentiates it from competitors. However, it faces stiff competition in China along with headwinds from geopolitical trade tensions.\n\nThe stock is currently trading at a 0.95 price-to-sales ratio. Investors who are optimistic about its long-term potential and willing to overlook geopolitical tensions and fierce competition may want to consider buying the stock at that price.\n\nThat said, its ongoing unprofitability and vulnerability to external economic and political pressures are headwinds for the stock. Before making a purchase, I'd look for improvements in its efficiency, along with signs that it is capturing a growing market share in China and improving its bottom line. Until then, most investors are best off looking elsewhere.","url":"https://www.fool.com/investing/2025/07/21/should-you-buy-nio-stock-while-its-below-5/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F825757%2Fnio-es8-larger.png&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-07-22 00:26:00","author":"Courtney Carlsen","authors":["Courtney Carlsen"],"language":"en","source_country":"us","sentiment":-0.297},{"id":343918966,"title":"World News | Looming over Two Cases Threatening Musk's Car Company is a Single Question: Can He Be Trusted?","text":"Miami, Jul 22 (AP) Elon Musk fought court cases on opposite coasts Monday, raising a question about the billionaire that could either speed his plan to put self-driving Teslas on US roads or throw up a major roadblock: Can this wildly successful man who tends to exaggerate really be trusted? In Miami, a Tesla driver who has admitted he was wrong to reach for a dropped cell phone moments before a deadly accident, spoke of the danger of putting too much faith in Musk's technology — in this case his Autopilot programme. Also Read | US: Alaska Airlines Restores Operations After Equipment Failure at Data Centre Grounds All Planes. “I trusted the technology too much,” said George McGee, who ran off the road and killed a woman out stargazing with her boyfriend. “I believed that if the car saw something in front of it, it would provide a warning and apply the brakes.” In unusual coincidence, regulators arguing an Oakland, California, case tried to pin exaggerated talk about the same Tesla technology at the centre of a request to suspend the carmaker from being able to sell vehicles in the state. Also Read | US: Appeals Court Orders New Trial for Man Convicted in 1979 Etan Patz Case. Musk's tendency to talk big — whether its his cars, his rockets or his government costing-cutting efforts — have landed him in trouble with investors, regulators and courts before, but rarely at such a delicate moment. After his social media spat with President Donald Trump, Musk can no longer count on a light regulatory touch from Washington. Meanwhile, sales of his electric cars have plunged and so a hit to his safety reputation could threaten his next big project: rolling out driverless robotaxis — hundreds of thousands of them — in several US cities by the end of next year. The Miami case holds other dangers, too. Lawyers for the family of the dead woman, Naibel Benavides Leon, recently convinced the judge overseeing the jury trial to allow them to argue for punitive damages. A car crash lawyer not involved in the case, but closely following it, said that could cost Tesla tens of millions of dollars, or possibly more. “I've seen punitive damages go to the hundreds of millions, so that is the floor,” said Miguel Custodio of Los Angeles-based Custodio & Dubey. “It is also a signal to other plaintiffs that they can also ask for punitive damages, and then the payments could start compounding.” Tesla did not reply for a request for comment. That Tesla has allowed the Miami case to proceed to trial is surprising. It has settled at least four deadly accidents involving Autopilot, including payments just last week to a Florida family of a Tesla driver. That said, Tesla was victorious in two other jury cases, both in California, that also sought to lay blame on its technology for crashes. Lawyers for the plaintiffs in the Miami case argue that Tesla's driver-assistance feature, called Autopilot, should have warned the driver and braked when his Model S sedan blew through flashing lights, a stop sign and a T-intersection at 62 miles-an-hour in an April 2019 crash. Tesla said that drivers are warned not to rely on Autopilot, or its more advanced Full Self-Driving system. It say the fault entirely lies with the \"distracted driver\" just like so many other “accidents since cellphones were invented.” Driver McGee settled a separate suit brought by the family of Benavides and her severely injured boyfriend, Dillon Angulo. McGee was clearly shaken when shown a dashcam video Monday of his car jumping a Key West, Florida, road and hitting a parked Chevrolet Tahoe which then slammed into Benavides and sent her 75 feet through the air to her death. Asked if he had seen those images before, McGee pinched his lips, shook his head, then squeaked out a response, “No.” Tesla's attorney sought to show that McGee was fully to blame, asking if he had ever contacted Tesla for additional instructions about how Autopilot or any other safety features worked. McGee said he had not, though he was heavy user of the features. He said he had driven the same road home from work 30 or 40 times. Under questioning he also acknowledged he alone was responsible for watching the road and hitting the brakes. But lawyers for the Benavides family had another chance to parry that line of argument and asked McGee if he would have taken his eyes off the road and reached for his phone had he been driving any car other than a Tesla on Autopilot. McGee responded, “I don't believe so.” The case is expected to continue for two more weeks. In the California case, the state's Department of Motor Vehicles is arguing before an administrative judge that Tesla has misled drivers by exaggerating the capabilities of its Autopilot and Full Self-Driving features. A court filing claims even those feature names are misleading because they offer just partial self-driving Musk has been warned by federal regulators to stop making public comments suggesting Full Self-Driving allows his cars to drive themselves because it could lead to overreliance on the system, resulting in possible crashes and deaths. He also has run into trouble with regulators for Autopilot. In 2023, the company had to recall 2.3 million vehicles for problems with the technology and is now under investigation for saying it fixed the issue though it's unclear it has, according to regulatory documents. The California case is expected to last another four days. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Elon Musk fought court cases on opposite coasts Monday, raising a question about the billionaire that could either speed his plan to put self-driving Teslas on US roads or throw up a major roadblock: Can this wildly successful man who tends to exaggerate really be trusted?","url":"https://www.latestly.com/agency-news/world-news-looming-over-two-cases-threatening-musks-car-company-is-a-single-question-can-he-be-trusted-7012272.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-22 00:24:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.627},{"id":343914390,"title":"White House Bars WSJ From Press Pool As Trump-Epstein Birthday Letter Row Continues","text":"A White House decision to remove The Wall Street Journal from the press pool covering President Donald Trump’s upcoming visit to Scotland has drawn sharp criticism from journalists, press advocacy bodies, and political commentators. The move comes days after the Journal published a report alleging that Trump once sent Jeffrey Epstein a sexually suggestive birthday greeting featuring a nude sketch. In a retaliatory move, Trump’s administration has now excluded the paper from Air Force One access, breaking longstanding norms of press neutrality in presidential travel. Press Secretary Karoline Leavitt confirmed the exclusion on Monday, citing “fake and defamatory conduct” by the Journal as the reason. “Thirteen diverse outlets will participate in the press pool to cover the President’s trip to Scotland. Due to The Wall Street Journal’s fake and defamatory conduct, they will not be one of the thirteen outlets on board,” Leavitt said in a statement to Business Insider. The Journal’s parent company, Dow Jones, declined to comment officially, although internal sources have confirmed the newsroom is preparing for a prolonged legal battle. Trump’s Lawsuit Seeks $10 Billion In Damages From Murdoch-Led Media Group The White House Correspondents’ Association (WHCA), which previously coordinated the press pool rotation, strongly condemned the decision. “Government retaliation against news outlets based on the content of their reporting should concern all who value free speech and an independent media,” WHCA President Weijia Jiang said. She urged the administration to reverse its decision and restore the Journal’s access to the president’s overseas engagements. The WHCA also warned of a dangerous precedent being set by political retribution. Earlier this year, the Trump administration had unilaterally stripped the WHCA of its role in press pool assignments, centralising that authority within the White House Communications Office. This change effectively gave the executive branch full discretion over which media outlets could access key presidential events, including briefings and overseas visits. In a related February incident, the Associated Press was barred from witnessing an executive order signing after refusing to refer to the “Gulf of Mexico” as the “Gulf of America,” highlighting a pattern of retaliatory media exclusion. Trump Denies Epstein Letter Allegation, Targets WSJ In Legal Offensive At the heart of the latest clash is the Journal’s 18 July exposé, which claimed Trump sent Epstein a birthday letter in 2003 featuring a sketch of a nude woman, along with the message, “Happy Birthday — and may every day be another wonderful secret.” Trump vehemently denied the allegation, calling it “a disgraceful lie”, and filed a sweeping defamation lawsuit on Friday against Rupert Murdoch, Dow Jones, News Corp. CEO Robert Thomson, and four Journal reporters. The lawsuit, filed in federal court, seeks at least $10 billion in damages. Legal analysts have described the figure as largely symbolic, intended more for public messaging than courtroom feasibility. In its response, Dow Jones stood firmly by its reporting, with a spokesperson stating, “We have full confidence in the rigour and accuracy of our reporting, and will vigorously defend against any lawsuit.” The Journal is reportedly preparing a detailed legal response citing internal documentation, editorial oversight logs, and corroborative sources. Scotland Trip Now A Flashpoint In Trump’s Broader Media Offensive Strategy First Amendment scholars and media rights activists are warning of a growing erosion in institutional press freedoms under the current administration. “This isn’t about one outlet. It’s about how power is exercised in a democracy,” said Columbia journalism professor Jonathan Bell. He added that the White House’s shift to handpicking pool reporters weakens public accountability and blurs the line between political preference and governmental access. With Trump’s legal team ramping up pressure on legacy media houses and the administration continuing to redefine access norms, the Scotland trip has become more than a diplomatic visit. It is now the latest flashpoint in a wider war over press independence and presidential impunity. The ripple effects are already being felt across newsrooms in Washington, with several outlets reconsidering their reporting posture toward the administration in light of the Journal’s exclusion. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"In a controversial move that has drawn widespread backlash, the Trump administration has excluded The Wall Street Journal from the presidential press pool for his upcoming trip to Scotland. The decision has been attributed to the Journal’s recent expose linking Trump to a sexually suggestive letter allegedly sent to Jeffrey Epstein.","url":"https://www.timesnownews.com/world/us/us-news/white-house-bars-wsj-from-press-pool-as-trump-epstein-birthday-letter-row-continues-article-152321323","image":"https://images.timesnownews.com/thumb/msid-152321336,thumbsize-35016,width-1280,height-720,resizemode-75/152321336.jpg","video":null,"publish_date":"2025-07-22 00:21:48","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.229},{"id":343919000,"title":"World News | Banishing a Reporter: Trump Escalates Battle with Wall Street Journal over Epstein Story","text":"Washington, Jul 22 (AP) President Donald Trump on Monday followed up his lawsuit against The Wall Street Journal over last week's Jeffrey Epstein story by banishing one of the newspaper's reporters from Air Force One for an upcoming Scotland trip. The moves reflect Trump's aggressiveness toward media who displease him — even a media magnate, Rupert Murdoch, with outlets that have been friendly to him in the past. Also Read | US: Alaska Airlines Restores Operations After Equipment Failure at Data Centre Grounds All Planes. Trump filed a $10 billion defamation lawsuit against the Journal and Murdoch on Friday because of the newspaper's article about a sexually suggestive letter bearing Trump's name that was included in a 2003 album compiled for alleged sex trafficker Epstein's birthday. The president has denied having anything to do with it. On Monday, the White House said it was removing a Journal reporter from the pool covering the president's trip this weekend to his golf courses in Turnberry and Aberdeen in Scotland. The Journal's Tarini Parti had been scheduled to cover him on the trip. Also Read | US: Appeals Court Orders New Trial for Man Convicted in 1979 Etan Patz Case. “Due to the Wall Street Journal's fake and defamatory conduct, they will not be one of the thirteen outlets on board,” White House press secretary Karoline Leavitt said. The Journal declined comment on the action. Aggressiveness with the press is in the Trump playbook It's a tactic the Trump White House has used before. It restricted the access of journalists from The Associated Press to press events when the news outlet would not change its style guidelines to reflect Trump's renaming of the Gulf of Mexico. That launched a legal battle that is wending its way through the courts. The defamation lawsuit is another tool Trump has used against media outlets. He has sued CBS News for its editing of a “60 Minutes” interview with former opponent Kamala Harris; ABC News for a false statement made by George Stephanopoulos in a story regarding a New York writer who had accused Trump of sexual abuse; and Meta after it removed Trump's social media accounts following the Jan. 6, 2021, attack on the Capitol. In each of those cases, Trump won multimillion-dollar settlements. But in those instances, news was only one part of a major corporation's business. In the case of Murdoch and News Corp., news is the chief part of his business. The Journal has vowed to fight. It's also the first time Trump has sued for defamation as a sitting president, and it's not clear whether any president has done that in the past. “There's nothing inherently wrong with a president bringing a libel suit,” said noted free speech attorney Floyd Abrams. “But this claim certainly seems like nothing more or less than an effort to suppress speech that our president finds discomforting. That's not why we have libel law. It's why we have a First Amendment.” News organisations have reacted in varied ways It's all part of a broader pattern of trying to intimidate news organizations that report stories Trump does not like, said Jameel Jaffer, executive director of the Knight First Amendment Institute at Columbia University. “These are lawsuits that have no hope of actually succeeding as lawsuits, but nevertheless have the potential to chill media organizations from doing what all of us need them to do,” Jaffer said. Not every news organization has bowed down; “60 Minutes,” in fact, did some notably tough stories about the early days of Trump's second administration. But it's impossible to quantify stories that weren't done because of fear of a fight with the White House, he said. The Wall Street Journal leans conservative editorially, but hasn't been afraid to take Trump on in both its opinion and news sections. Other Murdoch outlets — Fox News Channel and the New York Post — are much friendlier to him. Ever since the administration announced that it would not be releasing additional government files from the case against Epstein, factions of Trump's base supporters have turned on him. That has put some normally supportive news outlets in a difficult position. Fox News largely avoided the story after Trump suggested his allies stop wasting time on it. But Fox's Howard Kurtz reported on The Wall Street Journal lawsuit on his “Media Buzz” show Sunday, saying that by doing so, “the president has drawn extra attention to the Journal's reporting.” The president's battle with the press has taken on several dimensions. He has been fighting to take away government support for news organizations like Voice of America, and last week the Republican-controlled Congress voted to take away federal funding from NPR and PBS because the president says their news programming is biased against conservatives. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump on Monday followed up his lawsuit against The Wall Street Journal over last week's Jeffrey Epstein story by banishing one of the newspaper's reporters from Air Force One for an upcoming Scotland trip.","url":"https://www.latestly.com/agency-news/world-news-banishing-a-reporter-trump-escalates-battle-with-wall-street-journal-over-epstein-story-7012265.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-22 00:18:10","author":null,"language":"en","source_country":"in","sentiment":-0.137},{"id":343922184,"title":"This Trillion-Dollar Artificial Intelligence (AI) Stock Could Double Your Money in 5 Years","text":"In 2021, social media company Facebook changed its name to Meta Platforms (META 1.22%), partly to reflect its new focus on its metaverse ambitions. Although it is still working on that project, over the past two years, Meta's work in artificial intelligence (AI) has become the company's primary focus. The tech leader is making moves, and if enough things go right, these initiatives could lead to superior returns in the next five years and beyond. Here's why Meta Platforms could potentially double investors' money by the end of 2030.\n\nMeta Platforms is sparing no expense\n\nMeta Platforms has been investing a significant amount of money in its AI ambitions. The company announced it would build AI data centers, a project it expects will cost hundreds of billions of dollars. Meta Platforms has made other strategic moves. It recently acquired Play AI, a company that generates human-like voices through AI. The financial details of the transactions were not disclosed.\n\nElsewhere, Meta Platforms deepened its partnership with EssilorLuxottica, the company that owns RayBan and Oakley, both of which sell glasses and eyewear accessories. Meta Platforms and EssilorLuxottica have been working together for years, but the recent investment, estimated at roughly $3.5 billion, brings their partnership to a new level. Meta Platforms has also been trying to poach top AI talent from competitors, including OpenAI.\n\nHow will Meta Platforms' AI investments pay off? Consider the company's AI hardware vision. CEO Mark Zuckerberg predicted that AI glasses will likely dominate the industry within the next five to 10 years. Perhaps he is being too optimistic, but it's worth pointing out that Meta's AI glasses, developed in collaboration with EssilorLuxottica, have impressive features. They can be controlled through voice command, take pictures and videos, and users can even share what they see on video calls on WhatsApp.\n\nMeta Platforms' revenue from these glasses currently makes up a tiny percentage of its total sales. However, provided Zuckerberg's vision for the future is even close to the truth, that segment could see incredible sales growth in the next five years and perhaps contribute more meaningfully to the tech leader's financial results. And that's just one example. Here's another: Meta Platforms' large language model (LLM), Llama, is available for free. That may seem counterintuitive. It certainly wasn't free for Meta Platforms to create Llama.\n\nHowever, the company aims to attract talented developers to work on and refine its LLM, ultimately (hopefully) making it the leading one on the market. Since Llama powers some of the company's AI-related initiatives, including its virtual assistant, Meta AI, this strategy could, eventually, have positive spillover effects across all these other initiatives.\n\nRevenue and earnings could double by 2030\n\nMeta Platforms' work in AI will also help improve its advertising business, from which it currently generates the overwhelming majority of its sales. The company is looking to automate the ad creation and launch process, something that will almost certainly increase ad demand and related revenue for Meta Platforms. With an ecosystem of 3.43 billion daily active users as of the end of the first quarter, Meta Platforms' websites and apps will remain favorite targets for businesses looking to advertise to a large audience.\n\nFurther, Meta Platforms has also improved engagement on its apps thanks to AI-powered recommendation algorithms. The company's business is being transformed thanks to AI, with improved productivity and more lucrative opportunities across its business. In the next five years, we could see Meta Platforms' revenue and earnings double. It almost accomplished this feat in the past half-decade.\n\nMETA Revenue (Annual) data by YCharts\n\nBut with a laser focus on AI and multiple avenues for growth, the Facebook parent can pull it off, even with some potential headwinds, such as President Donald Trump's trade policies that have already decreased ad demand from some Asia-based companies -- not that this prevented Meta Platforms from delivering strong results in the first quarter. It's also worth mentioning that Meta Platforms now pays a dividend. Investing in the stock today while setting up automatic dividend reinvestment could lead to the kinds of returns that will more than double your initial capital by the end of 2030.","url":"https://www.fool.com/investing/2025/07/21/this-trillion-dollar-artificial-intelligence-ai-st/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F825566%2Fperson-sitting-and-working-at-a-desk.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-07-22 00:18:00","author":"Prosper Junior Bakiny","authors":["Prosper Junior Bakiny"],"language":"en","source_country":"us","sentiment":-0.123},{"id":343918228,"title":"Pentadbiran Trump dedah fail pembunuhan Martin Luther King Jr","text":"WASHINGTON: Pentadbiran Trump mendedahkan ratusan ribu halaman rekod berkaitan pembunuhan Martin Luther King Jr, meskipun mendapat bantahan daripada keluarga pemimpin hak sivil itu.\n\n\"Rakyat Amerika Syarikat (AS) telah menunggu hampir enam dekad untuk mengetahui sepenuhnya hasil siasatan kerajaan Persekutuan terhadap pembunuhan Dr King.\n\n\"Kami komited untuk memastikan segala fakta didedahkan sepenuhnya berhubung peristiwa penting dan tragik dalam sejarah negara ini,\" kata Pengarah Perisikan Negara, Tulsi Gabbard, dalam satu kenyataan.\n\nGabbard berkata lebih 230,000 halaman dokumen telah didedahkan dan diterbitkan dengan 'pengubahsuaian minimum atas faktor kerahsiaan peribadi'.\n\nPresiden AS, Donald Trump menandatangani perintah eksekutif selepas memegang jawatan untuk menyahklasifikasi fail pembunuhan tiga tokoh utama era 1960-an: Presiden John F Kennedy, adiknya Robert F Kennedy dan Martin Luther King Jr.\n\nArkib Negara sebelum ini telah mendedahkan dokumen berkaitan pembunuhan John F Kennedy pada November 1963 pada Mac lalu dan fail berkaitan pembunuhan Robert F Kennedy pada Jun 1968 dikeluarkan pada April.\n\nKing dibunuh pada April 1968 di Memphis, Tennessee. James Earl Ray disabitkan bersalah atas pembunuhan itu dan meninggal dunia dalam penjara pada 1998, namun anak-anak King menyuarakan keraguan bahawa Ray adalah pembunuh sebenar.\n\nDalam kenyataan pada Isnin, dua anak King yang masih hidup, Martin Luther King III dan Bernice King, berkata mereka menyokong ketelusan dan pertanggungjawaban sejarah, namun bimbang rekod itu mungkin digunakan untuk menjejaskan legasi ayah mereka.\n\nMereka berkata, semasa hayatnya, King menjadi sasaran 'kempen maklumat palsu dan pemantauan yang menyerang secara melampau dan menjijikkan', diketuai Pengarah Biro Penyiasatan Persekutuan (FBI) ketika itu, J Edgar Hoover.\n\nKempen itu bertujuan menjatuhkan, melemahkan dan memusnahkan reputasi Dr King serta gerakan Hak Sivil Amerika secara keseluruhan.\n\n\"Tindakan ini bukan sahaja pencerobohan privasi, malah serangan disengajakan terhadap kebenaran,\" kata mereka dalam kenyataan bersama. \n\n\"Kami menyeru sesiapa yang meneliti fail-fail ini melakukannya dengan belas kasihan, berhemah dan hormat terhadap kesedihan berpanjangan yang ditanggung keluarga kami,\" kata mereka. AFP","summary":"WASHINGTON: Pentadbiran Trump mendedahkan ratusan ribu halaman rekod berkaitan pembunuhan Martin Luther King Jr, meskipun mendapat bantahan daripada keluarga pemimpin hak sivil itu.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1422940/pentadbiran-trump-dedah-fail-pembunuhan-martin-luther-king-jr","image":"https://assets.bharian.com.my/images/articles/bh22lepas-o_BHfield_image_listing_featured.var_1753143363.jpg","video":null,"publish_date":"2025-07-22 00:16:08","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.107},{"id":343917206,"title":"Iran continues developing its missile program — foreign minister","text":"NEW YORK, July 22. /TASS/. Tehran continues developing its missile program, Iranian Foreign Minister Abbas Araghchi said in an interview with Fox News.\n\n\"On our missiles, , that is our most reliable means of defense,\" he said, adding that the republic continues working on its missile program.\n\nIran’s missile program is deterrent in its nature, Araghchi noted. \"They [missiles] are for defense. They are not for offense. I can assure you that Iran's missiles would never have a nuclear warhead,\" he stressed.\n\nOvernight into June 13, Israel launched a military operation against Iran. Less than 24 hours later, Tehran retaliated. Nine days later, in the early hours of June 22, US jets targeted three Iranian nuclear sites, effectively entering the conflict. The following evening, Tehran carried out a missile strike on Al Udeid, the largest US military base in the region, located in Qatar. According to US officials, there were no casualties or significant damage. US President Donald Trump later announced that Israel and Iran had agreed to a complete ceasefire. The truce took effect on June 24.","summary":"According toAbbas Araghchi, missiles are for defense","url":"https://tass.com/world/1992343","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-22 00:16:06","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.418},{"id":343921578,"title":"SoftBank and OpenAI's Stargate aims building small data center by year-end, WSJ reports - Reuters","text":"July 21 (Reuters) - Stargate, a multi-billion-dollar effort by ChatGPT's creator OpenAI, SoftBank (9434.T), opens new tab and Oracle (ORCL.N), opens new tab to supercharge the U.S.' AI ambitions is now setting the more modest goal of building a small data center by the end of the year, likely in Ohio, the Wall Street Journal reported on Monday.\n\nIn January, U.S. President Donald Trump hosted top tech CEOs at the White House to highlight the $500 billion Stargate Project, which would create more than 100,000 jobs in the country.\n\nAdvertisement · Scroll to continue\n\nSoftBank and OpenAI, which jointly lead the joint venture, have been at odds over crucial terms of the partnership, including where to build the sites, the report said, citing people familiar with the matter.\n\nIn a joint statement, the two companies told Reuters they were moving \"with urgency on site assessments\" and were also advancing projects in multiple states.\n\nWhen the project was unveiled, the companies involved, along with other equity backers of Stargate, had committed $100 billion for immediate deployment, with the remaining investment expected to occur over the next four years.\n\nOracle Chairman Larry Ellison said at the time that the first of the project's data centers was already under construction in Texas.\n\nAdvertisement · Scroll to continue\n\nTrump has prioritized winning the AI race against China and declared, on his first day in office, a national energy emergency aimed at removing all regulatory obstacles to oil and gas drilling, coal and critical mineral mining, and building new gas and nuclear power plants to bring more energy capacity online.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV598344 \nAbout ConnatixV598344 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Preetika Parashuraman in Bengaluru; additional reporting by Rishabh Jaiswal; Editing by Alan Barona\n\nPurchase Licensing Rights","summary":"SoftBank and OpenAI's Stargate aims building small data center by year-end, WSJ reports  Reuters","url":"https://www.reuters.com/business/softbank-openais-stargate-aims-building-small-data-center-by-year-end-wsj-2025-07-22/","image":"https://www.reuters.com/resizer/v2/6PXKCOZLLBJ77IGLWWQ4JZAPNI.jpg?auth=4293eae6645bb4ffb54b9c2f8868567940fc79a0ce20a3ef7f63d81fcefacd62&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-22 00:14:54","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"gb","sentiment":-0.159},{"id":343916686,"title":"Big blow to Donald Trump's Republican party as Florida Judge rules Miami election can't be delayed by a year","text":"AgenciesUS President Donald Trump. (Getty Images)\n\nMiami city commissioners violated the Florida Constitution when they voted last month to postpone this fall's election to November 2026, a state judge ruled Monday, saying that such a change required voter approval. The judge, Valerie R. Manno Schurr of Florida's 11th Judicial Circuit, ruled in favor of Emilio T. González, a candidate for mayor. He sued in late June after the City Commission voted 3-2 to delay the election, a move it said was meant to save money and improve turnout. Critics noted that it would give elected city officials an extra year in office. The postponement had led to public outcry from candidates who had already filed to run, and from some voters who said the process had been undemocratic.Mayor Francis X. Suarez and one city commissioner, Joe Carollo, are supposed to leave office at the end of this year because of term limits. Carollo voted against postponing the election; Suarez signed the approved ordinance into law.The three commissioners who voted to postpone the Miami election said at a meeting in June that doing so would align with the midterms, lowering the election costs and probably leading to higher turnout. Before their vote, James Uthmeier, Florida's Republican attorney general, opined that changing the election date without voter approval would be unlawful. Governor Ron DeSantis agreed.The commissioners and the mayor cannot lawfully change the date of a municipal election by ordinance, the judge wrote. Postponing the election from an odd-numbered year to an even-numbered one amounted to amending the city's charter, which would require approval from the electorate, she ruled.The judge cited the Miami-Dade County charter, which governs cities in the county, including Miami, under the Florida Constitution. Lawyers for the city had argued that the ordinance changed the city's code, not its charter. The judge dismissed that argument, saying what mattered was the decision's substantive effect.Live Events\"Our Constitution deals with the substance of matters, not mere semantics,\" she wrote. \"The city's contention that its ordinance did not 'amend' its City Charter is nothing more than semantic sleight of hand.\"Manno Schurr dismissed the city's emergency request to toss out González's lawsuit and granted his request for summary judgment. The city immediately said it would fight the ruling.FAQsQ1. Who is Governor of Florida?A1. Governor of Florida is Ron DeSantis.Q2. When election in Miami?A2. Miami election was supposed to be held this fall but city authority has taken steps to postpone it to next year.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onMiami electionMiami election dateFlorida electionFlorida governorUS news\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onMiami electionMiami election dateFlorida electionFlorida governorUS news(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Miami election was supposed to be held this fall but city authority has taken steps to postpone it to next year. However, a Florida court judge has intervened into the matter.","url":"https://economictimes.indiatimes.com/news/international/us/big-blow-to-donald-trumps-republican-party-as-florida-judge-rules-miami-election-cant-be-delayed-by-a-year/articleshow/122824210.cms","image":"https://img.etimg.com/thumb/msid-122824233,width-1200,height-630,imgsize-15188,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-22 00:14:35","author":"Donald Trump","authors":["Donald Trump"],"language":"en","category":"politics","source_country":"in","sentiment":-0.399},{"id":343921148,"title":"Trump thinks Canadians 'nasty' for avoiding U.S. travel, banning booze: ambassador (Canada)","text":"The United States ambassador to Canada says Canadians avoiding U.S. travel and banning American alcohol are among the reasons Donald Trump thinks they are \"nasty\" to deal with.\n\nPete Hoekstra told a conference audience on Monday that such steps \"don't send positive signals\" about Canada treating the U.S. well.\n\nHoekstra was speaking at the annual Pacific NorthWest Economic Region Foundation summit in Bellevue, Washington.\n\nThe Canadian Press was provided with a recording of the ambassador's comments by the office of B.C. Premier David Eby, which said it received the audio from someone who was in the audience.\n\nEby says in a statement that Hoekstra's remarks show Canadians' efforts to stand up to Trump are \"having an impact,\" and he encouraged people to \"keep it up.\"\n\nA representative of Hoekstra's office did not immediately respond to a request for comment.\n\nThe ambassador made the remarks in answer to a question from a conference moderator about what could be done to get people travelling again as Vancouver and Seattle prepare to host games as part of next year's FIFA World Cup.\n\n\"Canadians staying home, that's their business, you know. I don't like it, but if that's what they want to do, it's fine. They want to ban American alcohol. That's fine,\" he says.\n\n\"There are reasons why the president and some of his team referred to Canada as being mean and nasty to deal with, OK, because of some of those steps.\"\n\nHoekstra adds that he \"can get alcohol across the border if (he) wanted to.\"\n\n\"We go back and forth to Michigan and they don't check my car when I come back,\" he said, drawing laughs from the crowd.\n\nEby's statement in response to Hoekstra's remarks says people should keep buying Canadian products and keep their vacations Canadian.\n\n\"We won't take these attacks on our jobs, our economy and our sovereignty, lying down. We'll stand strong together,\" the premier says in the emailed statement.\n\nB.C. is among the provinces that banned the sale of U.S. alcohol from government-run stores after Trump slapped steep tariffs on goods from Canada, a move that has prompted some Canadians to cancel their cross-border trips.","summary":"The United States ambassador to Canada says Canadians avoiding U.S. travel and banning American alcohol are among the reasons Donald Trump thinks they are &amp;quot;nasty&amp;quot; to deal with. Pete Hoekstra told a conference audience on Monday that such steps &amp;quot;don't send positive signals&amp;quot; about ...","url":"https://www.castanet.net/news/Canada/562546/Trump-thinks-Canadians-nasty-for-avoiding-U-S-travel-banning-booze-ambassador","image":"https://www.castanet.net/content/cp/2025/7/c70f2a34e86ea6e4db28f7274c518d712b6e969101fedf4a51182ff730f0911e.jpg","video":null,"publish_date":"2025-07-22 00:14:00","author":"Brenna Owen,The Canadian Press","authors":["Brenna Owen","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.234},{"id":343921446,"title":"10 takeaways from Hunter Biden media blitz: drug use, laptop scandal, Joe Biden’s dropout ","text":"Here are the Washington Examiner’s top takeaways from both interviews.\n\n1. Hunter says Joe Biden was on Ambien during the debate against Trump \n\nHunter Biden suggested in his interview with Callaghan that Joe Biden was on Ambien during his campaign-ending debate performance against President Donald Trump last year.\n\n“I know exactly what happened in that debate. He flew around the world basically, and the mileage that he could have flown around the world three times. He’s 81 years old. He’s tired as sh**,” Hunter Biden said during his interview with Callaghan.\n\nHe continued, “They give him Ambien to be able to sleep. He gets up on the stage, and he looks like he’s a deer in the headlights. And it feeds into every f****** story that anybody wants to tell.”\n\nThe younger Biden talked about the debate between Joe Biden and Trump several times throughout his interviews with Callaghan and Harrison.\n\nDuring his interview with Harrison, Hunter Biden claimed he was not in favor of the June 2024 debate against Trump held in Atlanta, Georgia.\n\n“Look, I was opposed to the debate,” he said. “I didn’t understand why we were rushing into a debate with somebody who had just been convicted on 34 felony counts, and why we weren’t just going to wait to see how this played out.”\n\nThe June 27, 2024, debate was the earliest-ever debate between presidential candidates. Biden’s aides had pushed for it to stave off doubts about Biden’s mental acuity.\n\nBut ultimately, Biden’s fumbling and ramblings hastened his exit from the race.\n\n“That debate was awful when my dad walked out, I knew that he had an off night, you know what I mean. He wasn’t drooling, but he had an off night,” the younger Biden said.\n\n2. Hunter blames Pelosi for making the ‘decision’ on his father dropping out\n\nHunter Biden suggested that Nancy Pelosi was the one to drive the former president out of the race in an “At Our Table” podcast, hosted by former DNC chair Jamie Harrison. \n\n“They already made a decision. They clearly made a decision. When I say ‘they,’ I mean the speaker,” he said when asked about his father’s decision to drop out of the race.\n\nPelosi, who remains a prominent figure in the Democratic Party, was the House speaker during the Biden administration.\n\nHowever, shortly before Biden dropped out of the 2024 race, Pelosi told the New Yorker that she had concerns about the election and Biden’s chances of winning, putting pressure on Biden to drop out.\n\nThe younger Biden recalls Alexandra Pelosi, Nancy Pelosi’s daughter, calling Jill Biden out for not pushing the former president to drop out of the 2024 race.\n\n“And I heard Alexandra Pelosi say something like ‘put your big girl pants on’ to my mom, and I kind of feel like saying who the f*** do you think you are,” he said. “I’d never speak about your mom that way. I would never speak about your father that way. I would never insult your parents that way.”\n\n3. Takes special shots at George Clooney\n\nHunter Biden’s disdain for celebrity actor George Clooney was on full display during the podcast interview with former DNC chairman Jaime Harrison.\n\n“I love George Clooney’s movies, but I don’t really give a sh** what he thinks about who should be the nominee for the Democratic Party,” Biden said bluntly.\n\nClooney was among the loudest voices last year calling for the elder Biden to exit the 2024 race after the disastrous debate against President Donald Trump, even writing an op-ed piece in the New York Times.\n\nThe younger Biden criticized Clooney over his behavior during a June 2024 fundraiser. CNN’s Jake Tapper and Axios’s Alex Thompson wrote in their book Original Sin that Biden didn’t recognize the Hollywood actor.\n\n“I’ll be honest, I really don’t like George Clooney as an actor or as a person,” Biden said to Harrison.\n\nIn the interview with Andrew Callaghan, Hunter unleashed even more: “F*** him! F*** him and f*** everybody around him,” he said. \n\nBiden claimed Clooney threatened to pull out of an event because the president refused to recognize the International Criminal Court’s arrest warrant for Israeli Prime Minister Benjamin Netanyahu.\n\n4. Gushes on Wes Moore and the future of the party\n\nIn an interview with Andrew Callaghan on Channel 5, Hunter Biden gushes over the Maryland governor, seeing him as the future of the Democratic Party.\n\n“I don’t think the Democratic Party’s dead. I think that there’s some really incredible leaders in the Democratic Party,” he said. “Wes Moore gives me an incredible amount of hope. He’s incredibly dynamic. He’s so goddamn smart, and he’s truly a genuinely decent human being. I love Governor Moore.”\n\nBiden continued to say that Minnesota Gov. Tim Walz and former Vice President Kamala Harris are also “incredible leaders,” but questions whether they can run again and if they even want to run again. He also thinks the Democratic Party is always claimed to be in “disarray” before every election, saying there’s no leadership and nothing’s getting done. However, Biden believes “someone will emerge.”\n\n“There will be a leader that will emerge. The stakes are too high,” he said. “Whether they’ll succeed in this environment, I don’t know. And that’s the question: How far are people willing to go?”\n\nThe younger Biden said there needs to be a leader who puts “themselves in jeopardy on behalf of the American people,” using Sen. Alex Padilla’s (D-CA) notable moment of interrupting Homeland Security Secretary Kristi Noem’s press conference as an example.\n\nHarrison, the former DNC chairman, claimed during the podcast that Biden’s decision to exit the 2024 race was “the most selfless act that I’ve ever seen in American politics,” to which the younger Biden concurred.\n\n“Do you think your dad stepping out was a mistake?” Harrison asked Biden.\n\n“No,” he responded.\n\n“I know that it wasn’t a mistake in that moment, because what he did is, I think, that he made the only choice that was left to him, which was either save the party or save himself. And he chose to save the party,” he continued. “And in so doing, I think, did one of the most selfless acts of anybody that I know, as a student of history.”\n\nThe younger Biden also claimed that had his father remained, he would have secured a second term.\n\n“Do I think that he could have won? I think that he could have won, yeah,” he said. “It doesn’t mean that I don’t respect other people’s opinion, because nobody can actually answer that question.”\n\n5. Denies responsibility for the cocaine bag found at the White House\n\nHunter Biden denied any responsibility for the bag of cocaine found inside the White House in July 2023, asking Callaghan rhetorically during his interview why he would bring the drug to the residence and “stick it into a cubby outside the situation room in the West Wing.”\n\n“I have been clean and sober since June of 2019, and I have not touched a drop of alcohol or a drug, and I’m incredibly, incredibly proud of that,” Hunter Biden said. \n\nThe bag of cocaine found at the White House during the Biden administration has been the subject of much controversy, as speculation mounted that the bag belonged to Hunter Biden, whose struggles with drug and alcohol addiction had been widely known. \n\nThe denial comes after FBI Deputy Director Dan Bongino announced earlier this year that the agency would reopen its investigation into several cases of “potential public corruption” that have held public interest, including the cocaine discovery.\n\n6. Claims to be in the White House for ’12 days’ during his father’s presidency \n\nAs Republicans investigate Joe Biden’s mental acuity during his time in the White House, Hunter Biden forcefully denied allegations that he was the “acting Chief of Staff” for his father.\n\n“You think Joe Biden was involved in some cover-up? You think Jake Tapper is telling the truth when he says that I was the acting Chief of Staff [of President Joe Biden’s White House]?” Hunter Biden questioned while speaking with Harrison. \n\nBIDEN AUTOPEN USE: WHAT TO KNOW AS TRUMP ORDERS AN INVESTIGATION INTO HIS PREDECESSOR\n\nCNN’s Jake Tapper, alongside Thompson, said during an interview with Katie Couric that he thought Hunter Biden was “driving the decision-making for the family,” and was “almost like a chief of staff” for the Biden family. \n\n“I was in that White House 12 days over the last two years of the administration,” Hunter Biden claimed. “I stayed as far away as I possibly could, which by the way broke my heart.”\n\n7. Hunter Biden calls Netanyahu a ‘monster’\n\nHunter Biden touched on Israel’s war against Hamas and attacks on Iran and called Israeli Prime Minister Benjamin Netanyahu a “monster,” after the prime minister went on TV talking about the “awful sacrifices he’s had to make,” most notably regarding his family.\n\n“Bibi Netanyahu went on TV and said about the awful sacrifices that he’s had to go to because his son has had to cancel his scheduled wedding twice now,” he said. “He said that on TV, and he said and his wife has gone through so much pain because she’s had to put her life on hold these last two years, since October 7, and he hadn’t said one f***ing thing about how many people that are still hostages, that he refuses to negotiate for? That to me is a monster.”\n\nThe younger Biden also noted that this isn’t the first time Israel has warned the United States about potential Iranian nuclear weapons.\n\n“Netanyahu has been promising us that Iran was on the verge of a nuclear weapon for 22 years now,” he said. “And then he did it a few months ago, and then he did it a few weeks ago, and then he dropped it, and then he dropped bombs.”\n\n“He’s been wrong every time, but he’s the boy who cried wolf, and one day the wolf is going to be pushed,” he said about Iran’s ability to get a nuclear weapon.\n\nBiden then claimed that Netanyahu bombed Iran to “save his own a** so that he doesn’t end up in jail, because he has a favorability rating inside of Israel of about 22%.”\n\n8. Accused Trump of sending illegal immigrants to death camps\n\nWading into domestic politics, Hunter Biden forcefully rebuked Trump’s decision to send illegal immigrants to prisons in El Salvador and South Sudan, calling the latter a “death camp.”\n\n“If you think that the prison in El Salvador is not a f***ing concentration camp, you’re out of your f***ing mind,” Hunter Biden said. “Tell me, anybody that’s returning from there. You saw those pictures. Do you think anybody’s getting out of there?” \n\nHe continued, “You think anybody’s getting out of those South Sudan prisons ever? Ever? Out of your fucking mind. That’s a f****** – That’s a death camp. They’re done. They’re over. And if you’re not dead, you would want to be dead if you were in that prison.”\n\nThe Trump administration has conducted several deportation flights since he returned to the Oval Office, despite questions over the legality of some deportations the White House has carried out. \n\nAt times, the White House has fought the court system, with federal judges halting deportation plans or ordering the return of specific individuals, such as the mistakenly deported Maryland man, Kilmar Abrego Garcia, who was brought back to the U.S. after a lengthy battle. \n\n9. Downplays the significance of his laptop \n\nThe embattled Biden minimized the importance of the laptop scandal that roiled his family in 2020 after the New York Post published the contents of a hard drive he left at a repair shop in 2019. \n\nDuring his Channel 5 sit-down, Hunter Biden said that none of his legal issues have stemmed from the discovery of the hard drive. He said that “not one single person has ever accused me of a crime based upon anything that was in or discovered as it relates to my laptop.”\n\n“So this whole idea that there was some conspiracy to cover up the laptop — they uncovered 20 years unvarnished, of every single communication that I have ever had over a phone or by text or over email or computer in any digital way,” he said. “There’s not one communication that you can even remotely say is evidence of a crime. Not one.”\n\nHowever, in the final days of his presidency, President Joe Biden issued a sweeping pardon for his son, preventing him from ever serving prison time for his convictions on tax and gun felonies. President Joe Biden had pledged not to pardon his son, but he reversed course in December, just days before Hunter was to be sentenced on three gun felonies and faced a second sentencing for failing to pay income taxes on millions of dollars worth of income.\n\nThe complete and unconditional pardon covers any crimes the younger Biden may have committed starting in 2014, before the laptop was discovered, and runs through 2024.\n\n10. Joe Biden’s prostate cancer ‘not curable’\n\nIn his interview with Callaghan, Hunter Biden addressed his father’s recent prostate cancer diagnosis that revived questions about the former president’s health while in office. \n\nHunter Biden explained that his father was not tested for the disease during his time in office because it is not a standard test for men older than 70. \n\n“And he went in and got tested, and he had prostate cancer, and it had spread to his bones,” Hunter Biden said. “He’s in great health otherwise, and they can treat it, but it’s not curable.”\n\nHe continued, “And so that’s all the public knowledge of it. But I think that that is literally everything that there is to know about it. They do this thing called hormone therapy, and it makes you tired and stuff like that. But seeing him day-to-day, he’s doing well.”\n\nJoe Biden was diagnosed with prostate cancer after getting a biopsy to follow up on “increasing urinary symptoms,” his office said in a statement at the time. The older Biden was diagnosed with an aggressive form of prostate cancer, characterized by a Gleason score of 9, or Grade Group 5, with metastasis to the bone.","summary":"Hunter Biden, the son of former President Joe Biden, sat down for two lengthy interviews in which he discussed his past drug abuse, denied that a bag of cocaine found at the White House during his father’s administration was his, and discussed his father’s decision to drop out of the 2024 presidential election.  The younger [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3477980/takeaways-hunter-biden-interviews-drug-use-laptop-joe-dropout/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/hunter_biden_court_2024.webp","video":null,"publish_date":"2025-07-22 00:13:22","author":"Hailey Bullis","authors":["Hailey Bullis"],"language":"en","source_country":"US","sentiment":-0.475},{"id":343918102,"title":"‘Revenge Tour’: Watters Says Hunter Biden ‘Doesn’t Give An F’ And Names Which 2028 Contender Can’t Match His Swagger","text":"Fox News’ Jesse Watters said Monday on “The Five” that Hunter Biden “doesn’t give an F” about what Democrats think, calling out how Democrat California Gov. Gavin Newsom couldn’t compete with Hunter’s “swagger” in a potential 2028 race.\n\nHunter sat down with Channel 5 for a three-hour interview, sharing his thoughts on his father, former President Joe Biden. Hunter also discussed his father’s 2024 presidential campaign. While discussing the interview, a co-host on “The Five” said Hunter was “not wrong” when calling out Democrat pundits who turned their backs on the former president after his disastrous debate in June 2024. (RELATED: Polymarket Releases First Look At 2028 Presidential Odds)\n\n“When Roman emperors used to murder their political rivals, they used to not just murder the rival. They’d murder the entire family” Watters said. “Because if you leave the son alive, he’ll spend the rest of his life seeking revenge. They may have killed off Joe Biden, but Hunter Biden is very much alive. Make no mistake, everything he’s saying is exactly what Joe Biden is thinking. This is dark Brandon Jr.”\n\n“This is the guy the memo was about. This is a guy who doesn’t give an F. He’s macho. He’s bold. To say that they’re going to invade El Salvador to bring back the bad hombres. That’s like left-wing Trump. This is what they’ve been looking for,” Watters added.\n\nPrior to Biden debating President Donald Trump in June 2024, Democrats had backed the former president for a second term. Videos of Biden stumbling and misspeaking circulated online, with former White House Press Secretary Karine Jean-Pierre labeling them “cheap fakes” and blaming Republicans for the pushback.\n\nBiden, during the debate, was seen struggling to finish his arguments against Trump and even froze mid-sentence at one point. Soon after, Democrats and media pundits called for Biden to step down from his presidential campaign.\n\nWith Democratic donors freezing funds to the party as long as Biden remained in the race, celebrities like George Clooney wrote an op-ed for The New York Times in July 2024, saying the former president was too impaired to be the nominee.\n\n“Gavin Newsom doesn’t have an ounce of that kind of swagger because that is real. The problem with the Democratic Party, the autopsy, whatever you want to call it, they don’t even want to talk about Biden,” Watters said. “They don’t want to see Joe. They don’t want to see Hunter.”\n\n“But this guy is going to be on a revenge tour, the likes of which we’ve never seen, and his dad is writing a book. So they’re never going to get rid of him,” Watters said. “The only way they do it, Tom Homan has to deport the Biden family to go spend time with Irish Rosie [O’Donnell]. And I bet the Democrats would say, ‘Tom, get him out.'”\n\nDemocrats have struggled to rally behind a single voice and leader for the party since Trump’s win in November 2024. Questions about who could become the new face of the 2028 Democratic primaries have circulated, with names like Newsom, New York Rep. Alexandria Ocasio-Cortez, and former Transportation Secretary Pete Buttigieg floated as possible options.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'This is dark Brandon Jr.'","url":"https://dailycaller.com/2025/07/21/jesse-watters-hunter-biden-democrats-2028-elections/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Screenshot-2025-07-21-at-3.37.21 PM-e1753137474845.png","video":null,"publish_date":"2025-07-22 00:13:02","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","source_country":"US","sentiment":-0.263},{"id":343912482,"title":"Iran does not rule out return of IAEA inspectors to country","text":"NEW YORK, July 22. /TASS/. Iran continues cooperating with the International Atomic Energy Agency (IAEA), and it does not rule out that IAEA inspectors could return to the country in the future, the republic’s Foreign Minister Abbas Araghchi said in an interview with Fox News.\n\n\"We have not stopped our cooperation with the agency. We continue working with them. We need a new modality because the facilities have been destroyed,\" he said. \"Based on the modality that we come to with the agency, that (return of inspectors - TASS) would be possible,\" the minister added.\n\n\"Any request by the agency to visit any place or to send inspectors or whatever should be carefully considered by our supreme National Security Council because of the safety and security concerns,\" he noted.\n\nOn July 2, Iranian President Masoud Pezeshkian signed a law suspending cooperation between Tehran and the IAEA. The law took effect and became legally binding from the day it was signed by the president.\n\nOvernight into June 13, Israel launched a military operation against Iran. Less than 24 hours later, Tehran retaliated. Nine days later, in the early hours of June 22, US jets targeted three Iranian nuclear sites, effectively entering the conflict. The following evening, Tehran carried out a missile strike on Al Udeid, the largest US military base in the region, located in Qatar. According to US officials, there were no casualties or significant damage. US President Donald Trump later announced that Israel and Iran had agreed to a complete ceasefire. The truce took effect on June 24.","summary":"\"Any request by the agency to visit any place or to send inspectors or whatever should be carefully considered by our supreme National Security Council because of the safety and security concerns,\" Abbas Araghchi said","url":"https://tass.com/world/1992341","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-22 00:10:52","author":"Tass","authors":["Tass"],"language":"en","source_country":"RU","sentiment":-0.215},{"id":343917932,"title":"'Big Beautiful Bill' could strip health care from 10 million, add $3.4 trillion to deficit","text":"According to the latest report from the nonpartisan Congressional Budget Office, more than 10 million people are expected to lose their health care over the next decade as a result of the passage of President Donald Trump's tax and spending legislation, known as the \"Big Beautiful Bill.\"Many of those affected are on Medicaid, a program for some of poorest Americans.The analysis shows an improvement from the more than 11 million people who were forecast to lose coverage in the CBO's earlier review.But Congress' passage of the bill brought concerns of additional hoops for Medicare recipients to jump through, from additional work requirements to making other people in eligible for Medicaid.RELATED STORY | Most US adults think the GOP tax bill will help the wealthy and harm the poorIn the same analysis, the Congressional Budget Office says the newly passed law will add $3.4 trillion to the deficit over the next decade — which is a slight increase from the estimates the CBO released ahead of the bill's approval.This has prompted concerns from deficit hawks on Capitol Hill and from lawmakers who will have to explain the bill's effects to their constituents.Recent polling shows the bill is not very popular among the American people, with a more than 60% disapproval rating, according to the latest CBS News/YouGov poll.","summary":"According to analysis from the Congressional Budget Office, more than 10 million people could lose their health care over the next decade as a result of President Trump's tax and spending legislation.","url":"https://www.scrippsnews.com/politics/the-president/big-beautiful-bill-could-strip-health-care-from-10-million-add-3-4-trillion-to-deficit","image":"https://ewscripps.brightspotcdn.com/dims4/default/ea0432b/2147483647/strip/true/crop/8640x4536+0+103/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F19%2F5e%2F3c0f2e36495bb2f3acc1597316cc%2Fap25027819080480.jpg","video":null,"publish_date":"2025-07-22 00:10:03","author":"Nathaniel Reed","authors":["Nathaniel Reed"],"language":"en","source_country":"us","sentiment":0.142},{"id":343916546,"title":"Hunter Biden Criticizes George Clooney and Democrats Who Oppose Joe","text":"Hunter Biden remains quite upset with actor George Clooney, due to a New York Times opinion piece he wrote last July urging then-President Joe Biden to withdraw from the 2024 presidential campaign.\n\nThe younger Biden sat down for a three-hour-long, very foul-mouthed interview with YouTuber Andrew Callaghan, hosting him in Wilmington, Delaware.\n\nBiden used explicit language when talking about Clooney and other Democrats who had been critical of his father or had a hand in facilitating the president’s departure from the 2024 election.\n\nThe anniversary of the senior Biden bowing out of the race and endorsing Vice President Kamala Harris was Monday. \n\nExpressing his sentiments about Clooney’s decision to write the op-ed that implied the Democratic president was losing touch, the former first son harshly remarked, ‘F*** him, f*** him and everybody around him.’\n\n‘I agree with Quentin Tarantino, F***ing George Clooney is not a f***ing actor. He is a f***ing, like, I don’t know what he is. He’s a brand,’ Biden continued. ‘And by the way, and God bless him you know what, he supposedly treats his friends really well, you know what I mean, buys them things. And he’s got a really great place in Lake Como and he’s great friends with Barack Obama. F*** you, what do you have to do with fucking anything?’\n\n‘Why do I have to f***ing listen to you?’ Biden asked. \n\nIn the op-ed, Clooney said of the president that ‘the one battle he cannot win is the fight against time.’ \n\nThe actor had seen Biden at a June 15, 2024 fundraiser in Los Angeles ahead of Biden’s disastrous June 27 debate in Atlanta. In the op-ed, Clooney divulged that the Biden he saw at the fundraiser was the same one who appalled Democratic voters on the debate stage. \n\n‘This is about age. Nothing more,’ Clooney wrote. ‘We are not going to win in November with this president.’ \n\nThe president’s debate performance against President Donald Trump had heightened calls for the 81-year-old to drop out, with Clooney’s op-ed published less than two weeks later. \n\nBehind-the-scenes, CNN’s Jake Tapper and Axios’ Alex Thompson wrote in their book Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again that President Biden didn’t recognize Clooney when he arrived at the LA fundraiser. \n\nThe younger Biden countered that Monday saying that Tapper and Thompson’s sources misinterpreted presidential protocol. \n\nBiden said Clooney was introduced to the president at the fundraiser because that is the customary part of presidential photo lines. \n\n‘And he may know George for the last 30 years and he may have met him 15 times but the guy on his shoulder, who’s usually a military officer, has one job, to say the name of the person who’s walking up,’ Biden said. \n\nHe added: ‘I was there. I watched George Clooney be introduced to my dad with 30 other people in line and the guy said, “Mr. President, George Clooney and Julia Roberts.” That’s it, that’s the story.’ \n\nBiden claimed that Clooney used that incident to undercut his father. \n\n‘What right do you have to step on a man who’s given 52 years of his f***ing life to the service of this country and decide that you, George Clooney, are gonna take out basically a full-page ad in the f***ing New York Times to undermine the president at a time in which, by the way, what do people care about the most?’ Biden said. ‘Why do you think that the Republicans have an advantage over us? Because they’re unified.’\n\nRepresentatives for Clooney did not immediately respond to the Daily Mail’s request for comment. \n\nBiden also bristled that Clooney had almost skipped the fundraiser over his father and the actor’s wife Amal not seeing eye-to-eye on an issue having to do with Israeli Prime Minister Benjamin Netanyahu. \n\nBiden went after authors Tapper and Thompson by name as well. \n\nThe former first son called the book a ‘money grab’ on Tapper’s part and mocked the cable news host’s ratings. \n\n‘Jesus Christ Jake, grow the f*** up,’ Biden said, noting how he’s known the CNN newsman for 30 years. \n\nHe objected to Tapper suggesting he was acting as some sort of ‘chief of staff’ who helped hide President Biden’s declining condition. \n\nIn an interview with Katie Couric, Tapper had referred to Hunter Biden not as a faux White House chief of staff, but serving that role in the Biden family. \n\n‘What they’re also doing,’ he continued. ‘Is that they’ve started a congressional investigation and now I have to deal with another f***ing subpoena because Jake Tapper has decided that he’s – through anonymous sources – create some kind of conspiracy of a crime and here we are, to what end? To what end?’ \n\n‘As the world falls apart around us, why do I have to f***ing spend my time worrying or thinking about or even talking about someone as irrelevant of Jake Tapper,’ Biden added. \n\nHe continued to discuss the pressure campaign that followed his father until the president announced on July 21, 2024 that he would end his reelection bid. \n\nSeveral hours later, Biden endorsed Harris. \n\nBiden complained that his father and Trump – who at 79 will become the nation’s oldest president should he serve all four years – are being measured differently, pointing to a gaffe Trump made at the G7 last month, when he mistakenly announced a trade deal with the ‘EU’ while standing alongside the U.K. prime minister. \n\n‘Can you imagine if he opened up that treaty with Prime Minister Starmer at the G7 in Canada and all the pages fell out and then he said he just signed a treaty with the European Union,’ Biden said. ‘And then he got on a plane and said the reason he was going home early from the G7 is because he had a major announcement the next day and the next day he put up a flagpole. Can you imagine?’ \n\nTrump had rushed home from the summit in Canada to deal with Israel and Iran warring. \n\n‘Where the f*** is Jake Tapper?’ Biden asked. ‘Where the f*** is George Clooney.’ \n\nCNN defended Tapper in a statement to the Daily Mail. \n\n‘Jake Tapper is one of the most influential political journalists of his time. His award-winning programs The Lead with Jake Tapper and State of the Union with Jake Tapper and Dana Bash reach broad global audiences across CNN, CNN International and HBO Max with significant digital extensions across CNN.com and social platforms,’ said spokesperson Dylan Rose Geerlings. ‘No single metric can capture the true reach and impact of a journalist driving the national conversation, but Jake’s work and his outsized influence speak for themselves.’\n\nThroughout the three-hour-long sit-down, Biden also slammed David Axelrod several times. \n\nAxelrod was former President Barack Obama’s longtime political adviser who suggested early in the 2024 cycle that Biden should consider dropping out and allowing the Democrats to have a primary instead. \n\n‘David Axelrod had one success in his political life and that was Barack Obama and that was because of Barack Obama not because of f***in’ David Axelrod.,’ Biden said. \n\nObama chose Joe Biden to be his running mate during the 2008 election cycle – but there have long been reports about there being rifts between the Obama and the Biden camps. \n\nThat was on full display during the interview, when Biden went after the Pod Save America podcasters too. \n\nHe mocked the group – made up of four former Obama aides – Jon Favreau, Jon Lovett, Dan Pfeiffer and Tommy Vietor.\n\nBiden called them ‘four white millionaires that are dining out on their association with him from 16 years ago, living in Beverly f***ing Hills, telling the rest of the world what black voters in South Carolina really want.’ \n\n‘The Anita Dunns of the world, who’s made 40, 50 million dollars off the Democratic party, they’re all gonna insert their judgment over a man who has figured out, unlike anybody else, how to get elected to the United States Senate over seven times,’ Biden added. \n\nDunn served in his father’s administration but also worked for Obama. \n\nBiden also mocked Rahm Emanuel, Obama’s former White House chief of staff, for having presidential ambitions. \n\n‘What a f***ing …,’ Biden said trailing off. ‘David Axelrod’s going to run his campaign for him,’ he said, rolling his eyes.","summary":"Internewscast Journal\n\nInternewscast\n\n\nHunter Biden remains quite upset with actor George Clooney, due to a&#8230;\n\n\nThis Post: Hunter Biden Criticizes George Clooney and Democrats Who Oppose Joe first appeared on Internewscast Journal","url":"https://internewscast.com/news/hunter-biden-criticizes-george-clooney-and-democrats-who-oppose-joe/","image":"https://internewscast.com/wp-content/uploads/2025/07/Hunter-Biden-unleashes-on-George-Clooney-and-Democrats-critical-of.jpg","video":null,"publish_date":"2025-07-22 00:07:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.057},{"id":343917924,"title":"Washington locals react to Trump wanting Commanders to switch back to Redskins (Video)","text":"Washingtonians reacting to Donald Trump's call for the Commanders to change their name back to Redskins are not putting much stock into the president's opinion on the matter. (AP Video: River Zhang).\n\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home","summary":"Washingtonians reacting to Donald Trump's call for the Commanders to change their name back to Redskins are not putting much stock into the president's opinion on the matter. (AP Video: River Zhang). #trump Subscribe: http://smarturl.it/AssociatedPress...\n\n\nThe post Washington locals react to Trump wanting Commanders to switch back to Redskins (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/07/21/washington-locals-react-to-trump-wanting-commanders-to-switch-back-to-redskins-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/07/22/maxresdefault.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1753144444","video":null,"publish_date":"2025-07-22 00:04:05","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":-0.485},{"id":343914534,"title":"Nationwide 'People's Sick Day' set to cripple US as protestors plot mass walkout","text":"Most individuals reserve their sick leave for unforeseen illnesses, caring for an unwell child, or undergoing medical procedures, without considering the possibility of using this time as a form of civil disobedience or protest against the government or their employer. Yet, a burgeoning group with increasing membership intends to do just that – they're borrowing tactics from other protestors to potentially disrupt what they perceive as systemic injustices afflicting the American working class . Dubbed \"The People's Sick Day,\" members of the group will call in sick in protest to criticise the 902 billionaires residing in the United States and hope to initiate an \"economic blackout.\" The organisers believe their element of surprise is a key advantage, as they won't reveal the dates far in advance but will instead give participants just 48 hours' notice before the three-day action begins. Karress Marie, a lead organiser of the People's Sick Day, highlighted the power in numbers. According to The Mirror , she said: \"There are 902 billionaires in the United States; there are 347 or 370 million Americans here, number one. So it's us against them. And if you talk about the people who are below the poverty line, that's 60% of us, so over 200 million of us against less than a quarter of that. Right? \"So I would say, first, check the numbers. Secondly, look at history. Look at history. History has shown us that it has worked.\" Marie has leveraged her extensive social media presence across various platforms and prior managerial expertise to unite a diverse group of disgruntled Americans. They view the withdrawal of their labour and purchasing power as the only means to counter not only the escalating economic disparity in the country, but also what many perceive as President Donald Trump's dismantling of democratic institutions, social safety nets and breaches of the U.S. Constitution. The coalition's list of demands is extensive and appears somewhat ambitious, considering the current political atmosphere, growing polarisation, and the historically sluggish pace at which the federal government legislates minor matters, let alone significant issues like healthcare, campaign finance reform, tax policy, and wage increases. Marie stressed that the three-day strike will involve no physical presence on the streets, ruling out any form of public demonstrations or protests. Instead, she is urging participants to simply stay at home and refrain from spending money. This strategy, she explained, is partly due to the current wave of Immigration and Customs Enforcement (ICE) raids across the nation and concerns that public gatherings could expose demonstrators to danger. Marie emphasisied: \"The demonstration is staying home, because of the safety concerns that we have right now, with the outrageous amount of budget that ICE has right now and the the the use of force against American citizens, with the U.S. military, even at a state level, we are asking people to do the absolute most, safest thing in the country, which is stay at home.\" Marie has voiced concerns that physical protests could inadvertently undermine her movement's goal of a three-day spending boycott. She even criticised direct actions like the \"No Kings Day\" demonstrations, arguing they were ineffective and inadvertently boosted the economy. \"Look at all that happened on No Kings Day. Close to 12 million people went outside, and what did they get? They got an Alligator Auschwitz,\" Marie remarked, referencing the controversial new immigration detention centre in Florida, which the Trump administration has nicknamed Alligator Alcatraz. \"What did they get after that? They went outside, they clapped and they cheered and they yelled and they made signs, and they even spent money into the economy. You went to lunch afterwards, you bought bottled water, you bought riot gear because you were scared you're going to get pepper-sprayed. You did all these things and spent all this money and spent all this time. And what did you get out of it? Not one demand was listed.\" Marie went on to say that the most concrete outcome they wished to witness was Trump being impeached and ousted from his position. Such a scenario would necessitate impeachment proceedings in the House of Representatives followed by a conviction during a Senate trial, requiring two-thirds, or 67 Senators, to vote in favour of his removal. The group's Discord server features a channel titled \"Why are you striking?\" where responses range from stagnant wages and assaults on women's and LGBTQ+ rights, to alleged breaches of the Constitution by the Trump administration. The common thread throughout the movement is a collective dissatisfaction with the current state of governance in the country and a sense that it no longer serves their interests. What stands out is that many of those voicing their grievances aren't all left-wing activists, or Marxists, or whatever Fox News seeks to portray progressives in this nation as. Republicans are being drawn into this movement, with even some Trump supporters joining, eager to reverse what they perceive as harm they've caused with their ballot choices over the past three elections. \"I'm striking because - after three elections of voting for the horrible orange creature - I finally woke up and saw how his policies are doing horrible damage to American workers, immigrants with or without documents, the people of Palestine, the LGBTQ+ community, and millions of other human beings,\" one participant wrote. \"I am striking because I think corporations and big companies are ruining our country. They only care about profit margins and not the workers and they violate the rights of u.s. citizens everyday,\" another user wrote. Only time will reveal whether The People's Sick Day will garner sufficient backing and involvement to create a meaningful impact on the U.S. economy, but from what I observe, their complaints are valid, and their fury justified. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","summary":"The People's Sick Day, an online movement, aims to address a laundry list of social and political issues by withholding their labour and buying power","url":"https://www.dailystar.co.uk/news/us-news/nationwide-peoples-sick-day-set-35594133","image":"https://i2-prod.dailystar.co.uk/article35594131.ece/ALTERNATES/s1200b/1_Peoples-sick-day-flyer-1.jpg","video":null,"publish_date":"2025-07-22 00:01:42","author":"Alexandra Snow,Anthony Orrico","authors":["Alexandra Snow","Anthony Orrico"],"language":"en","source_country":"gb","sentiment":-0.391},{"id":343911784,"title":"GOP to America: Forget the Epstein files, we’re on summer break","text":"House Republicans are still trying to bury the Epstein scandal, hopeful that Americans will simply forget about it during the chamber’s summer break.\n\nAccording to Politico, the GOP-controlled House will not take any votes on the Epstein files before the chamber begins its month-long recess in August.\n\nThe Epstein files have roiled President Donald Trump’s base for weeks, after the Trump administration claimed that there are no Epstein files to release—despite many of those same Republicans claiming Trump would make the files public if he were elected again. \n\nMany in Trump’s MAGA base are not buying that claim, demanding the release of the files and sending Trump into such a rage that he called his own supporters “weaklings” and declared that he no longer wants their support.\n\nThe Epstein files have caused a massive headache for GOP congressional leaders, who are caught between quelling dissent in their own ranks and appeasing Dear Leader.\n\nIn order to do that, House Republicans crafted a resolution last week that called for the release of the Epstein files but carried no legal weight to enforce it. It was Speaker Mike Johnson's effort to appease the White House and beat back a bipartisan bill that would have actually forced the release of the files.\n\nBut now, Johnson won't even put that toothless legislation up for a vote before the House skips town, a deal he apparently worked out with the White House—which is seeking the release of Epstein grand jury documents, even though legal experts say that those documents are not exhaustive.\n\nBut the move could backfire on both Johnson and Trump, as even some of the most loyal GOP lawmakers are unhappy with the cover-up of the files.\n\n\"Dangling bits of red meat no longer satisfies,\" GOP Rep. Marjorie Taylor Greene of Georgia wrote on X. \"They want the whole steak dinner and will accept nothing else.\"\n\nGreene signed on to the bipartisan legislation—crafted by Reps. Ro Khanna, Democrat of California, and Thomas Massie, Republican of Kentucky—which would legally compel the Trump administration to release the files. Khanna and Massie are using a discharge petition to get the bill to the floor, a process by which a House majority can force a piece of legislation to a vote even if the speaker objects.\n\nMeanwhile, as MAGA implodes over the Epstein files, more reports have surfaced showing just how close Trump and Epstein were.\n\nThe Wall Street Journal reported on a birthday message that Trump wrote to Epstein, complete with a drawing of a naked woman and a rather cryptic message.\n\n\"Happy Birthday—and may every day be another wonderful secret,” he wrote.\n\nThe New York Times also published an article Sunday showing that a former Epstein employee went to the FBI twice to detail troubling encounters between Trump and Epstein.\n\nAnd House Judiciary Committee Democrats said that FBI agents reviewing the Epstein files were told to flag any that referenced Trump.\n\nUnsurprisingly, Trump’s handling of the Epstein files is deeply unpopular with Americans.\n\nA Quinnipiac poll found that 63% of voters disapprove of Trump’s handling of the Epstein files, and an SSRS poll for CNN found that just 3% of Americans are satisfied with the amount of information released. \n\nSimilarly, a YouGov poll for The Economist found that 67% of Americans believe the Trump administration is covering up evidence relating to the Epstein case, including 59% of Trump’s own supporters.\n\n“Why not vote on the binding Massie-Khanna Epstein legislation this week [Speaker Johnson]?” Massie wrote on X on Monday. “We should not punt this until after the 5 week recess, nor should we wait for my discharge petition to ripen and collect the required signatures to force the vote.”","summary":"House Republicans are still trying to bury the Epstein scandal, hopeful that Americans will simply forget about it during the chamber’s summer break.\n\n\n\nAccording to Politico, the GOP-controlled House will not take any votes on the Epstein files before the chamber begins its month-long recess in August.\n\n\n\nThe Epstein files have roiled President Donald Trump’s base for weeks, after the Trump administration claimed that there are no Epstein files to release—despite many of those same Republicans claiming Trump would make the files public if he were elected again. \n\n\n\nMany in Trump’s MAGA base are not buying that claim, demanding the release of the files and sending Trump into such a rage that he called his own supporters “weaklings” and declared that he no longer wants their support.\n\n\n\n\nA cartoon by Clay Jones.\n\n\nThe Epstein files have caused a massive headache for GOP congressional leaders, who are caught between quelling dissent in their own ranks and appeasing Dear Leader.\n\n\n\nIn order to do that, House Rep","url":"https://www.dailykos.com/story/2025/7/21/2334484/-GOP-to-America-Forget-the-Epstein-files-we-re-on-summer-break?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1385425/story_image/AP25003751080120.jpg?1736267120","video":null,"publish_date":"2025-07-22 00:01:13","author":"Emily Singer","authors":["Emily Singer"],"language":"en","source_country":"US","sentiment":-0.374},{"id":343914684,"title":"Hunter Biden says Joe's use of Ambien fueled his disastrous Trump debate as he explains how to COOK crack in wild interview","text":"Hunter Biden blamed the sleep aid Ambien for his father's disastrous presidential debate performance, which became a turning point in the 2024 campaign. \n\nThe younger Biden sat down for a three-hour-long interview with YouTuber Andrew Callaghan, which was released Monday - the anniversary of former President Biden's decision to quit his reelection campaign and endorse his Vice President Kamala Harris. \n\nBiden also talked extensively about his own drug use in the sit-down, including how he learned how to make his own crack cocaine.\n\n'I know exactly what happened in that debate,' Biden said. 'He flew around the world. He's 81 years old. He's tired. They gave him Ambien to be able to sleep and he gets up on the stage and looks like a deer in the headlights.' \n\nThe then president blamed his lousy June 27, 2024 performance on a cold, though had spent several days at Camp David resting up ahead of the Atlanta showdown with now President Donald Trump. \n\nIt wasn't enough to quiet the calls for him to drop out. \n\nThe former first son remained bitter about what happened to his father, though told Callaghan he was able to remain sober the whole time. \n\nBiden said he was just over six years sober after spending about three years, after the 2015 death of his brother Beau, in the pits of addiction to alcohol and crack cocaine.\n\n'This is like a PSA - if you want to completely, utterly f*** up your life,' Biden said, crack cocaine would do the job. \n\n'The only difference between crack cocaine and cocaine is sodium bicarbonate and water and heat,' he explained. 'You can go to a your neighborhood convenience store and just get - anyway, I don't want to tell people how to make, how to make crack cocaine, but it literally is a mayonnaise jar of cocaine and baking soda.' \n\nBiden said the high is extremely intense on crack cocaine. \n\n'It's vastly, vastly different,' the recovering addict admitted. \n\n'I feel really reluctant to kind of have some euphoric discussion, I know you're not asking me to do that, have some euphoric discussion about crack cocaine,' he continued, with Callaghan saying that he was not. \n\n'I don't want to have the experience of some euphoric recall - that's how powerful crack cocaine is,' Biden admitted. \n\nThe former first son said that crack had a dirty reputation but 'it's the exact opposite.' \n\n'When you make crack, what you're doing is you're burning off all the impurities,' he explained. \n\nBiden said his addiction in earnest started in 2016, when he left an alcohol recovery program over a row with staff and found his former dealer 'Bicycles' in a downtown Washington, D.C. park who sold him crack. \n\n'Now there are periods where I would stop. I would try and get help or half try and get help or appease people in my life and say that I was getting help. And so I did a whole host of things to try and pull myself out of it. I did try,' he remembered. \n\n'And people would come in and out of my web and try and help me, and my level of toxicity would drag them down until they would disappear. And then people that would come into my life that were nothing but blood sucking leeches that would literally saw vulnerability and latch on and drain me literally of everything that I had, from emotional well-being to my physical well-being to my bank account and that was the ebb and flow for almost three years until I met Melissa,' he continued, referencing his wife Melissa Cohen. \n\nCohen and Biden had a whirlwind romance in 2019, marrying shortly after they met, with the South African filmmaker helping him get sober. \n\nPrior to that, Biden recalled a particularly scary moment when he was found in a hotel swimming pool floating face down. \n\n'Someone had given me something,' he recalled. 'And this person saved me and I woke up after about 12 hours where they just held me.' \n\n'My whole point of this story is that this person put themselves at an enormous risk,' he continued, explaining that if he had overdosed and died, the individual could have been blamed. \n\n'They saved my life for nothing other than to be human, because every single other person that was there, literally, they stole my shoes, they stole my clothes,' the former first son recalled. \n\nHe added that he thought it was hypocritical that Republicans have used his struggle with addiction to score political points when so many of them have been touched by it too. \n\n'I've gotten over the fact that [former Rep.] Matt Gaetz or Eric Trump is going to like use this story as another, you know, data point for like how f***ed up Hunter Biden is. But I don't give a s*** anymore,' Biden said.","summary":"Hunter Biden blamed the sleep aid Ambien for his father's disastrous presidential debate performance, which became a turning point in the 2024 campaign.","url":"https://www.dailymail.co.uk/news/article-14926567/hunter-biden-joe-biden-ambien-debate-crack.html","image":"https://i.dailymail.co.uk/1s/2025/07/22/00/100508661-0-image-m-10_1753139877572.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/07/21/8943455764409499954/1024x576_MP4_8943455764409499954.mp4","publish_date":"2025-07-22 00:00:40","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.342},{"id":343912316,"title":"Letterman supports Colbert with supercut of CBS slagging","text":"David Letterman let his work talk for him after CBS announced their decision to end the “Late Show.”\n\nCurrent “Late” host Stephen Colbert announced the end of the talk show institution last week, seeming entirely caught by surprise. Letterman helmed the series from 1993 until his retirement in 2015. He responded to the news on Monday, sharing a 20-minute supercut of bits taking potshots at the Tiffany Network.\n\n“You can’t spell CBS without B.S.,” he shared in the caption.\n\nLetterman’s fellow travelers of late-night have criticized the decision to wrap the series next May. Several of Colbert’s current rivals shared their shock after the announcement. NBC talk show host Jimmy Fallon called Colbert “one of the sharpest, funniest hosts to ever do it.” John Oliver, the host of HBO’s “Last Week Tonight,” called the news “incredibly sad.” No one was as direct as Jimmy Kimmel, who hosts ABC’s late night offering.\n\n“F**k you and all your Sheldons, CBS,” Kimmel wrote on Instagram.\n\nOther critics suggested that Colbert’s firing was politically motivated. CBS parent network Paramount settled a lawsuit out of court with President Donald Trump. The settlement comes as Paramount is seeking a massive merger.with Skydance Media. Colbert called the settlement “a big, fat bribe” on air just days before recieving the cancellation news. \n\n“As someone who has always been a proud employee of this network, I am offended,” he said. “And I don’t know if anything will ever repair my trust in this company — but just taking a stab at it, I’d say $16 million would help.”\n\nLetterman had a famously tense relationship with the C-suite of CBS. He sparred with Les Moonves from the moment the former CEO took the top position at the network and Moonves admitted that Letterman “hated” him.\n\n“He hated me when I walked in the door [at CBS]. He was there about a year before I got there. He just, generally speaking, didn’t like management,” Moonves told Vanity Fair in 2016, before sharing that Letterman mocked him on-air for six months after an early confrontation.\n\nMoonves resigned three years after Letterman, following multiple allegations of sexual harassment.\n\nWatch Letterman’s burn book-cum-clip show below","summary":"\"You can't spell CBS without B.S.\"","url":"https://www.salon.com/2025/07/21/letterman-backs-colbert-with-supercut-of-cbs-slagging/","image":"https://www.salon.com/app/uploads/2025/07/david-letterman-1146387970-150x150.jpg","video":null,"publish_date":"2025-07-22 00:00:29","author":"Alex Galbraith","authors":["Alex Galbraith"],"language":"en","category":"sports","source_country":"US","sentiment":0.06},{"id":343915110,"title":"Ishiba’s last stand? LDP in turmoil as Sanseito surge shakes Japan","text":"With his grasp on power slipping, Japan’s Prime Minister Shigeru Ishiba has vowed to remain in office despite a stinging electoral rebuke that plunged his ruling coalition into fresh turmoil.\nThe humiliating setback, confirmed late on Sunday, has fuelled doubts about Ishiba’s leadership as rivals within his Liberal Democratic Party (LDP) circle and stoked anxiety in the world’s fourth-largest economy, already reeling from rising prices, mounting security threats and the disruptive effects of US President Donald Trump’s aggressive tariff regime.\nIn a sombre appearance on public broadcaster NHK two hours after polls closed on Sunday, Ishiba “solemnly” conceded the “harsh result”. “It is a difficult situation that must be taken very humbly and seriously,” he said. Pressed on he intended to continue as Japan’s leader, he replied: “That’s right”.\nBut Ishiba’s leadership of the party and the country appears increasingly precarious. Signs of discontent have flared within the LDP since the vote, with former economic security minister Sanae Takaichi openly signalling her readiness to challenge the prime minister.\nAddressing supporters in Nara prefecture on Friday, Takaichi declared the party was “under scrutiny” and warned it might require drastic change to resurrect its fortunes.\n\n“I have made up my mind in my own way,” Jiji Press quoted her as saying. “I will once again firmly reset the party’s backbone. I promise to fight for that.”\nShe added that she had “tried to hold back” from criticism but hinted that her restraint was ending: a signal widely interpreted as intent to launch a leadership challenge.\n“Takaichi will definitely push for the leadership, whether that is a politically wise move at the moment or not,” Michael Cucek, a professor of Asian studies at Temple University’s Tokyo campus, told This Week in Asia.\n“She is a wild card and her ambition and willingness to use brinkmanship may force a leadership crisis in the party.”\nPressure on Ishiba is mounting from elsewhere too: party elder and former prime minister Taro Aso has also suggested the time may be ripe for change.\n\nStill, Ishiba retains leverage. With no leadership election scheduled for this year and no overt challenge likely before the Diet’s special session to confirm the election results later this week, he could yet stave off his critics.\nHe could even threaten to dissolve the lower house of parliament, Cucek said – a move few LDP lawmakers would countenance given the party’s fragile public standing.\nMeanwhile, the Trump administration is set to impose 25 per cent tariffs on all Japanese imports from August 1, further clouding the outlook. Ishiba’s chief negotiator, Ryosei Akazawa, left Tokyo on Monday for another round of talks in Washington.\nAny challenger would have to stand up to the US president, Cucek said. “No one wants to be seen to be kowtowing to Trump on tariffs, as there is no possibility of emerging with any dignity from that process,” he told This Week in Asia.\n\nFar-right resurgence\nAmong voters, the sense of crisis is palpable. “The LDP and Komeito have been the driving force in Japanese politics for decades and have never been in as difficult a position as this, other than when the former Democratic Party won the election in 2009,” said Yuichi Kujirai, a 32-year-old medical trainee in Tokyo.\nHe pointed to the surprise surge of the nationalist Sanseito party as evidence of a shifting political landscape: “We may be entering a new era”.\nAlarmed by Sanseito’s rise, Kujirai said he joined a crowd of “thousands” at one of the party’s campaign rallies in Tokyo before the election. “I was shocked,” he said. “It might sound like an exaggeration, but I felt in some danger.”\nDuring the event, he said party leader Sohei Kamiya vowed to “expose all civil servants with radical ideologies” and force their resignation. Other candidates reportedly called dissenters “traitors” and advocated for nuclear armament.\n\nKamiya later apologised for remarks that anti-racism groups condemned as inflammatory, after he told an audience, “They’re calling us stupid, foolish and Koreans,” to laughter from the crowd.\n“The atmosphere is becoming similar to how it was in Japan during World War II,” Kujirai warned. “I am worried that Japan is once again leaning towards militarism.”\nSanseito’s hardline messaging appears to have resonated with the public, however. The party secured 14 seats in the election – nearly triple what forecasts predicted just days before the vote – vaulting it to the third-largest opposition force in the Diet and complicating coalition arithmetic for the LDP and its junior partner Komeito.\n\nAnalysts say it is highly unlikely that Sanseito will enter into a formal alliance with the LDP. But its new-found strength may give it a disproportionate sway over Japan’s legislative future.\n“The LDP and Komeito need allies to get any bill passed … I think they will have to try a more formal partnership arrangement [now],” Cucek said, adding that Sanseito’s newly earned influence gave it the power to hold Ishiba’s government “to ransom”.","summary":"With his grasp on power slipping, Japan’s Prime Minister Shigeru Ishiba has vowed to remain in office despite a stinging electoral rebuke that plunged his ruling coalition into fresh turmoil.\nThe humiliating setback, confirmed late on Sunday, has fuelled doubts about Ishiba’s leadership as rivals within his Liberal Democratic Party (LDP) circle and stoked anxiety in the world’s fourth-largest economy, already reeling from rising prices, mounting security threats and the disruptive effects of US...","url":"https://www.scmp.com/week-asia/politics/article/3319039/ishibas-last-stand-japans-ldp-turmoil-sanseito-surge-erodes-pms-grip-power","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/07/21/1d596c89-02c7-4295-9fce-1f3da2e508dd_3e4739b9.jpg","video":null,"publish_date":"2025-07-22 00:00:12","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":-0.216},{"id":343921576,"title":"US Treasury's Bessent calls for review of Fed non-monetary policy operations - Reuters","text":"WASHINGTON, July 21 (Reuters) - U.S. Treasury Secretary Scott Bessent said the Federal Reserve's vital independence on monetary policy is threatened by its \"mandate creep\" into non-policy areas and he called on the U.S. central bank to conduct an exhaustive review of those operations.\n\nThe Fed's autonomy \"is threatened by persistent mandate creep into areas beyond its core mission, provoking justifiable criticism that unnecessarily casts a cloud over the Fed's valuable independence on monetary policy,\" Bessent said in a post on X.\n\nAdvertisement · Scroll to continue\n\nHe called Fed monetary policy \"a jewel box\" that should be walled off to preserve its independence, which he called a cornerstone of continued U.S. economic growth and stability.\n\nBessent said a review should be conducted into the Fed's decision to launch a massive renovation project of its headquarters at a time when it is posting operating losses. He did not say who should conduct that review, adding that he has \"no knowledge or opinion on the legal basis\" for the project.\n\nPresident Donald Trump has railed repeatedly against Fed Chair Jerome Powell and urged him to resign because of the central bank's reluctance to cut interest rates. In recent days Trump has also taken aim at the $2.5 billion renovation at the Fed's almost 100-year-old Washington headquarters, which has exceeded its budget, suggesting there could be fraud involved and that might be a reason to oust Powell.\n\nAdvertisement · Scroll to continue\n\nA recent Supreme Court opinion has solidified a long-standing interpretation of the law that the Fed chair cannot be fired over policy differences but only \"for cause.\"\n\nThe Fed's Board of Governors approved the renovation project, opens new tab in 2017, during Trump's first term, and received design approval from the National Capital Planning Commission in 2020 and 2021.\n\nSpeaking with CNBC earlier on Monday, Bessent declined to comment on a report that he had advised Trump not to fire Powell, saying it would be the president's decision.\n\n\"If this were the (Federal Aviation Administration) and we were having this many mistakes, we would go back and look at why. Why has this happened?\" said Bessent, whom Trump has mentioned as a possible candidate to replace Powell. \"All these PhDs over there, I don't know what they do.\"\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV598344 \nAbout ConnatixV598344 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nPowell last week responded to a Trump administration official's demands for information about cost overruns on the renovation project, saying it was large in scope and involved a number of safety upgrades and hazardous materials removals.\n\nBessent declined to be drawn on predictions that U.S. financial markets could crash if Powell was ousted.\n\nPowell's term as chair ends in May 2026, although he is due to stay on as a Fed governor through January 2028.\n\nBessent noted another governor seat will come open in January.\n\nReporting by Andrea Shalal and Susan Heavey\nEditing by Bernadette Baum, Chizu Nomiyama and Leslie Adler\n\nPurchase Licensing Rights","summary":"US Treasury's Bessent calls for review of Fed non-monetary policy operations  Reuters","url":"https://www.reuters.com/business/us-treasurys-bessent-calls-review-fed-non-monetary-policy-operations-2025-07-21/","image":"https://www.reuters.com/resizer/v2/J4LJB32P4RNAFBXEJBF3JPRUJE.jpg?auth=c2c71d6b0a631ba19d5041cba84a8f485e5185a46233418e589795846727c9b6&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-21 23:59:33","author":"Andrea Shalal,David Lawder","authors":["Andrea Shalal","David Lawder"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.135},{"id":343911956,"title":"Trump is stacking wins, voters reject Dems’ left turn and other commentary","text":"GOP watch: Trump Is Stacking Wins\n\nRepublican “hand-wringing” over President Trump’s performance, character and temperament is overdone, asserts Ingrid Jacques at USA Today.\n\nTrump’s “detractors on the right” need to take a deep breath and “consider what this president has accomplished.”\n\nHis “wins” surpass those of any “other Republican president in modern history.”\n\nDefunding the Corporation for Public Broadcasting tops the list, with Trump making clear there is no “First Amendment requirement for the government (taxpayers) to fund any specific outlet.”\n\nHe’s also dismantling the Department of Education, a “behemoth” that’s done “nothing to improve education in the country.”\n\nFinally, his judicial choices “sealed the court’s conservative majority for years to come,” making it foolish for anyone to say Trump’s been “bad news for the Republican Party.”\n\nFrom the right: Voters Reject Dems’ Left Turn\n\nA new I&I/TIPP poll shows “the Democratic Party’s attempt to ‘resist’ President Donald Trump is backfiring,” as “a plurality of American adults now believe the one-time party of the center has gone too far to the left,” reports Issues & Insights’ Terry Jones.\n\nThe poll found “more than one-in-five Democrats believe their party is too radical, sharply reducing the number of reliable votes for the party come election time.”\n\nAlso, “among Democrats, those who want to work with Trump (19%) plus those who want to work with him depending on the issue (37%) form a significant 56% majority, exceeding the still substantial share of the Dems who prefer to ‘resist’ Trump on all things (38%). So outright Trump rejectionism is a minority even within the Democratic Party.”\n\nAntisemitism beat: Resist Anti-Israel Hate\n\n“Silence” in the face of attacks on Israelis and surging antisemitism “has become all too familiar to American Jews” laments Yael Bar Tur at the City Journal.\n\nAnd antisemites have gone even further, speaking out to “accept or even condone violence against Jews, Zionists, and the people of Israel.”\n\nIndeed, for some New Yorkers, “anti-Israel sentiment has become a routine part of their social media feeds and conversations,” as they “dismiss” anti-Jewish attacks as part of “the cosmic struggle for justice.”\n\nYet others are unwilling to “normalize the Intifada.” Good: “New Yorkers shouldn’t be fooled by activists’ efforts to present the anti-Israel cause as mainstream.”\n\nNew Yorkers need to do what they do best: “Think for themselves and resist the pull of propaganda.”\n\nCulture critic: Stephen Colbert’s Big Mistake\n\nStephen Colbert’s “The Late Show won’t continue in any form,” cheers Joe Concha at the Washington Examiner.\n\nThe show often hosted liberal darlings like Elizabeth Warren, Bernie Sanders, Adam Schiff and Rachel Maddow. After its cancellation, many lefties “immediately cried foul and pointed the finger at Trump.”\n\n“Here’s the actual story: The Late Show lost $40 million last year,” and “Colbert’s show is, by far, the most expensive to produce at CBS.”\n\nHe was able to ride the wave of Trump-hating to gain ratings success during the first term.\n\n“But as Colbert found out by napalming Letterman’s legacy at CBS, making Trump the sole focus while inviting (tedious) Democrats on as featured guests was a recipe for disaster.”\n\n“The only question is . . . who will be the next to fall?” “Here’s looking at you, Jimmy Kimmel.”\n\nMideast desk: Israeli Hack Attack\n\n“The 12-day war between Israel and Iran featured an unprecedented cyber campaign against the Islamic Republic’s financial system,” observe Michael Doran and Zineb Riboua at The Wall Street Journal.\n\n“Predatory Sparrow, a hacker group linked to the Israeli government, claimed credit for erasing Bank Sepah’s banking data and rendering its systems inoperable.”\n\n“As panic spread, a run on all banks ensued.”\n\nTehran’s stock market crashed, and Iran’s private currency exchange was shut down.\n\n“Israel’s success offers the Trump administration new tools for confronting the Iranian threat.”: Use economic sanctions and shift US cyber policy “from passive support to active partnership in offensive operations.”\n\n“The more Washington and Jerusalem operate together in combat, the stronger their alliance grows.”\n\n— Compiled by The Post Editorial Board","summary":"Republican “hand-wringing” over President Trump’s performance, character and temperament is overdone, asserts Ingrid Jacques at USA Today.","url":"https://nypost.com/2025/07/21/opinion/trump-is-stacking-wins-voters-reject-dems-left-turn-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-jh1yjzqru-1753135318451.jpg?quality=75&strip=all&1753121619&w=1200","video":null,"publish_date":"2025-07-21 23:57:35","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.252},{"id":343921584,"title":"Trump releases Martin Luther King assassination files - Reuters","text":"SummaryTrump signed order in January to release filesMLK was killed in 1968Files include records from FBI, which had sought to discredit King\n\nWASHINGTON, July 21 (Reuters) - The U.S. Justice Department on Monday released more than 240,000 pages of documents related to the assassination of Martin Luther King Jr., including records from the FBI, which had surveilled the civil rights leader as part of an effort to discredit the Nobel Peace Prize winner and his civil rights movement.\n\nFiles were posted, opens new tab on the website of the National Archives, which said more would be released.\n\nAdvertisement · Scroll to continue\n\nKing died of an assassin's bullet in Memphis, Tennessee, on April 4, 1968, as he increasingly extended his attention from a nonviolent campaign for equal rights for African Americans to economic issues and calls for peace. His death shook the United States in a year that would also bring race riots, anti-Vietnam war demonstrations and the assassination of presidential candidate Robert F. Kennedy.\n\nEarlier this year, President Donald Trump's administration released thousands of pages of digital documents related to the assassinations of Robert Kennedy and former President John F. Kennedy, who was killed in 1963.\n\nAdvertisement · Scroll to continue\n\nTrump promised on the campaign trail to provide more transparency about Kennedy's death. Upon taking office, he also ordered aides to present a plan for the release of records relating to the assassinations of Robert Kennedy and King.\n\nThe FBI kept files on King in the 1950s and 1960s - even wiretapping his phones - because of what the bureau falsely said at the time were his suspected ties to communism during the Cold War between the U.S. and Soviet Union. In recent years, the FBI has acknowledged that as an example of \"abuse and overreach\" in its history.\n\nThe civil rights leader's family asked those who engage with the files to \"do so with empathy, restraint, and respect for our family's continuing grief,\" and condemned \"any attempts to misuse these documents.\"\n\n\"Now more than ever, we must honor his sacrifice by committing ourselves to the realization of his dream – a society rooted in compassion, unity, and equality,\" they said in a statement.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV598344 \nAbout ConnatixV598344 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\n\"During our father's lifetime, he was relentlessly targeted by an invasive, predatory, and deeply disturbing disinformation and surveillance campaign orchestrated by J. Edgar Hoover through the Federal Bureau of Investigation,\" the family, including his two living children, Martin III, 67, and Bernice, 62, said, referring to the then-FBI director.\n\nJames Earl Ray, a segregationist and drifter, confessed to killing King but later recanted. He died in prison in 1998.\n\nKing's family said it had filed a wrongful death civil lawsuit in Tennessee in 1999 that led to a jury unanimously concluding \"that our father was the victim of a conspiracy involving Loyd Jowers and unnamed co-conspirators, including government agencies as a part of a wider scheme. The verdict also affirmed that someone other than James Earl Ray was the shooter, and that Mr. Ray was set up to take the blame. Our family views that verdict as an affirmation of our long-held beliefs.\"\n\nJowers, once a Memphis police officer, told ABC's Prime Time Live in 1993 that he participated in a plot to kill King. A 2023 Justice Department report, opens new tab called his claims dubious.\n\nReporting by Kanishka Singh in Washington; additional reporting by Brad Brooks and Bianca Flowers; Editing by Donna Bryson and Stephen Coates\n\nPurchase Licensing Rights\n\nKanishka SinghThomson ReutersKanishka Singh is a breaking news reporter for Reuters in Washington DC, who primarily covers US politics and national affairs in his current role. His past breaking news coverage has spanned across a range of topics like the Black Lives Matter movement; the US elections; the 2021 Capitol riots and their follow up probes; the Brexit deal; US-China trade tensions; the NATO withdrawal from Afghanistan; the COVID-19 pandemic; and a 2019 Supreme Court verdict on a religious dispute site in his native India.","summary":"Trump releases Martin Luther King assassination files  Reuters","url":"https://www.reuters.com/world/us/trump-releases-martin-luther-king-assassination-files-2025-07-21/","image":"https://www.reuters.com/resizer/v2/QALWXCSCKVNUTEJ5T3VYTLYORU.jpg?auth=1dc729757f4921dd5a84e99323797b3f900566bc3d9a1e3da8454f1dc699d9a4&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-07-21 23:55:13","author":"Kanishka Singh","authors":["Kanishka Singh"],"language":"en","source_country":"gb","sentiment":-0.188}]}