{"offset":0,"number":50,"available":16717,"news":[{"id":308114392,"title":"Trump and Netanyahu to meet again on Gaza, tariffs and more","text":"Palm Beach Gardens: President Donald Trump plans to meet with Israeli Prime Minister Benjamin Netanyahu on Monday in what would be their second White House sit-down since Trump's return to office. The visit, confirmed by a White House official and Netanyahu's office Saturday, comes as Israel deploys troops in a new security corridor across Gaza to pressure the Hamas militant group. Netanyahu's defense minister has said Israel will seize large areas of the territory and add them to its so-called security zones. Last month, Israel shattered the ceasefire with a surprise bombardment in Gaza after trying to pressure Hamas to accept proposed new terms for the ceasefire, a move supported by the White House. Hundreds of Palestinians have since been killed. Israel has pledged to escalate the war in Gaza until Hamas returns the remaining hostages seized in the Oct. 7, 2023, attack that sparked the war, disarms and leaves the territory. Israel also has halted all supplies of food, fuel and humanitarian aid into Gaza. Netanyahu's office in a statement on social media said he and Trump would discuss “the tariff issue , the efforts to return our hostages, Israel-Turkey relations, the Iranian threat and the battle against the International Criminal Court.” Israel faces a 17% tariff. Netanyahu is wanted by the court for alleged crimes against humanity in Gaza. The U.S. is not a member of the court. In February, Netanyahu became the first foreign leader invited to the White House during Trump's second term. Their meeting focused on Israel’s war with Hamas and the next steps as a ceasefire deal took hold. At a joint news conference afterward, Trump made the surprise proposal that displaced Palestinians in Gaza be permanently resettled outside the territory and the United States take “ownership” in redeveloping the area into “the Riviera of the Middle East.” Palestinians objected to leaving their homeland, and Arab nations and rights groups sharply criticized the idea. That February meeting gave Netanyahu a chance to remind the world of the Trump administration’s support for Israel, defend the conduct of the war and distract from political pressures back home. Those pressures have only grown as Israelis protest both the lack of a deal to bring remaining hostages home from Gaza and Netanyahu’s moves to fire the head of the country’s domestic security agency and its attorney general. He also faces calls to accept responsibility for his role in failing to prevent the Oct. 7. attack. In a statement Saturday, relatives of hostages held in Gaza pleaded with Trump to “please use all your power to pressure Netanyahu to end this war and bring our hostages back now.” “We are addressing President Trump: Netanyahu is lying when he says that military pressure will bring back the abductees. The only way to quickly return all the abductees is to end the war and return them all in one fell swoop,” Ifat Calderon, aunt of hostage Ofer Calderon, said in Tel Aviv, Israel. Hamas says it will only release the remaining 59 hostages — 24 of whom are believed to be alive — in exchange for the release of more Palestinian prisoners, a lasting ceasefire and an Israeli pullout from Gaza. The Oct. 7 attack on southern Israel killed about 1,200 people, mostly civilians. Some 251 hostages were taken, most of them since released in ceasefire agreements and other deals. More than 50,000 Palestinians have been killed in Gaza as part of Israel’s offensive, according to Gaza’s Health Ministry, which doesn’t say whether those killed are civilians or combatants. Israel says it has killed around 20,000 militants, without providing evidence. Meanwhile, police arrested two of Netanyahu's close associates this week on suspicion of accepting money from Qatar to promote a positive image of the Gulf Arab state in Israel. Qatar is a key mediator for Hamas in its negotiations with Israel but denies backing the militant group. Netanyahu says the case is baseless. The prime minister is also the subject of a long-running corruption trial and regularly rails against a “deep state” that he alleges is out to get him. Trump says the first foreign trip of his second administration will include stops in Saudi Arabia, Qatar and possibly the United Arab Emirates, and “other places.” The trip could come as soon as May. Trump has said he wants to reward Saudi Arabia for its investment in the U.S. and that all three Gulf countries would be making commitments to creating jobs in the U.S. during his trip.","summary":"The visit comes as Israel deploys troops in a new security corridor across Gaza to pressure the Hamas militant group","url":"https://www.deccanchronicle.com/world/trump-and-netanyahu-to-meet-again-on-gaza-tariffs-and-more-1871216","image":"https://www.deccanchronicle.com/h-upload/2025/04/06/1905073-aa-4377734.webp","video":null,"publish_date":"2025-04-06 01:13:15","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.104},{"id":308113436,"title":"Photos: Protesters tee off against Trump and Musk at ‘Hands Off!’ rallies","text":"Hundreds of thousands of demonstrators rallied Saturday against President Donald Trump and billionaire Elon Musk at sites across the United States. At more than 1,200 “Hands Off!” demonstrations — in both blue and red states — protesters criticized the administration’s actions on government downsizing, the economy, human rights and other issues.\nMajor rallies were held throughout the Bay Area, at Sacramento’s capitol grounds, in Southern California, at the National Mall in Washington, D.C., in New York City and Boston and other locations. In Florida, people rallied near a golf course where Trump spent the morning.\nAsked about the demonstrations, the White House said in a statement that Trump will always protect Social Security, Medicare and Medicaid.\nRead more here.\nA demonstrator dressed as the Statue of Liberty participates in the “Hands Off!” protests against President Donald Trump at the Washington Monument in Washington, Saturday, April 5, 2025. (AP Photo/Jose Luis Magana) \nDemonstrators hold up signs during the nationwide “Hands Off” protest against US President Donald Trump and his advisor, Tesla CEO Elon Musk, at the Colorado Capital in Denver, Colorado on April 5, 2025. Protesters flooded the streets of several major US cities on Saturday to oppose the divisive policies of President Donald Trump, in the largest demonstrations since his return to the White, House. Opponents of the Republican president’s policies — from government staffing cuts to trade tariffs and eroding civil liberties — rallied in Washington, New York, Houston, Los Angeles and Florida, among other locations. (Photo by Jason Connolly / AFP) (Photo by JASON CONNOLLY/AFP via Getty Images) \nA demonstrator hold a U.S. flag during a “Hands Off!” protest against President Donald Trump on Saturday, April 5, 2025, in New York. (AP Photo/Andres Kudacki) \nProtesters hold signs and flags and a large balloon with an image of US President Donald Trump during the nationwide “Hands Off!” protest against Trump and his advisor, Tesla CEO Elon Musk, in downtown Los Angeles on April 5, 2025. Protesters flooded the streets of several major US cities on Saturday to oppose the divisive policies of President Donald Trump, in the largest demonstrations since his return to the White House. Opponents of the Republican president’s policies — from government staffing cuts to trade tariffs and eroding civil liberties — rallied in Washington, New York, Houston, Los Angeles and Florida, among other locations. (Photo by Etienne LAURENT / AFP) (Photo by ETIENNE LAURENT/AFP via Getty Images) \nChristine Mahon waves at passing cars with other protestors lining Dodge Street during a demonstration against President Trump’s administration in Omaha, Neb., on Saturday, April 5, 2025, as part of the nationwide “Hands Off!” protest. (Megan Nielsen/Omaha World-Herald via AP) \nA demonstrator dressed as the Statue of Liberty participates in the “Hands Off!” protests against President Donald Trump at the Washington Monument in Washington, Saturday, April 5, 2025. (AP Photo/Jose Luis Magana)","summary":"More than 1,200 demonstrations held across the United States","url":"https://www.mercurynews.com/2025/04/05/photos-protesters-tee-off-against-trump-and-musk-at-hands-off-rallies/","image":"https://www.mercurynews.com/wp-content/uploads/2025/04/GettyImages-2208153098.jpg?w=1024&h=683","video":null,"publish_date":"2025-04-06 01:07:46","author":"Nhat V. Meyer","authors":["Nhat V. Meyer"],"language":"en","category":"politics","source_country":"us","sentiment":0.365},{"id":308115018,"title":"San Diego aircraft carrier USS Carl Vinson making good time en route to Middle East","text":"The San Diego-based aircraft carrier USS Carl Vinson appears to be making good time traveling from the Indo-Pacific to the Middle East. The U.S. Naval Institute says the flat-top sailed through the Malacca Strait between Indonesia and Malaysia on Friday accompanied by its escort ships.\n\nThe nuclear-powered Vinson will soon pass beneath the lower tip of India and head for the Red Sea, where another American carrier, the USS Harry S. Truman, is operating.\n\nOn March 21, President Donald Trump ordered the Vinson to join the Truman in the Middle East so that they can suppress the missile and drone attacks that Yemen-based Houthis have been launching against commercial shipping, the AP and USNI reported.\n\nThe Vinson left San Diego for the Indo-Pacific in mid-November and completed various naval exercises with Japan and Korea before being diverted to the Red Sea area.","summary":"The nuclear-powered Vinson will soon pass beneath the lower tip of India and head for the Red Sea","url":"https://www.sandiegouniontribune.com/2025/04/05/san-diego-aircraft-carrier-uss-carl-vinson-making-good-time-en-route-to-middle-east/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/04/sut-l-carl-vinson-009_76978e.jpg?w=1024&h=682","video":null,"publish_date":"2025-04-06 00:55:21","author":"Gary Robbins","authors":["Gary Robbins"],"language":"en","source_country":"US","sentiment":-0.135},{"id":308112042,"title":"U.S. Naval Academy library lists 381 ‘DEI’ books removed","text":"April 5 (UPI) -- The U.S. Naval Academy removed 381 books from its library shelves in response to President Donald Trump's executive order banning diversity, equity and inclusion materials and policies in federal facilities.\n\nDefense Secretary Pete Hegseth last week ordered the Naval Academy to review its titles listings and remove books that promote DEI, U.S. officials told the Navy Times.\n\nAcademy officials identified nearly 900 books for review and afterward compiled a llst of 381 books that it removed\n\nAmong the titles removed are, \"How to be an antiracist\" by Ibram X. Kendi, \"Uncomfortable conversations with a black man\" by Emmanuel Acho and \"Why didn't we riot?: a Black man in Trumpland\" by Issac J. Bailey.\n\nThe Naval Academy removed the 381 books on Monday in advance of a visit that Hegseth made on Tuesday.\n\nHegseth's order required the Defense Department to remove all \"new articles, photos and videos promoting diversity, equity and inclusion, including content related to critical race theory, gender ideology and identity-based programs,\" Military.com reported.\n\nTrump's executive order against DEI in the federal government did not apply to the U.S. military academies, but Hegseth ordered them to comply with the order following new reports saying DEI books remained on military academies' library shelves.\n\nIn addition to removing books from the Naval Academy library, school officials also removed historic items honoring Jewish female academy graduates from the Commodore Uriah P. Levy Center and Jewish Chapel.\n\nTheir removal was a mistake, and \"Naval Academy leadership is immediately taking steps to review and correct the unauthorized removal,\" Comdr. Ashley Hockycko said.\n\nOther books and materials were removed by the U.S. Military Academy at West Point, the Air Force Academy in Colorado Springs and the Naval Academy in Annapolis, Md.\n\nAmong those removed were books and materials discussing women who served during the Civil War, website discussions of Kristin Griest, who was the first woman to complete the Army's Ranger School, and lessons discussing the Tuskegee Airmen's and Women's Airforce Service Pilots' services duringWorld War II.\n\nSome of the removed items and online content have been returned.","summary":"The U.S. Naval Academy removed 381 books from its library shelves in response to President Donald Trump's executive order banning diversity, equity and inclusion materials and policies in federal facilities.","url":"https://www.upi.com/Top_News/US/2025/04/05/naval-academny-books-removed-list/6551743899743/","image":"https://cdnph.upi.com/ph/st/th/6551743899743/2025/upi_com/cb947d150f5a5d9dacf0330a67506fa0/v1.2/US-Naval-Academy-library-lists-381-DEI-books-removed.jpg","video":null,"publish_date":"2025-04-06 00:48:55","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"US","sentiment":-0.289},{"id":308114192,"title":"Trump Begins Tariff Negotiations with Vietnam, India, and Israel","text":"TEMPO.CO, Jakarta - The President of the United States, Donald Trump conducted discussions with representatives from Vietnam, India, and Israel regarding new tariffs imposed on imported goods.As reported by Firstpost on Saturday, April 5, 2025, Trump is in communication with representatives from these three countries to negotiate bilateral trade deals that could alleviate tariff burdens before the upcoming deadline next week.US Secretary of State Marco Rubio discussed the new import tariffs with Israeli Prime Minister Benjamin Netanyahu, according to Reuters, citing the reading from their meeting at the Department of State. Despite being close allies, Trump imposed a 17 percent tariff on Israeli products.The Times of Israel reported that Israeli Prime Minister Netanyahu is set to visit the United States, citing an announcement from Trump. If the visit materializes on Monday, April 7, 2025, one of the main agenda items is expected to be the Trump administration's 17 percent tariffs on Israeli goods.On Friday, Vietnam, which was hit with a 46 percent tariff, announced that they would reduce tariffs on US goods to zero. Trump disclosed this announcement on his social media platform, Truth Social.\"Just had a very productive call with To Lam, General Secretary of the Communist Party of Vietnam. He told me that Vietnam wants to cut their Tariffs back to ZERO if they make a deal with the US. I thanked him on behalf of our Country, and told him I look forward to meeting in the near future,\" Trump said in a post.Vietnam - the US's largest trading partner in Southeast Asia and a major manufacturing hub - was hit with a 46 percent duty as part of Trump's broader trade policy. Although earlier statements indicated that the tariffs were non-negotiable, recent discussions suggest otherwise.Trump also commented that despite his friendship with Indian Prime Minister Narendra Modi, India imposes a 52 percent tariff on American goods. \"We have charged them almost nothing for years,\" Trump said. The US currently imposes a 27 percent tariff on India.Discussions between Trump and these nations only concern a small portion of those affected by his tariff measures. In particular, this is seen as the first phase of broader discussions as the countries consider their responses.On Wednesday, President Trump signed an executive order setting a baseline tariff of 10 percent on all imports to the United States starting April 5, 2025.Meanwhile, higher and reciprocal tariffs on countries with the largest trade deficits with the US will take effect on April 9, 2025.Several countries have expressed their intention to retaliate against the tariff hikes.For example, China announced it will impose a 34 percent tariff on all imports from the United States starting April 10, 2025.As a result of the situation, the US stock market plummeted, losing a value of $6.6 trillion in two days of trading - the largest drop in the history of the country's stock market.While some officials argue that the tariffs are an intentional effort by the president to disrupt the global trade pattern, Trump told reporters on Thursday that he believes the tariffs strengthen his ability to negotiate trade deals with other world leaders.\"Every country is calling us. That's the beauty of what we're doing - we're in the driver's seat. Tariffs give us a great strength for negotiation. They always do,\" Trump said.Editor's Choice: Prabowo Discusses U.S. Tariff Policy with Several ASEAN LeadersClick here to get the latest news updates from Tempo on Google News","summary":"President of the United States Donald Trump held discussions with representatives from Vietnam, India, and Israel regarding new import tariffs","url":"https://en.tempo.co/read/1993824/trump-begins-tariff-negotiations-with-vietnam-india-and-israel","image":"https://statik.tempo.co/data/2025/04/05/id_1389570/1389570_720.jpg","video":null,"publish_date":"2025-04-06 00:47:24","author":"Sita Planasari","authors":["Sita Planasari"],"language":"en","category":"politics","source_country":"id","sentiment":-0.034},{"id":308111124,"title":"Andy Roddick’s wife Brooklyn Decker slams North Carolina court for ruling in favor of Republican Jefferson Griffin's challenge","text":"Andy Roddick's wife and actress Brooklyn Decker spoke up about a court decision that could possibly reverse a pivotal judicial election in North Carolina. Decker was outraged at an appellate court decision that benefited Republican challenger Jefferson Griffin's complaint against more than 65,000 ballots, describing it as a dangerous precedent that endangers democracy.The row is a result of the extremely close 2024 North Carolina Supreme Court election, where Democratic incumbent Justice Allison Riggs took Griffin by only 734 votes. When the recounts confirmed Riggs' margin, Griffin challenged the validity of tens of thousands of ballots on the grounds that they lacked complete voter identification information.The North Carolina State Board of Elections, which has a majority of Democrats, dismissed his complaint, saying the voters were acting in good faith and complied with the law. But Griffin fought the case through the courts, and it resulted in a recent appellate court decision that can potentially change the outcome in his favor.According to reports on April 4, 2025, a three-judge panel of the North Carolina Court of Appeals issued a 2-1 ruling supporting Griffin's allegations. Judges John Tyson and Fred Gore held that ballots without proper ID information—such as driver's license or Social Security numbers—should not have been counted. The court directed that impacted voters be allowed 15 business days to update their registration records, or their votes would be discarded.Democratic Judge Toby Hampson was the lone dissenter, cautioning that this kind of ruling could disenfranchise thousands and undermine public trust in the electoral system. In the event a large number of ballots are discarded, Griffin may unseat Riggs, something that has evoked fierce criticism from civil rights activists and political commentators alike.Brooklyn Decker didn't hold back in reaction to the decision. Posting the breaking news headline in her Instagram stories, she captioned:\"This is WILD. Allison Riggs won this election. Her Republican opponent and the state Supreme Court Republican majority threw out votes to steal the election from her. It will likely go to the US Supreme Court. We should all be very worried about this precedent.\"Screengrab of Andy Roddick's wife Brooklyn Decker's Instagram stories (@brooklyndecker)Andy Roddick’s wife Brooklyn Decker slammed Donald Trump’s plastic straw pushIn Picture: Andy Roddick's wife Brooklyn Decker during the \"Fire Drill Friday\" Climate Change Protest (Source: Getty)Andy Roddick's wife Brooklyn Decker expressed her frustration with President Donald Trump for bringing back plastic straws over paper ones. In February 2025, Trump signed an executive order reversing a Biden-era policy that aimed to phase out federal purchases of plastic straws, cutlery, and packaging.\"We’re going back to plastic straws, These things don't work, I've had them many times, and on occasion, they break, they explode. If something's hot, they don't last very long, like a matter of minutes, sometimes a matter of seconds. It's a ridiculous situation,\" Trump said in a statement.Decker responded to the executive order in an Instagram story, writing:\"This is so f*cking stupid,\" Andy Roddick's wife wrote.In other news, Brooklyn Decker raised red flag after the U.S. aligned with Russia in a controversial UN vote on Ukraine.","summary":"Andy Roddick&#039;s wife and actress Brooklyn Decker spoke up about a court decision that could possibly reverse a pivotal judicial election in North Carolina.","url":"https://www.sportskeeda.com/tennis/news-andy-roddick-s-wife-brooklyn-decker-slams-north-carolina-court-ruling-favor-republican-jefferson-griffin-s-challenge","image":"https://staticg.sportskeeda.com/editor/2025/04/b8fed-17438948589318-1920.jpg","video":null,"publish_date":"2025-04-06 00:41:02","author":"S Shahi","authors":["S Shahi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.273},{"id":308112272,"title":"Anti-Trump rally draws thousands to downtown Denver","text":"Thousands massed around the steps of the Colorado Capitol and took to the streets of downtown Denver on Saturday to protest the Trump administration’s wide-ranging funding cuts and executive actions.\n\nThe first months of President Donald Trump’s second term have seen his administration — including the newly formed Department of Government Efficiency, led by Tesla CEO Elon Musk — attempt to freeze trillions of dollars of federal grants and cut tens of thousands of government jobs.\n\nThe U.S. Department of Veterans Affairs is among the agencies targeted for cuts, facing a reorganization that would include the loss of 80,000 positions, according to The Associated Press.\n\nShaunice Coleman of Denver, who joined demonstrators Saturday, described her own struggles as a Navy veteran trying to access mental health resources and other help after losing her job as a pharmacy technician.\n\nShe said she was particularly concerned about the direct and indirect impact of cuts on the VA’s health care professionals.\n\n“The veterans are not getting the support and the care that they need, because the workers are burnt out,” she said. “I’ve always wanted to use my voice. I just never knew how.”\n\nAlong with spending cuts, the president has signed more than 100 executive orders since returning to office Jan. 20, including directives to curtail birthright citizenship, assert executive control over regulatory agencies, dismantle other federal agencies and overhaul the election process.\n\nTrump’s administration has defended the cuts and executive actions as necessary to conserve taxpayer money and fulfill election promises, while opponents have accused the president of an ongoing, undemocratic power grab benefitting himself and his associates.\n\nThe idea that Trump and Musk pose a threat to American democracy was reflected in the signs held by protesters, many of which ridiculed the two and compared them to fascist political figures, and in the statements made by speakers.\n\nColorado Attorney General Phil Weiser described the state’s efforts to fight Trump’s executive orders in court and said the size of Saturday’s crowd was proof that opponents of the administration “will not be intimidated.”\n\n“Just like fear is contagious, so is hope,” Weiser said. “What we need to recognize is (that) the rule of law, the Constitution, they are in the balance.”\n\nJessie Danielson, a Democratic state senator representing Lakewood and the west side of the Denver area, also denounced Trump’s public lambasting of judges who have blocked some of his policies.\n\n“They are threatening judges to give them cover for corrupt and illegal actions that defy our laws and our Constitution,” Danielson said. “Using fear and extortion, Trump and Musk attack, every day, the very ideas of free press, free speech and freedom of thought.”\n\nProtesters marched through downtown Denver after the conclusion of the speeches. During the speeches, some protesters, flanked by members of the Party for Socialism and Liberation, also began marching west on Colfax Avenue, blocking traffic and chanting in opposition to Trump and U.S. military aid to Israel.\n\nGraham Ottley, joined by his wife and two young children, said his family took part in the protest and march in part because of the federal government’s policies on immigration, which have impacted the nonprofits he and his wife work with. He said they also wanted to show their children what it means to be active participants in a democracy.\n\n“We want them … just to be active and engaged with what’s going on in our political system, and to feel like they have a voice, and that they matter as citizens in our country,” he said. “We’re excited to just exercise our rights.”\n\nLabor unions and activist groups also set up booths around the Capitol steps during the event, which was scheduled to last until 4 p.m.\n\nSaturday’s protest was organized by the Colorado 50501 Chapter, Move On, Colorado Indivisible, Solidarity Warriors, Political Revolution and Common Ground People’s Collective, and it coincided with similar “Hands Off!” protests that the chapter said in a news release were taking place in all 50 states and in Europe.\n\nProtests were also scheduled in Boulder, Colorado Springs, Fort Collins, Greeley, Pueblo and other Colorado cities, according to the Colorado 50501 Chapter.\n\nStay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"A crowd of thousands heard speeches and marched through downtown Denver on Saturday to protest the actions of the Trump administration.","url":"https://www.denverpost.com/2025/04/05/anti-trump-rally-march-downtown-denver/","image":"https://www.denverpost.com/wp-content/uploads/2025/04/TDP-L-TRUMP-PROTEST_DSC4462.jpg?w=1024&h=751","video":null,"publish_date":"2025-04-06 00:23:44","author":"Max Levy","authors":["Max Levy"],"language":"en","source_country":"US","sentiment":-0.427},{"id":308112116,"title":"Mark Cuban weighs in on transgender athletes in women's sports: 'People just aren't ready'","text":"Dallas Mavericks minority owner and \"Shark Tank\" host Mark Cuban gave his take on transgender athletes in women's sports this week. During an interview on \"The Stephen A. Smith Show\" Friday, Cuban suggested trans inclusion should not be \"pushed down people's throats.\" \"To make it a national issue so that if you weren’t supporting the fewer than 10 trans athletes in the NCAA, then you weren’t a good person. People just aren’t ready for that yet. You've got to meet people where they are,\" Cuban said. \"It takes time, you can’t just force it down people’s throats.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Cuban also suggested people affected by transgender inclusion policies in sports should not be used in political campaigns. \"Instead of trying to get where the people who are being disadvantaged and being discriminated against are helped, they wanted to make it a campaign issue,\" Cuban said. \"Focus on helping the people, not using them to campaign.\" A national exit poll conducted by the Concerned Women for America legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. WHO IS STEPHANIE TURNER? WOMEN'S FENCER WHO KNELT TO PROTEST TRANS OPPONENT AND IGNITED GLOBAL AWARENESS Additionally, 6% said it was the most important issue of all, while 44% said it was \"very important.\" Cuban also suggested he supports women athletes who choose not to compete against transgender competitors, saying the decision of whether to compete against trans athletes should be left up to the athletes themselves. \"My attitude is if there’s a trans athlete, no matter what side, you let the opponent — whether it’s an individual sport or a team sport — you let them decide if they want to compete against them or not,\" Cuban said. CLICK HERE TO GET THE FOX NEWS APP Cuban, a staunch supporter of former President Joe Biden and former Vice President Kamala Harris and an impassioned critic of President Donald Trump, is one of the many prominent left-wing figures who have spoken out against the Democratic Party's stance on trans athlete inclusion. Smith has repeatedly called out the Democratic Party for its stance on trans athletes, suggesting it played heavily into its defeat in the November election. HBO host Bill Maher has also criticized Democratic support for trans inclusion in women's sports. Even Democratic lawmakers like Rep. Seth Moulton, D-Mass, and former Montana Sen. Jon Tester have spoken out against the party's current stance. A New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people who participated, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said that transgender athletes should not be allowed to compete against women. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Dallas Mavericks minority owner Mark Cuban gave his take on the issue of trans athletes in women&apos;s sports in an interview on &quot;The Stephen A. Smith Show.&quot;","url":"https://www.foxnews.com/sports/mark-cuban-weighs-trans-athletes-womens-sports-people-just-arent-ready","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/mark-cuban-campaigning.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-06 00:23:07","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.166},{"id":308110018,"title":"World News | Taiwan President Meets ICT Industry Representatives Amid US Tariff Concerns","text":"Taipei [Taiwan], April 6 (ANI): Taiwanese President Lai Ching-te on Saturday held a meeting with representatives from the information and communications technology (ICT) sector, which is set to face significant tariffs on exports to the United States, according to a report by Focus Taiwan.\nAs per a statement from Presidential Office spokesperson Karen Kuo, the meeting took place at the presidential residence, where President Lai listened to the concerns and needs of the ICT industry.\nAlso Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'.\nDuring the meeting, the government outlined its plans for a response package worth NT$88 billion, aimed at offering support to businesses and helping to mitigate the impact of the new tariffs on Taiwan's exports. Kuo further mentioned that Lai is scheduled to meet with representatives from traditional industries and small to medium-sized enterprises on Sunday.\nAlso Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone.\nThe Cabinet has estimated that electronics and information technology industries will be hit hardest, as ICT products accounted for 52 per cent of total Taiwanese exports to the US in 2024, followed by electronic components (13.4 per cent) and automobile parts (1.8 per cent), Focus Taiwan reported.\nEarlier on Friday, Taiwan's Premier Cho Jung-tai announced that USD 2.66 billion (NT$88 billion) would be allocated to support the industrial and agricultural sectors in response to the latest US tariff policy.\nSpeaking at a news conference in Taipei on Friday, Cho outlined government initiatives to assist export supply chains following US President Donald Trump's decision to impose a 32 per cent reciprocal tariff on Taiwanese imports, the Taipei Times reported.\nThe government revealed a series of 20 measures aimed at supporting affected industries. Of the NT$88 billion, NT$70 billion will be directed towards the industrial sector to help cover administrative costs, enhance competitiveness, diversify markets, offer tax incentives, and stabilise employment. Meanwhile, NT$18 billion will be allocated to assist the agricultural sector, Cho stated.\nOn April 2, Trump announced a widespread imposition of tariffs on countries worldwide. As per the announcements, the import tariffs on other major countries are China (34 per cent), the European Union (20 per cent), Vietnam (46 per cent), Taiwan (32 per cent), Japan (24 per cent), India (26 per cent), the United Kingdom (10 per cent), Bangladesh (37 per cent), Pakistan (29 per cent), Sri Lanka (44 per cent), and Israel (17 per cent). (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Taiwanese President Lai Ching-te on Saturday held a meeting with representatives from the information and communications technology (ICT) sector, which is set to face significant tariffs on exports to the United States, according to a report by Focus Taiwan.","url":"https://www.latestly.com/agency-news/world-news-taiwan-president-meets-ict-industry-representatives-amid-us-tariff-concerns-6761570.html","image":"https://st1.latestly.com/wp-content/uploads/2025/04/ANI-20250405202640.jpg","video":null,"publish_date":"2025-04-06 00:22:23","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.216},{"id":308109938,"title":"Analysis: Senate Republicans Aim to Eliminate California’s Electric Vehicle Regulation","text":"Senate Republicans are looking to scrap a Biden-era rule that essentially allows Democrat-run California to impose an electric vehicle (EV) mandate across the United States.\n\nSen. Shelley Moore Capito (R-WV) proposed a resolution on Friday that would repeal California’s “Advanced Clean Cars II,” which Biden’s Environmental Protection Agency (EPA) signed off on weeks before Trump’s second term, the Daily Caller News Foundation reported. The rule would ban the sale of gas-powered vehicles in California and 11 other states by 2035.\n\nCapito proposed the resolution despite the Government Accountability Office (GAO) stating in March that the EPA waiver was not subject to the Congressional Review Act (CRA). Capito, who is chairman of the Senate Environment and Public Works (EPW) Committee, is arguing that the California EV waivers are rules that can be repealed under the CRA, according to the report.\n\n“By submitting these waivers, the Trump EPA is complying with the law and giving Congress the opportunity to reject California’s effort to impose its EV mandate on all Americans,” Senate Environment and Public Works Republicans posted to X on Feb. 14.\n\nOpponents of California’s EV mandate “are optimistic” that Senate Republicans will secure a full repeal, despite uncertainty over procedural hurdles, the report states.\n\n“Leadership in the House and Senate recognize that this is an important piece of President Trump’s commitment to restoring consumer choice in our ability to purchase automobiles that we want to purchase,” Tom Pyle, president of the Institute for Energy Research, told the outlet. “The pieces are in place, they’re aware of the deadlines, and I’m confident that they will deliver for President Trump and the American people.”\n\nCalifornia’s EV mandate is set to go into effect for model year 2026 and would phase out the sale of new gas-powered cars by 2035. The eleven states who have planned to implement the standard, as allowed by the Biden EPA waiver, are: Colorado, Delaware, Maryland, Massachusetts, New Jersey, New Mexico, New York, Oregon, Rhode Island, Washington and Vermont, as well as Washington, D.C.\n\n“Republicans will need simple majority votes in both chambers to send the CRA resolutions to President Donald Trump’s desk for signature, assuming GOP leadership moves forward in repealing the measures,” according to the report. “Trump strongly opposed Biden-era regulations forcing EVs on American consumers on the campaign trail and signed an executive order eliminating EV mandates on his first day in office on Jan. 20.”\n\nRepublican Reps. John Joyce (R-PA), Jay Obernolte (R-CA) and John James (R-MI) introduced resolutions on Wednesday evening to eliminate California’s EV mandate.\n\nRepublican Sens. Deb Fischer (R-NE) and Markwayne Mullin (R-OK) also introduced resolutions on Friday that would eliminate California’s vehicle emission rules, which essentially crack down on diesel engines and heavy-duty trucks, according to the report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSenate Republicans are looking to scrap a Biden-era rule that essentially allows&#8230;\n\n\nThis Post: Analysis: Senate Republicans Aim to Eliminate California&#8217;s Electric Vehicle Regulation first appeared on Internewscast Journal","url":"https://internewscast.com/news/analysis-senate-republicans-aim-to-eliminate-californias-electric-vehicle-regulation/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-04-06 00:22:00","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.127},{"id":308110658,"title":"Zelenskyy meets European military leaders to plan for peacekeeping force","text":"Ukrainian President Volodymyr Zelenskyy met the leaders of the British and French armed forces in Kyiv on Saturday (April 5, 2025) to discuss the potential deployment of a multinational peacekeeping force to Ukraine, despite the reluctance of U.S. President Donald Trump to provide security guarantees.\n\n The U.K. Ministry of Defence said officials addressed the structure, size and composition of any future “reassurance force,” while the chief of the defence staff, Adm Antony Radakin, emphasised that the U.K. would look to “build on the formidable capabilities of the Ukrainian army and put them in the strongest possible position to deter Russian aggression”.\n\nThe weekend discussions are planned to set the ground for a further meeting between defence ministers in Brussels and the Ukraine Defence Contact Group on Friday.\n\n Britain has been promoting the idea of a European-led peacekeeping force for Ukraine in the event of a ceasefire but it has said such a force needed a U.S. “backstop\" to make it credible in the face of possible Russian reprisals.\n\n Building a force big enough to act as a credible deterrent — U.K. officials have talked about possibly 10,000 to 30,000 troops — would be a considerable effort for nations that shrank their militaries after the Cold War but are now rearming.\n\n Trump, who has been pushing for a ceasefire in the war in Ukraine, temporarily paused military aid to Kyiv and has repeatedly said that the country will never join the NATO military alliance.\n\n Death toll from from Friday's strike rises to 18\n\nThe death toll from a Russian missile strike in the central Ukrainian city of Kryvyi Rih has risen to 18, including nine children, regional Governor Serhii Lysak said on Saturday.\n\n A further 72 people were injured in Friday's attack, the youngest a 3-month-old. About half of them remained in the hospital, with 17 in serious condition.\n\n “There can never be forgiveness for this,” said Oleksandr Vilkul, head of the city's defense council. “Eternal memory to the victims.” \n\nKryvyi Rih is Zelenskyy's hometown.\n\n “The missile struck an area right next to residential buildings — hitting a playground and ordinary streets,” Zelenskyy wrote on Telegram.\n\n Local authorities said the strike damaged about 20 apartment buildings, more than 30 vehicles, an educational building and a restaurant.\n\n The Russian Defence Ministry claimed on Friday that it had carried out a high-precision missile strike with a high explosive warhead on a restaurant where a meeting with unit commanders and Western instructors was taking place.\n\n Russian military claimed that the strike killed 85 military personnel and foreign officers and destroyed 20 vehicles. The military's claims could not be independently verified. The Ukrainian General Staff rejected the claims.\n\n A later drone strike on Kryvyi Rih killed one woman and wounded seven other people.\n\n Russian forces launched 92 drones into Ukraine overnight, with 51 shot down by air defences, the Ukrainian air force wrote on social media Saturday. A further 31 decoy drones also failed to reach their targets, it said.\n\n Elsewhere, one person died on Saturday in the Russian-occupied town of Horlivka in Ukraine's Donetsk region due to shelling, Moscow-installed Gov Denis Pushilin said. Security officials told Russian state news channels that they had destroyed 28 Ukrainian drones over the Donetsk region overnight, marking the first time that the occupied territory had been targeted by such long-range strikes.\n\nZelenskyy criticises U.S. ambassador's response \n\nZelenskyy blamed the daily strikes on Russia's unwillingness to end the war: “Every missile, every drone strike proves Russia wants only war,\" he said, urging Ukraine's allies to increase pressure on Moscow and bolster Ukraine's air defences.\n\n He also criticised the response of the US Embassy in Kyiv to the strike. Ambassador Bridget A Brink posted on social media Friday that she was “horrified\" by the strike in Kryvyi Rih. “More than 50 people injured and 16 killed, including 6 children. This is why the war must end,” the post said.\n\n Zelenskyy, who has so far had a strained relationship with US President Donald Trump, described the post as “unpleasantly surprising\" for not directly naming Russia as the perpetrator of the attack.\n\n \"Such a strong country, such a strong people — and such a weak reaction. They are even afraid to say the word Russian when talking about the missile that killed children,” he said in a post that also praised countries including Japan, Britain, Switzerland and Germany for their “principled statements.” “Yes, the war must end. But in order to end it, we must not be afraid to call a spade a spade,” he said.","summary":"The weekend discussions are planned to set the ground for a further meeting between defence ministers in Brussels and the Ukraine Defence Contact Group","url":"https://www.thehindu.com/news/international/zelenskyy-meets-european-military-leaders-to-plan-for-peacekeeping-force/article69417769.ece","image":"https://th-i.thgim.com/public/incoming/okhmsj/article69417770.ece/alternates/LANDSCAPE_1200/Russia_Ukraine_War_Foreign_Troops_56231.jpg","video":null,"publish_date":"2025-04-06 00:21:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.2},{"id":308109932,"title":"Trump Extends TikTok Sale Deadline by an Additional 75 Days","text":"President Donald Trump said on Truth Social Friday that he is extending the TikTok sale deadline for another 75 days.\n\n“My Administration has been working very hard on a Deal to SAVE TIKTOK, and we have made tremendous progress,” Trump wrote. “The Deal requires more work to ensure all necessary approvals are signed, which is why I am signing an Executive Order to keep TikTok up and running for an additional 75 days.”\n\nMeanwhile, a spate of tech companies and billionaires have placed bids for TikTok—including Amazon and AppLovin separately this week—ahead of Saturday’s original deadline for China-based ByteDance to sell to a U.S. buyer.\n\nABC News is reporting that the Trump Administration is considering a leasing deal instead.\n\nThe leasing option would let China keep control of its prized TikTok algorithm, though the U.S. company holding the lease would have a minority stake, a “source close to the deal” told the outlet. Oracle would supervise the lease, per NPR. Oracle already provides TikTok with backend tech support.\n\nIn addition to Amazon and AppLovin’s bids this week, formal offers to acquire the app have been submitted from billionaire and former L.A. Dodgers owner Frank McCourt (who teamed up with Shark Tank investor Kevin O’Leary and Reddit co-founder Alexis Ohanian) in January. AI startup Perplexity also submitted a more than $50 billion offer to merge its business with TikTok’s U.S. division.\n\nThe TikTok saga has been ongoing since April 2024 when lawmakers concerned about U.S. user data making its way to the Chinese government passed a law to force ByteDance to sell TikTok or face a ban. Since then, TikTok went dark for its 170 million U.S. users for one day, before Trump signed an executive order extending the deadline for 75 days.\n\nThe deadline was April 5 but now there is a new set of 75 days to get a deal done.\n\n“We look forward to working with TikTok and China to close the Deal,” Trump wrote. “Thank you for your attention to this matter!”\n\nThis is a breaking news story and will be updated.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump said on Truth Social Friday that he is extending&#8230;\n\n\nThis Post: Trump Extends TikTok Sale Deadline by an Additional 75 Days first appeared on Internewscast Journal","url":"https://internewscast.com/business/trump-extends-tiktok-sale-deadline-by-an-additional-75-days/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-04-06 00:19:03","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.14},{"id":308110020,"title":"World News | Joint Training at Duvvada Firing Range Showcases India-US Military Cooperation in Tiger Triumph 2025","text":"Visakhapatnam (Andhra Pradesh) [India], April 6 (ANI): In a significant demonstration of India-US military cooperation, troops from both nations conducted an intensive joint training phase at the Duvvada Firing Range, Visakhapatnam, Andhra Pradesh from April 2 - 4 as part of Exercise Tiger Triumph 2025. The exercise reaffirmed the growing synergy between the two militaries, enhancing interoperability, tactical coordination and operational preparedness in combat and humanitarian assistance scenarios.\nThe training began with a joint opening address by the commanding officers of both contingents, setting the tone for a collaborative and high-impact engagement. This was followed by an introduction from the Commanding Officer of the 8 Gorkha Rifles Infantry Battalion Group, which represented the Amphibious Brigade of the Bison Division under the Sudarshan Chakra Corps. The US Army contingent, comprising personnel from the 1st Battalion, 5th Infantry Regiment (\"Bobcats\") and the 1st Stryker Brigade Combat Team, 11th Infantry Division (\"Arctic Wolves\"), received insights into Indian Army training methodologies and the objectives of this joint exercise.\nAlso Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'.\nA key highlight of the training was the participation of Rear Admiral Greg Newkirk, US Navy, who, along with the Commanding Officer of the 8 Gorkha Rifles Infantry Battalion Group, took part in live-firing drills and Jungle Lane Shooting exercises. Their direct involvement underscored the emphasis on hands-on leadership and practical engagement in operational training. The event also saw participation from senior officers from HQ Eastern Naval Command and HQ Integrated Defence Staff (IDS), further strengthening the high-level commitment to bilateral defense cooperation.\nThe training phase covered small arms marksmanship and jungle warfare tactics, with Indian and US soldiers paired as buddy teams for live-firing drills from 100 meters, close-quarters combat shooting at 50 metres and Jungle Lane Shooting exercises designed to simulate engagements in dense terrain. Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone.\nAdditionally, troops underwent Integrated Field Craft (IFC) training, focusing on obstacle navigation, tactical movement and terrain-based combat techniques--essential skills for real-world operations. The Combat Medical Aid module provided crucial training in battlefield first aid and casualty evacuation procedures, ensuring rapid and efficient medical response in crisis situations.\nMeanwhile, in a statement posted on X, the Indian Army's Southern Command stated, \"Landing forces of the Gorkha Infantry Battalion Group from the Amphibious Brigade of Bison Division Indian Army and USMC conducted joint training onboard USS Comstock, US Navy on high-impact combat drills. This interaction at EasternNavalCommand sets the tone for seamless beaching ops at Kakinada, Andhra Pradesh by INS Jalashwa and USS Comstock.\"\nhttps://x.com/IN_HQENC/status/1908515534712234101\nThe joint training at Duvvada Firing Range solidified India-US military ties, fostering mutual respect, trust and camaraderie between troops. Tiger Triumph 2025 continued to reinforce the India-US strategic partnership, enhancing their combined ability to respond to regional security challenges and humanitarian crises in the Indian Ocean Region. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  In a significant demonstration of India-US military cooperation, troops from both nations conducted an intensive joint training phase at the Duvvada Firing Range, Visakhapatnam, Andhra Pradesh from April 2 - 4 as part of Exercise Tiger Triumph 2025.","url":"https://www.latestly.com/agency-news/world-news-joint-training-at-duvvada-firing-range-showcases-india-us-military-cooperation-in-tiger-triumph-2025-6761563.html","image":"https://st1.latestly.com/wp-content/uploads/2025/04/ANI-20250405193732.jpg","video":null,"publish_date":"2025-04-06 00:12:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.479},{"id":308110022,"title":"World News | Netanyahu to Meet Trump at White House for Key Talks on Tariffs","text":"Washington DC [US], April 6 (ANI): Israeli Prime Minister Benjamin Netanyahu is scheduled to meet with US President Donald Trump at the White House on Monday, as confirmed by two US officials and one Israeli official, according to a report by The New York Times.\nThe officials, who requested anonymity as they were not permitted to speak on the matter publicly, indicated that the leaders are expected to discuss various issues, including the ongoing conflict in Gaza. Also Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'.\nAdditionally, they may address the impact of Trump's tariffs, which include a 17 per cent increase on Israeli goods imported into the United States.\nOn April 2, Trump announced a widespread imposition of tariffs on countries worldwide. In February, soon after taking charge for the second time, Trump outlined a new trade policy focused on fairness and reciprocity and said that the US would implement reciprocal tariffs, charging other countries the same tariffs they impose on American goods.\nAlso Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone.\nTrump emphasised that tariffs would address unfair trade practices, including non-monetary barriers, subsidies, and VAT systems, while encouraging foreign countries to either reduce or eliminate tariffs against the US.\nAs per the announcements, the import tariffs on other major countries are China (34 per cent), the European Union (20 per cent), Vietnam (46 per cent), Taiwan (32 per cent), Japan (24 per cent), India (26 per cent), the United Kingdom (10 per cent), Bangladesh (37 per cent), Pakistan (29 per cent), Sri Lanka (44 per cent), and Israel (17 per cent). From April 9 onwards, countries with the largest trade deficits with the US will face higher, individualised tariffs. India is one of the countries affected, with a 26 percent tariff imposed on all its exports.\nMeanwhile, the US stock markets tanked more than 5 per cent on Friday after Donald Trump's reciprocal tariffs sparked fear among investors of a global economic recession.\nThe Dow Jones index closed with a decline of more than 5.50 per cent, making it one of the highest losses of the index. The S&P 500 index declined approximately 6 per cent by the closing, while Nasdaq tanked 5.73 per cent. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Israeli Prime Minister Benjamin Netanyahu is scheduled to meet with US President Donald Trump at the White House on Monday, as confirmed by two US officials and one Israeli official, according to a report by The New York Times.","url":"https://www.latestly.com/agency-news/world-news-netanyahu-to-meet-trump-at-white-house-for-key-talks-on-tariffs-6761556.html","image":"https://st1.latestly.com/wp-content/uploads/2025/04/ANI-20250405185224.jpg","video":null,"publish_date":"2025-04-06 00:04:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.108},{"id":308110024,"title":"World News | PM Modi Holds Productive Meeting with President Dissanayake; India, Sri Lanka Boost Defence, Energy Ties","text":"Colombo [Sri Lanka], April 6 (ANI): Prime Minister Narendra Modi had a productive meeting with Sri Lankan President Anura Kumara Dissanayake on Saturday with the two countries fostering their partnership in a range of areas including defence and energy. Ahead of the talks, Prime Minister was accorded a ceremonial welcome at Independence Square. The Prime Minister is the first foreign leader to pay a State visit to Sri Lanka since President Disanayaka took office in September 2024.\nAlso Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'.\nApart from MoU on Defence Cooperation, an MoU was signed between India, Sri Lanka, and Arab Emirates for Cooperation in Development of Trincomalee as an energy hub. A multi-product pipeline is among the initiatives that will be discussed under this MoU.\nPM Modi and the Sri Lankan President held detailed discussions in restricted and delegation-level format on further deepening the special and close bilateral ties that are rooted in shared history and driven by strong people-to-people linkages. Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone.\nThey reviewed cooperation in the fields of connectivity, development cooperation, economic ties, defence relations, reconciliation and fishermen issues. Prime Minister reiterated Sri Lanka's importance in India's Neighbourhood First Policy and Vision MAHASAGAR. He conveyed India's continued commitment to assist in Sri Lanka's economic recovery and stabilization. Following the talks, the two leaders virtually inaugurated several projects. These include 5000 solar rooftop units installed at religious places across Sri Lanka and a temperature-controlled warehousing facility at Dambulla. They also virtually participated in the ground-breaking ceremony for the launch of the 120 MW Sampur Solar power project.\nThe two leaders witnessed the exchange of seven MoUs in the fields of energy, digitization, defence, health and multi-sectoral assistance in the Eastern Province. Prime Minister announced support for the development of the Thirukoneswaram temple in Trincomalee, the Sacred City project in Anuradhapura and the Sita Eliya temple complex in Nuwara Eliya. In the areas of capacity building and economic support, a comprehensive package for training an additional 700 Sri Lankan citizens annually, and the conclusion of Bilateral Amendatory Agreements on Debt Restructuring were also announced. In keeping with the shared Buddhist heritage of the two countries, PM Modi announced that Holy Relics of Lord Buddha from Gujarat would be traveling to Sri Lanka for the International Vesak Day celebrations. PM Modi arrived in Sri Lanka on a three-day visit on Friday from Thailand where he also attended the BIMSTEC summit. Foreign Secretary Vikram Misri, who briefed reporters about PM Modi's Sri Lanka visit, later said that MoU on Defence Cooperation is an umbrella framework document that will make existing defense cooperation initiatives more structured. \"There will be activities related to, of course, the continuing and even intensifying the tradition of high-level visits between the two countries, more joint exercises, capacity building in various areas, exchanges in HADR related operations, increasing port calls by naval units of both countries, and also to explore defense industry cooperation between the two sides,\" he said. Misri said President of Sri Lanka has both during his visit to Delhi and on this occasion and on several other occasions mentioned and stated clearly that Sri Lankan territory will not be used or be allowed to be used in any manner that is inimical or detrimental to India's interests.\n\"In fact, if I recall correctly during discussions today, he said that neither Sri Lanka's land nor the oceans around it will be allowed to be used in any manner inimical to India's security\".\nAnswering queries related to the MoU on the development of Trincomalee as an energy hub which involves India, Sri Lanka and the United Arab Emirates, Misri said the actual projects that will be carried out will be discussed by the designated business entities of the three sides.\n\"At the present moment, the way this is structured, it is a government-to-government MoU in order to provide the enabling framework, and to set out some of the broad terms of reference for this cooperation,\" he said. Misri said the immediate next step that will be enabled by this framework MoU is the identification and nomination of specific agencies and entities that could be government entities or private sector entities or could be entities related to the governments themselves that will try and realize the business-to-business part of this agreement.\n\"So, the actual projects that will be carried out will be discussed in detail by the designated business entities of the three sides, and that is the next step that will ensue. The UAE is a major energy partner for India. It is a strategic partner for India in the energy space, and it was therefore an ideal partner for this particular exercise that is being done for the first time in this region,\" he said.\n\"And what the exact contours of the UAE role will be is something that is going to be elaborated once the B2B discussions kick off under this MoU,\" he said.\nMisri said insofar as the components of the activities are concerned, a multi-product pipeline is one of the things that will be discussed under this particular MoU. \"It is something that has been under discussion bilaterally also between India and Sri Lanka, but this is one of the projects which will be covered under this trilateral MoU,\" he said. \"You are aware that in Trincomalee we have the tank farms. Some of them are already being developed and utilized by Lanka IOC, but there are many more that are lying unused, and have not been put to use as yet. And there is a possibility that they will also be developed and utilized under this particular MoU,\" he added.\nHe said in the business space there are a number of initiatives possible for discussion under an MoU such as this. \"I imagine that once the entities get together, they will look at all issues related obviously to financing, to feasibility, to viability, etc., and come up with the projects that can be taken forward on the ground,\" he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi had a productive meeting with Sri Lankan President Anura Kumara Dissanayake on Saturday with the two countries fostering their partnership in a range of areas including defence and energy.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-holds-productive-meeting-with-president-dissanayake-india-sri-lanka-boost-defence-energy-ties-6761554.html","image":"https://st1.latestly.com/wp-content/uploads/2025/04/ANI-20250405185109.jpg","video":null,"publish_date":"2025-04-06 00:02:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.307},{"id":308110014,"title":"World News | 300 Indian Origin Pakistani Citizens Visit Dwarkadhish Temple in Gujarat","text":"Gandhinagar (Gujarat) [India], April 6 (ANI): A group of 300 Pakistani citizens of Indian origin, residing in Pakistan's Sindh, visited the Dwarkadhish Temple, Devbhumi Dwarka in Gujarat and offered prayers.\nOne of the devotees expressed his profound happiness and stated, \"We are from Sindh, Pakistan. A total of 300 devotees have come here at Dwarkadhish Temple to offer prayers...we are very happy to be here...\"\nAlso Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'.\nThe second devotee stated, \"We are very happy to be here, and we have offered prayers at Dwarkadhish Temple. There is brotherhood on both sides, and we feel obliged to be here.\"\nNotably, the Pakistanis are currently in India on a 60-day visa, facilitated by a religious organization in Raipur.\nAlso Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone.\nThe group, comprising businessmen and professionals from Karachi and surrounding areas, was welcomed at the temple and offered prayers by the temple priest, Paresh Bhai.\nThe priest expressed his privilege in facilitating their visit and stated that it was a proud moment for him to see the devotees take back memories of their visit to the Dwarkadhish Temple to Pakistan.\nSome members of the group mentioned that after taking a dip in the Ganges River, they plan to take some of its water back to Pakistan as a sacred souvenir.\nThe group has been touring various places in India, including Dwarkadhish Temple, and plans to visit Bet Dwarka, Mount Abu, and other religious sites. They shared their positive experiences of living in Pakistan, stating that they face no difficulties and coexist harmoniously with others.\nDuring their visit, some members of the group sang devotional songs, including \"Radhe-Radhe,\" and expressed their deep connection to the land, stating that they felt like staying in India rather than returning to Pakistan.\nThe delegation plans to visit Bet Dwarka, a significant pilgrimage site associated with Lord Krishna, on the following day. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  A group of 300 Pakistani citizens of Indian origin, residing in Pakistan's Sindh, visited the Dwarkadhish Temple, Devbhumi Dwarka in Gujarat and offered prayers.","url":"https://www.latestly.com/agency-news/world-news-300-indian-origin-pakistani-citizens-visit-dwarkadhish-temple-in-gujarat-6761552.html","image":"https://st1.latestly.com/wp-content/uploads/2025/04/ANI-20250405183546.jpg","video":null,"publish_date":"2025-04-06 00:00:21","author":null,"language":"en","source_country":"in","sentiment":-0.006},{"id":308114368,"title":"Trump’s Reciprocal Tariffs: A New Era for Trade?","text":"Apr-05-2025\n\nThe Tariff Act of 1789 was the first major piece of legislation passed by Congress. It was to create an environment for the economy and business to prosper. Tariffs continued to play a key role in U.S. trade policy before waning in the mid-1900s.\n\nFast forward to 2025, when President Donald Trump announced the implementation of ...","summary":"The Tariff Act of 1789 was the first major piece of legislation passed by Congress. It was to create an environment for the economy and business to prosper. Tariffs continued to play a key role in U.S. trade policy before waning in the mid-1900s. Fast forward to 2025, when President Donald Trump announced the implementation [&#8230;]","url":"https://www.theepochtimes.com/epochtv/trumps-reciprocal-tariffs-a-new-era-for-trade-5836913","image":"https://img.theepochtimes.com/assets/uploads/2025/04/05/id5837350-Trump-tariffs.jpg","video":null,"publish_date":"2025-04-06 00:00:10","author":"Chris Beers","authors":["Chris Beers"],"language":"en","source_country":"us","sentiment":0.123},{"id":308110758,"title":"Musk lashes out at architect of Trump’s tariffs in first public comments about shock policy","text":"There's trouble in Trumpland; Tesla CEO and head of the Department of Government Efficiency, Elon Musk, has taken public swipes at Donald Trump’s adviser on trade and manufacturing, Peter Navarro, who helped shape the president's reciprocal tariff policy that tanked markets across the world.\n\nMusk is typically vocal in his support and defense of the president, but has been quiet since Trump's \"Liberation Day\" tariff announcement that killed $2.5 trillion from the U.S. stock market — a loss of value that cost the Tesla CEO more than $30bn, according to CNBC.\n\nOn X, which Musk owns, he took swipes at Navarro, a Harvard-educated economist who advises Trump on trade. Navarro who was originally tapped for a spot in the White House by Trump's son-in-law, Jared Kushner, is the author of books on China and the economic threats he says the nation poses to the U.S.\n\nA user on X posted a video from CNN in which Navarro defends the tariffs, noting positively that he went to Harvard. Musk took issue with that, calling it a \"bad thing.\"\n\n\"A PhD in Econ from Harvard is a bad thing, not a good thing,\" he wrote. \"Results in the ego/brains>>1 problem.\"\n\nAnother user replied, insisting that Navarro was correct in his defense, but Musk rejected that and questioned Navarro's practical economic experience.\n\n\"He aint built s***,\" Musk wrote.\n\nNavarro was jailed after a grand jury indicted him in 2022 on two counts of contempt of Congress. He refused to comply with a subpoena from the White House Select Committee investigating the Capitol riot on January 6, 2021.\n\nThe economist was sentenced to four months in jail and was fined $9,500. He was the first former White House official imprisoned on a charge of contempt of Congress.\n\nIn another post, an X user shared a quote from conservative American economist Thomas Sowell that critiqued Harvard-trained professionals.\n\n\"In every disaster throughout American history, there always seems to be a man from Harvard in the middle of it,\" the quote, attributed to Sowell, said.\n\nMusk replied to the post with a simple \"yup.\"\n\nSowell has been a vocal critic of Trump's tariffs, and warned that the president's policy could set off a global trade war and potentially another Great Depression, according to Fox Business.\n\nDespite the shock and condemnation of Trump’s tariffs even by some conservatives, it hasn’t dulled the negative attention Musk is facing for his actions as the head of DOGE. Under Musk, the agency has demanded the firing of tens of thousands of federal workers, effectively shuttered entire agencies, and has crippled some agencies' ability to work efficiently. Protesters took to the streets on Saturday to voice their anger at Trump and Musk for their dismantling of the federal government.\n\nAmericans frustrated by Musk — who was not personally elected — meddling in the federal government have responded by protesting outside Tesla facilities and boycotting the company's vehicles. Some have gone so far as to vandalize or even destroy Tesla vehicles and showrooms.\n\nTesla announced a 13 percent drop in its first quarter sales this year when compared to last year, making it the company's worst quarter since 2022, according to a company statement. As of Friday, Tesla's stock price was down 10 percent between Musk-related blowback and Trump's tariffs.\n\nMusk's comments come shortly after news broke that Trump told his inner circle that the Tesla CEO will be stepping back from his duties at the White House, although he has not given a timeline for this happening.","url":"https://uk.news.yahoo.com/musk-lashes-architect-trump-tariffs-221607268.html","image":"https://media.zenfs.com/en/the_independent_577/797ceb34c652415e62626e1a6f5741a8","video":null,"publish_date":"2025-04-05 23:57:07","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.244},{"id":308108756,"title":"Musk lashes out at architect of Trump’s tariffs in first public comments about shock policy","text":"There's trouble in Trumpland; Tesla CEO and head of the Department of Government Efficiency, Elon Musk, has taken public swipes at Donald Trump’s adviser on trade and manufacturing, Peter Navarro, who helped shape the president's reciprocal tariff policy that tanked markets across the world. \n\nMusk is typically vocal in his support and defense of the president, but has been quiet since Trump's \"Liberation Day\" tariff announcement that killed $2.5 trillion from the U.S. stock market — a loss of value that cost the Tesla CEO more than $30bn, according to CNBC. \n\nOn X, which Musk owns, he took swipes at Navarro, a Harvard-educated economist who advises Trump on trade. Navarro who was originally tapped for a spot in the White House by Trump's son-in-law, Jared Kushner, is the author of books on China and the economic threats he says the nation poses to the U.S.\n\nA user on X posted a video from CNN in which Navarro defends the tariffs, noting positively that he went to Harvard. Musk took issue with that, calling it a \"bad thing.\" \n\n\"A PhD in Econ from Harvard is a bad thing, not a good thing,\" he wrote. \"Results in the ego/brains>>1 problem.\" \n\nAnother user replied, insisting that Navarro was correct in his defense, but Musk rejected that and questioned Navarro's practical economic experience. \n\n\"He aint built s***,\" Musk wrote. \n\nNavarro was jailed after a grand jury indicted him in 2022 on two counts of contempt of Congress. He refused to comply with a subpoena from the White House Select Committee investigating the Capitol riot on January 6, 2021.\n\nThe economist was sentenced to four months in jail and was fined $9,500. He was the first former White House official imprisoned on a charge of contempt of Congress. \n\nIn another post, an X user shared a quote from conservative American economist Thomas Sowell that critiqued Harvard-trained professionals. \n\n\"In every disaster throughout American history, there always seems to be a man from Harvard in the middle of it,\" the quote, attributed to Sowell, said. \n\nMusk replied to the post with a simple \"yup.\"\n\nSowell has been a vocal critic of Trump's tariffs, and warned that the president's policy could set off a global trade war and potentially another Great Depression, according to Fox Business.\n\nDespite the shock and condemnation of Trump’s tariffs even by some conservatives, it hasn’t dulled the negative attention Musk is facing for his actions as the head of DOGE. Under Musk, the agency has demanded the firing of tens of thousands of federal workers, effectively shuttered entire agencies, and has crippled some agencies' ability to work efficiently. Protesters took to the streets on Saturday to voice their anger at Trump and Musk for their dismantling of the federal government.\n\nAmericans frustrated by Musk — who was not personally elected — meddling in the federal government have responded by protesting outside Tesla facilities and boycotting the company's vehicles. Some have gone so far as to vandalize or even destroy Tesla vehicles and showrooms. \n\nTesla announced a 13 percent drop in its first quarter sales this year when compared to last year, making it the company's worst quarter since 2022, according to a company statement. As of Friday, Tesla's stock price was down 10 percent between Musk-related blowback and Trump's tariffs.\n\nMusk's comments come shortly after news broke that Trump told his inner circle that the Tesla CEO will be stepping back from his duties at the White House, although he has not given a timeline for this happening.","summary":"DOGE boss says Peter Navarro being Harvard trained is a ‘bad thing, not a good thing’","url":"https://www.independent.co.uk/news/world/americas/us-politics/musk-lashes-out-trump-tariffs-b2728143.html","image":"https://static.independent.co.uk/2025/04/05/23/41/US-POLITICS-TRUMP-zc89ig7z.jpeg?trim=1506,0,1507,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/kF4casBr-OhrQWqOm.mp4","publish_date":"2025-04-05 23:57:07","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.244},{"id":308110762,"title":"Thousands take part in anti-Trump, Musk protests nationwide and abroad","text":"Crowds of people angry with how US President Donald Trump and his administration have been running the country have taken to the streets in nationwide protests to voice their objection in scores of American cities on Saturday.\n\nIt’s the biggest day of demonstrations yet by an opposition movement, trying to regain its momentum after the shock of the Republican’s first weeks in office.\n\nThe protest movement – so-called Hands Off! – was organised for more than 1,200 location in all 50 states by more than 150 groups, including civil rights organisations, labour unions, LGBTQ+ advocates, veterans and election activists.\n\nThe rallies appeared peaceful with authorities reporting no cases of major violence, clashes or arrests.\n\nFrom the National Mall park in the capital Washington DC, to Midtown Manhattan, to Boston Common and multiple state capitols, thousands of protesters assailed Trump and the world’s richest man, Elon Musk’s actions.\n\nCritics voiced their objection to the current administration’s policies and approaches, which included downsizing of the federal government, the economy, immigration and human rights.\n\nDemonstrators rallied to oppose the administration’s moves to fire thousands of federal employees, close Social Security Administration field offices and effectively shutter entire government agencies, such as USAID.\n\nMusk has played a pivotal role in facilitating such actions, as he heads the newly created Department of Government Efficiency – or DOGE – which aims to slash “unnecessary government spending”. DOGE plans to cut around $2 trillion (€1.82 trillion) in federal expenditure.\n\nProtesters held signs and placards reading “Trap the Muskrat” and “Deport Elon Musk” in clear opposition of his policies. Many have also criticised Musk – who owns Tesla, SpaceX, Starlink and X – for his role in government, being a naturalised citizen.\n\n\"Here in America, Mr. Musk, justice is not for sale. And we don't raffle off state Supreme Court judgeships for million-dollar prizes. Stop trying to buy our votes. Stop ripping off our government. And stop stealing our data,” said Congressman Jamie Raskin, speaking at the DC rally.\n\nIn Boston, demonstrators held signs reading “hands off our democracy” and “hands off our social security”. Mayor Michelle Wu attended the protest in the Massachusetts capital, where she denounced Trump’s intimidation tactics and attacks on diversity and equality.\n\n“I refuse to accept that they could grow up in a world where immigrants like their grandma and grandpa are automatically presumed to be criminals,” Wu said\n\nHundreds of people also demonstrated in Palm Beach Gardens, Florida, a few miles from Trump's golf course in Jupiter, where he spent the morning at the club's Senior Club Championship. People lined both sides of PGA Drive, encouraging cars to honk and chanting slogans against Trump.\n\nAsked about the protests, the White House said in a statement that “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries.”\n\n“Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors,” added the White House.\n\nProtests also took place across the pond, as hundreds of US citizens abroad and foreign nationals protested against Trump’s foreign policy approach.\n\nDemonstrations took place from London to Berlin, calling for an “end to chaos”, referring to the US president’s aggressive global tariff policy which has thrown stock markets across the world in a frenzy, as well as advocated for Ukraine, which Trump has been critical of.\n\n\"Even people who voted for him are not getting what they voted for with the tariffs. Everyone has lost money. Eggs are not cheaper. They're not having a better life. So they should be even angrier than anyone else,” said Alyssa, an American protesting in London.\n\nActivists have staged nationwide and international demonstrations against Trump and Musk numerous times since the former’s return to the White House.\n\nProtesters say they will continue to peacefully voice their objection to an administration they say does not represent them or the common interests of US citizens in hopes of exerting pressure on the administration to reverse course.","url":"https://uk.news.yahoo.com/thousands-part-anti-trump-musk-234848523.html","image":"https://media.zenfs.com/en/euronews_uk_articles_973/17b962c0b8a81e95c88aea197621852a","video":null,"publish_date":"2025-04-05 23:48:48","author":"Malek Fouda","authors":["Malek Fouda"],"language":"en","category":"politics","source_country":"gb","sentiment":0.158},{"id":308109592,"title":"Thousands take part in anti-Trump, Musk protests nationwide and abroad","text":"Crowds of people angry with how US President Donald Trump and his administration have been running the country have taken to the streets in nationwide protests to voice their objection in scores of American cities on Saturday.It’s the biggest day of demonstrations yet by an opposition movement, trying to regain its momentum after the shock of the Republican’s first weeks in office.The protest movement – so-called Hands Off! – was organised for more than 1,200 location in all 50 states by more than 150 groups, including civil rights organisations, labour unions, LGBTQ+ advocates, veterans and election activists.The rallies appeared peaceful with authorities reporting no cases of major violence, clashes or arrests.From the National Mall park in the capital Washington DC, to Midtown Manhattan, to Boston Common and multiple state capitols, thousands of protesters assailed Trump and the world’s richest man, Elon Musk’s actions.Critics voiced their objection to the current administration’s policies and approaches, which included downsizing of the federal government, the economy, immigration and human rights.Demonstrators rallied to oppose the administration’s moves to fire thousands of federal employees, close Social Security Administration field offices and effectively shutter entire government agencies, such as USAID.Musk has played a pivotal role in facilitating such actions, as he heads the newly created Department of Government Efficiency – or DOGE – which aims to slash “unnecessary government spending”. DOGE plans to cut around $2 trillion (€1.82 trillion) in federal expenditure.Protesters held signs and placards reading “Trap the Muskrat” and “Deport Elon Musk” in clear opposition of his policies. Many have also criticised Musk – who owns Tesla, SpaceX, Starlink and X – for his role in government, being a naturalised citizen.\"Here in America, Mr. Musk, justice is not for sale. And we don't raffle off state Supreme Court judgeships for million-dollar prizes. Stop trying to buy our votes. Stop ripping off our government. And stop stealing our data,” said Congressman Jamie Raskin, speaking at the DC rally.In Boston, demonstrators held signs reading “hands off our democracy” and “hands off our social security”. Mayor Michelle Wu attended the protest in the Massachusetts capital, where she denounced Trump’s intimidation tactics and attacks on diversity and equality.“I refuse to accept that they could grow up in a world where immigrants like their grandma and grandpa are automatically presumed to be criminals,” Wu saidHundreds of people also demonstrated in Palm Beach Gardens, Florida, a few miles from Trump's golf course in Jupiter, where he spent the morning at the club's Senior Club Championship. People lined both sides of PGA Drive, encouraging cars to honk and chanting slogans against Trump.Asked about the protests, the White House said in a statement that “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries.”“Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors,” added the White House.Protests also took place across the pond, as hundreds of US citizens abroad and foreign nationals protested against Trump’s foreign policy approach.Demonstrations took place from London to Berlin, calling for an “end to chaos”, referring to the US president’s aggressive global tariff policy which has thrown stock markets across the world in a frenzy, as well as advocated for Ukraine, which Trump has been critical of.\"Even people who voted for him are not getting what they voted for with the tariffs. Everyone has lost money. Eggs are not cheaper. They're not having a better life. So they should be even angrier than anyone else,” said Alyssa, an American protesting in London.Activists have staged nationwide and international demonstrations against Trump and Musk numerous times since the former’s return to the White House.Protesters say they will continue to peacefully voice their objection to an administration they say does not represent them or the common interests of US citizens in hopes of exerting pressure on the administration to reverse course.","summary":"Thousands of people staged protests against Trump and Tesla boss Elon Musk across the US and beyond the borders to express dissatisfaction with policies and actions of the current administration.","url":"https://www.euronews.com/2025/04/06/thousands-take-part-in-anti-trump-musk-protests-nationwide-and-abroad","image":"https://static.euronews.com/articles/stories/09/17/20/76/1440x810_cmsv2_13eee7fc-0ef4-55fd-aadb-97d2bf1b9150-9172076.jpg","video":null,"publish_date":"2025-04-05 23:48:48","author":"Malek Fouda","authors":["Malek Fouda"],"language":"en","category":"politics","source_country":"fr","sentiment":0.165},{"id":308106100,"title":"When Joe Rogan delivered a hot take on \"the best Batman ever\"","text":"Five years ago on episode #1585 of The Joe Rogan Experience, the popular podcaster welcomed friend and fellow comedian Tony Hinchcliffe. As the pair discussed the entertainment industry, Rogan shared his thoughts on legendary Hollywood actor Michael Keaton.Keaton famously played Batman, a comic book character, in the 1989 live action superhero film 'Batman.' According to Rogan, Keaton's portrayal of the character is the very best in history, superior to even Christian Bale's portrayal of the character many years later.\"There's a lot of people that are really reluctant to accept him as Batman, cause he's kind of, like, this thin guy. He's not jacked. Might have been the best Batman ever. Might have been the best Batman, and that's including Christian Bale.\"Check out Joe Rogan's thoughts on the best Batman actor of all time (0:50):The UFC commentator's assertion is certainly a hot take, as many fans of the Batman cinematic mythos hail Bale as the greatest film representation of the character. Rogan, though, has always moved to the beat of his own drum and it comes as little surprise that he, once again, went against the grain.Rogan himself dabbled in acting and the entertainment industry in general before finding his feet as a comedian and MMA commentator. However, it was his work as a podcaster that truly skyrocketed his popularity, with the JRE podcast featuring a number of notable guests from all walks of life.In fact, the significance of the podcast is such that Rogan is often said to have helped sway a large portion of Americans to vote for Donald Trump in the 2024 U.S. presidential elections by interviewing Trump himself, who ultimately won the elections.Joe Rogan is familiar with the film businessAt one point, Joe Rogan was an actor. He made his debut in a short film, 'Bruce Testones, Fashion Photographer,' playing the titular character Bruce Testones. However, his first serious role was as Frank Valente on 90s sitcom, 'Hardball.' He also played Joe Garrelli in a different sitcom, 'NewsRadio.'Check out Joe Rogan as Frank Valente:Thereafter, the majority of Rogan's roles were him portraying fictional versions of himself as he gradually moved away from acting. Instead, he became known as the host of 'Fear Factor,' before ultimately focusing on his comedy work.","summary":"Five years ago on episode #1585 of The Joe Rogan Experience, the popular podcaster welcomed friend and fellow comedian Tony Hinchcliffe.","url":"https://www.sportskeeda.com/mma/when-joe-rogan-delivered-hot-take-the-best-batman-ever","image":"https://staticg.sportskeeda.com/editor/2025/04/df8e5-17438936153252-1920.jpg","video":null,"publish_date":"2025-04-05 23:43:24","author":"Ricardo Viagem","authors":["Ricardo Viagem"],"language":"en","source_country":"in","sentiment":0.806},{"id":308106514,"title":"US revokes all South Sudan visas after it refuses to take back its citizens","text":"The US said on Saturday it would revoke all visas held by South Sudanese passport holders over South Sudan’s failure to accept the return of its repatriated citizens, at a time when many in Africa fear that country could return to civil war.\nUS President Donald Trump’s administration has taken aggressive measures to ramp up immigration enforcement, including the repatriation of people deemed to be in the US illegally.\nThe administration has warned that countries that do not swiftly take back their citizens will face consequences, including visa sanctions or tariffs.\nSouth Sudan had failed to respect the principle that every country must accept the return of its citizens in a timely manner when another country, including the US, seeks to remove them, US Secretary of State Marco Rubio said in a statement.\n“Effective immediately, the United States Department of State is taking actions to revoke all visas held by South Sudanese passport holders and prevent further issuance to prevent entry into the United States by South Sudanese passport holders,” Rubio said.\n\n“We will be prepared to review these actions when South Sudan is in full cooperation,” Rubio said.\nIt is time for South Sudan’s transitional government to “stop taking advantage of the United States,” he said.\nSouth Sudan’s embassy in Washington did not respond immediately to a request for comment.\nAfrican Union mediators arrived in South Sudan’s capital Juba this week for talks aimed at averting a new civil war in the country after its First Vice-President Riek Machar was placed under house arrest last week.\nSouth Sudan President Salva Kiir’s government has accused Machar, a long-time rival who led rebel forces during a 2013-18 war that killed hundreds of thousands, of trying to stir up a new rebellion.\nMachar’s detention followed weeks of fighting in the northern Upper Nile state between the military and the White Army militia. Machar’s forces were allied with the White Army during the civil war but deny any current links.\nThe 2013-18 war was contested largely along ethnic lines, with fighters from the Dinka, the country’s largest group, lining up behind Kiir, and those from the Nuer, the second-largest group, supporting Machar.","summary":"The African nation is on the brink of return to civil war after its First Vice-President Riek Machar was placed under house arrest last week.","url":"https://www.scmp.com/news/world/united-states-canada/article/3305379/us-revokes-all-south-sudan-visas-after-it-refuses-take-back-its-citizens","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/04/06/4c3303b5-f0b2-41cd-a849-b8a8d4c46a7b_cc15303f.jpg","video":null,"publish_date":"2025-04-05 23:34:57","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.074},{"id":308107476,"title":"'Hands Off!' Anti-Trump Americans Flood Washington","text":"When Liz Gabbitas joined thousands of fellow protesters Saturday in the US capital, she thought her message to the Trump administration would be best delivered through her homemade sign: a cardboard guillotine.The 34-year-old librarian made clear she does not advocate violence, but nevertheless insisted that her one-meter (three-foot) sign, complete with tin foil blade, \"communicated the visual language\" of revolutionary fervor she longs for less than three months into Donald Trump's presidency.\"It's easy to be overwhelmed with all of the horrible things going on\" under Trump's leadership, she told AFP at the base of the Washington Monument, just blocks from the White House.\"I'm worried that the separation of powers is dissolving,\" she added, noting Trump's dramatic expansion of executive authority. \"And I do worry that people get into the trap of feeling like, well there's nothing I can do.\"Americans were taking action all around her, however, on the biggest day of national \"Hands Off\" protests since Trump returned to power.Hand-scrawled \"Resist\" signs poked up from the crowd, which organizers said amounted to more than 20,000 people.Some protesters dressed in the red cloaks of \"The Handmaid's Tale,\" a popular novel and TV series about a totalitarian society. Others carried American flags upside down, traditionally a symbol of distress or danger to the country's liberties. \"You did Nazi this coming,\" screamed a sign.Bob Dylan's protest classic \"Masters of War\" oozed from a portable speaker. A larger-than-life paper mache model of Elon Musk, the billionaire whom Trump has tasked with slashing the federal workforce, cast a fascist salute.\"Because of Trump and Elon and DOGE, my project died and I was laid off,\" said Annette, a 39-year-old from Oregon who recently lost her government contractor job in international development.While she fears a collapse in US-funded humanitarian work worldwide, \"I'm really heartened to see so many people out here,\" she said.But \"this is not enough... Congress needs to get off their asses, I think,\" she said.\"Unfortunately,\" she added, \"I feel this in my heart that people aren't going to come out until it hurts them personally somehow.\"Half a mile away, Shelly Townley and her husband were making their way past the White House, provocatively holding an upside-down American flag and a sign reading \"Stop the Musk Coup.\"\"I feel sad. This is the first time I've walked by here without crying,\" Townley, a 62-year-old from North Carolina, told AFP. \"I believe we're under a coup right now, by oligarchs, much to my dismay,\" and \"the checks and balances of our government\" are disintegrating, she added.Even though Trump was away in Florida, Townley found herself looking at the White House through tall metal fencing erected ahead of the rally.\"I wish that instead of being at a golf tournament at Mar-a-Lago that he was in there and could see what was happening out here, that the people are out here\" opposing his policies, she said.Not everyone was comfortable openly protesting in public, especially given Trump's executive order issued last week that approves deployment of \"a more robust Federal law enforcement presence\" in Washington. A 51-year-old woman who represents an NGO said she was wearing a mask \"to protect my identity.\"\"I think they are using AI and different recognition technologies to out people and to then punish them,\" she added.\"It's all about loyalty with this administration,\" she warned. \"And if you're disloyal, you're at risk of losing everything.\"","summary":"When Liz Gabbitas joined thousands of fellow protesters Saturday in the US capital, she thought her message to the Trump administration would be best delivered through her homemade sign: a cardboard guillotine.","url":"https://www.ibtimes.com/hands-off-anti-trump-americans-flood-washington-3768937","image":"https://d.ibtimes.com/en/full/4591894/demonstrators-dressed-characters-handmaids-tale-gather-national-mall-nationwide-hands.jpg","video":null,"publish_date":"2025-04-05 23:27:07","author":"Michael Mathes","authors":["Michael Mathes"],"language":"en","category":"politics","source_country":"US","sentiment":-0.348},{"id":308104618,"title":"'Hands Off!' Protesters on Why They Are Rallying Against Trump and Musk","text":"Thousands of protesters packed Manhattan's Fifth Avenue on Saturday in a sweeping show of opposition to the Trump administration, joining the nationwide \"Hands Off!\" movement targeting President Donald Trump and billionaire Elon Musk.Why It MattersThe protests were among more than 1,200 coordinated across the United States on Saturday, organized by \"Hands Off!\" a grassroots movement supported by civil rights groups, labor unions, and advocacy organizations.Protesters primarily targeted the president and Musk for actions taken during the early months of the second Trump administration, criticizing mass federal layoffs, immigration crackdowns, and U.S. involvement in the conflicts in Ukraine and Gaza.In addition, hundreds of people in European cities—including Frankfurt, Berlin, London, Lisbon and Paris—took to the streets in solidarity with American protests.What To KnowFifth Avenue became a river of protest on Saturday, as thousands marched through Midtown Manhattan in one of the largest coordinated demonstrations of the year. Chanting, waving flags, and holding handmade signs, the crowd stretched nearly 20 blocks.Organizers said more than 600,000 people had signed up to participate in protests across the country. In New York City, the rally began at Bryant Park around noon, with demonstrators marching down Fifth Avenue through Madison Square Park.Protesters carried signs opposing cuts to Social Security and Medicare, demanding protections for immigrants and civil rights, and condemning federal downsizing efforts led by Musk's Department of Government Efficiency (DOGE).Some demonstrators waved American flags and held cardboard signs with clever slogans. One read, \"Billionaires are attacking fed workers for protecting you.\" Another declared, \"This is what democracy looks like.\"Early in the protest, many participants hesitated to speak on the record out of fear of retaliation. But as the afternoon continued, people began to open up.\"This is what we're standing out here in the cold for,\" Frank Hickey, a former police officer who lives in Manhattan, said. \"This is what we're getting fallen arches and stiff backs for—and I think it's important.\"Hickey, who previously volunteered in Ukraine teaching self-defense and leading a book club, called the protest \"an extension of the lawlessness of the Trump regime.\"Some protesters focused on single issues—such as defending Medicare or Social Security—while others voiced broader opposition to the Trump administration and the Make America Great Again (MAGA) movement. Musk was also a frequent target. Several signs demanded his \"deportation,\" while others denounced the influence he's had on the Trump administration since the campaign.Musk, who was born in South Africa, moved to the U.S. in 1992 to attend college. He initially entered the country on an Exchange Visitor Visa before transitioning to a work visa and eventually gaining citizenship.Kailani, a 26-year-old graduate student from the Bronx, said she feared the collapse of constitutional safeguards. \"The most concerning thing is the blatant disregard of the court orders that have been issued,\" she said. \"The checks and balances are not working and are being actively destroyed.\"Though largely peaceful, the protest saw a brief confrontation in Madison Square Park between an anti-Trump marcher and a Trump supporter. Police quickly stepped in. The pro-Trump counterdemonstration remained small.One of the Trump supporters involved in the altercation, Brian, said he attended the protest to push back against what he described as cultural confusion and societal decline.\"You've got people with cat litter boxes in schools. It's a bunch of brain syndrome,\" he said. \"Life isn't about grown men's feelings. If nobody ever gave a s*** about my part of life, why should I care about yours?\"He added: \"No politician is good, but there are politicians that are worse than the other ones. At some point you got to take a stand.\"The New York protest wound down by 6 p.m., with some groups staying behind to chant and speak out against what they described as \"the destruction of our government and our economy for the benefit of Trump and his billionaire allies,\" as one protester told Newsweek.Earlier this week, Trump announced global sweeping tariffs that have rattled global and domestic markets, with Wall Street tanking over the past few days, marking the worst days for the U.S. stock markets since 2020.What People Are SayingThe Hands Off! mission statement articulates specific grievances: \"They're dismantling Social Security and Medicare—forcing seniors and disabled Americans to jump through hoops to access the benefits they've already paid into. They're handing trillions to billionaires—while forcing the rest of us to pay higher prices for food, rent, and healthcare.\"President Donald Trump told Fox News in February: \"Social Security won't be touched, other than if there's fraud or something... It's going to be strengthened... Medicare, Medicaid, none of that stuff is going to be touched.\"Former Vice President Kamala Harris wrote on X, formerly Twitter, on Saturday: \"Today, in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.\"Trump has distanced himself from Project 2025 and previously called parts of the 900-page guideline spearheaded by The Heritage Foundation \"ridiculous and abysmal.\" However, he has brought on some individuals associated with it into his administration.What Happens Next?Organizers hope the nationwide protests will sway lawmakers on issues such as voting rights, social services, and economic policy.","summary":"Protesters targeted Trump and Musk over federal layoffs, immigration crackdowns, and U.S. involvement in Ukraine and Gaza, among other issues.","url":"https://www.newsweek.com/hands-off-protesters-why-they-are-rallying-against-trump-musk-2055931","image":"https://d.newsweek.com/en/full/2621809/new-york-city-hands-off.jpg","video":null,"publish_date":"2025-04-05 23:25:42","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.054},{"id":308108820,"title":"Farmers market season kicks off in Lincoln Park: 'A dedication to shopping local'","text":"On Saturday, Green City Market kicked off farmers market season with its annual Lincoln Park event, where shoppers can track ingredients in their purchases within the market’s boundaries.\n\nSample a beverage from Jun Bug Kombucha? Walk over to Ellis Family Farms, where the honey was sourced.\n\nBuy a batch of lacto-fermented vegetables from Sidekick Ferments? Head over to Jacobson Family Farms to shop the produce in its natural state.\n\nEat a salad with feta from Closed Loop Farms? There’s even more cheese at J2K Capraio’s booth.\n\n“We’re using at least five other vendors,” said Jake Chappell, 32, the home delivery manager for Back of the Yards-based Closed Loop Farms. “It’s really great to have cohesion, where everyone’s working together and selling each other’s product and hyping each other up.”\n\nThat collaborative spirit is just one of the highlights of the farmers market on North Clark Street, which runs each Saturday through November. (It will add Wednesday hours beginning in May.) The event features dozens of vendors from Chicago and throughout the Midwest. Thousands of patrons shop for vegetables, flowers, meat, baked goods, coffee, prepared food and even dog treats.\n\nIn addition to providing access to locally grown food in a fun environment, the market has become a place where farmers can branch out and thrive.\n\n“We’re watching our farmers, who maybe started off only doing produce, expanding their farm operations,” said Taylor Choy, Green City Market’s deputy director and chief operating officer. “Now, they’re raising animals, they’re starting to do more regenerative agricultural practices. So we’re growing the farmers also in their businesses here, incubating them. We’re testing out to see if the expansion of their farm operations will yield better sustainability for their businesses.”\n\nNow in its 26th year, Green City Market drew more than 60,000 customers in 2024 to its multiple markets held throughout the year. Choy said that turnout was up 42% over the year before.\n\n“I think that there is maybe greater distrust when we go to grocery stores, where that food is coming from,” said Choy, who cited recent egg shortages and food recalls. “What we see, especially with the last couple of years, are younger generations coming to shop at farmers markets more. There’s a dedication to shopping local.”\n\nFarmers and other business owners may also welcome support from markets amid the turbulent political climate. Choy said one vendor lost a federal contract. \n\nAnd given that the full impact of President Donald Trump’s new tariffs on imported products is unknown, vendors are waiting to see how they will be affected. Their food may be grown in the Midwest, but their packaging — and even their tents — may be produced elsewhere and thus generate extra costs, Choy said. \n\nSam Fazioli, owner of Jun Bug Kombucha, said he was anticipating some price changes for his ingredients. \n\n“We do import tea from Japan,” said Fazioli, 35, who works out of a shared kitchen, which he calls “the fermentation station,” in Lake View. “The tariffs will be affecting those purchases. It hasn’t gone into effect yet, so we haven’t seen it as of yet.”\n\nHe also partners with a local purveyor of saffron, which sources the spice from Afghanistan. \n\n“He hasn’t raised his prices yet,” Fazioli said.\n\nKyle Jacobson, 39, owner of Jacobson Family Farms in north suburban Antioch, said he wasn’t able to predict what might happen for his business. \n\n“All of our packaging is U.S.-made, but who knows, though?” he said. “I don’t have time to think about it. I’ve got to get the seeds in the ground, I’ve got to get the animals rotated into the butcher.”\n\nJacobson, a first-generation farmer who also sells pasture-raised beef, lamb and chicken and pork, called the Lincoln Park market the best in the city.\n\n“On top of the traffic, you have customers that are just real foodies that are willing to explore,” he said. \n\nAmong Saturday’s curious customers were Rachel Auerbach, 28, of Lincoln Park, and Gabrielle Marmon, 29, of Lake View.\n\n“I really like to support local farms and businesses,” said Auerbach, who bought mushroom pasta and pasta sauce. “I feel like that’s so important, especially right now — just the impending drive towards big business.”\n\nMarmon, who purchased cheddar biscuits, said she enjoyed the sense of community at the market.\n\n“I find it really empowering to feel like you’re a part of something local but bigger than yourself.” \n\nPopular among customers was 78-year-old Oriana Kruszewski, who Choy calls the “market grandma.” \n\nThe owner of Oriana’s Orchard in Winslow, near the Wisconsin border, Kruszewski was selling Asian pear products, including dried pear chips, herbal tea and raw vinegar. She was assisted by “Top Chef” contestant and North Pond Restaurant executive chef César Murillo, who uses her pears in his mole. \n\nKruszewski spoke about a love of nature and teaching younger people like Murillo her trade. She also eagerly engaged in conversation with customers, providing detailed information about how she grows her products. \n\nShe’s been a market vendor for decades and said it wasn’t just the business that kept her coming back.\n\n“It’s the atmosphere,” she said.","url":"https://chicago.suntimes.com/food-and-restaurants/2025/04/05/green-city-market-farmers-market-lincoln-park","image":"https://cst.brightspotcdn.com/dims4/default/2ac034c/2147483647/strip/true/crop/6297x3595+0+302/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F0d%2Fee%2F97af889e49598a7d016c9b88b999%2Ffarm","video":null,"publish_date":"2025-04-05 23:23:21","author":"Erica Thompson","authors":["Erica Thompson"],"language":"en","source_country":"us","sentiment":0.052},{"id":308104872,"title":"World News | Indian-American Fort Bend County Judge Arrested on Money Laundering Charges","text":"Houston, Apr 6 (PTI) Fort Bend County judge K P George, a prominent Indian-American elected official, was arrested Friday on two felony counts of money laundering stemming from allegations of wire fraud and falsification of a campaign finance report. George, a Democrat who has served as county judge since 2018 and won re-election in 2022, was booked into the county jail around 3:30 pm and released after posting USD 20,000 for bail. The charges carry a maximum prison term of 10 years. Also Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'. He has denied any wrongdoing and claimed the indictments are politically driven. According to court records and the Fort Bend County District Attorney's Office, George is accused of laundering between USD 30,000 and USD 150,000. Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone. Officials confirmed the new charges are unrelated to a separate 2023 indictment in which George and former chief of staff Taral Patel were accused of manufacturing fake racist attacks against George's 2022 campaign by creating fraudulent social media accounts. \"These charges are unrelated to the pending misdemeanour,\" the DA's office said in a statement. \"Our office remains committed to the integrity our public deserves and the ethics to which all prosecutors are sworn.\" In a statement Friday, George denied any wrongdoing and claimed the indictments were politically driven. \"I have full faith in the judicial system and will vigorously defend my innocence,”\" he said, accusing the DA's office of \"improper treatment\". The District Attorney's Office rejected the claim and emphasised the investigation had been conducted in accordance with legal and ethical standards. The arrest has intensified political pressure on George. Fort Bend County Treasurer Bill Rickert publicly called for his resignation, citing concern over \"fake racism scandals\" and now the money laundering charges. Former Precinct 4 Constable Trever Nehls, who challenged George in 2022, echoed the sentiment, saying, \"This indictment is not surprising. I saw during the campaign how lies and hate were used to manipulate voters.\" The charges against George and Patel have drawn widespread attention, particularly in Fort Bend, one of Texas's fastest-growing and most demographically diverse counties. \"An indictment like this, especially involving alleged financial misconduct, can severely erode public trust even before a trial,\" said Dr. Elena Martinez, a political analyst at the University of Houston. \"Given Fort Bend's national profile, this case is likely to draw attention well beyond the county line.\" George's office announced Thursday -- just a day before his arrest -- that the annual State of the County address, originally scheduled for May 8, had been postponed until further notice. No reason was given at the time. The District Attorney's Office said the investigation remains ongoing. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Fort Bend County judge K P George, a prominent Indian-American elected official, was arrested Friday on two felony counts of money laundering stemming from allegations of wire fraud and falsification of a campaign finance report.","url":"https://www.latestly.com/agency-news/world-news-indian-american-fort-bend-county-judge-arrested-on-money-laundering-charges-6761550.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-04-05 23:18:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.416},{"id":308103514,"title":"US to revoke all visas of South Sudan nationals","text":"The United States says it's revoking all visas held by South Sudan nationals, citing the African country's refusal to accept the repatriation of its citizens.\n\n\"Every country must accept the return of its citizens in a timely manner when another country, including the United States, seeks to remove them,\" US Secretary of State Marco Rubio said in a statement on Saturday.\n\n\"As South Sudan's transitional government has failed to fully respect this principle, effective immediately, the United States Department of State is taking actions to revoke all visas held by South Sudanese passport holders and prevent further issuance to prevent entry into the United States by South Sudanese passport holders.\"\n\nRubio accused the transitional government in Juba of \"taking advantage\" of the US. He added that Washington would be willing \"to review these actions when South Sudan is in full co-operation\".\n\nPresident Donald Trump's administration has taken aggressive measures to ramp up immigration enforcement, including the repatriation of people deemed to be in the US illegally.\n\nThe administration has warned that countries that do not swiftly take back their citizens will face consequences, including visa sanctions or tariffs.\n\nSouth Sudan's embassy in Washington did not respond immediately to a request for comment.\n\nSouth Sudan, with a population of around 11 million, experienced a brutal civil war after it gained independence from its northern neighbour Sudan in 2011.\n\nPresident Salva Kiir and his opponent Vice President Riek Machar formed a joint transitional government in 2020, which is now on the verge of collapse. The domestic political crisis has been escalating for several weeks.\n\nAfrican Union mediators arrived in South Sudan's capital Juba this week for talks aimed at averting a new civil war in the country after its First Vice President Riek Machar was placed under house arrest last week.\n\nThe government has accused Machar, a longtime rival who led rebel forces during a 2013-18 war that killed hundreds of thousands, of trying to stir up a new rebellion.\n\nMachar's detention followed weeks of fighting in the northern Upper Nile state between the military and the White Army militia. Machar's forces were allied with the White Army during the civil war but deny any current links.\n\nThe 2013-18 war was contested largely along ethnic lines, with fighters from the Dinka, the country's largest group, lining up behind Kiir, and those from the Nuer, the second-largest group, supporting Machar.\n\nwith reuters","summary":"The US is revoking all visas held by South Sudanese passport holders over the African nation's failure to accept the return of repatriated citizens.","url":"https://thewest.com.au/politics/us-to-revoke-all-visas-of-south-sudan-nationals-c-18279841","image":"https://images.thewest.com.au/publication/C-18279841/94a3688c1705b388ca9e6859820cc76af0f40e18-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-04-05 23:11:07","author":"South Sudan,Staff Writers","authors":["South Sudan","Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.049},{"id":308104916,"title":"Protesters Rally Against Trump and Musk in Nationwide ‘Hands Off!’ Events","text":"WASHINGTON — Crowds of people angry about the way President Donald Trump is running the country marched and rallied in scores of American cities Saturday in the biggest day of demonstrations yet by an opposition movement trying to regain its momentum after the shock of the Republican’s first weeks in office.\n\nSo-called Hands Off! demonstrations were organized for more than 1,200 locations in all 50 states by more than 150 groups including civil rights organizations, labor unions, LBGTQ+ advocates, veterans and elections activists. The rallies appeared peaceful, with no immediate reports of arrests.\n\nFrom the National Mall and Midtown Manhattan to Boston Common and multiple state capitols, thousands of protesters assailed Trump and billionaire Elon Musk ‘s actions on government downsizing, the economy, immigration and human rights. In Seattle, in the shadow of the city’s iconic Space Needle, protesters held signs with slogans like “Fight the oligarchy.”\n\nMusk, a Trump adviser who owns Tesla, SpaceX and the social media platform X, has played a key role in the downsizing as the head of the newly created Department of Government Efficiency. He says he is saving taxpayers billions of dollars.\n\nKelley Robinson, president of the Human Rights Campaign advocacy group, criticized the administration’s treatment of the LBGTQ+ community at the rally at the National Mall, where Democratic members of Congress also took the stage.\n\n“The attacks that we’re seeing, they’re not just political. They are personal, y’all,” Robinson said. “They’re trying to ban our books, they’re slashing HIV prevention funding, they’re criminalizing our doctors, our teachers, our families and our lives.”\n\n“We don’t want this America, y’all,” Robinson added. “We want the America we deserve, where dignity, safety and freedom belong not to some of us, but to all of us.”\n\nIn Boston, demonstrators brandished signs such as “Hands off our democracy” and “Hands off our Social Security.”\n\nMayor Michelle Wu said she does not want her children and others’ to live in a world in which threats and intimidation are government tactics and values like diversity and equality are under attack.\n\n“I refuse to accept that they could grow up in a world where immigrants like their grandma and grandpa are automatically presumed to be criminals,” Wu said.\n\nRoger Broom, 66, a retiree from Delaware County, Ohio, was one of hundreds who rallied at the Statehouse in Columbus. He said he used to be a Reagan Republican but has been turned off by Trump.\n\n“He’s tearing this country apart,” Broom said. “It’s just an administration of grievances.”\n\nHundreds of people also demonstrated in Palm Beach Gardens, Florida, a few miles from Trump’s golf course in Jupiter, where he spent the morning at the club’s Senior Club Championship. People lined both sides of PGA Drive, encouraging cars to honk and chanting slogans against Trump.\n\n“They need to keep their hands off of our Social Security,” said Archer Moran of Port St. Lucie, Florida.\n\n“The list of what they need to keep their hands off of is too long,” Moran said. “And it’s amazing how soon these protests are happening since he’s taken office.”\n\nThe president planned to go golfing again Sunday, according to the White House.\n\nAsked about the protests, the White House said in a statement that “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries. Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.”\n\nActivists have staged nationwide demonstrations against Trump and Musk multiple times since Trump returned to office. But before Saturday the opposition movement had yet to produce a mass mobilization like the Women’s March in 2017, which brought thousands of women to Washington after Trump’s first inauguration, or the Black Lives Matter demonstrations that erupted in multiple cities after George Floyd’s killing by police in Minneapolis in 2020.\n\nIn Charlotte, North Carolina, protesters said they were supporting a variety of causes, from Social Security and education to immigration and women’s reproductive rights.\n\n“Regardless of your party, regardless of who you voted for, what’s going on today, what’s happening today is abhorrent,” said Britt Castillo, 35, of Charlotte. “It’s disgusting, and as broken as our current system might be, the way that the current administration is going about trying to fix things — it is not the way to do it. They’re not listening to the people.”\n\nAssociated Press journalists Julie Carr Smyth in Columbus, Ohio, Fatima Hussein in West Palm Beach, Florida, and Erik Verduzco in Charlotte, North Carolina, contributed.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSo-called Hands Off! demonstrations were organized for more than 1,200 locations in&#8230;\n\n\nThis Post: Protesters Rally Against Trump and Musk in Nationwide &#8216;Hands Off!&#8217; Events first appeared on Internewscast Journal","url":"https://internewscast.com/news/protesters-rally-against-trump-and-musk-in-nationwide-hands-off-events/","image":"https://media.tegna-media.com/assets/CCT/images/f8e2ff82-5eb3-4b18-9cc0-b579d9093f9f/20250405T173318/f8e2ff82-5eb3-4b18-9cc0-b579d9093f9f_750x422.jpg","video":null,"publish_date":"2025-04-05 23:02:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.147},{"id":308104926,"title":"Masses of Anti-Musk Demonstrators Flood ICE’s DC Office While Trump Unconcernedly Golfs During Nationwide Protests","text":"Thousands of protestors swarmed ICE’s Washington DC headquarters amid nationwide demonstrations against President Donald Trump and DOGE head Elon Musk.\n\nThe protesters formed a ring of steel around the structure on Saturday, decrying Trump’s mass deportation policies following the detainment of doctoral student Rumeysa Ozturk, 30, from Tufts University.\n\nIt came as hundreds of thousands of others took to the streets to protest the, ‘Trump-Musk billionaire takeover and the Republican assault on our freedoms and our communities’.\n\nVideos posted on social media showed demonstrators clutching Palestinian flags and signs that read, ‘Let Gaza Live!’ rallying around the the Customs and Border Protection headquarters.\n\nThe president was far from the action however and spent the day playing golf at his Florida resort. \n\nOzturk was detained by ICE agents while walking down a suburban Boston street on March 25 and placed in a detention center in Louisiana. \n\nThe Department of Homeland Security said she and two other Palestinian students at Columbia University, Ranjani Srinivasani and Mahmoud Khalil, were detained because of their ‘support for Hamas’.\n\nTheir detentions have sparked outrage from civil rights advocates and immigration lawyers who claim they were unlawfully detained.\n\nOn Saturday the students’ supporters marched side by side members of almost 200 groups as part of the ‘Hands Off!’ demonstration.\n\nThe organization said that nearly 600,000 people signed up to participate.\n\n‘Whether you’re outraged by skyrocketing healthcare costs, job cuts, attacks on privacy, or the gutting of essential services—this moment is for you. Whether you’ve been in the fight for years or you’re just fed up and ready to take action—this moment is for you,’ the organizer toolkit read. \n\nBritt Jocovich, a spokesperson for MoveOn, another progressive organization leading the protests told the New York Times ahead of the protests, ‘We need to bring in new people, and that’s where Trump’s policies are so consequential.’\n\nJocovich also argued that ‘reality has hit’ differently during Trump’s second administration than it did in his first term. \n\nLeah Greenberg, the co-founder of Indivisible, told the Times that the march is intended to show the public that economic attacks and attacks on civil rights are intertwined. \n\n‘They are not different things. They come from an anti-democratic alliance taking over and attacking fundamental parts of our democracy.’\n\nRepresentatives join the fight \n\nRepresentatives also joined the protests amid calls from Democrat constituents for their party to present a stronger front against Trump and the Republicans. \n\nTexas Representative Al Green, who made headlines in March after he was censured for shouting during Trump’s address to Congress, spoke at the Washington DC demonstration. \n\n‘You don’t deserve the office you hold,’ Green said, addressing Trump. \n\n‘You can’t be entrusted with liberty and justice for all. You can’t be entrusted with the government of the people by the people for the people. I’m coming for you,’ he concluded, as reported by The Hill. \n\nGreen attended the Washington rally wearing a shirt that fittingly read, ‘censured not silenced.’ \n\nIn New York, thousands were seen flooding 5th avenue with American flags, Ukrainian flags, and signs that pictured Secretary of Defense Pete Hegseth and Trump captioned, ‘Have you no shame?’ \n\nProtestors also lined the Boston Common in Massachusetts with signs that read, ‘This is the government our founders warned us about,’ and ‘You can’t spell hatred without red hat.’\n\nRepresentative Maxwell Frost shared photos on X at a Florida rally and captioned the post, ‘Fight for freedom, save America.’ \n\n Georgia Representative Hank Johnson shared a video of himself on X marching with protestors while holding a sign that read, ‘Hands Off!’ \n\nCalifornia Representative Eric Swalwell took his speaking opportunity at a DC rally to slam Trump for going on a golf trip amid tariff concerns. \n\n‘So, to Donald Trump, I say, get your a** off the golf course and face the people,’ he taunted. \n\nThe demonstration marks the first massive protest against Trump since the Women’s March in 2017. \n\nThe Women’s March included A-list stars like Madonna, Miley Cyrus, Jane Fonda, and Cher. \n\nTrump on defense \n\nTrump hasn’t responded to the protests yet, but defended his tariff economic plan on Truth Social on Saturday morning claiming, ‘China has been hit much harder than the USA, not even close. \n\n‘They, and many other nations, have treated us unsustainably badly. We have been the dumb and helpless “whipping post,” but not any longer.’\n\nHe went on to say that his administration was leading an ‘economic revolution’ and that the end result would be ‘historic.’ \n\nTrump landed in his Florida sanctuary on Thursday, where he attended a Saudi-backed LIV Golf tournament. \n\nOn Saturday he won the Senior Club Championship second round and is expected to compete in Sunday’s Championship round.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThousands of protestors swarmed ICE&#8217;s Washington DC headquarters amid nationwide demonstrations against&#8230;\n\n\nThis Post: Masses of Anti-Musk Demonstrators Flood ICE&#8217;s DC Office While Trump Unconcernedly Golfs During Nationwide Protests first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/masses-of-anti-musk-demonstrators-flood-ices-dc-office-while-trump-unconcernedly-golfs-during-nationwide-protests/","image":"https://i.dailymail.co.uk/1s/2025/04/05/22/96961313-0-image-a-5_1743889132129.jpg","video":null,"publish_date":"2025-04-05 23:00:52","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.022},{"id":308107066,"title":"How to watch UFC for free tonight: Time, channel, stream","text":"The UFC will air live on cable Saturday, with the event taking place at it’s home base UFC Apex in Las Vegas. Grizzled veteran Josh Emmett looks to get back into the featherweight title discussion against undefeated Lerone Murphy. \n\nWatch: UFC Fight Night: Emmett vs. Murphy will air on ESPN, and can be streamed on DirecTV Stream (free trial). \n\nHere’s what you need to know:\n\nWhat: UFC Fight Night: Emmett vs. Murphy\n\nWho: Josh Emmett (19-4) vs. Lerone Murphy (15-0-1)\n\nWhen: Saturday, April 5, 2025\n\nTime: Main card starts 9 p.m. ET, Prelims begin at 6 p.m. ET\n\nWhere: UFC Apex, Las Vegas, Nevada\n\nTV: ESPN, ESPNU\n\nStream: DirecTV Stream (free trial), fuboTV (free trial), ESPN+\n\nCan I bet on the fights?\n\nYes, you can bet on UFC Fight Night: Emmett vs. Murphy from your phone in New York State, and we’ve compiled some of the best introductory offers to help navigate your first bets from BetMGM, FanDuel, DraftKings, Bet365 and more.\n\nLerone Murphy is a -330 favorite to beat Josh Emmett on FanDuel. \n\nHere’s a recent UFC story from the Associated Press:\n\nNEW YORK (AP) — UFC is joining up with Facebook’s parent company Meta in a deal that will bring mixed martial arts to more fans around the world.\n\nThe companies said Wednesday that their multiyear partnership will give UFC the ability to use Meta’s technology platforms, services, and products, including Meta AI, Meta Glasses, Meta Quest, Facebook, Instagram, WhatsApp and Threads, so that UFC fans have more ways to view its content.\n\nMeta and UFC, whose parent company is TKO Group, said they will work together to incorporate Meta’s AI glasses into UFC events.\n\n“Meta has the greatest minds in tech and they are going to take fan engagement to the next level,” UFC President and CEO Dana White said in a statement.\n\nWhite mentioned that Meta is already working on some innovations for a new fighter rankings system.\n\nThe deal, whose financial terms were not disclosed, will also see the Meta brand appear in UFC’s Octagon, as well as across numerous broadcasts. Meta’s social media platform Threads will feature exclusive original UFC content.\n\n“I love this sport and I’m looking forward to working with the UFC to let fans experience it in new ways,” Meta Founder and CEO Mark Zuckerberg said.\n\nZuckerberg is trained in mixed martial arts and posted about completing his first jiu jitsu tournament in 2023. That same year, there were talks of him and Tesla CEO Elon Musk squaring off in a “cage match,” but the event never happened.\n\nZuckerberg and White are no strangers to each other, with White joining Meta’s board of directors in January.\n\nBoth Zuckerberg and White are among the many high profile business figures within the orbit of President Donald Trump. After Trump won reelection in November, Zuckerberg dined at the president-elect’s Mar-a-Lago club in Florida and Meta donated $1 million to Trump’s inauguration fund. Other Big Tech companies such as Amazon have donated similar amounts.\n\nTrump is a longtime UFC fan and frequent attendee of major fights. His ties with White date back to 2001, when White hosted a UFC at the Republican’s former casino-hotel in Atlantic City, New Jersey, the Trump Taj Mahal. Trump has also appeared with White at UFC matches over the years, especially in his 2024 campaign as part of efforts to appeal to younger male voters.\n\nWhite has had speaking roles at the 2016, 2020 and 2024 Republican conventions and appeared on stage at Trump’s election victory party in November.\n\nShares of Meta Platforms Inc. rose slightly in midday trading, while shares of TKO Group Holdings Inc. climbed more than 2%.\n\nWhat is DirecTV Stream?\n\nDirecTV Stream is a comprehensive internet TV service that offers your favorite entertainment, news and sports channels, as well as local TV stations and regional sports networks. It’s the only choice for fans who want full access to local, televised sports. DirecTV Choice includes 125+ channels, unlimited DVR storage and thousands of on-demand titles.","summary":"How to watch UFC for free tonight: Time, channel, stream","url":"https://www.syracuse.com/tv/2025/04/how-to-watch-ufc-fight-night-for-free-tonight-time-channel-stream.html","image":"https://www.syracuse.com/resizer/v2/E3X443WXTBECBAW5WHRKHZBR7A.jpg?auth=0d3b045da280fb4e24599316172ab9c14f2870d2c950f7ff87fc15806b5f898c&width=1280&quality=90","video":null,"publish_date":"2025-04-05 23:00:00","author":"Joey Aliberti","authors":["Joey Aliberti"],"language":"en","source_country":"us","sentiment":0.196},{"id":308107700,"title":"Alexandra Shulman's Notebook: They're not the Beatles but the new boys look fab","text":"The actors cast in the upcoming Beatles biopics being directed by Sam Mendes are a brilliant illustration of how ideas of physical attraction change over time.\n\nThe new Fab Four – Paul Mescal as Paul, Harris Dickinson as John, Barry Keoghan as quirky Ringo and Joseph Quinn as George – are some of the most fashionable and desirable young actors around. But they look nothing like the original Beatles, who, pictured in their prime with their moptop hairdos, appear faintly ridiculous to the modern eye.\n\nIt’s intelligent casting. The physical attraction of performers is often linked to how they have previously appeared. Would Mescal have the same allure if it weren’t for his winning turn as the love interest in the BBC’s Normal People?\n\nMendes needs his crew to have contemporary sex appeal to avoid being a pastiche of the past. That’s not to say John, Paul, Ringo and George weren’t extremely alluring.\n\nDuring one Liverpool television news meeting, the editor announced he had been offered an item about The Beatles. ‘The Beatles? The Beatles? I’ve had it with the Beatles. How about you?’ he asked an attractive female colleague and girl about town. ‘Three of them,’ she replied unabashedly.\n\nLauren’s giant leap for womenkind\n\nSay what you like about Lauren Sanchez, Amazon boss Jeff Bezos’ pneumatic wife-to-be, but you have to admit she’s got chutzpah.\n\nThe women-only crew she has gathered to launch into space on her husband’s Rocketship NS-31 mission includes broadcaster Gayle King, singer Katy Perry, civil rights activist Amanda Nguyen and rocket scientist Aisha Bowe. Sanchez says she wanted to ‘expand what explorers look like for the next generation’.\n\nThey certainly redefined the look on Elle magazine’s cover, styled in leather corsets, towering stilettos, plunging necklines and clinging pantsuits – channelling the team leader’s overt style.\n\nThey’ll probably have to ditch those outfits for the actual flight, but even so it’s refreshing to see a group of successful women daring to delight in fashion. When I was at Vogue, I hoped to encourage women in a range of professions to talk about fashion and beauty. In the Elle interview, they joke about whether their eyelash extensions will stay on in space.\n\nI wish them all the best when they take off on April 14.\n\nPerhaps Lauren will come back inspired by the incredible view of the Earth to urge her husband’s pal Donald Trump to take a more generous attitude towards the rest of the globe.\n\nTrump is getting nothing out of me\n\nTo be honest, I hadn’t thought about tariffs until Trump’s Liberation Day, which prompted me to work out what I buy from the US – and decide whether to boycott it. It turned out nothing in our household is American, apart from several pricey James Perse T-shirts.\n\nI scoured our kitchen cupboards and came up with a single jar of Hellmann’s mayonnaise, and even that is now owned by British multinational Unilever.\n\nI’ve never owned an American car and we don’t buy American alcohol (except for a bottle of Jack Daniel’s at Christmas for Phil, our plumber).\n\nThe only area where the US has infiltrated my bank account is tech. We’re an Apple and Amazon household, and Netflix and Disney+ presumably count, too. Perhaps it’s time to switch and put my money where my mouth is and dump the Amazon habit.\n\nMeghan’s £16 jam is a tariff too far\n\nLiberation Day will not be very liberating for Meghan Sussex, who has just launched her For Ever range.\n\nWith the new impetus to buy British, I suspect anyone here who had been waiting to snap up her £16 raspberry spread might decide Tiptree’s £3.80 version, farmed in Essex, will do just fine.\n\nI’m Zapp-happy – even on my sick bed\n\nIt's expensive being stuck in bed these days. I’ve been laid up with suspected food poisoning, but it wasn’t enough to stop me doing a spot of online shopping.\n\nAs well as purchasing a new dress I hadn’t previously felt I needed, I experimented with Zapp, a grocery delivery app I wish I hadn’t discovered. It’s lethal.\n\nMy dodgy tummy left me craving bread, bananas and honey, none of which we had in the house. So I tapped them into Zapp.\n\nHey presto, within half an hour all three arrived – and only fractionally more expensive than if I’d waited and added them to my next Ocado order.\n\nDeliveroo offers the same service, but it just doesn’t have the same appeal. Zapp tempts shoppers with a well-designed carousel of high-end produce alongside the basics. There’s Daylesford soups, Fortnum & Mason teas and, should it take your fancy, vintage Dom Perignon 2013 at £299.99.\n\nOr there’s the option of improving life by adding a pricey but delicious Cire Trudon candle to the basket, or a box of Charbonnel and Walker sea salt truffles. It’s hard to add lustre to shopping online, but Zapp has achieved it by creating something with the fun of old-fashioned window shopping.\n\nNot grand – but a premium return\n\nBy the time you read this I will no doubt have lost money on the Grand National.\n\nEvery year I place my bets and every year I come out the loser. It’s hardly surprising, since I make my uncharacteristically slapdash decision based on names rather than form.\n\nThis year, though, I will take consolation from having won on my Premium bonds four months in a row. It’s not made me wealthy – and, frankly, if the money were invested somewhere else the return would be higher – but there’s something cheering about waking up to an email saying: ‘Alexandra, you’ve just won…’\n\nIt’ll take the edge of knowing the bookie has got the better of me once again.","summary":"The actors cast in the upcoming Beatles biopics being directed by Sam Mendes are a brilliant illustration of how ideas of physical attraction change over time.","url":"https://www.dailymail.co.uk/femail/article-14575595/Alexandra-Shulmans-Notebook-Beatles.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/22/96961241-0-image-m-21_1743888682533.jpg","video":null,"publish_date":"2025-04-05 22:59:13","author":"Alexandra Shulman,Editor","authors":["Alexandra Shulman","Editor"],"language":"en","source_country":"gb","sentiment":0.343},{"id":308103510,"title":"UK PM ready to 'shelter' businesses from tariff storm","text":"British Prime Minister Keir Starmer says he's ready to step in to help \"shelter\" the country's businesses from the fallout from US President Donald Trump's new tariff policies, mooting state intervention for the worst-affected industries.\n\n\"We stand ready to use industrial policy to help shelter British business from the storm,\" Starmer wrote in the Telegraph newspaper.\n\n\"Some people may feel uncomfortable about this – the idea the state should intervene directly to shape the market has often been derided,\" he said.\n\n\"But we simply cannot cling on to old sentiments when the world is turning this fast.\"\n\nWhile Starmer said the government's priority remains to try and secure a trade deal with the US which could include tariff exemptions, he said he will do \"everything necessary\" to protect the national interest.\n\nBritain was spared the most punitive treatment in Trump's tariff announcement on Wednesday when it was hit with the lowest import duty rate of 10 per cent, but a global trade war will hurt its open economy.\n\n\"This week we will turbocharge plans that will improve our domestic competitiveness, so we're less exposed to these kinds of global shocks,\" he said, adding that the government also wanted to strengthen alliances and reduce barriers to trade.\n\nThe Telegraph said that Starmer's government could bring in emergency reforms to reduce red tape around regulation and raised the prospect of targeted tax breaks to help affected sectors.\n\nBritish car maker Jaguar Land Rover said on Saturday it would pause shipments of cars to the US for a month due to the tariffs, adding to fears about the impact on an industry which employs 200,000 people in the UK.\n\nWriting in the newspaper, Starmer reiterated he would take a \"cool-headed\" approach to the tariffs rather than immediately retaliating, but he added: \"All options remain on the table\".\n\nBritain on Wednesday published a 400-page list of US goods it could include in any possible retaliatory tariff response.","summary":"As Trump's tariffs begin Jaguar Land Rover has suspended shipments of its cars to the US and the UK prime minister flags he's ready to help British industries.","url":"https://thewest.com.au/business/uk-pm-ready-to-shelter-businesses-from-tariff-storm-c-18279644","image":"https://images.thewest.com.au/publication/C-18279644/1d91f4ce1f896ec7dbca1a3c8329a84901834751-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-04-05 22:54:05","author":"Staff Writers","authors":["Staff Writers"],"language":"en","source_country":"au","sentiment":-0.015},{"id":308104422,"title":"China Hit With 54% \"Reciprocal Tariff\" Rate Following Trump Address. 3 Things Pinduoduo Stock Investors Should Know","text":"Stocks plunged on Thursday in response to President Donald Trump's \"reciprocal tariffs.\"\n\nWhile the president had telegraphed his desire for punitive tariffs to try to balance the trade deficit the U.S. has with much of the world, investors were taken aback by their size. China has long served as a scapegoat for Trump so perhaps it's not a surprise that goods imported from China will now face a 54% tariff, which includes a 20% rate the president imposed earlier.\n\nU.S. stocks tumbled on the news, but the impact on Chinese listings was much more modest, as the iShares MSCI China ETF was down just 0.9% on Thursday.\n\nInternational stocks are outperforming U.S. stocks so far this year, and that makes sense. Not only do international stocks have less exposure to Trump's trade war and the weakening consumer confidence in the U.S., but valuations are much lower in international equities, especially entering the year.\n\nChina stocks are especially cheap right now, and one that has been a standout performer in recent years is PDD Holdings (PDD -8.37%), the parent of Pinduoduo and Temu, which is challenging Alibaba and JD.com for e-commerce supremacy in China. Let's take a look at what PDD stock investors should know about the tariffs.\n\n1. What the retaliation tariffs mean for China\n\nThe 54% tariffs being imposed in China will affect the Chinese economy in a number of ways. Already, a number of companies like Nike have moved some of its production out of China to neighboring countries like Vietnam, and that trend could accelerate as companies looking to avoid the tariffs move production to countries with lower rates or even to the U.S.\n\nIn 2024, U.S. imports from China totaled $438.9 billion. In addition to sending production out of China, the trade war could also weigh on an already weak Chinese economy if it makes goods more expensive, and China has already said that it will impose its own tariffs to protect its economy and its interests.\n\nThe size of the impact on the Chinese economy is unclear, but more consumer weakness will weigh on e-commerce operators like PDD Holdings.\n\n2. Imports to the U.S will be affected\n\nPDD Holdings doesn't break down its revenue by region, but the company has put considerable effort into marketing Temu, its low-cost e-commerce platform, enough so that it's made the digital advertising market more competitive and it's grabbed market share from a number of e-commerce companies and other retailers.\n\nAmazon has responded to the threat from Temu and Shein by launching Haul, its own low-cost platform, though it's unclear how it's performing. \n\nPDD brought in $54 billion in revenue in 2024, but its gross merchandise volume (GMV), or the value of goods sold on its platform, is likely much larger. At a minimum, the company likely did $5 billion in GMV in the U.S., but it's probably several times larger than that, given Temu's impact on the e-commerce market. \n\nAdvertising is the biggest source of revenue for the company so it's also reliant on advertisers being confident in customers spending on the platform.\n\n3. U.S. investors could rotate to China\n\nPrior to the tariffs announcement, some investors were already rotating into Chinese stocks, including billionaire David Tepper, seeing an opportunity there as Chinese stocks are much cheaper than their U.S. counterparts.\n\nIn that sense, PDD Holdings could benefit if the tariffs drive the U.S. economy into a recession as it's one of the more popular Chinese stocks for American investors to own.\n\nThough its growth rate has slowed down in recent quarters, the company reported 24% revenue growth in the fourth quarter, continuing to outperform competitors like Alibaba and JD.com.\n\nAt a price-to-earnings ratio of just 11, there's a good argument for buying PDD based on its fundamentals.","url":"https://www.fool.com/investing/2025/04/05/china-hit-with-54-reciprocal-tariff-rate-following/?source=askdougpancakes&utm_source=chromefollow&utm_medium=feed&utm_campaign=news&referring_guid=25abd443-2d20-4f1e-aee4-7a745c490a46","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F813681%2Fchina-e-commerce.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-04-05 22:51:00","author":"Jeremy Bowman","authors":["Jeremy Bowman"],"language":"en","source_country":"us","sentiment":-0.069},{"id":308106068,"title":"‘This has got to be a moment in America,’ Cory Booker tells 1st town hall since record speech","text":"By Mike Catalini | Associated Press\n\nPARAMUS, N.J. — Democratic Sen. Cory Booker took a version of his record-breaking Senate floor speech on the road Saturday to a town hall meeting in a New Jersey gymnasium, calling on people to find out what they can do to push back on President Donald Trump’s agenda.\n\nBooker took questions at suburban New Jersey’s Bergen Community College the same day as more than 1,200 “Hands Off!” demonstrations were planned around the country. The town hall event was punctuated both by celebratory shouts of “Cory, Cory” as well as at least a half-dozen interruptions by protesters.\n\nIt was Booker’s first in-person event in his home state since his speech this week, where he held the Senate floor for 25 hours and 5 minutes in opposition to Trump’s policies. In doing so, he broke the record for the longest floor speech, which was set by segregationist Sen. Strom Thurmond in opposition to the Civil Rights Act of 1957.\n\nQuestioner after questioner asked what they could be doing to show their disagreement and worry over the president’s policies. Booker told them it only takes a little bit more — could they afford a trip to Washington to lobby against budget cuts? One of the loudest moments of applause came after he addressed a woman who said she worried about what potential Medicaid cuts could mean for her son with autism.\n\n“A gathering like this can’t be the end of our activism,” Booker said. “This has got to be a moment in America where all of us begin to say, what more can I do?”\n\nThe questions and Booker’s response mirror what voters and other Democrats have been hearing during town halls. He said he didn’t want to focus on the Democratic Party, which has struggled to find a message since losing the 2024 election. Instead, he said, he would focus on “the people of our country.”\n\n“I think the Democratic Party lost a lot of elections because people didn’t believe that they cared about them. So let’s stop worrying about the politics and get more focused on the people,” Booker said.\n\nAfter the event, Booker said he was reluctant to tell people the exact tactics to use, citing civil rights activists like the late John Lewis. He said creativity has a role to play.\n\n“I know one thing it’s not is sitting down and doing nothing and just watching on TV and getting stuck in a state of sedentary agitation,” he said. “Everybody has to be taking measures to put the pressure on to change.”\n\nBooker, who ran unsuccessfully for president in 2020, said after the event that he was focused on running for reelection to the Senate in 2026 and that 2028 “will take care of itself.”\n\nBooker, 55, is in his second full term in the Senate. He chairs the Strategic Communications Committee, his party’s messaging arm. His team is focused on boosting Senate Democrats’ presence across social platforms through more frequent and casual content.\n\nBooker himself has amassed one of the largest followings on social media platforms like Instagram, TikTok and X, where his commentary appears to connect with the party’s base. But staffers are now focused on how to transfer that success to Booker’s fellow senators, who are often less digitally fluent and face different political landscapes in their home states.\n\nThat has involved turning the communications committee into a nerve center for testing and coordinating the easiest-to-use formats for lawmakers looking to boost their digital brands.\n\nBooker hopes to double the engagement senators receive with their content directly online and increase the caucus’ appearances with online digital media personalities.\n\nThe start of Saturday’s event included six disruptions, including by several people who decried the treatment of Palestinians. Police in the gymnasium escorted them from the arena.\n\n“I hear you and I see you,” Booker said.\n\nAssociated Press reporter Matt Brown in Washington contributed.","summary":"Sen. Booker took questions at suburban New Jersey’s Bergen Community College the same day as more than 1,200 “Hands Off!” demonstrations were planned around the country.","url":"https://www.mercurynews.com/2025/04/05/this-has-got-to-be-a-moment-in-america-cory-booker-tells-1st-town-hall-since-record-speech/","image":"https://www.mercurynews.com/wp-content/uploads/2025/04/Cory_Booker_78188.jpg?w=1024&h=683","video":null,"publish_date":"2025-04-05 22:46:00","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.312},{"id":308103372,"title":"Trump Enjoys ‘Big Moneymaking Weekend’ Amid Market Meltdown","text":"President Donald Trump is holed up at two of his Florida resorts for a “big moneymaking weekend” after his tariff announcement sent the stock market careening downward, according to a New York Times report.\n\nIn just a few days, Trump managed to hold multiple glitzy fundraisers as well as a LIV Golf tournament—the fourth tournament paid for by Saudi Arabia’s sovereign wealth fund to be hosted at a Trump course, the Times reported.\n\nTrump on Wednesday announced a sweeping universal tariff plan. All goods entering the U.S. were hit with a baseline 10 percent tax, while certain trading partners will be tariffed at much higher rates.\n\nIn the two days of trading since, the S&P 500, an indicator of the market’s overall performance, has lost more than 10 percent of its value. It is one of the worst stock market crashes in American history.\n\nThe scene in Trump’s corner of Florida, however, did not reflect the catastrophe unfolding in the American markets, based on details reported by the Times.\n\nOn Thursday at Mar-a-Lago, hundreds gathered for the American Patriots Gala, a right-wing fundraiser attended by Secretary of Homeland Security Kristi Noem and Argentinian President Javier Milei—but not Trump himself. \n\nThe president, meanwhile, was 70 miles down the coast, at another of his properties, the Trump National Doral resort. His helicopter touched down just in time to host a dinner at Doral. \n\nHe was there, rather than Mar-a-Lago, to attend the LIV Golf tournament on Friday. Trump drew much criticism for his spectatorship on two fronts: the bad optics of enjoying a sporting event while the stock market tanked and the fact that the president missed an event honoring dead American soldiers to be there.\n\nThe vibe at the LIV tournament was party-like, per the Times. Club music blasted out of speakers. Beer and wine dispensers lined the tourney’s courses. The Doral sold out all of its 643 rooms for the event, including its $13,000 presidential suite, the Times reported.\n\nAt one point on Friday, as stocks slumped even farther, Trump posted to Truth Social that “THIS IS A GREAT TIME TO GET RICH, RICHER THAN EVER BEFORE.”\n\nBy nightfall, it was time for another fundraiser. The president, now back at Mar-a-Lago, hosted a $1 million-a-plate private dinner. It was at least the fourth such event Trump has hosted since entering office. A fifth is slated for April 24. \n\nWith just an hour or two of work, Trump can clear as much as $20 million from the events, during which he listens to around 20 attendees discuss their business ventures one-by-one over dinner in the club’s “White and Gold Room.”\n\nGuests at the session on Friday included cosmetics heir Ronald Lauder and casino mogul Steve Wynn. \n\nOn Saturday, Trump made his way to another of his golf courses to throw his own hat in the ring for a smaller tournament. \n\nThe White House, which didn’t allow reporters to observe or photograph the president’s day on the links, offered an update after the fact: “The president won his second round matchup of the senior club championship today in Jupiter, Fla., and advances to the championship round on Sunday.”","summary":"Chip Somodevilla / Getty ImagesPresident Donald Trump is holed up at two of his Florida resorts for a “big moneymaking weekend” after his tariff announcement sent the stock market careening downward, according to a New York Times report.\n\nIn just a few days, Trump managed to hold multiple glitzy fundraisers as well as a LIV Golf tournament—the fourth tournament paid for by Saudi Arabia’s sovereign wealth fund to be hosted at a Trump course, the Times reported.\n\nTrump on Wednesday announced a sweeping universal tariff plan. All goods entering the U.S. were hit with a baseline 10 percent tax, while certain trading partners will be tariffed at much higher rates.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-enjoys-big-moneymaking-weekend-amid-market-meltdown/","image":"https://www.thedailybeast.com/resizer/v2/PS6OISETPZHQVI4ZROII6NM7FU.jpg?smart=true&auth=7db02e123acd82caddd1833829d7676df277873973dcbc2bb306a4dfb7443e38&width=1440&height=1080","video":null,"publish_date":"2025-04-05 22:43:12","author":"Liam Archacki","authors":["Liam Archacki"],"language":"en","source_country":"us","sentiment":0.089},{"id":308104658,"title":"Starmer pledges to ‘do everything necessary’ to protect UK amid tariffs fallout","text":"Sir Keir Starmer has pledged to “do everything necessary” to protect the UK’s national interest in the wake of Donald Trump’s tariffs, as he said that ministers are “ready to use industrial policy” to help shelter businesses.\n\nThe Prime Minister said that “these new times demand a new mentality”, after the 10% levy on British imports into America came into force.\n\nIt comes as Jaguar Land Rover announced it would “pause” shipments to the US, as businesses are grappling with the new taxes.\n\nThe car manufacturer said on Saturday that it was working to “address the new trading terms” and is looking to “develop our mid- to longer-term plans”.\n\nThe 10% tariff on goods imported into America from around the world kicked in on Saturday morning, while a 25% levy on foreign car imports came into force on Thursday.\n\nWriting in the Sunday Telegraph, Sir Keir said that when it comes to tariffs, “the immediate priority is to keep calm and fight for the best deal”.\n\nThe Prime Minister said that in the coming days “we will turbocharge plans that will improve our domestic competitiveness”, and added: “We stand ready to use industrial policy to help shelter British business from the storm.”\n\nIt is thought that a number of announcements could be made soon as the Government looks to encourage growth.\n\nThe FTSE 100 had its worst day of trading since the start of the pandemic on Friday, with banks among some of the firms to suffer the sharpest losses.\n\nThe Prime Minister wrote: “This week, the Government will do everything necessary to protect Britain’s national interest. Because when global economic sands are shifting, our laser focus on delivering for Britain will not. And these new times demand a new mentality.”\n\nSir Keir has been taking calls from foreign leaders through the weekend to discuss the tariff changes, and shared his “concerns” about the impact on global economics and security in a call with Emmanuel Macron.\n\nIssuing a readout of the conversation with the French President, a Downing Street spokesperson said: “They agreed that a trade war was in nobody’s interests but nothing should be off the table and that it was important to keep business updated on developments.\n\n“The Prime Minister and president also shared their concerns about the global economic and security impact, particularly in South-East Asia.”\n\nWhile the UK is set to continue at the 10% baseline, other nations are due to see their tariff rates increase further next week.\n\nSome of the highest tariff rates have been applied to nations in South-East Asia, with imports from Vietnam will be subject to a 46% tariff, while those from Cambodia will face a 49% rate.\n\nImports from France will see a 20% tariff, the rate that has been set for EU nations.\n\nSir Keir’s call with his French counterpart came after separate conversations with the prime ministers of Italy and Australia on Friday.\n\nMr Trump has warned Americans that the tariffs “won’t be easy”, but urged them to “hang tough”.\n\nIn a post on his TruthSocial platform, the president said: “We are bringing back jobs and businesses like never before. Already, more than FIVE TRILLION DOLLARS OF INVESTMENT, and rising fast! THIS IS AN ECONOMIC REVOLUTION, AND WE WILL WIN. HANG TOUGH, it won’t be easy, but the end result will be historic.”","summary":"The Prime Minister pledged to ‘turbocharge plans that will improve our domestic competitiveness’.","url":"https://www.standard.co.uk/news/politics/keir-starmer-prime-minister-jaguar-land-rover-america-government-b1220953.html","image":"https://static.standard.co.uk/2025/04/05/22/c14789b8c3f66f02fc43f4c30f54a5ceY29udGVudHNlYXJjaGFwaSwxNzQzOTcyODQ5-2.79608891.jpg?width=1200","video":null,"publish_date":"2025-04-05 22:42:29","author":"Caitlin Doherty","authors":["Caitlin Doherty"],"language":"en","source_country":"gb","sentiment":0.036},{"id":308103252,"title":"Thousands of anti-Musk protestors swarm ICE's DC headquarters amid nationwide protests as carefree Trump golfs","text":"Thousands of protestors swarmed ICE's Washington DC headquarters amid nationwide demonstrations against President Donald Trump and DOGE head Elon Musk.\n\nThe protesters formed a ring of steel around the structure on Saturday, decrying Trump's mass deportation policies following the detainment of doctoral student Rumeysa Ozturk, 30, from Tufts University.\n\nIt came as hundreds of thousands of others took to the streets to protest the, 'Trump-Musk billionaire takeover and the Republican assault on our freedoms and our communities'.\n\nVideos posted on social media showed demonstrators clutching Palestinian flags and signs that read, 'Let Gaza Live!' rallying around the the Customs and Border Protection headquarters.\n\nThe president was far from the action however and spent the day playing golf at his Florida resort. \n\nOzturk was detained by ICE agents while walking down a suburban Boston street on March 25 and placed in a detention center in Louisiana. \n\nThe Department of Homeland Security said she and two other Palestinian students at Columbia University, Ranjani Srinivasani and Mahmoud Khalil, were detained because of their 'support for Hamas'.\n\nTheir detentions have sparked outrage from civil rights advocates and immigration lawyers who claim they were unlawfully detained.\n\nOn Saturday the students' supporters marched side by side members of almost 200 groups as part of the 'Hands Off!' demonstration.\n\nThe organization said that nearly 600,000 people signed up to participate.\n\n'Whether you're outraged by skyrocketing healthcare costs, job cuts, attacks on privacy, or the gutting of essential services—this moment is for you. Whether you've been in the fight for years or you're just fed up and ready to take action—this moment is for you,' the organizer toolkit read. \n\nBritt Jocovich, a spokesperson for MoveOn, another progressive organization leading the protests told the New York Times ahead of the protests, 'We need to bring in new people, and that's where Trump's policies are so consequential.'\n\nJocovich also argued that 'reality has hit' differently during Trump's second administration than it did in his first term. \n\nLeah Greenberg, the co-founder of Indivisible, told the Times that the march is intended to show the public that economic attacks and attacks on civil rights are intertwined. \n\n'They are not different things. They come from an anti-democratic alliance taking over and attacking fundamental parts of our democracy.'\n\nRepresentatives join the fight \n\nRepresentatives also joined the protests amid calls from Democrat constituents for their party to present a stronger front against Trump and the Republicans. \n\nTexas Representative Al Green, who made headlines in March after he was censured for shouting during Trump's address to Congress, spoke at the Washington DC demonstration. \n\n'You don't deserve the office you hold,' Green said, addressing Trump. \n\n'You can't be entrusted with liberty and justice for all. You can't be entrusted with the government of the people by the people for the people. I'm coming for you,' he concluded, as reported by The Hill. \n\nGreen attended the Washington rally wearing a shirt that fittingly read, 'censured not silenced.' \n\nIn New York, thousands were seen flooding 5th avenue with American flags, Ukrainian flags, and signs that pictured Secretary of Defense Pete Hegseth and Trump captioned, 'Have you no shame?' \n\nProtestors also lined the Boston Common in Massachusetts with signs that read, 'This is the government our founders warned us about,' and 'You can't spell hatred without red hat.'\n\nRepresentative Maxwell Frost shared photos on X at a Florida rally and captioned the post, 'Fight for freedom, save America.' \n\n Georgia Representative Hank Johnson shared a video of himself on X marching with protestors while holding a sign that read, 'Hands Off!' \n\nCalifornia Representative Eric Swalwell took his speaking opportunity at a DC rally to slam Trump for going on a golf trip amid tariff concerns. \n\n'So, to Donald Trump, I say, get your a** off the golf course and face the people,' he taunted. \n\nThe demonstration marks the first massive protest against Trump since the Women's March in 2017. \n\nThe Women's March included A-list stars like Madonna, Miley Cyrus, Jane Fonda, and Cher. \n\nTrump on defense \n\nTrump hasn't responded to the protests yet, but defended his tariff economic plan on Truth Social on Saturday morning claiming, 'China has been hit much harder than the USA, not even close. \n\n'They, and many other nations, have treated us unsustainably badly. We have been the dumb and helpless “whipping post,” but not any longer.'\n\nHe went on to say that his administration was leading an 'economic revolution' and that the end result would be 'historic.' \n\nTrump landed in his Florida sanctuary on Thursday, where he attended a Saudi-backed LIV Golf tournament. \n\nOn Saturday he won the Senior Club Championship second round and is expected to compete in Sunday's Championship round.","summary":"Protestors took to the streets on \nSaturday to protest President Trump and his 'First Buddy,' Elon Musk, but Trump had other plans.","url":"https://www.dailymail.co.uk/news/article-14575427/elon-musk-protestors-donald-trump-dc-los-angeles-new-york.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/22/96961313-0-image-a-4_1743889128509.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/04/05/7105475147927669160/1024x576_MP4_7105475147927669160.mp4","publish_date":"2025-04-05 22:39:07","author":"Editor,Sophie Gable","authors":["Editor","Sophie Gable"],"language":"en","source_country":"gb","sentiment":0.022},{"id":308101836,"title":"Zelensky used lie detectors to investigate leak – FT","text":"Ukrainian leader Vladimir Zelensky has made ministerial staffers take lie detector tests in an effort to find out who leaked the draft of the minerals deal with the US, the Financial Times (FT) reported on Saturday, citing government officials. \n\nAccording to FT, the tests had been administered across several ministries after Zelensky instructed Ukraine’s domestic security service to investigate the leak.\n\nThe draft, which was first reported by opposition Ukrainian MP Jaroslav Zheleznyak, outlined the mechanism for the US to manage revenues from oil, gas, and mineral projects. Ukrainian officials told FT that they were “caught off guard” by the scope of the latest American demands. \n\nUS President Donald Trump has been trying to persuade Kiev to sign the minerals agreement since February. At the same time, he refused to provide specific security guarantees to Ukraine, arguing that joint business ventures would be enough to deter Russia.\n\nEarlier this week, Trump accused Zelensky of “trying to back out” of the deal and warned that he would face “big problems” if the agreement failed to come through. Speaking to CNN, he reiterated that Ukraine will “never be a member of NATO.” \n\nThe attempt to sign a deal in late February was aborted after Zelensky’s heated argument with Trump and Vice President J.D. Vance in the White House. \n\nThe US planned to sign the deal during Zelensky’s visit to the White House in late February. “He got to the Oval Office and blew up what should have been the easiest thing to do in the world,” US Treasury Secretary Scott Bessent said in an interview with journalist Tucker Carlson published on Friday.","summary":"Ukrainian leader Vladimir Zelennsky reportedly made officials take polygraph tests \nRead Full Article at RT.com","url":"https://www.rt.com/russia/615282-zelensky-ukraine-lie-detectors/","image":"https://mf.b37mrtl.ru/files/2025.04/article/67f1b09585f54050170f9ca2.jpg","video":null,"publish_date":"2025-04-05 22:38:45","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.574},{"id":308104876,"title":"World News | 'This Has Got to Be a Moment in America,' Cory Booker Tells 1st Town Hall Since Record Speech","text":"Paramus (New Jersey), Apr 6 (AP) Democratic Sen. Cory Booker took a version of his record-breaking Senate floor speech on the road Saturday to a town hall meeting in a New Jersey gymnasium, calling on people to find out what they can do to push back on President Donald Trump's agenda. Booker took questions at suburban New Jersey's Bergen Community College the same day as more than 1,200 “Hands Off!” demonstrations were planned around the country. The town hall event was punctuated both by celebratory shouts of “Cory, Cory” as well as at least a half-dozen interruptions by protesters. Also Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'. It was Booker's first in-person event in his home state since his speech this week, where he held the Senate floor for 25 hours and 5 minutes in opposition to Trump's policies. In doing so, he broke the record for the longest floor speech, which was set by segregationist Sen. Strom Thurmond in opposition to the Civil Rights Act of 1957. Questioner after questioner asked what they could be doing to show their disagreement and worry over the president's policies. Booker told them it only takes a little bit more — could they afford a trip to Washington to lobby against budget cuts? One of the loudest moments of applause came after he addressed a woman who said she worried about what potential Medicaid cuts could mean for her son with autism. Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone. “A gathering like this can't be the end of our activism,” Booker said. “This has got to be a moment in America where all of us begin to say, what more can I do?” The questions and Booker's response mirror what voters and other Democrats have been hearing during town halls. He said he didn't want to focus on the Democratic Party, which has struggled to find a message since losing the 2024 election. Instead, he said, he would focus on “the people of our country.” “I think the Democratic Party lost a lot of elections because people didn't believe that they cared about them. So let's stop worrying about the politics and get more focused on the people,” Booker said. After the event, Booker said he was reluctant to tell people the exact tactics to use, citing civil rights activists like the late John Lewis. He said creativity has a role to play. “I know one thing it's not is sitting down and doing nothing and just watching on TV and getting stuck in a state of sedentary agitation,” he said. “Everybody has to be taking measures to put the pressure on to change.” Booker, who ran unsuccessfully for president in 2020, said after the event that he was focused on running for reelection to the Senate in 2026 and that 2028 “will take care of itself.” Booker, 55, is in his second full term in the Senate. He chairs the Strategic Communications Committee, his party's messaging arm. His team is focused on boosting Senate Democrats' presence across social platforms through more frequent and casual content. Booker himself has amassed one of the largest followings on social media platforms like Instagram, TikTok and X, where his commentary appears to connect with the party's base. But staffers are now focused on how to transfer that success to Booker's fellow senators, who are often less digitally fluent and face different political landscapes in their home states. That has involved turning the communications committee into a nerve center for testing and coordinating the easiest-to-use formats for lawmakers looking to boost their digital brands. Booker hopes to double the engagement senators receive with their content directly online and increase the caucus' appearances with online digital media personalities. The start of Saturday's event included six disruptions, including by several people who decried the treatment of Palestinians. Police in the gymnasium escorted them from the arena. “I hear you and I see you,” Booker said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Democratic Sen. Cory Booker took a version of his record-breaking Senate floor speech on the road Saturday to a town hall meeting in a New Jersey gymnasium, calling on people to find out what they can do to push back on President Donald Trump's agenda.","url":"https://www.latestly.com/agency-news/world-news-this-has-got-to-be-a-moment-in-america-cory-booker-tells-1st-town-hall-since-record-speech-6761549.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-04-05 22:38:07","author":null,"language":"en","source_country":"in","sentiment":-0.305},{"id":308103936,"title":"Medicare will not cover weight-loss drugs like Zepbound and Wegovy","text":"President Donald Trump’s administration has decided not to cover expensive, high-demand obesity treatments under the federal government’s Medicare program.\n\nThe Centers for Medicare and Medicaid Services said late Friday that it would not cover the medications under Medicare’s Part D prescription drug coverage. Medicare covers health care expenses mainly for people age 65 and older.\n\nTrump’s predecessor, Joe Biden, proposed a rule in late November after Trump won re-election that would have extended coverage of drugs like Zepbound and Wegovy. The rule was not expected to be finalized until Trump took office.\n\nTrump returned to office in January. The Senate confirmed Dr. Mehmet Oz to lead the Centers for Medicare and Medicaid Services on Thursday.\n\nCMS did not offer an explanation Friday for its decision, and federal spokespeople did not immediately respond to requests for comment.\n\nTrump’s Health and Human Services secretary, Robert F. Kennedy Jr., has been an outspoken opponent of the injectable drugs, which have exploded in popularity due to the potentially life-changing weight loss that some patients experience.\n\nPolls show Americans favor having Medicaid and Medicare cover the costs. But many insurers, employers and other bill payers have been reluctant to pay for the drugs, which can be used by a wide swath of the population and can cost hundreds of dollars a month.\n\nBiden’s proposal was expensive: It would have included coverage for all state- and federally funded Medicaid programs for people with low incomes, costing taxpayers as much as $35 billion over next decade.\n\nProponents of the coverage have argued that treating obesity can actually reduce longer-term costs by cutting down on heart attacks and other expensive health complications that can arise from the disease.\n\nThe benefits consultant Mercer has said that 44% of U.S. companies with 500 or more employees covered obesity drugs last year.\n\nMedicare does pay for drugs like Wegovy for patients who have heart disease and need to reduce their risk of future heart attacks, strokes and other serious problems. The federal program also covers versions of the drugs that treat diabetes.\n\nMore than a dozen state Medicaid programs already cover the drugs for obesity.\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.","summary":"The Centers for Medicare and Medicaid Services said late Friday that it would not cover the medications under Medicare’s Part D prescription drug coverage.","url":"https://www.oregonlive.com/business/2025/04/medicare-will-not-cover-these-popular-drugs-trump-administration-decides.html","image":"https://www.oregonlive.com/resizer/v2/KVAHOER6HBHBBDM6IC5IXB2WLA.jpg?auth=d1a1a18c3127df41de37224abb6b0c4049a9cba7ea48a95ef4472ae1f3a1fe4e&width=1280&quality=90","video":null,"publish_date":"2025-04-05 22:38:03","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.297},{"id":308100518,"title":"Time has come to stop war in Ukraine, Musk says","text":"ROME, April 6. /TASS/. US businessman Elon Musk, currently in charge of the US Department of Government Efficiency in the administration of President Donald Trump, spoke in favor of ending the conflict in Ukraine when speaking at the congress of the Italy’s Lega Party by a videoconference link.\n\n\"I have no respect for the warmongers,\" Musk said when answering a question of Matteo Salvini, the party leader and the Deputy Prime Minister of Italy. \"This is an evil thing,\" he continued, referring to the conflict in Ukraine. The time has come to put it to an end, Musk added.","summary":"US businessman said that he has 'no respect for the warmongers'","url":"https://tass.com/world/1939359","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-04-05 22:38:02","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.79},{"id":308107632,"title":"WATCH IT: Footage from Saturday's 'Hands Off!' rallies in the Berkshires","text":"On Saturday, thousands attended 'Hands Off!' rallies rebuking President Donald Trump in the Berkshires.\n\nWatch footage below of those protests filmed by Eagle photojournalists Gillian Heck and Ben Garver.\n\nBetween 1,000 and 2,000 people flocked to Park Square.\n\nWilliamstown\n\nProtesters braved the to line the road near First Congregational Church.\n\nGreat Barrington\n\nAttendees gathered in front of Town Hall.","summary":"On Saturday, thousands attended 'Hands Off!' rallies rebuking President Donald Trump in the Berkshires.","url":"https://www.berkshireeagle.com/news/local/watch-it-footage-from-saturdays-hands-off-rallies-in-the-berkshires/article_b310f5bf-fe26-4822-bbf6-0868632aa0da.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/assets/v3/editorial/2/dd/2dd0b0f7-84df-4b62-800f-b0207c3cd826/67f1a8a3cc28f.image.jpg?crop=1920%2C1008%2C0%2C35&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-04-05 22:38:00","author":"Gillian Heck — The Berkshire Eagle,The Berkshire Eagle","authors":["Gillian Heck — The Berkshire Eagle","The Berkshire Eagle"],"language":"en","source_country":"us","sentiment":0.583},{"id":308099150,"title":"Demonstrators Rally Nationwide in ‘Hands Off!’ Protests Targeting Trump and Musk","text":"Crowds of people angry about the way President Donald Trump is running the country marched and rallied in scores of American cities Saturday in the biggest day of demonstrations yet by an opposition movement trying to regain its momentum after the shock of the Republican’s first weeks in office.\n\nSo-called Hands Off! demonstrations were organized for more than 1,200 locations in all 50 states by more than 150 groups including civil rights organizations, labor unions, LBGTQ+ advocates, veterans and elections activists. The rallies appeared peaceful, with no immediate reports of arrests.\n\nFrom the National Mall and Midtown Manhattan to Boston Common and multiple state capitols, thousands of protesters assailed Trump and billionaire Elon Musk ‘s actions on government downsizing, the economy, immigration and human rights. In Seattle, in the shadow of the city’s iconic Space Needle, protesters held signs with slogans like “Fight the oligarchy.”\n\nDemonstrators voiced anger over the administration’s moves to fire thousands of federal workers, close Social Security Administration field offices, effectively shutter entire agencies, deport immigrants, scale back protections for transgender people and cut funding for health programs.\n\nMusk, a Trump adviser who owns Tesla, SpaceX and the social media platform X, has played a key role in the downsizing as the head of the newly created Department of Government Efficiency. He says he is saving taxpayers billions of dollars.\n\nKelley Robinson, president of the Human Rights Campaign advocacy group, criticized the administration’s treatment of the LBGTQ+ community at the rally at the National Mall, where Democratic members of Congress also took the stage.\n\n“The attacks that we’re seeing, they’re not just political. They are personal, y’all,” Robinson said. “They’re trying to ban our books, they’re slashing HIV prevention funding, they’re criminalizing our doctors, our teachers, our families and our lives.”\n\n“We don’t want this America, y’all,” Robinson added. “We want the America we deserve, where dignity, safety and freedom belong not to some of us, but to all of us.”\n\nIn Boston, demonstrators brandished signs such as “Hands off our democracy” and “Hands off our Social Security.”\n\nMayor Michelle Wu said she does not want her children and others’ to live in a world in which threats and intimidation are government tactics and values like diversity and equality are under attack.\n\n“I refuse to accept that they could grow up in a world where immigrants like their grandma and grandpa are automatically presumed to be criminals,” Wu said.\n\nRoger Broom, 66, a retiree from Delaware County, Ohio, was one of hundreds who rallied at the Statehouse in Columbus. He said he used to be a Reagan Republican but has been turned off by Trump.\n\n“He’s tearing this country apart,” Broom said. “It’s just an administration of grievances.”\n\nHundreds of people also demonstrated in Palm Beach Gardens, Florida, a few miles from Trump’s golf course in Jupiter, where he spent the morning at the club’s Senior Club Championship. People lined both sides of PGA Drive, encouraging cars to honk and chanting slogans against Trump.\n\n“They need to keep their hands off of our Social Security,” said Archer Moran of Port St. Lucie, Florida.\n\n“The list of what they need to keep their hands off of is too long,” Moran said. “And it’s amazing how soon these protests are happening since he’s taken office.”\n\nThe president planned to go golfing again Sunday, according to the White House.\n\nAsked about the protests, the White House said in a statement that “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries. Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.”\n\nActivists have staged nationwide demonstrations against Trump and Musk multiple times since Trump returned to office. But before Saturday the opposition movement had yet to produce a mass mobilization like the Women’s March in 2017, which brought thousands of women to Washington after Trump’s first inauguration, or the Black Lives Matter demonstrations that erupted in multiple cities after George Floyd’s killing by police in Minneapolis in 2020.\n\nIn Charlotte, North Carolina, protesters said they were supporting a variety of causes, from Social Security and education to immigration and women’s reproductive rights.\n\n“Regardless of your party, regardless of who you voted for, what’s going on today, what’s happening today is abhorrent,” said Britt Castillo, 35, of Charlotte. “It’s disgusting, and as broken as our current system might be, the way that the current administration is going about trying to fix things — it is not the way to do it. They’re not listening to the people.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nCrowds of people angry about the way&#160;President Donald Trump&#160;is running the country&#8230;\n\n\nThis Post: Demonstrators Rally Nationwide in &#8216;Hands Off!&#8217; Protests Targeting Trump and Musk first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/demonstrators-rally-nationwide-in-hands-off-protests-targeting-trump-and-musk/","image":"https://www.wfla.com/wp-content/uploads/sites/71/2025/04/AP25095693889812.jpg?w=900","video":null,"publish_date":"2025-04-05 22:35:08","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.169},{"id":308111306,"title":"‘Hands Off!’ anti-Trump protests in 50 states try to reach newly alarmed","text":"WASHINGTON >> Opponents of President Donald Trump held protests in all 50 states today to oppose the president’s slash-and-burn attack on federal health care programs, government workers and the rule of law, a message that they say appeals to a politically diverse set of Americans.\n\nThe “Hands Off!” mass action was organized by Indivisible, MoveOn and several other groups that led protests about abortion rights, gun violence and racial justice during the first Trump administration.\n\nBut organizers said they worked with 150 local, state and national partners to emphasize their message: Trump is threatening health care, Social Security and education, making life harder for the average American, while benefiting his richest friends.\n\n“We need to bring in new people, and that’s where Trump’s policies are so consequential,” said Britt Jacovich, a spokesperson for MoveOn.\n\nLongtime Trump opponents are reexamining the huge protest movements, including the Women’s March on Washington, that defined his first stint in office. The demonstrations minted new generations of activists and helped the Democrats retake the House in 2018, but they did not protect Roe v. Wade or compel Congress to pass police reform legislation. And in the end, Trump came roaring back in November and won the election.\n\n“The protests were effective in the short term, but in the longer term, unless there is some kind of resounding defeat politically, movements like Trump’s are able to reconstitute and, in this case, win,” said Erica Chenoweth, a political scientist who studies social movements and nonviolent resistance.\n\nSome 500,000 people signed up to participate in today’s marches in all 50 states, with a marquee rally on the National Mall in Washington.\n\n(In Honolulu, hundreds of protesters gathered at noon around the State Capitol as part of the effort.)\n\nProtests also took place in a number of foreign cities.\n\nIndivisible groups have hosted 150 town halls in Republican House districts. Many who attended were worried that Social Security and Medicaid were next on the chopping block. Concerned about the economic outlook, including rising costs for housing and food, they wanted to know why billionaire Elon Musk was overseeing the government overhaul.\n\nElections in Florida and Wisconsin on Tuesday gave Democrats hope. In Florida, Republicans won two House seats by slimmer-than-expected margins. And a liberal judge won election to the Wisconsin Supreme Court. A variety of polls show that Trump’s approval rating has dropped.\n\nBut the Trump administration’s deportations, investigations and university funding cuts have helped subdue dissent.\n\n“You want the whole country involved in a protest, people in surprising places,” said Jason Stanley, a philosophy professor who recently quit his job at Yale and fled to the University of Toronto. He said that mass movements gain staying power when they garner support beyond protest-friendly environments like liberal cities and college campuses. “Everyone in a democracy has agency, but everyone has to feel like they have agency to use it,” he said.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"WASHINGTON >> Opponents of President Donald Trump held protests in all 50 states today to oppose the president&#8217;s slash-and-burn attack on federal health care programs, government workers and the rule of law, a message that they say appeals to a politically diverse set of Americans.","url":"https://www.staradvertiser.com/2025/04/05/breaking-news/hands-off-anti-trump-protests-in-50-states-try-to-reach-newly-alarmed/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/04/web1_20250405_WEB_HandsOff-1.jpeg","video":null,"publish_date":"2025-04-05 22:35:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":-0.142},{"id":308104874,"title":"World News | Elon Musk Says He Hopes for Zero Tariffs with Europe Someday","text":"Washington, Apr 6 (AP) Billionaire Elon Musk told Italy League leader Matteo Salvini on Saturday that he hoped in the future the US and Europe could create \"a very close, stronger partnership\" and reach a \"zero-tariff zone\". Musk spoke to Salvini in a video conference during the League's congress in Florence. Salvini is the leader of the far-right, anti-migrant League party and vice premier of the Italian conservative government led by Premier Giorgia Meloni. Also Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'. He said that, ideally, there will be a \"zero-tariff zone in the future with a free trade zone between Europe and North America\". Musk, an adviser to President Donald Trump who owns Tesla, SpaceX and the social media platform X, has played a key role in government downsizing as the head of the newly created Department of Government Efficiency. (AP) Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone. (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Billionaire Elon Musk told Italy League leader Matteo Salvini on Saturday that he hoped in the future the US and Europe could create &quot;a very close, stronger partnership&quot; and reach a &quot;zero-tariff zone&quot;.","url":"https://www.latestly.com/agency-news/world-news-elon-musk-says-he-hopes-for-zero-tariffs-with-europe-someday-6761548.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-04-05 22:34:08","author":null,"language":"en","source_country":"in","sentiment":0.295},{"id":308106122,"title":"India to be patient in trade talks, to protect dairy, agriculture; Curb Chinese dumping: Officials","text":"New Delhi: India will negotiate its trade agreements carefully and patiently in the wake of the tariffs imposed by the Donald Trump administration and protect its sensitive sectors like dairy and agriculture, officials said Saturday, citing the example of the US which is sensitive about peanut butter.“We have to be patient. Trade pacts do not happen overnight. It is a careful and steady process. Things are analysed carefully,” an official said on the condition of anonymity, adding that a slight impact on demand in the US could be a little challenging.India has “emerged a winner” following the reciprocal tariffs imposed by the United States, officials said, pointing out that the country has a first mover advantage compared to its competitors owing to of the Bilateral Trade Agreement that the two are negotiating and because Indian exporters are better positioned to deal with the additional US tariffs.They said the country will take all measures within the World Trade Organization (WTO) framework to check dumping of goods from countries such as China which have been slapped with steeper tariffs. “The government is there to protect domestic industry from any possibility of dumping of goods in such a situation,” said another official, who did not wish to be identified.120023798While the US has imposed 26% reciprocal tariffs on India, it has levied 34% additional import duties on China. India is also likely to gain from the US-China trade war, according to officials.While certain exports such as fisheries could lose market share to Ecuador, which faces lower reciprocal tariffs, India can export more of the product to the European Union, they said.Limited Impact on Pharma ExportsNew Delhi anticipates only a small impact on its pharmaceutical exports due to the new American tariffs imposed by the Trump administrationWashington could impose tariffs similar to what it has levied on steel imports.FTA talks with UKIndia is currently negotiating a free trade agreement (FTA) with the United Kingdom, with “very good” progress on the talks, and there are similar requests from other countries including Bahrain and Qatar.Work is also underway to provide support to exporters who would be impacted by the US tariffs. Goods exports growth in 2024-25 is expected to be slightly higher than that in the previous fiscal and 2025-26 growth will be higher than in 2024-25, said an official.India’s goods exports in the April 2024-February 2025 period amounted to $395.63 billion.India’s competitor Vietnam is facing 46% US tariffs, Indonesia 32% and Thailand 36%.Reaching out to exportersOfficials also said that the commerce department is reaching out to domestic exporters regarding the US tariffs.“Work is progressing to prepare the export promotion mission for extending support measures to exporters,” said the official.","summary":"India is meticulously negotiating trade agreements in light of US-imposed tariffs, focusing on protecting sensitive sectors like dairy and agriculture. The government aims to prevent goods dumping from countries with steeper tariffs and provide support to impacted exporters. FTA discussions with the UK and other nations are showing good progress.","url":"https://economictimes.indiatimes.com/news/economy/foreign-trade/india-to-be-patient-in-trade-talks-to-protect-dairy-agriculture-curb-chinese-dumping-officials/articleshow/120023734.cms","image":"https://img.etimg.com/thumb/msid-120023756,resizemode-4,width-1200,height-900,imgsize-96879,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 22:34:00","author":"Et Bureau","authors":["Et Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":0.323},{"id":308099142,"title":"Barack Obama Speaks Out About the ‘Unbelievable’ Trump Presidency, Indicating a Shift in Their Relationship","text":"Former president Barack Obama spoke out against Donald Trump’s administration in a highly critical tirade signalling the end of their supposed ‘bromance’.\n\nThe 63-year-old took aim at the Republican leader’s crackdown on law firms, press freedoms and free speech in universities, breaking his silence on what he described as an ‘unimaginable’ presidency. \n\nObama also claimed Trump’s imposition of import taxes – which saw the FTSE 100 suffer its sharpest drop since the outbreak of the Covid pandemic – is not ‘going to be good for America’. \n\nTrump’s 10% tariff on UK products has also seen nearly £175 billion wiped off the UK stock market in just a week – hammering the pensions and savings of millions. \n\nObama warned Trump’s presidency could be ‘dangerous’, adding had been acting like a ‘wannabe dictator running around trying to punish his enemies’. \n\nAddressing students at Hamilton College on Thursday, Obama said: ‘Imagine if I had done any of this.’ \n\n‘It’s unimaginable that the same parties that are silent now would have tolerated behavior like that from me, or a whole bunch of my predecessors.’\n\nObama’s comments come just months after he and Trump were seen sharing a moment of laughter at Jimmy Carter’s funeral, which viewers claimed was a clear show of affection between former political opponents. \n\n‘I just want to be clear about this,’ Obama continued in his speech to students.\n\n‘Imagine if I had pulled Fox News’ credentials from the White House press corps. You’re laughing, but this is what’s happening.’ \n\n‘Imagine if I had said to law firms that were representing parties that were upset with policies my administration had initiated, that you will not be allowed into government buildings,’ he continued. \n\n‘We will punish you economically for dissenting from the Affordable Care Act or the Iran deal. We will ferret out students who protest against my policies,’ Obama added. \n\nThe Trump administration has barred the Associated Press from participating in the press pool over the organization’s refusal to use the president’s preferred ‘Gulf of America.’ \n\nAP remains credentialed, but the White House has also taken over who can participate in the daily pool, adding podcasters and conservative influencers. \n\nThe Trump administration has also gone after law firms – using executive orders – who were involved in some of the cases that the president refers to as a ‘witchhunt.’\n\n‘When I watch some of what’s going on now, it does not look, I don’t think what we just witnessed in terms of economic policy and tariffs is going to be good for America, but that’s a specific policy,’ Obama continued. \n\n‘I’m more deeply concerned with a federal government that threatens universities if they don’t give up students who are exercising their right to free speech,’ the former Democratic president said. \n\n‘I am more troubled by the idea that a White House can say to law firms, “If you represent parties that we don’t like, we’re going to pull all our business or bar you from representing people effectively”.\n\n‘That kind of behavior is contrary to the basic compact we have as Americans.\n\n‘Just because (Trump) acts goofy, doesn’t mean his presidency won’t be dangerous.\n\n‘We do not need four years of a wannabe king, a wannabe dictator running around trying to punish his enemies. \n\n‘What I can’t understand is why anyone would think that Donald Trump will shake things up in a way that is good for you. Because there is absolutely no evidence that this man thinks about anybody but himself.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer president Barack Obama spoke out against Donald Trump&#8217;s administration in a highly&#8230;\n\n\nThis Post: Barack Obama Speaks Out About the &#8216;Unbelievable&#8217; Trump Presidency, Indicating a Shift in Their Relationship first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/barack-obama-speaks-out-about-the-unbelievable-trump-presidency-indicating-a-shift-in-their-relationship/","image":"https://internewscast.com/wp-content/uploads/2025/04/rewrite-this-title-Barack-Obama-breaks-silence-on-Trumps-unimaginable.jpg","video":null,"publish_date":"2025-04-05 22:31:10","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.555},{"id":308099214,"title":"UK PM Keir Starmer ready to ‘shelter’ businesses from Trump tariff storm","text":"British Prime Minister Keir Starmer said on Saturday he was ready to step in to help “shelter” the country’s businesses from the fallout from US President Donald Trump’s new tariff policies, mooting state intervention for the worst-affected industries.\n“We stand ready to use industrial policy to help shelter British business from the storm,” Starmer wrote in the Telegraph newspaper.\n“Some people may feel uncomfortable about this – the idea the state should intervene directly to shape the market has often been derided.\n“But we simply cannot cling on to old sentiments when the world is turning this fast.”\nWhile Starmer said the government’s priority remains to try and secure a trade deal with the US which could include tariff exemptions, he said he will do “everything necessary” to protect the national interest.\n\nBritain was spared the most punitive treatment in Trump’s tariff announcement on Wednesday when it was hit with the lowest import duty rate of 10 per cent, but a global trade war will hurt its open economy.\n“This week we will turbocharge plans that will improve our domestic competitiveness, so we’re less exposed to these kinds of global shocks,” he said, adding that the government also wanted to strengthen alliances and reduce barriers to trade.\nThe Telegraph said that Starmer’s government could bring in emergency reforms to reduce red tape around regulation and raised the prospect of targeted tax breaks to help affected sectors.\nBritish car maker Jaguar Land Rover said on Saturday it would pause shipments of cars to the US for a month due to the tariffs, adding to fears about the impact on an industry which employs 200,000 people in the UK.\nWriting in the newspaper, Starmer reiterated he would take a “cool-headed” approach to the tariffs rather than immediately retaliating, but he added: “All options remain on the table.”\nBritain on Wednesday published a 400-page list of US goods it could include in any possible retaliatory tariff response.","summary":"The prime minister says the priority is to get a deal with the US, but state intervention for the worst-hit industries is also on the table.","url":"https://www.scmp.com/news/world/europe/article/3305378/uk-pm-keir-starmer-ready-shelter-businesses-trump-tariff-storm","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/04/06/95a9dd5b-0fb9-4bf4-a016-b1899e8914f2_6161e592.jpg","video":null,"publish_date":"2025-04-05 22:31:07","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"cn","sentiment":-0.016},{"id":308099058,"title":"World News | Trump Administration Argues Judge Cannot Order Return of Man Mistakenly Deported to El Salvador","text":"Washington, Apr 6 (AP) A federal judge did not have the authority to order the Trump administration to broker the return of a Maryland man who was mistakenly deported from the US to a notorious El Salvador prison, government attorneys argued Saturday as they urged an appeals court to suspend the ruling. US District Judge Paula Xinis on Friday ordered the administration to “facilitate and effectuate” Kilmar Abrego Garcia's return to the U.S. by late Monday night. Justice Department lawyers asked the 4th US Circuit Court of Appeals to immediately pause the judge's order. Also Read | 'The Market Has Spoken': China Takes a Jab at Donald Trump Administration, Says 'Trade War Started by US Against World Is Unprovoked and Unjustified'. “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote. The appeals court asked Abrego Garcia's lawyers to respond to the government's filing by Sunday afternoon. Also Read | US Shocker: Teacher Offers USD 2,000 to Student To Kill Husband in Columbus, Arrested After Mother Finds Texts on Boy's Phone. Abrego Garcia, a 29-year-old Salvadoran national, was arrested in Maryland and deported last month despite an immigration judge's 2019 ruling that shielded him from deportation to El Salvador, where he faced likely persecution by local gangs. His mistaken deportation, described by the White House as an “administrative error,” has outraged many and raised concerns about expelling noncitizens who were granted permission to be in the US. Dozens of supporters gathered at the Greenbelt, Maryland, federal courthouse for Friday's hearing. A cheer erupted in the courtroom when Xinis ruled in favor of Abrego Garcia, whose wife, a US citizen, was in attendance. Xinis, who was nominated by President Barack Obama, said there was no legal basis for Abrego Garcia's detention and no legal justification for his removal to El Salvador, where he has been held in a prison that observers say is rife with human rights abuses. During Friday's hearing, Justice Department attorney Erez Reuveni conceded to Xinis that Abrego Garcia should not have been removed from the U.S. or sent to El Salvador. Reuveni could not tell the judge upon what authority he was arrested in Maryland. “I'm also frustrated that I have no answers for you for a lot of these questions,” he said. Reuveni's name was not on Saturday's court filing. A department spokesperson confirmed that he was placed on leave. “At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement. Abrego Garcia's attorney, Simon Sandoval-Moshenberg, said the government has done nothing to get his client back, even after admitting its errors. “Plenty of tweets. Plenty of White House press conferences. But no actual steps taken with the government of El Salvador to make it right,” he told the judge on Friday. The White House has cast Abrego Garcia as an MS-13 gang member and doubled down on that claim after Friday's hearing. Abrego Garcia's attorneys have countered that there is no evidence he was in MS-13. Abrego Garcia had a permit from DHS to legally work in the U.S., his attorney said. He served as a sheet metal apprentice and was pursuing his journeyman license. Abreho Garcia fled El Salvador around 2011 because he and his family were facing threats by local gangs. In 2019, a US immigration judge granted him protection from deportation to El Salvador. Government lawyers say they have no control over Abrego Garcia and no authority to arrange for his return — “any more than they would have the power to follow a court order commanding them to 'effectuate' the end of the war in Ukraine, or a return of the hostages from Gaza.” “It is an injunction to force a foreign sovereign to send back a foreign terrorist within three days' time. That is no way to run a government. And it has no basis in American law,\" they wrote. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A federal judge did not have the authority to order the Trump administration to broker the return of a Maryland man who was mistakenly deported from the US to a notorious El Salvador prison, government attorneys argued Saturday as they urged an appeals court to suspend the ruling.","url":"https://www.latestly.com/agency-news/world-news-trump-administration-argues-judge-cannot-order-return-of-man-mistakenly-deported-to-el-salvador-6761547.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-04-05 22:30:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.285}]}