{"offset":0,"number":50,"available":10000,"news":[{"id":353687876,"title":"US Defense Intelligence Agency chief to be removed","text":"Published on: August 24, 2025 6:16 AM\n\nThe head of the US Defense Intelligence Agency (DIA) is being removed, a senior defense official said Friday — the latest in a series of top officers to be fired this year.\n\nThe removal of Lieutenant General Jeffrey Kruse, who headed the DIA since early 2024, comes after the agency produced a preliminary assessment that said US strikes on Iran in June set back Tehran’s nuclear program by just a few months.\n\nThe assessment — which was widely reported on by US media — contradicted claims from President Donald Trump that the strikes totally destroyed the nuclear sites, drawing the ire of both him and officials within his administration.\n\nKruse “will no longer serve as DIA director,” the senior defense official said on condition of anonymity, without providing an explanation for the general’s departure.\n\nPrior to becoming director of the DIA, Kruse served as the advisor for military affairs for the director of national intelligence, and also held positions including director of intelligence for the coalition against the Islamic State jihadist group, and senior special advisor to the head of US European Command.\n\nThe United States launched a massive operation against three Iranian nuclear sites in June, an effort that involved more than 125 US aircraft as well as a guided missile submarine.\n\nTrump called the strikes a “spectacular military success” and repeatedly said they “obliterated” the nuclear sites, but the DIA’s preliminary assessment raised doubts about the president’s claims.\n\nThe Trump administration responded with an offensive against the media, insisting the operation was a total success and berating journalists for reporting on the assessment.\n\nDefense Secretary Pete Hegseth insisted the assessment was “leaked because someone had an agenda to try to muddy the waters and make it look like this historic strike wasn’t successful,” and slammed “fawning coverage of a preliminary assessment.”\n\nSince beginning his second term in January, Trump has overseen a purge of top military officers, including chairman of the Joint Chiefs of Staff general Charles “CQ” Brown, whom he fired without explanation in February.\n\nOther senior officers dismissed this year include the heads of the Navy and Coast Guard, the general who headed the National Security Agency, the vice chief of staff of the Air Force, a Navy admiral assigned to NATO, and three top military lawyers.\n\nThe chief of staff of the Air Force also recently announced his retirement without explanation just two years into a four-year term.\n\nHegseth has insisted the president is simply choosing the leaders he wants, but Democratic lawmakers have raised concerns about the potential politicization of the traditionally neutral US military.\n\nEarlier this year, the Pentagon chief additionally ordered at least a 20 percent reduction in the number of active-duty four-star generals and admirals in the US military, as well as a 10 percent cut in the overall number of general and flag officers.","summary":"The head of the US Defense Intelligence Agency (DIA) is being removed, a senior defense official said Friday &#8212; the latest in a series of top officers to be fired this year. The removal of Lieutenant General Jeffrey Kruse, who headed the DIA since early 2024, comes after the agency produced a preliminary assessment that [&#8230;]","url":"https://dailytimes.com.pk/1358280/us-defense-intelligence-agency-chief-to-be-removed/","image":"https://dailytimes.com.pk/assets/uploads/2025/08/US-Defense-Intelligence-Agency-chief-to-be-removed-copy.jpg","video":null,"publish_date":"2025-08-24 01:16:49","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.23},{"id":353687872,"title":"Seoul, Tokyo strengthen bonds ahead of crucial Trump summit","text":"Published on: August 24, 2025 6:15 AM\n\nSouth Korean President Lee Jae Myung, in his first summit with Japanese Prime Minister Shigeru Ishiba on Saturday, stressed the importance of setting aside their past differences as they face common challenges from the United States, their mutual ally.\n\nThe two agreed to cooperate in areas that include clean energy, artificial intelligence, low births, the aging population and disaster prevention. They reaffirmed South Korea and Japan would work together and with the United States toward ending North Korea´s nuclear and missile development programs.\n\nLee’s visit to Japan may help him prepare for his crucial first summit in Washington on Aug. 25 with US President Donald Trump, mainly on trade and defense issues.\n\n“I came to Japan today with a conviction to boldly break away from past practices, pursuing pragmatic diplomacy centered on national interest and opening a path toward future-oriented, mutually beneficial cooperation between the countries,” Lee told a joint press conference after two summit sessions.\n\nLee – who met Ishiba on the sidelines of the Group of Seven summit in June – said he is the first South Korean president since the 1965 normalization of ties to choose Japan as the first destination for a bilateral summit after taking office.\n\nJapanese officials see it as a sign of Lee placing great importance on relations between the two neighbors whose ties have repeatedly been disrupted by historical disputes, hampering their trilateral coordination with Washington.\n\n“It is more important than ever for the two countries to cooperate,” Ishiba said. “The president and I share this view since his inauguration and I feel encouraged.”\n\nThe stable relations not only benefit the two countries but also the region, said Ishiba in his opening remarks at the summit. The Japanese prime minister faces pressure from rightwing rivals within his governing party to resign over its July election loss.\n\nSaturday´s summit was aimed at highlighting the two nations’ good ties as they mark the 60th anniversary of normalizing their diplomatic relations.\n\nRintaro Nishimura, an associate with The Asia Group´s Japan branch, said the timing of Lee´s visit shows his style “of pragmatic diplomacy,” with a focus both on bilateral and trilateral relations with the US\n\n“I also think it was a gesture from Lee to show that Japan is very important in his mind as a partner in his foreign policy,” he said.\n\nIshiba, who met Trump in Washington in February and held talks with him at the June G7 summit, has settled a tariffs deal ahead of South Korea.\n\n“We shared a recognition that in the face of a rapidly changing international situation, unwavering cooperation of South Korea-Japan and South Korea-US-Japan is more important than ever,” Lee said.\n\nLee said they agreed to pursue “a virtuous cycle” in which their improved relations enhance their trilateral cooperation with the US\n\nIshiba said they agreed to step up strategic dialogue in the areas of defense and economic security.\n\nThe summit comes just days after the two leaders signaled their conciliatory approach to each other.\n\nA joint statement after Saturday’s summit, the first such in 17 years, said the two leaders agreed to look toward the future even as Tokyo reiterates its “deep remorse and heartfelt apology” over Japan’s brutal colonial rule.\n\nIn his address last week marking the liberation from Japan´s 1910-1945 colonization of the Korean Peninsula, Lee called for the two sides to overcome past grievances while also urging Tokyo to face unresolved issues and strive to maintain trust.\n\nAlso, Lee told Japan´s conservative Yomiuri newspaper in an interview published Thursday, that he will stick to previous agreements with Japan on the forced labor issues and sexual abuses of the so-called “comfort women,” though many Koreans still harbor hard feelings.\n\nIshiba, who has acknowledged Japan´s wartime aggression and shown empathy toward Asian victims, expressed “remorse” over the war, which he called a mistake, restoring the word in a Japanese leader´s Aug. 15 surrender anniversary address for the first time since its 2013 removal by former Prime Minister Shinzo Abe.","summary":"South Korean President Lee Jae Myung, in his first summit with Japanese Prime Minister Shigeru Ishiba on Saturday, stressed the importance of setting aside their past differences as they face common challenges from the United States, their mutual ally. The two agreed to cooperate in areas that include clean energy, artificial intelligence, low births, the [&#8230;]","url":"https://dailytimes.com.pk/1358282/seoul-tokyo-strengthen-bonds-ahead-of-crucial-trump-summit/","image":"https://dailytimes.com.pk/assets/uploads/2025/08/WhatsApp-Image-2025-08-23-at-8.30.20-PM-copy.jpg","video":null,"publish_date":"2025-08-24 01:15:30","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":0.335},{"id":353688782,"title":"Ghislaine Maxwell has serious daddy issues and ended up in a toxic sexual relationship with a manipulative liar. Listening to her speak has left me with this VERY unsettling thought, confesses SARAH VINE","text":"The Ghislaine Maxwell tapes, released on Friday night by the US Department of Justice and available for anyone to listen to, are utterly fascinating. It’s the first real chance we’ve had to hear the voice of a woman who ranks, in popular perception at least, alongside some of history’s greatest villains.\n\nThere have been books, documentaries and endless column inches written about her. But the woman herself has never been heard (beyond the confines of her few remaining friends and family members). Our picture of her is built by the testimonies, invariably hostile, of others.\n\nThese tapes change all that. They show her in a whole new light and may well raise a few doubts in people’s minds as to how much of what we have been led to believe about her is actually true. They certainly made me think.\n\nOne thing is for sure: the veracity of some of the things she says remains questionable, not least the assertion that the famous photograph of the late Virginia Giuffre with Prince Andrew is fake. This is despite a forensic investigation by this newspaper that has all but proven otherwise.\n\nBut that’s not what hooked me. It’s her – her voice, her personality, the way she speaks, those soft, well spoken, slightly hesitant, apologetic tones. There is a girlishness to her that belies her age (63). To say she is seductive is not quite right. But she is compelling in a way that I had not anticipated. It’s confusing, unsettling, unexpected. I don’t know if I trust it. But I can’t deny it.\n\nShe certainly does not come across as a heartless, hardened madam, the arch manipulator at the centre of a web of sexual intrigue, collecting helpless, juicy specimens to feed to her master.\n\nOn the contrary, she comes over as uncertain, vulnerable, at times incredibly fragile. There is a naivety to her, which I had not anticipated. For example, she says ‘hypocryphal’ when she means ‘apocryphal’, and she does it twice. It’s a small thing, but it stands out and betrays her befuddlement.\n\nAlso, she only once refers to Epstein as ‘Jeffrey’, which feels odd. He’s always ‘Epstein’, or ‘Mr Epstein’. There is a formality that belies their supposed intimacy.\n\nIf it’s an act, it’s remarkably skilled. At times her emotion is audible. There are moments when, speaking about Epstein, or her father, she sounds utterly heartbroken.\n\nThere’s no doubt her association with Epstein took her to some dark places. What’s debatable, hearing these tapes, is whether she went there by design or ended up there almost by accident as a result of her weak psychological and emotional make-up. In other words, was she a willing participant or a mere passenger on the Epstein expressway to Hell?\n\nOf course, whatever the nature of her participation, it still doesn’t excuse it. But it doesn’t take a genius to see that this was a woman who went from one highly controlling relationship with a manipulative deceiver – her father, Robert Maxwell – straight into an almost identical one with her lover, Jeffrey Epstein.\n\nShe met him in 1991, shortly before her father died. Epstein scooped her up, gave her a job and a salary and put her to use running his real estate affairs.\n\nShe talks about the first time they slept together, in 1992. She thought it meant they were in a relationship. That, she remarks ruefully, didn’t happen.\n\nIt’s clear from her recollections that he meant a great deal to her, whereas she clearly meant very little to him. Still, he ‘encouraged me to believe’ that they might get married and have children. She was in her early 30s when they met: she felt her clock was ticking. ‘I should have had more confidence in myself,’ she says. ‘But at the time, given everything that had happened in my life...’\n\nEven when they finally broke up and she started a relationship with a tech tycoon, she stayed close to Epstein. ‘I viewed Epstein as family, someone I could rely on,’ she says. ‘His mum had become like a surrogate mother for me,’ she adds, her voice breaking. ‘I could look after her the way I looked after my mum.’\n\nDear Lord, Freud would have a field day. A father/lover who acts as her saviour yet rejects her sexually, controls her financially, undermines her confidence, makes her feel worthless one moment yet spoils her the next – and has her running around after him, trying to please the unpleasable: it’s a potent, toxic and deeply messed-up mix.\n\nMaxwell wouldn’t be the first woman with serious daddy issues to end up in a highly toxic relationship with a nasty, manipulative man like Epstein. Not all of them end up in jail for sex trafficking.\n\nThe question is, did she do the things she did because she wanted to or because she was desperate to please him and earn his approval – and was ultimately too damaged, weak and insecure to resist?\n\nMelania trumps Putin \n\nMelania Trump’s letter to Vladimir Putin was a masterclass in Bond girl diplomacy. It was the epistolary equivalent of sidling up to him, running a perfectly manicured finger\n\ndown his chest and saying, ‘My, Mr Putin, what big muscles you have.’ Still, I guess if anyone knows how to handle a power-crazed narcissist, it’s Mrs Donald J. Trump.\n\nBravissima Ms Meloni! Your expressions are priceless\n\nGiorgia Meloni, Italy’s prime minister, is a one-woman meme. The look on her face last week, left, as she met Donald Trump, Volodymyr Zelensky and other European leaders in Washington was priceless. Every woman who has ever sat around a table with a load of mansplaining blokes with intergalactic egos will have recognised it instantly. Bravissima!","summary":"Ghislaine Maxwell has never been heard (beyond the confines of her few remaining friends and family members). These tapes change all that.","url":"https://www.dailymail.co.uk/debate/article-15028169/Ghislaine-Maxwell-daddy-issues-toxic-liar-SARAH-VINE.html","image":"https://i.dailymail.co.uk/1s/2025/08/23/17/101488603-0-image-m-17_1755965094439.jpg","video":null,"publish_date":"2025-08-24 01:08:24","author":"Editor,Sarah Vine","authors":["Editor","Sarah Vine"],"language":"en","source_country":"gb","sentiment":0.305},{"id":353688120,"title":"Murdoch paper Trump is suing slams president’s ‘vendetta campaign’ against John Bolton","text":"The Wall Street Journal’s editorial board launched a scathing critique of President Donald Trump, characterizing the recent FBI raid on the Maryland home and office of former national security adviser John Bolton as a “vendetta campaign.”\n\nThe newspaper's editorial board described the Friday morning operation as “hard to see ... as anything other than vindictive.”\n\nThe conservative paper has long rebuked Trump, even when its publisher, a subsidiary of right-wing media tycoon Rupert Murdoch and his NewsCorp empire, has been on good terms with the president both in and out of office.\n\nThat relationship soured significantly after the WSJ published an article concerning an allegedly “bawdy” birthday letter to the late pedophile Jeffrey Epstein, which Trump asserts does not exist. The president filed a $10 billion defamation lawsuit against Murdoch, the paper, its parent company Dow Jones, and the journalists whose bylines appeared on the piece.\n\nOn Saturday, in a strongly worded editorial, the board asserted that “it is increasingly clear that vengeance is a large part, maybe the largest part of how [Trump] will define success in his second term.”\n\nDespite the president's claims of ignorance regarding the raid, the publication highlighted his past criticisms of his former national security adviser and United Nations ambassador from his first term.\n\nThe editorial board also noted the immediate termination of Bolton’s protective security detail upon Trump's return to the White House, despite threats to his life connected to actions against Iran.\n\n“This is the kind of gratuitous viciousness that has increasingly defined Mr. Trump’s return to office,” the board wrote.\n\nThe publication also directed sharp criticism at FBI Director Kash Patel, who tweeted that “NO ONE is above the law” just minutes before news of the Bolton raid broke.\n\n“The president’s minions ... don’t serve as the check on his worst impulses the way grown-ups did in his first term,” the board wrote.\n\nThe raid on Bolton’s property occurred shortly after several recent public appearances analyzing Trump’s summit with Russian President Vladimir Putin a week ago, with a stated aim of negotiating an end to Russia’s war on Ukraine.\n\nBolton, a frequent contributor to the WSJ, also recently appeared on The Daily Beast podcast, where he described Trump as “the world’s worst negotiator” and claimed the president struggled to focus on preparing for a 2018 summit with Putin due to watching a soccer game.\n\nDuring Trump’s meeting with Putin, Bolton said that Trump would surrender Alaska to Russia.\n\nOn Friday morning, Bolton wrote about an interview he did with NPR about Russia.\n\n“Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote on X. “Moscow has demanded that Ukraine cede territory it already holds and the remainder of Donetsk, which it has been unable to conquer. [Ukrainian President Volodymyr] Zelensky will never do so. Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don't see these talks making any progress.”\n\nIn a 2024 preface to his memoir, The Room Where It Happened, Bolton wrote that Trump was “unfit” to be president and would seek retribution against his political enemies if he returned to office.\n\nThe president attempted to block the book’s publication, claiming that Bolton had exposed classified information, despite the book having undergone an extensive pre-publication review at the White House for such material.\n\nTrump, for his part, has regularly and loudly criticized Bolton, calling him “stupid” and saying that he “blew up the Middle East.”\n\nThe WSJ’s editorial board had previously warned about Trump and his allies pursuing political revenge, including in December 2024, weeks before his inauguration.\n\n“We said this was one of the risks of a second Trump term, and it’s turning out to be worse than we imagined,” the board wrote.\n\nAn affidavit outlining the purpose of the raid that has been filed in federal court remains sealed.\n\nRegarding Trump’s lawsuit targeting the newspaper’s report on an alleged birthday card from the president to the late sex offender, the WSJ’s parent company, Dow Jones, has said in a statement that it maintains \"full confidence in the rigor and accuracy” of its reporting.","url":"https://uk.news.yahoo.com/murdoch-paper-trump-suing-slams-010637371.html","image":"https://s.yimg.com/ny/api/res/1.2/1lYaaQ4snZYcUESHulb0kw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/945169075d05dfc8888322c52e2673ef","video":"","publish_date":"2025-08-24 01:06:37","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.243},{"id":353686536,"title":"Hegseth fires intelligence boss after Trump angered by Iran strike damage report","text":"The head of the US Defense Intelligence Agency (DIA) and two other senior officers have been fired — the latest in a series of military firings this year.\n\nThe removal of Lieutenant General Jeffrey Kruse, who led the DIA since early 2024, comes after the agency produced a preliminary assessment that said US strikes on Iran set back Tehran's nuclear program by just a few months.\n\nThe assessment contradicted claims from US President Donald Trump that the strikes totally destroyed the nuclear sites, drawing the ire of both him and officials within his administration.\n\nLieutenant General Kruse \"will no longer serve as DIA director\", a senior defence official said on condition of anonymity, without providing an explanation for the general's departure.\n\nPrior to becoming director of the DIA, Lieutenant General Kruse served as the advisor for military affairs for the director of national intelligence, and also held positions including director of intelligence for the coalition against the Islamic State jihadist group.\n\nA US official separately said on condition of anonymity that two other senior officers — Vice Admiral Nancy Lacore, chief of Navy Reserve, and Rear Admiral Milton Sands, commander of the Naval Special Warfare Command — were also leaving their positions.\n\nSeries of top officers fired\n\nIn June, the United States launched a massive operation against three Iranian nuclear sites, an effort that involved more than 125 US aircraft as well as a guided missile submarine.\n\nMr Trump called the strikes a \"spectacular military success\" and repeatedly said they \"obliterated\" the nuclear sites, but the DIA's preliminary assessment raised doubts about the president's claims.\n\nThe Trump administration responded with an offensive against the media, insisting the operation was a total success and berating journalists for reporting on the assessment.\n\nUS Defense Secretary Pete Hegseth insisted the assessment was \"leaked because someone had an agenda to try to muddy the waters and make it look like this historic strike wasn't successful\", and slammed \"fawning coverage of a preliminary assessment\".\n\nSince beginning his second term in January, Mr Trump has overseen a purge of top military officers, including chairman of the Joint Chiefs of Staff General Charles CQ Brown, whom he fired without explanation in February.\n\nOther senior officers dismissed this year include the heads of the Navy and Coast Guard, the general who headed the National Security Agency, the vice chief of staff of the Air Force, a Navy admiral assigned to NATO, and three top military lawyers.\n\nThe chief of staff of the Air Force also recently announced his retirement without explanation just two years into a four-year term.\n\nMr Hegseth has insisted the president is simply choosing the leaders he wants, but Democratic politicians have raised concerns about the potential politicisation of the traditionally neutral US military.\n\nEarlier this year, the Pentagon chief additionally ordered at least a 20 per cent reduction in the number of active-duty four-star generals and admirals in the US military, as well as a 10 per cent cut in the overall number of general and flag officers.","summary":"The firing of the head of the US Defense Intelligency Agency (DIA) Lieutenant General Jeffery Kruse comes after the DIA produced a preliminary assessment that said US strikes on Iran set back Tehran's nuclear program by just a few months.","url":"https://www.abc.net.au/news/2025-08-24/head-of-us-defense-intelligency-agency-fired-by-pete-hegseth/105690536","image":"https://live-production.wcms.abc-cdn.net.au/c5993c3de5bf1bfdcc2492997441a13d?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485","video":null,"publish_date":"2025-08-24 01:00:14","author":"ABC News","authors":["ABC News"],"language":"en","source_country":"AU","sentiment":-0.271},{"id":353687770,"title":"Kennedy Center to host 2026 FIFA World Cup draw in December","text":"WASHINGTON: US President Donald Trump said on Friday the John F. Kennedy Center for the Performing Arts in Washington will host the 2026 FIFA World Cup draw in a televised event at noon EST on Dec 5, kicking off a year of more than 100 US-hosted football matches.\n\n“It’s a tremendous honour to bring this global event and this incredible group of people and these unbelievable athletes — the best athletes in the world — to the cultural centre of our nation’s capital,” Trump said in the Oval Office, flanked by Vice-President JD Vance, FIFA President Gianni Infantino and Homeland Security Secretary Kristy Noem, along with Richard Grenell, a special presidential envoy who also heads the Kennedy Center.\n\n“We are uniting the world, Mr. President, uniting the world, here in America, and we are very proud of that,” Infantino said, before letting Trump hold the golden World Cup trophy. He said 1 billion viewers worldwide were expected to watch the 2026 draw.\n\n“Can I keep it?” joked Trump, who has redone the Oval Office to add more gold decorations. “That’s a beautiful piece of gold.”\n\nHe also repeated a joke about renaming the center as the Trump/Kennedy Center.\n\nEarlier on Friday, Trump announced that the World Cup 2026 would have its primary office in the Kennedy Center.\n\nAndrew Giuliani, the son of former New York City mayor Rudy Giuliani and head of the White House World Cup task force, was also present at the event.\n\nTrump is overseeing a $257 million renovation at the Kennedy Center, which he has said would be a centerpiece of the 250th US anniversary celebrations next year, coinciding with the World Cup games.\n\n“We’re spending a lot of money, wisely, on making it really beautiful. It’s going to be beautiful again,” Trump said.\n\nThe 2026 World Cup, to be co-hosted by the US, Canada and Mexico, will be the first with 48 teams and will feature 104 matches.\n\nTrump said the event would draw more than $30 billion into the US economy, creating more than 185,000 jobs. Noem said the US government would work to ensure proper vetting and visa procedures for the estimated six million fans likely to attend.\n\nCanada will host 13 games, including 10 in the group stage split evenly between Toronto and Vancouver. Mexico will also get 13 games, including 10 during the group stage in Mexico City, Guadalajara and Monterrey. The rest of the tournament will be held in 11 cities across the US.\n\nPublished in Dawn, August 24th, 2025","summary":"WASHINGTON: US President Donald Trump said on Friday the John F. Kennedy Center for the Performing Arts in Washington will host the 2026 FIFA World Cup draw in a televised event at noon EST on Dec 5, kicking off a year of more than 100 US-hosted football matches.\n\n\n\n“It’s a tremendous honour to bring this global event and this incredible group of people and these unbelievable athletes — the best athletes in the world — to the cultural centre of our nation’s capital,” Trump said in the Oval Office, flanked by Vice-President JD Vance, FIFA President Gianni Infantino and Homeland Security Secretary Kristy Noem, along with Richard Grenell, a special presidential envoy who also heads the Kennedy Center.\n\n\n\n“We are uniting the world, Mr. President, uniting the world, here in America, and we are very proud of that,” Infantino said, before letting Trump hold the golden World Cup trophy. He said 1 billion viewers worldwide were expected to watch the 2026 draw.\n\n\n\n“Can I keep it?” joked Trump, who has redone the Oval O","url":"https://www.dawn.com/news/1936498/kennedy-center-to-host-2026-fifa-world-cup-draw-in-december","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-08-24 00:43:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":0.536},{"id":353687784,"title":"Ghislaine Maxwell denies existence of Epstein client list","text":"Claims she did not witness inappropriate conduct by Trump or Bill Clinton\n• Says Prince Andrew abuse allegations ‘mind-blowing, not conceivable’\n\nGHISLAINE Maxwell, the convicted associate of sex offender Jeffrey Epstein, has told US officials that a much-discussed “client list” does not exist, according to a BBC report.\n\nThe Trump administration has faced pressure to disclose information about Epstein, with whom Donald Trump was friendly before. \n\nMaxwell was interviewed in July and, according to the released transcript, said she did not witness any inappropriate conduct by Trump or former president Bill Clinton. \n\nShe also called allegations of Prince Andrew having sexual relations with an underage girl in Maxwell’s home “mind-blowingly not conceivable”. \n\nMaxwell is seeking a pardon from President Trump and has been accused of lying to federal officials. \n\nMaxwell is currently serving a 20-year sentence in a sex-trafficking scheme, and has petitioned the US Supreme Court to overturn her conviction. Her lawyer has said they would “welcome” a pardon from the US president. \n\nShortly after the interview with Deputy Attorney General Todd Blanche — who previously worked as Trump’s personal attorney — Maxwell was moved from her Florida prison to another low-security prison in Texas. It is unclear why the move was made. \n\nThe White House has been adamant that “no leniency is being given or discussed” in Maxwell’s case. Trump has maintained that he fell out with Epstein in 2004. \n\nThe president has accused his political opponents of using the case to distract from what he sees as his administration’s victories. \n\nBut he has also faced pressure from his own Republican Party for more transparency around investigations of Epstein. \n\nWhat Maxwell transcript revealed\n\nIn the transcripts — which amount to 300 pages, some heavily redacted — Maxwell said that while she believed Trump and Epstein were friendly “in social settings”, she did not think they were close friends. \n\n“I actually never saw the president in any type of massage setting,” she said, alluding to the massage services that some Epstein victims have mentioned. \n\n“The president was never inappropriate with anybody. In the times I was with him, he was a gentleman in all respects,” she added. \n\nShe also said she did not recall Trump sending Epstein a 50th birthday note in 2003, which drew recent headlines after the note was reported in the Wall Street Journal. \n\nIn the interview, Blanche also asked Maxwell about the alleged “client list” of high-profile personalities that has become the object of conspiracy theories in recent years. \n\nMaxwell was asked about several well-known figures, including Bill Gates, Elon Musk, former Israeli prime minister Ehud Barak, Health and Human Services Secretary Robert F. Kennedy Jr, actor Kevin Spacey, model Naomi Campbell and Prince Andrew — whom she denied she introduced to Epstein. \n\nThe list of his high-profile associates had become a focal point for conspiracy theorists who insisted that it was being kept hidden by the “deep state” to protect prominent participants in Epstein’s crimes. \n\n‘There is no list’ \n\nMaxwell also spoke about Prince Andrew, whose relationship with Epstein eventually led to his stepping down from royal duties. She called it a “flat untruth” that she’d been the one who introduced the Duke of York to Epstein. \n\n“First of all, let’s just state, I did not introduce him to Prince Andrew,” she said. \n\nShe spoke at length of Epstein’s relationship with both Prince Andrew and the Duchess of York, Sarah Ferguson. \n\nPrince Andrew has previously said that Maxwell introduced him to Epstein. But Maxwell said she believed it was the duchess who was responsible. \n\nWhen approached by the BBC about Maxwell’s claim, Sarah Ferguson’s representatives declined to comment. \n\nMaxwell also spoke about Prince Andrew’s alleged relationship with a woman whose name has been redacted in the transcript. \n\nShe said she found the allegations against the Duke of York “mind-blowingly not conceivable”, partly due to the size of her house where the events allegedly took place. \n\nShe was also asked about a “famous photo” of Prince Andrew and the unnamed woman, with Maxwell in the background. She told Blanche this photo was fake. \n\nThe prince was accused by Virginia Giuffre, who is not named in the transcript, of sexually abusing her when she was 17. He denied the allegations but reached a financial settlement with her in 2022, which contained no admission of liability or apology. \n\nA widely circulated photo shows him alongside Giuffre with Maxwell in the background. Andrew has previously disputed its authenticity. \n\nGiuffre took her own life earlier this year. Her family has condemned the justice department for interviewing Maxwell and said she is a “monster” whose testimony cannot be trusted. \n\nAccording to Maxwell, she first befriended Epstein in 1991, and subsequently developed a sexual relationship with him. \n\nEven after that relationship ended, she said she was still paid by Epstein — up to $250,000 a year by 2009 — and remained “friends with benefits”.\n\nPublished in Dawn, August 24th, 2025","summary":"• Claims she did not witness inappropriate conduct by Trump or Bill Clinton\n\n• Says Prince Andrew abuse allegations ‘mind-blowing, not conceivable’\n\n\n\nGHISLAINE Maxwell, the convicted associate of sex offender Jeffrey Epstein, has told US officials that a much-discussed “client list” does not exist, according to a BBC report.\n\n\n\nThe Trump administration has faced pressure to disclose information about Epstein, with whom Donald Trump was friendly before. \n\n\n\nMaxwell was interviewed in July and, according to the released transcript, said she did not witness any inappropriate conduct by Trump or former president Bill Clinton. \n\n\n\nShe also called allegations of Prince Andrew having sexual relations with an underage girl in Maxwell’s home “mind-blowingly not conceivable”. \n\n\n\nMaxwell is seeking a pardon from President Trump and has been accused of lying to federal officials. \n\n\n\nMaxwell is currently serving a 20-year sentence in a sex-trafficking scheme, and has petitioned the US Supreme Court to overturn her conv","url":"https://www.dawn.com/news/1936334/ghislaine-maxwell-denies-existence-of-epstein-client-list","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-08-24 00:42:47","author":"Monitoring Desk","authors":["Monitoring Desk"],"language":"en","category":"politics","source_country":"pk","sentiment":0.019},{"id":353684454,"title":"Lorne Michaels Reveals ‘SNL’ Cast Changes Expected Next Week","text":"Lorne Michaels, the mastermind behind “Saturday Night Live,” has announced that the show will experience some cast changes before its new season starts in October.\n\nSpeaking to Puck, Michaels, 80, confirmed that there will be a big cast shakeup for “SNL’s” 51st season. \n\nThe previous season celebrated the show’s 50-year milestone. NBC marked this occasion with an “SNL50” anniversary episode featuring numerous celebrity hosts and the return of beloved former cast members.\n\nMichaels said that because season 50 was so monumental, no casting changes were announced during that time. \n\nMichaels shared with Puck that when Kate McKinnon hosted, Kristen Wiig and Maya Rudolph made appearances. This meant that disruptions to the cast or shifts in focus were avoided, particularly since it coincided with an election year.\n\nWhile viewers are eager to discover which members might depart before the 51st season, Michaels did reveal one constant: James Austin Johnson will reprise his role as President Donald Trump.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLorne Michaels, the mastermind behind &#8220;Saturday Night Live,&#8221; has announced that the&#8230;\n\n\nThis Post: Lorne Michaels Reveals &#8216;SNL&#8217; Cast Changes Expected Next Week first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/lorne-michaels-reveals-snl-cast-changes-expected-next-week/","image":"https://internewscast.com/wp-content/uploads/2025/08/US-heat-wave-smothers-Pacific-Northwest-poses-extreme-risk-in-260x140.jpeg","video":null,"publish_date":"2025-08-24 00:41:39","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.032},{"id":353688614,"title":"Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release | US News","text":"A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers.\n\nKilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US.\n\nHe was released from federal detention on Friday after being held since March, when he was arrested and then deported back to his home country by Immigration and Customs Enforcement (ICE) officials.\n\nIn a new filing to the Tennessee court on Saturday, Mr Garcia’s defence lawyers said that immigration officials threatened the 29-year-old with deportation to Uganda earlier in the week.\n\nAccording to the filing, while he was held in Putnam County Jail on Thursday, Mr Garcia declined an offer to be deported to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison.\n\nAfter he left jail on Friday, ICE notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday.\n\nThat same day, the Trump administration “informed Mr Abrego that he has until first thing Monday morning – precisely when he must report to ICE’s Baltimore Field Office – to accept a plea in exchange for deportation to Costa Rica, or else that offer will be off the table forever”.\n\nFiled along with the brief was a letter from the Costa Rican government stating that Mr Garcia would be welcomed to that country as a legal immigrant and wouldn’t face the possibility of detention.\n\nJustice Department spokesperson Chad Gilmartin responded in a statement and said: “A federal grand jury has charged Abrego Garcia with serious federal crimes… underscoring the clear danger this defendant presents to the community.\n\n“This defendant can plead guilty and accept responsibility or stand trial before a jury. Either way, we will hold Abrego Garcia accountable and protect the American people.”\n\nSimon Sandoval-Moshenberg, one of Mr Garcia’s attorneys, said he would “fight tooth and nail against any form of deportation to Uganda” or nearby countries in Africa.\n\n“It is preposterous that they would send him to Africa, to a country where he doesn’t even speak the language, a country with documented human rights violations, when there are so many other options,” he said. “This family has suffered enough.”\n\nHowever, Mr Sandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favourable for his client, saying: “That’s a pretty reasonable option, right? I mean, Costa Rica makes sense.\n\n“It’s a Spanish-speaking country. It’s proximate to the United States. His family can visit him there easily.”\n\nMr Garcia, who lived in Maryland with his American wife and son, was deported to El Salvador under a controversial 18th-century law. He was then imprisoned in its notorious maximum security Terrorism Confinement Center (CECOT).\n\nThis was despite an immigration judge’s 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country.\n\nDemocrat senator Chris Van Hollen, who met Mr Garcia in CECOT, said the 29-year-old was “traumatised” by the experience.\n\nRead more from Sky News:Menendez brothers denied parole – but they could still taste freedomWhat Epstein’s right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend\n\nThe Trump administration admitted that deporting Mr Garcia was an “administrative error”, but said at the time they could not bring him back as they do not have jurisdiction over El Salvador.\n\nAfter eventually returning him to the US in June, the Trump administration detained Mr Garcia on criminal charges that were filed in May.\n\nThe criminal indictment alleges Mr Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country.\n\nHomeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Mr Garcia was a member of MS-13 – an international criminal gang formed by immigrants who had fled El Salvador‘s civil war to protect Salvadoran immigrants from rival gangs.\n\nMr Garcia’s lawyers strongly deny the claims.","summary":"A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers. Kilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into [&#8230;]\n\n\nThe post Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release | US News appeared first on Ghana Latest News.","url":"https://ghananewss.com/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-threatened-with-deportation-to-uganda-one-day-after-release-us-news/","image":"https://e3.365dm.com/25/08/768x432/skynews-kilmar-abrego-garcia_6998406.jpg?20250823054451","video":null,"publish_date":"2025-08-24 00:32:34","author":"Benjamin Nii Nai,Ghana News","authors":["Benjamin Nii Nai","Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.199},{"id":353688620,"title":"ET World Leaders Forum 2025: We will ensure national interest is safeguarded, says EAM S Jaishankar","text":"EAM S Jaishankar\n\nExternal affairs minister S Jaishankar questioned the contention by US President Donald Trump and his administration that India has profited unfairly from the purchase and sale of Russian crude, pointing to the irony of such an allegation. “If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. Europe buys, America buys… so (if) you don’t like it, don’t buy it,” he said. “It’s funny to have people who work for a pro-business American administration accusing other people of doing business.” Trump has threatened to double tariffs on Indian goods to 50% over India’s purchases of Russian oil that he said is helping to fund the Ukraine conflict.At The Economic Times World Leaders Forum in the Capital on Saturday, Jaishankar defended the concept of strategic autonomy that India has adopted.‘Red Lines in Negotiations ClearJaishankar underlined that the country will continue to take decisions independently, even as trade remains a “sticking point” in discussions with the US.Live EventsHe recalled that when oil prices surged as the Russia-Ukraine conflict kicked off, there was global concern. “In 2022, there was deep nervousness on the international level due to oil prices going up,” he said. “That time, it was said that if India wants to buy Russian oil, let them, because that would stabilise prices… Yes, it is in our national interest but it is also in the global interest.”When asked if India-China ties are being reset in the backdrop of recent US-India tensions, Jaishankar said the engagement has to be contextualised over a longer period, rather than in terms of news cycles. “It is not correct to integrate our ties with China and US in one space,” he said. “What's happening with China now had its preparation done from October 2024. India-US and India-China ties are different situations and timelines. We have historical problems with China and a stable border is still a prerequisite for development of ties, but trade and relations are important for our industries here.”Jaishankar said talks during his Russia visit focused on the annual bilateral summit. He happens to be the first foreign minister to visit the Kremlin after the recent summit between Trump and Russian President Vladmir Putin. “We’d like to increase trade with Russia,” he said, while stressing that New Delhi’s position on the Ukraine conflict is clear. “Where India stands is very clear and we want an early end to the Russia-Ukraine issue.”With regard to India-US ties under Trump, he said, “Right now, there are issues, it is pretty open. But it’s not like we never had issues before. Other parts of the relationship are strong.” However, the external affairs minister said dialogue channels remain active despite differences. “We are two big countries, we need to have conversations and we will see how it goes.”On trade talks with the US, Jaishankar said the two sides are in touch but India’s position is firm. Since the 50% tariff threat by Trump, the US has deferred the visit of its team to India for negotiating the bilateral trade agreement (BTA). He reiterated that India will ensure national interest is safeguarded and that the Centre will protect the interests of its people. “We have red lines in the negotiations, and we have to be clear about them,” he said. “We are committed to protecting the interests of farmers and small businesses.”(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onS JaishankarRussian crude oilTrump administrationtrade negotiationsIndia US relationstariffs on Indian goods\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onS JaishankarRussian crude oilTrump administrationtrade negotiationsIndia US relationstariffs on Indian goods(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"External Affairs Minister Jaishankar defended India's strategic autonomy amid US concerns over Russian oil purchases, highlighting the global interest in stabilizing oil prices. He emphasized independent decision-making, acknowledging trade as a sticking point with the US.","url":"https://economictimes.indiatimes.com/news/india/et-world-leaders-forum-2025-we-will-ensure-national-interest-is-safeguarded-says-eam-s-jaishankar/articleshow/123476912.cms","image":"https://img.etimg.com/thumb/msid-123476949,width-1200,height-630,imgsize-44208,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-24 00:30:00","author":"Sectionset World Leaders Forum 2025: We Will Ensure National Interest Is Safeguarded, Says Eam S Jai","authors":["Sectionset World Leaders Forum 2025: We Will Ensure National Interest Is Safeguarded, Says Eam S Jai"],"language":"en","source_country":"in","sentiment":-0.025},{"id":353686382,"title":"Self-deportation is crucial to undoing the Biden illegal-migrant mess","text":"Two news items from last week point to where US immigration enforcement is headed: 1) the number of foreign-born people in the country fell by 1.5 million in the first six months of 2025, and 2) ICE is on track to deport just 400,000 illegal immigrants for the whole year.\n\nThe obvious conclusion: A lot more illegal migrants are self-deporting than being expelled — which is surely how most Americans want things to proceed, and a lot more practical than any kind of mass round-ups. \n\nThe Trump administration is increasing deportations: This year’s 400,000 is up from the last reported Biden annual total of 271,000 which itself reflected a belated effort to show greater toughness as Democrats finally admitted how badly their open-borders policies had angered voters.\n\nBut Team Trump’s fierce rhetoric matters plenty, too: sending a message to strongly override the “everybody come on in” signals of the prior four years.\n\nSee the feds’ plans to review the status of 55 million visa holders as yet another signal: a warning that those who’ve been abusing their visas — it’s time to acquire permanent legal status if you mean to stay permanently, or make plans to head home. \n\nProdding and persuasion were always going to be crucial in undoing the Biden mess: ICE — despite a big expansion of its budget and the firm support of the president — can’t detain and deport that many people.\n\nIt would require mass roundups that aren’t remotely politically practical: Voters want all the worst illegal immigrants sent home, but will balk at ham-handed enforcement.\n\nSo seriously reducing the illegal population, even the millions of bogus Biden-era “asylum seekers,” is going to involve a lot of self-deportation.\n\nDoing it on your own also preserves the chance to return legally. \n\nPresident Donald Trump won re-election by promising to get everything back under control.\n\nBy stopping new illegal migration cold, he’s proved Democrats were simply lying when they said it couldn’t be done without passing new laws.\n\nNow he needs to show that greatly reducing the illegal population, particularly the millions waved in these last few years, doesn’t require “police-state tactics” and other “savage cruelty” — that is, to expose Dems’ new lies. \n\nOf course, lefties who oppose policing of all kinds will keep screaming about even reasonable immigration enforcement — but that just exposes their extremism to the broader public. \n\nHigh-profile but deft toughness is delivering exactly what the public wants; expect Team Trump to stick to what’s already working.","summary":"Prodding and persuasion have always been key to Trump’s promise to liberate America from tens of millions of illegal aliens.","url":"https://nypost.com/2025/08/23/opinion/donald-trump-doesnt-have-to-deport-10-million-illegals-they-will-leave-by-themselves/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-7ylv8fmqp-1755988354668.jpg?quality=75&strip=all&1755973970&w=1200","video":null,"publish_date":"2025-08-24 00:27:33","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.636},{"id":353681474,"title":"North Korean leader oversees new missile test, state media says","text":"United Nations Command said about 30 North Korean troops crossed the heavily-fortified border between the north and south, Yonhap News Agency said.\n\nPyongyang responded by accusing Seoul of a \"deliberate provocation\".\n\nSouth Korea and the United States have been conducting large-scale joint military exercises in the region since Monday.\n\nUS President Donald Trump is due to meet South Korea's President Lee Jae Myung at a summit on Monday in Washington.\n\nThe newly-elected South Korean president had campaigned on improving inter-Korean ties. \n\nHowever, Kim's sister has since rebuffed efforts towards reconciliation made by Lee's government.\n\nKim also earlier this month condemned the US and South Korea's joint military drills, describing them as \"most hostile and confrontational\". \n\nThe North Korean leader vowed to speed up his aim to increase the country's stash of nuclear weapons.\n\nIn January, North Korea claimed to fire a new intermediate-range ballistic missile tipped with a hypersonic warhead, which it said \"will reliably contain any rivals in the Pacific region\".\n\nSenior South Korean officials have raised concerns about North Korea receiving Russian missile technology in exchange for sending troops to back the Russian aggression against Ukraine.\n\nShin Wonsik, national security adviser for former South Korean President Yoon Suk Yeol, said last year that Seoul had found Moscow provided missiles and other equipment to help reinforce the air defense network for Pyongyang, the capital.\n\nWhether the latest missiles fired by North Korea involved any Russian technology was unclear.\n\nNorth Korea is one of the world's most repressive totalitarian states, with Kim and his family ruling the hermit nation for decades.\n\nSouth and North Korea have been divided since the Korean War ended in 1953.\n\nThey did not sign a peace treaty and therefore have remained technically still at war ever since, although it has been years since either side shelled the other.","url":"https://www.bbc.com/news/articles/cj3lp47nxdjo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/048c/live/11cef040-807c-11f0-9c84-8f69c101453a.jpg","video":null,"publish_date":"2025-08-24 00:17:59","author":"Jack Burgess","authors":["Jack Burgess"],"language":"en","category":"politics","source_country":"gb","sentiment":0.093},{"id":353685554,"title":"World News | Zelenskyy Tells South African President He is Ready for Talks with Putin","text":"Kyiv [Ukraine], August 24 (ANI): Ukrainian President Volodymyr Zelenskyy on Saturday spoke with South African President Cyril Ramaphosa and told him that he is ready to hold talks with Russian President Vladimir Putin.\nDuring the call, Zelenskyy also spoke about opportunities for joint work with Africa and said the Global South must send \"relevant signals\" in favour of peace.\nAlso Read | Beirut District Refuses to Succumb to Lebanon’s Divisions.\nIn a post on X, he said, \"I spoke with President of the Republic of South Africa, Cyril Ramaphosa, at his request. I informed about the joint diplomatic efforts with our partners and the productive meetings with President Trump in Washington.\"\nhttps://x.com/ZelenskyyUa/status/1959216634721083615\nAlso Read | UK Shocker: Man Confesses to Brother After Killing Girlfriend in Car, Driving Around With Her Body for 2 Hours in London; Arrested.\n\"I reaffirmed my readiness for any format of meeting with the head of Russia. However, we see that Moscow is once again trying to drag everything out even further. It is important that the Global South sends relevant signals and pushes Russia toward peace,\" he added.\nZelenskyy also appreciated the solidarity of the Baltic states with Ukraine against its conflict with Russia. He affirmed that Ukraine with its allies will bring peace to the European continent.\nIn a post on X, he said, \"We remember the longing for freedom that Lithuanian, Latvian and Estonian people demonstrated with the Baltic Way. We honor the unity these nations showed in defending their right to freedom and independence.\"\nhttps://x.com/ZelenskyyUa/status/1959232705658294334\n\"And today we highly appreciate the genuine solidarity of the Baltic states, in the face of dumb Russian imperialism. Just as you have, we are defending the right of our state and our people to independent life, and against the Russian attempt to subjugate us. Together we will return durable peace and uphold human dignity on the European continent,\" he added.\nEarlier in the day, Zelenskyy spoke to Prime Minister of the Netherlands Dick Schoof on the occasion of National Flag Day in Ukraine and apprised him of the talks in Washington.\nhttps://x.com/ZelenskyyUa/status/1959212393579385044\nMeanwhile, United States President Donald Trump renewed a threat on Friday to impose sanctions on Russia if there is no progress towards a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his warm meeting with Russian President Vladimir Putin in Alaska. Russian Foreign Minister Sergey Lavrov said there is no agenda for a potential summit between Putin and his Ukrainian counterpart, President Volodymyr Zelenskyy, whom he accused of saying \"no to everything\", as per Al Jazeera. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Zelenskyy also discussed opportunities for joint work with the African continent and said that Global South must send signals towards peace.","url":"https://www.latestly.com/agency-news/world-news-zelenskyy-tells-south-african-president-he-is-ready-for-talks-with-putin-7074272.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250823184947.jpg","video":null,"publish_date":"2025-08-24 00:10:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.022},{"id":353681106,"title":"Driver in Fatal Florida U-Turn Crash Denied Bond, Faces Deportation","text":"A truck driver accused of causing a fatal three-person crash in Florida was denied bond on Saturday and faces deportation proceedings.Harjinder Singh, a 28-year-old a native of India, was charged with three counts of vehicular homicide this week after allegedly making an illegal U-turn that resulted in a collision with a minivan on a highway approximately 50 miles north of West Palm Beach.The ContextThe Florida Department of Highway Safety and Motor Vehicles (FLHSMV) confirmed Singh was arrested after the collision near Fort Pierce on the Florida Turnpike on August 12 after he tried to turn his tractor-trailer through an \"unauthorized location.\"A black Chrysler Town & Country minivan drove head-on into the tractor-trailer as it was making the U-turn, video of the incident taken from the cab of the truck shows. Two passengers, a 37-year-old woman from Pompano Beach and a 54-year-old man from Miami, died at the scene. The driver, a 30-year-old man from Florida City, later died at a hospital, FLHSMV officials told Newsweek.Harneet Singh, the driver's brother, was a passenger in the vehicle driven by his brother during the fatal crash, a Department of Homeland Security (DHS) official said in a statement. Both were uninjured in the accident.Why It MattersUnder Florida law, vehicular homicide is a second-degree felony, punishable by up to 15 years in prison.California's Assembly Bill 60 (AB 60), enacted in 2015, allows undocumented immigrants to apply for a driver's license if they can provide proof of identity and California residency. These licenses are marked \"not for federal identification.\"The case has sparked a political clash between federal immigration authorities and California officials over driver's license policies for undocumented immigrants. The dispute centers on conflicting claims about Singh's work authorization, with federal officials maintaining Singh was in the country illegally when California issued his commercial driver's license, while Democratic Governor Gavin Newsom's office says Singh obtained proper work permits in 2018 during President Donald Trump's previous administration.What To KnowSingh was denied bond Saturday on all charges, including the three vehicular homicide counts and federal immigration violations. He remains in the St. Lucie County Jail with U.S. Immigration and Customs Enforcement (ICE) maintaining a hold on him, according to Lieutenant Andrew Bolonka from the St. Lucie County Sheriff's Office.Florida authorities report Singh entered the United States illegally from Mexico in 2018. Florida Republican Governor Ron DeSantis dispatched Lieutenant Governor Jay Collins to California to personally escort Singh onto an airplane Thursday, bringing him back to Florida for prosecution.California is one of 19 states, plus the District of Columbia, that issues driver's licenses regardless of immigration status. Supporters of such policies argue they allow people to work legally, access healthcare, and travel safely.What People Are SayingDHS Assistant Secretary Tricia McLaughlin said in a statement: \"How many more innocent people must die before Gavin Newsom stops playing games with the safety of the American public? We pray for the victims and their families. Secretary Noem and DHS are working around the clock to protect the public and get these criminal illegal aliens out of America.\"American Trucking Associations Chief Operating Officer Dan Horvath told Newsweek: \"This incident underscores the importance and urgency of the work that the Trump Administration is doing to audit CDL issuances nationwide, in addition to its enhanced enforcement of English-language proficiency—a fundamental requirement for operating commercial vehicles in interstate commerce.\"White House spokeswoman Abigail Jackson said: \"This recent news is a devastating tragedy made even worse by the fact that it was totally preventable. Illegal aliens that have no legal right to be in our country certainly should not be granted commercial drivers licenses. Gavin Newscum's pro-illegal alien policies have deadly consequences. Yet he continues to double down and put illegals over American citizens.\"Conservative commentator Charlie Kirk shared the video on X and wrote: \"Deport him to CECOT for life. And then strip California of every federal dollar for as long as it takes. Rogue states must not be allowed to continue shielding, coddling, and licensing illegals.\"What Happens NextSingh will face prosecution on state vehicular homicide charges while simultaneously undergoing federal deportation proceedings.Reporting from the Associated Press contributed to this article.","summary":"Truck driver Harjinder Singh is charged with three vehicular homicides in Florida crash denied bond, faces deportation","url":"https://www.newsweek.com/truck-driver-harijinder-singh-florida-u-haul-denied-bond-deportation-2118349","image":"https://d.newsweek.com/en/full/2708615/florida-accident-deport.png?w=1600&h=900&q=88&f=3e46d8d7cf29dbde3bd14d80ac1bd9df","video":null,"publish_date":"2025-08-24 00:02:43","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"US","sentiment":-0.49},{"id":353680978,"title":"Trump reportedly pointed finger at John Bolton before FBI raid as conservative media sounds alarm","text":"Weeks before the FBI raided John Bolton’s house, President Donald Trump made clear that his former national security adviser was a target of his second term.\n\nLaw enforcement agents raided Bolton’s home in Bethesda, Maryland and his Washington, D.C. office on Friday as part of an investigation related to classified documents, Vice President JD Vance confirmed. Bolton served as Trump’s national security adviser from 2018 to 2019 but has since become a vocal critic of the president. \n\nOn Friday, Trump said he wasn’t aware of the raids until after they happened. “I saw it on television this morning,” he said. The president added he “wasn’t a fan” of Bolton. \n\n“My house was raided also,” Trump told reporters, referring to the FBI raid of his Mar-a-Lago compound in 2022. “So I know the feeling. It’s not a good feeling.”\n\nBut sources close to Trump toldThe Washington Post that the president was irked by Bolton’s critical comments ahead of his Alaska summit with Russian President Vladimir Putin. The president also publicly took issue with Bolton’s remarks, calling him “really dumb” in a Truth Social post on August 13 — raising questions over the timing of the raid, which occurred just nine days after the social media post.\n\nThe Independent has requested comment from the White House.\n\nEarlier this month, Bolton accused Trump of running a “retribution presidency.” Since returning to the White House, Trump has targeted his so-called political enemies, including law firms, news organizations, former government officials, ideological opponents, and universities.\n\nBolton noted that Trump has “already come after me and several others,” alluding to the revocation of his security detail, which he received following threats against his life from Iran.\n\nBolton has yet to make a public statement following the raids.\n\nTheir public feud began to simmer during Trump’s first administration in 2019, when the president asked his national security adviser to resign, stating in a tweet that he “disagreed strongly with many of his suggestions.”\n\nIn 2020, Bolton released an explosive memoir, The Room Where It Happened, detailing his time working in the first Trump administration. \n\nThe Department of Justice launched a criminal investigation into whether Bolton disclosed classified information in his book and the administration tried to halt its publication, and a judge found in June 2020 that Bolton “likely jeopardized national security by disclosing classified information in violation of his nondisclosure agreement obligations.”\n\nBut the court did not block the book’s publication.\n\nBoth the lawsuit and criminal probe were dropped under the Biden administration.\n\nFollowing the FBI raid, Vance hinted at a new law enforcement probe into Bolton that was in “the very early stages.” The vice president noted that classified documents are “certainly part of” that probe, but that “there’s a broad concern about Ambassador Bolton.”\n\nFBI Director Kash Patel appeared to defend the raid, writing on X Friday morning that “NO ONE is above the law” and that FBI agents are “on mission.”\n\nAttorney General Pam Bondi similarly remarked that “America’s safety isn’t negotiable. Justice will be pursued. Always.”\n\nThe investigation has sparked criticism from usually reliably supportive right-wing media outlets.\n\nOn Friday, panelists appearing on Fox News’ America’s Newsroom said they were “skeptical” of the FBI’s decision to execute the raid.\n\nChris Swecker, former assistant FBI director from 2004 to 2006, said that he had consulted with former agency colleagues about the raid. \n\n“We're looking at this a little bit skeptically because we were very heavily critical of the Mar-a-Lago raid. Just because you have the authority and discretion to do something like this, doesn't mean you should,” he told Fox News.\n\nEvery federal search is predicated on an affidavit that shows probable cause that a crime has been committed and that evidence exists in a specific location, he said.\n\n“We just don't want to see the FBI weaponized for the other side, if you will, just turning the playbook over,” he added. “So, we're anxiously awaiting the unsealing of that affidavit.”\n\nAttorney and Fox News contributor Jonathan Turley alluded to the “longstanding disagreement” between Trump and Bolton.\n\n“There is a great concern about whether this is retaliation against a political opponent,” he said. “We just don't know because we haven't seen the warrant, we haven't seen the affidavit.”\n\nOther conservative media warned that the raid could signal Trump is using the FBI to exact political retribution. The Wall Street Journal’s editorial board said the raid reeks of political vengeance. \n\n“It’s hard to see the raid as anything other than vindictive,” the editorial board wrote Friday. “Mr. Trump made clear that he was out for blood against Mr. Bolton when he pulled the former adviser’s protective detail after his re-election.”\n\nTrump may hope that the raid leads Bolton to stop criticizing him publicly, the board suggested, adding that “the real offender here is a president who seems to think he can use the powers of his office to run vendettas.”\n\nIn August 2022, FBI agents raided Trump’s Mar-a-Lago resort in Palm Beach related to his handling of classified documents. \n\nA federal grand jury indicted Trump on charges alleging he unlawfully withheld thousands of classified documents at his Mar-a-Lago compound and then obstructed law enforcement’s attempts to retrieve them. A federal judge appointed by Trump dismissed the case, and special counsel Jack Smith withdrew his appeals after Trump won the 2024 presidential election.","summary":"Bolton accused Trump of running a ‘retribution presidency’ before FBI raid at his home and office","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-john-bolton-fbi-raid-b2813104.html","image":"https://static.independent.co.uk/2025/08/23/18/25/Former-White-House-national-security-adviser-John-Bolton-arrives-at-his-house-following-its-search-b.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/rulG9XAu-4VHSaSK0.mp4","publish_date":"2025-08-24 00:00:27","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.302},{"id":353679702,"title":"How Many Israeli Hostages Are Alive In Gaza? Here's What Trump Claimed","text":"US President Donald Trump has said that fewer than 20 Israeli hostages held by Hamas may still be alive. His remarks came during a press conference in the Oval Office this week. For months, reports have estimated that around 50 Israelis remain in Hamas captivity in Gaza, with at least 20 believed to still be alive. Trump, however, said the real number could be even lower, as per The New York Post. “So now they have 20,” he told said. “But the 20 is actually probably not 20, because a couple maybe aren’t around any longer. It’s a terrible thing.” Trump Calls Situation 'Extortion' Trump called the situation “extortion” and insisted that it needs to end quickly. He also hinted that a military operation to free the hostages might be safer than continuing negotiations. “I actually think they’re safer in many ways if you went in and you really went in fast,” he said. His comments came as the families of hostages continue to plead for international support and urgent action. Many of them have said that every single life matters. The Hostages and Missing Families Forum issued a statement saying, “Mr President, 50 hostages remain in the hands of Hamas in Gaza. For us, each and every one of them is an entire world.” Israeli Officials Deny Change In Numbers Israeli officials, however, have not confirmed any change in the number of living hostages. Gal Hirsch, Israel’s point man on the hostage issue, told families that the official figure remains the same. “According to Israel’s information, there is no change in the information you have received from us: 20 of the hostages are alive,” he wrote in a message cited by the Times of Israel. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"President Donald Trump said that fewer than 20 Israeli hostages held by Hamas may still be alive, contradicting reports suggesting around 50 remain captive. Trump described the situation as \"extortion\" and said that a military operation might be a safer solution than negotiations.","url":"https://www.timesnownews.com/world/us/us-news/how-many-israeli-hostages-are-alive-in-gaza-heres-what-us-president-donald-trump-claimed-article-152513214","image":"https://images.timesnownews.com/thumb/msid-152513215,thumbsize-1524670,width-1280,height-720,resizemode-75/152513215.jpg","video":null,"publish_date":"2025-08-23 23:50:44","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","category":"politics","source_country":"in","sentiment":-0.146},{"id":353678758,"title":"The Queen’s True Feelings About Trump Revealed","text":"If 2024 was marked by health challenges, then 2025 turned the monarchy into a prized soft power entity embroiled in a custody dispute. In essence, 2025 revolved around Donald Trump.\n\nDonald Trump held a sincere and profound admiration for the Royal Family. His initial presidential trip to the UK took place in 2018, prior to his State Visit in 2019, with one crucial stipulation. ‘We were explicitly informed that Donald Trump’s main motive for visiting was to meet the Queen,’ acknowledged Jeremy Hunt, the British foreign secretary at that time. ‘She was seen as our most valuable asset, and the Americans communicated that “If a meeting with the Queen is on the agenda, he’ll visit.” The Queen warmly welcomed him to Windsor for tea at the conclusion of his brief visit.\n\nA recurring media narrative, often revived by Trump’s detractors across the Atlantic, portrays Mr. Trump as having been ‘impolite’ to the Queen. Allegations include that he delayed her by arriving late at the welcoming platform and that he walked ahead of her during the Guard of Honour inspection at Windsor Castle. However, Royal Household members present at the event refute these claims, asserting that the Queen was not at all bothered.\n\n‘Trump didn’t do anything amiss. He arrived precisely on time. It was the Queen who came out ahead of time because she wanted to inspect the platform and steps, which were concerning at that stage of her life,’ explains a senior staff member. ‘You must understand that it was her first major event following the Duke of Edinburgh’s retirement from public engagements the previous year.\n\n‘She was keen to ensure everything went smoothly. Inspecting the troops was similar. Throughout her reign, the Duke would accompany the visitor for the inspection, a task she hadn’t undertaken before. And Trump acted correctly. The visitor traditionally leads the way, and she had to signal for him to step forward. The anti-Trump faction was eager to highlight any misstep. There wasn’t one.’\n\nA member of the late Queen’s staff recalls that the dialogue between the monarch and Mr. Trump, as well as his wife Melania, flowed smoothly over tea in the Oak Room. The leaders developed a ‘genuine rapport’, partly due to shared traits: both had Scottish mothers and substantial estates in Scotland. ‘Their conversation wasn’t mere chit-chat. They covered policy issues. His demeanor was utterly charming, consistently well-behaved,’ notes the royal aide. One notable aspect for everyone, including the Queen, was the President’s vigor: ‘He moved briskly up and down stairs. When Joe Biden visited three years later, we had to use the old Edwardian lift for him.’\n\nThe visit had been scheduled to last 20 minutes but went on for 40. It also meant that when Mr Trump returned for the proper State Visit the following year, there was a link. ‘It’s always easier when you can begin by saying, “Hello again, Mr President.” There was a connection there,’ says the Palace source. ‘No doubt about that.’\n\nSeveral years later, the moment had lost none of its magic for Mr Trump as he was filmed looking through a new book of photographs of his first presidency, many of them featuring him with the Queen and the Royal Family. ‘It’s a piece of history at the highest level,’ he murmured, flicking through the pages. ‘She was unbelievable. We had a really good relationship. There’s Charles. He’s a really good person. Camilla is fantastic.’\n\nIn 2025, a new British government wanted a new monarch to rekindle that rapport with a new US administration. No one could deny, for example, that Mr Trump’s past pronouncements on climate change were at odds with those of the King in princely days. However, as noted earlier, the monarch reigns with different responsibilities, just as today’s judge is not yesterday’s barrister.\n\nThe initial signs were more than encouraging on a blustery Saturday night in Paris in December 2024. Mr Trump was still in pre-inauguration president-elect mode and had joined other world leaders flying to Paris for the reopening of Notre-Dame de Paris, five years on from the fire that destroyed much of the cathedral. Earlier in the day, it was announced that the Prince of Wales, attending on behalf of his father, would have a meeting with Mr Trump before the service started.\n\nHowever, with northern Europe being battered by Storm Darragh, William’s plane was delayed and profuse apologies were conveyed to the Trump team that there would be no time to meet before the service. With some leaders, Mr Trump’s response would have been a shrug and a ‘so sorry, see you soon’. However, the president-elect’s staff simply re-arranged the meeting to a slot after the service. What’s more, the prince would not have to travel to meet Mr Trump. Instead, the president-elect would come round to see him at the British embassy.\n\nTo cap it all, a 15-minute meeting went on – and on. British diplomats were somewhat amused when, after 45 minutes, the embassy received a call from the Elysee Palace. President Macron’s staff wanted to know where Mr Trump had got to, as the presidential banquet was starting.\n\n‘Mr Trump very much enjoyed the conversation,’ says one of the British team, ‘and that conversation was incredibly warm about the memories that he had of meeting the prince’s grandmother. There was a lot of talk about the late Queen and of how important that was to the President.’\n\nThe next day, Mr Trump told the New York Post that the Prince ‘looked really very handsome last night’ during a ‘great, great talk’.\n\nWithin a few weeks of Mr Trump’s inauguration on January 20, Sir Keir was in the Oval Office for one of the President’s new-style televised armchair ‘welcomes’, alongside a sofa full of Trump acolytes. Sir Keir wasted no time in playing what some commentators would call his Trump trump card: the Royal Family.\n\nSuccessive British governments have done this. Go through the declassified files on the famous Ronald Reagan visit of 1982 – at the height of the Falklands War – and the diplomatic traffic shows that the top priority for the president on his first European tour was clearly riding at Windsor with the Queen. Sir Keir was determined to play similar mood music.\n\n‘It is my pleasure to bring from His Majesty the King a letter,’ he began, nervously. ‘He sends his best wishes – but he asks me to bear this letter and bring it to you.’\n\nIt is very telling, though little remarked upon at the time, that Mr Trump’s first reaction was neither to tear it open, nor to pocket it for later inspection. Instead, he wanted to do the right thing when it came to royalty. ‘Am I supposed to read it right now?’ he replied, seeking guidance.\n\n‘Yes, please do,’ said Sir Keir. ‘I need to tell him what your reaction is.’ ‘He is a great, great gentleman,’ murmured the President as he spent 17 seconds scanning the letter before concluding: ‘That’s – wow! Well that is really nice. I must make sure his signature is on that otherwise it’s not quite as meaningful. And it is!’ A handsome, thick-nibbed ‘Charles R’ was waved around before the cameras. ‘And that’s quite a signature, isn’t it. He’s a beautiful man and a wonderful man. And I’ve known him – I know him very well, actually.’\n\nRather than take the lead and announce the big ‘reveal’, Mr Trump was, again, happy to defer.\n\n‘Perhaps you’d like to say what that very important paragraph says,’ he asked Sir Keir, who duly obliged, addressing the room. ‘Yes, this is a letter from His Majesty the King. It’s an invitation for a second State Visit. This is really special. This has never happened before! This is unprecedented and I think that symbolises the strength of the relationship between us. I think the last State Visit was a tremendous success.’ ‘It was,’ Mr Trump assured him.\n\n‘His Majesty the King wants to make this even better than that,’ the Prime Minister went on, repeating the ‘unprecedented’ nature of a second visit. Lawyer that he is, Sir Keir now needed to clinch the deal: ‘What I haven’t got yet is your answer. I do need to…’\n\nTo which Mr Trump beamed and replied instantly: ‘The answer is yes. On behalf of our wonderful First Lady Melania and myself, we look forward to being there and honouring the King and honouring your country. Your country is a fantastic country.’\n\n‘I shall happily take that back to His Majesty,’ Sir Keir concluded.\n\n‘It’s beautiful,’ murmured the President, before remembering to retrieve the letter: ‘I’m going to keep that one!’\n\nBritish diplomats could not have wished for a more promising opening encounter with the new administration. Some veterans within the royal circle, however, were uncomfortable with the lack of decorum surrounding an invitation from the sovereign. ‘It was like seeing someone with their trousers down,’ was how one described it. ‘These things should be done with dignity.’ The fault, say the critics, was not Mr Trump’s, but Sir Keir’s.\n\nOn her initial visit to the first Trump administration in 2017, the then-British PM Theresa May had also delivered a royal invitation to make a State Visit to Britain. That letter had not been ripped open in front of the cameras, but conveyed in private and its contents announced afterwards. Sir Keir could have done the same.\n\nInstead, during a private White House meeting prior to the spectacle in the Oval Office, he had told Mr Trump that he came bearing a personal letter from the King and proposed to hand it over in front of the media. Mr Trump concurred.\n\nThe Palace was not consulted on the Prime Minister’s theatrical presentation of correspondence written in a congenial, conversational style, the King’s words clearly not intended for instant public consumption. It was, in effect, a personal overture, expressing the King’s (and the UK’s) desire to host a second State Visit. A formal invitation would follow later when dates had been arranged.\n\nThe King had suggested Mr Trump might, initially, like a more informal meeting at one of the royal estates, if he were visiting one of his Scottish golf courses. The two of them could also discuss plans for the State Visit. He even suggested Dumfries House, home of his King’s Foundation and its hospitality programme for training young people ‘who often end up as staff in your own establishments’.\n\nIn his enthusiasm to flatter his host, Sir Keir had not been entirely accurate about one detail, a surprising oversight for a normally fastidious lawyer. The offer of a second State Visit was certainly unusual, but it was far from ‘unprecedented’.\n\nIn recent years, Queen Margrethe of Denmark, for example, had enjoyed two State Visits to Britain, as had France’s President Poincaré in the reign of George V. The ‘unprecedented’ element of the invitation (as the King had stated in his letter) was the fact that no previous US president had made two State Visits to the UK, though this was perhaps not surprising. Until George W. Bush’s State Visit in 2003, all presidential trips to Britain – even Ronald Reagan’s eventful stay at Windsor – had been designated ‘official’ but not ‘state’ visits.\n\nWhat was not in question, though, was Britain’s determination to utilise the durable soft power of the House of Windsor to the full. Britain had two priority foreign policy objectives at the start of 2025: a new relationship with a new Washington; and resetting the UK’s relations with Europe.\n\nThe King’s State Visit to Italy in April and his invitation to President Macron of France to make a State Visit to Britain in July would help with the second. Offering Mr Trump a State Visit would help with the first, though the rapid pace of events would not leave time for an informal Scottish tête-à-tête in advance, as the King had proposed in his letter.\n\nOne world leader, however, was not pleased about the invitation – and said so. Asked what Canadians thought about Britain’s invitation to Mr Trump, the new Canadian Prime Minister Mark Carney had replied: ‘To be frank, [they] weren’t impressed by that gesture, given the circumstance.’\n\nShortly after his election victory, but pre-inauguration, Mr Trump had told the then Canadian prime minister Justin Trudeau, over a private dinner, that if Canada could not endure the hefty tariffs he was proposing for Canadian imports, ‘then maybe Canada should become the 51st state [of the USA]’. Initially, Canadian politicians brushed it off as a joke. Except that Mr Trump started referring to the prime minister as ‘Governor Justin Trudeau of the Great State of Canada’.\n\nThe ‘joke’ was no longer a joke once Mr Trump was in the White House and had started ramping up the rhetoric about annexing new territory, including Greenland, Panama and, in particular, the larger part of North America. After more than a century as friends, neighbours and great wartime allies, not to mention fellow members of Nato, Canada suddenly felt peculiarly vulnerable.\n\nLaid low by internal politics, Mr Trudeau stepped down. He was replaced by Mark Carney, who promptly called a general election, fought it on the issue of Canada versus Trump and won. Among his first acts was to ask Canada’s head of state to open the new parliamentary session.\n\nIt was very short notice by royal standards but the King’s team arranged a two-day visit, bolting on separate audiences with leaders of Canada’s three main indigenous peoples. He even squeezed in a reunion with some of the ‘Weston girls’, the 50 Canadian teenage schoolgirls chosen to go to London for the 1953 Coronation, courtesy of the businessman and philanthropist, Garfield Weston.\n\nThe next morning, the King was seated in the Senate on his Canadian throne. His British government had, quite correctly, been excluded from this process.\n\nHis speech had been written ‘on advice’ from his Canadian prime minister, a small but significant difference from the convention in Britain. When the monarch opens Parliament at Westminster, the speech is ‘written by’ the UK government and is simply a shopping list of policies to be recited by the occupant of the Throne. A speech ‘on advice’ (whether at a state banquet or on a royal tour) is more nuanced and collaborative. It might be written by the government, but there can be appropriate input from the monarch and scope for Palace officials, in their words, to ‘cast a constitutional lens’ over the text.\n\nThis was the case in Canada – and it was very much more than a list of policies. Every word had been weighed up by the monarch as well as the politicians.\n\nThough King for less than three years, Charles III had been active in world politics for longer than almost anyone on Earth. His first meeting in the Oval Office (with Richard Nixon) had taken place when Mr Carney was five. So while the rules state that a constitutional monarch must always act on advice from ministers, common sense dictated that the King should be handed a speech with which he was personally content.\n\nIt turned out to be a deftly crafted half-hour homily on Canadian values, and it went much further than many had expected. These were values, he said, worth ‘far more than any foreign power on any continent can ever take away’. The King put a benign gloss on talks between ‘the Prime Minister and the President of the United States’ to build ‘a new economic and security relationship between Canada and the US rooted in mutual respect’. That phrase, ‘mutual respect’, was working hard. This, he went on, would bring ‘benefits to both nations’, except that the King did not quite say that. He added what would normally be a wholly superfluous word and said ‘both sovereign nations’.\n\nQuietly noting each coded reference, his audience finally cracked when he observed: ‘As the anthem reminds us: “The True North” is indeed strong and free.’ Canada is north of only one border. The ovation, a flagrant breach of parliamentary convention, was long and heartfelt. The tradition is for speeches from the throne to be lukewarm, vanilla, demonstrably neutral and heard in complete silence. Not this time.\n\nThe King had not even finished. He waited for the clapping to subside before delivering his final words, holding himself together up to that emotional last line. As the King of Canada came to the end of this one, there was a discernible crack in his voice as he made his parting blessing: ‘May God bless and guide you in all your duties.’ Whereupon, both houses of the Canadian parliament jumped to their feet in noisy applause.\n\nThe King’s words would, of course, be analysed forensically in Washington, London and elsewhere. His speech and all the pageantry around his visit had amply reinforced Mr Carney’s central message that Canada is not for sale. Yet the King had also been sufficiently statesmanlike so as not to derail the very different strategy of his Prime Minister on the other side of the Atlantic. Sir Keir Starmer’s plan remained simple: avoid a rift with President Trump at all costs.\n\nThe late Queen had formally opened this parliament once – in 1957. Her visit had been a milestone (no Canadian monarch had done this before), but it had not been as loaded with this sort of diplomatic and political baggage. Indeed, it could be said that this speech represented the greatest (non-medical) challenge of the reign of Charles III so far.\n\nDid Nigel persuade Trump to stop Canada jibes ahead of King’s visit? \n\nThe King’s mission to Canada was a tricky one. He was, on the one hand, expected to issue a forceful assertion of Canadian sovereignty in the face of that increasingly combative rhetoric from Donald Trump about Canada being a ‘51st state’. The visit, though, ran counter to the policy of his British prime minister, Sir Keir Starmer, which was to avoid antagonising Mr Trump in the hope of securing a better trade deal for the UK.\n\nBoth prime ministers were acting in their respective national interests. But where would that leave the King? Here was a prime example of a serious if often overlooked challenge for modern monarchs: the doctrine of ‘the divisibility of the Crown’. In short, what happens when the same monarch sits on the throne of multiple nations, which then don’t agree on a serious issue?\n\nIn the event, the King made his speech. And, thereafter, it was noticeable that Donald Trump had dropped the ‘51st state’ narrative. There were no references to ‘Governor Carney’. Had the joke worn out? Had he been listening to advice? It later transpired that, ahead of the King’s visit to Canada, Trump’s closest political ally in Britain, Nigel Farage, leader of the Reform Party, had sought a meeting with Trump’s team, including his special envoy to the UK, Hollywood producer Mark Burnett. ‘Nigel Farage was very concerned. He wanted Trump to realise that he could not be pro-royal, pro-British, pro-State Visit and still talk like that about Canada,’ said a senior Farage aide. ‘It was one or the other. Let’s just say that Nigel received confirmation that the message had been transmitted.’\n\nA similar ‘divisibility of the Crown’ problem had surfaced in the previous reign during the late Queen’s tour of Canada in 1964. Anti-royal protests and the threat of violence in French-speaking Quebec had led the British prime minister, Sir Alec Douglas-Home, to consider giving the Queen formal advice to return to Britain. Since her Canadian government had invited her as Queen of Canada, she would then face an excruciating question: who answered to whom? If she returned, she was telling Canada that it was subservient to the UK. If she stayed, she was breaking her word as constitutional monarch of the UK. Britain eventually backed down, after a fudged decision to ‘monitor’ the situation.\n\nWhatever the transatlantic complexities in 2025, the King and Queen could, at least, draw one reassurance from all this: no one was questioning the relevance of the monarchy any more.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIf 2024 was marked by health challenges, then 2025 turned the monarchy&#8230;\n\n\nThis Post: The Queen&#8217;s True Feelings About Trump Revealed first appeared on Internewscast Journal","url":"https://internewscast.com/news/the-queens-true-feelings-about-trump-revealed/","image":"https://internewscast.com/wp-content/uploads/2025/08/What-the-Queen-REALLY-thought-of-Trump.jpg","video":null,"publish_date":"2025-08-23 23:42:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.001},{"id":353681298,"title":"Trump crime crackdown deploys troops in Washington’s safest sites","text":"Hundreds of National Guard soldiers in military fatigues and combat boots mingled with tourists, posed for selfies, and treated themselves to ice cream from food trucks on Thursday along Washington’s National Mall, one of the safest parts of America’s capital.\n\nOn occasion an angry local would hurl verbal abuse at them, but the soldiers simply shrugged and carried on what appeared to be an undemanding assignment.\n\nOutside the National Museum of African American History and Culture, five members of the West Virginia National Guard were standing on the street corner far away from the city’s crime hot spots.\n\n“It’s boring. We’re not really doing much,” said Sergeant Fox, who declined to give his first name.\n\nFox is among almost 2,000 troops, including 1,200 from six Republican-led states, who are being deployed in Washington as part of an extraordinary militarization inside the Democratic-led city.\n\nThe soldiers, some of whom told Reuters they did not get involved in arrests, are officially in Washington to support a federal crackdown on what President Donald Trump calls a crime epidemic. But that depiction appears to run counter to the fact that crime rates overall have shrunk in recent years.","summary":"Hundreds of National Guard soldiers in military fatigues and combat boots mingled with tourists, posed for selfies, and treated themselves to ice cream from food trucks on Thursday along Washington&#8217;s National Mall, one of the safest parts of America&#8217;s capital. On occasion an angry local would hurl verbal abuse at them, but the soldiers simply [&#8230;]","url":"https://www.fbcnews.com.fj/world/trump-crime-crackdown-deploys-troops-in-washingtons-safest-sites/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2025/08/worlld.png","video":null,"publish_date":"2025-08-23 23:33:24","author":"Ny Vann,Reuters","authors":["Ny Vann","Reuters"],"language":"en","category":"politics","source_country":"fj","sentiment":-0.132},{"id":353681572,"title":"Donald Trump: US President jokes he'll play in the World Cup next year","text":"Donald Trump has joked that he might play in the 2026 FIFA World Cup next yearTrump was joined by FIFA president Gianni Infantino as they spoke to reporters on FridayThe World Cup will be held across the United States, Mexico and Canada in 2026\n\nDonald Trump humorously suggested he could play in the 2026 FIFA World Cup, calling himself a “very good athlete” who looks “extremely good in shorts.” \n\nThe tournament, officially branded as FIFA World Cup 26, will be the 23rd edition of the quadrennial men’s international football championship contested by national teams from FIFA member associations.\n\nThe 2026 FIFA World Cup will be held from June 11 to July 19, spanning 16 cities across three North American countries. \n\nThe United States will serve as the primary host, with Canada and Mexico acting as co-hosts, marking the first time the tournament is hosted by three nations. \n\nAhead of the Mundial, Donald Trump joked that he might take part, describing himself as a “very good athlete” who looks “extremely good in shorts.”\n\nSpeaking to reporters alongside FIFA president Gianni Infantino, Trump joked about joining the action when the tournament comes to the U.S. next summer.\n\n“I might play,” Trump said with a grin. “I see the money these soccer players are making… I might give it a try! I’m a very good athlete.”\n\nHe also took the opportunity to praise his son Barron, describing him as a standout soccer talent - and exceptionally tall.\n\n'My son is a very good athlete and he's a good soccer player. On the tall side for a soccer player - he's 6'9'. That's pretty tall?' \n\nInfantino replied with a laugh: 'That's pretty tall - but that's good!'\n\nBut Trump wasn't done. 'I may put on [soccer] shorts - I look extremely good in shorts - and join the play,' he joked, drawing more laughter from the crowd.\n\nThe World Cup will be held across the United States, Mexico, and Canada in 2026, with Trump previously voicing strong support for the tournament coming to North America.\n\nTrump confirmed that the draw for the 2026 World Cup will take place in Washington this December. \n\nWhile Trump won't actually be on the field for the USMNT next summer, there's every chance he takes center stage at the tournament - similarly to the Club World Cup. \n\nThe US President was seen on stage with the Chelsea squad when they lifted the tournament trophy at MetLife Stadium after beating PSG last month. \n\nTrump had earlier presented Chelsea and England star Cole Palmer with the golden ball award - however the player appeared bemused by the President's presence.\n\nAfterwards, Trump remained on stage - handing medals players - before passing over the Club World Cup trophy and celebrating as the side lifted the title.\n\nSource: YEN.com.gh","summary":"US President Donald Trump joked that he might play in the 2026 FIFA World Cup, claiming he's a 'very good athlete' who looks 'extremely good in shorts.'","url":"https://yen.com.gh/sports/football/289754-donald-trump-president-jokes-ll-play-world-cup-year/","image":"https://cdn.yen.com.gh/images/1200x675/7a923957a8ae7355.jpeg?v=1","video":null,"publish_date":"2025-08-23 23:29:05","author":"Isaac Darko,Samuel Obour","authors":["Isaac Darko","Samuel Obour"],"language":"en","category":"politics","source_country":"gh","sentiment":0.31},{"id":353676702,"title":"‘It’s insulting’: Ghislaine Maxwell’s ‘absurd’ move","text":"For weeks we all wondered, albeit with a generous dollop of scepticism, what Jeffrey Epstein’s partner-in-trafficking, Ghislaine Maxwell, had told the Trump administration across two days of interviews in July.\n\nWho among the rich and famous had she exposed as being complicit in, or at least aware of, Epstein’s abuse of women and underage girls?\n\nWhat big names would be sacrificed as she grasped for a more lenient sentence? (She’s serving 20 years in prison at the moment, having been convicted of trafficking teenagers for Epstein to prey upon.)\n\nWhat conveniently exculpatory statements had she offered about President Donald Trump, a longtime friend of Epstein, from whom she is currently seeking a pardon?\n\nAnd what probing questions did Todd Blanche, formerly the President’s personal lawyer and now his Deputy Attorney-General, actually ask her?\n\nWe were told, after all, that she had been extraordinarily cooperative and forthcoming; that she discussed a hundred different names and “didn’t hold anything back”.\n\n“Ghislaine answered every single question asked of her over the last day-and-a-half. She answered those questions honestly, truthfully, to the best of her ability,” Maxwell’s lawyer, whose handsomely paid job involves saying such things, I suppose, claimed at the time.\n\nNow we have our answers. The government has published a transcript of the interviews with Maxwell, which you can read here, given sufficient time. But be sure you have nothing better to do with that time, because Maxwell’s testimony is hardly worth the bother.\n\nShe has not come clean. Instead we have essentially the same delusional, self-serving story she’s been telling for years: that despite the litany of traumatised victims, and an Everest of evidence that she and Epstein targeted underage girls, nobody really did anything wrong.\n\nBut if they did do something wrong, Maxwell certainly didn’t know about it!\n\nShe does not provide any information that could be used to investigate uncharged third parties. She does not admit to her own guilt. She barely even implicates Epstein himself.\n\n“I never, ever saw any man doing something inappropriate with a woman of any age. I never saw inappropriate habits,” she tells Mr Blanche at one point.\n\n“I’m not saying that Mr Epstein did not do those things. I don’t feel comfortable saying that today, given what I now know to be true. So I am not here to defend him. But what I can say is that I did not participate in that activity.”\n\nThat contradicts the accounts of multiple victims, who have alleged Maxwell didn’t merely lure them into Epstein’s web, but participated in some of the sexual abuse herself. And it very much contradicts the findings of a court that heard all about her leading role in the sex trafficking scheme.\n\n(We’ll skate past the astonishingly flippant phrase “inappropriate habits” as a descriptor for the sexual abuse of minors, though it does strike me as quite revealing.)\n\nMaxwell was not hanging around Epstein, practically joined to him at the hip, all the while oblivious to his crimes. She was an architect of them.\n\nAnd her new testimony isn’t just useless, it is insulting. It’s hour after hour of a remorseless sexual predator spitting in the faces of the girls she victimised. And she has the nerve to seek credit for it. To claim that she’s been helpful, and deserves to be rewarded.\n\nForgive the horrendously blunt analogy, here, but imagine Goebbels had lived past the end of World War II. Or Himmler. It doesn’t really matter which – just pick any of the Nazi cowards who escaped justice by killing themselves.\n\nThis is like Goebbels requesting an interview, seeking leniency, after the war. And then, in that interview, claiming to know of nothing that would incriminate anyone else in the regime. Including himself. And including Hitler! Who might have engaged in some war crimes (who can say?), but without poor Joseph’s knowledge.\n\nIt’s laughable. Maxwell’s testimony is so brazenly unhelpful, such an obvious waste of time for law enforcement, that it makes the subsequent decision to move her to a nicer, minimum-security prison even weirder. If anything she should have been transferred to somewhere worse, as punishment for her cheek.\n\nIt’s never been entirely clear what the Trump administration thought it might accomplish by interviewing Maxwell. “Well everybody, we spoke to Ghislaine and she didn’t offer anything useful,” is not an answer to the question: “Why aren’t you releasing the Epstein files?” The whole exercise was a non-sequitur from the beginning.\n\nNow, for the second time since Mr Trump returned to the White House, the implication seems to be that no further prosecutions will be pursued in relation to Epstein’s crimes, though others were obviously involved. Case closed.\n\nOne other feature of the Maxwell transcripts: her absurd efforts to ingratiate herself with Mr Trump, whose presidential pardon power is probably her only viable route out of jail.\n\n“I don’t think they were close friends,” she says of Mr Trump and Epstein, suggesting they were only chummy at shared social events.\n\nThat bizarre message Mr Trump allegedly wrote to Epstein to mark his 50th birthday, which the President says is fake? She has no memory of it. The report that Mr Trump invited Epstein, as the sole guest, to a “calendar girl” show at Mar-a-Lago? No no, they were never close friends, you see. They just hung out at the occasional party.\n\n“As far as I’m concerned, President Trump was always very cordial and very kind to me,” Maxwell said at another juncture.\n\n“And I just want to say that I find – I admire his extraordinary achievement in becoming the President now. And I like him. And I’ve always liked him.”\n\nYou have to acknowledge, “I’ve always liked him” is a weak attempt at flattery. A zero out of ten on the subtlety scale.\n\nIf Maxwell really wanted to worm her way into Mr Trump’s affections, she should have bumped that up to a one or two by saying, for example, that she believed the President’s claim that the 2020 election was rigged against him.\n\nThat’s what Vladimir Putin did during his summit with Mr Trump in Alaska a week ago, telling the President “your election was rigged”. Mr Trump promptly trotted off to do a TV interview in which he called this remark “one of the most interesting things” from their meeting, which had been convened to discuss an end to Putin’s invasion of Ukraine.\n\n“Vladimir Putin, smart guy, said you can’t have an honest election with mail-in voting. He said there’s not a country in the world that uses it now.”\n\nYes, smart guy, Vladimir. He actually has quite a bit of experience in rigging elections himself. You might call him an expert on the subject.\n\nLater, on social media, Mr Trump again claimed the United States is “the only country in the world that uses mail-in voting”. There are, in fact, more than 20.\n\nConsider it a little micro-example of the American President’s extraordinary gullibility. If someone tells him a “fact” that fits his priors, he believes it unquestioningly, whether the other person is a murderous dictator nakedly stroking his ego, or some Twitter troll lurking around the Mar-a-Lago ballroom.\n\nA couple of days after the Putin summit Volodymyr Zelensky, having been ambushed and browbeaten by Mr Trump and Vice President J.D. Vance during his earlier visit to the White House in February, managed to earn a better reception by wearing different clothes, and by making sure to mention how thankful he was for Mr Trump’s efforts multiple times.\n\nEuropean leaders, who’d accompanied Mr Zelensky in a show of unity, mollified the President with similar over-the-top praise, and then by sitting together in front of the Resolute Desk like obedient schoolchildren visiting the principal’s office.\n\nWe could go back to Mr Trump’s first term, and recall how North Korean dictator Kim Jong-un manipulated him into holding multiple nuclear summits that legitimised him, but ultimately achieved nothing.\n\nWe could look at his relationship with Viktor Orban, whose actions in Hungary have reduced the country to something less than a democracy, but whose nice words about Mr Trump have earned him the American President’s favour.\n\nIf I were Donald Trump, I would find all of this quite insulting. The idea that saying “I’ve always liked him” could actually shift my view would be offensive.\n\nI’m not for one moment suggesting that Maxwell’s attempts at sucking up to the President will get her a pardon. But the fact she thinks something so transparent could even possibly work? That says something.\n\nIt suggests all of these people see Mr Trump as someone who is easily manipulated. As someone simple-minded and vulnerable to the most basic forms of flattery.\n\n“I think he wants to make a deal for me,” Mr Trump said of Putin this week, in remarks captured by a hot mic while he was speaking to French President Emmanuel Macron.\n\nThose two words, “for me” – goodness, they’re striking. He still thinks he is friends with Putin. He still thinks the war in Ukraine might end because Putin wants to do him a favour. The naivety, the strange innocence of it all, is painful.","summary":"After weeks of waiting, Ghislaine Maxwell’s new testimony has been unveiled. It’s revealing in exactly the wrong way.","url":"https://www.news.com.au/world/north-america/ghislaine-maxwells-useless-testimony-spits-in-the-faces-of-epsteins-victims-and-insults-donald-trump-as-well/news-story/2b884bc77a7e558fad036f751fd65307?from=rss-basic","image":"https://content.api.news/v3/images/bin/02c600867e0da4c6b33eb96352536f23","video":null,"publish_date":"2025-08-23 23:26:07","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.379},{"id":353677862,"title":"Newsom's trolling of Trump attracts attention to complicated redistricting fight","text":"Taking on President Donald Trump isn't new for Gov. Gavin Newsom, but imitating the president on social media is.\n\nNewsom's trolling the last few weeks has been extra spicy, timed around the launch of the campaign for an issue that's the opposite of spicy: redistricting.\n\n\"Gavin Newsom has decided. somebody said something brash and reckless. I'm going to say the same thing,\" said Karen North, a professor of digital social media at USC's Annenberg School for Communication and Journalism.\n\nThe use of all caps, MAGA phrases, and threats combined with personal praise are vintage Donald Trump.\n\nReferring to redistricting, Newsom's press office posed on X: \"Final warning Donald Trump - maybe the most important warning in history! Stop cheating or California will redraw the maps. And guess who will announce it this week? Gavin Newsom (many say the most loved & handsome governor).\"\n\nAlso, \"make the maps great again! big beautiful rally today. Thank you for your attention to this matter!\"\n\nIn terms of engagement, it's working. Newsom's office X account has seen an increase of 250,000 followers since Aug. 1, an engagement rate of more than 50% and more than 1.5 million profile visits.\n\n\"Not only has Newsom become much more aggressive in his criticism of trump, but by imitating him, he is reminding the political community that this type of behavior from an elected official is out of the ordinary,\" said Dan Schnur, a political communications lecturer at USC and UC Berkeley.\n\n\"How do you get the attention of people who don't care about Gavin Newsom? To become entertaining and engaging like this, brash and shocking is a great way to get attention and it's clearly working in that regard,\" said North.\n\nThe new strategy has caught the attention of Trump who posted on his social media platform, Truth Social: \"Gavin Newscum is way down in the polls. he is viewed as the man who is destroying the once great state of California. I will save California!!! President DJT.\"\n\nSo will engagement on social media translate to votes for redistricting?\n\nA UC Berkeley institute of governmental studies poll conducted for the la times found 46 percent of registered voters believe redistricting is a good idea. Thirty-six percent say it's a bad idea and 18% had no opinion. As far as Newsom's approach to trump which is only going to ramp-up ahead of the Nov. 4 special election, 59% said Newsom should continue the behavior and 29 percent said he should take a more cooperative stance.\n\n\"I hope it's a wake up call to the president of the United States following his example,\" said Newsom. \"If you have issues with what I'm putting out, you sure as hell should have concerns about what he's putting out as president. To the extent it's gotten attention, I'm pleased. The deeper question is how have we allowed the normalization of his tweets, truth social posts over the course of the last many years to go without similar scrutiny and notice.\"\n\nSupporters of trump say they find his brash tone on social media to be authentic which has boosted his popularity. It seems to be working for Newsom so far, but whether it drives voters to the polls in two and a half months remains to be seen.","summary":"Taking on President Trump isn't new for Gov. Newsom, but imitating the president on social media is.","url":"https://abc7.com/post/governor-gavin-newsoms-trolling-president-donald-trump-attracts-attention-complicated-redistricting-fight/17616948/","image":"https://cdn.abcotvs.com/dip/images/17618446_082225-kabc-5p-ca-redistricting-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/kabc/082225-kabc-5p-ca-redistricting-vid.mp4","publish_date":"2025-08-23 23:21:17","author":"Josh Haskell,KABC","authors":["Josh Haskell","KABC"],"language":"en","category":"politics","source_country":"us","sentiment":0.115},{"id":353678060,"title":"Pentagon quietly blocks Ukraine’s use of US missiles against Russia: report","text":"The Pentagon has been quietly blocking Ukraine from using US-made long-range Army Tactical Missile Systems (ATACMS) to strike targets inside Russia, limiting Kyiv’s ability to employ these weapons in its defence against Moscow’s invasion, The Wall Street Journal reported on Saturday, citing US officials.\nReuters could not immediately verify the report.\nThe news came as US President Donald Trump has grown more frustrated publicly over the three-year-old war and his inability to secure a peace deal between Russia and Ukraine.\nAfter his summit with Russian President Vladimir Putin and a subsequent meeting with European leaders and Ukrainian President Volodymyr Zelensky failed to produce observable progress, Trump said on Friday that he was again considering slapping Russia with economic sanctions or, alternatively, walking away from the peace process.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\n\nTrump had hoped to arrange a bilateral meeting between Putin and Zelensky, but that has also proven difficult.\nRussian Foreign Minister Sergey Lavrov told NBC on Friday that there was no agenda in place for a sit-down with Zelensky.\n“Putin is ready to meet with Zelensky when the agenda would be ready for a summit. And this agenda is not ready at all,” Lavrov told NBC, saying no meeting was planned for now.\nAs the White House sought to persuade Putin to join peace talks, an approval process put in place at the Pentagon has kept Ukraine from launching strikes deep into Russian territory, the Journal reported.\nUS Defence Secretary Pete Hegseth has final say over use of the long-range weapons, the Journal said.\nNeither Ukraine’s presidential office nor the defence ministry immediately responded to Reuters’ request for a comment outside business hours. The White House and the Pentagon also did not immediately respond to requests for comment.","summary":"The Pentagon has been quietly blocking Ukraine from using US-made long-range Army Tactical Missile Systems (ATACMS) to strike targets inside Russia, limiting Kyiv’s ability to employ these weapons in its defence against Moscow’s invasion, The Wall Street Journal reported on Saturday, citing US officials.\nReuters could not immediately verify the report.\nThe news came as US President Donald Trump has grown more frustrated publicly over the three-year-old war and his inability to secure a peace...","url":"https://www.scmp.com/news/world/russia-central-asia/article/3322948/pentagon-quietly-blocks-ukraines-use-us-missiles-against-russia-report-says","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/08/24/b1c1a0ca-2f8a-42ba-b3ad-1aa0235312a5_8bc2314c.jpg","video":null,"publish_date":"2025-08-23 23:05:42","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.07},{"id":353681570,"title":"Proposed Trump Travel Ban Puts Six Countries’ World Cup Hopes in Doubt","text":"Six nations face the possibility of missing the 2026 World Cup as a result of Donald Trump’s proposed travel banOne has already booked its place at the tournament, while the others remain in the qualification race but risk being denied entry to the host nationFIFA is said to be in talks with the U.S. government to ensure every qualified team can take part\n\nThe 2026 FIFA World Cup, to be hosted across the United States, Mexico, and Canada, is set to be a landmark event in football history. \n\nBut a major controversy is looming, as six nations may be barred from taking part due to a proposed travel ban by U.S. President Donald Trump. \n\nIf enforced, the restrictions could stop players from certain countries - some still vying for qualification - from entering the U.S. for the tournament, regardless of their performance on the pitch.\n\nTrump’s Travel Ban and Its Possible Impact on the World Cup\n\nA New York Times report from March 14 revealed that the Trump administration is weighing plans to restrict travel for citizens from as many as 43 countries - including some whose national teams are still battling for World Cup qualification. \n\nIran, which has already secured its place at the tournament, is said to feature on a draft list of affected nations.\n\nThe proposal reportedly divides countries into three categories: Red (full travel ban), Orange (severe visa restrictions), and Yellow (a 60-day grace period to address concerns before restrictions take effect). \n\nIran is believed to be placed in the “Red” category, which would block its team from entering the U.S. and potentially rule them out of the 2026 World Cup.\n\nWhich Other Nations Could Be Affected?\n\nAlongside Iran, six other countries still in contention for a place at the 2026 World Cup may also be at risk. \n\nThese include Sudan, Cameroon, Burkina Faso, Cape Verde, DR Congo, and Venezuela. Reports suggest Sudan, Venezuela, and Iran are listed in the “Red” category, which would impose a full travel ban. \n\nThe remaining nations also appear on the draft restrictions list in some form, placing their potential World Cup participation in serious doubt.\n\nHow can this issue be resolved?\n\nIf the travel ban is enforced, it could set a dangerous precedent, undermining the integrity of the World Cup and excluding teams based on political decisions rather than sporting merit. \n\nAs the situation develops, FIFA, national football federations, and human rights groups are expected to weigh in on the issue, with hopes of finding a solution that upholds the principles of fair play and inclusivity in global football.\n\nWith the Mundial less than a year away, discussions are already underway to find a resolution. \n\nAs reported by beIN Sports, FIFA has begun talks with the U.S. government to explore potential exemptions for affected teams. \n\nGiven that FIFA mandates host nations to ensure that all qualified teams can participate, pressure is mounting on U.S. officials to provide assurances that players from restricted countries will be able to enter the country.\n\nSource: YEN.com.gh","summary":"A further six countries could be blocked from playing at the 2026 World Cup in the US after being included in Donald Trump’s proposed travel ban list.","url":"https://yen.com.gh/sports/football/289753-donald-trumps-travel-ban-block-nations-2026-world-cup/","image":"https://cdn.yen.com.gh/images/1200x675/b9d850074dd84cae.jpeg?v=1","video":null,"publish_date":"2025-08-23 23:03:52","author":"Isaac Darko,Samuel Obour","authors":["Isaac Darko","Samuel Obour"],"language":"en","source_country":"gh","sentiment":0},{"id":353678748,"title":"Inside Ukraine’s ‘fortress belt’ that Putin wants for peace – and why Russia might lose 2 million troops trying to conquer it","text":"Lines of dragons’ teeth bollards are established in Ukraine to protect against Russian attacks as part of the “fortress belt” that Vladimir Putin demands must be surrendered before considering any ceasefire.\n\nThe Sun on Sunday’s Defence Editor, Jerome Starkey, visited to assess these barricades and tank trap trenches, which President Volodymyr Zelensky claims would take four years to breach.\n\nUK’s Defence Intelligence experts estimate that 1.9 million Russian troops might become casualties during the time it would require to overcome this belt, which is the most fortified position in the war-torn region of eastern Donbas.\n\nIt stretches 30 miles from Slovyansk to Kostyantynivka in Donetsk Oblast [province] of which Russia currently occupies 70 per cent.\n\nThe Kremlin took 40 per cent when it launched a war on Ukraine in 2014, and has captured 30 per cent more since February 2022.\n\nDuring a meeting in Alaska last week with US President Donald Trump, Putin expressed his demand for all of Donbas, which includes Donetsk and Luhansk, as a precondition for a ceasefire, as experts argue his forces are unable to capture it.\n\nBungling US envoy Steve Witkoff initially claimed Putin would return Kherson and Zaporizhzhia as part of the deal. \n\nBut the Kremlin insisted it would do nothing more than freeze the front lines in those areas — clinging to territory it already holds.\n\nRussia knows how effective the fortress belt is, having copied it with the Surovikin line that stalled Ukraine’s counter-offensive in 2023.\n\nAnd Mr Zelensky immediately rejected giving up land, with experts warning it would gift Russian troops a launchpad for more attacks.\n\nHe told reporters after meeting Mr. Trump that Russia would require at least four years—based on its current progression rate—to conquer Donbas by force.\n\nHe mentioned: “The talks about capturing our Donbas by the end of the year are merely idle chatter. Occupying our Donbas would demand an additional four years.”\n\nNonetheless, Mr Trump has pressured Mr Zelensky to cede Ukraine’s land for peace. \n\nHe said Kyiv could end the war now with “land swaps”.\n\nHowever, war expert Matthew Savill, of the London-based Rusi think-tank, said talk of land exchanges could be seen as “a calculated insult to the Ukrainians” as all of the land being discussed is Ukrainian.\n\nHe said ceding the fortress belt would force hundreds of thousands of people to flee their homes.\n\nIt would also mean Russian forces move 50 miles east and leave Ukraine’s defenders in new positions that are harder to defend.\n\nAnd it would gift Russia a launchpad for further assaults into neighbouring Kharkiv and Dnipro oblasts.\n\nMr Savill said: “It would mean the loss of their most extensively fortified and resourced defences in the east, opening up Kharkiv and Dnipropetrovsk to future attacks.”\n\nEuropean leaders who met Mr Trump at the White House on Monday last week said it would be akin to America giving up Florida.\n\nBut Vice President JD Vance continued to press the idea of ceding land. \n\nThe US-based Institute for the Study of War said Putin’s demands were “all advantages for Russia and disadvantages for Ukraine”.\n\nIt also insisted the fortress belt was “critical” to Ukraine and warned there was “no guarantee fighting will not resume” even if it agreed to give the land up.\n\nIt would mean losing what is the main fortified defensive line in Donetsk Oblast since 2014 “with no guarantee fighting will not resume”.\n\nThe institute added: “Ukraine has spent the last 11 years pouring time, money and effort into reinforcing the fortress belt and establishing significant defence, industrial and defensive infrastructure” in and around the surrounding cities.”\n\nBritain’s Defence Intelligence said Russia would suffer nearly two million casualties over four years trying to take it by force, on top of its one million already wounded or dead.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLines of dragons’ teeth bollards are established in Ukraine to protect against&#8230;\n\n\nThis Post: Inside Ukraine’s ‘fortress belt’ that Putin wants for peace – and why Russia might lose 2 million troops trying to conquer it first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/inside-ukraines-fortress-belt-that-putin-wants-for-peace-and-why-russia-might-lose-2-million-troops-trying-to-conquer-it/","image":"https://internewscast.com/wp-content/uploads/2025/08/Inside-Ukraine-‘fortress-belt-Putin-is-demanding-in-return-for.jpg","video":null,"publish_date":"2025-08-23 23:03:40","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.005},{"id":353677460,"title":"Ghislaine Maxwell on her ruinous relationship with 'devious' paedophile Jeffrey Epstein: 'I wanted to have his kids but he never loved me... I wasn't his type'","text":"Sitting across from the handsome, shy financier on their first date, Ghislaine Maxwell could hardly take her eyes off the large ketchup stain on his tie.\n\nFor the Oxford-educated socialite, whose biological clock was ticking, Jeffrey Epstein seemed the perfect catch, a man she could 'get married and have children with'.\n\nBut, as Ghislaine sensationally revealed over nine hours of taped interviews with the US Deputy Attorney General, that innocent first meeting would plunge her into a sordid world of depraved sex – with her lover quickly rejecting her in favour of ever-younger girls.\n\nEven after they slept together for the first time, Epstein humiliated her by 'rejecting' her for the next nine months, claiming he suffered from erectile dysfunction, something she later learned was a lie.\n\nHe also pumped himself full of testosterone, the male hormone, which made him 'mean and angry', would masturbate in front of her and slept with hundreds of girls while Ghislaine shared his bed as 'friends with benefits'.\n\nAfter a decade of 'booty calls' and travelling the world running his estates, watching him live a 'Sex and the City' life surrounded by girls – many of whom would later claim he raped and abused them – Ghislaine would come to the conclusion: 'He never loved me and I wasn't his type.'\n\nThe full extraordinary story of how the privileged daughter of disgraced newspaper baron Robert Maxwell met the paedophile who would land her in jail for 20 years is compelling – and even more so when heard in the modulated upper-crust voice of a woman one victim called 'Mary Poppins'.\n\n'She spoke like the Queen, she was so English and prim, like a real-life Mary Poppins. It made me trust her,' Prince Andrew's accuser Virginia Giuffre said.\n\nIn the hours of tapes released late on Friday, Ghislaine broke her silence on her ten-year romance with the billionaire financier, revealing how she arrived in New York in 1991 shortly before the death of her father.\n\nGhislaine said: 'A girlfriend of mine said: \"I've got a guy for you.\" And I was like, \"Who is it?\" And she goes, \"He's been dating my sister, you'll love him. He's looking for a wife.\"\n\n'I'm edging towards 30. That's a very important moment for a girl to think about things.\n\n'I met him in his offices on Madison Garden. I think the most memorable thing I can think about was that he was wearing a tie which he didn't often do. It had a giant, seems like a ketchup stain on it. So I was like, wow, OK. And that was how we met.'\n\nWhen Robert Maxwell died in disgrace later that year – after falling from his yacht as he was investigated for plundering millions from his company's pension fund – Ghislaine was ostracised by London society and returned to New York.\n\nEpstein quickly offered her a job, using her connections to find him properties to buy and relying on her exquisite taste to decorate them with antiques and finery.\n\nThe former maths teacher was building his fortune on Wall Street but was 'gauche', with Ghislaine saying he humiliated her sexually from the start.\n\nShe said: 'In 1992, I slept with him one time and I was like, whoa, that's it. We're going to be dating because that's how I thought.\n\n'I felt if you slept with someone you were dating them. That's the world I came from. But then we didn't sleep together again for nine months.\n\n'He told me he had a heart condition which meant he didn't have intercourse a lot, which suited me fine because I actually do have a medical condition which precludes me having a lot of intercourse.'\n\nGhislaine rented Epstein a New York townhouse which was the former Iranian Embassy. Meanwhile, she was broke and living in a 'tiny 10ft by 10ft' apartment.\n\nEpstein offered her $25,000 a year to run his estates, which would eventually come to include a mansion in Palm Beach, a private Caribbean island, a penthouse in Paris, a sprawling ranch in New Mexico and New York's biggest private home on 71st Street in Manhattan. \n\nHer salary would eventually increase to $250,000 a year and she would move into her own brownstone in New York.\n\nGhislaine said she loved Epstein and believed they would 'marry and have children' one day – but quickly discovered she was not the only one.\n\nThe financier would never give her a key to his New York home and continued to see girlfriends such as former Miss Sweden, Eva Andersson, until around 1993.\n\nAs Epstein's fortune grew – he committed suicide in jail in 2019, leaving a staggering $550 million in the bank – the couple entered the jet-set world of the super-rich.\n\nGhislaine told of flights aboard Epstein's private jet – dubbed 'the Lolita Express' – to Africa, Europe and Latin America with 'good friend' former US President Bill Clinton and actor Kevin Spacey. She went hunting for dinosaur bones with Donald Trump's Health Secretary Robert F Kennedy Jr, met Fidel Castro in Cuba, flew a Black Hawk helicopter with the president of Colombia and went to lavish parties around the globe, including ones with Prince Andrew at Balmoral and Windsor Castle.\n\nOn one memorable occasion, they visited the Vatican in Rome and she was allowed to hold a letter written by Henry VIII asking the Pope for a divorce.\n\nThere were parties with supermodel Naomi Campbell and dinners with Bill Gates, Richard Branson and Elon Musk.\n\nShe was invited by Hillary Clinton to pop into the couple's home in Chappaqua in upstate New York because she was 'passing by'.\n\nThroughout the two-day interview with US Deputy Attorney General Todd Blanche, which took place last month in Tallahassee Federal Court, Ghislaine insisted she was never aware of Epstein's 'depravity' for young girls.\n\nShe said: 'I never saw it, never. In the entire time I was with him no one ever reported it to me or came to me and said anything inappropriate happened. I never saw a tear. I never saw any of that.\n\n'I want to be clear that had anybody ever reported anything illegal I would've immediately done something. I never saw what I would characterise as a child come to give him a massage and going upstairs.'\n\nEpstein eventually asked her to move out of his Palm Beach house and she described his lifestyle as like 'Sex and the City'.\n\nShe said: 'There are always these women around and men who like it. I knew he liked other forms of sexual activities.' \n\nCrudely, she said he would masturbate in front of her. As their love life dwindled to what she called 'friends with benefits', Epstein demanded she find him masseuses.\n\nShe said: 'Epstein... he loved massages. And if I met someone I thought was a good masseuse, I introduced them. He would get bored with a masseuse and would say \"Find me a new masseuse.\"'\n\nShe described Epstein's sexual life as a 'slide' where one massage a day turned into two – then more.\n\nGhislaine visited spas to recruit massage therapists but insists that she was never part of his depraved world. Many of Epstein's child victims say they were brought in under the pretence of giving him a massage only to be sexually assaulted and raped.\n\nIn a stunning admission, Ghislaine said: 'I do believe that Epstein did a lot, not all, but some of what he's accused of.\n\n'I'm not here to defend him in any respect. However the man I met and the man he became, I believe that there is a progression.\n\n'I think someone who has an interest… in underage people is obviously someone who is unwell. But I don't think you wake up one day and start doing what he's accused of.\n\n'He started doing testosterone and that altered his character. He became more aggressive.'\n\nShe claimed she was 'naive', adding: 'I started to suspect that he was not faithful. Seems ludicrous but that's what I thought. When I didn't have sex with him after that first time and it took so long, I asked him, \"Was it me?\" And he told me it was him.\n\n'I'm very bright. I've had an excellent education. I'd had boyfriends but I had never understood that someone would lie to me about it. I didn't have a frame of context of life experience where somebody would be so manipulative and devious with me.'\n\nFar from having erectile dysfunction, Ghislaine said Epstein, in fact, suffered from priapism, a condition which gives a man a continuous erection.\n\nDespite her insistence she never knew about the underage girls, Ghislaine's mask appeared to slip when she admitted: 'I like people my age or older and I don't find the society, or the companionship of younger people is... that enjoyable. I didn't like the company he chose to be with.' \n\nBut she lived in hope saying: 'I had wanted to get married and have children. And Epstein had encouraged me to believe that would happen… certainly by the mid to late 1990s.' She added Epstein was 'basically my life'.\n\nBut when the terror attacks of September 11, 2001, brought down the World Trade Centre and she rang Epstein for comfort, he refused to see her. She recalled bitterly: 'If you're not going to be there for someone on 9/11, you're never going to be there. For me, that was the line's end.'\n\nDespite their break-up – Ghislaine would go on to date billionaire Ted Waitt – she remained in Epstein's life, managing his properties, even after he was convicted on child sex charges in 2008. It would be a decision that would ultimately land her behind bars.\n\nGhislaine's love story with Epstein, which started so innocently and with such hope, ended up costing her everything – including her freedom.","summary":"For the Oxford-educated socialite, whose biological clock was ticking, Jeffrey Epstein seemed the perfect catch, a man she could 'get married and have children with'.","url":"https://www.dailymail.co.uk/news/article-15028365/Ghislaine-Maxwell-ruinous-relationship-devious-paedophile-Jeffrey-Epstein-wanted-kids-never-loved-wasnt-type.html","image":"https://i.dailymail.co.uk/1s/2025/08/23/21/101493785-0-image-m-34_1755981397698.jpg","video":null,"publish_date":"2025-08-23 23:02:36","author":"Caroline Graham,Editor","authors":["Caroline Graham","Editor"],"language":"en","source_country":"gb","sentiment":-0.014},{"id":353676562,"title":"Flying Ukraine flags ‘a visible symbol of UK’s unwavering support’ – Government","text":"Ukrainian flags will appear above Downing Street and several Whitehall buildings to mark 34 years since Ukraine left the Soviet Union, the Government has announced.\n\nThe Prime Minister’s official residence at No 10 Downing Street is among the buildings where a flag will fly on Sunday.\n\n“We stand in solidarity with the Ukrainian people, including those who have made a second home here in the UK, in the face of continued Russian aggression,” a Government spokesperson said.\n\n“Our support for Ukraine’s independence will be clear for all to see, which is why the Prime Minister travelled to Washington DC this week to work with allies to secure a just and lasting peace for Ukraine.”\n\nAt the White House, Sir Keir Starmer met European leaders including Ukrainian leader Volodymyr Zelensky, Nato secretary general Mark Rutte and French President Emmanuel Macron.\n\nHe also met Donald Trump days after the US president spoke to his Russian counterpart Vladimir Putin at an Alaska summit.\n\nAfter his meetings, Mr Trump wrote on his Truth Social platform: “Everyone is happy about the possibility of PEACE for Russia/Ukraine.”\n\nHe claimed he had started to organise a meeting between Mr Putin and Mr Zelensky, but Russian foreign minister Sergey Lavrov said there was “no meeting planned” between the two leaders in a taped interview for NBC’s Sunday show Meet The Press With Kristen Welker.\n\n“On Ukrainian Independence Day, Government buildings are flying the blue and yellow flag of Ukraine as a visible symbol of our unwavering support,” the Government spokesperson added.\n\nAmong the buildings where a flag will be flown are the Cabinet Office at 70 Whitehall, the Treasury building at 100 Parliament Street, the Scotland Office and Wales Office, and the Foreign Office and Ministry of Defence main buildings.","summary":"A spokesperson said: “Our support for Ukraine’s independence will be clear for all to see.”","url":"https://www.standard.co.uk/news/politics/keir-starmer-ukraine-donald-trump-vladimir-putin-government-b1244275.html","image":"https://static.standard.co.uk/2025/08/24/00/685c5075681a2d9e05013858cf18a755Y29udGVudHNlYXJjaGFwaSwxNzU1OTYzNzAx-2.66735497.jpg?width=1200","video":null,"publish_date":"2025-08-23 23:01:00","author":"Will Durrant","authors":["Will Durrant"],"language":"en","category":"politics","source_country":"gb","sentiment":0.368},{"id":353686420,"title":"Why Republicans keep saying slavery was great","text":"Most rational human beings who know anything about American history believe that the practice of slavery was one of the United States’ original sins, and that it was allowed for too long. Untold millions suffered due to the enslavement of human beings across generations in a way that still has very real lingering effects.\n\nWhich makes slavery the most bewildering topic for Republicans to want to explore the upside of.\n\nPresident Donald Trump made clear on Tuesday that he doesn’t like all this negative talk about slavery, and complained that the Smithsonian museums are too “woke.” \n\n“The Smithsonian is OUT OF CONTROL, where everything discussed is how horrible our Country is, how bad Slavery was, and how unaccomplished the downtrodden have been — Nothing about Success, nothing about Brightness, nothing about the Future,” Trump bleated on Truth Social.\n\nWhite House senior associate Lindsey Halligan appeared on Fox News to underscore Trump’s message.\n\n“What I saw when I was going through the museums personally was an overemphasis on slavery,” said the white woman. “And I think there should be more of an overemphasis on how far we've come since slavery.”\n\nRelated | Trump commands Smithsonian to pipe down on 'how bad Slavery was'\n\nIn an Aug. 13 appearance on CNN, pro-MAGA celebrity trainer Jillian Michaels argued that museums like the Smithsonian give too much weight to the role of pro-white racism when discussing slavery.\n\n“You cannot tie imperialism and racism and slavery to just one race, which is pretty much what every single exhibit does,” Michaels said.\n\nSlavery in America was practiced for over 200 years. It involved the subjugation of Black people forced into labor for the benefit of white people. Slaves built the foundations of America’s economic supremacy and were not paid a dime for it, and many lost their lives in the process. These are not facts up for dispute or quibbling around the edges. It happened, it was well-documented, and everyone who sets foot in the country is surrounded by the aftermath of this debilitating, inhuman practice.\n\nThe MAGA drive to whitewash slavery didn’t appear out of nowhere. Trump is a racist who has pursued a racist agenda. His administration has sought to roll back or purge civil rights-era gains. Under his orders, the U.S. government is in the middle of a push to absolve and even honor the pro-slavery Confederacy. And the right wing has long sought to deemphasize slavery’s severity and downplay its ripple effect.\n\nFor instance, Republican-run states like Florida and Texas have pushed school curricula attempting to educate children on the purported upside of slavery. The Florida version of this was materials that raved over how “slaves developed skills which, in some instances, could be applied for their personal benefit.” In Texas, the thought process was that children shouldn’t learn about the use of Black slaves to build notable structures, like Thomas Jefferson’s famed Monticello estate.\n\nConservative politics has for decades been focused on pushing white voters with racist sympathies to vote red. This has led the GOP to emphasize that group’s grievances, including praise for the Confederacy and made-up issues like “white genocide.” Arguing that slavery wasn’t all bad or at a minimum arguing that there was something positive about keeping millions of Black people as property fits within that morally bankrupt paradigm.\n\nConservative leaders and Republican voters have made it clear for a long time that they prefer fairy tale narratives about America’s past over the truth—because that truth could expose the legacy of white supremacy.\n\nOf course this is not reality. Slavery was a massive mark on America and it was followed up by policies like Jim Crow and redlining, along with many of the ideas at the center of modern Republican politics. It is not a coincidence that after America twice elected a Black man named Barack Obama as president, that this generated backlash with many white voters and led to the ascendancy of a racist like Trump.\n\nNo matter how the right tries to rewrite reality for schoolchildren or manipulate museum exhibits, the facts will never change. Slavery was wrong, it was an integral part of the foundation of America, and everyone who lives in this country has to deal with its dark legacy every day of their lives.","summary":"Most rational human beings who know anything about American history believe that the practice of slavery was one of the United States’ original sins, and that it was allowed for too long. Untold millions suffered due to the enslavement of human beings across generations in a way that still has very real lingering effects.\n\n\n\nWhich makes slavery the most bewildering topic for Republicans to want to explore the upside of.\n\n\n\nPresident Donald Trump made clear on Tuesday that he doesn’t like all this negative talk about slavery, and complained that the Smithsonian museums are too “woke.” \n\n\n\n“The Smithsonian is OUT OF CONTROL, where everything discussed is how horrible our Country is, how bad Slavery was, and how unaccomplished the downtrodden have been — Nothing about Success, nothing about Brightness, nothing about the Future,” Trump bleated on Truth Social.\n\n\n\nWhite House senior associate Lindsey Halligan appeared on Fox News to underscore Trump’s message.\n\n\n\n“What I saw when I was going through the museums pe","url":"https://www.dailykos.com/story/2025/8/23/2339741/-Why-Republicans-keep-saying-slavery-was-great?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1470431/story_image/ETR21.png?1755901055","video":null,"publish_date":"2025-08-23 23:00:04","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.338},{"id":353683272,"title":"State of Texas: 'This is not over,' next phase of redistricting battle looms","text":"AUSTIN (Nexstar) -- The battle over redrawing voting lines in Texas reached a crescendo at the Capitol this week. On Monday, most of the House Democrats who were breaking quorum returned to the state, clearing the way for a vote on the contentious plan. For Wednesday's vote, Democrats rallied outside the chamber, vowing to fight on. Inside the House, efforts to change the bill fell short, and the legislation passed along party lines. The bill passed the Senate early Saturday morning, after Republicans in the chamber made a procedural move that blocked a planned filibuster by State Sen. Carol Alvarado, D-Houston. From the start, it was clear that Democrats did not have the votes to stop redistricting legislation at the Capitol. The focus now is on the next phase of the fight, with both sides looking to the courts and to redistricting efforts in other states. California voters will decide in November whether to approve a redrawn congressional map designed to help Democrats win five more U.S. House seats next year, matching the Republican gains expected by redistricting in Texas. California lawmakers voted mostly along party lines Thursday to approve legislation calling for the special election. Democratic Gov. Gavin Newsom has led the campaign in favor of the map. The fight goes beyond California and Texas. Other states are also considering redistricting plans, including Indiana and Missouri, which lean Republican. While the Texas plan will likely face legal challenges before taking effect, it is already having an effect on the 2026 elections. Hours after the bill cleared the House, State Rep. Briscoe Cain, R-Deer Park, announced he would run for the newly drawn Congressional District 9 in the Houston area. In central Texas, the new voting districts may push out a Congressman who has served for decades. Lloyd Doggett was first elected to Congress in 1995. Rep. Doggett currently represents District 37, one of two Austin-area districts held by Democrats. The other is District 35 held by Rep. Greg Casar. The new map moves District 35 out of Austin to cover parts of San Antonio and counties south and east of the city. Voters in that new district favored Donald Trump by 10 points in the last election. Doggett and Casar appeared together at recent rallies opposing redistricting. But both democrats faced questions about a potential primary showdown under the new maps. Casar leads the Congressional Progressive Caucus in Washington, and some progressives in central Texas started a vocal campaign in support of the younger congressman. Thursday morning, a group led by former state senator Wendy Davis called for Doggett to step aside to clear a path for Casar. \"We want to make sure that we are not risking losing Congressman Casar and the incredible, incredible trajectory he's on right now, and his ability to represent Texas, and honestly the country as a whole in the role that that he has right now,\" Davis said. Later that day, Doggett issued a news release, saying he would end his reelection campaign if the new district map survives court challenges. That would rule out a primary against Casar. Doggett said the statement from Davis highlighted division among Texas Democrats, which he believes would detract from progressive goals. \"What did affect me from that is that beginning at 4:00 AM in the morning, a Twitter storm started and social media battle on Democratic chat groups, and it was just indicative of the fact that we're going to have a slug fest here if we have two Democratic members of Congress running against one another,\" Doggett said, addressing reporters on Friday. \"That is not in our interest at a time our country is in such peril, and when we need everyone united against Trump autocracy. And so that's why I decided to step aside, not because of what was written, but the reaction to it as an indication of what would lie ahead in a six month slug fest,\" Doggett added. After Doggett's announcement, Casar had kind words for his fellow congressmen. He posted on social media, \"Lloyd Doggett is an Austin institution. I've learned so much from him. I'm grateful to him. The fight for democracy continues.\" Doggett emphasized that he is still running for reelection to his current district. He believes that courts should reject the redrawn maps that Texas lawmakers passed. Gov. Greg Abbott is calling on lawmakers to pass more legislation during the ongoing Special Session. Wednesday evening, he announced that he added three items to the Special Session #2 agenda. Among them, a measure to allow over-the-counter access to Ivermectin. State Rep. Joanne Shofner, R-Nacogdoches, has proposed a bill to give patients access to Ivermectin without a presccription. The drug, which is used for treating parasitic infections in animals and humans, gained attention when people began using it to treat symptoms of COVID-19. Current research from the CDC does not support claims that the drug is effective to treat COVID-19. Shofner said people should have freedom to choose to take the drug. \"This is one of the primary things when I ran that I wanted to have some sort of medical freedom. We have to be able to be free in order to select the medicine we need,\" Shofner said. Rep. Shofner authored a similar bill in the regular session, which failed to advance. She said the biggest hurdle is what she described as big pharma. \"Back in 1994 is when the patent went out, so there's no money to be made on it, so they're not pushing it,\" Shofner said. Dr. Zeke Silva with the Texas Medical Association testifited against the original version of Shofner's bill. He said a doctor should be involved in making the decision whether a patient should take Ivermectin. \"You could imagine a scenario where a medication interacts with another medication. In this case, imagine Warfarin, that might lead to a bleeding complication,\" Silva said. Shofner is optimistic about the chances for her legislation. She noted that at least three other states have approved over-the-counter access to Ivermectin. \"That sends a huge message,\" she said. A news release from the Governor's office outlined the additional items added to the special session call, which Abbott described as \"important issues that will benefit Texas.\" Dozens of families packed inside a small room at the Texas Capitol Monday shared tragic stories — and where their lives are now — after learning their daughters died in July floods at Camp Mystic. \"My anguish is as infinite as the stars in the sky ... a black hole of pain,\" 8-year-old Virginia Hollis' mother said. \"We don't know when she died, we don't know how, we really don't know anything ... Camp Mystic families advocate for flood safety legislation at Capitolall we do know is our daughter was at camp, she was not protected, she was not safe.\" After 25 campers and two counselors were swept away by fast-rising water, lawmakers are looking to pass legislation to create uniform flood safety measures, protocols and standards. This, after Camp Mystic, along the Guadalupe River, has been criticized by parents and officials for not doing enough to keep kids safe. Senate Bill 1 relates specifically to camp ground and youth camp safety. It would require a number of changes: The reality for families who lost their girls is dark, as they work to honor their daughters who were lost in what has been deemed a preventable loss. After their testimony, senators also heard from other camp that do have effective safety measures, to help with determining best practices. Both the Senate and the House moved quickly to pass legislation to create more uniform safety standards for camps. One day after the Senate hearing, many of the families returned to the Capitol. They sat in the gallery for the vote on House Bill 1, which requires youth camps to submit detailed emergency preparedness plans for floods. It also bans camps from building cabins in 100 year flood plains. \"When I speak on this bill and for this bill, I hope I'm not just speaking for myself, but for the lost children, the grieving families who have called us met with us and shared their heartbreaking grief with us,\" State Rep. Drew Darby, R-San Angelo said from the House floor, looking up at the parents seated in the gallery. Rep. Darby authored HB 1, a bill that had strong bipartisan support. \"Let me be clear, nobody could have anticipated, nobody could have anticipated what happened that weekend, but we could have been better prepared,\" State Rep. Donna Howard, D-Austin said. Her voice broke as she spoke, which happened to several other lawmakers who spoke in support of the bill, recognizing the grief of the affected families. Before the vote, House members paid tribute to the 27 girls who died at Camp Mystic, reciting their names and recognizing their families in the gallery. \"Members this bill is for Heaven's 27,\" Darby said, leading up to the vote to pass the legislation. Hours later, the families returned to the Capitol, this time to watch Senators pass SB 1, the Senate version of the camp safety bill. \"I can tell you that on a bipartisan basis, the members of this floor and this Senate are here to take action so that this never happens again,\" Lt. Gov. Dan Patrick told the families sitting above in the Senate gallery. Bill author Sen. Charles Perry, R-Lubbock, said he worked closely with the families to shape the legislation, and he addressed them before the final vote. \"You've acknowledged your strengths comes from your kiddos, and it will be with you forever, and don't ever, ever forget to lean on that in your bad days. But what you've done for me was your testimony and witness of faith in action,\" Perry said from the Senate floor. Perry asked the families to stand as he read tributes to each of 27 girls who died at Camp Mystic. Then, Senators took the voted unanimously to pass Senate Bill 1. The Texas House committee on public education advanced a plan that would eliminate the state's current standardized test and replace it with a new type of testing that is designed to hopefully reduce anxiety and stress for students in the classroom. But it doesn't appear to have bipartisan support. House Bill 8 -- authored by State Rep. Brad Buckley, R - Salado, would repeal the State of Texas Assessments of Academic Readiness, or STAAR, test at the start of the 2027-2028 academic year. Buckley said it would be replaced with a series of shorter assessments throughout the school year. \"To eliminate the high-stakes, one test, one day environment,\" Buckley said to his colleagues on the committee as he laid out the bill. Lawmakers on both sides of the aisle agree the STAAR test needs to go. During the regular session this year, the original STAAR-repeal proposal almost received unanimous support in the Texas House, but disagreements with the Senate ultimately killed the bill. The added pressure placed on students with the STAAR test became apparent in the committee meeting after a seventh grade student from Fort Worth ISD testified. \"The STAAR test creates that major weight on my brain where I can't think while the teacher is giving me information,\" the student said. \"I don't sleep well and I don't eat well. Now you tell me if that seems healthy for a child's brain and body.\" The current proposal would create three different tests spaced throughout the school year. A beginning of the year test, a middle of the year test, and an end of year test. The first two tests will be adaptive, meaning the questions will change for each student depending on if they got the previous question correct. This will provide data to show what grade level of a subject each student is testing at. Those test results will be available to both teachers and parents 48 hours after the assessment. Mary Lynn Pruneda, the director of education policy at Texas 2036, a nonpartisan public policy group, said the proposed testing system will help educators track how their students are progressing throughout the school year. \"An adaptive test goes up and it goes down, and it can get you a really full picture of where exactly your child is performing,\" she explained. The end of year assessment will be the same for all students and will be pushed back to later in the year to give teachers more time to teach. HB 8 also bans over testing and sets a limit on the number of preparation tests a district can give a student. The bill passed out of committee with eight ayes and one no, with six members not present. State Rep. Gina Hinojosa, D - Austin, was the lone dissenting vote and the only Democrat of the present members. Her main concern with the testing proposal centers on who is making the test. The proposal would require the Texas Education Agency (TEA) to do the job. \"I just have no faith that our state will do a good job of it as it has not done a good job with the creation of the STAAR test,\" Hinojosa said. She instead is advocating for a nationally norm-referenced test that would show how Texas students are doing in comparison to other states. Hinojosa points out students in Texas who are not in the public education system are tested with a national test instead of a test created by the state. House Bill 4 -- the original plan to repeal the STAAR test in the regular session -- did replace the STAAR with three nationally norm-referenced tests. However, Buckley, who wrote HB 4 earlier in the year, decided to go with a criterion-referenced test for the end of year exam. So what's the difference? Pruneda explains the difference with the analogy of two different types of scales. She equates the norm-referenced test with a balance scale, which shows you the comparison of weight between two different objects. In terms of education, it shows you who is better or worse in test scores. The criterion-referenced test is like a scale you step on to see how much you weigh, Pruneda explained. It shows you exactly how much you weigh down to the ounce. \"A norm-referenced test, which was talked about during the regular legislative session, actually requires that 50% of kids don't pass. But a criterion-referenced test is a lot more useful to moms and dads, because it tells them exactly if their kid is on grade level and anything that they're specifically struggling with,\" Pruneda said. State Rep. John Bryant, D - Dallas, asked Buckley during the meeting why there was a drastic change from HB 4 in the regular session and HB 8 in the special session. Buckley said he had been able to speak with stakeholders over the past couple of months to find the best pathway forward, and he felt a norm-referenced test would not accurately assess Texas students on the state's education standards. \"I think this is a fair sort of marriage of the two ideas that gives flexibility to districts that can move for growth throughout the year, but also gives us the opportunity to know whether or not kids are achieving at the at a level they should be on the state standards.\" An almost identical bill already passed out of the Texas Senate. The House bill now moves to the floor for a vote.","summary":"The battle over redrawing voting lines in Texas reached a crescendo at the Capitol this week. On Monday, most of the House Democrats who were breaking quorum returned to the state, clearing the way for a vote on the contentious plan.","url":"https://www.kxan.com/news/state-of-texas-this-is-not-over-next-phase-of-redistricting-battle-looms/","image":"https://www.kxan.com/wp-content/uploads/sites/40/2025/08/IMG_3863.jpg","video":null,"publish_date":"2025-08-23 23:00:00","author":"Adam Schwager,Dylan McKim,Jala Washington,John Thomas,Josh Hinkle","authors":["Adam Schwager","Dylan McKim","Jala Washington","John Thomas","Josh Hinkle"],"language":"en","source_country":"us","sentiment":0.076},{"id":353677154,"title":"What the Queen REALLY thought of Trump: Critics said he was rude to her - but the truth is much more unexpected… In a new edition of his peerless biography of the King, ROBERT HARDMAN reveals astonishing new details about the royals","text":"What the Queen REALLY thought of Trump: Critics said he was rude to her – but the truth is much more unexpected… In a new edition of his peerless biography of the King, ROBERT HARDMAN reveals astonishing new details about the royals\n\nRead part one: Why the Palace was SO appalled by Harry's TV 'stitch-up'... and tasteless plea that came next: in a new edition of his peerless biography of the King, Royal author ROBERT HARDMAN reveals astonishing new details of Prince's behaviour. Read them HERE\n\nBy ROBERT HARDMAN FOR THE MAIL ON SUNDAY\n\nPublished: 23:55 BST, 23 August 2025 | Updated: 23:58 BST, 23 August 2025\n\nIf 2024 had been the year of health setbacks, then 2025 was the year when the monarchy was suddenly a trophy soft power asset – caught in a custody battle. In short, 2025 was about Donald Trump.\n\nMr Trump’s fondness for the Royal Family was genuine and deep-seated. His first presidential visit to the UK was in 2018 (ahead of his State Visit in 2019) and that event came with one very firm pre-condition. ‘It was made very clear to us that the reason Donald Trump wanted to come was to meet the Queen,’ the British foreign secretary at the time, Jeremy Hunt, admitted. ‘She was our greatest asset, and so we were told by the Americans, “If you want him to come and it involves tea with the Queen, he’ll come.” ’ The Queen was very happy to welcome him to Windsor for tea at the end of his short visit.\n\nA popular press narrative, regularly resurrected by Trump critics on both sides of the Atlantic, has taken root that Mr Trump was ‘rude’ to the Queen. The charges are that he had kept her waiting on the greeting dais by arriving late and that he had walked in front of her during the inspection of the Guard of Honour in the Quadrangle of Windsor Castle. Members of the Royal Household who were actually there deny this, saying that the Queen was not remotely put out.\n\n‘Trump did nothing wrong at all. He arrived exactly on time. It was the Queen who had come out early because she wanted to check the dais and the steps, which were always a concern at that stage of her life,’ says one senior member of her staff. ‘You have to remember that this was her first big event since the Duke of Edinburgh’s retirement from public duties the year before.\n\n‘She wanted to get it right. It was the same inspecting the troops. All through her reign, it would be the duke who escorted the visitor to do the inspection and she hadn’t done it before. And Trump did the right thing. The visitor is always invited to walk first and she had to gesture to him to go in front. The anti-Trump crowd were determined to find a faux pas. There wasn’t one.’\n\nOne of the late Queen’s staff recalls that the conversation flowed as the monarch served Mr Trump and his wife, Melania, tea in the Oak Room. The two leaders had a ‘genuine rapport’, not least because they had some things in common: both had Scottish mothers and both had significant landholdings in Scotland. ‘It wasn’t just small talk. They discussed policy matters. He was super charming, on his best behaviour throughout,’ says the royal staffer. One thing that struck everyone, including the Queen, was the President’s energy: ‘He would bound up and down the stairs. When Joe Biden came three years later, we had to put him in the creaky old Edwardian lift.’\n\nThe visit had been scheduled to last 20 minutes but went on for 40. It also meant that when Mr Trump returned for the proper State Visit the following year, there was a link. ‘It’s always easier when you can begin by saying, “Hello again, Mr President.” There was a connection there,’ says the Palace source. ‘No doubt about that.’\n\nSeveral years later, the moment had lost none of its magic for Mr Trump as he was filmed looking through a new book of photographs of his first presidency, many of them featuring him with the Queen and the Royal Family. ‘It’s a piece of history at the highest level,’ he murmured, flicking through the pages. ‘She was unbelievable. We had a really good relationship. There’s Charles. He’s a really good person. Camilla is fantastic.’\n\nQueen Elizabeth and Donald Trump are pictured inspecting the Guard of Honor at Windsor Castle in July 2018\n\nTrump and the Queen clinking glasses after delivering remarks. The president ordinarily drinks white grape juice at such functions whereas the Queen drank water\n\nTrump and Melania walk from the Quadrangle at Windsor after inspecting the Guard of Honour in 2018\n\nIn 2025, a new British government wanted a new monarch to rekindle that rapport with a new US administration. No one could deny, for example, that Mr Trump’s past pronouncements on climate change were at odds with those of the King in princely days. However, as noted earlier, the monarch reigns with different responsibilities, just as today’s judge is not yesterday’s barrister.\n\nThe initial signs were more than encouraging on a blustery Saturday night in Paris in December 2024. Mr Trump was still in pre-inauguration president-elect mode and had joined other world leaders flying to Paris for the reopening of Notre-Dame de Paris, five years on from the fire that destroyed much of the cathedral. Earlier in the day, it was announced that the Prince of Wales, attending on behalf of his father, would have a meeting with Mr Trump before the service started.\n\nHowever, with northern Europe being battered by Storm Darragh, William’s plane was delayed and profuse apologies were conveyed to the Trump team that there would be no time to meet before the service. With some leaders, Mr Trump’s response would have been a shrug and a ‘so sorry, see you soon’. However, the president-elect’s staff simply re-arranged the meeting to a slot after the service. What’s more, the prince would not have to travel to meet Mr Trump. Instead, the president-elect would come round to see him at the British embassy.\n\nTo cap it all, a 15-minute meeting went on – and on. British diplomats were somewhat amused when, after 45 minutes, the embassy received a call from the Elysee Palace. President Macron’s staff wanted to know where Mr Trump had got to, as the presidential banquet was starting.\n\n‘Mr Trump very much enjoyed the conversation,’ says one of the British team, ‘and that conversation was incredibly warm about the memories that he had of meeting the prince’s grandmother. There was a lot of talk about the late Queen and of how important that was to the President.’\n\nThe next day, Mr Trump told the New York Post that the Prince ‘looked really very handsome last night’ during a ‘great, great talk’.\n\nWithin a few weeks of Mr Trump’s inauguration on January 20, Sir Keir was in the Oval Office for one of the President’s new-style televised armchair ‘welcomes’, alongside a sofa full of Trump acolytes. Sir Keir wasted no time in playing what some commentators would call his Trump trump card: the Royal Family.\n\nSuccessive British governments have done this. Go through the declassified files on the famous Ronald Reagan visit of 1982 – at the height of the Falklands War – and the diplomatic traffic shows that the top priority for the president on his first European tour was clearly riding at Windsor with the Queen. Sir Keir was determined to play similar mood music.\n\n‘It is my pleasure to bring from His Majesty the King a letter,’ he began, nervously. ‘He sends his best wishes – but he asks me to bear this letter and bring it to you.’\n\nIt is very telling, though little remarked upon at the time, that Mr Trump’s first reaction was neither to tear it open, nor to pocket it for later inspection. Instead, he wanted to do the right thing when it came to royalty. ‘Am I supposed to read it right now?’ he replied, seeking guidance.\n\nRobert Hardman's exclusive details on the Queen's impression of Donald Trump have been adapted from the new edition of his biography Charles III: The Inside Story \n\nQueen Elizabeth II sitting with Donald Trump at an event to commemorate the 75th anniversary of the D-Day landings in June 2024\n\nTrump and Melania Trump with Queen Elizabeth walking into the Music Room for a State Banquet at Buckingham Palace in June 2019\n\n‘Yes, please do,’ said Sir Keir. ‘I need to tell him what your reaction is.’ ‘He is a great, great gentleman,’ murmured the President as he spent 17 seconds scanning the letter before concluding: ‘That’s – wow! Well that is really nice. I must make sure his signature is on that otherwise it’s not quite as meaningful. And it is!’ A handsome, thick-nibbed ‘Charles R’ was waved around before the cameras. ‘And that’s quite a signature, isn’t it. He’s a beautiful man and a wonderful man. And I’ve known him – I know him very well, actually.’\n\nRather than take the lead and announce the big ‘reveal’, Mr Trump was, again, happy to defer.\n\n‘Perhaps you’d like to say what that very important paragraph says,’ he asked Sir Keir, who duly obliged, addressing the room. ‘Yes, this is a letter from His Majesty the King. It’s an invitation for a second State Visit. This is really special. This has never happened before! This is unprecedented and I think that symbolises the strength of the relationship between us. I think the last State Visit was a tremendous success.’ ‘It was,’ Mr Trump assured him.\n\n‘His Majesty the King wants to make this even better than that,’ the Prime Minister went on, repeating the ‘unprecedented’ nature of a second visit. Lawyer that he is, Sir Keir now needed to clinch the deal: ‘What I haven’t got yet is your answer. I do need to...’\n\nTo which Mr Trump beamed and replied instantly: ‘The answer is yes. On behalf of our wonderful First Lady Melania and myself, we look forward to being there and honouring the King and honouring your country. Your country is a fantastic country.’\n\n‘I shall happily take that back to His Majesty,’ Sir Keir concluded.\n\n‘It’s beautiful,’ murmured the President, before remembering to retrieve the letter: ‘I’m going to keep that one!’\n\nBritish diplomats could not have wished for a more promising opening encounter with the new administration. Some veterans within the royal circle, however, were uncomfortable with the lack of decorum surrounding an invitation from the sovereign. ‘It was like seeing someone with their trousers down,’ was how one described it. ‘These things should be done with dignity.’ The fault, say the critics, was not Mr Trump’s, but Sir Keir’s.\n\nOn her initial visit to the first Trump administration in 2017, the then-British PM Theresa May had also delivered a royal invitation to make a State Visit to Britain. That letter had not been ripped open in front of the cameras, but conveyed in private and its contents announced afterwards. Sir Keir could have done the same.\n\nInstead, during a private White House meeting prior to the spectacle in the Oval Office, he had told Mr Trump that he came bearing a personal letter from the King and proposed to hand it over in front of the media. Mr Trump concurred.\n\nThe Palace was not consulted on the Prime Minister’s theatrical presentation of correspondence written in a congenial, conversational style, the King’s words clearly not intended for instant public consumption. It was, in effect, a personal overture, expressing the King’s (and the UK’s) desire to host a second State Visit. A formal invitation would follow later when dates had been arranged.\n\nThe King had suggested Mr Trump might, initially, like a more informal meeting at one of the royal estates, if he were visiting one of his Scottish golf courses. The two of them could also discuss plans for the State Visit. He even suggested Dumfries House, home of his King’s Foundation and its hospitality programme for training young people ‘who often end up as staff in your own establishments’.\n\nIn his enthusiasm to flatter his host, Sir Keir had not been entirely accurate about one detail, a surprising oversight for a normally fastidious lawyer. The offer of a second State Visit was certainly unusual, but it was far from ‘unprecedented’.\n\nTrump is seen fist-bumping Queen Elizabeth during a trip to London in June 2019\n\nIn recent years, Queen Margrethe of Denmark, for example, had enjoyed two State Visits to Britain, as had France’s President Poincaré in the reign of George V. The ‘unprecedented’ element of the invitation (as the King had stated in his letter) was the fact that no previous US president had made two State Visits to the UK, though this was perhaps not surprising. Until George W. Bush’s State Visit in 2003, all presidential trips to Britain – even Ronald Reagan’s eventful stay at Windsor – had been designated ‘official’ but not ‘state’ visits.\n\nWhat was not in question, though, was Britain’s determination to utilise the durable soft power of the House of Windsor to the full. Britain had two priority foreign policy objectives at the start of 2025: a new relationship with a new Washington; and resetting the UK’s relations with Europe.\n\nThe King’s State Visit to Italy in April and his invitation to President Macron of France to make a State Visit to Britain in July would help with the second. Offering Mr Trump a State Visit would help with the first, though the rapid pace of events would not leave time for an informal Scottish tête-à-tête in advance, as the King had proposed in his letter.\n\nOne world leader, however, was not pleased about the invitation – and said so. Asked what Canadians thought about Britain’s invitation to Mr Trump, the new Canadian Prime Minister Mark Carney had replied: ‘To be frank, [they] weren’t impressed by that gesture, given the circumstance.’\n\nTrump’s closest political ally in Britain is Nigel Farage, leader of the Reform Party (pictured together in 2016)\n\nShortly after his election victory, but pre-inauguration, Mr Trump had told the then Canadian prime minister Justin Trudeau, over a private dinner, that if Canada could not endure the hefty tariffs he was proposing for Canadian imports, ‘then maybe Canada should become the 51st state [of the USA]’. Initially, Canadian politicians brushed it off as a joke. Except that Mr Trump started referring to the prime minister as ‘Governor Justin Trudeau of the Great State of Canada’.\n\nThe ‘joke’ was no longer a joke once Mr Trump was in the White House and had started ramping up the rhetoric about annexing new territory, including Greenland, Panama and, in particular, the larger part of North America. After more than a century as friends, neighbours and great wartime allies, not to mention fellow members of Nato, Canada suddenly felt peculiarly vulnerable.\n\nLaid low by internal politics, Mr Trudeau stepped down. He was replaced by Mark Carney, who promptly called a general election, fought it on the issue of Canada versus Trump and won. Among his first acts was to ask Canada’s head of state to open the new parliamentary session.\n\nIt was very short notice by royal standards but the King’s team arranged a two-day visit, bolting on separate audiences with leaders of Canada’s three main indigenous peoples. He even squeezed in a reunion with some of the ‘Weston girls’, the 50 Canadian teenage schoolgirls chosen to go to London for the 1953 Coronation, courtesy of the businessman and philanthropist, Garfield Weston.\n\nThe next morning, the King was seated in the Senate on his Canadian throne. His British government had, quite correctly, been excluded from this process.\n\nHis speech had been written ‘on advice’ from his Canadian prime minister, a small but significant difference from the convention in Britain. When the monarch opens Parliament at Westminster, the speech is ‘written by’ the UK government and is simply a shopping list of policies to be recited by the occupant of the Throne. A speech ‘on advice’ (whether at a state banquet or on a royal tour) is more nuanced and collaborative. It might be written by the government, but there can be appropriate input from the monarch and scope for Palace officials, in their words, to ‘cast a constitutional lens’ over the text.\n\nBORIS JOHNSON: Trump's broken the logjam - and peace is now a step closer…\n\nThis was the case in Canada – and it was very much more than a list of policies. Every word had been weighed up by the monarch as well as the politicians.\n\nThough King for less than three years, Charles III had been active in world politics for longer than almost anyone on Earth. His first meeting in the Oval Office (with Richard Nixon) had taken place when Mr Carney was five. So while the rules state that a constitutional monarch must always act on advice from ministers, common sense dictated that the King should be handed a speech with which he was personally content.\n\nIt turned out to be a deftly crafted half-hour homily on Canadian values, and it went much further than many had expected. These were values, he said, worth ‘far more than any foreign power on any continent can ever take away’. The King put a benign gloss on talks between ‘the Prime Minister and the President of the United States’ to build ‘a new economic and security relationship between Canada and the US rooted in mutual respect’. That phrase, ‘mutual respect’, was working hard. This, he went on, would bring ‘benefits to both nations’, except that the King did not quite say that. He added what would normally be a wholly superfluous word and said ‘both sovereign nations’.\n\nQuietly noting each coded reference, his audience finally cracked when he observed: ‘As the anthem reminds us: “The True North” is indeed strong and free.’ Canada is north of only one border. The ovation, a flagrant breach of parliamentary convention, was long and heartfelt. The tradition is for speeches from the throne to be lukewarm, vanilla, demonstrably neutral and heard in complete silence. Not this time.\n\nThe King had not even finished. He waited for the clapping to subside before delivering his final words, holding himself together up to that emotional last line. As the King of Canada came to the end of this one, there was a discernible crack in his voice as he made his parting blessing: ‘May God bless and guide you in all your duties.’ Whereupon, both houses of the Canadian parliament jumped to their feet in noisy applause.\n\nThe King’s words would, of course, be analysed forensically in Washington, London and elsewhere. His speech and all the pageantry around his visit had amply reinforced Mr Carney’s central message that Canada is not for sale. Yet the King had also been sufficiently statesmanlike so as not to derail the very different strategy of his Prime Minister on the other side of the Atlantic. Sir Keir Starmer’s plan remained simple: avoid a rift with President Trump at all costs.\n\nThe late Queen had formally opened this parliament once – in 1957. Her visit had been a milestone (no Canadian monarch had done this before), but it had not been as loaded with this sort of diplomatic and political baggage. Indeed, it could be said that this speech represented the greatest (non-medical) challenge of the reign of Charles III so far.\n\nADAPTED from Charles III. The Inside Story by Robert Hardman (Pan Macmillan, £12.99). New edition to be published on August 28. ©Robert Hardman 2025. To order a copy for £11.69 (offer valid until September 6, 2025; UK P&P free on orders over £25) go to mailshop.co.uk/books or call 020 3176 2937. \n\nDid Nigel persuade Trump to stop Canada jibes ahead of King’s visit? \n\n‘Nigel Farage was very concerned. He wanted Trump to realise that he could not be pro-royal, pro-British, pro-State Visit and still talk like that about Canada,’ said a senior Farage aide\n\nThe King’s mission to Canada was a tricky one. He was, on the one hand, expected to issue a forceful assertion of Canadian sovereignty in the face of that increasingly combative rhetoric from Donald Trump about Canada being a ‘51st state’. The visit, though, ran counter to the policy of his British prime minister, Sir Keir Starmer, which was to avoid antagonising Mr Trump in the hope of securing a better trade deal for the UK.\n\nBoth prime ministers were acting in their respective national interests. But where would that leave the King? Here was a prime example of a serious if often overlooked challenge for modern monarchs: the doctrine of ‘the divisibility of the Crown’. In short, what happens when the same monarch sits on the throne of multiple nations, which then don’t agree on a serious issue?\n\nIn the event, the King made his speech. And, thereafter, it was noticeable that Donald Trump had dropped the ‘51st state’ narrative. There were no references to ‘Governor Carney’. Had the joke worn out? Had he been listening to advice? It later transpired that, ahead of the King’s visit to Canada, Trump’s closest political ally in Britain, Nigel Farage, leader of the Reform Party, had sought a meeting with Trump’s team, including his special envoy to the UK, Hollywood producer Mark Burnett. ‘Nigel Farage was very concerned. He wanted Trump to realise that he could not be pro-royal, pro-British, pro-State Visit and still talk like that about Canada,’ said a senior Farage aide. ‘It was one or the other. Let’s just say that Nigel received confirmation that the message had been transmitted.’\n\nTrump listens as Nigel Farage speaks during a Make America Great Again rally at Phoenix Goodyear Airport in October 2020\n\nA similar ‘divisibility of the Crown’ problem had surfaced in the previous reign during the late Queen’s tour of Canada in 1964. Anti-royal protests and the threat of violence in French-speaking Quebec had led the British prime minister, Sir Alec Douglas-Home, to consider giving the Queen formal advice to return to Britain. Since her Canadian government had invited her as Queen of Canada, she would then face an excruciating question: who answered to whom? If she returned, she was telling Canada that it was subservient to the UK. If she stayed, she was breaking her word as constitutional monarch of the UK. Britain eventually backed down, after a fudged decision to ‘monitor’ the situation.\n\nWhatever the transatlantic complexities in 2025, the King and Queen could, at least, draw one reassurance from all this: no one was questioning the relevance of the monarchy any more.\n\nShare or comment on this article:\nWhat the Queen REALLY thought of Trump: Critics said he was rude to her - but the truth is much more unexpected… In a new edition of his peerless biography of the King, ROBERT HARDMAN reveals astonishing new details about the royals\n\nAdd comment","summary":"If 2024 had been the year of health setbacks, then 2025 was the year when the monarchy was suddenly a trophy soft power asset.","url":"https://www.dailymail.co.uk/news/royals/article-15027741/What-Queen-REALLY-thought-Trump-Critics-said-rude-truth-unexpected-new-edition-peerless-biography-King-ROBERT-HARDMAN-reveals-astonishing-new-details-royals.html","image":"https://i.dailymail.co.uk/1s/2025/08/23/16/101487999-0-image-a-6_1755961876473.jpg","video":null,"publish_date":"2025-08-23 22:58:31","author":"Editor,Robert Hardman","authors":["Editor","Robert Hardman"],"language":"en","source_country":"gb","sentiment":-0.004},{"id":353682818,"title":"Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release","text":"A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers.\n\nKilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US.\n\nHe was released from federal detention on Friday after being held since March, when he was arrested and then deported back to his home country by Immigration and Customs Enforcement (ICE) officials.\n\nIn a new filing to the Tennessee court on Saturday, Mr Garcia's defence lawyers said that immigration officials threatened the 29-year-old with deportation to Uganda earlier in the week.\n\nAccording to the filing, while he was held in Putnam County Jail on Thursday, Mr Garcia declined an offer to be deported to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison.\n\nAfter he left jail on Friday, ICE notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday.\n\nThat same day, the Trump administration \"informed Mr Abrego that he has until first thing Monday morning - precisely when he must report to ICE's Baltimore Field Office - to accept a plea in exchange for deportation to Costa Rica, or else that offer will be off the table forever\".\n\nFiled along with the brief was a letter from the Costa Rican government stating that Mr Garcia would be welcomed to that country as a legal immigrant and wouldn't face the possibility of detention.\n\nJustice Department spokesperson Chad Gilmartin responded in a statement and said: \"A federal grand jury has charged Abrego Garcia with serious federal crimes... underscoring the clear danger this defendant presents to the community.\n\n\"This defendant can plead guilty and accept responsibility or stand trial before a jury. Either way, we will hold Abrego Garcia accountable and protect the American people.\"\n\nSimon Sandoval-Moshenberg, one of Mr Garcia's attorneys, said he would \"fight tooth and nail against any form of deportation to Uganda\" or nearby countries in Africa.\n\n\"It is preposterous that they would send him to Africa, to a country where he doesn't even speak the language, a country with documented human rights violations, when there are so many other options,\" he said. \"This family has suffered enough.\"\n\nHowever, Mr Sandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favourable for his client, saying: \"That's a pretty reasonable option, right? I mean, Costa Rica makes sense.\n\n\"It's a Spanish-speaking country. It's proximate to the United States. His family can visit him there easily.\"\n\nMr Garcia, who lived in Maryland with his American wife and son, was deported to El Salvador under a controversial 18th-century law. He was then imprisoned in its notorious maximum security Terrorism Confinement Center (CECOT).\n\nThis was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country.\n\nDemocrat senator Chris Van Hollen, who met Mr Garcia in CECOT, said the 29-year-old was \"traumatised\" by the experience.\n\nRead more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend\n\nThe Trump administration admitted that deporting Mr Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador.\n\nAfter eventually returning him to the US in June, the Trump administration detained Mr Garcia on criminal charges that were filed in May.\n\nThe criminal indictment alleges Mr Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country.\n\nHomeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Mr Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs.\n\nMr Garcia's lawyers strongly deny the claims.","url":"https://uk.news.yahoo.com/kilmar-abrego-garcia-man-wrongly-225800046.html","image":"https://s.yimg.com/ny/api/res/1.2/ujotIq3.kTWz4mo.q.c0fQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NjA7Y2Y9d2VicA--/https://media.zenfs.com/en/sky.com/6855049a9a15ab163b3b8ff72751a071","video":null,"publish_date":"2025-08-23 22:58:00","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.215},{"id":353674230,"title":"Pentagon has restricted Ukraine from striking Russian territory – WSJ","text":"The Pentagon has blocked Ukraine from striking deep inside Russia with American-supplied missiles, the Wall Street Journal reported Saturday, citing US officials.\n\nAccording to the paper, the Department of Defense has been preventing Kiev from firing long-range ATACMS missiles since late spring. On at least one occasion, Washington reportedly turned down a Ukrainian request to hit a target on Russia’s internationally recognized territory.\n\nThe WSJ linked the policy shift to President Donald Trump’s effort to “entice” Moscow during peace talks.\n\nDETAILS TO FOLLOW","summary":"The US has reportedly prevented Ukraine from using American long-range missiles deep inside Russia \nRead Full Article at RT.com","url":"https://www.rt.com/news/623459-us-blocks-ukraine-atacms/","image":"https://mf.b37mrtl.ru/files/static.en/article/dev_story.jpg","video":null,"publish_date":"2025-08-23 22:53:00","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.099},{"id":353673822,"title":"Global Postal Networks Suspend Package Delivery to the United States","text":"Postal services across the world announced they are halting shipments to the United States amid President Donald Trump’s tariffs.\n\nLast month, the president revealed plans to broaden the United States’ initiative to address the ‘de minimis’ loophole. This loophole had allowed packages valued under $800 to bypass import duties. The expansion of this effort to worldwide parcels is set to commence on August 29.\n\nHowever, international postal services have expressed that they have not received any directive from the United States regarding the new requirement to charge import duties on all incoming parcels. Consequently, many have decided to halt shipments to the US until the matter is clarified.\n\nAccording to LaPoste, France’s postal service, ‘European postal services are pressed with an extraordinarily short timeframe for adaptation, especially given the ongoing need for further clarifications on these procedures,’ as mentioned in their statement to the Financial Times.\n\nIt will now stop shipping most merchandise to the US on Monday, as will postal services in Austria and Singapore.\n\nSimilarly, the UK’s Royal Mail announced it would stop package deliveries to the US on Tuesday to ensure items reach their destination before the duties are imposed. They noted that parcels originating from the UK exceeding $100 in value, including gifts for family and friends, will now face a 10 percent duty fee.\n\nThe postal services of Germany, Denmark, Sweden, Italy, and South Korea have also declared an immediate suspension of shipments to the US.\n\nAdditionally, Postnord, a Nordic logistics firm, and Italy’s postal service declared similar suspensions starting Saturday. Australia Post has also temporarily halted ‘transit post routed from other countries through to the US,’ although this only impacts a ‘limited number’ of shipments.\n\nDHL, the largest shipping provider in Europe, also announced this week that starting Saturday it ‘will no longer be able to accept and transport parcels and postal items containing goods from business customers destined for the US’.\n\n‘Key questions remain unresolved, particularly regarding how and by whom customs duties will be collected in the future, what additional data will be required, and how the data transmission to the U.S. Customs and Border Protection will be carried out,’ the company said.\n\nTrump and European leaders had agreed in a trade framework last month to a 15 percent tariff on the vast majority of products shipped from the EU, and without the de minimis rule, packages valued at under $800 will now be subject to the tariff.\n\nYet La Poste said the US did not provide full details or allow enough time for the French postal service to prepare for the new customs procedures.\n\n´Despite discussions with U.S. customs services, no time was provided to postal operators to re-organize and assure the necessary computer updates to conform to the new rules,´ it said in a statement.\n\nPostNL spokesperson Wout Witteveen also claimed the Trump administration is pressing ahead with the new duties despite US authorities lacking a system to collect them. He said that the Netherlands’ postal service is now working closely with its American counterparts to find a solution.\n\n‘If you have something to send to America, you should do it today,’ he said. \n\nAnd in India, communications officials said Trump’s executive order closing the de minimis loophole requires transport carriers or other ‘qualified parties’ approvved by the US to collect and remit the tariff duties.\n\nBut ‘several critical processes relating to the designation of “qualified parties” and mechanisms for duty collection and remittance remain undefined. \n\n‘Consequently, US-bound air carriers have expressed their inability to accept postal consignments after 25th August, 2025, citing lack of operational and technical readiness,’ India’s communications ministry said.\n\nBjörn Bergman, head of PostNord´s Group Brand and Communication, added that the pause on shipments to the US from Nordic countries was ‘unfortunate but necessary to ensure full compliance of the newly implemented rules.’\n\nIf clarification on the new rules does not come by August 29, PostEurop – an association representing 51 European public postal operators – warned that more members will likely follow suit with their own suspensions.\n\nThe move comes as experts say Americans will soon see increased prices on common goods.\n\nKyle Peacock, founder of Peacock Tariff Consulting, told Daily Mail that Americans should expect to add an extra $40 a week to their grocery bill within the next three to six months due to tariffs. \n\n‘We have started to see certain products suffer,’ he said. ‘Coffee prices have already jumped, so have vegetables.’ \n\nHe said consumers will start to feel the blows come October as companies can no longer keep taking on the weight of tariffs themselves. \n\nArie Brish, a St. Edward’s University business professor, agreed, saying the lag is due to taking ‘time to propagate in the ecosystem’.\n\n‘Some supply and distribution chains prepared themselves and stocked up before tariffs took effect,’ Brish told Daily Mail.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPostal services across the world announced they are halting shipments to the&#8230;\n\n\nThis Post: Global Postal Networks Suspend Package Delivery to the United States first appeared on Internewscast Journal","url":"https://internewscast.com/news/global-postal-networks-suspend-package-delivery-to-the-united-states/","image":"https://internewscast.com/wp-content/uploads/2025/08/Postal-services-across-the-world-STOP-shipment-of-packages-to.jpg","video":null,"publish_date":"2025-08-23 22:51:43","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.044},{"id":353675774,"title":"It’s been a confusing week – and Trump’s been made to look weak | US News","text":"It’s been a confusing week.\n\nThe Monday gathering of European leaders and Ukraine’s president with Donald Trump at the White House was highly significant.\n\nThe leaders went home buoyed by the knowledge that they’d finally convinced the American president not to abandon Europe. He had committed to provide American “security guarantees” to Ukraine.\n\nThe details were sketchy, and sketched out only a little more through the week (we got some noise about American air cover), but regardless, the presidential commitment represented a clear shift from months of isolationist rhetoric on Ukraine – “it’s Europe’s problem” and all the rest of it.\n\nYet it was always the case that, beyond that clear achievement for the Europeans, Russia would have a problem with it.\n\nTrump’s envoy’s language last weekend – claiming that Putin had agreed to Europe providing “Article 5-like” guarantees for Ukraine, essentially providing it with a NATO-like collective security blanket – was baffling.\n\nRussia gives two fingers to the president\n\nAnd throughout this week, Russia’s foreign minister Sergei Lavrov has repeatedly and predictably undermined the whole thing, pointing out that Russia would never accept any peace plan that involved any European or NATO troops in Ukraine.\n\n“The presence of foreign troops in Ukraine is completely unacceptable for Russia,” he said yesterday, echoing similar statements stretching back years.\n\nRemember that NATO’s “eastern encroachment” was the justification for Russia’s “special military operation” – the invasion of Ukraine – in the first place. All this makes Trump look rather weak.\n\nIt’s two fingers to the president, though interestingly, the Russian language has been carefully calibrated not to poke Trump but to mock European leaders instead. That’s telling.\n\nRead more on Ukraine:Trump risks ‘very big mistake’NATO-like promise for Ukraine may be too good to be trueEurope tried to starve Putin’s war machine – it didn’t go as planned\n\nThe bilateral meeting (between Putin and Zelenskyy) hailed by Trump on Monday as agreed and close – “within two weeks” – looks decidedly doubtful.\n\nMaybe that’s why he went along with Putin’s suggestion that there be a bilateral, not including Trump, first.\n\nIt’s easier for the American president to blame someone else if it’s not his meeting, and it doesn’t happen.\n\nNATO defence chiefs met on Wednesday to discuss the details of how the security guarantees – the ones Russia won’t accept – will work.\n\nEuropean sources at the meeting have told me it was all a great success. And to the comments by Lavrov, a source said: “It’s not up to Lavrov to decide on security guarantees. Not up to the one doing the threatening to decide how to deter that threat!”\n\nThe argument goes that it’s not realistic for Russia to say from which countries Ukraine can and cannot host troops.\n\nWould Trump threaten force?\n\nThe problem is that if Europe and the White House want Russia to sign up to some sort of peace deal, then it would require agreement from all sides on the security arrangements.\n\nThe other way to get Russia to heel would be with an overwhelming threat of force. Something from Trump, like: “Vladimir – look what I did to Iran…”. But, of course, Iran isn’t a nuclear power.\n\nSomething else bothers me about all this. The core concept of a “security guarantee” is an ironclad obligation to defend Ukraine into the future.\n\nFuture guarantees would require treaties, not just a loose promise. I don’t see Trump’s America truly signing up to anything that obliges them to do anything.\n\nA layered security guarantee which builds over time is an option, but from a Kremlin perspective, would probably only end up being a repeat of history and allow them another “justification” to push back.\n\nRead more from Sky News:Inside the ISIS resurgence10 years since one of UK’s worst air disastersHow Republicans are redrawing maps to stay in power\n\nImage and reality don’t seem to match\n\nAmong Trump’s stream of social media posts this week was an image of him waving his finger at Putin in Alaska. It was one of the few non-effusive images from the summit.\n\nHe posted it next to an image of former president Richard Nixon confronting Soviet leader Nikita Khrushchev – an image that came to reflect American dominance over the Soviet Union.\n\nThat may be the image Trump wants to portray. But the events of the past week suggest image and reality just don’t match.\n\nThe past 24 hours in Ukraine have been among the most violent to date.","summary":"It&#8217;s been a confusing week. The Monday gathering of European leaders and Ukraine&#8217;s president with Donald Trump at the White House was highly significant. Ukraine latest: Trump changes tack The leaders went home buoyed by the knowledge that they&#8217;d finally convinced the American president not to abandon Europe. He had committed to provide American &#8220;security [&#8230;]\n\n\nThe post It&#8217;s been a confusing week &#8211; and Trump&#8217;s been made to look weak | US News appeared first on Ghana Latest News.","url":"https://ghananewss.com/its-been-a-confusing-week-and-trumps-been-made-to-look-weak-us-news/","image":"https://e3.365dm.com/25/08/768x432/skynews-white-house-trump-talks_6994821.jpg?20250818211709","video":null,"publish_date":"2025-08-23 22:31:36","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.475},{"id":353686928,"title":"President Donald Trump and 11 year old daughter Ivanka pose at the Harley-Davidson Café opening","text":"Here is a much higher-quality version of this image. Here is the source of this image. Per there:\n\n Donald Trump and Ivanka Trump during Grand Opening of The Harley Davidson Cafe at Harley Davidson Cafe in New York City, New York, United States. (Photo by Ron Galella, Ltd./Ron Galella Collection via Getty Images)\n\n Here are other pictures of this event.","url":"https://www.reddit.com/r/pics/comments/1myf0p5/president_donald_trump_and_11_year_old_daughter/","image":"https://preview.redd.it/president-donald-trump-and-11-year-old-daughter-ivanka-pose-v0-l6m4a6c7iukf1.jpeg?auto=webp&s=04f9acb71be90ba4c79b5a82ab2c343d494ee260","video":null,"publish_date":"2025-08-23 22:28:30","author":"80000gvwr,u/80000gvwr","authors":["80000gvwr","u/80000gvwr"],"language":"en","category":"politics","source_country":"US","sentiment":0.387},{"id":353689056,"title":"Pentagon restricts Ukraine's use of US missiles against Russia, WSJ reports - Reuters","text":"WASHINGTON, Aug 23 (Reuters) - The Pentagon has been quietly blocking Ukraine from using U.S.-made long-range Army Tactical Missile Systems (ATACMS) to strike targets inside Russia, limiting Kyiv's ability to employ these weapons in its defense against Moscow's invasion, the Wall Street Journal reported on Saturday, citing U.S. officials.\n\nReuters could not immediately verify the report.\n\nThe news came as U.S. President Donald Trump has grown more frustrated publicly over the three-year-old war and his inability to secure a peace deal between Russia and Ukraine.\n\nAdvertisement · Scroll to continue\n\nAfter his summit with Russian President Vladimir Putin and a subsequent meeting with European leaders and Ukrainian President Volodymyr Zelenskiy failed to produce observable progress, Trump said on Friday that he was again considering slapping Russia with economic sanctions or, alternatively, walking away from the peace process.\n\n\"I'm going to make a decision as to what we do and it's going to be, it's going to be a very important decision, and that's whether or not it's massive sanctions or massive tariffs or both, or we do nothing and say it's your fight,\" Trump said.\n\nTrump had hoped to arrange a bilateral meeting between Putin and Zelenskiy, but that has also proven difficult. Russian Foreign Minister Sergei Lavrov told NBC on Friday that there was no agenda in place for a sitdown with Zelenskiy.\n\nAdvertisement · Scroll to continue\n\n\"Putin is ready to meet with Zelenskiy when the agenda would be ready for a summit. And this agenda is not ready at all,\" Lavrov told NBC, saying no meeting was planned for now.\n\nAs the White House sought to persuade Putin to join peace talks, an approval process put in place at the Pentagon has kept Ukraine from launching strikes deep into Russian territory, the Journal reported.\n\nDefense Secretary Pete Hegseth has final say over use of the long-range weapons, the Journal said.\n\nNeither Ukraine's presidential office nor the defence ministry immediately responded to Reuters' request for a comment outside business hours. The White House and the Pentagon also did not immediately respond to requests for comment.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV605362 \nAbout ConnatixV605362 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Bipasha Dey in Bengaluru and Lidia Kelly in Melbourne; Writing by James Oliphant; Editing by Don Durfee and Diane Craft\n\nPurchase Licensing Rights","summary":"Pentagon restricts Ukraine's use of US missiles against Russia, WSJ reports  Reuters","url":"https://www.reuters.com/world/europe/pentagon-restricts-ukraines-use-us-missiles-against-russia-wsj-reports-2025-08-23/","image":"https://www.reuters.com/resizer/v2/NBZCBZC2U5N4RIVUUENPSVEHAE.jpg?auth=667036d8f085a1ca35f27693f23406cfb36598c48b069087da289d98700724b2&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-08-23 22:23:46","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.104},{"id":353673820,"title":"NATO Deploys Warplanes in Response to Russian Strikes Close to Romanian Border in Ukraine","text":"Two German warplanes were scrambled overnight from Romania after Russia launched a large-scale missile and drone attack in Ukraine less than a mile from the NATO borderline.\n\nRomania’s Ministry of Defense said on Wednesday that two German Eurofighter Typhoon aircraft, stationed at Romania’s Mihail Kogălniceanu Air Base as part of NATO’s Enhanced Air Policing mission, were deployed “to monitor the air situation,” but noted that this time no Russian aircraft or projectiles crossed the NATO border.\n\nDespite last week’s talks between Russian President Vladimir Putin and President Donald Trump, Moscow has continued its aerial bombardment of Ukraine, including in an overnight attack that targeted oil and port facilities in the Odesa region on and near the Danube River, which separates the Ukrainian border with the allied NATO nation of Romania. \n\n“The rescue operation continues,” Zelenskyy added, though he did not confirm how many others were injured in the strikes.\n\n“All of these are demonstrative strikes that only confirm the need to put pressure on Moscow, the need to impose new sanctions and tariffs until diplomacy is fully effective,” Zelenskyy said on X. “I thank all partners who are helping to stop this Russian war. Together with the United States, Europe, and all those who seek peace.\n\n“We need strong security guarantees to ensure a truly reliable and lasting peace,” he added. \n\nThe strikes come as NATO nations prepare to meet virtually on Wednesday to discuss security guarantees for Ukraine following high-level talks first between Trump and Putin on Friday, and then Trump, Zelenskyy and top NATO leaders at the White House on Monday.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTwo German warplanes were scrambled overnight from Romania after Russia launched a&#8230;\n\n\nThis Post: NATO Deploys Warplanes in Response to Russian Strikes Close to Romanian Border in Ukraine first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/nato-deploys-warplanes-in-response-to-russian-strikes-close-to-romanian-border-in-ukraine/","image":"https://internewscast.com/wp-content/uploads/2025/08/NATO-scrambles-warplanes-as-Russia-hits-near-Romanian-border-in.jpg","video":null,"publish_date":"2025-08-23 22:19:33","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.311},{"id":353669004,"title":"Russia claims forces took control of two settlements in Ukraine's Donetsk","text":"Moscow [Russia], August 24 (ANI): Russia on Saturday claimed that its forces captured two settlements in Ukraine’s Donetsk region over the past 24 hours, Anadolu News Agency reported.In a statement, the Russian Defence Ministry said that the villages of Seredne and Kleban Byk came under Russian control following operations conducted by the Southern and Western groups of forces.The ministry also claimed that Russian forces struck a Ukrainian military-industrial complex and temporary deployment points of Ukrainian armed formations and foreign fighters across 143 locations.Additionally, Russian air defence successfully countered Ukrainian air attacks and shot down four guided aerial bombs and 160 drones over the past week, Anadolu News Agency reported, citing the statement from the Defence Ministry.This comes amid the peace talks between both nations, brokered by the US, to put an end to the war.Earlier, Ukrainian President Volodymyr Zelenskyy spoke with South African President Cyril Ramaphosa and told him that he is ready to hold talks with Russian President Vladimir Putin.In a post on X, he said, “I spoke with President of the Republic of South Africa, Cyril Ramaphosa, at his request. I informed about the joint diplomatic efforts with our partners and the productive meetings with President Trump in Washington.”“I reaffirmed my readiness for any format of meeting with the head of Russia. However, we see that Moscow is once again trying to drag everything out even further. It is important that the Global South sends relevant signals and pushes Russia toward peace,” he added.Meanwhile, United States President Donald Trump renewed a threat on Friday to impose sanctions on Russia if there is no progress towards a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his warm meeting with Russian President Vladimir Putin in Alaska. Russian Foreign Minister Sergey Lavrov said there is no agenda for a potential summit between Putin and his Ukrainian counterpart, President Volodymyr Zelenskyy, whom he accused of saying “no to everything”, as per Al Jazeera. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/russia-claims-forces-took-control-of-two-settlements-in-ukraines-donetsk-9524359.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-08-23 22:15:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.096},{"id":353670544,"title":"Marjorie Taylor Greene issues passionate plea in support of Gaza, setting off MAGA — including Laura Loomer","text":"Georgia Republican Rep. Marjorie Taylor Greene has issued a passionate appeal urging Americans to support Gaza, enraging her usual MAGA allies.\n\nThe far-right congresswoman has repeatedly denounced Israel’s ongoing war in Gaza in the wake of Hamas attacks on October 7, 2023. Last month, she labeled the war a “genocide,” breaking with her Republican colleagues in Congress.\n\nThe Republican Congresswoman wrote a lengthy post on X on Saturday asking how Americans would feel if the United States was “bombed day and night because of something horrific our government did,” killing and injuring adults and children, while the rest of the world didn’t come to its aid. \n\n“This is what is happening to Gaza where in spite of what we have all been told, many innocent people and children are being killed and they are not Hamas,” Greene wrote Saturday morning. \n\n“Does Hamas deserve it? Yes. Do innocent people and children deserve it? No,” she continued. “The innocent people in Gaza did not kill and kidnap the innocent people in Israel on Oct 7th.”\n\n“Just as we spoke out and had compassion for the victims and families of [October 7], how can Americans not speak out and have compassion for the masses of innocent people and children in Gaza?” the GOP firebrand wrote. “Is one type of innocent life worthy and another type of innocent life worth nothing?”\n\nThe United States has sent nearly $18 billion in military assistance to Israel since October 7. More than 60,000 Palestinians have been killed since the start of the war, Gaza’s Health Ministry reported last month.\n\n“I don’t know about you, but I don’t want to pay for genocide in a foreign country against a foreign people for a foreign war that I had nothing to do with,” Greene concluded. “And I will not be silent about it.”\n\nJust 15 minutes after Greene posted her post on X, far-right activist Laura Loomer commented: “Why are you advocating for GAZANS to come to the US? How is Islamic immigration ‘America First’?”\n\nLast week, Loomer celebrated the State Department’s decision to halt visitor visas for people from Gaza — including temporary visas for privately funded medical care — after she posted a series of videos of flights carrying people from Gaza to the United States and demanded that whoever approved their visas be fired. \n\nThe videos, showing children arriving in the country for medical treatment, were posted from HEAL Palestine, a nonprofit that delivers urgent and long-term support to Palestinian children and families. Visitor visas are nonimmigrant visas that allow people to enter the country temporarily, including for medical treatment, according to the State Department.\n\nOther X users seemed to agree with Loomer.\n\n“You have lost my support,” one person responded to Greene. Another called her “an idiot.”\n\nMore than half a million people in Gaza are trapped by famine, according to a recent analysis from the Integrated Food Security Phase Classification, a group of international organizations on which the United Nations and aid agencies rely to monitor global hunger crises.\n\nLast month, Greene slammed Florida Republican Rep. Randy Fine, who is Jewish and one of the most outspoken supporters of Israel in Congress, after he repeatedly suggested that Palestinians in Gaza should be starved. He has previously suggested Gaza should be \"nuked” and “must be destroyed” while labelling a fellow member of Congress a “Muslim terrorist.”\n\n“Release the hostages. Until then, starve away,” he wrote.\n\nOf the starvation in Gaza, Fine said: “This is all a lie anyway.”\n\n“I can only imagine how Florida’s 6th district feels now that their Representative, that they were told to vote for, openly calls for starving innocent people and children,” Greene posted in response. \n\n“It’s the most truthful and easiest thing to say that Oct 7th in Israel was horrific and all hostages must be returned, but so is the genocide, humanitarian crisis, and starvation happening in Gaza,” she added. “But a Jewish U.S. Representative calling for the continued starvation of innocent people and children is disgraceful.”\n\nLoomer again responded to Greene, writing: “There is no genocide in Gaza.”\n\nHer words echo those of Israeli Prime Minister Benjamin Netanyahu, who last month claimed that “there is no policy of starvation in Gaza” and “there is no starvation in Gaza.”\n\nThe next day, President Donald Trump pushed back, stating that the region is suffering from “real starvation” and “you can’t fake that.”\n\nGreene has repeatedly broken with her party in recent weeks, including her opposition to Trump’s recent artificial intelligence executive order and her call for the Trump administration to release the so-called Epstein files.\n\n“I don't know if the Republican Party is leaving me, or if I'm kind of not relating to the Republican Party as much anymore,” Greene told the Daily Mail earlier this month. “I don't know which one it is.”","summary":"Far-right congresswoman breaks from GOP to label Israel’s war a ‘genocide’ and urges American support for ‘masses of innocent people and children’","url":"https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-gaza-israel-loomer-b2813129.html","image":"https://static.independent.co.uk/2025/08/07/12/16/Georgia-GOP-Rep--Marjorie-Taylor-Greene-blasts-Fox-News-for-its-older-audience.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/cc8idOHE-4VHSaSK0.mp4","publish_date":"2025-08-23 22:13:15","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.322},{"id":353677300,"title":"Russia claims more Ukrainian land as hopes for summit fade","text":"Russian forces are slowly advancing in the embattled eastern region of Donetsk. (AP pic)\nKYIV: Russia on Saturday said its forces had taken two villages in eastern Ukraine's Donetsk region, increasing the military pressure as world leaders struggle to broker an end to the conflict.\nSouth Africa added its voice to those calling for a summit between Ukraine and Russia.\nRussian forces are slowly advancing in the embattled eastern region of Donetsk, grinding closer to Kyiv's key defensive line in costly metre-for-metre battles.\nMoscow's defence ministry said on Telegram that its forces had captured the villages of Sredneye and Kleban-Byk.\nThe taking of Kleban-Byk would mark a further advance towards Kostiantynivka – a key fortified town on the road to Kramatorsk, where a major Ukrainian logistics base is located.\nOn Friday, Russia said its troops had captured three villages in the Donetsk region it claimed to have annexed in September 2022.\nOn Saturday, Ukrainian military officials said its forces had stopped a Russian advance and recaptured the village of Zeleny Gai in the Donetsk region in a post to Telegram.\nIn July, Russia claimed the capture of the village, on the border with Dnipropetrovsk, adding that it was an important stronghold used by Ukraine to protect the area.\nRamaphosa backs summit\nThe latest Russian advances come as hopes dim for a summit between Russian and Ukrainian presidents – a solution championed by US President Donald Trump as part of his efforts to end the conflict.\nSouth African President Cyril Ramaphosa on Saturday added his voice to calls for a Russia-Ukraine summit during a telephone conversation with Ukrainian President Volodymyr Zelensky.\n\"President Ramaphosa stressed the urgency of holding bilateral and trilateral meetings between the leaders of Russia and Ukraine and the United States as key to signal a firm commitment to ending the war,\" said a statement from his office.\nRamaphosa, who currently chairs the G20, also spoke with French President Emmanuel Macron and Finnish President Alexander Stubb, the statement added. He will speak with other European leaders in the coming weeks.\nRamaphosa spoke on Monday with Vladimir Putin, whom he described in October at the BRICS summit as a \"dear ally\" and a \"valued friend\".\nHowever, for the first time since Russia's attack on Ukraine, South Africa earlier this year backed a UN resolution declaring that Russia had launched a full-scale invasion of Ukraine.\nZelensky said he had told Ramaphosa he was ready for any kind of meeting with Putin.\n\"However, we see that Moscow is once again trying to drag everything out even further,\" he said on X.\nHe called on the Global South to send \"relevant signals and (push) Russia toward peace\".\nOn Friday, Russian foreign minister Sergei Lavrov said \"no meeting\" was planned as Trump's mediation efforts appeared to stall, while Zelensky accused Russia of trying to prolong the offensive.","summary":"Moscow has increased military pressure as world leaders struggle to broker an end to the conflict.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/08/24/russia-claims-more-ukrainian-land-as-hopes-for-summit-fade","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/08/41320f5a-donetsk-russia-war-22082025.webp","video":null,"publish_date":"2025-08-23 22:07:33","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.106},{"id":353673870,"title":"If You'd Invested $1,000 In Dogecoin 5 Years Ago, Here's How Much You'd Have Today","text":"Dogecoin (DOGE -1.63%), the original meme token was first created in 2013, making it one of the oldest cryptocurrencies. Despite significant volatility and little real-world utility of Dogecoin's blockchain network, the cryptocurrency continues to be one of the 10 largest in the world by market cap at roughly $31.6 billion.\n\nDogecoin was launched as a joke and has always thrived due to its virality, largely as investors on social media and even celebrities embraced the token. As the crypto sector has gotten a lift from President Donald Trump's pro-crypto administration, Dogecoin has benefited and is up about 100% over the past year, continuing what's been a strong overall run.\n\nIf you'd invested $1,000 in Dogecoin five years ago, here's how much you'd have today.\n\nInvestors have crushed it\n\nDue to Dogecoin's scale and how well known it is worldwide, the token has typically moved in line with the crypto sector but at a higher beta compared to the world's largest cryptocurrency, Bitcoin. This means that Dogecoin has performed better when Bitcoin and most of the crypto sector has risen, but worse so when Bitcoin and the sector has declined.\n\nThat said, the huge volatility has clearly benefited Dogecoin investors over the longer five-year period.\n\nDogecoin Price data by YCharts.\n\nAs you can see above, $1,000 invested in Dogecoin is now worth over $60,000, meaning the return is over an astonishing 6,000%. The broader benchmark S&P 500 index is up 87% over the past five years, and much of this time has been characterized by a bull market.\n\nDoes this mean you should buy Dogecoin?\n\nI still think the token is extremely risky because it has a substantial market cap, while its network does not yet have strong real-world utility. Dogecoin's large supply also does not make it a good store of value. Those who have gambled on the token over the past five years have been well rewarded, but I still wouldn't invest anything more than you can afford to lose.","summary":"Dogecoin is the original meme token and still very popular today.","url":"https://www.fool.com/investing/2025/08/23/if-youd-invested-1000-in-dogecoin-5-years-ago-here/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F830185%2Fshiba-inu-dog-doge-dogecoin.jpeg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-08-23 22:03:00","author":"Bram Berkowitz","authors":["Bram Berkowitz"],"language":"en","source_country":"us","sentiment":-0.337},{"id":353668540,"title":"Trade negotiations still going on as fresh tariffs loom","text":"MUMBAI: India’s foreign minister said on Saturday that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional US tariffs are due to hit. \n\nIndian goods face additional US tariffs of up to 50 percent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 percent tariff has already come into effect, while the remaining 25 percent is set to be enforced from August 27. \n\nA planned visit by US trade negotiators to New Delhi from August 25-29 has been called off, dashing hopes that the levies may be lowered or postponed. “We have some redlines in the negotiations, to be maintained and defended,” Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country’s farmers and small producers. \n\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world’s largest and fifth largest economy is worth over $190 billion. “It is our right to make decisions in our ‘national interest’,” Jaishankar said. \n\nAnalysts at Capital Economics said on Friday that if the full US tariffs come into force and stick, the hit to India’s economic growth would be 0.8 percentage points both this year and next. \n\n“The longer-term harm could be even greater as a high tariff could puncture India’s appeal as a global manufacturing hub.” \n\nThe Indian minister described US President Donald Trump’s policy announcements as “unusual”. \n\n“We have not had a US president who conducts his foreign policy so publicly as the current one and (it) is a departure from the traditional way of conducting business with the world,” Jaishankar said.","summary":"MUMBAI: India’s foreign minister said on Saturday that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional US tariffs are due to hit. \n\n\n\nIndian goods face additional US tariffs of up to 50 percent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 percent tariff has already come into effect, while the remaining 25 percent is set to be enforced from August 27. \n\n\n\nA planned visit by US trade negotiators to New Delhi from August 25-29 has been called off, dashing hopes that the levies may be lowered or postponed. “We have some redlines in the negotiations, to be maintained and defended,” Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country’s farmers and small producers. \n\n\n\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bi","url":"https://www.brecorder.com/news/40379381/trade-negotiations-still-going-on-as-fresh-tariffs-loom","image":"https://i.brecorder.com/large/2025/08/68aa20fcd99b1.jpg","video":null,"publish_date":"2025-08-23 22:01:42","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.108},{"id":353668538,"title":"US Defence Intelligence Agency chief among latest ousted officers","text":"WASHINGTON: The head of the US Defence Intelligence Agency (DIA) and two other senior officers are being removed, officials said Friday — the latest in a series of military firings this year.\n\nThe removal of Lieutenant General Jeffrey Kruse, who led the DIA since early 2024, comes after the agency produced a preliminary assessment that said US strikes on Iran set back Tehran’s nuclear program by just a few months.\n\nThe assessment — which was widely reported on by US media — contradicted claims from President Donald Trump that the strikes totally destroyed the nuclear sites, drawing the ire of both him and officials within his administration.\n\nKruse “will no longer serve as DIA director,” a senior defense official said on condition of anonymity, without providing an explanation for the general’s departure.\n\nPrior to becoming director of the DIA, Kruse served as the advisor for military affairs for the director of national intelligence, and also held positions including director of intelligence for the coalition against the Islamic State jihadist group.\n\nA US official separately said on condition of anonymity that two other senior officers — Vice Admiral Nancy Lacore, chief of Navy Reserve, and Rear Admiral Milton Sands, commander of the Naval Special Warfare Command — were also leaving their positions.\n\nIn June, the United States launched a massive operation against three Iranian nuclear sites, an effort that involved more than 125 US aircraft as well as a guided missile submarine.\n\nTrump called the strikes a “spectacular military success” and repeatedly said they “obliterated” the nuclear sites, but the DIA’s preliminary assessment raised doubts about the president’s claims.\n\nThe Trump administration responded with an offensive against the media, insisting the operation was a total success and berating journalists for reporting on the assessment.\n\nDefence Secretary Pete Hegseth insisted the assessment was “leaked because someone had an agenda to try to muddy the waters and make it look like this historic strike wasn’t successful,” and slammed “fawning coverage of a preliminary assessment.”\n\nSince beginning his second term in January, Trump has overseen a purge of top military officers, including chairman of the Joint Chiefs of Staff general Charles “CQ” Brown, whom he fired without explanation in February.\n\nOther senior officers dismissed this year include the heads of the Navy and Coast Guard, the general who headed the National Security Agency, the vice chief of staff of the Air Force, a Navy admiral assigned to NATO, and three top military lawyers.\n\nThe chief of staff of the Air Force also recently announced his retirement without explanation just two years into a four-year term. Hegseth has insisted the president is simply choosing the leaders he wants, but Democratic lawmakers have raised concerns about the potential politicization of the traditionally neutral US military.","summary":"WASHINGTON: The head of the US Defence Intelligence Agency (DIA) and two other senior officers are being removed, officials said Friday — the latest in a series of military firings this year.\n\n\n\nThe removal of Lieutenant General Jeffrey Kruse, who led the DIA since early 2024, comes after the agency produced a preliminary assessment that said US strikes on Iran set back Tehran’s nuclear program by just a few months.\n\n\n\nThe assessment — which was widely reported on by US media — contradicted claims from President Donald Trump that the strikes totally destroyed the nuclear sites, drawing the ire of both him and officials within his administration.\n\n\n\nKruse “will no longer serve as DIA director,” a senior defense official said on condition of anonymity, without providing an explanation for the general’s departure.\n\n\n\nPrior to becoming director of the DIA, Kruse served as the advisor for military affairs for the director of national intelligence, and also held positions including director of intelligence for the ","url":"https://www.brecorder.com/news/40379376/us-defence-intelligence-agency-chief-among-latest-ousted-officers","image":"https://i.brecorder.com/large/2025/08/68aa2275805bd.jpg","video":null,"publish_date":"2025-08-23 22:01:42","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.202},{"id":353668528,"title":"Trump names close political aide as ambassador to India","text":"WASHINGTON: President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\n\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\n\nGor’s enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a “snake” after he scuttled the tech and aerospace billionaire’s choice to lead NASA.\n\nGor’s influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote on his Truth Social platform.\n\n“Sergio will make an incredible Ambassador,” he wrote.\n\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia. Trump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department’s top position for South Asia still vacant.\n\nThe nomination comes after a spike in tensions with India, which the United States has prioritized as an emerging partner since the 1990s.\n\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump’s own diplomacy with counterpart Vladimir Putin.\n\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\n\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\n\nGor was born in Uzbekistan when it was still in the Soviet Union — a background on which he has been discreet — before moving as a child to Malta.\n\nAfter attending university in the United States, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump — and as an amateur wedding DJ.\n\nIn his post, Trump hailed Gor’s work as director of presidential personnel, saying that 95 percent of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\n\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an “excellent representative of America in one of the most important relationships our nation has in the world.”\n\nTrump named an ambassador to India later than for many other major countries. While presidents have often tapped political aides as ambassador — former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo — India has an illustrious history of seeing public intellectuals as ambassador. US ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\n\nBiden’s ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man.","summary":"WASHINGTON: President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\n\n\n\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\n\n\n\nGor’s enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a “snake” after he scuttled the tech and aerospace billionaire’s choice to lead NASA.\n\n\n\nGor’s influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\n\n\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote on his Truth Social platform.\n\n\n\n“Sergio will m","url":"https://www.brecorder.com/news/40379374/trump-names-close-political-aide-as-ambassador-to-india","image":"https://i.brecorder.com/large/2025/08/68aa22995922d.jpg","video":null,"publish_date":"2025-08-23 22:01:42","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.245},{"id":353668512,"title":"Trump says US to probe furniture imports, threatening tariffs","text":"WASHINGTON: US President Donald Trump on Friday threatened fresh tariffs on imported furniture, saying his administration will launch a probe on the sector.\n\n“We are doing a major Tariff Investigation on Furniture coming into the United States,” Trump wrote in a post on his Truth Social platform.\n\n“Within the next 50 days, that Investigation will be completed,” the US leader added.\n\nHe said the tariff rate for furniture has yet to be decided, but justified the plan as a means to bring the furniture industry back to states like North Carolina, South Carolina and Michigan.\n\nThe US employed over 340,000 people in the furniture and related products manufacturing sector as of July, according to government data, about half the level seen in the year 2000.\n\nChina and Vietnam are among the major sources of US furniture imports.\n\nThe United States imported $25.5 billion worth of furniture in 2024, according to trade publication Furniture Today.\n\nTrump’s move marks his latest threat targeting specific sectors, after he imposed steep duties on imports of steel, aluminum, autos and other products this year.\n\nThe Trump administration has also launched several investigations into imports of pharmaceuticals, chips, critical minerals and various categories of goods — taking into consideration their effects on national security.\n\nTypically, such probes take months to conclude, and they could eventually justify the imposition of new tariffs.\n\nWhile economies like Vietnam and China are already hit with separate waves of countrywide levies — with specific sectors coming under separate rates — some of these country-specific duties are facing legal challenges.\n\nThe sectoral tariffs imposed after investigations, however, are generally seen to be on firmer legal ground.\n\nSince returning to the presidency in January, Trump’s fresh duties on products from US trading partners have added to the business costs of importers and other firms.","summary":"WASHINGTON: US President Donald Trump on Friday threatened fresh tariffs on imported furniture, saying his administration will launch a probe on the sector.\n\n\n\n“We are doing a major Tariff Investigation on Furniture coming into the United States,” Trump wrote in a post on his Truth Social platform.\n\n\n\n“Within the next 50 days, that Investigation will be completed,” the US leader added.\n\n\n\nHe said the tariff rate for furniture has yet to be decided, but justified the plan as a means to bring the furniture industry back to states like North Carolina, South Carolina and Michigan.\n\n\n\nThe US employed over 340,000 people in the furniture and related products manufacturing sector as of July, according to government data, about half the level seen in the year 2000.\n\n\n\nChina and Vietnam are among the major sources of US furniture imports.\n\n\n\nThe United States imported $25.5 billion worth of furniture in 2024, according to trade publication Furniture Today.\n\n\n\nTrump’s move marks his latest threat targeting specific sec","url":"https://www.brecorder.com/news/40379377/trump-says-us-to-probe-furniture-imports-threatening-tariffs","image":"https://i.brecorder.com/large/2025/08/68aa220346322.jpg","video":null,"publish_date":"2025-08-23 22:01:42","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.02},{"id":353685894,"title":"Oil prices gain as Ukraine peace process stalls","text":"HOUSTON: Oil prices edged up on Friday as hopes of an imminent peace deal between Russia and Ukraine faded, putting prices on track for their first weekly gain in three weeks. Brent crude futures were up 18 cents at $67.85 a barrel by 10:31 a.m. EDT (1431 GMT). \n\nWest Texas Intermediate (WTI) crude futures gained 25 cents, or 0.39%, to $63.77. Both contracts gained more than 1% in the previous session. Brent has risen 3.04% so far this week while WTI is up 1.5%. “Everyone is waiting for President Trump’s next step,” said UBS commodity analyst Giovanni Staunovo. “Over the coming days, it seems nothing will happen,” he added. \n\nUS President Donald Trump on Friday said he will see if Russian President Vladimir Putin and Ukraine President Volodymyr Zelenskiy will work together in ending Russia’s war in Ukraine. \n\nThe three-and-a-half-year war continued unabated this week as Russia launched an air attack on Thursday near Ukraine’s border with the European Union, and Ukraine said it hit a Russian oil refinery and the Unecha oil pumping station, a critical part of Russia’s Europe-bound Druzhba oil pipeline. \n\nHungary said deliveries through the pipeline had been halted. Trump is seeking to arrange a summit between Putin and his Ukrainian counterpart Zelenskiy as part of efforts to broker a peace deal for Ukraine. \n\nRussian Foreign Minister Sergei Lavrov said there is no agenda for a potential summit between Putin and Zelenskiy, accusing Zelenskiy of saying “no to everything”. \n\nThe less likely a ceasefire looks, the more likely the risk of tougher US sanctions on Russia, ING analysts said in a client note on Friday. \n\nMeanwhile, US and European planners have presented military options to their national security advisers after the first in-person meeting between the US and Russian leaders since Russia invaded Ukraine. Estonia is ready to participate in a peacekeeping operation in Ukraine with a force of up to one battalion, the Baltic country’s Prime Minister Kristen Michal said at a press conference with his Finnish counterpart in Tallinn on Friday. Putin demanded that Ukraine give up all of the eastern Donbas region, renounce NATO ambitions and keep Western troops out of the country, sources told Reuters. Trump pledged to protect Ukraine under any war-ending deal and Zelenskiy dismissed the idea of withdrawing from internationally recognised Ukrainian land. \n\nLARGER THAN EXPECTED FALL IN US OIL STOCKS \n\nOil prices were also supported by a larger than expected drawdown from US crude stockpiles in the past week, indicating strong demand. Stocks fell by 6 million barrels in the week ended August 15, the US Energy Information Administration said on Wednesday. Analysts had expected a draw of 1.8 million barrels. \n\nWeak economic data from Germany on Friday partially offset the stocks draw, showing that Europe’s largest economy shrank by 0.3% in the second quarter, raising concerns over oil demand. \n\nInvestors were also looking to the Jackson Hole economic conference in Wyoming for signals of a Federal Reserve interest rate cut next month. \n\nUS Federal Reserve Chair Jerome Powell on Friday pointed to a possible rate cut at the central bank’s September meeting but stopped short of committing to cutting interest rates. \n\nLower interest rates can stimulate economic growth and increase oil demand, potentially boosting prices.","summary":"HOUSTON: Oil prices edged up on Friday as hopes of an imminent peace deal between Russia and Ukraine faded, putting prices on track for their first weekly gain in three weeks. Brent crude futures were up 18 cents at $67.85 a barrel by 10:31 a.m. EDT (1431 GMT). \n\n\n\nWest Texas Intermediate (WTI) crude futures gained 25 cents, or 0.39%, to $63.77. Both contracts  gained more than 1% in the previous session. Brent has risen 3.04% so far this week while WTI is up 1.5%. “Everyone is waiting for President Trump’s next step,” said UBS commodity analyst Giovanni Staunovo. “Over the coming days, it seems nothing will happen,” he added.  \n\n\n\nUS President Donald Trump on Friday said he will see if Russian President Vladimir Putin and Ukraine President Volodymyr Zelenskiy will work together in ending Russia’s war in Ukraine. \n\n\n\nThe three-and-a-half-year war continued unabated this week as Russia launched an air attack on Thursday near Ukraine’s border with the European Union, and Ukraine said it hit a Russian oil refine","url":"https://www.brecorder.com/news/40379360/oil-prices-gain-as-ukraine-peace-process-stalls","image":"https://i.brecorder.com/large/2025/08/68aa166f3ccc3.jpg","video":null,"publish_date":"2025-08-23 22:01:41","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.237},{"id":353670452,"title":"Detroiters largely stand by Biden over Trump when comparing presidencies","text":"Detroit residents spoke with Fox News Digital this month about whether President Donald Trump or former President Joe Biden provided them a better life, and the results skewed toward the latter. Not too far from Pontiac, Fox News Digital spoke with voters in the heart of downtown Detroit, the seat of deep-blue Wayne County that went heavily for Biden and Kamala Harris in 2020 and 2024. Jayla, a graphic design intern currently in college, said that her life was better under Biden, who won Michigan narrowly in 2020 en route to ousting Trump from the White House. DR. OZ TOUTS INVESTMENT IN MEDICAID: 'I'M TRYING TO SAVE THIS BEAUTIFUL PROGRAM' \"Biden, especially with being a Type 1 Diabetic. I think his medical plans have kind of served me for better, whereas on the other side, I've kind of been actually going through it as a college student,\" Jayla said. \"Of course, Trump!\" Ronald, a native of Detroit suburb Livonia, told Fox News Digital. \"Just take a look at the economy. I don't want to go into the rest because you don't want to be canceled,\" Ronald said. \"I would say Biden,\" said Joseph, a Detroit native and quality management professional. \"Although people like to bring up the fact that things are so inflated, it also is due to the nature where we are currently as a society.\" Mary, an educator, was accompanying Joseph while walking through downtown Detroit. She said that her life was better under Biden because her student loans were forgiven. \"I had like six figures of student loans. So that definitely was a big help for me financially,\" Mary said. TRUMP TO UNVEIL NEW MAHA INITIATIVES AT 'MAKE HEALTH TECH GREAT AGAIN' WHITE HOUSE EVENT Josie, a Detroit native and social worker, raised concerns about Trump's changes to Medicaid through The One Big Beautiful Bill Act he signed into law last month. \"Biden, with the cuts that are happening to Medicaid and all of that stuff, it's making my work hard. It's impacting our community negatively, and a lot of people are going to need increased resources and all that, and we're having trouble finding even anybody, any social workers to do a job because there's no money,\" Josie said. PJ, a clothing maker, said that his life was better under Biden. \"Biden by far. I'm not a fan of either of them. I have to go with Biden,\" PJ said. \"A lot of these politicians, they don't really care about us, so it's kind of like, it's the same thing under different people,\" he added. Trump improved significantly on his showing in Wayne County in 2024 from four years earlier, as he captured Michigan and won the presidency over Harris. While he still lost the county by nearly 29 points, it was a far better showing than the 38-point defeat he took there in 2020, and he was able to more than make up the ground needed in the rest of the state. CLICK HERE TO GET THE FOX NEWS APP","summary":"Detroit residents speaking with Fox News Digital largely chose President Biden over President Trump when speaking about which White House occupant they preferred.","url":"https://www.foxnews.com/media/detroiters-speak-out-biden-forgave-my-loans-but-trump-made-my-wallet-fatter","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/detroiters-on-biden-v-trump-economy.png","video":"https://www.foxnews.com/video/6377083701112","publish_date":"2025-08-23 22:00:09","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.026},{"id":353671364,"title":"New Trump design chief aims to improve thousands of US government websites","text":"WASHINGTON :U.S. President Donald Trump's new design chief said on Saturday he aims to improve government services to be as satisfying to use as the Apple App Store.\n\nTrump has named Airbnb co-founder Joe Gebbia to spearhead the new National Design Studio that will seek to make digital services at federal agencies more efficient.\n\nGebbia said on X on Saturday he aims to make government websites beautifully designed and running on modern software with a great user experience. \"An experience that projects a level of excellence for our nation, and makes life less complicated for everyday Americans,\" he said.\n\nTrump signed an executive order on Thursday to create the studio - a new body that an official familiar with the plan said appears to be a stripped-down successor to the controversial Department of Government Efficiency, formerly headed by billionaire Elon Musk.\n\nGebbia, who has led efforts to revamp the federal retirement process at the federal human resources agency, is the new chief design officer. Reuters reported this week that tackling problems at the Internal Revenue Service would be a focus, citing a government official.\n\nMany U.S. government websites were designed by lowest-cost bidders and are hard to use or have not been significantly updated for years.\n\nWhite House official David Sacks said on X that Gebbia will \"oversee the redesign of roughly 26,000 federal web portals, many of which are obsolete, so they better serve Social Security recipients, veterans, and all citizens.\"\n\nAccording to Trump's executive order, the National Design Studio will improve the “usability and aesthetics” of federal digital services.\n\nThe studio will advise agencies on how to reduce duplicative design costs and use standardized design on sites where people interact with the government.\n\nThe order also said that the studio will close in three years.","summary":"","url":"https://www.channelnewsasia.com/business/new-trump-design-chief-aims-improve-thousands-us-government-websites-5310996","image":"https://dam.mediacorp.sg/image/upload/s--g6u9_V7t--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-08-23t215935z_2_lynxmpel7m0f3_rtroptp_3_usa-trump-design.jpg?itok=L","video":null,"publish_date":"2025-08-23 21:56:18","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.069},{"id":353671440,"title":"More US intelligence officials fired allegedly because they dissented with Trump","text":"US Defence Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of American damage to Iranian nuclear sites angered President Donald Trump, according to sources quoted by AP. However, Reuters reports the reasons for the dismissal are unknown.\n\nTwo people familiar with the decision and a White House official told AP, on condition of anonymity because they were not authorised to discuss it publicly, that Lt. Gen. Jeffrey Kruse will no longer serve as head of the US Defence Intelligence Agency, AP reported.\n\nCarla Babb, a veteran Military News journalist, wrote on X that “a DIA (Defence Intelligence Agency) spokesperson tells me that Lt. Gen. Kruse is no longer the Director of the Defence Intelligence Agency. Deputy Director Christine Bordine has assumed the role of Acting Director of DIA ‘effective immediately’”. However, Reuters wrote, “it was not immediately clear why Lieutenant General Jeffrey Kruse, who led the Defence Intelligence Agency, was fired.”\n\nDangerous habit of testing loyalty\n\nHegseth‘s purge broadened. One U.S. official, speaking on the condition of anonymity, told Reuters that in addition to Kruse, Hegseth had also ordered the removal of the chief of U.S. Naval Reserves and the commander of Naval Special Warfare Command. “The firing of yet another senior national security official underscores the Trump administration’s dangerous habit of treating intelligence as a loyalty test rather than a safeguard for our country,” said U.S. Senator Mark Warner, who is the vice chair of the Senate Select Committee on Intelligence. The firing was first reported by the Washington Post.\n\nIn June, President Donald Trump had pushed back strongly on a leaked DIA report that found that attacks on Iran had only set back its nuclear programme by months. The White House declared the agency’s assessment “flat out wrong”, the BBC wrote. Trump had declared the nuclear sites in Iran “completely destroyed” and had accused the media of “an attempt to demean one of the most successful military strikes in history”.\n\nIn a statement, US Senator Mark Warner warned that Kruse’s sacking was a sign that Trump had a “dangerous habit of treating intelligence as a loyalty test rather than a safeguard for our country”. Trump has removed several officials whose analysis has been seen to be at odds with him.","summary":"US Defence Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of American damage to Iranian nuclear [&#8230;]","url":"https://euroweeklynews.com/2025/08/23/more-us-intelligence-officials-fired-allegedly-because-they-dissented-with-trump/","image":"https://cdn.euroweeklynews.com/wp-content/uploads/2025/05/Pete-Hegseth-says-the-Pentagon-knows-China-would-win-a-war-against-the-United-States-anytime-Photo-Youtube-Interview-Nov-2024.jpg","video":null,"publish_date":"2025-08-23 21:51:51","author":"Olivier Acuña Barba","authors":["Olivier Acuña Barba"],"language":"en","category":"politics","source_country":"es","sentiment":-0.276},{"id":353667344,"title":"Trump says many people in Epstein files ‘don’t deserve to be there’ amid fallout from Ghislaine Maxwell interview: Live","text":"President Donald Trump said he “couldn’t care less” that the Justice Department planned to hand over a trove of the so-called “Epstein files” to the House Oversight Committee.\n\n“Innocent people shouldn’t be hurt, but I’m in support of keeping it totally open,” Trump told reporters in the Oval Office Friday, when asked if he supported the process. “I couldn’t care less.”\n\nThe House Oversight Committee issued a subpoena earlier this month demanding all documents related to the criminal cases against Jeffrey Epstein and Ghislaine Maxwell. The committee received a batch of files Friday, but Democrats have stated that 97 percent of those documents are already publicly available.\n\nTrump then labeled the matter a “Democrat hoax.” He previously said former Presidents Barack Obama and Joe Biden cooked it up. \n\n“You’ve got a lot of people that could be mentioned in those files that don’t deserve to be, you know, people, because he knew everybody in Palm Beach,” he added. The Wall Street Journal reported last month that DOJ officials told Trump earlier this year that his name, among others, appeared in the Epstein documents. \n\nThe White House blasted the story as “fake news.”","summary":"The president says he ‘couldn’t care less’ that Justice Department plans to hand over trove of ‘Epstein files’ to House Oversight Committee","url":"https://www.independent.co.uk/news/world/americas/us-politics/ghislaine-maxwell-interview-trump-epstein-live-b2813015.html","image":"https://static.independent.co.uk/2025/07/29/13/02/GettyImages-2225863393.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/4MViInzT-4VHSaSK0.mp4","publish_date":"2025-08-23 21:51:09","author":"Mike Bedigan,Oliver O'Connell and Joe Sommerlad","authors":["Mike Bedigan","Oliver O'Connell and Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":-0.747},{"id":353673062,"title":"More Americans identify as transgender than ever; Trump’s claim they “don’t exist” contrasts with rising numbers","text":"APNearly 3 million Americans now identify as transgender, including 724,000 youth, despite Trump’s 2025 executive order restricting recognition of gender identity\n\nDonald Trump may have signed an executive order claiming transgender people “do not exist,” but more Americans than ever now say they are transgender. A recent study by UCLA, published on August 20, has revealed that approximately 2.8 million people aged 13 and older in the United States identify as transgender. Of those Americans who identify as trans, roughly equal numbers are trans men, trans women, and non-binary. About 33 percent are transgender women. About 34 percent are transgender men and 33 percent are transgender nonbinary adults, the UCLA study said. The UCLA study found that the racial and ethnic makeup of people who identify as transgender closely mirrors that of the overall US population. It also concluded that the proportion of adults identifying as transgender has stayed fairly consistent with earlier research. While adults aged 18 to 24 are now notably more likely to identify as transgender, those aged 25 to 34 also show higher rates compared with adults 65 and older.Live EventsThe report also signified that Americans are becoming more comfortable with transgender issues and culture.Shows and films from companies like Disney have featured transgender characters in recent years, allowing adolescents to see positive depictions of transgender people, which contrasts sharply with older media portrayals that were often stigmatizing or negative.According to a 2022 report by Hartford Healthcare's Institute of Living, younger generations are increasingly open to exploring different aspects of their gender identity.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontransgender identityDonald TrumpTrump transgender claimsUCLA studygender identity explorationtransgender statisticstrans men and womentransgender comfort levelsUCLAtransgender representation in media\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontransgender identityDonald TrumpTrump transgender claimsUCLA studygender identity explorationtransgender statisticstrans men and womentransgender comfort levelsUCLAtransgender representation in media(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless","summary":"Despite political rhetoric, a UCLA study reveals that approximately 2.8 million Americans aged 13 and older identify as transgender, with roughly equal numbers of trans men, trans women, and non-binary individuals. The study indicates that younger generations are more likely to identify as transgender and that Americans are becoming more comfortable with transgender issues, influenced by positive media portrayals.","url":"https://economictimes.indiatimes.com/news/international/us/more-americans-identify-as-transgender-than-ever-trumps-claim-they-dont-exist-contrasts-with-rising-numbers/articleshow/123477617.cms","image":"https://img.etimg.com/thumb/msid-123477616,width-1200,height-630,imgsize-122906,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-23 21:40:45","author":"Sectionsmore Americans Identify As Transgender Than Ever; Trump’s Claim They “don’t Exist” Contrasts","authors":["Sectionsmore Americans Identify As Transgender Than Ever; Trump’s Claim They “don’t Exist” Contrasts"],"language":"en","category":"politics","source_country":"in","sentiment":0.499}]}