{"offset":0,"number":50,"available":18301,"news":[{"id":265657828,"title":"Trump picks Robert F. Kennedy Jr. for HHS head: Letters to the Editor — Nov. 19, 2024","text":"The Issue: Donald Trump’s choice of Robert F. Kennedy Jr. to head Health and Human Services.\n\nFrom Robert F. Kennedy Jr. to head Health and Human Services to Matt Gaetz as attorney general, President-elect Donald Trump is announcing selections for his new administration that have seasoned veterans dropping their jaws (“2 turkeys’ fowl play mar Don return,” Michael Goodwin, Nov. 17).\n\n“Seasoned veterans” of battles that were fought with wooden spears and animal bones, perhaps. I hate to break it to you all, but those days are over.\n\nFrom my perspective, most of Trump’s picks are right on the money, but a few of them are simply Trump being Trump. He’s disruptive, which is the main reason we voted for him.\n\nSylvester Stallone said that Trump is the “second George Washington.” I am more inclined to quote the irreverent wizards of Monte Python’s Flying Circus and say, “And now, for something completely different.”\n\nArthur Saginian\n\nSanta Clarita, Calif.\n\nI agree that Robert F. Kennedy Jr. is not the best choice for HHS Secretary.\n\nA medical professional is best qualified to understand the human body and the science, traditions and outcomes of medicine as it is practiced today, including health and well-being practices. \n\nElinor Hite\n\nCarrollton, Texas\n\nWhen push comes to shove, The Post toes the line in spouting the regime narrative to buttress the status quo.\n\nI’m referring to The Post’s Nov. 15 editorial (“RFK Jr.: Bad Medicine,” Nov. 15) on Trump appointment of RFK Jr. to be the secretary of Health and Human Services.\n\nThe editorial and news article (“Don: I’ll give RFK a shot”) are nothing more than establishment hit-pieces to assassinate RFK’s character.\n\nBy putting RFK Jr’s opposition to the fluoridation of water on its list of “bad” RFK beliefs, The Post contradicts its own reporting.\n\nThe May 21 article, “Fluoride may affect unborn,” reports on a study published in JAMA that shows that children’s exposure to fluoride in the womb can lead to behavioral problems, including “symptoms linked to autism.” I guess JAMA is as “loony” as RFK Jr.\n\nMichael Klewin\n\nLawrence Township, NJ\n\nThe negative reaction from the The Post regarding Trump and his nomination of RFK Jr. is welcome news indeed.\n\nTrump’s other appointments for Justice, Homeland Security, etc., all have zero experience in any of those positions.\n\nTrump’s goal is to damage the US government and grow his power in the executive branch.\n\nI don’t agree with Michael Goodwin. His position disappoints.\n\nI believe Trump’s selection of Robert F. Kennedy Jr. and Matt Gaetz is brilliant.\n\nBoth are honorable disrupters of a corrupt systems that needs to be reformed. \n\nWest Hartford, Conn.\n\nAdvice to columnist Michael Goodwin: Be careful what you wish for.\n\nIf Gaetz and RFK, Jr., are as bad as Goodwin says they are, then Senate Democrats will have all the more reason to support these two nominees for their respective Cabinet posts.\n\nRemember, the Democrats have a vested interest in making sure Trump fails in his second presidency, and the first place they’ll start is with his Cabinet nominees.\n\nJ. J. Crovatto\n\n“It was just my imagination, runnin’ away with me.” Since 1970, we have gone from that soulful line from The Temptations to the following doleful message from Donald Trump’s pick to head our nation’s health department: “Don’t trust no vaccination, just put your faith in me.”\n\nSorry, RFK Jr. Your dad inspired hope, but you’re not him. Not even close.\n\nVin Morabito\n\nScranton, Pa.\n\nThe average American is medicated, has no energy, does not exercise, eats poorly and is mentally challenged.\n\nTrump, not the New York Post, recognizes this and has the correct solution. Next time, do extra research instead of just one interview.\n\nStanley Osur\n\nTenafly, NJ","summary":"Post readers discuss Donald Trump’s choice of Robert F. Kennedy Jr. to head Health and Human Services.","url":"https://nypost.com/2024/11/18/opinion/donald-trump-picks-robert-f-kennedy-jr-to-head-health-and-human-services-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/newspress-collage-b728s0ov6-1731970916571.jpg?quality=75&strip=all&1731953029&w=1200","video":null,"publish_date":"2024-11-19 01:07:05","author":"Post Readers","authors":["Post Readers"],"language":"en","source_country":"us","sentiment":0.171},{"id":265657908,"title":"Who is Sean Duffy, Newly Appointed Transport Secretary in Donald Trump 2.0 Cabinet","text":"West Palm Beach: President-elect Donald Trump said on Monday he is naming former Wisconsin Rep Sean Duffy as his nominee to be transportation secretary, as he continues to roll out picks for his Cabinet.Who is Sean Duffy, Newly Appointed US Transport SecretaryDuffy is a former reality TV star who was one of Trump's most visible defenders on cable news -- a prime concern for the media-focused president-elect.Duffy served in the House for nearly nine years, was a member of the Financial Services Committee and was chairman of the subcommittee on insurance and housing. He left Congress in 2019, and is now co-host of a show on Fox Business, the \"Bottom Line\".Trump's New Addition to his CabinetIn his announcement on Monday, Trump noted that Duffy is married to a Fox News host, calling him \"the husband of a wonderful woman, Rachel Campos-Duffy, a STAR on Fox News\".Trump said Duffy would use his experience and relationships built over the years in Congress \"to maintain and rebuild our Nation's Infrastructure, and fulfil our Mission of ushering in The Golden Age of Travel, focusing on Safety, Efficiency, and Innovation. Importantly, he will greatly elevate the Travel Experience for all Americans!\" Duffy in 2022 ruled out a run for Wisconsin governor, despite pleas from Trump to make a bid, saying he needed time to care for the needs of his family of nine children, posting on social media that his youngest child had a heart condition.He is a former lumberjack athlete and frequent contributor to Fox News. He was featured on MTV's \"The Real World: Boston\" in 1997. He met his future wife on the set of MTV's \"Road Rules: All Stars\" in 1998.He was a special prosecutor and Ashland County district attorney who won election to Congress as part of a tea party wave in 2010. He served until resigning in 2019. (Except for the headline and the subheads, this story has not been edited by Republic and is published from a syndicated feed.)","summary":"Who is Sean Duffy, Newly Appointed Transport Secretary in Donald Trump 2.0 Cabinet","url":"https://www.republicworld.com/world-news/who-is-sean-duffy-newly-appointed-transport-secretary-in-donald-trump-2-0-cabinet","image":"https://img.republicworld.com/all_images/sean-duffy-with-donald-trump-1731978340204-16_9.webp","video":null,"publish_date":"2024-11-19 01:05:48","author":"Associated Press Television News","authors":["Associated Press Television News"],"language":"en","category":"politics","source_country":"in","sentiment":0.336},{"id":265657670,"title":"EIA revises Europe’s oil forecast, notes rising Norwegian output","text":"News Terminal\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nGreen Economy\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nConstruction\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nNuclear Program\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nCentral Asia\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nTurkmenistan\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nSouth Caucasus\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nAzernews.az\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nEIA revises Europe’s oil forecast, notes rising Norwegian output\r\n\r\n\n\r\n\n\r\n\r\n\r\n19 November 2024 05:05 (UTC +04:00)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nAccess to paid information is limited\r\n\n\r\nIf You already have a account, please log in\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nSubscription to paid content\r\n\nGain access to all that Trend has to offer, as well as to premium, licensed content via subscription or direct purchase through a credit card.\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n10 news item\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nSubscribe to paid news for 3 months\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nSee all packages\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\nEIA revises Europe’s oil forecast, notes rising Norwegian output\r\n\n\r\n05:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan’s industrial production grows\r\n\n\r\n04:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS coal exports set to rise in 2024, domestic production faces decline\r\n\n\r\n03:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nQazaqGaz, Gaffney Cline team up to implement projects in Kazakhstan\r\n\n\r\n02:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSnam’s Ravenna LNG terminal to begin operations in early 2025\r\n\n\r\n02:25 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nState-owned entities in Kyrgyzstan see hefty hike in asset accumulation\r\n\n\r\n01:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan plans major irrigation infrastructure expansion by 2028\r\n\n\r\n01:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nShell, bp, TotalEnergies, Equinor join forces on energy access goals\r\n\n\r\n01:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n“Earth Through Children’s Eyes\" photo exhibition opens at Heydar Aliyev Center (PHOTO)\r\n\n\r\n00:53 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHealth Ministers of Azerbaijan and Georgia meet within COP29 (PHOTO)\r\n\n\r\n00:18 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran keen on accelerating Rasht-Astara railway construction\r\n\n\r\n18 November 23:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's product imports from Azerbaijan decrease\r\n\n\r\n18 November 23:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan raises need criterion and living wage thresholds\r\n\n\r\n18 November 22:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS distillate fuel demand set to rise in 2025 - EIA\r\n\n\r\n18 November 22:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nADB to build student dormitories in Kazakhstan\r\n\n\r\n18 November 21:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPort logistics volume in Kazakhstan experiences growth\r\n\n\r\n18 November 21:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts event on \"Radiation and Climate Change: New Challenges\"\r\n\n\r\n18 November 20:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change impacts all aspects of existence - minister\r\n\n\r\n18 November 20:53 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan presents energy efficiency roadmap (PHOTO)\r\n\n\r\n18 November 20:49 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's Mouteh Gold Complex amplifies its gold bullion output\r\n\n\r\n18 November 20:46 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan features panel session on human capital development\r\n\n\r\n18 November 20:43 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change, among other factors, harms children's rights - official\r\n\n\r\n18 November 20:40 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEuropean neocolonialism: the ghost that won’t rest\r\n\n\r\n18 November 20:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's Nakhchivan reveals share of online registered local commercial entities\r\n\n\r\n18 November 20:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVice-President of Heydar Aliyev Foundation Leyla Aliyeva, Princess of Jordan and Director General of ICCROM watch “Mangurt” play (PHOTO)\r\n\n\r\n18 November 19:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPhoto report showcasing eighth day of COP29 in Azerbaijan's Baku (PHOTO)\r\n\n\r\n18 November 19:45 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku calls on global community: Combating climate change demands joint efforts\r\n\n\r\n18 November 19:35 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUK company to createforest ecosystem in Kazakhstan's Almaty region\r\n\n\r\n18 November 19:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan's foreign trade turnover hike\r\n\n\r\n18 November 19:27 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 Green Zone hosts panel on raising human capital for green future\r\n\n\r\n18 November 19:24 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVolume of gold produced in Azerbaijan revealed\r\n\n\r\n18 November 19:23 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazMunayGas increases refining depth indicator\r\n\n\r\n18 November 19:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani FM discusses regional situation with Vice-President of OSCE PA\r\n\n\r\n18 November 19:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVolume of Azerbaijan's gas exports to Europe announced\r\n\n\r\n18 November 19:17 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRiding subway rise in Azerbaijan as more people hop on them\r\n\n\r\n18 November 19:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident of Kazakhstan arrives in Serbia for official visit\r\n\n\r\n18 November 19:08 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's Bahar Azadi gold coin tumbles in price\r\n\n\r\n18 November 19:06 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran unveils amount of tea leaves purchased from local farmers\r\n\n\r\n18 November 19:04 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan saying no to charging VAT for citizens buying Apple services domestically\r\n\n\r\n18 November 19:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change impact on human health feels worldwide - Azerbaijani health minister\r\n\n\r\n18 November 18:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 makes global call for eradication of landmines in Azerbaijan and beyond (PHOTO)\r\n\n\r\n18 November 18:54 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani MFA addresses views on European Council's Framework Convention for Protection of National Minorities\r\n\n\r\n18 November 18:52 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGreen skills to support shift to green economy - UK Parliamentary Under-Secretary of State\r\n\n\r\n18 November 18:34 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan to host event on International Aviation and Climate Change\r\n\n\r\n18 November 18:30 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan tallies volume of funds allocated in country for compulsory health insurance of population\r\n\n\r\n18 November 18:29 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n'Green' activities to foster greatly environmental protection - Georgian minister\r\n\n\r\n18 November 18:27 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan set to host ministerial talks on digitalization of Middle Corridor\r\n\n\r\n18 November 18:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani house in Prague opens Sunday school for children (PHOTO)\r\n\n\r\n18 November 18:17 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 approves Baku principles of human development for climate resilience\r\n\n\r\n18 November 18:09 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan House in Krakow, Poland marks November 8 - Victory Day (PHOTO)\r\n\n\r\n18 November 18:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA predicts US refinery capacity cuts to lead to rising gasoline, diesel margins\r\n\n\r\n18 November 18:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's household incomes grow\r\n\n\r\n18 November 18:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's state budget surplus for 2024 announced\r\n\n\r\n18 November 17:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazakhstan discloses coal supply figures for heating season\r\n\n\r\n18 November 17:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS gas prices slide in October - EIA latest outlook\r\n\n\r\n18 November 17:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan tallies country's gas exports in 10M2024\r\n\n\r\n18 November 17:43 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani Clean Energy Jabrayil, Baku Steel Company ink memorandum on renewables (PHOTO)\r\n\n\r\n18 November 17:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29: Implementation of Baku's Master Plan until 2040 drives sustainable dev't of capital (PHOTO)\r\n\n\r\n18 November 17:35 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNatural gas production in US slows in 2024, growth predicted for 2025\r\n\n\r\n18 November 17:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's COP29 features panel discussion on investing in skills (PHOTO)\r\n\n\r\n18 November 17:16 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan seeks British investment for modernization of railway sector\r\n\n\r\n18 November 17:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses gas volume transported via country's main pipelines\r\n\n\r\n18 November 17:12 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA sees weak growth in global oil demand, with India driving most of increase\r\n\n\r\n18 November 17:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan signs MoU with Chinese TBEA on renewable energy (PHOTO)\r\n\n\r\n18 November 17:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan has no goal of switching to floating exchange rate - CBA governor\r\n\n\r\n18 November 17:01 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's Baku initiative group holds event on solidarity for green future (PHOTO)\r\n\n\r\n18 November 16:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani-American Organizations Alliance sends congratulatory letter to Donald Trump (PHOTO)\r\n\n\r\n18 November 16:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan hosts Turkic NGOs' cooperative climate initiative forum\r\n\n\r\n18 November 16:51 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's 'green hospitals' project likely to become reality within five years - minister\r\n\n\r\n18 November 16:51 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHeydar Aliyev Foundation VP Leyla Aliyeva participates in discussions on strengthening environmental literacy among youth at COP29 (PHOTO)\r\n\n\r\n18 November 16:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA forecasts oil price spike in early 2025\r\n\n\r\n18 November 16:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nInternational logistics company's Azerbaijani branch winding down\r\n\n\r\n18 November 16:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nWe still far from halving global emissions this decade - UN official\r\n\n\r\n18 November 16:44 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHosting COP29 in fraternal Azerbaijan makes us happy - Turkish minister\r\n\n\r\n18 November 16:39 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan, Slovakia work out renewables cooperation\r\n\n\r\n18 November 16:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nLetter of intent signed to create “Baku COP Presidencies Continuity Coalition for Climate and Health” (PHOTO)\r\n\n\r\n18 November 16:33 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTransparency, inclusiveness and urgency remain key to COP29's success - official\r\n\n\r\n18 November 16:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 framework sees article adoption on non-market approaches - Mukhtar Babayev\r\n\n\r\n18 November 16:24 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses number of social benefits and pensions in country in 10M2024\r\n\n\r\n18 November 16:23 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku Initiative Group holds protest against nuclear tests in colonial territories (PHOTO)\r\n\n\r\n18 November 16:15 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 makes decision on work program under Paris Agreement's non-market approaches\r\n\n\r\n18 November 16:13 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGlobal unity for climate change fight shines through COP29 - EU representative\r\n\n\r\n18 November 16:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKeeping global warming to 1.5 degrees remains possible - European commissioner\r\n\n\r\n18 November 16:06 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHeatwaves significantly impair educational performance - UNICEF\r\n\n\r\n18 November 16:06 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts discussions on restoration of Absheron lakes, climate stability, and sustainable water management\r\n\n\r\n18 November 16:02 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan to imprison havoc-unlishers to ecosystem\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA updates forecast on Azerbaijan's oil output in 2025\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's state budget envisages oil price at $70 - minister\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nJICA to provide grant for modernization of Kyrgyzstan's air navigation equipment\r\n\n\r\n18 November 15:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nISESCO developing global dashboard to track progress in green education\r\n\n\r\n18 November 15:52 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 ICESCO Pavilion launches framework for introducing 'green' education in Islamic world\r\n\n\r\n18 November 15:47 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTürkiye develops education strategy to support green economy transition - minister\r\n\n\r\n18 November 15:42 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev appoints consul general of Azerbaijan to Los Angeles, US - decree\r\n\n\r\n18 November 15:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNew collective quantitative target must сonsider children's needs - UNICEF\r\n\n\r\n18 November 15:37 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan unveils growth of consumer prices\r\n\n\r\n18 November 15:36 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRelations between Turkic states progressing rapidly across all sectors - Azerbaijani official\r\n\n\r\n18 November 15:31 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev appoints new consul general of Azerbaijan to Türkiye's Kars city\r\n\n\r\n18 November 15:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan appoints its new consul general in Batumi, Georgia - decree\r\n\n\r\n18 November 15:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan announces its oil production volume for 10M2024\r\n\n\r\n18 November 15:25 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan designates consul general in city of Aktau, Kazakhstan - decree\r\n\n\r\n18 November 15:24 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB names priority spheres of cooperation with Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGovernment obtains social benefit hike assignment - minister\r\n\n\r\n18 November 15:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB eyes to add new partner banks to its network in Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's strategic foreign exchange reserves multiply - deputy minister\r\n\n\r\n18 November 15:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB president talks about new country strategy for Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan does much to mitigate climate change - minister\r\n\n\r\n18 November 15:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan fully committed to development of climate education - official\r\n\n\r\n18 November 14:58 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan counts revenues and expenditures of Unemployment Insurance Fund\r\n\n\r\n18 November 14:56 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan advocates for climate change integration into PISA framework - minister\r\n\n\r\n18 November 14:52 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan makes several novelties in its draft budget for 2025\r\n\n\r\n18 November 14:44 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGermany becomes sixth main trading partner of Azerbaijan - AZPROMO\r\n\n\r\n18 November 14:33 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan discloses GDP growth rate for 10M2024\r\n\n\r\n18 November 14:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nLa Gazette du Caucase blasts French politicians for undermining COP29 with Armenian bias\r\n\n\r\n18 November 14:20 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts ministerial roundtable on greening education\r\n\n\r\n18 November 14:19 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses weekly mine clearing progress in liberated territories\r\n\n\r\n18 November 14:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan hikes minimum living wage and poverty line for 2025 budget - minister\r\n\n\r\n18 November 14:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan set to acquire new demining equipment\r\n\n\r\n18 November 14:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSignificant financial surplus expected by year-end - chairman\r\n\n\r\n18 November 13:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nColonized nations face environmental challenges - Kenyan MP\r\n\n\r\n18 November 13:47 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan unveils minimum pension level for next year\r\n\n\r\n18 November 13:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan boosts defense allocations in state budget for 2025\r\n\n\r\n18 November 13:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEU set to end free emissions quotas by 2039 - Cefic director general\r\n\n\r\n18 November 13:34 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMinimum wage prepares to ascend to new heights in Azerbaijan\r\n\n\r\n18 November 13:32 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts panel discussion on accelerating global industrial and energy decarbonization (PHOTO)\r\n\n\r\n18 November 13:30 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan pulls back curtain on its inflation forecast for 2025\r\n\n\r\n18 November 13:27 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan betting uptick in average monthly salary by 2025\r\n\n\r\n18 November 13:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP for Hope: COP29 in Baku marks new milestone in COP events history - German Vice Chancellor (Exclusive)\r\n\n\r\n18 November 13:17 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's petrochemical sector to capture most carbon emissions soon - federation secretary\r\n\n\r\n18 November 13:08 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazakhstan becomes part of Hydrogen Breakthrough Agenda\r\n\n\r\n18 November 13:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMitigating risks in transition to zero emissions requires focus on four key areas - WB\r\n\n\r\n18 November 13:03 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCentral Bank of Azerbaijan discloses inflation forecast by end of 2024\r\n\n\r\n18 November 12:51 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMalaysia reveals its renewable energy share target by 2050\r\n\n\r\n18 November 12:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUN Secretary-General calls on G20 leaders to support COP29 goals\r\n\n\r\n18 November 12:33 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change significantly impacts labor market - Azerbaijani minister\r\n\n\r\n18 November 12:30 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEU to focus on implementation and investment in next five years - Commissioner for Climate Action\r\n\n\r\n18 November 12:28 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCombating climate change requires focusing on health - Dutch minister\r\n\n\r\n18 November 12:23 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets with Secretary-General of Commonwealth (VIDEO)\r\n\n\r\n18 November 12:19 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Baku adopts declaration on strengthening co-op on declining Caspian Sea levels\r\n\n\r\n18 November 12:18 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEBRD invests in Azerbaijan’s solar power expansion at COP29\r\n\n\r\n18 November 12:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change demands thorough reevaluation of our way of life - Italian minister\r\n\n\r\n18 November 11:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSeveral billion people stand vulnerable to climate change impacts - Adaptation Fund chair\r\n\n\r\n18 November 11:56 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEquinor expands Norwegian drilling operations with new rig contract\r\n\n\r\n18 November 11:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNar’s environmental training concludes with a meeting with an international expert (PHOTO)\r\n\n\r\n18 November 11:42 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran releases currency exchange rates for November 18\r\n\n\r\n18 November 11:36 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran’s IRENEX reveals products to be on sale for November 18\r\n\n\r\n18 November 11:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBank Respublika and FMO sign major loan agreement at COP29\r\n\n\r\n18 November 11:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSignificant efforts crucial for enhancing teachers' knowledge of climate change - minister\r\n\n\r\n18 November 11:32 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nWorld Bank tackles climate risks in S. Caucasus with focus on sustainable infrastructure - regional director\r\n\n\r\n18 November 11:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku Initiative reflects Azerbaijan's commitment to human-centered climate action - COP29 Lead Negotiator\r\n\n\r\n18 November 11:28 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRussian presidential envoy set to address COP29 on BRICS nations' climate cooperation\r\n\n\r\n18 November 11:26 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets with President of Palau (PHOTO/VIDEO)\r\n\n\r\n18 November 11:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts meeting on Investing in Human Development for Climate Resilient Future (PHOTO)\r\n\n\r\n18 November 11:20 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev sends congratulatory letter to Sultan of Oman\r\n\n\r\n18 November 11:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan plays important role, greatly contributing to provision of BTRs - official\r\n\n\r\n18 November 11:09 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTürkiye working to create fair transition-based sectoral infrastructure for green transformation\r\n\n\r\n18 November 10:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts ECO ministerial meeting on circular economy (PHOTO)\r\n\n\r\n18 November 10:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets Russia's finance minister, head of Liberal Democratic Party (PHOTO/VIDEO)\r\n\n\r\n18 November 10:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRealize your year-end plans with a Yelo Bank loan!\r\n\n\r\n18 November 10:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAIIB signs landmark private sector solar PV project in Azerbaijan at COP29\r\n\n\r\n18 November 10:52 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTransparency remains key to global climate action efforts - COP29 Lead Negotiator\r\n\n\r\n18 November 10:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nTerms of use\r\n\r\n\n\r\n\r\n\r\n\n\r\nNews terminal\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n© 2024 Trend News Agency\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\nForgot password?\r\n\r\n\nOther ways to register\r\n\n\r\n\n\r\n Login with Facebook\r\n\r\n\n\r\n Login with Google\r\n\r\n\n\r\n Login with Twitter\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\nOther ways to register\r\n\n\r\n\n\r\n Login with Facebook\r\n\r\n\n\r\n Login with Google\r\n\r\n\n\r\n Login with Twitter\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nPassword reset","summary":"","url":"https://en.trend.az/business/3972088.html","image":"/imagen/3972088","video":null,"publish_date":"2024-11-19 01:05:00","author":null,"language":"en","source_country":"az","sentiment":0.448},{"id":265656976,"title":"South China Sea ‘crises’ still likely during next Trump term: military expert","text":"Military accidents involving China and the US in the South China Sea will be “increasingly likely” during Donald Trump’s second presidential term, but China is better prepared this time, according to a military analyst and retired People’s Liberation Army officer.\nPLA senior colonel Zhou Bo, now a senior fellow with Tsinghua University’s Centre for International Security and Strategy, said the risks in the South China Sea were higher than for other flashpoints such as Taiwan.\nHe said it would become “increasingly likely to have accidents or serious crises in the South China Sea, in the air or sea”.\nHe added that despite frequent confrontations between China and the Philippines, any serious deadly conflict in the next four years was “still likely to occur between China and the US instead”.\nHe said he thought Manila had been provocative but “they know the bottom line” and the maritime dispute between the countries “could be resolved”.\nZhou’s remarks draw on the US Department of Defence’s latest China Military Power Report, which states that from autumn of 2021 to autumn of 2023, there were “over 180 instances of PLA coercive and risky air intercepts against US aircraft in the region – more in the past two years than in the previous decade”.\n“That’s one incident every four days,” Zhou said.\n“The point is that we have a different understanding of international law,” Zhou said. Beijing considers the South China Sea part of China’s territory and territorial waters, while Washington disagrees.\n“For us, it is about security; for the US, it is about safety,” he said.\n“The US insists on coming to the South China Sea, and we do not want them to come,” Zhou said, adding that he did not foresee a clear solution to the stand-off between the two powers.\nHowever, Zhou said that compared to Trump’s previous term in the White House, “China is simply better prepared now”.\nOne reason for this, he said, was the modernisation of China’s military, which is on track to become the world’s biggest navy, according to the Pentagon.\nOther factors include China’s reduced economic dependence on the US, the rise of the Global South against Western dominance, and the growth of China-centred or China-led multilateral initiatives including the Belt and Road Initiative, the Shanghai Cooperation Organisation and Brics.\nZhou sees the Taiwan Strait as another potential flashpoint.\n“The Taiwan question actually could be both extremely complicated and very simple,” he said.\nZhou added that all Washington must do was to “let Beijing believe that peaceful reunification is still possible”. Under such conditions, “there is no possibility that Beijing would want to use force”, he added.\n\nAt his final official meeting with US President Joe Biden during the Asia-Pacific Economic Cooperation summit in Lima, Peru over the weekend, Chinese President Xi Jinping urged his counterpart to avoid provocation in the South China Sea and support China’s peaceful reunification.\nDuring the meeting, Xi described the Taiwan question as one of the “four red lines for China that must not be challenged or crossed”, according to state news agency Xinhua.\nBeijing sees Taiwan as part of China to be reunited by force, if necessary. Most countries, including the United States, do not recognise the self-governed island as independent, but Washington is opposed to any attempt to take the island by force.\nTrump has recently tapped Beijing-sanctioned Marco Rubio to serve as US secretary of state. The Florida senator, who has introduced legislation supporting Taiwan and has described the island as “an independent democracy and strong ally of the United States”, is one of several hawkish figures picked to serve in key roles – including defence secretary, national security adviser, and CIA director – in the next administration.\nZhou said he believed the Pentagon’s Joint Chiefs of Staff would wield more influence over military matters than Trump’s aides and advisers, adding that this might ease some of the more extreme hardline rhetoric emanating from Washington.","summary":"Retired PLA officer predicts risk of ‘accidents’ could grow after Donald Trump returns to White House, but Beijing is ‘better prepared now’.","url":"https://www.scmp.com/news/china/military/article/3287104/south-china-sea-crises-still-likely-during-next-trump-term-military-expert","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/18/2a9f803f-f5de-4704-b2b8-3b56ffece140_53ed5381.jpg","video":null,"publish_date":"2024-11-19 01:00:13","author":"Enoch Wong","authors":["Enoch Wong"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.153},{"id":265656852,"title":"Dental company stocks jump amid RFK Jr.’s health claims about fluoride","text":"Robert F. Kennedy Jr.’s concerns about the health effects of fluoride may already be helping some Americans — investors in dental services companies. \n\nShares in Dentsply Sirona, Envista, Henry Schein Patterson Companies, and other providers of dental products are jumping, with Wall Street betting that a potential push by the incoming Trump administration to remove fluoride from the nation’s drinking water could spur demand for the companies’ services. \n\nKennedy, tapped by President-elect Donald Trump to lead the U.S. Department of Health and Human Services, said on social media just ahead of the November 5 presidential election that Trump would rid fluoride from the public water supply on his first day in office. Kennedy, a noted vaccine skeptic, has described fluoride as an “industrial waste” and linked it to arthritis, neurological deficiencies in children and other serious health problems. \n\n“The thought here is RFK will bring to HHS a voice that is in favor of reducing, or eliminating, the amount of fluoridation that is added to drinking water,” Don Bilson, Gordon Haskett’s head of event-driven research, told investors in a report, according to NBC News. “This will, in turn, lead to an acceleration of tooth decay and more dental visits.”\n\nDental experts have largely refuted such claims. Dr. Aaron Yancoskie, associate dean of academic affairs at Touro College of Dental Medicine, told “CBS Mornings Plus” on November 13 that there is “excellent, solid data going back 75 years showing that fluoride is both safe, and it’s extremely effective at decreasing dental decay, that is, cavities, by strengthening the enamel of our teeth.”\n\nAccording to KFF Health News, some studies have linked fluoride exposure among pregnant women to a higher risk of childhood neurobehavioral problems and lower IQs, leading experts to call for further research.\n\nFluoride is a mineral that keeps teeth healthy and reduces cavities by protecting them against bacteria that produces potentially damaging acid, according to the U.S. Centers for Disease Control and Prevention. To prevent tooth decay, the U.S. has been adding a small quantity of fluoride to water since the 1950s.\n\nStocks have surged since Trump won a second term in the White House, with investors buoyed by his pledges during the campaign against Vice President Kamala Harris to cut corporate taxes and eliminate red tape for businesses. \n\n contributed to this report.","summary":"Robert F. Kennedy Jr.&#8217;s concerns about the health effects of fluoride may already be helping some Americans — investors in dental services companies.  Shares in Dentsply Sirona, Envista, Henry Schein Patterson Companies, and other providers of dental products are jumping, with Wall Street betting that a potential push by the incoming Trump administration to remove &#8230;\n\n\nThe post Dental company stocks jump amid RFK Jr.&#8217;s health claims about fluoride appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/dental-company-stocks-jump-amid-rfk-jr-s-health-claims-about-fluoride/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/14/f13d3dff-dfbd-45da-a2ff-296fd2217cff/thumbnail/1200x630/5956bfeb52c22bdff62a42e806831a42/cbsn-fusion-trump-names-rfk-jr-health-secretary-pick-thumbnail.jpg?v=6125856b135c6847bbc622c9704e0334","video":null,"publish_date":"2024-11-19 00:58:07","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","source_country":"us","sentiment":0.03},{"id":265657796,"title":"What Trump's reelection means for the Justice Department","text":"What Trump's reelection means for the Justice Department\n Donald Trump on the campaign trail repeatedly accused Democrats of using the U.S. Justice Department to indict him for several crimes. So what exactly does this baseless claim signal about how the president-elect will seek to reshape the DOJ? Hugo Lowell, senior political correspondent for The Guardian, joins \"America Decides\" to discuss.","summary":"Donald Trump on the campaign trail repeatedly accused Democrats of using the U.S. Justice Department to indict him for several crimes. So what exactly does this baseless claim signal about how the president-elect will seek to reshape the DOJ? Hugo Lowell, senior political correspondent for The Guardian, joins \"America Decides\" to discuss.","url":"https://www.cbsnews.com/video/what-trump-reelection-means-for-justice-department/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/19/2ea56d3e-6f06-4628-9e77-b1b6a56238c1/thumbnail/1200x630/21349fe968b8df0ea7adfc1e536f906c/cbsn-fusion-what-trump-reelection-means-for-justice-department-thumbnail.jpg?v=6125856b135c6847bbc622c9704e0334","video":null,"publish_date":"2024-11-19 00:58:06","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.404},{"id":265656898,"title":"Ex-Wisconsin Rep. gets nod for transportation","text":"WEST PALM BEACH, Fla. — President-elect Donald Trump said Monday he is naming former Wisconsin Rep. Sean Duffy as his nominee to be transportation secretary, as he continues to roll out picks for his Cabinet.\n\nDuffy is a former reality TV star who was one of Trump’s most visible defenders on cable news — a prime concern for the media-focused president-elect. Duffy served in the House for nearly nine years, was a member of the Financial Services Committee and was chairman of the subcommittee on insurance and housing. He left Congress in 2019, and is now co-host of a show on Fox Business, “The Bottom Line.”\n\nIn his announcement Monday, Trump noted that Duffy is married to a Fox News host, calling him “the husband of a wonderful woman, Rachel Campos-Duffy, a STAR on Fox News.”\n\nDuffy is so far the second Fox-affiliated television host to be named to a Cabinet position in Trump’s new White House. Trump last week announced he was choosing Fox News host Pete Hegseth to serve as his defense secretary.\n\nTrump said Duffy would use his experience and relationships built over the years in Congress “to maintain and rebuild our Nation’s Infrastructure, and fulfill our Mission of ushering in The Golden Age of Travel, focusing on Safety, Efficiency, and Innovation. Importantly, he will greatly elevate the Travel Experience for all Americans!”\n\nDuffy in 2022 ruled out a run for Wisconsin governor, despite pleas from Trump to make a bid, saying he needed time to care for the needs of his family of nine children, posting on social media that his youngest child had a heart condition.\n\nHe is a former lumberjack athlete and frequent contributor to Fox News. He was featured on MTV’s “The Real World: Boston” in 1997. He met his future wife on the set of MTV’s “Road Rules: All Stars” in 1998.\n\nA reality television background before politics is not unusual in Trump’s world. The former president launched his political career after his hit reality show, ” The Apprentice,”\n\nDuffy, after his time on reality television, worked as a special prosecutor and Ashland County district attorney. He won election to Congress as part of a tea party wave in 2010.","summary":"President-elect Donald Trump said Monday he is naming former Wisconsin Rep. Sean Duffy as his nominee to be transportation secretary, as he continues to roll out picks for his Cabinet.","url":"https://www.bostonherald.com/2024/11/18/ex-wisconsin-rep-gets-nod-for-transportation/","image":"https://www.bostonherald.com/wp-content/uploads/2024/11/AP24323829416285.jpg?w=1024&h=679","video":null,"publish_date":"2024-11-19 00:57:11","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.427},{"id":265656972,"title":"Trump taps former congressman Sean Duffy for US transportation secretary","text":"Donald Trump on Monday nominated former congressman Sean Duffy to be transportation secretary and oversee a huge federal portfolio of infrastructure spending and transit regulations.\nAs the incoming Republican administration promises a swathe of spending cuts, Trump in a statement praised Duffy’s advocacy in Congress for “fiscal responsibility”.\nStill, with the leader of the Department of Transportation tasked with overseeing major infrastructure upgrades and maintenance, the president-elect said Duffy, from Wisconsin, worked with Democratic colleagues in Congress on a major road and bridge project.\nAnd as the Trump administration seeks to slash regulations, the incoming president said Duffy would eliminate racial diversity programmes for pilots and air traffic controllers.\n\n“He will prioritise excellence, competence, competitiveness and beauty when rebuilding America’s highways, tunnels, bridges and airports,” Trump said.\nDuffy – like defence secretary pick Pete Hegseth – is a television host, with the former on Fox Business and the latter on the arch-conservative Fox News.\nHe was featured on MTV’s The Real World: Boston in 1997. He met his future wife on the set of MTV’s Road Rules: All Stars in 1998.\nA reality television background before politics is not unusual in Trump’s world. The former president launched his political career after his hit reality show, The Apprentice.\nDuffy, after his time on reality television, worked as a special prosecutor and Ashland County district attorney. He won election to Congress as part of a tea party wave in 2010.\nAs Trump rounds out his picks for his cabinet – which will help him attempt to carry out an agenda of trade tariffs and mass deportations – he has tapped a mix of political allies, firebrands and a few relatively conventional figures, with loyalty to Trump what he values most.\nThe Republican led Senate will need to approve his nominees, and Trump is already facing pushback from his own party on some.\nFormer congressman Matt Gaetz, tapped to lead the Justice Department, was probed by the House ethics committee for allegedly having sex with a 17 year old girl years ago and for other alleged offences.\nThe Justice Department also investigated him but brought no criminal charges.\nStill, Washington is waiting eagerly to see if the House ethics committee report on him will be released to the Senate and/or the general public.\nHegseth, who would lead the Pentagon, is under scrutiny after it was revealed he paid a settlement to a woman who accused him of sexual assault, as part of a non-disclosure agreement.\nAdditional reporting by Associated Press","summary":"If confirmed, Sean Duffy will oversee aviation, automotive, rail, transit and other transportation policies.","url":"https://www.scmp.com/news/world/united-states-canada/article/3287130/trump-taps-former-congressman-sean-duffy-us-transportation-secretary","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/19/af1fc5e8-a1e7-4c16-9938-48fde86927c1_ee792f56.jpg","video":null,"publish_date":"2024-11-19 00:56:36","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":0.204},{"id":265656302,"title":"G20 leaders discuss global challenges ahead of Trump's return","text":"The leaders of the Group of 20 economies began a two-day meeting on Monday in Brazil to address global challenges, including geopolitical conflicts and climate change, ahead of Donald Trump's return as U.S. president in January.\n\nThe leaders gathered as Trump's comeback revives memories of his disruption of the G20 and other multilateral frameworks during his first term, when his \"America First\" stance tested international unity. His embrace of protectionism has also added a layer of uncertainty to the global economy.\n\nJapanese Prime Minister Shigeru Ishiba, who is attending the G20 summit for the first time since taking office in October, said the world is confronted with challenges that cannot remain unaddressed, citing conflicts, climate change and natural disasters.\n\n\"Under such circumstances, the G20 must find common ground, rather than being left with divisions and confrontations, and find solutions based on shared responsibilities,\" he said during one of the day's sessions.\n\nThe G20 meeting in Rio de Janeiro comes as the recent victory of Republican Trump, an advocate of higher tariffs on imports and a hard-liner on China, has raised uncertainty over whether the world's largest economy can achieve the soft landing expected by analysts.\n\nFor its part, this year's G20 chair Brazil has prioritized combating poverty and hunger, enhancing global governance and promoting sustainable development.\n\nBrazilian President Luiz Inacio Lula da Silva described the state of the world as being \"worse\" than during the 2008 global financial crisis as he made the case for G20 action.\n\nHe cited, as causes behind the highest number of armed conflicts since World War II, the issues of forced displacement, the devastating effects of extreme climate in \"all corners of the planet,\" and deepening racial and gender inequalities.\n\nDespite the wide range of topics to be covered by the G20 leaders, attention is likely to center on how they outline their positions on Russia's war in Ukraine, the Israel-Gaza conflict, trade and climate change in a statement to be released after their discussions.\n\nU.S. President Joe Biden, attending the last G20 summit of his tenure, said his country \"strongly supports\" Ukraine's sovereignty and territorial integrity, adding, \"Everyone around this table, in my view, should as well.\"\n\nHe also said Israel has a right to defend itself, but how it does so matters \"a great deal.\"\n\nMany of the G20 leaders, including Biden, Ishiba and Chinese President Xi Jinping, visited Brazil after attending the Asia-Pacific Economic Cooperation summit in neighboring Peru.\n\nWhile Trump has yet to be inaugurated, APEC leaders, at the conclusion of their gathering on Saturday, underscored the importance of effective global collaboration amid \"unprecedented and rapid changes\" in areas such as trade, climate change and energy.\n\nThe leaders pledged to \"deliver a free, open, fair, nondiscriminatory, transparent, inclusive and predictable trade and investment environment,\" echoing the G20's existing commitment to ensuring rules-based, nondiscriminatory trade.\n\nIn addition to the Group of Seven countries -- Britain, Canada, France, Germany, Italy, Japan and the United States, plus the European Union -- the G20 comprises Argentina, Australia, Brazil, China, India, Indonesia, Mexico, Russia, Saudi Arabia, South Africa, South Korea and Turkey.\n\nRelated coverage","summary":"RIO DE JANEIRO - The leaders of the Group of 20 economies began a two-day meeting on Monday in Brazil to address glob...","url":"https://english.kyodonews.net/news/2024/11/efe83619028d-update2-g20-leaders-discuss-global-challenges-ahead-of-trumps-return.html","image":"https://img.kyodonews.net/english/public/images/posts/855746f8739b0e1f4ff070efc13d8bf7/cropped_image_l.jpg","video":null,"publish_date":"2024-11-19 00:53:31","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.394},{"id":265656300,"title":"Kyodo News Digest: Nov. 19, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nRIO DE JANEIRO - The leaders of the Group of 20 economies began a two-day meeting on Monday in Brazil to address global challenges, including geopolitical conflicts and climate change, ahead of Donald Trump's return as U.S. president in January.\n\nThe leaders gathered as Trump's comeback revives memories of his disruption of the G20 and other multilateral frameworks during his first term, when his \"America First\" stance tested international unity. His embrace of protectionism has also added a layer of uncertainty to the global economy.\n\nRIO DE JANEIRO - Japan and Britain agreed Monday to launch a new framework for dialogue among their economic and foreign ministers to discuss trade, security and other shared challenges.\n\nThe agreement was reached at a meeting between Japanese Prime Minister Shigeru Ishiba and British Prime Minister Keir Starmer on the margins of the Group of 20 summit in Brazil's Rio de Janeiro, according to the Japanese Foreign Ministry.\n\nJapan, Canada agree to further cooperation in LNG, EV battery sectors\n\nRIO DE JANEIRO - The leaders of Japan and Canada agreed Monday to enhance economic ties further in such fields as electric vehicle batteries and liquefied natural gas.\n\nIn their first summit meeting, Japanese Prime Minister Shigeru Ishiba and his Canadian counterpart Justin Trudeau also confirmed that greater security cooperation between the two nations is important, the Japanese government said.\n\nLife term sought for widow over murder of Japanese \"Don Juan\"\n\nWAKAYAMA, Japan - Prosecutors sought on Monday a life term for a 28-year-old woman accused of murdering her wealthy husband who had described himself as the \"Don Juan\" of the western Japan area where he lived.\n\nSaki Sudo is charged with causing 77-year-old Kosuke Nozaki to ingest a lethal amount of an illegal stimulant drug on May 24, 2018, just months after they got married, according to the indictment.\n\nKOFU, Japan - The Yamanashi prefectural government said Monday it has given up its proposal to build a light rail connection to the fifth station on Mt. Fuji amid public concerns over its environmental impact and is now considering introducing a rubber-tired tram.\n\nThe central Japan prefecture had explored the possibility of connecting the foot of the country's tallest peak to the intermediate station with a light rail system to deal with the large influx of summer tourists and reduce vehicle emissions.\n\nNEW YORK - The National Baseball Hall of Fame on Monday unveiled its 2025 ballot featuring 14 newly eligible candidates, including former Seattle Mariners outfielder Ichiro Suzuki, widely considered a shoo-in for the honor in his first vote.\n\nThe 51-year-old will need to be named on at least 75 percent of the ballots cast by selected baseball journalists to win induction into the Hall of Fame. Given his groundbreaking career and success in the majors over 18-plus seasons, there has been speculation Suzuki could be the second-ever unanimous pick, after former New York Yankees closer Mariano Rivera.\n\nChina denies reported drone production for Russian military\n\nBEIJING - China on Monday denied reports that it has been producing drones for Russia's military amid the war in Ukraine, saying it has \"put under strict control\" such dual-use items.\n\n\"We have never offered lethal weapons to any parties concerned,\" Chinese Foreign Ministry spokesman Lin Jian said at a press conference. \"We hope people will not make presumptions concerning China without presenting any evidence based on facts.\"\n\nBaseball: Japan's Daikin secures naming rights for Astros ballpark\n\nNEW YORK - The U.S. subsidiary of Japanese air-conditioner maker Daikin Industries Ltd. has sealed a naming-rights partnership with the Houston Astros, the club and company said Monday, with the team's ballpark to be rebranded from 2025.\n\nWith the 15-year deal, Daikin becomes the first company from Japan to acquire naming rights for a Major League Baseball stadium, it said in a statement. The 41,000-seat ballpark, first opened in 2000 and known as Minute Maid Park since 2002, will be renamed Daikin Park in the agreement running through 2039.\n\nVideo: Ceremony held to mark opening of Kansai shogi hall","summary":"Junya Ito (L) and Keito Nakamura are pictured during training with the Japan national team in Xiame...","url":"https://english.kyodonews.net/news/2024/11/e348f2494b20-kyodo-news-digest-nov-19-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/3635e110c56a54c7a03107667f08221e/cropped_image_l.jpg","video":null,"publish_date":"2024-11-19 00:53:31","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.375},{"id":265656298,"title":"Japan, Britain to launch ministerial dialogue on economic security","text":"Japan and Britain agreed Monday to launch a new framework for dialogue among their economic and foreign ministers to discuss trade, security and other shared challenges.\n\nThe agreement was reached at a meeting between Japanese Prime Minister Shigeru Ishiba and British Prime Minister Keir Starmer on the margins of the Group of 20 summit in Brazil's Rio de Janeiro, according to the Japanese Foreign Ministry.\n\nThe economic version of the \"two-plus-two\" ministerial framework is the second of its kind for Japan, which uses the same format with the United States. Japan and Britain are both close U.S. allies and major exporters to the world's largest economy.\n\nUnder the new consultative framework, Tokyo and London may discuss the push by incoming U.S. leader Donald Trump to impose higher tariffs on U.S. imports.\n\nJapan and Britain have also been deepening defense cooperation as they share concerns about the rise of China.\n\nIshiba and Starmer agreed to \"strongly promote\" more concrete bilateral cooperation in realizing a \"free and open\" Indo-Pacific, based on the view that the security of Asia is inseparable from that of Europe, according to the ministry.\n\nRelated coverage","summary":"RIO DE JANEIRO - Japan and Britain agreed Monday to launch a new framework for dialogue among their economic and fore...","url":"https://english.kyodonews.net/news/2024/11/f5e9da631736-update1-japan-britain-to-launch-ministerial-dialogue-on-economic-security.html","image":"https://img.kyodonews.net/english/public/images/posts/0562c001fed4cbf43023e15be7539d4b/cropped_image_l.jpg","video":null,"publish_date":"2024-11-19 00:53:31","author":null,"language":"en","category":"business","source_country":"jp","sentiment":0.29},{"id":265656426,"title":"Donald Trump meets with members of the House of Representatives at the Capitol: ‘Isn’t Winning Great?’","text":"“When you can get used to one, you can get used to anything,” he said.\n\nTrump went on to add that Republicans’ success in purple states and momentum in blue-leaning states last Tuesday has Democrats rattled.\n\n“It’s got them very worried because they say, well, next time if we go up even a fraction of what we went up, you’re going to win New York, you’re going to win New Jersey, you’re going to win places that weren’t winnable,” he added.\n\nShortly after these remarks, media members were removed from the conference room for the remainder of the closed-door meeting, per C-SPAN’s video.","summary":"WASHINGTON, DC–President-elect Donald Trump met with House Republicans on Capitol Hill Wednesday&#8230;","url":"https://internewscast.com/news/donald-trump-meets-with-members-of-the-house-of-representatives-at-the-capitol-isnt-winning-great/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Donald-Trump-Meets-with-House-Republicans-on.jpg","video":null,"publish_date":"2024-11-19 00:52:23","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.406},{"id":265655870,"title":"Trump will declare a national emergency exists in order to use military for deportations","text":"Skip to content\n\nAll Sections\n\n \n Subscribe Now \n \n\n Monday, November 18th 2024 \n\nE-Edition \n \n\n \n Home Page\n\nCrime & Public Safety\n\nYour Tax Dollars At Work\n\nMassachusetts\n\nBest Reviews\n\nReal Estate\n\nLetters to the Editor\n\nSubmit a Letter\n\nBoston Red Sox\n\nNew England Patriots\n\nBoston Celtics\n\nBoston Bruins\n\nCollege Sports\n\nHigh School Sports\n\nDonald Trump\n\nElection 2024\n\nState House\n\nBoston City Hall\n\nEntertainment\n\nEntertainment\n\nTV and Streaming\n\nMusic and Concerts\n\nFun & Games\n\nSpecial Sections\n\nRestaurants Food & Drink\n\nBoston Herald Store\n\nNews Obituaries\n\nPlace an Obituary\n\nClose Menu \n\nSign up for email newsletters\n\n Sign Up\n\nPolitics | \n\n Trump will declare a national emergency exists… \n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\n Account Settings\n Contact Us\n Log Out\n\n Spoof a user\n\nSign up for email newsletters\n\n Sign Up\n\n Monday, November 18th 2024 \n\nE-Edition \n \n\nPolitics \n\nDonald Trump\n\nState House\n\nBoston City Hall\n\n Trending: \n\nPolitics | \n\n Carrot recall \n\nPolitics | \n\n Teachers strikes \n\nPolitics | \n\n Spirit Airlines \n\nPolitics | \n\n Seth Moulton \n\nPolitics | \n\n Rams vs. Patriots \n\nBreaking News\n \n\nPolitics | \n\n Katherine Clark’s daughter, Riley Dowell, arrested at chaotic anti-abortion Boston march \n\nNovember 18, 2024 at 6:05 pm \n\nSubscriber Exclusive\n\nPolitics | \n\n Trump will declare a national emergency exists in order to use military for deportations \n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\n President-elect Donald Trump speaks during a meeting with the House GOP conference last week in Washington. (Allison Robbert/Pool via AP, File) \n\nBy Matthew Medsger | mmedsger@bostonherald.com | Boston Herald\nUPDATED: November 18, 2024 at 7:48 PM EST\n\nPresident-elect Donald Trump is confirming his intention to declare a national emergency as pretext for using the military in his plans to round up and deport more than 10 million people currently residing in the U.S.Trump’s intention was first proclaimed in response to “good news” shared by Judicial Watch’s Tom Fitton, who said that the […]\n\n Subscribe to continue reading this article.\n\n Already subscribed? To login in, click here.\n\nOriginally Published: November 18, 2024 at 7:45 PM EST\n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\nMost Popular\nMost Popular\n\nDear Abby: Sponging Samantha a wedge in parents’ marriage\nDear Abby: Sponging Samantha a wedge in parents' marriage\n\nDear Abby: It’s time to kick spoiled Kiki to the curb\nDear Abby: It's time to kick spoiled Kiki to the curb\n\n9 people arrested after Boston anti-abortion ‘Men’s March’ draws counter-protest, police say\n9 people arrested after Boston anti-abortion ‘Men’s March’ draws counter-protest, police say\n\nTakeaways from Patriots’ 28-22 loss to Rams as Drake Maye pick thwarts comeback attempt\nTakeaways from Patriots' 28-22 loss to Rams as Drake Maye pick thwarts comeback attempt\n\nHowie Carr: Tom Brady the GOAT vs Tom Brady the Massachusetts hack’s hack\nHowie Carr: Tom Brady the GOAT vs Tom Brady the Massachusetts hack's hack\n\nBoston music school cancels ex-transgender college student’s awareness presentation\nBoston music school cancels ex-transgender college student's awareness presentation\n\nMayor Wu on Trump’s mass deportations: Boston ‘not cooperating’ with efforts that threaten residents’ safety\nMayor Wu on Trump's mass deportations: Boston 'not cooperating' with efforts that threaten residents' safety\n\nNFL Notes: The untold secret behind the Patriots’ Super Bowl LIII win over the Rams\nNFL Notes: The untold secret behind the Patriots' Super Bowl LIII win over the Rams\n\nPhil Markoff’s former fiancee ‘moving on’\nPhil Markoff’s former fiancee ‘moving on’\n\nCallahan: Jerod Mayo’s lack of adjustments was glaring in Patriots’ loss to Rams\nCallahan: Jerod Mayo's lack of adjustments was glaring in Patriots' loss to Rams\n\nTrending Nationally\n\nOne dead, 15 hospitalized in new multi-state E. coli outbreak linked to organic carrots\nFlorida school district removes church signs amid complaints from Satan-related group\nBoston mayor on Trump’s mass deportations: City ‘not cooperating’ with efforts that threaten residents’ safety\n‘I was flabbergasted’: One of America’s oldest quilts, from 1769, found in Clay County, Minn.\nTrump immigration policy: Will Southern California’s undocumented community face deportation?\n\n More in Politics \n\nPolitics | \n\n Biden decision to allow Ukraine more widespread use of U.S. weapons a ‘game changer’ \n\nSubscriber Exclusive\n\nNational Politics | \n\n Trump says he is naming former Wisconsin Rep. Sean Duffy to be transportation secretary \n\nPolitics | \n\n Katherine Clark’s daughter, Riley Dowell, arrested at chaotic anti-abortion Boston march \n\nNational Politics | \n\n Pennsylvania’s high court orders counties not to count disputed ballots in US Senate race \n\nSign Up For Newsletters\n\nSend a News Tip\n\nBoston Herald Store/Back Copies\n\nWork With Us\n\nLegal Notices\n\nPrivacy Policy\n\nAccessibility\n\nClassifieds\n\nSpecial Sections\n\nFun & Games\n\nBusiness Directory\n\nNetwork Advertising\n\nAdtaxi Solutions\n\n Subscribe Now \n\nTerms of Use\n\nCookie Policy\n\nCookie Preferences\n\nCalifornia Notice at Collection\n\nNotice of Financial Incentive\n\nDo Not Sell/Share My Personal Informatio\n\nArbitration\n\nPowered by WordPress.com VIP\n\nCopyright © 2024 MediaNews Group","summary":"President-elect Donald Trump is confirming his intention to declare a national emergency as pretext for using the military in his plans to round up and deport more than 10 million people currently residing in the U.S. Trump’s intention was first proclaimed in response to “good news&#8221; shared by Judicial Watch’s Tom Fitton, who said that [&#8230;]","url":"https://www.bostonherald.com/2024/11/18/trump-will-declare-a-national-emergency-exists-in-order-to-use-military-for-deportations/","image":"https://www.bostonherald.com/wp-content/uploads/2024/11/AP24323605348624.jpg?w=1024&h=683","video":null,"publish_date":"2024-11-19 00:45:30","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","category":"politics","source_country":"us","sentiment":0.056},{"id":265657224,"title":"Why Democrats are losing tomorrow’s elections today","text":"America is outgrowing the Democratic Party.\n\nThat’s not a partisan claim; it’s demographic reality.\n\nBlue states are shedding population and will have less representation in Congress and fewer votes in the Electoral College after the next census. \n\nTwo nonpartisan nonprofits, the Brennan Center for Justice and the American Redistricting Project, crunched the numbers last year and came to conclusions that ought to shock Democrats into changing the way they govern places like California and New York.\n\nStates that voted for Kamala Harris this year are set to lose 12 seats in the House of Representatives, and an equal number of presidential electors, after 2030, according to the two groups’ extrapolations from Census Bureau data.\n\nCalifornia is on track to lose four congressmen and electoral votes. \n\nNew York will lose three, Illinois two, while Oregon, Minnesota and Rhode Island are each going to be down one.\n\nSolidly Republican states will get most of the gains, with Texas picking up four congressional seats and electoral votes, Florida acquiring three, and Idaho, Utah and Tennessee each adding one.\n\nThis year’s battleground states – all of which Donald Trump won – on balance come out slightly ahead of where they are now in the post-2030 projections: Arizona and North Carolina will be up one congressman and electoral vote, and Pennsylvania down one.\n\nIn an era when control of Congress depends on razor-thin and sometimes single-digit margins, the net loss of 12 seats from reliably Democratic states, and Republican states’ gains, will give the GOP an edge in the House, even if redistricting removes some red congressional seats in blue states and adds some blue seats in red states.\n\nAt the presidential level, the effect is like flipping a midsize deep-blue state to the GOP: The 12 Electoral College votes Democratic states are losing equal the Electoral College representation of Washington state today.\n\nThese are much more dramatic shifts than the 2020 Census brought about; its net result was only a slight gain for Republican states.\n\nWhy does 2030 look so much worse for Democrats?\n\nGovernors like California’s Gavin Newsom and New York’s Kathy Hochul (and Andrew Cuomo before her) bear the blame. \n\nThis decade began with blue states under strict COVID lockdowns, while Republican strongholds like Texas and Florida were open.\n\nThose big GOP states were already easier places to start a family or business, and they handled the COVID crisis better, coming out of it with stronger economies and presenting a more attractive picture to Americans looking to migrate within the country.\n\nNewsom, Hochul and Illinois’ J.B. Pritzker simply aren’t competitive with Republican governors like Florida’s Ron DeSantis or Texas’ Greg Abbott when it comes to making their states desirable destinations for ordinary homebuyers or employers in search of a business-friendly environment.\n\nRegulatory red tape and vertiginous housing costs are driving middle-class Americans out of the biggest blue states.\n\nIf anything, the forecast for 2030 is an early warning: Unless Democrats get the cost of living under control, their biggest states will see their population plunge in the next 25 years.\n\nDemographers at Cornell University’s Brooks School of Public Policy estimate New York State could lose 2 million people, 13% of the present headcount, by 2050. \n\n“Conservative estimates suggest a population decrease of 1 million by 2050, but we think an even greater decline is more likely,” Jan Vink, lead analyst of Brooks School’s Program on Applied Demographics, told the Cornell Chronicle.\n\nHigh rates of foreign immigration to blue states, which were generous about offering public benefits to newcomers, kept population numbers up even as birth rates fell and the sting of bad policies grew sharper.\n\nBut by voting for Trump, Americans also voted for less immigration, and now California, Illinois and New York will have to entice residents from other states to relocate if these big blues hope to hold on to their national political clout. \n\nIn the long run, governors and state governments are the key to Congress and the White House. \n\nIt’s not only Trump who defeated Harris this month – GOP governors have been beating their Democratic counterparts for years and turning the country red, slowly then quickly.\n\nThe 2028 presidential election will be the last one fought on the present electoral map.\n\nBut the elections of the 2030s are already taking shape, and several governors who aspire to the party’s nomination in ’28, such as Newsom, are only making the next decade’s fights for the House and White House much harder for Democrats to win. \n\nAs the sun sets on Joe Biden and Kamala Harris, it’s premature for Democrats to think about the next presidential election until they rethink the kind of governors they elect in the largest, yet shrinking, blue states.","summary":"'California is on track to lose four congressmen and electoral votes'","url":"https://www.wnd.com/2024/11/why-democrats-are-losing-tomorrows-elections-today/","image":"https://www.wnd.com/wp-content/uploads/2024/11/electoral-map-counties-2024-presidemntial-race-donald-trump-victory.jpg","video":null,"publish_date":"2024-11-19 00:43:06","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.11},{"id":265655430,"title":"Keir Starmer risks an early rift with Donald Trump after PM calls for 'respectful' UK-China relations as he becomes first PM to meet Xi Jinping since 2018 at G20 summit","text":"Keir Starmer risks an early rift with Donald Trump after PM calls for 'respectful' UK-China relations as he becomes first PM to meet Xi Jinping since 2018 at G20 summit\n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nBy JASON GROVES and HARRIET LINE\n\nPublished: 00:41 GMT, 19 November 2024 | Updated: 00:41 GMT, 19 November 2024\n\nChina’s communist president yesterday praised Labour’s plans for the economy as Sir Keir Starmer pushed for a new ‘respectful’ relationship with Beijing.\n\nIn an extraordinary thawing of relations, Xi Jinping borrowed Labour’s favourite slogan to praise Sir Keir for working to ‘fix the foundations’ of the economy.\n\nPresident Xi welcomed the Prime Minister’s bid to soften Britain’s stance, saying there was now a chance to ‘break new ground in UK-China relations’.\n\nHis intervention came as Sir Keir brushed aside complaints he is ‘kowtowing’ to the communist superpower by becoming the first British PM to meet President Xi in more than six years.\n\nThe two men met amid tight security on the fringes of the G20 summit in Rio de Janeiro.\n\nSignalling a major reset, the PM immediately suggested a further summit in Beijing or London to discuss rebuilding a relationship shattered by China’s crackdown in Hong Kong and vicious human rights abuses against the Uygher people in Xinxiang.\n\nHe said Chancellor Rachel Reeves would hold talks with China’s vice-president next year in a bid to boost trade.\n\nAnd he opened the door to a new wave of Chinese investment, which went into reverse under the last government because of fears about China’s hostile intentions towards the UK.\n\nSir Keir Starmer pushed for a new 'respectful' relationship with China during a bilateral meeting with Xi Jinping at the G20 summit\n\nWelcoming the Prime Minister's stance, President Xi said it was an opportunity to 'break new ground in UK-China relations’\n\nSir Keir was the first British PM to meet Xi in more than six years, when the Chinese president met Theresa May\n\nHowever, there were tensions over human rights, with Western journalists bundled out of the room by Chinese security staff when Sir Keir raised the case of jailed British Hong Kong activist Jimmy Lai.\n\nSpeaking as the two men met in Rio, the PM said: ‘We want our relations to be consistent, durable, respectful, and as we have agreed, avoid surprises where possible.\n\n‘A strong UK-China relationship is important for both of our countries and for the broader international community.’\n\nSir Keir said Britain would be a ‘predictable, consistent, sovereign actor committed to the rule of law’.\n\nHe raised human rights and asked president Xi to lift sanctions on seven British parliamentarians.\n\nBut he has faced criticism at home for costing up to China’s communist leader, whose regime was deemed hostile to Britain by the last government.\n\nShadow foreign secretary Priti Patel branded China ‘malign’ state, and urged the PM not to soften the UK’s stance on issues like human rights.\n\n‘Britain’s standing on the world stage risks being weakened if the Prime Minister does not robustly defend our national interest,’ she said.\n\n‘In this uncertain world, we need leaders who are clear about defending this country’s national interest, and who are not afraid to stand up against China’s malign influence with confidence and authority. Starmer must set out, as part of his supposed reset, what assurances he received from president Xi on the UK’s areas of concern.’\n\nThe PM also risks an early rift with Donald Trump who has signalled a much tougher stance on China, including in trade where he has proposed 60 per cent tariffs on all imports.\n\nSir Ian Duncan Smith, who is among those sanctioned by China, told the Mail: ‘I don’t know what the hell Starmer thinks he looked like at that meeting.\n\n‘They bundled the journalists out as soon as they talked about human rights and Jimmy Lai.\n\n‘So what does Starmer do? Does he say ‘I think the journalists should stay in?’. No, he carries on.\n\n‘We look so weak, don’t we? Am I alone at looking at this and thinking, “Whatever happened to this country?”.’\n\nTory grandee Sir Iain Duncan Smith said that Britain looked 'weak' following the PM's talks with Xi Jinping\n\nThe PM also risks an early rift with Donald Trump who has signalled a much tougher stance on China, particularly on trade\n\nSir Iain added: ‘They are so desperate for growth, this government, that they will do anything to get it, because they are in real trouble at the moment and the prospects are no growth...\n\n‘We’ll never do a trade deal with America if he goes down this road - this basically shuts off any trade deal with America’.\n\nA group of MPs and their allies across the world are today calling for Hong Kong businessman and British national Jimmy Lai to be released unconditionally and immediately from prison as his trial recommences.\n\nPro-democracy supporter Mr Lai was jailed in late 2020 in Hong Kong, and is currently being held in solitary confinement after being accused of violating the territory’s new national security law.\n\nMr Lai, who founded the now defunct Apple Daily newspaper, has pleaded not guilty to charges of collusion with foreign forces and sedition, and faces life behind bars if convicted.\n\nAs the 76-year-old’s trial is set to recommence in Hong Kong, 105 politicians from 24 countries – including 23 MPs and seven peers – have joined forces to call for the court proceedings to cease and for Mr Lai’s immediate release.\n\nA joint statement co-ordinated by Alicia Kearns, a shadow Foreign Office minister, warns Mr Lai’s health is ‘deteriorating’ and describes his trial as being ‘tainted with unfairness’.\n\nXi JinpingBeijingLabourChinaHong Kong\n\nShare or comment on this article:\nKeir Starmer risks an early rift with Donald Trump after PM calls for 'respectful' UK-China relations as he becomes first PM to meet Xi Jinping since 2018 at G20 summit\n\nAdd comment","summary":"In an extraordinary thawing of relations, Xi Jinping borrowed Labour's favourite slogan to praise Sir Keir for working to 'fix the foundations' of the economy and welcomed the PM's softer stance.","url":"https://www.dailymail.co.uk/news/article-14098817/Keir-Starmer-Donald-Trump-UK-China-relations-Xi-Jinping-G20-summit.html","image":"https://i.dailymail.co.uk/1s/2024/11/19/00/92218239-0-image-m-105_1731976432717.jpg","video":null,"publish_date":"2024-11-19 00:41:43","author":"Editor,Harriet Line,Jason Groves","authors":["Editor","Harriet Line","Jason Groves"],"language":"en","category":"politics","source_country":"gb","sentiment":0.181},{"id":265657976,"title":"India’s ICBM: Surya or Agni","text":"INDIA has been developing a diverse range of missile systems, including Intercontinental Ballistic Missiles (ICBMs), submarine-launched ballistic missiles and hypersonic cruise missiles capable of delivering nuclear warheads. This development and deployment exacerbate the security dilemmas of neighbouring states. Moreover, these advancements alarm major powers, as New Delhi seeks to safeguard its strategic autonomy in international geopolitics. Its balancing efforts recently prompted the US State and Treasury Departments to impose sanctions on 19 Indian companies and two Indian nationals for “enabling Russia’s prosecution of its illegal war.\n\nDuring the last two decades, the Indo-US strategic partnership systemically evolved into the Indo-US threshold alliance. Despite increasing multidimensional cooperation, the Americans did not object to India’s military purchases, including S-400 missiles from Russia. Indian companies and Russian state-owned enterprises have been cooperating for a long time. Therefore, the recent sanctions against the Indian companies seem strange, especially when elected President Donald Trump’s cohorts are publicizing the continuity of the Indo-Pacific strategy.\n\nTrump administration 2.0’s hardened approach against China would be one of the few policy areas that continue from Biden to Trump. Hence, the minilateral security group—Australia, India, Japan and the United States (Quad)—could be further energized. The Americans are supposed to strengthen Quad. However, the sanctions against the Indian companies could discourage India from playing a proactive role as a staunch ally of the US to contain China in the Asia-Pacific region. Though the sanctions could be quashed sooner, India is not allowed to be a free-lancer or an autonomous actor in the global strategic environment.\n\nThe US does not desire India to acquire a military capability that could undermine Western nations or its heartland security. Therefore, the American strategic community closely monitors India and may discourage its pursuit of the Intercontinental Ballistic Missile (ICBM) potential. On October 3, 2003, the then US Secretary of State, Colin Powell, while responding to the Washington Post’s reporter question regarding India-US space cooperation, said: “We also have to protect certain red lines that we have concerning proliferation because its sometimes hard to separate within space launch activities and industries and nuclear programs and that which could go to weapons and that which could be solely for peaceful purposes.” Nevertheless, after two years, the Bush administration agreed to build closer cooperation with India in space exploration, satellite navigation and launch.\n\nThe Indo-US close cooperation in space indirectly assisted India’s ICBM project. The critical elements of ICBM—hardware and technology—were obtained from India’s gigantic Polar Space Launch Vehicle (PSLV) purchased from the US in the 1960s. The review of literature published by Western and Indian scholars reveals that the Surya-ICBM project systematically evolved. The Surya is a three-stage ICBM missile with the first two Surya stages derived from PSLV’s solid-fuel rockets and the third Surya stage uses a Russian-supplied cryogenic upper stage for the Geosynchronous Space Launch Vehicle (GSLV).\n\nRecently, the Indian Defense Research and Development Organization (DRDO) categorically denied the existence of the Surya-Intercontinental Ballistic Missile (ICBM) project. On November 10, 2024, India’s Defence Research Wing website published an article titled: “Pakistani Analyst Claims India’s Surya ICBM Could Concern Washington, Europe and Russia.”. According to the article, “India has consistently denied the existence of any Surya ICBM project. Past statements from DRDO officials have clarified that India is focused on enhancing its defence capabilities within its strategic requirements with no public confirmation of plans to develop ICBM that extends beyond the reach of its current Agni series. The Surya missile concept is believed to have originated from speculative reports and discussions within circles but has not been substantiated by any official Indian government source.” It also reconfirmed the continuity of India’s no-first-use (NFU) policy.\n\nThe determinants of the recent denial of the existence of the Surya project could be five: first, the indirect pressure of the United States (fear of sanctions). It has little impact on India’s ambitious missile programme. Second, there is a technological failure (adoption of PSLV and GSLV). Third, Surya’s size and weight make it difficult to conceal its launch site, which likely makes it vulnerable to attack before launch. Fourth, its vulnerability makes it more useful for first-strike weapons, which is contrary to India’s declaratory NFU policy. Fifthly, India’s Agni project has steadily advanced, which has provided India the option to shelve the Surya project and advance Agni into ICBM.\n\nThe Agni-V is a solid propellant three-stage missile with a range of 5000-8000 kilometres, and the Agni-VI is a solid propellant three-stage missile with a range of 8000-10,000 kilometres. On March 11, 2024, India successfully conducted a test of multiple independently targetable re-entry vehicle (MIRV) technology on Agni-V. The Agni-VI can reach Western nations and the Agni-VI can reach the United States. Thus, the Agni ICBM brought far-flung targets, including the United States and entire Western Europe, into the range of India’s nuclear arsenal.\n\n—The writer is Prof at the School of Politics and IR, Quaid-i-Azam University.\n\n([email protected])","summary":"&#160; INDIA has been developing a diverse range of missile systems, including Intercontinental Ballistic Missiles (ICBMs), submarine-launched ballistic missiles and…","url":"https://pakobserver.net/indias-icbm-surya-or-agni/","image":"https://pakobserver.net/wp-content/uploads/2024/04/Prof-Jaspal.webp","video":null,"publish_date":"2024-11-19 00:41:02","author":"Dr Zafar Nawaz Jaspal","authors":["Dr Zafar Nawaz Jaspal"],"language":"en","category":"business","source_country":"pk","sentiment":-0.088},{"id":265656576,"title":"Trump standing by Hegseth amid sexual assault allegations","text":"Trump standing by Hegseth amid sexual assault allegations\n President-elect Donald Trump is standing by Pete Hegseth, his selection for secretary of defense. The former Fox News host's lawyer says Hegseth paid a confidential financial settlement to a woman who accused him of sexual assault to save his job at the news channel. The army veteran has denied any wrongdoing. CBS News political reporter Olivia Rinaldi joins \"America Decides\" with more.","summary":"President-elect Donald Trump is standing by Pete Hegseth, his selection for secretary of defense. The former Fox News host's lawyer says Hegseth paid a confidential financial settlement to a woman who accused him of sexual assault to save his job at the news channel. The army veteran has denied any wrongdoing. CBS News political reporter Olivia Rinaldi joins \"America Decides\" with more.","url":"https://www.cbsnews.com/video/trump-standing-by-hegseth-amid-sexual-assault-allegations/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/19/d2fbf55c-7fa3-4aa8-a247-5dbde827f922/thumbnail/1200x630/f2f7654c2cffe411126c81988417d22c/cbsn-fusion-trump-standing-by-hegseth-amid-sexual-assault-allegations-thumbnail.jpg?v=6125856b135c6847bbc622c9704","video":null,"publish_date":"2024-11-19 00:39:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.368},{"id":265654886,"title":"Jeremy Clarkson to defy doctors' orders and lead thousands of farmers from Diddly Squat as they descend on Westminster to protest against Labour's 'death' inheritance tax raid","text":"Jeremy Clarkson is expected to defy doctors' orders and lead thousands of farmers from Diddly Squat and descend on Westminster to protest against the inheritance tax raid.\n\nFarmers gathering for today's mass protest in London warned that 'things will get bad very fast' if the government refuses to scrap plans for inheritance tax on farms.\n\nThousands are set to descend on Westminster to vent their anger over what has been called the 'family farm death tax' introduced in last month's Budget.\n\nFuming Clarkson, 64, is currently recovering from a life-saving heart operation and was ordered not to go on the march by his doctors and to 'avoid stress'.\n\nDespite this he - joined by co-star Kaleb Cooper - will lead 'two coaches of farmers' from Diddly Squat to demonstrate on the 'hugely important issue'.\n\nNational Farmers' Union (NFU) leader Tom Bradshaw will tell his members they have been 'stabbed in the back' by Labour - after the party had 'wooed the rural vote' in its election campaign.\n\nHis comments will follow an extraordinary intervention from tech billionaire Elon Musk, who last night accused Sir Keir Starmer's administration of 'going full Stalin' against British farmers.\n\nSir Keir Starmer has said that he understands changes to inheritance tax are 'causing concern' for farmers but insisted 'the vast majority of farms' will not be affected.\n\nSpeaking at the G20 summit in Brazil on Monday, he said: 'On the question inheritance tax, look I do understand that it's causing concern.\n\n'But if you take a typical case of a couple wanting to pass a family farm down to one of their children, which would be a very typical example, with all of the thresholds in place, that's £3 million before any inheritance tax is paid.'\n\n'And that's why I'm confident that the vast majority of farms and farmers will not be affected at all by that aspect of the budget.'\n\nClarkson told The Sun: 'I will be there', along with Charlie Ireland and Cooper.\n\nAfter being shown an opinion poll saying he is more trusted than the PM, the Chancellor and new Tory Leader Kemi Badenoch, he joked: 'I'd become an MP - but if I am paying inheritance tax I could not afford to take the pay cut.'\n\nProceedings are expected to begin with a 'Mass Lobby' by 1,800 members of the NFU at Church House. \n\nBut it will be followed by a protest rally from 11am which will see an estimated 10,000-20,000 independent farmers gathering in Whitehall to listen to speakers including broadcaster Jeremy Clarkson who has been outspoken on rural issues.\n\nThe protesters will later march to Parliament Square, symbolically led by children on toy tractors.\n\nThe protests come after tax changes announced in the budget mean from April 2026 farmers will have pay 20 per cent inheritance tax on farms worth more than £1million - although this rises to £3million if farmers take advantage of additional tax relief measures.\n\nAlthough the rate is half the 40 per cent rate paid by ordinary members of the public, farmers argue farms will have to be broken up or sold to pay death duties.\n\nOne of the protest rally's organisers, Clive Bailye ((CRCT)), founder of The Farming Forum website, warned of strikes, blockades and go-slows if ministers fail to pay attention to farmers' anger.\n\n'There's a lot of militancy in the farming community over this,' said Mr Bailye, a Staffordshire arable farmer.\n\n'If we don't get anything out of Tuesday's rally I can see things getting bad very fast.\n\n'If the next generation can't afford to continue with the farming way of life then they've got nothing to lose. That makes them very dangerous - farmers have got the ability to cause economic chaos.\n\n'We've seen how European farmers have managed to get their governments to change policy. Talk of a farmers' strike is really gathering momentum, and you could see blockades or go-slow protests.'\n\nHe added: 'If farmers tip away their own milk, they're the ones who lost out the most - but if they feel they're going to go out of business then they may go ahead anyway.\n\n'But we don't want to cause disruption to the public because at the moment they're on the side of farmers.'\n\nHe stressed campaigners were not demanding a full U-turn, but wanted to meet ministers to discuss how to avoid the predicted crippling impact on family-owned farms.\n\nMeanwhile, NFU president Mr Bradshaw will accuse the government today of betraying farmers - with the tax changes affecting some 68 per cent of farmers rather than a tiny minority.\n\nMr Bradshaw will say: 'I don't think I've ever seen the industry this angry, this disillusioned and this upset. And given what we've had to be angry about in recent years that's saying something.'\n\nHe will add: 'To launch a policy this destructive without speaking to anyone involved in farming beggars belief.\n\n'And let us remember that they promised not to do this when they were wooing the rural vote. It's not only been bungled in delivery, it's also nothing short of a stab in the back.'\n\nEnvironment Secretary Steve Reed inflamed farmers further yesterday by telling farmers to 'check the facts' before they protest.\n\nMr Reed said: 'I know change can cause uncertainty, but if farmers check the facts they'll see this change is fair and proportionate for everyone.'\n\nThe MP for Streatham and Croydon North added: 'Around 40 per cent of the value of this tax loophole has gone to just 7 per cent of landowners. It's become the most effective way for the super-rich to avoid paying their inheritance tax - and it's costing other taxpayers a whopping £200m a year.'\n\nGareth Wyn Jones, a Welsh farmer who has been leading calls for a strike, said he would stop supplying his sheep and cattle for a week from today.\n\nHe predicted shortages of bread, milk and eggs in the coming weeks if ministers don't agree to negotiations.\n\n'If Labour were supporting British agriculture then ministers wouldn't be having to make contingency plans.\n\nHe added: 'He [Keir Starmer] needs to be shown what happens if his Government bites the hand that feeds it.\n\n'We need to show the Government that if we're not going to listen, we will turn off the taps of food production.'\n\nPhil Vickery, a member of the 2003 England World Cup-winning rugby team and Cornish dairy farmer, said: 'Keir Starmer is destroying the future of our farmers and their families.'\n\nDowning Street has refused to be drawn into a row with Elon Musk over comments on X that Britain is 'going full Stalin' in its approach to farmers.\n\nThe businessman, who will advise Donald Trump's incoming US administration, shared a screenshot of a Guardian article titled 'Farmers have hoarded land for too long. Inheritance tax will bring new life to rural Britain'.\n\nThe billionaire's claim appears to refer to Soviet leader Joseph Stalin's forced collectivisation of once privately owned farms - leading to the starvation and death of millions.\n\nRachel Reeves defended the policy yesterday, saying it was a 'difficult decision' aimed at plugging funding gaps - and so that 'the wealthier estates and most valuable farms pay their fair share'. \n\nLast night there were fears far-right sympathisers would try and hijack the rally for their own ends - who the organisers said were not welcome.\n\nPaul Thorpe, a far-right YouTuber, published a video message urged his followers to join the protest, stating: 'I'll be there to support our farming community and I hope as many of you patriots will be there too.'\n\nMeanwhile eco-protesters Just Stop Oil hit back at recent claims by Jeremy Clarkson that 'It seems if you are from Just Stop Oil or protesting about Gaza you can do what you want' - pointing out there are currently 40 JSO and Palestine Action activists involved in street protests currently in jail.","summary":"Jeremy Clarkson is expected to defy doctors' orders and lead thousands of farmers from Diddly Squat and descend on Westminster to protest against the inheritance tax raid.","url":"https://www.dailymail.co.uk/news/article-14098353/Jeremy-Clarkson-defy-doctors-thousands-farmers-Diddly-Squat-Westminster-protest-Labours-inheritance-tax.html","image":"https://i.dailymail.co.uk/1s/2024/11/18/22/92213565-0-image-a-18_1731968245992.jpg","video":null,"publish_date":"2024-11-19 00:38:12","author":"Claire Ellicott,Colin Fernandez,Editor,James Tozer","authors":["Claire Ellicott","Colin Fernandez","Editor","James Tozer"],"language":"en","source_country":"gb","sentiment":-0.043},{"id":265657974,"title":"Complex reasons behind Kamala’s election loss","text":"KAMALA Harris’s recent election loss can be attributed to a variety of interconnected factors. While her late entrance into the race against Donald Trump may have been one consideration, it was the broader strategy or lack thereof that significantly impacted her campaign. From missed opportunities to address critical international issues to a strategic misalignment with key voter concerns, Harris’s candidacy faced substantial hurdles that her team was unable to overcome.\n\nOne of the primary challenges Harris encountered was her late entry into the election. This delay left limited time to establish a robust campaign strategy and cultivate meaningful connections with the American electorate. Unlike Trump, who had laid significant groundwork with a fervent base and clear agenda, Harris was still developing her platform. Her late start meant facing an uphill battle in gaining the traction necessary to challenge an opponent with years of consolidated support. Trump’s early involvement enabled him to present a cohesive narrative, resonating with voters familiar with his positions, while Harris struggled to establish comparable familiarity and rapport.\n\nHowever, more than the timing of her entry, Harris’s party appeared to adopt a cautious, perhaps overly restrained, approach on several pressing issues. Chief among these was the ongoing conflict and humanitarian crisis in Palestine and Lebanon. For decades, the United States has been closely aligned with Israel, a position garnering both domestic and international critique, especially as conflicts have intensified and images of suffering circulated widely on social media. In this age of instantaneous digital communication, the American public has access to a constant stream of updates, videos, and images capturing conflict realities. Social media has provided an unfiltered view of atrocities, sparking significant public discourse on human rights and the United States’ role in addressing these injustices.\n\nHarris’s silence, as well as that of her party, on the treatment of Palestinians and Lebanese civilians by Israeli forces did not go unnoticed by the American public. Historically, the Democratic Party has positioned itself as a champion of human rights, and its inability to unequivocally address these issues seemed incongruous with its stated values. Many voters, particularly younger and more progressive individuals, voiced disappointment with the party’s unwillingness to take a firm stance against what they perceived as human rights abuses. By remaining silent, Harris’s campaign missed an opportunity to rally support among those passionate about social justice and international humanitarian concerns. Her stance, or lack thereof, may have left voters feeling disillusioned with the party’s commitment to genuine human rights advocacy.\n\nAnother misstep was the overall strategic direction of Harris’s campaign. Rather than focusing on a few core issues that deeply resonated with the American public, her campaign often felt fragmented. Issues like the economy, healthcare, and domestic social justice movements undoubtedly remained central to her platform, yet there was a perceived lack of cohesion in how these policies were presented. In contrast, Trump’s campaign capitalized on a simpler, albeit more polarizing, message that was easily digestible and designed to activate his loyal base. Harris’s team, by contrast, struggled to crystallize a narrative that resonated as strongly, making it difficult for her to cut through the noise in an already crowded political landscape.\n\nMoreover, Harris’s party failed to fully grasp the powerful role social media plays in shaping public opinion. American citizens, known for their strong human rights convictions, are active participants in global discussions through social media. During the crises in Palestine and Lebanon, shared stories and images amplified public empathy and outrage, with many expecting Harris’s party to reflect these sentiments and provide clear solutions for international and domestic issues. The lack of an outspoken response left voters questioning her leadership’s sincerity and her party’s principles. Compounding this, Harris’s campaign struggled to counter Trump’s narrative effectively. His bold, often controversial statements garnered significant media coverage, shaping public perception and reaching a wide audience quickly. For many undecided voters, Trump’s directness, despite its divisiveness, offered clarity and strength, while Harris’s more cautious, inclusive approach missed opportunities to connect with those seeking decisive leadership in uncertain times.\n\nAnother dimension worth noting is the growing frustration among American voters with political establishments. Harris, as a prominent Democratic figure, was often seen as part of the political status quo that some Americans believe has failed to deliver tangible improvements to their daily lives. This perception was particularly strong among voters impacted by economic instability, rising costs of living, and concerns about national security. Trump, despite his own record, managed to tap into this sentiment by portraying himself as an outsider willing to challenge the “Washington elite.” This portrayal, though arguably inconsistent with his own history, resonated with many who felt that the traditional political system no longer represented their interests.Finally, the complexity of today’s media environment posed yet another obstacle. With so many avenues of information, from traditional media to independent online outlets and social media influencers, shaping public opinion has become an increasingly nuanced task. Harris’s campaign struggled to maintain control over its narrative, and as a result, her messages sometimes seemed to get lost amid competing voices. The rapid pace of information flow also meant that any missteps were swiftly amplified, leaving her campaign in a constant state of damage control rather than focusing on advancing a proactive vision for the nation.\n\nIn the end, Harris’s loss cannot be attributed to a single factor but rather a culmination of strategic missteps, delayed decisions, and an inability to connect with an electorate looking for authentic representation. Her campaign’s hesitance to address critical international and domestic issues, combined with a perceived disconnect from the prevailing sentiments of American voters, cost her the trust and support she needed to secure a victory. The election results reveal a complex narrative about the expectations of American voters, the importance of timely and authentic communication, and the pressing need for leaders who can adapt to the evolving dynamics of public opinion in a digital age.\n\n—The writer is contributing columnist, based in Islamabad.\n\n([email protected])","summary":"KAMALA Harris’s recent election loss can be attributed to a variety of interconnected factors. While her late entrance into the…","url":"https://pakobserver.net/complex-reasons-behind-kamalas-election-loss/","image":"https://pakobserver.net/wp-content/uploads/2024/07/muhammad.webp","video":null,"publish_date":"2024-11-19 00:36:35","author":"Muhammad Mohsin Iqbal","authors":["Muhammad Mohsin Iqbal"],"language":"en","category":"politics","source_country":"pk","sentiment":0.036},{"id":265655402,"title":"Will Shiba Inu Coin Reach 1 Cent By 2025? 47% Of Benzinga Readers Say…","text":"Meme coin Shiba Inu SHIB/USD is one of the cryptocurrencies that have traded higher since Donald Trump won the 2024 presidential election.\n\nThe cryptocurrency trades well off of all-time highs, but Benzinga readers think the coin could go higher over the next year.\n\nWhat Happened: Shiba Inu continues to see a high burn rate, an event that can increase the price of the cryptocurrency with a lower supply available.\n\nWhile Bitcoin BTC/USD hit new all-time highs and continues to trade higher after the 2024 election, Shiba Inu lost momentum. The cryptocurrency, which is the 11th largest by market capitalization, is down 10.5% over the past seven days with a current trading price of $0.00002457.\n\n\"Do you think Shiba Inu can reach one cent by the end of 2025,\" Benzinga recently asked readers.\n\nThe results were:\n\nThe Benzinga poll was nearly evenly split with 47% of readers saying they think Shiba Inu could hit one cent by the end of 2025.\n\nGiven the coin's low price currently, a move to one cent would drastically increase the valuation of the coin and is not likely without some increased burning to the supply.\n\nFor context, a $1 investment today could buy 40.700.04 SHIB. If Shiba Inu coin hit one cent, the $1 investment would turn into $407 and be up 40,600%.\n\nRead Also: Bitcoin To $100K? Benzinga Readers Predict If BTC Can Hit New Milestone Before End Of 2024\n\nWhy It's Important: Shiba Inu launched as a similarly themed cryptocurrency to Dogecoin DOGE/USD in August 2020. The coin leveraged the Ethereum network and created a decentralized exchange called ShibaSwap, which includes other tokens like BONE and LEASH.\n\nShiba hit an all-time high of $0.00008845 in October 2021. The coin was helped by the inclusion on several major cryptocurrency platforms like Coinbase, Kraken and Robinhood in 2021 and 2022.\n\nPrior to then, it was harder for investors to buy Shiba Inu.\n\nIn September, Shiba Inu coin had a rally on news that a stablecoin called SHI could be launching. The launch of a stablecoin and the increasing burn rate of SHIB could point to increased attention on the meme coin in the coming months.\n\nAnother recent Benzinga poll didn't have the same optimism for Shiba Inu coin compared to some other cryptocurrencies. Shiba Inu was picked last of the coins Bitcoin, Ethereum, Dogecoin, Shiba Inu and Pepe coin for which cryptocurrency would have the best return between now and the end of 2025.\n\nBitcoin won that poll with 40%, followed closely by Dogecoin at 36%. Shiba Inu coin ranked last at 7%.\n\nDogecoin To 69 Cents Or $1? Benzinga Readers Predict How High It Could Fly By End Of 2024\n\nThe study was conducted by Benzinga from Nov. 11 through Nov. 12, 2024, and included the responses of a diverse population of adults 18 or older. Opting into the survey was completely voluntary, with no incentives offered to potential respondents. The study reflects results from 47 adults.\n\nMeme coins are among the topics to be explored at Benzinga's upcoming Future of Digital Assets event on Nov. 19.\n\nPhoto: Shutterstock\n\nMarket News and Data brought to you by Benzinga APIs\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","summary":"Meme coin Shiba Inu (CRYPTO: SHIB) is one of the cryptocurrencies that have traded higher since Donald Trump won the 2024 presiden\n\n\nread more","url":"https://www.benzinga.com/markets/cryptocurrency/24/11/42052184/will-shiba-inu-coin-reach-1-cent-by-2025-47-of-benzinga-readers-say","image":"https://cdn.benzinga.com/files/images/story/2024/11/18/Shiba-Inu-shib-Editorial--Illustrative-P.jpeg?width=1200&height=800&fit=crop","video":null,"publish_date":"2024-11-19 00:35:18","author":"Chris Katje","authors":["Chris Katje"],"language":"en","source_country":"us","sentiment":-0.376},{"id":265657580,"title":"US House Ethics panel to meet amid calls for report on Trump AG pick Matt Gaetz","text":"The U.S. House of Representatives Ethics Committee is expected to discuss next steps on Wednesday in its investigation into President-elect Donald Trump's attorney general pick Matt Gaetz, two sources with knowledge of the panel's plans said. The sources were granted anonymity to discuss the bipartisan panel's inner workings. A growing number of Trump's fellow Republicans in the U.S. Senate, which has a constitutional duty to confirm or reject high-level presidential appointments, have called on the House panel to turn over its findings on allegations of sexual misconduct involving a teenager and drug use by Gaetz. It is uncertain whether the probe will continue because Gaetz, 42, resigned his seat in the Republican-controlled House on Wednesday, hours after Trump unveiled his choice of the lawmaker and as the probe was nearing completion. Gaetz denies any wrongdoing. An attorney who said he represented two women who testified to the committee told ABC News on Monday that Gaetz had paid his clients, who were adults, for sex and that one of his clients witnessed Gaetz having sex with a 17-year-old girl. She testified (that) in July of 2017, at this house party, she was walking out to the pool area, and she looked to her right, and she saw Rep. Gaetz having sex with her friend, who was 17, ABC quoted the attorney, Joel Leppard, as saying. The Department of Justice, which the attorney general leads, investigated Gaetz for nearly three years over sex trafficking allegations involving the teenager. Gaetz's office said in 2023 that prosecutors had told him he would not face charges. A Gaetz spokesperson referred a request for comment to a spokesman for Trump's transition office, who dismissed Leppard's claim. These are baseless allegations intended to derail the second Trump administration, said the spokesman, Alex Pfeiffer, in an email. Leppard did not immediately respond to a request for comment. SENATORS WANT TO SEE REPORT Gaetz is one of several Cabinet nominees tapped by Trump last week who lack the resumes normally seen in candidates for high-level administration jobs. Republican U.S. Senator Markwayne Mullin on Sunday told NBC's Meet the Press that the panel should share its report with the Senate. The Senate should have access to that, Mullin said. Should it be released to the public or not? That I guess will be part of the negotiations. Republican House Speaker Mike Johnson has said he believes the report should not be made public, as Gaetz is no longer a House member. Trump himself faced a pair of federal prosecutions since leaving office in 2021, one for his efforts to overturn his 2020 election defeat and one for mishandling classified documents after leaving office. He has denied wrongdoing, described those prosecutions and two others he faced as politically motivated and vowed to use the Justice Department to go after political enemies when he returns to power on Jan. 20.","summary":"The US House Ethics Committee will discuss the investigation into Matt Gaetz. Gaetz is Trump's pick for attorney general.  Senators want to see the House panel's findings on Gaetz. Gaetz faces allegations of sexual misconduct and drug use. He resigned from the House. Gaetz denies the allegations. He says the allegations are intended to derail the second Trump administration.","url":"https://economictimes.indiatimes.com/news/international/world-news/us-house-ethics-panel-to-meet-amid-calls-for-report-on-trump-ag-pick-matt-gaetz/articleshow/115432235.cms","image":"https://img.etimg.com/thumb/msid-115432240,resizemode-4,width-1200,height-900,imgsize-28146,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-11-19 00:34:47","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.247},{"id":265657218,"title":"The 4-year anti-Trump fantasy cruise","text":"Attention to all you woke election snowflakes. Stop sucking your thumb for a few minutes because I have some hopeful news for you. If four years of living under the new Hitler and his deplorable supporters adds to your groaning and whining soul, there is a way you can avoid that anticipated hell on earth.\n\nYou can move to Canada – but under Justin Trudeau, lots of luck. Fidelito is not good at anything but euthanasia. But if that’s your quest post election, go for it. For you who need to escape from the claws of Trump and Canada is not your way out, there’s a luxury liner company that’s offering a four year cruise around the world to avoid the rule of Donald Adolf Trump. Then when Gavin Newscum (as Trump call him) beats J.D. Vance in four years, the Trump haters can return to America and the inauguration of the New World Order. That’s when America will really be Made Great Again – right, Whoopi?\n\nSo what can one expect for a cruise price tag of about $300,000? There will be many stops along the way at destinations of great interest, I’m sure. My vast research team has come back with a report of the onboard entertainment guests can expect. Much of it will be reliving the glory days of the Biden presidency – and who wouldn’t want to relive those many glorious moments?\n\nMonday morning, on the Good Ship Lollypop, the revelers will get to celebrate one of the greatest moments in presidential history, according to the delusional left. This video will produce a thrill down the legs of every cruise passenger. It occurred in Atlanta, the debate sight where Joe Biden went against Donald Trump.\n\nIf you’ll recall, after the debate ended, Dr. Jill took some time off from treating her constituents to congratulate Joe for “answering all the questions,” and she added, “you knew all the facts.”\n\nI can imagine the ship Villa Vie Odyssey will be rocking and rolling after that video plays. “Four more years” will ring out through the halls.\n\nThis will be the inauguration of the joy and love that will be poured out all over the cruise ship every day.\n\nAnother special moment in the first week of the Voyage to Cherish will be a video showing Kamala Momala smiling during her visit to the border. That will bring back her greatest moment as border czar when she greeted a border guard and then told an illegal immigrant trying to sneak into the United States, “Oh, no you don’t. You turn around and come in the legal way. President Biden is a leader who holds the Constitution of the United States in the highest regard.\n\n“As Secretary Mayorkas says, ‘The border is secure,’ so you turn right around. That is a direct order from me, the border czar.” And then Kamala wakes up from her dream, with a cackle.\n\nThe Wednesday breakfast will feature Kamala’s visit to the TV show “The View.” You will see the segment where she responds to Sonny Hostin’s question about doing anything different as president than Joe Biden. Being eternally loyal to her president, Harris said she could not think of one thing. What magnificence she continued to display; because, unlike her boss, we all know she’s not a hair sniffer.\n\nThursday morning breakfast will be highlighted by the video of Drew Barrymore telling Kamala that “the whole world needs a hug but, in our country, we need you to be Momala of the country.” I mean, that moment made TV history. There will not be a dry eye on board the Odyssey as it sails the blue waters of joy.\n\nFriday morning’s program will remind those on board what a regular gal our Kamala is. The presentation will once again remind America what a great joy she could be as our veep shares a beer with “The Late Show” host Stephen Colbert. That will be followed by the video of Sen. Liz Warren drinking a beer with her husband, showing the world what wonderfully regular people Democrat babes are.\n\nAnd what better way to end the week than with a video recapping the moment when joy entered the convention arena in Chicago last summer, highlighted by the new masculinity of Tim Walz’s flaming-hands entrance. The crowd erupted with joy never seen before in American politics.\n\nAnd this is all scheduled for the first week! One can only imagine the joy will reign when the great moments of the convention are relived as well as the clip when George Clooney ends his career … oops, I mean announces his support for Kamala.","summary":"'Much of it will be reliving the glory days of the Biden presidency – and who wouldn't want to relive those many glorious moments?'","url":"https://www.wnd.com/2024/11/the-4-year-anti-trump-fantasy-cruise/","image":"https://www.wnd.com/wp-content/uploads/2023/07/Icon-of-the-Seas-cruise-ship-video-screenshot.jpg","video":null,"publish_date":"2024-11-19 00:34:29","author":"Nin Privitera","authors":["Nin Privitera"],"language":"en","source_country":"us","sentiment":0.23},{"id":265655396,"title":"Trump Responds 'TRUE!' To Conservative's Claim That Military Will Be Used Against Immigrants","text":"President-elect Donald Trump seemingly agreed that military resources will be used to deport undocumented immigrants.\n\nWhat Happened: Trump's confirmation came via a repost on social media. Conservative activist Tom Fitton claimed the incoming administration will deploy military assets for a mass deportation program.\n\nTrump's responded with the caption: \"TRUE!!!\"\n\nThe statement aligns with earlier plans sketched out by Trump’s nativist advisors, including Stephen Miller and Tom Homan.\n\nMiller and Homan, Trump’s border czar and former acting director of the U.S. Immigration and Customs Enforcement, devised the deterrence program to separate thousands of immigrant families.\n\nHUGE: President @RealDonaldTrump confirms he is prepared to declare a national emergency and use the military assets to reverse the Biden invasion. pic.twitter.com/XnqW121GnQ\n— Tom Fitton (@TomFitton) November 18, 2024\n\nSee Also: Could Trump’s Housing Plans Reshape The Real Estate Market?\n\nWhy It Matters: Miller, Trump’s deputy chief of staff, previously proposed using military funds to construct large-scale holding facilities for immigrants.\n\nOn Nov. 7, the day Trump’s re-election was confirmed, stock opportunists pounced. The share prices of major prison stocks — Geo Group GEO and CoreCivic CXW — spiked.\n\nGeo and CoreCivic both closed in the red Monday, down 0.83% and 1.03%, respectively.\n\nTrump’s critics warn his deportation plans will likely lead to families being broken up and force taxpayers to shoulder the billions it will cost to fund such an initiative.\n\nThe use of military resources in immigration enforcement is not without precedent internationally. Several countries have turned to their armed forces to manage immigration challenges, often citing national security concerns:\n\nThe Australian government employed its military under the direction of former Australian Prime Minister Tony Abbott’s 2013 \"Operation Sovereign Borders” campaign. The military's role included detaining migrants in offshore facilities — a practice widely criticized by human rights organizations for alleged abuses and inhumane conditions.\n\nItaly’s navy continues to intercept migrant ships. Last week, it opened detention centers in Albania to process thousands of asylum-seekers outside its borders. The plan does not call for families to be separated, according to the Associated Press.\n\nIndia has stationed military units along its borders with Bangladesh and Myanmar, citing the need to curb illegal immigration. The military operations led to the controversial expulsion of Rohingya refugees fleeing persecution in Myanmar. This drew condemnation from international bodies such as the United Nations.\n\nAs a key entry point for migrants entering Europe, Greece has used its military to assist in patrolling borders and managing overcrowded refugee camps on islands like Lesbos. The military's involvement has been criticized for heavy-handed and harsh tactics.\n\nWhat’s Next: Trump's rhetoric creates a precedent that raises questions about the balance between national security and civil liberties.\n\nIn the lead-up to Election Day, the twice-impeached former president often made graphic criticisms of migrants. Many of his claims, linking them to crime and violence, were unsubstantiated.\n\nA KFF poll showed 80% of Americans encountered false claims about migrants increasing crime, reflecting Trump’s fearmongering strategy.\n\nThe announcement comes as Trump continues to fill key cabinet positions, with some nominees facing scrutiny over qualifications and conduct.\n\nGaetz Nomination In Peril Due To GOP Resistance\n\nPhoto: Pixabay\n\nMarket News and Data brought to you by Benzinga APIs\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","summary":"Twice-impeached Trump often makes graphic criticisms of migrants, including unsubstantiated claims that linked them to crime and violence.\n\n\nread more","url":"https://www.benzinga.com/news/global/24/11/42052172/trump-responds-true-to-conservatives-claim-that-military-will-be-used-against-immigrants","image":"https://cdn.benzinga.com/files/images/story/2024/11/18/Reorganization-of-Border-Enforcement-Lea.jpeg?width=1200&height=800&fit=crop","video":null,"publish_date":"2024-11-19 00:33:59","author":"Anthony Noto","authors":["Anthony Noto"],"language":"en","category":"politics","source_country":"us","sentiment":-0.183},{"id":265654466,"title":"Judge 'unlikely to rescue' ex-Fox News host in contempt battle: report","text":"Ex-Fox News reporter Catherine Herridge is subject to fines and possible jail time as a federal appeals court \"appears unlikely to rescue\" the conservative journalist for \"refusing\" to reveal her sources for reports about about a Chinese American scientist who was probed by the FBI, Politico reports. \n\nWhen Donald Trump succeeds Joe Biden in January, Politico reports the MAGA leader \"could order the Justice Department to settle an underlying lawsuit filed by the woman, Yanping Chen,\" which \"would wipe away the fines and any other punishment against Herridge.\"\n\nPolitico reports:\n\nHerridge relied on one or more anonymous sources for several 2017 stories about potential national security risks related to a Virginia school that was founded by Chen and attended by many members of the U.S. military whose tuition was paid by taxpayers. Herridge published details about an FBI investigation into Chen, including photos of her in a People’s Liberation Army uniform.\n\nChen, who says leaks about the probe damaged her reputation, sued several federal agencies over the disclosures. As part of that lawsuit, she issued a subpoena to Herridge to try to force her to disclose her source. Herridge refused.\n\nREAD MORE: Trump’s plan to defy 14th Amendment: No passports for children of undocumented parents\n\nThe president-elect \"has long praised and amplified Herridge’s reporting on other topics,\" the news outlet reports, \"especially her stories that raised questions about the investigations he faced in 2017 and 2018 over his presidential campaign’s contacts with Russia.\"\n\nHerridge's legal fight \"could become the first big showdown over press freedom during\" Trump's second administration, Politico notes.\n\nREAD MORE: House Ethics chair dismisses Johnson’s request to keep Gaetz report under wrap\n\nPolitico's full report is available at this link.","summary":"Ex-Fox News reporter Catherine Herridge is subject to fines and possible jail time as a federal appeals court \"appears unlikely to rescue\" the conservative journalist for \"refusing\" to reveal her sources for reports about about a Chinese American scientist who was probed by the FBI, Politico reports. \n\nWhen Donald Trump succeeds Joe Biden in January, Politico reports the MAGA leader \"could order the Justice Department to settle an underlying lawsuit filed by the woman, Yanping Chen,\" which \"would wipe away the fines and any other punishment against Herridge.\"\n\nPolitico reports: \n\nHerridge relied on one or more anonymous sources for several 2017 stories about potential national security risks related to a Virginia school that was founded by Chen and attended by many members of the U.S. military whose tuition was paid by taxpayers. Herridge published details about an FBI investigation into Chen, including photos of her in a People’s Liberation Army uniform.\n\nChen, who says leaks about the probe damaged her repu","url":"https://www.alternet.org/catherine-herridge-fox-news-court/","image":"https://www.alternet.org/media-library/image.png?id=54650570&width=1200&height=600&coordinates=0%2C117%2C0%2C117","video":null,"publish_date":"2024-11-19 00:33:00","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":-0.293},{"id":265654852,"title":"Oregon surpasses 100,000 registered electric vehicles, remains one of top EV states","text":"Oregon has surpassed 100,000 registered electric vehicles, keeping the state in the top five for EV adoption nationwide.\n\nGenerous state rebates and a push to build more charging stations across the state have contributed to the popularity of EVs in Oregon, Oregon environmental officials Monday.\n\nThe state actually crossed the green milestone in July but obtaining the DMV registration data takes several months, they said.\n\nAs of August, Oregon had about 102,400 registered cars, SUVs and light trucks, according to the state Department of Environmental Quality. That number includes both battery electric vehicles and plug-in gas-electric hybrid vehicles.\n\nMost of the vehicles were registered in Multnomah, Washington and Clackamas counties.\n\nOregon ranked fifth nationwide last year for the number of registered EVs per capita, following California, Washington State, Hawaii and Colorado, according to the U.S. Department of Energy.\n\nOregon officials said the transition to EVs is key to the state’s effort to reduce greenhouse gas emissions from transportation, which accounts for about 35% of the state’s total greenhouse gas emissions.\n\nThe DEQ said the popular Oregon electric vehicle rebate program helped speed up EV adoption and made them available to lower income households.\n\nOver the past six years, DEQ said it has distributed more than 33,000 EV rebates across Oregon, totaling over $99 million. More than a third of the state’s registered EVs have received a rebate and at least $30 million in rebates have gone to low and moderate-income households, the agency said.\n\nBut the rebate program has been on hold for more than a year. This summer, the DEQ received an additional $30.5 million from the U.S. Environmental Protection Agency specifically for rebates of $5,000 to $7,500 aimed at low- or moderate-income households, DEQ Director Leah Feldon said. The extra money will go to restart the rebate program next year, including to pay those who applied in 2024 and were placed on a waiting list.\n\nState officials also said a push to build more charging stations in Oregon contributed to EV adoption. As of this month, the Oregon Departments of Transportation has distributed $4.2 million to nearly 190 charging station projects in 27 Oregon counties, the transportation agency said. Over 75% of those projects are in rural or disadvantaged communities.\n\nIt’s unclear if Oregon’s EV adoption will continue at a similarly brisk pace if President-elect Donald Trump decides to kill the federal $7,500 consumer tax credit for electric vehicles when he takes office in January. The tax credit is available in addition to state rebates.\n\n— Gosia Wozniacka covers environmental justice, climate change, the clean energy transition and other environmental issues. Reach her at gwozniacka@oregonian.com or 971-421-3154.\n\nOur journalism needs your support. Subscribe today to OregonLive.com.","summary":"Oregon has surpassed 100,000 registered electric vehicles, likely due to generous state rebates and a push to build more charging stations, state officials said.","url":"https://www.oregonlive.com/environment/2024/11/oregon-surpasses-100000-registered-electric-vehicles-remains-one-of-top-ev-states.html","image":"https://www.oregonlive.com/resizer/v2/XM37MYAEEFHZ7HREGU3FG4VWZU.jpg?auth=3a3ab2487c1afd0fe4bdf5b54c5cfefef0b17d342064de5b74db30654fc75733&width=1280&quality=90","video":null,"publish_date":"2024-11-19 00:32:57","author":"Gosia Wozniacka","authors":["Gosia Wozniacka"],"language":"en","source_country":"us","sentiment":-0.217},{"id":265657222,"title":"Good things are happening: Here are just 10","text":"Want to hear something that may be music to your ears, especially if you were delighted by the Nov. 5 national election?\n\n“Anxious gloom grips much of the District.”\n\nThat was the take of Washington Post staff writer Kyle Swensen in a feature article last Wednesday about a place called Kraken.\n\nIt’s a rage room where clients pay $29.99 to use crowbars, wrenches and baseball bats to smash things for 15 minutes of “stress relief.”\n\nOne client placed five dinner plates on the floor, each with a letter on it, spelling out “TRUMP.”\n\nAs the Post reported, “The plates were soon rubble.”\n\n“I feel better,” said the client, a Kamala Harris supporter from Howard University.\n\nWell, join the club. I have felt a whole lot better since Nov. 5, and even more so now that the GOP has recaptured the House of Representatives in addition to the Senate and White House.\n\nConfining the violence to a paid bashing session is far better than the riots that were anticipated in many places.\n\nDowntown businesses in the District of Columbia, which voted 92% for Ms. Harris and her running mate, Minnesota Gov. Tim Walz, had boarded up their storefronts, as had businesses in other major cities.\n\nApparently, the sheer size of the Donald Trump/J.D. Vance victory, which included the popular vote, tempered the hotheads, at least for now.\n\nIn January, feminists will be out in force again in Washington in their unique haberdashery, marching against the new administration because it’s not dedicated to killing unborn babies and castrating boys.\n\nBut we should in the meantime enjoy the holidays and celebrate the things that matter most.\n\nAnd, because of Mr. Trump’s triumph, a number of good things will be happening.\n\nIn no particular order:\n\n– The Pentagon will once again be under the control of a defense secretary who thinks the armed forces are there to protect the United States, not to hold drag queen shows and subject hapless soldiers to DEI nonsense.\n\n– The southern border will once again be closed except for legal immigration. People here illegally, beginning with tens of thousands of criminals, will be deported.\n\n– The U.S. auto industry will be freed from the climate hysteria extremists at the EPA who issued emissions rules designed to force all Americans into unwanted electric vehicles.\n\nThis is good news especially for Ford Motor Company, which has lost more than $5 billion trying to meet government dictates. Electric cars and trucks piled up at dealers’ lots while EPA bureaucrats insisted that dealers sell an electric vehicle for every purchase of a gas-powered vehicle.\n\nMaybe the dealers should have thrown in an electric car as a bonus for customers who bought gas-powered cars. This would make great sense under the Democrats’ version of economics.\n\n– The Department of Education will be put on notice that it may be short-lived. At the least, it will have to stop inflicting the LGBTQ lifestyle on kids, including transgender insanity, a calamitous social contagion with no biological basis.\n\nWashington’s educrats also will have to stop recommending anti-American history lessons and anti-free-market, pro-socialist economics. School districts that insist on continuing to miseducate kids should lose federal funding.\n\n– The dynamic duo of Elon Musk and Vivek Ramaswamy are heading up a new Department of Government Efficiency (DOGE) – outside of government, which is important. They plan to forge ways to cut down the federal bureaucracy by eliminating waste, obsolete programs and duplication.\n\n– House and Senate committees will continue exposing how the FBI, CIA, NSA and other agencies were transformed by the Obama/Biden/Harris regime into instruments of political suppression. This, time, Mr. Trump will clean house, especially at the FBI, whose armed agents raided his Florida home.\n\n– The 51 “national security experts” who sent the patently false letter just before the 2020 election that implied Hunter Biden’s laptop from hell was Russian misinformation will probably lose their security clearances. That’s the least that should happen to them, legally speaking, for their disgraceful behavior.\n\nFormer CIA Director John Brennan, who signed the letter along with former Director of National Intelligence James Clapper and Leon Panetta, a former CIA director and secretary of Defense, recently denied that the letter constituted a lie.\n\nIt was just “a yellow flag,” he said. That’s Democrat-speak. To paraphrase the late Senate Majority Leader Harry Reid after he was caught lying about Republican presidential candidate Mitt Romney’s tax status, “It worked, didn’t it?”\n\n– The new Congress will pass laws enhancing election integrity to counter the many ways that Democrats loosened voting rules during the COVID-19 pandemic. Voter ID and citizenship laws will blossom. Registration rolls will be cleaned up.\n\n– The 47thpresident will appoint judges who see the Constitution rightly as a limitation on government, not a blank check. This will help counter the many Clinton/Obama/Biden “living Constitution” judges who have turned the nation’s founding document into silly putty.\n\n– Colleges will be put on notice that they will risk losing federal funds if they don’t protect Jewish students on campus from Hamas-backing mobs.\n\n– January 6 defendants, some of whom are still being mistreated by the Biden/Harris Justice Department, will see justice done at last.\n\nThere’s much more, of course, but you get the idea.\n\nGood things are happening.\n\nYou can tell by the uptick in business at the Kraken.\n\nThis column was first published at the Washington Times.","summary":"'It's a rage room where clients pay ... to use crowbars, wrenches and baseball bats to smash things'","url":"https://www.wnd.com/2024/11/good-things-are-happening-here-are-just-10/","image":"https://www.wnd.com/wp-content/uploads/2022/05/woman-women-smiling-happy-joy-beautiful-gorgeous-rejoice-teeth-whites-pure-skin-lipstick-red-unsplash.jpg","video":null,"publish_date":"2024-11-19 00:32:41","author":"Robert Knight","authors":["Robert Knight"],"language":"en","source_country":"us","sentiment":-0.075},{"id":265657220,"title":"Crybaby liberals bawl over election results","text":"This election brought further evidence of society’s drift to a crybaby culture. For higher education, democracy means blubbering or throwing a hissy fit if you lose.\n\nAcademia turned to group therapy to cope with President-elect Donald Trump’s victory. Georgetown University provided students with a “self-care suite” stocked with milk and cookies and coloring books. Harvard canceled classes for those traumatized by democracy. The University of Oregon offered a petting zoo for emotional support.\n\nStudents at the University of Michigan School of Social Work were invited to participate in an “empowering therapy workshop” to “process emotions stirred up by the election season.”\n\nWhere were the workshops to help process the emotions stirred up by Oct. 7, 2023, the greatest one-day slaughter of Jews since the Holocaust? But then, what’s rape, torture and murder compared to losing an election?\n\nIt didn’t start with the 2024 election.\n\nLast year, Boston University Law School offered therapy after three Supreme Court decisions that went against liberal orthodoxy. Would you want a lawyer who needed therapy when he lost? (“Your honor, can we have a brief recess so I can process my emotions?”)\n\nA Yale University psychiatrist is urging supporters of Vice President Kamala Harris not to attend holiday gatherings with family members who voted for Mr. Trump and to tell them why they’re being shunned. “I think you should very much be entitled to do so, and I think it may be essential to your mental health,” said Dr. Amanda Calhoun — Sigmund Freud meets Cruella de Vil.\n\nImagine the anguish caused by sharing cranberry sauce with relatives who disagree with you.\n\nDie-hard feminists are vowing to refrain from sex while Mr. Trump is in office. This elicited an audible sigh of relief in some quarters.\n\nIncreasingly, we live in a society where emotions are exalted and reason is rejected. I wail, therefore I am.\n\nIn New York City, there are pop-up Sob Parlors where customers can pay $20 for 30 minutes in a private room to cry themselves a river.\n\nPolitical demonstrations often resemble temper tantrums. Because we’re selling arms to Israel, protesters feel justified in defacing statues and blocking traffic.\n\nKeith Hayward, a criminologist at the University of Copenhagen, is the author of “Infantilised: How Our Culture Killed Adulthood.”\n\nMr. Hayward notes that the “markers of adulthood” – leaving home, marrying, having children – are rapidly declining. In the United States, 45% of young adults (18 to 30 years of age) live with their parents, the highest percentage since the Depression.\n\nCinema celebrates prolonged adolescence. In “Arthur,” Dudley Moore’s man-child wandered around in an alcoholic haze, wearing a top hat in the bathtub and playing with model trains. The 1981 movie won three Academy Awards.\n\nGlobal warming whiner Greta Thunberg operates on high-octane histrionics. The Swedish pest was 16 when she gave her “you have stolen my dreams” speech at the United Nations. She knew nothing about climate change other than what she got from popular media.\n\nHer fame was based on her age and ability to emote. Her latest cause is ending the war in Gaza, about which she is equally clueless.\n\nOur culture used to honor maturity, hard work and sacrifice. We pay homage to this on Memorial Day. The average age of the soldiers who braved withering fire to wade ashore on Omaha Beach was 22.\n\nA society that celebrates heroism, loyalty and achievement gets it. One that glorifies emotional outbursts and needs cuddly critters to handle distress over losing an election, gets a culture of Greta Thunbergs coached by an army of Dr. Amanda Calhouns.\n\nThere’s a wonderful parody on the internet called “Millennial Job Interview” where a young woman tells an interviewer that she couldn’t possibly come to work before 10:45 a.m., after she’s had her venti soy latte, and needs mental health days off to deal with stress. When she’s rejected, she sniffs, “I’ve been here a whole five minutes and no one has validated me.”\n\nFor conservatives, it’s reassuring to know that the left is dominated by emotional cripples who are easily defeated. On the other hand, sob parlors, self-care suites and comfort animals do not bode well for a nation’s future.\n\nAfter Pearl Harbor, Japanese Adm. Yamamoto said, “I fear we have awakened a sleeping giant and filled him with a terrible resolve.”\n\nAfter the next Pearl Harbor, a future adversary may say: “We have awakened a bawling brat. Get out the milk and cookies.”\n\nThis column was first published at the Washington Times.","summary":"'Increasingly, we live in a society where emotions are exalted and reason is rejected'","url":"https://www.wnd.com/2024/11/crybaby-liberals-bawl-over-election-results/","image":"https://www.wnd.com/wp-content/uploads/2024/06/hidden-face-woman-women-braids-ashamed-sad-remorseful-afraid-fear-crying-laughing-surprised-astonished-shocked-blondes-hair-whites-young-youth-teens-teenagers-unsplash.jpg","video":null,"publish_date":"2024-11-19 00:30:47","author":"Don Feder","authors":["Don Feder"],"language":"en","category":"politics","source_country":"us","sentiment":0.262},{"id":265657582,"title":"How Kamala Harris burned through $1.5 billion in 15 weeks","text":"Vice President Kamala Harris spent a remarkable $1.5 billion in her hyper-compressed 15-week presidential campaign. But in the days since losing to President-elect Donald Trump, her operation has faced questions internally and externally over where exactly all that cash went. Despite her significant financial advantage, Harris became the first Democratic presidential candidate to lose the national popular vote in two decades, ceding every battleground state to Trump. Her cash-rich campaign spared no expense as it hunted for voters -- paying for an avalanche of advertising, social-media influencers, a for-hire door-knocking operation, thousands of staff, pricey rallies, a splashy Oprah town hall, celebrity concerts and even drone shows. It was a spree that averaged roughly $100 million per week. The frenzied spending has led to second-guessing among some Democrats, including whether investing in celebrity-fueled events with stars such as Lady Gaga and Beyoncé was more ostentatious than effective. Since her loss, the Harris operation has pressed supporters for more cash with desperate-sounding solicitations, stirring fears about postelection debts. Is there anything we can say? came one email asking for cash last Monday. The biggest expense during the race was advertising. Between July 21 and Oct. 16, financial records show that the Harris campaign spent $494 million on producing and buying media, a category that includes both television and digital ads. The total sum through the election is said to be closer to $600 million. Yet starting in October, her campaign was actually narrowly outspent on broadcast television by Trump, according to data from ad-tracking service AdImpact. The ads were just one piece of a campaign that had enough cash to spend on seemingly everything. There was $2.5 million directed toward three digital agencies that work with online influencers, records show. The campaign spent around $900,000 to book advertising on the exterior of the Sphere venue in Las Vegas in the last week of the race, two officials said. There were drone shows in the sky before the debate in Philadelphia in September and at a Pittsburgh Steelers game in October. In a note Friday to Harris' top fundraisers, Chris Korge, the Democratic National Committee's finance chair, said that losing all seven battleground states had shocked us all. I will absolutely push for an introspective study and analysis of the campaign, its structure, its messaging, all communication platforms and budgeting, Korge wrote. Given the magnitude of Harris' loss, more of the focus so far has been on the Democratic brand and message rather than the mechanics of her operation. Harris inherited a campaign based in inconvenient Wilmington, Delaware, that was built for President Joe Biden, and she had limited time to refashion it to better suit her strengths. Harris added some senior advisers but mostly kept the Biden team in place, including Jennifer O'Malley Dillon, the powerful campaign chair who oversaw the finances and virtually every major move. The campaign's spending decisions were documented in Federal Election Commission records and interviews with 15 Harris campaign officials and close allies, most of whom insisted on anonymity to discuss internal finances and dynamics candidly. Many of the financial figures in this article are from the latest campaign reports; some are from Harris officials with knowledge of the spending. All told, the Biden and Harris campaigns collectively raised about $2.15 billion, two people said. It is not clear exactly how much Trump spent, though it was far less. Trump and the Republican Party together raised $1.2 billion, one person with knowledge of the figure said. Even in defeat, there were some signs of the effectiveness of Harris' spending: She performed stronger in the battleground states than nationally. Some Harris aides and allies have taken a strange sort of solace in the scope of her defeat as Trump captured 312 electoral votes -- far more than the 270 needed to win. There is not a single expenditure in a different spot that would have changed the outcome of the race, said Bakari Sellers, a close ally of Harris and a former lawmaker in South Carolina. In fact, Sellers said, the campaign faced an unusual problem: We had so much money it was hard to get it out the door. Patrick Stauffer, the campaign's chief financial officer, said in a statement that there had been no outstanding debts or overdue bills as of Election Day. He said that there will be no debt on the next Democratic National Committee and Harris for President campaign filings in December. Donations made after the election to the Harris Fight Fund are being funneled to the Democratic National Committee, officials said. In recent days, the committee has shed hundreds of staff members, an expected downsizing after the defeat. The party had a payroll of roughly 680 in October and is shrinking by roughly 70%, according to two people familiar with the cutbacks. A DNC official said 95% of those being let go had a postelection end date in their offer letter. Still, the reductions were symbolic of the boom and bust of elections -- and the severity of the bust in defeat. We are prepared to lead the fight against Donald Trump into the future, said Rosemary Boeglin, communications director for the Democratic National Committee. Trump himself mocked the Harris team for its financial situation in a recent social-media post: Whatever we can do to help them during this difficult period, he offered. One particular Harris payment has drawn attention in the aftermath of the election: the $1 million paid to Oprah Winfrey's production firm, Harpo Productions. In an Instagram post, Winfrey said the company was paid to stage a livestreamed town hall in Detroit, providing the set, lights, cameras, microphones, crew, producers and even the chairs. I did not take any personal fee, Winfrey wrote. However the people who worked on that production needed to be paid. And were. End of story. The $1 million actually undercounts the full cost of the event, which ran closer to $2.5 million, according to two people briefed on the matter. Another pricey choice was holding swing-state rallies featuring star performers on the eve of the election, including Lady Gaga in Philadelphia, Jon Bon Jovi in Detroit, Christina Aguilera in Nevada, James Taylor in North Carolina and Katy Perry in Pittsburgh. The singers themselves were not compensated, officials said, but the support staff was. The overall bill for the election-eve rallies exceeded the planned budget and is said to have topped $10 million. The cost overruns were partly because the Harris team built an entire rally venue at a park in Pittsburgh only to be told by the Secret Service that the site could not be properly secured. They had to rush to take it down and rebuild at a second venue. Because of Vice President Harris' unparalleled fundraising prowess, Stauffer said, we were able to run an aggressive all-of-the-above strategy to reach voters, keeping the seven battleground states incredibly close. Even as Harris ran notably stronger in battlegrounds such as Pennsylvania, Georgia and North Carolina than in surrounding areas, those results were double-edged, politically. They suggested that the ticket she led was so unpopular that it took an enormous campaign just to limit her losses. Though Harris had been on the ticket from the start, her advisers discovered that the Biden operation had done virtually no research on her strengths and weaknesses. Her operation spent more than $12 million on polling from July 21 to mid-October, records show. Other major costs, according to records and campaign officials, included $111 million in online ads seeking donations, at least $100 million transferred to battleground-state parties, $70 million on mail and nearly $28 million to produce the merchandise that people were ordering. And for all the focus on her volunteer program, the campaign spent a significant sum -- about $50 million -- for paid door-to-door canvassers. In an Oct. 16 memo, the leading super political action committee supporting Harris raised alarms about being outspent on television. The group, Future Forward, said in the memo, which was first reported by The Washington Post, that it would be difficult for anyone but the Harris team to close the gap because of the higher ad rates that super PACs pay. It was hardly Future Forward's only frustration. Another memo, issued days later, pointed out very high-performing ads that have yet to get a big spend. One ad, Future Forward said, had ranked in the 100th percentile -- meaning it was the most effective -- yet it had virtually never been aired. Campaign officials, meanwhile, were frustrated that Future Forward sat on so much of its money until the final weeks, forcing the campaign to spend more on the airwaves earlier. Another Harris challenge: After raising $1 billion in less than three months, a bevy of consultants, allies and others were often angling for a cut, including the chair of the Democratic Party in Philadelphia. In September, the Harris operation contributed almost $25 million to other party committees, in part to quiet those demands. Some media allies of Harris were also paid. Areva Martin, who hosts a talk show, was paid $200,000 as a media consultant and she went on a battleground-state tour in October. Roland Martin, who hosts his own streaming programming and runs a media company called Nu Vision Media, received $350,000 in September for a media buy that he said was for advertising. It should have been a hell of a lot more, Martin said in a brief interview. More should have been spent on Black-owned media. Martin interviewed Harris in October. Harris' campaign also made two $250,000 donations to National Action Network, the organization led by the Rev. Al Sharpton. Sharpton interviewed Harris on MSNBC in October. As Harris faced questions about relative weakness among Black voters, her campaign gave $2 million in late September to the National Urban League. One of the unanswered questions is who exactly made money off the commissions on Harris' advertising, which can be especially lucrative. Such payments are often hidden even in federal disclosures. In 2020, for instance, Mike Donilon, who was one of Biden's top strategists, reported on his personal financial disclosure form with the White House that his consultancy had earned $4.35 million in 2020, far more than the roughly $543,000 disclosed to the Federal Election Commission in payments to his firm. Numerous firms could have netted big commissions from the Harris campaign. Four companies received at least $90 million in payments as of mid-October, including one firm whose cumulative receipts from the Harris campaign approached $300 million.","summary":"Vice President Kamala Harris's presidential campaign, despite spending a staggering $1.5 billion in just 15 weeks, ended in a decisive loss to Donald Trump. The campaign's lavish spending on advertising, events, and staff has sparked internal scrutiny and questions about its effectiveness.","url":"https://economictimes.indiatimes.com/news/international/world-news/how-kamala-harris-burned-through-1-5-billion-in-15-weeks/articleshow/115432002.cms","image":"https://img.etimg.com/thumb/msid-115432049,resizemode-4,width-1200,height-900,imgsize-132518,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-11-19 00:30:38","author":null,"language":"en","source_country":"in","sentiment":-0.12},{"id":265653988,"title":"Letters: Oakland mayor | Before vaccines | Cruelty over compassion","text":"Lee not the answer\nfor Oakland mayor\n\nRe: “Leaders courting Bay Area progressive for mayor” (Page A1, Nov. 16).\n\nBarbara Lee has served us well as a representative.\n\nSo did Ron Dellums. He was not an effective mayor, and I don’t think Lee would be either. It is time to find a strong new leader focused on Oakland’s many issues, one who has the energy to lead Oakland.\n\nThere are other candidates besides Lee who have the integrity to do this. Let’s support one of them.\n\nJudith Ubsdell\n\nRFK Jr. could turn back\nclock to before vaccines\n\nRe: “Trump picks RFK Jr. to lead Dept. of Health and Human Services” (Page A1, Nov. 15).\n\nDo we want vaccine-denier Robert F. Kennedy Jr. to head HHS? I don’t think so.\n\nMost people in the country now have no memory of living with childhood communicable diseases, but not me. I suffered through measles, chicken pox, mumps and rubella because there were no vaccines for these during my childhood.\n\nHowever, I did miss the worst scourge of all — polio. Every winter during the early 1950s my mother lived in fear that I would contract polio and end up paralyzed or in an iron lung. She went door to door every year collecting for the March of Dimes supporting research for a vaccine. When the Salk vaccine came out when I was 6 years old, she had me at the health department ASAP for the shot.\n\nSo, do we really want to go back to pre-vaccine days? If we don’t learn from history, we are doomed to repeat it.\n\nPeggy Moyers\n\nCruelty toward migrants\nreplaces compassion\n\nRe: “We must learn from our history, reject Trump ‘mass deportation’” (Page A6, Nov. 7).\n\nCalifornia state Sen. Josh Becker warns President-elect Donald Trump’s planned mass deportation “ is a dangerous idea with potential to tear apart families, disrupt communities and inflict lasting trauma.”\n\nIn 1954, during Dwight D. Eisenhower’s presidency, “Operation Wetback” was conducted. Over 1 million Mexicans were deported back to Mexico after having come to our border seeking work. Military-style tactics were inflicted on these immigrants by Border Control, and the trauma this population experienced still reverberates to this day.\n\nMost Americans are descendants of immigrants. Think about what a round-up and separation of your own family would look and feel like. Moreover, no one leaves home unless their very survival is at stake. Think about why your forebears left their country of origin.\n\nSadly, compassion has gone out the window and cruelty has replaced it.\n\nSharon Brown\nWalnut Creek","summary":"East Bay Times Letters to the Editor for Nov. 19, 2024","url":"https://www.mercurynews.com/2024/11/18/letters-1936/","image":"https://www.mercurynews.com/wp-content/uploads/2024/03/EBT-L-OAKDOWTOWN-03XX-12.jpg?w=1024&h=661","video":null,"publish_date":"2024-11-19 00:30:27","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.555},{"id":265654640,"title":"China's Xi Jinping Urges G20 Leaders To Help \"Cool\" Ukraine Crisis","text":"Chinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a \"political solution,\" state media reported.\n\nHis remarks at the G20 summit in Brazil come shortly after Ukraine received a US green light to launch long-range missiles provided by Washington against targets inside Russia.\n\n\"The G20 should support the United Nations and its Security Council in playing a greater role, and support all efforts conducive to the peaceful settlement of crises,\" Xi said, according to Chinese state broadcaster CCTV.\n\nHe called for leaders to avoid \"spillovers\" from battlefields and escalation of fighting, and to help \"cool the Ukraine crisis and seek a political solution.\"\n\nWar in Ukraine continues to rage since Russia's invasion in 2022.\n\nChina presents itself as a neutral party in the war and says it is not sending lethal assistance to either side, unlike the United States and other Western nations.\n\nBut it remains a close political and economic ally of Russia. NATO members have branded Beijing a \"decisive enabler\" of the war, which it has never condemned.\n\nFollowing the long-range missile policy shift by US President Joe Biden, who leaves office in January, German Chancellor Olaf Scholz said Monday his country was sending Ukraine 4,000 AI-guided drones.\n\nXi, in his speech Monday, also called for efforts to shore up multilateral trade systems and warned against \"politicizing economic issues\" without naming any specific countries.\n\nHis comments come before US President-elect Donald Trump reenters the White House in January, after campaigning on pledges to enact sweeping tariffs on China and others.\n\nWashington also unveiled sharp tariff hikes this year on Chinese goods, notably on products like electric vehicle batteries and solar cells, as the United States tries to grow its domestic clean energy sectors.\n\n\"We must avoid politicizing economic issues, artificially dividing the global market, and avoid practicing protectionism in the name of green and low-carbon development,\" Xi said.\n\nIn seeking cooperation on artificial intelligence, he added that this should not become \"a game of rich countries and the wealthy.\"\n\nXi called for \"all sides to stop fighting\" in Gaza as well, saying the war between Israel and Hamas has \"brought heavy suffering,\" CCTV reported.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Chinese President Xi Jinping urged G20 leaders Monday to support efforts to de-escalate the war in Ukraine and reach a &quot;political solution,&quot; state media reported.","url":"https://nation.lk/online/china-s-xi-jinping-urges-g20-leaders-to-help-cool-ukraine-crisis-284057.html","image":"https://c.ndtvimg.com/2024-11/rp0upan_xi-jingping-g20_625x300_19_November_24.jpeg","video":null,"publish_date":"2024-11-19 00:30:05","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.19},{"id":265654484,"title":"MSNBC staffers slam ‘Morning Joe’ co-hosts after Mar-a-Lago summit with Trump: ‘Cowardice’","text":"More like Morning Oh-hell-no. \n\nMSNBC staffers were furious to learn that “Morning Joe” co-hosts Mika Brzezinski and Joe Scarborough met with President-elect Donald Trump at Mar-a-Lago over the weekend, and didn’t hold back in voicing their displeasure.\n\nOne unnamed employee vented to Fox News Digital, characterizing the meeting as “cowardice” and “disgusting but frankly unsurprising” — and saying the sit-down flew in the face of anti-Trump author and historian Tim Snyder’s on-air admonishment to the network to never “obey in advance.”\n\n“Five years of political warfare has deeply divided Washington and the country,” said Brzezinski, 57, as she opened Monday’s show with the stunning revelation.\n\n“Joe and I realize it’s time to do something different, and that starts with not only talking about Donald Trump, but also talking with him,” she added, noting that Trump was “cheerful and upbeat” during the private meeting, and seemed “interested in finding common ground” with Democrats.\n\nThe same employee told the outlet that MSNBC staff members had become “largely disdainful” of the left-wing network hosts in light of the news, calling them “opportunistic” for arranging to meet with Trump after spending two years demonizing him as the second coming of Adolf Hitler.\n\nMSNBC contributor Jennifer Rubin called the meeting “disgusting” on Bluesky, the social media platform attracting disaffected liberals who claim to be leaving Elon Musk-owned X.\n\nKatie Phang, host of the network’s “The Katie Phang Show,” made an oblique reference on X to the hosts’ visit, writing, “Normalizing Trump is a bad idea. Period.”\n\nThe employee echoed her sentiment, telling the outlet, “Katie Phang is right. It’s normalization (and it’s access bulls–t) … Journalists don’t need access to their subjects to hold them to account. None of it is believable. The obvious answer is believable: They are opportunists.”\n\nThe Comcast-owned cable news channel experienced a drastic 54% ratings dip in the election’s immediate aftermath, according to a report, as viewers’ grew tired of the network’s slanted coverage.\n\nThe co-hosts — who married in 2018 — also drew swift condemnation from outside the network, with some accusing the talking heads of grasping at ratings with their abrupt about-face, which followed more than two years of fomenting fear about Trump on a daily basis.\n\n“Bend the knee to the King in order to save their careers,” a person wrote on X.\n\n“Gutted by Joe and Mika this morning. Total capitulation after years of railing about his lack of fitness. Not even an interview to show their ‘journalistic integrity’. Just a pure kiss-the-ring session. Disappointed and done with them and their show,” a viewer tweeted.\n\n“This is why people don’t trust the mainstream media anymore. Joe and Mika who constantly attack ‘fascist’ Trump on their show, went to Mar a Lago to talk with Trump over the weekend,” said another.\n\nScarborough, 61, attempted to defend what many called abject hypocrisy, saying, “Don’t be mistaken, we are not here to defend or normalize Donald Trump.”\n\nThe summit was the first time the pair had seen the incoming president in seven years, Brzezinski said. \n\nTrump later told Fox News Digital that the meeting with the lefty morning show co-hosts was “extremely cordial” and lamented “that it wasn’t done long ago.”","summary":"More like Morning Oh-hell-no. MSNBC staffers were furious to learn that “Morning Joe” co-hosts Mika Brzezinski and Joe Scarborough met with President-elect Donald Trump at Mar-a-Lago over the weekend, and didn’t hold back in voicing their displeasure. One unnamed employee vented to Fox News Digital, characterizing the meeting as “cowardice” and “disgusting but frankly unsurprising” &#8230;\n\n\nThe post MSNBC staffers slam ‘Morning Joe’ co-hosts after Mar-a-Lago summit with Trump: ‘Cowardice’ appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/msnbc-staffers-slam-morning-joe-co-hosts-after-mar-a-lago-summit-with-trump-cowardice/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/msnbc-staffers-slam-morning-joe-93912650.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-11-19 00:29:58","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.259},{"id":265654006,"title":"Campbell calls defense cost deal with Seoul 'extraordinarily generous,' hopes Trump govt. will grasp its 'wisdom'","text":"Campbell calls defense cost deal with Seoul 'extraordinarily generous,' hopes Trump gov't will grasp its 'wisdom'\n\nUS Deputy Secretary of State Kurt Campbell on Monday portrayed a recently concluded defense cost-sharing deal with South Korea as \"extraordinarily generous and gracious,\" and expressed hope that the incoming Trump administration will appreciate its \"wisdom.\"\n\nCampbell made the remarks during a forum amid concerns that after President-elect Donald Trump takes office in January, he could seek renegotiation of the Special Measures Agreement, a deal that determines Seoul's share of the cost for the stationing of the 28,500-strong US Forces Korea.\n\n\"We've recently concluded extraordinarily generous and gracious host-nation support arrangements with both Japan and South Korea, signaling the determination to keep the United States forward-engaged and forward-deployed,\" he said during the forum co-hosted by the Center for Strategic and International Studies and the Korea Foundation.\n\n\"My hope would be that the wisdom of that would be fully appreciated in a new administration,\" he added.\n\nLast month, Seoul and Washington struck the deal for the 2026-2030 period, under which Seoul is to pay 1.52 trillion won ($1.10 billion) in 2026, up from 1.4 trillion won in 2025.\n\nDuring a campaign period, Trump said that if he were in the Oval Office, Seoul would be paying $10 billion per year to maintain USFK personnel -- remarks that raised the possibility that the incoming US government could seek to raise Seoul's financial contributions further.\n\nCampbell also warned that substantially reducing the number of US troops in the Indo-Pacific would run counter to America's strategic interests, while underscoring the \"bipartisan\" US commitment to the troop presence in the region.\n\nHis remarks came amid lingering speculation that under his America First credo, Trump could call for regional allies to take up greater security responsibilities and seek to curtail the US' costly military involvement overseas.\n\n\"I think any effort that would look to substantially remove US forces or change the nature of our fundamental commitments to the Indo-Pacific, if that happened at this juncture, I think it would be contrary to American strategic interests,\" the senior diplomat said.\n\nIn a Time magazine interview in April, Trump suggested that the US could pull out its forces if South Korea does not pay more to support the stationing of the USFK personnel -- a stance that has stoked concerns over the future of the longstanding alliance.\n\nCampbell pointed out that one of the \"essential features of our ticket to the big game\" has been the \"bipartisan\" determination of the US to remain \"forward deployed and forward engaged across Asia.\"\n\n\"At the core of our military engagement are our rock-solid alliances with both Japan and South Korea,\" he said.\n\nThe official highlighted the need for Seoul to engage early with the Trump team and make the case for the importance of a stronger South Korea-US alliance.\n\n\"I am very encouraging of President Yoon (Suk Yeol) and his team to get in early, make the argument for partnership, make the argument about why South Korea is such a stalwart friend of the United States and that the United States and ROK can count on each other,\" he said. \"I am hopeful that that takes place and I think that will put us in good stead as we go forward.\"\n\nROK stands for South Korea's official name, the Republic of Korea.\n\nDescribing nuclear security challenges from North Korea, China, and Russia as \"real,\" Campbell underlined the importance of America's extended deterrence commitments to regional allies.\n\n\"You have a massive build-up on the part of China ... You have a country in Russia that has used nuclear saber-rattling on a regular basis ... and you've got a North Korea that is determined to continue to redefine its nuclear and missile capabilities,\" he said.\n\n\"All those things buffet the strategic consciousness of the countries in the Indo-Pacific and it is essential for the United States to be absolutely rock-solid in our commitment to extended deterrence.\"\n\nHe went on to say that if one country in the Indo-Pacific thought about reconsidering its nuclear options, it would likely lead to \"a chain of reconsiderations\" across the region.\n\nTouching on how China would view a deepening military partnership between Moscow and Pyongyang, the deputy secretary noted \"concerns\" on the part of Beijing.\n\n\"It appears in many respects that the dominant relationship that China once enjoyed with the DPRK has been usurped by a more consequential partnership between the DPRK and Russia that has caused some concerns in Beijing,\" he said, referring to North Korea by its official name, the Democratic People's Republic of Korea.\n\nMoreover, Campbell said that Pyongyang's engagement with Moscow is a topic that is \"increasingly uncomfortable\" for Beijing officials.\n\n\"In some of the discussions that we've had, it seems that we are informing China of things that they were unaware of actually with respect to DPRK pursuits,\" he said. \"I think they are concerned that Russian encouragement may cause the DPRK to contemplate either actions or military developments that are not in China's interests.\"\n\nCampbell pledged that Washington will continue to press China to make the case that what the North has been doing is \"destabilizing\" and \"dangerous.\"\n\n\"I will say (that) even though that is the case, China continues to come back to the sort of worn propositions that it is the failure of the US and other countries to reach out effectively to the DPRK that has led us to the stalemate that we are experiencing right now,\" he said. (Yonhap)","summary":"Campbell calls defense cost deal with Seoul &#039;extraordinarily generous,&#039; hopes Trump gov&#039;t will grasp its &#039;wisdom&#039; US Deputy Secretary of State Kurt Campbell on Monday portrayed a recently concluded defense cost-sharing deal w","url":"https://www.koreaherald.com/view.php?ud=20241119050007","image":"https://res.heraldm.com/content/image/2024/11/19/20241119050002_0.jpg","video":null,"publish_date":"2024-11-19 00:28:49","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"KR","sentiment":0.009},{"id":265654416,"title":"China, Australia Relations Have Seen ‘Twists and Turns,’ Xi Says","text":"“Over the past decade, we have made some progress in China-Australia relations and also witnessed some twists and turns. That trajectory has many inspirations to offer,” Xi said, according to a readout of the discussion from the Australian government. “This is the result of our collective hard work in the same direction, and should be maintained with great care.” \n\nThe bilateral talks at the Group of 20 in Brazil on Monday were the first meeting between the two leaders since the effective end of China’s punitive trade campaign against Australia, following the lifting of tariffs on wine and barley and with restrictions on lobster sales expected to finish by the end of 2024.\n\nSpeaking after the meeting with Xi, Albanese said green energy and climate action would be a particular focus for future cooperation between Australia and China. US President-elect Donald Trump was not mentioned during the talks, he added. \n\nRelations between China and Australia have rapidly improved since the election of Albanese’s center-left Labor government in May 2022, including negotiations which saw the trade restrictions steadily lift over the past two years. \n\nStill, points of tension remain between the two countries, including China’s policies toward the South China Sea, Taiwan and Hong Kong. Australia has also voiced concern over the treatment of Australian writer Yang Hengjun, who was given a suspended death sentence by a Chinese court in February in a blow to the thaw in ties.","summary":"Improved relations between China and Australia must be maintained with “great care” after a decade of “twists and turns,” Chinese President Xi Jinping said before meeting with Prime Minister Anthony Albanese on the sidelines of the G-20.","url":"https://financialpost.com/pmn/business-pmn/china-australia-relations-have-seen-twists-and-turns-xi-says","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/11/776072081.jpg","video":null,"publish_date":"2024-11-19 00:27:50","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":0.153},{"id":265653630,"title":"Donald Trump: Three grammar lessons from George Bush’s congratulatory message","text":"“I congratulate President Trump on his election as 47th President of the United States of America, as well as Vice President-elect J.D. Vance and their families.\n\n“I also thank President Biden and Vice President Harris for their service to our country.\n\n“The strong turnout in this election is a sign of the health of our republic and the strength of our democratic institutions. Laura and I are grateful to the election officials, poll workers, and volunteers who oversaw a free and fair election.\n\n“We join our fellow citizens in praying for the success of our new leaders at all levels of government. May God continue to bless our great country.”\n\nThe above is a recent statement by a former President of the United States of America, George W Bush. Beyond being a good gesture from a statesman, as he congratulated the country’s President-elect, Donald Trump, the piece provides the basis for our lesson today. We shall analyse three expressions in it, which many often find rather too tricky to handle. The way Bush presents the three is instructive.\n\nNot ‘I and Laura’\n\nWhen the subject of a clause combines the speaker/writer and another fellow, the name of the other party should come first. The same applies if personal pronouns (I, you, he etc.) are involved. It is a concept that symbolises courtesy/politeness and maturity. Unfortunately, a lot of folks are obsessed with putting themselves first:\n\nI and John will be there. (Wrong)\n\nMe and John will be there. (Wrong)\n\nJohn and I will be there. (Correct)\n\nThe same rule applies when we have compound objects:\n\nThey invited me and John. (Wrong)\n\nThey invited John and me. (Correct)\n\nNow, here is how our dear Bush does justice to this linguistic culture:\n\n“Laura and I are grateful to the election officials…”\n\nIn other words, it would be inappropriate to say:\n\nI and Laura are grateful to the election officials.\n\nDouble or no comma\n\nAmong other roles that commas play in communication, it helps in separating nonessential appositives (added information) as well as non-restrictive relative clauses. In such contexts, you can take out the elements inserted into clauses without injuring the structure. What is, however, very important is that we use two commas to mark out the apposition: one before it, the other after. It is a must to have the two in the context:\n\nLagos State Governor, Babajide Sanwo-Olu was at the FEC meeting. (Wrong)\n\nLagos State Governor, Babajide Sanwo-Olu, was at the FEC meeting. (Correct)\n\nThe player, who got a red card during the match against Arsenal will not play today. (Wrong) \n\nThe player, who got a red card during the match against Arsenal, will not play today. (Correct)\n\nThere is, however, an alternative. You may choose to leave out both commas. The rule, yet, is that, when you decide to do this, neither of the commas should be there:\n\nLagos State Governor, Babajide Sanwo-Olu was at the FEC meeting. (Wrong)\n\nLagos State Governor Babajide Sanwo-Olu was at the FEC meeting. (Correct)\n\nThe player who got a red card during the match against Arsenal, will not play today. (Wrong)\n\nThe player who got a red card during the match against Arsenal will not play today. (Correct)\n\nAgain, this is how Bush smartly puts it in the message: “I congratulate President Trump on his election as 47th President of the United States of America, as well as Vice President-elect J.D. Vance and their families.”\n\nHe chooses not to separate ‘Vice President-elect’ and ‘J.D. Vance’ with any comma and he is firm and consistent at it. In other words, his sentence would have been faulty if he had put it thus: “I congratulate President Trump on his election as 47th President of the United States of America, as well as Vice President-elect, J.D. Vance and their families.”\n\nThe definite article in ‘the United States’\n\nOf course, you should also note how the former President duly puts ‘the’ before the name of his dear country: the United States of America. Countries that have political titles in their names, those that refer to a group of islands or an assemblage of national entities as well as those with ‘Republic’ in their names should have the definite article preceding such:\n\nI will be in United Kingdom tomorrow. (Wrong)\n\nI will be in the United Kingdom tomorrow. (Correct)\n\nI will be in UK tomorrow. (Wrong)\n\nI will be in the UK tomorrow. (Correct)\n\nI will be in Republic of Benin tomorrow. (Wrong)\n\nI will be in the Republic of Benin tomorrow. (Correct)\n\nI will be in United States tomorrow. (Wrong)\n\nI will be in the United States tomorrow. (Correct)\n\nI will be in USA tomorrow. (Wrong)\n\nI will be in the USA tomorrow. (Correct)\n\nI congratulate President Trump on his election as 47th President of United States of America… (Wrong)\n\nI congratulate President Trump on his election as 47th President of the United States of America… (Correct)","summary":"“I congratulate President Trump on his election as 47th President of the United States of America, as well as Vice President-elect J.D. Vance and their families. “I also thank President Biden and Vice President Harris for their service to our country. “The strong turnout in this election is a sign of the health of our \n\n\n \n Read More","url":"https://punchng.com/donald-trump-three-grammar-lessons-from-george-bushs-congratulatory-message/","image":"https://cdn.punchng.com/wp-content/uploads/2020/08/25182115/Akeem-Lasisi.jpg","video":null,"publish_date":"2024-11-19 00:27:28","author":"Akeem Lasisi","authors":["Akeem Lasisi"],"language":"en","source_country":"ng","sentiment":0.28},{"id":265654218,"title":"MSNBC staffers slam ‘Morning Joe’ co-hosts after Mar-a-Lago summit with Trump: ‘Cowardice’","text":"More like Morning Oh-hell-no. \n\nMSNBC staffers were furious to learn that “Morning Joe” co-hosts Mika Brzezinski and Joe Scarborough met with President-elect Donald Trump at Mar-a-Lago over the weekend, and didn’t hold back in voicing their displeasure.\n\nOne unnamed employee vented to Fox News Digital, characterizing the meeting as “cowardice” and “disgusting but frankly unsurprising” — and saying the sit-down flew in the face of anti-Trump author and historian Tim Snyder’s on-air admonishment to the network to never “obey in advance.”\n\n“Five years of political warfare has deeply divided Washington and the country,” said Brzezinski, 57, as she opened Monday’s show with the stunning revelation.\n\n“Joe and I realize it’s time to do something different, and that starts with not only talking about Donald Trump, but also talking with him,” she added, noting that Trump was “cheerful and upbeat” during the private meeting, and seemed “interested in finding common ground” with Democrats.\n\nThe same employee told the outlet that MSNBC staff members had become “largely disdainful” of the left-wing network hosts in light of the news, calling them “opportunistic” for arranging to meet with Trump after spending two years demonizing him as the second coming of Adolf Hitler.\n\nMSNBC contributor Jennifer Rubin called the meeting “disgusting” on Bluesky, the social media platform attracting disaffected liberals who claim to be leaving Elon Musk-owned X.\n\nKatie Phang, host of the network’s “The Katie Phang Show,” made an oblique reference on X to the hosts’ visit, writing, “Normalizing Trump is a bad idea. Period.”\n\nThe employee echoed her sentiment, telling the outlet, “Katie Phang is right. It’s normalization (and it’s access bulls–t) … Journalists don’t need access to their subjects to hold them to account. None of it is believable. The obvious answer is believable: They are opportunists.”\n\nThe Comcast-owned cable news channel experienced a drastic 54% ratings dip in the election’s immediate aftermath, according to a report, as viewers’ grew tired of the network’s slanted coverage.\n\nThe co-hosts — who married in 2018 — also drew swift condemnation from outside the network, with some accusing the talking heads of grasping at ratings with their abrupt about-face, which followed more than two years of fomenting fear about Trump on a daily basis.\n\n“Bend the knee to the King in order to save their careers,” a person wrote on X.\n\n“Gutted by Joe and Mika this morning. Total capitulation after years of railing about his lack of fitness. Not even an interview to show their ‘journalistic integrity’. Just a pure kiss-the-ring session. Disappointed and done with them and their show,” a viewer tweeted.\n\n“This is why people don’t trust the mainstream media anymore. Joe and Mika who constantly attack ‘fascist’ Trump on their show, went to Mar a Lago to talk with Trump over the weekend,” said another.\n\nScarborough, 61, attempted to defend what many called abject hypocrisy, saying, “Don’t be mistaken, we are not here to defend or normalize Donald Trump.”\n\nThe summit was the first time the pair had seen the incoming president in seven years, Brzezinski said. \n\nTrump later told Fox News Digital that the meeting with the lefty morning show co-hosts was “extremely cordial” and lamented “that it wasn’t done long ago.”","summary":"More like Morning Oh-hell-no","url":"https://nypost.com/2024/11/18/us-news/msnbc-staffers-slam-morning-joe-co-hosts-after-mar-a-lago-summit-with-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/msnbc-staffers-slam-morning-joe-93912650.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/MSpNHEYW-RyIcpnTz.mp4","publish_date":"2024-11-19 00:27:00","author":"Chris Nesi","authors":["Chris Nesi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.259},{"id":265655294,"title":"Kyrgyzstan’s industrial production grows","text":"News Terminal\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nGreen Economy\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nConstruction\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nNuclear Program\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nCentral Asia\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nTurkmenistan\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\nSouth Caucasus\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\nAzernews.az\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\nCentral Asia\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\nKyrgyzstan’s industrial production grows\r\n\r\n\n\r\n\n\r\n\r\n\r\n19 November 2024 04:26 (UTC +04:00)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nAccess to paid information is limited\r\n\n\r\nIf You already have a account, please log in\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nSubscription to paid content\r\n\nGain access to all that Trend has to offer, as well as to premium, licensed content via subscription or direct purchase through a credit card.\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n10 news item\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\nSubscribe to paid news for 3 months\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nSee all packages\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\nKyrgyzstan’s industrial production grows\r\n\n\r\n04:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS coal exports set to rise in 2024, domestic production faces decline\r\n\n\r\n03:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nQazaqGaz, Gaffney Cline team up to implement projects in Kazakhstan\r\n\n\r\n02:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSnam’s Ravenna LNG terminal to begin operations in early 2025\r\n\n\r\n02:25 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nState-owned entities in Kyrgyzstan see hefty hike in asset accumulation\r\n\n\r\n01:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan plans major irrigation infrastructure expansion by 2028\r\n\n\r\n01:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nShell, bp, TotalEnergies, Equinor join forces on energy access goals\r\n\n\r\n01:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n“Earth Through Children’s Eyes\" photo exhibition opens at Heydar Aliyev Center (PHOTO)\r\n\n\r\n00:53 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHealth Ministers of Azerbaijan and Georgia meet within COP29 (PHOTO)\r\n\n\r\n00:18 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran keen on accelerating Rasht-Astara railway construction\r\n\n\r\n18 November 23:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's product imports from Azerbaijan decrease\r\n\n\r\n18 November 23:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan raises need criterion and living wage thresholds\r\n\n\r\n18 November 22:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS distillate fuel demand set to rise in 2025 - EIA\r\n\n\r\n18 November 22:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nADB to build student dormitories in Kazakhstan\r\n\n\r\n18 November 21:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPort logistics volume in Kazakhstan experiences growth\r\n\n\r\n18 November 21:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts event on \"Radiation and Climate Change: New Challenges\"\r\n\n\r\n18 November 20:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change impacts all aspects of existence - minister\r\n\n\r\n18 November 20:53 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan presents energy efficiency roadmap (PHOTO)\r\n\n\r\n18 November 20:49 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's Mouteh Gold Complex amplifies its gold bullion output\r\n\n\r\n18 November 20:46 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan features panel session on human capital development\r\n\n\r\n18 November 20:43 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change, among other factors, harms children's rights - official\r\n\n\r\n18 November 20:40 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEuropean neocolonialism: the ghost that won’t rest\r\n\n\r\n18 November 20:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's Nakhchivan reveals share of online registered local commercial entities\r\n\n\r\n18 November 20:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVice-President of Heydar Aliyev Foundation Leyla Aliyeva, Princess of Jordan and Director General of ICCROM watch “Mangurt” play (PHOTO)\r\n\n\r\n18 November 19:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPhoto report showcasing eighth day of COP29 in Azerbaijan's Baku (PHOTO)\r\n\n\r\n18 November 19:45 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku calls on global community: Combating climate change demands joint efforts\r\n\n\r\n18 November 19:35 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUK company to createforest ecosystem in Kazakhstan's Almaty region\r\n\n\r\n18 November 19:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan's foreign trade turnover hike\r\n\n\r\n18 November 19:27 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 Green Zone hosts panel on raising human capital for green future\r\n\n\r\n18 November 19:24 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVolume of gold produced in Azerbaijan revealed\r\n\n\r\n18 November 19:23 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazMunayGas increases refining depth indicator\r\n\n\r\n18 November 19:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani FM discusses regional situation with Vice-President of OSCE PA\r\n\n\r\n18 November 19:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nVolume of Azerbaijan's gas exports to Europe announced\r\n\n\r\n18 November 19:17 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRiding subway rise in Azerbaijan as more people hop on them\r\n\n\r\n18 November 19:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident of Kazakhstan arrives in Serbia for official visit\r\n\n\r\n18 November 19:08 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's Bahar Azadi gold coin tumbles in price\r\n\n\r\n18 November 19:06 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran unveils amount of tea leaves purchased from local farmers\r\n\n\r\n18 November 19:04 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan saying no to charging VAT for citizens buying Apple services domestically\r\n\n\r\n18 November 19:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change impact on human health feels worldwide - Azerbaijani health minister\r\n\n\r\n18 November 18:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 makes global call for eradication of landmines in Azerbaijan and beyond (PHOTO)\r\n\n\r\n18 November 18:54 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani MFA addresses views on European Council's Framework Convention for Protection of National Minorities\r\n\n\r\n18 November 18:52 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGreen skills to support shift to green economy - UK Parliamentary Under-Secretary of State\r\n\n\r\n18 November 18:34 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan to host event on International Aviation and Climate Change\r\n\n\r\n18 November 18:30 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan tallies volume of funds allocated in country for compulsory health insurance of population\r\n\n\r\n18 November 18:29 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n'Green' activities to foster greatly environmental protection - Georgian minister\r\n\n\r\n18 November 18:27 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan set to host ministerial talks on digitalization of Middle Corridor\r\n\n\r\n18 November 18:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani house in Prague opens Sunday school for children (PHOTO)\r\n\n\r\n18 November 18:17 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 approves Baku principles of human development for climate resilience\r\n\n\r\n18 November 18:09 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan House in Krakow, Poland marks November 8 - Victory Day (PHOTO)\r\n\n\r\n18 November 18:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA predicts US refinery capacity cuts to lead to rising gasoline, diesel margins\r\n\n\r\n18 November 18:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's household incomes grow\r\n\n\r\n18 November 18:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's state budget surplus for 2024 announced\r\n\n\r\n18 November 17:58 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazakhstan discloses coal supply figures for heating season\r\n\n\r\n18 November 17:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUS gas prices slide in October - EIA latest outlook\r\n\n\r\n18 November 17:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan tallies country's gas exports in 10M2024\r\n\n\r\n18 November 17:43 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani Clean Energy Jabrayil, Baku Steel Company ink memorandum on renewables (PHOTO)\r\n\n\r\n18 November 17:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29: Implementation of Baku's Master Plan until 2040 drives sustainable dev't of capital (PHOTO)\r\n\n\r\n18 November 17:35 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNatural gas production in US slows in 2024, growth predicted for 2025\r\n\n\r\n18 November 17:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's COP29 features panel discussion on investing in skills (PHOTO)\r\n\n\r\n18 November 17:16 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan seeks British investment for modernization of railway sector\r\n\n\r\n18 November 17:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses gas volume transported via country's main pipelines\r\n\n\r\n18 November 17:12 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA sees weak growth in global oil demand, with India driving most of increase\r\n\n\r\n18 November 17:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan signs MoU with Chinese TBEA on renewable energy (PHOTO)\r\n\n\r\n18 November 17:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan has no goal of switching to floating exchange rate - CBA governor\r\n\n\r\n18 November 17:01 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's Baku initiative group holds event on solidarity for green future (PHOTO)\r\n\n\r\n18 November 16:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijani-American Organizations Alliance sends congratulatory letter to Donald Trump (PHOTO)\r\n\n\r\n18 November 16:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Azerbaijan hosts Turkic NGOs' cooperative climate initiative forum\r\n\n\r\n18 November 16:51 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's 'green hospitals' project likely to become reality within five years - minister\r\n\n\r\n18 November 16:51 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHeydar Aliyev Foundation VP Leyla Aliyeva participates in discussions on strengthening environmental literacy among youth at COP29 (PHOTO)\r\n\n\r\n18 November 16:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA forecasts oil price spike in early 2025\r\n\n\r\n18 November 16:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nInternational logistics company's Azerbaijani branch winding down\r\n\n\r\n18 November 16:45 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nWe still far from halving global emissions this decade - UN official\r\n\n\r\n18 November 16:44 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHosting COP29 in fraternal Azerbaijan makes us happy - Turkish minister\r\n\n\r\n18 November 16:39 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan, Slovakia work out renewables cooperation\r\n\n\r\n18 November 16:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nLetter of intent signed to create “Baku COP Presidencies Continuity Coalition for Climate and Health” (PHOTO)\r\n\n\r\n18 November 16:33 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTransparency, inclusiveness and urgency remain key to COP29's success - official\r\n\n\r\n18 November 16:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 framework sees article adoption on non-market approaches - Mukhtar Babayev\r\n\n\r\n18 November 16:24 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses number of social benefits and pensions in country in 10M2024\r\n\n\r\n18 November 16:23 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku Initiative Group holds protest against nuclear tests in colonial territories (PHOTO)\r\n\n\r\n18 November 16:15 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 makes decision on work program under Paris Agreement's non-market approaches\r\n\n\r\n18 November 16:13 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGlobal unity for climate change fight shines through COP29 - EU representative\r\n\n\r\n18 November 16:11 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKeeping global warming to 1.5 degrees remains possible - European commissioner\r\n\n\r\n18 November 16:06 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nHeatwaves significantly impair educational performance - UNICEF\r\n\n\r\n18 November 16:06 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts discussions on restoration of Absheron lakes, climate stability, and sustainable water management\r\n\n\r\n18 November 16:02 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan to imprison havoc-unlishers to ecosystem\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEIA updates forecast on Azerbaijan's oil output in 2025\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's state budget envisages oil price at $70 - minister\r\n\n\r\n18 November 15:59 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nJICA to provide grant for modernization of Kyrgyzstan's air navigation equipment\r\n\n\r\n18 November 15:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nISESCO developing global dashboard to track progress in green education\r\n\n\r\n18 November 15:52 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 ICESCO Pavilion launches framework for introducing 'green' education in Islamic world\r\n\n\r\n18 November 15:47 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTürkiye develops education strategy to support green economy transition - minister\r\n\n\r\n18 November 15:42 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev appoints consul general of Azerbaijan to Los Angeles, US - decree\r\n\n\r\n18 November 15:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNew collective quantitative target must сonsider children's needs - UNICEF\r\n\n\r\n18 November 15:37 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan unveils growth of consumer prices\r\n\n\r\n18 November 15:36 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRelations between Turkic states progressing rapidly across all sectors - Azerbaijani official\r\n\n\r\n18 November 15:31 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev appoints new consul general of Azerbaijan to Türkiye's Kars city\r\n\n\r\n18 November 15:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan appoints its new consul general in Batumi, Georgia - decree\r\n\n\r\n18 November 15:26 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan announces its oil production volume for 10M2024\r\n\n\r\n18 November 15:25 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan designates consul general in city of Aktau, Kazakhstan - decree\r\n\n\r\n18 November 15:24 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB names priority spheres of cooperation with Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGovernment obtains social benefit hike assignment - minister\r\n\n\r\n18 November 15:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB eyes to add new partner banks to its network in Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:05 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan's strategic foreign exchange reserves multiply - deputy minister\r\n\n\r\n18 November 15:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBSTDB president talks about new country strategy for Azerbaijan (Exclusive)\r\n\n\r\n18 November 15:02 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan does much to mitigate climate change - minister\r\n\n\r\n18 November 15:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan fully committed to development of climate education - official\r\n\n\r\n18 November 14:58 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan counts revenues and expenditures of Unemployment Insurance Fund\r\n\n\r\n18 November 14:56 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan advocates for climate change integration into PISA framework - minister\r\n\n\r\n18 November 14:52 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan makes several novelties in its draft budget for 2025\r\n\n\r\n18 November 14:44 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nGermany becomes sixth main trading partner of Azerbaijan - AZPROMO\r\n\n\r\n18 November 14:33 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKyrgyzstan discloses GDP growth rate for 10M2024\r\n\n\r\n18 November 14:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nLa Gazette du Caucase blasts French politicians for undermining COP29 with Armenian bias\r\n\n\r\n18 November 14:20 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts ministerial roundtable on greening education\r\n\n\r\n18 November 14:19 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan discloses weekly mine clearing progress in liberated territories\r\n\n\r\n18 November 14:15 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan hikes minimum living wage and poverty line for 2025 budget - minister\r\n\n\r\n18 November 14:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan set to acquire new demining equipment\r\n\n\r\n18 November 14:00 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSignificant financial surplus expected by year-end - chairman\r\n\n\r\n18 November 13:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nColonized nations face environmental challenges - Kenyan MP\r\n\n\r\n18 November 13:47 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan unveils minimum pension level for next year\r\n\n\r\n18 November 13:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan boosts defense allocations in state budget for 2025\r\n\n\r\n18 November 13:38 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEU set to end free emissions quotas by 2039 - Cefic director general\r\n\n\r\n18 November 13:34 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMinimum wage prepares to ascend to new heights in Azerbaijan\r\n\n\r\n18 November 13:32 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts panel discussion on accelerating global industrial and energy decarbonization (PHOTO)\r\n\n\r\n18 November 13:30 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan pulls back curtain on its inflation forecast for 2025\r\n\n\r\n18 November 13:27 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan betting uptick in average monthly salary by 2025\r\n\n\r\n18 November 13:22 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP for Hope: COP29 in Baku marks new milestone in COP events history - German Vice Chancellor (Exclusive)\r\n\n\r\n18 November 13:17 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran's petrochemical sector to capture most carbon emissions soon - federation secretary\r\n\n\r\n18 November 13:08 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nKazakhstan becomes part of Hydrogen Breakthrough Agenda\r\n\n\r\n18 November 13:07 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMitigating risks in transition to zero emissions requires focus on four key areas - WB\r\n\n\r\n18 November 13:03 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCentral Bank of Azerbaijan discloses inflation forecast by end of 2024\r\n\n\r\n18 November 12:51 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nMalaysia reveals its renewable energy share target by 2050\r\n\n\r\n18 November 12:38 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nUN Secretary-General calls on G20 leaders to support COP29 goals\r\n\n\r\n18 November 12:33 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change significantly impacts labor market - Azerbaijani minister\r\n\n\r\n18 November 12:30 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEU to focus on implementation and investment in next five years - Commissioner for Climate Action\r\n\n\r\n18 November 12:28 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCombating climate change requires focusing on health - Dutch minister\r\n\n\r\n18 November 12:23 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets with Secretary-General of Commonwealth (VIDEO)\r\n\n\r\n18 November 12:19 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 in Baku adopts declaration on strengthening co-op on declining Caspian Sea levels\r\n\n\r\n18 November 12:18 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEBRD invests in Azerbaijan’s solar power expansion at COP29\r\n\n\r\n18 November 12:10 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nClimate change demands thorough reevaluation of our way of life - Italian minister\r\n\n\r\n18 November 11:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSeveral billion people stand vulnerable to climate change impacts - Adaptation Fund chair\r\n\n\r\n18 November 11:56 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nEquinor expands Norwegian drilling operations with new rig contract\r\n\n\r\n18 November 11:50 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nNar’s environmental training concludes with a meeting with an international expert (PHOTO)\r\n\n\r\n18 November 11:42 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran releases currency exchange rates for November 18\r\n\n\r\n18 November 11:36 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nIran’s IRENEX reveals products to be on sale for November 18\r\n\n\r\n18 November 11:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBank Respublika and FMO sign major loan agreement at COP29\r\n\n\r\n18 November 11:34 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nSignificant efforts crucial for enhancing teachers' knowledge of climate change - minister\r\n\n\r\n18 November 11:32 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nWorld Bank tackles climate risks in S. Caucasus with focus on sustainable infrastructure - regional director\r\n\n\r\n18 November 11:31 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nBaku Initiative reflects Azerbaijan's commitment to human-centered climate action - COP29 Lead Negotiator\r\n\n\r\n18 November 11:28 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRussian presidential envoy set to address COP29 on BRICS nations' climate cooperation\r\n\n\r\n18 November 11:26 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets with President of Palau (PHOTO/VIDEO)\r\n\n\r\n18 November 11:21 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts meeting on Investing in Human Development for Climate Resilient Future (PHOTO)\r\n\n\r\n18 November 11:20 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev sends congratulatory letter to Sultan of Oman\r\n\n\r\n18 November 11:13 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAzerbaijan plays important role, greatly contributing to provision of BTRs - official\r\n\n\r\n18 November 11:09 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTürkiye working to create fair transition-based sectoral infrastructure for green transformation\r\n\n\r\n18 November 10:59 (UTC+04)\r\nGreen Economy\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nCOP29 hosts ECO ministerial meeting on circular economy (PHOTO)\r\n\n\r\n18 November 10:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nPresident Ilham Aliyev meets Russia's finance minister, head of Liberal Democratic Party (PHOTO/VIDEO)\r\n\n\r\n18 November 10:57 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nRealize your year-end plans with a Yelo Bank loan!\r\n\n\r\n18 November 10:55 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nAIIB signs landmark private sector solar PV project in Azerbaijan at COP29\r\n\n\r\n18 November 10:52 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nTransparency remains key to global climate action efforts - COP29 Lead Negotiator\r\n\n\r\n18 November 10:48 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\nFinancial mechanism needs to be created to help small island states - Member of Parliament of Tonga\r\n\n\r\n18 November 10:40 (UTC+04)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nTerms of use\r\n\r\n\n\r\n\r\n\r\n\n\r\nNews terminal\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n© 2024 Trend News Agency\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\nForgot password?\r\n\r\n\nOther ways to register\r\n\n\r\n\n\r\n Login with Facebook\r\n\r\n\n\r\n Login with Google\r\n\r\n\n\r\n Login with Twitter\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\nOther ways to register\r\n\n\r\n\n\r\n Login with Facebook\r\n\r\n\n\r\n Login with Google\r\n\r\n\n\r\n Login with Twitter\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\nPassword reset","summary":"","url":"https://en.trend.az/casia/kyrgyzstan/3971781.html","image":"/imagen/3971781","video":null,"publish_date":"2024-11-19 00:26:00","author":null,"language":"en","category":"politics","source_country":"az","sentiment":0.442},{"id":265654596,"title":"PM Wong congratulates Trump on winning US election in phone call with president-elect","text":"SINGAPORE: Singapore Prime Minister Lawrence Wong said on Tuesday (Nov 19) that he had spoken to US president-elect Donald Trump and congratulated him on his election victory in a phone call.\n\nIn a Facebook post, Mr Wong noted that the US-Singapore partnership is \"strong and dynamic\", and is \"built on a deep reservoir of mutual trust and shared interests\".\n\n\"I look forward to working with the president and his team to deepen our bilateral ties,\" Mr Wong added.","summary":"","url":"https://www.channelnewsasia.com/singapore/pm-lawrence-wong-congratulates-donald-trump-winning-us-presidential-election-phone-call-4755591","image":"https://onecms-res.cloudinary.com/image/upload/s--tYkCcLXI--/c_crop,h_1152,w_2048,x_0,y_50/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2024/11/19/467436538_1116728296479315_5049016496032620213_n.jpg?itok=aGtMM0YB","video":null,"publish_date":"2024-11-19 00:24:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.044},{"id":265654004,"title":"Effort to stop NK military support for Russia needs to go in parallel with denuclearization push: FM","text":"Any attempt to end North Korea's military support for Russia's war in Ukraine needs to proceed in parallel with a push to denuclearize the North, Seoul's chief diplomat said Monday, stressing Pyongyang's backing for Moscow is reshaping security dynamics in the Indo-Pacific and Europe.\n\nIn a message to an annual forum, Cho voiced optimism that the South Korea-US alliance will continue to \"thrive\" under the incoming Trump administration, despite concerns that President-elect Donald Trump's America First credo could weaken partnerships with allies and partners.\n\n\"Its troops and weapons deployed to Russia are directly threatening Europe and reshaping security dynamics in the Indo-Pacific and Europe,\" Cho said in the video message for the South Korea-US Strategic Forum co-hosted by the Center for Strategic and International Studies and the Korea Foundation.\n\n\"Thus, any attempt to end the war in Ukraine would be inadequate without addressing North Korea's illicit assistance to Russia's war efforts. And any attempt to stop North Korea's military support for Russia's aggression would be incomplete without a parallel push to denuclearize North Korea,\" he added.\n\nA deepening military alignment between Moscow and Pyongyang has been a source of growing concern for both Seoul and Washington as the North's material and personnel support to Russia could expand the war in Ukraine and the two countries' cooperation could have security implications on the Korean Peninsula.\n\nOn the future of the alliance between Seoul and Washington, Cho expressed his confidence, offering a set of reasons, including the fact that American support for the alliance \"cuts across party lines.\"\n\n\"The importance of the Nuclear Consultative Group and of strengthening extended deterrence is widely understood,\" he said. \"Support runs deep for further expanding the alliance's horizon to cyberspace and outer space and for broadening our trade and investment partnership to include shipbuilding and servicing, semiconductors, batteries, AI and nuclear domains, among others.\"\n\nNCG is a key nuclear deterrence body between Seoul and Washington, while extended deterrence refers to Washington's commitment to using the full range of its military capabilities, including nuclear weapons, to defend its Asian ally.\n\nThe foreign minister also reiterated the Yoon Suk Yeol administration's determination to assume responsibilities commensurate with Korea's strength, saying that it \"comports very well with the expectation that allies must pull their weight.\"\n\n\"Seoul, too, is committed to maintaining peace through strength and making sure that its defense spending is robust. Only three US allies and partners -- Israel, Greece, Poland -- spend more on defense as a percentage of GDP than Korea,\" he said.\n\nIn addition, Cho underscored the importance of cooperation with Japan and other partners to confront global challenges.\n\n\"Deepening ROK-US-Japan trilateral cooperation and advancing collaboration with like-minded nations across the Indo-Pacific and in Europe, whether through NATO or the G7, will remain as critical as ever in addressing this and other complex challenges facing our world,\" he said.\n\nROK stands for South Korea's official name, the Republic of Korea. (Yonhap)","summary":"Any attempt to end North Korea&#039;s military support for Russia&#039;s war in Ukraine needs to proceed in parallel with a push to denuclearize the North, Seoul&#039;s chief diplomat said Monday, stressing Pyongyang&#039;s backing for Moscow is re","url":"https://www.koreaherald.com/view.php?ud=20241119050005","image":"https://res.heraldm.com/content/image/2024/11/19/20241119050000_0.jpg","video":null,"publish_date":"2024-11-19 00:22:50","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"KR","sentiment":0.264},{"id":265653504,"title":"Don Lemon Unconcerned About Elon Musk’s Impact on Donald Trump","text":"Don Lemon isn’t losing sleep over Elon Musk‘s influence on President-elect Donald Trump … though, he does think people should be concerned about billionaires’ control of the media.\n\nWe caught up with the newsman at LAX a day before he announced his decision to exit Musk’s social media site … and he shared his 2 cents on the Tesla CEO’s close relationship with the soon-to-be 47th President of the United States.\n\nAs Lemon put it … Trump’s win doesn’t heighten Musk’s impact, as the businessman already had a massive reach given his net worth and resources. Lemon is doubtful Musk would step into an official role in Trump’s administration, theorizing the tech magnate would follow in the footsteps of billionaires before him … influencing the prez from behind the scenes.\n\nHe continued … “We’ve always had rich people who’ve had huge influence over our country, especially our media. Look at Howard Hughes and others. History repeats itself.”\n\nHowever, Lemon’s assessment of the situation may be a bit off the mark … as Trump has announced he’s appointing Musk and Vivek Ramaswamy to lead what he’s calling the Department Of Government Efficiency, an organization that doesn’t exist yet — and no further details have been released.\n\nThe proposed new department is already sparking controversy given Musk and Ramaswamy’s respective businesses have potential conflicts of interest … particularly with Musk’s government contracts involving SpaceX, for example.\n\nTrump announced the appointments Wednesday, when he explained the businessmen would “provide advice and guidance from outside of Government.”\n\nLemon, who famously feuded with Musk over his canceled show on X, departed the platform over claims the site was not a place for “honest debate.”\n\nA lot has changed in less than 24 hours. Stay tuned!","summary":"Don Lemon isn&#8217;t losing sleep over Elon Musk&#8216;s influence on President-elect Donald&#8230;","url":"https://internewscast.com/entertainment/don-lemon-unconcerned-about-elon-musks-impact-on-donald-trump/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Don-Lemon-Not-Worried-About-Elon-Musk039s-800x430.jpg","video":null,"publish_date":"2024-11-19 00:22:43","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.26},{"id":265652952,"title":"“Mia Thornton’s Former Husband Declines to Appear on Camera with Her New Partner”","text":"Entertainment\n\nSupport Our Cause\n\nIndia’s strengthening connections with natural gas\n\nNovember 3, 2024\n\nWho Is Amy Wood Husband And Net Worth: Does She Has A Page There? Family & Wikipedia – Meet Her Daughter\n\nJanuary 13, 2022\n\nSearch Continues For Suspects In Florida Shooting That Left 2 Dead, 21 Injured\n\nJune 1, 2021\n\nDiddy’s 17-year-old daughters go to prom as he says sorry for assaulting his ex-girlfriend Cassie Ventura in a disturbing video\n\nMay 20, 2024\n\nWhat sets Project 2025 apart from other policy wish lists?\n\nSeptember 11, 2024\n\n Order Now - 50% Off + Free Shipping \n\nEntertainment\n\nSupport Our Cause \n\nSearch for:\n\n“Mia Thornton’s Former Husband Declines to Appear on Camera with Her New Partner”\n\nRecap of Day 2: Surveillance footage plays crucial role in the trial of a man charged with the murder of Laken Riley.\n\nPublished on 19 November 2024\n\nInternewscast \n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nYou May Also Like\n\nLil Durk Attends Court Hearing as Potential Trial Date is Set\n\nInternewscast\nNovember 18, 2024\n\n22-year-old Nephew Fatally Shoots Police Officer Uncle Due to Feelings of Neglect, Says District Attorney\n\nNovember 19, 2024\n\nSean Duffy, Fox Host and Real World Star, Picked by Trump for Cabinet Role\n\nNovember 19, 2024\n\nSean Duffy, Former Real World Star and Fox Host, Chosen by Trump for Cabinet Role\n\nNovember 19, 2024\n\nRecap of Day 2: Surveillance footage plays crucial role in the trial of a man charged with the murder of Laken Riley.\n\nNovember 19, 2024\n\nEric Johnson, Jessica Simpson’s husband, spotted without wedding band for the first time amidst divorce speculations\n\nNovember 19, 2024\n\nRecap of Day 2: Surveillance footage plays crucial role in the trial of a man charged with the murder of Laken Riley.\n\nPolice officers described searching the man’s apartment and questioning him and…\n\nInternewscast\nNovember 19, 2024\n\nEntertainment\n\nNew District Attorney Given Authority in Menendez Brothers’ Case by California Governor\n\nCalifornia Governor Gavin Newsom has kicked the can down the road in…\n\nInternewscast\nNovember 19, 2024\n\nEntertainment\n\nTrump Chooses Sean Duffy from Fox Business to Head Department of Transportation and Enhance Safety in the Skies\n\nSean Duffy is entering the real world of Washington D.C., with Donald…\n\nInternewscast\nNovember 19, 2024\n\nMEOVV’s “TOXIC” Video Marks the Start of a Dreamy New Chapter for the Up-and-Coming Band\n\nThe stars of MEOVV have gone and set the music world ablaze…\n\nInternewscast\nNovember 19, 2024\n\nInternewscast Journal\n\nAdvertise / Guest Post\nBBCGist Health\nTerms and Conditions\nSupport Our Cause\n\nCopyright 2023. All Right Reserverd\n\nGet the Latest Updates and Happening around the Globe. Click to Subcribe","summary":"","url":"https://internewscast.com/life-style/mia-thorntons-former-husband-declines-to-appear-on-camera-with-her-new-partner/","image":"https://internewscast.com/wp-content/uploads/2024/11/Lil-Durk-Appears-In-Court-As-Tentative-Trial-Date-Is-380x200.jpg","video":null,"publish_date":"2024-11-19 00:17:36","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.204},{"id":265656662,"title":"Geneva Dry Dialogues: Precious Shipping","text":"Making predictions in shipping is akin to chewing glass, Khalid Hashim, managing director of Thailand’s largest dry bulk owner, Precious Shipping.\n\n“Only the insane would do that,” he says, stressing: “Predictions in shipping are always wrong.”\n\nNevertheless, when pressed to give his take on where the dry bulk markets will be come the end of April next year when he takes the stage at Geneva Dry, the world’s premier commodities shipping conference, Hashim says a huge amount depends on the type, and amount of stimulus China will put into its economy.\n\n“That will be the major event that could push the dry bulk markets significantly. China is not going to show their hand till such time as they see what barriers Trump enacts against the Chinese economy, and then, and only then, will they enact counter measures to support their economy,” Hashim says.\n\nOn the return of Donald Trump to the White House, Hashim is sanguine – tariffs have not stymied ton-miles thus far, he points out.\n\n“Trade flows under Trump 1.0 and Biden’s continuation and increasing Trump’s 1.0 into Biden 1.0, have increased, not decreased, trade flows into the US,” he points out. “If the past is any predictor of trade flows, then as we have seen all such disruptions tend to have an immediate, but extremely short-term impact, before leading to increased ton-mile and increased trade.”\n\nHashim will join Emilie Nourry, head of shipping at Eramet, Karim Coumine, manager of chartering for minor bulks at Anglo American, and William Fairclough, the managing director of Wah Kwong Maritime Transport Holdings, on April 28 next year for a new session at Geneva Dry looking at how electric vehicles are supercharging dry bulk.\n\n“EVs will require more power, as more and more people will be making EVs their choice of urban transport. As the total number of EVs increases, the power draw down will keep on increasing world over,” Hashim says, suggesting that coal-fired power plants will remain vital to electricity grids everywhere for many years to come.\n\nWith more than 35 sponsors already onboard and more than 100 delegates signed up, Geneva Dry 2025, scheduled for April 28 and 29, is set to welcome back familiar sessions such as iron ore, coal, agri-commodities, minor bulks and dry decarbonisation, as well as featuring some new panels including a 50-minute special on forward freight agreements, a chartering spotlight, while digital efficiency drivers at port and then at sea will form the first two sessions on Day Two.\n\nCompanies attending include 2020 Bulkers, Anglo American, BPG Shipping Company, Cargill, Cetus Maritime, CTM, Eastern Mediterranean Maritime, Enesel, Eramet, Fednav, Fortescue, G2 Ocean, Heidelberg Materials Trading, Himalaya Shipping, Mandarin Shipping, Marfin Management, Metbulk Shipping, Norbulk Shipping, Nova Marine Carriers, Precious Shipping, Seanergy Maritime Holdings, Star Bulk, SwissMarine, Taylor Maritime Investments, Trafigura, United Maritime Corporation, Vale, Wah Kwong Maritime Transport Holdings, and Western Bulk.\n\nThe full Geneva Dry agenda can be accessed here.Geneva Dry registration, at just $780, can be accessed here.Special Geneva Dry hotel room rates can be found here.","summary":"Making predictions in shipping is akin to chewing glass, Khalid Hashim, managing director of Thailand’s largest dry bulk owner, Precious Shipping. “Only the insane would do that,” he says, stressing: “Predictions in shipping are always wrong.” Nevertheless, when pressed to give his take on where the dry bulk markets will be come the end of &#8230;","url":"https://splash247.com/geneva-dry-dialogues-precious-shipping/","image":"https://splash247.com/wp-content/uploads/2024/11/Khalid-Hashim.jpg","video":null,"publish_date":"2024-11-19 00:16:04","author":"Splash","authors":["Splash"],"language":"en","source_country":"sg","sentiment":0.053},{"id":265652486,"title":"Donald Trump Wouldn't Use Special Counsel for 'Political Vendetta': Lawyer","text":"Donald Trump is unlikely to push for the appointment of a special prosecutor to \"pursue vendettas\" against political opponents according to a former U.S. attorney, who argued the incoming president is more likely to \"weaponize\" the Justice Department as a whole.The claim was made by Preet Bharara, the former U.S. attorney for the southern district of New York, in a recent episode of his Stay Tuned With Preet podcast. Prosecutor Jack Smith was appointed as special counsel in November 2022 by Attorney General Merrick Garland to oversee two separate investigations into Trump. These were allegations he had broken the law attempting to overturn the 2024 presidential election and that he mishandled classified documents, both of which the former president denied.In July, Judge Aileen Cannon dismissed the classified documents case, which she had been overseeing, on the basis that Smith's appointment was unconstitutional. Last week, The New York Times reported Smith plans to resign as special counsel before Trump begins his second presidency in January.Speaking in June 2023, Trump said that if returned to the White House, he would \"appoint a real special prosecutor to go after\" President Biden along with \"all others involved with the destruction of our elections, borders, & country itself!\"During a WABC radio interview in October, Trump also suggested that Smith should be exiled.He said: \"You have to get the killers, the murders, and mentally deranged, you have to get them out. And we should throw Jack Smith out with them, the mentally deranged people. Jack Smith should be considered mentally deranged, and he should be thrown out of the country.\"On his podcast, Bharara suggested Cannon's dismissal of Trump's classified documents case on the basis Smith was unconstitutionally appointed as special counsel could make it harder for the incoming president to appoint a special counsel of his own to target political rivals.However, Bharara went on to argue this wouldn't matter as Trump wouldn't want someone with \"punitive independence\" from the Department of Justice to lead any investigations.Referring to the possibility of Trump targeting \"political adversaries\" he said: \"I think at the end of the day, if he pursues such things, he's not going to want that to be done by someone who has punitive independence and separation from the department. If he's going to weaponize the department, he's going to weaponize the department.\"Newsweek contacted representatives for Donald Trump by email on Monday.In May 2024, Trump became the first former president with a felony record in American history after he was convicted of 34 counts of falsifying business documents to cover up the payment of hush money to a former adult film actress ahead of the 2016 presidential election.Sentencing is due on November 26 though speaking to Newsweek Professor David Driesen, a constitutional law professor at Syracuse University, said Trump is highly unlikely to serve a prison sentence while president.He said: \"The Supreme Court may invent new law to keep Trump out of jail if New York Justice Juan Merchan sentences him to prison while his time in office.\"The high court has already shown a willingness to protect Trump, especially when it granted him immunity from criminal trial for official misconduct in Trump v. United States.\"","summary":"Trump previously said he would \"appoint a real special prosecutor to go after\" Biden if he secured a second White House term.","url":"https://www.newsweek.com/donald-trump-wouldnt-use-special-consul-political-vendetta-lawyer-1987942","image":"https://d.newsweek.com/en/full/2524156/donald-trump.jpg","video":null,"publish_date":"2024-11-19 00:15:31","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.423},{"id":265654492,"title":"Trump issues World War III warning","text":"U.S. President Elect Donald Trump has issued an emergency World War III warning, calling for a ceasefire between Ukraine and Russia to prevent nuclear war. Trump's call comes after U.S. President Joe Biden authorized the use of U.S. made long-range weapons in Ukraine to potentially strike deep inside Russia. Russian President Vladimir Putin subsequently warned Biden and others that Russia may be on the cusp of war with NATO. According to some sources, 100,000 North Korean soldiers are being deployed to Ukraine. Others say they are already fighting in smaller numbers.\"We have never been closer to World War Three than we are today, under Joe Biden,\" said Trump in a broadcast. \"A global conflict between nuclear armed powers would mean death and destruction on a scale unmatched in human history. It would be nuclear Armageddon. Nothing is more important than avoiding that nightmare. We will avoid it, but we need new leadership. Every day this proxy battle in Ukraine continues, we risk global war. We must be absolutely clear that our objective is to immediately have a total secession of hostilities, all shooting has to stop.\" Trump regains control of the White House in January.","summary":"U.S. President Elect Donald Trump has issued an emergency World War III warning, calling for a ceasefire between Ukraine and Russia to prevent nuclear war.","url":"https://www.westernstandard.news/news/trump-issues-world-war-iii-warning/59584","image":"https://media.assettype.com/westernstandard/2024-11-18/k1zayzex/Screenshot-2024-11-18-at-4.52.25-PM.png?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2024-11-19 00:15:09","author":"James Snell","authors":["James Snell"],"language":"en","category":"politics","source_country":"ca","sentiment":0.086},{"id":265654832,"title":"MAGA Mom Reveals Donald Trump's Election Win Was 'Better Than The Birth' of Her Kids","text":"Supporters packed into the Donald Trump election watch party in Palm Beach, Florida, waiting eagerly for the results. The air was heavy with energy. The night felt 'better than the birth' of her children, said 47-year-old mother of three, Carla Martin. Even though she was kidding, there was some truth to it. Martin was out there dancing and enjoying the scene while surrounded by American flags and people sporting red MAGA caps.\n\nThe enthusiasm of many Trump fans was shown by Mike Cordeiro, a Florida small business owner. He remarked, \"It's amazing,\" as the victory completely changed the trajectory of American politics. His enthusiasm perfectly expressed the emotions of many conservatives who saw Trump's victory as their opportunity to significantly impact the nation. It wasn't simply politics for some. Republican college student Reagan Faulkner discussed feeling liberated. She compared it to a scene in Home Alone where terror simply vanishes, saying, \"I think that's the overwhelming feeling that conservatives have,\" according to the New York Times.\n\nPeople, however, were affected by the election outcomes in various ways. Georgia utility worker Bill Womack stated clearly that he believed Trump's promises. \"He's going to start drilling, drilling, drilling. Prices are going to drop — on food, on everything,\" Womack predicted with characteristic enthusiasm. Religious communities also celebrated the win. On Fox News, Ainsley Earhardt talked about the spiritual side of things. She mentioned viral videos where Trump supporters were singing hymns and pointed out how big of a deal the abortion issue was for evangelical voters.\n\nRonnie Graham, a business broker from North Carolina, saw divine intervention in Trump's victory. \"I believe that God has saved him and saved his life, spared his life so he can help bring back our republic,\" Graham declared, reflecting the deep spiritual conviction among some supporters. Yet, the victory was not without complexity. Some supporters acknowledged Trump's controversial past while maintaining their belief in his potential. Chuck Seger from Maine candidly admitted, \"He said a few things that were pretty ridiculous, but I'm OK with it. The world needs to be woken up.\"\n\nInteresting findings about voters' expectations and feelings were also revealed by polling data. The majority of Trump and Harris supporters believed their candidate would win initially; approximately 76% of Trump supporters and 74% of Harris backers were fairly certain that their candidate would win. However, feelings were all over the place after the election. 72% of Trump supporters expressed relief, while 69% expressed happiness. The majority of Harris voters were depressed, with 73% feeling hopeless and 62% concerned about the future, according to YouGov.\n\nTrump's victory was largely due to economic factors. A huge 74% of Americans said the economy and inflation were big factors in the election. The second biggest reason, for 65% of people, was immigration. Interestingly, voters were considering more than simply policies. For many, Trump was more than simply another politician. Many saw him as a voice for people who felt excluded by the established political system and a symbol of change in their eyes.","summary":"Many saw Trump as a voice for people who felt excluded by the established political system and a symbol of change in their eyes.","url":"https://www.inquisitr.com/maga-mom-reveals-donald-trumps-election-win-was-better-than-the-birth-of-her-kids","image":"https://dab57h0r8ahff.cloudfront.net/724529/uploads/bcdf3a20-a289-11ef-85cd-1d570f288ccd_1200_630.jpeg","video":null,"publish_date":"2024-11-19 00:15:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","category":"politics","source_country":"US","sentiment":0.166},{"id":265652950,"title":"Trump Chooses Sean Duffy from Fox Business to Head Department of Transportation and Enhance Safety in the Skies","text":"Sean Duffy is entering the real world of Washington D.C., with Donald Trump tapping the Fox Business host and former Representative of Wisconsin as his secretary of transportation. Duffy will replace Pete Buttigieg, who was selected by sitting President Biden to lead the department under his administration.\n\nDuffy represents a double-dip into the bin of Fox personalities for Trump. The President-elect had previously announced that “Fox & Friends Weekend” co-host Pete Hegseth would be appointed secretary of defense. Unlike Hegseth, Duffy has legislative experience, having served as a U.S. Representative from 2011 to 2019. He resigned in 2019 for personal reasons, disclosing that his newborn daughter had been diagnosed with a heart defect.\n\nPrior to his 2010 campaign for the House of Representatives, Duffy had been appointed the District Attorney of Ashland County in Wisconsin in 2002.\n\nDuffy first entered the public eye in his late twenties, featured as a star on “The Real World: Boston,” the sixth season of MTV’s landmark reality TV series. He also competed on the first season of “The Challenge” — known in 1998 as “Road Rules: All Stars” — where he met his wife Rachel Campos. In 2022, he joined Fox Business to co-host “The Bottom Line” with Dagen McDowell.\n\nIn a statement, Trump said that Duffy “will prioritize Excellence, Competence, Competitiveness and Beauty when rebuilding America’s highways, tunnels, bridges and airports. He will ensure our ports and dams serve our Economy without compromising our National Security, and he will make our skies safe again by eliminating DEI for pilots and air traffic controllers.”","summary":"Sean Duffy is entering the real world of Washington D.C., with Donald&#8230;","url":"https://internewscast.com/entertainment/trump-chooses-sean-duffy-from-fox-business-to-head-department-of-transportation-and-enhance-safety-in-the-skies/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Fox-Business-Host-Sean-Duffy-Tapped-by-800x430.jpg","video":null,"publish_date":"2024-11-19 00:13:33","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.065},{"id":265652694,"title":"‘We will never let up’ over Ukraine, Lammy tells Russia","text":"The UK will “never let up” in backing Ukraine, the Foreign Secretary said, as the war entered its 1,000th day and questions lingered over whether British-supplied missiles could be authorised to hit targets within Russia.\n\nDavid Lammy warned that faith in international law may “never return” unless Vladimir Putin fails as he attended a UN Security Council session on Monday.\n\nIt follows speculation that the UK could follow the US after President Joe Biden allowed Ukraine to use American-supplied weapons to strike sites in Russia after months of pressure from Ukrainian President Volodymyr Zelensky.\n\nAddressing delegates in New York, Mr Lammy said: “Unless Putin fails, we could plunge into a world where the principles inscribed in the UN charter will have lost their meaning.\n\n“Unless Putin fails, others will be inspired to wage imperialist wars of conquest. Unless Putin fails, our faith in international law may never return. Unless Putin fails, each of our borders will be less safe.\n\n“If anyone (is) doubting Putin’s intent, this weekend’s massive missile attack on Ukraine and its energy infrastructure should serve as a reminder Putin wants to plunge Ukraine into darkness.”\n\nRussia launched a massive missile and drone strike over the weekend, which targeted Ukraine’s energy infrastructure.\n\nMr Lammy’s message comes as Kyiv and Western allies brace for a possible change of US stance under Donald Trump, who has said he could end the war “in a day”.\n\nOutgoing president Mr Biden has given Ukraine permission to use US-supplied weapons to strike targets in Russia after months of pressure from Mr Zelensky.\n\nThe move fuelled speculation that the UK Government, which has been reluctant to authorise the use of Franco-British Storm Shadow missiles in Russia without a shift in US policy, may follow suit.\n\nMinisters on Monday hinted at a possible change, saying Britain was working in close co-operation with America and would align with allies in ensuring Kyiv could make use of the capabilities that had been offered.\n\nHowever, the White House is yet to authorise the use of Storm Shadow missiles – which use American navigation data – in Russia, The Sun reported.\n\nThe Kremlin said the move would change the nature of Western involvement in the conflict.\n\n“It is obvious that the outgoing administration in Washington intends to take steps and they have been talking about this, to continue adding fuel to the fire and provoking further escalation of tensions around this conflict,” spokesman Dmitry Peskov told reporters after Mr Biden’s decision.\n\nThe UK Government said on Monday it would not be drawn on “operational details” regarding the missiles because to do so would “only play into the hands of Putin.”\n\nAsked how concerned he was about the change of US leader as he spoke with the press outside the UN Security Council meeting, the Foreign Secretary said: “I’ve studied in this country, I’ve worked in this country, and I know that there’s a simple rule: one president at a time.\n\n“We’re dealing with President Biden and we are committed to putting Ukraine in the strongest possible position.”\n\nHe added: “We will help keep the lights of Ukraine on in the face of Putin’s aggression, and that matters not just for Ukraine’s security, Britain’s security or indeed Europe’s security.”\n\nPrime Minister Sir Keir Starmer has said that Ukraine is “number one” on his agenda at the G20 summit in Brazil, though he is not expected to hold meetings with Mr Biden or French President Emmanuel Macron on Tuesday.\n\nSpeaking to broadcasters, he said: “Tomorrow is day 1,000 of the conflict, that’s 1,000 days of aggression from Russia and 1,000 days of sacrifice from Ukraine.\n\n“So that is my clear message here. It’s number one on my agenda.”\n\nDowning Street said the summit would offer Sir Keir an opportunity to encourage allies to “double down” in their support after the Russian attack on Ukraine’s energy infrastructure.\n\n“We’ve seen in recent days the lengths that Putin will go to systematically attack energy infrastructure in Ukraine, the impact that it’s having on innocent civilians all over the country, and that is why he’s come to this summit that marks this 1,000th day of sacrifice for Ukrainians with this message to the G20 that we must double down,” the Prime Minister’s official spokesman said.","summary":"David Lammy warned that faith in international law may ‘never return’ unless Vladimir Putin fails as he attended a UN Security Council session.","url":"https://www.standard.co.uk/news/politics/vladimir-putin-joe-biden-david-lammy-ukraine-un-security-council-b1194796.html","image":"https://static.standard.co.uk/2024/11/18/22/4df7748795d0be54276d6d658b426eb5Y29udGVudHNlYXJjaGFwaSwxNzMyMDUzNjM3-2.77752687.jpg?width=1200","video":null,"publish_date":"2024-11-19 00:12:15","author":"Pa Political Staff","authors":["Pa Political Staff"],"language":"en","category":"politics","source_country":"gb","sentiment":0.038},{"id":265657290,"title":"Republicans Who Voted for Merrick Garland as AG Complain About Matt Gaetz, Trump’s Choice  ","text":"Some of the 20 Senate Republicans who voted to confirm President Joe Biden’s pick of Merrick Garland for attorney general already are shaking their heads at President-elect Donald Trump’s nominee as the nation’s top law enforcer. \n\nSeveral of those GOP senators have spoken out against Trump’s choice last week of Matt Gaetz for attorney general. Others of the 20 Senate Republicans who backed Garland may follow in criticizing Gaetz as his nomination proceeds.\n\nGaetz, a Republican, represented a Florida district in the U.S. House for over seven years before resigning Wednesday shortly after being tapped publicly by Trump to lead the Justice Department. \n\nThe 20 Republican senators who voted in 2021 to confirm Garland as attorney general are, in alphabetical order, Roy Blunt of Missouri, Richard Burr of North Carolina, Shelley Moore Capito of West Virginia, Bill Cassidy of Louisiana, Susan Collins of Maine, John Cornyn of Texas, Joni Ernst of Iowa, Lindsey Graham of South Carolina, Chuck Grassley of Iowa, Jim Inhofe of Oklahoma, Ron Johnson of Wisconsin, James Lankford of Oklahoma, Mitch McConnell of Kentucky, Jerry Moran of Kansas, Lisa Murkowski of Arkansas, Rob Portman of Ohio, Mitt Romney of Utah, Mike Rounds of South Dakota, John Thune of South Dakota, and Thom Tillis of North Carolina. \n\nSome of these Republican senators have expressed discontent and uncertainty with Trump’s choice of Gaetz for attorney general, although they voted less than four years ago to confirm Garland to fill the same role for Biden, a staunch Democrat. \n\nThune and Cornyn were just in a three-way race with Sen. Rick Scott of Florida to lead the GOP conference as Senate majority leader next year. Thune won.\n\nThune told The Hill that he is unsure whether Gaetz, who last year almost singlehandedly toppled House Speaker Kevin McCarthy, R-Calif., will make it through the Senate confirmation process. \n\n“I don’t know [how Gaetz will do] until we start the process, and that’s what we intend to do with him and all the other potential nominees,” Thune told reporters Thursday, according to The Hill, adding that senators “expect our committees to do their jobs and provide the advice and consent that is required under the Constitution.” \n\nOn Jan. 3, as a result of the Nov. 5 election, Thune and the Republicans will gain control of the Senate over Democrats, 53-47.\n\nEven so, Gaetz, who many senators regarded as a conservative gadfly in the House, has a tough fight ahead of him to become attorney general in the second Trump administration. \n\nAssuming all 45 Democrats and two independents who caucus with Democrats vote “nay” on Gaetz, the former congressman can lose the votes of only four Republican senators and still be confirmed. (Vice President JD Vance may cast any tie-breaking votes in the Senate after he is sworn in Jan. 20.) \n\nCollins told reporters that she was shocked by Trump’s pick of Gaetz, Politico reported. \n\n“Obviously, the president has the right to nominate whomever he wishes,” Collins told the reporters. “But this is why the Senate’s advise and consent process is so important. I’m sure that there will be many, many questions raised at Mr. Gaetz’s hearing, if in fact the nomination goes forward.” \n\nTillis also voiced his opinion. \n\n“I have very few skills, [but] vote counting is one and I think he’s got a lot of work to get 50,” he said of Gaetz. \n\nAlaska’s Murkowski also expressed doubts, Politico reported. \n\n“I don’t think it’s a serious nomination for the attorney general. … I’m looking forward to the opportunity to consider somebody that is serious,” Murkowski said. “This one was not on my bingo card.” \n\nCapito told WTRF-TV in West Virginia that she believes Trump’s Nov. 5 win was a mandate from voters for change. \n\n“I’m not surprised that he has appointed somebody to shake it up the way that he would like to,” Capito said of Trump, Gaetz, and the Justice Department, “but I would remind everybody that the process that we’re going forward on in terms of nominations is a grueling process and it’s very much a vetting process.” \n\n“And so I expect that we will be doing that … probably beginning in January as this process moves forward,” Capito added. \n\nJohnson said he would keep an “open mind” during the appointment process, The Wall Street Journal reported. Tillis told the Raleigh-based News & Observer that he cares about “a defensible resume and a really clear vetting.” \n\n“We normally give the president the benefit of the doubt,” Rounds told The Hill, “but we still do our due diligence, and ‘advice and consent’ is still important.” \n\nGraham told Fox News host Sean Hannity that Gaetz should be heard because he is Trump’s choice for attorney general. \n\n“Every president deserves a chance to pick their Cabinet,” Graham said. \n\nGarland, a former federal appeals court judge for the District of Columbia, took office as attorney general on March 11, 2021. President Barack Obama had named Garland to succeed the late Supreme Court Justice Antonin Scalia, but Senate Republicans blocked that appointment until after the 2016 presidential election. \n\nRepublicans in both the House and Senate have criticized many of Garland’s actions (or lack of action) as attorney general. \n\nAfter the Supreme Court’s 2022 ruling overturning Roe v. Wade and abortion on demand in the Dobbs v. Jackson decision was leaked, for example, the Justice Department declined to prosecute protesters outside the homes of conservative justices. \n\nGarland’s Justice Department angered conservatives by prosecuting Trump, or allowing his prosecution, after he left the presidency in January 2021, while at the same time not investigating the explosive contents of a laptop abandoned by Hunter Biden, the new president’s son. \n\nGarland also presided over his department’s pursuit and prosecution of pro-life activists.\n\nKen McIntyre contributed to this developing story, which will be updated.","summary":"Some of the 20 Senate Republicans who voted to confirm President Joe Biden’s pick of Merrick Garland for attorney general already are shaking their heads... Read More\n\n\nThe post Republicans Who Voted for Merrick Garland as AG Complain About Matt Gaetz, Trump’s Choice   appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2024/11/18/republicans-who-voted-for-merrick-garland-as-ag-complain-about-matt-gaetz-trumps-choice/","image":"https://www.dailysignal.com/wp-content/uploads/2024/11/241118_Gaetz_Lewis.jpg","video":null,"publish_date":"2024-11-19 00:10:55","author":"Christina Lewis,Ken McIntyre","authors":["Christina Lewis","Ken McIntyre"],"language":"en","category":"politics","source_country":"us","sentiment":-0.264},{"id":265652480,"title":"Bob Seely: Keir Starmer has gone from shallow moral posturing on China to a policy of dangerous ingratiation with a regime hell-bent on destroying the West","text":"Keir Starmer and his Labour Party were, in Opposition, figures of moral certainty.\n\nLabour would work with our allies to designate the systematic oppression of China’s Uighur minority as a genocide. Labour would conduct an audit of our China policy to ensure consistency on human rights.\n\nHow power changes you.\n\nOn Sunday, Starmer flew to the G20 meeting in Rio and yesterday met the Chinese President Xi Jinping – the first British Prime Minister in six years to hold direct talks with him.\n\nStarmer now says he wants a ‘stable’ and ‘pragmatic’ relationship with the Chinese dictatorship, which rules over more than a billion people and is the world’s second largest economy.\n\nBut make no mistake: when a Labour politician says a ‘pragmatic’ relationship, that is code for ignoring the Chinese Communist Party’s sinister programme of espionage that, according to the head of MI5, Ken McCallum, is taking place in this country on an ‘epic scale’.\n\nCode for ignoring, too, China’s institutionalised theft of intellectual property, its intimidation of Taiwan, its military expansion and ghastly record on human rights.\n\nPlus overlooking the fact that China has never been held to account for Covid, which a former British prime minister, Boris Johnson, claims, among others, was caused by a leak from a laboratory in the country.\n\nThe fact is that rather than defending our vital national interests, the policy under Labour is one of dangerous ingratiation with the Chinese regime. Labour have gone from shallow moral posturing to the craven abandonment of their ethical principles.\n\nPart of this is perhaps down to Keir Starmer and his net zero minister Ed Miliband’s obsession with forcing Britain to give up fossil fuels in double-quick time, which has made us ever more dependent on Chinese-made solar panels, wind turbines and electric car batteries.\n\nWhatever the cause, there is no doubt that the new Government is now doing its best to ‘kowtow’. Wherever you look, there are signs of it.\n\nBridget Phillipson, the Education Secretary, shelved planned laws defending free speech on campus after pressure from universities concerned that they might lose Chinese students – and, therefore, substantial income.\n\nForeign Secretary David Lammy handed over the Indian Ocean Chagos Islands – which host a strategically vital UK/US airbase – to Mauritius, a state allied to China.\n\nThis is not to say past Tory governments have got everything right on China. David Cameron, when prime minister, pursued a policy of cosying up to Beijing, effectively offering a carte blanche for the expansion of the regime’s influence here.\n\nMore recently, however, a group of China-sceptics, myself included, persuaded Rishi Sunak’s government to be more robust and more consistent. Progress was being made – if slowly.\n\nBut under Labour we are going backwards at speed. And following the election of Donald Trump, this could not be a worse political strategy.\n\nTrump has made clear that he is taking a hard line on China and threatens tariffs on Chinese imports. We really cannot afford to be out of step with Washington.\n\nLabour says what British businesses want is ‘certainty’. But why, if certainty is what you want, do you not choose to do a trade deal with the US, the world’s largest economy – and which happens to be an ally, not a hostile state?\n\nI fear our ministers simply don’t understand the scale of the challenge ahead.\n\nPresident Xi has said he wants China to be ready to invade Taiwan by force by 2027. If he sees that threat through, this Parliament will witness some of the most devastating events of this century – and the collapse of the international order.\n\nChina’s agenda is to dominate the West, not to live in harmony with us. It wishes to isolate the US from Europe, and Taiwan from the world.\n\nIts strategies to achieve this range from economic domination of future industries to the manipulation of foreign governments and the mass collection of our data.\n\nXi doesn’t want free trade: he wants dependency from us and others so that we cannot adopt policies against the interests of the Chinese Communist Party. And that sinister process is already well under way.\n\nIf China were to drive a wedge between the US and its allies, authoritarian states from North Korea to Iran and Russia would rejoice. It would be the beginning of the end for the West.\n\nDon’t get me wrong: we need to deal with China. For better or worse, the West bought Beijing into the global trading system earlier this century – a system it is now subverting from within. China is now our fourth biggest goods trading partner.\n\nI worked with researcher Rob Clarke and a group of leading thinkers on a report for the Civitas think tank last month containing critical suggestions for how we can start to develop a coherent policy. It explains how we can reduce the risk, increase the benefit and live up to our principles. High on our agenda should be diversifying our supply chains so we can still trade – but with less dependency and less danger of industrial espionage.\n\nNor should we forget about human rights, because how a foreign government treats its own is an indicator of how it would treat us, if it could.\n\nUnder China’s Communists, the Uighurs face horrendous oppression. The treatment of an entire people is brutal. For all Labour’s posturing about the plight of the Palestinians, they utter not a peep about this Muslim minority.\n\nThe Government’s thinking is so naive they haven’t even come up with legislation to defend Britain in areas that China is already seeking to dominate. Take genomics, called the ‘new gold’. China has prioritised acquiring large datasets of DNA - because who controls genomic information will control the future of healthcare for humanity and the economy, since it is crucial for producing new drugs, tackling diseases and developing resilient crops.\n\nAlready, US Congress has put forward bipartisan legislation to ban Chinese companies that have been collecting large quantities of genomic data from public contracts. Yet the same companies blacklisted by the US are embarking on new contracts with British universities.\n\nAnd what about Chinese investment in UK academia? We know that around 30 per cent of Chinese funding to British higher education institutions since 2017 has been linked to the Chinese armed forces. Do we want to be responsible for helping the firms building weapons that China may, in future, use to attack Taiwan or the US Pacific Fleet?\n\nAt the very least, Starmer should challenge Xi over his use of ‘Confucius Institutes’, which provide Chinese-language teachers to UK classrooms to spy on students.\n\nAnd does Labour have anything to say about China’s increasing support for Russia or its North Korean ally’s decision to send thousands of troops to die in Russia’s savage war against Ukraine?\n\nI doubt Starmer will raise any of these issues with Xi this week. But he must change his tune.\n\nThe Chinese scholar of war, Sun Tzu, said ‘tactics without strategy is the noise before defeat’. Six months into Labour’s first four years in power, we have neither tactics nor strategy.\n\nn Former Conservative MP Bob Seely sat on the Foreign Affairs Committee and is an expert in hybrid warfare.","summary":"Former Conservative Party MP Bob Seely has warned that Prime Minister Sir Keir Starmer's policy of seeking closer relations both economically and politically with China could prove disastrous.","url":"https://www.dailymail.co.uk/news/article-14098697/Bob-Seely-Keir-Starmer-gone-shallow-moral-posturing-China-policy-dangerous-ingratiation-regime-hell-bent-destroying-West.html","image":"https://i.dailymail.co.uk/1s/2024/11/18/23/92216955-0-image-m-72_1731973877813.jpg","video":null,"publish_date":"2024-11-19 00:10:31","author":"Bob Seely,Editor","authors":["Bob Seely","Editor"],"language":"en","source_country":"gb","sentiment":-0.059},{"id":265651790,"title":"Trump FCC pick Brendan Carr is the free speech fighter to take on Big Tech censorship regime","text":"Great news: Donald Trump has named Brendan Carr to head the Federal Communications Commission, a stern warning to our digital would-be overlords.\n\nBig Tech and the regulatory state have been using their unelected power for years to censor anyone who dares to disagree.\n\nIt’s time to fight back — and Carr is the man to do it. \n\nCarr’s been an FCC commissioner since 2017, staunchly advocating against the sleazy Big Tech-Big Government censorship cartel. \n\nAnd before all the libs start shrieking about how unqualified/political/eeeeeevil Carr is, note that he’s been confirmed unanimously three times by the Senate and has served under both Trump and President Biden. \n\nThe new commish noted in an X post about his appointment, “We must dismantle the censorship cartel and restore free speech rights for everyday Americans.”\n\nAnd the free-speech warrior has already put the Gang of Four on notice.\n\nDays before his elevation, he sent a blistering missive to Meta’s Mark Zuckerberg, Apple’s Tim Cook, Microsoft’s Satya Nadella and Alphabet’s Sundar Pichai demanding answers on just how intertwined their companies and products are with NewsGuard. \n\nNewsGuard, recall, is an Orwellian outfit that enables censorship by generating what amount to blacklists of websites based on alleged “misinformation” sins. \n\nOther groups like ad-biz cartel GARM then use those blacklists, like the one generated by the Global Disinformation Index, to try to starve of revenue any site that dares to question, say, the utility of COVID lockdowns.\n\nAnd — surprise, surprise! — the least “trustworthy” sites are always the ones good liberal journos dislike, regardless of whether they’ve actually published anything untrue. \n\nThe Post has been on the business end of the unholy tech-fed combine, seeing our 100% accurate reporting on Hunter Biden suppressed, as well as opinion content on COVID’s likely lab origin. \n\nIt’s an end-run around the First Amendment, with the feds using servile tech CEOs and shady “services” like NewsGuard as cutouts. \n\nCarr’s leveling a big gun at Big Tech, noting in his letter that the Section 230 liability shield that protects platforms like Facebook from litigation only stays in effect as long as Big Tech is operating “in good faith.”\n\nThey haven’t been doing that for years.\n\nSo watch out, would-be Ministry of Truthers across the private and public sectors: A new sheriff’s coming to town. \n\nAnd he actually believes Americans should be free to say, hear and think what they want.","summary":"Brendan Carr will become head of the FCC when Trump takes office. That's great news.","url":"https://nypost.com/2024/11/18/opinion/trump-fcc-pick-brendan-carr-is-a-free-speech-fighter-just-what-we-need-to-fight-the-big-tech-big-gov-censorship-regime/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/newspress-collage-137nvonud-1731969513809.jpg?quality=75&strip=all&1731951680&w=1200","video":null,"publish_date":"2024-11-19 00:09:44","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":0.254},{"id":265651666,"title":"Australia, Japan, U.S. seek to lock in cooperation ahead of Trump 2.0","text":"SYDNEY/DARWIN, Australia -- Australia, Japan and the U.S. are moving to solidify their strategic partnership as Asia braces for potential instability in the lead-up to Donald Trump's return to the White House. \n\nBefore Trump takes office in January, U.S. Secretary of Defense Lloyd Austin is working to shore up Washington's networks of like-minded partners, which the administration of President Joe Biden has developed to counter China's increasing assertiveness in the Indo-Pacific. Under Biden, the U.S. has endeavored to bolster minilateral cooperation with Japan, South Korea and other regional players, like the Philippines.","url":"https://asia.nikkei.com/Politics/Defense/Australia-Japan-U.S.-seek-to-lock-in-cooperation-ahead-of-Trump-2.0","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F2%2F9%2F9%2F7%2F48577992-4-eng-GB%2FCropped-1731922352PR20241118-0014-01.jpg?width=1200&fit=c","video":null,"publish_date":"2024-11-19 00:09:27","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":-0.435}]}