{"offset":0,"number":50,"available":14555,"news":[{"id":287153180,"title":"Senate confirms Pam Bondi as attorney general","text":"The U.S. Senate voted on Tuesday to confirm Pam Bondi as U.S. Attorney General in President Donald Trump's administration. \n\nRepublicans were able to overcome the dissenting votes from Democrats to confirm Bondi 54 to 46. \n\n'Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.' \n\nDemocratic Sen. Dick Durbin of Illinois continued to oppose Bondi and Trump's pick for FBI director, Kash Patel. \n\n\"I urge my colleagues to think twice about Pam Bondi and Kash Patel,\" said Durbin. \"This is not what we should expect or want from the FBI and the Department of Justice.\"\n\nBondi had been berated by Democratic senators who asked if she would support a blanket pardon of those arrested over the rioting at the U.S. Capitol. \n\n\"As I said, the pardons are at the direction of the president,\" Bondi said at the time. \"We will look, and we will advise. I will look at every case on a case-by-case basis, and I abhor violence to police officers.\"\n\nBondi served as the first female attorney general for Florida and was well-known to Trump before his second term. \n\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans — Not anymore,\" he said in November when announcing her nomination. \"Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.\" \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"The U.S. Senate voted on Tuesday to confirm Pam Bondi as U.S. Attorney General in President Donald Trump's administration. \n\nRepublicans were able to overcome the dissenting votes from Democrats to confirm Bondi 54 to 46. \n\n'Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.' \n\nDemocratic Sen. Dick Durbin of Illinois continued to oppose Bondi and Trump's pick for FBI director, Kash Patel. \n\n\"I urge my colleagues to think twice about Pam Bondi and Kash Patel,\" said Durbin. \"This is not what we should expect or want from the FBI and the Department of Justice.\"\n\nBondi had been berated by Democratic senators who asked if she would support a blanket pardon of those arrested over the rioting at the U.S. Capitol. \n\n\"As I said, the pardons are at the direction of the president,\" Bondi said at the time. \"We will look, and we will advise. I will look at every case on a case-by-case basis, and I abhor violence to police officers.\"\n\nBondi served as the first female attorney","url":"https://www.theblaze.com/news/senate-confirms-pam-bondi-ag","image":"https://www.theblaze.com/media-library/senate-confirms-pam-bondi-as-attorney-general.jpg?id=56186882&width=1200&height=600&coordinates=0%2C166%2C0%2C167","video":null,"publish_date":"2025-02-05 01:00:48","author":"Blaze News","authors":["Blaze News"],"language":"en","category":"politics","source_country":"US","sentiment":-0.071},{"id":287154392,"title":"Countdown to quit: thousands of US federal workers accept Musk’s ‘buyout’ offer","text":"More than 20,000 employees – about 1 per cent of the US federal workforce – have signed up for an offer to quit their jobs in exchange for a deferred resignation deal that would have taxpayers continue to pay their salaries through the end of September.\nBut those numbers are increasing every day, according to an official familiar with the data, and the Trump administration expects a spike in resignations as employees near Thursday’s deadline to accept the offer.\nUS President Donald Trump and his efficiency tsar, Tesla and SpaceX CEO Elon Musk, hopes that the offer could cull as much as 10 per cent of the federal workforce.\nThat target could be difficult to meet. There are nearly 2.3 million civilian federal employees, but perhaps half of those – including civilian defence and intelligence employees, postmen, law enforcement personnel and certain other sensitive positions – are ineligible for the offer.\n\nThose 20,000 employees could also include many people who were already planning to retire in the coming months. An average of 62,000 federal workers have retired each year over the past decade, according to data provided by the US Office of Personnel Management. Some 298,000 employees will become eligible for retirement within the next two years.\nAnd federal employee unions have urged members to be sceptical of the offers, which they said were not guaranteed. The National Treasury Employees Union said the programme was “designed to entice or scare you into resigning”, and the American Federation of Government Employees said the intent was “to turn the federal government into a toxic environment where workers cannot stay even if they want to”.\nAs a result, the Office of Personnel Management has given increasingly detailed guidance on the offer, and put its key terms in writing.\nOPM’s acting director and top lawyer also defended the legality of the plan in a memo to agencies on Tuesday, assuring employees that any signed departure agreement was “binding on the government”.\n“Were the government to backtrack on its commitments, an employee would be entitled to request a rescission of his or her resignation,” OPM Acting Director Charles Ezell wrote.\nThough colloquially known as a “buyout”, the deferred resignation plan is structured differently than those often found in the private sector. Employees have until Thursday to accept and could leave their jobs by the end of February. They are free to take other jobs as long as they do not conflict with their continued federal employment. They also have to agree not to sue the government.","summary":"About 1 per cent of the US federal workforce have signed up for a deferred resignation deal as Thursday’s deadline fast approaches.","url":"https://www.scmp.com/news/world/article/3297380/countdown-quit-thousands-us-federal-workers-accept-musks-buyout-offer","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/05/abae1117-61d6-422e-9fea-ce1565fb52eb_a8a3024a.jpg","video":null,"publish_date":"2025-02-05 00:58:24","author":"Bloomberg","authors":["Bloomberg"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.016},{"id":287153854,"title":"Andy Reid returning to Chiefs next season not motivated by chase of wins record","text":"Andy Reid is not going anywhere. \n\nThe Chiefs head coach confirmed Tuesday that he will return in 2025 for his 13th season with the team. \n\n“Yes, I’ll be back,” Reid said. \n\nChiefs owner Clark Hunt said Monday that he expected Reid to return, prompting the question to Reid at his Tuesday news conference. \n\nReid turns 67 in March. His 273 regular-season wins are fourth all time. He is 55 behind Don Shula. Reid said chasing the record is not his motivation to keep coaching. \n\n“That’s not part of it,” Reid said. “I just enjoy teaching. I don’t get caught up much in the stats or the records. I enjoy being around the guys. I enjoy football, the game. You can’t put in the hours we do and not enjoy it. I love the game.” \n\nThree for three \n\nGeorge Karlaftis is batting 1.000. \n\nThree years in the NFL with the Chiefs, three Super Bowl appearances, a third ring on tap — with a win against the Eagles in Super Bowl LIX. \n\nCan he even imagine a world in which he doesn’t make it to the final game of the season? \n\n“I wouldn’t want to,” Karlaftis deadpanned. \n\nKarlaftis doesn’t need a reminder that he is lucky. He can look at teammate DeAndre Hopkins — once the best receiver in the NFL — finally making it to the Super Bowl for the first time in his 12th season, or think back to one of his rookie mentors, Carlos Dunlap, finally playing in and winning the Super Bowl in his final NFL game. \n\nBut if he did need a reminder, leave it to Travis Kelce. \n\n“Talking to Travis, he’s like, ‘Do you realize how lucky you are to be in this situation?’ Karlaftis said. “You can’t take that stuff for granted.” \n\nRef boss bites back \n\nOne day after NFL commissioner Roger Goodell called it “ridiculous” to think that there is an officiating agenda to help the Chiefs win, NFL Referees Association executive director Scott Green doubled down. \n\n“It is insulting and preposterous to hear conspiracy theories that somehow 17 officiating crews consisting of 138 officials are colluding to assist one team,” Green told Fox Sports. \n\nThe theories exist because the Chiefs have won an unprecedented 17 straight one-score games and have been called for 30 fewer penalties than their opponents over their past 12 playoff games. \n\nCan’t get sidetracked \n\nDonald Trump is expected to become the first sitting president to attend the Super Bowl. \n\n“That’s cool, but Donald’s not on that field,” said Eagles left tackle Jordan Mailata, a native of Australia. “But that’s a part of blocking out the noise. What am I going to do thinking about Donald Trump? How’s that going to make me win the game?’’ \n\nHawkeye hoopla \n\nEagles rookie cornerback Cooper DeJean is a fan of another rookie from Iowa: WNBA sensation Caitlin Clark, his fellow former Hawkeye. \n\n“I think she’s probably the most exciting player to watch right now, men or women’s basketball,” DeJean said. “Just the way she plays the game, she can score, she can pass, she can do it all. She’s taking women’s basketball to new heights.” \n\nBrady rule lifted \n\nA broadcast restriction Tom Brady has faced as a minority owner of the Raiders will be lifted as he prepares to call the Super Bowl with Fox. \n\nThe future Hall of Fame quarterback has been granted access to production meetings with the Chiefs ahead of Sunday’s game, Hunt said Tuesday, a brief reversal of the restrictions on Brady this season. \n\n“When [Brady] was approved as an owner of the Raiders, there were a lot of discussions internally [among owners] and that ended up being the recommendation of the league office, that it didn’t make sense to have him in the production meetings,” Hunt said, according to The Athletic. “That’s where that rule came from. Since he’s doing the game this week, we have no issue with him being in our production meetings. He’ll have the access that any broadcaster would have.”","summary":"Reid turns 67 in March. His 273 regular-season wins are fourth all time. He is 55 behind Don Shula. Reid said chasing the record is not his motivation to keep coaching. ","url":"https://nypost.com/2025/02/04/sports/super-bowl-2025-andy-reid-returning-to-chiefs-next-season/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/kansas-chiefs-head-coach-andy-97895083.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-05 00:57:26","author":"Brian Costello,Jaclyn Hendricks,Mark Cannizzaro,Paul Schwartz,Ryan Dunleavy","authors":["Brian Costello","Jaclyn Hendricks","Mark Cannizzaro","Paul Schwartz","Ryan Dunleavy"],"language":"en","source_country":"us","sentiment":0.255},{"id":287153568,"title":"Trump weighs plan to outsource US prisoners to El Salvador","text":"US President Donald Trump expressed interest on Tuesday in El Salvador’s offer to house violent US convicts but acknowledged that the move raises significant legal questions.US secretary of state Marco Rubio, who brokered the deal with Salvadoran President Nayib Bukele, also admitted that constitutional issues must be addressed before the plan can proceed.During a meeting with Bukele on Monday, Rubio secured a commitment that El Salvador would accept deported criminals of any nationality, including American citizens and legal residents convicted of violent crimes. Bukele confirmed the offer on X, saying that his country is willing to “outsource part of the US prison system” for a fee that would be affordable for the US but beneficial to El Salvador.El Salvador’s prison system has been under international scrutiny for its harsh conditions. According to the state department, its facilities suffer from overcrowding, poor sanitation, and inadequate access to basic needs like potable water and ventilation. The country’s new mega-prison (CECOT), built under Bukele’s administration, can house 40,000 inmates and prisoners are subjected to severe restrictions, including no visits or rehabilitation programs.Speaking at the Oval Office, Trump emphasised that he is eager to move forward with the plan if legally permissible. “I’m just saying, if we had the legal right to do it, I would do it in a heartbeat,” he told reporters, according to AP. However, he acknowledged uncertainty over whether US laws allow the transfer of American citizens to foreign prisons.Trump also claimed that “numerous, many” countries have expressed interest in taking American prisoners, although he did not specify which ones, USA Today reported. He argued that outsourcing the incarceration of violent criminals would reduce costs for the US while ensuring these offenders are permanently removed from society.Rubio, speaking alongside Costa Rican President Rodrigo Chaves, admitted that the legal framework for outsourcing US prisoners remains unclear. “We have a Constitution,” he said, emphasising that any such move would need to be carefully vetted. Critics argue that banishing American convicts to foreign countries could violate their constitutional rights, particularly those concerning due process and humane treatment.Meanwhile, Trump’s aggressive foreign policy shifts have sparked controversy within the US government. Thousands of USAID employees have been laid off amid a sweeping freeze on foreign aid, and Rubio has signalled that the state department may absorb parts of USAID, AP reported. The reorganisation has left aid programs in limbo, further complicating US-Central America relations.Bukele’s proposal comes as El Salvador continues its crackdown on gang violence, which has led to the mass incarceration of over 83,000 people with limited due process. While Bukele’s policies have significantly reduced crime, human rights groups warn of widespread abuses in the country’s prisons.Despite the legal uncertainties, Trump remains eager to outsource prisoners, particularly those convicted of violent and repeat offences. “These people are never going to be any good,” he said, suggesting that once transferred, they would remain in El Salvador permanently, as per USA Today.","summary":"US President Trump expresses interest in El Salvador's offer to house violent US convicts but acknowledges significant legal questions. Secretary of State Marco Rubio secured a commitment from Salvadoran President Nayib Bukele to accept deported criminals, raising constitutional concerns.","url":"https://timesofindia.indiatimes.com/world/us/i-would-do-it-in-a-heartbeat-trump-weighs-plan-to-outsource-us-prisoners-to-el-salvador/articleshow/117931158.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117931177/117931177.jpg","video":null,"publish_date":"2025-02-05 00:57:17","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.305},{"id":287153424,"title":"Donald Trump pledges to help develop Gaza Strip","text":"President Donald Trump has said the US would “take over” the Gaza Strip and that Palestinians should permanently leave the enclave in the strongest indication yet that he wants the 2.2mn population resettled in countries such as Egypt and Jordan.\n\nSpeaking as he held talks with Israeli Prime Minister Benjamin Netanyahu at the White House on Tuesday, Trump said that “all” Palestinians in Gaza should “be resettled”.\n\n“The US will take over the Gaza Strip, and we will do a job with it too. We’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site,” he said.\n\nAsked whether he would send American troops to Gaza, Trump said, “We’ll do what is necessary, we’re going to take over that piece we’re going to develop it, we’re going to create thousands of thousands of jobs, it’s something that the Middle East is going to be very proud of.”\n\nTrump’s proposal would upend decades of US policy and fuel outrage across the Arab world, where Washington’s allies have long warned against the forced displacement of Palestinians.\n\nEgypt and Jordan have already rejected Trump’s plans to resettle Palestinians outside of Gaza after the US president last month said it was time to “clean out” the enclave.\n\nArabs view such moves as akin to 1948, when hundreds of thousands of Palestinians were forced from their homes or fled in the fighting that accompanied Israel’s founding. Palestinians refer to that period as the Nakba, or catastrophe.\n\nThe forced displacement of Palestinians would also rattle the US’s western allies, which have long supported a two-state solution to the protracted Palestinian-Israeli conflict.\n\nBut Trump doubled down on Tuesday, describing Gaza as a “demolition site”, and saying he expected Cairo and Amman, both of which receive large amounts of US aid, to accept Palestinians.\n\nJordan’s King Abdullah will meet with Trump next week in Washington to make his case against the proposal.\n\nIsrael has reduced much of the densely populated strip to a rubble strewn wasteland since it launched a ferocious retaliatory offensive after Hamas’s October 7 2023 attack, with Israeli forces bombing Gaza from the air, land and sea.\n\nArab and European powers hope a fragile ceasefire and hostage deal between Israel and the Palestinian militant group will lead to a permanent end to the war that would enable the reconstruction of the strip to begin.\n\nBut Trump said: “If we can find the right piece of land, or numerous pieces of land, and build them some really nice places with plenty of money in the area . . . I think that would be a lot better than going back to Gaza, which has had just decades and decades of death.”\n\nShortly before meeting Netanyahu, who considers Tehran’s nuclear programme an existential threat to Israel, Trump also signed a memorandum that would direct his government to impose “maximum pressure” on Iran.\n\nUS officials described the move as a tool to press Tehran back to the negotiating table to discuss Iran’s nuclear programme.\n\nAs Trump was signing it, he did not indicate what kinds of sanctions he would use against Iran but said that he would look to speak to the Islamic republic’s leaders about a possible deal to end the nuclear crisis.\n\n“We will see whether or not we can arrange or work out a deal with Iran and everybody can live together,” he said.\n\nTrump said he was “unhappy” to sign the memorandum but had no choice. “It’s very simple. Iran cannot have a nuclear weapon,” he added.\n\nAs part of the effort, Trump indicated he was seeking to curb Iran’s oil exports, saying that the US has “the right” to block the sale of Iranian crude to other nations.\n\nBrent crude futures traded around $76 a barrel after the memorandum was signed, well above Tuesday’s low of around $74.15.\n\nIranian President Masoud Pezeshkian has for weeks signalled more willingness to agree to a negotiated settlement to secure sanctions relief and ease domestic economic pressure.\n\nHis government has also made clear it wants to avoid military confrontation with the US and Israel.\n\nTrump mounted a campaign of “maximum pressure” against Iran in his first term as president after abandoning a 2015 nuclear deal that Tehran signed with world powers. US sanctions were imposed on the Islamic republic.\n\nIn response, Tehran ramped up its nuclear activity and it is now enriching uranium close to weapons-grade level.\n\nTrump’s sanctions against Iran remained in place during Joe Biden’s administration, but analysts said it did not implement them as strictly as it sought to revive the nuclear accord with Iran and ease the crisis.\n\nNetanyahu has made clear his government wants to keep up the pressure on Iran after more than a year of conflict between Israel and Tehran-backed militants following Hamas’s attack on the Jewish state.\n\nLast year, Israel and Iran twice traded direct missile fire against each other as their long-running shadow war burst into the open. Netanyahu claimed that Israeli strikes destroyed much of Iran’s air defences.\n\nIsrael also dealt a series of devastating blows to Hizbollah, the Lebanese militant group and Iran’s most important proxy, and many experts said the Islamic republic is at its most vulnerable in decades.\n\nNetanyahu has long vowed to prevent Iran developing a nuclear weapon, and may seek US support to launch more strikes against the republic, according to analysts.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump has said the US would “take over” the Gaza&#8230;\n\n\nThis Post: Donald Trump pledges to help develop Gaza Strip first appeared on Internewscast Journal","url":"https://internewscast.com/business/donald-trump-pledges-to-help-develop-gaza-strip/","image":"https://internewscast.com/wp-content/uploads/2025/02/rewrite-this-title-Donald-Trump-says-US-will-‘take-over.jpg","video":null,"publish_date":"2025-02-05 00:53:55","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.182},{"id":287154592,"title":"Trump doubles down on US “ownership” of Gaza","text":"In a press conference with Israeli Prime Minister Benjamin Netanyahu, US President Donald Trump doubled down on remarks about the United States owning and redeveloping Gaza. “It’s something that could change history,” Netanyahu added.","summary":"US President Donald Trump doubled down on remarks about the United States owning and redeveloping Gaza.","url":"https://www.aljazeera.com/program/newsfeed/2025/2/5/trump-doubles-down-on-us-ownership-of-gaza?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/02/AP25036021236042-1738716435.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-02-05 00:52:28","author":"Apps Support","authors":["Apps Support"],"language":"en","source_country":"QA","sentiment":-0.221},{"id":287153420,"title":"Trump states that the US is willing to deploy troops to take control of the Gaza Strip if needed","text":"President Donald Trump outlined an extraordinary new plan for the Middle East on Tuesday, with the United States taking control of the war-torn Gaza strip while its Palestinian population is moved to neighboring countries.\n\nIt is the latest evolution in his plan for rebuilding a territory devastated by Israeli bombardment.\n\nHis words will sow fear in the Palestinian population but Trump insisted it was time for a new way of thinking.\n\n‘The US will take over the Gaza Strip, and we will do a job with it too,’ he said at a press conference alongside Israeli Prime Minister Benjamin Netanyahu. \n\n‘We’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site … level the site and get rid of the destroyed buildings.’\n\nTrump, a property developer who sees the world in terms of deals, has long talked up Gaza’s coastal location and pleasant climate as a perfect holiday vacation. \n\nIn his vision, U.S. reconstruction would create thousands of jobs and spare Palestinians the pain and expense of rebuilding once again. \n\nIt could become ‘the Riviera of the Middle East,’ he added.\n\nWhen a reporter asked if that might involve military force, Trump answered: ‘If necessary. \n\nAnd when asked who would live there, he answered: ‘I envision world people living there. The world’s people. \n\n‘I think you’ll make that into an international, unbelievable place.’\n\nYet the proposal to move out Gaza Palestinian population will be seen as a call for ‘ethnic cleansing’ by opponents.\n\nNetanyahu could not help but beam as the president outlined his latest proposal. And he praised Trump for his radical thinking, such as recognizing Jerusalem as the capital of Israel during his first term.\n\n‘You see things others refuse to see,’ he said. ‘You say things others refuse to say. \n\n‘And after the jaws drop people scratch their heads and they say, you know, he’s right.’\n\nTrump said he planned to visit Gaza, Israel and Saudi Arabia during a future trip to the Middle East but offered no further details. \n\nMore than 40,000 people have been killed in Gaza since Israel launched strikes in the wake of the Oct. 7 Hamas terror attack. \n\nHundreds of thousands of people have been lost their homes.\n\n‘I don’t think people should be going back,’ said Trump earlier as he welcomed Netanyahu to the Oval Office. “You can’t live in Gaza right now. I think we need another location. \n\n‘I think it should be a location that’s going to make people happy.’\n\nThe comments will terrify Palestinians who have long feared that Israel was seeking to take their land. \n\nThey have lived under an economic blockade and more than a year of military bombardment, leaving the territory resembling a ‘demolition site,’ as Trump put it.\n\nNetanyahu is visiting to plan for the next stage of talks with Hamas, negotiations which plan for three to five years of reconstruction. \n\nAmerican officials have already made clear that they see that timeline as unviable. \n\nAgainst that backdrop, Trump upended the Middle East 10 days by floating the idea of moving the territory’s population to Egypt and Jordan, in answer to DailyMail.com question.\n\nBoth countries have rejected the idea. \n\nBut the former property developer, who sees the world in terms of deals, insisted that other nations would step up. \n\n‘You look over the decades, it’s all death in Gaza,’ he said. \n\n‘This has been happening for years. It’s all death. \n\n‘If we can get a beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what’s happening in Gaza.’\n\nEarlier Trump’s national security adviser told reporters that Trump viewed the issue as a humanitarian one.\n\n‘You have these people that are sitting with literally thousands of unexploded ordinance and piles of rubble,’ said Mike Waltz. \n\n‘At some point, we have to look realistically, how do you rebuild Gaza? What does that look like? What is the timeline? \n\n‘A lot of people were looking at very unrealistic timelines. We’re talking 10 to 15 years.’\n\nIt was all smiles between Trump and Netanyahu on Tuesday, but there has been tension in their relationship.\n\nTrump complained during his first term that the Israeli leader let him down just before the US killed a top Iranian general in 2020, dropping out of the operation at the 11th hour.\n\nAnd he was furious that Netanyahu congratulated President Joe Biden on winning the 2020 election.\n\nBut Netanyahu, who has lost support at home and who has been indicted at the International Criminal Court, badly needs Trump now to help shore up his position.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump outlined an extraordinary new plan for the Middle East on&#8230;\n\n\nThis Post: Trump states that the US is willing to deploy troops to take control of the Gaza Strip if needed first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-states-that-the-us-is-willing-to-deploy-troops-to-take-control-of-the-gaza-strip-if-needed/","image":"https://i.dailymail.co.uk/1s/2025/02/05/00/94869121-0-image-a-24_1738714759023.jpg","video":null,"publish_date":"2025-02-05 00:51:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.012},{"id":287154594,"title":"Trump says US will ‘take over’ and ‘own’ Gaza in redevelopment plan","text":"United States President Donald Trump has said that the US will “take over” and “own” Gaza as part of a plan to turn the enclave into “the Riviera of the Middle East”.\n\nIn extraordinary remarks on Tuesday, Trump said his administration would redevelop the territory in a bid to “supply unlimited numbers of jobs and housing for the people of the area.”\n\n“The US will take over the Gaza Strip and we will do a job with it, too. We’ll own it,” Trump said at the White on Tuesday after talks with Israeli Prime Minister Benjamin Netanyahu.\n\n“And be responsible for dismantling all of the dangerous unexploded bombs and other weapons on this site, level the site and get rid of the destroyed buildings.”","summary":"US president pledges to turn enclave into &#039;the Riviera of the Middle East&#039;.","url":"https://www.aljazeera.com/news/2025/2/5/trump-says-us-will-take-over-and-own-gaza-in-redevelopment-plan?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/02/AP25036011684331-1738715888_5787bc-1738716649.jpg?resize=1200%2C630&quality=80","video":null,"publish_date":"2025-02-05 00:50:55","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.073},{"id":287153426,"title":"Trump declares exit from UN human rights council and stops financial support for Palestinian refugees","text":"TANZANIA – President Donald Trump announced Tuesday that the United States will withdraw from the top U.N. human rights body and will not resume funding for the U.N. agency helping Palestinian refugees.\n\nThe U.S. left the Geneva-based Human Rights Council last year, and it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the surprise Oct. 7, 2023, attacks in southern Israel, which UNRWA denies.\n\nTrump’s announcement came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.\n\nTrump’s executive orders also call for a review of American involvement in the Paris-based U.N. Educational, Scientific and Cultural Organization, known as UNESCO, and a review of U.S. funding for the United Nations in light of “the wild disparities in levels of funding among different countries.”\n\nThe United States, with the world’s largest economy, pays 22% of the U.N.’s regular operating budget, with China the second-largest contributor.\n\n“I’ve always felt that the U.N. has tremendous potential,” Trump told reporters in the Oval Office. “It’s not living up to that potential right now. … They’ve got to get their act together.”\n\nHe said the U.N. needs “to be fair to countries that deserve fairness,” adding that there are some countries, which he didn’t name, that are “outliers, that are very bad and they’re being almost preferred.”\n\nBefore Trump’s announcement, U.N. spokesman Stephane Dujarric reiterated the Human Rights Council’s importance and UNRWA’s work in delivering “critical services to Palestinians.”\n\nTrump also pulled the U.S. out of the Human Rights Council in June 2018. His ambassador to the U.N. at the time, Nikki Haley, accused the council of “chronic bias against Israel” and pointed to what she said were human rights abusers among its members.\n\nPresident Joe Biden renewed support for the Human Rights Council, and the U.S. won a seat on the 47-nation body in October 2021. But the Biden administration announced in late September that the United States would not seek a second consecutive term.\n\nTrump’s order on Tuesday has little concrete effect because the United States is already not a council member, said council spokesperson Pascal Sim. But like all other U.N. member countries, the U.S. automatically has informal observer status and will still have a seat in the council’s ornate round chamber at the U.N. complex in Geneva.\n\nUNRWA was established by the U.N. General Assembly in 1949 to provide assistance for Palestinians who fled or were expelled from their homes before and during the 1948 Arab-Israeli war that followed Israel’s establishment, as well as for their descendants. It provides aid, education, health care and other services to some 2.5 million Palestinians in Gaza, the occupied West Bank and East Jerusalem, as well as 3 million more in Syria, Jordan and Lebanon.\n\nBefore the Oct. 7 Hamas attacks, UNRWA ran schools for Gaza’s 650,000 children as well as health facilities, and helped deliver humanitarian aid. It has continued to provide health care and been key to the delivery of food and other aid to Palestinians during the war.\n\nThe first Trump administration suspended funding to UNRWA in 2018, but Biden restored it. The U.S. had been the biggest donor to the agency, providing it with $343 million in 2022 and $422 million in 2023.\n\nFor years, Israel has accused UNRWA of anti-Israeli bias in its education materials, which the agency denies.\n\nIsrael alleged that 19 of UNRWA’s 13,000 staff in Gaza participated in the Hamas attacks. They were terminated pending a U.N. investigation, which found nine may have been involved.\n\nIn response, 18 governments froze funding to the agency, but all have since restored support except the United States. Legislation ratifying the U.S. decision halted any American funding to UNRWA until March 2025, and Trump’s action Tuesday means it will not be restored.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTANZANIA – President Donald Trump announced Tuesday that the United States will&#8230;\n\n\nThis Post: Trump declares exit from UN human rights council and stops financial support for Palestinian refugees first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-declares-exit-from-un-human-rights-council-and-stops-financial-support-for-palestinian-refugees/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/3XLNSDKD7BGNJB5MCLWIB3HZ4U.jpg","video":null,"publish_date":"2025-02-05 00:49:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.09},{"id":287153570,"title":"Senate Committee advances Tulsi Gabbard’s nomination for DNI","text":"Tulsi Gabbard's nomination as director of national intelligence (DNI) moved a step closer to confirmation after the Senate Intelligence Committee approved it in a narrow 9-8 vote, with all Republicans supporting her and all Democrats opposing. The decision sets the stage for a full Senate vote, where Gabbard will need near-unanimous Republican backing to secure the position.Gabbard, a former Democratic congresswoman from Hawaii and 2020 presidential candidate, has sparked controversy due to her past comments sympathetic to Russia, her meeting with Syria’s former leader Bashar al-Assad, and her defence of Edward Snowden, the former NSA contractor who leaked classified intelligence. These issues made her one of the most divisive picks for US President Donald Trump’s cabinet.During her contentious confirmation hearing, Gabbard attempted to clarify her stance on Snowden, stating that while he \"broke the law,\" his leaks exposed \"illegal and unconstitutional programs\" within the US government. However, she avoided directly calling him a traitor, despite repeated questioning from both Republican and Democratic senators, as per AP.Initial Republican support for Gabbard was uncertain, as some lawmakers raised concerns about her lack of intelligence experience and her history of challenging US intelligence agencies. However, a weekend pressure campaign led by Trump supporters, including Elon Musk, helped secure votes. Musk had initially criticised Sen Todd Young for his tough questioning of Gabbard but later called him an \"ally\" after Young announced his support, The New York Times reported.Young, whose opposition could have stalled Gabbard’s nomination, later explained that he backed her after securing written assurances that she would hold officials accountable for unauthorised disclosures and not intervene in discussions about Snowden’s legal status. Other swing votes, such as Sen Susan Collins, also came around after Gabbard pledged to shrink the size of the ODNI and return it to its original coordinating role among intelligence agencies.Democrats have remained firmly opposed to Gabbard’s nomination. Sen Mark Kelly warned that her \"tendency to embrace poorly supported claims\" over intelligence assessments was \"dangerous\". Sen Martin Heinrich went further, labelling her a \"national security risk\" who \"parrots dictators' talking points\", according to The New York Times.With Republicans holding a narrow majority in the Senate, Gabbard’s confirmation is not guaranteed. A date for the full Senate vote has yet to be scheduled.","summary":"The Senate Intelligence Committee narrowly approved Tulsi Gabbard's nomination as DNI with a 9-8 vote, leading to a full Senate vote. Gabbard's nomination has sparked controversy over her past comments on Russia, Assad meetings, and defense of Snowden.","url":"https://timesofindia.indiatimes.com/world/us/senate-committee-advances-tulsi-gabbards-nomination-for-director-of-national-intelligence/articleshow/117931072.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117931105/117931105.jpg","video":null,"publish_date":"2025-02-05 00:48:21","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.108},{"id":287152016,"title":"Trump says Palestinians should leave Gaza and US will ‘take over’","text":"By Kevin Liptak | CNN\n\n(CNN) — President Donald Trump said Tuesday that the US “will take over” the Gaza Strip, after saying earlier that he doesn’t think there is a permanent future for Palestinians in Gaza.\n\n“The US will take over the Gaza Strip and we will do a job with it too,” Trump said during a joint press conference alongside his Israeli counterpart Benjamin Netanyahu. “We’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site and get rid of the destroyed buildings.”\n\nAsked whether he was willing to send US troops to fill a security vacuum in Gaza, Trump did not rule it out.\n\n“As far as Gaza is concerned, we’ll do what is necessary. If it’s necessary, we’ll do that. We’re going to take over that piece that we’re going to develop it,” he said.\n\nTrump’s comments are a remarkable assertion from a sitting American president, particularly one who rose to political power in the United States through his criticism of America’s longest wars in the Middle East.\n\n“I do see a long-term ownership position, and I see it bringing great stability to that part of the Middle East, and maybe the entire Middle East,” Trump told reporters in the East Room.\n\n“This was not a decision made lightly. Everybody I’ve spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs with something that will be magnificent.”\n\nTrump, a former real estate developer, said he had studied the matter “closely, over a lot of months.”\n\nSpeaking earlier Tuesday, Trump suggested Gazans move to a new location provided by one or more nations in the Middle East.\n\n“I mean they’re there because they have no alternative. What do they have? It is a big pile of rubble right now,” Trump said moments before hosting Netanyahu for Oval Office talks.\n\nTrump’s suggestion that Gazans leave the strip permanently amounts to a provocative stance that will endear him to Israel’s most conservative politicians but is generally a non-starter for Israel’s neighbors, who have said they are unwilling to accept new Palestinian refugees from the enclave.\n\nOn Tuesday, Trump framed the matter as a humanitarian one, saying it was impossible to believe anyone would want to remain in the war-torn territory.\n\n“Why would they want to return? The place has been hell,” Trump said, ignoring a reporter who cried out: “Because it’s their home.”\n\nInstead of Gaza, he suggested the Palestinians be provided a “good, fresh, beautiful piece of land” to live.\n\nBut under repeated questioning, Trump made clear he did not see a world in which Palestinians ever return to Gaza.\n\n“I don’t think people should be going back to Gaza. I think Gaza has been very unlucky for them.” He said, “Gaza is not a place for people to be living.”\n\nNetanyahu, sitting alongside Trump in the Oval Office, smiled as Trump was speaking. The Israeli leader, under conflicting pressures domestically, was in Washington to ascertain exactly where Trump stands on the next phase of a ceasefire in Gaza.\n\nBut Trump’s dim views of Gaza as a permanent home for Palestinians was certain to provide grist for far-right allies of the Israeli leader, who have called on Netanyahu to abandon the temporary truce that was struck last month.\n\nNetanyahu’s visit was expected to last several hours and include a joint press conference, all meant to demonstrate Trump’s solidarity with Israel.\n\nThe comity between the men could belie a relationship that’s more complicated than it sometimes appears – with nothing less than the future of the Middle East potentially riding on Trump’s words.\n\nTrump has claimed credit for the hostages-for-ceasefire agreement struck in the days before he entered office – and even officials in the outgoing Biden administration acknowledged Trump’s imminent arrival helped apply pressure on Israel and Hamas.\n\nNetanyahu, perhaps seeking to ingratiate himself to his host, praised Trump’s efforts.\n\n“I think President Trump added great force and powerful leadership to this effort,” Netanyahu said in the Oval Office.\n\nBut for all of his prodding to get the deal inked, Trump will still need to oversee the remaining two phases of the three-phase plan. He didn’t sound particularly confident a day before meeting Netanyahu.\n\n“I have no assurances that it’ll hold,” he said in the Oval Office, where he’d summoned reporters to watch him sign some papers. “And I’ve seen people brutalized. I’ve never – nobody’s ever seen anything like it.”\n\nHe sounded slightly more optimistic a day later.\n\n“We’ll see what happens. We’re dealing with very complicated people, but a deal can absolutely get done,” he said alongside Netanyahu on Tuesday.\n\nThere’s plenty for Trump and Netanyahu to discuss beyond the immediate matter of the ceasefire agreement. There’s the question of Gaza itself, which Trump has previously said should be cleared out for rebuilding, with the Palestinians who live there moved to Egypt and Jordan (a topic of discussion likely to continue when Jordan’s King Abdullah visits the White House next week).\n\n“I would like to see Jordan, I’d like to see Egypt take some,” Trump said again Tuesday, just before Netanyahu arrived. “Look, the Gaza thing has not worked. It’s never worked.”\n\nAnd then there is the prospect of a broader normalization of relations between Israel and its Arab neighbors, principally Saudi Arabia, that former President Joe Biden had been pursuing before the October 7, 2023, attacks. Trump, who openly pines for a Nobel Peace Prize, may see his opportunity in such a pursuit, which could transform the entire Middle East and create a new bulwark against Iran, a common foe to Jerusalem and Riyadh.\n\nWhether Netanyahu is interested in diplomacy – or whether he instead sees Trump’s arrival in Washington as a moment to take decisive action against Iran, potentially even taking out its nuclear program – remains to be seen.\n\nThere is already speculation Netanyahu could use the talks to take Trump’s temperature on a direct strike, seizing a moment when Iranian proxies have been decimated, Iran’s nuclear ambitions appear to be accelerating and while he has friendlier ties to Washington.\n\nFor his part, Trump has not sounded particularly enthusiastic about starting a new conflict with Iran.\n\n“Hopefully that can be worked out without having to worry about it. It would really be nice if that could be worked out without having to go that further step,” he said last month when asked about a strike on Iranian facilities.\n\nA complicated relationship\n\nBy the end of Biden’s term, relations were so strained between the American and Israeli leaders that they went months without speaking, despite the ongoing war in Gaza and intensive efforts by Biden’s aides to broker a cease-fire.\n\nIn the lead-up to last November’s election, there was little question among Biden’s team that Netanyahu favored a Trump victory, believing he would enjoy a far wider remit from the American government to prosecute his war aims with Trump in office instead of then-Vice President Kamala Harris.\n\nThose predictions have not been wrong.\n\nAlready, Trump has lifted a hold on heavy bomb deliveries to Israel, rolling back one of the few Biden-era policies meant to exert leverage on Israel amid its war in Gaza.\n\nHe could go even further this week. Netanyahu and his delegation plan to press Trump’s administration to move forward with billions of dollars in pending arms sales, including thousands of new bombs, missiles, artillery and other weapons, during this week’s visit.\n\nWhile some of the items could take a year or more to produce, deliveries of the bombs would begin within the next few months.\n\nIf Trump goes ahead, it would represent a new level of support to Israel from the United States, and a signal of Trump’s willingness to indulge Netanyahu’s requests at a moment of deep uncertainty in the Middle East.\n\nBut while Trump is popular in Israel, and Netanyahu enthusiastically welcomed his return to the White House, things haven’t always been so cheerful.\n\nWhen Netanyahu congratulated Biden on his election victory in 2020, Trump was enraged at what he saw as betrayal. In the months that followed, Trump accused Netanyahu of disloyalty and fumed to the esteemed Israeli reporter Barak Ravid, now a CNN analyst: “F**k him.”\n\nEven three years later, after Hamas launched the worst terrorist attack in Israel’s history on October 7, 2023, it was clear Trump’s sore feelings hadn’t entirely faded.\n\n“(Netanyahu) was not prepared. He was not prepared, and Israel was not prepared,” Trump said in an interview shortly after the attacks, comments that drew condemnation even from Republicans.\n\nNetanyahu undoubtedly hopes the animosity will be forgotten when he visits on Tuesday. It seems almost certain his interactions with Trump will contain none of the open discord that colored his relationship with Biden in the final year of his presidency.\n\nWhat is clear is Netanyahu’s desire to gather a wide range of opinions while he is in town. The prime minister is planning to remain in Washington well beyond his Tuesday talks with Trump. He arrived to Blair House, the presidential guest residence, late Sunday and is expected to stay until the end of the week, including for meetings on Capitol Hill.\n\nFor all of their vast differences, Trump and Biden do share a philosophy when it comes to engaging with their foreign counterparts: dealing directly is the best way to make progress.\n\nMay’s early trip to Washington, designed in part to convince Trump not to withdraw from NATO, did not portend particularly warm ties for the rest of his term. He repeatedly criticized her handling of Brexit, although by the time May resigned from office they seemed to have patched things up.\n\nWith Netanyahu, however, Trump has an altogether more immediate task.\n\nThis story and headline have been updated with additional developments.","summary":"“Why would they want to return? The place has been hell,” Trump said, ignoring a reporter who cried out: “Because it’s their home.”","url":"https://www.mercurynews.com/2025/02/04/trump-says-palestinians-should-leave-gaza-and-us-will-take-over/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/sjm-S-ISRAEL-TRUMP-GET_218905936.jpg?w=1024&h=682","video":null,"publish_date":"2025-02-05 00:46:43","author":"Cnn.com Wire Service","authors":["Cnn.com Wire Service"],"language":"en","category":"politics","source_country":"us","sentiment":-0.173},{"id":287150276,"title":"Republicans cave to Trump, endorse contentious picks for cabinet","text":"Washington: Hold-out Republican senators have fallen into line to support US President Donald Trump’s most contentious cabinet picks, including Robert F. Kennedy Jr and Tulsi Gabbard, paving the way for their confirmation by the full Senate.\n\nRepublican Senator Bill Cassidy of Louisiana, a gastroenterologist who raised concerns about Kennedy’s long-standing anti-vaccine positions, and who voted to impeach Trump in 2021 for his role in the January 6 riots, ultimately backed Kennedy to become health secretary in Trump’s cabinet after weeks of uncertainty.\n\nCassidy said that in a flurry of phone calls with Kennedy and the White House over several days, he had extracted commitments that Kennedy would not establish a parallel vaccine monitoring system, would retain the existing Centre for Disease Control advisory committee on immunisation, and would not remove public statements affirming vaccines do not cause autism.\n\n“He will be the secretary, but I believe he will also be a partner,” Cassidy said. The two would speak or meet multiple times a month, with Cassidy given input into hiring decisions at the health department.","summary":"A handful of senators – including a doctor – had raised concerns about Trump’s nominees for the top health and intelligence jobs, RFK Jr and Tulsi Gabbard. Now they’ve fall into line.","url":"https://www.smh.com.au/world/north-america/republicans-cave-to-trump-endorse-contentious-picks-for-cabinet-20250205-p5l9lu.html","image":"https://static.ffx.io/images/$zoom_0.1487%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/8a92e28985319eea3b13e58da47aea94da191e69","video":null,"publish_date":"2025-02-05 00:44:32","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","category":"politics","source_country":"au","sentiment":-0.256},{"id":287153684,"title":"Elon Musk shares desire to visit mysterious square structure spotted on Mars","text":"This mysterious square structure has been spotted on Mars - and, naturally, Elon Musk wants to investigate it.\n\nThe incredible geometric shape - estimated to be 3km (1.8miles) wide - was first spotted by NASA's Mars Global Surveyor's Mars Orbiter Camera (MOC) but has been brought to the wider attention by podcaster Joe Rogan.\n\nHe is Mr Musk's friend and, amid chatter between the pair on X, the owner of SpaceX revealed he wants to visit the mysterious structure. The 53-year-old entrepreneur, recently described as a \"special government employee\" under Donald Trump's administration, posted: \"We should send astronauts to Mars to investigate!\"\n\nReacting to the scientific images posted by another X user, Mr Rogan, 57, had initially commented: \"This is f****** WILD\". To which, some social media users suggest otherworldly intelligence created the spectacle.\n\nComments included: \"This structure is identical to the Great Pyramid of Giza in many aspects\", \"Nothing in nature creates straight lines. Someone made that,\" and \"Who wants to bet there used to be life on Mars?\"\n\nWhile others disputed any there is any mystery to the formations. One X user wrote: \"Natural geological fracturing can cause right angles like that. It's not amazing to search an entire planet and find one or two. Amazing would be finding so many its approaching a statistical impossibility.\"\n\nMr Musk's company, SpaceX, lauched a Falcon 9 rocket on Thursday night, which threatened to send deafening sonic booms rattling across Central Florida.\n\nThe aerospace company brought its booster back for a rare land recovery, targeting a 54-minute window from 6:13pm to 7:07pm local time. The Falcon 9 was launched from pad 39A, before returning to land at Cape Canaveral Space Force Station in Central Florida – with potential sonic booms to be heard by residents across multiple counties.\n\nThe mission deployed the third pair of Maxar’s WorldView Legion high-resolution satellite imagery into orbit. It followed the fog-covered Falcon 9 liftoff on a Starlink mission from Cape Canaveral Space Force Station.","summary":"Elon Musk, who has been vaguely described as a &quot;special government employee&quot; under Donald Trump's administration, suggested he intends to send astronauts to investigate the square","url":"https://www.mirror.co.uk/science/breaking-elon-musks-desire-visit-34616561","image":"https://i2-prod.mirror.co.uk/incoming/article34616577.ece/ALTERNATES/s1200/1_Musk-Main.jpg","video":null,"publish_date":"2025-02-05 00:42:35","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","source_country":"GB","sentiment":0.011},{"id":287152176,"title":"Trump proposes permanent displacement of Gazans with Netanyahu at White House","text":"WASHINGTON, Feb 4 (Reuters) - U.S. President Donald Trump proposed the permanent resettlement of Palestinians from war-shattered Gaza to neighboring countries, calling the enclave a “demolition site” on Tuesday as he held pivotal talks with Israeli Prime Minister Benjamin Netanyahu.\n\nTrump repeated his call for Jordan, Egypt and other Arab states to take in Gazans, saying Palestinians there had no alternative but to abandon the coastal strip, which must be rebuilt after nearly 16 months of a devastating war between Israel and Hamas.\n\nBut this time Trump said he would support resettling Palestinians “permanently,” going beyond his previous suggestions that Arab leaders had already steadfastly rejected.\n\nIsrael commits to new Gaza talks ahead of Trump meeting\n\nJust two weeks into his second term, Trump was hosting Netanyahu at the White House to discuss the future of the fragile Gaza ceasefire, strategies to counter Iran and hopes for a renewed push for an Israeli-Saudi normalization deal. “It’s a pure demolition site,”\n\nTrump, speaking shortly before Netanyahu arrived, said of Gaza.\n\n“If we could find the right piece of land, or numerous pieces of land, and build them some really nice places with plenty of money in the area, that’s for sure. I think that would be a lot better than going back to Gaza.”\n\n“I don’t know how they (Palestinians) could want to stay,” Trump said when asked about the reaction of Palestinian and Arab leaders to his proposal.\n\nWith Netanyahu at his side in the Oval Office, Trump later made similar remarks but suggested that Palestinians should leave Gaza for good “in nice homes and where they can be happy and not be shot, not be killed.”\n\n“They are not going to want to go back to Gaza,” he said.Reasserting his proposal at a joint press conference after their talks, Trump described the Gaza Strip as a longtime “symbol of death and destruction” and said Palestinians there should be housed in “various domains” in other countries. He said the U.S. will take over the Gaza Strip, “level the site” and create economic development but did not say how.\n\nTrump offered no specifics on how a resettlement process could be implemented but his proposal echoed the wishes of Israel’s far right and contradicted former President Joe Biden’s commitment against mass displacement of Palestinians.\n\nSome human rights advocates have likened Trump’s idea to ethnic cleansing. Forced displacement of Gaza’s population would likely be a violation of international law and would be fiercely opposed not only in the region but also by Washington’s Western allies.\n\nSenior Hamas official Sami Abu Zuhri condemned Trump’s calls for Gazans to leave as “expulsion from their land.”\n“We consider them a recipe for generating chaos and tension in the region because the people of Gaza will not allow such plans to pass,” he said.\n\nAs Netanyahu arrived at the White House, Trump greeted him at the doors and the two leaders smiled for photographers before heading inside. Dozens of pro-Palestinian protesters gathered outside the gates during the Israeli leader’s visit.\n\nThe meeting, Trump’s first with a foreign leader since returning to office on Jan. 20, was meant to showcase close ties between the president and Netanyahu after a period of strained relations between the prime minister and Biden over Israel’s handling of the war in Gaza.\n\nBut Netanyahu could also come under pressure from a sometimes unpredictable American president whose broader policy goals for the Middle East may not always match Netanyahu’s domestic and geopolitical interests.\n\nMIDDLE EAST AT A CRITICAL JUNCTURE\n\nTheir meeting coincided with the start of mediation efforts between Israel and Hamas on the crucial second stage of the ceasefire deal and hostage release, which many experts believe is fraught with obstacles.\n\nThe region is at a critical juncture, with the Gaza truce fragile, a parallel Israel-Hezbollah ceasefire deal in Lebanon nearing possible expiration within weeks and concerns about Iran’s nuclear ambitions persisting despite its weakened state.\n\nTrump’s call for the resettlement of Gazans has added to regional unease where many countries are uncertain what his return to power will mean for them.\n\nIn his first term, Trump handed Netanyahu a series of successes, including relocation of the U.S. embassy to Jerusalem from Tel Aviv and the signing of the Abraham Accords, normalizing relations between Israel and several Arab states. He remains a strong supporter of Israel, taking credit for helping to broker the Gaza deal between Israel and Hamas even before he returned to office, while insisting he wants to end the wars in the Middle East.\n\nTrump has said he hopes to renew an effort toward historic normalization of relations between Israel and Arab power Saudi Arabia, and U.S. officials said that goal, plus maintaining the Gaza ceasefire, would be a focus of the White House talks.\n\nTrump’s broader regional ambitions have created uncertainty over how much leeway he will give Netanyahu. The prime minister faces demands from far-right members of his coalition threatening to topple his government unless he restarts the fighting in Gaza to fulfill his pledge to destroy Iran-backed Hamas.\n\nAn ever-raging war would complicate if not block Trump’s attempt to bring the Saudis to the negotiating table.\n\nThough Biden maintained military support for Israel after Hamas’ Oct. 7, 2023, attack that prompted the Israeli assault on Gaza, relations were strained at times over the high Palestinian civilian death toll and Netanyahu’s defiance of U.S. demands.","summary":"WASHINGTON, Feb 4 (Reuters) - U.S. President Donald Trump proposed the permanent resettlement of Palestinians from war-shattered Gaza to neighboring countries, calling the enclave a “demolition site” on Tuesday as he held pivotal talks with Israeli Prime Minister Benjamin Netanyahu.\n\n\nTrump repeated his call for Jordan, Egypt and other Arab states to take in Gazans, saying Palestinians there had no alternative but to abandon the coastal strip, which must be rebuilt after nearly 16 months of a devastating war between Israel and Hamas.\n\n\nBut this time Trump said he would support resettling Palestinians “permanently,” going beyond his previous suggestions that Arab leaders had already steadfastly rejected.\n\n\nIsrael commits to new Gaza talks ahead of Trump meeting\n\n\nJust two weeks into his second term, Trump was hosting Netanyahu at the White House to discuss the future of the fragile Gaza ceasefire, strategies to counter Iran and hopes for a renewed push for an Israeli-Saudi normalization deal. “It’s a pure demo","url":"https://www.brecorder.com/news/40346377/trump-proposes-permanent-displacement-of-gazans-with-netanyahu-at-white-house","image":"https://i.brecorder.com/large/2025/02/050541457744127.jpg?r=054154","video":null,"publish_date":"2025-02-05 00:41:59","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.444},{"id":287153412,"title":"Trump states that the United States is prepared to seize control of the Gaza Strip using troops if needed.","text":"President Donald Trump outlined an extraordinary new plan for the Middle East on Tuesday, with the United States taking control of the war-torn Gaza strip while its Palestinian population is moved to neighboring countries.\n\nIt is the latest evolution in his plan for rebuilding a territory devastated by Israeli bombardment.\n\nHis words will sow fear in the Palestinian population but Trump insisted it was time for a new way of thinking.\n\n‘The US will take over the Gaza Strip, and we will do a job with it too,’ he said at a press conference alongside Israeli Prime Minister Benjamin Netanyahu. \n\n‘We’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site … level the site and get rid of the destroyed buildings.’\n\nTrump a property developer who sees the world in terms of deals, has long talked up Gaza’s coastal location and pleasant climate as a perfect holiday vacation. \n\nIn his vision, U.S. reconstruction would create thousands of jobs and spare Palestinians the pain and expense of rebuilding once again. \n\nWhen a reporter asked if that might involve military force, Trump answered: ‘If necessary. \n\nAnd when asked who would live there, he answered: ‘I envision world people living there. The world’s people. \n\n‘I think you’ll make that into an international, unbelievable place.’\n\nYet the proposal to move out Gaza Palestinian population will be seen as a call for ‘ethnic cleansing’ by opponents.\n\nNetanyahu could not help but beam as the president outlined his latest proposal. And he praised Trump for his radical thinking, such as recognizing Jerusalem as the capital of Israel during his first term.\n\n‘You see things others refuse to see,’ he said. ‘You say things others refuse to say. \n\n‘And after the jaws drop people scratch their heads and they say, you know, he’s right.’\n\nMore than 40,000 people have been killed in Gaza since Israel launched strikes in the wake of Oct. 7 Hamas terror attack. \n\nHundreds of thousands of people have been displaced.\n\n‘I don’t think people should be going back,’ said Trump earlier as he welcomed Netanyahu to the Oval Office. “You can’t live in Gaza right now. I think we need another location. \n\n‘I think it should be a location that’s going to make people happy.’\n\nThe comments will terrify Palestinians who have long feared that Israel was seeking to take their land. \n\nThey have lived under an economic blockade and more than a year of military bombardment, leaving the territory resembling a ‘demolition site,’ as Trump put it.\n\nNetanyahu is visiting to plan for the next stage of talks with Hamas, negotiations which plan for three to five years of reconstruction. \n\nAmerican officials have already made clear that they see that timeline as unviable. \n\nAgainst that backdrop, Trump upended the Middle East 10 days by floating the idea of moving the territory’s population to Egypt and Jordan, in answer to DailyMail.com question.\n\nBoth countries have rejected the idea. \n\nBut the former property developer, who sees the world in terms of deals, insisted that other nations would step up. \n\n‘You look over the decades, it’s all death in Gaza,’ he said. \n\n‘This has been happening for years. It’s all death. \n\n‘If we can get a beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what’s happening in Gaza.’\n\nEarlier Trump’s national security adviser told reporters that Trump viewed the issue as a humanitarian one.\n\n‘You have these people that are sitting with literally thousands of unexploded ordinance and piles of rubble,’ said Mike Waltz. \n\n‘At some point, we have to look realistically, how do you rebuild Gaza? What does that look like? What is the timeline? \n\n‘A lot of people were looking at very unrealistic timelines. We’re talking 10 to 15 years.’\n\nIt was all smiles between Trump and Netanyahu on Tuesday, but there has been tension in their relationship.\n\nTrump complained during his first term that the Israeli leader let him down just before the US killed a top Iranian general in 2020, dropping out of the operation at the 11th hour.\n\nAnd he was furious that Netanyahu congratulated President Joe Biden on winning the 2020 election.\n\nBut Netanyahu, who has lost support at home and who has been indicted at the International Criminal Court, badly needs Trump now to help shore up his position.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump outlined an extraordinary new plan for the Middle East on&#8230;\n\n\nThis Post: Trump states that the United States is prepared to seize control of the Gaza Strip using troops if needed. first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-states-that-the-united-states-is-prepared-to-seize-control-of-the-gaza-strip-using-troops-if-needed/","image":"https://i.dailymail.co.uk/1s/2025/02/05/00/94869121-0-image-a-24_1738714759023.jpg","video":null,"publish_date":"2025-02-05 00:40:59","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.061},{"id":287154596,"title":"Donald Trump teases US aims to ‘take over’ Gaza during Netanyahu’s visit","text":"United States President Donald Trump has welcomed Israeli Prime Minister Benjamin Netanyahu to the White House, marking the first visit of a foreign leader during his second term.\n\nBut Tuesday’s meeting was steeped in controversy as Trump repeatedly weighed in on the future of war-torn Gaza — and whether Palestinians should return to live in the enclave.\n\n“Gaza is a guarantee that they’re going to end up dying. The same thing is going to happen again,” Trump said. “It’s happened over and over again. And it’s going to happen again.”\n\n“So I hope we can do something where they wouldn’t want to go back.  Who would want to go back? They’ve experienced nothing but death and destruction.”\n\nTrump also suggested that the US aims to “take over” a depopulated Gaza, shaping its landscape for years to come.\n\n“ I do see a long-term ownership position, and I see it bringing great stability to that part of the Middle East and maybe the entire Middle East,” Trump said. “This was not a decision made lightly. Everybody I’ve spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs.”\n\nA fragile ceasefire recently paused hostilities in Gaza where, for the past 15 months, Israel has led a devastating military campaign that has killed an estimated 61,700 Palestinians.\n\nUnited Nations experts and human rights advocates have compared the military campaign with a genocide. But the US remains a firm ally of Israel – and of Netanyahu’s government.\n\nIn remarks after his bilateral meeting with Netanyahu, Trump returned to a vision he had outlined earlier in the day, in which Palestinians would be settled “permanently” in “a beautiful area” outside of Gaza.\n\nSuch comments have spurred fears that Trump would support the ethnic cleansing of Gaza, and nearby countries like Egypt and Jordan have repeatedly rejected the prospect of absorbing Gaza’s population.\n\n“I think Jordan and Egypt – they say they’re not going to accept, but I say they will. But I think other countries will accept also,” Trump said.\n\nA close ally\n\nTuesday’s bilateral meeting was set against a period of regional turmoil in the Middle East.\n\nRecent ceasefires have slowed hostilities in Lebanon and Gaza. A new government has risen in Syria. And there are growing tensions between Iran and Israel.\n\nBefore arriving in the US on Sunday, Netanyahu underscored the symbolism of being the first foreign head of state to visit Trump since the president’s second inauguration on January 20.\n\n“I think it’s a testimony to the strength of the Israeli-American alliance,” Netanyahu said in a statement.\n\nThe two countries indicated that a range of topics would be on the table for discussion, including the ceasefire agreements, the future of Gaza and efforts to normalise relations between Israel and its Arab neighbours.\n\nIn the lead-up to Tuesday’s meeting, Trump also signed a series of executive orders and directives, some of which pertained to goals he shares with Netanyahu.\n\nOne announced the return of his “maximum pressure” campaign against Iran. Another saw the US withdraw from the United Nations Human Rights Council and UNRWA, the relief agency for Palestinian refugees.\n\nNetanyahu’s government has accused UNRWA of involvement in the attack on southern Israel on October 7, 2023, without offering proof to substantiate the claim.\n\nThe Israeli leader’s visit was greeted by protesters calling for a “free, free, free Palestine”.\n\nSome activists denounced his invitation to the White House as an honour bestowed on a “war criminal”: In November, the International Criminal Court in The Hague issued an arrest warrant for Netanyahu on charges of crimes against humanity and war crimes.\n\nStill, Trump reaffirmed his commitment to Netanyahu at Tuesday’s news conference.\n\n“The bonds of friendship and affection between the American and Israeli people have endured for generations, and they are absolutely unbreakable,” Trump said.\n\nNetanyahu responded with praise of his own: “You are the greatest friend Israel has ever had in the White House.”\n\nCeasefire in Gaza\n\nThe tenuous ceasefire in Gaza was a central part of the two leaders’ latest meeting.\n\nTrump has repeatedly taken credit for the ceasefire deal, which came into effect on January 19, the day before he took office. He blamed the foreign policy of his predecessor Joe Biden for allowing the war in Gaza to begin in the first place.\n\n“Nobody did anything for four years except in the negative,” Trump said at one point, referring to Biden’s term in office. “Unfortunately, the weakness and incompetence of those past four years [caused]  the grave damage around the globe.”\n\nStill, Trump has cast doubt on the strength of the ceasefire and whether it would last.\n\n“The strikes could start tomorrow,” Trump said on Tuesday. “There’s not a lot left to strike.”\n\nThe initial 42-day truce, which will see the release of 33 Israeli captives and nearly 2,000 Palestinian prisoners, expires on March 1.\n\nOn Tuesday, a spokesperson for the Palestinian group Hamas said that negotiations for a second phase of the ceasefire have begun. If agreed to, that phase would see the full withdrawal of Israeli troops from Gaza and the freeing of all captives.\n\nBut Trump lashed out at the group in his remarks, praising Israel’s efforts to cut off resources to Gaza.\n\n“We starved Hamas and Iran’s other terrorist proxies, and we starved them like they had never seen before. Resources and support disappeared for them,” Trump said.\n\nUS to ‘take over’ Gaza?\n\nThe president also renewed his call for a mass displacement of Palestinians in Gaza, despite human rights experts warning that it would amount to ethnic cleansing.\n\n“ It’s been an unlucky place for a long time,” Trump said of Gaza. “ And it should not go through a process of rebuilding and occupation by the same people that have really stood there and fought for it and lived there and died there and lived a miserable existence there.”\n\nHe added that Palestinians would “love to leave” if given an alternative.\n\n“They should get a good, fresh, beautiful piece of land, and we [can] get some people to put up the money to build it and make it nice and make it habitable and enjoyable,” Trump explained.\n\nHe stopped short of committing US resources to any such construction effort, saying a new home for Palestinians could be  ”paid for by neighbouring countries of great wealth”.\n\nHe did, however, propose that the US would assert a presence in Gaza in the future.\n\n“ The US will take over the Gaza Strip, and we will do a job with it too. We’ll own it and be responsible for dismantling all of the dangerous, unexploded bombs and other weapons on the site. Level the site,” Trump said.\n\n“Level it out and create an economic development that will supply unlimited numbers of jobs and housing for the people of the area.”\n\nEarlier in the day, he had said he would not necessarily support Israel taking Gaza itself: “Not necessarily, no. I just support cleaning it up and doing something with it.”\n\nThe US has backed the Israeli offensive in Gaza, providing billions in military aid.\n\nA hardline approach to Iran\n\nAnother pillar of Tuesday’s meeting was how to approach Iran, which Netanyahu has portrayed as Israel’s greatest threat.\n\nOn Tuesday, Netanyahu chuckled as he recalled how Trump during his first term decided to withdraw from the Joint Comprehensive Plan of Action (JCPOA), an agreement that would have seen Iran limit its nuclear programme in favour of loosened sanctions.\n\nIran responded in the years since by escalating its nuclear programme.\n\n“ You withdrew from the disastrous Iran nuclear deal. I remember we spoke about it. You said, ‘This is the worst deal I’ve ever seen,'” Netanyahu said. “ I think it speaks loudly for just common sense.”\n\nFor his part, Trump played up his decision to return to the “maximum pressure” strategy he pursued during his first term.\n\n“ We will once again enforce the most aggressive possible sanctions, drive Iranian oil exports to zero and diminish the regime’s capacity to fund terror throughout the region and throughout the world,” he said.\n\nUS officials have argued that Iran and its allies like Hezbollah and Hamas have been “weakened” by the regional violence that broke out over the last year.\n\nHezbollah has been dealt heavy blows after the Israeli bombardment of southern Lebanon. Hamas has lost its top military and political leaders. And the regime of Syrian President Bashar al-Assad has collapsed.\n\nCritics have warned, however, that Netanyahu may exploit this moment to seek US assistance in striking Iran’s nuclear facilities.\n\nAt a news conference on Tuesday, Nihad Awad, the executive director of the Council on American-Islamic Relations (CAIR), urged Trump to stand up against any Israeli attempt to launch an offensive targeting Iran.\n\n“We hope that President Trump will not be dragged and fooled by this war criminal, Benjamin Netanyahu, to launch a war on Iran and destabilise the region further,” Awad told reporters.\n\n“President Trump has a golden opportunity to put an end to the suffering of the people in the region and hold the Israeli leaders accountable instead of celebrating them.”\n\nTrump did leave the door open for diplomacy, saying that he is “unhappy” to apply renewed sanctions on Iran. He added that his only red line is that Iran cannot have a nuclear weapon.\n\n“I want to see everybody do well. I want to see great countries, and I want to see peace in the Middle East and elsewhere,” he said.\n\nTrump has not ruled out speaking to Iranian officials.","summary":"The Israeli prime minister was the first foreign leader to visit Trump after his inauguration ceremony on January 20.","url":"https://www.aljazeera.com/news/2025/2/5/donald-trump-teases-us-aims-to-take-over-gaza-during-netanyahus-visit?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/02/AP25035789175045-1738707831_075271-1738708833.jpg?resize=1200%2C630&quality=80","video":null,"publish_date":"2025-02-05 00:40:24","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.201},{"id":287153178,"title":"Ayanna Pressley says Dems will fight 'Nazi nepo baby' Elon Musk 'in the streets'","text":"Democratic Rep. Ayanna Pressley of Massachusetts tossed out insults against tech entrepreneur Elon Musk and called for activists to fight against him \"in the streets.\" \n\nPressley was flanked by other Democrats including Rep. Maxine Waters of California at a protest against Musk gaining access to data records at the Treasury Department. \n\n'This is not your trashy Cybertruck that you can just dismantle, pick apart, and sell the pieces of!' \n\n\"This is an unprecedented moment and unconstitutional crisis, but we will match their energy!\" said Pressley. \"With unprecedented organizing, mobilizing, agitating, we will see you in the courts, in Congress, [and] in the streets!\"\n\nMusk was chosen by President Donald Trump to identify government offices and programs that were opposed to the Trump agenda and needed to be shut down. Democrats have been furious at his efforts to severely curtail the United States Agency for International Development.\n\n\"Elon Musk is a Nazi nepo baby, a godless, lawless billionaire who no one elected!\" she continued. \"Elon! This is the American people. This is not your trashy Cybertruck that you can just dismantle, pick apart, and sell the pieces of!\" \n\nVideo of Pressley's comments were posted to social media where many criticized her for the insults she lobbed at Musk. Some characterized Pressley's comments as advocating for violence against Musk and others on the right.\n\nDemocrats also protested outside of the USAID building after workers were locked out and Secretary of State Marco Rubio announced that he was taking over as acting director of the organization. \n\n\"This is a constitutional crisis that we are in today. Let's call it what it is,\" said Sen. Chris Murphy (D-Conn.). \"The people get to decide how we defend the United States of America. The people get to decide how their taxpayer dollars are spent. Elon Musk does not get to decide.\"\n\nCritics claim that Musk does not have the authority to dismantle a government office that was instituted by Congress. \n\nPressley posted a video of herself leading a chant with protesters saying, \"Hey hey! Ho ho! Elon Musk has got to go!\" \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"Democratic Rep. Ayanna Pressley of Massachusetts tossed out insults against tech entrepreneur Elon Musk and called for activists to fight against him \"in the streets.\" \n\nPressley was flanked by other Democrats including Rep. Maxine Waters of California at a protest against Musk gaining access to data records at the Treasury Department. \n\n'This is not your trashy Cybertruck that you can just dismantle, pick apart, and sell the pieces of!' \n\n\"This is an unprecedented moment and unconstitutional crisis, but we will match their energy!\" said Pressley.  \"With unprecedented organizing, mobilizing, agitating, we will see you in the courts, in Congress, [and] in the streets!\"\n\nMusk was chosen by President Donald Trump to identify government offices and programs that were opposed to the Trump agenda and needed to be shut down. Democrats have been furious at his efforts to severely curtail the United States Agency for International Development.\n\n\"Elon Musk is a Nazi nepo baby, a godless, lawless billionaire who no one ","url":"https://www.theblaze.com/news/ayanna-pressley-nazi-nepo-musk","image":"https://www.theblaze.com/media-library/ayanna-pressley-says-dems-will-fight-nazi-nepo-baby-elon-musk-in-the-streets.jpg?id=56188554&width=1200&height=600&coordinates=0%2C173%2C0%2C174","video":null,"publish_date":"2025-02-05 00:35:00","author":"Blaze News","authors":["Blaze News"],"language":"en","source_country":"US","sentiment":-0.257},{"id":287151530,"title":"Trump: ‘The U.S. will take over the Gaza Strip’","text":"IE 11 is not supported. For an optimal experience visit our site on another browser.\n\nTrump: ‘The U.S. will take over the Gaza Strip’Feb. 5, 202503:44Now PlayingTrump: ‘The U.S. will take over the Gaza Strip’03:44UP NEXT'Illegal': Elon Musk's 'DOGE' coup at USAID 'makes our country less safe,' top Dem explains07:35Joy slams 'DOGE' coup: ‘Unelected billionaire Musk has personal data of millions’11:08Safety over convenience: D.C. Mayor on the need to revisit air traffic policy after deadly crash05:32Elon and Trump’s great, unjust purge of federal institutions07:39‘Focus is power’: Chris Hayes on covering Trump in the age of ‘the attention economy’07:25‘Reckless and shameful’: Kansas Rep. blasts Trump’s comments on fatal D.C. plane crash09:22'Legally dubious': Fmr. Biden policy advisor skeptical of Trump's plan to buy out federal workers07:52'Terrifying’: Obama's HHS Secretary blasts RFK Jr.'s responses in confirmation hearing08:16Web Exclusive: NY AG James calls out convict Trump - 'He thinks he can undermine the Constitution’05:09‘There's no reasonable doubt’: Jan. 6 insurrectionists pardoned by Trump re-arrested, shot by police05:34Illegal 'cuts'? Trump's shocking federal money freeze causing 'chaos,' Michigan Gov. Whitmer says06:26NY AG James leads nationwide legal smackdown of Trump's 'illegal' attempt to freeze federal money07:59Government deficiency: Trump ICE raids waste money with military planes to deport at Biden's levels06:59Trump’s war on DEI a cover for oligarchs planning to ‘loot the federal government,’ critics say10:26Snitches get riches: Trump destroys DEI as Project 2025 plot to give allies jobs, expert says06:29‘No respect’: Trump defense secretary pick Hegseth faces THIS challenge if confirmed, veteran says11:12Back the blue? Officers assaulted on Jan. 6 slam Trump, members of Congress defending MAGA mob07:21‘Beaten, tased’: Jan. 6 officer slams Trump calling MAGA mob attacks on him ‘very minor’11:21Trump doesn’t know what DEI is—so his attacks will hurt veterans, labor leader says06:57The ReidoutTrump: ‘The U.S. will take over the Gaza Strip’03:44Share this -CopiedPresident Donald Trump suggested that the U.S. will take over the Gaza Strip during a joint news conference with Israeli Prime Minister Benjamin Netanyahu on Tuesday, something Trump has never said before.Feb. 5, 2025Now PlayingTrump: ‘The U.S. will take over the Gaza Strip’03:44UP NEXT'Illegal': Elon Musk's 'DOGE' coup at USAID 'makes our country less safe,' top Dem explains07:35Joy slams 'DOGE' coup: ‘Unelected billionaire Musk has personal data of millions’11:08Safety over convenience: D.C. Mayor on the need to revisit air traffic policy after deadly crash05:32Elon and Trump’s great, unjust purge of federal institutions07:39‘Focus is power’: Chris Hayes on covering Trump in the age of ‘the attention economy’07:25MSNBC HIGHLIGHTS (BEST OF MSNBC)Play AllThe ReidoutTrump: ‘The U.S. will take over the Gaza Strip’The Beat with Ari‘Purge’: See Jan 6 prosecutor blow whistle on Trump’s push for ‘partisan’ DOJ hunting foesMorning JoeDoris Kearns Goodwin: We are witnessing an attempt to return to the old spoils systemMorning JoeTrump is a bully and he is trying to bully everybody: Robert ReichMorning Joe'One of the coolest gigs a comedian can get': Amber Ruffin tapped for WHCA dinnerMorning JoeJulia Stiles makes directorial debut with 'Wish You Were Here'Play All","summary":"President Donald Trump suggested that the U.S. will take over the Gaza Strip during a joint news conference with Israeli Prime Minister Benjamin Netanyahu on Tuesday, something Trump has never said before.","url":"https://www.msnbc.com/the-reidout/watch/trump-suggested-that-the-us-will-take-over-the-gaza-strip-231114309520","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_02/1738715726948_n_reidout_trumpgaza_250204_1920x1080-ns59ma.jpg","video":null,"publish_date":"2025-02-05 00:34:07","author":"Msnbc","authors":["Msnbc"],"language":"en","category":"politics","source_country":"US","sentiment":-0.154},{"id":287153572,"title":"Trump suggests 'permanently' resettling of Palestinians from Gaza","text":"Israeli Prime Minister Benjamin Netanyahu met US President Donald Trump at the White House late on Tuesday to discuss a truce with Hamas. Trump suggested relocating Palestinians from Gaza to other countries. \"It would be my hope that we could do something really nice, really good, where they wouldn't want to return,\" Trump said. \"Why would they want to return? The place has been hell.\" Trump earlier said Palestinians would \"love\" a plan to move them to Middle Eastern countries, including Egypt and Jordan. He took credit for securing the Israel-Hamas truce and was expected to ask Netanyahu to move forward with the next phase of the ceasefire. Netanyahu, when asked about the possibility of progress, said, \"We're going to try. That's one of the things we're going to talk about. When Israel and the United States work together, and President Trump and I work together, the chances go up a lot.\" Egypt, Jordan reject Idea Egypt and Jordan rejected Trump's suggestion of relocating Palestinians. Still, Trump, with Netanyahu by his side, said he believes Egypt and Jordan—as well as other countries which he did not name—will ultimately agree to take in Palestinians.“You look over the decades, it’s all death in Gaza,” Trump said. \"This has been happening for years. It’s all death. If we can get a beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what’s happening in Gaza.”Trump said Palestinians should get a \"fresh, beautiful piece of land\" in another country. \"I think they'd love to leave Gaza if they had an option,\" he said before his meeting with Netanyahu. Israel announced it was sending a delegation to Qatar to discuss the second phase of the ceasefire agreement. Hamas confirmed that negotiations had begun, with spokesperson Abdel Latif al-Qanou saying the focus was on \"shelter, relief and reconstruction.\" The first phase of the ceasefire, lasting six weeks, involves the exchange of hostages held in Gaza for prisoners in Israeli custody. Hamas took 251 hostages in its October 7, 2023, attack on Israel. Israel says 76 hostages remain in Gaza, including 34 who are dead. Families of Israeli hostages are urging for the agreement to continue to secure their release. Trump said he would also work on restarting efforts for a normalization deal between Israel and Saudi Arabia, which were halted after the Gaza war. Discussions with Netanyahu also included Iran, which supports Hamas and Hezbollah. Before the meeting, Trump signed an order reinstating \"maximum pressure\" on Iran over allegations of nuclear weapon development. Since the ceasefire began on January 19, Israel has conducted operations against militants in the occupied West Bank. The UN warned that conditions in the Jenin refugee camp were worsening. On Tuesday, the Israeli military said a gunman killed two soldiers near Jenin before being shot. Under the ceasefire, 18 hostages have been freed, and around 600 Palestinian prisoners have been released. More aid, including food, fuel, and medicine, has entered Gaza. Some displaced people have returned to the north. Hamas's October 7 attack killed 1,210 people in Israel, mostly civilians, according to official Israeli figures. Israel’s response has killed at least 47,518 people in Gaza, mostly civilians, according to the Hamas-run health ministry. The UN considers these numbers reliable.","summary":"Israeli Prime Minister Netanyahu and US President Trump discussed a truce with Hamas and Trump's proposal to relocate Palestinians from Gaza to other Middle Eastern countries, despite resistance from Egypt and Jordan. The meeting also addressed efforts for a normalization deal between Israel and Saudi Arabia and tensions with Iran.","url":"https://timesofindia.indiatimes.com/world/us/the-place-has-been-hell-donald-trump-suggests-permanently-resettling-of-palestinians-in-gaza-as-he-meets-netanyahu-in-white-house/articleshow/117930823.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117930935/117930935.jpg","video":null,"publish_date":"2025-02-05 00:31:24","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.265},{"id":287151548,"title":"Democrats demand answers after Trump unleashes attacks on FBI officials","text":"Democrats have now issued two separate letters over “national security concerns” caused by the Trump administration. \n\nOne letter, sent on Tuesday, is from 20 Democratic attorneys general requesting that Donald Trump’s FBI pick, Kash Patel, return to Congress to answer further questions about political retribution and retaliation in the FBI. \n\n“The request follows alarming reports of politically motivated firings at the FBI and efforts to compile a list of agents involved in investigating the January 6th Capitol riots,” said Rhode Island Attorney General Peter Neronha in a press release regarding the coalition’s letter.\n\nThis comes after Patel was questioned by Democrats last week in Congress about an “enemies list” in his confirmation hearing, targeting so-called \"deep state\" officials in Trump’s latest retaliation saga.\n\nArizona, California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, Rhode Island, Vermont, and Washington are the states involved in the request to bring Patel back for more questions.\n\n“We demand that you use your Constitutional authority to require that Kash Patel, President Trump’s nominee to be the director of the FBI, return for further questioning before the Judiciary Committee,” said Arizona Attorney General Kris Mayes, who spearheaded the coalition. “Mr. Patel must answer questions about this unprecedented attack on the FBI before Senators vote on his confirmation.”\n\nThe other letter is from Democratic senators addressing “grave concerns” over the chaotic purging of FBI and DOJ officials this week.\n\nOn Monday, as Trump and Musk continued their weeklong federal purge, threatening employees with a “buyout” and firing FBI officials and civil servants, Senate Judiciary Democrats issued a letter demanding Trump’s Cabinet picks address “grave concerns” over Trump’s “mass purging.” \n\nLetters were sent to Trump’s Attorney General pick Pam Bondi, FBI pick Patel, Deputy Attorney General pick Todd Blanche, Acting Attorney General James McHenry, and Acting FBI Director Brian Driscoll.\n\n“We have grave concerns about the removal or reassignment across the DOJ and FBI of senior career civil servants who have served honorably under multiple administrations, regardless of the President’s party,” the 10 senators explained in a press release. “The removals and reassignments from their positions of a significant number of experienced, nonpartisan Department officials with invaluable national security expertise without any comparable replacements one day into the second Trump Administration presents an alarming threat to national security.”\n\nMeanwhile, on Tuesday, CNN reported that the FBI has turned over the names of 5,000 individuals who worked on the Jan. 6 cases to the Trump administration’s Justice Department. \n\nEven some Republicans are aghast by the purge. \n\nChris Christie, former New Jersey governor and Trump ally before their public fallout, weighed in on ABC News’ “This Week” on Sunday. He said FBI officials “are stunned about what’s happening” and called it “incredibly dangerous” to national security. \n\n“In the threat assessment we have right now across the world, to lose that many agents, and then take a year to a year-and-a-half to try to replace them, is incredibly dangerous for our national security,” Christie said. “And for what? Because they did their jobs.”\n\nThe mounting backlash from Democratic lawmakers and former Republican allies shows just how unprecedented the gutting within the FBI and DOJ is. With Patel at the center of scrutiny, concerns of political retribution and the erosion of nonpartisan law enforcement are reaching a boiling point. \n\nDaily Kos is different because we don't hold back, and we're not afraid to call out Trump. Chip in $5 to Daily Kos.","summary":"Democrats have now issued two separate letters over “national security concerns” caused by the Trump administration. \n\n\n\nOne letter, sent on Tuesday, is from 20 Democratic attorneys general requesting that Donald Trump’s FBI pick, Kash Patel, return to Congress to answer further questions about political retribution and retaliation in the FBI. \n\n\n\n“The request follows alarming reports of politically motivated firings at the FBI and efforts to compile a list of agents involved in investigating the January 6th Capitol riots,” said Rhode Island Attorney General Peter Neronha in a press release regarding the coalition’s letter.\n\n\n\nThis comes after Patel was questioned by Democrats last week in Congress about an “enemies list” in his confirmation hearing, targeting so-called \"deep state\" officials in Trump’s latest retaliation saga.\n\n\n\nArizona, California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, Nevada, New Jersey, New Mexico, New York, Oregon, Rhode ","url":"https://www.dailykos.com/story/2025/2/4/2301401/-Democrats-demand-answers-after-Trump-unleashes-attacks-on-FBI-officials?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1394466/story_image/AP25030562279212.jpg?1738593645","video":null,"publish_date":"2025-02-05 00:30:15","author":"Morgan Stephens","authors":["Morgan Stephens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":287152012,"title":"Letters: Supporting Trump doesn’t make us bad or stupid. We just see the world differently than you.","text":"Like it or not, Trump\nis America’s president\n\nLove it or hate it, the American people have spoken and put the one many around here regard as a villain back in the White House. But that 77 million people voted for Donald Trump doesn’t make us either bad or stupid people. We just see the world, and Donald Trump, differently than you.\n\nI know that seeing the title “President Trump” in print again makes the blood of many around here boil, but you’re wrong to hate like this. Indeed, you would be wrong even if he was much worse than you think he is. God calls us to love our neighbors (which is really everyone we know) as ourselves.\n\nPresident Trump won a second chance to make his mark on American history. If it turns into a disaster, then the Democrats will be able to win next time. That’s just how it works in our democracy.\n\nChristopher Andrus\n\nLet’s not overpraise\nthe rich for crumbs\n\nWhen I go to a program at Lesher Center for the Arts, someone very much like myself comes on stage and immediately thanks Chevron for supporting whatever event I’ve attended. Then I go home, turn on the TV to watch the “PBS NewsHour,” and I see it thanking a long list of rich people and their foundations.\n\nAll the while I’m thinking: With one hand most of those companies, foundations and rich people have generated supernormal profits by plundering society, and with the other they dole out a few crumbs to good causes like Lesher programs and the “PBS NewsHour.”\n\nReally, why the heck should we lavish thanks on them for what they owe us?\n\nJim Wolpman\nWalnut Creek\n\nBack to the bad old\ndays without vaccines\n\nRe: “Halting foreign aid hurts U.S. as well as world” (Page A6, Jan. 29).\n\nAre we going back to the 1930s and 40s — before the polio and measles vaccines — when millions died of these diseases and others?\n\nKansas City, Kan., is presently fighting one of the largest tuberculosis outbreaks in U.S. history.\n\nA billionaire (Elon Musk) tells a billionaire (Donald Trump) to stop all foreign aid, and diseases that affect the poorest of us now will go unchecked.\n\nGet your masks out, folks.\n\nBill Nicholson\n\nBetter character needed\nfor public megaphone\n\nJust think if you had the ability to influence the stock market with the loudest megaphone in the world.\n\nYou could threaten companies and institutions with erratic behavior, policies and claims causing the markets to crash. Then at some point when the dip in prices has met some acceptable level you just reverse your threat and the market rebounds spectacularly making you and a favored few, who were invested, billions.\n\nWhoever has that megaphone needs to be a person of impeccable character, honesty and transparency, don’t you think?\n\nChaotic Week 2\nhighlights incompetence\n\nPresident Trump’s incompetence was on full display this past week. His ill-conceived, nonsensical federal funding freeze, which endangered the health and welfare of millions of Americans, had to be rescinded days after its inception. Those who voted for a chaos president got their wish.\n\nTrump also blamed the tragic and fatal American Airlines jet collision with a military helicopter on DEI hiring practices. \n\nOh, yeah — only Week Two.\n\nWalnut Creek","summary":"Also: Overpraising rich &#124; Bad old days &#124; Public megaphone &#124; Week 2 chaos. East Bay Times reader letters to the editor for Feb. 5, 2025.","url":"https://www.mercurynews.com/2025/02/04/letters-letters-supporting-trump-doesnt-make-us-bad-or-stupid/","image":"https://www.mercurynews.com/wp-content/uploads/2024/11/BIZ-PFP-BANKRATE-TRUMP-TAX-MI-1.jpg?w=1024&h=658","video":null,"publish_date":"2025-02-05 00:30:07","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":0.017},{"id":287149284,"title":"Deloitte To African Governments: Implement Robust Accountability Structures","text":"The Deloitte Africa Lead for Infrastructure, Capital Projects and Economic Advisory, Mr. Appiah Lartey, has called for robust accountability structures in the public sector as well as a review of national debt sustainability frameworks to address the debt distress cycle that African countries go through.\n\nHe also said he would want to see the introduction of more efficiency in government administration including expenditure rationalisation, improved revenue mobilisation and a private sector participation in energy distribution.\n\nMr. Lartey, who stated while speaking during a panel session at the 2025 Crystal Ball Africa Forum in Accra, attributed the major causes of fiscal challenges and debt overhang to recurrence of large fiscal deficits, debt mismanagement and high debt service costs, government inefficiency as well as global socio-economic developments.\n\nHe therefore urged African governments to not only live within their means, but to also discover innovative means to accelerate development, particularly infrastructure.\n\nOn how a trade war between China and USA could impact Africa governments’ economic policies following the inauguration of Donald Trump as US President, Mr. Lartey proposed trade policy adjustments as well as financial market and investment policies to limit its impact on the continent’s economies.\n\nHe called on countries to intensify their efforts to diversify trade partners and strengthen economic ties with other regions to reduce dependency.\n\nHe also urged African governments to consider imposing stricter controls on foreign investments to manage the potential capital flight caused by market instability.\n\nMr. Lartey also advocated for strong regional and economic community collaboration among African governments as well as a strong currency policy, inflation control and debt sustainability measures to stabilize African economies in 2025 and beyond.\n\nOn how African countries can ensure that they have strong currency regimes, he advocated for import substitution, tariffs on imports and deliberate policy support for local businesses.\n\nFor debt sustainability, he urged African governments that have defaulted on their loans to renegotiate with their creditors, widen the tax net and adopt innovative financing solutions such as more Public Private Partnerships and green financing solutions.\n\nHe also urged businesses to adopt prudent financial management principles and optimise the cost going forward, employ technology to enhance business efficiency, among others.\n\nThe panel session members comprised, Professor Godfred Bokpin of the University of Ghana Business School; Ben Boakye, Executive Director of the African Center for Energy Policy and Dr. Olufunso Somorin, Regional Principal Officer, African Development Bank.\n\nThe Crystal Ball Africa is an annual Pan-African business forum held in January of each year, that provides deep insights on trends and issues that impact businesses in Africa.\n\nIt provides a platform for collaboration, networking and sharing insights on navigating the complexities of the African business landscape.","summary":"ShareThe Deloitte Africa Lead for Infrastructure, Capital Projects and Economic Advisory, Mr. Appiah Lartey, has called for robust accountability structures in the public sector as well as a review of national debt sustainability frameworks to address the debt distress cycle that African countries go through. He also said he would want to see the introduction...\n\n\nThe post Deloitte To African Governments: Implement Robust Accountability Structures appeared first on New Telegraph.","url":"https://newtelegraphng.com/deloitte-to-african-governments-implement-robust-accountability-structures/","image":"https://i0.wp.com/newtelegraphng.com/wp-content/uploads/2025/02/images-18-2.jpeg?fit=636%2C424&ssl=1","video":null,"publish_date":"2025-02-05 00:30:03","author":"New Telegraph","authors":["New Telegraph"],"language":"en","category":"politics","source_country":"ng","sentiment":0.022},{"id":287148156,"title":"Trump Says US Will ‘Take Over the Gaza Strip’ in Press Conference With Netanyahu | Video","text":"President Donald Trump told reporters the United States will “take over the Gaza Strip” as a solution to the ongoing crisis in the region. Trump made the statement while hosting a press conference with Israeli Prime Minister Netanyahu.\n\nTrump: \"The US will take over the Gaza Strip.\"[image or embed] \n — Aaron Rupar (@atrupar.com) February 4, 2025 at 6:00 PM\n\n“The U.S. will take over the Gaza Strip, and we will do a job with it too,” he said in part. “We’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site and get rid of the destroyed buildings, level it out, create an economic development that will supply unlimited numbers of jobs and housing for the people of the area.”\n\nMore to come …","summary":"\"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site,\" the President adds\n\n\nThe post Trump Says US Will &#8216;Take Over the Gaza Strip&#8217; in Press Conference With Netanyahu | Video appeared first on TheWrap.","url":"https://www.thewrap.com/trump-us-will-take-over-gaza-strip/","image":"https://www.thewrap.com/wp-content/uploads/2025/02/trump-us-gaza-strip.jpg","video":null,"publish_date":"2025-02-05 00:29:51","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.143},{"id":287146698,"title":"'F Yes' Trends After Elon Musk Asks if DOGE Should Audit IRS","text":"Elon Musk stirred controversy once again with a viral poll on X, asking users if his Department of Government Efficiency (DOGE) should audit the Internal Revenue Service (IRS). The results were overwhelmingly in favor, with more than 90 percent of respondents supporting the move—including 40 percent who chose the option \"F Yes.\" The poll quickly trended online, with many users debating the implications of Musk's growing role in government oversight.At the time of publishing, the poll had gotten nearly one million responses.Why It MattersThe latest development is part of Musk's broader push to overhaul government agencies through DOGE, an entity he has been leading since being appointed a \"special government employee\" by President Donald Trump. According to its website, DOGE has been created to \"decentralize the narrative around government spending, giving power back to the people to hold government entities accountable for their financial decisions.\"DOGE has already gained control over key financial operations, including the Treasury Department's payment system, which distributes Social Security and Medicare benefits. According to DOGE, the organization has saved the federal government $1 billion a day by freezing hiring, eliminating diversity initiatives, and halting payments to foreign organizations.The move to audit the IRS aligns with previous efforts by Musk to challenge federal tax collection practices, including his past criticisms of government spending and the Direct File program, a free tax filing initiative. DOGE's potential scrutiny of the IRS could add to existing concerns about the agency's funding and its role in tax enforcement.What to KnowOf the nearly one million respondents to Musk's poll, 52 percent responded \"yes,\" 41 percent responded \"F yes,\" and nearly 7 percent responded \"no.\" Musk currently has nearly 216 million followers on X. Later in the day, \"F Yes\" was trending on X, with about 54,000 posts including the phrase within four hours.Musk's poll was posted just a day after he claimed to have \"deleted\" the government team responsible for Direct File, a program designed to allow millions of Americans to file taxes directly with the IRS without using paid services. The claim created confusion, with some taxpayers questioning whether the program was still operational. The IRS later confirmed that Direct File remains functional, despite Musk's statements.Meanwhile, DOGE's growing influence within the Treasury Department has raised alarm among policymakers. Treasury officials have expressed concerns about Musk's aggressive cost-cutting measures, with some warning of potential disruptions to essential government services. Critics argue that Musk's moves lack congressional oversight, potentially creating a constitutional crisis.What People Are SayingThe reaction to Musk's poll has been mixed. Supporters argue that auditing the IRS is necessary to increase transparency and eliminate inefficiencies.On January 31, Musk posted on X that, \"The @DOGE team discovered, among other things, that payment approval officers at Treasury were instructed always to approve payments, even to known fraudulent or terrorist groups.\"Representative Nancy Mace of South Carolina also took to X. \"The IRS is corrupt. Plain and simple.\"One X user named Christopher Randolph responded to the poll and posted, \"F Yes audit the IRS. Once the audit is completed and made public, Trump will have a solid case to abolish it and transition to the [External Revenue Service].\"Another X user named Sassafrass84 posted, \"Can you delete the IRS before April 15th? Asking for all Americans.\"What's NextWhile the X poll itself holds no legislative power, the overwhelming response may further embolden Musk to expand DOGE's oversight of government agencies. Lawmakers are now discussing whether Musk's role in the Trump administration should be subject to stricter checks, with some calling for hearings on the scope of his authority. Meanwhile, the IRS has yet to respond to Musk's proposal, and it remains unclear whether DOGE will take any formal steps to pursue an audit.","summary":"Elon Musk recently asked X users if they wanted DOGE to audit the IRS. Here's how they responded.","url":"https://www.newsweek.com/elon-musk-x-poll-irs-overhaul-doge-reaction-2026263","image":"https://d.newsweek.com/en/full/2581410/irs-building-elon-musk.jpg","video":null,"publish_date":"2025-02-05 00:26:42","author":"Jenna Dejong","authors":["Jenna Dejong"],"language":"en","source_country":"us","sentiment":0.132},{"id":287151256,"title":"THE TIK TOK CRISIS","text":"SONNY ARAGBA-AKPORE argues that the crisis may linger awhileWhile the American ban of Tik Tok is on hold for 75 days beginning from January 20,2025,the European Commission is currently scrutinizing Tik Tok’s practices regarding data protection,advertising transparency and potential addictive design features,particularly concerning young users.\n\n African countries have high usage in some countries with Kenya being at the forefront.But some have frowned at its usage.\n\n The restrictions in Europe on the app, are particularly on government employee devices due to security concerns, while in Africa, some nations have completely banned TikTok due to worries about inappropriate content and potential political misuse, with Kenya being a notable exception where usage is high. Some African governments have banned TikTok due to concerns about the spread of inappropriate content, political rhetoric, and others. Despite concerns, many African creators use TikTok to showcase their culture and creativity.\n\nThe ban in the USA could affect American companies like Apple, Google, and Oracle. The ban could chill certain types of investment and create a slippery slope that applies to other companies. A TikTok ban in the United States could have several implications, including: App store removal where TikTok would be removed from app stores like Apple and Google. Updates would no longer be available as users are unable to update the app, which could lead to performance issues and compatibility problems.\n\n The app could eventually become unusable without updates. Data security stands risks of inability to associate with a TikTok ban. There will be geopolitical consequences as the ban could raise concerns about the government targeting individual companies.\n\n The ban could send a message that the U.S. government is afraid of the Chinese government influencing Americans.It could make online experiences more insular and inconsistent from country to country.\n\n As the future of the social media platform remains murky, plans for an American entity to purchase TikTok appear to be narrowing in scope. While several individuals and companies have thrown their hats into the ring with interest, President Donald Trump recently expressed his support of two tech giants: Elon Musk, CEO of Tesla and SpaceX, and Larry Ellison, co-founder of Oracle. Oracle, a software company, houses most of TikTok’s U.S. servers. Plans are already on to meet the 75-day window to stabilize Tik Tok.\n\n General Atlantic CEO Bill Ford said last week that a deal would get done to save TikTok in the U.S. after President Donald Trump signed an executive order that halted a ban on the app for 75 days. “It’s in everybody’s interest,” Ford told journalists at an event in Davos, Switzerland. Ford is on the board of directors for ByteDance, Tiktok’s Chinese parent company. “We’ll get on with it, as soon as maybe the end of the week in terms of negotiating what might work … The Chinese government, the U.S. government and the company and the board all have to be involved in this conversation,” Ford added.\n\nTrump’s executive order paused the enforcement of a bipartisan law passed by Congress last year that required ByteDance to sell TikTok’s U.S. assets by Sunday for the app to continue functioning in the country. It was passed amid national security concerns that the Chinese government could get access to Americans’ personal information through the app.\n\n Tik Tok was taken down for 24 hours after the Supreme Court ruling for its ban before President Trump,s Executive Order for a 75-day stay of enforcement. But the service interruption TikTok instituted hours earlier caught most users by surprise. Experts had said the law as written did not require TikTok to take down its platform, only for app stores to remove it.\n\n Current users were expected to continue to have access to videos until the app stopped working due to a lack of updates.\n\n The company’s app also was removed from prominent app stores, including the ones operated by Apple and Google. Apple told customers with its devices that it also took down other apps developed by TikTok’s China-based parent company, ByteDance including one that some social media influencers had promoted as an alternative.\n\n Under the federal legislation, which remains in place despite Trump’s order, companies could be fined $5,000 per users they help access TikTok. For Google and Apple, this could mean a $5,000 fine for each user who downloads or updates TikTok. For internet hosting services like Oracle, it could mean a $5,000 fine for each user that accesses TikTok using their services.\n\n To break that down, if reportedly 170 million Americans use TikTok and companies could be charged $5,000 per user, that amounts to about $850 billion in fines, spread across different types of tech companies.\n\n Even for tech giants like Google, Apple and Oracle, these are “hefty fines” they could be facing, according to agency reports.Apple and Google will be mostly hit by the ban .App Store specifically listed Tik Tok apps including TikTok,TikTok Studio, TikTok ,Shop Seller Center,CapCut,Lemon8, Hypic,Lark – Team Collaboration Lark – Rooms Display Lark Rooms Controller will be affected.\n\n Apple said if a user already has the apps on their device, they will remain there but can’t be redownloaded and won’t provide updates. The apps also won’t allow in-app purchases or new subscriptions during the ban.\n\n Instagram Reels, YouTube Shorts, and Triller are similar to TikTok in functionality but with some minor differences. Reels allows videos up to 90 seconds, Shorts up to 60 seconds, and Triller supports longer videos (up to three minutes) with advanced editing tools, ideal for music videos. For more editing flexibility, use Movavi Video Editor to customize your clips before posting.\n\n For adult content creators seeking creative freedom, Triller offers advanced editing tools and music-powered features that turn basic videos into pro-level content, while Likee provides a wide range of effects to make your videos more engaging. When you need even greater flexibility and control, try Movavi Video Editor to fine-tune clips, adjust audio, add special effects, and create smooth transitions.\n\nPrior to the Supreme Court ruling in more than two-hour appearance before a panel of three judges at a federal appeals court in Washington, attorneys for the two sides – and content creators – were pressed on their best arguments for and against the law that forces TikTok and its China-based parent company ByteDance to break ties by mid-January 2025 or lose one of their biggest markets in the world.\n\nAndrew Pincus, a veteran attorney representing the two companies, argued in court that the law unfairly targets the company and runs foul of the First Amendment because TikTok Inc. – the U.S. arm of TikTok – is an American entity. After his remarks, another attorney representing content creators who are also challenging the law argued it violates the rights of U.S. speakers and is akin to prohibiting Americans from publishing on foreign-owned media outlets, such as Politico, Al Jazeera or Spotify.\n\nAragba-Akpore is member of THISDAY Editorial Board","summary":" SONNY ARAGBA-AKPORE argues that the crisis may linger awhile While the American ban of Tik Tok is on hold for 75 days beginning from January 20,2025,the European Commission is currently scrutinizing","url":"https://www.thisdaylive.com/index.php/2025/02/05/the-tik-tok-crisis/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/images-5.jpeg","video":null,"publish_date":"2025-02-05 00:24:58","author":"Adeyinka Salami","authors":["Adeyinka Salami"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.048},{"id":287149482,"title":"White House Says Trump–Xi Call Not Yet Scheduled","text":"A call between President Donald Trump and Chinese leader Xi Jinping is yet to be scheduled, the White House told reporters on Tuesday as U.S. tariffs on Chinese goods took effect.\n\nWhite House press secretary Karoline Leavitt made the remark after Trump’s top trade adviser, Peter Navarro, said the leaders were set to speak on Tuesday.\n\nIn an interview with Fox Business Network earlier in the day, Leavitt said, “President Xi did reach out to President Trump to speak about this, maybe to begin a negotiation. So we'll see how that call goes.”\n\nTrump, on Feb. 1, announced additional tariffs on goods from Canada, Mexico, and China, saying he’s holding the countries accountable for their failure to halt the flow of illegal immigration and poisonous drugs such as fentanyl into the United States. All new tariffs were set to take effect on Tuesday.\n\nNavarro declined to comment on whether Trump may also delay tariffs on Chinese goods, saying, “It’s up to the boss. I never get ahead of the boss.”\n\nAlso asked about the Chinese regime’s retaliation on Tuesday at the White House, Trump said, “That’s fine.”\n\nThe president said he’s in no hurry to speak to Xi.\n\nUnder the de minimis rule, packages valued under $800 can be imported duty-free and with minimal border inspection.\n\nThe rule, which is meant to minimize bureaucracy and reduce costs for customers, small businesses, and the government, has been exploited by Chinese e-commerce giants such as Shein and Temu and used to post small packs of fentanyl or precursors.\n\nIn an apparent rebuttal of Beijing’s repeated denial of responsibility in helping fuel America’s fentanyl crisis, Trump said the communist regime’s “most sophisticated domestic surveillance network” and “most comprehensive domestic law enforcement apparatus” and its routine harassment of political dissidents outside of China, show it “does not lack the capacity to severely blunt the global illicit opioid epidemic; it simply is unwilling to do so.”\n\nSince January 2023, the U.S. Justice Department has indicted a number of Chinese chemical companies and executives over fentanyl.\n\nThe spokesperson said Beijing has supported the U.S. response to the fentanyl crisis, and that the problem belongs to the United States.\n\nOn Tuesday, China’s Ministry of Finance announced additional tariffs on some U.S. imports, including 15 percent on coal and liquefied natural gas and 10 percent on crude oil, farm machinery, a small number of trucks, and big-engine sedans.\n\nChina’s Ministry of Commerce added some tungsten, tellurium, bismuth, molybdenum, and indium products to its export control list and expanded its list of “unreliable entities” to include U.S. biotechnology company Illumina and clothing company PVH Corp, the holding company for brands including Calvin Klein.\n\nOn the same day, the State Administration for Market Regulation published a one-sentence statement announcing it had launched an anti-trust investigation into Google.","summary":"The president said he's in no hurry to speak to Chinese leader Xi Jinping as new U.S. tariffs on Chinese goods took effect on Tuesday","url":"https://www.theepochtimes.com/china/white-house-says-trump-xi-call-not-yet-scheduled-5802959","image":"https://img.theepochtimes.com/assets/uploads/2025/01/01/id5802501-Karoline-Leavitt-Karoline-Leavitt_3KOKO-300x180.jpg","video":null,"publish_date":"2025-02-05 00:24:02","author":"Lily Zhou","authors":["Lily Zhou"],"language":"en","category":"politics","source_country":"us","sentiment":0.165},{"id":287149104,"title":"US Senate’s committee supports Tulsi Gabbard as Director of National Intelligence","text":"WASHINGTON, February 5. /TASS/. The US Senate’s special committee on intelligence has recommended to approve President Donald Trump’s nominee for Director of National Intelligence Tulsi Gabbard, leading US media reported.\n\nAccording to reports by The Washington Post, Politico, CNN and others, Gabbard received enough support among members of the committee. This paves the way to a vote on her candidacy in the Senate. If approved by the Senate, Gabbard will take the oath of office.\n\nTrump nominated Gabbard to the post on November 13, 2024.\n\nGabbard is known for her criticism of the previous US administration’s foreign policies with regard to Russia and Ukraine. She accused the administration of Joe Biden of trying to protract the Ukrainian conflict in an attempt to weaken Russia, and called for negotiations between the sides. In 2022 she said that all attempts to settle the Ukrainian crisis need to include Kiev’s territorial losses and its neutral status. She also emphasized the need for the US to participate in the peace process and criticized military aid to the Kiev government, which, in her opinion, only protracts the conflict.","summary":"Trump nominated Gabbard to the post on November 13, 2024","url":"https://tass.com/world/1908751","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-02-05 00:23:12","author":"Tass","authors":["Tass"],"language":"en","source_country":"RU","sentiment":0.002},{"id":287151894,"title":"Trump announces US will 'take over' Gaza Strip and level it","text":"President Donald Trump said that the US \"will take over\" the Gaza Strip, after saying earlier that he doesn't think there is a permanent future for Palestinians in Gaza.\n\n\"The US will take over the Gaza Strip and we will do a job with it too,\" Trump said during a joint press conference alongside his Israeli counterpart Benjamin Netanyahu.\n\n\"We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site and get rid of the destroyed buildings.\"\n\nREAD MORE: FBI agents sue over Trump investigation probes﻿\n\nSpeaking earlier Tuesday, Trump suggested Gazans move to a new location provided by one or more nations in the Middle East.\n\n\"I mean they're there because they have no alternative. What do they have? It is a big pile of rubble right now,\" Trump said moments before hosting Netanyahu for Oval Office talks.\n\nTrump's suggestion that Gazans leave the strip permanently amounts to a provocative stance that will endear him to Israel's most conservative politicians but is generally a non-starter for Israel's neighbors, who have said they are unwilling to accept new Palestinian refugees from the enclave.\n\nOn Tuesday, Trump framed the matter as a humanitarian one, saying it was impossible to believe anyone would want to remain in the war-torn territory.\n\n\"Why would they want to return? The place has been hell,\" Trump said, ignoring a reporter who cried out: \"Because it's their home.\"\n\nInstead of Gaza, he suggested the Palestinians be provided a \"good, fresh, beautiful piece of land\" to live.\n\nBut under repeated questioning, Trump made clear he did not see a world in which Palestinians ever return to Gaza.\n\n\"I don't think people should be going back to Gaza. I think Gaza has been very unlucky for them.\" He said, \"Gaza is not a place for people to be living.\"\n\nTrump seemed to slip into his real estate developer mode when he said he envisions people living in a redeveloped Gaza that he said could look like \"the Riviera of the Middle East.\"\n\n\"This could be something that could be so valuable, this could be so magnificent,\" Trump said.\n\nHe said \"most importantly,\" the people that live there would be able to live in peace and added, \"We'll make sure that it's done world class.\"\n\nHe said he envisioned \"Palestinians, mostly\" living there but also described his vision for Gaza as \"an international, unbelievable place\" where \"the world's people\" live.\n\nNetanyahu, sitting alongside Trump in the Oval Office, smiled as Trump was speaking. The Israeli leader, under conflicting pressures domestically, was in Washington to ascertain exactly where Trump stands on the next phase of a ceasefire in Gaza.\n\nBut Trump's dim views of Gaza as a permanent home for Palestinians was certain to provide grist for far-right allies of the Israeli leader, who have called on Netanyahu to abandon the temporary truce that was struck last month.\n\nNetanyahu's visit was expected to last several hours and include a joint press conference, all meant to demonstrate Trump's solidarity with Israel.\n\nThe comity between the men could belie a relationship that's more complicated than it sometimes appears – with nothing less than the future of the Middle East potentially riding on Trump's words.\n\nTrump has claimed credit for the hostages-for-ceasefire agreement struck in the days before he entered office – and even officials in the outgoing Biden administration acknowledged Trump's imminent arrival helped apply pressure on Israel and Hamas.\n\nNetanyahu, perhaps seeking to ingratiate himself to his host, praised Trump's efforts.\n\nREAD MORE: Students gunned down in 'worst mass shooting' in Sweden's history\n\n\"I think President Trump added great force and powerful leadership to this effort,\" Netanyahu said in the Oval Office.\n\nBut for all of his prodding to get the deal inked, Trump will still need to oversee the remaining two phases of the three-phase plan. He didn't sound particularly confident a day before meeting Netanyahu.\n\n\"I have no assurances that it'll hold,\" he said in the Oval Office, where he'd summoned reporters to watch him sign some papers. \"And I've seen people brutalised. I've never - nobody's ever seen anything like it.\"\n\nHe sounded slightly more optimistic a day later.\n\n\"We'll see what happens. We're dealing with very complicated people, but a deal can absolutely get done,\" he said alongside Netanyahu on Tuesday.\n\nThere's plenty for Trump and Netanyahu to discuss beyond the immediate matter of the ceasefire agreement. There's the question of Gaza itself, which Trump has previously said should be cleared out for rebuilding, with the Palestinians who live there moved to Egypt and Jordan (a topic of discussion likely to continue when Jordan's King Abdullah visits the White House next week).\n\n\"I would like to see Jordan, I'd like to see Egypt take some,\" Trump said again Tuesday, just before Netanyahu arrived. \"Look, the Gaza thing has not worked. It's never worked.\"\n\nAnd then there is the prospect of a broader normalization of relations between Israel and its Arab neighbors, principally Saudi Arabia, that former President Joe Biden had been pursuing before the October 7, 2023, attacks.\n\nTrump, who openly pines for a Nobel Peace Prize, may see his opportunity in such a pursuit, which could transform the entire Middle East and create a new bulwark against Iran, a common foe to Jerusalem and Riyadh.\n\nWhether Netanyahu is interested in diplomacy – or whether he instead sees Trump's arrival in Washington as a moment to take decisive action against Iran, potentially even taking out its nuclear program – remains to be seen.\n\nThere is already speculation Netanyahu could use the talks to take Trump's temperature on a direct strike, seizing a moment when Iranian proxies have been decimated, Iran's nuclear ambitions appear to be accelerating and while he has friendlier ties to Washington.\n\nFor his part, Trump has not sounded particularly enthusiastic about starting a new conflict with Iran.\n\n\"Hopefully that can be worked out without having to worry about it. It would really be nice if that could be worked out without having to go that further step,\" he said last month when asked about a strike on Iranian facilities.\n\nA complicated relationship\n\nBy the end of Biden's term, relations were so strained between the American and Israeli leaders that they went months without speaking, despite the ongoing war in Gaza and intensive efforts by Biden's aides to broker a cease-fire.\n\nIn the lead-up to last November's election, there was little question among Biden's team that Netanyahu favored a Trump victory, believing he would enjoy a far wider remit from the American government to prosecute his war aims with Trump in office instead of then-Vice President Kamala Harris.\n\nThose predictions have not been wrong.\n\nAlready, Trump has lifted a hold on heavy bomb deliveries to Israel, rolling back one of the few Biden-era policies meant to exert leverage on Israel amid its war in Gaza.\n\nHe could go even further this week. Netanyahu and his delegation plan to press Trump's administration to move forward with billions of dollars in pending arms sales, including thousands of new bombs, missiles, artillery and other weapons, during this week's visit.\n\nWhile some of the items could take a year or more to produce, deliveries of the bombs would begin within the next few months.\n\nIf Trump goes ahead, it would represent a new level of support to Israel from the United States, and a signal of Trump's willingness to indulge Netanyahu's requests at a moment of deep uncertainty in the Middle East.\n\nBut while Trump is popular in Israel, and Netanyahu enthusiastically welcomed his return to the White House, things haven't always been so cheerful.\n\nWhen Netanyahu congratulated Biden on his election victory in 2020, Trump was enraged at what he saw as betrayal. In the months that followed, Trump accused Netanyahu of disloyalty and fumed to the esteemed Israeli reporter Barak Ravid, now a CNN analyst: \"F— him.\"\n\nEven three years later, after Hamas launched the worst terrorist attack in Israel's history on October 7, 2023, it was clear Trump's sore feelings hadn't entirely faded.\n\n\"(Netanyahu) was not prepared. He was not prepared, and Israel was not prepared,\" Trump said in an interview shortly after the attacks, comments that drew condemnation even from Republicans.\n\nNetanyahu undoubtedly hopes the animosity will be forgotten when he visits on Tuesday. It seems almost certain his interactions with Trump will contain none of the open discord that colored his relationship with Biden in the final year of his presidency.\n\nWhat is clear is Netanyahu's desire to gather a wide range of opinions while he is in town. The prime minister is planning to remain in Washington well beyond his Tuesday talks with Trump. He arrived to Blair House, the presidential guest residence, late Sunday and is expected to stay until the end of the week, including for meetings on Capitol Hill.\n\nIn pictures: Celebrations erupt after ceasefire announcedView Gallery\n\nFor all of their vast differences, Trump and Biden do share a philosophy when it comes to engaging with their foreign counterparts: dealing directly is the best way to make progress.\n\nEight years ago, Trump's first foreign guest at the White House was the United Kingdom's then-Prime Minister Theresa May, whose visit may be best remembered for photographs of May and Trump clasping hands as they gingerly descended a ramp along the West Colonnade.\n\nMay's early trip to Washington, designed in part to convince Trump not to withdraw from NATO, did not portend particularly warm ties for the rest of his term. He repeatedly criticised her handling of Brexit, although by the time May resigned from office they seemed to have patched things up.\n\nWith Netanyahu, however, Trump has an altogether more immediate task.\n\n-with Associated Press\n\nREAD MORE: China hits back at Trump with tariffs of its own﻿\n\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.","summary":"President Donald Trump said that the US &quot;will take over&quot; the Gaza Strip, after saying earlier that he doesn&#x27;t think there is a permanent future for Palestinians in Gaza.","url":"https://www.9news.com.au/world/donald-trump-gaza-strip-israel-benjamin-netanyahu-taking-over-level/77f971f8-f475-4147-bb6e-62e480182374","image":"https://imageresizer.static9.net.au/CGwJqoHkee9CoR3chnPTjSwf8MU=/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fff609dd2-4336-49c1-ae61-cf5fbf3af7c2","video":null,"publish_date":"2025-02-05 00:18:54","author":"9News","authors":["9News"],"language":"en","category":"politics","source_country":"au","sentiment":-0.239},{"id":287147230,"title":"U.S. Crypto And Digital Assets Top David Sacks’ First Press Conference","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident Donald Trump listens to White House adviser David Sacks as he signs an executive order ... [+] regarding cryptocurrency in the Oval Office of the White House, Thursday, Jan. 23, 2025, in Washington. (AP Photo/Ben Curtis)\nCopyright 2025 The Associated Press. All rights reserved\n\nU.S. Crypto And Digital Assets Top David Sacks’ First Press Conference\n\nToday, David Sacks, President Trump’s crypto and AI czar, held a press conference alongside Senator Tim Scott, Representative French Hill, Senator John Boozman, and Representative GT Thompson to unveil new plans for U.S. leadership in digital assets. They introduced the GENIUS Act, a bill aimed at regulating stablecoins by establishing clear issuance procedures and designating federal and state regulators based on the issuer's size.\n\nSacks emphasized that keeping innovation onshore is a top priority to ensure the U.S. maintains global leadership in financial technology. To advance this initiative, he announced a joint working group between the House and Senate dedicated to crypto legislation. This effort reflects the administration’s broader goal of creating regulatory clarity and fostering a thriving blockchain ecosystem within the United States.\n\nDespite these announcements, the market responded negatively, with Bitcoin’s price declining. Some investors were frustrated by the lack of exclusive, market-moving news, failing to recognize that comprehensive legislation is necessary for crypto adoption at the national level—especially if the government intends to hold digital assets as part of its Treasury Reserve.\n\nA Unified Approach to Crypto Regulation\n\nOne of the key takeaways from the press conference was the announcement of a bipartisan and bicameral working group that will drive legislation forward. This working group includes:\n\nThe House Financial Services Committee\n\nThe Senate Banking Committee\n\nThe House Agriculture Committee\n\nThe Senate Agriculture Committee\n\nWith this coalition, lawmakers aim to harmonize regulations across different oversight agencies like the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC).\n\nMORE FOR YOU\n\n‘This Is A Big Deal’—Bitcoin And Crypto Now Braced For A Huge U.S. Price Earthquake\n\nTrump Tariffs Live Updates: China Responds With Retaliatory Tariffs, Export Controls And Google Probe\n\nUSAID Controversy Live Updates: Marco Rubio Suggests Some Parts Will ‘Reorganize’—Rest ‘May Be Abolished’\n\nThe challenge? Some digital assets are considered securities, while others fall under the category of commodities, creating a complex and fragmented regulatory landscape.\n\nBy bringing together key stakeholders, this initiative seeks to eliminate uncertainty and provide the crypto industry with clear guidelines on compliance, operations, and legal obligations.\n\nStablecoins and the Future of the U.S. Dollar\n\nA major highlight of the discussion was the role of stablecoins in ensuring U.S. dollar dominance in the global financial system. Stablecoins—digital assets pegged to traditional currencies—offer a way to increase the utility of the U.S. dollar in the digital economy.\n\nSenator Bill Hagerty introduced a new stablecoin bill that is expected to align with past bipartisan efforts, reflecting a growing consensus on the need for well-defined regulations. Officials underscored several benefits of stablecoins, including:\n\nEnhancing the U.S. dollar’s role as the world’s reserve currency in an increasingly digital world.\n\nDriving demand for U.S. treasuries, which could help lower long-term interest rates.\n\nProviding a transparent and regulated alternative to offshore stablecoins, reducing risks for consumers and businesses.\n\nSen. Bill Hagerty (R-TN) (Photo by Kevin Dietsch/Getty Images)\nGetty Images\n\nStablecoins are seen as a critical financial tool for cross-border payments, decentralized finance (DeFi), and global trade. By regulating them effectively, the U.S. can solidify its leadership in the financial sector while maintaining control over digital transactions.\n\nEnding Regulatory Uncertainty for Crypto Entrepreneurs\n\nFor years, crypto startups and innovators have struggled with unclear and inconsistent regulations, often facing prosecution without clear guidance on compliance. The lack of regulatory clarity has led to founders being debanked and startups moving overseas, shifting innovation away from U.S. markets.\n\nThe administration aims to reverse this trend by creating a transparent regulatory environment where crypto businesses can operate with confidence and legal certainty. Officials emphasized that well-defined rules will:\n\nEncourage domestic innovation instead of pushing companies offshore.\n\nSeparate legitimate businesses from bad actors, reducing the risk of major frauds like the FTX collapse in the Bahamas.\n\nProvide better consumer protections, making it easier for regulators to supervise crypto markets.\n\nThe shift to onshore regulation is expected to strengthen market integrity while promoting healthy competition among U.S.-based digital asset firms.\n\nLegislative Priorities: Market Structure & Consumer Protection For Crypto and Stablecoin\n\nAs part of the broader push for regulatory clarity, lawmakers are working on two major legislative efforts:\n\nMarket Structure Legislation – Based on the Fit 21 bill, which previously passed the House with strong bipartisan support. This bill seeks to provide clear definitions for digital assets, assign regulatory oversight, and establish fair compliance requirements.\n\nStablecoin Legislation – Now gaining momentum, with the new bill introduced by Senator Hagerty expected to set a strong foundation for stablecoin regulation.\n\nCongressional leaders emphasized the importance of bipartisan cooperation, highlighting past successes in achieving broad support for crypto regulations. With a new administration committed to financial innovation, there is optimism that both bills will pass swiftly and be signed into law.\n\nA Bitcoin Reserve? Evaluating the Crypto Possibilities\n\nOne of the most intriguing developments from the press conference was the mention of a U.S. Bitcoin Reserve. President Trump had previously floated the idea of holding Bitcoin as part of national reserves, and officials confirmed that the administration is actively evaluating the feasibility of such a move.\n\nWhile details remain sparse, a Bitcoin Reserve could serve multiple purposes, including:\n\nDiversifying U.S. reserves in a digital-first global economy.\n\nStrengthening the country’s position in crypto markets by legitimizing Bitcoin as a financial asset.\n\nAttracting investment in blockchain infrastructure, driving technological advancements.\n\nAdditionally, discussions around a sovereign wealth fund involving digital assets are ongoing, though officials indicated that such plans would require further evaluation.\n\nWhat Could Have Been Better?\n\nWhile the press conference outlined ambitious plans, many in the crypto community were disappointed by the lack of immediate, groundbreaking announcements. The market reaction reflected this frustration, with Bitcoin prices declining as investors expected more clarity on key issues such as:\n\nWhich digital assets will be included in the U.S. Treasury Reserve?\n\nWhat is the timeline for full regulatory implementation?\n\nIs there a possibility of removing taxes on American digital assets?\n\nThe GENIUS Act provided an initial framework, but there was little clarity on when regulations will take effect, or whether tax incentives for crypto holders will be considered. Many Bitcoin investors expected an official confirmation of government Bitcoin purchases, which did not happen. The possibility of removing taxes on American digital assets has been a topic of discussion, but there has been no official confirmation or concrete proposal from the administration or Congress at this time.\n\nThis frustration, while understandable, overlooks the bigger picture: for the U.S. government to effectively integrate crypto into its financial infrastructure, it must first establish a legal framework. Without clear regulations, the government cannot hold, issue, or transact in crypto assets at scale.\n\nLooking Ahead: A Defining Moment for U.S. Crypto Policy\n\nThe United States stands at a critical crossroads in its approach to crypto and digital assets. The next 100 days will be crucial, as lawmakers and regulators work to finalize legislation, educate new members of Congress, and implement a cohesive strategy for the future of crypto in the U.S.\n\nThe overarching goal is clear: keep innovation onshore, establish fair and transparent regulations, and protect consumers while fostering financial growth.\n\nDespite market skepticism, this press conference signals a major step toward a regulated and government-backed digital asset economy. As the regulatory framework takes shape, all eyes will be on Congress, industry leaders, and the administration to ensure that America remains the global leader in digital assets—not just for today, but for the future of finance and crypto.\n\nDid you enjoy this story? Don’t miss my next one: Use the blue follow button at the top of the article near my byline to follow more of my work.\n\nFollow me on Twitter or LinkedIn. \n\nSandy Carter\n\nEditorial Standards\n\nForbes Accolades","summary":"Sacks first Press Conference focused on crypto, US Innovation, and Stablecoins.  This AI and Crypto czar started the conversation that has been anticipated for some time.","url":"https://www.forbes.com/sites/digital-assets/2025/02/04/us-crypto-and-digital-assets-top-david-sacks-first-press-conference/","image":"https://imageio.forbes.com/specials-images/imageserve/67a2aaebecfa548b45f33295/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-05 00:18:08","author":"Contributor,Sandy Carter","authors":["Contributor","Sandy Carter"],"language":"en","source_country":"US","sentiment":-0.037},{"id":287147236,"title":"Trump Says U.S. Will ‘Take Over’ Gaza Strip: ‘We’ll Own It’","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident Donald Trump said Tuesday the U.S. will “take over” the Gaza Strip, making the statement after saying Palestinians should be resettled away from the war-torn region.\n\nTrump made the statement during a press conference with Netanyahu at the White House. (Photo by Anna ... [+] Moneymaker/Getty Images)\nGetty Images\n\nTrump said “we’ll own it” when discussing the future of Gaza, and suggested the U.S. could “create an economic development that will supply unlimited numbers of jobs and housing” for Palestinians in Gaza.\n\nThis is a developing story. Check back for updates.\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nAntonio Pequeño IV\n\nEditorial Standards\n\nForbes Accolades","summary":"Trump said Palestinians should be relocated and should not rebuild in the war-torn region.","url":"https://www.forbes.com/sites/antoniopequenoiv/2025/02/04/trump-says-us-will-take-over-gaza-strip-well-own-it/","image":"https://imageio.forbes.com/specials-images/imageserve/67a2ace6cc56d895f9ae2f55/0x0.jpg?format=jpg&crop=3617,2409,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-05 00:15:35","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.168},{"id":287146814,"title":"Trump Says US \"Will Take Over Gaza Strip\" After Talks With Netanyahu","text":"President Donald Trump said Tuesday the United States will take control of war-torn Gaza, as he addressed reporters at the White House after talks with Israeli Prime Minister Benjamin Netanyahu over the country's conflict with Hamas.\"The US will take over the Gaza Strip and we will do a job with it, too. We'll own it. And be responsible for dismantling all of the dangerous unexploded bombs and other weapons on this site,\" Trump said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Israeli Prime Minister Benjamin Netanyahu met Donald Trump at the White House Tuesday for crucial talks on the truce with Hamas, as the US president suggested permanently resettling Palestinians from war-battered Gaza.","url":"https://www.ndtv.com/world-news/donald-trump-says-us-will-take-over-gaza-strip-after-talks-with-benjamin-netanyahu-7636527","image":"https://c.ndtvimg.com/2025-02/r7dnrjb8_trump-netanyahu-press-conference_625x300_05_February_25.jpeg","video":null,"publish_date":"2025-02-05 00:14:39","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.338},{"id":287145150,"title":"DC Plane Crash: NTSB Provides Update on Black Hawk Data","text":"The National Transportation Safety Board (NTSB) issued an update on the investigation into the fatal midair collision near D.C.'s Ronald Reagan National Airport last week.The update included insight into the Black Hawk helicopter's height and cockpit voice recorder transcription.Why It MattersThe collision over the Potomac River was the first fatal commercial crash in the U.S. since 2009, when a propeller plane crashed near Buffalo, New York, killing nearly 50 people.Recent airplane incidents and close calls nationwide have raised concerns about safety protocols, and in a news conference after the crash last week, President Donald Trump questioned if Diversity, Equity and Inclusion (DEI) may be partly to blame for the crash near Reagan National.Trump also questioned air traffic controllers and the helicopter's path during the press briefing.What To KnowThe crash involved a Sikorsky H-60 military helicopter and an American Airlines (AA) passenger jet. The jet was carrying 64 people on board and the Black Hawk was carrying three soldiers. All 67 people died and the remains of 65 victims have been identified, Fox 5 said, citing the D.C.'s chief medical examiner.In an update on Tuesday, the NTSB said that recovery of the wrecked jet continues as pieces continue to be removed from the river.\"NTSB has also been provided updated information that shows the air traffic control tower display at DCA is fed by the Potomac TRACON,\" the NTSB said in the update. \"The TRACON fuses information from multiple radar sensors and ADS-B data, providing the best quality flight track data to air traffic control. This data showed the Black Hawk was at 300 feet on the air traffic control display at the time of the collision. This data is rounded to the nearest 100 feet.\"To gather additional information \"to verify data points from the Black Hawk,\" the helicopter will need to be removed from the river, the NTSB says. That will take place later in the week.Maintenance paperwork and records for both the helicopter and the jet are getting reviewed by officials, the NTSB says. Also, the cockpit voice recorder transcriptions for both aircraft are ongoing, the NTSB says.In an email to Newsweek when asked when the transcriptions will be complete and if they will be shared with the public, the NTSB said, \"We don't have information to share on that at this time.\"The New York Times previously reported last week that on the night of the collision, the Black Hawk was flying too high and at least a half mile off the preapproved path, citing people briefed on the matter.What People Are SayingVirginia Governor Glenn Youngkin, a Republican, on X (formerly Twitter) on Saturday: \"This morning, we grieved as a community. 67 souls lost—each with families, friends, and dreams. We hold them in our hearts, across states and borders, and come together to support one another. In this time of deep sorrow, let's wrap these families in compassion, prayer, and hope.\"U.S. Army on X on Saturday, linking to a news release of the third soldier's ID: \"Our deepest condolences go out to all the families who are mourning the loss of their loved ones impacted by this devastating accident. We continue to work with the families of our fallen Soldiers and support the ongoing investigations.\"The NTSB said on X ahead of their update: \"NTSB is not planning any additional on scene media briefings on the Jan. 29 midair collision near DCA. NTSB needs additional information to verify data points from the Black Hawk. In order to obtain this information, the Black Hawk needs to be recovered from the water, which is expected to take place later this week. Any future media briefings will take place at NTSB headquarters. A written investigative update will be provided later today on http://NTSB.gov.\"What Happens NextAs the plane wreckage gets removed from the river, the parts will be moved \"to a secure location for a wreckage layout examination,\" the NTSB says.","summary":"In an update on Tuesday, officials say that transcriptions for both aircrafts cockpit voice recordings are ongoing.","url":"https://www.newsweek.com/dc-plane-crash-ntsb-provides-update-black-hawk-data-2026272","image":"https://d.newsweek.com/en/full/2581366/dca-plane-crash.jpg","video":null,"publish_date":"2025-02-05 00:10:26","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"sports","source_country":"US","sentiment":-0.325},{"id":287151532,"title":"Trump just showed us why he’s not winning the Nobel Peace prize anytime soon","text":"As Israeli Prime Minister Benjamin Netanyahu visited President Donald Trump at the White House on Tuesday and King Abdullah II of Jordan does the same on Feb. 11, one question keeps bubbling up to the surface: Can Donald Trump, the self-professed “peacemaker” who has eyed the coveted Nobel Peace Prize for many years, go where no U.S. president has gone before by striking a transformational, comprehensive peace deal in the Middle East? Trump’s critics would answer with a big eye roll. And yet his pressuring of Netanyahu to sign onto the first stage of a three-phase ceasefire deal with Hamas — three more hostages were freed over the weekend in return for more than 100 Palestinian prisoners, the fourth round of prisoner exchanges since the deal took effect in mid-January — at least gives some credibility behind the ambition. Trump clearly has Middle East peace on his mind, and the Trump administration’s desire to expand the 2020 Abraham Accords, which normalized relations between Israel and four Arab countries, is never far from its lips. As national security adviser Mike Waltz said before Trump even stepped foot into office for his second term, Israeli-Saudi normalization is a “huge priority” for the team. But Trump can kiss all of this goodbye if he intends to move forward with his ongoing calls to expel the Palestinian population from Gaza, an idea he referenced during his joint press conference with Netanyahu at the White House. While he didn’t specifically use the word “expel” in his remarks, his suggestion that Palestinians might want to think about packing up their things and going to another area while reconstruction commences has caused shock and trepidation across the Arab world. Trump even suggested that his plan was in the works, with various countries contacting him and pledging assistance. Whether or not that’s the case, Trump appears increasingly invested in making this relocation scheme a reality. “Gaza is a demolition site right now,” Trump told reporters on Tuesday. “You can’t live in Gaza right now.” If this were just another one-off, rambling comment from Trump, perhaps it could be dismissed as a nothing-burger. But it isn’t. Trump has referenced this idea on earlier occasions, first on Jan, 28, when he name-dropped Egyptian President Abdel Fattah el-Sisi and Jordanian King Abdullah for help in taking Gaza’s population in, and again on Jan. 31, when he was signing executive orders in the Oval Office. Asked by a reporter about Egypt and Jordan’s refusal to play along, Trump matter-of-factly stated that they didn’t have a choice: “They will do it. They will do it. They’re gonna do it, OK? We do a lot for them, and they’re gonna do it.” Trump’s pretensions aside, Egypt and Jordan have their own reasons for not wanting to turn themselves into Trump’s enforcers. The most obvious, of course, is that such a proposition is extraordinarily unpopular in the Arab world. Countries throughout the Middle East disagree on a lot of things, but dislocating more than 2 million Palestinians from their homes in Gaza and opening the door to Israeli annexation of the coastal enclave — a fantasy ultranationalist Israeli ministers like Bezalel Smotrich surely dream about — certainly isn’t one of them. If there was any dispute about that, the Arab League put it to rest over the weekend, when it released a statement that such plans “threaten the region’s stability, risk expanding the conflict, and undermine prospects for peace and coexistence among its peoples.” Egypt and Jordan also have self-interested reasons for dismissing any Gazan relocation effort. Jordan, for one, is already hosting more than 2 million Palestinians who are registered as refugees, making approximately half of the kingdom’s population of Palestinian origin. As a resource-poor country, Jordan doesn’t have the luxury of sustaining a new influx of new refugees and wouldn’t want to, even if Washington or its Gulf allies picked up the tab (the U.S. already provides Jordan with $1.45 billion in foreign aid every year). For Egyptian President Sisi, the issue is less about economics and more about security. This is the same guy, after all, who led a 2013 military coup against a democratically elected Muslim Brotherhood-led government (Hamas was established in 1987 as an affiliate of the Muslim Brotherhood), killed more than 800 people in the process and jailed tens of thousands more in an attempt to snuff out any resistance. If Sisi wasn’t willing to let Palestinians into Egypt when Israeli military operations in Gaza were at its height, he’s unlikely to do so when the guns have fallen silent (for the time being). Encouraging or compelling Palestinian civilians to leave Gaza, even if it’s ostensibly to accelerate reconstruction, is liable to kill Trump's diplomatic agenda in the Middle East. At the top of the wish list is an Israeli-Saudi normalization accord, something his predecessor Joe Biden couldn’t finalize before his term ended, despite a year-and-a-half of talks with Israeli and Saudi officials. Such a deal would be a groundbreaking accomplishment for Washington in a region often associated with sunk costs, self-defeating policies and missed opportunities. And just as important for Trump, it would be an extremely impressive achievement he could rightfully brag about. Yet none of it will happen if Palestinians are forced to leave their own lands. It would snuff out an expansion of the Abraham Accords before the Trump administration even got the ball rolling. Although the Saudi government may have been open to a normalization deal with Israel before the war in Gaza, it’s no longer content with token Israeli concessions on behalf of the Palestinians. The Saudis now want a concrete pathway toward the establishment of a Palestinian state. As Saudi Crown Prince Mohammed Bin Salman said in September, “The [Saudi] kingdom will not stop its tireless work towards the establishment of an independent Palestinian state with East Jerusalem as its capital. We affirm that the kingdom will not establish diplomatic relations with Israel without that.” The Saudi foreign minister reiterated that position in November, and it’s about as clear as it can get: Normalization without a Palestinian state (or at least a tangible process that leads to one) is impossible. Trump, therefore, needs to ask a fundamental question: What’s more important to him? Doing something all of his predecessors couldn’t do — shepherding formal diplomatic relations between Israel and the Arab world’s most important state — or catering to the whims of Israel’s ultranationalists by proposing a cockamamie scheme that equates to deporting more than 2 million Palestinians from their own homes? The first is difficult to achieve but still doable; the second would cause more problems than they’re worth by compromising Washington’s diplomatic relationships in the Middle East, pushing his dream deal further away, and even risking the collapse of a ceasefire deal in Gaza he helped usher into being. And in this scenario, Trump can forget about seeing his name in the annals of Nobel history.","summary":"Trump met with Israeli Prime Minister Benjamin Netanyahu at the White House Tuesday, and repeated his poorly thought through plans for Gaza.","url":"https://www.msnbc.com/opinion/msnbc-opinion/trump-repeated-baffling-claim-gaza-visit-netanyahu-rcna190680","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-02/250204-trump-netanyahu-ew-457p-bc6151.jpg","video":null,"publish_date":"2025-02-05 00:07:09","author":"Daniel R. Depetris","authors":["Daniel R. Depetris"],"language":"en","source_country":"US","sentiment":-0.048},{"id":287148820,"title":"Trump in no hurry to talk to Xi amid new tariff war","text":"“That’s fine,” Trump said at the White House when asked about China’s retaliatory duties.\n\nA conversation between Xi and Trump is seen as key to a potential easing or delay of tariffs, as conversations with Mexican and Canadian leaders did on Monday.\n\nWhite House spokeswoman Karoline Leavitt told reporters that a Trump-Xi call still needed to be scheduled.\n“President Xi did reach out to President Trump to speak about this, maybe to begin a negotiation. So we’ll see how that call goes,” Leavitt told Fox Business Network earlier on Tuesday.\n\nU.S. President Donald Trump said on Tuesday he is in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the world’s two largest economies sparked by his sweeping 10% tariffs on all Chinese imports.\n\nChina imposed targeted tariffs on U.S. imports on Tuesday and put several companies, including Google, on notice for possible sanctions, in a measured response to Trump’s tariffs.","summary":"&#8220;That&#8217;s fine,&#8221; Trump said at the White House when asked about China&#8217;s retaliatory duties. A conversation between Xi and Trump is seen as key to a potential easing or delay of tariffs, as conversations with Mexican and Canadian leaders did on Monday. White House spokeswoman Karoline Leavitt told reporters that a Trump-Xi call still needed [&#8230;]","url":"https://www.fbcnews.com.fj/world/trump-in-no-hurry-to-talk-to-xi-amid-new-tariff-war/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2025/02/Untitled-design-81.png","video":null,"publish_date":"2025-02-05 00:05:52","author":"Ny Vann","authors":["Ny Vann"],"language":"en","source_country":"fj","sentiment":-0.135},{"id":287145870,"title":"Domestic abuser caught after police dog chase through woodland river","text":"Jump to content\n\nUK EditionChange\n\nUS EditionAsia EditionEdición en Español\nSign up to our newslettersSubscribe now\nLog in / Register\n Independent\nUS PoliticsInvesting Subscribe\n\nUK Politics\n\nNews Videos\n\nRugby Union\n\nSport Videos\n\nJohn Rentoul\nMary Dejevsky\nAndrew Grice\nSean O’Grady\n\nPhotography\nTheatre & Dance\nCulture Videos\n\nFitness & Wellbeing\n\nFood & Drink\n\nHealth & Families\nRoyal Family\n\nElectric Vehicles \nLifestyle Videos\n\nHome & Garden\n\nFashion & Beauty\n\nFood & Drink\n\nTravel & Outdoors\nSports & Fitness\n\nHotel Reviews\nNews & Advice\nSimon Calder\n\nAustralia & New Zealand\nSouth America\nC. America & Caribbean\nMiddle East\n\nPolitics Explained\n\nNews Analysis\nToday’s Edition\n\nClimate 100\nElectric Vehicles \n\nSustainable Living\n\nClimate Videos\n\nBehind The Headlines\nOn The Ground\nDecomplicated\nYou Ask The Questions\nBinge Watch\n\nTravel Smart\nWatch on your TV\n\nToday’s Edition\nCrosswords & Puzzles\nMost Commented\nNewsletters\nAsk Me Anything\nVirtual Events\nWine Offers \n\nBetting Sites\nCasino Sites \n\nThank you for registering\nPlease refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in\n\nIndependent TV\n\nEditor’s Picks\n\nCancelled: The rise and fall of Aung San Suu Kyi Documentary\n\nWWE duo Pretty Deadly take us through a workout\n\nTravel along with us on the Silk Road to Uzbekistan\n\nThe Brookside kiss that made a lesbian storyline mainstream\nMore Editor’s Picks\n\nThe ‘intense challenge’ of filming Netflix’s American Primeval\n\nWhat to do when you visit Jamaica\n\nThe Spider-Man kiss was an ordeal for both actors but it was worth it\n\nThe A-Word | An Independent TV Documentary\n\nTravel Smart\n\nWhat to do when you visit Jamaica\n\nHow to make the most of your trip to Italy’s Amalfi Coast\n\nHere’s where to avoid the tourist crowds in Spain\n\nHow to make the most of your city break in the USA\nMore Travel Smart\n\nThe TravelSmart guide to southeast Asia\n\nThe best European cruise holiday destinations\n\nWhy Kentucky should be your next US destination choice\n\nThe most magical Christmas markets to visit\n\nHow Melania and Donald Trump’s awkward kiss got everyone speculating\n\nThe Brookside kiss that made a lesbian storyline mainstream\n\nThe Spider-Man kiss was an ordeal for both actors but it was worth it\n\nThe green dress Keira Knightley wore everyone wanted \nMore That Dress\n\nHow Kim Kardashian’s attempt to honour Marilyn Monroe went wrong\n\nHow Audrey Hepburn and Givenchy created a fashion staple\n\nWhy Rihanna’s Met Gala “steak bake” dress was a huge deal\n\nThe powerful message behind Lady Gaga’s iconic meat dress\n\nBinge Watch\n\nHow filming took an actor to the Sahara and Arctic Ocean\n\nThe ‘intense challenge’ of filming Netflix’s American Primeval\n\nNicholas Hoult and Bill Skarsgård faced their fears filming Nosferatu\n\nHow Gotham got a fresh spin with The Penguin\nMore Binge Watch\n\nThe Holdovers is the perfect film to get in the festive spirit\n\nThe TV show drawing comparisons to Lost is a great Christmas watch\n\nWhy you should see Gasoline Rainbow this Christmas\n\nWhy this lavish retelling of the vampire story is worth a watch\n\nLemoncello perform ‘Old Friend’ in Music Box session\n\nLemoncello perform ‘Sunflower’ in Music Box session\n\nBoston trio Tiny Habits perform ‘Wishes’ for Music Box session\n\nBoston trio Tiny Habits perform ‘Mudroom’ in Music Box session\nMore Music Box\n\nThe Mysterines perform ‘The Last Dance’ for Music Box\n\nRock band The Mysterines perform single ‘Stray’ for Music Box\n\nGareth Dunlop performs ‘Church’ in acoustic live set\n\nIrish pop artist Gareth Dunlop performs Go Down Swinging for Music Box\n\nOn The Ground\n\nSearching for the ‘Whitby Woman’\n\nOn the campaign trail with Sir Jacob Rees-Mogg\n\nLife at 50C: Delhi’s streets struggling to cope with heatwave\n\nIndian farmers use election to make voices heard against Narendra Modi\nMore On The Ground\n\nBaltimore will rebuild, but at what cost? | On The Ground\n\nNew Yorkers turn to self-defence classes as punching attacks continue\n\nThis 26-year-old could be Biden’s secret weapon | On The Ground\n\nThe NHS nurse fighting to be heard | On The Ground\n\nBehind The Headlines\n\nWhat would a President Trump 2.0 look like?\n\nWhen will the Cost of Living Crisis end? \n\nHow airlines greenwash the skies\n\nIs it time to panic over AI? | Behind The Headlines\nMore Behind The Headlines\n\nMy personal struggle amid the global fight for abortion rights \n\nNon-doms, ghost-doms and tax loopholes of the elite \n\nThe fight for LGBT+ rights in Poland\n\nThe war in Ukraine | Behind The Headlines\n\nDecomplicated\n\nWhat is tactical voting - and why could it be a powerful tool?\n\nAre ultra-processed foods bad for you?\n\nWhy are UK councils going bankrupt? \n\nWhat causes the winter flu and how does it differ from other types?\nMore Decomplicated\n\nHow does the Iowa Caucus pick the next US president? | Decomplicated\n\nEverything you need to know about the bedbug invasion | Decomplicated\n\nWhat is Raac and why is it causing an issue in schools?\n\nHow does El Niño affect our weather? | Decomplicated\n\nPensioner who left Christianity to become escort never been happier\n\nMartin Lewis issues warning over 'easy' online bank app\n\nDomestic abuser caught after police dog chase through woodland river\n\nPolice swarm Swedish school after five people shot in Örebro\n\nExperts say 'new evidence' will give Letby victims' families 'comfort‘\n\nWatch: Woman comes 'within half a second of being hit by train‘\n\nUFC president Dana White opens up on concerns for friend Donald Trump\n\nTrump press secretary stumbles over Musk's security clearance\n\nChelsea fan sniffs Enzo Fernandez's shorts on live TV\n\nTransfer deadline day round-up from The Independent's Miguel Delaney\n\nMikel Arteta defends right to ‘respectful’ criticism of referees\n\nPep Guardiola: Haaland will control his emotions against Arsenal\n\nRuben Amorim tells Rashford what he must do to stay at Man United\n\nFire engulfs kiosk outside Etihad ahead of Man City clash\n\nArne Slot says Liverpool were ‘almost perfect’ in victory over Ipswich\n\nNovak Djokovic breaks silence after retiring from Australian Open\n\nSurfers ride powerful 13ft waves amid weather warning\n\nFloodwaters rage across Yelville as residents evacuated from homes\n\nGreece shuts down Acropolis as temperatures hit almost 40 degrees\n\nEerie tornado sirens ring through downtown Chicago\nMore Climate\n\nGooglebox stars stuck in Jamaica as Hurricane Beryl makes landfall\n\nDamaged boats sink in port after Hurricane Beryl lashes Barbados\n\nNorthern California wildfire forces thousands to evacuate\n\nCars swept away in New Mexico flash floods after wildfires \n\nBear Grylls scales 120ft London building to promote new Netflix show\n\nBear Grylls reveals what makes him uncomfortable\n\nDancing On Ice's Chris Taylor falls in first dance with new partner\n\nDancing On Ice: Christopher Dean fights back tears in DC crash tribute\nMore Culture\n\nChris Martin delivers emotional performance for Liam Payne at Grammys\n\nWatch: Blue Ivy and Jay-Z celebrate Beyonce’s Grammy Awards win\n\nKelsey Parker reveals pregnancy to friends and family in new video\n\nJustin Timberlake celebrates birthday with surprise from Jessica Biel\n\nMeghan Markle joins Jessica Alba for surprise birthday party\n\nThe ultimate guide to exploring Rome\n\nMartin Lewis warns Vinted and Ebay sellers they have days to act\n\nHarry makes first public appearance since settling newspaper claim\nMore Lifestyle\n\nJake Paul parties with 'best friend' Mike Tyson at Trump inauguration\n\nDonald Trump leans in to kiss Melania Trump ahead of inauguration\n\nJamie Theakston cries in first radio show back after cancer treatment\n\nWhale rescued after becoming tangled in discarded ocean plastic\n\nWill Bayley's Electric Road Trip\nPartner Content\n\nParalympian Will Bayley puts his “Range Anxiety” to the test\n\nThe feel-good perks of living the Electric Vehicle lifestyle\n\nParalympian Will Bayley checks the performance of electric vehicles\n\nTo EV or not to EV? Paralympian Will Bayley considers electric cars\n\nPartner Content\n\nSaudi Cup: ‘A true display of horsemanship’, says Prince Bandar\n\nPrincess Nourah praises young fashion designers on show at Saudi Cup\n\nAndrew Strauss says Saudi is an eye opener\n\nSaudi Arabia is ‘pushing limits’ of fashion creativity\nMore Saudi Cup\n\nSaudi Cup could become ‘the best race in the world’\n\nHorseracing chiefs praise Saudi Cup\n\nSaudi will become a ‘worldwide, year-long’ horseracing destination\n\nArabian horses ‘big part’ of global racing culture, says Damien Oliver\n\nGalaxy The Ripple Effect\nPartner Content\n\nEbony Rainford-Brent MBE on the imposter syndrome epidemic\n\nFinance coach Ellie Austin-Williams on the psychology of money\n\nEbony Rainford-Brent MBE on how to tackle imposter syndrome\n\nSimple ways to boost your money situation with Ellie Austin-Williams\n\nBig In America\nPartner Content\n\nCan Willsow’s children’s books pique the interest of the US market?\n\nWill the founders of Spice Kitchen be able to find US retailers? \n\nCo-founders of See.Sense bring their cycle safe tech to New York City\n\nCollctiv fintech founder Amy Whitell tries to crack the US tech market\nMore Big In America\n\nThe maritime tech guru taking high-speed ferries across the Atlantic\n\nSaudi Green Initiative\nPartner Content\n\nSaudi government doesn’t ‘pay lip service’ on climate action\n\nSGI ‘seems like a nest of harmony’, journalist says\n\nSGI ambitions are ‘extremely high’, says Saudi climate envoy\n\nSaudi Green Initiative aims to ‘not just preserve, but create’\nMore Saudi Green Initiative\n\nExpert explains how ‘blended finance’ can help achieve net zero\n\nSGI can be a ‘catalyst’ for Saudi Arabia, head of SABB says\n\nKaust professor ‘inspired’ by Saudi efforts to save coral reefs\n\nWatch in full: Day two of the Saudi Green Initiative Forum\n\nPartner Content\n\nGérard Mestrallet on the challenges of bringing infrastructure to the region of AlUla\n\nSir George Iacobescu, chairman of the Canary Wharf Group on the investment into the historic region of AlUla\n\nOliver Ripley of sustainable hotel group Habitas talks about how AlUla challenged his preconceptions of Saudi Arabia\n\nThomas Kaplan of wild cat conservation charity Panthera on the mission to save the Arabian Leopard\n\nHow AlUla’s sustainability plan will stand the test of time - webinar\n\nDiscover AlUla: The Journey Through Time\n\nAlUla Oasis View Trail\n\nStargazing Experience\n\nGet in touch\n\nOur Products\n\nNewsletters\n\nToday’s Edition\nInstall our app\n\nOther publications\n\nInternational editions\nIndependent en Español\nIndependent Arabia\nIndependent Turkish\nIndependent Persian\nIndependent Urdu\nThe Standard\n\nBetting Offers\nVoucher codes\nCompetitions and offers\nIndependent Advertising\nIndependent Ignite\nSyndication\nWorking at The Independent\n\nCode of conduct and complaints\nContributors\nCookie policy\nDonations Terms & Conditions\nPrivacy policy\n\nUser policies\nModern Slavery Statement\n\nThank you for registering\nPlease refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in","summary":"Police bodycam has captured the moment a violent domestic abuser was caught following a foot pursuit by officers and a police dog through woodland and rivers near Tunbridge Wells.","url":"https://www.independent.co.uk/tv/kent-police-chase-domestic-abuse-dog-river-b2692331.html","image":"https://static.independent.co.uk/2025/02/04/23/27/youtube_qP161QKl8Bs_1280x720_h264-mp4-00_00_36_05-Still001.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/0V8G2d9e-4VHSaSK0.mp4","publish_date":"2025-02-05 00:05:00","author":"Richard Gilzene","authors":["Richard Gilzene"],"language":"en","category":"politics","source_country":"gb","sentiment":0.605},{"id":287149480,"title":"Tiger Woods Says His Mother Has Died. He Called Kultida Woods a ‘Force of Nature’","text":"Kultida Woods, the Thai-born mother of Tiger Woods who instilled his dominant spirit and encouraged him to wear a red shirt on Sunday as his power color, died Tuesday.\n\nWoods announced the death of his 78-year-old mother in a social media post. He did not disclose a cause or other details. She was at his indoor TMRW Golf League match last week in South Florida, where she lived.\n\nHe described her as a “force of nature” who was his biggest supporter from the time she drove him to junior golf tournaments in California to being there for his 15 major championships, often wearing her wide-brimmed visor and sunglasses.\n\n“It is with heartfelt sadness that I want to share that my dear mother, Kultida Woods, passed away early this morning,” Woods wrote. “My Mom was a force of nature all her own, her spirit was simply undeniable. She was quick with the needle and a laugh. She was my biggest fan, greatest supporter, without her none of my personal achievements would have been possible. She was loved by so many, but especially by her two grandchildren, Sam and Charlie.”\n\nPresident Donald Trump was among those who reached out with a post on his Truth Social, calling her “an amazing influence” on Woods.\n\nWoods’ father, Earl, died in 2006.\n\n“Tida,” as she was called by many, was working as a civilian secretary in the U.S. Army office in Bangkok when she met Earl Woods, who was stationed there. She spoke minimal English when she married him and left Thailand for the first time in 1968, first going to Brooklyn and then to Cypress, California, where Woods was born in 1975.\n\nHis father taught him golf. His mother brought the discipline.\n\n“Everyone thought it was my dad when I went on the road, which it was,” Woods said last year when he received the Bob Jones Award from the USGA. “But Mom was at home. If you don’t know, Mom has been there my entire life. She’s always been there through thick and thin.\n\n“She has allowed me to get here. She allowed me to do these things, chase my dreams, and the support and love — I didn’t do this alone. I had the greatest rock that any child could possibly have: my mom.”\n\nPassing along the Thai heritage of Woods was important to his mother. She took him to Thailand for the first time when Woods was 9, and he returned there to play three tournaments early in his career, winning each time.\n\nWhat they shared was a fighting spirit.\n\n“I am a loner, and so is Tiger,” she said in a 2009 interview in Thailand with Jaime Diaz at Golf Digest, a rare occasion when she spoke publicly.\n\n“When I was a girl my mother would always be worried, ‘What will people say?’ And even then I would think, I don’t give a damn,“ Tida said. ”I always tell Tiger: ‘You can’t do things just to please other people. It will waste your energy, and you won’t be happy in yourself. You have to do what is right for yourself.’ And on that, he does a good job.”\n\nInside the ropes, his mother wanted to see domination, and she got every bit of that. “And then, sportsmanship,” she once said.\n\nShe was the one responsible for him wearing a Sunday red shirt — Woods now has an apparel line named for that — because in Thai it was his power color.\n\n“Mom thought being a Capricorn that my power color was red, so I wore red as a junior golfer and I won some tournaments,“ Woods said at the launch last year of the Sun Day Red brand. ”I go to a university that is red — Stanford is red. We wore red on the final day of every single tournament, and then every single tournament I’ve played as a professional I’ve worn red. It’s just become synonymous with me.”\n\nShe also had a tradition of giving Woods a new Tiger head cover for his driver each year.\n\nStitched among the orange-and-black was written in Thai, “Love from Mom.”\n\nTida moved out of the house where Woods grew up to something more modern in Orange County, and she followed him to South Florida after her husband died. She didn’t get out to as many tournaments but rarely missed the Masters. She was there with her grandchildren when Woods captured his fifth green jacket and 15th major in 2019 at Augusta National.\n\nShe was there for a long time, and Woods never failed to cite her influence on his career. That started long ago, driving him to tournaments or dropping him off at the golf course with a dollar — 75 cents to buy a hot dog, 25 cents for the phone call to pick him up.\n\nWoods said in a 2017 interview with USA Today that it was his mother’s discipline he feared.\n\n“My mom’s still here and I’m still deathly afraid of her,” he said. “She’s a very tough, tough old lady, very demanding. ... I love her so much, but she was tough.”","summary":"Kultida Woods, the Thai-born mother of Tiger Woods who instilled his dominant spirit and encouraged him to wear a red shirt on Sunday as his power color, died Tuesday. Woods announced the death of his 78-year-old mother in a social media post. He did not disclose a cause or other details. She was at his [&#8230;]","url":"https://www.theepochtimes.com/us/tiger-woods-says-his-mother-has-died-he-called-kultida-woods-a-force-of-nature-5804125","image":"https://img.theepochtimes.com/assets/uploads/2025/02/04/id5804183-Obit_Woods_Mother_Golf_25035641173734-300x180.jpg","video":null,"publish_date":"2025-02-05 00:04:59","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":0.241},{"id":287143722,"title":"Teamsters Canada Statement on US-Canada Trade War","text":"“These tariffs are not just an attack on Canada—they are an attack on all workers, both Canadian and American. They threaten our shared prosperity and inflict profound hardship on working families in both countries.\n\n“When the tariff threat eventually resurfaces, Canada will have to be ready with robust support measures for workers, and direct emergency programs for impacted sectors. Teamsters Canada will support a strong response, including ‘Buy Canadian’ campaigns.\n\n“Donald Trump has said that Canada is a ‘very tough’ country, and that the U.S. does not need Canada. Canada must now urgently work to develop new markets and diversify our exports. We have options! We are a reliable, trustworthy, and lucrative trading partner with much to offer the world. Expanding energy corridors, pipelines, and transportation infrastructure will be critical to ensuring Canadian goods and commodities reach new markets.\n\n“Clearly, this was never about fentanyl trafficking or illegal migrants from the north. Canada has been disrespected, threatened with annexation, and seen decades of friendship and alliance trampled. We must ensure our country is never again left vulnerable to the whims of a foreign power.\n\n“Canadians must stand tall, stand strong, and stay united.”\n\nTeamsters Canada represents close to 135,000 workers in Canada in all industries from coast to coast.\n\nMedia requests:Christopher MonetteDirector of Public Affairs, Teamsters CanadaCell. : 514-226-6002 | cmonette@teamsters.ca","summary":"Teamsters Canada calls on government not to let guard down LAVAL, Quebec, Feb. 04, 2025 (GLOBE NEWSWIRE) &#8212; François Laporte, National President of Teamsters Canada, issued the following statement on the United States-Canada trade war: “Donald Trump’s declaration of economic war against Canada has united our country like never before. Yesterday’s announcement of a one-month [&#8230;]","url":"https://financialpost.com/globe-newswire/teamsters-canada-statement-on-us-canada-trade-war","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/no0203canadiandollar.jpg?quality=5&strip=all&w=100&sig=Vobk40W541kyqjk2xH9x5A","video":null,"publish_date":"2025-02-05 00:04:34","author":"GlobeNewswire","authors":["GlobeNewswire"],"language":"en","source_country":"CA","sentiment":-0.1},{"id":287147466,"title":"Officials identify 66 of 67 US plane crash victims","text":"Washington officials have positively identified 66 of the 67 people killed in Wednesday's mid-air collision between an American Airlines passenger jet and a military helicopter over the Potomac River.\n\nA joint statement from agencies said all 67 bodies have been recovered.\n\nWork continues by the US Army Corps of Engineers to remove the airplane wreckage from the Potomac River near Washington's Reagan National Airport. Officials plan to begin removing the helicopter wreckage on Wednesday.\n\nIn the aftermath of the crash, the Federal Aviation Administration has imposed significant restrictions on helicopter flights around Reagan National until at least late February and two of the lesser-used runways remain closed.\n\nInvestigators from the NTSB have said they had determined the CRJ-700 plane that had departed from Wichita, Kansas, was flying at an altitude of 99m at the time of impact.\n\nThe NTSB said on Tuesday updated data shows the Black Hawk was flying at 91.5m on the air traffic control display at the time of the collision.\n\nThe data indicates the Army Black Hawk helicopter was flying above 61m, the maximum altitude for the route it was using.\n\nAmerican Airlines CEO Robert Isom spoke to President Donald Trump on Monday, according to an email sent to employees on Tuesday, adding the president offered condolences for crew members, passengers and their loved ones.\n\n\"President Trump also made clear that aviation safety is a priority for his administration,\" Isom added in his note.\n\nIsom praised the FAA for \"limiting helicopter traffic near\" Reagan.\n\nThe National Transportation Safety Board has completed interviews with air traffic controllers and obtained training and flight logs for both flight crews and maintenance records for both aircraft.\n\nNTSB Chair Jennifer Homendy told Reuters the NTSB plans to look at prior near-miss incidents between helicopters and airplanes around Washington Reagan and could expand the investigation \"to other areas where there's military helicopter and air traffic.\"\n\nData confirmed previously that the air traffic controller alerted the helicopter to the presence of the CRJ-700 about two minutes before the collision.","summary":"The remains of all 67 victims of the mid-air collision near Washington's Reagan National Airport have been recovered.","url":"https://thewest.com.au/news/aviation/officials-identify-66-of-67-us-plane-crash-victims-c-17617958","image":"https://images.thewest.com.au/publication/C-17617958/da89b2f760799d2e5180c1ff26096a1572d0e4ab-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-02-05 00:03:50","author":"David Shepardson,David Shepardsonr","authors":["David Shepardson","David Shepardsonr"],"language":"en","category":"politics","source_country":"au","sentiment":-0.328},{"id":287146054,"title":"As Japan’s ‘weak’ PM faces the Trump test, can Ishiba hold the line?","text":"As Japanese Prime Minister Shigeru Ishiba heads to Washington this week, he faces a tall order: charm US President Donald Trump, stave off looming tariffs, and protect Japan’s fragile economy – all while his own political career teeters on the edge.\nIshiba’s visit from Friday comes with promises of trade deals, increased defence spending and an invitation for Trump to make a state visit to Japan later this year, but experts warn that Trump’s “America First” agenda is likely to overshadow any goodwill.\nThe US president is expected to press Ishiba to increase defence spending further and may threaten tariffs unless Japanese firms expand manufacturing facilities in the United States.\n“Trump likes winners and strong leaders,” said Stephen Nagy, a professor of politics and international relations at Tokyo’s International Christian University. “He is going to find Ishiba underwhelming.”\n\nAlready viewed as a weak leader domestically, Ishiba faces mounting criticism that he lacks the political clout to counter Trump’s aggressive protectionist policies. “Ishiba has no political capital in the US, where he is seen as a leader on the way out,” Nagy added. “I’m not at all confident that Ishiba is equipped to face Trump.”\nJapanese businesses are watching nervously, fearing that Trump’s penchant for economic brinkmanship could upend the fragile trade relationship between the two countries. Trump has already delayed imposing 25 per cent tariffs on Canadian and Mexican imports but has signalled that no country – including Japan – is safe from his trade-war tactics.\n“Companies are looking at what Trump threatened to do to Mexico and Canada, two of America’s most important trade partners, and they are worried,” Nagy said. Japanese firms – particularly in the car industry – have invested heavily in manufacturing plants in the US, Mexico and Canada, hoping that the revised three-way free trade agreement that Trump touted as one of the most significant achievements of his first term would shield them from his tariff threats. But the president’s mercurial approach to trade has left them vulnerable.\n\nThe Daiwa Institute of Research estimates that if Trump were to impose 25 per cent tariffs on Japanese goods, the country’s gross domestic product could shrink by as much as 1.4 per cent within three years. Takahide Kiuchi, executive economist at the Nomura Research Institute, has warned that Japan’s status as the fifth-largest exporter to the US makes it a prime target for future tariffs, regardless of Ishiba’s diplomatic efforts.\n“It will be difficult for Japan … to avoid being subject to additional US tariffs,” Kiuchi said. While Ishiba may promise to increase imports of liquefied natural gas and other American goods, Kiuchi believes such concessions are likely to fall short. “Trump has announced that he will impose tariffs on imported semiconductors, pharmaceuticals, steel, aluminium, copper, oil, and natural gas as early as mid-February,” Kiuchi said. “It is quite possible that Japan will be included among the target countries.”\nThe challenges facing Ishiba are compounded by his tenuous position at home. With disapproval ratings for his cabinet climbing to nearly 50 per cent, he lacks the domestic support that his late predecessor, Shinzo Abe, leveraged to build a rapport with Trump. Abe famously visited Trump in New York before his inauguration, presenting him with a gold-plated putter and pledging a close friendship. Ishiba, by contrast, has struggled to even arrange a meeting and is viewed as politically weak by both Washington and Tokyo.\n\n“Trump is going to ask Ishiba what he’s going to do for Japan and what he’s going to do for the US,” Nagy said. “If he is unsatisfied with Ishiba’s plans, then he won’t accept any of them.”\nThe usually pro-Trump Sankei Shimbun newspaper sounded the alarm in a rare critical editorial this week, urging Ishiba to challenge Trump’s tariffs head-on. “In Washington, Ishiba must take up with Trump the impact of these tariffs on the free-trade system, and persuade the US president to seek compromises,” it said. Failure to do so, the paper warned, could destabilise global free trade and embolden China and Russia.\nIshiba, for his part, has laid out his strategy, telling lawmakers on Monday that he intends to emphasise the importance of the rule of law and the dangers of unilateral economic measures.\n“I will share with President Trump the concept of the rule of law, under which changes to the status quo by force are unacceptable,” he said. “We will closely examine how the Trump administration’s high tariff policy will affect global free trade.”\nWhether Trump will be swayed by Ishiba’s arguments – or his offerings of increased defence and energy spending – remains to be seen. But with tariffs looming and Japan’s economy at risk, Ishiba’s first meeting with Trump could define not just his premiership but Japan’s economic future.\nFor now, Japanese businesses and politicians alike can only hope Ishiba’s Washington gambit pays off. If it doesn’t, Japan may find itself squarely in Trump’s crosshairs.","summary":"Armed with promises to buy US weapons and energy, Shigeru Ishiba hopes to stave off tariffs – but Trump is expected to push for more.","url":"https://www.scmp.com/week-asia/politics/article/3297376/japans-weak-pm-faces-trump-test-can-ishiba-hold-line","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/02/05/a80943fe-35d6-48f4-9c65-9f6aa046ea7f_0d7a3fd0.jpg","video":null,"publish_date":"2025-02-05 00:02:36","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":0.197},{"id":287149156,"title":"Not realistic or right for UK to distance from China, says CBI boss","text":"It is not realistic or right for UK firms to distance themselves from China amid a need for stronger global trade, according to the head of one of Britain’s most prominent business groups.\n\nRain Newton-Smith, chief executive of the Confederation of British Industry (CBI), will say in a speech that the UK must not listen to the “siren call of protectionism” in its trade policy.\n\nIt comes amid a backdrop of a looming global trade war after US President Donald Trump announced plans to impose new tariffs.\n\nOver the weekend, the Trump administration confirmed plans to introduce 25% tariffs on imports from Canada and Mexico, although the start of these has been delayed for a month.\n\nOn Tuesday, Mr Trump imposed 10% tariffs on China, sparking instant retaliation from Beijing, which launched its own tariffs on coal, liquified natural gas and crude oil.\n\nThe CBI chief will tell an audience at the University of Oxford on Wednesday that the UK “must not” fall behind one of the key trading blocs in the case of a potential trade war.\n\n“We must project the UK as a world leader in trade, innovation and sustainable economic growth,” she will say.\n\n“There may be tension between the established big blocs – the US, the EU and China.\n\n“There may be pressure to fall in behind one or more. But we must not.\n\n“Engagement is always better than protectionism, or sticking our heads in the sand.\n\n“When it comes to China, we must be practical.\n\n“Yes, let’s recognise the security concerns, but full decoupling from China is not realistic and it is not right.”\n\nShe also stressed that boosting business confidence must be a key commitment for the Government.\n\nIt comes three months after Ms Newton-Smith said the Labour Government’s autumn budget caught firms “off guard” and would undermine investment and jobs.\n\nOn Wednesday, Ms Newton-Smith will stress that firms are “straining” under the burden of the budget.\n\nShe will add: “A business sector that has seen its overheads increase and its headroom for investment squeezed.\n\n“If we’re to get business investing, this must be only the start of a real confidence campaign.”","summary":"Rain Newton-Smith will say in a speech that the UK must not listen to the ‘siren call of protectionism’ in its trade policy.","url":"https://www.standard.co.uk/business/business-news/not-realistic-or-right-for-uk-to-distance-from-china-says-cbi-boss-b1209162.html","image":"https://static.standard.co.uk/2025/02/05/00/20bf03e3dd010e6e88dd03ce4115818fY29udGVudHNlYXJjaGFwaSwxNzM4NzY3Nzgy-2.74621400.jpg?width=1200","video":null,"publish_date":"2025-02-05 00:01:00","author":"Henry Saker-Clark","authors":["Henry Saker-Clark"],"language":"en","category":"politics","source_country":"gb","sentiment":0.015},{"id":287145296,"title":"Letters: Unelected Elon Musk is bent on breaking government","text":"Unelected Musk is\nbreaking government\n\nIt is bad enough for Donald Trump to continue with his poorly planned actions to create utter chaos in our country. However, to let Elon Musk run rampant with his destructive behavior is sheer lunacy.\n\nMusk is not an elected official, nor is he an informed analyst. His aim is to break up a system that has worked throughout the years. Sure there were problems along the way, but nothing criminal enough to warrant a ruthless break up of established departments.\n\nMusk has headed several corporations, but their sizes are minuscule compared to the vast size of the federal government. He appears to act first and then inform Donald Trump. He has tacit approval to do as he pleases. This raises the question of who is really in charge of the executive branch? The legislative branch is determined to rubberstamp Trump’s agenda. The judicial branch needs to do its duty.\n\nTerrele Schumake\n\nMusk given a job\nhe doesn’t understand\n\nWhen little, my children were given chores appropriate to their abilities, and then taught how to do the job. If the chore was loading the dishwasher, they were taught how to rinse the dishes, and then properly place them in the dishwasher.\n\nToday, in Washington, D.C., things are done differently. “Daddy’s” special helper, Elon Musk, was given carte blanche to overhaul government services, despite not being a bona fide government employee, despite having no experience for this job, and despite no one showing him how to proceed in dealing with a plethora of sensitive government issues. Giddy as a kid in a candy shop, he is creating turmoil that will hurt the citizens of our country, as well as harm people worldwide.\n\nI did hear President Trump say, “Elon can’t do anything without approval.” His words don’t appease me; he is too busy seeking revenge to oversee how Elon is doing his chores.\n\nPauline Chand\n\nJan. 6 pardons result of\nMcConnell’s cowardice\n\nOn Jan. 6, 2021, the U.S. Capitol was ransacked.\n\nDuring the next few days, Mitch McConnell publically stated that Trump was responsible. Yet, on Feb.13, McConnell refused to rally enough Republicans to convict Trump. Now, we are all paying for McConnell’s lack of courage.\n\nPerhaps the word “traitor” should be placed on his tombstone.\n\nRobert Miller\n\nRepublicans aspire\nto a dictatorship\n\nJ.D. Vance commented about Christians caring about others: “A lot of the far left … seem to hate the citizens of their own country and care more about people outside their own borders. That is no way to run a society.” That statement, that sentiment, is more revealing of the twisted undemocratic mindset of himself and many Republicans than he may realize. It is not the job of our government to “run” society; a democratic government is run by society. Dictatorships “run” (and ruin) societies, e.g. North Korea and Russia.\n\nToday’s Republican Party is, indeed, aspiring to “run” our society, to tell us what we should do. Accordingly, they aspire to change our very form of government to one of dictatorship. They are a poor torch-bearer for conservatism, which is a legitimate political position.\n\nFreedom is a society free of government telling people how to live and love and think.\n\nTrump’s second term\nis unbridled power trip\n\nThe outcome of the 2024 election may best be explained by incompetence — not only by the winning candidate but more disturbingly by the voting public.\n\nFirst, what were almost 90 million eligible voters who didn’t vote at all thinking? Democracy cannot flourish when people won’t vote.\n\nSecond, 77 million Trump voters (almost half the vote total) chose a scofflaw, self-aggrandizer, fraudster and convicted felon. Trump’s amoral character has been fully exposed, yet his supporters seem uninformed or uncaring about the dangers facing our democracy — and their own children’s future.\n\nTrump has now embarked on an unbridled power trip, putting loyal sycophants in charge of our national security and economy, and wreaking revenge on his perceived political enemies (among the best of our public servants). He clearly cares only about his own perverse goals while sowing chaos into our hard-won democratic social order. Impeachment is the correct legal recourse.\n\nJerry Meyer\n\nCaltrain could learn\na thing from Amtrak\n\nThis is to compliment Caltrain on their new electrified trains.\n\nHowever, as a senior coming into Diridon Station with luggage and a compromised gait, I cannot get Caltrain to give me a lift from Track 6 into the station.\n\nI frequently use public transportation, Caltrain and Amtrak. Amtrak will pick me up on Track 6 at Diridon and give me a lift into the station, but if I arrive via Caltrain, I am stranded.\n\nCaltrain and Amtrak, please work together on this service for your riders to complete a wonderful train trip.\n\nHelen Gendler","summary":"Also: Doesn't understand &#124; McConnell's cowardice &#124; Aspiring to dictatorship &#124; Power trip &#124; Learning a thing. Mercury News reader letters to the editor for Feb. 5, 2025.","url":"https://www.mercurynews.com/2025/02/04/letters-unelected-elon-musk-breaking-government/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/Pictures_of_the_Week_Global_Photo_Gallery_15646.jpg?w=1024&h=683","video":null,"publish_date":"2025-02-05 00:00:52","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.29},{"id":287146646,"title":"Colorado councilwoman encourages people to 'report' ICE activity to help illegal immigrants avoid capture","text":"Councilwoman Stacie Gilmore of Denver, Colorado encouraged local residents to report ICE activity to her \"more than 600 volunteers\" who are available 24/7. Even before President Donald Trump's inauguration, regional Democratic leaders across the U.S. had vowed to either not cooperate with or outright block Trump’s efforts to deport illegal immigrants. Illegal immigration in Denver became a national news story after a video went viral of alleged Venezuelan gang members carrying guns through an Aurora apartment complex. The president had promised during a campaign rally in Colorado last October, \"Upon taking office, we will have an ‘Operation Aurora’ at the federal level to expedite the removals of these savage gangs.\" Shortly after Trump actually took office, however, Gilmore used multiple social media platforms to encourage Colorado residents to report ICE activity. \"This is a challenging and heartbreaking time for our community. If you see activity by ICE, stay safe and know you have every right to report it,\" she wrote. \"More than 600 volunteers with the Colorado Rapid Response Network take calls in English and Spanish 24/7.\" CNN HOST VISIBLY STUNNED BY INCOMING BORDER CZAR SAYING HE'LL ‘JAIL’ DENVER MAYOR FOR REFUSING DEPORTATIONS Gilmore laid out instructions in multiple slides featuring both English and Spanish, \"See a raid? Make sure you stay safe and if you can: Take a photo or video of activity. Record the time, date, and location. Note the government agencies involved, their vehicles, uniforms, and what they’re doing.\" This is the latest of many posts she has made for illegals, ranging from slides helping them to \"know your rights,\" to sharing resources ranging from legal aid to jobs and training for illegal residents. But not all Colorado residents agree that illegal immigration should be tolerated. Republicans in Colorado specifically have condemned their Democratic opponents after Denver Mayor Mike Johnston vowed to station police to block ICE agents from carrying out deportations and a report showed that the city has spent over $356 million in taxpayer dollars on services for migrants. DENVER MIGRANT ADVOCATES SAY SIX MONTHS OF FREE RENT, FOOD NOT ENOUGH: ‘A SLAP IN THE FACE’ AND ‘OFFENSIVE’ Councilman Roger Hudson, representing a small town just south of Denver, told Fox News Digital that \"there's nothing kind, there's nothing hopeful\" about what Democrats have done to the city. According to Hudson, Denver has accepted over 45,000 migrants since 2022. He said that these migrants have taken up much of the funding meant for important services in the city, including public schools and parks. \"Now they're not mowing the grass in parks, the fountains are down, rec centers are closed, the homeless problem is completely out of control,\" he said. \"What they’ve done to Denver is horrific.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Denver, Colorado councilwoman Stacie Gillmore called upon local residents to report on ICE agents as they attempt to find and deport illegal immigrants.","url":"https://www.foxnews.com/media/colorado-councilwoman-encourages-people-report-ice-activity-help-illegal-immigrants-avoid-capture","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/councilwoman-stacie-gilmore.png?ve=1&tl=1","video":null,"publish_date":"2025-02-05 00:00:02","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.134},{"id":287149540,"title":"EU Moves Closer to Establishing Special Tribunal to Prosecute Russia for Ukraine Invasion","text":"The European Union on Tuesday said experts had agreed on the “legal foundations” for a special tribunal to try Russia over the war in Ukraine. \n\nProposals for establishing a court to hold Russia accountable over its invasion were floated more than two years ago. \n\nBut wrangling over the legal basis for the tribunal and how it would work has meant progress on establishing it has been painfully slow.\n\nThe return of US President Donald Trump to the White House appears to have sped up efforts, as European officials fear his plans for a peace deal could mean Moscow escapes justice for good. \n\nThe EU said experts from 37 countries meeting in Brussels had “laid down the legal foundations for the establishment of a Special Tribunal for the Crime of Aggression against Ukraine”. \n\nThey also set out the key elements of the legal text that would govern how the court functions, Brussels said. \n\n“When Russia chose to roll its tanks over Ukraine’s borders, breaking the UN Charter, it committed one of the gravest violations: the Crime of Aggression,” European Commission president Ursula von der Leyen said.\n\n“Now, justice is coming. Justice for Ukraine.”\n\nEU justice commissioner Michael McGrath said that some technical work remained to draw up a final draft but he hoped it would be concluded in the near future. \n\nWhile talks have dragged on over the tribunal, the International Criminal Court (ICC) in March 2023 issued an arrest warrant for Russian President Vladimir Putin over the abduction of Ukrainian children. \n\nBut the special tribunal is specifically intended to try Russia for the “crime of aggression”, for which the ICC does not have jurisdiction. \n\nIn a bid to hold Russia accountable, Ukrainian and international investigators have continued efforts to document thousands of cases of abuses committed during the war.","summary":"The EU has agreed on the legal foundations for a special tribunal to try Russia for the crime of aggression in Ukraine, as fears that Trump’s peace plans could let Moscow escape justice ramp up.","url":"https://www.kyivpost.com/post/46584","image":"https://static.kyivpost.com/storage/2025/02/04/20917bc4c89656931f7619022e8e058b.jpg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-02-05 00:00:00","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"ua","sentiment":-0.05},{"id":287144682,"title":"NFL scraps 'End Racism' message from Super Bowl LIX end zones","text":"Feb. 4 (UPI) -- For the first time in four years, Sunday's Super Bowl will not feature the message \"End Racism\" at the back of one of the end zones after the National Football League revealed Tuesday it has shelved the phrase.\n\nInstead, Super Bowl LIX in New Orleans -- with the Kansas City Chiefs taking on the Philadelphia Eagles -- will feature the phrases \"Choose Love\" and \"It Takes All of Us\" behind each goal post, according to the NFL, as the White House also revealed President Donald Trump is scheduled to attend the game.\n\n\"The Super Bowl is often a snapshot in time and the NFL is in a unique position to capture and lift the imagination of the country,\" NFL spokesman Brian McCarthy said in a statement.\n\n\"'Choose Love' is appropriate to use as our country has endured in recent weeks wild fires in southern California, the terrorist attack here in New Orleans, the plane and helicopter crash near our nation's capital, and the plane crash in Philadelphia,\" McCarthy told The Athletic on Tuesday.\n\nThe messages \"Choose Love\" and \"It Takes All of Us\" appeared in the end zones for this year's AFC Championship Game in Kansas City, while \"End Racism\" was the end-zone phrase at the NFC Championship Game in Philadelphia.\n\nThe message \"End Racism\" began appearing in NFL stadium end zones at the start of the 2020 season following a summer of protests in the United States over racial inequality and the death of George Floyd by a police officer.\n\nNFL Commissioner Roger Goodell defended the league's diversity, equity and inclusion policies this week as Trump recently banned DEI programs throughout federal government.\n\n\"We got into diversity efforts because we felt like it was the right thing for the National Football League, and we're going to continue those efforts because we've not only convinced ourselves, we've proven ourselves, that it does make the NFL better,\" Goodell told reporters during Monday's news conference.\n\n\"Our efforts are fundamental in trying to attract the best possible talent in the National Football league, both on and off the field, as I said previously,\" Goodell added. \"We see how it benefits the National Football League, and so I think we'll continue those efforts.\"","summary":"For the first time in four years, Sunday's Super Bowl will not feature the message \"End Racism\" at the back of one of the end zones, after the National Football League revealed Tuesday it has shelved the phrase.","url":"https://www.upi.com/Top_News/US/2025/02/04/nfl-shelves-end-racism-message-super-bowl/7751738710348/","image":"https://cdnph.upi.com/ph/st/th/7751738710348/2025/upi/4fd3463ce19f3f0f330d660f224bb367/v1.2/NFL-scraps-End-Racism-message-from-Super-Bowl-LIX-end-zones.jpg","video":null,"publish_date":"2025-02-04 23:59:53","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","source_country":"us","sentiment":0.197},{"id":287144646,"title":"Kamala Harris' stepdaughter complains about price of eggs in tone-deaf social media whine","text":"Kamala Harris' stepdaughter complains about price of eggs in tone-deaf social media whine\n\nWelcome to MAGAland podcast: Trump’s tariffs, Elon’s USAID takeover – and how aviation safety hangs in the balance. Listen here\n\nBy MELISSA KOENIG FOR DAILYMAIL.COM\n\nPublished: 23:47 GMT, 4 February 2025 | Updated: 23:56 GMT, 4 February 2025\n\nKamala Harris' stepdaughter has posted a tone-deaf photo of herself complaining about the exorbitant price of eggs.\n\nElla Emhoff, 25, shared a photo of herself carrying some yogurt and a small carton of six eggs to her Instagram Stories on Tuesday.\n\n'Just here with my overpriced half carton of eggs,' she wrote in small letters at the bottom.\n\nBut President Donald Trump's White House has blamed her stepmother and the Biden administration for the rising prices amid an ongoing bird flu epidemic.\n\n'As far as the egg shortage, what's also contributing to that is that the Biden admin and Department of Agriculture directed the mass killing of 100 million chickens,' White House Press Secretary Karoline Leavitt said at her first press briefing last week.\n\nThe White House spokesperson was referring to the US Department of Agriculture's policy of slaughtering an entire flock any time the bird flu is detected on a poultry farm.\n\nAnd with massive egg farms routinely housing more than 1 million chickens, just a few infections can cause a supply crunch.\n\nMore than 145 million chickens, turkeys and other birds have been slaughtered since the current outbreak began in 2022, with the vast majority of them being egg-laying chickens.\n\nElla Emhoff , 25, posted a tone-deaf photo of herself complaining about the exorbitant price of eggs on Tuesday\n\nCage-free egg laws may also be responsible for some supply disruptions and price increases.\n\nOrganic and cage-free eggs are already more expensive than other varieties, but new laws in 10 states set minimum space for chickens or cage-free requirements for egg-laying hens. \n\nThe deadly combination has caused the cost of a dozen eggs to more than double since the summer of 2023, and hit a near-record high of $4.15 in December last year. \n\nWhile this fell short of the $4.82 record set two years ago, the Agriculture Department predicts prices are going to climb another 20 percent this year.\n\nBut the prices are already exorbitant, with shoppers across the country complaining they are already paying double the average price - that is if they can find eggs at their local grocery store at all. \n\nAs of the end of last week, the wholesale price on the New York market for large cartons of eggs delivered to retailers rose by 39 cents, to $7.62 per dozen, according to USDA data on the egg market. \n\nIn the Midwest, it increased 54 cents to $7.03 per dozen, and in California, it climbed by 37 cents to $8.72 per dozen. \n\nShoppers across the country have reported egg shortages at their local groceries\n\nAmid the shortage, Waffle House announced Monday it has implemented a 50 cent per egg surcharge across all of its menus \n\nAmid the shortage, Waffle House announced Monday it has implemented a 50 cent per egg surcharge across all of its menus.\n\nThe breakfast giant known for its affordable meals described the price increase as a 'temporary targeted surcharge' its executives made rather than increasing prices across the board.\n\nIt said 'quality, fresh-cracked, Grade A Large eggs will remain a key ingredient in many of our customers' favorite meals.\n\n'Consumers and restaurants are being forced to make difficult decisions,' the Waffle House said of the nationwide egg shortage.\n\n'We are continuously monitoring egg prices and will adjust or remove the surcharge as market conditions allow,' it said.\n\nAt the same time, major retailers including Publix and Lidl have implemented egg purchase limits at its stores.\n\nFormer Vice President Kamala Harris and Doug Emhoff took a trip to an Asian grocery store at the end of last month amid rumors the now former Second Couple's marriage is on the rocks\n\nThe couple purchased some Botan brand rice and hot sauce before checking out and heading on their way\n\nGrocery prices in general have also rose 22 percent under the Biden-Harris administration from when they took office in 2021, according to CNN. \n\nBut Harris did not seem to mind as she and her husband, Doug Emhoff, took a trip to an Asian grocery store at the end of last month amid rumors the now former Second Couple's marriage is on the rocks. \n\nThe married couple of 10 years put on a united front during a trip to the 99 Ranch Market in Los Angeles just days after they returned home to a chilly reception from neighbors. \n\nHarris, wearing a denim, button-down, black hat and black jeans, was seen browsing the aisles of the Asian supermarket chain with Emhoff, who wore a gray polo shirt and khakis. \n\nThe couple purchased some Botan brand rice and hot sauce before checking out and heading on their way.\n\nAs they shopped, they were seen on video waving and greeting those they passed by. Emhoff remained one step behind his wife as they returned to their luxury property, accompanied by a member of staff.\n\nInside, Emhoff seemed almost bemused by the photographers, trying to hide a smile as he stared into the cameras and eventually giving a wave as Harris dutifully pushed her shopping cart along, before chatting to a clerk inside the store. \n\nWhite HouseKaroline LeavittElla Emhoff\n\nShare or comment on this article:\nKamala Harris' stepdaughter complains about price of eggs in tone-deaf social media whine\n\nAdd comment","summary":"Ella Emhoff , 25, posted a tone-deaf photo of herself complaining about the exorbitant price of eggs on Tuesday amid nationwide shortages.","url":"https://www.dailymail.co.uk/news/article-14361037/Ella-Emhoff-egg-prices-bird-flu.html","image":"https://i.dailymail.co.uk/1s/2025/02/04/23/94865681-0-image-m-19_1738712740474.jpg","video":null,"publish_date":"2025-02-04 23:56:56","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.015},{"id":287151978,"title":"Chipotle assesses fallout from Mexico tariffs, forecasts tepid annual sales growth - Reuters","text":"Feb 4 (Reuters) - Chipotle Mexican Grill (CMG.N), opens new tab said on Tuesday that if President Donald Trump's proposed tariffs on Mexico go into full effect, the burrito maker would see a roughly 60-basis-point impact on its raw material costs this year.\n\nThe forecast from the popular eatery — while yet a small hit — is among the first from companies that are rushing to assess any hit from these proposed tariffs. Chipotle also forecast tepid annual comparable sales growth on Tuesday, a sign that it was bracing for a hit from inflation to hurt demand for its premium burritos and bowls.\n\nAdvertisement · Scroll to continue\n\nIts shares fell 4% in extended trade.\n\nChipotle, like other restaurants and fast food chains that rely on supplies from Mexico, could be handed higher costs of raw materials — including avocados — if President Trump's proposed tariffs take effect. Trump announced, and then paused for a month, tariffs on Mexico.\n\nThe country accounted for about half of avocados that Chipotle serves, executives said on a post-earnings call on Tuesday.\n\nAdvertisement · Scroll to continue\n\nChipotle forecast annual comparable sales growth at low to mid-single digits, which was below analysts' expectations of a 5.2% growth, according to data compiled by LSEG.\n\nThe company has seen higher costs of commodities such as avocado and beef, as it looks to reinvigorate its menu by adding popular limited-time offers, including the smoked brisket and its honey chicken, in order to keep consumers interested.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 480pAuto (480p) \n\nAbout ConnatixV558078 \nAbout ConnatixV558078 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nThis is the first quarter with Scott Boatwright at Chipotle's helm. Boatwright officially became CEO in November but had been operating as interim CEO since mid-August, when Starbucks poached Brian Niccol with one of corporate America's most lucrative contracts.\n\nBoatwright said he would continue efforts at kitchen automation technology that began under Niccol, such as deploying an advanced produce slicer to all restaurants with the potential to cut labor costs.\n\nFor now, the 2% price hike it made to menu prices in December is likely to carry through for the rest of the year.\n\n\"If something that came up throughout the year that would be a permanent hit to the business in the form of inflation, we would consider taking price, but at this point, we feel we are covered,\" Chief Financial Officer Adam Rymer said.\n\nChipotle's operating margin in the reported quarter ended Dec. 31 was 14.6%, compared with 16.9% in the preceding quarter.\n\n\"I think most restaurants right now are very reluctant to take any price. But if inflation continues, I don't know that they're going to have much of a choice,\" said Peter Saleh, analyst at BTIG.\n\n\"(Chipotle has) taken a fair amount of price over the past four or five years and they haven't really seen pushback on demand. I still think they're a good value for play for the consumer,\" he added.\n\nFourth-quarter comparable sales grew 5.4%, below estimates of a 5.6% growth, while its adjusted earnings per share of 25 cents beat estimates by 1 cent.\n\nReporting by Juveria Tabassum and Waylon Cunningham; Editing by Alan Barona and Sayantani Ghosh\n\nXFacebookLinkedinEmailLinkPurchase Licensing Rights","summary":"Chipotle assesses fallout from Mexico tariffs, forecasts tepid annual sales growth  Reuters","url":"https://www.reuters.com/business/retail-consumer/chipotle-mexican-grill-reports-smaller-than-expected-rise-quarterly-sales-2025-02-04/","image":"https://www.reuters.com/resizer/v2/NLUMBY7DJNI7LJYKYC3AM7FKOQ.jpg?auth=d3c715fff136a7468e44d2382b3481d05b97e189f91537a20b05f63c9eafcf60&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-02-04 23:56:34","author":"Juveria Tabassum,Waylon Cunningham","authors":["Juveria Tabassum","Waylon Cunningham"],"language":"en","source_country":"gb","sentiment":-0.114},{"id":287145866,"title":"Fast fashion, laptops and toys are likely to cost more due to US tariffs on Chinese imports","text":"A sweeping new U.S. tariff on products made in China is expected to increase the Fonto co for a wide array of products, from the ultra-cheap apparel sold on online shopping platforms to toys and electronic devices such as computers and cellphones. \n\nAn additional 10% tariff on all Chinese goods took effect Tuesday, a day after President Donald Trump agreed to pause his threatened tariffs against Mexico and Canada for 30 days. The delay followed negotiations on Trump's demands for the North American nations to take steps to reduce illegal immigration and the flow of drugs such as fentanyl into the U.S. \n\nAfter failing to get a similar White House reprieve, China struck back with retaliatory tariffs on some U.S. goods that are set to begin next week. \n\nThe sheer volume and variety of the China-made merchandise sold in the U.S. means residents would probably see the prices of many typically inexpensive items tick higher if the tit-for-tat tariffs persist. \n\nThese are some of the products most likely to be impacted: \n\n Electronics, home supplies and car parts \n\nThe U.S. imported about $427 billion worth of goods from China in 2023, the most recent year with complete data, according to the U.S. Census Bureau. Consumer electronics, including cellphones, computers and other tech accessories, make up the biggest import categories. \n\nChina is a dominant production engine for tech gear, including for American companies like Apple that have their products assembled in the country. In 2023, China accounted for 78% of U.S. smartphone imports and 79% of laptop and tablet imports, the Consumer Technology Association trade group reported. \n\nThe tariffs also may affect how much consumers pay for typically inexpensive clothing, shoes and kitchen items like pots and pans, as well as the big-ticket items, such as appliances, furniture and auto parts. \n\nJay Salaytah, 43, who runs his own auto repair shop in Detroit, said he bought some pieces of equipment sooner than he might have, anticipating they would cost more if Trump implemented his campaign promise to use import tariffs as a tool to promote U.S. manufacturing. \n\n“I knew the costs were going to go up, and these are manufactured in China,” Salaytah said of a probe test light he purchased before Tuesday's tariff went into effect. \n\n Low-cost apparel and accessories \n\nIn addition to imposing a new tariff on Chinese imports, Trump’s executive order also suspended a little-known trade exemption that allowed goods worth less than $800 to come into the U.S. duty-free. The order left open the possibility for the loophole to still be used with shipments from other countries.\n\nThe trade rule, known as “de minimis,” has existed for nearly a century. It came under greater scrutiny in recent years due to the rapidly growing number of low-cost items coming into the U.S. from China, mainly from prominent China-founded online retailers such as Shein, Temu and Alibaba’s AliExpress. \n\nFormer President Joe Biden’s administration proposed a crackdown on the loophole in September, but the rules did not take effect before Biden left office. \n\nShein and Temu have gained global popularity by offering a quickly updated assortment of ultra-inexpensive clothes, accessories, gifts and gadgets shipped mostly from China, allowing the two e-commerce companies to compete on the home turf of American companies.\n\nSeattle-based Amazon is trying to compete with them through an online storefront that mimics their business model by offering cheap products shipped directly from China.\n\nChinese exports of low-value packages soared to $66 billion in 2023, up from $5.3 billion in 2018, according to report released last week by the Congressional Research Service. In the U.S., Temu and Shein comprise about 17% of the discount market for fast fashion, toys and other consumer goods, the report said. \n\n How much will prices go up? \n\nIt’s unclear. Under de minimis, Shein, Temu and AliExpress could bypass taxes collected by customs authorities. But under the changes effective Tuesday, company shipments from China will now be subject to existing duties plus the new 10% tariff imposed by Trump, analysts said.\n\n“The vast majority of these orders are valued less than $800, which means all or virtually all of them are going to get caught in that,” Youssef Squali, an analyst at Truist Financial, said. \n\nJuozas Kaziukenas, founder of e-commerce intelligence firm Marketplace Pulse, said he thinks the price increases on platforms like Shein and Temu will be “pretty small” and the products they sell will remain cheap. However, the rule change is likely to result in delivery delays since the packages now have to go through customs, Kaziukenas said.\n\nThe new tariffs will also hit third-party sellers on Amazon that import products from China, according to Squali. He expects sellers to eat some of the costs and pass the rest onto customers, which he thinks could result in percentage price increases in the mid-single digits. Other e-commerce sites that host businesses, such as Etsy, are also going to be impacted, Squali said. \n\nTemu, which is owned by China’s PDD Holdings, has previously said its growth did not depend on the de minimis policy. Though most of its products are shipped from China, Temu has been recruiting Chinese merchants to store inventory in the U.S., a move that experts said would allow it to not be as exposed to changes around the trade rule. \n\nIn January, China also introduced measures to help cross-border e-commerce build overseas warehousing by offering them tax rebates or tax exemptions\n\n What are US retailers saying? \n\nThe day after November's U.S. presidential election, Brieane Olson, CEO of teen clothing chain PacSun, went to Hong Kong to meet with factory executives to figure out ways to prepare for Trump’s tariff plan. \n\nRoughly 35% to 40% of PacSun’s garments are made in China, even as the chain has accelerated moves to diversify with suppliers in countries like Cambodia and Vietnam.\n\nBut Olson said Trump's 10% tariff on Chinese goods was less extreme than the company anticipated. For now, PacSun doesn’t plan to increase prices on its products or move its manufacturing of knitwear and denim out of China. \n\nToys are another category of consumer products that relies heavily on imports from China. Greg Ahearn, the president and CEO of The Toy Association trade group, said he thinks toy companies that source in China are going to absorb the cost of the new tariff in the short term.\n\nEventually, those price hikes will be moved onto the consumer, Ahearn said. \n\nAssociated Press writers Anne D’Innocenzio in New York, and Christopher Rugaber and Didi Tang in Washington contributed to this report.","summary":"A sweeping new U.S. tariff on products made in China is expected to increase the prices American consumers pay for a wide array of products","url":"https://www.independent.co.uk/news/china-ap-donald-trump-chinese-amazon-b2692309.html","image":"https://static.independent.co.uk/2025/02/04/23/Tariffs_Consumer_Products_China_91411.jpg?width=1200","video":null,"publish_date":"2025-02-04 23:54:48","author":"Haleluya Hadero","authors":["Haleluya Hadero"],"language":"en","source_country":"gb","sentiment":-0.278},{"id":287154642,"title":"Bukele's Big House: El Salvador Offers US A Prison Deal Like No Other, Musk Says 'Great Idea'","text":"El Salvador's President Nayib Bukele says he will incarcerate convicted criminals from the U.S. in his country, a macabre offer that is being praised as an \"unprecedented\" by U.S. Secretary of State Marco Rubio.\n\nBukele made the proposal while hosting Rubio at his residence near San Salvador on Monday. He said El Salvador is prepared to imprison convicted Americans, for a small fee of course, in an infamous mega-prison opened a year ago, the largest in Latin America.\n\n\"We have offered the United States of America the opportunity to outsource part of its prison system,\" Bukele wrote on X. \"The fee would be relatively low for the U.S. but significant for us, making our entire prison system sustainable.\"\n\nSuch A Good Friend\n\n\"In an act of extraordinary friendship to our country … [El Salvador] has agreed to the most unprecedented and extraordinary migratory agreement anywhere in the world,\" Rubio told reporters Monday.\n\nIn addition to loving the U.S., Bukele also loves Bitcoin BTC/USD, making El Salvador the first country to adopt it as its legal tender in 2021.\n\n\"He has offered to house in his jails dangerous American criminals in custody in our country, including those with U.S. citizenship and legal residency. No country's ever made an offer of friendship such as this. We are profoundly grateful,\" gushed Rubio.\n\nIs That Even Legal?\n\nNot at all.\n\n\"The U.S. is absolutely prohibited from deporting U.S. citizens, whether they are incarcerated or not,\" Leti Volpp, a law professor at the University of California/Berkeley who specializes in immigration law, told CNN in an email.\n\nIt is unclear whether the U.S. government will take up Bukele's offer though Elon Musk seemed to quite like it. He took to X where he called it a \"great idea,\" so one can assume the plan has a pretty good chance being accepted by President Donald Trump. \n\nGreat idea!! https://t.co/7924xQYiun\n— Elon Musk (@elonmusk) February 4, 2025\n\nBukele has made El Salvador's prison system — known for rampant human rights violations, violence and overcrowding — part of his anti-crime and anti-gang program. Since March 2022, more than 84,000 people have been arrested, most with no due process, according to Amnesty International.\n\nWhy Can't U.S. Prisons House U.S. Citizens?\n\nApparently, there are too many criminals. Since returning to the White House in January, Trump has prioritized arresting and deporting millions of undocumented individuals. His administration also plans to detain 30,000 migrants at Guantanamo Bay, Cuba.\n\nCoreCivic, Inc. CXW and the GEO Group, Inc. GEO have historically secured substantial contracts with the U.S. Immigration and Customs Enforcement (ICE).\n\nAmerican Civil Liberties Union (ACLU) data found that private prison corporations have pocketed billions from ICE detention contracts in the past two decades. But even they are filling to capacity it seems.\n\nEl Salvador Goes Bigger on Bitcoin: Daily Purchase Jumps 10x Amid Market Slump\n\nPhoto: Shutterstock\n\n$BTCBitcoin\n\n$98041.18-3.37%\n\nCXWCoreCivic Inc\n\n$18.88-5.65%\n\nGEOThe GEO Group Inc\n\n$28.40-8.30%\n\nMarket News and Data brought to you by Benzinga APIs\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","summary":"El Salvador's President Nayib Bukele says he will incarcerate convicted criminals from the U.S. in his country, a macabre offer that is being praised as an \"unprecedented\" by U.S. Secretary of State Marco Rubio.\n\n\nread more","url":"https://www.benzinga.com/news/global/25/02/43483622/bukeles-big-house-el-salvador-offers-us-a-prison-deal-like-no-other-musk-says-great-idea","image":"https://cdn.benzinga.com/files/images/story/2025/02/04/Flag-Of-El-Salvador-And-Police-Handcuffs.jpeg?width=1200&height=800&fit=crop","video":null,"publish_date":"2025-02-04 23:54:14","author":"Maureen Meehan","authors":["Maureen Meehan"],"language":"en","source_country":"us","sentiment":-0.152},{"id":287145142,"title":"Who Is Lisa Bloom? Attorney Repping Diddy Accusers","text":"Lisa Bloom, the attorney who commonly represents alleged victims of sex crimes in high-profile cases and once advised disgraced producer Harvey Weinstein, is representing another accuser of Sean \"Diddy\" Combs.Bloom, the daughter of fellow high-profile attorney Gloria Allred, is representing former Danity Kane member Dawn Richard. In a lawsuit filed Tuesday, Bloom is also representing a John Doe who worked as a dancer and stripper and claims he was sexually assaulted by Combs multiple times from 2007 to 2012.Newsweek reached out to Bloom via email for comment on Tuesday.Combs' lawyers told Newsweek in a statement Tuesday, \"No matter how many lawsuits are filed, it won't change the fact that Mr. Combs has never sexually assaulted or sex trafficked anyone—man or woman, adult or minor.\"Why It MattersCombs, 55, is behind bars at the Metropolitan Detention Center (MDC) in Brooklyn, awaiting his May federal sex trafficking trial. He is also the subject of at least 30 lawsuits accusing him of sex crimes.Who Is Lisa Bloom?Bloom founded The Bloom Firm and is known for her work in civil rights, sexual harassment, and discrimination cases. The daughter of renowned women's rights attorney Gloria Allred, Bloom earned her law degree from UCLA after attending Yale University.Throughout her career, she has been involved in numerous high-profile cases, including representing women who accused Fox News host Bill O'Reilly and President Donald Trump of sexual misconduct. She also advocated for Jeffrey Epstein's victims.Bloom faced controversy in 2017 when it was revealed that she had advised Harvey Weinstein on strategies to undermine his accusers, a role she later apologized for and stepped away from.She is a frequent legal analyst on television networks like CNN and MSNBC and has authored books on gender issues and parenting.New John Doe AllegationsA lawsuit filed Tuesday by a John Doe represented by The Bloom Firm alleges Combs engaged in prolonged sexual, physical, and psychological abuse spanning over five years.The complaint details how Combs allegedly exploited Doe, a Las Vegas-based dancer and entertainer aspiring to break into the music industry, by luring him with false promises of career advancement.Doe describes being coerced into strip performances, forcibly drugged through spiked beverages and baby oil, and pressured into sexual acts under the threat of exposure and physical harm. The suit also claims that Combs secretly recorded the plaintiff engaging in sexual activities and used these recordings as blackmail.Dawn Richard Accusations Against CombsDawn Richard, a former member of the Combs-created girl group Danity Kane, filed a lawsuit against the rap mogul in September, alleging sexual assault, sex trafficking and other abuses during their professional relationship.Richard alleged Combs subjected her to years of sexual and verbal abuse, deprived her of food and sleep, and withheld approximately $3.5 million in unpaid wages and royalties. She also alleges witnessing Combs physically assault other women.Combs denied these allegations, describing them as opportunistic and false.What People Are SayingBloom on the No Jumper podcast in October about Combs' future: \"I think he's in prison for the rest of his life, and I think he should be because I know what the victims' stories are.\"Combs' lawyers told Newsweek on Tuesday: \"We live in a world where anyone can file a lawsuit for any reason. Fortunately, a fair and impartial judicial process exists to find the truth, and Mr. Combs is confident he will prevail in court.\"Phil Pines, Combs' former assistant, in The Fall of Diddy docuseries: \"The smell of baby oil is something I don't ever want to have to smell again.\"\"There would be baby oil surrounding the bathtub, and there would be a bathtub full of water, and you would reach down there to unplug, and you would feel the baby oil was in the tub.\"What Happens NextTony Buzbee, the attorney representing dozens of alleged victims of Combs, said he will file over 10 more lawsuits in the next seven days.Do you have a story Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.","summary":"Bloom, the attorney and daughter of Gloria Allred, is representing people accusing Sean \"Diddy\" Combs of sex crimes in New York.","url":"https://www.newsweek.com/who-lisa-bloom-attorney-repping-diddy-accusers-2026212","image":"https://d.newsweek.com/en/full/2581361/lisa-bloom-diddy-lawsuit.png","video":null,"publish_date":"2025-02-04 23:51:14","author":"Erin Keller","authors":["Erin Keller"],"language":"en","category":"politics","source_country":"US","sentiment":-0.081},{"id":287146644,"title":"Israeli prime minister lauds Trump's leadership when asked if Biden should take credit for ceasefire","text":"Israeli Prime Minister Benjamin Netanyahu lauded President Donald Trump's leadership when asked who should take credit for the ceasefire deal reached in the waning days of the Biden administration. \"Prime Minister Netanyahu, we've heard Joe Biden and Donald Trump take credit for the hostage and ceasefire deal. Who do you think deserves more credit?\" Fox News' Peter Doocy asked Netanyahu as he joined Trump in the Oval Office on Tuesday. \"I think President Trump had a great force and powerful leadership to this effort. I appreciate it,\" Netanyahu responded. \"He sent a very good emissary. He's helped a lot. And, you know, I'll just tell you, I'm happy that they're here. And I'm sure the president is happy that they're here. And I would think that's about enough.\" Israel and Hamas reached a ceasefire deal Jan. 15, just days before Biden exited the White House, and Trump entered it, on Jan. 20. The ceasefire followed a meeting between Trump's then-incoming Middle East envoy, Steve Witkoff, and Netanyahu. TRUMP EYES ABRAHAM ACCORDS EXPANSION, GAZA REBUILD WITH NETANYAHU MEETING ON DECK Credit for the ceasefire was claimed by both Biden and Trump, with the 46th president taking a victory lap for the achievement in the opening remarks of his farewell address to the nation. \"After eight months of nonstop negotiation, my administration — by my administration — a cease-fire and hostage deal has been reached by Israel and Hamas, the elements of which I laid out in great detail in May of this year,\" Biden said in his farewell address. \"This plan was developed and negotiated by my team and will be largely implemented by the incoming administration. That's why I told my team to keep the incoming administration fully informed, because that's how it should be, working together as Americans.\" At another point of Tuesday's joint press conference, Netanyahu argued that chances of peace in the Middle East increase when he and Trump — and Israel and the U.S. overall — work side by side. TRUMP REINSTATES ‘MAXIMUM PRESSURE’ CAMPAIGN AGAINST IRAN \"When Israel and the United States work together, and President Trump and I work together, you know, the chances go up a lot [to reach the second phase of the ceasefire deal],\" he said. \"It's when we don't work together, when Israel and the United States don't work together, that creates problems. When the other side sees daylight between us, and occasionally in the last few years … then it's more difficult.\" Trump invited Netanyahu to the White House to discuss the ceasefire deal's future, and Iran's grip in the Middle East and resettling Gaza residents in other nations. Iran has been at the forefront of Hamas' war on Israel, assisting in funding the effort. Trump said during the press conference that war would not have broken out if he had been president back on Oct. 7, 2023 — citing that Iran was financially hobbled under his first administration. \"Iran was in big trouble when I left. They were broke,\" Trump said. \"They didn't have money for Hamas. They didn't have any money for Hezbollah. You had no problem. October 7th could have never happened when I left.\" ISRAEL'S NETANYAHU DEPARTS FOR US TO MEET WITH TRUMP, HOPING TO STRENGTHEN TIES WITH WASHINGTON Netanyahu vowed during the press conference that he would bring home the remaining hostages in Hamas captivity, while adding that \"Hamas is not going to be in Gaza\" much longer. Trump added that Gaza is too dangerous for even the soldiers currently on the ground. CLICK HERE TO GET THE FOX NEWS APP \"It's too dangerous for people. Nobody wants to be there,\" he said. \"Warriors don't want to be there. Soldiers don't want to be there. How can you have people go back? You're saying go back into Gaza now? The same thing's going to happen.\" \"It'll only be death,\" he said.","summary":"Israeli Prime Minister Benjamin Netanyahu lauded President Donald Trump&apos;s leadership when asked if the Biden or Trump administration should take credit for the ceasefire deal.","url":"https://www.foxnews.com/politics/netanyahu-lauds-trumps-leadership-when-asked-who-should-take-credit-ceasefire","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/trumpbibi.png?ve=1&tl=1","video":null,"publish_date":"2025-02-04 23:50:38","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.404}]}