{"offset":0,"number":50,"available":25593,"news":[{"id":282134494,"title":"7 memorable times Trump wielded his trademark Sharpie","text":"In September 2019, ahead of the devastation brought in by Hurricane Dorian, the president said the storm was headed to Alabama.\n\n\"In addition to Florida - South Carolina, North Carolina, Georgia, and Alabama, will most likely be hit (much) harder than anticipated,\" Trump tweeted at the time. \"Looking like one of the largest hurricanes ever. Already category 5. BE CAREFUL! GOD BLESS EVERYONE!\"\n\nIn a bid to quell public panic regarding the former president's errant forecast, the Birmingham branch of the National Weather Service set the record straight, blatantly correcting his prediction.\n\n\"Alabama will NOT see any impacts from Dorian,\" the agency said in a tweet the same day. \"We repeat, no impacts from Hurricane Dorian will be felt across Alabama. The system will remain too far east.\"\n\nBut Trump doubled down once again on his claims and refused to accept the NWS' forecast, instead presenting a map of Hurricane Dorian's path with a black Sharpie stroke extending the storm's path over Alabama. The incident later became known as \"SharpieGate,\" prompting its fair share of internet mockery and memes in its wake.","summary":"Trump is known for having a penchant for the bold strokes of a Sharpie marker, even asking the company to design a custom pen for him to use.","url":"https://www.businessinsider.com/notable-times-donald-trump-wielded-infamous-sharpie-sharpiegate-signatures-2022-11","image":"https://i.insider.com/678ee2c32fcded5e9073eb34?width=1200&format=jpeg","video":null,"publish_date":"2025-01-21 01:05:40","author":"Katherine Tangalakis-Lippert,Lauren Frias","authors":["Katherine Tangalakis-Lippert","Lauren Frias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.55},{"id":282133760,"title":"Trump Postpones Immediate China Tariffs And Advocates For Global Trade Reforms &#8211; Reports","text":"President Donald Trump has opted to delay the introduction of China-specific tariffs on his first day in office, instead ordering his administration to address unfair trade practices globally and investigate whether Beijing has complied with the deal signed during his first term. The new direction, as outlined in a fact sheet seen by Bloomberg News, aims to reverse what Trump’s team considers the “destructive impact of globalist, America-last trade policy.” The fact sheet further calls for federal agencies to look into currency manipulation by other nations, emphasizing the administration’s commitment to reducing reliance on foreign nations for essential supply chains while reinvigorating the U.S. industrial base.\nThis decision to hold off on targeting China immediately marks a significant shift for the new administration, suggesting a more cautious and negotiating approach. According to sources familiar with the decision, Trump’s delay signals his eagerness to cut a new deal with Chinese President Xi Jinping rather than proceeding with the hard-line tariffs he had promised during his campaign. While Trump’s initial campaign rhetoric included threats of up to 20% tariffs on all imported goods and 60% on Chinese products, as well as a 25% duty on all goods from Canada and Mexico, his first actions in office reflect a more strategic and deliberate approach.\nThe delay in implementing tariffs comes as a relief to several companies that had feared immediate imposition of the duties. However, some insiders cautioned that Trump has been known to quickly change his mind, meaning the tariffs could be reinstated in the coming weeks or months. Despite this uncertainty, the decision on Monday signals a shift from the fiery rhetoric of the campaign trail to a more measured strategy.\nIn addition to delaying tariffs, Trump is set to direct his cabinet secretaries to assess the impact of the US-Mexico-Canada Agreement (USMCA) on American workers and businesses. His administration plans to evaluate whether continuing participation in the agreement is in the country’s best interest. The USMCA replaced the North American Free Trade Agreement (NAFTA) during Trump’s first term, and he has often referred to it as “the best deal ever negotiated.”\nAdditionally, Trump announced that he could sign as many as 100 executive actions on his first day in office, which will include measures aimed at curbing inflation and cutting regulations, particularly those related to oil and gas production. One of the more novel proposals involves the study of creating an external revenue service—a new agency that would focus on collecting tariff revenue—though it remains unclear how this would differ from the current federal system.\nThe announcement of Trump’s tariff delay had an immediate impact on the markets. The dollar fell sharply, with a Bloomberg gauge of the greenback showing a loss of about 1.2%, on track for its largest daily decline since November 2023. Investors had speculated that a trade war, with tariffs targeting foreign nations, could hurt global economies more than the U.S. and lead to a stronger dollar due to its status as a safe-haven currency. With the announcement, U.S. equity futures climbed, reflecting investor optimism that Trump’s approach may alleviate some of the economic tensions in the near term.\nTrump’s tariffs have already had a major impact on the U.S. economy. In his first term, the self-proclaimed “tariff man” imposed duties on about $380 billion worth of imports. While these tariffs were designed to reduce the U.S. trade deficit and bring manufacturing jobs back to the country, the effectiveness of such measures remains a subject of debate. Economists have raised concerns that tariffs may not significantly close the trade deficit or revitalize U.S. manufacturing in the long term. In the short term, however, tariffs are likely to lead to a stronger dollar, higher import costs, and increased government revenues.\nThe future of U.S. tariffs remains uncertain, with Trump’s team signaling that they will continue to assess the situation and potentially act if further negotiations with China and other countries do not yield the desired results. For now, the delay in imposing China-specific tariffs reflects the president’s desire to adopt a more calculated approach to trade while exploring broader global reforms.\nALSO READ: Trump Seeks To Make 'Two Genders' Policy Official While Targeting DEI","summary":"Trump delays tariffs on China, opting for global trade reforms and investigation into Beijing’s deal compliance, signaling a more cautious approach.","url":"https://www.newsx.com/world/trump-postpones-immediate-china-tariffs-and-advocates-for-global-trade-reforms-reports/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Trump-Postpones-Immediate-China-Tariffs-And-Advocates-For-Global-Trade-Reforms-Reports.webp","video":null,"publish_date":"2025-01-21 01:02:30","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":0.185},{"id":282133756,"title":"Barron Trump Then And Now, How The Youngest Trump Has Changed Over These Years","text":"Barron Trump, the youngest son of Donald and Melania Trump, has been a quiet figure in the public eye, often staying out of the spotlight. However, his transformation over the years has certainly caught the attention of many. From a 10-year-old boy attending his father's inauguration in 2017 to a tall, college-bound young man at his father’s second inauguration in 2025, Barron’s growth has been remarkable.\nWhen Barron first stepped into the public eye at his father’s inauguration in 2017, he was just a shy child, standing beside his parents with an air of youthful innocence. At only 10 years old, he wasn’t quite ready to embrace the limelight, yet he became a subject of curiosity as he joined his parents on one of the biggest stages of American politics. His height back then was notably shorter than his father’s, yet his calm demeanor and reserved nature contrasted with the usual political spectacle.\nFast forward to 2025, and Barron has grown both physically and personally. Now well over 6 feet tall, Barron appears to have followed in his father’s footsteps in terms of stature. But what’s even more significant is his path toward adulthood. At the age of 18, Barron is now attending New York University, where he’s navigating life as a young adult away from the glare of the public eye. The transition from a child to a young man who is poised to make his mark on the world is clear, and Barron seems eager to build his own identity.\nThroughout his growing years, Barron has maintained a level of privacy that has helped him stay out of the media frenzy that often surrounds the Trump family. He’s rarely seen in public, and when he is, he’s often observed with a quiet grace and maturity that belies his young age. Unlike his older siblings, Barron has kept a low profile, allowing him to focus on his studies and interests rather than the political spotlight.\nHis transformation, from the boy who shyly stood beside his parents to the young adult who is ready to take on the challenges of university life, marks a new chapter in the Trump family’s public narrative. While his father continues his political journey, Barron’s future appears to be his own, with the potential to build a career far removed from the political stage.\nAs Barron Trump moves forward into adulthood, it will be interesting to see what path he chooses. While much of the world’s attention was focused on his father’s presidency, Barron’s evolution stands as a testament to the passage of time and the personal growth that comes with it. Whether or not he’ll ever take on a public role remains to be seen, but for now, he is embracing the transition from childhood to adulthood with grace and composure.\nALSO READ: Trump Seeks To Make 'Two Genders' Policy Official While Targeting DEI","summary":"Barron Trump, from a 10-year-old at his father&#8217;s first inauguration in 2017 to a tall, college-bound young man in 2025, has grown before our eyes.","url":"https://www.newsx.com/trump-inauguration/barron-trump-then-and-now-how-the-youngest-trump-has-changed-over-these-years/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Barron-Trump-Then-And-Now-How-The-Youngest-Trump-Has-Changed-Over-These-Years.webp","video":null,"publish_date":"2025-01-21 01:02:30","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":0.432},{"id":282133758,"title":"Michelle Obama Encourages People To Honour Dr. Martin Luther King Jr. As She Skips Trump&#8217;s Inauguration Day","text":"As Donald Trump prepared to take the oath of office as the 47th President of the United States on Monday, Michelle Obama took a moment to celebrate the legacy of civil rights leader Dr. Martin Luther King Jr. The former First Lady shared a heartfelt tribute on social media, marking the national holiday dedicated to Dr. King’s memory.\nMichelle Obama’s Tribute to Dr. King\n“Reverend Dr. Martin Luther King Jr.’s legacy of service always inspires me,” Michelle Obama wrote on Instagram. In her post, she encouraged Americans to honor Dr. King’s life and contributions by giving back to their communities.\n“This #MLKDay, I hope you’ll join me and @WhenWeAllVote in honoring Dr. King’s life and legacy by getting involved in your community,” she wrote. “Whether you’re mentoring students at your local school or volunteering for a cause that matters to you, it all helps make a difference.”\nThe post was accompanied by an iconic photo of Dr. King and one of his famous quotes: “The time is always right to do what is right.”\nMichelle Obama’s Decision Not to Attend the Inauguration\nWhile Barack Obama attended Donald Trump’s inauguration, Michelle Obama was notably absent. According to a statement from the Office of Barack and Michelle Obama, the former President would represent the family at the ceremony.\nA source told People magazine that Michelle’s decision was intentional. “Michelle doesn’t do anything because it’s expected or it’s protocol or it’s tradition,” the source explained. Despite their attendance at Trump’s 2017 inauguration, this time was different, reflecting her personal feelings about the current political landscape.\nTrump Acknowledges Martin Luther King Jr.\nDuring his inaugural speech, President Trump briefly referenced Dr. Martin Luther King Jr., acknowledging the significance of the holiday.\n“To the Black and Hispanic communities, I want to thank you for the tremendous outpouring of love and trust that you have shown me with your vote. We set records and I will not forget it,” Trump stated.\nHe continued, “Today is Martin Luther King Day and [in] his honor, this will be a great honor, but in his honor, we will strive together to make his dream a reality. We will make his dream come true.”\nBernice King Reflects on MLK Day and the Inauguration\nDr. King’s daughter, Bernice King, shared her thoughts on the significance of MLK Day coinciding with the inauguration during an interview with MSNBC’s The Weekend. She noted that the timing served as a powerful reminder of her father’s mission.\n“It’s wonderful that this occurs on the King holiday, the inauguration, because it reminds us of King,” she said. “It points us back to King. It says, ‘When we move forward, we’ve got to do it in the spirit of King.’”\nBernice King emphasized the importance of nonviolence as a central tenet of her father’s philosophy. “We have to strategize. We’ve been missing the strategy. We’ve been missing the spirit of Dr. King,” she said.\nShe explained that nonviolence is more than just a posture—it is a way of life. “The spirit of Dr. King is nonviolence. And nonviolence is not just a posture, it’s a mindset. For us, we define it as a love-centered way of thinking, speaking, acting and engaging that leads to personal, cultural, and societal transformation.”\nHonoring King’s Legacy\nAs the nation observes Martin Luther King Jr. Day, leaders and citizens alike are reminded of his enduring message of equality, justice, and service. Michelle Obama’s tribute, coupled with reflections from Dr. King’s family, highlights the continued relevance of his teachings in today’s world.\nWhile the country transitions into a new presidential term, the principles of unity and nonviolence championed by Dr. King remain a guiding light for many as they navigate the path forward.\nAlso Read: Do You Know President Donald Trump In His First Term Donated His Entire $1.6M Salary Back To The U.S. Government","summary":"As Donald Trump prepared to take the oath of office as the 47th President of the United States on Monday, Michelle Obama took a moment to celebrate the legacy of civil rights leader Dr. Martin Luther King Jr.","url":"https://www.newsx.com/trump-inauguration/michelle-obama-encourages-people-to-honour-dr-martin-luther-king-jr-as-she-skips-trumps-inauguration-day/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Obama.webp","video":null,"publish_date":"2025-01-21 01:02:30","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","category":"politics","source_country":"in","sentiment":0.631},{"id":282133754,"title":"Trump Seeks To Make &#8216;Two Genders&#8217; Policy Official While Targeting DEI","text":"On the heels of his inauguration as the 47th President of the United States, Donald Trump has announced a sweeping change in federal policy, declaring that only two genders — male and female — will be recognized by the U.S. government. In a move that’s expected to shake up conversations around gender rights, Trump stated that, “As of today, it will henceforth be the official policy of the United States government that there are only two genders – male and female.”\nThis decision is part of Trump’s broader efforts to challenge the growing influence of gender diversity policies, which have become a flashpoint in political discourse. During his election campaign, Trump and many of his Republican allies took aim at transgender laws, focusing on issues like transgender women competing in sports. The president has also promised to take strong action to restrict gender-affirming care, signaling his administration’s intent to curb the advancements made in transgender rights in recent years.\nIn the days leading up to his swearing-in, Trump reiterated his stance on gender issues during a pre-inauguration rally. He made it clear that one of his top priorities was to “keep all men out of women’s sports,” underscoring his administration’s commitment to rolling back policies that he believes disrupt traditional gender roles. Trump’s announcement of his executive order aligns with the larger cultural and political currents shaping his administration’s approach to gender and identity.\nAn official from Trump’s team revealed to Reuters that, alongside this executive order, more actions targeting diversity, equity, and inclusion (DEI) programs were in the works. The plan includes halting the use of federal funds to promote what they term \"gender ideology,\" a move that will undoubtedly provoke strong reactions from civil rights advocates.\nThe proposed executive orders would make significant changes to government-issued identification papers, such as passports, by offering only male or female options based on biological sex rather than gender identity. This shift could mark a drastic departure from the approach seen under previous administrations, which allowed individuals to select their gender identity on official documents.\nTrump’s stance on gender diversity is consistent with actions taken during his first term as president, including his controversial ban on transgender individuals serving in the military. Though that policy was reversed by President Joe Biden in 2021, Trump’s new executive orders signal a continued commitment to undoing what he views as progressive overreach on gender and identity issues.\nThis development could set the stage for significant political and legal battles, with civil and human rights groups already preparing to challenge these policies. Critics argue that slashing DEI programs would undermine years of work to ensure equal treatment for marginalized communities. Additionally, many activists contend that limiting gender recognition to biological sex could further harm transgender individuals who have already faced significant challenges in the U.S. social and legal landscape.\nInterestingly, the corporate world has shown signs of divergence on this issue. While some companies have begun to roll back DEI initiatives in recent months, companies like Apple and Costco have remained steadfast in their commitment to supporting gender diversity and inclusion. The broader business community will likely keep a close eye on how Trump’s policies influence corporate practices moving forward, particularly with respect to employee rights and gender diversity efforts.\nAs Trump’s executive orders take shape, it is clear that this move will be one of the most controversial and far-reaching policy shifts of his administration. The decision to end gender diversity recognition could alter the landscape of U.S. federal policy, especially when it comes to transgender rights, civil rights protections, and the future of diversity, equity, and inclusion initiatives.\nALSO READ: Meet Kash Patel, The Indian-American Lawyer Poised To Lead The FBI Under Trump 2.0","summary":"President Trump announces executive orders to end gender diversity in federal policies, recognizing only male and female, with a focus on limiting DEI.","url":"https://www.newsx.com/trump-inauguration/trump-seeks-to-make-two-genders-policy-official-while-targeting-dei/","image":"https://www.newsx.com/wp-content/uploads/2025/01/trump-trump-announcements-TRUMP-EXECUTIVE-ORDERS-donald-trump-trump-oath-trump-oath-ceremony-trump-47th-president-inauguration-live-inauguration-day-2025.webp","video":null,"publish_date":"2025-01-21 01:02:30","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":0.31},{"id":282133634,"title":"Trump’s ‘Day One’ promise has been broken","text":"Amid the blitz of executive orders Donald Trump foreshadowed at his inauguration there was a notable omission. There were no new tariffs, at least not yet.\n\nInstead, Trump has passed the contentious issue over to federal agencies, directing them to investigate a range of trade issues, including US trade deficits, conformance with trade deals signed in the past, unfair trade practices, currency manipulation, the effectiveness of tariffs imposed on national security grounds and the exemption from tariffs for low-value goods.\n\nHe is also ordering a feasibility study for the creation of an “External Revenue Service” to collect revenue from tariffs (a function already performed by US Customs and Border Protection).\n\nThe absence of any immediate action on tariffs caused the US dollar to weaken against its major trading partners’ currencies, while those of the most exposed to the tariffs he has threatened – Canada and Mexico in particular – strengthened, as did the Australian dollar. (Historically, the currencies of those imposing tariffs tend to strengthen, while their targets’ currencies weaken).","summary":"Donald Trump had threatened to launch an economic war on the rest of the world on day one of his new presidency. He has backed down - for now.","url":"https://www.smh.com.au/business/the-economy/trump-s-day-one-promise-has-been-broken-20250121-p5l606.html","image":"https://static.ffx.io/images/$zoom_0.8307920370370371%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_573%2C$y_328/t_crop_custom/q_86%2Cf_auto/dc213f7e49bb33b1575a1e7a1b92e74240ddef20","video":null,"publish_date":"2025-01-21 00:58:56","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.181},{"id":282134496,"title":"Trump orders federal employees to return to the office full-time","text":"President Donald Trump on Monday signed an executive order mandating that federal workers return to their offices full-time, a core element of his focus on overhauling the government workforce.For years, Republicans have sought to weaken protections that federal workers have long enjoyed, with many conservatives zeroing in on reclassifying scores of career civil servants.\"Heads of all departments and agencies in the executive branch of Government shall, as soon as practicable, take all necessary steps to terminate remote work arrangements and require employees to return to work in-person at their respective duty stations on a full-time basis, provided that the department and agency heads shall make exemptions they deem necessary,\" the order read.Trump has been especially insistent on a return-to-office push, with his position threatening the remote and hybrid arrangements that many federal workers have enjoyed since the start of the COVID-19 pandemic.Some workers may consider quitting instead of working from the office full time.Elon Musk, who will lead Trump's cost-cutting advisory group, the Department of Government Efficiency, said he'd welcome this.\"Requiring federal employees to come to the office five days a week would result in a wave of voluntary terminations that we welcome: If federal employees don't want to show up, American taxpayers shouldn't pay them for the Covid-era privilege of staying home,\" Musk said in a November op-ed in The Wall Street Journal. The op-ed was co-written with Vivek Ramaswamy, who is leaving DOGE to run for governor of Ohio.While many federal employees can telework, an August 2024 report from the Office of Management and Budget said around 10% of the roughly 2.3 million civilian workers in two dozen major agencies, including the Department of Defense and the Social Security Administration, \"were in remote positions where there was no expectation that they worked in-person on any regular or recurring basis.\"That includes over 60,000 people in the Department of Defense, around 37,000 in the Department of Veterans Affairs, and nearly 27,000 in the Department of Health and Human Services.The Office of Management and Budget found, based on average data representing pay periods ending May 4 and May 18, around 1.1 million civilian workers employed in the two dozen agencies were eligible for telework.The Department of Defense has a large workforce compared to the other agencies, but only about 8% were remote employees.\"Among the subset of federal workers that are telework-eligible, excluding remote workers, 61.2% of regular, working hours were spent in-person,\" the OMB report said. That figure for the Department of Agriculture was 81%, and around 80% for the Department of State.When asked about potential relocation out of DC and return to office before the inauguration, Trump's transition team pointed to Trump's comments at a December 16 press conference that if people don't return to the office, \"they're going to be dismissed.\"On Monday, Trump also issued an executive order that put a freeze on federal hiring.\"As part of this freeze, no Federal civilian position that is vacant at noon on January 20, 2025, may be filled, and no new position may be created except as otherwise provided for in this memorandum or other applicable law,\" the order read.That executive order does not apply to military personnel, immigration enforcement positions, or positions involving national security or public safety.","summary":"Trump promised stark changes for government workers. On his first day in office, he ordered federal employees to return to the office.","url":"https://www.businessinsider.com/donald-trump-orders-federal-workers-return-to-office-rto-2025-1","image":"https://i.insider.com/678a7fe610c98eace912da16?width=1200&format=jpeg","video":null,"publish_date":"2025-01-21 00:55:59","author":"John L. Dorman,Madison Hoff","authors":["John L. Dorman","Madison Hoff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":282133082,"title":"Marco Rubio, former Florida senator, confirmed as secretary of state by the Senate, becomes the first Cabinet member appointed by Trump.","text":"The Senate quickly confirmed Marco Rubio as secretary of state Monday, voting unanimously to give President Donald Trump the first member of his new Cabinet on Inauguration Day.\n\nRubio, the Republican senator from Florida, is among the least controversial of Trump’s nominees and vote was decisive, 99-0. Another pick, John Ratcliffe for CIA director, is also expected to have a swift vote. Action on others, including former combat veteran and Fox News host Pete Hegseth for defense secretary, is expected later in the week.\n\n“Marco Rubio is a very intelligent man with a remarkable understanding of American foreign policy,” Sen. Chuck Grassley of Iowa, the senior-most Republican, said as the chamber opened.\n\nIt’s often tradition for the Senate to convene immediately after the ceremonial pomp of the inauguration to begin putting the new president’s team in place, particularly the national security officials. During Trump’s first term, the Senate swiftly confirmed his defense and homeland security secretaries on day one, and President Joe Biden’s choice for director of national intelligence was confirmed on his own Inauguration Day.\n\nWith Trump’s return to the White House, and his Republican Party controlling majorities in Congress, his outsider Cabinet choices are more clearly falling into place, despite initial skepticism and opposition from both sides of the aisle.\n\nSenate Majority Leader John Thune moved quickly Monday, saying he expected voting to begin “imminently” on Trump’s nominees.\n\nDemocrats have calculated it’s better for them to be seen as more willing to work with Trump, rather than simply mounting a blockade to his nominees. They’re holding their opposition for some of his other picks who have less support, including Tulsi Gabbard for director of national intelligence and vaccine skeptic Robert F. Kennedy Jr. for health secretary.\n\nSenate Democratic Leader Chuck Schumer said his party will “neither rubber-stamp nominees we feel are grossly unqualified, nor oppose nominees that deserve serious consideration.”\n\nRubio, he said, is an example of “a qualified nominee we think should be confirmed quickly.”\n\nSenate committees have been holding lengthy confirmation hearings on more than a dozen of the Cabinet nominees, with more to come this week. And several panels are expected to meet late Monday to begin voting to advance the nominees to the full Senate for confirmation.\n\nThe Senate Foreign Relations Committee advanced Rubio’s nomination late Monday. The Senate Armed Services Committee and Senate Intelligence Committee, respectively, advanced the nominations of Hegseth and Ratcliffe.\n\nRubio, a well-liked senator and former Trump rival during the 2016 presidential race, has drawn closer to the president in recent years. He appeared last week to answer questions before the Foreign Relations Committee, where he has spent more than a decade as a member.\n\nAs secretary of state, Rubio would be the nation’s top diplomat, and the first Latino to hold the position. Born in Miami to Cuban immigrants, he has long been involved in foreign affairs, particularly in South America, and has emerged as a hawk on China’s rise.\n\nDuring his confirmation hearing last week, Rubio warned of the consequences of America’s “unbalanced relationship” with China. While he echoes Trump’s anti-globalist rhetoric, Rubio is also seen as an internationalist who understands the power of U.S. involvement on the global stage.\n\nRubio is likely to win bipartisan support from both Republicans and Democrats. He would take over for outgoing Secretary of State Antony Blinken, who has said he hopes the Trump administration continues Biden’s policies in the Middle East to end the war in Gaza and to help Ukraine counter Russian nomination.\n\nThe Senate is split 53-47, but the resignation of Vice President JD Vance drops the GOP majority to 52 until his successor arrives. Republicans need almost all every party member in line to overcome Democratic opposition to nominees.\n\nObjection from any one senator, as is expected with Hegseth and several other choices, would force the Senate into procedural steps that would drag voting later into the week.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe Senate quickly confirmed Marco Rubio as secretary of state Monday, voting&#8230;\n\n\nThis Post: Marco Rubio, former Florida senator, confirmed as secretary of state by the Senate, becomes the first Cabinet member appointed by Trump. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/marco-rubio-former-florida-senator-confirmed-as-secretary-of-state-by-the-senate-becomes-the-first-cabinet-member-appointed-by-trump/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Marco-Rubio-Senate-confirms-former-Florida-senator.jpg","video":null,"publish_date":"2025-01-21 00:54:09","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.179},{"id":282132820,"title":"Trump says troops dismissed for refusing the COVID vaccine will be reinstated","text":"President Donald Trump said he will reinstate all military members who were dismissed for refusing to comply with orders to receive the COVID-19 vaccine during the pandemic.\n\n“This week, I will reinstate any service members who were unjustly expelled from our military for objecting to the COVID vaccine mandate with full back pay,” the newly inaugurated 47th President Trump said inside the Capitol Rotunda during the swearing-in ceremony Monday.\n\nAround 8,400 troops were expelled from the military after refusing orders and declining the vaccine, according to military data, with Marines making up around 3,700 of the dismissals. Thousands of others got medical and religious exemptions from the vaccine mandate.\n\nTrump’s comments echo those made by his Defense Secretary nominee Pete Hegseth during his confirmation hearings last week, who said the members would be “apologized to” and “reinstituted with pay and rank.”\n\n“And I will sign in order to stop our warriors from being subjected to radical political theories and social experiments while on duty,” Trump said Monday. “It’s going to end immediately. Our armed forces will be free to focus on their sole mission, defeating America’s enemies.”\n\nThe COVID-19 vaccine mandate for U.S. military members lasted from August 2021 to January 2023, when it was overturned by legislation. Despite the new law, dismissed military members were not reinstated, leading to some pushback from conservative lawmakers.\n\nThe administration did not immediately provide details of the reinstatement and information on how much back pay may cost.","summary":"President Donald Trump said he will reinstate all military members who were dismissed for refusing to comply with orders to receive the COVID-19 vaccine during the pandemic.","url":"https://www.bostonherald.com/2025/01/20/trump-says-troops-dismissed-for-refusing-the-covid-vaccine-will-be-reinstated/","image":"https://www.bostonherald.com/wp-content/uploads/2025/01/GettyImages-2194408827.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-21 00:53:44","author":"Grace Zokovitch","authors":["Grace Zokovitch"],"language":"en","category":"politics","source_country":"us","sentiment":-0.427},{"id":282132746,"title":"Bye-bye Biden: Trump's inaugural executive orders mark major rollback of Biden-era policies","text":"US President Donald Trump, in his first move as the POTUS, on Monday (Jan 20) signed an executive order mandating federal employees to return to the office full-time, effectively ending remote work arrangements. Advertisment The White House confirmed the executive order, stating: \"Heads of all departments and agencies in the executive branch of Government shall, as soon as practicable, take all necessary steps to terminate remote work arrangements and require employees to return to work in-person at their respective duty stations on a full-time basis.\" Also read | Trump to greenlight supply of 2,000-pound bombs to Israel, undo Biden-era sanctions on settlers: Report The return-to-office mandate is part of a broader suite of executive orders Donald Trump signed just after his inauguration ceremony, aimed at reversing policies from the Biden administration. AdvertismentBye bye Biden, hello Trump In what was a highly choreographed event, Trump sat onstage at a desk to sign a pile of executive orders, showcasing each signed document to an applauding audience while an aide narrated the actions. As per reports, foremost among the notable measures was \"rescission of 78 Biden-era executive actions, executive orders, presidential memoranda and others,\" signed by Trump's predecessor. Advertisment Also read | 'Worst administrations in history': Trump to cease Biden's bureaucrats and fire them Regulatory and hiring freeze Trump also imposed a regulatory freeze, barring bureaucrats from issuing new regulations rules until \"full control of this the government and this administration\" is achieved. The newly inaugurated US president also put in place a federal hiring freeze. However, the military and \"a number of other excluded categories,\" till full control is in place. Also read | Trump 'had to tone down' official speech, gave uncensored address post swearing-in Exit from Paris Climate Agreement Marking a major pivot from former President Joe Biden's climate policies, Trump also signed an order withdrawing the US from the Paris Climate Agreement, along with a letter formally notifying the United Nations of the withdrawal. Cost-of-living directive Federal government agencies were tasked with addressing the \"cost of living crisis that has cost Americans so dearly.\" Free speech Trump issued a directive to the federal government ordering \"the restoration of freedom of speech and preventing government censorship of free speech, going forward.\" End to 'weaponisation' of government Trump ordered federal departments to cease actions that he claimed targeted \"political adversaries of the previous administration\". \"Could you imagine Biden doing this? I don\"t think so,\" Trump declared while signing the orders. (With inputs from agencies)","summary":"US President Donald Trump, in his first move as the POTUS, on Monday (Jan 20) signed an executive order mandating federal employees to return to the office full-time, effectively ending remote work arrangements. \n\n\nThe White House confirmed the executive order, stating: \"Heads of all departments and agencies in the executive branch of Government shall, as soon as practicable, take all necessary steps to terminate remote work arrangements and require employees to return to work in-person at their respective duty stations on a full-time basis.\"  \n\n\nAlso read | Trump to greenlight supply of 2,000-pound bombs to Israel, undo Biden-era sanctions on settlers: Report\n\n\nThe return-to-office mandate is part of a broader suite of executive orders Donald Trump signed just after his inauguration ceremony, aimed at reversing policies from the Biden administration. \n\n\nBye bye Biden, hello Trump\nIn what was a highly choreographed event, Trump sat onstage at a desk to sign a pile of executive orders, showcasing each signed d","url":"https://www.wionews.com/world/trumps-first-executive-orders-orders-major-rollback-of-biden-era-policies-exit-from-paris-climate-agreement-and-more-8639056","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/01/21/ZEjvkDiWe4wqa3ONsSgQ.png","video":null,"publish_date":"2025-01-21 00:53:10","author":"Moohita Kaur Garg","authors":["Moohita Kaur Garg"],"language":"en","category":"politics","source_country":"in","sentiment":0.097},{"id":282134490,"title":"Meet Kai Trump, the president's eldest grandchild who calls him 'an inspiration'","text":"Kai Madison Trump, 17, is Donald Trump's eldest grandchild. She attended the presidential inauguration and was mentioned by Trump during his address at Capital One Arena.In her first public appearance at the Republican National Convention in July, Trump spoke about her relationship with her grandfather.\"To me, he's just a normal grandpa,\" she said. \"He gives us candy and soda when our parents aren't looking. He always wants to know how we're doing in school.\"\"A lot of people have put my grandpa through hell and he's still standing,\" she continued. \"Grandpa, you are such an inspiration and I love you. The media makes my grandpa seem like a different person, but I know him for who he is.\"Here's what you need to know about Kai Trump, the president's eldest grandchild.","summary":"Kai Trump is President Donald Trump's granddaughter. She spoke at the Republican National Convention and called Trump \"a normal grandpa.\"","url":"https://www.businessinsider.com/kai-trump-age-parents-rnc-trump-granddaughter-donald-trump-jr-2025-1","image":"https://i.insider.com/678eda5f2fcded5e9073ea9d?width=1200&format=jpeg","video":null,"publish_date":"2025-01-21 00:51:20","author":"Erin McDowell","authors":["Erin McDowell"],"language":"en","category":"politics","source_country":"us","sentiment":0.251},{"id":282132710,"title":"Trump govt will foster global peace, stability – Okei-Odumakin","text":"The President, Centre For Change, Dr Joe Okei-Odumakin, has said United States President Donald Trump will restore stability in troubled global regions by curbing terrorist groups’ activities and reining in their sponsors.\n\nOdumakin made this known in a Monday statement titled, “America’s Baton Change and the World,” obtained by The PUNCH.\n\nShe stated that as the international community applauded former President Joe Biden’s diplomacy in the Middle East, Trump’s emergence had equally sent positive signals.\n\nThe human rights activist said, “As the international community applauds Biden’s diplomacy in the region, President Donald Trump’s ascendancy has equally sent positive signals which would definitely expand the peace process in the troubled region.\n\n“In addition to that, it is anticipated that Trump’s administration would restore stability in the region by curtailing the activities of terrorist groups and their sponsors.\n\n“Ongoing negotiations with Iran over its nuclear programme are expected to produce a deal acceptable to the global community.”\n\nShe also stated that Trump’s controversial position on immigration may not be as harsh as it has been perceived in Africa and other parts of the developing world.\n\nOdumakin noted that the US President’s insistence on shutting the borders against illegal immigrants could hardly be faulted. “No serious government anywhere can condone illegal immigration and thereby compromise its national security,” she said.\n\nOn global economy, she suggested that Trump’s pre-pandemic tax cuts, which strengthened the American economy should be re-enacted to benefit the greatest number of ordinary citizens.\n\nTrump was in 2017 elected as the 45th President of the US in his first tenure, but lost his re-election bid to Biden in 2020.\n\nTrump won the 2024 presidential elections four years after, and was sworn in as the 47th President for a second term on Monday.\n\nOdumakin commended former President Joe Biden’s administration for its efforts to promote peace in the Middle East, particularly the ceasefire between Israel and Hamas.\n\nShe said Biden’s legacy included the Israel-Hamas peace deal, which she said was similar to former President Jimmy Carter’s brokered historic Camp David Accord between Israel and Egypt.","summary":"The President, Centre For Change, Dr Joe Okei-Odumakin, has said United States President Donald Trump will restore stability in troubled global regions by curbing terrorist groups’ activities and reining in their sponsors. Odumakin made this known in a Monday statement titled, “America’s Baton Change and the World,” obtained by The PUNCH. She stated that as \n\n\n \n Read More","url":"https://punchng.com/trump-govt-will-foster-global-peace-stability-okei-odumakin/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/20190206/TT.jpg","video":null,"publish_date":"2025-01-21 00:49:05","author":"Gbenga Oloniniran","authors":["Gbenga Oloniniran"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.102},{"id":282132852,"title":"Donald Trump closes ‘victory rally’ by dancing to Village People’s ‘YMCA’ – National","text":"President-elect Donald Trump danced alongside 1970s hitmakers Village People at a rally held in Washington the day before his inauguration.\n\nHis well-known “Trump dance” began trending online almost immediately, carrying over into Monday morning, the day he’s set to become the 47th president of the United States.\n\nTrump brought the group on stage to close out his campaign-style “MAGA Victory Rally” at Capital One Arena on Sunday.\n\nHe danced alongside the group, clapping his hands, pumping his fists and swaying to the to their classic hit Y.M.C.A., alongside members James Kwong, Javier Perez, James Lee, J.J. Lippold, Nicholas Manelick and Victor Willis.\n\nAmerican disco group the Village People made a name for themselves in the late-70s for their chant-along dance-pop hits and their colourful on-stage personas. Their best known hit, Y.M.C.A. — widely considered a gay anthem — has became a staple of Trump’s rallies in the last election, along with their hit Macho Man.\n\nDuring his 2024 campaign run, Trump completed over 110 rallies and would use Y.M.C.A. at each rally as he exited the stage. But first, he always danced for the crowd. He usually started with the arms, clenched fists pumping back and forth, then followed by some clapping and waving.\n\nThe Village People’s support of Trump first came as a surprise after they sent a cease-and-desist letter to the his team in 2023 after he played Macho Man at a Mar-a-Lago event.\n\nThe program for Trump’s inauguration festivities and the Victory Rally were released on Jan. 13. Village People member Willis responded to the backlash they received to their inclusion in the festivities with an official statement on the group’s Facebook page.\n\n“We know this won’t make some of you happy to hear however we believe that music is to be performed without regard to politics,” the band said in a post on its Facebook page after it was announced that they were set to perform at one of Trump’s inaugural balls and a rally.\n\n“Our song Y.M.C.A. is a global anthem that hopefully helps bring the country together after a tumultuous and divided campaign where our preferred candidate lost. Therefore, we believe it’s now time to bring the country together with music which is why VILLAGE PEOPLE will be performing at various events as part of the 2025 Inauguration of Donald J. Trump,” the band wrote.\n\nCloser to the date of the rally, the group posted another statement on their Facebook page addressing why they were performing at various Trump inaugural activities.\n\n“First of all, our performances are not an endorsement of the President Elect’s policies no matter what you say to the contrary. Having said that, we do support that we have a new president now and we should all wish him well until he gives us a reason not to. But let’s give him a chance and see what he’s going to do,” the band said.\n\n“President Obama, Clinton and Bush will all attend the inauguration and so will President Biden, and Vice President Harris. So will Mark Zuckerberg (Facebook), Jeff Bezos (Washington Post, etc.) and on and on. Are you condemning any of them? Or is it only recording artists that you believe that should not attend or perform, and that our talents should only be preserved for Democrats?” they asked.\n\nThe group continued: “Well, one man has done a lot for Village people lately. His name is Donald J. Trump. He has brought a lot of joy to the American people with his use of Y.M.C.A. And you want Village People to push all that aside and not perform at his inauguration? NEGATIVE!”\n\n“We’re doing the right thing by performing and keeping political views out of this. So, please stop pushing your political views onto Village People,” the concluded.\n\nThe Village People weren’t the only people that performed at Trump’s MAGA style rally Sunday as Kid Rock, Billy Ray Cyrus and Lee Greenwood also took the stage. Those performing at inaugural balls include country star Carrie Underwood, rapper Nelly, country music band Rascal Flatts, country singer Jason Aldean and singer-songwriter Gavin DeGraw.\n\n— With files from The Associated Press","summary":"President-elect Donald Trump danced alongside 1970s hitmakers Village People at a rally held in Washington the day before his inauguration. His well-known “Trump dance” began trending online almost immediately, carrying over into Monday morning, the day he’s set to become the 47th president of the United States. Trump brought the group on stage to close [&#8230;]\n\n\nThe post Donald Trump closes ‘victory rally’ by dancing to Village People’s ‘YMCA’ &#8211; National appeared first on Ghana Latest News.","url":"https://ghananewss.com/donald-trump-closes-victory-rally-by-dancing-to-village-peoples-ymca-national/","image":"https://d21y75miwcfqoq.cloudfront.net/70c8fc80","video":null,"publish_date":"2025-01-21 00:46:38","author":"Ghana News,Los Angeles","authors":["Ghana News","Los Angeles"],"language":"en","category":"politics","source_country":"gh","sentiment":0.413},{"id":282131754,"title":"'Please let us in': Trump crackdown leaves migrants in tears","text":"As President Donald Trump returns to the White House, he has reiterated his commitment to a sweeping immigration crackdown aimed at reducing the number of migrants entering the United States, a key part of his broader agenda to strengthen national security.Margelis Tinoco, a 48-year-old Colombian, was in tears after her asylum appointment was canceled due to the new policies. She had made the long and perilous journey from South America with her husband and son.\"I don't know what will become of my life anymore,\" Tinoco said, expressing the uncertainty that many migrants now face under the new administration’s tougher stance on immigration.Trump began his second term with a series of orders targeting the U.S. immigration system. He vowed to declare a national emergency at the U.S.-Mexico border, immediately halt \"all illegal entry,\" and initiate the deportation of \"millions and millions of criminal aliens.\"Minutes after he was sworn in, an app created by his predecessor, Joe Biden, to streamline U.S. immigration processes went offline. Tinoco showed reporters the message on her phone informing her that existing asylum appointments had been canceled.\"Look what it says,\" Tinoco said, her voice breaking. \"Have compassion and let us cross,\" she pleaded, recounting her “six months of suffering” after leaving Venezuela, where she had been living with her family.Yaime Perez, a 27-year-old Cuban, also voiced her distress. “Since we are here, please let us in, please, after all the work we have put in to get here, let us enter your country, so that we can better ourselves in life and be somebody,” she said.Antony Herrera, a 31-year-old Venezuelan, arrived with his wife and three children only to find their appointment canceled as well. “We don’t know what is going to happen,” Herrera said, noting that he and millions of others had fled crisis-stricken Venezuela, where President Nicolás Maduro was inaugurated for a third term earlier this month after a disputed election.Caravan Heads for BorderDuring his first term, Trump exerted heavy pressure on Mexico to curb migration from Central America. On Monday, he reinstated the \"Remain in Mexico\" policy, which had been in place during his first administration. Under that rule, migrants seeking asylum at the U.S.-Mexico border must remain in Mexico until their cases are adjudicated.It is unclear whether Mexico will continue to accept deported migrants from other countries, as it did under Trump’s first term, in exchange for the president’s withdrawal of tariff threats. Mexico's president, Claudia Sheinbaum, confirmed on Monday that her country would accept its own deported nationals but did not address how it would handle other foreign nationals expelled from the U.S.Sheinbaum also extended her congratulations to Trump, calling for “dialogue, respect, and cooperation” between the two countries.In southern Mexico, hundreds of U.S.-bound migrants ignored Trump’s warnings and set off on foot from near the border with Guatemala. The caravans are a tactic used by migrants to pressure Mexican authorities into granting them transit permits.\"I’m a little scared because with everything we’ve been through, everything we’ve fought for, with all the sacrifices we’ve made, it’s very hard to have the doors closed on us and not be able to cross,\" said Jefferzon Celedon, a 24-year-old Venezuelan.Despite the uncertainty, fellow Venezuelan Leonel Delgado, 42, expressed determination. \"We have to keep going and not be swayed by what people say, whether they close it or not. We will see when we arrive,\" he said.","summary":"","url":"https://tribune.net.ph/2025/01/21/please-let-us-in-trump-crackdown-leaves-migrants-in-tears","image":"https://media.assettype.com/tribune/2025-01-20/j59xtn37/00036UW2H2.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-01-21 00:44:44","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":-0.192},{"id":282130912,"title":"President Trump Shouts Out Capitals' Alex Ovechkin During Inauguration Ceremonies","text":"The Washington Capitals' blast into elite status has also garnered honors from The White House.President Donald Trump gave a nod to the Capitals and future Hall of Fame forward Alex Ovechkin during a rally following his inauguration back into power during a rally at Capital One Arena, the home of the Capitals, on Monday.\"I wanna thank the owners of this arena, they are great,\" Trump said.\" They are up here someplace in one of those beautiful boxes. Their team is doing very well and Ovechkin is a great player, right?\"The filled house gave applause in response to his mention of the Capitals, who are currently leading the NHL in points while Ovechkin chases the all-time goals record.","summary":"The 47th President of the United States gave a nod to the Capitals and Alex Ovechkin during his inauguration Monday.","url":"https://www.newsweek.com/sports/president-trump-shouts-out-capitals-alex-ovechkin-during-inauguration-ceremonies-2018024","image":"https://d.newsweek.com/en/full/2569256/alex-ovechkin.jpg","video":null,"publish_date":"2025-01-21 00:40:10","author":"Sean Treppedi","authors":["Sean Treppedi"],"language":"en","category":"politics","source_country":"US","sentiment":0.631},{"id":282129954,"title":"Labour are urged to curb spending on disability benefits - as minister admits the UK is 'long overdue a realistic appraisal of how we are using taxpayers' money'","text":"Britain's spending on health-related benefits could reach £100billion by 2030 - approaching double the nation’s current outgoings on defence.\n\nSpending on incapacity and disability benefits has risen by 40 per cent in real terms since 2013 to £64.7billion - a fifth more than the £53.9billion spent on defence last year.\n\nIn a scathing House of Lords report, peers warned that this figure is set to rise to £100.7billion by 2030 - equivalent to three per cent of GDP. Defence spending currently sits at 2.29 per cent of GDP, £64.4 billion, with the Prime Minister resisting calls to increase the proportion to 2.5.\n\nMinisters were told they must ensure radical reforms to the ‘financially unsustainable’ welfare system are the government’s ‘top priority’.\n\nToday Chief Secretary to the Treasury Darren Jones will lay out new laws to crack down on benefit fraud and recover money from the bank accounts of benefits cheats refusing to pay up.\n\nHe will also admit that the UK is ‘long overdue a reckoning with government spending, and a realistic appraisal of how we are using taxpayers’ money..’ This Labour government, he will say, will ‘focus on driving efficiency and value for money extends to our approach to welfare'.\n\nAround 3.7 million working-age people receive health-related benefits, 1.2 million more than before the pandemic.\n\nLord Bridges of Headley, Chair of the Economic Affairs Committee, said in the Lord’s report: ‘The health benefits system is financially unsustainable, wastes human potential and - in the words of the Employment Minister - “does not work for anybody”.\n\n‘Urgent action is needed to reform both the unemployment and health-related benefits system, and how they interact.\n\n‘Without a clear plan of action, growing welfare spending will remain a significant challenge for the forthcoming Spending Review.’\n\nMinisters have pledged to crack down on Britain’s welfare bill to ‘deliver savings’ and ensure money can be spent in other areas.\n\nWork and Pensions Secretary Liz Kendall is expected to submit a Green Paper on her reforms in March, which will then be consulted on before concrete proposals are made.\n\nLast week Sir Keir Starmer vowed to be ‘ruthless with cuts’ if needed, though some Labour MPs are concerned that ministers may go too far.\n\nThe report came amid suggestions that Labour’s Strategic Defence Review could now be delayed until autumn, despite initial plans for it to be ready by the first half of 2025.\n\nThe Prime Minister has pledged to eventually increase the UK’s defence spending to 2.5 per cent of GDP amid threats from Russia and China, but will not put an ‘arbitrary date’ on when that will be achieved.\n\nHe is likely to face renewed calls to speed up the process as US President Donald Trump, who has called for NATO member nations to spend five per cent of GDP on defence, enters the White House.","summary":"Spending on incapacity and disability benefits has risen by 40 per cent in real terms since 2013 to £64.7billion - a fifth more than the £53.9billion spent on defence last year.","url":"https://www.dailymail.co.uk/news/article-14306467/labour-curb-spending-disability-benefits-minister.html","image":"https://i.dailymail.co.uk/1s/2025/01/20/22/94322055-0-image-m-93_1737411526253.jpg","video":null,"publish_date":"2025-01-21 00:37:40","author":"Editor,Kumail Jaffer","authors":["Editor","Kumail Jaffer"],"language":"en","source_country":"gb","sentiment":-0.096},{"id":282133964,"title":"Donald Trump’s First Orders of Business: Immigration, Gender, Drilling, and J6 Pardons","text":"Joined by his and Vice President JD Vance’s families on the Capital One Arena stage, Trump assured convicted January 6 rioters, who he refers to as “hostages,” that he would sign pardons for them later that evening. The president is expected to continue signing executive orders Monday night and in the coming days targeting immigration, transgender people’s rights, and diversity, equity, and inclusion (DEI) measures.\nWhen signing the executive orders on stage, Trump pulled down the mic and said: “Could you imagine Biden doing this? I don’t think so!” Trump’s choice of having this initial signing ceremony in a sports arena rather than, say, the Oval Office, reflects the theatrical flair he has cultivated in politics since his infamous escalator ride nearly a decade ago. The gathering resembled a political rally, with MAGA icons like billionaire Elon Musk taking the stage ahead of Trump, who ran through familiar grievances and grudges with perceived enemies.\n“Did everybody hear my speech?” Trump asked the arena crowd. Did you like my speech?” They cheered.\nHours earlier, standing in the United States Capitol rotunda, a just-sworn in Trump detailed what his first moves as president would be. From a blunt crackdown on immigration to a regressive understanding of gender, Trump outlined a conservative reshaping of American life—one that could pose particular harm to undocumented immigrants, transgender people, and women.\nDuring that inaugural address, Trump pledged to declare a national emergency at the Southern border, announced he would designate cartels as terrorist groups, and rename the Gulf of Mexico to the Gulf of America. As for his energy policy, Trump vowed to “drill baby drill.” The president also claimed he would bring free speech, as he defines it, back to the US; spoke of putting an American flag on Mars; promised to take dominion over the Panama Canal; and exclaimed that the US would only recognize two genders. The president also, after railing against his political enemies and demonizing immigrants, said he hopes he is remembered as a “peacemaker” and a “unifier.”\nWhile Trump’s supporters in attendance roared with applause, former presidents Joe Biden, Barack Obama, Bill Clinton, and George Bush, however, sat sternly. Kamala Harris, Douglas Emhoff, Jill Biden, Laura Bush, and Hillary Clinton also sat behind the new president, rarely clapping. (They all stood and clapped when Trump spoke of hostages being released following the recent ceasefire agreement between Israel and Hamas.)\nHere’s some of what his administration has already enacted and what they plan to do in the days to come:\nImmigration\nMinutes after Trump took office, his administration shut down the Customs and Border Protection mobile app CBP One, which aids migrants in making appointments at the US-Mexico border. In doing so, they canceled all outstanding appointments made by migrants without visas hoping to enter legally.\nTrump is expected to sign orders declaring a national emergency at the border, bolstering the military's role in border security; ending “catch and release” and “remain in Mexico”; designating criminal cartels as terrorists; suspending refugee resettlement; ending asylum and closing the border to those without legal status; ending birthright citizenship; toughening the screening and vetting of immigrants; giving more power to ICE and CBP; and restoring the death penalty for those who murder law enforcement officers and for undocumented immigrants who commit capital crimes.\nEnergy and Inflation\nThe president is likely to sign an executive order declaring a national energy emergency that allows for less regulations around coal and natural-resource production. The order will halt what Trump officials call the “electric vehicle mandate”—a goal set by the Biden administration to promote EV usage. He also put forth an order changing the name of Alaska’s Denali, the tallest mountain in North America, back to Mount McKinley. It was renamed in 2015 by Obama at the request of native Alaskan tribes and politicians. On stage, Trump signed an order to address the “cost of living crisis,” but it's unclear what that entails.\nGender, Sexuality, and Race\nA government health website, reproductiverights.gov, that offered birth control and emergency abortion guidance appears to have been disabled after Trump took office, according to reporting from the Associated Press. It was launched after the Supreme Court overturned Roe v. Wade, the landmark decision that protected national access to abortion.\nTrump is also expected to sign executive orders making it the policy of the US to recognize only two genders, male and female, requiring government agencies to use an outdated and scientifically inaccurate gender binary on documents like passports, visas, and employee records, in addition to an order ending diversity, equity and inclusion programs in the federal government, including diversity training.","summary":"In an arena filled with raucous supporters, the 47th president signed a slew of executive orders, aired grievances, and vowed to issue pardons for convicted January 6 rioters.","url":"https://www.vanityfair.com/news/story/donald-trumps-first-orders-of-business-immigration-gender-drilling-and-j6-pardons","image":"https://media.vanityfair.com/photos/678eeafe6e036b92b96dd875/16:9/w_5744,h_3231,c_limit/vf125-signing.jpg","video":null,"publish_date":"2025-01-21 00:37:35","author":"Katie Herchenroeder","authors":["Katie Herchenroeder"],"language":"en","category":"politics","source_country":"US","sentiment":0.094},{"id":282129950,"title":"Inauguration day 2025 in memes: Most hilarious moments from Trump's swearing in","text":"Inauguration day 2025 in memes: Most hilarious moments from Trump's swearing in\n\nLISTEN: Welcome to MAGAland, our podcast on the latest inside the White House\n\nBy JAMES GORDON FOR DAILYMAIL.COM\n\nPublished: 00:14 GMT, 21 January 2025 | Updated: 00:36 GMT, 21 January 2025\n\nDonald Trump’s inauguration for his second term as President of the United States has ignited a wildfire of memes and online humor that range from biting satire to downright absurdity. \n\nWith the world watching, the internet did what it does best and turned one of the most pivotal political events into a treasure trove of digital comedy. \n\nEven before Trump raised his hand to take the oath, memes began to flood social media platforms across X, Instagram and the recently revived TikTok. \n\nThe scale and creativity surrounding Trump’s inauguration highlighted the internet’s unparalleled ability to turn even the most serious of occasions into viral entertainment.\n\nThe hat worn by First Lady Melania Trump inside the U.S. Capitol drew particular attention. \n\nThe accessory seemed to cast a shadow over the top half of her face leading to a host of memes comparing her to cartoon characters - and even the McDonald’s villain, the Hamburglar.\n\nOthers poked fun at the last minute venue change that saw the ceremony moved from the steps of the Capitol to inside the warmth of the Capitol rotunda in anticipation of the freezing cold conditions.\n\nNo matter the location, one meme noted how Democratic Senator Bernie Sanders appeared to adopt the same pose while sitting in his chair as Barack Obama's inauguration in 2009.\n\nThe internet wasted no time in comparing Melania Trump's outfit to the Hamburglar\n\nInternet users thought the kiss that wasn't between Trump and Melania was most amusing\n\nOne X user sought it fit to portray him as a Looney Tunes character with their signature 'That's all Folks!' sign off\n\nThe comparisons between Melania Trump's hat and the Hamburglar could not be denied\n\nSenator John Fetterman was also mocked for showing up in his signature hoodie and shorts, despite the subzero weather outside.\n\nOne meme poked fun at Trump's ambitions to take over Canada or buy Greenland - notoriously cold destinations - while simultaneously holding his inauguration indoors due to the cold Washington D.C. weather. \n\nOthers shared sympathies for the hardworking staff who set up chairs and equipment outdoors only for the venue to be changed.\n\nElon Musk's animated mannerisms drew attention throughout much of the ceremony - particularly when President Trump spoke of America's ambitions to travel to Mars. \n\nOne source of amusement was found comparing Musk's wide grin next to the dour appearance of Trump's youngest son, Barron, who looked particularly gloomy at one point. \n\nOthers mocked Kamala Harris for her failed campaign, noting that Trump managed to secure victory with a rented garbage truck against the Vice President's $2million event alongside Oprah. \n\nAs the day’s events fade into history, the memes will undoubtedly live on, immortalizing Trump’s second inauguration in the collective memory of the internet.\n\nKamala Harris' campaign allegedly paid $2million for an event involving Oprah yet lost, while the Trump team rented a garbage truck and won\n\nPlenty of memes poked at the chilly weather and the sudden change of venue\n\nOthers thought the first lady's outfit to be reminiscent of a Spy vs Spy cartoon strip\n\nThe fast food theme continued on on X with the shape of the Pizza Hut logo drawing comparisons\n\nAny cartoon character with a striped hat was ripe for comparison with Melania's\n\nEven way Melania wore the hat drew comparisons to superthief Carmen Sandiego\n\nOne user joked how Melania would have seen very little of anything thanks to her wide brim\n\nThere were some interesting comparisons to how things were in 2016 to today\n\nSpare a thought for the outdoor organizers whose work counted for nothing\n\nBernie Sanders appeared to replicate his famous pose from 2021's inauguration \n\nElon Musk's mannerisms drew much attention as he appeared to be animated throughout much of the ceremony. Baron Trump looked dour by comparison\n\nHillary Clinton appeared relaxed throughout making some amusing facial expressions\n\nJohn Fetterman made zero effort to dress for the occasion in his signature hoodie and shorts\n\nPresident George W. Bush's facial expressions drew much amusement during the ceremony\n\nLauren Sanchez's cleavage caught the attention of Facebook founder Mark Zuckerberg \n\nThere were so many comments mocking the interaction between Donald Trump and his wife\n\nThe non-kiss between Melania and Trump was an easy one for memes to mock\n\nMany memes appeared mere seconds after the non-kiss taking place\n\nTrump made good on his word that 'now the work begins' as he immediately started signing executive orders when took the stage at his inaugural parade in Washington.\n\n'You are now witnessing the dawn of the golden age of America,' he declared to great applause.\n\nTrump turned his rally at a downtown Washington arena into a signing ceremony for executive actions that his new administration is taking to institute major policy changes.\n\nInstagramTikTokDonald TrumpMelania Trump\n\nShare or comment on this article:\nInauguration day 2025 in memes: Most hilarious moments from Trump's swearing in\n\nAdd comment","summary":"Donald Trump's second inauguration sparked a storm of memes, transforming the political spectacle into an internet comedy goldmine.","url":"https://www.dailymail.co.uk/news/article-14306459/Inauguration-day-2025-memes-hilarious-moments-Trumps-swearing-in.html","image":"https://i.dailymail.co.uk/1s/2025/01/21/00/94325103-0-image-m-36_1737417842298.jpg","video":null,"publish_date":"2025-01-21 00:36:25","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","category":"politics","source_country":"gb","sentiment":0.097},{"id":282132830,"title":"Can he do that? Lawyers and lawmakers debate if Trump has authority to suspend the US TikTok ban","text":"By SALLY HO\n\nOn the eve of his inauguration, President Donald Trump said an executive order suspending a nationwide ban on TikTok would be among his first official acts. The social media platform and app’s ardent users waited Monday evening to learn if he would follow through and if so, what the order might say.\n\nThe platform went offline before the ban approved by Congress and upheld by the U.S. Supreme Court took effect on Sunday. After Trump promised to pause the ban on Monday, TikTok restored access for existing users. Google and Apple, however, still have not reinstated TikTok to their app stores.\n\nBusiness leaders, lawmakers, legal scholars, and influencers who make money on TikTok are watching to see how Trump tries to resolve a thicket of regulatory, legal, financial and geopolitical issues with his signature.\n\nHow did the TikTok ban come about?\n\nTikTok’s app allows users to create and watch short-form videos, and broke new ground by operating with an algorithm that fed viewers recommendations based on their viewing habits. But concerns about its potential to serve as a tool for Beijing to manipulate and spy on Americans pre-date Trump’s first presidency.\n\nIn 2020, Trump issued executive orders banning dealings with ByteDance, TikTok’s China-based parent company, and the owners of the Chinese messaging app WeChat. Courts ended up blocking the orders, but less than a year ago Congress overwhelmingly passed a law citing national security concerns to ban TikTok unless ByteDance sold it to an approved buyer.\n\nThe law, which went into force Sunday, allows for fines of up to $5,000 per U.S. TikTok user against major mobile app stores — like the ones operated by Apple and Google — and internet hosting services like Oracle if they continued to distribute TikTok to U.S. users beyond the deadline for ByteDance’s divestment.\n\nTrump on Sunday said he had asked TikTok’s U.S. service providers to continue supporting the platform and app while he prepared to sign an executive order to stop the ban for now.\n\n“The order will also confirm that there will be no liability for any company that helped keep TikTok from going dark before my order,” Trump posted on Truth Social, his social networking site.\n\nThe law that Congress passed and now-former President Joe Biden signed in April allowed for a 90-day extension if there had been progress toward a sale before the statute’s effective date. Less certain is whether that provision can be applied retroactively, according to Sarah Kreps, director of Cornell University’s Tech Policy Institute.\n\n“Executive orders cannot override existing laws,” Kreps said. “It’s not clear that the new president has that authority to issue the 90-day extension of a law that’s already gone into effect.”\n\nWhat difference might the sale of TikTok make?\n\nKreps also doubts the conditions for a delay exist at this point without so much as even a potential buyer being named to prove that a sale was moving along.\n\nBut Alan Rozenshtein, a University of Minnesota law professor, has written that the law also empowers the president to decide what constitutes a “qualified divestiture” — suggesting Trump could have discretion to say whether or when ByteDance meets the terms of the Protecting Americans from Foreign Adversary Controlled Applications Act.\n\nAlthough ByteDance spent months repeating it wasn’t interested in selling, Beijing on Monday also signaled a possible easing on China’s stance on TikTok to allow it to be divested from its Chinese parent company. China’s vice president held meetings with Vice President JD Vance and Tesla tech titan Elon Musk on Sunday.\n\nChinese Foreign Ministry spokeswoman Mao Ning, said Monday that business operations and acquisitions “should be independently decided by companies in accordance with market principles.”\n\n“If it involves Chinese companies, China’s laws and regulations should be observed,” Mao said.\n\nUntil now, it was widely believed that Beijing would not allow the sale of TikTok, which had come to embody China’s defiance in the face of “U.S. robbery.” However, TikTok was among several issues brought up in a phone call between Chinese President Xi Jinping and Trump on Friday, though details were not available.\n\nTrump later announced plans to delay the TikTok ban and suggested a joint venture in which the U.S. would get a 50% ownership of the app. Shou Zi Chew, TikTok’s CEO, attended Trump’s inauguration, seated with American tech heavyweights.\n\nWho or what can enforce the ban?\n\nThe Justice Department is generally tasked with enforcing the laws of the federal government, so it’s possible that Trump will direct the DOJ to ignore the law. Such a move might itself be subject to legal scrutiny but would buy time for TikTok.\n\nTrump’s efforts to save TikTok may put him at odds with some of the House members and senators who voted for the law, which received broad bipartisan support. House Speaker Mike Johnson called ByteDance’s ownership “a very dangerous thing,” and said he expected a full sale to happen.\n\n“I think we will enforce the law,” Johnson told NBC News’ “Meet the Press” on Sunday.\n\nLegislators now stand to “look a little bit silly” if the ban doesn’t last, Kreps said.\n\n“(The case) becomes about the separations of powers, and checks and balances, that we don’t have a king who decides what happens with the law,” Kreps said. “Enforcement isn’t only up to the executive branch.”\n\nWhat are other potential legal obstacles?\n\nSen. Tom Cotton of Arkansas, in a message posted on X, listed a number of state and federal agencies, and private entities, that might be willing to go to court to get the ban enforced.\n\n“Any company that hosts, distributes, services, or otherwise facilitates communist-controlled TikTok could face hundreds of billions of dollars of ruinous liability under the law, not just from DOJ, but also under securities law, shareholder lawsuits, and state AGs,” Cotton noted.\n\nDespite the intense scrutiny and potential costs involved, the machinations over TikTok are in some ways just business as usual for the tech companies involved, according to Gus Hurwitz, a legal scholar with the International Center for Law and Economics.\n\n“The fines that we’re talking about are civil penalties and companies risk civil penalties all the time,” Hurwitz said.\n\nStill, the hard business calculus of complying with a law in limbo or risk defying a president who holds lucrative federal contracts over those companies could come into focus if shareholders sue.\n\nOracle, for example, has a part of the Pentagon’s $9 billion contract to build its cloud computing network.\n\n“This actually could be the right business decision to make,” Hurwitz said. “That’s not necessarily a breach of duty to shareholders.”\n\nWhich companies are deciding whether to trust Trump’s assurances?\n\nThere’s been lots of questions about how companies such as Oracle and Akamai Technologies are powering TikTok’s servers to stay online, while others such as Apple and Google have made the app unavailable for new users to download.\n\nNone of the companies have responded to requests for comment.\n\nOracle in 2020 announced it had a 12.5% stake in TikTok Global after securing its business as the app’s cloud technology provider.\n\nMeanwhile, as of Monday night, a search for TikTok on Apple’s app store directs to an online statement that reads in part: “Apple is obligated to follow the laws in the jurisdictions where it operates,” while Google’s app store notes downloads for TikTok “are paused due to current US legal requirements.”\n\nHo reported from Seattle. Maya Sweedler and Didi Tang in Washington contributed reporting.","summary":"Business leaders, lawmakers, legal scholars, and influencers who make money on TikTok are watching to see how Trump tries to resolve a thicket of regulatory, legal, financial and geopolitical issues with his signature.","url":"https://www.bostonherald.com/2025/01/20/can-trump-suspend-tiktok-ban/","image":"https://www.bostonherald.com/wp-content/uploads/2025/01/APTOPIX_Trump_Inauguration_66050_66bc97.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-21 00:35:03","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.538},{"id":282133100,"title":"Donald Trump inauguration day: Senate moves swiftly to confirm Marco Rubio as US secretary of state","text":"The US Senate has quickly confirmed Marco Rubio as secretary of state, voting unanimously to give President Donald Trump the first member of his new Cabinet on Inauguration Day.\n\nRubio, the Republican senator from Florida, is among the least controversial of Trump’s nominees and vote was decisive, 99-0 on Monday.\n\nAnother pick, John Ratcliffe for CIA director, is also expected to have a swift vote. Action on others, including former combat veteran and Fox News host Pete Hegseth for defence secretary, is expected later in the week.\n\n“Marco Rubio is a very intelligent man with a remarkable understanding of American foreign policy,” Senator Chuck Grassley of Iowa, the senior-most Republican, said as the chamber opened.\n\nIt’s often tradition for the Senate to convene immediately after the ceremonial pomp of the inauguration to begin putting the new president’s team in place, particularly the national security officials.\n\nDuring Trump’s first term, the Senate swiftly confirmed his defence and homeland security secretaries on day one, and President Joe Biden’s choice for director of national intelligence was confirmed on his own Inauguration Day.\n\nWith Trump’s return to the White House, and his Republican Party controlling majorities in Congress, his outsider Cabinet choices are more clearly falling into place, despite initial scepticism and opposition from both sides of the aisle.\n\nSenate Majority Leader John Thune moved quickly Monday, saying he expected voting to begin “imminently” on Trump’s nominees.\n\nDemocrats are holding their opposition for some of Trump’s other picks who have less support, including Tulsi Gabbard for director of national intelligence and vaccine sceptic Robert F Kennedy Jr for health secretary.\n\nSenate Democratic Leader Chuck Schumer said his party will “neither rubber-stamp nominees we feel are grossly unqualified, nor oppose nominees that deserve serious consideration”.\n\nRubio, he said, is an example of “a qualified nominee we think should be confirmed quickly”.\n\nRubio, a well-liked senator and former Trump rival during the 2016 presidential race, has drawn closer to the president in recent years.\n\nAs secretary of state, Rubio would be the nation’s top diplomat, and the first Latino to hold the position. Born in Miami to Cuban immigrants, he has long been involved in foreign affairs, particularly in South America, and has emerged as a hawk on China’s rise.\n\nDuring his confirmation hearing last week, Rubio warned of the consequences of America’s “unbalanced relationship” with China.\n\nWhile he echoes Trump’s anti-globalist rhetoric, Rubio is also seen as an internationalist who understands the power of US involvement on the global stage.\n\nRubio will over from outgoing Secretary of State Antony Blinken, who has said he hopes the Trump administration continues Biden’s policies in the Middle East to end the war in Gaza and to help Ukraine counter Russian nomination.","summary":"The US Senate has unanimously confirmed Marco Rubio as secretary of state, giving Donald Trump the first member of Cabinet in his new administration.","url":"https://thewest.com.au/politics/us-election/donald-trump-inauguration-day-senate-moves-swiftly-to-confirm-marco-rubio-as-us-secretary-of-state-c-17454545","image":"https://images.thewest.com.au/publication/C-17454545/ff71833d9952e46cfe5298926dfdb08c84c82bea-16x9-x0y31w4000h2250.jpg?imwidth=1200","video":null,"publish_date":"2025-01-21 00:33:55","author":"Lisa Mascaro,Lisa Mascaroaptu","authors":["Lisa Mascaro","Lisa Mascaroaptu"],"language":"en","category":"politics","source_country":"au","sentiment":0.358},{"id":282129796,"title":"Trump signs executive order withdrawing US from Paris Climate Agreement again","text":"WASHINGTON, January 21. /TASS/. US President Donald Trump has once again signed a decree on the country's withdrawal from the Paris Climate Agreement.\n\nTrump did this in the presence of his supporters at the Capital One sports and concert complex in Washington.\n\nTrump has repeatedly expressed doubts about the scientific validity of the concept of global warming. In 2017, he withdrew the United States from the Paris Climate Agreement. By November 2020, the country had completed the process of withdrawing from the agreement, but in January 2021, then-US President Joe Biden signed an executive order returning Washington to the Paris Agreement.\n\nThe Paris Climate Agreement was signed in December 2015, with 195 countries signing on. Under its terms, participating countries pledged to voluntarily reduce carbon dioxide emissions in the coming decades in order to limit the increase in average annual temperature to 1.5 or 2 degrees Celsius above pre-industrial levels of global economic development.","summary":"US president did this in the presence of his supporters at the Capital One sports and concert complex in Washington","url":"https://tass.com/world/1901943","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-21 00:33:30","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.175},{"id":282130096,"title":"MTG angrily cuts in line at inauguration — insisting she 'supports President Trump the most'","text":"Far-right Rep. Marjorie Taylor Greene (R-Georgia) was among the many members of Congress who waited in line at the Capitol Rotunda to attend President Donald Trump's second inauguration. But the far-right MAGA congressman, according to the Daily Beast, grew impatient and insisted on cutting in front of others in the line — arguing that she deserved to go ahead of them because she was more pro-Trump.\n\nLawmakers were placed in line based on their seniority — that is, how long they have been serving in Congress. Greene was first elected to Congress in 2020, entered the U.S. House of Representatives in January 2021, and won a third two-year term in 2024.\n\nBut Greene disliked that seniority system and said she refused to abide by it.\n\nREAD MORE: Trump expected to target citizenship of children with undocumented parents\n\nDuring an appearance on Real America's Voice, she recalled, \"I said, 'This is ridiculous. We need to be lining up by who supports President Trump the most.' I said, 'That's me.'\"\n\nGreene, the Daily Beast reports, \"apparently stormed to the front of the line,\" where she said she saw Rep. Marcy Kaptur (D-Ohio). Now 78, Kaptur has been serving in the U.S. House since January 1983 — and she was at the front of the line based on seniority.\n\nBut Greene, on \"Real America's Voice,\" said she told the veteran congresswoman, \"Look, you voted to impeach President Trump, so I'm going in front of you.\"\n\nGreene added that \"every single one of those Democrats\" didn't deserve to attend the inauguration.\n\nREAD MORE: Biden preemptively pardons members of January 6 panel and other Trump targets","summary":"Far-right Rep. Marjorie Taylor Greene (R-Georgia) was among the many members of Congress who waited in line at the Capitol Rotunda to attend President Donald Trump's second inauguration. But the far-right MAGA congressman, according to the Daily Beast, grew impatient and insisted on cutting in front of others in the line — arguing that she deserved to go ahead of them because she was more pro-Trump.\n\nLawmakers were placed in line based on their seniority — that is, how long they have been serving in Congress. Greene was first elected to Congress in 2020, entered the U.S. House of Representatives in January 2021, and won a third two-year term in 2024.\n\nBut Greene disliked that seniority system and said she refused to abide by it.\n\nREAD MORE: Trump expected to target citizenship of children with undocumented parents\n\nDuring an appearance on Real America's Voice, she recalled, \"I said, 'This is ridiculous. We need to be lining up by who supports President Trump the most.' I said, 'That's me.'\"\n\nGreene, the Daily","url":"https://www.alternet.org/mtg-trump-inauguration/","image":"https://www.alternet.org/media-library/image.jpg?id=55704420&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-01-21 00:32:39","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.353},{"id":282131764,"title":"Trump vows new US 'golden age' following White House return","text":"Donald Trump vowed to usher in a new \"golden age\" as he took the oath for a historic second US presidential term on Monday. He painted a picture of an America in decline, claiming that only his hardline policies could restore the nation to its former glory.In an often divisive address at the US Capitol, the 47th president promised a flurry of executive orders, including declaring a national emergency at the Mexican border and instituting a policy recognizing only two genders.Trump also embraced a nationalistic tone, emphasizing his extraordinary political comeback. He pledged to impose trade tariffs, rename the Gulf of Mexico the Gulf of America, and \"take back\" the Panama Canal, which has been controlled by Panama since 1999.\"The golden age of America begins right now. From this day forward, our country will flourish and be respected again all over the world,\" Trump said in the Capitol, where the inauguration was held indoors for the first time in decades due to freezing weather.The Republican even suggested he was on a divine mission, stating, \"I was saved by God to make America great again\" after surviving an assassination attempt at a rally in July.While promising renewal, Trump harshly denounced what he called a \"betrayal\" of Americans by a \"radical and corrupt establishment\" under outgoing President Joe Biden.\"America's decline is over,\" Trump declared, becoming the oldest president in US history at 78.Biden, 82, who had earlier hosted Trump and his wife Melania for tea at the White House, watched with a stony expression as his political rival delivered his critique of Biden's single term in office.'National Emergency'Trump was surrounded by America's wealthiest and most powerful figures at the inauguration, held in the same building that his supporters attacked in January 2021 as they attempted to overturn the certification of his election loss to Biden.Elon Musk, the world’s richest man, along with Meta CEO Mark Zuckerberg, Amazon founder Jeff Bezos, and Google CEO Sundar Pichai, all sat in prime seats in the Capitol, alongside Trump’s family and cabinet members.Musk, who will lead a cost-cutting effort in the new administration, later told a rally that Trump's victory marked a \"fork in the road of human civilization.\"Former presidents Barack Obama, George W. Bush, and Bill Clinton attended the ceremony with their spouses, though Michelle Obama pointedly stayed away.Trump will begin his second term with a series of executive orders.\"I will declare a national emergency at our southern border\" with Mexico, Trump said to loud cheers from the audience, adding that he would deploy troops to the border and deport \"millions and millions\" of illegal immigrants.Trump also stated that his administration would recognize \"only two genders, male and female,\" ending the practice of offering a third gender option in certain government settings, and abolishing diversity programs.He vowed to withdraw the US from the Paris climate accord aimed at addressing global warming, expand oil production, and encourage more drilling, while scrapping rules intended to promote the purchase of electric vehicles.Finally, Trump promised to \"plant the Stars and Stripes\" on Mars.\"I feel on cloud 10,\" said Gregg Donovan, a 65-year-old from Hollywood, wearing a top hat adorned with a photo of Trump, outside the Capitol after the inauguration.Biden PardonsAfter delivering his concise half-hour inaugural address, Trump quickly shifted to a more informal speech, discussing topics ranging from immigration to his wife's attire, and even repeating his false claim that he had won the 2020 election—an ongoing effort to undermine US democracy.In a split-screen moment as Trump spoke, an emotional Biden told staff, \"We’re leaving the office, but we’re not leaving the fight.\" He then boarded a final flight to California.Biden's last acts in office revealed his disdain for Trump, whom he had planned to face in the 2024 election before concerns about his age led him to drop out. Biden preemptively pardoned former officials and family members to shield them from \"baseless and politically motivated investigations\" under Trump.Despite the tensions, Biden sought to restore some traditional decorum to the inauguration. After Trump skipped Biden's inauguration in 2021, Biden invited Trump and Melania to the White House for tea.Trump is just the second president in US history to return to power after being voted out, following Grover Cleveland in 1893. He is also the first convicted felon to become president, due to charges related to paying hush money to a porn star during his first presidential campaign.Russian President Vladimir Putin congratulated Trump and expressed openness to talks on the Ukraine conflict.Israeli Prime Minister Benjamin Netanyahu also congratulated Trump, whose team helped broker a ceasefire deal in Gaza.","summary":"","url":"https://tribune.net.ph/2025/01/21/trump-vows-new-us-golden-age-following-white-house-return","image":"https://media.assettype.com/tribune/2025-01-20/unm874xo/00036UX4TX.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-01-21 00:32:00","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":0.23},{"id":282132742,"title":"Trump signs key executive orders and pardon for January 6 defenders hours after taking oath","text":"Just hours after his inauguration, President Donald Trump signed several key executive orders, including one granting pardons to those involved in the January 6 events, marking a swift start to his second term.","summary":"Just hours after his inauguration, President Donald Trump signed several key executive orders, including one granting pardons to those involved in the January 6 events, marking a swift start to his second term.","url":"https://www.wionews.com/videos/trump-signs-key-executive-orders-and-pardon-for-january-6-defenders-hours-after-taking-oath","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/01/21/N9MnbOE1DH8kdUseoVWL.jpg","video":null,"publish_date":"2025-01-21 00:31:14","author":"Wion Video Team","authors":["Wion Video Team"],"language":"en","source_country":"in","sentiment":-0.102},{"id":282129794,"title":"There is significant chance Trump's efforts on Ukraine will bear fruit — expert","text":"WASHINGTON, January 21. /TASS/. Russian President Vladimir Putin's statements about his readiness for dialogue on Ukraine with the new head of the US administration Donald Trump are a positive signal, and there is a significant chance that the parties' efforts will bear fruit, senior fellow at the Council on Foreign Relations (CFR) and former senior director for European affairs at the White House National Security Council Charles Kupchan said in an interview with TASS.\n\n\"Putin's statement that he is open to dialogue with Trump over Ukraine and nuclear arms is a positive sign; there is a reasonable chance that Trump's efforts to end the war will bear fruit,\" he said.\n\nAccording to him, \"Putin also stated that he wanted a lasting peace settlement, not just a ceasefire. That objective is desirable, but a settlement will be much more difficult to achieve than a ceasefire. Putin may predicate a lasting settlement on demands that Ukraine, Europe, and probably Trump himself will find it very hard to accept — such as Ukrainian neutrality, recognition of occupied Ukraine as Russian territory, and the removal of sanctions. A ceasefire may be attainable, but a lasting peace settlement may well remain out of reach.\"\n\nAs Putin said earlier at a meeting of the Russian Security Council, Moscow is open to dialogue with the new US administration on the Ukrainian conflict, the most important thing is to eliminate the root causes of the crisis. He confirmed that Russia takes into account the statements of Trump and his team about the desire to restore contacts, as well as the need to do everything to a world war.","summary":"According to senior fellow at the Council on Foreign Relations Charles Kupchan, that objective is desirable, but a settlement will be much more difficult to achieve than a ceasefire","url":"https://tass.com/world/1901941","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-21 00:31:01","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.264},{"id":282129224,"title":"Trump to withdraw U.S. from Paris climate agreement again","text":"President Donald Trump said Monday he will again withdraw the United States from the landmark Paris climate agreement, dealing a blow to worldwide efforts to combat global warming and once again distancing the U.S. from its closest allies. The announcement, which came the day Mr. Trump was sworn in to a second term, echoed Trump's actions in 2017, when he announced that the U.S. would abandon the global Paris accord. President Biden later rejoined.As he signed a series of executive actions following his inauguration, Mr. Trump said, \"I'm immediately withdrawing from the unfair, one-sided Paris Climate Accords.\" He also signed a letter informing the U.N. of his decision.The pact is aimed at limiting long-term global warming to 2.7 degrees Fahrenheit (1.5 degrees Celsius) above pre-industrial levels or, failing that, keeping temperatures at least well below 3.6 degrees Fahrenheit (2 degrees Celsius) above pre-industrial levels. The U.S. is one of the world's top carbon polluting nations.The 2015 Paris agreement is voluntary and allows nations to provide targets to cut their own emissions of greenhouse gases from the burning of coal, oil and natural gas. Those targets are supposed to become more stringent over time, with countries facing a February 2025 deadline for new individual plans. The outgoing Biden administration last month offered a plan to cut U.S. greenhouse gas emissions by more than 60% by 2035.Laurence Tubiana, CEO of the European Climate Foundation and a key architect of the Paris agreement, called the planned U.S. withdrawal unfortunate but said action to slow climate change \"is stronger than any single country's politics and policies.\"The global context for Trump's action is \"very different to 2017,\" Tubiana said, adding that \"there is unstoppable economic momentum behind the global transition, which the U.S has gained from and led but now risks forfeiting.\"The International Energy Agency expects the global market for key clean energy technologies to triple to more than $2 trillion by 2035, she said.\"The impacts of the climate crisis are also worsening. The terrible wildfires in Los Angeles are the latest reminder that Americans, like everyone else, are affected by worsening climate change,\" Tubiana said.Gina McCarthy, who served as White House climate adviser under President Joe Biden, a Democrat, said that if Trump, a Republican, \"truly wants America to lead the global economy, become energy independent and create good-paying American jobs,\" then he must \"stay focused on growing our clean energy industry. Clean technologies are driving down energy costs for people all across our country.\"The world is now long-term 2.3 degrees Fahrenheit (1.3 degrees Celsius) above mid-1800s temperatures. Most but not all climate monitoring agencies said global temperatures last year passed the warming mark of 2.7 degrees Fahrenheit, and all said it was the warmest year on record.Without greater reductions over the next few years, the world is on a path to see a temperature increase of more than 3 degrees Celsius, according to an October U.N. report, which warned such an outcome \"would bring debilitating impacts to people, planet and economies.\"The withdrawal process from the Paris accord takes one year. Trump's previous withdrawal took effect the day after the 2020 presidential election, which he lost to Biden.While the first Trump-led withdrawal from the landmark U.N. agreement — adopted by 196 nations — shocked and angered nations across the globe, \"not a single country followed the U.S. out the door,\" said Alden Meyer, a longtime climate negotiations analyst with the European think tank E3G.Instead, other nations renewed their commitment to slowing climate change, along with investors, businesses, governors, mayors and others in the U.S., Meyer and other experts said.Still, they lamented the loss of U.S. leadership in global efforts to slow climate change, even as the world is on track to set yet another record hot year and has been lurching from drought to hurricane to flood to wildfire.\"Clearly America is not going to play the commanding role in helping solve the climate crisis, the greatest dilemma humans have ever encountered,\" said climate activist and writer Bill McKibben. \"For the next few years the best we can hope is that Washington won't manage to wreck the efforts of others.\"About half of Americans \"somewhat\" or \"strongly\" oppose U.S. action to withdraw from the climate accord, and even Republicans aren't overwhelmingly in favor, according according to a poll from The Associated Press-NORC Center for Public Affairs Research. Only about 2 in 10 U.S. adults \"somewhat\" or \"strongly\" in favor of withdrawing from the Paris agreement, while about one-quarter are neutral.Much of the opposition to U.S. withdrawal comes from Democrats, but Republicans display some ambivalence as well. Slightly less than half of Republicans are in favor of withdrawing from the climate accord, while about 2 in 10 are opposed.China several years ago passed the United States as the world's largest annual carbon dioxide emitting nation. The U.S. — the second biggest annual carbon polluting country — put 4.9 billion metric tons of carbon dioxide in the air in 2023, down 11% from a decade earlier, according to the scientists who track emissions for the Global Carbon Project.But carbon dioxide lasts in the atmosphere for centuries, so the United States has put more of the heat-trapping gas that is now in the air than any other nation. The U.S. is responsible for nearly 22% of the carbon dioxide put in the atmosphere since 1950, according to Global Carbon Project.While global efforts to fight climate change continued during Trump's first term, many experts worry that a second Trump term will be more damaging, with the United States withdrawing even further from climate efforts in a way that could cripple future presidents' efforts. With Trump, who has dismissed climate change, in charge of the world's leading economy, those experts fear other countries, especially China, could use it as an excuse to ease off their own efforts to curb carbon emissions.Simon Stiell, the U.N. climate change executive secretary, held out hope that the U.S. would continue to embrace the global clean energy boom.\"Ignoring it only sends all that vast wealth to competitor economies, while climate disasters like droughts, wildfires and superstorms keep getting worse,\" Stiell said. \"The door remains open to the Paris Agreement, and we welcome constructive engagement from any and all countries.\"","summary":"President Donald Trump says he will again withdraw the United States from the landmark Paris climate agreement.","url":"https://www.cbsnews.com/news/trump-withdrawing-us-paris-climate-agreement-again/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/01/21/02bcb918-e695-436c-8816-43d19871dbff/thumbnail/1200x630/d93d6618fc7a55f6136363caf2aaa91a/2025-01-21t000117z-2058680929-up1el1l0022t3-rtrmadp-3-usa-trump-inauguration.jpg?v=b37f0cace52a6645c18f53563f47da","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3472977_hls/master.m3u8","publish_date":"2025-01-21 00:30:51","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.071},{"id":282132144,"title":"Letters: Green infrastructure could give our California coast a chance","text":"Green infrastructure\nwill help defend coasts\n\nRe: “Sea lions adapt to squeeze play” (Page A1, Jan. 15).\n\nGiven the heightened presence of storm activity off of California’s coast due to climate change, Santa Cruz’s Municipal Wharf collapse illustrates the dangers of doing nothing to improve coastal infrastructure. As ocean storm patterns change, state legislators should consider enforcing green infrastructure (“living shorelines”) in coastal communities to protect structures and marine species.\n\nAccording to the California Department of Fish and Wildlife, at least 10 coastal public piers were closed for all or part of 2024 because of structural damage caused by ocean storms. Debris from destroyed structures could harm the California sea lion and other marine species once those materials enter the water. Implementing living shorelines can reduce erosion better than sea walls.\n\nSanta Cruz has asked community members to report any observed wharf debris. Looking ahead, requiring local governments to utilize green infrastructure is a feasible mitigation strategy state legislators should consider to protect our coast.\n\nMarie Blackard\n\nDeposit on recyclables\nshould be called tax\n\nWhy is the California Redemption Value charged for beverages called a “deposit”? One is charged from 5 cents to 25 cents per container (can, bottle or box) and one is supposed to be able to reclaim that amount when the container is recycled.\n\nIn reality, the opportunities to reclaim that “deposit” are so limited that it is next to impossible. I believe in protecting the environment through recycling but why don’t we call it what it is — a fee or possibly even a tax? \n\nWho knows, if it were deemed a tax one might be able to claim it as a part of one’s itemized deductions on income tax, assuming the limitation on state and local income taxes (SALT) is amended.\n\nDarcy A. Johnson\n\nLocal taxes compound\nhigh electricity bills\n\nRe: “Soaring electric bills could thwart green energy push” (Page A8, Jan. 9).\n\nThe article doesn’t mention that heavy local taxes further drive up many electric bills. Berkeley, for example, adds a 7.5% Utility Users’ Tax to my electric bill.\n\nIt is ironic that Berkeley’s clean energy ideology is trampled by its even stronger appetite for maximally taxing its residents and businesses in every way imaginable. Even the Ava “clean energy” portion of the bill has the 7.5% Berkeley Tax plopped on, thereby actually discouraging electrification.\n\nBerkeley should eliminate electricity taxes and instead begin living within its means by reducing overtime misuse, avoiding unnecessary, overly expensive, future projects like the recent overbudget $10 million North Berkeley Senior Center remodel, and abandoning grandiose plans for unneeded projects like the $158 million proposed Civic Center remodel.\n\nBy overtaxing basic services like clean electricity, cities like Berkeley greatly harm their struggling businesses, residents and society at large.\n\nBarbara Sacks\n\nTrump shows true\ncolors as L.A. burns\n\nOnce again President Donald Trump is showing us his true colors. During this time of the L.A. fires when California needs support, empathy and compassion from the nation’s commander-in-chief, all we are getting is an attempt to blame state and local leaders.\n\nThis serves to alienate California from the rest of the country. Trump seems to want to be the divider-in-chief.\n\nPeggy Moyers\n\nDOGE an example of\nright-wing deep state\n\nRe: “Inside DOGE’s plan to cut costs” (Page A1, Jan. 13).\n\nPresident Trump’s so-called Department of Government Efficiency (DOGE), planned in secret, is a group of handpicked billionaires to be embedded in government agencies, with an agenda of cost-cutting and deregulation.\n\nCost-cutting? Why not start with presidential perks and the billionaires’ tax breaks that have not helped the economy? And deregulation? Do we really want our food, drugs and transportation rendered unsafe and tax evasion rendered easier by an emasculated Internal Revenue Service?\n\nAlthough, technically, only Congress has the power to cut spending, DOGE will have the ear of a president to whom a majority of legislators are beholden. Sounds like a real deep state in the making.\n\nKaren Lee Cohen\nWalnut Creek\n\nDangerous Patel must\nbe kept from FBI role\n\nI am concerned about most of President Donald Trump’s cabinet nominees, but one strikes me as particularly potentially dangerous to democracy: Kash Patel for FBI director.\n\nHe is loyal to the incoming president, not the people. He has declared war on the media, created an enemies list, talked about revoking security clearances, and promoted a rigged election conspiracy. I am old enough to remember Cointelpro and studying the effects of J. Edgar Hoover’s FBI. We cannot go down those roads again.\n\nWe must insist, via calls and letters, that Sens. Alex Padilla and Adam Schiff vote no to the confirmation of Kash Patel.\n\nSharyl Larson","summary":"Also: Recyclable tax &#124; Compounding bills &#124; True colors &#124; DOGE deep state &#124; Dangerous Patel. East Bay Times reader letters to the editor for Jan. 21, 2025.","url":"https://www.mercurynews.com/2025/01/20/letters-green-infrastructure-protect-coasts-1977/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/SJM-L-WHARFLIONS-01XX-6.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-21 00:30:44","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.203},{"id":282132778,"title":"[Trump 2.0] What will Trump discuss with Korean corporate leaders?","text":"Questions remain over significance of attending inauguration\n\nBy Park Jae-hyuk\n\nBoth hopeful and doubtful outlooks coexist regarding the participation of Korean businesspeople in U.S. President-elect Donald Trump's inauguration on Monday.\n\nGiven his lifelong career as a real estate tycoon, the incoming U.S. president is expected to engage in transactions with corporate leaders from Korea, aiming to benefit both his second administration and the Korean business community.\n\nShinsegae Group Chairman Chung Yong-jin, for example, made headlines, after it was revealed that he has been invited to the presidential inaugural ball to be held throughout the evening of the inauguration day. Last month, Chung met with Trump in person at the Mar-a-Lago resort in Florida at the invitation of the president-elect’s oldest son, Donald Trump Jr.\n\nThe grandson of the late Samsung founder Lee Byung-chul has regained significant public attention since 2022, when he posted anti-communist content on social media. At the same time, expectations are rising that Shinsegae may increase its investments in the U.S. retail industry under a second Trump administration.\n\n“I expect that Trump Jr. will introduce me to key officials,” Chung told reporters at John F. Kennedy International Airport in New York, Friday (local time). “I will do my best as a businessman.”\n\nSPC Group has already announced plans to make additional investments in the United States, following a press release about Chairman Hur Young-in’s participation in the inauguration. The food firm, which owns the Paris Baguette bakery chain, highlighted its commitment to expanding its presence in the U.S. Hur is one of the businesspeople who met Trump in 2019, when he visited Korea for a summit with then-President Moon Jae-in.\n\n“After the ceremony, the chairman will meet U.S. lawmakers interested in the Korean economy and strengthen his personal networks with them,” SPC said. “Under the second presidency of Trump, we will carry out various investment activities in the U.S.”\n\nBom Kim, the Korean-American founder of Coupang, will also reportedly attend the inauguration, along with senior executives of the Seattle-headquartered e-commerce firm, which is listed on the New York Stock Exchange. Alex Wong, former head of the company’s public affairs, was named Trump’s principal deputy national security adviser.\n\nHowever, the absence of Korea’s leading conglomerates from the inauguration has raised skepticism that attendance at the event alone may not lead to meaningful outcomes. Due to forecasts of severe cold weather, Trump's inauguration was moved indoors for the first time in 40 years, forcing most participants to watch the ceremony on screens.\n\nPark Ju-gun, founder of the corporate tracker Leader Index, pointed out that the investment sizes from Shinsegae and SPC are unlikely to be significant enough to meet Trump’s expectations.\n\nWhen SM Group Chairman Woo Oh-hyun, Shin Young Chairman Kang Ho-gap and General Equity Partners CEO Kweon Ji-hoon were invited to Trump’s first presidential inauguration in 2017, they also failed to draw public attention after the event. Woo will attend the upcoming ceremony as well, along with the heads of several smaller Korean firms.\n\n“Invitations of most Korean businesspeople to the inauguration were made upon their individual relationships (with American friends),” Park said. “Except for Federation of Korean Industries (FKI) Chairman Ryu Jin, the participants are not expected to play major roles for Korea’s policymakers and business communities.”\n\nRyu, who also leads Poongsan, a copper products and ammunition manufacturer, has been invited to the inauguration in the capacity of the Korea-U.S. Business Council’s chair. He is known for his friendship with the family of former U.S. President George H. W. Bush.\n\nAlthough Poongsan has U.S. operations, he seems to focus more on representing the broader Korean business community. This is part of his efforts to restore the stature of the Federation of Korean Industries (FKI), which has weakened since the 2016 corruption scandal involving the federation and the impeached former President Park Geun-hye.\n\nIn return, he may try to make the American business community’s voice heard in Korea, considering the U.S. Chamber of Commerce’s protest against Seoul’s move to regulate online platforms. The U.S.-Korea Business Council is under the supervision of the chamber.\n\n“Although I will not meet the president-elect, I will talk with the officials of his second administration,” Ryu told reporters on Jan. 9, confirming that he will depart for the U.S. on Jan. 18.\n\nHe also dismissed concerns about Trump’s tariffs, suggesting that worries over inflation will prompt the business-minded president-elect to reconsider his trade policies.\n\n“I believe that Trump will do better than before,” Ryu added.\n\nOther efforts\n\nKorea’s four largest conglomerates are expected to talk with the Trump administration behind the scenes, amid the absence of their chairmen from the inauguration.\n\nHyundai Motor Group, which donated $1 million to the ceremony and started considering building a steel mill in the southern region of the U.S., denied that Executive Chair Chung Euisun would participate in the event. The heads of Samsung, SK, and LG were also not invited.\n\nGiven that Lotte’s large-scale investments in a Louisiana plant led to Trump inviting Chairman Shin Dong-bin to the White House in 2019, there is a possibility that Korean tycoons could have separate meetings with the new president in the future by making investments in the U.S.\n\n“With their lobbyists and offices in Washington, the top four business groups have continued negotiations under the table to brace for the universal tariff plan,” Park said.\n\nThe heirs to Hanwha and HD Hyundai, both of whom will be absent from the inauguration, are likely to leverage their fathers' friendships with Trump’s aides to ensure their companies benefit from the president-elect’s plan to rebuild the U.S. Navy.\n\nHanwha Group Chairman Kim Seung-youn, father of Vice Chairman Kim Dong-kwan, was invited to Trump’s previous inauguration, although he was unable to attend due to health reasons.\n\nAsan Foundation Chairman Chung Mong-joon, father of HD Hyundai Executive Vice Chairman Chung Ki-sun, advised lawmakers of the then-ruling Saenuri Party in 2016, when the now-disbanded party was preparing to send a delegation to the U.S. to meet Trump’s transition team.","summary":"Both hopeful and doubtful outlooks coexist regarding the participation of Korean businesspeople in U.S. President-elect Donald Trump&apos;s inauguration on Monday.","url":"https://nation.lk/online/trump-2-0-what-will-trump-discuss-with-korean-corporate-leaders-292600.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/a87f233fb0664f698c133b5ced4fdb40.png","video":null,"publish_date":"2025-01-21 00:30:24","author":"Park Jae","authors":["Park Jae"],"language":"en","category":"politics","source_country":"lk","sentiment":0.153},{"id":282132414,"title":"India to take up Biden's AI chip export curbs with Trump govt","text":"India will raise the issue of the US imposing a country-specific cap on exports of AI compute and foundational models with the incoming Donald Trump administration, a senior official told ET. The Ministry of Electronics and Information Technology (MeitY) has held initial discussions with various arms of the government, including national security advisor (NSA) Ajit Doval's office, and has shared analysis and concerns pertaining to the move by the outgoing Joe Biden US administration. We really have to take it up with the new government once it comes in, the official said. The cap could be detrimental to India's tech industry in the long term even if it's not an immediate crisis for the country, the person added. The government will raise the issues under the India-US Initiative on Critical and Emerging Technologies (iCET) framework, the official said.117406883 The framework, launched by Prime Minister Narendra Modi and President Biden on the sidelines of the Quad Summit in Tokyo in May 2022, focuses on collaboration in critical and emerging technologies. Earlier this month, US national security adviser Jake Sullivan was in India and also met Doval. The two sides regularly discuss cooperation on areas including artificial intelligence, quantum computing, semiconductors, defence and space. We have an iCET framework; it is led by the NSA. So, we'll take it up through that channel, the official cited above said. MeitY has done an assessment, NSA has done an assessment...everyone is assessing what the implications are, what it implies, and so on. It's not an immediate crisis, we should be able to manage. But, as we go along, it's more important to (raise this). As per the new US directive, India won't be able to import more than 50,000 GPUs from the US in a year and even at the country level India will need a licence. The government is currently sourcing close to 10,000 GPUs under the India AI Mission. The number may go up in the future. ET had reported on January 15 that the rule may increase compliance complexities for companies like Reliance Industries, which recently placed an order for Nvidia GPUs. It could put data centre providers such as Tata Communications, Yotta Data Services, E2E Networks and Ctrl S-which are expanding to offer AI cloud computing-at a disadvantage relative to US rivals. Uncertainty over licences and trade negotiations could challenge India's ambitions for large-scale AI hardware deployment, the official said. The regulations divide the world into three groups-the first comprising 20 countries including Australia, the UK, France, Germany, Sweden, Switzerland have unrestricted access to AI chips, while 20 others including China, Russia, North Korea and Iran will have no access.","summary":"India will express its concerns to the incoming Donald Trump administration about its predecessor’s decision to impose country-specific curbs on artificial intelligence (AI) computing and foundational models.","url":"https://economictimes.indiatimes.com/tech/technology/india-to-take-up-bidens-ai-chip-export-curbs-with-trump-govt/articleshow/117406695.cms","image":"https://img.etimg.com/thumb/msid-117406734,resizemode-4,width-1200,height-900,imgsize-77128,overlay-ettech/articleshow.jpg","video":null,"publish_date":"2025-01-21 00:30:00","author":"Surabhi Agarwal","authors":["Surabhi Agarwal"],"language":"en","category":"politics","source_country":"in","sentiment":0.27},{"id":282132744,"title":"Trump to greenlight supply of 2,000-pound bombs to Israel, undo Biden-era sanctions on settlers: Report","text":"US President Donald Trump may soon greenlight supply of 2,000-pound bombs to Israel, earlier frozen by the Joe Biden administration. News agency Reuters reported citing Walla News that the 47th US president was also expected to undo Biden administration\"s sanctions imposed on Israeli settlers accused of violent attacks against Palestinians in the occupied West Bank. Advertisment Earlier, Israeli Prime Minister Benjamin Netanyahu congratulated Trump shortly after his swearing-in ceremony and declared the US-Israel alliance would reach to greater heights under his administration. In a short video address, Netanyahu said, “You brokered the historic Abraham Accords, in which Israel made peace with four Arab countries,” he added. “I believe that working together again, we will raise the US-Israel alliance to even greater heights” and will “complete the defeat of Iran\"s terror axis and usher in a new era of peace and prosperity for our region.” Netanyahu to visit US soon: Report AdvertismentIsraeli media reported that discussions were underway between Trump team and Netanyahu administration to facilitate a visit by the Israeli PM “as early as next month.” On Saturday (Jan 18), Trump himself had said he would be meeting the Israeli PM “fairly shortly.” Also read: 'Worst administrations in history': Trump to cease Biden's bureaucrats and fire them Advertisment The developments come hot on the heels of a Gaza ceasefire agreement brokered by Qatar that will see the release of 33 Israeli hostages held by Hamas and Palestinian prisoners in Israel. The Trump team has widely been credited for the same, with the new national security adviser, Mike Waltz, recently hailing \"Trump effect\" for the historic deal. Also read: Trump Inauguration 2025: Thousands of supporters welcome US President Trump Despite the deal, Netanyahu has refused to promise reduction of troops currently stationed at the Gaza-Egypt border. “Not only will we not reduce our forces there, we will even increase them slightly,\" the Israeli leader said. (With inputs from agencies)","summary":"US President Donald Trump may soon greenlight supply of 2,000-pound bombs to Israel, earlier frozen by the Joe Biden administration. News agency Reuters reported citing Walla News that the 47th US president was also expected to undo Biden administration&rsquo;s sanctions imposed on Israeli settlers accused of violent attacks against Palestinians in the occupied West Bank.\n\n\nEarlier, Israeli Prime Minister Benjamin Netanyahu congratulated Trump shortly after his swearing-in ceremony and declared the US-Israel alliance would reach to greater heights under his administration.\n\n\nIn a short video address, Netanyahu said, &ldquo;You brokered the historic Abraham Accords, in which Israel made peace with four Arab countries,&rdquo; he added. &ldquo;I believe that working together again, we will raise the US-Israel alliance to even greater heights&rdquo; and will &ldquo;complete the defeat of Iran&rsquo;s terror axis and usher in a new era of peace and prosperity for our region.&rdquo;\n\n\nNetanyahu to visit US soon: Re","url":"https://www.wionews.com/world/trump-to-greenlight-supply-of-2000-pound-bombs-to-israel-undo-biden-era-sanctions-on-settlers-8639050","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/01/21/PNjqGn3SHKyP8BbYNp4l.jpg","video":null,"publish_date":"2025-01-21 00:29:38","author":"Vikrant Singh","authors":["Vikrant Singh"],"language":"en","category":"politics","source_country":"in","sentiment":-0.156},{"id":282130512,"title":"Arab Gulf leaders, Jordan’s king, Palestine’s President congratulate Trump on his inauguration","text":"Dubai: Arab Gulf leaders, the king of Jordan, and Palestine's President have congratulated Donald Trump on his inauguration as the 47th President of the US.\nThe leadership of the UAE, including President Sheikh Mohamed bin Zayed Al-Nahyan; Sheikh Mohammed bin Rashid Al-Maktoum, the Prime Minister and ruler of Dubai; and Sheikh Mansour bin Zayed Al-Nahyan, the UAE's Deputy Prime Minister and chairman of the Presidential Court, each sent a congratulatory message to Trump on Monday.\nOman's Sultan Haitham bin Tariq expressed his wish for Trump's success in his second term as US President.\nBahrain's King Hamad bin Isa Al-Khalifa expressed his wishes for Trump's good health, happiness, and success in his role, highlighting his pride in the relations and close partnership between the US and Bahrain.\nSheikh Meshal Al-Ahmad Al-Jaber Al-Sabah, the Emir of Kuwait, affirmed in his message to Trump the aspiration to strengthen the well-established relations between the two countries.\nJordan's King Abdullah II said on X that Jordan highly valued its partnership with the US and was committed to working with Trump toward a peaceful world.\nIn his speech at the Capitol Rotunda, Trump said he wanted to be a \"peacemaker and unifier\" while mentioning the recently released hostages in a deal between Hamas and Israel which brought a ceasefire to the Gaza Strip this week.\nMahmoud Abbas, the President of the Palestinian Authority (PA), said in a message that the PA was ready to work with Trump to achieve peace during his administration, based on the two-state solution.\nPresident Mahmoud Abbas extended his heartfelt congratulations to President Donald Trump on his inauguration and for taking the constitutional oath as President of the United States of America.\nIn his message, President Abbas emphasised, \"We stand ready to work with you to achieve peace during your tenure, guided by the two-state solution based on international legitimacy. This vision seeks the establishment of the State of Palestine and the State of Israel living side by side in peace and security.\"\nPresident Abbas further highlighted the importance of collective efforts to foster security and stability in the region and across the globe, expressing his hope for fruitful collaboration in pursuing these shared goals.","summary":"Oman's Sultan Haitham bin Tariq expressed his wish for Trump's success in his second term as US President.","url":"https://telanganatoday.com/arab-gulf-leaders-jordans-king-palestines-president-congratulate-trump-on-his-inauguration","image":"https://media.telanganatoday.com/wp-content/uploads/2025/01/g.jpg","video":null,"publish_date":"2025-01-21 00:28:47","author":"IANS","authors":["IANS"],"language":"en","category":"politics","source_country":"in","sentiment":0.421},{"id":282129174,"title":"Editorial: An unusual inauguration of a highly unusual American president","text":"In his inaugural address, President Donald J Trump said: “For American citizens, January 20 2025 is Liberation Day.” This comment, 18 months ahead of the 250th anniversary of Independence Day, was met with cheers. Such conduct from the audience at an inauguration is unusual, as was the outbreaks of chants of ‘U SA … U SA’ from his supporters. And this was not from the huge crowd that is normally gathered outside the ceremony, in the vast expanse of park to the west of Capitol Hill in Washington DC. This was from his elected representatives or invited guests. But then everything about the 45th, and now 47th, president of the United States of America is unusual. He stated yesterday that his life had been “saved by God [from assassination] to make America great again”. His chosen minister, Franklin Graham (son of the late Billy), began his prayers by appearing to endorse Mr Trump’s presentation of himself as victim, saying: “There are times I am sure you thought it was pretty dark but look what God has done”. ​And if that was not explicit enough, President Trump in his own address said the “the vicious, violent and unfair weaponisation of the justice department and our government will end”. Only moments earlier he had seemed magnanimous, naming his predecessors, all living ex presidents, who were in attendance. And they all were far too well behaved to boycott the ceremony as he disgracefully did in 2021. These were unfortunate partisan moments at such an event. President Trump won’t care though. His enemies helped put him in office by losing control of US borders and other appalling failures. The president might well be wiser than he was in his first term. He is prepared to tackle huge problems that others will not. We wish him well in his stewardship of what can fairly still be called the ‘free world’.","summary":"News Letter editorial on Tuesday January 21 2025:","url":"https://www.newsletter.co.uk/news/opinion/editorial-an-unusual-inauguration-of-a-highly-unusual-american-president-4952249","image":"https://www.newsletter.co.uk/webimg/b25lY21zOjY5ZDc2NTk0LThjYjItNGNmYi04N2YwLTIwOWVmNGVkZDE0OToxZDIyZDIyMy0zM2Y1LTRjOGEtYTVjMC03YWYxYTYyNWNhNmM=.jpg?width=1200&enable=upscale","video":null,"publish_date":"2025-01-21 00:25:15","author":"Editorial","authors":["Editorial"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.247},{"id":282130130,"title":"Rubio wins unanimous nod to be top U.S. diplomat","text":"Washington - The U.S. Senate unanimously approved Marco Rubio as secretary of state on Monday, putting the fellow senator in the front line of President Donald Trump's often confrontational diplomacy.Rubio, who is the first Hispanic and first fluent Spanish speaker to assume the position of top U.S. diplomat, is Trump's first Cabinet nominee to be confirmed by the Republican-led Senate, only hours after the inauguration.Unusually in a highly partisan era, Rubio was confirmed 99-0, with several senators from the rival Democratic Party describing Rubio as a friend. One Senate seat was made vacant by the inauguration of Vice President JD Vance.","summary":"Unusually in a highly partisan era, Rubio was confirmed 99-0, with several senators from the rival Democratic Party describing Rubio as a friend.","url":"https://www.japantimes.co.jp/news/2025/01/21/world/politics/rubio-us-secretary-of-state-confirmed/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/01/21/447095.jpg?v=3.1","video":null,"publish_date":"2025-01-21 00:25:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.484},{"id":282130924,"title":"How Common is Birthright Citizenship? What the Data Shows","text":"Birthright citizenship hasn't changed much over the years with births to foreign-born mothers in the United States remaining between 20 and 25 percent for over two decades, according to data from a youth advocacy organization.Newsweek reached out to the White House for comment via email on Monday.Why It MattersPresident Donald Trump is set to issue executive orders on Monday aimed at tightening border security and cracking down on illegal immigration, which includes ending birthright citizenship for children of immigrants living in the U.S. illegally.What To KnowIn 2000, 21 percent of births were to foreign-born mothers, according to data from the Annie E. Casey Foundation. This number has fluctuated slightly throughout the years, peaking at 25 percent in 2006. It decreased to 21 percent in 2021 before increasing to 24 percent in 2023.It's important to note that this data does not differentiate between illegal and legal foreign-born mothers and includes mothers from Puerto Rico and the Virgin Islands.14th Amendment SimplifiedBirthright citizenship is enshrined in the 14th Amendment of the U.S. Constitution, which was added in the 19th Century to grant citizenship to former slaves.The 14th Amendment states, \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\"History of Birthright CitizenshipBirths to mothers living in the U.S. illegally generally increased throughout the 1980s until the start of the Great Recession in 2007 when the number of births began to decline, the Pew Research Center said in 2018, citing data from the Census Bureau's American Community Survey and Current Population Survey.What Countries Have Birthright Citizenship?Here are the countries around the world that have unrestricted birthright citizenship. There are other countries not on these lists that have restricted birthright citizenship.North America\nUnited States\n\nCentral America\n\nEl Salvador\n\nThe Caribbean\nAntigua and Barbuda\n\nSaint Kitts and Nevis\nSaint Lucia\nSaint Vincent and the Grenadines\nTrinidad and Tobago\nSouth America\n\nCentral Africa\n\nEast Africa\n\nSouthern Africa\n\nWhat People Are SayingAn incoming White House official said in a briefing that Newsweek was a part of on Monday, \"We are then going to end birthright citizenship.\"\"This action gives effect to the phrase, and subject to the jurisdiction thereof, in the 14th Amendment, to clarify that, on a perspective basis, the federal government will not recognize automatic birthright citizenship for children of illegal aliens born in the United States,\" the official said. \"We are also going to enhance the vetting and screening of illegal aliens.\"Thomas Wolf, a constitutional expert, wrote on Bluesky on Monday, \"Talk of rescinding birthright citizenship is just that: Talk. Presidents can't rescind it, because the Constitution expressly guarantees it. The Constitution's text reflects a basic American principle: Being born here comes with citizenship. Any executive order won't survive the court fights.\"Jeffrey Rosen, President and CEO of the National Constitution Center, told CNN in an article last updated in November 2018 of the 14th Amendment, \"It is really important that it's a vision of citizenship based on land rather than blood. It is an idea that anyone can be an American if they commit themselves to our Constitutional values.\"Mehdi Hasan, editor-in-chief and CEO of the media company Zeteo, wrote on X, formerly Twitter, on Monday, \"Donald Trump plans to try and end birthright citizenship via executive order. He can't. The 14th Amendment is very clear on this, as is Supreme Court precedent.\"Nick Sortor, a political commentator seen on Fox News and Newsmax, reacted to the news of Trump's plans to end birthright citizenship of people living in the U.S. illegally, writing on X on Monday, \"GOOD! NO MORE ANCHOR BABIES!\"What Happens NextIf Trump does try to end birthright citizenship for children of people living in the U.S. illegally, it will be sure to be challenged in court given that it is a contentious legal issue.","summary":"Data shows birthright citizenship hasn't changed much since 2000 as Trump wants to end it for children of illegal immigrants.","url":"https://www.newsweek.com/birthright-citizenship-donald-trump-executive-order-2017995","image":"https://d.newsweek.com/en/full/2569199/migrants.jpg","video":null,"publish_date":"2025-01-21 00:24:35","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"US","sentiment":-0.025},{"id":282133252,"title":"Elon Musk Generates Controversy With Hand Gesture at Trump Inauguration Event, Draws Comparison to Fascist Salute","text":"X owner Elon Musk generated controversy hours after Donald Trump was inaugurated as the nation’s 47th president with a gesture made during a speech that drew immediate comparisons to a fascist salute. “Some elections are important, some are not, but this one really mattered. And I just want to say thank you for making it […]","summary":"X owner Elon Musk generated controversy hours after Donald Trump was inaugurated as the nation&#8217;s 47th president with a gesture made during a speech that drew immediate comparisons to a fascist salute. &#8220;Some elections are important, some are not, but this one really mattered. And I just want to say thank you for making it [&#8230;]","url":"https://variety.com/2025/biz/news/elon-musk-controversy-hand-gesture-trump-inauguration-1236279573/","image":"https://variety.com/wp-content/uploads/2025/01/GettyImages-2194418262.jpg","video":null,"publish_date":"2025-01-21 00:23:30","author":"Jack Dunn","authors":["Jack Dunn"],"language":"en","source_country":"us","sentiment":0.545},{"id":282129618,"title":"President Trump’s inauguration is marked with celebration and protest across Southern California","text":"Love him or loathe him, President Donald Trump’s inauguration on Monday, Jan. 20, had Californians across Southern California marking the day in ways as diverse as the region itself.\n\nIn Tustin, the air was crisp, but the atmosphere festive. John Kelly, 63, opened the spacious courtyard behind his Kelly’s Hair Design to around 30 guests eager to celebrate the transition of power.\n\n“I’m just so happy Donald Trump has gotten back in,” said the longtime businessman, donning a red MAGA baseball cap, “because he said he’s going to look out for the little guy.”\n\nCigar smoke and the buttery scent of popcorn — popped in a machine adorned with “Trump 2024” and “Make America Great Again” stickers — wafted through the air as Kelly’s friends and family huddled around an old Panasonic TV, their necks craned to witness the moment. Beside the TV stood a life-size cardboard cutout of first lady Melania Trump and the president, whose imaginary hand a guest shook after Trump’s swearing-in.\n\nThe guests, who had been silent and intently watching the TV, erupted when Trump uttered the final words of his oath, “So help me God.” Fists punched the air, guests exchanged hugs and congratulations, and handshakes were shared all around.\n\nBut not everyone was celebrating.\n\nProtests broke out across Southern California, including in Los Angeles and outside San Bernardino City Hall, where 26-year-old Desmond Manuel, a student organizer of the Party for Socialism and Liberation, led the charge.\n\nManuel said the demonstration was against Trump’s “anti-worker, anti-immigrant and anti-women billionaire agenda.”\n\n“We are also here today to honor and celebrate the legacy of Dr. Martin Luther King Jr. on this significant day. Dr. King’s legacy … remains far more important than the inauguration of Donald Trump,” he said.\n\nOver 100 protesters gathered outside City Hall, holding signs as security guards surrounded the area. Many wore red PSL shirts; others waved cultural flags.\n\nSpeakers led chants of “money for jobs and education” as the crowd roared in response. When one speaker announced, “a new president just got inaugurated a couple of hours ago into office,” the crowd erupted in boos.\n\n“It’s not enough to just sit back and watch all the crazy news about the Trump administration and complain about it on social media. I wanted to stand tall with my friends today and take real action,” said Angela Prairie, 18, of Redlands.\n\nTo the west, in Los Angeles, protesters railed against fascism and corporate greed. Some even created a paper mache effigy of Trump alongside billionaires Elon Musk and Jeff Bezos, who had prime seats at the inauguration.\n\nOne protester, identifying as Maebe A., said they were upset when Trump said the federal government would only recognize male and female genders.\n\n“I already knew I was going to be out here,” said Maebe, a transgender person from West Hollywood. But after Trump’s remarks, they said, “I was reminded why I need to be here.”\n\n“If the government doesn’t recognize us, we still exist either way, whether or not they acknowledge us,” they said.\n\nMeanwhile in Tustin, Kelly, in between chatting with guests and scooping popcorn into bags, spoke about his hope that Trump would revitalize small businesses. Kelly, who ran a cigar shop on the family-owned property, blamed high tobacco taxes under former President Barack Obama for its 2011 closure.\n\n“When you look around here in Orange County, a lot of brick-and-mortar merchants have gone the way of the dodo bird. They’re extinct,” said Kelly, a former council member. “Something that’s being lost in this world is a small retail merchant. So I hope that with the presidency of Donald J. Trump, he can listen to the common man.”\n\n(Kelly was at the Capitol on Jan. 6, 2021. He was not charged with a crime and said he was part of “the peaceful crowd” in Washington that day.)\n\nKelly’s sister, Karen Kelly, clasped her hands as she listened to Trump’s speech. God “spared his life” last July to “make America great again,” she said.\n\nAbout 70 miles east of Tustin, the Golden State Republican Women met Monday morning at Riley’s Farm, a family-owned farm in Oak Glen known for its colonial-style living history experience in the San Bernardino Mountains.\n\nThe watch party sold 140 tickets, filling the dining area at Riley’s Farm. Guests enjoyed breakfast, coffee and mimosas and gave a standing ovation when Trump appeared on screen.\n\nThe audience was decked out in a sea of MAGA hats, with many wearing red, white and blue. Trump signs adorned the walls alongside American flags, while some attendees sported sparkly red cowboy boots and hats.\n\nJanet Price, founder and president of the Golden State Republican Women, said it’s fun to gather with like-minded individuals to celebrate.\n\n“It was packed at 7:30 this morning,” Price said. “These are very patriotic, enthusiastic people … and this whole candidacy, we saw things we didn’t expect to see. He (Trump) did things he never expected to do, such as getting shot. All that showed character.”\n\nPrice said she’s been interested in politics since she was a teenager and has always identified as a conservative Republican.\n\n“This is the time I’ve kind of waited for,” she said. “It’s like my whole life, this is it. I’m very grateful.”\n\nThe crowd was lively, cheering loudly for Trump and booing when now-former President Joe Biden appeared on screen. In both Oak Glen and Tustin, crowds erupted into cheers when Trump declared a national emergency at the southern border.\n\nBut Costa Mesa resident Steve “Bugs” Giglio, 74, while fully supportive of Trump, expressed concern about what could happen to undocumented immigrants who have been in the country for a long time, including those protected under Deferred Action for Childhood Arrivals, an Obama-era policy that allows eligible undocumented immigrants who were brought to the country as children to work and protects them from deportation.\n\n“The two biggest issues for me are inflation and immigration,” Giglio said as he poured himself some orange juice at John Kelly’s party. “But I hope that he’s fair and doesn’t overdo it and start kicking out the kids that have lived here for 20 years.”\n\n“That kind of stuff is not good. We’ll see how he does with that.”\n\nMany partygoers in Los Angeles County said they look forward to Trump cracking down on illegal immigration.\n\nBryan Alvarado, 22, of Paramount, voted for the first time last year, saying he was never interested in politics until the Biden administration. He said he believes Trump will improve relations with Russia and China and wants him to fix the economy and close the U.S.-Mexico border.\n\n“As a Hispanic, I will say this: deport all illegal immigrants,” he said, later adding, “I’m just glad he (Trump) puts Americans first before foreigners.”\n\nAbout 150 people packed into Hacienda Playa, a Mexican restaurant in Playa del Rey, to watch the inauguration over breakfast.\n\nThat event, which doubled as a fundraiser for the 61st Assembly District race, offered a buffet with scrambled eggs, sausages, homestyle potatoes, rice, beans, fruit salad and cinnamon rolls.\n\nThe first 20 people who showed up received free MAGA hats. Many sported Trump-themed apparel, including one man who donned a jersey with No. 45 on the back, referencing Trump’s previous term as the 45th president.\n\nThe loudest crowd reaction came when Trump declared the U.S. government would only recognize two genders, sparking a standing ovation from some in the crowd. Applause also followed his promises to bring back military personnel who refused the COVID-19 vaccine and rename the Gulf of Mexico the “Gulf of America.”\n\n“This is the happiest moment of my life,” Alvarado said, clutching a folded American flag to his chest.\n\nMark Lindbergh from Hawthorne brought his sons, 25 and 21, to the breakfast, even though they could’ve watched the inauguration at home. He said he wanted to soak in the camaraderie of being around fellow Republicans.\n\n“I wanted to show them (my sons) America’s back, and when we’re down, there’s always hope,” said the father of seven.\n\nLindbergh, a consistent Trump voter, said he was glad to hear the president mention the devastating L.A. wildfires in his inaugural speech.\n\nSo was Anthony Abe, 37, of Inglewood, who said it meant a lot because “the majority of California do not support him,” yet Trump “still made time in his speech” to mention California.\n\n“That means he cares a lot,” said Abe.\n\nOlivia Valentine, a former Hawthorne council member and chair of the Hawthorne-Lawndale-Gardena Republican Assembly, criticized the state’s policies on homelessness, public safety and wildfire prevention and said she hopes Trump will have on influence on them.\n\n“What I’m hoping is there will be enough of a groundswell to put pressure on the state legislature here to make better policies,” she said. “I’m sure he’s got a lot of ideas that the state should listen to,” including related to clearing brush to prevent wildfires.\n\nTrump has said he will visit Los Angeles on Friday to survey the damage from the Palisades and Eaton fires.","summary":"Some donned red, white, and blue and celebrated the 47th president. Others filled the streets in protest of another Trump presidency.","url":"https://www.ocregister.com/2025/01/20/president-trumps-inauguration-is-marked-with-celebration-and-protest-across-southern-california/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/OCR-L-IDEVENTS-0121-01-PB-1.jpg?w=1024&h=644","video":null,"publish_date":"2025-01-21 00:23:25","author":"Arianna Clay,Hanna Kang,Linh Tat,Madison Hart","authors":["Arianna Clay","Hanna Kang","Linh Tat","Madison Hart"],"language":"en","category":"politics","source_country":"us","sentiment":0.115},{"id":282134688,"title":"Boris Johnson on Donald Trump’s speech: ‘This completed the most spectacular comeback of all time’","text":"Camera IconUS President Donald Trump speaks during inauguration ceremonies in the Rotunda of the US Capitol. Credit: EPA\n\n opinionBoris Johnson on Donald Trump’s speech: ‘This completed the most spectacular comeback of all time’\n\nBoris JohnsonDaily MailJanuary 21, 2025 8:23AMComments","summary":"BORIS JOHNSON: Sitting feet away in the rotunda of the Capitol building, I saw the moment the world’s wokerati had worked so hard to prevent.","url":"https://www.perthnow.com.au/politics/donald-trump/boris-johnson-on-donald-trumps-speech-this-completed-the-most-spectacular-comeback-of-all-time-c-17454585","image":"https://images.perthnow.com.au/publication/C-17454585/57625880e659aae135a03fca2c134ba8c03ff966-16x9-x0y0w6000h3375.jpg?imwidth=1200","video":null,"publish_date":"2025-01-21 00:23:25","author":"Boris Johnson","authors":["Boris Johnson"],"language":"en","category":"politics","source_country":"AU","sentiment":0.7},{"id":282133098,"title":"Boris Johnson on Donald Trump’s speech: ‘This completed the most spectacular comeback of all time’","text":"Never mind whether or not he actually touched that Bible. At 12.01pm Eastern Standard Time, the invisible pulse of power surged from the battered volume into those five frankly normal-sized digits of the right hand of Donald John Trump.\n\nAnd it happened. Sitting feet away in the rotunda of the Capitol building I saw the moment the world’s wokerati had worked so hard to prevent.\n\nI saw the resurrection of the man they despised and reviled — the second inauguration that so many believed was morally, politically, legally, perhaps even biologically, impossible. In taking that oath — with Melania by his side in her blue boater — Donald Trump became not just the 45th but also the 47th president and completed the most spectacular political comeback of all time.\n\nHis speech ranged from surging optimism to pure bullishness of a kind seemingly calculated to have his opponents chewing the carpet.\n\nHe began with an almost crooning gentleness. A golden age had begun, he announced, leaning over the podium, and looking sideways at us.\n\n“There is sunlight streaming all over the world,” he whispered, and as we looked up at the immense cupola above us we saw how obedient rays of sunshine seemed just then to break through the windows.\n\nAnd then gradually he started turning up the volume of his boasts.\n\nWith the tech titans of America ranged behind him – some of them now notably more deferential than they were — he proclaimed that the next four years would be the greatest in American history. Elon Musk, Jeff Bezos, Mark Zuckerberg, Tim Cook — all of them were sitting right behind Trump, as if to assert the new symbiosis between the president and the super-oligarchs of America. They all clapped.\n\nTo wild acclaim, he vowed to crush inflation, kick out illegal immigrants, restore American manufacturing industry and plant the Stars and Stripes on Mars.\n\nHe was somehow going to reclaim American control of the Panama Canal – an announcement that got a pretty stony reception from the ex-presidents behind him.\n\nHe was going to tear up the restrictions on American oil and gas and his message to the hydrocarbons industry was drill baby, drill.\n\nAgain, this did not seem to be going down big with Joe Biden and Kamala Harris.\n\nIt moved his supporters to paroxysms of excitement. Henceforward he pledged that there would only be two genders recognised by the US government – male and female. This got another standing ovation.\n\nIn fact almost everything got a standing ovation – and it got to the point where I started to follow the example of one of the well-groomed young Trump children in front of me, who only seemed to rise to his feet on very special occasions.\n\nAs we came towards the climax of the speech, Trump made a point about America – that it encourages its citizens to try to achieve the impossible. In America, unlike other countries, they can succeed.\n\n“The impossible is what we do best,” he said, and to prove the point he cited, naturally, his own career – his astonishing political revival. Looking at the facts, it is hard to disagree.\n\nThis is a 78-year-old man who has beaten umpteen legal cases against him, most of them vexatious and all of them purely designed to keep him off the ballot. He has fought day in, day out for four years to reclaim the presidency.\n\nHe has spoken at hundreds of rallies and public events, weaving his monologues until he is hoarse with the effort. He has tweeted inexhaustibly in his own inimitable voice.\n\nHe has reached out to groups that distrusted him – and gradually won them round.\n\nBy dint of a phenomenal work ethic, and a refusal to give up, he has become only the second man in history to serve two nonconsecutive terms as president.\n\nIn November he became the first Republican in 20 years to win the popular vote.\n\nAbove all, he showed his mettle when he missed death by a millimetre, as a high-velocity bullet hit his ear at a rally in Pennsylvania.\n\nWhich of us would have the guts to get up – as he did – and with bloodstreaked face urge his supporters to “fight, fight, fight”?\n\nTrump had concluded, he told us, that the Lord had intervened. In what must rank as one of the most alpha-male statements of all time, he said that he had been personally saved by God to make America great again.\n\nNo one dissented from this extraordinary proposition. On the contrary, they gave him yet another standing ovation.\n\nThere were many people in that audience who believed it to be literally true: that Trump now ranks with the great figures immortalised in the canvases and statues around the room.\n\nWashington, Lincoln – and now Trump, a man sent to fulfil the manifest destiny of the United States.\n\nIt is hard to overstate the excitement and confidence that is being engendered in Washington by the second coming of Trump, this realtor-turned-reality TV star.\n\nOn Wall Street, Trump’s bullishness and confidence are communicating themselves to the markets – and for the foreseeable future, American growth will exceed that of the UK and the rest of Europe. But it isn’t just the rich who are turning to Trump – and it certainly wasn’t the rich who turned out in their droves yesterday in the vicinity of the Capitol, in temperatures of minus three, to wave their red MAGA flags and to catch a glimpse of their hero.\n\nFor hundreds of millions of Americans, the orange-quiffed billionaire is a man who sees things as they do – and who shares their pain and their anxieties. He is also a man who can truly get things done.\n\nThey believe he can defeat the drugs cartels, and fix the problem of illegal immigration.\n\nThey believe him when he says he can make America respected around the world. This weekend they had another gigantic proof point of Trump’s effectiveness: in the deal between Israel and Hamas, and the release of the first hostages.\n\nNo one here believes that would have happened without Trump’s intervention.\n\nAnd for millions of others – in the US and around the world – that speech will, of course, have done nothing to allay their fears.\n\nThey will fasten on his loose language about taking back Panama. They will obsess about his seeming indifference to global warming, and his encouragement of fossil fuels.\n\nThey will worry that by insisting on America’s absolute right to free speech, he will somehow encourage a new and brutish culture of verbal aggression. Above all, they will be perturbed by his complete silence on the subject of Ukraine – the biggest war in Europe for 80 years.\n\nWhat does it mean? Will Trump abandon this entirely innocent country – and hand a victory to Putin?\n\nWell, we will see – but I remain firmly among the optimists.\n\nWhatever Trump says about drilling, his most important adviser is Elon Musk, who champions clean transport and believes that the entire electricity needs of the US could be satisfied by 100 square miles of solar panels.\n\nTrump talks a lot about tariffs – but he did that last time, and ended up doing a free trade deal with China.\n\nThe British Government should get its act together, and come up with a similar free trade deal.\n\nThe Trump administration is ready in a way that Biden simply was not.\n\nAs for Ukraine, I cannot for one second believe that Trump would allow America – and the West – to be humiliated by a capitulation to Vladimir Putin.\n\nAs the ceremony ended to shouts of ‘USA, USA’, Trump clenched his fist and departed – to sign 200 executive orders with his seismograph signature.\n\nAll human institutions need a leader, and the world is no exception. For better or worse, America is the leader of our planet, and on the whole things go better when that leadership is strong.\n\nThat strong leadership is what Trump is evidently determined to give.","summary":"BORIS JOHNSON: Sitting feet away in the rotunda of the Capitol building, I saw the moment the world’s wokerati had worked so hard to prevent.","url":"https://thewest.com.au/politics/donald-trump/boris-johnson-on-donald-trumps-speech-this-completed-the-most-spectacular-comeback-of-all-time-c-17454585","image":"https://images.thewest.com.au/publication/C-17454585/57625880e659aae135a03fca2c134ba8c03ff966-16x9-x0y0w6000h3375.jpg?imwidth=1200","video":null,"publish_date":"2025-01-21 00:23:25","author":"Boris Johnson","authors":["Boris Johnson"],"language":"en","category":"politics","source_country":"au","sentiment":-0.107},{"id":282132842,"title":"Trump signs order to end ‘government censorship’ of social media","text":"President Donald Trump on Monday signed an executive order intended to “immediately stop all government censorship,” a sweeping action that could chill years of efforts to combat the proliferation of false information online.\n\nThe order bans federal officials from any conduct that “would unconstitutionally abridge the free speech of any American citizen.” It also prohibits taxpayer resources from being used to “unconstitutionally abridge the free speech” of Americans.","summary":"President Donald Trump signed an executive order intended to stop “government censorship,” a sweeping action that could chill years of efforts to combat the proliferation of false information online.","url":"https://www.washingtonpost.com/politics/2025/01/20/trump-free-speech-executive-order-censorship/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2JKO7TIW5NVY6XEYANVYKVVKW4_size-normalized.jpg&w=1440","video":null,"publish_date":"2025-01-21 00:23:11","author":"Cat Zakrzewski","authors":["Cat Zakrzewski"],"language":"en","category":"politics","source_country":"us","sentiment":-0.458},{"id":282131600,"title":"Musk's hand gesture during Trump inauguration festivities draws scrutiny","text":"WASHINGTON : Billionaire Elon Musk's hand gesture while he spoke during a celebration of President Donald Trump's inauguration drew online comparisons to a Nazi salute on Monday, but a leading tracker of antisemitism said it appeared to represent a moment of enthusiasm instead. \n\nMusk took the Capital One Arena stage in Washington to huge cheers, pumping his arms and shouting, \"Yesssss.\"\n\n\"This was no ordinary victory. This was a fork in the road of human civilization,\" he said. \"This one really mattered. Thank you for making it happen! Thank you,\" he said. \n\nBiting his bottom lip, he thumped his right hand over his heart, fingers spread wide, then extended his right arm out, emphatically, at an upward angle, palm down and fingers together. Then he turned and made the same hand gesture to the crowd behind him. \n\n\"My heart goes out to you. It is thanks to you that the future of civilization is assured,\" he said as he finished the gesture. \n\nThe gestures were quickly scrutinized online. \n\n\"Did Elon Musk Sieg Heil at Trump's inauguration?\" asked the Jerusalem Post. \n\nThe Anti-Defamation League, which tracks antisemitism disagreed. \"It seems that @elonmusk made an awkward gesture in a moment of enthusiasm, not a Nazi salute, but again, we appreciate that people are on edge,\" it posted on Monday. \n\nSpokespeople for Musk and Trump did not immediately reply to requests for comment.\n\nSoon after his speech, Musk posted a Fox video clip of portions of his speech on his social media network X, that cut away from the podium when he made the first gesture while facing the cameras. \"The future is so exciting,\" he wrote above it. \n\nSome X users came to Musk’s defense, claiming that Musk was expressing “my heart goes out to you” and criticizing posts that suggested otherwise.\n\nMusk has backed the far-right Alternative for Germany (AfD), an anti-immigration, anti-Islamic party labeled as right-wing-extremist by German security services, in an upcoming national election. He hosted a broadcast with the party's leader on his social media platform earlier this month.","summary":"","url":"https://www.channelnewsasia.com/business/musks-hand-gesture-during-trump-inauguration-festivities-draws-scrutiny-4885726","image":"https://dam.mediacorp.sg/image/upload/s--Zgm7WwJR--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-21t002417z_1_lynxnpel0k00l_rtroptp_3_usa-trump-inauguration.jpg?","video":null,"publish_date":"2025-01-21 00:21:43","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.074},{"id":282133088,"title":"Trump makes strong statement to Biden in first executive order upon returning to office","text":"President Donald Trump declared ‘now, the work begins’ at his inaugural parade in Washington and immediately delivered by signing an executive order to cancel former President Biden’s executive actions. \n\n‘You are now witnessing the dawn of the golden age of America,’ he declared to great applause. ‘We’re not going to put up with that crap anymore.’\n\nTrump turned his rally at a downtown Washington arena into a signing ceremony as he grabbed his pen and issued multiple executive actions to institute major policy changes. \n\nHe told the crowd actions were coming on retaining federal documents and pardoning the people charged in the riot on the Capitol on Jan. 6, 2021. \n\nThe president said he would sign pardons back at the White House and indicated those convicted would be released Monday. He claimed they didn’t do something wrong and referred to them as hostages.\n\nTrump officially halted 78 Biden-era executive orders, announced a regulatory freeze preventing bureaucrats from issuing regulations until the Trump administration has full control of the government and a freeze on all federal hiring except for military and a few other essential areas.\n\nHe also ordered a requirement that federal workers return to full-time in-person work, a directive to every department and agency to address the cost of living crisis, and announced withdrawal from the Paris climate treaty.\n\nTrump also signed a government order restoring freedom of speech and preventing censorship of free speech and one ending the ‘weaponization of government against the political adversaries of the previous administration’\n\nSome of the orders he signed first including a Biden border bill, a regulatory freeze and a freeze on federal hiring. \n\nThe setup included a small desk, chair and microphone, where Trump was sitting to attach his signature to official actions.\n\nHe showed off his signature as he signs an initial round of executive orders before tossing the pens into the crowd. \n\nTrump declared at his indoor parade that he will sign pardons for ‘a lot of people’ who were convicted for the attack on the U.S. Capitol as the crowd cheered enthusiastically.\n\n‘We won, we won, but now the work begins,’ Trump said to start his remarks at the end of the parade in the packed Capitol One Arena in Washington, DC.\n\nThe president during his wide-ranging remarks also attacked special counsel Jack Smith and complained about being investigated.\n\nThe president mentioned that Biden pardoned his family members on Monday, one of his final acts as president. The crowd booed as the president said it happened while Trump was making his speech at the U.S. Capitol.\n\n‘Has anyone ever heard of Kamala?’ Trump also said as he relived his 2024 election victory before the crowd of supporters.\n\nTrump was introduced at event by special envoy Steve Witkoff after a touching moment where he shook hands with the families of hostages taken from Israel during the attack on October 7, 2023.\n\nDuring his address, Trump went into graphic detail about the carnage of the attack on Israel and repeated it shouldn’t ever have happened multiple times as he rambled.\n\nThe president went on to thank the crowd who came to witness the parade and praised those participating.\n\n‘You’re witnessing the dawn of the golden age of America,’ Trump said to the still packed room.\n\nHe also specifically thanked members of his family including the first lady, his children and grandchildren. \n\nSon Barron Trump received perhaps the loudest applause of the group as his dad mentioned how tall he is.\n\nEric Trump raised his fist as the crowd chanted his name, and Ivanka Trump blew kisses.\n\nKai Trump, the president’s eldest grandchild and daughter of Donald Jr., also waved to the crowd. \n\nTrump and the first lady along with Vice President Vance and his family all entered the arena through the crowd. \n\nAt times the military band played and during another moment people tried to get the wave going and snacked on concession stand foods.\n\nThe announcer acknowledged that the format was different for a parade from what people are used to.\n\nTrump’s family members filed into the room and stood in the first row of a three-row viewing box behind the stage as people clapped.\n\nThe family members took the stage, lining up to shake hands with Trump.\n\nA few individuals along the aisle got to greet the president directly as he entered the room.\n\nThe president announced intentions to immediately sign pardons for those imprisoned from January 6, work on bringing back Israeli hostages and several other policy priorities. \n\nFamilies of hostages from Israel attended the inauguration parade, including several with family members still in captivity and others whose loved ones have died.\n\nSteve Witkoff, Trump’s appointee for special envoy for peace in the Middle East, kicked off the speaking portion following the parade by celebrating the return of three Israeli hostages Sunday.\n\n‘For the former hostages here today, welcome home,’ Trump said after being introduced by Witkoff.\n\nBy the time Trump arrived in the building, the crowd was growing antsy. People who waited hours could be heard shouting ‘we want Trump’ after waiting most of the afternoon while he wrapped up at the U.S. Capitol.\n\nThe police and first responders from Butler County, PA started out the parade as they paid homage to Corey Comperatore who was killed in the assassination attempt on Trump in July. Comperatore’s fireman jacket was carried during the parade and a moment of silence was held in his memory.\n\nOthers participating it the parade were the New York Military Academy, Palm Beach Police and Fire Rescue, the New York City Police Department Emerald Society Pipes and Drums, the Florida Firefighters Pipes and Drums and the Middletown, Ohio high school marching band, which all marched in a loop around the arena floor.\n\nVance graduated from Middletown High School in 2003. The community raised more than $140,000 through private donations and grants to send students from Vance’s hometown to Washington. \n\nAfter the inauguration was moved inside, supporters who traveled to Washington, D.C., from all over the country waited in line starting the night before to get into the Capital One Arena. \n\nThe arena hosted a viewing party for Trump’s swearing in ceremony before he made his way to the event to kick off the official Inaugural parade Monday afternoon.\n\nInside the arena, Trump fans were decked out in a sea of red MAGA hats and other Trump branded apparel. \n\nA number of people wore star-spangle suits and American flag adorned outfits, waving Trump signs and American flags despite the cold air pumping through the room.\n\nDuring the ceremony, people in the largely packed arena were able to watch the event on the big screens in the center of the room as large red and gold electronic banners displayed the words ’60th Presidential Inauguration’ overhead.\n\nAs Trump, the first lady, his family and other MAGA favorites like Pete Hegseth, Elon Musk and Tulsi Gabbard showed up on the screen, the crowd in the just over 20,000 seat arena cheered.\n\nWhen President Biden, former Secretary Hillary Clinton, other Democrats and former Vice President Mike Pence appeared on the screens, Trump’s supporters booed. For Pence, a man could be heard shouting ‘traitor’ while there were a few chants of ‘lock her up’ for Clinton.\n\nDuring Trump’s inaugural address, lines about declaring an emergency at the border, only having two genders, the U.S. entering a ‘golden age’ and god saving his life received wild applause.\n\nAs the president walked Biden out to depart Washington outside the capitol, people could be heard singing ‘na na na na, hey hey hey, goodbye.’\n\nWhen Trump spoke of January 6 during his informal remarks after the ceremony, people at the arena remained in their seats to watch. They laughed at his jokes, booed his critics when their names were mentioned and remained enraptured for the speech that had some of his more popular rally lines.\n\nPeter Navarro, Kellyanne Conway, Governor Sarah Huckabee Sanders and other Trump allies were in the arena to warm up the crowd ahead of Trump’s remarks.\n\nElon Musk also made an appearance saying ‘his is what victory feels like,’ as he dancing onto the stage.\n\nHe called it a ‘fork in the road of human civilization’\n\n‘This one really mattered,’ he said of the election and thanked Trump’s supporters for ‘making it happen’\n\n‘It is thanks to you that the future of civilization is assured,’ Musk said.\n\nHe also vowed to ‘take DOGE to Mars.’\n\nDuring his remarks, the crowd started chanting ‘Elon, Elon.’\n\nHe said he is super fired up for the future and would work his a** off for them.\n\n‘Man I cannot wait,’ Musk said of the future.\n\nNavarro praised supporters for waiting in line in the cold Monday morning. He also spoke about going to prison but claimed the people he met in prison never did anything as bad as Dr. Anthony Fauci or Alvin Bragg.\n\nConway said the Trump sequel is going to be a ‘kicka** better than the original.’ For the event she was wearing the same red, white and blue coat she wore for Trump’s first inauguration.\n\nCongressman Ronny Jackson (R-Texas) spoke about it being the best day ever and vowed Trump is ‘taking it all back.’\n\nHuckabee Sanders said it was surreal to be back in Washington. She said GOP governors have been holding the line until Trump was back in the White House.\n\nCongressman Byron Donalds (R-FL) called Trump’s inauguration speech the best inauguration speech ever.\n\n‘We did it everybody,’ said conservative activist Charlie Kirk taking the stage to rancorous cheers.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump declared &#8216;now, the work begins&#8217; at his inaugural parade in Washington&#8230;\n\n\nThis Post: Trump makes strong statement to Biden in first executive order upon returning to office first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-makes-strong-statement-to-biden-in-first-executive-order-upon-returning-to-office/","image":"https://i.dailymail.co.uk/1s/2025/01/21/00/94325641-0-image-a-47_1737417864197.jpg","video":null,"publish_date":"2025-01-21 00:20:26","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":282129616,"title":"Abrupt end to border app that brought nearly 1 million to US strands many in Mexico","text":"By JULIE WATSON and MEGAN JANETSKY\n\nTIJUANA, Mexico — They came from Haiti, Venezuela and around the world, pulling small rolling suitcases crammed with clothing and stuffed animals to occupy their children. They clutched cellphones showing that after months of waiting they had appointments — finally — to legally enter the United States.\n\nNow outside a series of north Mexico border crossings where mazes of concrete barriers and thick fencing eventually spill into the United States, hope and excitement evaporated into despair and disbelief moments after President Donald Trump took office. U.S. Customs and Border Protection announced Monday that the CBP One app that worked as recently as that morning would no longer be used to admit migrants after facilitating entry for nearly 1 million people since January 2023.\n\nTens of thousands of appointments that were scheduled into February were canceled, applicants were told.\n\nThat was it. There was no way to appeal, and no one to talk to.\n\nIn Tijuana, where 400 people were admitted daily on the app at a border crossing with San Diego, Maria Mercado had to work up the courage to check her phone.\n\nTears ran down her cheeks after she finally looked. Her family’s appointment was for 1 p.m., a few hours too late.\n\n“We don’t know what we are going to do,” she said, standing with her family within view of the United States.\n\nShe left Colombia decades ago after it was overrun by drug cartel violence, heading to Ecuador. When cartels besieged her new homeland, the family fled again, in June, this time to Mexico, hoping to reach the U.S.\n\n“I’m not asking the world for anything — only God. I’m asking God to please let us get in,” she said.\n\nCBP One has been wildly popular, especially with Venezuelans, Cubans, Haitians and Mexicans. Now, they were stranded at the U.S. border or deeper in Mexico.\n\nJairol Polo, 38, tried getting an appointment for six months from Mexico City before snagging one for Wednesday in Matamoros, across from Brownsville, Texas. The Cuban man flew Monday from Mexico’s capital to learn at the Matamoros-Brownsville border crossing that his appointment was canceled.\n\n“Imagine how we feel,” he said dejectedly while smoking a cigarette.\n\nPeople with morning appointments got through on schedule. Andrum Roman, a 28-year-old Venezuelan, was in the last group to cross the border with the CBP One in Ciudad Juarez, across from El Paso, Texas.\n\n“We are a little safer now because we are here,” he said just before handing over his documents to U.S. authorities. “But you still don’t know what’s going to happen,” he said.\n\nAnother Venezuelan, Rober Caruzi, entered El Paso right behind him. “I reached the border twice and I was returned twice, but I didn’t lose hope,” he said.\n\nBy afternoon, the app was down.\n\nCBP One is effectively a lottery system that give appointments to 1,450 people a day at one of eight border crossings. People enter the U.S. on immigration “parole,” a presidential authority that former President Joe Biden used more than any other president since it was introduced in 1952.\n\nIts demise follows Trump’s campaign promises, and will please its critics, who see it as an overly generous magnet attracting people to Mexico’s border with the United States.\n\nDespite a glitchy launch in January 2023, it quickly became a critical piece of the Biden administration’s border strategy to expand legal pathways while cracking down on asylum for people who enter illegally. Supporters say it brought order amid the tumult of illegal crossings.\n\nMany migrant shelters in Mexico are now occupied largely by people who tapped their phones daily hoping for an appointment. U.S. Customs and Border Protection says about 280,000 people try daily for the 1,450 slots.\n\nThe demise of CBP One will be coupled with the return of “Remain in Mexico,” a remnant of Trump’s first term that forced about 70,000 asylum-seekers to wait in Mexico for hearings in U.S. immigration court.\n\nMatthew Hudak, who retired last year as deputy chief of the Border Patrol, said the demise of CBP One could encourage people to cross illegally. To be effective, it must be coupled with something like “Remain in Mexico,” he said.\n\n“The message with CBP One being shut down is basically, ‘Hey we’re not going to allow you to show up; the doors are not going to be open.’ For that to be meaningful, there has to be some level of consequence if you bypass any lawful means and you’re doing it illegally,” he said.\n\nNews of CBP One’s abrupt end shocked migrants across Mexico.\n\nJuan Andrés Rincón Ramos, a 19-year-old Venezuelan, cried with joy in early January when he got an asylum appointment through CBP One after months of trying. It was a lurch of hope after five years living in Peru and seven months in Mexico struggling to reach the U.S., where his brother lives in Pittsburgh.\n\nIn the makeshift Mexico City migrant camp where he lives, the fantasy of a life he dreamed for himself evaporated when he got the notification that his appointment had been canceled.\n\n“It was a moment of hope, but it didn’t last,” he said. “Everyone trusted in the American dream, but we were all wrong.”\n\nJanetsky reported from Mexico City. Associated Press journalists Tim Sullivan in Minneapolis, Elliot Spagat in San Diego, Valerie Gonzalez in Matamoros, Mexico, and Martin Silva in Ciudad Juarez, Mexico, contributed.","summary":"CBP One has been wildly popular, especially with Venezuelans, Cubans, Haitians and Mexicans. Now, they were stranded at the U.S. border or deeper in Mexico.","url":"https://www.ocregister.com/2025/01/20/abrupt-end-to-border-app-that-brought-nearly-1-million-to-us-strands-many-in-mexico/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/Trump_Immigration_76714_d7bdaa-e1737418870975.jpg?w=1024&h=577","video":null,"publish_date":"2025-01-21 00:19:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.288},{"id":282131952,"title":"Marco Rubio Unanimously Confirmed by Senate as Donald Trump’s Secretary of State","text":"Marco Rubio has been confirmed by the Senate as the country’s next secretary of state. \n\n The nomination of the senior senator from Florida, 53, was confirmed on Monday, Jan. 20, hours after Donald Trump took the oath of office as the 47th president.\n\n The vote was a unanimous and bipartisan 99-0 result, per the Associated Press. Florida Gov. Ron DeSantis chose state Attorney General Ashley Moody to fill the last two years of Rubio's Senate term last week.\n\n Rubio's confirmation hearing was mostly uneventful, with even Democratic Senators voicing support for his nomination. New Hampshire Sen. Jeanne Shaheen called Rubio “well-qualified to serve as secretary of state,\" per CNN.\n\n Five nominees were scheduled to receive votes from confirmation hearing committees, including Rubio. Others include John Ratcliffe for CIA director in the Intelligence Committee, Pete Hegseth for defense secretary in the Armed Services Committee, and both Russell Vought for White House budget director and Kristi Noem for homeland security secretary in the Homeland Security and Governmental Committee, according to NBC News.\n\n Noem's nomination was advanced with a 13-2 vote, while Vought's nomination was advanced 8-7, reports NBC News.\n\n Earlier on Monday, Senate majority leader John Thune (R-S.D.) shared his perspective on the day’s task at hand.\n\n \"We have a job to do, and advice and consent is part of it,” Thune said on the Today show. “So, we’re going to take that role seriously. Our senators take that role seriously, Republican and Democrat, and we will. But we also understand that we have a job to do, and I think it was spelled out very clearly by the voters in November.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n For Hegseth, the road to confirmation may be a lengthier one. On Monday, the Senate Armed Services Committee voted 14-13 on party lines to advance his nomination.\n\n Last week, the nominee was the subject of a tense and polarizing debate in his Senate confirmation hearing.\n\n As senators probed into a long history of accusations against him, Hegseth fought off allegations of misconduct, sexual assault and alcohol abuse — many of which resurfaced in the time since Trump nominated him.","summary":"The senior senator from Florida was confirmed by a 99-0 vote","url":"https://people.com/marco-rubio-confirmed-by-senate-as-donald-trump-secretary-of-state-8777428","image":"https://people.com/thmb/dhmbcAdzk-Y_-T4RCi5YdJ_o5Sk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/marco-rubio-confirmation-hearing-011525-1ca81d9a09cc42a3812682a8651d966f.jpg","video":null,"publish_date":"2025-01-21 00:17:35","author":"Anna Lazarus Caplan","authors":["Anna Lazarus Caplan"],"language":"en","category":"politics","source_country":"US","sentiment":0.05},{"id":282130914,"title":"Barron Trump Praised for Handshakes During Donald's Inauguration","text":"Barron Trump is being praised online for initiating handshakes with former President Joe Biden and former Vice President Kamala Harris during the inauguration of his father President Donald Trump on Monday.Why It MattersBarron, the youngest son of the president, was present while his 78-year-old father was inaugurated as the 47th president during a ceremony in the Capitol rotunda on Monday.The 18-year-old Trump's gesture towards Biden and Harris prompted a flurry of comments about his potential future political ambitions, which is already a frequent topic of speculation.What To KnowJust after Donald Trump was sworn into his second term by Supreme Court Chief Justice John Roberts, Barron Trump could be seen approaching Biden and Harris and shaking their hands while exchanging a few words with his father's presidential successor and predecessor. While it is unclear what was said, the exchange appeared to be friendly, with Biden smiling widely while they grasped hands.Following the gesture, the younger Trump walked a few feet and appeared to have a brief conversation with his mother, first lady Melania Trump. Clips of the handshakes were quickly shared on social media, prompting some Trump supporters to suggest that Barron would one day follow in his father's footsteps by becoming president himself.Newsweek reached out for comment to the White House via email on Monday.What People Are SayingConservative influencer Nick Sortor, in a post to X, formerly Twitter: \"Barron Trump just shook hands with Joe Biden and Kamala Harris. This kid will be our President one day. Bet on it.\"Kimberly Ross, a conservative columnist and contributor to The Washington Examiner, while sharing a video clip of the moment on X: \"Barron Trump shaking hands with Biden and Harris is a very classy act.\"Conservative reporter Taylor Hansen, on X: \"Looks like Barron Trump just went out of his way to shake both Joe's and Kamala's hand. Seems like a very respectful young man with all things considered.\"Joshua Charles, an ex-speechwriter for former Vice President Mike Pence, on X: \"Class act, Barron. Class act. Magnanimity is a forgotten virtue.\"Pro-Trump influencer \"Johnny MAGA,\" on X: \"Barron Trump just approached Biden and Kamala to extend handshakes. WOW.\"Jeff Storobinsky, an educator and analyst, on X: \"Correct me if I am wrong, but did only 1 son (Barron) do the right thing in shaking the hands of Former President Biden and former VP Kamala Harris ?\"What Happens NextIt is not clear that Barron Trump currently has any ambitions to follow in his father's footsteps by launching a political career. He is currently a freshman college student studying at New York University's Stern School of Business.","summary":"Barron Trump initiated handshakes with former President Joe Biden and former Vice President Kamala Harris on Monday.","url":"https://www.newsweek.com/barron-trump-inauguration-handshake-joe-biden-kamala-harris-2017997","image":"https://d.newsweek.com/en/full/2569246/barron-trump-inauguration-donald-trump-2025.jpg","video":null,"publish_date":"2025-01-21 00:17:21","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":0.01},{"id":282133086,"title":"King Charles Extends Congratulations to Donald Trump for His Inauguration, Commending the Special Relationship Between the UK and US","text":"King Charles has sent a personal congratulations message to President Donald Trump on his inauguration, ‘reflecting on the enduring special relationship between the UK and US’.\n\nThe monarch’s private words were sent to Mr Trump to congratulate him on being sworn into office as US president for a second time, Buckingham Palace has revealed.\n\nIt is understood all options remain possible for an incoming state visit by Mr Trump to the UK and a visit by Charles to the US, but no plans are currently in the diary.\n\nForeign monarchs, presidents or prime ministers are invited to visit the King on the advice and request of the Foreign and Commonwealth Office, with the decision down to the Government. \n\nWith the Republican politician making the most dramatic comeback in US political history, Charles and Mr Trump will be expected to encounter one another face to face once again during Trump 2.0, as his second term in office is being dubbed.\n\nCharles’ message comes as sources say the Royal Family will be considered a ‘priceless and powerful’ weapon of soft diplomacy in the future as Prime Minister Sir Keir Starmer and diplomats look to build bridges with the incoming US leader.\n\nSources say the King and senior royals will likely be deployed even ahead of government ministers to smooth over Anglo-US relations.\n\nMr Trump is well known for his love of the monarchy and the royal family plays a central role in the UK’s bond with the US. The US leader boasted he had ‘automatic chemistry’ with the late Queen, and has hailed the King as a ‘really wonderful guy’.\n\nThe two men have previously met twice and got on surprisingly well given their differing views on a number of world issues, including climate change.\n\nIn 2019, Charles and Camilla even had tea with President and his wife, Melania, at Clarence House and struck up what has been described as a ‘warm’ bond.\n\n‘In fact the President left saying what a pleasure it had been to meet the king and they stayed in touch for quite a while afterwards actually,’ said a source with knowledge of the meeting told the Mail.\n\nThe First Lady later revealed that she and the King also regularly wrote to one another too.\n\nPrince William also met with Mr Trump in Paris last month, with the president describing the royal as a ‘good man’ doing a ‘fantastic job’. Afterwards he said their half-hour chat at the residence of the British ambassador in Paris had been ‘great’.\n\nPresident Trump has never made a secret of his admiration for the Royal Family, particularly Queen Elizabeth, whom he called a ‘great, great woman’.\n\nHis late mother, Mary, was born in Scotland and installed in him huge affection and respect for the late monarch.\n\nThe president’s son, Eric Trump, also told the Mail last year: ‘I can tell you that our father and our entire family has tremendous respect for the monarchy. I do think one of the greatest, one of the most beautiful things in the UK, is actually the monarchy and what it stands for and what it symbolises.’\n\nKing Charles has met nine US presidents, beginning with Eisenhower in 1959.\n\nA source added: ‘If ever there were a time to have a head of state with a non-partisan relationship with him [the president] then now is the time to value it.\n\n‘You have continuity and a personal connection between the King, the President, the Queen and the First Lady. There’s a rapport moving forwards.’\n\nIn a new interview, Reform UK leader Nigel Farage called Mr Trump ‘the most pro-British president since Eisenhower’ and spoke of his love for the royals. \n\nThe president-elect, wearing a suit and dark red tie, shook his fist to photographers as he stepped out of the crowd. Melania, in a navy blue suit and matching hat with white trim, was at his side. Their son Barron walked with them.\n\nMr Farage said: ‘Trump as a teenager came to Scotland a lot and spent a lot of time there. He’s got his investments there, loves the royals – I mean on a level you can’t even believe. This is a very, very, very, very Anglophile president.’\n\nDonald Trump kicked off the ceremonies for his historic second inauguration alongside his wife Melania, son Barron, and his family at a church service on Monday.\n\nThe president-elect took the front row of St. John’s Episcopal Church – just a block away from the White House – and smiled to Vance, who was sat alongside wife Usha.\n\nThe Trump family joined them inside the church – Ivanka and Jared Kushner and their kids; Don Jr., his ex-wife Vanessa and their kids; Tiffany Trump and husband Michael Boulos; and Eric and Lara Trump and their two children.\n\nIncoming Vice President J.D. Vance and his wife Usha sat in the front pew with Donald, Melania and Barron.\n\nThe business world was well represented in church with media mogul Rupert Murdoch, as well as tech tycoons Elon Musk, TikTok CEO Shou Chew, Meta boss Mark Zuckerberg, Amazon’s Jeff Bezos and Apple’s Tim Cook all in attendance – as well as former UK Prime Minister Boris Johnson. \n\nMr Trump was also joined by Republican luminaries including Robert F. Kennedy Jr., Marco Rubio, Tulsi Gabbard, Sean Duffy, Rep. Mike Waltz, Pam Bondi, and Doug Burgum, with controversial Argentinian President Javier Milei also present.\n\nThere was a feeling among some of Mr Trump’s team that he was ‘snubbed’ by the royals during his first visit to the UK in 2018. \n\nCNN reported that Mr Trump apparently requested a trip to Buckingham Palace in one of the Queen’s gold-plated carriages. \n\nThat idea was vetoed by the security services and the UK Embassy.\n\nFearing protests – in the end more than 100,000 took to the streets to protest Mr Trump’s visit – they instead arranged for the Trumps to meet Her Majesty at Windsor. \n\nHowever, Prince William and Harry reportedly refused to meet with the then 45th president – as did the then-Prince Charles, according to some senior royal watchers. \n\nHowever, it appears the relationship between Charles and Mr Trump has warmed over time. \n\nAfter a meeting at Buckingham Palace in 2019 in which the pair discussed climate change at length, Mr Trump told Piers Morgan that he was ‘moved’ by Charles’ ‘passion for future generations’. \n\n ‘We were going to have a 15-minute chat. And it turned out to be an hour and a half. And he did most of the talking,’ Mr Trump said.\n\n‘What he really wants, and what he really feels warmly about is the future. He wants to make sure future generations have a climate that is good climate as opposed to a disaster and I agree.’\n\nIn July 2024 King Charles wrote to Mr Trump after he survived an assassination attempt, Buckingham Palace has confirmed.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKing Charles has sent a personal congratulations message to President Donald Trump on&#8230;\n\n\nThis Post: King Charles Extends Congratulations to Donald Trump for His Inauguration, Commending the Special Relationship Between the UK and US first appeared on Internewscast Journal","url":"https://internewscast.com/news/king-charles-extends-congratulations-to-donald-trump-for-his-inauguration-commending-the-special-relationship-between-the-uk-and-us/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-King-Charles-congratulates-Donald-Trump-on-his.jpg","video":null,"publish_date":"2025-01-21 00:17:08","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.419},{"id":282126968,"title":"Donald Trump announces hiring freeze and return-to-office order for federal workers; January 6 Capitol rioters to be pardoned","text":"Fact Check: Donald Trump’s inaugural speech examined\n\nThe United States spends more on its public healthcare system than any other country in the world\n\nWHAT WE KNOW\n\nThis is broadly true. The Centres for Medicare and Medicaid Services administer federal funding for healthcare in the United States and spending reached $1.8 trillion, or 7pc of gross domestic product (GDP), in 2023. This dwarfs spending for the total healthcare expenditure (public and private) of the entire European Union, which stands at 1.6 trillion euros ($1.67 trillion). Some poorer countries in the world spend more on healthcare per capita. However, the overall US public health spending is the highest in the world, despite the dominance of private providers in the sector. \n\nTrump said he won popular votes in the US election by the millions\n\nWHAT WE KNOW\n\nThis is true. Trump won 2.4 million more popular votes in the 2024 election than did US Vice President Kamala Harris, but what determined his win was his 312-226 lead in Electoral College votes over Harris.\n\n“To the Black and Hispanic communities, I want to thank you for the tremendous outpouring of love and trust that you have shown me with your vote. We set records and I will not forget it.” \n\nWHAT WE KNOW\n\nThis is mostly true. Trump received the highest share of votes among Hispanic and Black voters for a Republican presidential candidate in more than 40 years, but Harris received a greater share of votes from both demographics.\n\nTrump won 46pc of Hispanic voters and 13pc of Black voters nationwide, while Democrat Kamala Harris won 51pc and 86pc, respectively, according to an exit poll conducted by Edison Research.\n\nTrump’s share of Hispanic voters was the highest for a Republican presidential candidate in exit polls going back to the 1970s and was 2 percentage points higher than George W. Bush’s 44pc in 2004. Trump’s share of Black voters was similarly the highest since 1980, when Ronald Reagan received 14%, according to data compiled by the nonpartisan Roper Centre for Public Opinion Research. \n\n“The inflation crisis was caused by massive overspending and escalating energy crisis.”\n\nWHAT WE KNOW\n\nThis is mostly true. The government stimulus packages during the COVID-19 pandemic, high energy prices and global supply chain issues were seen as the major drivers of inflation during the Biden administration.\n\nThe Biden administration and Congress approved the $1.9 trillion American Rescue Plan Act in March 2021, after over $3 trillion in COVID relief spending approved during then-President Trump's first administration in 2020.\n\nU.S. consumer prices jumped 9.1pc in the 12 months through June 2022, the largest increase in four decades. Energy prices also rose 41.6pc year-on-year at the time. The Russia-Ukraine war, which had caused a spike in global fuel prices, contributed to the soaring prices.\n\nThe U.S. has the “largest amount of oil and gas of any country on earth.”\n\nWHAT WE KNOW\n\nThis lacks context. US crude oil production leads global rankings, rising to a record high of 13.46 million barrels per day in October, data from the Energy Information Administration (EIA) showed.\n\nUS total oil supply and natural gas supply lead the International Energy Agency’s global rankings.\n\nHowever, Organization of the Petroleum Exporting Countries (OPEC) data show that Venezuela, Saudi Arabia and Iran have the largest proven crude oil reserves, while Russia, Iran, and Qatar have the largest proven natural gas reserves.\n\n“China is operating the Panama Canal” \n\nWHAT WE KNOW\n\nThis is false. The canal is managed by the Panama Canal Authority, a Panamanian government agency.\n\n\"The canal is not under any direct or indirect control from China, the European community, the United States, or any other power,\" Panama's President Jose Raul Mulino said in December.\n\nHutchison Ports PPC, a division of Hong Kong-based company CK Hutchison Holdings Limited, operates the Balboa and Cristobal ports on either end of the canal, according to its website. The publicly listed conglomerate is not financially tied to the Chinese government. However, Trump and other US officials have previously warned about the risk of Beijing’s growing influence on trade in South America.\n\nThe US “spent more money than ever spent on a project before” and lost 38,000 lives while building the Panama Canal\n\nWHAT WE KNOW\n\nThe construction was initially undertaken by the French in the 1880s, when an estimated 20,000 canal workers died, according to the Linda Hall Library of Science, Engineering and Technology.\n\nDuring the US construction period, which started in 1904, around 5,600 died of injury and disease, the Panama Canal’s website writes, citing hospital records.\n\nThe US spent $326 million on construction, between 1903 and 1914, according to a study on the economic impact of the canal, which adds that it was the most expensive public works project in American history at that time.","summary":"Donald Trump has been sworn in as the 47th President of the United States today, becoming only the second president to regain the highest office in the country after losing an election.","url":"https://www.independent.ie/world-news/donald-trump-announces-hiring-freeze-and-return-to-office-order-for-federal-workers-january-6-capitol-rioters-to-be-pardoned/a1894824193.html","image":"https://focus.independent.ie/thumbor/tRkn9YfWUsulqAs-lhiIv0GPGv4=/60x0:735x450/629x0/prod-mh-ireland/7dfe4d8c-7f7d-4939-a0f6-cf8d0f478354/2aeff12f-52b3-453a-a081-fcba78996c8f/video/video.jpg","video":null,"publish_date":"2025-01-21 00:16:51","author":"Eoghan Moloney","authors":["Eoghan Moloney"],"language":"en","category":"politics","source_country":"ie","sentiment":0.095},{"id":282129960,"title":"Nat Barr puts Penny Wong on the spot with important Donald Trump question: Why she refused to answer","text":"Nat Barr puts Penny Wong on the spot with important Donald Trump question: Why she refused to answer\n\nPenny Wong dodges Trump questions\n\nWon't be drawn on gender declaration \n\n READ MORE: Donald Trump pulls no punches in blunt inauguration speech\n\nLISTEN: Welcome to MAGAland, our podcast on the latest inside the White House\n\nBy ASHLEY NICKEL AND DAVID SOUTHWELL FOR DAILY MAIL AUSTRALIA\n\nPublished: 23:59 GMT, 20 January 2025 | Updated: 00:16 GMT, 21 January 2025\n\nForeign Affairs Minister Penny Wong has spent the morning dodging awkward questions about US President Donald Trump's declaration that the US government will now only recognise 'two genders'.\n\nMs Wong, along with Australia's US Ambassador Kevin Rudd, attended Mr Trump's inauguration in Washington DC in the early hours of Tuesday, when the new US president said only 'male and female' would be officially recognised under his administration.\n\nFacing the Seven's Sunrise program on Tuesday, Ms Wong was asked by interviewer Natalie Barr what she had learned of Mr Trump's announcement on gender.\n\n'One of the interesting things he also said, \"That from this day forth there will be two genders in America, male and female\" - what did you make of that,' Barr asked Wong.\n\n'There will be a lot of things - domestic politics - which as foreign minister I'm not going to be commenting on,' Ms Wong said.\n\n'There's going to be a lot of change in this administration, I'm certainly not going to be providing rolling commentary.\n\n'What I would say is that my job, on your behalf, and the government's job is to advocate for Australia's interests, our economic interests, our national security interests, and we'll be doing that.'\n\nMs Wong was asked an almost identical question and gave a similar answer on Tuesday morning on ABC Radio National's breakfast program.\n\nForeign Affairs Minister Penny Wong (pictured) refused to comment on US President Donald Trump's move to recognise two genders\n\nHowever, ABC interviewer Sally Sara pressed Ms Wong further. \n\n'If President Trump is talking about rolling back diversity, equity and inclusion programs and only recognising two sexes, male and female, what will that mean for members and representatives of the Australian government and public servants that will be working directly with the administration? Will you be seeking guarantees about their treatment?' \n\n'You are working very hard to ask me to comment on a domestic policy announcement the President made just a few hours ago,' Ms Wong replied.\n\n'And as I said to you I don’t intend to do that. I have a job to do here in Washington and that is to advocate for Australia’s interests: our security interests and our economic interests, and that is what I intend to do.'\n\nMs Wong was also cagey when asked about Mr Rudd's relations with Mr Trump following a history of acrimony between the pair.\n\nMs Wong faced Sunrise shortly after Mr Trump's inauguration (pictured, hosts Matt Shirvington and Natalie Barr)\n\nSunrise host Matt Shirvington asked Ms Wong if she thought the two men have repaired their relationship, as well as whether she would meet with the administration this week.\n\nMs Wong only answered the second question, listing a number of officials she would be talking to including the Secretary of the Treasury and the incoming Secretary of State.\n\n'This has been a really good opportunity on behalf of the country to engage with key people in the new administration with whom we want to have a very strong and open relationship,' she said. \n\nDr Rudd previously called Trump a 'traitor to the West', a 'village idiot' and the 'most destructive president in history'.\n\nIn response, Trump said that Rudd was 'nasty' and he would not last long in the role once he returned to the White House.\n\nEarlier Ms Wong revealed Dr Rudd had been talking to Mr Trump before the inauguration.\n\nMr Trump (pictured) was sworn into office for his second term as US president on Monday, local time\n\nWhat to know about Trump's first executive orders as the president renames the Gulf of Mexico\n\n'I understand Mr Rudd, Ambassador Rudd, did have an opportunity to chat to the then President-Elect and he was honoured to attend the inauguration with me today and also to attend the various events associated with the inauguration,' Ms Wong said.\n\n'It's really quite an extraordinary event and I again want to say, my congratulations to President Trump and his team. \n\n'This is a big day for them but it's also a big day for the country and for the world. The changing of an American president is obviously a moment of real significance here and throughout the world.'\n\nMs Wong was also cagey on Mr Trump's proposed taxes and tariffs on imports into the US and how that would impact Australia.\n\n'President Trump has made clear his agenda would be about putting America first, so this is not a new position, it's not a surprising position,' she said.\n\n'When it comes to Australia-US economic relations, in terms of trade, the US has had a surplus with Australia since President Truman (mid 1900s).\n\n'Even of those exports from Australia that go to the US, about half of them go into US supply chains.\n\n'In terms of adding value to the American economy, Australia certainly does and that will be my message on behalf of Australia to the Secretary of State and we will continue to put this view that the economic relationship is in America's favor.'\n\nDuring Mr Trump's speech, he said his administration would put an end to trying 'to socially engineer race and gender into every aspect of public and private life'.\n\n'We will forge a society that is colour blind and merit-based,' he said.\n\n'As of today, it will henceforth be the official policy of the United States government that there are only two genders: male and female.' \n\nDonald TrumpSunrisePenny Wong\n\nShare or comment on this article:\nNat Barr puts Penny Wong on the spot with important Donald Trump question: Why she refused to answer\n\nAdd comment","summary":"Foreign Affairs Minister Penny Wong has spent the morning dodging awkward questions about US President Donald Trump 's declaration that the US government will now only recognise 'two genders'.","url":"https://www.dailymail.co.uk/news/article-14306163/Donald-Trump-gender-Australia.html","image":"https://i.dailymail.co.uk/1s/2025/01/20/23/94319185-0-image-m-3_1737417331811.jpg","video":null,"publish_date":"2025-01-21 00:16:15","author":"Ashley Nickel,Editor","authors":["Ashley Nickel","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.028},{"id":282129948,"title":"Brutal detail in Kevin Rudd selfie that will wipe the smile off his face: 'Deport him'","text":"Brutal detail in Kevin Rudd selfie that will wipe the smile off his face: 'Deport him'\n\nKevin Rudd mocked in selfie \n\nHe posed with ex-LNP staffer in US \n\nREAD MORE: How Kevin Rudd spent $24,000 in a single day as Anthony Albanese's ambassador to the US\n\nBy MAX AITCHISON, POLITICAL REPORTER FOR DAILY MAIL AUSTRALIA\n\nPublished: 00:14 GMT, 21 January 2025 | Updated: 00:15 GMT, 21 January 2025\n\nKevin Rudd has been mercilessly mocked after posing for a seemingly innocent selfie, amid calls for President Donald Trump to sack him.\n\nAustralia's Ambassador to the US was pictured grinning alongside former LNP staffer Barclay McGain in the Dirksen Senate Office Building in Washington DC on Friday. \n\nMr McGain, who works for lobby group Americans for Tax Reform, shared the selfie with a brutal message for the controversial diplomat and former Australian Prime Minister.\n\n'Bumped into this shady character swanning around the halls of Capitol Hill today and I have a message,' Mr McGain wrote on Facebook.\n\n'Dear President-elect Donald J. Trump, On Day 1, please do Australians a favour and deport this illegal immigrant from these United States. \n\n'Regards, The entirety of Australia.'\n\nMr Rudd's position has come under massive scrutiny after past negative comments he made about Trump resurfaced.\n\nThe former Labor leader has labelled the President-elect a 'village idiot', a 'traitor to the West' and 'the most destructive president in history'.\n\nAustralia's Ambassador to the US was pictured grinning in a selfie alongside his fellow countryman, Barclay McGain in the Dirksen Senate Office Building in Washington DC on Friday\n\nMr McGain, who works for lobby group Americans for Tax Reform, shared the selfie with a cheeky message for the controversial diplomat and former Australian Prime Minister (pictured)\n\nHe subsequently deleted a swathe of negative social media comments after Trump's stunning election victory in November. \n\nBut that same month Daily Mail Australia revealed how Mr Rudd never imagined Trump would return to power, dismissing his first term as a period of 'craziness'.\n\n'Never take a backwards step in saying we're allies with the United States,' Mr Rudd said.\n\n'For all the American pre-disposition to episodic craziness... Look at Trump: how did that happen? That was a walk on the wild side for all of us.' \n\nLess than nine months later, in March 2023, Mr Rudd was controversially appointed as Australia's ambassador to the US by Prime Minister Anthony Albanese. \n\nHe now faces the seemingly uphill task of trying to curry favour and influence with the Trump administration that is actively hostile towards him due to his previous comments.\n\nFor example, one of Trump's most senior campaign advisers, Dan Scavino Jr, gave an indication that Mr Rudd would not last long under the new administration.\n\nSharing Mr Rudd's congratulatory message to the new President-elect on X, Mr Scavino Jr posted an hour glass GIF to his two million followers - suggesting his days were numbered.\n\nTrump has also previously signalled his disapproval of Mr Rudd, branding him 'nasty' (pictured: the 47th President of the United States with his wife Melania at his inauguration on Monday)\n\nThe comment that proves Kevin Rudd never saw Trump comeback coming as insulting new video surfaces\n\nTrump has also previously signalled his disapproval of Mr Rudd, branding him 'nasty'.\n\n'I don't know much about him. I heard he was a little bit nasty,' Trump told GB News last year.\n\n'I hear he's not the brightest bulb, but I don't know much about him. If he's at all hostile, he will not be there long.'\n\nDespite his unpopularity, Rudd has been backed by both prime Minister Anthony Albanese and Opposition Leader Peter Dutton.\n\nMr McGain's post was flooded with similarly critical comments. \n\n'He is known as Kevin Dudd, village idiot,' wrote one.\n\n'We sent him to the US for the same reason we export Fosters beer. Nobody here likes it,' another quipped.\n\nMr McGain is no stranger to controversy. \n\nHe was was fired from his role as an electorate officer for former Federal MP Andrew Laming in 2020 after a social media post came to light showing him grinning with a racially offensive figurine. \n\nHe returned to work for Mr Laming six months later, but was publicly blasted the following year when he dressed up as acquitted US shooter Kyle Rittenhouse for a Halloween party - with the hashtag #NotGuilty.\n\nRittenhouse shot three people, killing two, with an AR-15 during Black Lives Matter riots in Kenosha, Wisconsin in August 2020 after a white police officer shot a black man.\n\nThe Prime Minister's office condemned the costume at the time as 'completely inappropriate'.\n\nDespite the controversy, he was pictured working on the Coalition campaign in two elections in 2023.\n\nAccording to his LinkedIn profile, he took up his new role as 'federal affairs associate' at the Americans for Tax Reform lobby group in September last year. \n\nDaily Mail Australia contacted Mr McGain for further comment. \n\nAnthony AlbaneseWashington DCAustralia Politics\n\nShare or comment on this article:\nBrutal detail in Kevin Rudd selfie that will wipe the smile off his face: 'Deport him'\n\nAdd comment","summary":"Australia's Ambassador to the US was pictured grinning in a selfie alongside former LNP staffer Barclay McGain in the Dirksen Senate Office Building in Washington DC on Friday.","url":"https://www.dailymail.co.uk/news/australia-politics/article-14306635/Kevin-Rudds-selfie-Washington-DC-turns-sour.html","image":"https://i.dailymail.co.uk/1s/2025/01/20/23/94324955-0-image-a-7_1737415991578.jpg","video":null,"publish_date":"2025-01-21 00:15:32","author":"Editor,Max Aitchison","authors":["Editor","Max Aitchison"],"language":"en","source_country":"gb","sentiment":0.087},{"id":282130144,"title":"Abrupt end to border app that brought nearly 1 million to US strands many in Mexico","text":"TIJUANA, Mexico (AP) — They came from Haiti, Venezuela and around the world, pulling small rolling suitcases crammed with clothing and stuffed animals to occupy their children. They clutched cellphones showing that after months of waiting they had appointments — finally — to legally enter the United States.\n\nNow outside a series of north Mexico border crossings where mazes of concrete barriers and thick fencing eventually spill into the United States, hope and excitement evaporated into despair and disbelief moments after President Donald Trump took office. U.S. Customs and Border Protection announced Monday that the CBP One app that worked as recently as that morning would no longer be used to admit migrants after facilitating entry for nearly 1 million people since January 2023.\n\nTens of thousands of appointments that were scheduled into February were canceled, applicants were told.\n\nThat was it. There was no way to appeal, and no one to talk to.\n\nIn Tijuana, where 400 people were admitted daily on the app at a border crossing with San Diego, Maria Mercado had to work up the courage to check her phone.\n\nTears ran down her cheeks after she finally looked. Her family’s appointment was for 1 p.m., a few hours too late.\n\n“We don’t know what we are going to do,” she said, standing with her family within view of the United States.\n\nShe left Colombia decades ago after it was overrun by drug cartel violence, heading to Ecuador. When cartels besieged her new homeland, the family fled again, in June, this time to Mexico, hoping to reach the U.S.\n\n“I’m not asking the world for anything — only God. I’m asking God to please let us get in,” she said.\n\nCBP One has been wildly popular, especially with Venezuelans, Cubans, Haitians and Mexicans. Now, they were stranded at the U.S. border or deeper in Mexico.\n\nJairol Polo, 38, tried getting an appointment for six months from Mexico City before snagging one for Wednesday in Matamoros, across from Brownsville, Texas. The Cuban man flew Monday from Mexico’s capital to learn at the Matamoros-Brownsville border crossing that his appointment was canceled.\n\n“Imagine how we feel,” he said dejectedly while smoking a cigarette.\n\nPeople with morning appointments got through on schedule. Andrum Roman, a 28-year-old Venezuelan, was in the last group to cross the border with the CBP One in Ciudad Juarez, across from El Paso, Texas.\n\n“We are a little safer now because we are here,” he said just before handing over his documents to U.S. authorities. “But you still don’t know what’s going to happen,” he said.\n\nAnother Venezuelan, Rober Caruzi, entered El Paso right behind him. “I reached the border twice and I was returned twice, but I didn’t lose hope,” he said.\n\nBy afternoon, the app was down.\n\nCBP One is effectively a lottery system that give appointments to 1,450 people a day at one of eight border crossings. People enter the U.S. on immigration “parole,” a presidential authority that former President Joe Biden used more than any other president since it was introduced in 1952.\n\nIts demise follows Trump’s campaign promises, and will please its critics, who see it as an overly generous magnet attracting people to Mexico’s border with the United States.\n\nDespite a glitchy launch in January 2023, it quickly became a critical piece of the Biden administration’s border strategy to expand legal pathways while cracking down on asylum for people who enter illegally. Supporters say it brought order amid the tumult of illegal crossings.\n\nMany migrant shelters in Mexico are now occupied largely by people who tapped their phones daily hoping for an appointment. U.S. Customs and Border Protection says about 280,000 people try daily for the 1,450 slots.\n\nThe demise of CBP One will be coupled with the return of “Remain in Mexico,” a remnant of Trump’s first term that forced about 70,000 asylum-seekers to wait in Mexico for hearings in U.S. immigration court.\n\nMatthew Hudak, who retired last year as deputy chief of the Border Patrol, said the demise of CBP One could encourage people to cross illegally. To be effective, it must be coupled with something like “Remain in Mexico,” he said.\n\n“The message with CBP One being shut down is basically, ‘Hey we’re not going to allow you to show up; the doors are not going to be open.’ For that to be meaningful, there has to be some level of consequence if you bypass any lawful means and you’re doing it illegally,” he said.\n\nNews of CBP One’s abrupt end shocked migrants across Mexico.\n\nJuan Andrés Rincón Ramos, a 19-year-old Venezuelan, cried with joy in early January when he got an asylum appointment through CBP One after months of trying. It was a lurch of hope after five years living in Peru and seven months in Mexico struggling to reach the U.S., where his brother lives in Pittsburgh.\n\nIn the makeshift Mexico City migrant camp where he lives, the fantasy of a life he dreamed for himself evaporated when he got the notification that his appointment had been canceled.\n\n“It was a moment of hope, but it didn’t last,” he said. “Everyone trusted in the American dream, but we were all wrong.”\n\nJanetsky reported from Mexico City. Associated Press journalists Tim Sullivan in Minneapolis, Elliot Spagat in San Diego, Valerie Gonzalez in Matamoros, Mexico, and Martin Silva in Ciudad Juarez, Mexico, contributed.","summary":"TIJUANA, Mexico (AP) — They came from Haiti, Venezuela and around the world, pulling small rolling suitcases crammed with clothing and stuffed animals to occupy their children. They clutched cellphones showing that after months of waiting they had appointments —…","url":"https://www.thestar.com/news/world/united-states/abrupt-end-to-border-app-that-brought-nearly-1-million-to-us-strands-many-in/article_30627956-8992-55f4-914e-5e6fa6cef672.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/f/95/f95d20ea-ecf3-552f-940d-5453205bfbdc/678ee83148991.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-01-21 00:15:20","author":"Julie Watson And Megan Janetsky The Associated Press,The Canadian Press. All Rights Reserved","authors":["Julie Watson And Megan Janetsky The Associated Press","The Canadian Press. All Rights Reserved"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.324},{"id":282132720,"title":"Trump inauguration: Kumuyi gears up for global evangelism","text":"The Deeper Christian Life Ministry is set to partner with the United States government and its pastors to advance global evangelism efforts.\n\nFounder and General Superintendent of the DCLM, Pastor William Kumuyi, made this announcement on his official X account, @pastorwf_kumuyi, on Monday.\n\nKumuyi shared the news following a meeting with U.S. Congressman Robert Pittenger and Pastor Lucas Miles of Turning Point USA.\n\nThe meeting took place ahead of the inauguration of Donald J. Trump as the 47th President of the United States.\n\n“It was great meeting with Congressman Robert Pittenger and Pastor Lucas Miles of @TPUSA yesterday, discussing how we can partner together for global evangelism as we prepare for the Inauguration of President Donald J. Trump,” Kumuyi wrote. \n\nHe added: “The harvest is plentiful. Let’s pray for open doors and hearts ready to receive the gospel! We believe in the power of the gospel to transform lives and nations. Exciting times ahead!”\n\nKumuyi was among a select group of African pastors who participated in the Inauguration Praise and Prayer Convocation held in honour of Donald Trump’s incoming administration.\n\nThe event, hosted at Greater New Hope Baptist Church, was organized by Jim Garlow’s Well Versed World ministry in collaboration with Tony Perkins of the Family Research Council.\n\nIt brought together faith leaders to intercede for the nation and the new administration.","summary":"The Deeper Christian Life Ministry is set to partner with the United States government and its pastors to advance global evangelism efforts. Founder and General Superintendent of the DCLM, Pastor William Kumuyi, made this announcement on his official X account, @pastorwf_kumuyi, on Monday. Kumuyi shared the news following a meeting with U.S. Congressman Robert Pittenger \n\n\n \n Read More","url":"https://punchng.com/trump-inauguration-kumuyi-gears-up-for-global-evangelism/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/20165334/Kumuyi-1-1200x630.webp","video":null,"publish_date":"2025-01-21 00:15:03","author":"Our Reporters","authors":["Our Reporters"],"language":"en","category":"politics","source_country":"ng","sentiment":0.56}]}