{"offset":0,"number":50,"available":11362,"news":[{"id":349474454,"title":"Donald Trump teases location of upcoming Putin summit as Russia's war on Ukraine continues","text":"US President Donald Trump hinted that the venue for his summit with Russian President Vladimir Putin will be revealed today to discuss the ongoing assault against Ukraine . During a peace treaty signing ceremony for Azerbaijan and Armenia, Trump teased the announcement and highlighted his 'international accomplishments,' even suggesting the possibility of him preventing World War Three. \"We're going to be announcing later, and we're going to have a meeting with Russia ,\" Trump informed reporters at the White House following a flurry of questions regarding a peace agreement between Ukraine and Russia. When questioned whether he believed an event similar to Friday's peace deal signing between Armenia and Azerbaijan could materialise for Putin and Zelenskyy, Trump responded, \"I think my instinct really tells me that we have a shot at it.\" Trump also hinted at a potential 'land swap' though has yet to elaborate on what that might entail, reports the Mirror US . The US proposal to acknowledge Russia's annexation of Crimea to conclude the conflict was not welcomed by Ukraine. Elina Beketova, fellow at the Centre for European Policy Analysis (CEPA) told Newsweek that Kyiv's 'position has not changed' and Ukraine will continue to strive for 'preserving its statehood and territorial integrity. ' Russia also now occupies Kherson, Donetsk, Luhansk, and Zaporizhzhia, in the Eastern region, which Putin may ask for. So far, Ukraine's leadership has opposed ceding any territory to Russia. Zelenskyy wrote on X, \"Ukraine is not afraid of meetings and expects the same brave approach from the Russian side. It is time we ended the war.\" Those remarks emerged as Ukrainian troops on the front line voiced minimal optimism for a diplomatic resolution to the conflict, with Trump's deadline arriving Friday for the Kremlin to pursue peace. Frustrated that Putin failed to respond to his appeals to cease bombardments of Ukrainian cities, Trump nearly a fortnight ago brought forward his ultimatum to impose additional sanctions on Russia and introduce secondary tariffs targeting nations that purchase Russian oil if the Kremlin did not move toward a settlement. President Donald Trump hosted a peace summit at the White House this Friday with the leaders of Armenia and Azerbaijan, seeking to bring years of conflict to a close and reopen vital transportation routes whilst capitalising on Russia's diminishing influence in the region. The South Caucasus nations will sign an agreement to establish a major transit corridor, dubbed the Trump Route for International Peace and Prosperity, according to the White House. This route will bridge the gap between Azerbaijan and its autonomous Nakhchivan exclave, currently separated by a 20-mile-wide strip of Armenian territory - a sticking point that has previously derailed peace negotiations. \"The roadmap they are agreeing to will build a cooperative future that benefits both countries, their region of the South Caucasus and beyond,\" declared White House spokeswoman Anna Kelly on Friday. She went on to emphasise that the fresh transit corridor will \"allow unimpeded connectivity between the two countries while respecting Armenia's sovereignty and territorial integrity and its people.\" This agreement follows a string of peace and economic deals facilitated by the U.S. this year. Meanwhile, Trump has made no secret of his ambition to secure the Nobel Peace Prize for his role in resolving enduring global disputes.","summary":"Trump has repeatedly said that 'no one wants a third world war' and said that he was close to making peace. He moved the deadline to March 25 and said that he would impose secondary sanctions on Russia if it did not make peace","url":"https://www.mirror.co.uk/news/us-news/donald-trump-teases-location-upcoming-35701883","image":"https://i2-prod.mirror.co.uk/article35701882.ece/ALTERNATES/s1200b/0_FILES-US-RUSSIA-UKRAINE-CONFLICT-TALKS.jpg","video":null,"publish_date":"2025-08-09 00:48:19","author":"Phoebe Tonks,Yelena Mandenberg","authors":["Phoebe Tonks","Yelena Mandenberg"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.093},{"id":349475806,"title":"World News | Trump to Meet Putin in Alaska on August 15, Says Russia-Ukraine Peace Deal \"very Close'","text":"Washington [US], August 9 (ANI): US President Donald Trump has announced that he will meet Russian President Vladimir Putin next Friday, August 15, 2025, in Alaska. The meeting is expected to focus heavily on efforts to broker a peace deal between Russia and Ukraine.\nTrump revealed the details on his Truth Social account. He wrote, \"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska. Further details to follow. Thank you for your attention to this matter!\"\nAlso Read | 'India Negotiating Trade Pacts With Several Nations, Including US', Says Union Minister Piyush Goyal.\nSpeaking earlier at the White House during the signing of the Armenia-Azerbaijan peace accord, Trump also hinted at progress on the Russia-Ukraine conflict.\n\"I came in, and this whole world was on fire, and all these things were sort of happening. We have only been here six months. The world was on fire, and we took care of just about every fire, and we're working on another one very strongly with Russia and Ukraine. We will have some more information for you a little bit later,\" Trump said.\nAlso Read | Has Pakistan Launched Trackless Electric Tram System? Fact Check Reveals Truth Behind Viral Video.\nHe also said that his \"highest aspiration is to bring peace and stability in the world.\"\nWhen asked about the Russia-Ukraine peace efforts during the Armenia-Azerbaijan accord event, Trump said, \"Russia, as you know, lost almost 25,000 over the last month and a half. Ukraine lost just a few, and lots of people are dying, and we are getting very close and will announce later on. We will have a meeting with Russia, and we will announce a location. The location will be a very popular one for lots of reasons. We will announce it a little later, and don't want to do it now because of the importance of what we just did.\"\nOn being asked how far negotiations had progressed, Trump replied, \"We are getting very close to a deal. Working with European nations, who are terrific people and leaders, is a pleasure through NATO. I became very friendly with them and agreed to go from 2 per cent to 5 per cent that they have already paid. And we are working together very closely. In all fairness to President Zelensky, he is getting everything he needs, assuming we will get something done. I will be meeting very shortly with President Putin. It would have been sooner, but I guess there are security arrangements that unfortunately people have to make.\"\nTrump also said that a deal to end the war in Ukraine would involve some exchange of territory.\n\"It's very complicated. But we're going to get some [territory] back, and we're going to get some switched. There'll be some swapping of territories to the betterment of both, but we'll be talking about that either later, or tomorrow,\" he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Speaking earlier at the White House during the signing of the Armenia-Azerbaijan peace accord, Trump also hinted at progress on the Russia-Ukraine conflict","url":"https://www.latestly.com/agency-news/world-news-trump-to-meet-putin-in-alaska-on-august-15-says-russia-ukraine-peace-deal-very-close-7049464.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250808225633.jpg","video":null,"publish_date":"2025-08-09 00:46:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.071},{"id":349475786,"title":"World News | US Brokers Peace Deal Between Armenia and Azerbaijan, Both Leaders to Nominate Trump for Nobel Peace Prize","text":"Washington [US], August 9 (ANI): The United States has brokered a historic peace deal between Armenia and Azerbaijan, ending decades of conflict over Nagorno-Karabakh enclave. The agreement, announced on Friday, was hailed by US President Donald Trump as a major diplomatic breakthrough that will strengthen regional stability and open doors for trade and investment.\nAt the signing ceremony, US President Donald Trump said, \"It's a long time. Thirty-five years they fought and now they're friends and they're going to be friends for a long time.\"\nAlso Read | 'India Negotiating Trade Pacts With Several Nations, Including US', Says Union Minister Piyush Goyal.\nHe explained that the new transit route will give Azerbaijan full access to the territory of Nagorno-Karabakh while respecting Armenia's sovereignty. The US will develop the corridor for \"up to 99 years.\"\n\"They're going to be able to really live and work together,\" Trump added.\nAlso Read | Has Pakistan Launched Trackless Electric Tram System? Fact Check Reveals Truth Behind Viral Video.\nAzerbaijani President Ilham Aliyev assured that there would be no turning back from the deal. \"There should be no doubt and no suspicion that any of the sides would step back. If any of us, Prime Minister Pashinyan or myself, had in mind to step back, we wouldn't have come here. So you can be absolutely sure, as well as the Azerbaijani community, that what has happened today will result in peace--long-lasting peace, eternal peace in the Caucasus.\"\nTrump also reflected on his administration's efforts over the past months. \"I came in and this whole world was on fire. All these things were sort of happening. We've only been here for six months. The world was on fire. We took care of just about every fire,\" he said.\nBoth Armenia's Prime Minister Nikol Pashinyan and Azerbaijan's President Aliyev said they would nominate Trump for the Nobel Peace Prize.\n\"We will defend that, and we will promote for that,\" Pashinyan said.\nAliyev added, \"Who, if not President Trump, deserves the Nobel Peace Prize? ... As soon as we [return], we will agree to issue a joint letter.\"\nUS Senator Marco Rubio also praised the achievement in a post on X (formerly Twitter), \"Under @POTUS's leadership, the US brought the leaders of Azerbaijan and Armenia together to reach a peace deal that will end decades of conflict. This historic deal will make the region stronger and open new doors for American trade and investment. We congratulate both countries on a new era of peace.\"\nhttps://x.com/SecRubio/status/1953925740493517199\nAccording to the White House, the arrangement also gives the US exclusive development rights to a transit route across southern Armenia. This corridor is expected to boost cooperation in energy, technology, and the economy between the nations. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Trump also reflected on his administration's efforts over the past months. &quot;I came in and this whole world was on fire. All these things were sort of happening. We've only been here for six months. The world was on fire. We took care of just about every fire,&quot; he said.","url":"https://www.latestly.com/agency-news/world-news-us-brokers-peace-deal-between-armenia-and-azerbaijan-both-leaders-to-nominate-trump-for-nobel-peace-prize-7049460.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250808235241.jpg","video":null,"publish_date":"2025-08-09 00:42:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.059},{"id":349474690,"title":"Trump to Meet Putin in Alaska Next Week to Discuss the Ukraine Conflict","text":"US President Donald Trump will meet with Russian President Vladimir Putin to negotiate an end of the war in Ukraine on 15 August in Alaska, Trump said on Saturday.\n\nTrump made the announcement on social media after he said that the parties, including Ukraine President Volodymyr Zelenskyy, were close to a ceasefire deal that could resolve the three-year conflict.\n\nAddressing reporters at the White House overnight, Trump suggested an agreement would involve some exchange of land.\n\nIn his evening address to the nation, Zelenskyy said it was possible to achieve a ceasefire as long as adequate pressure was applied to Russia. He said he had held more than a dozen conversations with leaders of different countries and his team was in constant contact with the United States.\n\nPutin claims four Ukrainian regions — Luhansk, Donetsk, Zaporizhzhia and Kherson — as well as the Black Sea peninsula of Crimea, which he annexed in 2014. His forces do not fully control all the territory in the four regions.\n\nUkraine has previously signalled a willingness to be flexible in the search for an end to a war that has ravaged its towns and cities and killed large numbers of its soldiers and citizens.\n\nThe US and Russia were aiming to reach a deal to halt the war in Ukraine that would lock in Moscow’s occupation of territory seized during its military invasion, Bloomberg News reported on Friday.\n\nUnder the putative deal, according to Bloomberg, Russia would halt its offensive in the Kherson and Zaporizhzhia regions along current battle lines.\n\nSince his return to the White House in January, Trump has moved to mend relations with Russia and sought to end the war. In his public comments he has veered between admiration and sharp criticism of Putin.\n\nIn a sign of his growing frustration with Putin’s refusal to halt Russia’s military offensive, Trump had threatened to impose new sanctions and tariffs from Friday against Moscow and countries that buy its exports unless the Russian leader agreed to end the 3.5 year conflict, the deadliest in Europe since World War Two.\n\nIt was unclear if or when those sanctions would take effect. \n\nThe administration took a step toward punishing Moscow’s oil customers on Wednesday, imposing an additional 25 per cent tariff on goods from India over its imports of Russian oil, marking the first financial penalty aimed at Russia in Trump’s second term.\n\nTrump’s special envoy Steve Witkoff held three hours of talks with Putin in Moscow on Wednesday that both sides described as constructive.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUS President Donald Trump will meet with Russian President Vladimir Putin to&#8230;\n\n\nThis Post: Trump to Meet Putin in Alaska Next Week to Discuss the Ukraine Conflict first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/trump-to-meet-putin-in-alaska-next-week-to-discuss-the-ukraine-conflict/","image":"https://images.sbs.com.au/dims4/default/e31ec75/2147483647/strip/false/crop/3000x1378+0+311/resize/1234x567!/format/jpeg/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F2a%2F96%2Fb7b3183349d1800e5896e858a0d5%2F20250805193163365520-origin","video":null,"publish_date":"2025-08-09 00:35:43","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.279},{"id":349474556,"title":"Armenia, Azerbaijan Sign Historic Peace Deal: Trump Route, Nobel Peace Prize, 35-Year Conflict Ended","text":"US President Donald Trump presided over a landmark moment on Friday as the leaders of Armenia and Azerbaijan signed a U.S.-brokered peace agreement to formally end more than three decades of conflict. The deal, signed at the White House by Armenian Prime Minister Nikol Pashinyan and Azerbaijani President Ilham Aliyev, marks a dramatic diplomatic win for the Trump administration and ushers in a new era of cooperation in the South Caucasus. Trump Route for International Peace and Prosperity At the center of the deal is a major infrastructure initiative dubbed the Trump Route for International Peace and Prosperity, a transit corridor that will connect mainland Azerbaijan to its Nakhchivan exclave through Armenian territory. The corridor is intended to boost regional connectivity and symbolizes a new chapter of economic integration and diplomatic normalization between the two former adversaries. According to the White House, the route will operate under Armenian law and be subleased to a US-led consortium for infrastructure development and management. It is expected to unlock significant trade, energy, and logistical opportunities for both countries. “For the first time, we are establishing peace in the South Caucasus and building real, physical connections between our peoples,” President Aliyev said during the signing ceremony. Pashinyan echoed the sentiment, calling the agreement the start of \"a better story than the one we had in the past.\" Nobel Peace Prize Endorsement from Both Leaders In a striking moment of bipartisan gratitude, both Aliyev and Pashinyan endorsed nominating President Trump for the Nobel Peace Prize, crediting him for brokering a deal that others, including the European Union and Russia, had failed to achieve. “So maybe we agree with Prime Minister Pashinyan to send a joint appeal to the Nobel committee to award President Trump with the Nobel Peace Prize,” Aliyev said. “I think President Trump deserves to have the Nobel Peace Prize and we will defend that, and we will promote that,” Pashinyan added. Trump has leaned into his role as a global peacemaker during his second term, previously helping to negotiate ceasefires in Southeast Asia, Central Africa, and South Asia. While challenges remain in Ukraine and the Middle East, Friday's agreement adds significant weight to Trump’s foreign policy credentials. 35-Year Conflict Comes to a Close The agreement formally ends a bitter 35-year conflict that began in the late 1980s over the disputed Nagorno-Karabakh region, which was internationally recognized as part of Azerbaijan but largely populated by ethnic Armenians. The region became the flashpoint for two wars and decades of hostility. In September 2023, Azerbaijan reclaimed full control of Karabakh after a lightning military campaign, prompting nearly 100,000 ethnic Armenians to flee. Since then, talks toward normalization had quietly advanced, but only recently gained momentum under Trump’s direct mediation. “It’s a long time — 35 years — they fought and now they’re friends, and they’re going to be friends for a long time,” President Trump said at the signing event in the White House State Dining Room. The peace agreement commits Armenia and Azerbaijan to: Cease all military hostilities Open formal diplomatic relations Respect each other’s territorial integrity Promote regional economic and infrastructure cooperation In a separate move, the United States also signed bilateral agreements with both countries to expand cooperation in energy, trade, and artificial intelligence, and lifted previous restrictions on defense cooperation with Azerbaijan — a move likely to be closely watched by Moscow. The deal not only sidelines Russia, once the key broker in the region, but positions the United States as a dominant diplomatic and economic force in the South Caucasus moving forward.","summary":"Armenia and Azerbaijan signed a historic US-brokered peace deal at the White House, ending a 35-year conflict. The agreement includes the Trump Route transit corridor and economic cooperation. Both leaders praised President Trump’s role and pledged to nominate him for the Nobel Peace Prize for his efforts in brokering the breakthrough.","url":"https://www.timesnownews.com/world/armenia-azerbaijan-sign-historic-peace-deal-at-white-house-trump-route-nobel-peace-prize-35-year-conflict-ended-article-152433388","image":"https://images.timesnownews.com/thumb/msid-152433403,thumbsize-1482929,width-1280,height-720,resizemode-75/152433403.jpg","video":null,"publish_date":"2025-08-09 00:32:58","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.008},{"id":349475356,"title":"Azerbaijan-Armenia joint declaration consists of seven provisions","text":"WASHINGTON, August 9. /TASS/. The joint declaration signed by the leaders of Azerbaijan and Armenia following their meeting in Washington includes seven provisions that emphasize the sides’ desire for peace but do not specify its details, according to text of the document published on the Armenian government's Telegram channel.\n\nThe declaration was signed by Azerbaijani President Ilham Aliyev and Armenian Prime Minister Nikol Pashinyan, with US leader Donald Trump signing as a witness.\n\nThe first paragraph states that the sides have initialed the previously agreed-upon text of the peace and relations restoration agreement between Azerbaijan and Armenia and will make efforts to finalize its ratification.\n\nThe second paragraph welcomes the signing of a joint appeal to the OSCE to dissolve the Minsk Group. The third paragraph emphasizes the importance of opening communications in the region.\n\nThe fourth paragraph states that Armenia will work with the US, as well as certain third parties, to develop and implement a transportation corridor project connecting Azerbaijan's core territory with Armenia. The fifth paragraph states that \"conditions have been created for the peoples of Azerbaijan and Armenia to establish good neighborly relations based on the inviolability of international borders and the inadmissibility of using force to acquire territory.\" The sides \"reject any attempt at revenge, now or in the future.\"\n\nThe sixth paragraph notes the importance of the Washington meeting for establishing peace in the South Caucasus region. The seventh and final paragraph thanks Trump for his efforts.","summary":"The sides \"reject any attempt at revenge, now or in the future\"","url":"https://tass.com/world/2000073","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-09 00:24:08","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":0.062},{"id":349474686,"title":"Second Circuit Court Clarifies Refusal of Trump’s Westfall Act Request","text":"A federal appellate court has finally provided the rationale behind its decision that resulted in President Donald Trump losing significantly in the prolonged defamation case initiated — and won — by writer E. Jean Carroll.\n\nIn late June, the U.S. Court of Appeals for the 2nd Circuit succinctly dismissed a request for public funding of Trump”s appeal against the $83 million judgment in favor of Carroll. The three-judge panel denied the application under the Westfall Act of 1988, which allows the U.S. Department of Justice to represent government officials sued for actions performed within their official roles.\n\n“The Court will issue an opinion detailing its reasoning in due course,” promised Senior U.S. Circuit Judge Denny Chin, appointed by Barack Obama, alongside U.S. Circuit Judges Sarah Merriam and Maria Araújo Kahn, both appointed by Joe Biden, on June 18.\n\nNow, nearly two months later, the panel explained its reasoning in a 23-page per curiam opinion. The nix here is mostly a matter of time.\n\nAccording to the court, the Westfall Act inherently “statutorily” prevents the claims as they were filed post-trial, with Trump and the government “both waived their rights” due to incorrect timing, and “in any event, principles of equity warrant denying the belated motion” while upholding Carroll’s triumph over Trump.\n\nThe decision issued on Friday begins with a concise summary before delving into the text of the statute, identifying “three avenues for substitution.” One involves actions initiated in federal court with U.S. attorney general certification, the second pertains to actions transitioned from state to federal court, and with the certification mentioned earlier, the third is for actions without such certification.\n\nHere, Carroll’s case began in New York state court in November 2019 and was removed to federal court by then-Attorney General Bill Barr in September 2020, along with the Westfall Act certification.\n\nCarroll won the merits of her case at the summary judgment stage. A jury trial was then held in January 2024 to determine damages.\n\nThe court found the niceties of civil procedure – and years’ worth of intervening events – weighed against the 45th and 47th president.\n\nFirst, the court determined, Barr’s certification alone was not enough.\n\n“Certification is conclusive for purposes of the removal to federal court, but the question of substitution is subject to judicial review,” the opinion reads. “Upon such review, the District Court denied the motion to substitute.”\n\nTrump, of course, appealed that ruling – and might have been substantially heartened when a previous panel on the 2nd Circuit reversed and remanded the case back to U.S. District Judge Lewis Kaplan. But this ruling essentially just punted the issues and reshuffled the decks.\n\nTo be sure, the ruling certified a question to the D.C. Circuit about whether Trump was acting in the scope of his employment – as president – when he defamed Carroll. But instead of answering that question directly, the D.C. Circuit simply provided the federal district court’s law about the scope of employer-agent liability in general terms. Then, the 2nd Circuit sent the law back down to Kaplan and told him to fashion his ruling with those legal principles in mind.\n\nWith the case back before Kaplan – and with Merrick Garland in charge of the DOJ – the federal government revoked the Westfall Act certification in July 2023. Kaplan credited that revocation.\n\n“No further action was taken in the District Court by Trump or the government regarding Westfall Act substitution,” the panel notes.\n\nSo, the appeals court determined, the requested substitution did not occur before trial. But, the panel stresses, this is not a conclusion reached through procedural whack-a-mole due to unassailable odds. Rather, the court says, Trump had options – and did not use them.\n\nHere, the panel’s first and second reasons for rejecting the claim – filing too late and later waiving an avenue of substitution – effectively interlock, if they do not entirely blur together.\n\nFrom the opinion, at length [emphasis in original]\n\nTrump could have sought substitution after the government declined to issue a pre-trial certification in July 2023 by petitioning the District Court under [the section outlining how to request substitution lacking a certification]. That provision provides that if “the Attorney General has refused to certify scope of office or employment under this section, the employee may at any time before trial petition the court to find and certify that the employee was acting within the scope of his office or employment.”\nBut Trump – the “employee” under this language – waived his right to petition for certification under that subsection.\n\n“Indeed, at no time after the remand did Trump file anything regarding substitution in the District Court,” the opinion goes on. “By declining to seek such relief, Trump waived his right to now bring this motion.”\n\nAnd Trump’s latest motion, the court observed, was filed far too late.\n\n“This motion was filed after trial, and before this Court, during the pendency of Trump’s appeal,” the panel wryly explains.\n\nOffering a tertiary reason to reject Trump’s request, the panel lands on the idea of fairness for Carroll and all she has been through.\n\n“The parties have litigated this case extensively for more than five years, through multiple courts,” the opinion continues. “The practical impact of permitting the Movants’ untimely motion to substitute would be to unwind those five years of litigation and a duly-rendered jury verdict, and, potentially, to deprive Carroll of any opportunity to pursue her claims.”\n\nThe judges point out how Trump and the government waited for “nearly three months” to file the latest request, at which point the appeal had been fully briefed for “nearly two months.”\n\n“After several years of litigation, at substantial cost to all parties, and a significant victory for Carroll, it is simply too late to bring this motion,” the panel concluded. “Fairness and equity dictate that the motion to substitute be denied.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: E. Jean Carroll enters a vehicle outside of the Manhattan federal&#8230;\n\n\nThis Post: Second Circuit Court Clarifies Refusal of Trump&#8217;s Westfall Act Request first appeared on Internewscast Journal","url":"https://internewscast.com/crime/second-circuit-court-clarifies-refusal-of-trumps-westfall-act-request/","image":"https://internewscast.com/wp-content/uploads/2025/08/2nd-Circuit-explains-rejection-of-Trumps-Westfall-request.jpg","video":null,"publish_date":"2025-08-09 00:21:07","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.284},{"id":349474692,"title":"Donald Trump Announces Putin’s Upcoming Visit to the U.S. for High-Stakes Meeting","text":"President Donald Trump announced on Friday that he will meet with Russian President Vladimir Putin next week in Alaska. \n\nThe president broke the news on his Truth Social social media platform, confirming that the meeting would take place on Friday, August 15. \n\nThe eagerly awaited meeting between myself, the President of the United States, and Russian President Vladimir Putin, is set for next Friday, August 15, 2025, in the wonderful state of Alaska,’ Trump announced. ‘More details will be provided soon. Thank you for your attention!’\n\nEarlier Friday, Trump spoke to reporters about his attempts to end the war between Ukraine and Russia, saying he would start by meeting with Putin. \n\nThe president confirmed that discussions about Ukrainian territory would be necessary to bring an end to the conflict that has persisted for three and a half years.\n\n‘It’s complicated, nothing easy,’ he previewed. ‘It’s very complicated but we’re going to get some back and we’re going to get some switched.’ \n\nTrump said his focus was on ending the war and ‘saving lives.’ \n\n‘I think if we didn’t come, Ukraine and Russia would have ended up being a World War, and I stopped that,’ he said.\n\nThis summit marks the first direct encounter between Russian and American leaders since former President Joe Biden’s meeting with Putin in 2021. Russia entered Ukraine in 2022 following the meeting with Biden, who opted out of further talks with Putin after the incursion.\n\nThis upcoming meeting will also be noteworthy as it is the first time since 2015 that Putin, or any Russian leader, has visited the U.S. The last visit occurred when Putin met then-President Barack Obama during the UN General Assembly Meeting in New York City on September 28, 2015.\n\nThe surprise announcement comes just one day after the Trump’s new deadline for Russia to commit to peace talks expired.\n\nTrump’s announcement came amidst reports from various U.S. media citing a White House source, suggesting that any meeting with the Russian leader would depend on his readiness to interact directly with Ukrainian President Volodymyr Zelensky.\n\nNevertheless, when journalists asked for clarity, the U.S. President clarified that a direct meeting between Putin and Zelensky is not a requirement for the planned discussions between the U.S. and Russia to proceed.\n\nThe U.S. leader is continuing to seek a diplomatic end to the war in Ukraine – and is threatening economic sanctions if Putin continues to snub Volodymyr Zelensky.\n\nIf the U.S. missed the peace talk deadline, the nation would have been expected to levy secondary tariffs targeting Russia’s key allies India and China. In anticipation of those surcharges, India last night announced it was suspending its orders for Russian oil.\n\nThe move would deprive the Kremlin of billions in oil revenues to bankroll its occupation and bombardment of Ukraine.\n\nWhen asked about the deadline, Trump said it was ‘up to’ Putin.\n\n‘It’s going to be up to him [Putin]. We’re going to see what he has to say. It’s going to be up to him. Very disappointed.’\n\nPosting on X, President Zelensky said a ceasefire between Ukraine and Russia was still at the forefront of negotiations.\n\nHe said: ‘We remain mindful of the need for a real ceasefire. Ukraine is ready for it and there has been no clear public response from Russia yet.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump announced on Friday that he will meet with Russian&#8230;\n\n\nThis Post: Donald Trump Announces Putin&#8217;s Upcoming Visit to the U.S. for High-Stakes Meeting first appeared on Internewscast Journal","url":"https://internewscast.com/news/donald-trump-announces-putins-upcoming-visit-to-the-u-s-for-high-stakes-meeting/","image":"https://internewscast.com/wp-content/uploads/2025/08/Donald-Trump-confirms-Putin-is-flying-to-US-soil-for.jpg","video":null,"publish_date":"2025-08-09 00:17:47","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":349474192,"title":"Rosie O'Donnell claims ABC will cancel 'The View' to appease 'orange messiah' Trump","text":"Liberal actress and comic Rosie O’Donnell predicted on Wednesday that ABC is going to cancel \"The View\" to appease President Donald Trump. ABC has reportedly begun to scrutinize \"The View\" as one of the most prominent shows on television known for far-left rhetoric. The Daily Beast reported about an apparent rift between the hosts of the show and the top brass at the company, going all the way up to Disney CEO Bob Iger, concerning a desire for the hosts to cool off the politics. O’Donnell, one of Trump’s most outspoken critics, wrote in a on TikTok, \"You know what I just read today? ABC is ‘reviewing the liberal bias’ on The View. The VIEW. The show with five women speaking the own opinions - That's the threat now. They say they're not canceling it— they're just ‘reviewing the bias.’ Which is code for - we're gonna cancel it we're just trying to soften you up first.\" 'THE VIEW' HOST SUNNY HOSTIN WARNS COLBERT CANCELLATION COULD LEAD TO THE 'DISMANTLING OF OUR CONSTITUTION' \"Apparently, the truth is dangerous now,\" she continued. \"They say they want ‘balance.’ But what they mean is silence. Silence anything that doesn't praise the orange messiah and his golden escalator of lies.\" \"This isn't about bias - This is about obedience. This is about removing any program that doesn't align with Trumpism — soft fascism in full lashes with commercial breaks,\" she said, before appearing to paraphrase a famous poem about the Holocaust, \"First they came for the journalists Then the educators Then the librarians Now, it's Joy Behar and Whoopi Goldberg. It would be funny if it weren't so terrifying.\" \"We are in a dictatorship with good lighting,\" O’Donnell added. \"I used to think the First Amendment meant something. I used to think you couldn't just erase a voice because it made you uncomfortable.\" O’Donnell went on to conclude that rather than getting quieter, women should \"speak louder\" and \"take up space.\" \"We stand together and say what is true, even when it shakes the walls. Because the most dangerous sound in the world is a woman who knows what she's talking about— and refuses to stop,\" she wrote. Fox News Digital reached out to \"The View\" and ABC for comment. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"Rosie O’Donnell is an irrelevant loser with too much time on her hands, whining about a failing talk show while everyday Americans are working hard,\" White House spokesperson Taylor Rogers wrote to Fox News Digital. \"We can all thank Rosie O’Donnell for helping President Trump make America great again by self-deporting to Ireland.\" In July, Rogers called out \"The Views\" ratings and suggested it could be canceled after co-host Joy Behar went on an anti-Trump rant. \"Joy Behar is an irrelevant loser suffering from a severe case of Trump Derangement Syndrome. It’s no surprise that ‘The View’s ratings hit an all-time low last year. She should self-reflect on her own jealousy of President Trump’s historic popularity before her show is the next to be pulled off-air,\" Rogers said at the time. CLICK HERE TO GET THE FOX NEWS APP CBS’ cancellation of \"The Late Show with Stephen Colbert\" last month started a flurry of speculation that networks are shutting down left-wing content to placate the Trump administration. The cancellation followed the network and its parent company’s settlement with Trump after he sued both for \"election interference\" over a \"60 Minutes\" interview edit of his 2024 opponent, then-Vice President Kamala Harris.","summary":"Liberal comedian Rosie O&apos;Donnell says ABC&apos;s reported review of political content on &quot;The View&quot; signals a plan to shut down the show amid Trump administration pressure.","url":"https://www.foxnews.com/media/rosie-odonnell-claims-abc-cancel-the-view-appease-orange-messiah-trump","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/rosie-odonnell-speaks-at-event.png","video":"https://www.foxnews.com/video/6375920125112","publish_date":"2025-08-09 00:17:31","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":-0.244},{"id":349474698,"title":"Trump Administration Pursues $1 Billion Settlement with UCLA, According to White House Official","text":"The Trump administration is pursuing a $1 billion settlement from the University of California, Los Angeles, according to a White House official on Friday, following accusations from the Department of Justice that the school engaged in antisemitism and breached other civil rights. \n\nIn a first against a public university, UCLA faces a widespread suspension of funds due to alleged civil rights violations, including antisemitism and affirmative action issues.\n\nPresident Donald Trump’s administration has previously withheld federal funding under similar accusations against prestigious private universities. Recent weeks have seen the administration reach financial settlements with Brown University for $50 million and Columbia University for $221 million, while still involved in a more extensive negotiation with Harvard University.\n\nWhile a White House official has confirmed the settlement request, they did not provide specific details about other demands made of UCLA or further clarify the amount. The official, speaking under the condition of anonymity, was not authorized to publicly discuss the matter.\n\nUCLA recently announced that $584 million in federal grants had been suspended by the Trump administration. This action followed a Civil Rights Division finding by the Department of Justice that UCLA violated both the equal protection clause of the Fourteenth Amendment and Title VI of the Civil Rights Act of 1964 due to “deliberate indifference” towards creating a hostile educational environment for Jewish and Israeli students.\n\nThe university faced significant backlash regarding its management of a protest encampment related to the 2024 Israel-Hamas conflict. One evening, counterprotesters attacked the encampment, deploying traffic cones and pepper spray, leading to violent clashes that lasted for hours and resulted in injuries to over a dozen individuals, before police intervened. The following day saw the arrest of more than 200 people after large numbers defied orders to vacate. Subsequently, Jewish students reported being obstructed by protesters when trying to attend classes.\n\nAn attack on California?\n\nThe University of California’s president, James B. Milliken, said Friday the university had “just received” a document from the Department of Justice and would review it. He said the size of the proposed settlement would “devastate” the University of California, whose campuses are viewed as some of the top public colleges in the nation.\n\n“Earlier this week, we offered to engage in good faith dialogue with the Department to protect the University and its critical research mission,” said Milliken, who started as president last week. “As a public university, we are stewards of taxpayer resources and a payment of this scale would completely devastate our country’s greatest public university system as well as inflict great harm on our students and all Californians.”\n\nCalifornia Gov. Gavin Newsom on Friday accused Trump of trying to silence academic freedom in his attack on such a prestigious public university system. \n\n“He has threatened us through extortion with a billion-dollar fine unless we do his bidding,” Newsom told reporters. Apparently referencing the settlements with Columbia and Brown, he added: “We will not be like some of those other institutions that have followed a different path.”\n\nThe $1 billion demand in the UCLA settlement is linked to Newsom’s status as one of Trump’s most outspoken foes, said Peter McDonough, vice president and general counsel at the American Council on Education, an association of college presidents.\n\n“Anyone who thinks this appalling demand is not blatantly political and ideological has their head in the sand,“ McDonough said. “Of course it’s influenced by the fact that UCLA sits within the California system and the California system sits within the state of California.”\n\nSettlements with Trump, and in court\n\nThe Trump administration has used its control of federal funding to push for reforms at elite colleges that the president decries as overrun by liberalism and antisemitism. The administration also has launched investigations into diversity, equity and inclusion efforts, saying they discriminate against white and Asian American students.\n\nLast month, Columbia University agreed to pay $200 million as part of a settlement to resolve investigations into the government’s allegations that the school violated federal antidiscrimination laws. The agreement also restored more than $400 million in research grants. \n\nThe Trump administration is using its deal with Columbia as a template for other universities, with financial penalties that are now seen as an expectation. For instance, the administration is pressing for a deal that would require Harvard to pay far more than Columbia’s $200 million. Harvard leaders have been negotiating with the White House even as they battle in court to regain access to billions in federal research funding terminated by the Trump administration.\n\nUCLA has already reached one settlement about the 2024 protests. The university agreed last week to pay $6 million to settle a lawsuit from three Jewish students and a Jewish professor who argued the university violated their civil rights by allowing pro-Palestinian protesters to block their access to classes and other areas on campus in 2024.\n\nUCLA initially had argued that it had no legal responsibility over the issue because protesters, not the university, blocked Jewish students’ access to areas. The university also worked with law enforcement to thwart attempts to set up new protest camps.\n\nBut in a preliminary injunction a year earlier, U.S. District Judge Mark Scarsi disagreed and ordered UCLA to create a plan to protect Jewish students on campus. The University of California has since created systemwide campus guidelines on protests, with an Office of Campus and Community Safety at UCLA.\n\nAs part of the settlement, UCLA said it will contribute $2.3 million to eight organizations that combat antisemitism and support the university’s Jewish community. UCLA Chancellor Julio Frenk, whose Jewish father and grandparents fled Nazi Germany to Mexico and whose wife is the daughter of a Holocaust survivor, also launched an initiative to combat antisemitism and anti-Israeli bias.\n\nAP writer Julie Watson contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe Trump administration is pursuing a $1 billion settlement from the University&#8230;\n\n\nThis Post: Trump Administration Pursues $1 Billion Settlement with UCLA, According to White House Official first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-administration-pursues-1-billion-settlement-with-ucla-according-to-white-house-official/","image":"https://internewscast.com/wp-content/uploads/2025/08/Trump-administration-seeks-1-billion-settlement-from-UCLA-a-White.jpeg","video":null,"publish_date":"2025-08-09 00:11:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.238},{"id":349473830,"title":"Trump Seeks $1 Billion From University Of California-Los Angeles","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-seeks-1-billion-from-university-of-california-los-angeles-over-pro-palestine-protests-9050235\" on this server.\nReference #18.91a12417.1754700406.a7cd2f8\nhttps://errors.edgesuite.net/18.91a12417.1754700406.a7cd2f8","summary":"President Donald Trump demanded a massive $1 billion fine from the prestigious University of California system on Friday as the administration pushed its claims of antisemitism in UCLA's response to 2024 student protests related to Gaza.","url":"https://www.ndtv.com/world-news/donald-trump-seeks-1-billion-from-university-of-california-los-angeles-over-pro-palestine-protests-9050235","image":null,"video":null,"publish_date":"2025-08-09 00:08:45","author":null,"language":"en","source_country":"in","sentiment":-1},{"id":349474174,"title":"Nazis are having a moment—and they’re thanking Trump","text":"Neo-Nazi groups are praising President Donald Trump for bringing their bigoted ideas and rhetoric into the mainstream of American politics. Over the years, multiple Democratic leaders have warned about this possibility.\n\nReuters reported on Friday that the Aryan Freedom Network, a Texas-based white supremacist group, is pleased with the direction that Trump has taken the country in. Co-leader Dalton Henry Stout told the outlet Trump has “awakened a lot of people to the issues we’ve been raising for years” and described the head of the Republican Party as “the best thing that’s happened to us.”\n\nThe white supremacists told Reuters they love Trump’s repeated praise of “Western values,” his attacks on DEI (diversity, equity, and inclusion) initiatives, and his opposition to immigration. Trump’s parroting of their brand of hate has reportedly increased interest and recruitment in the group.\n\nAryan Freedom Network describes itself as a “white racialist” group and has called for white people to “take back our land.”\n\nThe unity between the Trump-led MAGA movement and previously ostracized white supremacist groups has occurred alongside a rise in white supremacist violence. In 2020, 13% of extremist demonstrations and violent acts involved white nationalists, according to data from the Armed Conflict Location & Event Data project, as reported by Reuters. That has grown every year since, and by 2024, almost 80% of those events involved white supremacists.\n\nIn the future, it will be more difficult to obtain data on white supremacist violence because the Trump administration has cut or scaled back federal programs collecting such data and countering such domestic terrorism. Naturally, that is a boon to the movement.\n\nIt probably isn’t a coincidence that the most visible instance of political violence with white supremacist overtones was the Jan. 6, 2021, attack on the U.S. Capitol. That insurrection was led by pro-Trump forces and initiated by Trump as a way to overturn his loss to Joe Biden in the 2020 presidential election. At the beginning of his second term, Trump pardoned many of the offenders, thereby sanctioning their violent acts.\n\nEchoing the white supremacist movement, Trump has repeatedly sought to erase gains made during the historic Civil Rights movement. His administration has purged acknowledgement of milestone accomplishments by Black, Latino, and LGBTQ+ Americans.\n\nAs part of the so-called Department of Government Efficiency’s attack on government agencies, racists loyal to Trump benefactor Elon Musk were installed and supported in the administration. Most notably, as part of Trump’s anti-immigrant agenda, U.S. Immigration and Customs Enforcement has been deployed to engage in street-level thuggery to harass, manhandle, and abuse migrant populations and the communities that support them.\n\nIn one of the more open endorsements of the type of white supremacy that groups like Aryan Freedom Network espouse, Trump has gone about restoring statues and military base names meant to honor pro-slavery Confederates.\n\nThe administration’s allies are on a neo-Nazi kick as well. Musk has allowed pro-Nazi content to flourish and thrive on his social media site, X, formerly Twitter. Musk has expressed support for Nazi-affiliated parties around the world, including the extremist Alternative for Germany party.\n\nOn Fox News, host Greg Gutfeld recently argued that conservatives should tell each other “What up, my Nazi? Hey, what up, my Nazi?” to mock Americans’ sensitivities to racism. Conspiracy theorist Alex Jones, one of the biggest Trump backers in media, posted a meme on Wednesday that argued “We Are ALL Hitler” after Musk and Trump were criticized for making Nazi-style salutes.\n\nThe affiliation between Trump and the neo-Nazi right was a topic of concern raised by then-Vice President Kamala Harris during her presidential campaign last year.\n\n“I think it’s a tragedy that we have someone who wants to be president who has consistently over the course of his career attempted to use race to divide the American people,” Harris said last September.\n\nNow the tragedy has come to pass.","summary":"Neo-Nazi groups are praising President Donald Trump for bringing their bigoted ideas and rhetoric into the mainstream of American politics. Over the years, multiple Democratic leaders have warned about this possibility.\n\n\n\nReuters reported on Friday that the Aryan Freedom Network, a Texas-based white supremacist group, is pleased with the direction that Trump has taken the country in. Co-leader Dalton Henry Stout told the outlet Trump has “awakened a lot of people to the issues we’ve been raising for years” and described the head of the Republican Party as “the best thing that’s happened to us.”\n\n\n\nThe white supremacists told Reuters they love Trump’s repeated praise of “Western values,” his attacks on DEI (diversity, equity, and inclusion) initiatives, and his opposition to immigration. Trump’s parroting of their brand of hate has reportedly increased interest and recruitment in the group.\n\n\n\n\nWhite supremacists march in Charlottesville, Virginia, in August 2017.\n\n\nAryan Freedom Network describes itself as a","url":"https://www.dailykos.com/story/2025/8/8/2337463/-Nazis-are-having-a-moment-and-they-re-thanking-Trump?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1459723/story_image/AP25204132888181.jpg?1753289973","video":null,"publish_date":"2025-08-09 00:01:04","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","source_country":"US","sentiment":0.036},{"id":349476784,"title":"Trump Accused Of Displaying MORE 'Dementia' Signs as Prez Warns of a 'Great Depression' if His Tariffs Are Booted By the 'Radical Left Court' — 'He's Delusional!'","text":"Donald Trump has raised more concerns about his mental health, after the president went on another rambling rant supporting his newly enacted tariffs, RadarOnline.com can reveal.\n\nTrump warned on Friday, August 8, that blocking his business policies would lead to an economic collapse not seen since the Great Depression.Dozens of countries faced a sudden surge in import taxes as the tariffs took effect. Goods from more than 60 countries and the European Union are now subject to tariff rates of 10% or higher. \n\nProducts from the EU, Japan, and South Korea are taxed at 15 percent, while imports from Taiwan, Vietnam, and Bangladesh are taxed at 20 percent. \n\nMany economists have cautioned the extreme new taxes could put the U.S. economy into a tailspin, but Trump took to his Truth Social platform to say the exact opposite.\"Tariffs are having a huge positive impact on the Stock Market. Almost every day, new records are set,\" he posted. \"In addition, Hundreds of Billions of Dollars are pouring into our Country’s coffers. \n\n\"If a Radical Left Court ruled against us at this late date, in an attempt to bring down or disturb the largest amount of money, wealth creation and influence the U.S.A. has ever seen, it would be impossible to ever recover, or pay back, these massive sums of money and honor. \n\n\"It would be 1929 all over again, a GREAT DEPRESSION!\"Trump's Tariff ThreatTrump continued: \"If they were going to rule against the wealth, strength, and power of America, they should have done so LONG AGO, at the beginning of the case, where our entire Country, while never having a chance at this kind of GREATNESS again, would not have been put in 1929 style jeopardy. \n\n\"There is no way America could recover from such a judicial tragedy, but I know our Court System better than anyone. There is no one in history that has gone through the trials, tribulations, and uncertainties such as I, and absolutely terrible, but also amazingly beautiful, things can happen.\"\n\n\"Our Country deserves SUCCESS AND GREATNESS, NOT TURMOIL, FAILURE, AND DISGRACE. GOD BLESS AMERICA!\" he concluded his rant.Critics Call Trump OutHowever, the lengthy message was met with harsh resistance from critics who openly wondered what the president was thinking.\n\nOne person tweeted: \"Guess Trump hadn’t read history books or books on the economy about how Hoover’s tariffs resulted in the Great Depression. Trump is a clown.\"\n\nAnother echoed: \"Old man Donald Trump is babbling about his tariffs as if they're not what's going to be what sends us into another Great Depression. This guy is inept, and he's a disgrace.\"\n\nWhile one user added: \"This senile Felon needs to be 25thed or impeached once and for all. Power needs to be TAKEN AWAY from him, ASAP.\"\n\nAs a fourth blasted: \"There is nothing more annoying than a narcissist on the verge of mental collapse playing the victim.\"Walking on the White HouseTrump has been facing an increase in questions about his mental capacity, especially after he was seen yelling bizarre, nonsensical things while taking a walk on the White House roof.\n\nOn Tuesday, August 5, the 79-year-old was seen above the briefing room as he inspected the iconic building for possible construction in the future.\n\n\"Just taking a little walk,\" Trump yelled back at reporters after they questioned why he was on the roof of the White House.\n\nThey asked: \"What are you building?\" to which he responded, \"It goes with the ballroom, which is on the other side,\" and added, \"Something beautiful.\"\n\nTrump then claimed any construction that was to occur would be on his dime, boasting, \"Just more ways to spend my money for the country... Anything I do is financed by me.\"","summary":"The president suggested opposing him would lead to another economic collapse.","url":"https://radaronline.com/p/trump-dementia-great-depression-tariffs/","image":"https://media.radaronline.com/brand-img/2QzQ3SkW1/0x0/trump5-1754424556628.jpg","video":null,"publish_date":"2025-08-09 00:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":-0.17},{"id":349474222,"title":"Mick Clifford: Conspiracy theories are rampant but peddling them is reckless","text":"Conspiracy theories have come in from the cold. There was a time when such theories were confined to the fringes, but no more. One only has to look at how the Jeffrey Epstein case has transfixed the American body politic. \n\nDonald Trump propagated the theory that some form of deep state — including Democrats — had questions to answer around associations with the late paedophile. Then he got into power and saw that it was in his best interests to dismiss these theories, but the followers he had pumped up are now even more suspicious.","summary":" Sinn Féin figures have repeatedly claimed that the Government is going to introduce conscription","url":"https://www.irishexaminer.com/opinion/columnists/arid-41684213.html","image":"https://www.irishexaminer.com/cms_media/module_img/9470/4735358_13_seoimage1x1_GEMMA_20O_27DOHERTY_2017.jpg","video":null,"publish_date":"2025-08-09 00:00:00","author":"Irishexaminer.com,Mick Clifford","authors":["Irishexaminer.com","Mick Clifford"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.381},{"id":349474232,"title":"Scott Lucas: Time for Democrats to make noise and get into trouble","text":"“But after deep reflection, I’ve decided that I will not run for governor in this election. For now, my leadership — and public service — will not be in elected office.”\n\nIf you listened closely, you might have heard the sigh of relief, not just from Democrats but from many independents across the US. It was not just that Harris, justly or unjustly pilloried for her loss to Donald Trump, will not be standing. \n\nIt was that, with headline distractions about a 2028 presidential candidate out of the way, the Democratic Party and America might focus on the important issues at hand: the threat of Trump and his inner circle not just to the economy and to rights but to the future of the US system.\n\nIn the months after electoral failure, some Democrats and many commentators have been busy with self-flagellation, doom, and gloom. The party has not only lost its way, but is in danger of putting itself on the political margins, they say. Democrats have not only lost the working class but are losing Hispanics and young constituents.\n\nSome of the critique is merited. The party failed badly in its communications in autumn 2024. After a promising start to the emergency Harris campaign, following the belated withdrawal of Joe Biden, it gave up the narrative on key issues — notably the economy and immigration — to Trump and his acolytes. \n\nHarris’s performance in the sole debate was not enough to overtake the spectacle of Trump’s lies, distortions, and craziness. That failure was replicated in key congressional races. \n\nSo Democrats not only lost the White House, they failed to regain either the house or the senate. The Trumpists now dominated not only the executive but also the legislature and, through previous judicial appointments, the supreme court.\n\nBut much of the hand-wringing has been misleading. One of its themes is that the Democrats, controlled by the “radical left”, gave up on the economy and immigration by focusing on marginal cultural issues.\n\nThe “radical left” label is nonsense. For 50 years, Biden was an exemplar of centrist politics. Harris had tacked sharply away from the progressive image in her 2020 presidential run. Tim Walz, her vice presidential pick, was liked by progressives but is still a pragmatic centrist.\n\nThe Democratic national committee was firmly in the grips of the centre, so much so that it was being criticised for being too cautious in its approach and messaging. \n\nIn contrast, the most active campaigners on key economic issues, following the 2024 debacle, have been progressives such as Alexandra Ocasio-Cortez, Bernie Sanders, and Gretchen Whitmer, along with centrists such as former Chicago mayor Rahm Emanuel.\n\nThe snipe at cultural issues is more of a call for Democrats to tone down and even set aside attention to rights. It rests on a caricature that activists are obsessed with pronouns and self-identification.\n\nIn fact, at a time when the Trump administration is dismantling women’s rights, rallying for those rights — including reproductive rights — is needed more than ever. As Trump and Co. try to erase transgender people, a pride in LGBT+ rights is not a black mark or a scarlet letter. \n\nWhen migrants and asylum seekers are being rounded up and disappeared in foreign prisons, discussions of race, ethnicity, and America are needed more than ever.\n\nThe hand-wringers have highlighted a poll with a “favourable” rating of the Democrats of 28%, its lowest mark since 1992. But they haven’t considered that the rating could be effect rather than cause, given the pervasive, misleading “attack” narratives of Trumpists that are amplified by media.\n\nNor have they noted that much of the disquiet around the Democrats is that they are “weak” and “ineffective” — in other words, not speaking out on issues include those concerning rights.\n\nDemocrat advantage\n\nFAR from being down and out, Democrats have regained the advantage in party affiliation for the first time since 2022, with 46% of Americans identifying as Democrats or independent-leaning Democratic versus 43% who identify as Republican or Republican-leaning.\n\nMoreover, in surveys about the 2026 mid-term elections, the Democrats consistently hold an edge of around 3% over the GOP.\n\nThat Democrat edge is likely to widen as the economic downturn, fed by tariff chaos and the Trump administration’s “chainsaw” to the US system, takes hold in the coming months.\n\nBeyond superficial commentary about “left” and “centre”, the obvious and productive line is that this is not one way or the other: the Democratic Party, like any concerned activist, can seek a way forward on the economy, immigration, and rights.\n\nThey have talent across the political spectrum: governors such as Whitmer of Michigan, Andy Beshear of Kentucky, Josh Shapiro of Pennsylvania, Wes Moore of Maryland; senators such as Chris Murphy of Connecticut, Jon Ossoff of Georgia, and Bernie Sanders of Vermont; representatives including Ocasio-Cortez, Jasmine Crockett of Texas, Melanie Stansbury of New Mexico and Jamie Raskin of Maryland; and the ground troops at state and local level.\n\nMost importantly, they have a cause that needs to break through the doom-and-gloom, the Trumpian chaos, and the white noise across social media. \n\nThe US system is at risk of not just being bent but broken by an administration seeking authoritarian power, from the disregard and abuse of law and the constitution to the falsification of reality and the never-ending assault on “enemies”.\n\nThe late John Lewis, a civil rights icon who served 34 years in congress, famously said: “We must be the change we wish to see in the world”. \n\nBut he also cautioned that there would be those who would say the contest was lost. There would be those who would say, in the face of adversity, that it would be better to quiet down about rights and justice.\n\nHis advice? “Never, ever be afraid to make some noise and get in good trouble, necessary trouble.”\n\n Scott Lucas is professor of international politics at the Clinton Institute, University College Dublin; professor emeritus of international politics at the University of Birmingham; and editor-in-chief of EA WorldView.","summary":"The Democrats lost to Trump not because of the ‘radical left’, but because the party has long been in thrall to an overly-cautious centre. To win, that must change, writes Scott Lucas","url":"https://www.irishexaminer.com/opinion/commentanalysis/arid-41684123.html","image":"https://www.irishexaminer.com/cms_media/module_img/9470/4735088_8_seoimage1x1_GettyImages-1179403442_1_.jpg","video":null,"publish_date":"2025-08-08 23:59:00","author":"Irishexaminer.com,Scott Lucas","authors":["Irishexaminer.com","Scott Lucas"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.039},{"id":349468408,"title":"Trump is burning through IRS heads at a rate of almost 1 a month. Here's who's held the job, and why they left.","text":"President Donald Trump is over six and a half months into his second term. In that time, he's averaged a new IRS leader roughly every month.There have been six acting or confirmed commissioners in 2025, counting former Commissioner Danny Werfel, who resigned just as Trump took office, even though his term lasted until 2027.On Friday, IRS Commissioner Billy Long wrote on X that he was leaving his post less than two months after being confirmed to become the US Ambassador to Iceland. Treasury Secretary Scott Bessent will serve as acting commissioner.The unprecedented turnover at the top — President Joe Biden had just three IRS commissioners over his four-year term — extends throughout the IRS workforce. More than 25,000 employees have left the agency since Trump took office.","summary":"President Donald Trump's pick for IRS commissioner is moving on. Here's who else has had the job this year and why they left.","url":"https://www.businessinsider.com/trump-irs-commissioner-turnover-who-why-they-left-2025-8","image":"https://i.insider.com/689669f0cfc04e97619b2641?width=1200&format=jpeg","video":null,"publish_date":"2025-08-08 23:56:17","author":"Brent D. Griffiths,Kelsey Vlamis","authors":["Brent D. Griffiths","Kelsey Vlamis"],"language":"en","source_country":"us","sentiment":-0.559},{"id":349472916,"title":"Trump says he will meet Putin in Alaska next Friday to discuss Ukraine war","text":"Donald Trump has said he will meet with Vladimir Putin to discuss the war in Ukraine next week and said an end to the three-and-a-half-year war would have to involve “some swapping of territories”.\n\nTrump said he planned to meet the Russian president next Friday in Alaska. He announced the location in a brief post on his Truth Social site.\n\nRussian state media agency Tass confirmed the date and location of the meeting, citing Kremlin aide Yury Ushakov.\n\nEarlier in the day, Trump told reporters in the White House the meeting “would have been sooner, but I guess there’s security arrangements that unfortunately people have to make”.\n\nThe US president also said “there’ll be some swapping of territories to the betterment of both” Ukraine and Russia and that the issue would be discussed soon but he gave no further details.\n\nBloomberg reported on Friday that the deal could cement some of Putin’s territorial gains in Ukraine, in effect freezing the battle lines in the Kherson and Zaporizhzhia regions. Putin has claimed four Ukrainian regions in their entirety, although much of their territory remains under Ukrainian control.\n\nUS and Russian officials were working on a deal under which Russia would halt its offensive in exchange for the territorial concessions – making it a politically fraught proposal in Ukraine, Bloomberg said.\n\nTrump’s comments came after Poland’s prime minister said a “freeze” in the conflict could be close, after speaking with the Ukrainian leader, Volodymyr Zelenskyy, who has communicated with Trump and European leaders in recent days.\n\n“There are certain signals, and we also have an intuition, that perhaps a freeze in the conflict – I don’t want to say the end, but a freeze in the conflict – is closer than it is further away,” Donald Tusk said during a news conference. “There are hopes for this.”\n\nTusk said Zelenskyy was “very cautious but optimistic” about the ceasefire, Reuters reported. Ukraine was keen that Poland and other European countries play a role in planning for a ceasefire and an eventual peace settlement, Tusk said.\n\nTrump has previously expressed his readiness to meet Putin one on one without preconditions, including direct negotiations between Putin and Zelenskyy, stoking fears that Ukraine may be left out of negotiations for the framework of a potential ceasefire.\n\nIf the summit happens, it would be the first US-Russia summit since 2021, when former president Joe Biden met Putin in Geneva.\n\nZelenskyy has responded by speaking with European leaders including the German chancellor, Friedrich Merz, and the French president, Emmanuel Macron, who are key conduits to Trump.\n\nThe US envoy Steve Witkoff had proposed a three-way meeting with Trump, Putin and Zelenskyy but the Kremlin had ignored that suggestion, said the Putin aide Yuri Ushakov, and was “focusing on preparations for a bilateral meeting with Trump in the first place”.\n\nPutin has said he is not ready to meet Zelenskyy, even as the Kremlin claimed preparations were under way for a bilateral summit with Trump next week.\n\n“I have nothing against it in general, it is possible, but certain conditions must be created for this,” Putin said of a meeting with Zelenskyy. “But unfortunately, we are still far from creating such conditions.”\n\nLast month, Trump issued an ultimatum for Putin to agree to a ceasefire or face secondary sanctions with the deadline set for this Friday. That deadline appeared in place despite plans for the summit, although the White House has not said what secondary measures it could enforce.\n\nTrump did target India with a 25% tariff hike for purchasing Russian oil this week, singling out one of Moscow’s economic enablers in a move that New Delhi complained was unfair and selective.\n\nTrump had grown frustrated with Putin in public in recent months as the war dragged through its third year and Putin continued to launch nightly missile and drone strikes on Ukrainian cities despite Trump’s insistence that he could strike a deal within 24 hours of becoming president.\n\n“Putin … talks nice and then he bombs everybody in the evening,” Trump said last month. “So there’s a little bit of a problem there.”","summary":"US president said end to war will involve ‘some swapping of territories’ before announcing meeting\n\nDonald Trump has said he will meet with Vladimir Putin to discuss the war in Ukraine next week and said an end to the three-and-a-half-year war would have to involve “some swapping of territories”.\n\nTrump said he planned to meet the Russian president next Friday in Alaska. He announced the location in a brief post on his Truth Social site.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/aug/08/trump-says-he-will-meet-putin-very-shortly-to-discuss-end-to-ukraine-war","image":"https://i.guim.co.uk/img/media/be455799bf42ce68c648dc49782e575a43c9907e/157_0_2511_2009/master/2511.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-08-08 23:55:59","author":"Andrew Roth","authors":["Andrew Roth"],"language":"en","category":"politics","source_country":"us","sentiment":-0.434},{"id":349475362,"title":"Trump has invitation to visit Russia — Kremlin aide","text":"MOSCOW, August 9. /TASS/. The Kremlin expects that the next meeting between Russian President Vladimir Putin and his US counterpart Donald Trump to take place on Russian territory after Alaska, Kremlin aide Yury Ushakov told reporters.\n\nCommenting on the choice of Alaska as the venue for the August 15 summit between the Russian and US leaders, he said: \"Looking ahead, it is natural to focus on holding the next meeting between Presidents Vladimir Putin and Donald Trump on Russian territory. The corresponding invitation has already been sent to the US president.\"\n\nEarlier, Trump said he hoped to meet with his Russian counterpart in Alaska on August 15. The US president made this announcement on his Truth Social page. This will be their first face-to-face meeting since Trump returned to the White House in January 2025.\n\nOn August 7, Kremlin aide Yury Ushakov announced that Russia and the US had agreed to a meeting between the two leaders in the coming days. That same day, Vladimir Putin confirmed preparations for a meeting with Trump, noting mutual interest in a bilateral meeting.\n\nThese statements about the upcoming meeting came after US special presidential envoy Steve Witkoff visited Moscow on August 6 and met with Putin. The conversation lasted about three hours.","summary":"\"Looking ahead, it is natural to focus on holding the next meeting between Presidents Vladimir Putin and Donald Trump on Russian territory,\" Yury Ushakov said","url":"https://tass.com/politics/2000067","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-08 23:54:48","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.198},{"id":349469386,"title":"Trump says to meet Putin next Friday in Alaska","text":"The Alaska summit would be the first between sitting US and Russian presidents since Joe Biden met Putin in Geneva in June 2021. (AFP pic)\nWASHINGTON: US President Donald Trump said Friday he would meet Russian counterpart Vladimir Putin in one week in Alaska and suggested that an eventual deal between Moscow and Kyiv to end the war in Ukraine could involve swapping territory.\nTens of thousands of people have been killed since Russia launched its full-scale invasion of Ukraine in February 2022, with millions forced to flee their homes.\nPutin held consultations Friday with the leaders of China and India ahead of the summit with Trump, who has spent his first months in office trying to broker peace in Ukraine without making a breakthrough.\n\"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska,\" Trump said on his Truth Social site.\nHe said earlier at the White House that \"there'll be some swapping of territories to the betterment of both\" Ukraine and Russia, without providing further details.\nThe Kremlin did not immediately confirm the date or location for the talks.\nThree rounds of negotiations between Russia and Ukraine have failed to bear fruit, and it remains unclear whether a summit would bring peace any closer.\nRussian bombardments have forced millions of people to flee their homes and have destroyed swathes of eastern and southern Ukraine.\nPutin has resisted multiple calls from the US, Europe and Kyiv for a ceasefire.\nHe has also ruled out holding talks with Volodymyr Zelensky at this stage, a meeting the Ukrainian president says is necessary to make headway on a deal.\nAt talks in Istanbul last month, Russian negotiators outlined hardline territorial demands for halting its advance – calling for Kyiv to withdraw from some territory it controls and to renounce Western military support.\nThe Alaska summit would be the first between sitting US and Russian presidents since Joe Biden met Putin in Geneva in June 2021.\nTrump and Putin last sat together in 2019 at a G20 summit meeting in Japan during Trump's first term. They have spoken by telephone several times since January.\nWitkoff visit \nThe Kremlin said Friday that Putin had updated Chinese President Xi Jinping on \"the main results of his conversation\" with US special envoy Steve Witkoff, who visited Moscow earlier this week.\nXi expressed support for a \"long-term\" solution to the conflict, the Kremlin said.\nChina's Xinhua state news agency quoted Xi as having told Putin, \"China is glad to see Russia and the US maintain contact, improve their relations, and promote a political settlement of the Ukraine crisis.\"\nMoscow and Beijing have deepened political, economic and military ties since the start of Russia's offensive in Ukraine.\nPutin also spoke by phone to India's Prime Minister Narendra Modi after both countries condemned new US tariffs over New Delhi's oil purchases from Russia.\nXi and Modi have both tried to tout their own peace initiatives for Ukraine, though they have gained little traction.\nPutin, a former KGB agent who has ruled Russia for more than 25 years, said in June that he was ready to meet Zelensky, but only during a \"final phase\" of negotiations on ending the conflict.\nIn his regular evening address on Thursday, Zelensky said, \"It is only fair that Ukraine should be a participant in the negotiations.\"\nDonetsk governor Vadym Filashkin said Friday that families with children would be evacuated from 19 more villages in the region's east, where Russian forces have been advancing.\nThe villages, home to hundreds of people, are all within about 20 miles (30km) of the front line.","summary":"The US president said a potential Moscow-Kyiv peace deal could include territorial swaps to end the Ukraine war.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/09/trump-says-to-meet-putin-next-friday-in-alaska","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=85,format=auto,fit=scale-down,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2024/11/0b1c0c2c-afp__20241107__36lu69l__v1__highres__combousrussiavotediplomacytrumpputin.","video":null,"publish_date":"2025-08-08 23:51:17","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.264},{"id":349473964,"title":"Judge weighs Trump administration's request to end protections for immigrant children","text":"MCALLEN, Texas -- A judge on Friday was considering a Trump administration request to end a decades-old policy on protections for immigrant children in federal custody that the government says is inhibiting its immigration crackdown.\n\nThe administration asked U.S. District Judge Dolly Gee in Los Angeles during a hearing to dissolve the policy, which limits how long Customs and Border Protection can hold immigrant children and requires them to be kept in safe and sanitary conditions.\n\nGee, who oversees what is known as the Flores agreement, expressed skepticism at the government's request but did not immediately issue a ruling. It was not clear how soon she will rule.\n\nThe judge pressed government attorney Joshua McCroskey on why President Donald Trump's administration was holding children at the border for longer than the 72 hours laid out in the agreement when border arrests have reached record lows. She said it seems like conditions should be improving but they \"are deteriorating.\"\n\n\"It seems counterintuitive that should happen unless it's willful,\" said Gee, who was nominated to the court by President Barack Obama.\n\nMcCroskey said some children are being held for longer because Trump as part of his crackdown ended the Biden administration's policy that allowed expedited releases of immigrants. McCroskey also pointed to logistical challenges that resulted from the closure of temporary facilities that were set up under President Joe Biden to handle an influx of immigrants.\n\nIn May, CBP held 46 children over a week, including six children held for over two weeks and four children held 19 days, according to data revealed in a court filing. In March and April, CPB reported that it had 213 children in custody for more than 72 hours. That included 14 children, including toddlers, who were held for over 20 days in April.\n\nAdvocates for immigrant children asked the judge to keep protections and oversight in place and submitted accounts from immigrants in Texas family detention centers who described adults fighting children for clean water, despondent toddlers and a child with swollen feet who was denied a medical exam. The advocates also want the judge to expand independent monitoring.\n\n\"I have met children who have spent days in jail cells with barely more than ramen noodles to eat, lights on day and night, no sunlight or access to the outside world and the indignity of using the restroom in front of guards. On top of that trauma - then to be flown to family detention and locked up with no end in sight? It is truly shameful,\" Leecia Welch, the deputy legal director at Children's Rights, said in an interview after the hearing.\n\nThe Flores agreement, named for a teenage plaintiff, was the result of over a decade of litigation between attorneys representing the rights of immigrant children and the U.S. government over widespread allegations of mistreatment in the 1980s. It governs the conditions for all immigrant children in U.S. custody, including those traveling alone or with their parents.\n\nIn its written motion, the Trump administration said the government has made substantial changes since the agreement was formalized in 1997, creating standards and policies governing the custody of immigrant children that conform to legislation and the agreement.\n\nThe administration is looking to expand immigration detention space, including by building more centers like one in Florida dubbed \"Alligator Alcatraz,\" where a lawsuit alleges detainees' constitutional rights are being violated. In court, an attorney for the government, Tiberius Davis, acknowledged that the agreement hampers the administration's efforts, even though Trump's tax and spending bill provided billions to build new immigration facilities.\n\nDavis said the bill gives the government authority to hold families in detention indefinitely. \"But currently under the Flores settlement agreement, that's essentially void,\" he said.\n\nThe Biden administration successfully pushed to partially end the agreement last year. Gee ruled that special court supervision may end when the children are transferred from CPB custody to the Department of Health and Human Services. But she carved out exceptions for certain types of facilities for children with more acute needs.","summary":"A judge on Friday was considering a Trump administration request to end a decades-old policy on protections for immigrant children in federal custody that the government says is inhibiting its immigration crackdown.","url":"https://abc7.com/post/judge-weighs-trump-administrations-request-end-protections-immigrant-children/17476324/","image":"https://cdn.abcotvs.com/dip/images/17476282_080825-cc-ap-immigrant-child-texas-facility-img.jpg?w=1600","video":null,"publish_date":"2025-08-08 23:50:19","author":"President Barack Obama","authors":["President Barack Obama"],"language":"en","category":"politics","source_country":"us","sentiment":-0.161},{"id":349474228,"title":"Colin Sheridan: Stephen Colbert's axing brings to mind the lack of political satire here","text":"President Donald Trump is the gift that never stops giving to monologue makers, and if there's one thing Colbert can deliver with panache, it's a damn good monologue.\n\nPerhaps, too good, because his nightly shrine to shot glasses of satire and political punch‑drunk comedy has been abolished. CBS, citing financial woes, has slated the final curtain for May 2026, closing not just Colbert’s show but the entire Late Show franchise.\n\nIt’s the end of an era. Since Letterman passed the torch in 2015, Colbert has used that stage as part-sarcastic political commentator, part-sky-high comic helmsman. In the last season alone, he reigned as ratings champ among late‑night talkies, improbably packing more audience than over‑caffeinated hours warrant.\n\nSo yes, it may have been a “purely financial” choice, as CBS insists. But that phrase feels about as believable now as our own government saying they intend to pass the Occupied Territories Bill. \n\nIt comes just after Colbert’s attack on a Trump‑Paramount $16 million “bribe” just days before the axe fell — timing that smells less like coincidence and more like political orchestration.\n\nFellow comic gladiators rushed to his defence. Jon Stewart roared on The Daily Show: “This is not the moment to give in … you are fucking wrong,” decrying corporate fear over political reprisals. John Oliver lamented the loss of a fertile training ground for future late‑night scribes, calling it “incredibly sad\".\n\nWhat will it mean for our own Late Late Show? For decades, it’s been a cross‑population of small‑town sentiment, big‑city celebrity sycophancy, and hushed confessions over talk of tragedies, triumphs, and teddy bears. And every so often it even platforms a proper comedian, albeit one who knows better than to mock a sitting TD.\n\nAnd it's in that vacuum we could all do with a little Colbert. There is little or no political satire on Irish television these days - and doing mediocre impressions does not count. \n\nHost Patrick Kielty is a fireman reduced to rescuing kittens from a tree, and it's perhaps because of that that the Late Late Show is weathering whatever storm downed Colbert in the US. Its appeal may lean more cosy than cutting, but the crowds still tune in.\n\nStill, you can't help wondering: does Colbert's demise signal the death of the late-night format, or merely the flick‑off of an old lamp?\n\nStreaming platforms, TikTok, 24‑hour news cycles — they’re all wedding their viewers to the immediacy of media, stealing them away from the half‑hour a night in front of the TV. \n\nCBS isn’t the only network hitting budgetary bottom, though it’s certainly first to pitch out the stage talent. Even NBC’s stalwarts are trimming staff and band members. Attitudes and ad revenue are shifting, fast.\n\nBut here’s the irony: late-night talk shows are vital national psychotherapies. A place where politicians are cut into satire, pop stars unfurl their latest single, and comedians sharpen their wit against the absurd. \n\n The loss of Colbert’s show leaves a hole — one that’s political, comic, and uncomfortably silent.\n\nIn contrast, The Late Late Show stands as a testament to bland adaptability. It’s become more relatable because of, not despite, its softer profile. \n\nWhen guests spill their innermost thoughts or confess shame over missed anniversaries, we nod along, waiting for the former weather girl to tell us how stressful she found Dancing with the Stars. \n\nThere is little or nothing revolutionary about the formula. RTÉ can point to the Tommy Tiernan Show as a totem of brave programming, but, despite the quality differential, you can be damn sure which darling they'd kill first if given a choice.\n\nWhich is why the American axing is unlikely to trouble Kielty and co just yet, largely because the Late Late acts like an art project. A loss leader, less about the shining host, more about the cultural heartbeat it captures.\n\nColbert's exit, counterintuitively, does amplify the dearth of political criticism in Ireland, however. How can a nation of storytellers and general smart arses not produce one hour-long piece of satire per week, especially when there has never been more material with which to humorously work?\n\nI think I know the answer. And it might be much closer to Trump's America than we like to admit — the politicians would never allow it.","summary":"The Late Show with Stephen Colbert saw its host deliver nightly shot glasses of satire and political punch‑drunk comedy. Our own Late Late Show is more cosy than cutting","url":"https://www.irishexaminer.com/opinion/columnists/arid-41684450.html","image":"https://www.irishexaminer.com/cms_media/module_img/9472/4736138_13_seoimage1x1_US_20Harry_20080864_1_.jpg","video":null,"publish_date":"2025-08-08 23:44:00","author":"Colin Sheridan,Irishexaminer.com","authors":["Colin Sheridan","Irishexaminer.com"],"language":"en","source_country":"ie","sentiment":-0.067},{"id":349475360,"title":"Putin, Trump to discuss long-term settlement on Ukraine in Alaska — Kremlin aide","text":"MOSCOW, August 9. /TASS/. Russian President Vladimir Putin and his US counterpart Donald Trump will focus on discussing a long-term settlement of the Ukrainian conflict during their summit in Alaska, Kremlin aide Yury Ushakov told reporters.\n\nHe noted that \"the economic interests of our countries intersect in Alaska and the Arctic, and there are prospects for implementing large-scale, mutually beneficial projects.\"\n\n\"But, of course, the presidents themselves will undoubtedly focus on discussing options for achieving a long-term peaceful settlement of the Ukrainian crisis,\" Ushakov said.\n\nEarlier, Trump said he hoped to meet with his Russian counterpart in Alaska on August 15. The US president made this announcement on his Truth Social page. This will be their first face-to-face meeting since Trump returned to the White House in January 2025.\n\nOn August 7, Kremlin aide Yury Ushakov announced that Russia and the US had agreed to a meeting between the two leaders in the coming days. That same day, Vladimir Putin confirmed preparations for a meeting with Trump, noting mutual interest in a bilateral meeting.\n\nThese statements about the upcoming meeting came after US special presidential envoy Steve Witkoff visited Moscow on August 6 and met with Putin. The conversation lasted about three hours.","summary":"Yury Ushakov added that \"the economic interests of our countries intersect in Alaska and the Arctic, and there are prospects for implementing large-scale, mutually beneficial projects\"","url":"https://tass.com/politics/2000065","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-08 23:40:56","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.032},{"id":349463860,"title":"Major nation fears US could ‘invade’","text":"The extraordinary comments from Claudia Sheinbaum came after it was revealed that Donald Trump had signed a “secretive” order directing the Pentagon to target drug cartels considered to be terrorist organisations. \n\nThat raises the prospect of the US military engaging cartels abroad. \n\nGiven much of the drugs coming into the US pass through Mexico, that country could be a target for military action. \n\nIt comes as the US Secretary of State Marco Rubio announced a $76 million bounty for information leading to the arrest of Venezuelan dictator Nicolas Maduro.\n\nThe US has claimed the president of the Latin American nation is the leader of a drug cartel.\n\n‘There will be no invasion of Mexico’\n\nIn the past, the US has used its military in a number of Latin American nations including Cuba and Panama.\n\nPresident Sheinbaum is furious at any suggestion the US military could now play a role on Mexican territory, especially as a crackdown put in place by her has seen the amount of drugs crossing the border dramatically fall.\n\n“The United States is not going to come to Mexico with the military,” Ms Sheinbaum said on Friday, Mexico time. \n\n“We co-operate, we collaborate, but there is not going to be an invasion. That is ruled out, absolutely ruled out.\n\n“It is not part of any agreement, far from it. \n\n“When it has been brought up, we have always said no.”\n\nThat suggests the US has approached Mexico seeking permission to go after cartels within its borders. \n\nIt was said that President Trump had to be dissuaded from using the US military in Mexico during his first term.\n\nMs Sheinbaum was adamant that whatever the Trump order meant it did not mean that the American military would be positioned in Mexico. \n\n“We were informed that this executive order was coming and that it had nothing to do with the participation of any military personnel or any institution in our territory”.\n\nA major operation by Mexico with hundreds of troops targeting drugs gangs has seen fentanyl seizures in the US drop by 50 per cent in the past few months. \n\nThat casts some doubt on why the US would need to take such drastic action.\n\nTrump ‘secret directive’ \n\nOn Friday, US time, the New York Times said Mr Trump has “secretly signed a directive” reclassifying some drug cartels as terrorist organisations. That gives the US military an official basis to conduct operations either at sea or in foreign countries. \n\nThe US military has subsequently begun drawing up options for Mr Trump.\n\nIt is unclear what if any action the US could take not just in Mexico but any number of Latin Americans countries. \n\nIt’s not thought the US is looking to topple governments, for instance.\n\nBut, the US military could intercept suspected drug transports in international waters; it could bomb suspected drug factories or land troops in a foreign nation in an attempt to capture suspects.\n\nHowever, without the approval of Congress it’s possible any action could raise legal issues including murder charges against US personnel if civilians, or even suspects, were killed in an overseas operation. \n\n$76m reward for arrest of country’s leader\n\nIn late July, the Trump admission added the Cartel de los Sole, or Cartel of the Suns, to the list of global terror groups. \n\nIt claims Venezuela’s President Maduro is the head of the gang. \n\nOn Friday, Secretary Rubio said the US was “announcing a reward offer increase of up to $US50 million ($A76m) under the Narcotics Rewards Program for information leading to the arrest and/or conviction of Nicolas Maduro for violating US narcotics laws”.\n\n“For over a decade, Maduro has been a leader of Cartel de los Soles, which is responsible for trafficking drugs into the United States.\n\n“Since 2020, Maduro has strangled democracy and grasped at power in Venezuela,” added Mr Rubio.\n\n“Maduro claimed to have won Venezuela’s 2024 presidential election but failed to present any evidence that he had prevailed.\n\n“The United States has refused to recognise Maduro as the winner of 2024 election and does not recognise him as the President of Venezuela.”","summary":"A “secret directive” by Trump has raised the possibility the US could “invade” Mexico while the White House has put a reward out for the capture of a leader.","url":"https://www.news.com.au/world/north-america/us-politics/mexico-insists-the-us-wont-invade-while-trump-puts-bounty-on-venezuelas-leader/news-story/f528b946fc6902e0f09d8ccceda7019b?from=rss-basic","image":"https://content.api.news/v3/images/bin/0fdd0ff6b33c58e1e9e864adbf558c0a","video":null,"publish_date":"2025-08-08 23:36:28","author":"Benedict Brook In The Us","authors":["Benedict Brook In The Us"],"language":"en","category":"politics","source_country":"au","sentiment":-0.053},{"id":349467294,"title":"Trump-Putin summit: Meeting set for next Friday in Alaska; to discuss ending Ukraine war","text":"US President Donald Trump will meet Russian President Vladimir Putin next Friday in Alaska to discuss an end to Russia’s ongoing war in Ukraine.In a post on Truth Social, Trump said, \"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin of Russia will take place next Friday, August 15, 2025, in the Great State of Alaska.\"\"Further details to follow. Thank you for your attention to this matter!\" he added.Putin’s trip to Alaska will be his first to the US in a decade. The last time Russia’s leader was in the country was for a meeting with President Barack Obama at the UN General Assembly in New York in September 2015.The announcement came just hours after Trump told reporters he planned to discuss the ongoing war in Ukraine with Putin. The President expressed cautious optimism, saying he believes “we have a shot” at brokering a peace deal between Russia and Ukraine.Earlier, the Kremlin announced the expected meeting between both leaders after US envoy Steve Witkoff met Putin in Moscow.Witkoff, during his visit to Moscow, had proposed a trilateral meeting with Zelensky, but Russia did not respond to that proposal. \"The Russian side left this option completely without comment,\" Ushkov added.On Wednesday, Trump said he is likely to meet Putin face-to-face \"very soon.\"Trump has been attempting to broker an end to Russia's military assault on Ukraine; however, three rounds of direct talks between Moscow and Kyiv have failed to yield any progress.Both sides remain adamant and appear far from ending the more than three-year-long war. Since February 2022, tens of thousands have been killed in the conflict between Russia and Ukraine, and Russian assaults have forced millions to flee their homes. Despite repeated calls from the US, Europe, and Ukraine, Russia has resisted a ceasefire.","summary":"President Donald Trump announced a meeting with Russian President Vladimir Putin in Alaska on August 15, 2025, to discuss ending the ongoing war in Ukraine. This marks Putin's first visit to the US in a decade, signaling a potential shift in diplomatic efforts. Trump expressed optimism about brokering a peace deal, despite previous failed talks between Moscow and Kyiv.","url":"https://timesofindia.indiatimes.com/world/us/trump-putin-summit-meeting-set-for-next-friday-in-alaska-to-discuss-ending-ukraine-war/articleshow/123197831.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123197828/123197828.jpg","video":null,"publish_date":"2025-08-08 23:33:59","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":-0.398},{"id":349475366,"title":"Kremlin confirms that Putin-Trump summit to take place in Alaska on August 15","text":"MOSCOW, August 9. /TASS/. Russian President Vladimir Putin and his US counterpart Donald Trump will meet in Alaska on August 15, Kremlin aide Yury Ushakov told reporters.\n\n\"The US side has just announced that an agreement has been reached to organize a meeting between Russian President Vladimir Putin and US President Donald Trump on August 15, Friday, in Alaska. Russia and the US are close neighbors, bordering each other. It seems quite logical that our delegation should simply fly across the Bering Strait, and that such an important and long-awaited summit between the leaders of the two countries should be held there,\" the Kremlin aide said.\n\nEarlier, Trump said he hoped to meet with his Russian counterpart in Alaska on August 15. The US president made this announcement on his Truth Social page. This will be their first face-to-face meeting since Trump returned to the White House in January 2025.\n\nOn August 7, Kremlin aide Yury Ushakov announced that Russia and the US had agreed to a meeting between the two leaders in the coming days. That same day, Vladimir Putin confirmed preparations for a meeting with Trump, noting mutual interest in a bilateral meeting.\n\nThese statements about the upcoming meeting came after US special presidential envoy Steve Witkoff visited Moscow on August 6 and met with Putin. The conversation lasted about three hours.","summary":"\"It seems quite logical that our delegation should simply fly across the Bering Strait, and that such an important and long-awaited summit between the leaders of the two countries should be held there,\" Kremlin aide Yury Ushakov said","url":"https://tass.com/politics/2000063","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20250809/1451073.jpg","video":null,"publish_date":"2025-08-08 23:31:59","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":0.03},{"id":349473746,"title":"Letters: Is the US sleepwalking toward Armageddon?","text":"Is US sleepwalking\ntoward Armageddon?\n\nRe: “Trump orders US nuclear subs moved over statements from Russia’s Medvedev” (Page A3, Aug. 2).\n\nAre we sleepwalking into Armageddon? As Ukraine’s military situation continues to deteriorate, tensions with Russia are worsening. Donald Trump’s threatened sanctions deadline is approaching with no sign of Russia’s intention to comply. For example, tensions are mounting in the Baltic region after General Donahue’s recent declaration that his troops could seize the Russian city of Kaliningrad in a day. Now, President Trump, overreacting to several “provocative” social media posts by former Russian President Medvedev, has announced the redeployment of two nuclear-armed submarines to “appropriate regions,” presumably closer to Russia.\n\nLeaders who represent the two nations that possess 87% of the nuclear weapons on Earth should abstain from threats, real or implied. The 80th anniversary of the nuclear bombing of Hiroshima on Aug. 8 should be a time for sober reflection and a renewal of efforts to reduce the threat of nuclear war—the war everyone would lose.\n\nMichael Dunlap\n\nOppose the dismantling\nof the Education Dept.\n\nRe: “The Education Department was created to ensure equal access. Who would do that in its absence?” (March 12).\n\nYour recent article about major cuts to the Department of Education touches on an important point.\n\nI am a high school student in Berkeley, and these cuts directly threaten my opportunities and the opportunities of many of my peers to pursue an equal education. Our schools are already severely underfunded, and we cannot afford to lose crucial support for students, teachers and families.\n\nI urge our community and elected officials to stand up for our schools and oppose the dismantling of the Department of Education.\n\nMoses Esterson\n\nResponsibility would\nmost help homeless\n\nRe: “Worry reigns before encampment clearing” (Page A1, Aug. 1).\n\nThe East Bay Times’ front-page piece on the impending closure of a San Jose homeless encampment helped crystallize for me what’s wrong with how the homeless problem is being handled. Most in our progressive-dominated area assume that it’s an essential role of government to help the homeless. Several quoted in the story clearly assume this. And this is routinely assumed whenever homelessness and other problems are discussed.\n\nBut this wasn’t the perspective of America’s founders. They believed (correctly, conservatives like me say) that most adults can and should provide for their own needs and not be dependent on government help. There will always be a small percentage of people who truly can’t. These should certainly be helped, especially by charitable people, organizations and, failing this, by a limited government “safety net.” But many, if not most, homeless simply need to start acting like adults and take responsibility for their lives.\n\nChristopher Andrus\n\nLincoln Ave. changes\nare threat to cyclists\n\nI am a cyclist living in the Dimond district of Oakland off Lincoln Avenue down from Head Royce School. I am on a bicycle daily on Lincoln.\n\nI am appalled at the road modifications that were made at the private Head Royce School, without significant public and neighborhood input. The new modification removes the only shoulder we as bicyclists had in front of this private school, and it creates two lanes where there is only room for one— and now no place for cyclists to go. This is the worst, most unsafe modification that has occurred on this street in my time here, especially for cyclists who are coming down the hill.\n\nThis should never have been allowed without significant input from the community also considering bicycle access needs.\n\nHow could this have been allowed to happen? This must be removed and Lincoln Avenue restored to a safer state for all.\n\nAndrew Norton\n\nTrump’s mandate trope\nhurts truth, democracy\n\nRe: “Harris will not run for governor” (Page A1, July 31).\n\nBehind all of Donald Trump’s power seizures lies the logic: “He got a mandate from the American people — they want him to do this.”\n\nBut he got no mandate. He only won by 1.5 percent points. It was one of the closest elections in American history. He didn’t even get 50% of the vote.\n\nBut our press, including the East Bay Times, keeps feeding this deliberate misunderstanding by casually supporting this false theory, such as in Grant Stringer’s article: “Some observers suggested Harris would face stinging criticism on the campaign trail over her resounding 2024 defeat to now-President Trump.”\n\nNo, it was not “resounding.” Remind readers of the truth, as an informative newspaper should.\n\nSteve Koppman","summary":"Also: Education Department &#124; Real help &#124; Changes create threat &#124; Trump's 'mandate.' East Bay Times reader letters to the editor for Aug. 10, 2025.","url":"https://www.mercurynews.com/2025/08/08/letters-us-sleepwalking-armageddon/","image":"https://www.mercurynews.com/wp-content/uploads/2023/03/hypatia-h_14e15a921151a050abe9932ca7e5f2a1-h_74074052c062403d251b5a250e1fbd89.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-08 23:30:37","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":0.12},{"id":349474176,"title":"Trump is making the White House as tacky as he is","text":"Donald Trump can’t stop gilding the White House. \n\nRecent photos show somehow even more golden trim in the already gold-dusted Oval Office. \n\nProgressive influencer Brian Tyler Cohen posted the inside look to X on Thursday, showing the blindingly bright gold molding on the walls and gold appliqués across the door. These are in addition to the gold-framed paintings hung on the walls. \n\nWhile the new metallic touches might seem minuscule compared with the massive amounts of artwork, trophies, and other yellowish decor across the room, dialing back time to the Oval Office before Trump is a sight to be seen. \n\nWhen Joe Biden was still president, photos of the office showed yellow curtains, but the walls along the historical room were much whiter than what is pictured now. \n\nThen again, it’s not just that room seeing massive changes. Trump has torn into the historical, once-grassy Rose Garden to instead fill the ground with pale stone and white seating that includes the same yellow—or gold—umbrellas seen at his Mar-a-Lago estate in Florida.\n\nIf that weren’t enough, the president announced plans to construct a $200 million golden ballroom with similarly gold decor. \n\nNow it is worth noting that every president has the right to make their own changes to the White House grounds during their stay. However, while changes like Barack Obama’s basketball court have happened in recent years, Trump’s changes have been notably further from the traditional understated White House decor. \n\nIn response to her boss wasting taxpayer money on tacky gold trim, White House press secretary Karoline Leavitt said, “It’s the Golden Office for the Golden Age.”\n\nBut if there’s no golden age going on, then what? Let them eat gold?","summary":"Donald Trump can’t stop gilding the White House. \n\n\n\nRecent photos show somehow even more golden trim in the already gold-dusted Oval Office. \n\n\n\nProgressive influencer Brian Tyler Cohen posted the inside look to X on Thursday, showing the blindingly bright gold molding on the walls and gold appliqués across the door. These are in addition to the gold-framed paintings hung on the walls. \n\n\n\nxTrump is now remodeling the Oval Office to cover it in gold after ordering a $200 million golden ballroom.\n\nAll after cutting 17 million Americans’ health care and taking food away from hungry children. pic.twitter.com/JtCJMaGzwd\n\n— No Lie with Brian Tyler Cohen (@NoLieWithBTC) August 7, 2025\n\n\n\nWhile the new metallic touches might seem minuscule compared with the massive amounts of artwork, trophies, and other yellowish decor across the room, dialing back time to the Oval Office before Trump is a sight to be seen. \n\n\n\nWhen Joe Biden was still president, photos of the office showed yellow curtains, but the walls along the","url":"https://www.dailykos.com/story/2025/8/8/2337493/-Trump-is-making-the-White-House-as-tacky-as-he-is?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1442013/story_image/AP25156576670486.jpg?1749485396","video":null,"publish_date":"2025-08-08 23:30:06","author":"Alix Breeden","authors":["Alix Breeden"],"language":"en","category":"politics","source_country":"US","sentiment":-0.105},{"id":349476782,"title":"Norah O’Donnell Plotting Major CBS Comeback Months After Exiting Network — 'She’s Been Lobbying Hard'","text":"Norah O'Donnell is said to be plotting a major CBS comeback months after ditching her position at the anchor desk, RadarOnline.com can reveal. \n\nWhile sources claimed O'Donnell is angling hard to revive her career, insiders said she's \"delusional\" to think she can climb her way back to the top at the network.An Emotional Goodbye... Featuring OprahAfter five years anchoring CBS Evening News, O'Donnell bid farewell to her position in January with an emotional live send-off. \n\nShe was surprised by Oprah Winfrey with a montage video compiled of clips from over 1,300 interviews, including with the late Pope Francis and ex-Vice President Kamala Harris. \n\nWinfrey gushed over O'Donnell's career accomplishments as she applauded the anchor for how she \"made such a difference and informed our nation.\" \n\nO'Donnell concluded her final Evening News broadcast by saying it was the \"honor of a lifetime\" to work on the program and thanked viewers and the production crew.'Living in a Fantasy'While O'Donnell was no longer behind the Evening News desk, she remained at the network working as a senior correspondent contributing to programs like 60 Minutes. \n\nNow that CBS is undergoing a major shake-up after parent company Paramount was acquired by Skydance Media, sources claimed O'Donnell wants her old gig back.\n\nAccording to Hollywood insider Rob Shuter, who writes on Substack, a source said: \"She's living in a fantasy.\n\n\"The new Skydance bosses are cleaning house, and Norah is yesterday's news.\"O'Donnell's Toxic Attitude?The Insider further claimed O'Donnell's transition earlier this year wasn't solely based on declining ratings – her alleged toxic attitude played a factor in the decision. \n\nA veteran producer added: \"She was cold, tough to work with, and burned too many bridges.\" \n\nO'Donnell has reportedly tried to position herself as a \"savior\" the network desperately needs for the new Skydance team.\n\n\"She's been lobbying hard,\" a source claimed. \"But they're looking forward, not backward. And definitely not at her.\"As RadarOnline.com reported, CBS has been in a free fall as of late. \n\nThe network faced intense backlash after it made the controversial decision to axe beloved late-night host Stephen Colbert days after he criticized Paramount's $16million settlement with Donald Trump, which the host called a \"big fat bribe.\" \n\nInsiders warned Paramount's pending merger with Skydance could result in openly anti-Trump talent like Colbert and Jon Stewart being fired.\n\nTrump has been a vocal critic of legacy networks and has specifically called out CBS for having \"no talent.\"After Trump ripped the late night host, he set his sights on Gayle King after she ruffled conservatives' feathers by interviewing queer icon Bob the Drag Queen. \n\nHe wrote in an unhinged post: \"Gayle King's career is over. She should have stayed with her belief in TRUMP. She never had the courage to do so. No talent, no ratings, no strength!!!\"\n\nAn insider warned the network needed to rethink its programming if its wants to win back viewers. \n\nThey explained: \"The audience doesn’t want woke. It doesn’t like progressive and provocative bookings. The morning show audience wants optimism and cheer and joy, and what they were producing is at odds with audience expectations.\"","summary":"Norah O'Donnell stepped away from the 'CBS Evening News' anchor desk in January after five-years.","url":"https://radaronline.com/p/norah-odonnell-plotting-cbs-comeback-lobby-hard-evening-news/","image":"https://media.radaronline.com/brand-img/lwBezJUnk/0x0/norah-odonnell-lobbying-hard-for-cbs-comeback-1754690668222.png","video":null,"publish_date":"2025-08-08 23:30:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.281},{"id":349474816,"title":"Congressional remap unlikely in the cards for Illinois","text":"I’m assuming you’ve already seen coverage of the Democratic Texas state legislators who fled to Illinois to prevent a Republican-backed redrawing of congressional district lines in their home state. Their absence means their Legislature doesn’t have enough members to legally conduct business.\n\nLike every Democratic governor, Gov. JB Pritzker needs his party to win back the U.S. House next year to prevent further fiscal damage to his state (among many, many other things). Hence his intense attention to Texas attempting to pick up five seats with an intercensal remap.\n\nThis is also a bit of a public relations payback by Pritzker after Texas Gov. Greg Abbott sent tens of thousands of asylum-seekers to Chicago awhile back.\n\nNot to mention that the media-friendly news conferences and public appearances raise Pritzker’s national profile ahead of a possible presidential bid.\n\nCalifornia Gov. Gavin Newsom has his own national ambitions and has floated an idea for a November referendum on redrawing his state’s districts. So, hosting self-exiled Texas Democrats allows Pritzker to say he’s doing something.\n\nTexas state legislators are paid $600 a month. They all have “real” jobs. The Texas Dems also walked out in 2021 over a voting rights bill, but the stalemate ended five weeks later when three Democrats returned to the state and a quorum was restored.\n\nThis isn’t Texas’ first intercensal redistricting move. In 2001, a federal judge drew Texas’ congressional boundaries, but the Republican-controlled state Legislature redrew the map in 2003 (after another failed Democratic walkout), resulting in big GOP wins in 2004. Illinois House Speaker Michael Madigan refused to redraw Illinois’ maps in retaliation.\n\nIllinois Democrats hold 82% of our 17 congressional seats. We live in a heavily gerrymandered state.\n\nTexas Republicans hold 66% of that state’s 35 congressional seats. The remap could conceivably allow Texas Republicans to pick up five more seats, giving them 79% of the state’s districts — which would still be slightly below Illinois’ congressional gerrymander.\n\nBut it’s not quite that simple because Texas is being accused of conspiring to undermine the Voting Rights Act by breaking up existing minority-majority districts. The Illinois congressional map had no such issue.\n\nPritzker has said that redrawing Illinois’ congressional districts to elect another Democrat is a possibility. But Illinois’ petition circulation process began last week.\n\nUnless it’s done really soon, redrawing congressional districts here might require either a separate primary for all U.S. representatives or moving the whole primary process back for everyone.\n\nThe best way to accomplish this goal is by diluting current Democratic districts with more Republicans to make room for another Democratic district. And that may make some Democratic incumbents nervous about elections beyond 2026.\n\n“Nobody’s done any work on a map for Illinois,” Pritzker confessed to reporters late last week when asked.\n\nPritzker’s statement was confirmed by spokespersons for both House Speaker Emanuel “Chris” Welch and Senate President Don Harmon.\n\nI just don’t see this remap happening here.\n\nMeanwhile, Sen. Jil Tracy, R-Quincy, is listed as the sole Illinois attorney in a state lawsuit filed in her native Adams County on behalf of several Republican Texas legislators demanding that Illinois courts assist Texas in forcing the skedaddled Democrats to return to face the music.\n\nIronically, Tracy’s Senate Republican caucus briefly tried to shut down their chamber a few years ago when the Democrats wanted to redraw some judicial circuit boundaries.\n\nTexas has issued civil warrants for the apprehension of the absconded lawmakers, so their lawsuit is based on pretty thin gruel, particularly since Illinois does not allow the cooperation of its police with federal civil warrants issued by immigration authorities. Outside civil warrants just don’t mean much here.\n\nAccording to the lawsuit, Illinois has a “mandatory constitutional duty to respect and give full faith and credit to the public acts of the Texas House of Representatives, including the Quorum Order and the Quorum Warrants,” under the “full faith and credit” clause of the U.S. Constitution.\n\nThe plaintiffs want the Texas Democrats held in contempt and a post-haste hearing where the Southern state can “present evidence of Respondents’ willful attempts to circumvent Texas law.”\n\nPresident Donald Trump won Adams County with 73% of the vote last year, so prepare yourself for a possible initial win by the Texans. I seriously doubt that the state’s overwhelmingly Democratic Supreme Court would ever go along with any sort of punishment or detention, however.\n\nIn other words, this whole thing is mostly symbolic, including (so far, let’s hope) the unfortunately predictable fake bomb threats at the suburban hotel where the Texas Democrats are staying.\n\nRich Miller also publishes Capitol Fax, a daily political newsletter, and CapitolFax.com.","url":"https://chicago.suntimes.com/columnists/2025/08/08/pritzkers-dont-mess-with-texas-op","image":"https://cst.brightspotcdn.com/dims4/default/a968443/2147483647/strip/false/crop/5629x3758+0+0/resize/1486x992!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F76%2Fcc%2Fcb4dec6a4d92a1c619212c23a1d2%2Ftexas","video":null,"publish_date":"2025-08-08 23:30:00","author":"Rich Miller","authors":["Rich Miller"],"language":"en","source_country":"us","sentiment":-0.274},{"id":349470032,"title":"Dollar heads for weekly loss on dovish Fed expectations","text":"NEW YORK >> The dollar firmed today but was heading for a weekly fall as weakening economic data leads traders to price in the probability of more interest rate cuts this year, and as investors evaluate President Donald Trump’s nominations to the Federal Reserve.\n\nThe dollar has dropped since last week’s jobs report for July showed employers added fewer jobs than expected during the month, while job gains from previous months were also revised down sharply.\n\nOther data, including a weakening housing market and services sector data, are also pointing to a slowing economy.\n\nTrump on Thursday, meanwhile, said he will nominate Council of Economic Advisers Chairman Stephen Miran to serve out the final few months of a newly vacant Fed seat, while the White House seeks a permanent addition to the central bank’s governing board and continues its search for a new Fed chair.\n\nBloomberg News reported on Thursday that Fed Governor Christopher Waller, who voted for a rate cut in the Fed’s last meeting, is emerging as a top candidate to be the central bank’s next chair when Jerome Powell’s term ends in May.\n\n“It loads the FOMC with people who presumably are a little bit more favorable to lower interest rates,” said Shaun Osborne, chief FX strategist at Scotiabank in Toronto.\n\n“The impression is that the Fed is veering towards cutting interest rates probably a little bit quicker than markets had expected, certainly prior to last week. And maybe even speculation that the Fed could cut rates a bit more aggressively than we’d been expecting.”\n\nLARGER IMPACT\n\nTraders now see a 89% chance of a rate cut at the Fed’s September meeting, and are pricing in 58 basis points in cuts by year-end.\n\nTrump also last Friday fired a top Labor Department official on the heels of the weak jobs report, raising concerns that the Trump administration may have a larger influence over economic releases.\n\nThe dollar index nonetheless gained today, which Osborne said was likely consolidation, with no fresh news to drive direction. It was last up 0.21% on the day at 98.19 but on track for a weekly loss of around 0.5%.\n\nThe euro fell 0.09% to $1.1655.\n\nFX and rates analysts at Bank of America noted that short U.S. dollar remains the highest conviction trade for the rest of this year among fund managers it surveyed.\n\n“This could reflect survey respondents’ expectation of fading U.S. exceptionalism and simmering concerns on Fed independence and U.S. fiscal policy,” the analysts said. They added, however, that “rising concerns around global growth could test the short USD thesis.”\n\nThe next major U.S. economic release will be consumer price data for July due on Tuesday, which will be watched to see whether tariffs are reigniting inflation pressures.\n\nThe Fed now faces risks to both its inflation and jobs goals, with policymakers needing to balance which seems the more serious threat in deciding whether it is appropriate to reduce interest rates, St. Louis Fed President Alberto Musalem said today.\n\nTraders are also watching developments in a potential peace deal between Russia and Ukraine.\n\nThe U.S. and Russia are aiming to reach a deal to halt the war in Ukraine that would lock in Moscow’s occupation of territory seized during its military invasion, Bloomberg News reported today.\n\nAgainst the Japanese yen, the dollar strengthened 0.41% to 147.71.\n\nBank of Japan policymakers debated the likelihood of resuming interest rate increases, with one signalling the chance of a hike this year, a summary of opinions at the July meeting showed, heightening the chance of a near-term rise in borrowing costs.\n\nSterling rose 0.06% to $1.3451 and earlier reached a two-week high of $1.3458. The Bank of England cut interest rates on Thursday, but only after a narrow 5-4 vote, showing a lack of conviction in its easing bias.\n\nIn cryptocurrencies, bitcoin fell 0.70% to $116,429.\n\nTrump signed an executive order on Thursday that aimed to allow more private equity, real estate, cryptocurrency and other alternative assets in 401(k) retirement accounts – opening the way for alternative asset managers to tap a greater share of trillions of dollars in Americans’ retirement savings.","summary":"NEW YORK >> The dollar firmed today but was heading for a weekly fall as weakening economic data leads traders to price in the probability of more interest rate cuts this year, and as investors evaluate President Donald Trump&#8217;s nominations to the Federal Reserve.","url":"https://www.staradvertiser.com/2025/08/08/breaking-news/dollar-heads-for-weekly-loss-on-dovish-fed-expectations/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/08/web1_20250530_brk_dol01.jpg","video":null,"publish_date":"2025-08-08 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.14},{"id":349461154,"title":"The unlikely bond between JD Vance and David Lammy","text":"Vance acknowledged the two men come from \"different political spectrums\" but said Lammy had been \"kind enough to make time on a visit to [Washington] DC, we got to know each other a little bit then\".\n\nSince that first meeting, when Lammy was in opposition and Vance had just been elected to the US Senate, they have met regularly including at the new Pope's inauguration in May. \n\nLast week, Lammy told the Guardian he, Vance and Deputy Prime Minister Angela Rayner bonded over drinks in the Villa Taverna, the US ambassador's residence in Rome. \n\n\"I had this great sense that JD completely relates to me and he completely relates to Angela. So it was a wonderful hour and a half,\" he said. \"I was probably the shyest of the three.\"\n\nHe said that, like Vance, Rayner and himself were \"not just working-class politicians, but people with dysfunctional childhoods\".\n\nLammy's parents split up during his teens. His father went to the US and Lammy never saw him again. \n\nVance told the story of his own upbringing - including an absent father and a mother with a drug addiction - in his bestselling memoir Hillbilly Elegy. \n\nDespite their trickier starts in life, both ended up at prestigious US colleges. Lammy studied at Harvard, where he met and befriended Barack Obama. Vance went to Harvard's rival Yale - \"not quite as good,\" Lammy joked at Chevening. \n\nThe two men have also bonded over their Christian faith. Vance converted to Catholicism as an adult and took mass with Lammy when he visited Washington DC earlier this year. \n\nThe pair have something else in common, although neither want to to draw attention to it: their previous less-than-flattering comments about Donald Trump. \n\nJD Vance's past verdict - \"reprehensible\", \"an idiot\", \"I never liked him\".\n\nAnd Lammy's? \"A tyrant\" and \"a woman-hating, neo Nazi sympathising sociopath\". \n\nBe it political expediency or a genuine change of heart, both have since revised their opinions.","url":"https://www.bbc.com/news/articles/czr68vde7nvo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/3b82/live/63f69b30-745a-11f0-8689-0f7647a3ab5c.jpg","video":null,"publish_date":"2025-08-08 23:27:13","author":"Kate Whannel","authors":["Kate Whannel"],"language":"en","source_country":"gb","sentiment":-0.057},{"id":349461912,"title":"Trump says he expects to meet with Putin on August 15 in Alaska","text":"WASHINGTON, August 9. /TASS/. US President Donald Trump said that he expects to meet with his Russian counterpart Vladimir Putin in Alaska on August 15.\n\n\"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska,\" the US leader wrote on his Truth Social page, adding that details will follow later.\n\nOn August 7, Kremlin aide Yury Ushakov announced that Moscow and Washington had agreed to hold a meeting between their respective leaders in the coming days.","summary":"US leader added that details will follow later","url":"https://tass.com/world/2000061","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20250809/1451069.jpg","video":null,"publish_date":"2025-08-08 23:25:10","author":"Tass","authors":["Tass"],"language":"en","source_country":"RU","sentiment":0.455},{"id":349461070,"title":"Armenia, Azerbaijan Sign Historic Peace Deal At White House In Trump's Presence","text":"The long-standing conflict between Azerbaijan and Armenia reached a historic conclusion on Friday as the leaders of both nations signed a landmark peace agreement at the White House. The event was hosted by US President Donald Trump, who joined the leaders as they shook hands following the signing of the deal, aimed at ending decades of violence and hostility, according to the Associated Press.\nAzerbaijani President Ilham Aliyev and Armenian Prime Minister Nikol Pashinyan signed a series of agreements formalising peace between their nations and establishing new cooperative ties with the United States. As part of the deal, the two countries have pledged to reopen key transportation and trade routes, including those that had been closed since the early 1990s due to territorial disputes and war.\n“We are today establishing peace in the South Caucasus,” President Aliyev declared during the ceremony. “Today we writing a great new history.” The agreement is expected to transform the regional dynamic, fostering economic growth and stability across the South Caucasus.\nPrime Minister Pashinyan called the peace agreement a turning point. “Opening a chapter of peace,” he said, adding, “(We are) laying foundations to a better story that the one we had in the past.”\nPresident Trump, celebrating the diplomatic achievement, positioned himself as a global peacemaker. “Now they’re friends, and they’re going to be friends for a long time,” Trump said after the agreement was signed. “You two are going to have a great relationship and if you don’t, call me and I’ll straighten it out.”\nAs part of the deal, the nations will establish a major transit corridor, to be named the Trump Route for International Peace and Prosperity, according to a statement from the White House. An American infrastructure company will assist in the development of the corridor, which aims to connect Azerbaijan to Nakhichevan, further enhancing regional trade and connectivity.\nThe peace agreement comes just days before Trump’s upcoming August 15 summit with Russian President Vladimir Putin in Alaska, where the leaders will discuss a possible ceasefire in the Russia-Ukraine conflict.\nPresident Trump, reportedly being nominated for the Nobel Peace Prize by multiple leaders, including President Aliyev, has increasingly focused on brokering global peace as part of his second-term foreign policy agenda.","summary":"As part of the deal, the nations will establish a major transit corridor, to be named the Trump Route for International Peace and Prosperity.","url":"https://www.news18.com/world/armenia-azerbaijan-sign-historic-peace-deal-at-white-house-in-trumps-presence-ws-l-9494224.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/Untitled-design-11-2025-08-0e09ca0db187442e92a45ff5fb2e48a0.png","video":null,"publish_date":"2025-08-08 23:24:27","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.204},{"id":349464712,"title":"Australia joins other nations in ‘strongly’ rejecting Israeli decision to take-over Gaza","text":"Australia has joined Germany, Italy, New Zealand and the United Kingdom to “strongly reject” the Israeli decision to expand its military operation and take over Gaza.\n\nIn a joint statement released on Saturday, the foreign ministers of each of the contries said the action would “aggravate the catastrophic humanitarian situation, endanger the lives of the hostages, and further risk the mass displacement of civilians.\n\n“The plans that the Government of Israel has announced risk violating international humanitarian law.\n\n“Any attempts at annexation or of settlement extension violate international law.”\n\nIt comes as the United Nations Security Council flagged that it will hold an emergency meeting on Saturday regarding Israel’s plans to escalate the conflict.\n\nGermany, a key European ally, has also announced it will halt exports of military equipment to Israel that could be used in Gaza.\n\nThe joint statement urges Israel and the Palestinians, as well as the international community to “finally bring this conflict to an end now through an immediate and permanent ceasefire that enables the provision of a massive, immediate and unimpeded humanitarian assistance, as the worst-case scenario of a famine is unfolding in Gaza.\n\n“Hamas must release all hostages without further delay or precondition and must ensure they are humanely treated and not subject to cruelty and humiliation.”\n\nIt said the countries were united in their commitment to a two-state solution as the only way to guarantee peace.\n\n“A political resolution based on a negotiated two-state solution requires the total demilitarisation of Hamas and its complete exclusion from any form of governance in the Gaza Strip, where the Palestinian Authority must have a central role.”\n\nEarlier, US President Donald Trump’s ambassador to Israel, Mike Huckabee, told Reuters that some countries appeared to be putting pressure on Israel rather than on the militant group Hamas, whose deadly attack on Israel in 2023 ignited the war.\n\nIn Israel, families of hostages held by militants in Gaza, and opposition leaders blasted Prime Minister Benjamin Netanyahu for a decision that they said would put hostages’ lives at risk.","summary":"Penny Wong has issued a joint statement with a number of other foreign ministers to ‘strongly reject’ the Israeli Security Council’s decision to expand its military operation and take over Gaza.","url":"https://thewest.com.au/news/middle-east/australia-joins-other-nations-in-strongly-rejecting-israeli-decision-to-take-over-gaza--c-19627444","image":"https://images.thewest.com.au/publication/C-19627444/c9f424b1e59b0cb9ec120239c843423ce628064c-16x9-x0y157w3425h1927.jpg?imwidth=1200","video":null,"publish_date":"2025-08-08 23:21:31","author":"Peta Rasdien,William Pearce","authors":["Peta Rasdien","William Pearce"],"language":"en","source_country":"au","sentiment":0.007},{"id":349475316,"title":"Trump Confirms Upcoming Meeting with Putin in Alaska","text":"President Donald Trump confirmed that he and Russian President Vladimir Putin would be meeting in Alaska next Friday.\n\n“The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska,” Trump wrote in a post on Truth Social. “Further details to follow. Thank you for your attention to this matter!”\n\nTrump’s post comes as “multiple sources familiar with the matter” told CBS News that Trump and Putin were planning to meet in Alaska next week.\n\nA “senior White House official” told the outlet that the planning for the meeting “is still fluid,” adding that Ukrainian President Volodymyr Zelensky could possibly “end up being involved in some way.”\n\nBreitbart News previously reported that Moscow had revealed it expected Trump and Putin would be meeting in-person to discuss the ongoing Russia-Ukraine war. A top Kremlin aide issued a statement that a venue had been agreed on:\n\nA venue for Trump-Putin talks has been agreed, top Kremlin Aide Yury Ushakov said in a statement on Thursday morning after what President Trump hailed as “highly productive” talks in Moscow on Wednesday.\n\nU.S. Special Envoy to the Middle East Steve Witkoff previously traveled to Russia, where he met with Putin. The talks with Putin were reported to be “something of a last-bid attempt to find peace in Ukraine.”\n\nToday’s talks are something of a last-bid attempt to find peace in Ukraine. American and Russian negotiators have been meeting all year and despite a lot of happy talk from Moscow, any meaningful progress has failed to materialise so far. This resistance to change from Russia had had a noticeable effect on U.S. President Trump, who has transitioned from initial optimism about the power of talk to being “pissed off” and threatening consequences.\n\nIn the aftermath of Witkoff’s meeting with Putin, White House press secretary Karoline Leavitt shared a statement with Breitbart News, expressing that Trump was “open to meeting” with both Putin and Zelensky.\n\n“As President Trump said earlier today on TRUTH Social, great progress was made during Special Envoy Witkoff’s meeting with President Putin,” Leavitt said in her statement. “The Russians expressed their desire to meet with President Trump, and the President is open to meeting with both President Putin and President Zelensky.”","summary":"President Donald Trump confirmed that he and Russian President Vladimir Putin would be meeting in Alaska next Friday.\n\n\nThe post Trump Confirms Upcoming Meeting with Putin in Alaska appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/08/08/trump-confirms-upcoming-meeting-with-putin-in-alaska/","image":"https://media.breitbart.com/media/2025/08/Trump-Putin-640x335.jpeg","video":null,"publish_date":"2025-08-08 23:19:19","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"US","sentiment":0.034},{"id":349474798,"title":"Starmer faces call to ‘sit this one out’ on Gaza amid US-UK ‘disagreement’","text":"Sir Keir Starmer has faced a call to “sit this one out” on Gaza, after the Prime Minister warned the Israeli government against pursuing its plan to take control of Gaza City.\n\nWashington’s ambassador to Israel Mike Huckabee also suggested that Sir Keir would have lost Britain the Second World War, had he been in No 10 at the time.\n\nEarlier on Friday, US vice president JD Vance described a “disagreement” about how the US and UK could achieve their “common objectives” in the Middle East, and said Donald Trump’s administration had “no plans to recognise a Palestinian state”.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office has unveiled new principles for military action which include “the demilitarisation of the Gaza Strip”, “Israeli security control in the Gaza Strip” and “the establishment of an alternative civil administration that is neither Hamas nor the Palestinian Authority”.\n\nThe Israel Defence Forces “will prepare for taking control of Gaza City while distributing humanitarian assistance to the civilian population outside the combat zones”.\n\nAfter Sir Keir described the decision as being “wrong” and called for a “surge in humanitarian aid”, Mr Huckabee wrote: “So Israel is expected to surrender to Hamas and feed them even though Israeli hostages are being starved?\n\n“Did UK surrender to Nazis and drop food to them? Ever heard of Dresden, PM Starmer?\n\n“That wasn’t food you dropped. If you had been PM then UK would be speaking German.”\n\nIn a follow-up post, the ambassador suggested Sir Keir “ought to sit this one out”.\n\nIn a statement, Sir Keir had said: “The Israeli government’s decision to further escalate its offensive in Gaza is wrong, and we urge it to reconsider immediately.\n\n“This action will do nothing to bring an end to this conflict or to help secure the release of the hostages. It will only bring more bloodshed.\n\n“Every day the humanitarian crisis in Gaza worsens and hostages taken by Hamas are being held in appalling and inhuman conditions.\n\n“What we need is a ceasefire, a surge in humanitarian aid, the release of all hostages by Hamas and a negotiated solution.\n\n“Hamas can play no part in the future of Gaza and must leave as well as disarm.\n\n“Together with our allies, we are working on a long-term plan to secure peace in the region as part of a two-state solution, and ultimately achieve a brighter future for Palestinians and Israelis.\n\n“But without both sides engaging in good faith negotiations, that prospect is vanishing before our eyes.”\n\nSir Keir has pledged to recognise a Palestinian state in September unless the Israeli government meets a series of conditions towards ending the war in Gaza.\n\nThese include taking “substantive steps to end the appalling situation in Gaza”, “agreeing to a ceasefire, and making clear there will be no annexations in the West Bank”.\n\nAt Foreign Secretary David Lammy’s grace-and-favour retreat in Kent, Mr Vance said the UK “is going to make its decision” on Palestinian recognition.\n\n“We have no plans to recognise a Palestinian state,” he said.\n\n“I don’t know what it would mean to really recognise a Palestinian state given the lack of functional government there.”\n\nMr Vance added: “There’s a lot of common objectives here. There is some, I think, disagreement about how exactly to accomplish those common objectives, but look, it’s a tough situation.”","url":"https://uk.news.yahoo.com/starmer-faces-call-sit-one-231538744.html","image":"https://s.yimg.com/ny/api/res/1.2/Fth4H6whdHG.975YXtN9YA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQ7Y2Y9d2VicA--/https://media.zenfs.com/en/pa_viral_news_uk_120/d84bd0e351c45a3039c0c3ffe6a4d7be","video":null,"publish_date":"2025-08-08 23:15:38","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.157},{"id":349468108,"title":"Starmer faces call to ‘sit this one out’ on Gaza amid US-UK ‘disagreement’","text":"Sir Keir Starmer has faced a call to “sit this one out” on Gaza, after the Prime Minister warned the Israeli government against pursuing its plan to take control of Gaza City.\n\nWashington’s ambassador to Israel Mike Huckabee also suggested that Sir Keir would have lost Britain the Second World War, had he been in No 10 at the time.\n\nEarlier on Friday, US vice president JD Vance described a “disagreement” about how the US and UK could achieve their “common objectives” in the Middle East, and said Donald Trump’s administration had “no plans to recognise a Palestinian state”.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office has unveiled new principles for military action which include “the demilitarisation of the Gaza Strip”, “Israeli security control in the Gaza Strip” and “the establishment of an alternative civil administration that is neither Hamas nor the Palestinian Authority”.\n\nThe Israel Defence Forces “will prepare for taking control of Gaza City while distributing humanitarian assistance to the civilian population outside the combat zones”.\n\nAfter Sir Keir described the decision as being “wrong” and called for a “surge in humanitarian aid”, Mr Huckabee wrote: “So Israel is expected to surrender to Hamas and feed them even though Israeli hostages are being starved?\n\n“Did UK surrender to Nazis and drop food to them? Ever heard of Dresden, PM Starmer?\n\n“That wasn’t food you dropped. If you had been PM then UK would be speaking German.”\n\nIn a follow-up post, the ambassador suggested Sir Keir “ought to sit this one out”.\n\nIn a statement, Sir Keir had said: “The Israeli government’s decision to further escalate its offensive in Gaza is wrong, and we urge it to reconsider immediately.\n\n“This action will do nothing to bring an end to this conflict or to help secure the release of the hostages. It will only bring more bloodshed.\n\n“Every day the humanitarian crisis in Gaza worsens and hostages taken by Hamas are being held in appalling and inhuman conditions.\n\n“What we need is a ceasefire, a surge in humanitarian aid, the release of all hostages by Hamas and a negotiated solution.\n\n“Hamas can play no part in the future of Gaza and must leave as well as disarm.\n\n“Together with our allies, we are working on a long-term plan to secure peace in the region as part of a two-state solution, and ultimately achieve a brighter future for Palestinians and Israelis.\n\n“But without both sides engaging in good faith negotiations, that prospect is vanishing before our eyes.”\n\nSir Keir has pledged to recognise a Palestinian state in September unless the Israeli government meets a series of conditions towards ending the war in Gaza.\n\nThese include taking “substantive steps to end the appalling situation in Gaza”, “agreeing to a ceasefire, and making clear there will be no annexations in the West Bank”.\n\nAt Foreign Secretary David Lammy’s grace-and-favour retreat in Kent, Mr Vance said the UK “is going to make its decision” on Palestinian recognition.\n\n“We have no plans to recognise a Palestinian state,” he said.\n\n“I don’t know what it would mean to really recognise a Palestinian state given the lack of functional government there.”\n\nMr Vance added: “There’s a lot of common objectives here. There is some, I think, disagreement about how exactly to accomplish those common objectives, but look, it’s a tough situation.”","summary":"Washington’s ambassador to Israel also suggested that Sir Keir would have lost Britain the Second World War.","url":"https://www.standard.co.uk/news/politics/jd-vance-gaza-hamas-israel-washington-b1242195.html","image":"https://static.standard.co.uk/2025/08/09/00/77303ada7fc9be2760beef48d009a414Y29udGVudHNlYXJjaGFwaSwxNzU0NzgwNTQ4-2.81125648.jpg?width=1200","video":null,"publish_date":"2025-08-08 23:15:38","author":"Will Durrant","authors":["Will Durrant"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.157},{"id":349474236,"title":"Letters to the Editor: Croke Park 2026 calendar should be nailed down now","text":"Many supporters would be in favour of a return to playing the senior and minor All-Ireland finals on the same day in Croke Park. Presently, the playing of the minor championships at any old time, sometimes in out-of-the-way venues, is wrong. It gives the impression that Croke Park just wants to get these minor games played and out of the way as quickly as possible.\n\nI am not the only one who believes that county GAA managers have far too much power, which requires curtailment, as they are the main reason why there are no club games played during summer. We, in the GAA, badly need another system of playing our games, and it is not rocket science.\n\nStart the season in March and play the inter-county games on the first weekend of every month, with the club games on the other three weekends. Play the All-Irelands and county finals during late September. The number of games that a player would play would lessen as the season progressed depending on the success or otherwise of his club and county.\n\nGet rid of the stupid razzmatazz in Croke Park. It is just awful and serves no purpose, particularly during the interval of games when supporters just want to talk and listen to their friends. Again, I am not aware of anybody who is in favour of it.\n\nThe following is my last suggestion. \n\nPlay the national hurling and football leagues during October and November, with the semi-finals and finals in February. Give the above plan a trial run for a year and await the outcome.\n\n Liam Burke, Dunmore, Co Kilkenny\n\nWhy the two-state solution will never work\n\nWhat would it take to bring a just and lasting peace to the Palestinians? According to the Irish Examiner editorial on Tuesday, August 5, “the two-state solution is the only option”. \n\nIf that is true, then there is actually no solution.\n\nThe ‘two-state solution’ has become a mantra enunciated by political leaders and many other people who do not seem to have given any thought to the historical context which has led us to the current genocide in Gaza and the ethnic cleansing in the West Bank.\n\nIn 2024, Jewish historian Ilan Pappe wrote a book called A Very Short History of the Israel-Palestine Conflict, in which he lays bare the fallacies underlying the two-state solution mantra. In his final chapter, he draws seven or eight conclusions. All are relevant to a full historical understanding but, in a short letter, only some can be referenced.\n\nIn his third conclusion, he notes that from the moment the Zionist movement focused on Palestine as the site of a new Jewish nation, it became a settler-colonial movement. The early Zionists made no secret of their wish to remove the native population — to force them out if necessary. This fundamental objective has not changed in over 100 years, except that is has now reached genocidal proportions as happened historically in the US, Canada, Australia, New Zealand, etc.\n\nHis sixth conclusion is that the two-state solution — the main concept underlying the so-called peace process — has dismally failed. It is not practicable any more because of the presence of 750,000 illegal Jewish settlers in the West Bank, which has been split into dozens of military controlled enclaves since 1967. Equally critically, it can’t work because its logical and moral premises are flawed. It applies to only a small part of Palestine (22% max) and only to part of the Palestinian people. What about the Palestinian refugees and the Palestinian minority inside Israel, who were under harsh military rule from 1948 to 1956? Pappe argues that all of these dimensions can only be addressed in a single democratic state, with everyone enjoying equal rights.\n\nHis final conclusion is that we need to change how we talk about Israel and Palestine. Until we acknowledge that we are talking about decolonisation, then it’s all just “hot air”.\n\n Con Hayes, Tower, Co Cork\n\nExcellent insight into Trump’s tariff turmoil\n\nI want to compliment the Irish Examiner’s Cianan Brennan for an excellent piece of journalism on US president Donald Trump’s tariff regime (‘Trump’s global tariff agenda puts Ireland’s pharmaceutical industry at serious risk’ — Saturday, August 2).\n\nBrennan delineates in his piece how nations are beginning to fall into line following these tariff announcements.\n\nSome commentators believe that Europe has capitulated to Trump’s tariff demands but other observers are putting the spin that 15% tariff on the EU could have been a lot worse.\n\nAfter reading Brennan’s piece, one is left asking the big question around pharma, particularly for Ireland.\n\nWe know that the section 232 inquiry is meant to take circa two weeks. At the moment, the 0% still sticks for pharma, which, as we know, is obviously a huge industry in Ireland. One must remember that there’s about 30,000 jobs linked to US pharma firms. So there’s definitely a big question mark over what this will mean.\n\nAside from Ireland, I was thinking of the leaders of more than 60 countries plunged into a fresh race to secure trade deals with the US. It seems that these leaders are being treated like puppets by the Trump administration.\n\nThere was a lot of commentary about the way the president of the European Commission, Ursula von der Leyen, kind of rolled over and agreed to everything when she met Trump. I would actually go along with that.\n\nThen we have some commentators saying that it could have been far worse.\n\nIf one were to look at some of the tariffs that were meted out, one would have to say that they are absolutely outrageous, particularly the tariffs Trump has put on some of the poorest countries in the world. One would like to ask: What does he think he’s going to do to their economies?\n\nSyria is being tariffed at 41%, with Myanmar at 40%. I believe that this is an outrageous thing to do. South Africa is being tariffed at 39%, Switzerland at 39%, and Canada at 35%.\n\nI think that this is all very serious for the world.\n\nThe question many economists are now asking is: Does our place in the world suggest that we pay reverence and deference to Trump and his tariffs? Alternatively, one could play the long game by saying that Trump will be gone in a couple of years, so countries might decide to wait it out.\n\nOne senses that there’s a lot of uncertainty coming out of Leinster House and Europe.\n\nBrennan’s article leaves the reader in no doubt that Ireland will need to up its game in meeting the demands of Trump’s tariffs.\n\n John O’Brien, Clonmel, Co Tipperary","summary":"A reader amplifies John Fogarty's column in the 'Irish Examiner', and argues that the entire GAA family should have some certainty now about the dates for next year's marquee fixtures","url":"https://www.irishexaminer.com/opinion/yourview/arid-41684342.html","image":"https://www.irishexaminer.com/cms_media/module_img/9472/4736363_3_seoimage1x1_SHOWBIZ_20U2_20Ireland_20220318.jpg","video":null,"publish_date":"2025-08-08 23:11:00","author":"Irishexaminer.com,Sat, 09 Aug, 2025 - 00:11","authors":["Irishexaminer.com","Sat, 09 Aug, 2025 - 00:11"],"language":"en","source_country":"ie","sentiment":-0.451},{"id":349470034,"title":"Trump, Putin to meet in Alaska to discuss Ukraine peace deal","text":"WASHINGTON >> President Donald Trump will meet on Aug. 15 in Alaska with Russian President Vladimir Putin to negotiate an end of the war in Ukraine, Trump said today.\n\nTrump made the announcement on social media after he said that the parties, including Ukraine President Volodymyr Zelenskyy, were close to a ceasefire deal that could resolve the three-year conflict.\n\nAddressing reporters at the White House earlier today, Trump suggested an agreement would involve some exchange of land.\n\n“There’ll be some swapping of territories to the betterment of both,” Trump said.\n\nIn his evening address to the nation, Zelenskyy said it was possible to achieve a ceasefire as long as adequate pressure was applied to Russia. He said he had held more than a dozen conversations with leaders of different countries and his team was in constant contact with the United States.\n\nPutin claims four Ukrainian regions — Luhansk, Donetsk, Zaporizhzhia and Kherson — as well as the Black Sea peninsula of Crimea, which he annexed in 2014. His forces do not fully control all the territory in the four regions.\n\nUkraine has previously signaled a willingness to be flexible in the search for an end to a war that has ravaged its towns and cities and killed large numbers of its soldiers and citizens.\n\nBut accepting the loss of around a fifth of Ukraine’s territory would be painful and politically challenging for Zelenskyy and his government.\n\nThe U.S. and Russia were aiming to reach a deal to halt the war in Ukraine that would lock in Moscow’s occupation of territory seized during its military invasion, Bloomberg News reported earlier today.\n\nTyson Barker, the U.S. State Department’s former deputy special representative for Ukraine’s economic recovery, said the peace proposal, as outlined in the Bloomberg report, would be immediately rejected by the Ukrainians.\n\n“The best the Ukrainians can do is remain firm in their objections and their conditions for a negotiated settlement, while demonstrating their gratitude for American support,” said Barker, a senior fellow with the Atlantic Council.\n\nUnder the putative deal, according to Bloomberg, Russia would halt its offensive in the Kherson and Zaporizhzhia regions along current battle lines.\n\nThe last time Alaska hosted a high-stakes diplomatic gathering was in March 2021, when senior officials from the administration of Democratic former president Joe Biden met with top Chinese officials in Anchorage. The meeting involving Biden’s top diplomat Antony Blinken and his then Chinese counterpart Yang Jiechi quickly turned into a stunning public clash in front of the cameras, with both sides leveling sharp rebukes of the others’ policies that reflected the high tension in bilateral ties.\n\nSince his return to the White House in January, Trump has moved to mend relations with Russia and sought to end the war. In his public comments he has veered between admiration and sharp criticism of Putin.\n\nIn a sign of his growing frustration with Putin’s refusal to halt Russia’s military offensive, Trump had threatened to impose new sanctions and tariffs from today against Moscow and countries that buy its exports unless the Russian leader agreed to end the 3-1/2 year conflict, the deadliest in Europe since World War II.\n\nIt was unclear by this evening whether those sanctions would take effect or will be delayed or cancelled.\n\nThe administration took a step toward punishing Moscow’s oil customers on Wednesday, imposing an additional 25% tariff on goods from India over its imports of Russian oil, marking the first financial penalty aimed at Russia in Trump’s second term.\n\nTrump’s special envoy Steve Witkoff held three hours of talks with Putin in Moscow on Wednesday that both sides described as constructive.\n\nPrime Minister Donald Tusk of Poland, a close ally of Ukraine, said earlier today that a pause in the conflict could be close. He was speaking after talks with Zelenskyy.\n\n“There are certain signals, and we also have an intuition, that perhaps a freeze in the conflict — I don’t want to say the end, but a freeze in the conflict — is closer than it is further away,” Tusk told a news conference. “There are hopes for this.”\n\nTusk also said Zelenskyy was “very cautious but optimistic” and that Ukraine was keen that Poland and other European countries play a role in planning for a ceasefire and an eventual peace settlement.","summary":"WASHINGTON >> President Donald Trump will meet on Aug. 15 in Alaska with Russian President Vladimir Putin to negotiate an end of the war in Ukraine, Trump said today.","url":"https://www.staradvertiser.com/2025/08/08/breaking-news/trump-putin-to-meet-in-alaska-to-discuss-ukraine-peace-deal/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/08/web1_2025-08-08T154228Z_166059680_RC223GA1GBX6_RTRMADP_3_UKRAINE-CRISIS-USA-RUSSIA.JPG","video":null,"publish_date":"2025-08-08 23:08:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.308},{"id":349475328,"title":"Marlow: Eight Reasons I Called for the Prosecution of Letitia James for Conspiracy Against Trump's Civil Rights Ahead of DOJ Bombshell","text":"In Breaking the Law, my book on the lawfare against Donald Trump and his supporters, which was released this week, I called for Letitia “Tish” James to be prosecuted for conspiracy against rights.\n\nThe Department of Justice announced on Friday that they are investigating James for violating Donald Trump’s civil rights when she engaged in what the DOJ calls the “deprivation of rights” in targeting Trump.\n\nOutstanding.\n\nConspiracy against rights refers to a federal crime in the United States under 18 U.S.C. § 241, which states that it is illegal for people to “conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same.”\n\nAs much as anyone profiled in Breaking the Law, Tish James appears to have engaged in this exact behavior toward Donald Trump. Her suit was the most militant lawfare I encountered during my year of investigative research for the book.\n\nAs I noted earlier this week:\n\nLetitia “Tish” James is a partisan Democrat who ran and won her race for New York Attorney General specifically to try to destroy Trump. She is one of the most open and public practitioners of lawfare featured in the book. She once told a group of New York Democrats that “I look forward to going into the office of the Attorney General every day, suing [Trump], and then going home.” She uses the law to advance political goals, and she doesn’t hide that fact. Despite rising crime in New York during her tenure as state AG, she seems entirely fixated on getting Trump.\n\nHere are eight clear examples that prove James had no intention of ever affording President Trump equal protection under the law.\n\n1. Targeted Prosecution\n\n“We’re going to definitely sue him. We’re going to be a real pain in the ass. He’s going to know my name personally.” That’s what James said when assuming office, on video. She didn’t take long to make good on that promise. “We will use every area of the law to investigate President Trump and his business transactions and that of his family as well,” she stated a month after the election. This is the definition of a witch hunt.\n\nIn fact, James barely even paid lip service to addressing the rising criminality in New York so that she could stay narrowly focused on Trump (and hosting drag story hour read-a-thons).\n\n“The number one issue in this country is defeating Donald Trump. Nothing else matters,” James said.\n\nThat’s saying the quiet part out loud.\n\n2. She Prosecuted a Victimless (Non-)Crime\n\nThe crux of James’s suit against the Trumps was that they undervalued properties to gain better rates on loans, insurance policies, and tax rates. Who was the victim here of the evil Trump Organization? Apparently, it was corporations, specifically multibillion-dollar financial institutions that loaned money to the Trump family.\n\nSo, what did these corporations say when they filed complaints about Trump? Ah! But there were no complaints. The supposedly victimized banks and lenders liked working with the Trump Organization, so far as I can tell. It was James who brought the case on behalf of financial institutions that never claimed for a moment to be harmed.\n\nThe only harm in a business transaction is financial harm, and representatives of these institutions got onto the witness stand and under oath said they were not harmed and did not suffer.\n\nThis was literally unprecedented. It was the first time in state history that someone was accused of fraud even though no one believed that they had been harmed.\n\n3. Blatantly Undervaluing Mar-a-Lago to Justify Abuse\n\nMuch of the case hinged on the valuation of Trump’s legendary Mar- a-Lago property in Florida. The resort and club, which is a National Historic Landmark and has been Trump’s primary residence since 2019, was assessed a value in the range of $18 million to $28 million between 2011 and 2021. The court insisted these weren’t his figures, but the valuation of a basic Palm Beach assessment. The appraiser’s office is tasked with assessing property value for taxation purpose. Trump valued Mar-a-Lago as high as $739 million, according to the suit, which the judge declared was “an overvaluation of at least 2,300%, compared to the assessor’s appraisal.” Trump, on the other hand, testified that he believed the property is worth between $1 billion and $1.5 billion.\n\nOne-acre properties in the area routinely hit the real estate market in the $40 million price range, and two-acre homes in the area often are priced between $150 million and $200 million. Mar-a-Lago isn’t merely a unique historic landmark; it is 17 acres of beachfront property. Despite the sheer magnitude and the historical significance of the location, James and company advanced the opinion it was worth only a fraction of properties a tenth its size.\n\nThe court’s valuation of Mar-a-Lago was perhaps 1/50th its actual worth. This is “criminal” in the figurative sense, perhaps the literal sense too.\n\n4. Illicit White House Visits\n\nPublicly available records show that Tish James visited the Biden White House several times during the investigation and trial. First, on April 8, 2022, for a celebration of Ketanji Brown Jackson; then on July 18, 2022, to meet with Kamala Harris along with other attorneys general; and then on August 31, 2023, for an event honoring black women. It is possible but unknown at this time if she discussed Trump’s trial during these visits.\n\nI spoke to President Trump about these visits, and he is of the belief that she was coordinating with the Biden White House about the case.\n\nThis ought to be a major focus of the DOJ’s investigation.\n\n5. A Criminal Trial in Civil Court\n\nOne of the dead giveaways that Tish James was not even attempting to play fair was that she carried out the case as if it were taking place in a criminal court and the Trump family were crooks—despite the fact that the case was filed in civil court.\n\nThere are several distinctions between civil and criminal law, but the most relevant here is that most criminal cases are prosecuted by officials who represent a state, country, or some other jurisdiction. Civil cases are typically brought by an aggrieved party who believes that they are the victim of some wrongdoing. In this instance, the chief law enforcement officer for New York brought a civil case, not a criminal one, against Trump.\n\nShe did that because there was no criminal wrongdoing alleged.\n\nThe banks regarded Trump as a “whale,” an ideal business partner. He made every payment on time. He paid every dollar owed. The financial institutions made every nickel they expected to make from their dealings with him. Trump told me he even had a tendency to pay back loans early, even if he incurred penalties, ensuring that banks were happy with their relationship.\n\nYet Tish James took the position that Trump had conned them. The tenor of the suit suggested that he was an evildoer and needed to be punished.\n\n6. Creating a New Crime to Get Trump\n\nTish James was essentially creating a law out of whole cloth. She relied on New York Executive Law §63(12), which gives the authority broad power to investigate and prosecute civil fraud against consumers. It was typically used to go after con men who swindled sweet little grannies out of their savings, not real estate developers who sign agreements with sophisticated banks — banks who then told the court that they received every dime they were due on time and that they would do business with Trump again.\n\n“They tried me on a statute like it was consumer fraud, like I stole a refrigerator,” Trump told me in an exclusive interview.\n\nThe law was applied uniquely—and more harshly—than ever before.\n\n7. Cruel and Unusual Punishment\n\nTrump was initially assessed a $464 million fine for this victimless (non-)crime. This is not just confiscatory, it’s appallingly excessive.\n\nThe New York Supreme Court Appellate Division—the intermediate court in New York— reduced his bond to $175 million. As of March 2025 (when I last interviewed President Trump), they still had his money.\n\nTrump ought to pursue the appeal all the way to our nation’s top court. At a minimum, I expect the Supreme Court to rule that penalizing him half a billion dollars for a victimless violation violates the Eighth Amendment’s Excessive Fines Clause. “Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted,” the amendment reads. Notice how the language does not specify whether the excessive fine is related to a criminal or a civil matter, so Trump’s attorneys can certainly use this argument.\n\nNo other president in U.S. history could have survived this type of penalty. It is the definition of cruel and unusual.\n\n8. Election Interference\n\nThe fact that this case was allowed to go on is outrageous. The fact that it took place during the middle of a presidential election is a national disgrace.\n\nThis New York attorney general has always sought to destroy Trump and is clearly abusing her power to do so. (The judge in this juryless case does not seem to be operating on a rational plane. More on that in my book.)\n\nAs I concluded in Breaking the Law:\n\nThe most powerful law enforcement officer in a massively powerful state used her power to target and attempt to character-assassinate one of the state’s most successful residents on naked political grounds. It wasn’t merely excessive; this was a low moment for our country.\nJustice must be served, and Trump must win his appeal.\nThen Tish James ought to be prosecuted for conspiracy against rights.\n\nI’m heartened to learn that the DOJ intends to hold James accountable to the fullest extent of the law.\n\nThe investigations should then extend far beyond James and Jack Smith. Only then can we begin to dismantle the lawfare superstructure.\n\nAs Tish James is fond of saying herself, “[N]o one is above the law.”\n\nThis article was adapted from portions of Breaking the Law.\n\nBreaking the Law: Exposing the Weaponization of America’s Legal System Against Donald Trump, which has been hailed by President Trump as a “must read” book, is available in hardcover, eReader format, and as an audiobook read by the author himself.\n\nAlex Marlow is the editor-in-chief of Breitbart News, a two-time New York Times bestselling author, and the host of “The Alex Marlow Show” podcast produced weekdays by Breitbart News and Salem Podcast Network. You can subscribe to the podcast on YouTube, Rumble, Apple Podcasts, and Spotify. You can follow Alex on Facebook, Instagram, and X at @AlexMarlow.","summary":"As detailed in my new book \"Breaking the Law,\" here are eight clear examples that prove Letitia James had no intention of ever affording President Trump equal protection under the law.\n\n\nThe post Marlow: Eight Reasons I Called for the Prosecution of Letitia James for Conspiracy Against Trump&#8217;s Civil Rights Ahead of DOJ Bombshell appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/08/08/marlow-eight-reasons-i-called-for-the-prosecution-of-letitia-james-for-conspiracy-against-trumps-civil-rights-ahead-of-doj-bombshell/","image":"https://media.breitbart.com/media/2025/08/letitia-james-donald-trump-getty-640x335.png","video":null,"publish_date":"2025-08-08 23:06:43","author":"Alexander Marlow,New York Attorney","authors":["Alexander Marlow","New York Attorney"],"language":"en","category":"politics","source_country":"US","sentiment":-0.291},{"id":349474238,"title":"Irish Examiner view: Hold the gloating in an uncertain world","text":"It has been ubiquitous this week, as various storylines have emerged from the latest round of tariff bingo.\n\nThere are those who have wondered why so many countries have been able to get away with playing both ends against the middle when it comes to their purchase of cheaper Russian oil, while the rest of us take the hit for supporting Ukraine in our pockets and living standards.\n\nChina is one of those, but it doesn’t pretend to be in favour of Kyiv anyway. Turkey is another. So is Brazil, and the United Arab Emirates. Even some EU members remain enthusiastic consumers.\n\nAnd then, of course, there is Narendra Modi’s India, the subject of US president Donald Trump’s ire this week. Before Vladimir Putin’s illegal invasion, India purchased about 68,000 barrels of oil per day. Last year, that had risen to 2.3m barrels, roughly 40% of its needs.\n\nIndeed he has gone further, alleging that New Delhi is profiteering from sanctions avoidance.\n\nOn Truth Social, Mr Trump wrote: “India is not only buying massive amounts of Russian oil, they are then, for much of the oil purchased, selling it on the open market for big profits.\n\n They don’t care how many people in Ukraine are being killed by the Russian war machine. Because of this, I will be substantially raising the tariff paid by India to the USA. \n\nThere is zero evidence that sanctions are impeding the Russian war effort — bear in mind that the EU has introduced 18 different packages to increase the pressure on Moscow — and the reality is that a significant proportion of the oil that India is purchasing, legitimately, at capped prices, is being refined there and then re-exported back to Europe.\n\nWhile the relationship between Washington and the sub-continent may be regarded as collateral damage in the White House, such gestures must properly be viewed in Shakespearean terms as being “full of sound and fury, signifying nothing”. \n\nIt may well provide some mood music for Russia negotiator — and real estate developer — Steve Witkoff during his talks about talks with the Kremlin.\n\nBut for threats to carry real weight, they must include China, the principal purchaser of Russian oil. This is wholly unlikely to happen.\n\nUS imports from China are worth five times as much as those from India. Many of them are consumer goods such as toys, clothes, and electronics which will drive the inflation that Trump is pledged to suppress. The last time such stringent tariff threats were made, it presaged a suspension of trade between the world’s two largest economies, something which would herald an international commercial crisis.\n\nSitting here on the edge of Europe, Ireland might consider that a preoccupation with Ukraine will at least put the vexed subject of pharmaceutical tariffs on a longer finger. But this is cold comfort.\n\nAttention may be elsewhere for now. But it will only be a short time before the basilisk stare turns back in this direction. And others might then be able to find some consolation in our own travails. \n\nSports injuries \n\nThere was a moment in the final rugby Test between Australia and the Lions when the stadium fell silent. It wasn’t an observation of the normal courtesies which attend upon a penalty kicker’s attempt at conversion.\n\nWhen more than 80,000 people are that quiet, it can be a cause for worry. In this case, it was the moments that followed the collision between the head of the doughty Ireland lock James Ryan and the knee of the Wallabies man-mountain Will Skelton.\n\nRyan was stretchered off and, as we now know, regained consciousness sufficiently to provide a thumbs-up as he left the pitch on a stretcher.\n\nHowever, a match which produced three failed head injury assessments, plus that concussion, reignited the debate about the safety of high-impact sports such as rugby, boxing, Gaelic football, hurling, and NFL.\n\nThis was taken forward in the Irish Examiner when Colin Doherty, head of the School of Medicine in Trinity College Dublin and a neurologist with a special interest in the subject, challenged certain preconceptions about those who are criticised for worrying about what happens to athletes who suffer repeated blows during the natural course of their sport.\n\nHe wrote that he could hear the chorus of contact-sport supporters accusing him of wishing to ban contact sports or failing to see the important mental and physical benefits of taking part in sport.\n\n“Nothing could be further from the truth,” he said.\n\n“The charge that researchers like me are ultimately out to ban the sport is akin to saying that I want to ban driving because there are so many recorded deaths on the road.”\n\nThe paucity of the critics’ argument is such that it bears repetition. Calls for a proper, independently-funded research programme on risk — supported by mandatory screening for all players — seem reasonable.\n\nRequiring all coaches at all levels to undergo training in concussion awareness is a sensible precaution. What is there to argue about?\n\nIn the case of the groundbreaking legal action involving more than 1,000 players from rugby league and rugby union, there seems to be plenty at dispute.\n\nLast month, the judge presiding over the lawsuits said the solicitor acting on behalf of the claimants had been under a “misapprehension” about his responsibilities and that “he seems to have a problem with the English language”.\n\nHe also said that the firm involved had failed to disclose material to the defendants — World Rugby, the Rugby Football Union, the Welsh Rugby Union, and Rugby Football League.\n\nSenior master Jeremy Cook, hearing that only a minority of the players have received a medical diagnosis, said there had been enough delay. The cases needed resolving, “and the sooner the better”.\n\nThat is true, but the full hearings are unlikely to commence before 2026.\n\nThere is no reason, in the meantime, for sport to delay an improvement in precautionary practices and protocols.","summary":"In this age of uncertainty, Ireland may feel relieved that attention is elsewhere right now — but it won't be long until the basilisk stare turns back in this direction","url":"https://www.irishexaminer.com/opinion/ourview/arid-41684588.html","image":"https://www.irishexaminer.com/cms_media/module_img/9472/4736444_5_seoimage1x1_US_20Trump_20185281.jpg","video":null,"publish_date":"2025-08-08 23:06:00","author":"Irishexaminer.com,Sat, 09 Aug, 2025 - 00:06","authors":["Irishexaminer.com","Sat, 09 Aug, 2025 - 00:06"],"language":"en","source_country":"ie","sentiment":-0.336},{"id":349471960,"title":"Legality vs Reality: Could Western leaders face consequences for complicity in genocide?","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nUrsula von der Leyen, Donald Trump, Keir Starmer and Friedrich MerzAlamy\n\nThe Morning Lead\n\nLegality vs Reality: Could Western leaders face consequences for complicity in genocide?\n\nA growing number of genocide scholars have accused Israel of committing the crime of crimes in Gaza.\n\n12.06am, 9 Aug 2025\n\nShare options\n\nLAST WEEK THE Irish government was accused of being “complicit in Israel’s genocide” in a High Court case taken by The Ditch, Uplift and surgeon Ahmed El Mokhallalati.\n\nThe case argues that Ireland is violating international law by not inspecting flights reportedly carrying arms to Israel that have passed through Irish airspace during its war on the Gaza Strip in Palestine.\n\nThe case was the latest example of a state being accused of complicity in the gravest of crimes because of its alleged facilitation of Israel’s campaign, which has killed more than 60,000 people since October 2023. \n\nThe European Union’s former chief diplomat Josep Borrell issued a stark warning to the European Commission and member state leaders recently about the consequences of supporting Israel. \n\n“Those who do not act to stop this genocide and these violations of international law, even though they have the power to do so, are complicit in them,” Borrell wrote in an article in The Guardian newspaper. \n\nEuropean foreign ministers failed to agree to any sanctions against Israel last month, even though it had been found to have breached the human rights clauses of an association agreement with the bloc.\n\nThere has been some movement from individual member states allied to Israel this week, though. In response to Israel’s plan to take over Gaza City, Germany, one of Israel’s largest weapons suppliers, suspended the sale of arms that could be used in Gaza until further notice. \n\nAnd last month the UK House of Commons was the scene of a striking exchange between Conservative MP Kit Malthouse and Foreign Secretary David Lammy.\n\nMalthouse asked if Lammy could not see the potential “that he may end up at The Hague because of his inaction,” in relation to halting the supply of arms to Israel. \n\nLammy dismissed the question as “unbecoming”. \n\nAgainst the backdrop of global outrage at Israel’s conduct in Gaza, its allies in Europe and North America have remained largely steadfast in their support for almost two years, both materially and diplomatically. \n\nComplicity is a crime punishable under Article III (e) of the Convention on the Prevention and Punishment of the Crime of Genocide, most often referred to as the Genocide Convention. \n\nSo what risks do supportive states and government officials face if Israel is found guilty of genocide in the case taken against it by South Africa at the International Court of Justice (ICJ), and what form could the consequences take, if any? \n\nThe words Lammy to The Hague projected onto the UK House of Parliament by Palestinian Youth Movement on 3 August, 2025.Alamy Stock Photo\n\nAlamy Stock Photo\n\nAccording to international law experts who spoke to The Journal, powerful Western countries and their leaders could, at least in theory, find themselves facing charges in The Hague.\n\n“If Israel is found to have violated the Genocide Convention by a competent court, it is possible that third states might themselves face liability or be deemed responsible under international law for related violations,” said Michael Becker, assistant professor of international humanitarian law at Trinity College Dublin. \n\nBut for John Reynolds, associate professor of law at Maynooth University, the inherent flaws and historical power imbalances in the international legal system mean states and their leaders are unlikely to face real consequences. \n\nAdvertisement\n\n“Hopefully it’s not going to deteriorate further. But if it does, I suppose we’re into new territory, and if circumstances evolve in a certain way, for sure it’s legally possible,” Reynolds said. \n\nBut whether it is politically possible is another matter.\n\nA mounting case \n\nThe conclusion that Israel is committing genocide against the Palestinian people in Gaza has been reached by some of the world’s most eminent scholars who study the crime of crimes. \n\nAn essay published in the New York Times on 15 July by Israeli genocide and Holocaust scholar Omer Bartov was a recent, high-profile example.\n\n“I’m a genocide scholar. I know it when I see it,” the headline read. \n\nSince then, Israeli human rights NGO B’Tselem has come to the same conclusion.\n\nAmnesty International and Human Rights Watch had already reached the same verdict within months of Israel’s retaliation for the Hamas-led attack against it, in which almost 1,200 people were killed and roughly 250 were taken hostage.\n\nUplift's Brian Cuthbert and Saoirse McHugh and The Ditch's Roman Shortall, Paulie Doyle and Eoghan McNeill outside the Four Courts in Dublin.Uplift\n\nOn top of the South African case at the ICJ, in which Ireland has formally intervened, the International Criminal Court (ICC) has issued warrants for the arrest of Prime Minister Benjamin Netanyahu and his former defence minister Yoav Gallant. \n\nIt also issued warrants for Hamas leaders for their alleged crimes during the attack against Israel, all three of whom are now dead. \n\nIn a less publicised ICJ case, Nicaragua has accused Germany of complicity in genocide through its material support for Israel.\n\nIsraeli leaders and their supporters have rejected all of these accusations and described them as antisemitic, and even “Holocaust inversion”. \n\nAlamy Stock Photo\n\nAlamy Stock Photo\n\nWhat does the law say?\n\nAs Becker outlined, if the ICJ determines that Israel has committed violations of the Genocide Convention, a possible outcome of South Africa’s case, “it would then be possible to find that another state that has provided arms to Israel (if such arms were used to commit or facilitate genocidal acts) has violated international law”. \n\n“As a legal matter, there is some debate about whether complicity requires weapons to have been provided with both the knowledge that they will be used to commit genocide and the intent that they be used for that purpose,” Becker said.\n\n“The better view, however, is that full knowledge that the weapons will be used to perpetrate genocide is sufficient.”\n\nA different legal argument, he said, could focus on the obligation of states to prevent genocide, which is the duty of all signatories to the Convention. \n\n“The question will be at what point did the state know, or at what point should the state have known, that weapons or bombs would likely be used in ways that violate international humanitarian law,” Becker said.\n\nHe also noted that this is not to say that suspending arms supplies prior to a finding of genocide, or other violations of international law, would absolve a state of complicity. \n\nRelated Reads\n\nGermany to halt some arms exports to Israel as international condemnation of Gaza plan mounts\n\n'No more futile war': Hostage families fear the worst as Israel expands Gaza occupation\n\nICC prosecutor Karim Khan, who is currently on leave pending the result of a sexual misconduct investigation.Alamy Stock Photo\n\nAlamy Stock Photo\n\nThe ICJ deals with disputes between states, while the ICC is responsible for prosecuting individuals. \n\nSo, when Malthouse referred to the “personal” risk to Foreign Secretary Lammy, he was referring to the potential for prosecution in the ICC. \n\nReynolds said that it is “theoretically” possible that UK Prime Minister Keir Starmer and David Lammy could be prosecuted in the ICC.\n\n“It’s also possible for Joe Biden or Donald Trump or others in other countries as well. But it’s practically very unlikely, because the way these ICC prosecutions go is by trying to target the most senior people involved at the most direct level of the commissions of the crimes.\n\n“So in the case of Gaza, that would be the most senior people in the Israeli government and Israeli military.”\n\nLegality vs reality\n\nInternational law may sit atop the global legal order in theory but political realities have historically imposed informal limits on its efficacy.\n\nSee the long list of African generals and warlords indicted by the ICC, and the absence of – for example – US and UK leaders who presided over a war of aggression in Iraq. \n\nThe ICC will have to calculate the risks and rewards associated with taking on some of the most powerful world leaders, Reynolds explained. \n\nHe said it would have to weigh the likelihood of success against the length and cost of such proceedings, as well as the potential impact of any rulings that might be handed down. \n\nChildren crowd to receive a hot meal at a food distribution point in Gaza City in July 2025.Alamy Stock Photo\n\nAlamy Stock Photo\n\nBecause there is no police force available to courts like the ICJ and ICC, they rely on states to implement their decisions, and their rulings are more likely to be cited in cases brought against governments and state officials in domestic courts, which do have enforcement powers. \n\nStill, Reynolds did note that few international legal scholars, lawyers and other experts would have predicted that an Israeli prime minister would be the subject of an ICC arrest warrant. \n\nAt the same time though, the court has already faced consequences for its decision. \n\nThe US – which does not recognise the ICC – has sanctioned its lead prosecutor and a number of judges on the court, while some states in Europe (Hungary and Germany) have simply ignored the court’s authority despite being signatories to it. \n\nThe issue of state complicity, Becker said, “is distinct from questions relating to the potential criminal prosecution of state officials in those states that have provided support to Israel”.\n\n“In principle, the ICC could seek to do so if certain additional conditions were met. In reality, however, it is extremely unlikely that the ICC would choose to allocate its resources to such a prosecution.\n\n“In democratic states, the better remedy may be the ballot box.” \n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nDavid MacRedmond\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Legality vs Reality: Could Western leaders face consequences for complicity in genocide?”.\n\nRecipient's Email\n\nFeedback on “Legality vs Reality: Could Western leaders face consequences for complicity in genocide?”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nBenjamin Netanyahu\nDonald Trump\n\ninternational law\n\nKeir Starmer\n\nThe Morning Lead\n\nNews in 60 seconds\n\nUS Immigration\nFormer IRA member self-deports from US over fears of detention under Trump administration\n\nNegotiations\nTrump says he will meet with Putin ‘very shortly’ to discuss the war in Ukraine\n\nDrug cartels\nTrump may use military force against Latin American drug cartels, US reports claim\n\nAstronaut Jim Lovell, famed Apollo 13 commander, dies aged 97\n\nDebunked: Fox News claims about an Irish crime wave are based on discredited claims and bad stats\n\nCarrick-on-Suir\nFuneral details confirmed for Tipperary murder victim Ian Walsh\n\nFire crews in Los Angeles making good progress against blaze that forced thousands to flee\n\nIreland's biggest landlord sells 16 apartments for €6.6m and welcomes new rental regulations\n\nlate late dough\nRyan Tubridy has paid RTÉ back that €150,000 he received via the barter account\n\nInvestigatesagency fees\nTwo FG councillors have 'questions to answer' over migrant nurse agency fees, say opposition TDs\n\nTrump demands Intel CEO resign 'immediately' after national security concerns raised\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"A growing number of genocide scholars have accused Israel of committing the crime of crimes in Gaza.","url":"https://www.thejournal.ie/could-states-and-leaders-face-real-consequences-for-complicity-in-genocide-6779851-Aug2025/","image":"https://img2.thejournal.ie/article/6779851/river/?height=400&version=6782445","video":null,"publish_date":"2025-08-08 23:05:57","author":null,"language":"en","source_country":"ie","sentiment":0.091},{"id":349464418,"title":"Trump says he'll meet Putin in Alaska next Friday for first U.S.-Russia summit since 2021","text":"U.S. President Donald Trump said he will meet with Russian President Vladimir Putin on Aug. 15 in Alaska. \n\nTrump announced the meeting in a post on social media and said more details would follow.\n\nThe announcement came after Trump said Friday that he would meet \"very shortly\" with Putin to discuss ending the war in Ukraine, a potential major milestone after expressing weeks of frustration that more was not being done to quell the fighting.\n\nSpeaking to reporters at the White House earlier in the day, he also suggested that his meeting with the Russian leader could come before any sit-down discussion involving Ukrainian President Volodymyr Zelenskyy.\n\n\"We're going to have a meeting with Russia, start off with Russia,\" Trump said.\n\nIf it happens, the meeting would be the first U.S.-Russia summit since 2021, when former President Joe Biden met Putin in Geneva. It could mean a breakthrough in Trump's effort to end the war, although there's no guarantee it would stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace. \n\nThere was no immediate confirmation from Moscow.\n\nTrump also said that a peace deal would likely mean \"there will be some swapping of territories\" between Ukraine and Russia but didn't provide further details.\n\nAnalysts, including some close to the Kremlin, have suggested that Russia could offer to give up territory it controls outside of the four regions it claims to have annexed.\n\nTrump almost two weeks ago moved up his ultimatum to impose additional sanctions on Russia and introduce secondary tariffs targeting countries that buy Russian oil if the Kremlin did not move toward a settlement. The deadline was Friday.","summary":"U.S. President Donald Trump said he will meet with Russian President Vladimir Putin on Aug. 15 in Alaska. The announcement came after Trump said Friday that he would meet 'very shortly' with Putin to discuss ending the war in Ukraine.","url":"https://www.cbc.ca/news/world/trump-putin-meeting-1.7604979?cmp=rss","image":"https://i.cbc.ca/1.7604988.1754692067!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/russia-ukraine-war.jpg?im=","video":null,"publish_date":"2025-08-08 23:04:25","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.526},{"id":349464442,"title":"Jeffrey Epstein and Donald Trump: a timeline","text":"U.S. President Donald Trump keeps facing questions about Jeffrey Epstein, the multi-millionaire sex offender who died in jail in 2019 while facing federal charges of trafficking underage girls.\n\nAs media outlets reveal new information about the Epstein case and his long-ago personal relationship with Trump, the U.S. president and his administration have tried to shift the narrative. \n\nHere's a quick guide to the Epstein saga and how it has intersected with Trump over the years.\n\nTrump, then a wealthy real-estate developer, and Epstein, a hedge-fund manager, move in the same elite social circles in Manhattan and Palm Beach, Fla., and become friends. \n\n1992: Video from a party at Trump's Mar-a-Lago resort shows the two men together.\n\n1993: Epstein attends Trump's wedding to Marla Maples, according to video and photos obtained by CNN.\n\n1993-97: Trump travels at least seven times on one of Epstein's private jets, according to flight logs that eventually become evidence in lawsuits. However none of the flights go to Epstein's private island in the Caribbean. \n\nTrump rises to national fame with his reality TV show The Apprentice, while Epstein is charged with sexually abusing teenage girls. \n\n2002: In a feature about Epstein in New York magazine, Trump is quoted as saying he'd known Epstein for 15 years. \"Terrific guy. He's a lot of fun to be with,\" Trump said. \"It's even said that he likes beautiful women as much as I do, and many of them are on the younger side.\"\n\n2003: For his 50th birthday, Epstein receives a leather-bound book containing letters from friends. One message is from Trump, featuring an outline drawing of a naked woman and text suggesting the two men share a secret, the Wall Street Journal recently reported. Trump has denied he wrote the letter and is suing the newspaper for libel.\n\nMid-2000s: Trump and Epstein have a falling out, and the reasons are unclear. Most recently, Trump has said it was triggered by Epstein \"taking people that worked for me\" at Mar-a-Lago. Other accounts have blamed a 2004 bidding war over a mansion in Palm Beach or Epstein harassing the daughter of a Mar-a-Lago member in 2007. \n\n2008: Epstein is under investigation for sexually abusing underage girls at his homes in Florida and New York from 2002 through 2005. He avoids federal prosecution and a potentially lengthy prison sentence by pleading guilty to lesser state charges of soliciting prostitution from a minor, under a secret plea deal. \n\nTrump's life journey takes him to the White House, while Epstein's abruptly ends in jail.\n\n2017: Trump nominates Alexander Acosta to be his secretary of labour. Acosta was the U.S. attorney who oversaw Epstein's then-secret plea deal, revealed in 2018 by the Miami Herald. He resigns in 2019, shortly after federal prosecutors revive the criminal case against Epstein. \n\n2019: On July 8, in federal court in Manhattan, Epstein is indicted on sex trafficking charges. He pleads not guilty and is held in a federal jail. The next day, a reporter asks Trump if he still thinks Epstein is a terrific guy. Trump responds: \"I don't think I've spoken to him for 15 years. I wasn't a fan.\"\n\nOn Aug. 10, Epstein dies in custody. His death is ruled a suicide. \n\nDespite Epstein's death — or perhaps because of it — questions about the scandal continue to swirl. \n\n2023-24: During Joe Biden's presidency, key players in Trump's MAGA movement lead a push for more details of the Epstein case to be made public. Some go on to play key roles in Trump's second administration: Vice-President JD Vance, FBI director Kash Patel and Attorney General Pam Bondi.\n\nFeb. 21: A month after Trump's inauguration, Bondi is asked by Fox News whether the Justice Department will release Epstein's client list. \"It's sitting on my desk right now to review,\" she responds, adding that a \"truckload\" of previously withheld evidence was being examined.\n\nJuly 7: The Department of Justice announces that no more files related to the Epstein investigation will be released, and declares that no list of his clients exists. This angers some MAGA supporters, but both on social media and in exchanges with reporters, Trump tells people to stop talking about Epstein. \n\nJuly 23: The Wall Street Journal reports that Trump had been briefed in May that his name is among many that appear in the Epstein files. The paper notes that this does not indicate any wrongdoing by Trump.\n\nAug. 2: Federal prison officials say that Epstein's former girlfriend Ghislaine Maxwell, serving a 20-year sentence for sex trafficking, has been transferred to a minimum-security prison camp. This comes just days after Maxwell met with Deputy U.S. Attorney General Todd Blanche, previously one of Trump's personal lawyers.","summary":"U.S. President Donald Trump keeps facing questions about Jeffrey Epstein, the multi-millionaire sex offender who died in jail in 2019 while facing federal charges of trafficking underage girls. Here's a quick guide to the Epstein saga and how it intersected with Trump over the years.","url":"https://www.cbc.ca/news/world/trump-epstein-timeline-1.7604277?cmp=rss","image":"https://i.cbc.ca/1.5647742.1752820144!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/ghislaine-maxwell-jeffrey-epstein-donald-trump.jpg?im=","video":null,"publish_date":"2025-08-08 23:01:24","author":"Mike Crawley","authors":["Mike Crawley"],"language":"en","category":"politics","source_country":"ca","sentiment":0.226},{"id":349462216,"title":"Netanyahu ‘not a partner in peace’, says Scottish Labour leader Sarwar","text":"Israeli Prime Minister Benjamin Netanyahu is “not a partner in peace” who will eventually have to answer to international courts over the crisis in Gaza, the leader of Scottish Labour has said.\n\nAnas Sarwar hit out at the Israeli premier as he announced plans to take over Gaza City in a new offensive.\n\nWhile Prime Minister Sir Keir Starmer said the plans were “wrong”, Mr Sarwar was much more strident, describing Mr Netanyahu as a “war criminal”.\n\nFollowing news of the offensive, the Scottish Greens urged the Prime Minister to expel the Israeli ambassador from the UK.\n\nBut Mr Sarwar said he did not want to “get into stunts”.\n\n“The problem here is Benjamin Netanyahu, his Israel government, his illegal occupation, his lack of interest in peace and the fact that he clearly has no respect for international law, and gives no value to the sanctity of human life,” he told the PA news agency.\n\n“He is a danger to his own population in Israel, but he’s also a danger to the Palestinian population and a danger to the wider region in the Middle East.”\n\nHe added: “We all have to be resolute in saying that Netanyahu is a war criminal, he’s not acting in the interests of peace.\n\n“He’s not a partner for peace, Hamas is a terrorist organisation that committed horrific acts on October 7 2023 – they aren’t partners for peace.”\n\nDiplomacy, the Scottish Labour leader said, had not yet worked in ending the conflict, but shutting off communications would not help matters.\n\n“Diplomacy hasn’t worked in terms of the war ending, because the war is still ongoing,” he said.\n\n“There is a plausible case for genocide that the Israeli government has to answer and one day I believe will have to answer to the ICC and the ICJ.\n\n“But we have to urgently end the war – if we think just stopping talking to the Israeli government means that we end the war, I think that’s a pretty naive view of the situation right now.”\n\nThe only person who the Israel Government would listen to, he said, would be US President Donald Trump, as he urged the international community to exert as much pressure as possible on the administration.\n\nAsked if he felt the UK Government had done enough to solve the issue, the Scottish Labour leader said it had done “a lot”, but added: “I think there’s still more we have to look at.”\n\nScottish Green co-leader Lorna Slater said the UK Government has been an “active participant” in what she described as a “genocide” in Gaza.\n\n“Urging restraint is not enough, the hypocrisy must end. The arms sales must stop and so must the military collaboration and political support that has gone with them.\n\n“That must mean backing sanctions against Israeli forces and expelling the Israeli ambassador who has served as a mouthpiece for genocide.\n\n“This has been a disgraceful chapter in UK foreign policy and has made the Prime Minister and his colleagues complicit in some of the worst war crimes of this century.”\n\nThe UK Government has been contacted for comment.\n\nMeanwhile, Scottish First Minister John Swinney hit out at the announcement of the new offensive.\n\n“The decision of the Israeli Government to seize control of Gaza City is completely and utterly unacceptable,” he said in a post on X.\n\n“It will create even more human suffering for the Palestinian people and further escalate the conflict.\n\n“The international community must stop Israel and secure a ceasefire.”","summary":"The Israeli Government announced plans to occupy Gaza City on Friday.","url":"https://www.standard.co.uk/news/politics/benjamin-netanyahu-anas-sarwar-israeli-keir-starmer-prime-minister-b1242192.html","image":"https://static.standard.co.uk/2025/08/09/00/d588c79e8df7b0a4aac9b06b3878506bY29udGVudHNlYXJjaGFwaSwxNzU0NzQ3MDQ2-2.80797958.jpg?width=1200","video":null,"publish_date":"2025-08-08 23:01:00","author":"Craig Paton","authors":["Craig Paton"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.433},{"id":349461680,"title":"Letters: Residents’ input crucial to expanding S.J. housing stock","text":"Resident input would\nspur S.J. housing\n\nRe: “San Jose’s high-density rules are killing its housing dreams” (Page A6, July 31).\n\nProfessor Wood’s sharp critique of San Jose’s General Plan rightly faults the city’s housing policies for exacerbating our current housing crisis. The city’s misguided rules allow zero flexibility for responding to market forces and preserving neighborhood character.\n\nSan Jose must transition to higher densities thoughtfully, with our residents’ voices leading the way. The novel process employed for the former Pleasant Hills Golf Course property serves as an example for future development proposals. After completing a meaningful community input process, the developer submitted a thoughtful proposal of 32 units per acre that is consistent with guidelines created through dialogue with the surrounding community.\n\nThe design is responsive to public input and respectful of our neighborhood character, financially feasible and consistent with infill development policies. The process should be used to facilitate the growth of our housing supply throughout the city.\n\nCoffee shop lawsuit\nshould be tossed\n\nRe: “Coffee shop owner fires back amid suits” (Page B1, July 31).\n\nThanks to Shomik Mukherjee for a balanced article on the “antisemitism” lawsuits against the Jerusalem Coffee Shop (JCS). He got only one thing wrong. The six-pointed star emblazoned on hats that two Jewish customers wore into JCS is not a “symbol of the Jewish faith.” It’s a symbol of the Israeli state, which claims to represent Jews while violating every principle of Judaism.\n\nWhat kind of person would wear clothing with an Israeli flag symbol into a Palestinian-owned coffee house, at a time when Israel is committing horrible daily massacres against the Palestinian people? Only someone who wanted to create drama they could video and post online. They intended to demonize and attack the Palestinian community.\n\nNow, Trump’s Department of Justice and two pro-Israel organizations are suing JCS for antisemitism. These lawsuits are baseless and should be thrown out of court.\n\nDavid Spero\nSan Francisco\n\nMorality is not top\nconcern of politics\n\nRe: “Trump pronouncements an exercise in projection” (Page A6, Aug. 1).\n\nIt’s curious how evaluation of Joe Biden is predicated on Trump animus.\n\nIrv Brenner strangely projects Donald Trump as saying Biden is evil. True, Trump has portrayed Biden as a fool and our worst ever president, but evil is sheer projection by Brenner.\n\nThe letter is emblematic of the panic liberals are feeling about the success of Trump policies compared to the failure of the Biden administration. Biden’s good intentions were overridden by policy failures exacerbated by his mental decline to the point where the country was under the control of anyone in charge of his auto-signer.\n\nThe case against Trump is based on personality and character rather than policy.\n\nPersonal morality doesn’t translate to morality-driven governance that is evaluated by intentions rather than results. Morality and compassion in government must be mitigated by a realistic evaluation of economic and political circumstances.\n\nFred Gutmann\n\nSpeak up for Gaza’s\nkids — and the world’s\n\nDay after day, news from around the world documents the worsening humanitarian crisis in Gaza. Children are dying of starvation. Trucks are loaded with food across the border, but most have not been allowed in. How do we help stop this horror?\n\nI am the daughter of Holocaust survivors. My parents endured that horror, and raised me to do what I could to stand up for fairness — to recognize our common humanityand speak out against injustice toward any of us.\n\nWe must not look away from the preventable starvation in Gaza.\n\nIn the words of Omar El Akkad in his book “One Day Everyone Will Have Always Been Against This,” “It may seem now like it’s someone else’s children, but there’s no such thing as someone else’s children.”\n\nMay we join together to speak up for them and for a world where all children may thrive.\n\nMadelyn Hodges\n\nTrump has painted US\ninto a dangerous corner\n\nAmid the political chaos, please remember that the most powerful man in the world (he can destroy the Earth by punching a few buttons) has painted himself into a corner.\n\nDue to the largely contradictory interests to whom he has sold out (e.g. big money, radical evangelicals, Russia, fascists, Israel, tech moguls, Saudi Arabia), his government is extremely unpopular with real people and of course, his own base is finally accepting his possible history of pedophilia.\n\nWhat does Mr. Trump typically do when he is cornered? He creates another (bigger) distraction. Did you notice he moved a nuclear naval combat group closer to Russia?\n\nHe controls the Supreme Court and Congress, and he has neutered executive branch agencies. Near as I can tell, there are only three forces still opposing him: Elon Musk, the U.S. military and those of us who have yet to be silenced.\n\nDon Eggleston","summary":"Also: Toss lawsuit &#124; Morality and politics &#124; Gaza's kids &#124; A dangerous corner. Mercury News reader letters to the editor for Aug. 10, 2025.","url":"https://www.mercurynews.com/2025/08/08/letters-residents-input-expanding-sj-housing-stock/","image":"https://www.mercurynews.com/wp-content/uploads/2018/04/sjm-l-buildcost-0428-05.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-08 23:00:55","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.299},{"id":349464958,"title":"Azerbaijan, Armenia Back Trump's Nobel Peace Prize Nomination After Peace Deal","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/azerbaijan-armenia-back-donald-trumps-nobel-peace-prize-nomination-after-peace-deal-9050132\" on this server.\nReference #18.91a12417.1754696371.a6cd7e7\nhttps://errors.edgesuite.net/18.91a12417.1754696371.a6cd7e7","summary":"Azerbaijan's President Ilham Aliyev on Friday suggested sending a joint nomination alongside Armenia for Trump to be awarded the Nobel Peace Prize after the rivals signed an accord aimed at ending decades of conflict.","url":"https://www.ndtv.com/world-news/azerbaijan-armenia-back-donald-trumps-nobel-peace-prize-nomination-after-peace-deal-9050132","image":null,"video":null,"publish_date":"2025-08-08 22:59:53","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":349458764,"title":"Trump to meet Putin on August 15 in Alaska","text":"U.S. President Donald Trump on Friday (August 8, 2025) said he will meet with Russian President Vladimir Putin on August 15 in the U.S. State of Alaska.\n\nHe announced the meeting in a post on social meeting and said more details would follow.\n\nEarlier, Mr. Trump had said that he will meet “very shortly” with Russian President Vladimir Putin to discuss ending the war in Ukraine, a potential major milestone after expressing weeks of frustration that more was not being done to quell the fighting.\n\n“The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska,” Mr. Trump wrote on his Truth Social platform.\n\nThis will be the first meeting between the leaders since Trump returned to the White House\n\nSpeaking to reporters at the White House after announcing a framework aimed at ending decades of conflict elsewhere in the world — between Armenia and Azerbaijan — Mr. Trump had refused to say exactly when or where he would meet with Mr. Putin, but that he planned to announce a location soon.\n\nHe also suggested that his meeting with the Russian leader could come before any sit-down discussion involving Ukrainian President Volodymyr Zelenskyy.\n\n“We're going to have a meeting with Russia, start off with Russia. And we'll announce a location. I think the location will be a very popular one,” Mr. Trump had said.\n\nHe added: “It would have been sooner, but I guess there's security arrangements that unfortunately people have to make. Otherwise I'd do it much quicker. He would, too. He'd like to meet as soon as possible. I agree with it. But we'll be announcing that very shortly.\" \n\nFirst summit since 2021\n\nIf it happens, the meeting would be the first US-Russia summit since 2021, when former President Joe Biden met Mr. Putin in Geneva. It could mean a breakthrough in Mr. Trump's effort to end the war, although there's no guarantee it would stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace.\n\nThere was no immediate confirmation from Moscow.\n\nStill, Mr. Trump said, “President Putin, I believe, wants to see peace, and Zelenskyy wants to see peace.\" He said that, “In all fairness to President Zelenskyy, he's getting everything he needs to, assuming we get something done.” \n\nMr. Trump also said that a peace deal would likely mean “there will be some swapping of territories” between Ukraine and Russia but did not provide further details.\n\nPressed on if this was the last chance to make a major peace deal, Mr. Trump said, “I don't like using the term last chance,” and said that, “When those guns start going off, it's awfully tough to get 'em to stop.”","summary":"The U.S. and Russian Presidents will discuss ending the war in Ukraine; this will be the first meeting between the leaders since Trump returned to the White House","url":"https://www.thehindu.com/news/international/trump-to-meet-putin-on-august-15-in-alaska/article69911513.ece","image":"https://th-i.thgim.com/public/incoming/84gyqt/article69911514.ece/alternates/LANDSCAPE_1200/2025-08-08T154228Z_166059680_RC223GA1GBX6_RTRMADP_3_UKRAINE-CRISIS-USA-RUSSIA.JPG","video":null,"publish_date":"2025-08-08 22:56:59","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.474},{"id":349458622,"title":"Trump Confirms August 15 Alaska Meeting With Putin On Russia-Ukraine Ceasefire","text":"US President Donald Trump has officially confirmed a meeting with Russian President Vladimir Putin, scheduled to take place next week. In a Truth Social post shared on Friday, Trump announced that the two leaders will meet on August 15, 2025, in Alaska, to discuss the ongoing Russia-Ukraine conflict.\n“The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska,” Trump wrote in his post.\nThis announcement brings an end to weeks of speculation surrounding the venue for the high-level talks. The confirmation of Alaska as the location comes just days after reports that President Putin had shown interest in holding the summit in the United Arab Emirates (UAE). However, the US administration appears to have pushed for a domestic location, citing security and diplomatic considerations.\nThe upcoming summit marks Trump’s first official meeting with Putin since beginning his second term in office in January 2025. It will also be the first formal US-Russia presidential meet since June 2021, when then-President Joe Biden met with Putin in Geneva, Switzerland.\nThe Alaska meeting is expected to focus heavily on the Ukraine conflict, which has entered its fourth year and remains one of the most pressing international crises. US officials have not yet released details on the agenda or which aides will accompany President Trump during the discussions.\nMore updates are expected in the coming days as final preparations are made.","summary":"This announcement brings an end to weeks of speculation surrounding the venue for the high-level talks.","url":"https://www.news18.com/world/trump-confirms-august-15-alaska-meeting-with-putin-on-russia-ukraine-ceasefire-ws-l-9494222.html","image":"https://images.news18.com/ibnlive/uploads/2025/01/vladimir-putin-and-donald-trump-2025-01-107f91e508a35e03ddc791d9e61cdb02.jpg","video":null,"publish_date":"2025-08-08 22:55:34","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.005},{"id":349460128,"title":"Is your money safe? Trump’s 401(k) executive order could put your retirement savings on the line - check how","text":"Trump 401(k) executive order is shaking up how Americans might plan for retirement. With this bold move, President Donald Trump is pushing to open the door for cryptocurrency, private equity, and real estate investments inside your 401(k)—options once limited to the wealthy elite. Signed on August 7, 2025, this policy could completely change the way millions build their nest egg. \n\nTrump executive order could allow 401(k) investments in crypto and private equity: In a major shake-up to the way Americans save for retirement, President Donald Trump has signed a bold executive order that could soon allow 401(k) retirement plans to include alternative assets like cryptocurrencies, private equity, and real estate. This game-changing move has sparked a fierce debate across financial and political circles—with some hailing it as a way to democratize wealth-building opportunities and others warning of serious risks to Americans’ nest eggs.Trump’s new 401(k) order could expand investment options for everyday Americans On August 7, 2025, President Trump signed an executive order that directs the Department of Labor (DOL) to reassess rules surrounding the types of investments that can be included in employer-sponsored 401(k) retirement plans. Under this directive, assets that were once restricted—like Bitcoin, Ethereum, private real estate funds, and private equity vehicles—could become available to the average retirement saver.Productivity ToolZero to Hero in Microsoft Excel: Complete Excel guideBy Metla Sudha SekharFinanceIntroduction to Technical Analysis & Candlestick TheoryBy Dinesh NagpalFinanceFinancial Literacy i e Lets Crack the Billionaire CodeBy CA Rahul GuptaDigital MarketingDigital Marketing Masterclass by Neil PatelBy Neil PatelFinanceTechnical Analysis Demystified- A Complete Guide to TradingBy Kunal PatelProductivity ToolExcel Essentials to Expert: Your Complete GuideBy Study at homeArtificial IntelligenceAI For Business Professionals Batch 2By Ansh Mehra This move is part of Trump’s broader economic strategy to promote financial freedom, retirement innovation, and wealth access for all Americans. What the executive order says about alternative investments in 401(k)s The order requires the Department of Labor to review current fiduciary standards under ERISA (Employee Retirement Income Security Act of 1974) within 180 days. This could clear the path for retirement plans to offer: Digital assets such as cryptocurrencies and blockchain-based tokens Private equity funds and venture capital vehicles Real estate investment trusts (REITs) and infrastructure projects Hedge funds, commodities, and other non-traditional investments The Securities and Exchange Commission (SEC) has also been asked to examine potential rule changes that would support access to these emerging asset classes in retirement accounts.Live Events Why Trump wants to open up retirement investing to crypto and private equity President Trump and his economic advisors argue that the current retirement system is outdated and heavily favors Wall Street's public markets. They believe that expanding access to private market strategies and digital innovation can: Help Americans diversify their retirement portfolios Offer potential for higher long-term returns Give individuals access to investment tools once reserved for the ultra-wealthy Promote financial innovation and competition in the retirement industry Trump’s administration framed the move as a way to \"democratize investment access\" and close the wealth gap by allowing everyday Americans to build wealth using the same tools hedge funds and institutional investors have long enjoyed. Financial experts urge caution over risk and regulation While the proposal is generating excitement in tech and investment circles, many financial experts and retirement advisors are urging caution. Here’s why: Cryptocurrencies like Bitcoin and Ethereum are highly volatile, and price swings could wipe out a retiree’s savings if not properly managed. Private equity often involves long lock-up periods, high fees, and limited transparency, making them less suitable for average investors. Fiduciaries who manage 401(k) plans may face legal risks if these investments fail to meet the best-interest standard. The long-term returns of private market investments are not guaranteed and, in some cases, underperform public market indexes. According to retirement analysts, while greater access to alternative investments could benefit some investors, others may unknowingly expose themselves to significant risks and reduced liquidity. 401(k) plans won’t change overnight: What’s the timeline? Despite the executive order, retirement savers won’t see immediate changes to their 401(k) options. Here’s a breakdown of what to expect: The Department of Labor has until early 2026 to propose regulatory updates that would permit these investment changes. After that, financial providers would need to update their platforms, investment options, and risk disclosures. Adoption could take months or years, depending on how quickly the DOL and SEC move forward with rule changes and how retirement plan administrators respond. So, while the door is opening to crypto and private equity in 401(k)s, it’s not a done deal yet. What this means for your financial future and retirement planning If these changes are implemented, American workers could gain access to new asset classes that offer greater potential upside—but also come with greater responsibility and risk. Here’s what retirement savers should consider: Do your homework: Alternative assets are complex. Investors should thoroughly research any new offerings before allocating funds. Know your risk tolerance: Cryptocurrencies and private funds may not be appropriate for conservative savers nearing retirement. Diversify wisely: Experts recommend limiting exposure to alternative assets to a small percentage of your total portfolio. Seek professional advice: A licensed financial planner can help you assess whether these options align with your retirement goals. A bold retirement reform with both opportunity and risk President Trump’s 401(k) executive order could transform how Americans invest for retirement, opening up access to digital assets, private equity, and non-traditional investments once reserved for the wealthy. Supporters praise it as a long-overdue modernization of the retirement system, while critics fear it could lead to excessive risk-taking and financial missteps. As agencies move forward with reviewing the rules, savers should stay informed and cautious—because how this policy plays out could directly impact millions of Americans’ retirement security in the years to come.FAQs: Q1. What is Trump’s 401(k) executive order about? It aims to let Americans invest in crypto and private equity through their 401(k) plans. Q2. Can I invest in Bitcoin through my 401(k) now? Not yet—rules may change soon, but it’s not allowed as of now.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump 401(k) order risks retirement savingstrump 401(k) executive ordercrypto in retirement plansprivate equity 401(k) changestrump crypto retirement reform\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump 401(k) order risks retirement savingstrump 401(k) executive ordercrypto in retirement plansprivate equity 401(k) changestrump crypto retirement reform(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless","summary":"Trump 401(k) executive order is making headlines as it could soon allow Americans to invest in crypto, private equity, and real estate through their retirement plans. Signed on August 7, 2025, President Trump's order directs changes to open 401(k) access to alternative investments once only available to the wealthy. While this move could boost financial freedom and investment options, experts warn it also comes with risk. From Bitcoin to private funds, this bold retirement reform may reshape the future of savings.","url":"https://economictimes.indiatimes.com/news/international/us/is-your-money-safe-trumps-401k-executive-order-could-put-your-retirement-savings-on-the-line-check-how/articleshow/123195482.cms","image":"https://img.etimg.com/thumb/msid-123195485,width-1200,height-630,imgsize-26144,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-08 22:52:03","author":"Sectionsis Your Money Safe? Trump’s 401k Executive Order Could Put Your Retirement Savings On The Li","authors":["Sectionsis Your Money Safe? Trump’s 401k Executive Order Could Put Your Retirement Savings On The Li"],"language":"en","source_country":"in","sentiment":0.107}]}