{"offset":0,"number":50,"available":9776,"news":[{"id":357843790,"title":"Blowback over Kristi Noem interview prompts CBS News to change rules for “Face the Nation”","text":"CBS News is changing its policies for interviews on Face the Nation after Homeland Security Secretary Kristi Noem criticized the broadcast of her Aug. 31 conversation with the program.\n\n A spokesperson for the network told Entertainment Weekly that Face the Nation will change its rules to only broadcast unedited interviews.\n\n \"In response to audience feedback over the past week, we have implemented a new policy for greater transparency in our interviews,\" the spokesperson said. \"Face the Nation will now only broadcast live or live-to-tape interviews (subject to national security or legal restrictions). This extra measure means the television audience will see the full, unedited interview on CBS and we will continue our practice of posting full transcripts and the unedited video online.\"\n\n A representative from the Department of Homeland Security responded to the news in a statement to EW. \"Americans are fed up with endless whitewashing by the media — they want the whole truth, and they deserve the whole truth,\" a spokesperson said. \"This week, Americans made that clear, and this is their victory.\"\n\n Noem previously accused CBS News of attempting to \"whitewash the TRUTH\" about Kilmar Abrego Garcia, the man who was deported to El Salvador in March, after the network shortened her response to a question about him.\n\n CBS News posted Ed O'Keefe's full unedited interview with Noem on YouTube on Sunday. The video runs for 16 minutes and 40 seconds, whereas the broadcast version ran for 12 minutes and 15 seconds.\n\n DHS slammed the edited interview in a press release on Sunday. CBS News initially said that the edited interview \"met all CBS News standards\" (via The New York Times). It is standard practice for broadcast news outlets to edit interviews in order to condense their runtimes, as most TV programs must fit all of their content into a strict, unchangeable time block.\n\n CBS News' journalistic practices and policies regarding political coverage have been subject to widespread scrutiny in the last 12 months. In November, Donald Trump filed a lawsuit against the network's parent company, Paramount, after Face the Nation aired an interview with his political opponent in the presidential election, Kamala Harris. Trump sought $10 billion and accused CBS News of editing the interview in order to \"tip the scales [of the election] in favor of the Democratic party.\"\n\n Paramount eventually opted to settle the case and agreed to pay Trump $16 million in July. Critics including Sen. Elizabeth Warren and the Writers Guild of America East viewed the decision as an attempt to appease Trump in the midst of the company's then-pending merger with Skydance, which required approval from the Trump administration. The deal was approved later that month, and closed on Aug. 7.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Paramount also came under fire for canceling The Late Show With Stephen Colbert three days after the show criticized the CBS News-Trump settlement. Warren suggested that the show was canceled for \"political reasons\" related to the settlement, though the network has consistently stated that pulling the plug on the show was \"purely a financial decision against a challenging backdrop in late night.\"\n\n Additionally, in April, The New York Times reported that longtime 60 Minutes producer Bill Owens resigned from the show.","summary":"Noem criticized the network for editing four minutes out of a 16-minute interview.","url":"https://ew.com/kristi-noem-interview-cbs-news-changes-rules-face-the-nation-11804845","image":"https://ew.com/thmb/OQ318NBMDI4x6mbMnJBN4B5Iuyg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Kristi-Noem-face-the-nation-801-090525-a0ff496b60894020b0a09bf91c800050.jpg","video":null,"publish_date":"2025-09-06 00:49:41","author":"Wesley Stenzel","authors":["Wesley Stenzel"],"language":"en","source_country":"US","sentiment":0.025},{"id":357839742,"title":"San Jose mayor right to knock Newsom’s juvenile bullying of business","text":"Gov. Gavin Newsom’s decision to use his official social media accounts to constantly mock and parody President Donald Trump seems like a gamble that has paid off — at least for his 2028 White House ambitions. A national poll by Emerson College released Aug. 29 showed Newsom’s support among Democrats doubling since June. A groundswell of Democrats praising his combativeness even led to a rare positive Drudge Report banner story on the former San Francisco mayor.\n\nBut has this applause gone to his head — or, worse yet, has it led to him going from parodying Trump’s bullying style to adopting it?\n\nConsider the governor’s press office’s juvenile Aug. 20 response on X to a Bed Bath & Beyond announcement that the struggling retailer was keeping out of California due to its costly business climate: “After their bankruptcy and closure of every store, like most Americans, we thought Bed Bath & Beyond no longer existed,” Newsom’s account snarked. “We wish them well in their efforts to become relevant again as they try to open a second store.”\n\nHow does this help a state that has seen one high-profile company after another leave in recent years? As the Los Angeles Times reported Aug. 4, the decision by In-N-Out, California’s iconic burger chain, to relocate many key operations to Tennessee follows the exits of financial services powerhouse Charles Schwab, oil giant Chevron, and tech pioneers Tesla and SpaceX.\n\nThe foolishness of the governor’s gibe was underscored by the progressive, staunchly anti-Trump Democratic mayor of San Jose. In a column for The San Francisco Standard, Matt Mahan wrote, “Newsom’s supporters say he is ‘breaking the internet’ and ‘owning’ Trump. But the governor, and every elected official and leader, also need to own up to the truth. And the truth is that California has the highest unemployment rate in the nation, at 5.5%, and nearly half the nation’s unsheltered homeless people. We have the highest energy and housing costs in the continental United States, and, largely because of these high costs, the highest effective poverty rate in the nation.”\n\nMahan should have gone even farther and noted how Gov. Jerry Brown urged Silicon Valley CEOs to contact him directly if they ran into state-generated headaches. Or how Gov. Arnold Schwarzenegger was famous for reading stories about a business in distress and immediately giving the owner a call.\n\nWhy “should have”? Because in response to our questions, the governor’s press office also mockingly dismissed Mahan. “We’d ask Mayor Matt to spend his time less focused on the governor’s social media and his efforts to defend democracy, and instead focus on San Jose,” a spokesperson wrote in an email.\n\nWow, “Mayor Matt,” you just don’t get it, do you? Questioning California’s business climate is akin to attacking democracy.\n\nCall this what it is: pretzel logic in service of puerility.","summary":"Gov. Gavin Newsom&#8217;s decision to use his official social media accounts to constantly mock and parody President Donald Trump seems like a gamble that has paid off — at least for his 2028 White House ambitions. A national poll by Emerson College released Aug. 29 showed Newsom&#8217;s support among Democrats doubling since June. A groundswell of Democrats praising his combativeness even led to a rare positive Drudge Report banner story on the former San Francisco mayor. But has this applause gone to his head — or, worse yet, has it led to him going from parodying Trump&#8217;s bullying style to [&#8230;]","url":"https://www.sandiegouniontribune.com/2025/09/05/san-jose-mayor-right-to-knock-newsoms-juvenile-bullying-of-business/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/Homeless_Shelter_Arrests_83721.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-06 00:26:38","author":"U T Editorial Board","authors":["U T Editorial Board"],"language":"en","source_country":"us","sentiment":0.015},{"id":357841440,"title":"World News | US: Trump Signs Executive Order, Pentagon to Be Now Known as 'Department of War'","text":"Washington DC [US], September 6 (ANI): US President Donald Trump on Friday (US local time) officially signed an Executive Order which reverted the Department of Defence's name to the Department of War. He was flanked by US Secretary of War Pete Hegseth and Joint Chiefs of Staff Dan Caine. Also Read | 'Looking Forward to Deepening India-Jamaica Bonds of Friendship': PM Narendra Modi Congratulates His Jamaican Counterpart Andrew Holness for His 3rd Consecutive Victory.\nAhead of signing the order, US President Trump told the media that he had been discussing the idea for some time with Pete Hegseth and Dan Caine. Trump said, \"We won the first world war, second world war- everything before that and in between and then we decided to go woke and changed the name to 'Department of Defense', so we're going 'Department of War'\". Also Read | Donald Trump Trade Adviser Kevin Hassett Says US Disappointed by India's Russian Oil Imports, Hopes To Improve Ties.\nHe said that the name is \"much more appropriate\" considering the current global scenario. Secretary of War, Pete Hegseth, said, \"This name changing is not just about renaming, it is about restoring. Words matter... Restoring the warrior ethos, restoring victory and clarity, restoring intentionality... The War Department is going to fight decisively, not endless conflicts. It's going to fight to win, not to lose. We are going to go on offence, not just defence; maximum lethality, not tepid legality; violent effect, not politically correct. We are going to raise up warriors, not just defenders\". On being asked what message the rebranding sends to American enemies and allies, Trump said, \"It sends a message of victory and strength\". The White House also shared the announcement in a post on X. https://x.com/WhiteHouse/status/1964064230828613834\nThe Department of War posted a video where Secretary Pete Hegseth, in an interview with Fox News, said, \"We won World War I and World War II not with the Department of Defence but with the War Department \". It also showcased several elements of the American military. https://x.com/DeptofWar/status/1964063093484359918\nThe Department of War was originally established by President George Washington when he created the Army. The name was later changed in 1949 during President Harry Truman's broader reorganisation of the military.\nTruman signed the National Security Act in 1947, merging the Department of the Navy, the newly created Department of the Air Force, and the Department of the Army -- previously the Department of War -- into the National Military Establishment, led by a civilian Secretary of Defence. In August 1949, the establishment was renamed the Department of Defence, according to CNN.\nThe same act also created the Joint Chiefs of Staff as an advisory body to the president on military planning and strategy.\nCNN further reported that the latest move comes as part of Hegseth's broader efforts to restore older military traditions. He has reversed Biden-era decisions to remove Confederate-era names from bases like Fort Bragg and Fort Hood, instead reinstating the names but officially attributing them to different individuals.\nIn June, Hegseth also ordered the renaming of a Navy oiler ship that had been named after gay rights activist and Navy veteran Harvey Milk. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  US President Donald Trump on Friday (US local time) officially signed an Executive Order which reverted the Department of Defence's name to the Department of War.","url":"https://www.latestly.com/agency-news/world-news-us-trump-signs-executive-order-pentagon-to-be-now-known-as-department-of-war-7096378.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250905213148.jpg","video":null,"publish_date":"2025-09-06 00:26:23","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.085},{"id":357842510,"title":"ANDREW NEIL: The rise of State capitalism. Politically motivated vendettas. Rule by executive order. The National Guard on the streets... How Trump's America is getting more like China","text":"Imagine a powerful president who grabs chunks of private enterprise for the state, forces companies to invest more at home by threatening penal tariffs if they don’t, expands big government while cocking a snook at rising debt, deficits and thinks nothing of constantly intervening in the workings of the market economy to advance what he considers to be the national interest.\n\nSuch a leader would have our own dear Corbynistas cheering him to the rafters, urging Keir Starmer to follow suit and act like proper socialists. But when that president is Donald Trump, who has done all of the above, the Corbynistas are understandably quiet.\n\nYet their silence cannot mask one of the often-overlooked verities of our day: when it comes to economic policy, Right-wing populists like Trump have more in common with the Left than with true believers like Ronald Reagan and Margaret Thatcher. Under Trump, market capitalism – the basis of America’s power and prosperity – is being replaced by state capitalism in which big business does the bidding of big government.\n\nNot unlike China, you might say. And you would be right – which brings us to one of the great ironies of the 21st century. When China became part of the global trading system at the turn of the millennium there were many experts who hoped – even predicted – growing contact with the West would gradually turn the country more liberal and democratic.\n\nThat turned out to be a false dawn. China under President Xi is, if anything, more repressive today than before it began its climb to superpower status. What none of the experts foresaw – and it’s hard to blame them – is that America would become more like China. Yet that is precisely what is happening before our very eyes.\n\nUnconvinced? Consider Trump’s record in the eight short months since returning to the Oval Office.\n\nIntel, once the world’s premier chipmaker, is a shadow of its former self. The previous Biden administration did what the Left usually does with ailing big business: subsidised it with billions of taxpayers’ dollars. A president who believed in the market economy would have pulled the state props away. Not Trump. He turned the Biden largesse into a 10 per cent equity stake in Intel for the federal government.\n\nIntel was given no choice. Its hapless boss, only recently dismissed as useless by Trump, was forced to appear with Trump’s commerce secretary and welcome the federal government’s unwanted $10 billion ‘investment’, looking for all the world like he’d been taken hostage. In a sense he has. Trump will now call the shots at Intel whenever he pleases.\n\nOf course, as is often the case, the state has taken a stake in failure. Nvidia is now the leading US chipmaker, especially in artificial intelligence, with a market value of $4 trillion versus Intel’s ‘mere’ $100 billion. But Trump has his sticky fingers in that, too. He only agreed to an export licence for Nvidia (and AMD, another giant chipmaker) to sell chips to China in return for a 15 per cent cut of the revenues for the Treasury, somehow overcoming previous national security fears about exporting such technology to Beijing.\n\nLike Intel, Nvidia and AMD were left with no choice. But their vulnerability to Trump’s whim is nothing compared with how he has Apple, the famous global giant, by the short and curlies. Trump threatened it with penal tariffs of up to 100 per cent on iPhones and other products it exports to America unless it relocated more of its manufacturing, most of which is in China, to the US.\n\nApple’s chief, Tim Cook, was forced to agree through gritted teeth to another $100 billion of investments in the US on top of the $500 billion over the next four years he’d already announced to placate Trump. Nobody knows if investment on this scale will ever materialise. Trump seems happy for now. But Cook fears Trump will be back for more. Indeed his appetite for state capitalism is insatiable.\n\nEarlier this year he acquiesced to Nippon Steel’s takeover of US Steel only when the Japanese firm agreed to a government ‘golden share’ in the new company. Since Trump also controls the tariffs it will face from overseas competitors, the President has quite the power to make it do his bidding.\n\nThere are more corporate shakedowns in the pipeline. MP Materials, a Nevada-based miner of rare-earth metals, will soon have the Pentagon as its biggest shareholder, on receipt of substantial government aid. Apple has agreed to buy $500 million of rare earth magnets from it, though nobody knows if it would have done so without the constant need to appease Trump. Now you see how state capitalism works.\n\nTrump’s power grab doesn’t stop with corporations. He expects his writ to run everywhere. He has spent months trying to undermine and remove the chairman of the Federal Reserve, which sets interest rates independent of the government, because he wants quicker and deeper rate cuts. He fired the boss of the Bureau of Statistics because he didn’t like the figures she was producing (it’s made no difference — yesterday’s US jobs numbers were dire).\n\nBut it’s not just in economic matters that Trump is aping China. Even more worrying is his tilt towards too many aspects of authoritarian states. China, like all other dictatorships, is awash with nepotism, sycophancy, vendettas against rivals, repression of opponents and the use of military force to keep the population in line. Trump is assiduous in the pursuit of all of that.\n\nJust as China has its ‘red princes’, the privileged offspring of Chinese Communist Party bosses who have accumulated tens of billions over the years for their own use, America has the Trump family, which has enriched itself during Trump’s second term (over $2 billion in the first 112 days by some calculations) through cryptocurrency ventures, international real estate deals, increased profits at properties like Mar-a-Lago, exclusive membership clubs, legal settlements, inauguration funds, Trump merchandise and even a luxury jet from Qatar.\n\nTrump has populated his team with sycophants dedicated to doing his bidding and always ready to feed his narcissism, as those nauseating televised cabinet meetings sickeningly show. One of the worst is Kash Patel, the FBI director, whose 2023 book ‘Government Gangsters’ contained an ‘enemies list’ of 60 who had supposedly tried to thwart Trump.\n\nPatel, in best secret police fashion, seems to be working through the list on Trump’s behalf. John Bolton, Trump’s former national security adviser who departed on bad terms and wrote a critical book about the President, has just had his house raided by the FBI in pursuit of classified documents supposed to be in his possession (ironic given Trump’s cavalier handling of secret material at Mar-a-Lago).\n\nBolton joins a growing roll-call of Trump critics targeted for retaliatory federal investigations, such as James Comey, former FBI director, John Brennan, former CIA director, and Miles Taylor, an ex-senior homeland security official, all of whom crossed Trump.\n\nThe list goes on. Unable to force out the chairman of the Fed, Trump has tried to fire a Fed governor, Lisa Cook. She has refused to go quietly. So the administration is looking at criminal charges against her. Nor has he given up on ousting the chairman. Trump’s people are looking at a lawsuit against him for an overrun in the cost of renovating the Fed’s headquarters.\n\nNobody is safe. New York State attorney general Letitia James faces a federal criminal investigation involving properties she owns in two states. James was one of several legal officers pursuing Trump for various infractions. The case she brought against him cost $500 million. No surprise Trump wants revenge.\n\nPolitically motivated vendettas. Revenge against opponents. Rule by executive order. The National Guard deployed on the streets of the nation’s capital and soon, perhaps, other major cities too. State capitalism trumping the market economy. These have become the hallmarks of Trump’s second administration, which increasingly amounts to the Sinofication of America.\n\nOf course there is a case for some of what he’s attempting under, and some will say he’s only doing to others what they tried to do him. Perhaps. But America’s greatness is based on its reputation for freedom and belief in the market economy. America will not be made great again by undermining either — and certainly not by ditching both.","summary":"Imagine a powerful president who grabs chunks of private enterprise for the state and forces companies to invest more at home by threatening penal tariffs if they don't.","url":"https://www.dailymail.co.uk/columnists/article-15070817/Trumps-America-getting-like-China.html","image":"https://i.dailymail.co.uk/1s/2025/09/05/20/101884057-0-image-m-151_1757101114518.jpg","video":null,"publish_date":"2025-09-06 00:24:40","author":"Andrew Neil,Editor","authors":["Andrew Neil","Editor"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.202},{"id":357841422,"title":"World News | We Have Had Progress in Ariha Shah Case, Temple Visits Arranged: MEA","text":"New Delhi [India], September 6 (ANI): The government on Friday said that there has been progress in the matter concerning Ariha Shah, the Indian child under foster care in Germany, and it is doing several other things to ensure that her upbringing happens in a cultural environment that is conducive to her.\nAnswering queries during weekly briefing, Ministry of External Affairs spokesperson Randeep Jaiswal said that the matter was raised when the German Foreign Minister was in the country. Also Read | 'Looking Forward to Deepening India-Jamaica Bonds of Friendship': PM Narendra Modi Congratulates His Jamaican Counterpart Andrew Holness for His 3rd Consecutive Victory.\n\"This was raised when the Foreign Minister of Germany was here. It was also raised when External Affairs Minister visited Germany. We have had progress in this matter. We will shortly give you more details on that. But to tell you that the government attaches high importance to this particular matter. We have had consular visits,\" he said. \"The Embassy has been engaged with her, provided her books. We have arranged temple visits, and we are doing several other things to ensure that her upbringing happens in a cultural environment that is conducive to her, and for her full growth and development,\" he added.\nAlso Read | Donald Trump Trade Adviser Kevin Hassett Says US Disappointed by India's Russian Oil Imports, Hopes To Improve Ties.\nExternal Affairs Minister S Jaishankar had raised the issue of Ariha Shah during his talks with German Foreign Minister Johann Wadephul earlier this week.\n\"I raised the issue of Ariha Shah, an Indian child who has been in the foster care of German authorities for some time. I underlined to the minister that it is essential her cultural rights are ensured and that she grows up in Indian surroundings. This matter needs to be resolved without further delay, and we had some discussions on this today,\" he said.\nAriha Shah was put under the custody of German foster care in September 2021, when she was seven months old, after her grandmother accidentally hurt her. Since then, she has remained in foster care in Germany,\nThe Indian government has consistently pursued the matter with German authorities, maintaining that the child's linguistic, cultural, and social environment is crucial for her growth. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The government on Friday said that there has been progress in the matter concerning Ariha Shah, the Indian child under foster care in Germany, and it is doing several other things to ensure that her upbringing happens in a cultural environment that is conducive to her.","url":"https://www.latestly.com/agency-news/world-news-we-have-had-progress-in-ariha-shah-case-temple-visits-arranged-mea-7096376.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250905211339.jpg","video":null,"publish_date":"2025-09-06 00:24:23","author":null,"language":"en","source_country":"in","sentiment":0.027},{"id":357842716,"title":"Conor McGregor Teases Return with Two-Word Message Amid UFC White House Date Shift","text":"The UFC White House event scheduled for next year is shaping up to be the biggest spectacle the Las Vegas-based promotion has ever delivered. The historic card was first announced by U.S. President Donald Trump in July, who revealed that Dana White would bring the Octagon to the South Lawn of the White House to celebrate the July 4th weekend in 2026, an occasion that also marks America’s 250th anniversary of the Declaration of Independence. Recently, White went live to unveil blockbuster fights for UFC 321 and UFC 322, while also confirming that preparations for the White House event are officially underway. However, new reports suggest a major shift in plans.\n\nUFC White House Spectacle May Land in June 2026 Instead of July\n\nAccording to the Wall Street Journal, the White House card will still happen but could take place one month earlier in June 2026 instead of July, a change that could significantly impact how the event is staged and promoted. WSJ reported that ceremonial weigh-ins for the historic White House event will be staged at the Lincoln Memorial, while the fights themselves will take place on the South Lawn. \n\nEarlier discussions even considered fighters making their walkouts from the Oval Office. According to the report, fighters may warm up inside 1600 Pennsylvania Avenue, with giant screens set up nearby for fans. A week of festivities at the National Mall is also being discussed, along with fireworks and light shows to cap off the spectacle.","summary":"The UFC White House event scheduled for next year is shaping up to be the biggest spectacle the Las Vegas-based promotion has ever delivered. The historic card was first announced by U.S.","url":"https://www.yardbarker.com/mma/articles/conor_mcgregor_teases_return_with_two_word_message_amid_ufc_white_house_date_shift/s1_17666_42694160","image":"http://res.cloudinary.com/ybmedia/image/upload/c_crop,e_improve,h_1123,w_2000,x_0,y_6/c_fill,f_auto,h_1215,q_auto,w_2160/v1/m/b/4/b42514d0b95532e0c69b4666a1e85199293e4729/march-8-2024-austin-tx-conor-mcgregor-speaks.jpg","video":null,"publish_date":"2025-09-06 00:21:02","author":"Kshitiz Kumar Singh,NY Fights","authors":["Kshitiz Kumar Singh","NY Fights"],"language":"en","source_country":"us","sentiment":-0.21},{"id":357841262,"title":"'Get Along Very Well With Modi; He's Great': Trump Praises PM But Deplores India-Russia Oil Trade","text":"US President Donald Trump has expressed his disappointment over India’s continued import of oil from Russia despite ongoing global tensions linked to the Ukraine war. Trump criticised the scale of India’s energy trade with Moscow, stating he was “very disappointed” by the volume of oil purchases.\n“I was very disappointed that India is buying a lot of oil from Russia. That’s not helping the situation,” he added, referring to the broader geopolitical implications of countries continuing business ties with the Kremlin amid Western sanctions.\nHowever, while voicing concern over policy, Trump made it a point to differentiate between governmental decisions and personal relationships. Reaffirming his strong rapport with Prime Minister Narendra Modi, the President said, “I get along very well with Modi, as you know. He’s great.”\nHe went on to praise PM Modi’s leadership and spoke about the Prime Minister’s visit to the United States earlier this year. “He was here a couple of months ago. We had a great time,” Trump noted.\n\nHis remarks come in the backdrop of deteriorating ties between India and the United States over Trump’s 50% tariffs on Indian imports over Russian oil purchases and after Prime Minister Narendra Modi’s visit to China, where he met Chinese President Xi Jinping and Russian President Vladimir Putin.\n\nTrump also recalled the PM’s time at the White House. “We went to the Rose Garden and it was, the grass was so soaking wet. Such a terrible place to have a news conference. I said, let’s use a beautiful white stone emblematic of the White House. And it’s been very well received,” said the President. “But we had a news conference on the grass. That was my last news conference I had on the grass, because everybody sunk in. You probably sunk in, every reporter out there. They ruined their shoes. We made that change. It’s been a really well-received change.”\n\nTrump’s comments come at a time of uncertainty in India-US trade talks, especially after the sixth round of negotiations was recently called off. The two countries have conducted five rounds of negotiations so far, with access to India’s agriculture and livestock sectors appearing to be one of the major areas of contention.","summary":"He went on to praise PM Modi's leadership and spoke about the Prime Minister’s visit to the United States earlier this year","url":"https://www.news18.com/world/get-along-very-well-with-modi-hes-great-trump-praises-pm-but-deplores-india-russia-oil-trade-9552667.html","image":"https://images.news18.com/ibnlive/uploads/2025/04/Trump-tariffs-2-2025-04-fb5dd7008ab1042937b417ea5bed3a80.jpg","video":null,"publish_date":"2025-09-06 00:19:47","author":"News18,Pathikrit Sen Gupta","authors":["News18","Pathikrit Sen Gupta"],"language":"en","category":"politics","source_country":"in","sentiment":-0.149},{"id":357841140,"title":"Trump signs executive order to change name of the Pentagon","text":"Donald Trump signed an executive order to rename the Pentagon as the Department of War, stating it would indicate that America has “the strongest military.”\n\nThe name change is projected by Politico to cost taxpayers over $1 billion for rebranding agencies, global bases, stationery, and signage, although Trump downplayed the cost as “not a lot.” \n\nThis move reverses a decision from the late 1940s, following World War II, when the agency's name was changed from the Department of War to the Department of Defense. \n\nPete Hegseth, referred to as the “Now-Secretary of War,” supported the change, arguing that the US won both World Wars under a “War Department.” \n\nRepublicans have already introduced legislation in both the House and Senate to codify the name change, despite the Trump administration's previous vows to cut wasteful government spending.","summary":"","url":"https://www.independent.co.uk/bulletin/news/trump-department-of-war-pentagon-name-b2821308.html","image":"https://static.independent.co.uk/2025/09/05/20/34/SEI264804928.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/TL012jcu-4VHSaSK0.mp4","publish_date":"2025-09-06 00:18:55","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.47},{"id":357841430,"title":"World News | Exercise Yudh Abhyas 2025 Elevates India-US Strategic, Defence Partnership","text":"Washington, DC [US], September 6 (ANI): The 21st edition of Exercise Yudh Abhyas, comprising 450 personnel led by a battalion of the Madras Regiment training alongside US soldiers from the 1st Battalion, 5th Infantry Regiment (\"Bobcats\"), has become one of the largest bilateral military exercises for the Indian Army in terms of troops mobilised, a press release said.\nThe 21st edition of Exercise Yudh Abhyas, the premier annual Army exercise between India and the United States, commenced on September 1 at Fort Wainwright, Alaska, and will continue through September 14, as per an official statement by the Embassy of India in Washington. Also Read | 'Looking Forward to Deepening India-Jamaica Bonds of Friendship': PM Narendra Modi Congratulates His Jamaican Counterpart Andrew Holness for His 3rd Consecutive Victory.\nThe statement highlighted that the Indian Army contingent, comprising 450 personnel led by a battalion of the Madras Regiment, arrived in Fairbanks on August 31. They are training alongside US soldiers from the 1st Battalion, 5th Infantry Regiment (\"Bobcats\"), part of the 1st Infantry Brigade Combat Team (Arctic Wolves), 11th Airborne Division.\nThe statement highlighted that the 2025 edition is one of the largest bilateral military exercises for the Indian Army in terms of troops mobilised. The edition emphasises five areas, namely- mountain and high-altitude operations under sub-arctic conditions; heliborne and air-mobility integration, backed by artillery and aviation assets; electronic warfare, surveillance, and counter-drone systems; medical evacuation and combat casualty care in field conditions and live-fire tactical drills to validate seamless interoperability. Also Read | Donald Trump Trade Adviser Kevin Hassett Says US Disappointed by India's Russian Oil Imports, Hopes To Improve Ties.\nSince its inception in 2002 as a platoon-level exercise, Yudh Abhyas has expanded greatly both in scope and participation. Past editions have explored diverse terrains such as high-altitude warfare in India's Auli and Chaubattia; desert manoeuvres in Rajasthan; urban and cold environment training at Joint Base Lewis-McChord and Alaska.\nThe statement noted that Yudh Abhyas stands as a flagship, high-complexity Army-to-Army exercise. It has become one of the cornerstones of India-US military cooperation. India conducts more military exercises with the US than with any other country. These exercises, including Yudh Abhyas, Malabar, COPE India, Vajra Prahar, Tiger Triumph and several others, are central to building interoperability and forging mutual trust. It demonstrates how the two democracies continue to work towards peace, security and prosperity, including in the Indo-Pacific region. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The 21st edition of Exercise Yudh Abhyas, comprising 450 personnel led by a battalion of the Madras Regiment training alongside US soldiers from the 1st Battalion, 5th Infantry Regiment (&quot;Bobcats&quot;), has become one of the largest bilateral military exercises for the Indian Army in terms of troops mobilised, a press release said.","url":"https://www.latestly.com/agency-news/world-news-exercise-yudh-abhyas-2025-elevates-india-us-strategic-defence-partnership-7096371.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250905201332.jpg","video":null,"publish_date":"2025-09-06 00:16:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.382},{"id":357843420,"title":"Trillion dollar man: New pay package could make Musk that much richer if Tesla thrives","text":"The world’s richest man could become its first trillionaire if Elon Musk hits a series of extremely aggressive targets for his electric car company over the next decade, according to a proposed pay package released by the company.\n\nTesla said in a regulatory filing Friday that it will hand Musk shares worth as much as 12% of the company in a dozen separate packages if the company meets certain performance targets, including massive increases in car production, share price and operating profit. If approved by shareholders, the new pay package could make Musk the world’s first trillion dollar executive, and would mark a new level of outsized pay in a country already known for extreme compensation. But the payoff is in shares, not cash, and the goals are extreme as well.\n\nMusk overcame doubters to turn Tesla into the world’s most valuable car company, but he could face even steeper odds in hitting the targets set by the company’s compensation committee — not least because of Tesla’s main business of making electric vehicles is currently in a slump, in part because of Musk’s foray into right-wing politics.\n\n“It doesn’t matter how much money he gets. He can’t help himself,” said Telemetry analyst Sam Abuelsamid who follows Tesla stock, which has plummeted 27% from its December high. “And the more he talks, the more he turns off potential customers.”\n\nTo get his first package of shares equivalent to 1% of the company, Musk would have to convince investors in the stock market that Tesla is worth $2 trillion in total, double what they value it today, and also hit several other milestones. To receive all the shares offered and make him the world’s first trillion-dollar man would require that market value to then rise to $8.5 trillion, double that of the world’s most valuable company now, chipmaker Nvidia.\n\nAmong other goals, sales of all Tesla vehicles would eventually also have to reach 20 million, nearly triple its entire sales since it was founded more than two decades ago. Musk would also have to vastly expand Tesla’s robot and robotaxi businesses by selling a million of the bots and a million of the driverless cabs, the latter a business that has only begun to roll out its taxi service and is behind rivals, such as Waymo.\n\nMusk would also need to remain with Tesla for at least seven and a half years to cash out on any stock, and 10 years to earn the full amount.\n\nMusk has been one of the richest people in the world for several years. He is currently estimated to be worth more than $400 billion by Forbes magazine.\n\nA condition of the 11th and 12th tranches of the plan includes Musk coming up with a framework for someone to succeed him as CEO.\n\nThe plunge in Tesla sales this year was largely due to blowback over Musk’s affiliation with President Donald Trump. Tesla also faces intensifying competition from the big Detroit automakers and particularly from China.\n\nTesla sales have fallen precipitously in Europe after Musk aligned with a far-right political party in German. Sales plunged 40% in July in the 27 European Union countries compared with the year earlier even as sales overall of electric vehicle soared, according to the European Automobile Manufacturers’ Association. Meanwhile sales of Chinese rival BYD continued to climb fast, grabbing 1.1% market share of all car sales in the month versus Tesla’s 0.7%.\n\nWithout a reversal of those trends, meeting the financial goals could prove especially difficult. In its most recent quarter, Tesla reported that quarterly profits plunged from $1.39 billion to $409 million. Revenue also fell and the company came up short of even the lowered expectations on Wall Street.\n\nInvestors have grown increasingly worried about the trajectory of the company after Musk had spent so much time in Washington this year, becoming one of the most prominent officials in the Trump administration in its bid to slash the size of the U.S. government.\n\nEven bulls on the stock are not convinced the new pay incentive will keep Musk, who frequently posts on his X social media platform, from saying things that alienate potential buyers.\n\nSaid Wedbush Securities analyst Dan Ives, “Fixing the Musk brand damage remains a work in progress.” Even so, Ives told clients, “We believe this was the smart move by the Board as the biggest asset for Tesla is Musk.”\n\nIn January 2024, a Delaware judge threw out Musk’s previous pay package, worth $44.9 billion at the time. Investors voted to restore that compensation package at Tesla’s last shareholders meeting on June 13 of last year. But late last year the package was revoked for a second time. Tesla has appealed the ruling. Last month, Tesla said that it gave Musk a stock grant of $29 billion as a reward for years of “transformative and unprecedented” growth — despite the drop in sales and profits — and noting that the CEO hadn’t been paid in years.\n\nThe EV company is set to hold its annual shareholders meeting on Nov. 6, where investors will vote on the new pay package. Musk would also receive more voting power over Tesla under the proposed plan. Musk has said that he needed more shares and control so he couldn’t be ousted by shareholder activists. If he does hit all the goals, Musk would own about quarter of the company’s shares, up from 13% today.\n\nTesla’s stock nearly 3% in afternoon trading.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"The world&#8217;s richest man could become its first trillionaire if&#160;Elon Musk&#160;hits a series of extremely aggressive targets for his electric car company over the next...","url":"https://whdh.com/news/trillion-dollar-man-new-pay-package-could-make-musk-that-much-richer-if-tesla-thrives/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/02/image-2025-02-24T101433.649.jpg?quality=60&strip=color","video":null,"publish_date":"2025-09-06 00:14:47","author":"Associated Press,Michael Mahar","authors":["Associated Press","Michael Mahar"],"language":"en","source_country":"us","sentiment":-0.011},{"id":357842774,"title":"‘Treasonous’: GOP Rep Suspects Leak Behind Botched SEAL Mission In North Korea","text":"Former U.S. Navy SEAL officer and Republican Montana Rep. Ryan Zinke said Friday on CNN’s “The Lead with Jake Tapper” that he suspects there was a leak behind the botched SEAL mission in North Korea.\n\nThe New York Times published a story Friday revealing details of how a 2019 SEAL Team 6 Red Squadron operation to plant an electronic device in North Korea went wrong. While discussing the report, CNN’s Jake Tapper asked Zinke for his response, noting that Congress did not receive any information about the operation beforehand, according to the NYT. (RELATED: North Korea Built Secret Missile Base On Chinese Border Capable Of Striking US)\n\n“Deeply, deeply disturbing. World War II, loose lips sink ships. To disclose this type of operation, the leak had to come from somewhere. The details are too great,” Zinke said. “So this is treasonous to disclose because what it does is that there’s no doubt been multiple operations since then, and there probably will be.”\n\n“But when you disclose details of an operation like this, it puts at risk every SEAL, every warrior, every special operations, every soldier, sailor, airman, or Marine on future operations. It incurs greater risk,” Zinke added. “I think it was irresponsible for [The] New York Times to publish such an article. And what I’m hoping is, is they go back to the source, and they find the source, and they prosecute it.”\n\nAccording to the New York Times, the operation sought to plant an electronic device in North Korea to allow the U.S. to intercept the communications of North Korean leader Kim Jong Un. At the time, tensions between the two countries had escalated after nuclear talks collapsed during a February 2019 summit in Hanoi, Vietnam.\n\nThe SEAL team had allegedly prepped for months, but a North Korean boat appeared after they reached the country’s shore, prompting the SEALs to open fire and kill those on board, the NYT reported.\n\nIn addition to alleging that Congress had not been briefed before or after, the outlet also claimed President Donald Trump would have had to sign off on the mission directly due to its risks. Trump, during a press briefing Friday, denied having any knowledge of the operation.\n\n“I don’t know anything about it, no. I’d have to — I could look, but I know nothing about that,” Trump said.\n\nAt the time of the 2019 summit, Trump abruptly ended the meeting and opted not to reach an agreement with Kim, saying that North Korea wanted all sanctions lifted in exchange for denuclearizing only part of the areas the U.S. had demanded. After the talks collapsed, Trump became the first sitting U.S. president to set foot in North Korea during a face-to-face meeting with Kim.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Deeply disturbing'","url":"https://dailycaller.com/2025/09/05/gop-rep-ryan-zinke-suspects-leak-seal-mission-botched-north-korea/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-05-at-3.43.22 PM-e1757112551578.png","video":null,"publish_date":"2025-09-06 00:13:26","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.177},{"id":357837880,"title":"Watch: Ex-VP Mike Pence says he has 'great concerns' over Trump's tariffs","text":"Former Vice-President Mike Pence says he has \"great concerns\" over Donald Trump's unilateral tariffs. \n\nIn an interview with BBC Newsnight discussing a range of topics, Pence said he would \"like to see negotiations\" around lowering the levies. \n\nPence served as VP during Trump's first term in office.","url":"https://www.bbc.com/news/videos/cz7rjp0j4e4o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/cb21/live/e9a7ae10-8aa6-11f0-b391-6936825093bd.jpg","video":null,"publish_date":"2025-09-06 00:12:48","author":null,"language":"en","source_country":"gb","sentiment":0.066},{"id":357837874,"title":"Angola: The notorious prison being used in Trump's immigration crackdown","text":"The Department of Homeland Security has opened up a new immigration detention facility inside the Louisiana State Penitentiary, known as Angola. \n\nThe detention centre is designed to hold more than 400 undocumented immigrants convicted of serious crimes, including murder and rape. \n\nAs of Tuesday, 51 detainees had already arrived, according to US Immigrations Customs and Enforcement. \n\nThe BBC's Nick Beake explains Angola's notorious reputation, and how it fits into US President Donald Trump's immigration crackdown. \n\nProduced by Eloise Alanna, Alex Foster and Blanca Estrada\n\nFilmed by Meiying Wu","url":"https://www.bbc.com/news/videos/ckg39j10558o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/dd90/live/a7f4c750-8aa1-11f0-9cf6-cbf3e73ce2b9.jpg","video":null,"publish_date":"2025-09-06 00:12:48","author":"Eloise Alanna","authors":["Eloise Alanna"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.277},{"id":357842232,"title":"Barron Trump goes missing for first week of classes at NYU","text":"The NYU ladies’ man is reportedly MIA.\n\nBarron Trump was expected to start his sophomore year of studies at New York University’s Greenwich Village campus Tuesday, but was absent for the first week of classes.\n\nSeveral campus security officers confirmed President Donald Trump and First Lady Melania Trump’s son’s absence to People Friday.\n\n“From what I was told,” one officer shared, “he’s doing a semester at another NYU campus.”\n\nOfficials did not clarify with the outlet which campus Trump has transferred to due to security reasons. However, NYU’s other degree-granting campuses are located in Downtown Brooklyn, Abu Dhabi and Shanghai. The school also has learning centers in Los Angeles and Washington, D.C.\n\nPage Six has reached out to the White House for comment, but did not receive an immediate response. \n\nLast year, Trump, 19, relocated to Trump Tower in Manhattan to attend NYU’s Stern School of Business.\n\nBut even without being on campus, the first son still has a way of figuring out what is going on in classes through his friends.\n\nAs Page Six previously reported, the president’s scion has been talking with friends on the gaming platform, Xbox.\n\n“He has added it to his repertoire,” said the source. “It’s his communication platform of choice.”\n\nIt was also reported that Trump was talking to his classmates via Discord, the chat app for gamers. \n\nThe insider told us the tall now-sophomore chats via the gaming platforms because he cannot give out his phone number due to security reasons, and to keep his number from getting out to the public.\n\n“It’s his work around,” said the source. “He’s still trouble shooting.”\n\nThe insider also made it clear that Trump is only talking to people he personally knows on the platform and not giving his info out to strangers. \n\n“It’s gamer bro culture, they ask each other for their gamer tag,” said the insider. “He knows the people.”","summary":"The sophomore was expected to start his second year of studies Tuesday, but he was absent from NYU's Greenwich Village campus.","url":"https://pagesix.com/2025/09/05/celebrity-news/barron-trump-goes-missing-for-first-week-of-classes-at-nyu/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/09/110769527.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/tNHPA3kJ-guILbWnz.mp4","publish_date":"2025-09-06 00:10:39","author":"Breanna Bell,mliss1578","authors":["Breanna Bell","mliss1578"],"language":"en","category":"politics","source_country":"us","sentiment":0.035},{"id":357842448,"title":"World's biggest wind farm developer sees profits plunge... because summer wasn't windy","text":"The world's biggest wind developer has warned of a profits slump because the British summer was too warm and calm this year.\n\nDanish firm Orsted, which has 12 wind farms in Britain which generate 7 per cent of the country's electricity, became the latest to bemoan slowing speeds amid worries over the UK's energy strategy.\n\nThe company said it now expects annual profits this year between £2.8 billion and £3.1 billion, compared to previous hopes of between £2.9 billion and £3.25 billion.\n\nIt said the 'primary driver' for this was 'the impact from the lower-than-normal offshore wind speeds' across its sites, which include Hornsea 2, the world's largest offshore wind farm, off the Yorkshire coast.\n\nIt is the latest cause for concern over the country's energy strategy after Ed Miliband's Net Zero ambitions were last week blamed for a shock rise in energy bills that will see millions pay more this winter.\n\nRegulator Ofgem said 'policy costs' imposed by the energy secretary have contributed to the price cap rising at double the rate forecast by industry analysts.\n\nHouseholds will pay more to switch off wind turbines when they are generating too much power – as well as funding gas plants to step in when the wind is not blowing.\n\nAlthough it once had lofty ambitions to become the world's first renewable energy supermajor, Orsted 'seem to be going from one calamity to the next over the last few years', Ben Yearsley, investment consultant at Fairview Investing, said.\n\nIt won investor approval for almost £7 billion to help it fund projects in the US, which have been thrown into uncertainty by Donald Trump's backlash against wind. \n\nThe group also said yesterday it would take legal action in a bid to restart work on an offshore wind project that was halted by the US Government last month.\n\nTrump has long been a critic of wind, describing it as a 'very expensive, very ugly energy'. \n\nLast week, he warned that Mr Miliband's obsession with Net Zero was pushing electricity prices 'through the roof' in the UK.\n\nShadow energy secretary Claire Coutinho said: 'Ed promised to cut everyone's energy bills by £300 but bills will soon be £200 higher than when he took office – and his plans to make our energy system expensive and unreliable mean they're only going to keep going up. Cheap, reliable energy has to come first.'\n\nIt follows similar alarm bells over wind speed set off last month by German energy giant RWE. \n\nRWE blamed 'unfavourable wind conditions' for rising wholesale electricity prices in Europe and its declining profits.","summary":"Danish firm Orsted, which has 12 wind farms in Britain which generate 7 per cent of the country's electricity, became the latest to bemoan slowing speeds amid worries over the UK's energy strategy.","url":"https://www.dailymail.co.uk/news/article-15071401/Worlds-biggest-wind-farm-developer-sees-profits-plunge.html","image":"https://i.dailymail.co.uk/1s/2025/09/06/01/101891137-0-image-a-11_1757117143466.jpg","video":null,"publish_date":"2025-09-06 00:07:03","author":"Editor,Emily Hawkins","authors":["Editor","Emily Hawkins"],"language":"en","source_country":"gb","sentiment":-0.475},{"id":357842364,"title":"Amid Tariff Row, Trump Says \"Nothing To Worry About\" India-US Ties","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-says-nothing-to-worry-about-india-us-ties-amid-tariff-row-9225730\" on this server.\nReference #18.1d011002.1757120222.cb92b56\nhttps://errors.edgesuite.net/18.1d011002.1757120222.cb92b56","summary":"Calling India-US ties a \"very special relationship\", US President Donald Trump affirmed that he and Prime Minister Narendra Modi would always be friends, asserting that there is \"nothing to worry about\".","url":"https://www.ndtv.com/world-news/donald-trump-says-nothing-to-worry-about-india-us-ties-amid-tariff-row-9225730","image":null,"video":null,"publish_date":"2025-09-06 00:01:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":357837478,"title":"These Supreme Court justices want you to just shut up already","text":"Americans are not super fond of the Supreme Court right now, with approval ratings hovering near their lowest ever. \n\nNever fear, though. The conservative justices are here to set things right, and they know what it takes: a name change, a political adviser, and Bari Weiss. \n\nFirst up, Justice Brett Kavanaugh. Kav would like people to stop referring to the court’s emergency docket as the “shadow docket” and call it the “interim docket” instead. Um, why? Because not everything that the court decides on that docket is an emergency. \n\nKavanaugh is not fooling anyone here. This isn’t about wanting some precision in terms of emergency versus non-emergency docket actions. He’s just mad that people keep rightly criticizing the conservatives on the court for deciding things in the literal shadows—hence, the shadow docket nickname. \n\nKav and his colleagues have issued devastating rulings, with no briefing from the parties, no oral arguments, and no explanation for their decisions. \n\nWhy can the denizens of DOGE get your Social Security data? The court won’t tell you, but they can! \n\nWhy can President Donald Trump fire commissioners without cause, even though there is a 90-year-old Supreme Court case saying otherwise? The court won’t tell you, but he can! \n\nDespite the fact that the court’s conservatives have been nothing but handmaidens to fascism of late, giving Trump whatever he wants, Chief Justice John Roberts is busy lying to himself and everyone else by saying he doesn’t want the court to enter the political fray. \n\nRelated | Supreme Court couldn’t let the week go by without some treats for Trump\n\nOf course, you didn’t hear that from Roberts himself. No, that’s a statement from his political adviser, which is a thing that apparently Supreme Court justices have now?\n\nRoberts has a federal judge, Robert Dow, who serves as “counselor” to the chief justice. It looks like it is supposed to be more of a chief of staff role, but nonetheless, Dow has thoughts on behalf of Roberts, who he says doesn’t want to be pulled into any political conflicts. \n\nPer Dow, the courts have “a very tiny megaphone and if we use our megaphone too often, we risk losing what I would say is the long game, and the long game is to preserve our independence.” \n\nBrah. That independence ship sailed long ago, even before your boss invented a sweet, sweeping immunity for Trump. And while the lower courts have shown integrity and independence, your boss offers nothing but vague statements about how threatening judges is bad, mmmkay. \n\nMeanwhile, the court routinely overturns the lower courts with no explanation, sending a consistent message to Trump that whenever he races there, he’ll get what he wants. You’re not above the political fray, pal. You’re doing politics, pure and simple.\n\nNone of this phases Justice Amy Coney Barrett, who is busy on her book tour, with stops at conservative-friendly locations like the Richard Nixon Presidential Library and Barrett’s previous employer, Notre Dame. \n\nLast Thursday, Barrett did a softball interview with right-wing media grifter Bari Weiss, proprietor of the Free Press, founder of a pretend “university” in Texas, and possibly the new head of CBS News. Barrett, you will probably not be surprised to learn, doesn’t see anything wrong with, well, anything right now.\n\n“I think the Constitution is alive and well. I don't know what a constitutional crisis would look like,” she said. “I don't think that we are currently in a constitutional crisis, however. I think our country remains committed to the rule of law. I think we have functioning courts.”\n\nTo be fair, she’s right about one thing, which is that she really doesn’t know what a constitutional crisis looks like, because we’re deep into one. She also has no idea what a functioning court system looks like. The Supreme Court mostly exists these days to give Trump treats, constantly undermining the lower federal courts. \n\nAt root, none of these justices are seriously concerned about the Supreme Court. They’re unhappy about optics, but they’re not unhappy about their role in ushering in Trump’s king era. They just don’t think you should be nattering on about it so much.","summary":"Americans are not super fond of the Supreme Court right now, with approval ratings hovering near their lowest ever. \n\n\n\nNever fear, though. The conservative justices are here to set things right, and they know what it takes: a name change, a political adviser, and Bari Weiss. \n\n\n\nFirst up, Justice Brett Kavanaugh. Kav would like people to stop referring to the court’s emergency docket as the “shadow docket” and call it the “interim docket” instead. Um, why? Because not everything that the court decides on that docket is an emergency. \n\n\n\nKavanaugh is not fooling anyone here. This isn’t about wanting some precision in terms of emergency versus non-emergency docket actions. He’s just mad that people keep rightly criticizing the conservatives on the court for deciding things in the literal shadows—hence, the shadow docket nickname. \n\n\n\nKav and his colleagues have issued devastating rulings, with no briefing from the parties, no oral arguments, and no explanation for their decisions. \n\n\n\nWhy can the denizens of D","url":"https://www.dailykos.com/story/2025/9/5/2342020/-These-Supreme-Court-justices-want-you-to-just-shut-up-already?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1474965/story_image/AP25020744169073.jpg?1757102840","video":null,"publish_date":"2025-09-06 00:01:01","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.356},{"id":357842466,"title":"Trump is dead. That was the insane rumor millions believed. Now we unmask the man who sparked it all","text":"Falsehood flies, and truth comes limping after it.\n\nSo wrote the great satirist Jonathan Swift in 1710 - about three centuries before the rise of social media.\n\nHad he been alive to see this Labor Day weekend Swift may well have thought events beyond satire. Millions lost their minds and bought into a bizarre conspiracy theory that their leader, the most visible man in the country, had died or was close to it.\n\nAs it turned out, rumors of President Donald Trump's death were greatly exaggerated.\n\nBut the madness of the online crowd laid bare the growing power of left-wing influencers to light an online touchpaper.\n\nIt also showed how dangerous that could be for mainstream Democrats if they fail to distance themselves from the mob.\n\nPolitical analysts now believe the conjecture about the president's health was so highly offensive it could actually help Republicans in midterm elections in November, especially if Democrats continue to focus on the 79-year-old's age.\n\nRepublicans currently control both chambers in Congress but their position in the House is on an electoral knife edge. \n\n'Democrats will make a terrible mistake (in the midterms) if they move in this direction,' said one veteran pollster. 'This was really uncalled for and it's deeply offensive to most people, even people who who dislike Trump.\n\n'If it goes too far, Republicans would be foolish not to use it as an issue themselves because it would rile up the Trump base. And that's their problem in the midterm elections, Trump's not on the ballot. They've got to get the Trump people out to vote. Well, if you get mad enough about something like that, you'll go vote.'\n\nThe genesis of the disturbing 'Trump is dead' rumor demonstrated how extreme left-wing influencers were able to take a few crumbs and turn them into a loaf of bread.\n\nCrumb one was pictures of Trump in recent months with swollen ankles and a bruise on his hand.\n\nOn July 17, the White House announced he had chronic venous insufficiency, a benign and common condition, but was 'in excellent health.'\n\nThe second crumb came when an answer by Vice President J.D. Vance in an interview on August 27 was taken out of context and went viral.\n\nAsked if he was ready to take over the presidency, Vance said: 'If, God forbid, there's a terrible tragedy, I can't think of better on-the-job training than what I've gotten over the last 200 days.'\n\nA third crumb came as the president went uncharacteristically quiet after holding a three-hour public cabinet meeting on August 26.\n\nIt was then that the social media activity started in earnest.\n\nAnalysis shows that on August 28, when Trump had not been seen for two days, there were 915 mentions of 'Trump is dead' on X, Reddit, YouTube and the left-wing platform Bluesky.\n\nThose messages were engaged with in the form of likes, shares or comments 489,822 times.\n\nBut that spiraled and by September 3 the phrase had appeared 8,971 times on those platforms with 3,752,585, engagements.\n\nThe most seen posts were on X and one in particular was way out in front, racking up a staggering 13.9 million views, according to the social media intelligence platform Rolli IQ.\n\nIt appeared in the early hours of Saturday, August 30 and said: 'Trump is dead. He died on Wednesday.'\n\nThe post was made using the handle @lionel_trolling by John Ganz, the bestselling author of 'When the Clock Broke: Con Men, Conspiracists, and How America Cracked Up in the Early 1990s.'\n\nLater, on September 2, Ganz gave a detailed explanation of why he made the post in an article for his Unpopular Front newsletter, which was headlined: 'Confessions of a Disinformer - did I really start a massive hoax?'\n\nThe author outlined how he had been unable to watch a Mets game due to a broadcasting blackout, and instead took to X to tweet about Trump not having been seen for a few days.\n\nHe said his post 'seemed sort of funny to me. I didn't really have any intent while doing this. It was, in the parlance of our times, a s***post. And not even that, because that implies a desire to troll or disconcert.\n\n'I noticed that some of my funnier friends seemed to think it was funny and were liking it. (Some likes are better than others.) A success! I went to bed.'\n\nHe woke up to find he had hundreds of thousands of likes, and a lot of angry mentions.\n\n'The White House was putting out photos of Trump on his way to golf to prove he was alive. People were scouring Truth Social posts for signs of a ghostwriter. Did I cause all this?' he wrote.\n\n'Did I feel a sense of panic or regret at being the possible origin of mis or disinformation, for having momentarily raised or dashed the hopes of the millions of people who read it?' Ganz wrote. 'No, not really. Again, I thought it was funny.\n\n'Maybe this is a little nihilistic of me, but if they believed it, that was on them. F*** 'em if they can't take a joke, as a fella said.'\n\nGanz said the post had been 'nothing - barely even a thought.'\n\nHe added: 'This non-thought, this non-action, led to a whole fracas, a big upset, and it was me behind it.'\n\nThe author went on to quote Shakespeare, Tolstoy, and Kierkegaard as he analyzed the impact of social media.\n\n'In the mass democracy of social media, you too can be that idiot,' he wrote. 'Or, we can at least imagine ourselves to be the chief idiot for a day.'\n\nHe added: 'In a few days, I guarantee no one will remember it.'\n\nOther posts also went viral after being picked up by liberal influencers.\n\nOn August 29, a journalist in Washington D.C. made an innocuous post about Trump's schedule for the upcoming Labor Day weekend.\n\n'Trump has no public events scheduled all weekend. Don't believe he was seen today either,' she wrote.\n\nThe post was viewed millions of times after being picked up by a left-wing influencer X account called 'Did Donald Trump Die Today?'\n\nAnother post by an obscure sports fan in Boston, suggesting Trump had died, was also picked up by influencers and viewed six million times.\n\nMeanwhile, anti-Trump influencers also circulated a fake clip which, it was claimed, was from an episode of The Simpsons that aired over a decade ago.\n\nThe clip showed Trump at the White House clutching his chest and collapsing, and was widely shared as purported evidence that the show had predicted his death in August 2025.\n\nIn fact, there never was such an episode of The Simpsons and the clip itself was fake. Who created it remains unclear.\n\nOn Saturday morning, August 30, Trump was pictured heading to play golf, which the White House may have assumed would quash the rumors.\n\nA journalist also revealed that they had interviewed him behind closed doors for an hour the previous afternoon.\n\nBut, amid the online frenzy, liberal influencers piled in to dissect the photographs and offer opinions on the state of Trump's health.\n\nHarry Sisson, a Democratic Gen Z TikTok influencer, racked up millions views.\n\n'These photos are nor reassuring at all, he does not look good.' Sisson said. 'He just doesn't look healthy.'\n\nV Spehar, another TikTok podcast host with millions of views, said: 'As you know, we haven't seen Trump on video since his cabinet appearance. And there has been speculation that perhaps the president suffered a stroke.'\n\nConservative radio host John Fredricks then published a photo of himself with the president at his golf course in Sterling, Virginia on Sunday, but was inundated with claims it was fake.\n\n'It was just insane,' he said. 'It was out of like the Cartoon Network, the number of people that engaged in this and thought this photo was fake and somehow believed the president was dead, or sick or in the hospital, or he's not there. It was absolutely incredible.\n\n'I talked to him on Sunday, he looked and felt fabulous, we had a great conversation, he looked great he had just played 18 holes of golf.'\n\nD. Larry Sabato, Director of the Center for Politics at the University of Virginia, said Democrats should distance themselves from left-wing influencers making wild claims about the president's health.\n\n'I don't think they all understand that, at least from what I've seen, they're not reacting in the appropriate way, which is to say there's no room for that. Step out and say, knock it off, it doesn't help us at all, stick to the issues.\n\n'They certainly don't want this to dominate a (midterms) campaign. Most people are fair minded, they'll laugh it off at first, but if it continues, they'll say, you know, that's just rude, that has no place in politics.'\n\nHe said Democrats would also suffer if they focused on Trump's age in the midterms and tried to make him 'Biden 2.0.'\n\n'I think it's a mistake. You could talk about a gaffe or a misstatement, that's perfectly legitimate, but don't tie it to age.\n\n'The electorate in this country is also aging, and a lot of people will be offended by that. And by the way, older people turn out disproportionately in midterm elections.'\n\nThe question remains as to why the fake rumors about Trump's health took off so spectacularly on social media.\n\nAccording to medical sociologist Robert Bartholomew, author of 'Outbreak! The Encyclopedia of Extraordinary Social Behavior,' left-wing influencers succeeded by searching for signs to back up their claims, and then repeating them over and over again.\n\n'Rumors never appear out of thin air, they develop organically and spread within a specific context. The backdrop for the 'Trump is Dead' rumors was recent concerns over his health,' he said.\n\n'Influencers began to highlight Trump's recent absence from public engagements, expressing suspicion that something was amiss. An army of online commentators then went in search of evidence to support the theory, such as flags at the White House flying at half-staff. While this was true, it was in memory of a recent school shooting.'\n\nHe added: 'Repetition can also lend credence to these claims. In psychology, this is known as the 'illusion of truth' effect. Simply put, the more often claims are repeated, the more likely people are to believe them.'\n\nRepublicans united in slamming Democrats for spreading offensive lies about the president's health.\n\nBut the bizarre episode did include the faintest of whispers from MAGA world that the president might benefit from slowing down for a while, following a breathtaking first seven months.\n\nDuring that time he has successfully pushed his massive One Big Beautiful Bill through Congress, launched a massive immigration crackdown, and bombed Iran's nuclear facilities.\n\nAs one high-profile supporter put it, it might be time to 'take his foot off the gas' for a bit.","summary":"The genesis of the disturbing 'Trump is dead' rumor demonstrated how extreme left-wing influencers were able to take a few crumbs and turn them into a loaf of bread.","url":"https://www.dailymail.co.uk/news/article-15066639/Trump-dead-midterms-maga-backlash.html","image":"https://i.dailymail.co.uk/1s/2025/09/04/17/101844673-0-image-a-14_1757003928250.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/02/7970067745829308569/1024x576_MP4_7970067745829308569.mp4","publish_date":"2025-09-05 23:59:59","author":"Editor,Nick Allen","authors":["Editor","Nick Allen"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.317},{"id":357839778,"title":"ICE tells Kilmar Abrego Garcia he will be deported to Eswatini after claiming fear of persecution from 22 countries","text":"“Nonetheless, we hereby notify you that your new country of removal is Eswatini, Africa,” it said.\n\nThe Department of Homeland Security appeared to confirm the letter, mocking Abrego Garcia in a post on X and quoting the letter.\n\n“Homie is afraid of the entire western hemisphere,” it quipped.\n\nThe Washington Examiner reached out to ICE for confirmation and comment.\n\nThe announcement is a shift from the Department of Justice’s position stated last week, when it said the DHS would conduct a screening regarding his alleged fears of being deported to Uganda.\n\nAmong the 22 countries Abrego Garcia expressed fears about included Uganda, El Salvador, Mexico, Belize, Costa Rica, Guatemala, Honduras, Nicaragua, Panama, Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Venezuela, Cuba, the Dominican Republic, and Haiti.\n\nUGANDA TO ACCEPT DEPORTED US IMMIGRANTS WHO FEAR THEIR HOME COUNTRY\n\nEswatini was one of the countries that accepted U.S. deals to house deportees unrelated to the country to reduce stress on the U.S. immigration system. The tactics started with El Salvador and soon expanded to Costa Rica, Panama, Rwanda, Uganda, and South Sudan.\n\nThe Trump administration hopes to use the tactic to lighten the load on its strained immigration system, as President Donald Trump attempts to carry out the largest deportation operation in United States history.","summary":"Immigration and Customs Enforcement informed Salvadoran illegal immigrant Kilmar Abrego Garcia that he would be deported to the African country of Eswatini, after he claimed fear of persecution from 22 different countries. After the Trump administration tried to send Abrego Garcia to Uganda, the alleged MS-13 gang member claimed that he feared persecution or torture [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3795735/ice-kilmar-abrego-garcia-deported-eswatini-fear-of-persecution-22-countries/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25234691293535.jpg?w=696","video":null,"publish_date":"2025-09-05 23:59:40","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":0.05},{"id":357838798,"title":"Trump seeking ways to take over 9/11 memorial in NYC","text":"By PHILIP MARCELO\n\nNEW YORK (AP) — President Donald Trump’s administration said Friday that it is exploring whether the federal government can take control of the 9/11 memorial and museum in New York City.\n\nThe site in lower Manhattan, where the World Trade Center’s twin towers were destroyed by hijacked jetliners on Sept. 11, 2001, features two memorial pools ringed by waterfalls and parapets with the names of the dead, and an underground museum. Since opening to the public in 2014, the memorial plaza and museum have been run by a public charity, now chaired by former New York City Mayor Michael Bloomberg, a frequent Trump critic.\n\nThe White House confirmed the administration has had “preliminary exploratory discussions” about the idea, but declined to elaborate. The office noted the Republican pledged during his campaign last year to make the site a national monument, protected and maintained by the federal government.\n\nBut officials at the National September 11 Memorial & Museum say the federal government, under current laws, can’t unilaterally take over the site, which is located on land owned by the Port Authority of New York and New Jersey.\n\nThe U.S. government shouldering costs and management of the site also “makes no sense,” given Trump’s efforts to dramatically pare back the federal bureaucracy, said Beth Hillman, the organization’s president and CEO.\n\n“We’re proud that our exhibitions tell stories of bravery and patriotism and are confident that our current operating model has served the public honorably and effectively,” she said, noting the organization has raised $750 million in private funds and welcomed some 90 million visitors since its opening.\n\nLast year, the museum generated more than $93 million in revenue and spent roughly $84 million on operating costs, leaving a nearly $9 million surplus when depreciation is factored in, according to museum officials and its most recently available tax filings.\n\nNew York Gov. Kathy Hochul, meanwhile, voiced her own concerns about a federal takeover, citing the Trump administration’s recent efforts to influence how American history is told through its national monuments and museums, including the Smithsonian.\n\nThe takeover idea also comes just months after the Trump administration briefly cut, but then restored, staffing at a federal program that provides health benefits to people with illnesses that might be linked to toxic dust from the destroyed World Trade Center.\n\n“The 9/11 Memorial belongs to New Yorkers — the families, survivors, and first responders who have carried this legacy for more than two decades and ensured we never forget,” Hochul said in a statement. “Before he meddles with this sacred site, the President should start by honoring survivors and supporting the families of victims.”\n\nAnthoula Katsimatides, a museum board member who lost her brother, John, in the attack, said she didn’t see any reason to change ownership.\n\n“They do an incredible job telling the story of that day without sugarcoating it,” she said. “It’s being run so well, I don’t see why there has to be a change. I don’t see what benefit there would be.”\n\nThe memorial and museum, however, have also been the target of criticism over the years from some members of the large community of 9/11 victims’ families, some of whom have criticized ticket prices or called for changes in the makeup of the museum’s exhibits.\n\nTrump spokespersons declined to respond to the comments.\n\nIn all, nearly 3,000 people were killed when the hijackers crashed jetliners into the World Trade Center, the Pentagon and a field in southwest Pennsylvania during the Sept. 11 attacks. More than 2,700 of those victims perished in the fiery collapse of the trade center’s twin towers.\n\nFollow Philip Marcelo at https://x.com/philmarcelo","summary":"Trump pledged during his campaign last year to make the site a national monument.","url":"https://www.ocregister.com/2025/09/05/sept-11-museum-takeover/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/Sept_11_Memorial_Takeover_08450-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-05 23:59:19","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.061},{"id":357838926,"title":"Trump seeking ways to take over 9/11 memorial in NYC","text":"By PHILIP MARCELO\n\nNEW YORK (AP) — President Donald Trump’s administration said Friday that it is exploring whether the federal government can take control of the 9/11 memorial and museum in New York City.\n\nThe site in lower Manhattan, where the World Trade Center’s twin towers were destroyed by hijacked jetliners on Sept. 11, 2001, features two memorial pools ringed by waterfalls and parapets with the names of the dead, and an underground museum. Since opening to the public in 2014, the memorial plaza and museum have been run by a public charity, now chaired by former New York City Mayor Michael Bloomberg, a frequent Trump critic.\n\nThe White House confirmed the administration has had “preliminary exploratory discussions” about the idea, but declined to elaborate. The office noted the Republican pledged during his campaign last year to make the site a national monument, protected and maintained by the federal government.\n\nBut officials at the National September 11 Memorial & Museum say the federal government, under current laws, can’t unilaterally take over the site, which is located on land owned by the Port Authority of New York and New Jersey.\n\nThe U.S. government shouldering costs and management of the site also “makes no sense,” given Trump’s efforts to dramatically pare back the federal bureaucracy, said Beth Hillman, the organization’s president and CEO.\n\n“We’re proud that our exhibitions tell stories of bravery and patriotism and are confident that our current operating model has served the public honorably and effectively,” she said, noting the organization has raised $750 million in private funds and welcomed some 90 million visitors since its opening.\n\nLast year, the museum generated more than $93 million in revenue and spent roughly $84 million on operating costs, leaving a nearly $9 million surplus when depreciation is factored in, according to museum officials and its most recently available tax filings.\n\nNew York Gov. Kathy Hochul, meanwhile, voiced her own concerns about a federal takeover, citing the Trump administration’s recent efforts to influence how American history is told through its national monuments and museums, including the Smithsonian.\n\nThe takeover idea also comes just months after the Trump administration briefly cut, but then restored, staffing at a federal program that provides health benefits to people with illnesses that might be linked to toxic dust from the destroyed World Trade Center.\n\n“The 9/11 Memorial belongs to New Yorkers — the families, survivors, and first responders who have carried this legacy for more than two decades and ensured we never forget,” Hochul said in a statement. “Before he meddles with this sacred site, the President should start by honoring survivors and supporting the families of victims.”\n\nAnthoula Katsimatides, a museum board member who lost her brother, John, in the attack, said she didn’t see any reason to change ownership.\n\n“They do an incredible job telling the story of that day without sugarcoating it,” she said. “It’s being run so well, I don’t see why there has to be a change. I don’t see what benefit there would be.”\n\nThe memorial and museum, however, have also been the target of criticism over the years from some members of the large community of 9/11 victims’ families, some of whom have criticized ticket prices or called for changes in the makeup of the museum’s exhibits.\n\nTrump spokespersons declined to respond to the comments.\n\nIn all, nearly 3,000 people were killed when the hijackers crashed jetliners into the World Trade Center, the Pentagon and a field in southwest Pennsylvania during the Sept. 11 attacks. More than 2,700 of those victims perished in the fiery collapse of the trade center’s twin towers.\n\nFollow Philip Marcelo at https://x.com/philmarcelo","summary":"Trump pledged during his campaign last year to make the site a national monument.","url":"https://www.bostonherald.com/2025/09/05/sept-11-museum-takeover/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Sept_11_Memorial_Takeover_08450-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-05 23:59:19","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.061},{"id":357839728,"title":"Trump seeking ways to take over 9/11 memorial in NYC","text":"By PHILIP MARCELO\n\nNEW YORK (AP) — President Donald Trump’s administration said Friday that it is exploring whether the federal government can take control of the 9/11 memorial and museum in New York City.\n\nThe site in lower Manhattan, where the World Trade Center’s twin towers were destroyed by hijacked jetliners on Sept. 11, 2001, features two memorial pools ringed by waterfalls and parapets with the names of the dead, and an underground museum. Since opening to the public in 2014, the memorial plaza and museum have been run by a public charity, now chaired by former New York City Mayor Michael Bloomberg, a frequent Trump critic.\n\nThe White House confirmed the administration has had “preliminary exploratory discussions” about the idea, but declined to elaborate. The office noted the Republican pledged during his campaign last year to make the site a national monument, protected and maintained by the federal government.\n\nBut officials at the National September 11 Memorial & Museum say the federal government, under current laws, can’t unilaterally take over the site, which is located on land owned by the Port Authority of New York and New Jersey.\n\nThe U.S. government shouldering costs and management of the site also “makes no sense,” given Trump’s efforts to dramatically pare back the federal bureaucracy, said Beth Hillman, the organization’s president and CEO.\n\n“We’re proud that our exhibitions tell stories of bravery and patriotism and are confident that our current operating model has served the public honorably and effectively,” she said, noting the organization has raised $750 million in private funds and welcomed some 90 million visitors since its opening.\n\nLast year, the museum generated more than $93 million in revenue and spent roughly $84 million on operating costs, leaving a nearly $9 million surplus when depreciation is factored in, according to museum officials and its most recently available tax filings.\n\nNew York Gov. Kathy Hochul, meanwhile, voiced her own concerns about a federal takeover, citing the Trump administration’s recent efforts to influence how American history is told through its national monuments and museums, including the Smithsonian.\n\nThe takeover idea also comes just months after the Trump administration briefly cut, but then restored, staffing at a federal program that provides health benefits to people with illnesses that might be linked to toxic dust from the destroyed World Trade Center.\n\n“The 9/11 Memorial belongs to New Yorkers — the families, survivors, and first responders who have carried this legacy for more than two decades and ensured we never forget,” Hochul said in a statement. “Before he meddles with this sacred site, the President should start by honoring survivors and supporting the families of victims.”\n\nAnthoula Katsimatides, a museum board member who lost her brother, John, in the attack, said she didn’t see any reason to change ownership.\n\n“They do an incredible job telling the story of that day without sugarcoating it,” she said. “It’s being run so well, I don’t see why there has to be a change. I don’t see what benefit there would be.”\n\nThe memorial and museum, however, have also been the target of criticism over the years from some members of the large community of 9/11 victims’ families, some of whom have criticized ticket prices or called for changes in the makeup of the museum’s exhibits.\n\nTrump spokespersons declined to respond to the comments.\n\nIn all, nearly 3,000 people were killed when the hijackers crashed jetliners into the World Trade Center, the Pentagon and a field in southwest Pennsylvania during the Sept. 11 attacks. More than 2,700 of those victims perished in the fiery collapse of the trade center’s twin towers.\n\nFollow Philip Marcelo at https://x.com/philmarcelo","summary":"Trump pledged during his campaign last year to make the site a national monument.","url":"https://www.sandiegouniontribune.com/2025/09/05/sept-11-museum-takeover/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/Sept_11_Memorial_Takeover_08450-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-05 23:59:19","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.061},{"id":357835804,"title":"Trump Announces To Host 2026 G20 Summit At His Miami Golf Resort In Florida | Watch","text":"The United States will host the G20 summit in 2026, and the venue will be none other than Miami, Florida, specifically, the Trump National Doral resort. President Donald Trump made the announcement on Friday during a press briefing in the Oval Office, calling it a moment of pride for the country.\n“I’m thrilled to announce that the 2026 G20 conference will be held in one of our country’s greatest cities — beautiful Miami, Florida,” Trump said. He added that the summit would allow the US to showcase its achievements on a global stage. “I look forward to showing our successes to the rest of the world because America is the hottest country on earth,” he added.\n\n? @POTUS: “I’m thrilled to announce that the 2026 G20 conference… will be held in one of our country’s greatest cities — beautiful Miami, Florida.” pic.twitter.com/6fHNuvcsRj\n— Rapid Response 47 (@RapidResponse47) September 5, 2025\n\nTrump confirmed that the high-level meeting of the world’s largest economies will be held at his own property, the Trump National Doral resort and spa. Defending the decision, he described the resort as a practical and ideal location. “Everybody wants it there because it’s right next to the airport, it’s the best location, it’s beautiful — a beautiful everything,” said the President.\nAddressing concerns about personal financial benefit, Trump clarified, “We will not make any money on it. We’re doing a deal where it’s not going to be money, there’s no money in it. I just want it to go well.”\nThis will be the first time in two decades that the G20 summit will take place in the US. The last US-hosted G20 was held in Pittsburgh in 2009 under President Barack Obama.\nMiami Mayor Francis Suarez, who joined the President for the announcement, called it a “historic” moment for the city. “It puts the city on the map as one of the truly great global cities,” Suarez said, thanking Trump for selecting Miami. He also emphasised the economic boost expected from hosting the summit, calling it “a tremendous boom for the economy.”\nTrump echoed the sentiment, saying the event would bring in “millions and millions of dollars” to the US economy. He also noted that planning for the agenda is already underway.\nMeanwhile, Trump will not attend this year’s G20 summit in South Africa, and Vice President JD Vance is scheduled to represent the US.","summary":"Trump will not attend this year’s G20 summit in South Africa.","url":"https://www.news18.com/world/trump-announces-to-host-2026-g20-summit-at-his-miami-golf-resort-in-florida-watch-ws-l-9552666.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/Donald-Trump-pauses-trade-talks-2025-08-497af5b0536647c3c14a108c5a74c399.jpg","video":null,"publish_date":"2025-09-05 23:59:16","author":"New.storytailors,News18,World Desk","authors":["New.storytailors","News18","World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.011},{"id":357838796,"title":"Judge says in tentative ruling Huntington Beach can’t restrict children’s book access","text":"Huntington Beach can’t restrict minors from accessing books with sexual content in the city’s libraries, an Orange County judge said in a tentative ruling Friday, Sept. 5.\n\nThe decision stemmed from a lawsuit that some Huntington Beach residents and a local nonprofit filed against city leaders, alleging that efforts to restrict children’s books amounted to censorship that violates the state’s Freedom to Read Act.\n\nIn her ruling, Judge Lindsey Martinez directed the attorney for the group that brought the lawsuit to submit a writ of mandate in the next 30 days detailing how the city would have to comply with the law.\n\n“Today is a good day, the city lost and democracy won,” said Erin Spivey, a former librarian and one of the plaintiffs in the case.\n\nIn October 2023, the conservative majority of the Huntington Beach City Council directed librarians to relocate from the children’s section books containing sexually explicit material. The council also arranged to establish a community library board, made up of 21 members appointed by the councilmembers, that would be tasked with reviewing and blocking the purchase of books with content it deemed inappropriate. The board was never seated.\n\nThe definitions of “sexual” or “inappropriate” content provided in the ordinance have resulted in the library staff relocating books on puberty, sexual health and even potty training, Spivey said. Restricted titles, which included “It’s Perfectly Normal” and “Sex Is a Funny Word,” were placed on a shelf on the library’s fourth floor and could not be checked out without parental consent.\n\nIn February, Spivey and two Huntington Beach teenagers, alongside the transgender rights nonprofit Alianza Translatinx, sued the city for violating the Freedom to Read Act, which prohibits public libraries from banning books “because of the topics, views, ideas, or opinions contained in them.”\n\nFollowing a petition drive that forced a special election in June, Huntington Beach voters dealt a blow to the city’s policies by overwhelmingly approving measures to eliminate the community review board and bar the privatization of libraries.\n\nGiven the results of the election, the city’s attorney argued Friday that the court didn’t need to weigh in on policies that voters have repealed.\n\nCouncilmember Gracey Van Der Mark, who proposed the 2023 ordinance, said the city has “already taken proactive steps” to implement the measures that voters approved in June.\n\n“While we are disappointed in the court’s recent ruling, the city remains committed to upholding the democratic process,” she said in a statement. “This matter will be further reviewed and discussed with the city attorney during closed session.”\n\nHuntington Beach can appeal the court’s decision.\n\nA nonprofit law firm co-founded by President Donald Trump’s deputy chief of staff, Stephen Miller, represented Huntington Beach in the lawsuit.\n\nThe U.S. Supreme Court in June sided with a group of Maryland parents who wanted their children to opt out of classes with LGBTQ-themed books. Huntington Beach evoked the ruling Friday to question the constitutionality of the Freedom to Read Act — an argument the judge dismissed.\n\nSpivey said the writ of mandate will propose specific steps for Huntington Beach to take in order to comply with the state law, such as removing the “restricted books” list from the city library’s website and returning the books from the restricted area to the children’s section.\n\nSpivey also hopes that the library restores the Young Adult section, which she said was essentially dismantled, she said. “I’m hopeful that the library will decide to honor their teenage readers and return the YA section.”","summary":"An Orange County judge sided with Huntington Beach residents who sued the city for violating the state's Freedom to Read Act.","url":"https://www.ocregister.com/2025/09/05/judge-says-in-tentative-ruling-huntington-beach-cant-restrict-childrens-book-access/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/OCR-L-HBLIBELEC-0409-JG-10.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-05 23:58:54","author":"Claire Wang","authors":["Claire Wang"],"language":"en","category":"politics","source_country":"US","sentiment":-0.246},{"id":357841544,"title":"'Economic genius strikes again': Trump mocked for saying economy will improve in 2 years","text":"While running his third campaign for the White House in 2024, President Donald Trump promised that he would immediately jump-start the (already objectively strong) U.S. economy if elected.\n\n\"Starting on Day 1, we will end inflation and make America affordable again,\" Trump said at a Montana rally in August of last year. \"This election is about saving our economy.\"\n\nBut now that he's nearly eight months into his second term, Trump is moving the goalposts. During a press gaggle in the Oval Office, Trump suggested that Americans may have to wait until 2027 in order to see any significant improvement in the economy. His remarks came on the same day the August jobs report showed a disappointing 22,000 jobs created — roughly 50,000 fewer than initially projected.\n\nREAD MORE: 'Corrodes everything it touches': Republican lawmaker switches parties – and torches GOP\n\n\"We were on a very downward path with [former President Joe] Biden. And I heard the most we could was one percent GDP, and now I'm hearing 3.2 percent and three and a half percent,\" Trump said. \"And our big year won't bereally next year, I think it'll be the year after. Because when these plants start opening up — it takes a period of time to build them — we're gonna have tremendous job. It's unprecedented.\"\n\nThe president's comments quickly attracted a wave of ridicule on social media. Pennsylvania-based Democratic consultant J.J. Abbott mockingly tweeted: \"Golden Age (2027-??)\" in response to Trump's remark. Baseball writer Chris O'Leary sarcastically posted to his X account: \"Trump has to tank the economy so he can save it.\" Comedian Gabe Sanchez quipped: \"Surprised he didn't say two weeks,\" in reference to Trump's tendency to consistently estimate two-week timelines for major projects. Sports journalist Ryan McKinnell reminded his followers: \"the economy was booming before Trump took office.\"\n\n\"Then he tanked everything for Vladimir Putin,\" he added.\n\n\"Trump's economic genius strikes again, promising prosperity in 2027 after tanking it for everyone else in the meantime,\" progressive influencer Richard Angwin tweeted.\n\nREAD MORE: 'He was an FBI informant': Mike Johnson makes stunning admission about Trump","summary":"While running his third campaign for the White House in 2024, President Donald Trump promised that he would immediately jump-start the (already objectively strong) U.S. economy if elected.\n\n\"Starting on Day 1, we will end inflation and make America affordable again,\" Trump said at a Montana rally in August of last year. \"This election is about saving our economy.\"\n\nBut now that he's nearly eight months into his second term, Trump is moving the goalposts. During a press gaggle in the Oval Office, Trump suggested that Americans may have to wait until 2027 in order to see any significant improvement in the economy. His remarks came on the same day the August jobs report showed a disappointing 22,000 jobs created — roughly 50,000 fewer than initially projected.\n\nREAD MORE: 'Corrodes everything it touches': Republican lawmaker switches parties – and torches GOP\n\n\"We were on a very downward path with [former President Joe] Biden. And I heard the most we could was one percent GDP, and now I'm hearing 3.2 percent and","url":"https://www.alternet.org/trump-mocked-economy/","image":"https://www.alternet.org/media-library/image.jpg?id=61561399&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-09-05 23:58:32","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.094},{"id":357842454,"title":"He's no Elon! Melania spotted grimacing at Bill Gates as body language expert reveals First Lady was 'more tactile' with Tesla boss","text":"Melania Trump was spotted looking upset while Bill Gates was speaking during the president's dinner with tech CEOs this week.\n\nThe First Lady flashed a brief smile as the former head of Microsoft began to speak but quickly looked down before her lips curled into a noticeable frown.\n\nIt is a stark contrast to how she responded to Elon Musk when she first met him on the campaign trail with her husband, according to body language expert Judi James.\n\nJames zeroed in on an interaction between Melania, 55, and the Tesla CEO during President Donald Trump's October 2024 rally at Manhattan's Madison Square Garden.\n\nShe was seen kissing Musk on the cheek after he introduced her to the raucous crowd.\n\nAfter watching the interaction, James said the First Lady carried 'herself in a regal-looking way'.\n\n'She is more tactile, with the kiss on the cheek suggesting warmth, but also still very controlled, elegant and gracious,' James said. 'Musk uses gestures to help create this impression of her being very much the Queen Bee, even performing small bows.'\n\nNone of the warmth or closeness she had with Musk was present with Gates at the White House on Thursday, according to James.\n\nShe said Melania was still being courteous with the billionaire tech guru but also pointed out that she appeared to be in 'boardroom mode'. \n\n'There was a hint or a performance of a family-style warmth and acceptance back then for Musk but for Gates her look seems more official,' James said. \n\nInsiders have also commented on Melania's affinity for the richest man in the world. \n\nMonths before Trump and Musk's falling out this summer, sources close to Melania said she didn't mind how much time Musk was spending at Mar-a-Lago after the election.\n\nOne source from Palm Beach, Florida, told People that Melania was be happy to have a 'babysitter' for her husband adding that she makes the best of things she can't control.\n\nLittle is known about Melania's relationship with Musk now that he has largely been excommunicated from Trump's inner circle thanks to harsh criticism.\n\nHis ouster as the president's so-called 'first buddy' came after he claimed Trump was in the Epstein files. \n\nHe also called the Big Beautiful Bill a 'disgusting abomination', largely because it was projected to add $2.5 trillion to the deficit over the next 10 years.\n\nNot much is known about Melania's thoughts about Gates, but Trump's MAGA base certainly made their discontent with his invite to the tech summit known.\n\nGates generally draws the ire of MAGA for being a cheerleader for vaccine development during the COVID-19 pandemic.\n\nRobby Starbuck, a conservative commentator, raged that Gates was granted attendance at the White House.\n\n'It’s infuriating to see Bill Gates at the White House in a position of honor. I want a future where we stop giving power to evil people like Gates. He’s a globalist who hates the America First ideology. His God complex deserves nothing but contempt,' Starbuck wrote on X.\n\nThe pro-Trump WallStreetApes account, which has 1 million followers, wrote: 'Something has gone VERY wrong, tonight at the White House dinner. On the left: sitting next to Trump is Bill Gates. On the Right: Sitting next to Trump is Mark Zuckerberg. Bring back Elon Musk and Donald Trump unity'.\n\nAnother account expressed sympathy for Melania merely because she had to sit next to Gates.\n\n'Poor Melania had to sit by hybrid monster Bill Gates at tech dinner. Bless her,' the post read.","summary":"Melania Trump was spotted looking upset while Bill Gates was speaking during the president's dinner with tech CEOs this week. It's a stark contrast with how she's treated Elon Musk.","url":"https://www.dailymail.co.uk/news/article-15071045/melania-trump-grimace-bill-gates-tech-dinner-white-house.html","image":"https://i.dailymail.co.uk/1s/2025/09/06/00/101890205-0-image-m-19_1757114379943.jpg","video":null,"publish_date":"2025-09-05 23:58:05","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","source_country":"gb","sentiment":0.244},{"id":357836504,"title":"Trump Responds to Report on Failed SEAL Team 6 North Korea Mission","text":"President Donald Trump on Friday afternoon denied any knowledge of a reported 2019 botched SEAL Team 6 operation in North Korea, telling a reporter who asked him for a reaction that he was \"hearing it now for the first time.\"Newsweek reached out via email to the White House for clarification and further comment on Friday evening.Why It MattersThe purported mission would evidence the U.S. failing to achieve an intelligence objective against a country with which officials had engaged in sensitive diplomatic talks.The Pentagon and White House rarely—if ever—comment on any SEAL Team 6 missions.Trump has continued to seek talks with North Korea since returning to office for his second term, but has found the nation less receptive than during his first presidency. North Korean officials rejected a letter from Trump intended to open the door for dialogue.The ostensible goal for the talks would entail steps toward a peace deal between North and South Korea, ending a decades-long tense standoff between the neighboring nations.What To KnowThe New York Times on Friday released a report on a 2019 operation to plant a listening device that would have allowed the United States to intercept communications from North Korean leader Kim Jong Un at a time when the U.S. was holding high-level nuclear talks with the Hermit Kingdom.According to the Times, the operation did not pan out as planned once a boat started sweeping the water, prompting fears that the SEAL team had been spotted while heading for shore. The team opened fire, killing everyone on the boat, then retreating without completing the mission, per the report.Due to the extreme sensitivity of the mission, the Times said, it would have required Trump's direct approval.When asked about the mission during a press briefing in the Oval Office on Friday, Trump said: \"I don't know anything about it.\"\"I'd have to look, but I don't know anything about it,\" the president replied, adding, \"I'm hearing it now for the first time.\" The reporter had also asked if Trump had spoken with or engaged with North Korea since the purported incident, which he did not address.The Pentagon provided Newsweek with \"no comment\" when reached via email on Friday afternoon.The SEAL Team 6 Red Squadron—the same unit that killed Al-Qaeda founder and Sept. 11 mastermind Osama bin Laden—had been selected for the mission, and the team had practiced for months beforehand.What Is SEAL Team 6?SEAL Team 6 is the nickname given to the Naval Special Warfare Development Group, a component of the Joint Special Operations Command (JSOC). The team often undertakes classified missions on which neither the Pentagon nor the White House will usually offer comment.The group is the Navy's equivalent of the Delta Force, emerging to prominent public notice in the aftermath of bin Laden's killing.Journalist Sean Naylor, national security reporter for 20 years at Army Times, in 2015 published a book detailing the history of JSOC and some of its missions, like a 2008 mission during which SEAL Team 6 launched a raid from Afghanistan into Pakistan to find Al-Qaeda leaders.The Times also covered the release of the book, which has proved the most comprehensive, if unauthorized, look at the operations of a team that has \"engaged in combat so intimate that they have emerged soaked in blood that was not their own.\"\"Around the world, they have run spying stations disguised as commercial boats, posed as civilian employees of front companies and operated undercover at embassies as male-female pairs, tracking those the United States wants to kill or capture,\" the Times wrote.Trump Sought Nuke Deal With North KoreaTrump, during his first administration, attempted to engage in the same kind of deal-making that he has touted throughout his second term. During those first four years, he notched some considerable wins—most notably, the Abraham Accords between Israel and several Middle East nations.The president initially sought a nuclear weapons deal with North Korea, but settled for a 2018 signed joint statement, which laid out four goals for Kim to achieve: commit to establish new relations with the U.S.; build a lasting and stable peace regime on the Korean Peninsula; commit to work toward a complete denuclearization of the peninsula; and recover POW/MIA remains and repatriate them.The talks would have potentially proved a vital turning point in negotiations, but the coronavirus pandemic radically altered the trajectory of any such discourse. Once Trump left office, the possibility for any deal with the increasingly reclusive North Korea—which suffered greatly during the pandemic—turned more unlikely.","summary":"The purported 2019 effort would prove an intelligence failure, but the White House and Pentagon have rarely discussed SEAL Team 6 operations publicly.","url":"https://www.newsweek.com/seal-team-6-north-korea-mission-donald-trump-response-2125444","image":"https://d.newsweek.com/en/full/2717076/donald-trump-kim-jong-un-2019.jpg?w=1600&h=900&q=88&f=0d2a3959ae82e2d1b89683ea67fc484a","video":null,"publish_date":"2025-09-05 23:54:24","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.163},{"id":357841004,"title":"Trump stung by SCO optics","text":"THE Shanghai Cooperation Organisation (SCO) summit in Tianjing, followed by the grand military parade in Beijing’s Tiananmen Square, was all about optics and signaling. Looking at the reaction from the US and EU it would be safe to say that the messages hit bull’s eye.\n\nBut let’s first look closer to home. Before the summit, India’s Foreign Secretary Vikram Misri said India would be looking for a categorical condemnation of cross-border terrorism, which in common language means that India’s allegations against Pakistan are upheld.\n\nYou may recall in this column last week, there was a mention of the SCO principle of collective or indivisible security and once again that was upheld as both the Pahalgam terror incident and the Jaffar Express and the Khuzdar school bus terror attacks, in which many innocent lives were lost — with India blaming Pakistan for the first and Pakistan saying India was responsible for the second and third incidents — were condemned but neither country was named.\n\nDespite lack of success on this issue, as in the SCO foreign ministers meeting in June, Indian Prime Minister Narendra Modi was triumphantly holding hands with Russian President Vladimir Putin and laughing in videos captured of their stand-up chats with China’s strongman Xi Jinping.\n\n China may still not be militarily as strong as the US but it seems to be catching up fast.\n\nKnowledgeable sources suggested Mr Modi was keen to thumb his nose at the US and its ‘unreliable’ leader and his erstwhile friend President Donald J. Trump whom he has courted in the past, even raising the slogan, ahead of the US elections: Abki baar, Trump Sarkar (The next administration will be Trump’s).\n\nIndia is smarting at the ‘unfair’ 25+25 per cent tariffs with the latter being punitive for continued purchases of Russian oil when China and many other countries have not been penalised for their bulk oil/ energy procurement from Russia. But the size of the rapidly growing Indian economy, its human capital and enormous market means that despite its current tribulations, India won’t be ignored by either the US and its allies or the Global South for long. That is a certainty.\n\nMoving out of the region into the global arena, it was clear that the summit and the parade signalled what China sees as a return to a multipolar world and not the unipolar arrangement that evolved after the collapse of the Soviet Union and facilitated the massive eastward expansion of the Nato military alliance.\n\nThe Russian military assault and the war it triggered in Ukraine are attributed to that unipolar world, which meant initially that Moscow lacked the ability to stop the Western military alliance’s eastwards march. Later, however, after internal consolidation Russia started to flex its muscles first in Crimea and then in the Donbas region and made rapid advances in eastern Ukraine to pre-empt Nato’s further expansion.\n\nPresident Joe Biden pumped billions of dollars into the ideological military campaign directly and via the Nato members and slowed the pace of the Russian advance. With Trump’s assumption of office, all that changed as the new US president announced he wanted to end the war and that his friend Vladimir Putin was on board. So far it appears he got played by the Russian leader.\n\nIt was not surprising then that looking at the SCO summit and the grand spectacle put on display by the People’s Liberation Army in Beijing to mark the 80th anniversary of the Chinese victory over the Japanese military, Trump wrote a congratulatory message on his Truth Social platform and then said words that could be likened to a child throwing his toys out of the pram: “Give my warmest regards to Vladimir Putin, and Kim Jong Un, as you conspire against The United States of America.”\n\nChina’s response was measured as its spokesperson underlined the fact that the commemoration was to mark the end to World War II and that foreign guests had been invited for it. China said its development of diplomatic relations with any country is never directed against a third party.\n\nTrump’s political appointee as ambassador to Nato Matthew Whitaker seemed to have lost it in an interview with Fox News when, in a fit of rage, he accused China of putting on display lethal weaponry “in all likelihood stolen from us”.\n\nEU foreign policy chief, the former right-wing Estonian politician, Kaja Kallas also criticised the parade and said that Xi, Putin and Kim appearing together was part of efforts to build an anti-Western “new world order” and was a direct challenge to the international rules-based system.\n\nChina described the remarks by a “certain EU official” as being full of ideological bias, lacking basic historical knowledge and a blatant attempt to stir up confrontation. Beijing found the remarks misguided, utterly irresponsible and arrogant.\n\nIt was laughable that the hawkish EU foreign policy chief referred to the rules-based international system when she and her grouping has supported the Gaza genocide and the shredding of any so-called rules-based order by the apartheid state on a daily basis by the mass murder of civilians by bombs, missiles, drones and starvation.\n\nTo many an impartial observer, China’s awesome military display translated into the introduction of a semblance of welcome balance in our unipolar world. China may still not be militarily as strong as the US but it seems to be catching up fast as its various arms and armaments including new hypersonic missiles, stealth fighter-bombers, lasers and microwave air defence and unmanned aerial and submarine military vehicles displayed.\n\nOne hopes this doesn’t unhinge Trump completely. He should realise that his desire of winning the Nobel Peace Prize was nearly non-existent, because he greenlit and enabled the Gaza genocide, a grave crime against humanity. Equally, no end to the Ukraine war on terms unfavourable to Russia is now likely. Trump’s threatened tariffs and sanctions can cause pain but not in any decisive way.\n\nIt will be interesting to watch the White House’s next move. \n\nThe writer is a former editor of Dawn.\nabbas.nasir@hotmail.com\n\nPublished in Dawn, September 6th, 2025","summary":"THE Shanghai Cooperation Organisation (SCO) summit in Tianjing, followed by the grand military parade in Beijing’s Tiananmen Square, was all about optics and signaling. Looking at the reaction from the US and EU it would be safe to say that the messages hit bull’s eye.\n\n\n\nBut let’s first look closer to home. Before the summit, India’s Foreign Secretary Vikram Misri said India would be looking for a categorical condemnation of cross-border terrorism, which in common language means that India’s allegations against Pakistan are upheld.\n\n\n\nYou may recall in this column last week, there was a mention of the SCO principle of collective or indivisible security and once again that was upheld as both the Pahalgam terror incident and the Jaffar Express and the Khuzdar school bus terror attacks, in which many innocent lives were lost — with India blaming Pakistan for the first and Pakistan saying India was responsible for the second and third incidents — were condemned but neither country was named.\n\n\n\nDespite lack of s","url":"https://www.dawn.com/news/1940106/trump-stung-by-sco-optics","image":"https://i.dawn.com/large/2025/09/68bb70ad6ad1c.jpg","video":null,"publish_date":"2025-09-05 23:54:10","author":"Abbas Nasir","authors":["Abbas Nasir"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.23},{"id":357834664,"title":"Trump announces he’ll host 2026 G20 summit at his Doral resort","text":"U.S. President Donald Trump has made official his intention to host next year’s Group of 20 summit at his Doral resort in south Florida, with plans to curtail the attendee list and focus talks on the economy.Trump made the announcement Friday at an event at the White House. The theme of the summit, which will be held Dec. 14-15, 2026, will be 'Growth through Deregulation, Energy Abundance, and Innovation,” according to a White House official who detailed the plans on the condition of anonymity. The U.S. will streamline the summit to trim what had become a ballooning attendance list in recent years, in a bid to align the meeting with the founding G20 goals of growth and financial stability, according to the official.The summit — one of a series of high-profile international events the U.S. is hosting in 2026, when the nation will be celebrating its semiquincentennial — comes as Trump has looked to reshape the nation’s foreign policy approach. In recent months, Trump has imposed sweeping tariffs on allies and enemies alike, while seeking diplomatic engagement with traditional adversaries including Russian President Vladimir Putin and Chinese leader Xi Jinping.","summary":"The U.S. will also streamline the summit to trim what had become a ballooning attendance list in recent years, officials said.","url":"https://www.japantimes.co.jp/news/2025/09/06/world/politics/trump-g20-doral-resort/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/09/06/492146.jpg?v=3.1","video":null,"publish_date":"2025-09-05 23:49:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.372},{"id":357838600,"title":"Laura: Woke is being replaced by 'war'","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle September 05, 2025 05:28 \n\n Laura: Woke is being replaced by 'war' \n Fox News host Laura Ingraham discusses President Donald Trump's revival of the Department of War on 'The Ingraham Angle.'\n Tags POLITICSV-VIDEOTHE INGRAHAM ANGLECONFLICTS","summary":"Fox News host Laura Ingraham discusses President Donald Trump&apos;s revival of the Department of War on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6378554720112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/735ab887-4f9f-4409-b216-b7ea7718a64b/d2ca36f2-4cc6-4d5f-8eb2-2891c0d406ff/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-05 23:48:47","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.086},{"id":357838604,"title":"The Five - Friday, September 5","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode September 05, 2025 35:44 \n FULL EPISODE\n\n EXP 8 DAYS\n The Five - Friday, September 5 \n Donald Trump, Democrats, RFK\n Tags MOST RECENT EPISODES | VIDEOSTHE FIVE | FULL EPISODES","summary":"Donald Trump, Democrats, RFK","url":"https://www.foxnews.com/video/6378558964112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/eb9e2bda-d733-46ac-8eba-0307a0f1a61a/b62e8d7e-c16b-4379-87a2-5cab345515a1/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-09-05 23:48:11","author":null,"language":"en","source_country":"us","sentiment":-0.671},{"id":357834710,"title":"Japan’s Ninja-Like Market Surge Makes It a Top Investment Choice","text":"This year’s shock rise in Japanese shares is being called the ‘ninja stealth rally’. Since April, the Nikkei 225 and the more widely-based Topix stock market indices have climbed in a quiet manner that’s been compared to a legendary 15th-century Japanese ninja spy, remaining undetected while stalking a target.\n\nBut British investors looking to diversify are starting to notice that shares in such familiar Japanese businesses as electronics giant Sony and video games maker Nintendo have soared by as much as 40 per cent since January.\n\nThis is thanks to a trade deal with the US, but also signs of a major shift in Japanese corporate mindset. Stick-in-the-mud bosses are being compelled to embrace modernity.\n\nNoriyuki Takizawa, Japanese technology analyst at financial services group Fidelity, says: ‘It is an often-cited paradox that as the leader in robotics, Japan is also one of the few countries that still embraces the fax machine.’\n\nAsics, the athletics wear group, is also heading upwards. Since January there has been a 30p leap in the shares in this multinational corporation whose name is an acronym for the Latin anima sana in corpore sano (a sound mind in a sound body).\n\nThe brand owns Onitsuka Tiger, which has been one of the coolest footwear brands since its Mexico 66 yellow trainers were worn by Uma Thurman in the Quentin Tarantino film Kill Bill.\n\nAlso making strides has been Yonex, the sporting equipment maker. Its shares have jumped by 85 per cent this year, a feat attributed to an upsurge of interest in badminton.\n\nThe Nikkei, which stands at 43,018.75, could be 10 per cent higher this time next year, according to a Bloomberg survey of major fund managers. If you want to take a long-term bet on this trend, here’s what you need to know and the sectors to back.\n\nLAND OF THE RISING INDEX\n\nThe worldwide publicity attracted by the violent ups and downs of US stock markets in recent months is the main reason why there has been little focus on the ascent of Japan.\n\nBut Wall Street angst has been Japan’s gain, with American and other international investors seeking alternative homes for their money. Since January, they have committed about $35.7billion to Japanese shares.\n\nThese purchases accelerated following Donald Trump’s Liberation Day tariff announcements in April.\n\nAmong those snapping up shares has been the Berkshire Hathaway fund led by US investor Warren Buffett.\n\nThe fund has raised its stakes in Mitsubishi and Mitsui, increasing exposure to these sogo shosha, or trading houses founded in the 18th century.\n\nUnder the trade deal struck last month, Japanese exports to the US will be subject to a 15pc tariff, less than the 25 per cent previously threatened. The 15 per cent tariff rate also applies to cars – which may also seem like a reprieve although it could still prove a challenge for Honda, Nissan and Toyota – the world’s largest car manufacturer.\n\nThe apprehension over the headwinds faced by the auto industry underline that this is a controversial agreement, with strings attached.\n\nJapan has pledged to invest $550billion into various US industries such as artificial intelligence (AI), energy, shipbuilding and steel.\n\nCritics say Washington will have too much influence over Japan’s external investment strategy. But they also concede that Japan had not much room for manoeuvre.\n\nNervousness surrounds the deal. Nevertheless, investors remain confident that the rally will continue, driven by corporate reform.\n\nWILL IT BE DIFFERENT NOW?\n\nThe new, more positive perception of the prospects for Japan will come as a surprise to anyone who associates this nation with obdurate problems like deflation, an ageing population and a stagnant stock market. The Nikkei spent 34 years in the doldrums, only surpassing its 1989 peak of 38,916 at the beginning of 2024.\n\nDuring this period, many UK investors gambled on recovery but were disappointed. But hopes are more well-founded this time around. The improvement has been spurred by factors such as GDP growth and the emergence of inflation, which is above 2 per cent – a trend that has been greeted with a hurrah.\n\nTo the British, cheering inflation may seem strange. But deflation makes us keener to save than spend, which is bad for the economy. Wages are also improving, in another sign of a move away from culturally-ingrained norms. Asking for larger salaries or boasting about your earnings was not the done thing.\n\nJapanese companies used to be seen as bureaucratic and complacent. But this image is also fast disappearing. As Robert Burdett, of investment management company Nedgroup Investments, says: ‘Since World War Two, Japan has had 50 prime ministers compared to 15 in Britain.\n\n‘But this rapid pace of change was not reflected in corporate policy did not alter much until Shinzo Abe came on the scene.’\n\nAbe, who held office between 2012 and 2020, sparked the ‘Abenomics’ revolution which has shaken up businesses making them more efficient, and aware of the need to deliver shareholder value.\n\nBernard Chua, of American Century Investments, says: ‘Companies are setting higher profitability goals and returning capital to their shareholders.’\n\nHe adds that firms are also spending more on technology in which they have fallen behind global competitors, making Japan a ‘more investable opportunity’.\n\nSome investors may be perturbed by Japan’s level of national debt, which is equivalent to a seemingly terrifying 256 per cent of GDP, against 96 per cent in the UK and 106 per centin the US.\n\nBut almost all of these borrowings are funded locally, meaning that the country does not rely on possibly fickle foreign creditors.\n\nSuch is the growing conviction that these bonds offer value that David Roberts, the sector guru at Nedbank, has bought them for the first time in his career. This is a significant vote of confidence.\n\nCARS VERSUS SHOPPING\n\nWarren Buffett was an early cheerleader for the giant Japanese trading houses Itochu, Marubeni, Mitsui, Mitsubishi and Sumitomo, taking stakes in 2020.\n\nBuffett seems to have been drawn by the variety of these firms’ activities, ranging from chemicals and pharmaceuticals to salmon farming. Itochu owns the Family Mart chain of convenience stores, in which you can spend hours as a tourist marvelling at the different kinds of KitKat (apple, matcha and much more). Among Itochu’s other holdings is a slice of Paul Smith, the British fashion label beloved by the stylish Japanese.\n\nWhen Buffett made his first foray into the sector, sogo shosha shares were seen as undervalued. They now stand at 20-year highs. Hisashi Arakawa of investment company Aberdeen points out that tariffs may have an impact on the sector’s vast export activities, which suggests the shares are a ‘hold’ until there is more clarity on this issue.\n\nEmily Badger of the Man Group highlights the sectors that have been out of favour such as car manufacturers. She says: ‘Japanese car makers have faced challenges including competition from China, the move towards electrification and fears around a stronger yen. The possibility of high tariffs put the sector under even more strain – which means that these companies’ valuations are nearing historical lows. But we think there has been too much gloom about the prospects of companies like Honda and Nissan.’\n\nAgain, the effect of the tariffs is difficult to gauge but this could be a long-term play on Japan’s new willingness to adapt.\n\nSPREAD YOUR RISK\n\nThere are about 4,000 Japanese listed companies – fertile ground for stock picking. But researching their credentials is tricky. A fund or investment trust gives you exposure to a spread of domestic and export businesses.\n\nBurdett’s picks are Lazard Japan Strategic Advantage, WS Zennor Japan Equity Income and WS Morant Wright Japan, whose top holdings include Honda and Toyota. Baillie Gifford Japan and M&G Japan appear in many best-buy lists. In 2023 I put cash into Japanese funds and I am pleased with the results and persuaded that the future, although uncertain, could be bright.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThis year&#8217;s shock rise in Japanese shares is being called the &#8216;ninja&#8230;\n\n\nThis Post: Japan&#8217;s Ninja-Like Market Surge Makes It a Top Investment Choice first appeared on Internewscast Journal","url":"https://internewscast.com/business/japans-ninja-like-market-surge-makes-it-a-top-investment-choice/","image":"https://internewscast.com/wp-content/uploads/2025/09/rewrite-this-title-Ninja-stealth-rally-has-made-Japan-a.jpg","video":null,"publish_date":"2025-09-05 23:44:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.408},{"id":357837558,"title":"48% of Medicaid users are able-bodied healthy adults who ‘choose not to work,’ GOP congressman reports","text":"to top close Video This video is playing in picture-in-picture.\n\nMaria Bartiromos Wall Street September 05, 2025 08:58 \n\n 48% of Medicaid users are able-bodied healthy adults who ‘choose not to work,’ GOP congressman reports \n Rep. Jason Smith, R-Mo., unpacks the impacts of President Donald Trump’s ‘big, beautiful bill’ on ‘Maria Bartiromo’s Wall Street.’\n\nTags V-VIDEOSWHAT TO WATCHSHOWSPOLITICS","summary":"Rep. Jason Smith, R-Mo., unpacks the impacts of President Donald Trump’s ‘big, beautiful bill’ on ‘Maria Bartiromo’s Wall Street.’","url":"https://www.foxbusiness.com/video/6378559161112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/334e0fd1-691c-4ec8-9e4a-c969b28940fc/7271e29c-c2fb-484a-9966-18dd8b866973/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-05 23:42:44","author":null,"language":"en","source_country":"us","sentiment":0.156},{"id":357834422,"title":"Trump says U.S. in ‘very deep’ negotiations with Hamas, urges release of hostages","text":"U.S. President Donald Trump said on Friday (September 5, 2025) that Washington was in \"very deep\" negotiations with Palestinian militant group Hamas and urged them to release all hostages held in Gaza.\n\n\"We are in very deep negotiation with Hamas,\" Mr. Trump told reporters, saying the situation will be \"tough\" and \"nasty\" if Hamas continues to hold Israeli hostages.\n\n\"We said let them all out, right now let them all out. And much better things will happen for them but if you don't let them all out, it's going to be a tough situation, it's going to be nasty,\" Mr. Trump said, adding that Hamas was \"asking for some things that are fine.\"\n\nMr. Trump did not elaborate further.\n\nPalestinian militants took over 250 hostages into Gaza after an October 2023 attack in Israel that killed about 1,200 people, according to Israeli tallies.\n\nU.S. ally Israel's ensuing assault on Gaza has killed tens of thousands of people, internally displaced Gaza's entire population and prompted accusations of genocide and war crimes at international courts and from several rights groups. Israel denies the accusations.\n\nMr. Trump had promised a quick end to the war in Gaza during his presidential campaign but a resolution has been elusive.\n\nAbout 50 Israeli hostages are still being held by Hamas in Gaza, with 20 thought to be still alive.\n\nHamas has said it would release some hostages for a temporary ceasefire while Mr. Trump has repeatedly said he wants the release of all hostages.\n\nIsraeli Prime Minister Benjamin Netanyahu has said the war in Gaza would only end if all hostages were released, Hamas was disarmed, Israel established security control over the enclave and an alternative civilian administration set up. Hamas is demanding an end to the war and Israel's withdrawal from Gaza.","summary":"“We are in very deep negotiation with Hamas,” Mr. Trump told reporters, saying the situation will be “tough” and “nasty” if Hamas continues to hold Israeli hostages","url":"https://www.thehindu.com/news/international/trump-says-us-in-very-deep-negotiations-with-hamas-urges-release-of-hostages/article70017658.ece","image":"https://th-i.thgim.com/public/incoming/r9gv90/article70018278.ece/alternates/LANDSCAPE_1200/Israel_Palestinians_07166.jpg","video":null,"publish_date":"2025-09-05 23:41:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.402},{"id":357834666,"title":"Trump says India and Russia appear 'lost' to 'deepest, darkest China'","text":"Washington - U.S. President Donald Trump on Friday said India and Russia seem to have been 'lost' to China after their leaders met with Chinese leader Xi Jinping this week, expressing his annoyance at New Delhi and Moscow as Beijing pushes a new world order.'Looks like we've lost India and Russia to deepest, darkest, China. May they have a long and prosperous future together!' Trump wrote in a social media post accompanying a photo of the three leaders together at Xi's summit in China.Later on Friday, however, he told reporters he didn't think the U.S. had lost India to China.","summary":"\"Looks like we've lost India and Russia to deepest, darkest, China. May they have a long and prosperous future together!\" Trump wrote in a social media post.","url":"https://www.japantimes.co.jp/news/2025/09/06/asia-pacific/politics/trump-india-russia-china/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/09/06/492145.JPG?v=3.1","video":null,"publish_date":"2025-09-05 23:41:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.322},{"id":357834700,"title":"Two Teens Arrested in Murder of Capitol Hill Intern, Third Suspect Sought: DOJ, DC Police","text":"Two 17-year-olds were arrested in the murder of Capitol Hill intern Eric Tarpinian-Jachym. \n\nU.S. Attorney Jeanine Pirro identified two individuals, Jailen Lucas and Kelvin Thomas Jr., as the suspects. They have been charged with armed murder, classified as first-degree murder under D.C. law, and will face trial in an adult court.\n\nPirro mentioned that although Lucas and Thomas are juveniles, they have previous violent offenses in family court. She condemned D.C. leadership for supposedly being lenient towards juvenile offenders in the past, stating, “They don’t need protection; they must be held responsible, and we deserve protection.”\n\nFBI Director Kash Patel commented on the case, stating, “The murder of Eric Tarpinian-Jachym disturbed the nation’s capital, and today, justice is underway. Due to the persistent efforts of the FBI, MPD, and the Justice Department, the suspects are now in custody. This captures President Trump’s promise to restore safety to Washington, D.C.: ensuring law and order, accountability, and justice for victims,” he told Fox News Digital in an exclusive statement.\n\nAttorney General Pam Bondi also commented on the arrests, saying that if the suspects are convicted, “they will face severe justice.”\n\n“We hope that this provides some measure of solace to his family,” Bondi added in a statement.\n\nIn July, the House paid tribute to Tarpinian-Jachym with a moment of silence. Representative Estes commended the fallen intern, calling him a person who was “dedicated, thoughtful, and kind, with a deep love for our country.”\n\n“Eric was a warm and welcoming presence in my office, always greeting visitors with a smile,” Estes remarked on the House floor. “His absence will be deeply felt. We will always remember his presence and kindness. Those who met him during his brief time in my office will always remember him too.”\n\nTarpinian-Jachym is survived by his mother, Tamara; his father, Robert; his sister, Angela; and his brother, Jeremy.\n\nPresident Donald Trump’s strategy for addressing crime in Washington, D.C. has received both support and criticism, especially as National Guard troops have been deployed to patrol the streets.\n\nIn August, former Department of Government Efficiency employee Edward Coristine, best known by his online nickname “Big Balls,” was the victim of a violent attack in D.C. Two teenagers were subsequently arrested and charged in connection with his assault.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTwo 17-year-olds were arrested in the murder of Capitol Hill intern Eric&#8230;\n\n\nThis Post: Two Teens Arrested in Murder of Capitol Hill Intern, Third Suspect Sought: DOJ, DC Police first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/two-teens-arrested-in-murder-of-capitol-hill-intern-third-suspect-sought-doj-dc-police/","image":"https://internewscast.com/wp-content/uploads/2025/08/Mother-of-slain-congressional-intern-says-DC-Council-treats-violent.jpg","video":null,"publish_date":"2025-09-05 23:36:04","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.156},{"id":357842788,"title":"Hamas releases video showing Israeli hostages","text":"Hamas has released a video of two Israeli hostages who were seized from a music festival in Israel in October 2023, with one saying he is being held in Gaza City. \n\nGuy Gilboa-Dalal and Alon Ohel are two of 48 people Hamas is still holding in Gaza, where the Israeli military has launched a major offensive to wipe out the militant group.\n\nTwenty hostages are thought to still be alive.\n\nPalestinian militants took 251 hostages into the enclave after their 2023 cross-border attack on southern Israeli communities that killed about 1,200 people.\n\nThe video of the hostages features an exhausted-looking Mr Gilboa-Dalal speaking for about 3.5 minutes.\n\nHe says he and several other hostages are being held in Gaza City and he is afraid of being killed by Israel's offensive on the city.\n\nIn the video, dated August 28, Mr Gilboa-Dalal, aged 24, appears at times to be in the back seat of a car that is being driven around.\n\nAs the car passes by buildings, he identifies one as belonging to the Red Cross. Hamas has refused to allow the Red Cross to see the hostages.\n\nAt one point, Mr Ohel, 24, is also seen.\n\nThe ABC could not independently determine when the video was recorded.\n\nHostages who have filmed in similar videos and have since been freed have said their captors told them what to say.\n\n'Inhumane treatment'\n\nAfter the video was released, the Ohel family said they were shocked to see their relative's condition, in what was the first sighting of him since he was captured. \n\n“After consulting with eye specialists in Israel and around the world, it is clear that Alon has lost sight in his right eye,\" the Ohel family told the Hostages and Missing Families Forum on social media platform X. \n\nMr Gilboa-Dalal was seen in a video in February being forced to watch other hostages being freed under a temporary ceasefire. \n\nHuman Rights Watch has condemned Hamas and another militant group in Gaza for releasing videos of hostages, calling it inhumane treatment that amounts to a war crime. \n\nIsraeli officials have described the videos as psychological warfare.\n\nTens of thousands of Israelis have staged weekly demonstrations calling for an end to the war to secure the hostages' release. \n\nHundreds gathered on Friday at a public square in Tel Aviv to mark 700 days since the hostages were taken captive.\n\nMr Netanyahu's office said he had spoken with the parents of both hostages, and pushed for an all or nothing deal with Hamas requiring the militant group to release all the hostages and surrender.\n\nAfter the release of the video, Israeli Opposition Leader Yair Lapid took to X to urge Israeli negotiators to resume talks on a deal to secure the hostages. \n\nPrevious hostage releases were a result of diplomatic negotiations mediated by the United States and Arab states, but the last round of talks collapsed in July.\n\nUS President Donald Trump said on Friday Washington was in \"very deep\" negotiations with Hamas and he urged it to release all the hostages held in Gaza.\n\nHowever, Israel's far-right National Security Minister Itamar Ben-Gvir said Israel should respond by fully occupying Gaza.\n\nIsrael's military leadership has warned Mr Netanyahu against expanding the war, according to Israeli officials. \n\nFamilies of Israeli hostages and their supporters fear the attack could endanger the captives.\n\nHamas has said it would release some hostages in exchange for a temporary ceasefire. \n\nThe militant group has long offered to release all hostages in exchange for an end to the war and Israel's withdrawal from Gaza.\n\nIsrael bombs Gaza high-rise\n\nIsraeli Prime Minister Benjamin Netanyahu ordered the military last month to capture Gaza's largest urban centre, Gaza City, attacking what the government calls the last bastion of Hamas. \n\nAn Israeli military spokesperson said on Thursday that it now controlled about 40 per cent of the city, where about 1 million people lived prior to the war. \n\nThe military controls about 75 per cent of Gaza.\n\nOn Friday the Israeli military bombed a high-rise building in the city's west that it said was being used by Hamas. It said civilians were warned beforehand. \n\nThe military did not provide any evidence that militants were using the building.\n\nThe building's management issued a statement saying that it was being used for Palestinians displaced by the war. It denied that it had been used for anything other than civilian purposes.\n\nFootage showed the moment the building was struck. It collapsed moments after the impact, sending thick clouds of smoke billowing over nearby tent camps sheltering Palestinians.\n\nAcross Gaza, 30 Palestinians were killed by the military on Friday, including 20 in Gaza City, the Gaza Health Ministry said.\n\nMore than 64,000 Palestinians have been killed in Gaza since the war with Israel began, local health authorities say, with much of the enclave now in ruins and its residents facing a humanitarian crisis.","summary":"Hamas has released a video showing Israeli hostages Guy Gilboa-Dalal and Alon Ohel, who were captured during the militant group's October 7, 2023, attack. ","url":"https://www.abc.net.au/news/2025-09-06/hamas-releases-video-showing-israeli-hostages/105742948","image":"https://live-production.wcms.abc-cdn.net.au/4137cd74862c72020082415a3359b46a?impolicy=wcms_crop_resize&cropH=540&cropW=960&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-09-05 23:35:28","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.288},{"id":357839776,"title":"What is justice in the Epstein case?  ","text":"In the context of Washington and the news conference held in the shadow of the Capitol, there are two Epstein stories. Epstein Story A is Epstein’s criminal acts involving minors. Epstein Story B is what, if anything, Donald Trump had to do with it. If not for Epstein Story B, it is highly doubtful many people would be talking about Jeffrey Epstein today. \n\nThe women all said they want to see justice served. “I’m coming here because there’s been a severe miscarriage of justice, a delay in accountability,” said victim Jess Michaels in a group interview with NBC News, done the day before the news conference. “We are willing to do whatever we need to find justice,” said Liz Stein, another victim. “What we’re looking for out of this is justice, looking for accountability,” said Sky Roberts, brother of another victim, the late Virginia Giuffre. \n\nSo everyone agreed the goal is justice. But the main perpetrator in this case, Epstein, is dead, having killed himself in jail in 2019. Epstein’s sidekick, Maxwell, is in prison serving a 20-year sentence. What do the victims mean when they say they want justice?\n\nThey appear to mean that there are rich and famous men out there who abused them and who have not been named in relation to the Epstein case. They want the names made public and for accountability to follow.\n\nThat brings up the subject of Epstein’s “client list.” Many who feel passionately about the Epstein case have long believed that such a list, made by Epstein himself, exists, and that the Justice Department is covering it up. But in July the FBI announced that its “systematic review” of Epstein documents “revealed no incriminating ‘client list.’ There was also no credible evidence found that Epstein blackmailed prominent individuals as part of his actions. We did not uncover evidence that could predicate an investigation against uncharged third parties.” Others who have studied the case from the outside believe there is no list.\n\nNow, the Epstein victims say that if no list exists, they’ll make one. “Us Epstein survivors have been discussing creating our own list,” victim Lisa Phillips said at the news conference. “We know the names. Many of us were abused by them. Now, together, survivors, we will confidentially compile the names. We all know who were regularly in Epstein world. And it will be done by survivors, and for survivors. No one else is involved. Stay tuned for more details.”\n\nOn the other hand, on Wednesday, the victims had the attention of the world’s media. Why do they have to make a list? Why didn’t they reveal the names then and there? “Most of these individuals, the victims, are very scared to say these names because they could get sued,” said attorney Bradley Edwards, who has represented more than 200 Epstein victims. “They’re going to get attacked, and nobody protected them the first time.”\n\nOK. If the Justice Department is covering it up and the victims are afraid to speak, how are the names going to come out? At the news conference, Republican Rep. Marjorie Taylor Greene said she would do it herself. As a member of Congress, she is protected by the Constitution’s “speech or debate” clause for things she says on the floor of the House. “If they want to give me a list, I will walk in that Capitol on the House floor and I’ll say every damn name that abused these women,” Greene said at the news conference. “I can do that for them, and I’d be proud to do it.”\n\nThat would certainly be a scene. If the victims create a list, and if it has names of people who have not been publicly associated with the case, and if Greene reads it aloud on the House floor — that is a lot of ifs, but it would certainly raise many questions. Like, are the men guilty? Did law enforcement investigate their actions and decide not to charge them? If so, is it a good thing that a member of Congress is calling them pedophiles and rapists from the floor of the House of Representatives?\n\nYou’ll notice that all of the preceding discussion is about Epstein Story A, Jeffrey Epstein’s criminal acts involving minors. You’ll also notice that Epstein Story B, what, if anything, Donald Trump has to do with it, played little role in either the news conference or in the NBC interview. Perhaps that is because NBC’s Hallie Jackson asked the group this question: “Did anybody see or hear of [Donald Trump] himself doing anything inappropriate as it related to Jeffrey Epstein?” The group’s answer was: “No.” And that was that.\n\nWe know that Trump and Epstein were friends in the 1990s. There are pictures of them at social gatherings. One of the victims said Epstein bragged about being friends with Trump. But we also know that Trump and Epstein had a falling out in 2004, before Epstein’s earliest problems with the law, and had no known contact after that.\n\nAt the news conference, lawyer Edwards said that Trump, then a private citizen, actually helped the victims’ cause in the early years. “I can tell you that I talked to President Trump back in 2009 and several times after that,” Edwards said. “He didn’t think it was a hoax then. In fact, he helped me. He got on the phone. He told me things that were helping our investigation.”\n\nNote that Edwards mentioned Trump calling the current Epstein controversy a hoax, or, as Trump puts it, the “Democrat Epstein HOAX.” Trump posted on Truth Social Friday that, “This is merely another Democrat HOAX, just like Russia, Russia, Russia, and all of the others, in order to deflect and distract from the great success of a Republican president.” \n\nThe victims apparently took that to mean that Trump referred to the entire case as a hoax, as if the molestations did not happen. “I cordially invite you to the Capitol to meet me in person so you can understand this is not a hoax,” victim Haley Robson said at the news conference. “We are real human beings. This is real trauma.”\n\nWhat is going on here is that Trump, not surprisingly, is viewing the current Epstein brouhaha in a Trump-centric manner. When he calls it a hoax, he means that the accusations about him are a hoax. It is notable that he compared it to “Russia, Russia, Russia,” which was also a two-part matter. In that case, the two parts were 1.) what Russia did to try to disrupt the 2016 election, and 2.) whether Trump colluded with Russia. \n\nIn the Russia case, there was no doubt that Russia tried, ineffectively, to disrupt the election. But a long special counsel investigation failed to establish that collusion ever occurred, much less that Trump took part in it. So Trump feels, to this day, that he was the target of a hoax in the Russia collusion investigation.\n\nNow, Trump believes he is the target of a hoax in Epstein Story B, that is, what, if anything, Trump had to do with Epstein’s crimes. As he was with Russia, Trump appears to be right. Perhaps there is some world-shaking evidence that will emerge tying Trump to Epstein’s crimes, but after years of investigation, the chances of that seem vanishingly small. \n\nOn Capitol Hill, some of the crankier members of the House Republican caucus — Massie, Greene, and a few others — are pushing to keep the Epstein matter alive. But the fact is, most of the campaign to highlight Epstein is coming from Democrats, who hope to use it to damage Trump. Of course, Democrats controlled the Justice Department from 2021 to 2025 and could have, if the evidence existed, pursued Trump in the Epstein case. But they did nothing, which is another hint that they did not have evidence to use against Trump.\n\nThe issue at hand is a House effort to force the Justice Department to release its Epstein files. If that happens, some believe, all will be revealed. It is still unclear whether full release is possible; for example, some files are sealed by court order. Whatever happens, you can bet that even if “all” of the Epstein files are released, and Trump remains untouched, there will be some who claim that there are still deep, dark secrets out there.\n\nThat leaves the victims. They really are victims, and Jeffrey Epstein really did commit crimes against them and others. They say they can name other prominent molesters, although it is impossible to say how that will work. But as far as President Donald Trump, the political target here, is concerned, it appears that the mythical Trump-Epstein crime connection doesn’t exist.","summary":"WHAT IS JUSTICE IN THE EPSTEIN CASE? As he was promoting this week&#8217;s news conference featuring several of Jeffrey Epstein&#8217;s victims, Rep. Ro Khanna, the politically ambitious Democrat who, along with Republican Trump antagonist Rep. Thomas Massie, organized the event, promised that it would be &#8220;explosive.&#8221; It was not explosive. Several Epstein victims, some of whom [&#8230;]","url":"https://www.washingtonexaminer.com/daily-memo/3795880/what-is-justice-in-the-epstein-case/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25246686625185.jpg?w=696","video":null,"publish_date":"2025-09-05 23:35:27","author":"Byron York","authors":["Byron York"],"language":"en","category":"politics","source_country":"US","sentiment":-0.08},{"id":357836344,"title":"What is Department of War? Here's why US President Donald Trump renamed Department of Defense","text":"APWhat is Department of War? Trump signs order reviving the historic title for the Pentagon.President Donald Trump speaks in the Oval Office of the White House, Friday, Sept. 5, 2025, in Washington. (AP Photo/Alex Brandon)\n\nWhat is Department of War? US President Donald Trump has reintroduced the historic title by signing an executive order renaming the Department of Defense as the Department of War. The order revives the name that was in use from 1789 until 1947. While Congress approval is required for an official renaming, the order authorizes the use of the title as a secondary designation.What is Department of War? Historical BackgroundDepartment of War was created in 1789 when President George Washington signed it into law. It initially managed the Army, Navy, and Marine Corps. Within a decade, the Navy and Marines were separated into their own departments. Eventually, the War Department oversaw only the Army.By World War II, the US military was split across separate departments for the Army, Navy, and the newly developing Air Force. This fragmentation caused coordination problems. President Harry Truman and military leaders argued that such division contributed to failures such as the Pearl Harbor attack in 1941.In response, the National Security Act of 1947 merged the services under a single department. It was first called the National Military Establishment before being renamed the Department of Defense.Why Original Name Was Changed in 1947?The choice to rename the War Department to the Department of Defense was intentional. At the start of the Cold War, leaders wanted to highlight prevention and deterrence over aggressive military campaigns. Historian Melvyn Leffler explained that Truman and his advisers emphasized planning to stop future wars rather than engaging in them. The word “defense” symbolized this shift in policy.Live EventsAlso Read: Alien Spacecraft or Interstellar Comet 3I/ATLAS Biggest Revelation: See what NASA has foundWhy has Trump Renamed Department of Defense?President Trump defended the move as a return to tradition and strength. He argued that renaming the Pentagon signaled victory and confidence. Trump said that the United States won wars when it operated under the War Department but began losing its advantage after the change to the Department of Defense.Trump criticized what he described as a politically correct approach, insisting that the country should focus on both defense and offense. He linked the rebranding to his “Make America Great Again” policy, calling it a symbolic gesture of strength.Department of War Executive Order: Is Pentagon Renamed?The executive order does not formally rename the Pentagon. Instead, it permits “Department of War” to be used as a secondary title. It also allows Defense Secretary Pete Hegseth and other officials to adopt titles such as “Secretary of War” and “Deputy Secretary of War” in communications.The White House has already begun implementing symbolic changes. The Pentagon’s official website, defense.gov, now redirects visitors to war.gov. This represents a wider branding campaign aimed at embedding the title in official use.Also Read: Outlander: Blood of My Blood Episode 6 Birthright: Release date, time, preview, where to watch, episode schedule, setting, timeline, cast, charactersDepartment of Defense Name Change Reaction and Official SupportSecretary of Defense Pete Hegseth supported the decision. He described the rebranding as a move toward offense rather than defense. He said the focus would be on strength, lethality, and building warriors.Trump also dismissed the idea that Congress approval was necessary for the change, even though formal renaming of federal departments usually requires legislative action.Department of Defense Name Change Significance The rebranding of the Department of Defense as the Department of War revives a historic title that reflects America’s military past. Supporters view it as a return to tradition, while critics argue it signals a shift in tone at a sensitive global time.The decision ties back to debates about how the United States presents its military identity. The shift from “War” to “Defense” in 1947 was linked to the Cold War context, while Trump’s revival of “War” is tied to his agenda of projecting strength.Key Changes Introduced by Donald TrumpTrump signed an executive order to rebrand the Department of Defense as the Department of War. The change allows use as a secondary title, not an official rename. Department of War existed from 1789 to 1947. It originally oversaw the Army, Navy, and Marines, later just the Army. Renamed Department of Defense in 1947 to focus on deterrence during the Cold War. Trump says the old name shows strength and victory. Pentagon site now redirects from defense.gov to war.gov. Officials can use titles like Secretary of War. Secretary Pete Hegseth supported focus on offense and warriors. Name changes usually require Congress approval, but this is symbolic.FAQsWhat is Department of War and why was it created?The Department of War was formed in 1789 to manage the Army, Navy, and Marines. It later oversaw only the Army before being merged into the Department of Defense in 1947.Why did Trump rename the Department of Defense as Department of War?Trump argued that the original title signaled strength and victory. He said renaming would project power, align with tradition, and focus on both defense and offense in global strategy.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump renames DoDwhat is department of wartrump department of war orderdepartment of defense rebrandeddepartment of war 1789pentagon renamed department of warDepartment of WarDepartment of DefenseDoD turns DoWtrump exectutive order\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump renames DoDwhat is department of wartrump department of war orderdepartment of defense rebrandeddepartment of war 1789pentagon renamed department of warDepartment of WarDepartment of DefenseDoD turns DoWtrump exectutive order(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"What is Department of War? US President Donald Trump has signed an executive order to rebrand the Department of Defense with its original title, Department of War. The move revives a historic name first used in 1789 and discontinued in 1947.","url":"https://economictimes.indiatimes.com/news/international/us/what-is-department-of-war-history-trump-executive-order-department-of-defense-rebranded-1789-pentagon-renamed/articleshow/123728429.cms","image":"https://img.etimg.com/thumb/msid-123728435,width-1200,height-630,imgsize-85310,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-09-05 23:35:05","author":"Donald Trump","authors":["Donald Trump"],"language":"en","category":"politics","source_country":"in","sentiment":0.101},{"id":357835578,"title":"US President Donald Trump renames Pentagon the Department of War, says ‘it’s really about winning’","text":"President Donald Trump signed an executive order to rename the US defence department as the “Department of War”, reverting to a title it held until after World War II when officials sought to emphasise the Pentagon’s role in preventing conflict.\n\nMr Trump’s move represents his latest effort to rebrand the US military, which has included his decision to preside over an extraordinary military parade in downtown Washington DC, and to restore the original names of military bases that were changed after racial justice protests in 2020.\n\nMr Trump has also challenged conventional norms over domestic deployment of the US armed forces, creating military zones along the southern US border with Mexico to aid an immigration crackdown as well as deploying troops in cities like Los Angeles and Washington.\n\nThe order would authorise Defense Secretary Pete Hegseth and subordinate officials to use secondary titles such as “Secretary of War” and “Deputy Secretary of War” in official correspondence and public communications, according to a White House fact sheet.\n\n“It’s a very important change, because it’s an attitude,” Mr Trump said as he signed the executive order at a ceremony in the Oval Office.\n\n“It’s really about winning.”\n\nThe move would instruct Hegseth to recommend legislative and executive actions required to make the renaming permanent.\n\nDepartment name changes are rare and have required congressional approval. Still, Trump questioned whether he really needed a nod from Congress, even though his fellow Republicans hold slim majorities in both the Senate and House of Representatives.\n\nTwo Republican senators, Mike Lee of Utah and Rick Scott of Florida, and one Republican House member, Greg Steube of Florida, introduced legislation on Friday to make the change.\n\nDefense Secretary Pete Hegseth, introduced as the Secretary of War by Trump, cheered the change, which he has long advocated.\n\n“We’re going to go on the offence, not just on defence. Maximum lethality, not tepid legality,” Hegseth said.\n\nThe US Department of Defense was called the War Department until 1949, when Congress consolidated the Army, Navy and Air Force in the wake of World War II. Historians say the name was chosen in part to signal that in the nuclear age, the US was focused on preventing conflict.\n\nChanging the name again will be costly and require updating signs and letterheads used not only by officials at the Pentagon, but also military installations around the world.\n\nAn effort by former President Joe Biden to rename nine bases that honoured the Confederacy and Confederate leaders was set to cost the Army $US39 million ($A60 million). Hegseth reversed that effort earlier in 2025.\n\nCritics have said the planned name change is not only costly, but an unnecessary distraction for the Pentagon.\n\nHegseth has said that changing the name is “not just about words - it’s about the warrior ethos”.","summary":"WATCH: The US defence department will be renamed the ‘Department of War’ in President Donald Trump's latest effort to rebrand the nation's military.","url":"https://thewest.com.au/news/world/us-president-donald-trump-renames-pentagon-the-department-of-war-says-its-really-about-winning-c-19927830","image":"https://images.thewest.com.au/publication/C-19927830/e75becdc57f832431c7eba47f1f1cd220aa4d8dc-16x9-x1y0w2446h1376.jpg?imwidth=1200","video":null,"publish_date":"2025-09-05 23:32:29","author":"Phil Stewart","authors":["Phil Stewart"],"language":"en","category":"politics","source_country":"au","sentiment":0.342},{"id":357836098,"title":"Mark Zuckerberg caught on hot mic making embarrassing admission to Donald Trump","text":"Meta CEO Mark Zuckerberg was caught on a hot mic admitting to Donald Trump that he had no idea how to answer a question while sitting next to the president at a White House event.\n\nZuckerberg was among the moguls in attendance for a dinner on Thursday, alongside Apple CEO Tim Cook, Microsoft founder Bill Gates, the founder and CEO of Google, Sergey Brin, and Sundar Pichai, and OpenAI founder Sam Altman. \n\nTrump asked the Meta CEO and founder how much he was planning on spending in the US during the televised event. \n\n'Oh gosh, um, I think it's probably gonna be, something like, I don't know, at least $600 billion through '28, in the US, yeah,' he responded. \n\nTrump noted that it was a lot of money, and Zuckerberg confessed, 'Yeah, no it's significant'. \n\nLater on in the event, Zuckerberg was heard apologizing to Trump and admitting that he wasn't ready for the question. \n\nTrump laughed and told Melania, who was seated on his other side, that Zuckerberg wasn't prepared. \n\n'I wasn't sure what number you wanted to go with,' Zuckerberg confessed. \n\nDaily Mail reached out to Meta for comment on Zuckerberg's 'hot mic' remarks. \n\nIn another awkward moment, Zuckerberg admitted that he 'wasn't paying attention' when a reporter asked him about free speech legislation in the UK. \n\nTrump then joked that it was 'the beginning' of Zuckerberg's political career, which the CEO denied with a laugh. \n\nThe president also asked other moguls at the dinner about their US investment plans, including Pichai, who said Google was planning on investing $250 billion in the US, and Cook said that Apple was also planning on investing $600 billion. \n\n'I want to thank you for setting the tone such that we can make a major investment in the United States and have some key manufacturing here,' Cook told Trump when he announced the investment. \n\n'I think it says a lot about your leadership and focus on innovation,' he added. \n\nThe high-profile event was a 'who's who' in Silicon Valley, with the world's most influential tech leaders, including 13 billionaires, in attendance. \n\nThe sit-down dinner in the State Dining Room followed a summit hosted by the first lady earlier in the day on artificial intelligence in education.\n\nThe event was initially meant to debut the newly renovated Rose Garden, but the dinner was moved to the dining room due to rain. \n\nThe president began the dinner by thanking the moguls, praising the intelligence of the attendees, and boasting that it was 'definitely a high IQ group'.\n\n'I know everybody at the table indirectly through reading about you and studying, knowing a lot about your business, actually making it very easy for you in terms of electric capacity and getting it for you, getting your permits'.\n\nThe tech leaders took turns speaking and used the opportunity to offer unfiltered praise for the president. \n\nEven previous Trump critics like Gates praised the president and thanked him for his collaboration in the tech industry. \n\nAltman, who once compared Trump to Adolf Hitler, thanked the president for being 'pro-business' and 'pro-innovation,' adding that his embrace of the tech industry was 'a very refreshing change'. \n\n'I think it’s going to set us up for a long period of leading the world, and that wouldn’t be happening without your leadership,' he added. \n\nTrump's former head of the Department of Government Efficiency Elon Musk, colloquially referred to as the 'First Buddy' was notably absent from the event.","summary":"Meta CEO Mark Zuckerberg was caught making an awkward confession to President Trump during a high-profile state dinner at the White House.","url":"https://www.dailymail.co.uk/news/article-15071059/mark-zuckerberg-hot-mic-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/09/06/00/101890131-0-image-m-23_1757113229780.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/05/3561919145896463924/1024x576_MP4_3561919145896463924.mp4","publish_date":"2025-09-05 23:31:23","author":"Editor,Sophie Gable","authors":["Editor","Sophie Gable"],"language":"en","category":"politics","source_country":"gb","sentiment":0.248},{"id":357838094,"title":"Alcaraz beats Djokovic in 3 sets to reach U.S. Open final","text":"Carlos Alcaraz used his youth, athleticism and creativity to assert himself against the much more accomplished, but also much older, Novak Djokovic and beat the 24-time major champion 6-4, 7-6 (4), 6-2 at the U.S. Open on Friday for a berth in his third consecutive Grand Slam final.\n\nBy the end, Djokovic seemed resigned to the result. The 38-year-old from Serbia reached the semifinals at all four Slams this season but exited in that round each time.\n\nThe No. 2-seeded Alcaraz’s victory means he will face either No. 1 Jannik Sinner or No. 25 Felix Auger-Aliassime for the championship on Sunday, when President Donald Trump plans to attend.\n\nAlcaraz is seeking his sixth major title and second at Flushing Meadows. He defeated Sinner at the French Open in June and lost to his rival at Wimbledon in July.\n\nSinner could become the first repeat men’s champion in New York since Roger Federer won the hard-court tournament five years in a row from 2004 through 2008.\n\nDjokovic’s bid to become the first player in the sport’s history to get No. 25 was blocked again.\n\nAlcaraz, 22, and Sinner, 24, have combined to collect the past seven major championships and nine of the last 12. Djokovic won the other three in that span, most recently at the 2023 U.S. Open.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Carlos Alcaraz used his youth, athleticism and creativity to assert himself against the much more accomplished, but also much older, Novak Djokovic and beat the 24-time major champion…","url":"https://japantoday.com/category/sports/Alcaraz-beats-Djokovic-in-3-sets-to-reach-U.S.-Open-final","image":"https://media.japantoday.com/img/store/98/7b/63cf4811bcba12f68fb7680b6154e3b37a85/download/_w1700.jpeg","video":null,"publish_date":"2025-09-05 23:25:02","author":"Howard Fendrich,Japan Today Editor","authors":["Howard Fendrich","Japan Today Editor"],"language":"en","category":"sports","source_country":"jp","sentiment":-0.027},{"id":357842772,"title":"Long-Time Democratic Operative Julian Epstein Summarizes Letitia James’ Antics With Four Damning Words","text":"Longtime Democrat operative Julian Epstein appeared on Fox News Friday and blasted Democratic New York Attorney General Letitia James’ decision to appeal a ruling that overturned a $454 million civil fraud judgment against President Donald Trump.\n\nJames formally notified the court Thursday that she will appeal last month’s ruling tossing Trump’s $454 million civil fraud penalty, aiming to reinstate both the fine and the fraud finding against him and his company. In an appearance on “The Evening Edit,” Epstein said the case was politically motivated and fundamentally flawed.\n\n“It’s the same reaction that I’ve had with most of Letitia’s James’ antics and her pursuit of Trump. It’s doubling down on dumb,” Epstein said. “[In] the case in the appeals court in New York in August, you had mostly liberal Democratic appointed judges who all said that the judgment was way out of whack, that it was an Eighth Amendment violation.” (RELATED: Clay Travis Predicts Many More Things To Come After Appeals Court Rules Trump Fine Excessive)\n\nEpstein said James’ action was an abusive and political prosecution from the start.\n\n“The notion that you have half a billion-dollar fine when all of the affected parties in the case from Deutsche Bank on down said that there was no harm. This was an abusive prosecution. It was a political prosecution. The whole thing, in my view, should be thrown out. And she will not prevail,” Epstein said.\n\nJames sued Trump in 2022, accusing him of inflating property values to secure loans—an investigation she vowed during her 2018 campaign, when she called him an “illegitimate president.” In 2024, Judge Arthur Engoron barred Trump from serving as an officer or director of any New York-based company for three years and ordered him to pay the full penalty plus interest.\n\nA New York appeals court ruled in August that Engoron’s civil penalty against Trump violated the Eighth Amendment’s ban on excessive fines.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'It's same reaction that I've had'","url":"https://dailycaller.com/2025/09/05/julian-epstein-letitia-james-antics/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Long-Time-Dem-Operative-Summarizes-Letitia-James-Antics-With-Four-Damning-Words-e1757112305406.jpg","video":null,"publish_date":"2025-09-05 23:21:55","author":"Mariane Angela","authors":["Mariane Angela"],"language":"en","category":"politics","source_country":"US","sentiment":-0.283},{"id":357838622,"title":"Special Report w/ Bret Baier - Friday, September 5","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode September 05, 2025 39:33 \n FULL EPISODE\n\n EXP 7 DAYS\n Special Report w/ Bret Baier - Friday, September 5 \n Donald Trump, Migrants, Ukraine\n Tags MOST RECENT EPISODES | VIDEOSSPECIAL REPORT | FULL EPISODES","summary":"Donald Trump, Migrants, Ukraine","url":"https://www.foxnews.com/video/6378556836112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/1176f802-88a2-457b-80af-a9922c11739c/308ec10a-8b99-4abb-9667-a16098d95a1a/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-09-05 23:21:06","author":null,"language":"en","source_country":"us","sentiment":-0.352},{"id":357841080,"title":"Trump endorses Hinson in 2026 race to keep key Senate seat red","text":"President Donald Trump on Friday endorsed Republican Rep. Ashley Hinson as she runs to succeed retiring GOP Sen. Joni Ernst in Iowa. Hinson — a former TV news anchor who is in her third term representing Iowa's 2nd Congressional District, which covers the northeastern portion of the state — showcased her support for Trump as she launched her Senate campaign on Tuesday. \"I'm running to be President Trump's top ally in the United States Senate,\" she said. And in a Fox News Digital interview this week, Hinson highlighted that she's \"proud to stand\" with Trump. Trump, in a social media post, said, \"I know Ashley well, and she is a WINNER!\" HINSON LAUNCHES SENATE BID IN RACE TO SUCCEED IOWA'S ERNST \"I know Ashley well, and she is a WINNER! A Loving Wife and Proud Mother of two sons, Ashley is a wonderful person, has ALWAYS delivered for Iowa, and will continue doing so in the United States Senate,\" the president said. \"Ashley Hinson will be an outstanding Senator, and has my Complete and Total Endorsement – SHE WILL NOT LET YOU DOWN!\" Trump's support followed earlier endorsements from Senate Majority Leader Sen. John Thune and the National Republican Senatorial Committee (NRSC), which is the Senate GOP's campaign arm. \"We need conservative fighters in the Senate — and that's exactly what we'll get with Ashley Hinson,\" Thune wrote early Friday as he endorsed Hinson. And NRSC chair Sen. Tim Scott of South Carolina said, \"Having traveled Iowa with Ashley, I know she is the fighter the Hawkeye State needs to deliver President Trump's agenda in 2026 and beyond.\" Hinson doesn't have the GOP primary field to herself. Former state Sen. Jim Carlin and veteran Joshua Smith had already entered the primary ahead of Ernst's announcement. But the support from Trump, Thune, and the NRSC will further boost Hinson, who was already considered the frontrunner for the nomination, and will likely dissuade any others from entering the primary. The president's clout over the GOP is immense, and his endorsement in a Republican primary is extremely influential. Hinson's campaign launch came a few hours after Ernst, in a social media video, officially announced that she wouldn't seek re-election in next year's midterms. \"After a tremendous amount of prayer and reflection, I will not be seeking re-election in 2026,\" the 55-year-old Ernst, who was first elected to the Senate in 2014, said in a video posted to social media. TRUMP NOT ON BALLOT BUT FRONT-AND-CENTER IN 2025 ELECTIONS Ernst, a retired Army Reserve and Iowa National Guard officer who served in the Iraq War, had been wrestling for months over whether to run for re-election in 2026. And in her video, she said, \"This was no easy decision.\" Ernst first grabbed national attention 11 years ago with her \"make 'em squeal\" ads as she won the high-profile Senate election in Iowa in the race to succeed retiring longtime Democratic Sen. Tom Harkin. And Ernst highlighted in her video that \"11 years ago, Iowans elected me as the first female combat veteran to the U.S. Senate, and they did so with a mission in mind – to make Washington squeal. And I’m proud to say we have delivered. We’ve cut waste, fraud, and abuse across the federal government.\" Hinson, in a social media post, thanked Ernst for her \"incredible service to our state and nation\" as well as for her friendship. \"Iowa is better off thanks to your selfless service,\" she said. In an Iowa radio interview on Tuesday, she said that among her priorities as she runs for the Senate are \"secure borders, keeping men out of girls' sports, cutting taxes for our working families, standing up for Iowa agriculture and helping our young Iowans who are trying to buy a house and start a family.\" Hinson also pledged to campaign across all 99 of Iowa's counties, starting with a kick-off event on Friday. And as she entered the race, Hinson was endorsed by Republican Sens. Jim Banks of Indiana, Katie Britt of Alabama, and Markwayne Mullin of Oklahoma. House Majority Leader Rep. Steve Scalise, Majority Whip Rep. Tom Emmer, House Republican Leadership Chair Rep. Elise Stefanik and Iowa House Majority Leader Bobby Kaufmann also backed Hinson. Democratic Senatorial Campaign Committee (DSCC) communications director Maeve Coyle, following Hinson's announcement, argued that \"Republicans failed to convince Joni Ernst to run for reelection, and now they may be stuck with Ashley Hinson, who has repeatedly voted to raise costs and make life harder for Iowans by voting to slash Medicaid, cheering on the chaotic tariffs that threaten Iowa’s economy, voting against measures to lower the cost of insulin, and threatening Social Security.\" Responding, Hinson told Fox News Digital, \"I think they're misinformed at best.\" And she charged that \"when I hear the lies and the fearmongering coming out of the left, it's to only cover up for the fact that they have no message and no real leader other than Bernie and AOC and now Mamdani in New York,\" as she referred to Sen. Bernie Sanders of Vermont, Rep. Alexandria Ocasio-Cortez of New York and New York City Democratic mayoral nominee Zohran Mamdani. \"If that's the direction they want to take our country, I think Iowans are going to reject that wholeheartedly,\" she predicted. FOUR KEY SENATE SEATS THE GOP AIMS TO FLIP IN NEXT YEAR'S MIDTERM ELECTIONS Iowa was once a top battleground state that former President Barack Obama carried in his 2008 and 2012 White House victories. But the state has shifted to the right in recent election cycles, with President Donald Trump carrying the state by nine points in 2016, eight points in 2020, and by 13 points last November. Republicans currently hold both of the state's U.S. Senate seats – Ernst and longtime Sen. Chuck Grassley – and all four of Iowa's congressional districts, as well as all statewide offices except for state auditor, which is held by Democrat Rob Sand, who's running for governor next year. But Democrats in Iowa are energized after flipping two GOP-held state Senate seats in special elections so far this year. Five Democrats are already running for Senate in Iowa. The field includes state Rep. Josh Turek, a Paralympian wheelchair basketball player, state Sen. Zach Wahls, Knoxville Chamber of Commerce executive director Nathan Sage and Des Moines School Board Chair Jackie Norris. \"An open seat in Iowa is just the latest example of Democrats expanding the senatorial map,\" Lauren French, spokesperson for the Democrat-aligned Senate Majority PAC, said in a statement. But Sen. Tim Scott of South Carolina, the chair of the National Republican Senatorial Committee (NRSC), said in a statement, \"The NRSC is confident Iowans will elect a Republican to continue fighting for them and championing President Trump’s agenda in 2026.\" SENATE DEMOCRATS RECRUITING TOP CANDIDATES IN PUSH TO WIN BACK MAJORITY Republicans are aiming to not only defend, but expand, the current 53-47 Senate majority in next year's elections. Senate Republicans enjoyed a favorable map in the 2024 cycle as they flipped four seats from blue to red to win back the majority. But the party in power – the Republicans – traditionally faces political headwinds in the midterm elections. Nevertheless, a current read of the 2026 map indicates the GOP may be able to go on offense in some key states. In battleground Georgia, which Trump narrowly carried in last year's White House race, Republicans view first-term Sen. Jon Ossoff as the most vulnerable Democrat incumbent up for re-election next year. They're also targeting battleground Michigan, where Democratic Sen. Gary Peters is retiring at the end of next year, and swing state New Hampshire, where longtime Democratic Sen. Jeanne Shaheen decided against seeking a fourth six-year term in the Senate. Also on the NRSC's target list is blue-leaning Minnesota, where Democratic Sen. Tina Smith isn't running for re-election. CLICK HERE TO GET THE FOX NEWS APP But the GOP is defending an open seat in battleground North Carolina, where Republican Sen. Thom Tills decided against seeking re-election. And Republicans will likely be forced to spend resources to defend Sen. Jon Husted of Ohio – who was appointed to succeed former senator and now-Vice President JD Vance – as he faces off next year against former Democratic Sen. Sherrod Brown. Meanwhile, Democrats are also targeting moderate Sen. Susan Collins – who has yet to announce her expected 2026 re-election — in blue-leaning Maine.","summary":"Republican Rep. Ashley Hinson becomes the major GOP contender for Iowa&apos;s Senate seat after Joni Ernst announces retirement, securing Trump&apos;s influential endorsement.","url":"https://www.foxnews.com/politics/trump-endorses-hinson-2026-race-keep-key-senate-seat-red","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/ashley-hinson-fox-news-digital-intv-dc-sept.-4-2025.jpg","video":"https://www.foxnews.com/video/6378491461112","publish_date":"2025-09-05 23:20:34","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.127},{"id":357838624,"title":"Hegseth wants to change Pentagon briefing room name to ‘Pentagon War Annex’","text":"to top close Video This video is playing in picture-in-picture.\n\nOn Air Reporter Hit September 05, 2025 01:50 \n\n Hegseth wants to change Pentagon briefing room name to ‘Pentagon War Annex’ \n Fox News chief national security correspondent Jennifer Griffin reports on President Donald Trump’s name change of the Department of Defense on ‘The Story.’\n Tags V-VIDEOSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRPERSONALITIESU.S.","summary":"Fox News chief national security correspondent Jennifer Griffin reports on President Donald Trump’s name change of the Department of Defense on ‘The Story.’","url":"https://www.foxnews.com/video/6378555724112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/50a93486-aed8-409d-a120-f16a8bd5cc76/260fb6f3-81d3-4498-a04c-a0c0df3bfe61/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-05 23:20:23","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.183},{"id":357832888,"title":"Trump says US will host next year’s G20 summit at his Florida golf club but he won’t make money","text":"By SEUNG MIN KIM and WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump said Friday that the U.S. will host next year’s Group of 20 summit at his golf club in Doral, Florida, arguing it was “the best location” for the high-stakes international gathering but insisting his family’s business “will not make any money on it.”\n\nIn his first term, Trump tried to host a separate global summit at the club, but backed down after criticism from his own party about the propriety of doing so. Now, though, Trump rarely travels domestically without golfing at or staying in properties bearing his name and has faced very little political blowback.\n\nTrump’s sons have taken over running the Trump Organization while their father is in the White House. But the president has nonetheless prided himself in blurring the line between domestic and global policy and generating profits for the Trump brand.\n\nHe’s actively promoted his $TRUMP meme coin and even hosted the top 220 investors in it for a swanky dinner in May at his golf property in Virginia. The president made his first foreign trip to Saudi Arabia, after his sons crisscrossed the region drumming up business for the family’s other cryptocurrency ventures. Trump also went to Scotland to inaugurate his new golf course there.\n\nThe G20 is made up of some of the world’s major economies, the European Union and the African Union. Hosting the G20 at Doral would be an especially striking example of using the presidency to enrich his family, but Trump wasted little time defending it.\n\n“I think everybody wants it there,” he said when asked if the global summit would be at his golf club and spa. Trump noted that the conference would be occurring in December 2026, a time of year when hotels in South Florida are often more full, and said that Doral had the space and was ideally suited because of its close proximity to the city’s airport.\n\nThe United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009. The president suggested that organizers had requested the summit be at his property, but didn’t elaborate. He said each delegation from different countries “will have its own building.”\n\n“It’s the best location, it’s beautiful, beautiful everything,” Trump said, while adding, “We will not make any money on it.”\n\n“We’re doing a deal where it’s not going to be money, there’s no money in it. I just want it to go well,” Trump said. “I think it’ll be really a beautiful thing.”\n\nHe also called Doral “very, very successful, one of the most successful properties in the country.”\n\nMiami Mayor Frances Suarez, who attended Friday’s G20 site announcement in the Oval Office, said it “puts us on the global map” but also acknowledged that, for the area, “It’s a tremendous boom for your economy.”\n\n“As the president knows,” Suarez added. “He has multiple hospitality assets.”\n\nTrump also said Friday that he would not be attending this year’s G20 in South Africa, but planned to send Vice President JD Vance in his place.","summary":"The United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009.","url":"https://www.twincities.com/2025/09/05/trump-group-of-20/","image":"https://www.twincities.com/wp-content/uploads/2025/09/Trump_59720-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-05 23:20:20","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.087},{"id":357838800,"title":"Trump says US will host next year’s G20 summit at his Florida golf club but he won’t make money","text":"By SEUNG MIN KIM and WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump said Friday that the U.S. will host next year’s Group of 20 summit at his golf club in Doral, Florida, arguing it was “the best location” for the high-stakes international gathering but insisting his family’s business “will not make any money on it.”\n\nIn his first term, Trump tried to host a separate global summit at the club, but backed down after criticism from his own party about the propriety of doing so. Now, though, Trump rarely travels domestically without golfing at or staying in properties bearing his name and has faced very little political blowback.\n\nTrump’s sons have taken over running the Trump Organization while their father is in the White House. But the president has nonetheless prided himself in blurring the line between domestic and global policy and generating profits for the Trump brand.\n\nHe’s actively promoted his $TRUMP meme coin and even hosted the top 220 investors in it for a swanky dinner in May at his golf property in Virginia. The president made his first foreign trip to Saudi Arabia, after his sons crisscrossed the region drumming up business for the family’s other cryptocurrency ventures. Trump also went to Scotland to inaugurate his new golf course there.\n\nThe G20 is made up of some of the world’s major economies, the European Union and the African Union. Hosting the G20 at Doral would be an especially striking example of using the presidency to enrich his family, but Trump wasted little time defending it.\n\n“I think everybody wants it there,” he said when asked if the global summit would be at his golf club and spa. Trump noted that the conference would be occurring in December 2026, a time of year when hotels in South Florida are often more full, and said that Doral had the space and was ideally suited because of its close proximity to the city’s airport.\n\nThe United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009. The president suggested that organizers had requested the summit be at his property, but didn’t elaborate. He said each delegation from different countries “will have its own building.”\n\n“It’s the best location, it’s beautiful, beautiful everything,” Trump said, while adding, “We will not make any money on it.”\n\n“We’re doing a deal where it’s not going to be money, there’s no money in it. I just want it to go well,” Trump said. “I think it’ll be really a beautiful thing.”\n\nHe also called Doral “very, very successful, one of the most successful properties in the country.”\n\nMiami Mayor Frances Suarez, who attended Friday’s G20 site announcement in the Oval Office, said it “puts us on the global map” but also acknowledged that, for the area, “It’s a tremendous boom for your economy.”\n\n“As the president knows,” Suarez added. “He has multiple hospitality assets.”\n\nTrump also said Friday that he would not be attending this year’s G20 in South Africa, but planned to send Vice President JD Vance in his place.","summary":"The United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009.","url":"https://www.ocregister.com/2025/09/05/trump-group-of-20/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/Trump_59720-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-05 23:20:20","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.087},{"id":357838928,"title":"Trump says US will host next year’s G20 summit at his Florida golf club but he won’t make money","text":"By SEUNG MIN KIM and WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump said Friday that the U.S. will host next year’s Group of 20 summit at his golf club in Doral, Florida, arguing it was “the best location” for the high-stakes international gathering but insisting his family’s business “will not make any money on it.”\n\nIn his first term, Trump tried to host a separate global summit at the club, but backed down after criticism from his own party about the propriety of doing so. Now, though, Trump rarely travels domestically without golfing at or staying in properties bearing his name and has faced very little political blowback.\n\nTrump’s sons have taken over running the Trump Organization while their father is in the White House. But the president has nonetheless prided himself in blurring the line between domestic and global policy and generating profits for the Trump brand.\n\nHe’s actively promoted his $TRUMP meme coin and even hosted the top 220 investors in it for a swanky dinner in May at his golf property in Virginia. The president made his first foreign trip to Saudi Arabia, after his sons crisscrossed the region drumming up business for the family’s other cryptocurrency ventures. Trump also went to Scotland to inaugurate his new golf course there.\n\nThe G20 is made up of some of the world’s major economies, the European Union and the African Union. Hosting the G20 at Doral would be an especially striking example of using the presidency to enrich his family, but Trump wasted little time defending it.\n\n“I think everybody wants it there,” he said when asked if the global summit would be at his golf club and spa. Trump noted that the conference would be occurring in December 2026, a time of year when hotels in South Florida are often more full, and said that Doral had the space and was ideally suited because of its close proximity to the city’s airport.\n\nThe United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009. The president suggested that organizers had requested the summit be at his property, but didn’t elaborate. He said each delegation from different countries “will have its own building.”\n\n“It’s the best location, it’s beautiful, beautiful everything,” Trump said, while adding, “We will not make any money on it.”\n\n“We’re doing a deal where it’s not going to be money, there’s no money in it. I just want it to go well,” Trump said. “I think it’ll be really a beautiful thing.”\n\nHe also called Doral “very, very successful, one of the most successful properties in the country.”\n\nMiami Mayor Frances Suarez, who attended Friday’s G20 site announcement in the Oval Office, said it “puts us on the global map” but also acknowledged that, for the area, “It’s a tremendous boom for your economy.”\n\n“As the president knows,” Suarez added. “He has multiple hospitality assets.”\n\nTrump also said Friday that he would not be attending this year’s G20 in South Africa, but planned to send Vice President JD Vance in his place.","summary":"The United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009.","url":"https://www.bostonherald.com/2025/09/05/trump-group-of-20/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Trump_59720-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-05 23:20:20","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.087},{"id":357839716,"title":"Trump says US will host next year’s G20 summit at his Florida golf club but he won’t make money","text":"By SEUNG MIN KIM and WILL WEISSERT\n\nWASHINGTON (AP) — President Donald Trump said Friday that the U.S. will host next year’s Group of 20 summit at his golf club in Doral, Florida, arguing it was “the best location” for the high-stakes international gathering but insisting his family’s business “will not make any money on it.”\n\nIn his first term, Trump tried to host a separate global summit at the club, but backed down after criticism from his own party about the propriety of doing so. Now, though, Trump rarely travels domestically without golfing at or staying in properties bearing his name and has faced very little political blowback.\n\nTrump’s sons have taken over running the Trump Organization while their father is in the White House. But the president has nonetheless prided himself in blurring the line between domestic and global policy and generating profits for the Trump brand.\n\nHe’s actively promoted his $TRUMP meme coin and even hosted the top 220 investors in it for a swanky dinner in May at his golf property in Virginia. The president made his first foreign trip to Saudi Arabia, after his sons crisscrossed the region drumming up business for the family’s other cryptocurrency ventures. Trump also went to Scotland to inaugurate his new golf course there.\n\nThe G20 is made up of some of the world’s major economies, the European Union and the African Union. Hosting the G20 at Doral would be an especially striking example of using the presidency to enrich his family, but Trump wasted little time defending it.\n\n“I think everybody wants it there,” he said when asked if the global summit would be at his golf club and spa. Trump noted that the conference would be occurring in December 2026, a time of year when hotels in South Florida are often more full, and said that Doral had the space and was ideally suited because of its close proximity to the city’s airport.\n\nThe United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009. The president suggested that organizers had requested the summit be at his property, but didn’t elaborate. He said each delegation from different countries “will have its own building.”\n\n“It’s the best location, it’s beautiful, beautiful everything,” Trump said, while adding, “We will not make any money on it.”\n\n“We’re doing a deal where it’s not going to be money, there’s no money in it. I just want it to go well,” Trump said. “I think it’ll be really a beautiful thing.”\n\nHe also called Doral “very, very successful, one of the most successful properties in the country.”\n\nMiami Mayor Frances Suarez, who attended Friday’s G20 site announcement in the Oval Office, said it “puts us on the global map” but also acknowledged that, for the area, “It’s a tremendous boom for your economy.”\n\n“As the president knows,” Suarez added. “He has multiple hospitality assets.”\n\nTrump also said Friday that he would not be attending this year’s G20 in South Africa, but planned to send Vice President JD Vance in his place.","summary":"The United States hasn’t hosted a G20 since it was held in Pittsburgh in 2009.","url":"https://www.sandiegouniontribune.com/2025/09/05/trump-group-of-20/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/Trump_59720-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-05 23:20:20","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.087}]}