{"offset":0,"number":50,"available":27410,"news":[{"id":264424920,"title":"États-unis: Donald Trump Choisit Le Présentateur De Fox News Pete Hegseth Comme Ministre De La Défense","text":"Personalised advertising and content, advertising and content measurement, audience research and services development\n\nAdvertising and content can be personalised based on your profile. Your activity on this service can be used to build or improve a profile about you for personalised advertising and content. Advertising and content performance can be measured. Reports can be generated based on your activity and those of others. Your activity on this service can help develop and improve products and services.","summary":"Donald Trump a annoncé mardi qu'il comptait nommer comme ministre de la Défense...","url":"https://www.seneweb.com/news/International/etats-unis-donald-trump-choisit-le-prese_n_455658.html","image":"https://images.seneweb.com/dynamic/modules/news/images/gen/fb/7f2d6b9c877a749ea14cddf3393da4fee7de7ed3.jpeg","video":null,"publish_date":"2024-11-13 01:09:08","author":null,"language":"en","category":"politics","source_country":"sn","sentiment":0.432},{"id":264424706,"title":"Donald Trump top adviser puts Kevin Rudd on notice after US ambassador deletes critical social media posts","text":"One of Donald Trump’s most trusted advisers has put Kevin Rudd on notice, apparently hinting that the Australian ambassador’s time in the United States may be short-lived under the Republican President-elect.\n\nDan Scavino Jr, one of Mr Trump’s most senior campaign advisers and who served in the first Trump administration, aimed Mr Rudd with a clear message about his future as Australia’s ambassador to the US.\n\nIt appears the Republican loyalist took note of Mr Rudd’s disparaging comments about Mr Trump, made before he was appointed Australia’s ambassador in 2023.\n\nMr Rudd called Mr Trump “the most destructive president in history”, a “political liability”, a “problem to the world”, “traitor to the West”, and “village idiot” — which he made before he was appointed Australia’s ambassador in 2023.\n\nAfter Mr Trump’s stunning election victory last week, Mr Rudd quietly deleted a number of negative commentary about the 78-year-old President-elect and then posted a congratulations message to the Republican ticket.\n\nBut Mr Scavino Jr has not let the ambassador off the hook.\n\nHe reposted Mr Rudd’s message to X with a GIF of an hourglass — suggesting the Australian’s days in the plum diplomatic position might be numbered.\n\nThe post is now pinned on Mr Scavino’s account.\n\nDespite being a vocal critic of Mr Trump, Labor has put its full support behind Mr Rudd with a slate of senior ministers — including Prime Minister, and close ally, Anthony Albanese — declaring he had done a “terrific job” in Washington.\n\nEarlier in the year, Mr Trump said Mr Rudd was “nasty” and “not the brightest bulb” after a UK interviewer told the former president about negative comments the Australian had made before becoming ambassador.\n\nAsked whether he would take a phone call from Mr Rudd, Mr Trump said the Australian “won’t be there long” if he continued to speak ill of him.\n\nTrump’s own daughter-in-law, Lara Trump, told Sky News it would be “kind of hard” for Mr Rudd to continue in the Washington role if he hadn’t shown a “change of heart” towards her father-in-law.\n\nBut the Prime Minister has denied it would move Mr Rudd out of the job and insisted the government was “looking forward” to working with the returning Trump administration.\n\n“I’ve demonstrated, I think, my ability to work with world leaders and to develop relationships with them, which are positive,” Mr Albanese said when asked by Sunrise host Nat Barr about apologising for his own disparaging comments about Mr Trump.\n\n“And I think that I’ve demonstrated in the two-and-a-half years that I’ve had the honour of being Prime Minister.”\n\nMr Scavino Jr worked as White House deputy chief of staff for communications for Trump from 2020 to 2021. From 2017 he was in charge of the administration’s social media.\n\nHe has also been a senior adviser to the Republican’s 2024 re-election campaign and is likely to be named for a plum role in the upcoming administration.","summary":"One of Donald Trump’s most trusted advisers has put Kevin Rudd on notice, warning that the Australian ambassador’s time in the United States may be running out.","url":"https://thewest.com.au/politics/donald-trump-top-adviser-puts-kevin-rudd-on-notice-after-us-ambassador-deletes-critical-social-media-posts-c-16734935","image":"https://images.thewest.com.au/publication/C-16734935/c12fb9c09296bce5f286a51b59fb92ba9df1849c-16x9-x1y0w2446h1376.jpg?imwidth=1200","video":null,"publish_date":"2024-11-13 01:04:58","author":"Georgina Noack","authors":["Georgina Noack"],"language":"en","category":"politics","source_country":"au","sentiment":-0.064},{"id":264424856,"title":"Rise of the hawks: Trump’s first appointments don’t bode well for China","text":"Donald Trump’s administration is starting to take shape, and the nature of his appointees to key positions is ominous for China.\n\nAmong the confirmed appointments are Elise Stefanik as US ambassador to the United Nations and Mike Waltz as national security adviser, with Marco Rubio strongly tipped to become his Secretary of State.\n\nRobert Lighthizer is in the frame to reprise the role he had in the last Trump administration as US trade representative, although he is reportedly more interested in a broader role, perhaps as Treasury or commerce secretary. But there is a queue of contenders for those positions.\n\nWhat do these people have in common? They’re all among the most hawkish of China hawks.","summary":"Donald Trump’s administration is starting to take shape, and his appointees to key positions share something in common: they’re well-known China hawks.","url":"https://www.smh.com.au/business/markets/rise-of-the-hawks-trump-s-first-appointments-don-t-bode-well-for-china-20241113-p5kq5r.html","image":"https://static.ffx.io/images/$zoom_0.3870614035087719%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/c3a3279f8a4caed60245bdefbdb43e2da0742573","video":null,"publish_date":"2024-11-13 01:04:38","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.03},{"id":264424588,"title":"Rise of the hawks: Trump’s first appointments don’t bode well for China","text":"Donald Trump’s administration is starting to take shape, and the nature of his appointees to key positions is ominous for China.\n\nAmong the confirmed appointments are Elise Stefanik as US ambassador to the United Nations and Mike Waltz as national security adviser, with Marco Rubio strongly tipped to become his Secretary of State.\n\nRobert Lighthizer is in the frame to reprise the role he had in the last Trump administration as US trade representative, although he is reportedly more interested in a broader role, perhaps as Treasury or commerce secretary. But there is a queue of contenders for those positions.\n\nWhat do these people have in common? They’re all among the most hawkish of China hawks.","summary":"Donald Trump’s administration is starting to take shape, and his appointees to key positions share something in common: they’re well-known China hawks.","url":"https://www.theage.com.au/business/markets/rise-of-the-hawks-trump-s-first-appointments-don-t-bode-well-for-china-20241113-p5kq5r.html","image":"https://static.ffx.io/images/$zoom_0.3870614035087719%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/c3a3279f8a4caed60245bdefbdb43e2da0742573","video":null,"publish_date":"2024-11-13 01:04:38","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.03},{"id":264424564,"title":"Rise of the hawks: Trump’s first appointments don’t bode well for China","text":"Donald Trump’s administration is starting to take shape, and the nature of his appointees to key positions is ominous for China.\n\nAmong the confirmed appointments are Elise Stefanik as US ambassador to the United Nations and Mike Waltz as national security adviser, with Marco Rubio strongly tipped to become his Secretary of State.\n\nRobert Lighthizer is in the frame to reprise the role he had in the last Trump administration as US trade representative, although he is reportedly more interested in a broader role, perhaps as Treasury or commerce secretary. But there is a queue of contenders for those positions.\n\nWhat do these people have in common? They’re all among the most hawkish of China hawks.","summary":"Donald Trump’s administration is starting to take shape, and his appointees to key positions share something in common: they’re well-known China hawks.","url":"https://www.brisbanetimes.com.au/business/markets/rise-of-the-hawks-trump-s-first-appointments-don-t-bode-well-for-china-20241113-p5kq5r.html","image":"https://static.ffx.io/images/$zoom_0.3870614035087719%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/c3a3279f8a4caed60245bdefbdb43e2da0742573","video":null,"publish_date":"2024-11-13 01:04:38","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.03},{"id":264424670,"title":"Karine Jean-Pierre is asked if Biden and Harris were 'awkward' at first lunch since the election - and the reaction says it all","text":"White House press secretary Karine Jean-Pierre was asked Tuesday if President Joe Biden and Vice President Kamala Harris' post-election lunch at the White House was 'awkward.'\n\nHarris returned to the White House complex Tuesday for the first time since her bruising election loss a week ago to former President Donald Trump. \n\nAides stood on the Eisenhower Executive Office Building's steps to catch a glimpse of the now former Democratic nominee, who told them to keep the faith before she walked over for her lunch with Biden. \n\n'I don't even understand. Why would it be awkward? Why would it be awkward?' Jean-Pierre replied to Fox News' Peter Doocy. 'Why would you characterize it as awkward? They have regular lunches. They meet and talk regularly.' \n\nJean-Pierre then pointed to Biden and Harris' joint appearance Monday to mark Veterans Day at Arlington National Cemetery. \n\n'Did you see the show of force together?' she asked. \n\nWhile she said she didn't want to address the 'premise of this question' she said Biden and Harris 'had lunch today.' \n\n'They've had lunch many times,' she added. 'They had an opportunity to discuss the last 70 days or so of this administration, how important it is to get things done for the American people, and that is their focus. That is genuinely their focus.' \n\nOn Monday, Harris looked somber as she walked alongside the 81-year-old president to a wreath-laying ceremony at Arlington National Cemetery. \n\nBut it was first lady Dr. Jill Biden's stone-faced expression as she sat next to Harris that prompted all sorts of online chatter. \n\nWhile there had been some bad blood between the two women after Biden's first debate appearance alongside Harris in Miami in June 2019 - Dr. Biden officially campaigned for Harris in run-up to last Tuesday's election. \n\nAs for the president, he was largely sidelined by the end of the campaign cycle due to accidentally calling Trump supporters 'garbage.' \n\nThe White House pushed that he was referring to a Trump-aligned comedian as 'garbage' after the comic, Tony Hinchcliffe, insulted the entire island of Puerto Rico at the Republican's Madison Square Garden rally. \n\nThere was even a battle between the Biden press shop and the White House stenographers office after Biden's press aides changed the punctuation in a transcript to suggest Biden was only calling one Trump supporter - the comedian - 'garbage,' as opposed to every Trump supporter. \n\nThe now president-elect compared it to how Hillary Clinton called his MAGA movement faithful 'deplorables' ahead of her 2016 loss to him. \n\nEight years later, Democrats are licking their wounds again. \n\nTrump is headed to Washington, D.C. on Wednesday for meetings on Capitol Hill and then the White House for the traditional meeting between the current president and the president-elect.","summary":"White House press secretary Karine Jean-Pierre was asked Tuesday if President Joe Biden and Vice President Kamala Harris' post-election lunch at the White House was 'awkward.'","url":"https://www.dailymail.co.uk/news/article-14075073/karine-jean-pierre-awkward-lunch-joe-biden-kamala-harris.html","image":"https://i.dailymail.co.uk/1s/2024/11/13/01/92005371-0-image-m-77_1731459668970.jpg","video":null,"publish_date":"2024-11-13 01:04:04","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.212},{"id":264424586,"title":"Outspoken Rubio: Anti-Russia, Ready to soften for Trump’s foreign policy","text":"The candidate for the post of US Secretary of State in the new Donald Trump administration, Marco Rubio, “Iʼm not on the side of Russia, but unfortunately the reality is that the war in Ukraine will end through negotiations,” Rubio says according to media.\n\n“Despite Mr. Rubio's history of using harsh language about Russia, he is likely to go along with Mr. Trump's expected plans to pressure Ukraine to find a way to reach an agreement with Russia,” media said.\n\nMedia recalls that Rubio is also one of the most “outspoken senators” advocating for the need for the United States to be more aggressive towards China.\n\nAccording to Euro News In April, Rubio voted against a $95 billion (€89,4bn) aid bill for Israel, Ukraine, and Taiwan, which passed overwhelmingly through the Senate despite his resistance.\n\nRubio argued that although he supported aid in principle, he wouldn't support the bill due to the US not doing enough to combat domestic issues, such as investing in border security, signaling his support, like Trump, for the US becoming further isolationist.\n\nPreviously, WSJ, wrote that those close to US President-elect Donald Trump expect him to appoint Florida Republican Senator Marco Rubio as Secretary of State.\n\nAccording to American media, businessman Vivek Ramaswamy, Tennessee Senator Bill Hagerty, who previously served as the US Ambassador to Japan under Trump, and former US Ambassador to Germany Richard Grenell is also being considered as possible candidates for the post.\n\nMarco Rubio, 53, has been a senator since 2011. The media reported that Trump considered Rubio as a candidate for vice president, but ultimately chose Ohio Senator James David Vance. Rubio adheres to the position of negotiations regarding Ukraine, believing that this will help end the conflict. He was among 15 Republican senators who voted against allocating $95 billion in military aid to Ukraine, Israel, and Taiwan. Nevertheless, the bills were passed by both houses of Congress and signed by President Joe Biden.","summary":"The candidate for the post of US Secretary of State in the new Donald Trump administration, Marco Rubio, “Iʼm not on the side of Russia, but unfortunately the reality is that the war in Ukraine will end through negotiations,” Rubio says according to media. “Despite Mr. Rubio's history of using harsh language about Russia, he [&#8230;]","url":"https://easternherald.com/2024/11/13/outspoken-rubio-anti-russia-ready-to-soften-for-trumps-foreign-policy/","image":"https://easternherald.com/wp-content/uploads/2024/11/Donald-Trump-greets-Marco-Rubio.jpeg","video":null,"publish_date":"2024-11-13 01:02:12","author":"Europe Desk","authors":["Europe Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.067},{"id":264424518,"title":"Trump says Musk, Ramaswamy to lead new Department of Government Efficiency","text":"President-elect Donald Trump announced Tuesday that billionaire Elon Musk and businessman Vivek Ramaswamy will head up a new agency known as the Department of Government Efficiency.Trump in a statement said the two \"will pave the way for my Administration to dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies - Essential to the 'Save America' Movement.\"In his own statement, Musk said the new agency \"will send shockwaves through the system, and anyone involved in Government waste, which is a lot of people!\"Musk was a major part of Trump's reelection campaign effort, while Ramaswamy ran against Trump in the Republican primary before endorsing him. The department's acronym, DOGE, is also a dog meme that inspired Dogecoin, a cryptocurrency that was created as a joke and is credited with being the first meme coin.This is a developing story and will be updated.","summary":"Trump in a statement said the two will work to \"dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies.\"","url":"https://www.cbsnews.com/news/trump-elon-musk-vivek-ramaswamy-new-department-of-government-efficiency/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/13/02c840d2-d69d-4d04-89ba-ae769c161dde/thumbnail/1200x630/eb6c153b9a046197c2685846a9065bbf/gettyimages-2183791262.jpg?v=f619a2fc2fe5c36254958031a1f767d9","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3325651_hls/master.m3u8","publish_date":"2024-11-13 01:00:16","author":"Faris Tanyos","authors":["Faris Tanyos"],"language":"en","category":"politics","source_country":"US","sentiment":-0.097},{"id":264425052,"title":"California high school teacher caught in profanity-laced rant against Trump put on administrative leave","text":"A California high school teacher has been put on administrative leave after he was captured warning students they could be put in \"concentration camps\" because of President-elect Donald Trump's win and blaming \"racist\" voters and \"the patriarchy\" for Vice President Kamala Harris' defeat. American Culture Project senior fellow Corey DeAngelis shared audio of the fiery rant taken by a student in the teacher's classroom at Valley View High School in the Moreno Valley Unified School District and posted it to X. In the audio clips, the unnamed teacher warns students that they could end up in \"concentration camps\" or with \"no human rights\" because of Trump. \"This sh— is not a f— game. Does that make sense everybody? I cannot emphasize this enough. Can you end up in a concentration camp in your lifetime? Yes! Can you end up with no human rights? Yes. Will it happen to you? Most likely not. Which is a good thing, but has Donald Trump quoted Hitler? Yes. Does he embody some of Hitler’s ideas? Yes,\" the teacher said. IDAHO HIGH SCHOOL TEACHER UNDER INVESTIGATION AFTER ALLEGEDLY WISHING ‘UNWANTED PREGNANCY’ ON TRUMP SUPPORTER \"Donald Trump won because we have low voter turnout…he won because White women didn't show up and vote for Kamala Harris. He won because Black men and Brown men didn't show up to vote for Kamala Harris. Let me tell you, I know a lot of Latino men on this campus, adults and students, that love Donald Trump and he has called their mothers rapists. He has called their fathers rapists….and they did vote for him,\" he continued. \"I know a lot of Latino men that wish they were White, and they will never admit it to you. A lot of your fathers. A lot of your uncles. A lot of your grandfathers. God, they want to be White so bad but they never will be. I hate that sh—. I hate Latino men that oppress the women in their family, their own daughters, and they turn around and vote for a man that wants to oppress them,\" he said. \"I love being Mexican-American. I love my community. God, I f—ing hate the patriarchy. If you're a young man right now in front of me, I hope you hate it too….You get the privilege of not being born with a uterus so it doesn't affect you,\" he continued. \"I'm so f—ing sorry guys. You deserve better. Look at me! YOU DESERVE BETTER!\" \"Do you have privilege because you live here? YES! You're not a five-year-old girl in Arkansas whose the only African American in her class and whose great grandfather was lynched to death during the Civil Rights movement. You got a f— ton of privilege living in this great state. This election is going to affect billions of people! You're very lucky to be where you're at. Because there's some poor Palestinian boy in Michigan who is going to get beat up today and assaulted with his nose broken,\" he claimed. UNIVERSITIES COME UNDER FIRE FOR CANCELING CLASSES, PROVIDING SAFE SPACES TO STUDENTS UPSET BY TRUMP'S VICTORY The teacher went on to slam Trump as \"treasonous scum\" before blaming racism and sexism on Harris' defeat. \"When Joe Biden dropped out and Kamala took over, I cried for a week nonstop. Because I knew what? I knew what? I knew that we got the best candidate in the entire country, and it was a brown woman, people wouldn't vote for her. I knew there were White people and non-White people that were men that would show up and would rather vote for literally anybody except someone with a uterus who has melanin,\" he said. \"We all deserve better. You now know what this country is. Is our country racist? Is our country patriarchal? Can we change it? Maybe,\" he continued. The Moreno Valley Unified School District has not publicly identified the teacher but did confirm the classroom incident occurred in a comment to Fox News Digital. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"We were recently made aware of an incident at one of our high schools, in which a staff member's discussion about the election results turned unprofessional. We do not condone the behavior that occurred, and an immediate investigation has been launched. The staff member involved has been placed on administrative leave pending the outcome of this review,\" the district said in a statement.\"We recognize the heightened emotions surrounding the current political climate, and we deeply value the diversity of our community, which encompasses a wide range of perspectives and beliefs. Our goal is to foster a respectful and inclusive learning environment that supports all students.\" \"We appreciate those who came forward to share their concerns and inform us of the situation. By working together, we can continue to cultivate a positive and supportive educational experience for all students in our Moreno Valley Unified School District,\" the statement concluded. CLICK HERE TO GET THE FOX NEWS APP","summary":"A California high school teacher was placed on administrative leave after he unleashed a fiery rant in the classroom about President-elect Trump&apos;s election win.","url":"https://www.foxnews.com/media/california-high-school-teacher-caught-profanity-laced-rant-against-trump-put-administrative-leave","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/trumpschool.png?ve=1&tl=1","video":null,"publish_date":"2024-11-13 01:00:14","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","source_country":"US","sentiment":-0.179},{"id":264424826,"title":"Why Trump voters should be held accountable for their choice","text":"For now, I’m not getting involved in the debate over what Kamala Harris did wrong. For one thing, whatever conclusions are drawn now will almost certainly be forgotten by the time of the next election. For another, the debate takes vital attention away from the choice of the majority of American voters, which is to say, their terrible choice. \n\nWhy did they break for Donald Trump? Lots of worthy people are going to spend lots of time exploring that question. I won’t, though. What I know is that Trump campaigned on easily proven lies. What I also know is his supporters chose to believe them. What I care about now are the consequences of that choice, and those consequences are going to be bad for all of us, including everyone who voted for him.\n\nYesterday, the president-elect said among the first things he’s going to do is eliminate the US Department of Education. That agency not only sends federal money to local school districts, it makes sure children are treated equally. This is usually understood in terms of race, but special-education is protected too, and it needs it. There was a time in American history when special-needs kids were told to sink or swim.\n\nMy kid is one of those kids, and if the funding and protection she now has disappears, I’m going to take that personally. I’m going to blame everyone who supported Trump. I won’t care if they didn’t believe he’d follow through on his pledge. I won’t care if they didn’t know about it. I won’t care if they were lied to by the rightwing media apparatus. I won’t care if the kids of Trump voters are themselves victims of their parents’ bad choices. I’m going to blame them and I will be right to. \n\nIgnorance is no defense in law. \n\nIt should be no defense in politics either. \n\nTrump has also promised to impose punishing tariffs on imported goods from countries like China and Mexico. Tariffs are a tax and every adult knows how a tax works. Yes, some of his supporters pretended not to know that importers pass that cost on to consumers. But whether they did or didn’t is going to be irrelevant to me when I’m paying two or three times more for necessities like food and clothing. \n\nAs I’m standing in the checkout at Stop & Shop, sticker-shocked for the umpteenth time, I’m not going to be wondering what Kamala Harris could have done to persuade white working-class Americans to vote for her. I’m not going to feel sympathy for them, knowing that they decided to impoverish themselves out of spite and resentment. No, I’ll be too busy cursing them for the titanic assholes they are. \n\nTrump has also promised to deport millions of so-called illegal immigrants. He said he’ll only go after “the bad ones” and his supporters, even some Latinos, decided to believe a liar. But I’m not going to care how they came to that decision if the government starts snatching taxpayers out of their homes, arresting and detaining whole families, including US citizens, in the insane belief that doing so is going to make America great again. Why should I care about why they voted the way they did when the consequence of that choice brings chaos to communities, decimates the labor supply and raises prices?\n\nTrump has denied it, but his Republicans are looking forward to taking another crack at repealing the Affordable Care Act. Tens of millions of Americans depend on Obamacare, including independent businesspeople, like me, who could not do what we do without the law. Voters who supported Trump are included in that number, but again, it does not matter to me whether they knew a vote for him was a vote for abolishing affordable insurance. I tend to lose interest in the reasons behind another person’s choices if those choices ruin me. \n\nThe conventional wisdom is that Trump inflamed resentments in order to win. What’s missing from that story is that the resentments are over race, or rather racism. Fact is, lots of white people feel like nonwhite people are taking something from them when they do better for themselves. Trump has made an art form out of getting white people to believe nonwhite people are robbing them, making them poorer, even when the economy is rapidly benefiting those same white people. \n\nWell, when it comes to resentment, you haven’t seen anything yet.\n\nIf Trump does what he says, by the time he’s done, America is going to be poorer, sicker, weaker and more chaotic. In some cases, he will have done irreparable harm, as he did last time he was president, including to the people who supported him. And he will have done it because … well, it doesn’t matter. They made their choice and it was terrible.\n\nAnd the rest of us will be right to resent it.","summary":"For now, I’m not getting involved in the debate over what Kamala Harris did wrong. For one thing, whatever conclusions are drawn now will almost certainly be forgotten by the time of the next election. For another, the debate takes vital attention away from the choice of the majority of American voters, which is to say, their terrible choice. \n\nWhy did they break for Donald Trump? Lots of worthy people are going to spend lots of time exploring that question. I won’t, though. What I know is that Trump campaigned on easily proven lies. What I also know is his supporters chose to believe them. What I care about now are the consequences of that choice, and those consequences are going to be bad for all of us, including everyone who voted for him.\n\nYesterday, the president-elect said among the first things he’s going to do is eliminate the US Department of Education. That agency not only sends federal money to local school districts, it makes sure children are treated equally. This is usually understood in terms o","url":"https://www.alternet.org/alternet-exclusives/trump-voters-held-accountable/","image":"https://www.alternet.org/media-library/image.webp?id=54490709&width=1200&height=600&coordinates=0%2C133%2C0%2C134","video":null,"publish_date":"2024-11-13 01:00:02","author":"John Stoehr","authors":["John Stoehr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.382},{"id":264424674,"title":"Trump Names Elon Musk, Vivek Ramaswamy to Lead New Efficiency Department","text":"President-elect Donald Trump on Tuesday announced that Elon Musk and Vivek Ramaswamy will join his administration to lead a proposed new department focused on improving efficiency, reducing waste, and cutting excess regulation.\n\n“I am pleased to announce that the Great Elon Musk, working in conjunction with American Patriot Vivek Ramaswamy, will lead the Department of Government Efficiency (”DOGE“),” Trump said in a statement.\n\n“Together, these two wonderful Americans will pave the way for my Administration to dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies Essential to the ‘Save America’ Movement.”\n\nTrump suggested that the proposed department would create an entrepreneurial approach to government “never seen before” and would send shockwaves through Washington.\n\nThe department would have the edict of providing advice and guidance from outside the government, working in step with the White House and Office of Management and Budget “to drive large scale structural reform.”\n\n“I look forward to Elon and Vivek making changes to the Federal Bureaucracy with an eye on efficiency and, at the same time, making life better for all Americans,” Trump said. “Importantly, we will drive out the massive waste and fraud which exists throughout our annual $6.5 Trillion Dollars of Government Spending. They will work together to liberate our Economy, and make the U.S.Government accountable to ‘WE THE PEOPLE.’”\n\nThe to-be-established DOGE would aim to conclude its work to create a “smaller government” by July 4, 2026.","summary":"The proposed Department of Government Efficiency will offer advice on improving efficiency, reducing waste, and shrink the size of government by July 2026.","url":"https://www.theepochtimes.com/us/trump-taps-elon-musk-and-vivek-ramaswamy-to-lead-new-efficiency-department-5758739","image":"https://img.theepochtimes.com/assets/uploads/2024/11/13/id5758746-FotoJet-1-elon-vivek-300x180.jpg","video":null,"publish_date":"2024-11-13 00:58:55","author":"Caden Pearson","authors":["Caden Pearson"],"language":"en","category":"politics","source_country":"us","sentiment":0.133},{"id":264423972,"title":"Unification council official says N. Korea would not open dialogue with US while being paid by Russia","text":"The secretary general of South Korea's presidential advisory body on unification said Tuesday that North Korea would not engage in dialogue with the US as long as it is being paid by Russia for its troop deployment and other forms of military cooperation.\n\nTae Yong-ho, the secretary general of the Peaceful Unification Advisory Council, made the remarks amid expectations that US President-elect Donald Trump could revive his personal diplomacy with North Korean leader Kim Jong-un after he takes office in January.\n\n\"I think as long as Kim Jong-un is paid (for) his soldiers and military cooperation with Russia, he would not open dialogue with America or China because now currency keeps on coming,\" Tae said in English during a podcast hosted by the Washington-based Center for Strategic and International Studies.\n\n\"That's why he may concentrate all on the relations with Russia, but if the Ukraine war is finished, then Kim Jong-un may come back to his relations with China and whatever,\" he added.\n\nHe called for the upcoming US administration to make clear to North Korea that denuclearization of the Korean Peninsula is its primary goal.\n\n\"I think the new administration of America should continue to say to North Korea that denuclearization of North Korea is an unchangeable goal of America, (that) America would never compromise on this goal. That is, I think, very important,\" he said.\n\n\"I think America should try every possibility to invite China to be on the (side) of America and the South Korean side.\"\n\nTouching on North Korea's troop deployment to Russia, Tae noted that the dispatch has been kept a secret in the reclusive state, as observers have started to mention the possibility of public pushback that could arise in the event of heavy North Korean casualties in the fighting against Ukrainian forces.\n\n\"How long can this secret be kept ... it could be dependent on how many causalities North Korea would suffer,\" he said.\n\nHe also warned that if families of the deployed North Korean soldiers receive death notices or \"sacrifice\" notes from the military, they would be \"very\" upset.\n\n\"Because inside North Korea now, even North Korea has a very low birth rate. So there is only one child or two children in each family,\" he said. \"So parents cannot accept that their sons were killed not in defense of North Korea but in defense of Russia.\"\n\nTae pointed out that if North Korean troops' involvement in the war turns out to be successful, the reclusive leader might use the case to justify his regime's development of nuclear weapons.\n\n\"If he is successful in the Ukraine case, he may say to the leaders and North Korean people that because of nuclear weapons, North Korea can even take these troops out of North Korea and help a big country like Russia, and that even a big country like Russia comes to ask for help to North Korea,\" he said.\n\n\"(Kim would say) because of these nuclear weapons, he can send conventional weapons out of North Korea and even soldiers in return for huge hard currency. He may do a lot of things to justify his nuclear development domestically.\" (Yonhap)","summary":"The secretary general of South Korea&#039;s presidential advisory body on unification said Tuesday that North Korea would not engage in dialogue with the US as long as it is being paid by Russia for its troop deployment and other forms of military cooperation. Tae Yong-ho, the secretary general of the Peaceful Unification Advisory Council, made the remarks amid expectations that US President-elect Donald Trump could revive his personal diplomacy with North Korean leader Kim Jong-un after he ta","url":"https://www.koreaherald.com/view.php?ud=20241113050146","image":"https://res.heraldm.com/content/image/2024/11/13/20241113050148_0.jpg","video":null,"publish_date":"2024-11-13 00:58:38","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"kr","sentiment":-0.36},{"id":264424164,"title":"Trump re-election won’t affect Liberal government’s climate strategy: Guilbeault","text":"Morneau said he felt Canada should be more aligned on climate policy with the Trump administration set to take office. Trump has been bullish on expanding fossil fuel production and pulling back on renewables like wind and solar.\n\n“I respectfully disagree with (former minister) Morneau who, as you know, used to be my colleague,” Guilbeault said.\n\n“The time to fight climate change is now. It’s not tomorrow, it’s not the day after tomorrow. Climate impacts won’t wait.”\n\nGuilbeault also announced the launch of a new financing platform to help direct funds to climate initiatives.\n\nFundamentally, the platform is designed to make it easier to secure long-term loans for climate projects. A quarter of it is dedicated to developing countries and small island states.\n\nGuilbeault said the government has committed $160 million to the fund, with a goal of raising up to $2 billion through the private sector. Guilbeault said, so far, they’ve secured $800 million in total, but he couldn’t provide details on who’s funding it.\n\nOther questions remained unanswered with regard to exactly what kind of climate projects the money will help fund, or when the money will flow out the door.\n\nIn a statement, FinDev Canada, the Crown corporation that is managing the fund, said more information would be available later this week.\n\nOur website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our politics newsletter, First Reading, here.","summary":"Guilbeault's comments came two days after ex-Liberal minister Bill Morneau said he didn't think it was the right time for Canada to put caps on greenhouse gas emissions","url":"https://nationalpost.com/news/politics/climate-donald-trump-steven-guilbeault","image":"https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/11/Steven-Guilbeault-1.jpg","video":null,"publish_date":"2024-11-13 00:57:56","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.361},{"id":264424542,"title":"The new Trump administration is considering building immigrant detention centers close to big cities in the U.S.","text":"The incoming Trump administration is considering locations and talking to private prison companies about drastically expanding immigrant detention centers that would hold immigrants before they are deported as part of President-elect Donald Trump’s promised mass deportation plan, two sources familiar with the planning told NBC News.\n\nThe goal is to double the number of Immigration and Customs Enforcement detention beds — 41,000 are now allocated by Congress — to hold vast numbers of migrants for short periods of time while they await deportation after their arrests inside the U.S., the sources said. \n\nThe plan would also include restarting the policy of detaining parents with their children, known as family detention, which immigration advocates have criticized and the Biden administration stopped in 2021, the sources said. \n\nSo far, people working on the plans with the Trump transition team are assessing which of the facilities the Biden administration closed could be reopened, taking account of available space in county jails and assessing which areas might need temporary facilities to detain migrants as part of the deportation effort.\n\nTrump’s transition team is looking at how many migrants each region can hold, including in Democratic-controlled metropolitan areas across the country. A source familiar with the plans said they prioritize areas with large migrant populations that lack detention facilities, rather than single out Democratic strongholds.\n\nCities with large populations of migrants — like Denver, Los Angeles, Miami and Chicago — could need additional detention sites built nearby to hold migrants arrested there. The administration might also need to reopen, expand or build new facilities in the Northeast to hold migrants arrested around New York City, Philadelphia and Washington, the source said. \n\nAnother source familiar with the plans said so-called sanctuary policies in Democratic cities should not prevent ICE from expanding detention there. \n\nThe details of the plan open a window into what Trump has promised will be the “largest deportation operation in American history.” Critics of the plan have said he would lack the money, staffing, willingness from countries to take back migrants, flights and detention space to make it a reality. \n\nKaroline Leavitt, a spokeswoman for the transition team, said in a statement: “The American people re-elected President Trump by a resounding margin giving him a mandate to implement the promises he made on the campaign trail. He will deliver.” \n\nTwo of the largest publicly-traded companies in that industry, GEO Group and CoreCivic, have experienced increases in their stock prices. GEO Group and CoreCivic are both publicly traded, and their stocks have increased 69% and 61% respectively since Trump’s election victory.\n\nIn an earnings call Thursday, GEO Group Executive Chairman George Zoley said the company “was built for this unique moment in our company’s — country’s history and the opportunity that it will bring.”\n\nBrian Evans, GEO Group’s chief executive officer, said on the call, “We’re looking at a theoretical potential doubling of all of our services.” \n\nOn CoreCivic’s recent earnings call, CEO Damon Hininger noted that the company already has additional vacant beds in its system that could be used to meet a postelection demand.\n\n“So we are taking proactive steps and working on a plan to activate and make available every single bed that we’ve got in the enterprise,” Hininger said. “And again, that’s about 18,000 beds.”","summary":"The incoming Trump administration is considering locations and talking to private prison&#8230;","url":"https://internewscast.com/news/us/the-new-trump-administration-is-considering-building-immigrant-detention-centers-close-to-big-cities-in-the-u-s/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Incoming-Trump-admin-is-eyeing-new-immigrant-800x430.jpg","video":null,"publish_date":"2024-11-13 00:57:10","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.108},{"id":264424160,"title":"Oil Steadies Near November Lows With Outlook for Demand in Focus","text":"Crude has traded in a relatively tight range since the middle of last month, with traders tracking trends in Chinese consumption, tensions in the Middle East, and the implications of Donald Trump’s re-election to the Oval Office. After the monthly report from OPEC, the US will issue its short-term outlook later Wednesday, followed by the International Energy Agency’s view on Thursday.\n\nReflecting the bearish outlook, timespreads have weakened in recent sessions. While they remain in a backwardated structure — with nearby contracts at a premium to longer-dated ones — the gap has narrowed. Among the most notable is WTI’s prompt spread, which hit the lowest since February earlier this week.\n\n“The oil market appears to be heading for a sizeable surplus in 2025, driven by a combination of decelerating oil demand growth, still-robust non-OPEC supply growth, and OPEC’s ambition to start growing supply as well,” Morgan Stanley analysts including Martijn Rats said in a report. The bank cut its Brent forecasts, with the first-quarter 2025 outlook reduced by $5.50 to $72 a barrel.\n\nTo get Bloomberg’s Energy Daily newsletter into your inbox, click here.","summary":"Oil steadied neared its lowest level this month, with the outlook for demand in focus after OPEC cut projections again on China’s slowdown.","url":"https://financialpost.com/pmn/business-pmn/oil-steadies-near-november-lows-with-outlook-for-demand-in-focus","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/11/775957505.jpg","video":null,"publish_date":"2024-11-13 00:56:29","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"ca","sentiment":-0.136},{"id":264424940,"title":"Donald Trump says pal Elon Musk WILL be in his cabinet in new department after Don’s election triumph left Dems reeling","text":"DONALD Trump has given pal Elon Musk a top position in his upcoming cabinet.\n\nThe billionaire tech tycoon will lead Trump's newly forged Department of Government Efficiency - as \"secretary of cost cutting\".\n\nTrump said in a statement on Tuesday that he will \"pave the way for my Administration to dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies\".\n\nMusk will work as co-chair of the new team alongside prominent Republican Vivek Ramaswamy.\n\nThe Tesla CEO's proximity to Trump is set to make him one of the most powerful people on the plant.\n\nHe has been dubbed Trump's \"shadow vice president\", and went all in to support and campaign for the former president.\n\nMusk helped fund the Republican's election victory through his pro-Trump political action committee America PAC.\n\nHe was a regular fixture towards the end of Trump's campaign trail and even gave out huge cash prizes to voters who signed petitions relating to Republican causes.\n\nTrump has previously said Musk would be given a role as \"secretary of cost cutting\", heading up the new Department of Government Efficiency (DOGE).\n\nIt means Musk could have wide-reaching powers to cut down on the US federal bureaucracy that he and Trump have claimed is holding America back.\n\nThe Space X founder has been a key fixture of Trump's campaign and was pictured with his four-year-old son at the Mar-a-Lago election party.\n\nTrump even called him in to join a family photo taken at the Palm Beach mansion.\n\nDuring his victory speech he gave Musk a special thanks - telling crowds \"We have a new star - a star is born, Elon [Musk]!\"\n\nHe said: \"He is an amazing guy, we were sitting together tonight.\n\n\"He spent two weeks in Philadelphia and different parts of Pennsylvania campaigning.\"\n\nThe 78-year-old went on to praise Musk for his \"super-genius\" and described how he was in awe watching his Space X rocket return to Earth without a hitch.\n\n\"He sent the rocket up two weeks ago and I saw that rocket, I saw it coming down it was beautiful,\" Trump said.\n\n\"Only Elon can do this.\"","summary":"","url":"https://www.thesun.co.uk/news/31676663/elon-musk-donald-trump-cabinet-position/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/11/2024-elon-musk-worlds-richest-947107740_cb9144.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-11-13 00:56:28","author":"Ellie Doughty","authors":["Ellie Doughty"],"language":"en","category":"politics","source_country":"gb","sentiment":0.156},{"id":264423708,"title":"MAGA Wants DeSantis to Appoint Lara Trump to Senate","text":"Calls are circulating online for Florida Governor Ron DeSantis to appoint Lara Trump, daughter-in-law of President-elect Donald Trump, as the Sunshine State's next Senator.The push follows reports that Florida Senator Marco Rubio is expected to be announced as Trump's Secretary of State in the coming days. Three people familiar with the matter told The New York Times, however, that Trump may change his mind at the last minute about appointing Rubio.Alabama Senator Katie Britt, who was endorsed by Trump while running for her first term in 2022, publically called for Lara Trump to fill Rubio's seat in an interview with Axios published Tuesday morning, saying that Lara \"understands the America First agenda.\"\"For me, I think she would be a tremendous pick, a voice for hard-working families and another mom of school-aged kids that understands what we're up against, and that's to fight to protect the American dream,\" Britt said of Lara Trump.Florida Representative Anna Paulina Luna echoed support for Lara Trump in a series of posts on X, writing Tuesday that Lara \"will keep the seat and avoid a messy primary for FLORIDA\" in 2026.Luna, a strong all of former President Trump in Congress, also reposted a statement from conservative political podcaster Benny Johnson, who wrote on X,\"Lara Trump is the right person to fill\" Rubio's seat.\"Lara has a killer instinct for reform of broken systems,\" Johnson wrote in part while explaining his support for Lara Trump. \"Without her sharp leadership at the RNC, Trump would not have won the 2024 election in a landslide.\"\"As a Florida resident, I know my voice would be represented in the US Senate best by Lara Trump,\" Johnson added. \"Judging by the number of calls I'm receiving about it--I'm not alone.\"Telsa and SpaceX CEO Elon Musk also reacted to calls to put Lara Trump in the Senate, calling her \"genuinely great\" in a post to X. Caitlyn Jenner responded to Musk's post, \"One of the best [people] I know.\"Newsweek reached out to DeSantis' office via email on Tuesday for comment.Could Lara Trump Replace Senator Rubio?DeSantis will be tasked with filling Rubio's seat if the conservative lawmaker is pulled for Trump's next administration. Rubio was reelected in 2022, meaning his replacement would serve the remainder of his term until 2028.According to CBS News' Jim DeFede, who cited conversations with \"multiple Republican sources,\" among those top of the list to replace Rubio includes DeSantis' chief of staff, James Uthmeier, who could serve in the Senate role until 2026 until a special election can be held to fill the seat. That would give DeSantis a chance to run for the seat himself after the end of his current gubernatorial term.Florida Lieutenant Governor Jeanette Nunez is also reportedly on DeSantis' list, per DeFede's reporting. There is also speculation that DeSantis could resign as governor to give Nunez the position, allowing her to appoint him to the open Senate seat before 2026.DeSantis ran for the 2024 GOP presidential nomination but dropped out of the race in January. He subsequently threw his support behind President-elect Trump, who at the time was the frontrunner for the nomination.Lara Trump's political rise came to a head in the spring after she was selected as co-chair of the Republican National Committee, with the help of her father-in-law's approval. GOP communications specialist T.J. McCormack told Newsweek this week that Lara may be the most \"underrated political success story\" in recent years.She and her husband, Eric Trump, bought a house in Palm Beach County in southern Florida in 2021, according to the Miami Herald. She is originally from North Carolina.","summary":"DeSantis may be tasked with filling Senator Marco Rubio's seat if he is selected for Trump's next administration.","url":"https://www.newsweek.com/ron-desantis-lara-trump-marco-rubio-florida-senate-1984826","image":"https://d.newsweek.com/en/full/2519405/maga-wants-desantis-appoint-lara-trumptosenate.jpg","video":null,"publish_date":"2024-11-13 00:52:43","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"US","sentiment":0.343},{"id":264424348,"title":"Robert Griffin III wants end to Trump-supporter hatred: 'Not how you unite people'","text":"In a time of divisiveness following the election, a former NFL quarterback is trying to play peacemaker. Robert Griffin III posted on X last week that \"Black Men do support Black Women\" after MSNBC host Joe Scarborough called out \"misogyny from Black men.\" \"Stop tearing down and blaming black men for everything under the sun when it comes to Black Women,\" the former Baylor star wrote on X. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM On Tuesday, one week post Donald Trump's victory, Griffin again preached unification, this time calling out those who are quick to lambaste Trump supporters. \"Dear America, this is a safe space. Calling any of the 75 Million Americans who voted for Donald Trump bigots is not how you unite people,\" Griffin posted on X. \"How would you build a community where Black, White, Native American, Hispanic, Asian and all people celebrate their unique cultural backgrounds and beliefs without divisiveness?\" Democrats and anti-Trump critics spouted every type of analysis to try to pinpoint the reason Harris failed to win the White House nearly four months after she was appointed to take President Biden’s place in the presidential race after he dropped out. Simultaneously, many Harris supporters on social media are unfollowing or cutting off those who voted for Trump in his third run for president. Griffin criticized Trump and President Biden during their first debate on CNN June 27. \"My God, this Presidential debate proves that we need younger presidential candidates,\" Griffin wrote on X that night. Griffin, though, said he felt Trump won the election upon the first assassination attempt on his life. CLICK HERE TO GET THE FOX NEWS APP \"Hey man, I don't really care how much you love or hate President Donald Trump. Now is not the time to play politics. Now's the time to pray for Donald Trump, his family and the families of those who lost someone in the shooting. We got people out here who are so focused on the fact that they think that this assassination attempt was staged, and they are forgetting about the fact that someone died,\" Griffin said in a video shortly after the Butler, Pennsylvania, rally. Fox News' Ryan Gaydos and Jackson Thompson contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Robert Griffin III is calling out those who lambaste Trump supporters, saying continuing to call them &quot;bigots&quot; will do nothing to &quot;unite people.&quot;","url":"https://www.foxnews.com/sports/robert-griffin-iii-wants-end-trump-supporter-hatred-not-how-you-unite-people","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Robert-Griffin-III.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-13 00:52:11","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"US","sentiment":0.129},{"id":264423714,"title":"Keir Starmer unveils yet ANOTHER eco target at thinly attended COP29 climate summit - and Brits may have to eat less meat in order to hit it","text":"Sir Keir Starmer unveiled yet another green target yesterday - triggering warnings that people will have to give up meat and dairy or replace their gas boilers to meet it.\n\nThe Prime Minister announced the goal to reduce emissions at the UN climate summit Cop29 - but vowed that he would not tell people how to live their lives.\n\nThe pledge to cut UK greenhouse gas emissions by 81 per cent by 2035 is in line with the recommendation from independent advisers the Climate Change Committee (CCC). However, they said that this goal could only be met by people reducing meat and dairy consumption and travel.\n\nAsked whether this would be the cost of the new target yesterday, the Prime Minister said: 'What we're not going to do is start telling people how to live their lives. We're not going to start dictating to people what they do.'\n\nAsked again whether it was really possible to meet the goal without people changing their lifestyles, he said: 'Yes, of course it is.'\n\nAsked about the CCC's recommendations, he said: 'The target is my target and the plan is my plan, I'm not borrowing from somebody's else's plan.'\n\nBut the Tories warned yesterday that the pledge will lead to 'sacrifice and hardship' and would require a shift away from foods with a high carbon footprint and petrol and diesel vehicles.\n\nDuring energy questions yesterday, shadow energy secretary Claire Coutinho told MPs that the pledge made the UK's 'already stringent carbon emission targets even higher'.\n\n'That's despite the fact that we're only one per cent of global emissions, and whilst the leaders of the world's highest emitting countries, making up over 60per cent of emissions, are not attending,' she added.\n\n'The Climate Change Committee has said this target will require, for an example, an accelerated shift away from meat and dairy, less travel and a gas boiler ban for the British people, and yet the Government's approach would see our reliance on Chinese imports - a country which is 60per cent powered by coal - go through the roof.\n\n'So does the Minister agree that an approach which is asking for more sacrifice and hardship from the British people in return for more goods from one of the world's largest carbon emitters would mean less jobs in Britain and more carbon in the atmosphere?'\n\nSir Keir was also asked if he was 'disappointed' that there were so few leaders of major world countries present at the Cop29 summit in Baku, Azerbaijan.\n\nThe heads of the biggest polluters were notably absent, including Chinese premier Xi Jinping, US President Joe Biden and Indian PM Narendra Modi, while many EU leaders also stayed away.\n\nBut Sir Keir insisted that the UK was there to 'show leadership' and said he wanted to be 'ahead of the game' rather than 'in the middle of the pack'.\n\n'The race is on for the clean energy jobs of the future, the economy of tomorrow,' he said.\n\nThe summit's location in Azerbaijan has also prompted world leaders to stay away due to human rights concerns.\n\nIts president Ilham Aliyev yesterday said that oil was a 'gift of God' and its Cop chief executive was filmed promoting fossil fuel deals.\n\nThere have been fears that the Cop summit will be overshadowed by the election of Donald Trump who has threatened to pull out of the historic Paris agreement to limit global warming by reducing emissions.\n\nThe 81per cent target, which is based on reducing emissions compared with 1990 levels, forms the UK's latest formal commitment to reducing its greenhouse gas emissions.\n\nIn 2020, when the CCC set the goal for 2035, it detailed a series of changes that would need to be made to life in the UK to achieve it.\n\nThese included phasing out gas boilers by 2033 and ending sales of new petrol and diesel vehicles including hybrids by 2032.\n\nIt also said that around 10per cent of emissions savings would come from areas such as encouraging people to reduce meat and dairy consumption, slower growth in flights, reductions in car travel and cutting waste.\n\nThe UN's climate change chief Simon Stiell hailed the plans, saying they set a powerful example to other G20 nations.\n\nCharities and academics also welcomed the goal, but cautioned that the Government would need a proper plan to meet the target.\n\nTanya Steele, chief executive at WWF, said the UK had positioned itself as a climate leader but said it needed to back up the target with 'solid and credible delivery plans'.\n\nDr Caterina Brandmayr, from the Grantham Institute - Climate Change and the Environment, Imperial College London, said the target was 'what the world needs' but said it needed to back it up with strong policy and investment plans to show it was serious.\n\nMs Coutinho later said: 'The Climate Change Committee has said Keir Starmer's new target would mean Brits would need to eat less meat and travel less by air and car.\n\n'This is on top of Ed Miliband's mad approach to energy which is going to send bills soaring. All that would happen is that we would end up importing more from China, the world's largest polluter.'It makes no sense for the climate, the economy or for the British people.","summary":"The Prime Minister announced the goal to reduce emissions at the UN climate summit Cop29 - but vowed that he would not tell people how to live their lives.","url":"https://www.dailymail.co.uk/news/article-14075237/Keir-Starmer-unveils-eco-target-thinly-attended-COP29-climate-summit-Brits-eat-meat-order-hit-it.html","image":"https://i.dailymail.co.uk/1s/2024/11/12/12/91974975-0-image-a-10_1731413729015.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/12/5081926824647279391/1024x576_MP4_5081926824647279391.mp4","publish_date":"2024-11-13 00:51:45","author":"Claire Ellicot,Editor","authors":["Claire Ellicot","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.226},{"id":264424548,"title":"“Rebuilding the Democratic Party: Marianne Williamson Calls for Repentance from Elite Members”","text":"Until the day he died in 1995, if you asked my father who he voted for in any presidential election he said ‘Roosevelt.’ It was gospel in our house that Democrats were the party of the people and Republicans were the economic royalists.\n\nThat was then, and this is now.\n\nThe majority of Americans don’t necessarily see it that way anymore.\n\nThe emotional connection between the American people and the Democratic Party has been deeply frayed; a sense that the Democrats are the unequivocal advocates for working people is no longer a given.\n\nToday, there are millions of politically homeless in America. They’re not diehard Trump supporters, but they wouldn’t call themselves Democrats either. \n\nThe issues they care about were strewn like diamonds on the beach in 2024, and Donald Trump came along and said, ‘Great! I’ll take them!’\n\nThis was a spectacular failure and it was the Democrats’s own fault.\n\nThey discouraged a primary challenge against President Joe Biden, de-amplifying and deriding anyone with the audacity to challenge their supposedly superior wisdom in selecting a candidate to take on Trump.\n\nIt was the Democratic Party that claimed the ‘threat to democracy’ posed by the former president was so great that it entitled them to suppress democracy themselves – and anoint their own candidate.\n\nThis questionable strategy was enabled by Democratic voters who were willing to go along because surely, they must have assumed, the DNC knew what it was doing.\n\nIt also didn’t help that Kamala Harris’s campaign played more to disaffected Republicans than to the Party’s traditional working-class base.\n\nIt’s clear now that the Democrats did not know what they were doing and the elites running the show now have only two choices: Adapt and change or preside over the continuing decline of the Party.\n\nIf there is to be any hope of taking back Congress in 2026, important changes need to be made.\n\nSo far, we’re not hearing much from leaders other than justification and blame, the latter seems to ricochet between blaming Biden and blaming the voters!\n\nThe Democrats need to look in the mirror.\n\nHere is the deal: The political revolution in America today is between populism and the Establishment. The Republican Party allowed right-wing populists to enter their ranks, while the Democratic Party has kept left wing populists at bay.\n\nOne of the reasons the Republican party has been as resilient as it is, is because many of its leaders have a background in business. They believe: If it doesn’t work on Tuesday and it still doesn’t work by Thursday, then you sure as hell better change things by Saturday or your business might be gone.\n\nThe Democratic Party’s sensibility is pretty much the opposite: If it doesn’t work on Tuesday and it doesn’t work on Thursday, and even if the whole thing crumbles on Saturday, that’s just the way things we do things and maybe you won’t notice. But we sure did notice.\n\nMy suggestion to Democratic leaders is go on a listening tour of America. Come off your high horses. Don’t just take their questions; ask some of your own.\n\nAdmit that you’ve lost the voters’s trust and say you’d be grateful if people would explain what they’re going through and how the government might help them.\n\nYour message to the voters now needs to be, ‘Please come home.’ And performative measures will not be enough. Show some real humility.\n\nThe party’s main message in 2024 was: ‘Send money! We need your help!’. But given how panicked Americans are now about the price of cereal, your message should be, ‘How can we help you?’\n\nThe Democrats’s power never lay in money; it lay in their values, and they left those on the floor.\n\nThere were too many DC, LA, NYC, Sun Valley, and Martha’s Vineyard cocktail parties and fundraisers, I’m afraid.\n\nAt the very least you guys might have stopped by the kitchen on the way out and asked how things were going for the cooks, the servers, and the caterers.\n\nOnly serious contrition will be enough to restore the bonds that have been broken and reclaim the soulfulness of the Democratic party.\n\nThis moment can lead to a rebirth for the party, but only if the Democratic elite are willing to come down a notch.\n\nIf the Establishment allows this to be their bottoming out, they’ll fly high into the 2026 midterms and beyond. But anything less than that and we can all settle in for a long, long stretch of Trumpism.\n\nThe American people deserve so much better.","summary":"Until the day he died in 1995, if you asked my father&#8230;","url":"https://internewscast.com/news/us/rebuilding-the-democratic-party-marianne-williamson-calls-for-repentance-from-elite-members/","image":"https://internewscast.com/wp-content/uploads/2024/11/1731458811_rewrite-this-title-MARIANNE-WILLIAMSON-Democratic-Elites-destroyed-our-party-800x430.jpg","video":null,"publish_date":"2024-11-13 00:47:22","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.329},{"id":264423038,"title":"Donald Trump reveals Elon Musk’s new role in US Government","text":"President-elect Donald Trump has revealed that Elon Musk will lead the cheekily-titled Department of Government Efficiency under his presidency.\n\nThe department, which abbreviates to DOGE, a riff on the cryptocurrency Musk has promoted online, will drive “drastic change” and “send shockwaves through the system”, according to Mr Trump.\n\n“I am pleased to announce that the great Elon Musk, working in conjunction with American patriot Vivek Ramaswamy, will lead the Department of Government Efficiency (“DOGE”),” he said.\n\n“Together, these two wonderful Americans will pave the way for my administration to dismantle government bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal agencies — essential to the “Save America” movement.”\n\nMusk was quoted in the statement from Mr Trump’s campaign, saying: “This will send shockwaves through the system, and anyone involved in Government waste, which is a lot of people!”\n\nMore to come.","summary":"President-elect Donald Trump has confirmed that Elon Musk will take on a new government role under his presidency.","url":"https://thewest.com.au/politics/donald-trump/donald-trump-reveals-elon-musks-new-role-in-us-government-c-16734731","image":"https://images.thewest.com.au/publication/C-16734731/2762dcc540574d1b2216834461cd381dcba11542-16x9-x0y0w3949h2221.jpg?imwidth=1200","video":null,"publish_date":"2024-11-13 00:47:15","author":"David Johns","authors":["David Johns"],"language":"en","category":"politics","source_country":"au","sentiment":-0.072},{"id":264423422,"title":"Donald Trump reveals Elon Musk’s new role in US Government","text":"Camera IconPresident-elect Donald Trump has revealed Elon Musk’s new government role. Credit: Anna Moneymaker/Getty Images\n\n breakingDonald Trump reveals Elon Musk’s new role in US Government\n\nDavid JohnsThe NightlyNovember 13, 2024 8:47AMEmail David JohnsComments","summary":"President-elect Donald Trump has confirmed that Elon Musk will take on a new government role under his presidency.","url":"https://www.perthnow.com.au/politics/donald-trump/donald-trump-reveals-elon-musks-new-role-in-us-government-c-16734731","image":"https://images.perthnow.com.au/publication/C-16734731/2762dcc540574d1b2216834461cd381dcba11542-16x9-x0y0w3949h2221.jpg?imwidth=1200","video":null,"publish_date":"2024-11-13 00:47:15","author":"David Johns","authors":["David Johns"],"language":"en","category":"politics","source_country":"au","sentiment":0.281},{"id":264423096,"title":"Capitol Rioter Pleads Guilty to Charges Expecting Trump to Pardon Him: 'I'm Very Confident I'm at the Top of the List'","text":"A Raleigh, North Carolina man, pleaded guilty on Tuesday to charges stemming from his involvement in the January 6, 2021 Capitol riot, while expressing confidence that he would be pardoned by President-elect Donald Trump.Steve Baker, who entered the Capitol and Speaker Nancy Pelosi's office suite on that day, says he attended as a \"citizen journalist\" and admitted to witnessing attempts to revive Ashli Babbitt after she was shot.In court, prosecutors presented evidence challenging Baker's claim of non-participation, pointing to footage where he suggested he regretted not stealing computers and allegedly confronted police officers.Baker, who faces sentencing in March, voiced optimism that Trump's promises to pardon January 6 defendants would spare him.\"If there are pardons, if his campaign promise is kept, then I'm very confident I'm at the top of the list,\" he said.Federal Judge Christopher Cooper, who presided over the hearing, emphasized the distinction between the rule of law and mob rule displayed on January 6.\"The proceedings in this court have exemplified the rule of law,\" he stated, pushing back on Baker's criticism of the prosecutions.Trump has indicated he may pardon non-violent defendants, though he's clarified that he would evaluate each case individually.Originally published by Latin Times.","summary":"A North Carolina man pleaded guilty to charges stemming from his involvement in the Jan. 6, 2021 riot, while expressing confidence that he would be pardoned by Trump.","url":"https://www.ibtimes.com/capitol-rioter-pleads-guilty-charges-expecting-trump-pardon-him-im-very-confident-im-top-3750741","image":"https://d.ibtimes.com/en/full/4561236/capitol-rioter-pleads-guilty-charges-expecting-trump-pardon.jpg","video":null,"publish_date":"2024-11-13 00:46:13","author":"Morgan Music","authors":["Morgan Music"],"language":"en","source_country":"US","sentiment":0.12},{"id":264422764,"title":"Trump announces Elon Musk, Vivek Ramaswamy to lead new ‘Department of Government Efficiency’","text":"President-elect Donald Trump continued to fill his administration at breakneck speed Tuesday night, tapping SpaceX and Tesla CEO Elon Musk and biotech entrepreneur Vivek Ramaswamy would head up a new ‘Department of Government Efficiency’\n\nIn a statement, Trump likened the effort to the Manhattan Project that produced the atomic bomb and quoted Musk as saying: “This will send shockwaves through the system, and anyone involved in Government waste, which is a lot of people!”\n\n“Together, these two wonderful Americans will pave the way for my Administration to dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies – Essential to the ‘Save America’ Movement,” Trump, 78, said in a statement.\n\nThis is a developing story. Check back for more updates","summary":"\"Together, these two wonderful Americans will pave the way for my Administration to dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies - Essential to the 'Save America' Movement,\" Trump, 78, said in a statement","url":"https://nypost.com/2024/11/12/us-news/trump-announces-elon-musk-vivek-ramaswamy-to-lead-new-department-of-government-efficiency/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/newspress-collage-s720dqfgl-1731458655151.jpg?quality=75&strip=all&1731440681&w=1200","video":"https://cdn.jwplayer.com/videos/kkD2K055-RyIcpnTz.mp4","publish_date":"2024-11-13 00:45:18","author":"Samuel Chamberlain","authors":["Samuel Chamberlain"],"language":"en","category":"politics","source_country":"us","sentiment":-0.146},{"id":264423040,"title":"Donald Trump team’s ominous post sparks fresh concerns about Kevin Rudd’s future","text":"Close navigation menu\n\nSubscriber Exclusive\n\nToday's Paper\n\nWest Rewards\n\nVanishing Cousins\n\nThe West Live\n\nCourt in the Act\n\nReveal sub navigationChevron Down Icon\n\nCourts & Justice\n\nReveal sub navigationChevron Down Icon\n\nWest Coast Eagles\nFremantle Dockers\n\nRugby Union\nHorse Racing\n\nReveal sub navigationChevron Down Icon\n\nHerd On The Terrace\n\nAgriculture\nBulls N’ Bears\n\nReveal sub navigationChevron Down Icon\n\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\n\nReveal sub navigationChevron Down Icon\n\nGreat Southern\n\nPeel/Rockingham\n\nReveal sub navigationChevron Down Icon\n\nEmma Garlett\nSarah-Jane Tasker\nJosh Zimmerman\nDean Alston\nRangi Hirini\n\nPaul Murray\n\nBasil Zempilas\nJoe Spagnolo\n\nReveal sub navigationChevron Down Icon\n\nHealth & Wellbeing\n\nReal Estate\nHouse That!\n\nEntertainment\nReveal sub navigationChevron Down Icon\n\nCelebrity Gossip\n\nCompetitions & Puzzles\n\nReveal sub navigationChevron Down Icon\n\nWestern Australia\n\nWest Travel Club\nPhotography\nTravel Tips\n\nReveal sub navigationChevron Down Icon\n\nSmartphones\n\nTelecommunications\n\nThe West Australian\nToday's PaperPlace an AdWednesday, 13 November 2024\n\n BMW driver ‘lucky to be alive’ after car flips during chaseChevron Right Icon\n\nNewsAustraliaFederal PoliticsTAS NewsTechnologyWorld News\n\nDonald Trump team’s ominous post sparks fresh concerns about Kevin Rudd’s future\n\nWest Rewards External Logo\n\nEnjoy exclusive member discounts, giveaways and competitions with our subscriber rewards program.\n\nFind out moreDon’t miss WA DAY FESTIVAL at Perth Stadium Precinct and Burswood Park! Enjoy FREE entry, live music concert plus a drone show & fireworks. \nFind out More\n\nFrom around the site\n\nMajor Aussie bank posts mammoth profit\nAFL’s big fixture move in $4.5bn TV deal\nColes announces trial of AI-powered supermarket trolleyPremium\nTeen, woman dead in horror highway crashPremium\nWhy alleged murderer could not front courtPremium\nDutton’s big call on tax cuts promise\n\nTop Stories\n\n updatedMiningCommentsPremium\n updatedMinRes shutters lithium mine with 300 jobs affected\n\nThe West Australian exclusive\nThe West Australian exclusiveAFLComments\nThe West Australian exclusiveREVEALED: When Bunbury will host Eagles for historic clash\n\nThe West Australian exclusive\nThe West Australian exclusiveCRIMEPremium\nThe West Australian exclusiveTwo of WA’s most elusive crims caught after years of hiding\n\nOur Network\n\nWest Rewards\nWest Regional Network\nWest Announcements \nWest Classifieds\nWestBusiness Events \nWest Travel Club\n\nMedia Education\nThe Nightly\n\nOur Partners\n\nReal Estate View\nHealthengine\nHuddle Insurance\n\nRaiz Invest\n\nStarts at 60\n\nSubscribe To\n\nThe West Australian Newspaper\nThe West Email Newsletters\n\nConnect with usMessenger IconSend us a message\nShare to FacebookShare to TwitterShare to InstagramShare to YoutubeRSS FeedEmail Us\n\nFrequently Asked Questions\nEditorial Policy\nEditorial Complaints\nPlace an ad in the Classifieds\nAdvertise in The West Australian\n\n© West Australian Newspapers Limited 2024\nPrivacy Policy\nTerms of Use\nCookie Settings\nThe West Australian","summary":"One image from a member of Donald Trump’s inner circle has sparked fresh concern about the future of Australia’s US ambassador Kevin Rudd.","url":"https://thewest.com.au/news/donald-trump-teams-ominous-post-sparks-fresh-concerns-about-kevin-rudds-future-c-16734712","image":"https://images.thewest.com.au/publication/C-16734712/11e934e6fccce486c7dea53aca4f9978a1cd6bdc-16x9-x0y0w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2024-11-13 00:44:37","author":"Joseph Olbrycht-Palmer","authors":["Joseph Olbrycht-Palmer"],"language":"en","category":"politics","source_country":"au","sentiment":0.539},{"id":264423426,"title":"Donald Trump team’s ominous post sparks fresh concerns about Kevin Rudd’s future","text":"Camera IconAustralia’s US ambassador Kevin Rudd can’t escape his past comments about Donald Trump. NewsWire / Martin Ollman Credit: News Corp Australia\n\nDonald Trump team’s ominous post sparks fresh concerns about Kevin Rudd’s future\n\nJoseph Olbrycht-PalmerNewsWireNovember 13, 2024 8:44AM\n\nOriginally published as Donald Trump team’s ominous post sparks fresh concerns about Kevin Rudd’s future","summary":"One image from a member of Donald Trump’s inner circle has sparked fresh concern about the future of Australia’s US ambassador Kevin Rudd.","url":"https://www.perthnow.com.au/technology/donald-trump-teams-ominous-post-sparks-fresh-concerns-about-kevin-rudds-future-c-16734713","image":"https://images.perthnow.com.au/publication/C-16734713/11e934e6fccce486c7dea53aca4f9978a1cd6bdc-16x9-x0y0w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2024-11-13 00:44:37","author":"Joseph Olbrycht,Joseph Olbrycht-Palmer","authors":["Joseph Olbrycht","Joseph Olbrycht-Palmer"],"language":"en","category":"politics","source_country":"au","sentiment":0.184},{"id":264423396,"title":"Republican Dan Newhouse wins reelection to US House in Washington","text":"SEATTLE (AP) — Washington state Rep. Dan Newhouse, one of two remaining House Republicans who voted to impeach former President Donald Trump, won reelection Tuesday.\n\nIn his bid for a sixth term, he survived a challenge from Jerrod Sessler, who was endorsed by Trump.\n\nNewhouse was endorsed by the NRA and Susan B. Anthony Pro-Life America, and he has mostly steered clear of the subject of Trump. He’s instead focused on agriculture and border security in a state with millions of acres of pastures, orchards and cereal grain lands where immigrant labor is extremely important.\n\nSessler is a Navy veteran whose positions were in lockstep with Trump. He said he would fight for strong national security measures, including “an impenetrable border;” work to dismantle regulations imposed by the Environmental Protection Agency and other administrative agencies; and encourage tariffs and other sanctions on China.\n\n“China’s obsession with global power, combined with its atheistic mindset, which removes the morality component, makes it a dangerous adversary,” Sessler said in one of many video statements about issues posted to his campaign website.","summary":"SEATTLE (AP) — Washington state Rep. Dan Newhouse, one of two remaining House Republicans who voted to impeach former President Donald Trump, won reelection Tuesday.","url":"https://www.thestar.com/news/world/united-states/republican-dan-newhouse-wins-reelection-to-us-house-in-washington/article_752bc820-708f-5365-8439-9e3e94625971.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2024-11-13 00:41:03","author":"Gene Johnson The Associated Press,Wire Content","authors":["Gene Johnson The Associated Press","Wire Content"],"language":"en","category":"politics","source_country":"ca","sentiment":0.262},{"id":264422760,"title":"Trump lawyer Alina Habba emerges as frontrunner for White House press secretary: report","text":"Alina Habba, a lawyer who represented Donald Trump in a series of high-profile cases, has emerged as a possible frontrunner for the next White House Press Secretary, according to reports.\n\nHabba is expected at his Mar-a-Lago residence this week, as he begins to announce appointments to his cabinet and wider administration.\n\nSources told Mediate that although no formal decisions has yet been made, she is a favorite candidate for the position and has been in Florida for “conversations regarding a potential role.”\n\nOne source said it was uncertain as to whether, if offered the Press Secretary role, that Habba would take it. Another anonymous source from the Trump team said the lawyer’s experience defending the former president on-camera and in court are factors that will work in her favor.\n\n“Donald Trump is the premier programmer and producer-in-chief, he casts for the on-air roles,” the source told Mediate. “Alina is camera-ready and tested on day one. But more importantly she’s battle tested after being in the frontlines with POTUS the last four years.”\n\nHabba has represented Trump in various lawsuits including his case against The New York Times and his niece Mary Trump, the defamation case with E. Jean Carroll, the civil lawsuit with Michael Cohen and other legal matters.\n\nHowever, she has not always been successful. Trump lost the case against Carroll and was forced to pay the writer over $80 million.\n\nHabba was also part of the legal team who defended the president-elect in his sprawling civil fraud case, during which he and his sons were accused of misrepresenting the sizes of multiple properties in New York and elsewhere to banks and lenders.\n\nDuring the trial, Trump was hit with, and subsequently broke, multiple gag orders, over which he was charged $15,000 by judge Arthur Engoron.\n\nState appellate court judges upheld the gag orders after challenges from the Trump team, leading to Habba personally writing a check to cover the fines.\n\nThen, during the president-elect’s high-profile hush money trial in New York Habba announced that – while not representing Trump – she would be serving as his “legal adviser” and would be speaking on his behalf while he was subject to a gag order.\n\nSpeaking on The Benny Show on April 15, Habba said: “I plan, for the next six weeks, to truly just be spitting the truth and giving people facts they may not be hearing while he’s in court.”\n\nAs well as her history working, admittedly unsuccessfully, with Trump, Habba has continued to position herself inside his inner circle in the final months of the election.\n\nShe made multiple appearances at rallies in states including the now infamous Madison Square Garden event, during which she danced onto the stage to a song by DJ Khaled. The song was “All I Do Is Win.”","summary":"Habba – who represented the president-elect in failed legal cases – is reported to be expected at his Mar-a-Lago residence this week","url":"https://www.independent.co.uk/news/world/americas/us-politics/alina-habba-trump-press-secretary-b2646030.html","image":"https://static.independent.co.uk/2024/10/27/19/SEI227395067.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/696TQeAN-4VHSaSK0.mp4","publish_date":"2024-11-13 00:39:28","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.167},{"id":264422716,"title":"Trump expected to pick Kristi Noem for Homeland Security secretary","text":"Trump expected to pick Kristi Noem for Homeland Security secretary\n President-elect Donald Trump is expected to pick South Dakota Gov. Kristi Noem as Homeland Security Secretary. Weijia Jiang has more on Trump's potential cabinet picks.","summary":"President-elect Donald Trump is expected to pick South Dakota Gov. Kristi Noem as Homeland Security Secretary. Weijia Jiang has more on Trump's potential cabinet picks.","url":"https://www.cbsnews.com/video/trump-expected-to-pick-kristi-noem-for-homeland-security-secretary/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/13/cb73b09c-83a3-4a28-9ea2-5cd1c31834c9/thumbnail/1200x630/f425021ef8b27d1df18ba7bfc2ab1f86/1112-en-jiang.jpg?v=f619a2fc2fe5c36254958031a1f767d9","video":null,"publish_date":"2024-11-13 00:39:14","author":null,"language":"en","source_country":"US","sentiment":-0.729},{"id":264424556,"title":"After promising to ‘save TikTok’, Trump’s next steps remain uncertain.","text":"After a tumultuous year filled with anxiety and a legal battle about its future in the U.S., TikTok may have just been thrown a lifeline by the man who was once its biggest foe: Donald Trump.\n\nPresident-elect Trump, who tried to ban the social media platform the last time he was in the White House, has repeatedly pledged during his most recent campaign to oppose a ban on the short-form video app, which could happen as soon as mid-January if the company loses a court case that’s currently underway in Washington.\n\nFor months, TikTok, and its China-based parent company ByteDance, have been embroiled in a legal battle with the U.S. over a federal law that forces them to cut ties for national security reasons or stop operating in one of their biggest markets in the world. The measure, signed by President Joe Biden in April, gives ByteDance nine months to divest its stakes, with a possible three-month extension if a sale was in progress. If that happens, the deadline could be extended into the first 100 days of Trump’s presidency.\n\nThe companies have claimed that divestiture is not possible, and the law, if upheld, would force them to shut down by Jan. 19, just a day before Trump’s second inauguration. Attorneys for both sides have asked a federal appeals court reviewing the case to issue a ruling by Dec. 6. The losing side is expected to appeal to the Supreme Court, which has a conservative majority and could decide to take up the case, potentially dragging out the process even longer.\n\nWhen reached for comment, the Trump transition team did not offer details on how Trump plans to carry out his pledge to “save TikTok,” as he said on a Truth Social post in September while encouraging people who care about the platform to vote for him. But Karoline Leavitt, a spokeswoman for the transition team, indicated in a statement that he plans to see it through.\n\n﻿“The American people re-elected President Trump by a resounding margin giving him a mandate to implement the promises he made on the campaign trail,” Leavitt said. “He will deliver.”\n\nDuring a March interview with CNBC, Trump said he still believed TikTok posed a national security risk but opposed banning it because doing so would help its rival, Facebook, which he has continued to lambast over his 2020 election loss. He also denied changing his mind on the issue because of Republican megadonor Jeff Yass, a ByteDance investor that Trump, at the time, said that he had only met “very briefly.” He said Yass “never mentioned TikTok” during their meeting.\n\nStill, ByteDance – and groups connected to Yass – have been attempting to exert their influence. Lobbying disclosure reports show that this year, ByteDance paid veteran lobbyist and former Trump campaign aide David Urban $150,000 to lobby lawmakers in Washington in favor of TikTok. The company has also spent more than $8 million on in-house lobbyists and another $1.4 million on other lobbying firms, according to Open Secrets.\n\nMeanwhile, in March, Politico reported Kellyanne Conway, a former senior Trump aide, was being paid by the Yass-funded conservative group Club for Growth to advocate for TikTok in Congress. A spokesperson for the organization said Conway was hired as a consultant to conduct polling. Conway and Urban did not respond to requests for comment. TikTok, which has long denied it’s a national security risk, declined to comment.\n\nIf the courts uphold the law, it would fall on Trump’s Justice Department to enforce it and punish any potential violations with fines. The fines would apply to app stores that would be prohibited from offering TikTok, and internet hosting services who would be barred from supporting it. Leah Plunkett, a lecturer at Harvard Law School, said from her reading of the statute, the attorney general has to investigate violations but can decide whether or not to drag such companies to court and force them to comply.\n\nTrump could do other things to prevent TikTok from disappearing.\n\nHe could issue an executive order to nullify the ban — which Plunkett believes would not be lawful — or urge Congress to repeal the law. That would require support from Congressional Republicans who have aligned themselves with Trump but have also supported the prospects of getting TikTok out of the hands of a Chinese company.\n\nIn a statement sent to the AP after the election, Republican Rep. John Moolenaar of Michigan, chairman of the House Select Committee on China, said Trump’s “long-standing concerns” about TikTok align with the law’s requirement for divestment.\n\n“The Trump Administration will have a unique opportunity to broker an American takeover of the platform,” he said.\n\nByteDance, though, has previously said it has no intention to sell the platform despite interest from some investors, including Trump’s former Treasury Secretary Steven Mnuchin. Analysts say the company is even less likely to sell the proprietary algorithm that fuels what users see on the app. That means even if TikTok is sold to a qualified buyer, it is likely to be a shell of its current self and would need to be rebuilt with new technology.\n\nSarah Kreps, director of Cornell University’s Tech Policy Institute, said it’s also possible that Trump could take the issue back to the drawing board and direct his administration to negotiate a new deal with TikTok.\n\nTikTok said in 2022, it presented the Biden administration with a draft agreement that would bolster protections for users and provide it more oversight over the company’s U.S. operations. But the administration has argued in court documents in recent months that it would be challenging to enforce the agreement due to the size and the technical complexity of the platform.\n\nTrump hasn’t been privy to new intelligence material on the matter for a few years and it’s possible he could change his mind – and abandon his campaign promise – once he does, Kreps said.\n\nPlunkett, the Harvard Law faculty and author of “Sharenthood: Why We Should Think before We Talk about Our Kids Online,” said if she were counseling TikTok, she would advise them to come up with a divesture plan that is compliant with the law and as favorable to them as possible.\n\n“There is too much uncertainty about what a Trump administration is likely to do,” she said.","summary":"After a tumultuous year filled with anxiety and a legal battle about&#8230;","url":"https://internewscast.com/news/us/after-promising-to-save-tiktok-trumps-next-steps-remain-uncertain/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Trump-has-promised-to-039save-TikTok039-What-800x430.jpeg","video":null,"publish_date":"2024-11-13 00:39:08","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.392},{"id":264424336,"title":"Trump nominates Fox News host Pete Hegseth for defense secretary","text":"WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump moved to build out his foreign policy team Tuesday, announcing he is nominating Fox News host and Army veteran Pete Hegseth to serve as his defense secretary and former Director of National Intelligence John Ratcliffe to lead the Central Intelligence Agency.\n\nIn a flurry of announcements, Trump said he had chosen former Arkansas Gov. Mike Huckabee as ambassador to Israel and his longtime friend Steven Witkoff to be a special envoy to the Middle East. Trump also named Bill McGinley, his Cabinet secretary in his first administration, as his White House counsel.\n\nTrump is rolling out a steady stream of appointees and nominees for his upcoming administration, working thus far at a faster pace and without as much drama as his first transition following his 2016 victory.\n\nHegseth, 44, is a co-host of Fox News Channel’s “Fox & Friends Weekend” and has been a contributor with the network since 2014, where he developed a friendship with Trump, who made regular appearances on the show. He is also the author of “The War on Warriors: Behind the Betrayal of the Men Who Keep Us Free.”\n\nHegseth was an infantry captain in the Army National Guard and served overseas in Afghanistan, Iraq and Guantanamo Bay, Cuba. He was formerly head of the Concerned Veterans for America, a group backed by conservative billionaires Charles and David Koch, and he unsuccessfully ran for the Senate in Minnesota in 2012.\n\n“With Pete at the helm, America’s enemies are on notice — Our Military will be Great Again, and America will Never Back Down,” Trump said in a statement. “Nobody fights harder for the Troops, and Pete will be a courageous and patriotic champion of our ‘Peace through Strength’ policy.”\n\nRatcliffe, a former Republican congressman from Texas, served as director of national intelligence for the final months of Trump’s first term, leading the U.S. government’s spy agencies during the coronavirus pandemic. He is a more traditional pick for the role, which requires Senate confirmation, than some rumored loyalists pushed by some of Trump’s supporters.\n\nHuckabee is a staunch defender of Israel, and his intended nomination comes as Trump has promised to align U.S. foreign policy more closely with Israel’s interests as it wages wars against Hamas in Gaza and Hezbollah in Lebanon. Witkoff is a Florida real estate investor who is serving as a chair of Trump’s inaugural committee. He also spent time in the world of New York real estate, where Trump first made his mark as a public figure.\n\nAs intelligence director, Ratcliffe was criticized by Democrats for declassifying in the final days of the 2020 presidential election Russian intelligence alleging damaging information about Democrats during the 2016 race even though he acknowledged it might not be true.\n\nRatcliffe’s visibility rose as he emerged in 2019 as an ardent defender of Trump during the House’s first impeachment proceedings against him. He was a member of Trump’s impeachment advisory team and strenuously questioned witnesses during the impeachment hearings.\n\nAfter the Democratic-controlled House voted to impeach Trump, Ratcliffe said, “This is the thinnest, fastest and weakest impeachment our country has ever seen.” He also forcefully questioned former special counsel Robert Mueller when he testified before the House Judiciary Committee about his investigation into Russian interference in the 2016 election.\n\n“I look forward to John being the first person ever to serve in both of our Nation’s highest Intelligence positions,” Trump said in a statement. “He will be a fearless fighter for the Constitutional Rights of all Americans, while ensuring the Highest Levels of National Security, and PEACE THROUGH STRENGTH.”\n\nHuckabee has led paid tour group visits to Israel for years, frequently advertising the trips on conservative-leaning news outlets.\n\n“Mike has been a great public servant, Governor, and Leader in Faith for many years,” Trump said in a statement. “He loves Israel, and the people of Israel, and likewise, the people of Israel love him. Mike will work tirelessly to bring about Peace in the Middle East!”\n\nDavid Friedman, who served as Trump’s ambassador to Israel in his first term, said he was “thrilled” by Trump’s selection of Huckabee.\n\nWitkoff is also the president-elect’s golf partner and was with him when he was the target of a second assassination attempt at his golf club in West Palm Beach, Florida, in September.\n\nTrump’s transition team did not offer details about the Middle East envoy role, but Trump said in a statement, “Steve will be an unrelenting Voice for PEACE, and make us all proud.”\n\nThe selection of Witkoff follows a pattern for Trump in putting people close to him in pivotal roles on the Middle East portfolio. Eight years ago he appointed his former corporate attorney Jason Greenbaltt as his special representative for international negotiations and relied on his son-in-law, Jared Kushner, as his personal envoy in talks in the region.","summary":"In a flurry of announcements, Trump also named Bill McGinley, his Cabinet secretary in his first administration, as his White House counsel.\n\n\nThe post Trump nominates Fox News host Pete Hegseth for defense secretary appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2024/11/12/trump-nominates-fox-news-host-pete-hegseth-for-defense-secretary/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2024/11/Trump_Transition_87974-6733f450e25ec-768x432.jpg","video":null,"publish_date":"2024-11-13 00:38:32","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.133},{"id":264423668,"title":"Labor is running out of allies on its misinformation bill","text":"Labor’s path to passing its misinformation bill is narrowing, with several key crossbench senators going on the record in the past 24 hours to oppose the legislation. \n\nACT Senator David Pocock and Tammy Tyrrell of Tasmania, both independents, have stated they’ll vote no. \n\n“I’ve listened to the experts and people in the ACT and I’ll be opposing the Combatting Misinformation and Disinformation Bill, unless major changes are made to the legislation,” Pocock said in a video posted to Facebook overnight. \n\nPocock said he was hesitant to support a bill that would risk curtailing “freedom of speech and the freedom to protest”, because “in Australia we don’t have an overarching human rights act that entrenches these rights”. \n\nTyrrell, in her statement, said “putting the responsibility onto social media companies to decide what is or isn’t misinformation in Australia is a slippery slope”.\n\n“It’s important to me that people feel free to express different ideas and opinions without fear of being shut down. Having conversations that challenge our views is how we grow as a community,” she added. \n\nCrikey understands several other crossbench senators are also leaning towards voting no. \n\nTasmanian Senator Jacqui Lambie told The Sydney Morning Herald at the weekend the government was “rushing” the bill. \n\n“There are lots of problems with this bill,” she was quoted as saying. \n\nEx-Coalition turned independent Senator for Queensland Gerard Rennick also indicated he was opposed to the bill. \n\nBecause the Coalition has said it will oppose the bill, the government will need both the support of the Greens and several extra yes votes from the crossbench. The Greens have said they will await the outcome of an inquiry into the bill before deciding their stance. \n\nCommunications Minister Michelle Rowland has said mis- and disinformation “harms democracies [and] economies”.\n\n“Doing nothing is not an option,” she told reporters last month. \n\nEx-Labor gone independent WA Senator Fatima Payman also appeared sceptical towards the legislation. Her chief of staff Glenn Druery told Crikey the government’s chances of passing it were “not looking good”. \n\n“As the bill stands, the government is scrambling to get the numbers they need. And as we sit here on Wednesday morning at 10 o’clock, I think the government is in trouble. However, the Labor Party has been known to pull rabbits out of their hats in the past, and if they’re clever they might be able to do it again,” he said. \n\nCrikey understands Greens-turned-independent Senator from Victoria Lidia Thorpe was still making up her mind about the bill, which she views as having both some merits and some issues that need addressing. \n\nThe inquiry into the bill held its final hearing on Monday, and is due to report by November 25. The issue of requiring social media platforms to crack down on “misinformation” and “disinformation” has become a lighting rod for the right wing, including activists associated with the George Christensen-linked outfit CitizenGO.\n\nBrian Marlow, an activist known for his pro-vaping campaigning who is associated with the Australian Taxpayers’ Alliance, was one of the people who gave evidence to the inquiry on its final day, arguing the bill would be “dead in the water” even if it passed because it might attract opposition from the incoming US president Donald Trump. \n\n“The outcome of what President-elect Trump has said effectively makes this bill null and void and dead in the water,” he told the hearing. \n\nMarlow, who fronted the hearing as a representative for CitizenGO, told Crikey Christensen, the ex-Queensland senator, had been engaged in opposing the bill. \n\n“The first thing we decided to do together was to get stuck into this misinformation bill,” Marlow said. “My view is that the bill needs to be withdrawn. To quote Tony Abbott, the bill needs to be dead, buried, and cremated. It needs to be killed. A lot of people in Australia feel it’s a direct attack on people’s ability to speak freely online.”","summary":"The government's path towards passing its bill is narrowing after a pair of key crossbench senators came out against it. \n\n\nThe post Labor is running out of allies on its misinformation bill appeared first on Crikey.","url":"https://www.crikey.com.au/2024/11/13/labor-running-out-allies-misinformation-bill/","image":"https://www.crikey.com.au/wp-content/uploads/2024/11/20240625175780908350-original-1.jpg?quality=70","video":null,"publish_date":"2024-11-13 00:38:23","author":"Anton Nilsson","authors":["Anton Nilsson"],"language":"en","category":"politics","source_country":"au","sentiment":-0.074},{"id":264422802,"title":"Trump nominates Army Major Pete Hegseth for Secretary of Defense","text":"President-elect Donald Trump has announced he will nominate Army National Guardsman and Fox News host Pete Hegseth to serve as Secretary of Defense in his upcoming cabinet.\"Pete is tough, smart and a true believer in America First. With Pete at the helm, America’s enemies are on notice - Our Military will be Great Again, and America will Never Back Down,\" Trump said in a statement on the nomination.Hegseth has served in the Army National Guard since 2003. He served with his unit at Guantanamo Bay in Cuba, volunteered to serve in Iraq and was also deployed to Afghanistan. He currently holds the rank of Major.RELATED STORY | Trump selects William McGinley as White House CounselHegseth was also the executive director of the conservative policy organization Vets for Freedom from 2007 until 2012. He was then executive director for Concerned Veterans for America, another conservative veterans advocacy group, until 2015.Hegseth ran to represent Minnesota in the U.S. Senate in 2012, but ended his campaign before that year's primary election.Hegseth began working for Fox News in 2014 and is a co-host on \"Fox & Friends Weekend.\"The Senate will have to confirm Hegseth's nomination.This is a developing story and will be updated.","summary":"President-elect Donald Trump will nominate Army National Guardsman and Fox News host Pete Hegseth for Secretary of Defense in his upcoming cabinet. His appointment is subject to Senate approval.","url":"https://www.scrippsnews.com/politics/trump-nominates-army-major-pete-hegseth-for-secretary-of-defense","image":"https://ewscripps.brightspotcdn.com/dims4/default/b46d689/2147483647/strip/true/crop/4092x2148+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F49%2Fcf%2Fb47a7e67411bac9989a57d747878%2Fap24318008787974.jpg","video":null,"publish_date":"2024-11-13 00:35:20","author":"Scripps News Staff","authors":["Scripps News Staff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.034},{"id":264422852,"title":"RGIII Says That Calling Trump Voters Bigots Isn’t Exactly Going To Unite People","text":"Ex-NFL quarterback and former ESPNer Robert Griffin III is looking for answers in the wake of the 2024 presidential election, and he's come to a big epiphany: calling those who voted for President-elect Donald Trump — a group of 75 million Americans — bigots, isn't going to bring people together. Most of us have known this for quite some time, but nice to have another person on the same page. It's been fun to read through people's post-mortems of the 2024 Presidential Election — and more specifically how the Democrats fumbled the bag in such a big way — as though it isn't kind of obvious. I'm far from a political wizard, but when people are unhappy with the direction of the country on multiple fronts, opting for a wildly unlikable candidate, is part of the current administration that people are frustrated with, and has virtually no policies to speak of and the few that she does she can't articulate too well, isn't exactly a winning strategy whether you're running for President of the United States. That's not a winning strategy if you're running for middle school class president. Still, it's blown some people's minds, but RGIII has — believe it or not — been one of the people who seems to have been able to see the forest through the trees — kind of — when it comes to the election. This is kind of a fascinating tweet. On one hand, you've got RGIII hitting the nail on the head that calling Trump voters bigots will never bring people together, obviously. But, in the very next sentence, he asks how all these different groups can celebrate their \"unique cultural backgrounds and beliefs without divisiveness.\" Well, not constantly dividing people into groups based on their skin color or where their family came from might be a good start. But, in fairness to RGIII, he's just a dude trying to make sense of America's political climate, and you've got to respect that. He hasn't been afraid to call out nonsense in the aftermath of the election. Griffin responded to criticism from the likes of MSNBC's Joe Scarborough and Rev. Al Sharpton that black and Hispanic men were misogynists and to blame for Harris' loss (I know, it's a hell of a take). \"Black Men do support Black Women. Stop tearing down and blaming black men for everything under the sun when it comes to Black Women,\" Griffin wrote on X, per Fox News Digital. He's right about that. It goes to show how bad of a loss this election was for the Democratic Party, and even more so for left-wing ideology as a whole. I mean, from the looks of it, they're starting to lose the likes of RGIII a contender in this year's Woke All-Star Challenge. That's some bad news for the wokes…","summary":"","url":"https://www.outkick.com/sports/rgiii-says-calling-trump-voters-bigots-isnt-exactly-going-unite-people","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/11/rgiii-trump.jpg","video":null,"publish_date":"2024-11-13 00:34:49","author":"Matt Reigle","authors":["Matt Reigle"],"language":"en","category":"politics","source_country":"us","sentiment":-0.391},{"id":264423092,"title":"Trump taps Fox News host Pete Hegseth as defence secretary, John Ratcliffe to be CIA director","text":"US President-elect Donald Trump said Tuesday that he is nominating Fox News host and US Army veteran Pete Hegseth to serve as his defence secretary.\nHegseth deployed to Iraq and Afghanistan and unsuccessfully ran for Senate in Minnesota in 2012 before joining Fox News.\n“With Pete at the helm, America’s enemies are on notice – Our Military will be Great Again, and America will Never Back Down,” Trump said in a statement. “Nobody fights harder for the Troops, and Pete will be a courageous and patriotic champion of our ‘Peace through Strength’ policy.”\nHegseth, 44, is a co-host of Fox News Channel’s Fox & Friends Weekend and has been a contributor with the network since 2014, where he developed a friendship with Trump, who made regular appearances on the show. He is also the author of The War on Warriors: Behind the Betrayal of the Men Who Keep Us Free.\nEarlier Trump said he had picked John Ratcliffe, a close ally who was director of national intelligence at the end of his first term, to serve as director of the Central Intelligence Agency.\nRatcliffe served as the nation’s top spy from late May 2020 until Trump left office in January 2021.","summary":"Donald Trump’s team is moving quickly to fill key roles for the incoming administration.","url":"https://www.scmp.com/news/world/united-states-canada/article/3286311/trump-taps-fox-news-host-pete-hegseth-defence-secretary-john-ratcliffe-be-cia-director","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/13/969ce32a-33ca-48c5-ac3c-c4346a19f6db_71554389.jpg","video":null,"publish_date":"2024-11-13 00:33:49","author":"Agencies","authors":["Agencies"],"language":"en","source_country":"cn","sentiment":0.011},{"id":264422210,"title":"ACLU warns new House bill would give Trump ‘dangerous’ tool to stifle free speech and target political enemies","text":"The US House of Representatives is considering a bill that critics say would allow president-elect Donald Trump to go after his political enemies and tax-exempt organizations, including news outlets, universities and civil society groups.\n\nIf enacted, HR 9495 would give the incoming president and his secretary of the Treasury the ability to investigate tax-exempt organizations based on an accusation of wrongdoing. The bill was introduced in September by three Republican members and one Democrat. \n\nThe legislators allege a large portion of support for terrorist organizations in the wake of Hamas’s October 7 2023 attack on Israel has been funded by tax-exempt organizations, citing reports of material support going to designated terrorist groups. \n\nCurrent law does not allow the Internal Revenue Service to suspend the tax-exempt status of organizations that have provided material support to such organizations, but it is a federal crime for non-profits to provide material support to terrorist organizations.\n\nThe American Civil Liberties Union (ACLU) and more than 100 other organizations are concerned the bill’s passage could create a law that is “politicized” and “discriminatory” in its enforcement. In an open letter to House Speaker Mike Johnson in September, the organizations warned that the law would authorize “broad and easily abused new powers for the executive branch.”\n\nAccording to the bill text, the secretary of the Treasury could notify an organization of the department’s intention to classify it as a “terrorist-supporting organization” without reason. The non-profit would have 90 days to appeal the decision before its tax-exempt status is revoked. \n\nCivil rights leaders fear that organizations that support Palestine, where more than 40,000 people have reportedly been killed by Israeli forces since October 7, could become targets. \n\nThe House could hold a vote on the legislation this week. The ACLU renewed its calls for politicians to oppose the legislation following Trump’s re-election.\n\n“Passing this bill would hand the incoming Trump administration a dangerous new tool it could use to stifle free speech, target political opponents and punish disfavored groups,” Kia Hamadanchy, senior policy counsel at the ACLU wrote in a written statement on Tuesday. \n\n“The freedom to dissent without fear of government retribution is a vital part of any well-functioning democracy.” The organization called the 90-day appeal timeline a “mere illusion of due process.” Because the government does not need to inform the organizations of the evidence against them, they could potentially not mount an adequate defense. \n\nSome 130 groups – including Planned Parenthood, Greenpeace, Human Rights Watch, Women’s March and organizations advocating for Arab and immigrant Americans – warned congressional leaders in September about the bill’s sweeping implications.\n\nIn their letter to Johnson in September, the organizations wrote: “The potential for abuse under H.R. 6408 is immense as the executive branch would be handed a tool it could use to curb free speech, censor nonprofit media outlets, target political opponents,and punish disfavored groups across the political spectrum.”\n\nOn Tuesday Democratic congresswoman Rashida Tlaib tweeted: “No excuses. Every single one of my Democratic colleagues should be voting against this bill that gives Trump and his incoming administration dictatorial powers to target nonprofit organizations as political enemies without due process.”\n\nTrump has repeatedly threatened to use the government to punish his political opponents.\n\nThe law would also provide relief to hostages held abroad who are subject to penalties for late tax payments that were due while they were held in captivity. \n\nThe ACLU is not advocating against that provision and claims a bill on that issue alone could wind up on President Joe Biden’s desk independently. It’s unclear if the bill would have enough support to pass through lawmakers.","summary":"Civil rights groups worry the House is about to give the incoming president carte blanche to go after opponents","url":"https://www.independent.co.uk/news/world/americas/us-politics/aclu-trump-house-bill-vote-b2646006.html","image":"https://static.independent.co.uk/2024/09/25/23/2173582287.jpg?width=1200","video":null,"publish_date":"2024-11-13 00:32:17","author":"Michelle Del Rey","authors":["Michelle Del Rey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.267},{"id":264421738,"title":"Connecticut teacher on leave after threatening Trump supporters in Snapchat video: ‘If you wanna fight, text me’","text":"A Connecticut teacher was placed on leave for posting a Snapchat video of herself making violent threats against voters who chose President-elect Donald Trump. \n\nIn the video, Chapman School special education teacher Annie Dunleavy said that she would put Trump supporters “on a stretcher” if they “tested their gangster” on her. \n\n“[I’m] so serious nobody f—king talk to me unless you wanna swing – if you wanna fight, text me call me, whatever, anybody else stay the f–k outta my face,” she said in the video.\n\n“If you voted for Trump literally, please delete me, block me, get rid of everything of me – or step to me, so that I know what’s up and I can handle you how I see fit.”\n\nCheshire Public Schools Superintendent Dr. Jeff Solan was notified about the video over the weekend and assured that the teacher in question was sharing her personal views in what was meant to be a private message. \n\n“The Cheshire Public Schools is reviewing this situation as a personnel matter, and as such we are following all applicable laws,” he wrote in a message to the school community.\n\n“That being said, it is immediately clear that it will be impossible to conduct business as usual for our students and staff without temporarily removing the teacher from the building so we have done so until the outcome of the investigation.”\n\nLocal police were also notified after the post went viral online and are still investigating it. \n\n“The Cheshire Police Department is aware of the recent social media post which has gone viral which involves an employee of the Town of Cheshire Board of Education,” Cheshire police wrote in a statement. \n\n“Upon becoming aware of the nature of the post, an investigation was initiated. This investigation is still on-going and there is no further information available at this time.”\n\nParents and community members were unnerved by the video, but believe that putting Dunleavy on leave was the best available option.\n\n“So, whether you agree politically or not, it doesn’t matter,” Cheshire parent Ian Anctil told News 3. \n\n“You’re a teacher and educator educating our kids. You need to be cognitive of who’s going to hear what you say, whether it’s not intended for the public or not.”","summary":"A Connecticut teacher was placed on leave for posting a Snapchat video of herself making violent threats against voters who chose President-elect Donald Trump. In the video, Chapman School special education teacher Annie Dunleavy said that she would put Trump supporters &#8220;on a stretcher&#8221; if they &#8220;tested their gangster&#8221; on her.  Special education teacher Annie...","url":"https://nypost.com/2024/11/12/us-news/connecticut-teacher-on-leave-after-threatening-trump-supporters-on-snapchat/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/Annie-Dunleavy-comp.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/kkD2K055-RyIcpnTz.mp4","publish_date":"2024-11-13 00:32:16","author":"Caitlin McCormack","authors":["Caitlin McCormack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.125},{"id":264421954,"title":"Trump nominates former Fox News host Pete Hegseth to head Department of Defense in snub to former Dem Rep Tulsi Gabbard","text":"BREAKING NEWSTrump nominates former Fox News host Pete Hegseth to head Department of Defense in snub to former Dem Rep Tulsi Gabbard \n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nBy STEPHEN M. LEPORE FOR DAILYMAIL.COM\n\nPublished: 00:31 GMT, 13 November 2024 | Updated: 00:31 GMT, 13 November 2024\n\nPresident-elect Donald Trump said Tuesday that he is nominating Fox News host and Army veteran Pete Hegseth to serve as his defense secretary.\n\nHegseth deployed to Iraq and Afghanistan and unsuccessfully ran for Senate in Minnesota in 2012 before joining Fox News.\n\n'Pete is tough, smart and a true believer in America First,' Trump said in a statement. \n\nThe appointment comes after former Democrat Congresswoman and Trump ally Tulsi Gabbard said she'd wanted the job. \n\n'With Pete at the helm, America´s enemies are on notice - Our Military will be Great Again, and America will Never Back Down,' Trump added. \n\nPresident-elect Donald Trump said Tuesday that he is nominating Fox News host and Army veteran Pete Hegseth to serve as his defense secretary\n\n'Nobody fights harder for the Troops, and Pete will be a courageous and patriotic champion of our `Peace through Strength´ policy.'\n\nThis is a developing story. \n\nAfghanistanFox NewsDonald TrumpTulsi Gabbard\n\nShare or comment on this article:\nTrump nominates former Fox News host Pete Hegseth to head Department of Defense in snub to former Dem Rep Tulsi Gabbard\n\nAdd comment","summary":"President-elect Donald Trump said Tuesday that he is nominating Fox News host and Army veteran Pete Hegseth to serve as his defense secretary.","url":"https://www.dailymail.co.uk/news/article-14075253/Trump-nominates-cabinet-Fox-News-host-Pete-Hegseth-Department-Defense.html","image":"https://i.dailymail.co.uk/1s/2024/11/13/00/92005951-0-image-a-15_1731457858099.jpg","video":null,"publish_date":"2024-11-13 00:31:57","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.226},{"id":264422818,"title":"What the papers say – November 13","text":"The resignation of the Archbishop of Canterbury after a damning report found the Church of England failed to act on a serial abuser continues to dominate Wednesday’s headlines.\n\nThe Daily Mirror, the Daily Express and Metro all splash on Archbishop Justin Welby’s decision to step down from the Church’s top job.\n\nMeanwhile, the Daily Mail says the Church of England is “in crisis” amid calls from victims for other senior clergy to step down too.\n\nSenior Church of England officials tell The Times Mr Welby’s resignation was necessary to “change the face” of how the institution handles abuse cases.\n\nIn political news, the i says former Labour prime minister Gordon Brown has warned Sir Keir Starmer about potential ramifications of the two-child benefit cap.\n\nThe Daily Telegraph claims one of its writers is facing a “Kafkaesque” hate crime inquiry after a post on social media platform X.\n\nThe United Arab Emirates and Saudi Arabia have indicated they plan to improve Iranian relations in the wake of Donald Trump’s US election victory, according to the Financial Times.\n\nThe Sun’s front page reports rumours of a row at the BBC over who replaces outgoing Match of the Day Host Gary Lineker.\n\nLastly, the Daily Star says a “mega-brained boffiness” has predicted dinosaurs could be discovered in uncharted oceans in the next few years.","summary":"Here are the biggest stories leading Wednesday’s front pages.\n\n\nThe post What the papers say – November 13 appeared first on Jersey Evening Post.","url":"https://www.jerseyeveningpost.com/morenews/uknews/2024/11/13/what-the-papers-say-november-13-8/","image":"https://d3gvyx4eg3tne0.cloudfront.net/wp-content/uploads/2024/11/Img39325611.jpg","video":null,"publish_date":"2024-11-13 00:31:21","author":"UK News","authors":["UK News"],"language":"en","source_country":"gb","sentiment":0.066},{"id":264422998,"title":"Trump Nominates ‘Fox & Friends’ Host Pete Hegseth as Secretary of Defense","text":"Donald Trump nominated “Fox & Friends” host Pete Hegeseth as Secretary of Defense on Tuesday. \n\n“Pete has spent his entire life as a Warrior for the Troops, and for the Country. Pete is tough, smart and a true believer in America First,” Trump said in a statement of the National Guard veteran. “With Pete at the helm, America’s enemies are on notice – Our Military will be Great Again, and America will Never Back Down.”\n\nTrump previously considered Hegseth for the position of Secretary of Veterans Affairs.\n\nHegseth served as the CEO of Concerned Veterans for America from 2012-2015. During that time, he grew the organization into the “largest conservative Veterans advocacy organization in America and led the charge for real reform at the Department of Veterans Affairs.” He joined the organization after serving as the executive director of Vets For Freedom from 2007-2010.\n\nMore to come…","summary":"\"With Pete at the helm, America's enemies are on notice,\" the president-elect says\n\n\nThe post Trump Nominates &#8216;Fox &amp; Friends&#8217; Host Pete Hegseth as Secretary of Defense appeared first on TheWrap.","url":"https://www.thewrap.com/trump-cabinet-pete-hegseth-secretary-of-defense-fox-news/","image":"https://www.thewrap.com/wp-content/uploads/2024/11/Pete-Hegseth.jpeg","video":null,"publish_date":"2024-11-13 00:31:01","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","category":"politics","source_country":"US","sentiment":0.217},{"id":264422358,"title":"Trump’s Day One: Deportations, border wall, scrapping Biden's programs","text":"WASHINGTON - Donald Trump is expected to take a slew of executive actions on his first day as president to ramp up immigration enforcement and roll back signature legal entry programs from President Joe Biden, a sweeping effort that will be led by incoming 'border czar' Tom Homan and other Republican immigration hardliners, three sources familiar with the matter said.The executive actions would give federal immigration officers more latitude to arrest people with no criminal records, surge troops to the U.S.-Mexico border and restart construction of the border wall, the sources said.Homan, who served as acting director of U.S. Immigration and Customs Enforcement from 2017-2018 under Trump, will bring a deep understanding of the U.S. immigration system after a four-decade career that took him from a frontline Border Patrol agent to head of the agency that arrests and deports immigrants who are in the U.S. illegally.","summary":"The sweeping efforts will be led by incoming \"border czar\" Tom Homan and other Republican immigration hardliners.","url":"https://www.japantimes.co.jp/news/2024/11/13/world/politics/trump-deportations-border-biden/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/13/433721.jpg?v=3.1","video":null,"publish_date":"2024-11-13 00:31:00","author":"Ted Hesson,Web Master","authors":["Ted Hesson","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.13},{"id":264421662,"title":"Straight Talk: How Trump Pulled Off Historic Comeback, Reshaped US Politics","text":"Donald Trump is back, and how. In what will go down as the greatest political comeback in American history, Trump has become only the second President after Grover Cleveland to clinch two non-consecutive presidential terms. Trump did not have it easy.\nIn 2020, he left Washington as a disgraced politician in the eyes of the American mainstream media and the Left-Liberal apparatus. The 45th President made his peace with the fact that politics was over for him. He went into retirement at his luxurious estate – Mar-a-Lago in Florida.\nThen, in what will now be remembered as an act of extreme political myopia, the Democrats chose to drag Trump to the courts for a variety of cases. The full might of the Department of Justice was unleashed on Trump.\n\nIf there is one thing Trump craves, it is a good fight. The man has survived political vendetta, assassination attempts, a hostile mainstream media and a lot more. The net result of it all, you may ask?\nHe has now been elected by the people of America as their 47th president, in a staggering mandate which gave Republicans trifecta control over the White House, the House of Representatives and the Senate. Add to that, Trump has won the popular vote – a first for a Republican candidate since 2004. With a 6-3 conservative-leaning Supreme Court, team Trump will exercise full and complete control over Washington. Trump’s second term in office, therefore, will be dramatically different from his first. He will now be armed with a staggering mandate to fulfil his agenda – which is just as dramatic as him.\nTHE DEMOGRAPHICS SPEAK: WHY 2024 IS A WATERSHED YEAR FOR AMERICA\nThe Democratic party has long prided itself for being the party of the American “working class”. What this year’s election has revealed though is that the working class has pretty much abandoned the Democrats. Having sided with Trump and the Republican party instead, a majority of Americans have sent a resounding message of disapproval to the Democrats.\nThis becomes evident from the fact that it is not the Democrats, but the Republicans who have emerged as the working class’s choice. A majority of white voters cast their ballot for Trump, unchanged from the 2020 election that he narrowly lost. Essentially, Trump held on to the support he had amassed in 2016, which continued well into 2020. However, conventional political wisdom would suggest that eight years later, in 2024, Trump would have a much more difficult task of convincing his core voters to stick around. As it turns out, not only did he maintain his hold over traditional voters, but also got a big chunk of the Latino and minority votes.\nBesides, Trump gave the Democrats a run for their money even in what are considered “liberal” urban centres. Take for instance New York City, where his roughly 30% vote share topped every Republican candidate since Ronald Reagan, 40 years ago.\nTrump nearly doubled his vote share among young Black men. About 3 in 10 Black men under the age of 45 went for Trump, roughly double the number he got in 2020. A majority of Latino men – about 55% – voted for Donald Trump. In 2020, Trump won men by about 49%, but in 2024, his support from men grew to 55%. Even among women, despite all the clamour around abortion rights and the Democrats having a woman on the ticket, Trump increased his support from 43% in 2020 to over 45% now.\nWhat this suggests is a tectonic shift in American politics. If Trump is the man the working class now trusts, that represents nothing short of an existential crisis for the Democrats – who have spent a bulk of the last eight years convincing voters how Trump is an anti-democratic, fascist and racist megalomaniac. As is evident, ordinary Americans were simply not convinced of any of these labels being assigned to him.\nWHAT THE DEMOCRATS MISSED: REAL ISSUES, CORRECT MESSAGING AND A MASSIVE RED WAVE\nIn 2022, when the US midterm polls were held, it was widely believed that a red wave would sweep through the Congress. That proved to be a dud. In fact, Joe Biden based his decision of running for White House again on the Democratic party’s strong performance during the midterms, despite promising only two years ago that he would be a “transitional” and “stopgap” president.\nThe unexpected overperformance of Democrats during the midterms was all that it took for the party to start believing their own lies on the economy, immigration and several other bread-and-butter issues that have been piling upon ordinary Americans for four years now. Democrats, deluded by their performance in 2022, went up against Trump thinking of him as a clown who Americans would never vote back into the White House.\nHowever, Trump did exactly what Americans wanted him to do — speak about the real issues, and speak without any filters. Americans wanted the unvarnished truth, and Trump gave it to them. He successfully projected himself as a “fix” to all their problems – ranging from inflation and price rises to the influx of millions of illegal immigrants to the country. While Democrats were tying themselves in knots and becoming increasingly alien to ordinary Americans over the language they used and the condescension that came riddled with it, Trump spoke what came to his mind.\nMainstream media in the US is not willing to admit this, but Trump’s promise of dismantling the deep state, weeding out compromised bureaucrats and reining in the ‘woke’ agenda struck a chord with Americans who still believe in common sense rather than radical ideas propounded by the Left. It is no surprise, therefore, that the Trump campaign’s most successful advertisement this time was one which said: “Kamala is for they/them, Donald Trump is for you.”\nThe impact of Trump’s victory will be far-reaching and very difficult for the Democrats to overcome as a new era of personality politics is heralded across the country. Democrats must also reckon with the reality that Americans do not seem to share their apprehensions of Trump, and have grown rather fond of him since 2016. Essentially, that means Democrats have to completely reimagine the way they oppose and fight Trump, because what has been done so far by them to rein in Trump has only been perceived by Americans as political vendetta.","summary":"Donald Trump has survived political vendetta, assassination attempts, a hostile mainstream media and a lot more","url":"https://www.news18.com/opinion/straight-talk-how-trump-pulled-off-historic-comeback-reshaped-us-politics-9117996.html","image":"https://images.news18.com/ibnlive/uploads/2024/11/untitled-design-5-2024-11-b0f493cd07ffba667ccdca88626d0613-16x9.jpg?impolicy=website&width=1200&height=900","video":null,"publish_date":"2024-11-13 00:30:59","author":"News18,Sanbeer Singh Ranhotra","authors":["News18","Sanbeer Singh Ranhotra"],"language":"en","source_country":"in","sentiment":-0.109},{"id":264421514,"title":"Letters: Racking up debt | Showing spite | Non-voters | American character | Sexism and bigotry | Power to producers","text":"State bond measures\nkeep racking up debt\n\nReading the election results I see that voters have once again authorized California to take on more debt, with very vaguely stated objectives regarding how the money will be allocated.\n\nProposition 2 is $10 billion for “education.” Proposition 4, a $10 billion jackpot of money for the never-achieved goals of “clean water” and “wildfire prevention.”\n\nAfter these measures are enacted the Legislature will request a summary of where the money has been spent. Regularly, the governor will feign ignorance, or if an audit has been done, he will refuse to make public the findings.\n\nPrevious ballot measures have passed as panaceas for everything that ailed our poorly managed state. I have asked my elected representatives if they might know where the monies have gone, and if the funding has produced any tangible results.\n\nI am still waiting.\n\nClifford Sanburn\n\nCoastal agency showed\nspite, not spine\n\nRe: “Musk vs. Coastal Commission shows agency’s effectiveness” (Page A6, Nov. 8).\n\nI strongly disagree with Joe Matthews. What do 12 Democrat commission members have to fear when they reach a decision that they know will be lauded by the Democrat governor and Democrat leaders of the legislature who appointed them? How is that courageous?\n\nThe commission properly performed its duties in cases against David Geffen, the Edge and Vinod Khosla. By Matthews’ own definition, they are “safeguarding coastal ecosystems and enforcing the public’s right to access the coast.” The launch site at Vandenberg does not meet these criteria. It just happens to fall within the commission’s boundary. Matthews devotes one parenthetical sentence claiming rocket launches hurt coastal wildlife. Show me the data.\n\nIt’s true most of Musk’s launches are not for the government. He does personal things like launching satellites over Ukraine and North Carolina to provide a much-needed ability to communicate.\n\nThe commission didn’t show spine. They showed spite.\n\nEugene Paschal\n\nNon-voters put Trump\nback in White House\n\nDonald Trump got 74 million votes in 2020. He got 75 million votes in 2024. Joe Biden got 81 million votes in 2020. Kamala Harris got 71 million votes in 2024.\n\nTrump didn’t win this year because he netted any new voters. He won because 11 million Democrats and other non-Trump voters didn’t vote. Why they failed to vote remains a mystery to me. Perhaps it was progressives disgusted about Gaza, though Trump will be worse regarding that than Biden or Harris. Perhaps it was progressives disgusted about Harris’ tack to the middle, but progressives cannot win a national election on their own.\n\nWhatever the reason, I hope that four years from now, they are happy. But I doubt they will be. I foresee then a defeated Ukraine, a disbanded NATO, a ballooning national debt, a U.S. credit downgrade, and a crashing economy and stock market.\n\nJay Chafetz\nWalnut Creek\n\nElection results indict\nAmerican character\n\nWith the election of Donald Trump, Democratic politicians, pundits and talking heads seem obsessed with self-condemnation. However, that obsession is misplaced. The results were not an indictment of Democratic policies, but an indictment of Americans’ character — Americans who ignored rationality and chose their pocketbooks over morality and ethics.\n\nThey chose to ignore Trump’s known history of racism, fraudulent business practices, sexual predation, malicious rhetoric, yen for dictators, election interference, tax evasion and felonious indictments, thinking he would increase their economic well-being, despite many economists predicting Trump’s economic policies would be disastrous for the country.\n\nI have only one thing to say to those who voted for Trump: “Bless us Father, for we have sinned.”\n\nRobert Thomas\nCastro Valley\n\nSexism, bigotry played\nrole in election results\n\nI don’t want to think that Donald Trump won simply because men can’t stomach the gains that women have made. Men benefit from them too, but, then again, the election reflects the misogyny of society. And yes, women voted for Trump as well, but no one would have voted for a woman adjudicated of sexual assault, or convicted of 34 felonies, or a woman who had children by three or four different men … would they?\n\nThe whole thing creeps me out.\n\nHe has declared bankruptcy numerous times. He is openly racist, misogynistic, a compulsive liar and 51% of the voting public think that’s A-OK as long as he delivers on cheaper gas and grocery prices. He didn’t deliver on many of his promises in the 2016 campaign. This time won’t be any different, and a lot of people will be hurt.\n\nMartha Van Orshoven\n\nPower to producers\nover profit takers\n\nRe: “It’s time to curb excess, power of private equity” (Page A12, Nov. 10).\n\nThe recent letter on private equity highlighted a root cause of our social unrest. The wealthiest Americans literally have more money than they know what to do with.\n\nPrivate equity now dominates sectors essential to daily life, from housing to health care. For example, private equity firms purchased nearly 22% of single-family homes in 2021, contributing to housing shortages and rising rents that hit average families hard. Similarly, private equity-owned health care investments have soared in the past decade, often raising costs and reducing quality as investors prioritize profit. The ultra-wealthy, struggling to invest their vast resources in traditional markets, turn to private equity to sustain their wealth, and those effects cascade across our communities.\n\nWe must rethink how much is too much and push for policy choices that protect those who actually contribute to the economy by working and producing, not just taking profits.\n\nMichael Moore\nWalnut Creek","summary":"East Bay Times Letters to the Editor for Nov. 13, 2024","url":"https://www.mercurynews.com/2024/11/12/letters-1930/","image":"https://www.mercurynews.com/wp-content/uploads/2024/04/SBS-L-ELX-SEN-0305-01.jpg?w=1024&h=646","video":null,"publish_date":"2024-11-13 00:30:28","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.507},{"id":264421980,"title":"What is a recess appointment, the power Trump wants from the next GOP leader?","text":"What is a recess appointment, the power Trump wants from the next GOP leader?\n Congressional Republicans are preparing to carry out President-elect Donald Trump's agenda. This weekend, he took to social media saying that the next Senate Republican leader must \"agree to recess appointments.\" CBS News congressional correspondent Nikole Killion breaks down what that is, and what else the next leader will be tasked with.","summary":"Congressional Republicans are preparing to carry out President-elect Donald Trump's agenda. This weekend, he took to social media saying that the next Senate Republican leader must \"agree to recess appointments.\" CBS News congressional correspondent Nikole Killion breaks down what that is, and what else the next leader will be tasked with.","url":"https://www.cbsnews.com/video/recess-appointment-power-trump-wants-from-next-gop-leader/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/13/8f2fa564-5167-4d03-847d-83d42cb60992/thumbnail/1200x630/1da55073e420a344e281f35ac5338931/cbsn-fusion-recess-appointment-power-trump-wants-from-next-gop-leader-thumbnail.jpg?v=f619a2fc2fe5c36254958031a1f","video":null,"publish_date":"2024-11-13 00:29:57","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.257},{"id":264421790,"title":"Tracking Trump’s Cabinet Nominations","text":"President-elect Donald J. Trump is assembling the cast of characters who will serve in his cabinet and in other senior positions during his second term. The cabinet always comprises at least 16 positions — the vice president and the heads of the 15 executive departments — and presidents have discretion to elevate other officials, like the White House chief of staff, to the cabinet level. This page will be updated as new announcements are made.","summary":"President-elect Donald J. Trump is assembling the cast of characters who will serve in his cabinet and in other senior positions during his second term. The cabinet always comprises at least 16 positions — the vice president and the heads of the 15 executive departments — and presidents have discretion to elevate other officials, like &#8230;\n\n\nThe post Tracking Trump’s Cabinet Nominations appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/tracking-trumps-cabinet-nominations/","image":"https://static01.nyt.com/images/2024/11/12/multimedia/2024-11-12-trump-administration-cabinet-appointees-index/2024-11-12-trump-administration-cabinet-appointees-index-facebookJumbo-v3.jpg","video":null,"publish_date":"2024-11-13 00:29:06","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.342},{"id":264423060,"title":"Trump nominates Fox News host for defense secretary","text":"US President-elect Donald Trump has named Fox News host and former National Guardsman Pete Hegseth as his nominee for the next secretary of defense.\n\n“I am honored to announce that I have nominated Pete Hegseth to serve in my Cabinet as the secretary of defense,” Trump said in a statement carried by Fox News on Tuesday. \n\n“Pete has spent his entire life as a warrior for the troops, and for the country. Pete is tough, smart and a true believer in America First,” he said.\n\nHegseth served as an infantry officer in Afghanistan, Iraq, and Guantanamo Bay, according to his website. He studied politics at Princeton University and Harvard University’s John F. Kennedy School of Government.\n\nHe co-hosts Fox & Friends Weekend and has appeared as a commentator on multiple Fox News’ shows.\n\nDETAILS TO FOLLOW","summary":"Donald Trump has picked Fox News Host and security expert Pete Hegseth for his defense secretary \nRead Full Article at RT.com","url":"https://www.rt.com/news/607552-trump-reveals-pentagon-chief-pick/","image":"https://mf.b37mrtl.ru/files/static.en/article/breaking.jpg","video":null,"publish_date":"2024-11-13 00:28:26","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":0.271},{"id":264421416,"title":"Why Kevin Rudd won't want to give up his top Washington job - as his incredible perks are revealed","text":"Why Kevin Rudd won't want to give up his top Washington job - as his incredible perks are revealed\n\nREAD MORE: Albo breaks his silence on whether he will apologise to Trump\n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nBy MAX AITCHISON FOR DAILY MAIL AUSTRALIA\n\nPublished: 00:27 GMT, 13 November 2024 | Updated: 00:27 GMT, 13 November 2024\n\nKevin Rudd is under mounting pressure to return to Australia with his tail between his legs after a swathe of past insults he has made about Donald Trump have resurfaced.\n\nThe Australian Ambassador to the US has labelled the President-elect a 'village idiot', a 'traitor to the West' and 'the most destructive president in history'.\n\nThere are growing voices calling for Prime Minister Anthony Albanese to sack Mr Rudd and install someone else who can build a better relationship with Trump's new administration.\n\nTrump has also signalled his disapproval with the former Prime Minister of Australia, branding him 'nasty'.\n\n'I don't know much about him. I heard he was a little bit nasty,' Trump told GB News earlier this year.\n\n'I hear he's not the brightest bulb, but I don't know much about him. If he's at all hostile, he will not be there long.'\n\nAnd one of Trump's most senior campaign advisors, Dan Scavino Jr, gave an indication that Mr Rudd would not last long under the current administration.\n\nSharing Mr Rudd's congratulatory message to the new President-elect on X, Mr Scavino Jr posted an hour glass GIF - suggesting his days were numbered. \n\nBut Mr Rudd is unlikely to go quietly, especially given the huge number of perks he receives as one of Australia's top diplomats. \n\nMore to come. \n\nThe Australian Ambassador to the US, Kevin Rudd (pictured), has labelled the President-elect a 'village idiot', a 'traitor to the West' and 'the most destructive president in history'\n\nAnthony AlbaneseGB NewsDonald Trump\n\nShare or comment on this article:\nWhy Kevin Rudd won't want to give up his top Washington job - as his incredible perks are revealed\n\nAdd comment","summary":"Kevin Rudd is under mounting pressure to return to Australia with his tail between his legs after a swathe of past insults he has made about Donald Trump have resurfaced.","url":"https://www.dailymail.co.uk/news/article-14074961/Why-Kevin-Rudd-wont-want-Washington-job-incredible-perks-revealed.html","image":"https://i.dailymail.co.uk/1s/2024/11/13/00/92005839-0-image-m-13_1731457601488.jpg","video":null,"publish_date":"2024-11-13 00:27:37","author":"Editor,Max Aitchison","authors":["Editor","Max Aitchison"],"language":"en","source_country":"gb","sentiment":-0.182},{"id":264422702,"title":"AP Race Call: Republican Dan Newhouse wins reelection to U.S. House in Washington's 4th Congressional District","text":"WASHINGTON - Republican Rep. Dan Newhouse won reelection to a U.S. House seat representing Washington on Tuesday. Newhouse, who has held the seat since 2015, defeated Donald Trump-endorsed Republican Jerrod Sessler, a Navy veteran and former NASCAR driver. Newhouse was one of 10 House Republicans to vote to impeach Trump over the Jan. 6, 2021, insurrection at the Capitol and one of only two to keep his job after the 2022 election. The central Washington district runs from the Canadian border to the Columbia River. The Associated Press declared Newhouse the winner at 7:25 p.m. EST.","summary":"WASHINGTON - Republican Rep. Dan Newhouse won reelection to a U.S. House seat representing Washington on Tuesday. Newhouse, who has held the seat since 2015, defeated Donald Trump-endorsed Republican Jerrod Sessler, a Navy veteran and former NASCAR driver. Newhouse was…","url":"https://www.thestar.com/news/world/united-states/ap-race-call-republican-dan-newhouse-wins-reelection-to-u-s-house-in-washingtons-4th/article_08c8ab76-47db-5bff-98f0-f44ab8b4389f.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2024-11-13 00:27:34","author":"The Associated Press,Wire Content","authors":["The Associated Press","Wire Content"],"language":"en","category":"politics","source_country":"ca","sentiment":0.19},{"id":264421852,"title":"Trump taps John Ratcliffe, ex-national intelligence chief, for CIA director","text":"Nov. 12 (UPI) -- President-elect Donald Trump announced his choice Tuesday for CIA Director, tapping his former intelligence chief John Ratcliffe, who he called a \"warrior of truth.\"\n\n\"I am pleased to announce that former Director of National Intelligence John Ratcliffe will serve as Director of the Central Intelligence Agency,\" Trump wrote in a statement on Truth Social, which included claims about Ratcliffe \"exposing fake Russian collusion\" in Hillary Clinton's 2016 campaign and exposing \"intelligence officials lying about Hunter Biden's laptop.\"\n\n\"I look forward to John being the first person ever to serve in both of our nation's highest Intelligence positions,\" Trump added. \"He will be a fearless fighter for the Constitutional rights of all Americans, while ensuring the highest levels of national security and peace through strength.\"\n\nRatcliffe is currently a co-chair at the Center for American Security at the America First Policy Institute, a Trump-aligned think tank for security issues.\n\nBefore being appointed by Trump during his first administration, Ratcliffe represented Texas for five years in the U.S. House of Representatives, where he served on the Judiciary and Intelligence committees. Before that, he served as U.S. attorney for eastern Texas in 2007 and 2008.\n\nRatcliffe, who earned his bachelor's degree from Notre Dame and law degree from Southern Methodist University, was first nominated for the DNI post during Trump's final year of his first term, but withdrew after both Republican and Democratic lawmakers questioned his qualifications.\n\nRatcliffe was confirmed in 2020 after Trump nominated him for a second time. Trump honored Ratcliffe with the National Security Medal, which is the highest honor for distinguished achievement in the field of intelligence and national security.\n\nSince winning the presidential election last week, Trump has been filling his Cabinet positions and other top posts as he prepares for his inauguration on Jan. 20, and a second term in the White House.","summary":"President-elect Donald Trump announced his choice Tuesday for CIA Director, tapping his former intelligence chief John Ratcliffe, who he called a \"warrior of truth.\"","url":"https://www.upi.com/Top_News/US/2024/11/12/Donald-Trump-John-Ratcliffe-cia-director/7391731455902/","image":"https://cdnph.upi.com/ph/st/th/7391731455902/2024/upi/70cb61c1e60e4aed1def3601f171c456/v1.2/Trump-taps-John-Ratcliffe-ex-national-intelligence-chief-for-CIA-director.jpg","video":null,"publish_date":"2024-11-13 00:27:29","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","source_country":"US","sentiment":0.182},{"id":264422748,"title":"Trump Picks Pete Hegseth, a Veteran and Fox News Host, for Defense Secretary","text":"President-elect Donald J. Trump chose Pete Hegseth, a Fox News host and veteran of the wars in Iraq and Afghanistan, to be his next defense secretary, elevating a television ally to run the Pentagon and lead 1.3 million active-duty troops.\n\nThe choice of Mr. Hegseth was outside the norm of the traditional defense secretary, but he was a dedicated supporter of Mr. Trump during his first term, defending his interactions with the North Korean leader Kim Jong-un, embracing his “America First” agenda of trying to withdraw U.S. troops from abroad and energetically taking up the cause of combat veterans accused of war crimes.","summary":"The choice of Mr. Hegseth, a dedicated supporter of the president-elect in his first term, was outside the norm of the traditional choice for the post.","url":"https://www.nytimes.com/2024/11/12/us/politics/pete-hegseth-defense-secretary-trump.html","image":"https://static01.nyt.com/images/2019/12/23/us/politics/12dc-hegseth-01/00dc-hegseth1-facebookJumbo-v2.jpg","video":null,"publish_date":"2024-11-13 00:26:38","author":"Helene Cooper,Maggie Haberman","authors":["Helene Cooper","Maggie Haberman"],"language":"en","category":"politics","source_country":"us","sentiment":0.397}]}