{"offset":0,"number":50,"available":5352,"news":[{"id":254057918,"title":"J.K. Rowling, Elon Musk Named in Cyberbullying Lawsuit by Olympic Boxer Imane Khelif","text":"Harry Potter author J.K. Rowling and tech billionaire Elon Musk were named in a complaint filed in France over allegations of “aggravated cyber harassment” against Olympic champion Imane Khelif. Variety confirmed the news on Tuesday, and said that the lawsuit was filed against X (formerly Twitter) on Friday, the same day Kehlif won a gold medal in the women’s welterweight division of the 2024 Olympics. Khelif’s attorney, Nabil Boudi, told the outlet that this “ensure[s] that the prosecution has all the latitude to be able to investigate against all people,” including those who used pseudonyms to write speech directed at Khelfi. If the prosecutor’s office charges anyone under the statute, it could call for two to five years in prison and tens of thousands of Euros in fines. Boudi added that Donald Trump would be part of the investigation, as the former president “tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution.” The controversy surrounding the Algerian boxer began on Aug. 1, when her opponent, Italian boxer Angela Carini, withdrew from a match after just 46 seconds, saying, “I have never been hit so hard in my life.” This led to a wave of baseless criticism from people like Musk, Rowling, Trump, and Logan Paul — all of whom falsely suggested that Khelif is a trans woman and/or that she should be barred from women’s athletic events. (Paul later posted a statement admitting that “I might be guilty of spreading misinformation.”) In fact, Khelif, 25, was assigned female at birth, has never identified as transgender, and the International Olympic Committee has repeatedly asserted her qualifications to compete in the women’s division. Meanwhile, Musk and his social media platform, X, have become the biggest purveyors of misinformation online. Nearly two years since his $44 billion takeover, false and misleading information about wars, health, climate change, elections and more have flourished alongside violent rhetoric and hate speech on the digital forum. Since 2018, Rowling has approved of or has made repeated transphobic comments online. Rolling Stone recently described the author as “one of the hardest-working transphobes online” and referred to her 2022 novel, The Ink Black Heart, in which a character is persecuted for transphobia. And in March, U.K. broadcaster India Willoughby filed a criminal complaint against Rowling citing transphophia and claiming she misgendered her, violating the country’s Equalities Act and Gender Recognition Act.","summary":"The Algerian boxer filed a complaint in Paris after facing baseless claims about her gender","url":"https://www.rollingstone.com/culture/culture-news/j-k-rowling-elon-musk-cyberbullying-lawsuit-olympic-boxer-imane-khelif-1235079615/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/jk-rowling-elon-musk-Imane-Khelif-lawsuit.jpg","video":null,"publish_date":"2024-08-14 00:48:55","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","source_country":"us","sentiment":-0.241},{"id":254057906,"title":"Officials Say They’re Working to Keep Democratic Convention ‘Safe and Secure’","text":"Chicago Police Superintendent Larry Snelling said the Secret Service and local police were working closely with the FBI’s Bureau of Counter-Terrorism and Joint Terrorism task forces for the event. Security teams will use the city’s security camera system to monitor ground activity, he said. “We have eyes and ears on everything we possibly can,” he added. Derek Meyer, the deputy special agent in charge of the Secret Service’s Chicago field office, said the convention has been designated a “national special security event.” “That delegation allows for a ‘whole-of-government’ approach,” he said. “It means that the federal government has its full complement of resources and works with its state and local partners to ensure a safe and secure environment for residents and delegates in the entire city of Chicago as the DNC opens on Monday.” Scheduled for August 19–22, the convention is expected to encounter a significant number of protesters. The Council on American-Islamic Relations (CAIR) is coordinating a demonstration against Israel’s war in Gaza. The pro-abortion and pro-LGBT activist group Bodies Outside of Unjust Laws also plans to protest, along with dozens of other groups. Mr. Snelling said that security teams did not want to interfere with the protestors’ First Amendment rights, and that designated protest locations would be “within sight and sound” of the actual convention. “We get them there safely, give them the opportunity to have their voices heard, be seen. And then hopefully when it’s all over, everybody disperses safely,” he said. At the 1968 Chicago convention, protests against the Vietnam War eventually led to riots; one person died and hundreds more were injured. Mr. Snelling mentioned those riots, but pointed out that there has been a total of 26 national conventions for both parties since then without incident. “I want to reassure everyone that we will have resources in every single neighborhood. ... We have a city to protect, not just around the venues covering the Democratic National Convention,” he said. “So we will not deplete resources from our neighborhoods to simply put them in the area where the Democratic National Convention is being held.” Reporters asked about the effectiveness of the Secret Service in light of the near-assassination of former President Donald Trump at a Butler, Pennsylvania campaign rally on July 13. Mr. Meyer said the two events are very different. “Obviously, all of us in law enforcement are trying to get better every day. But as far as comparing Butler to a national special security event, you can’t compare it. “We’ve been planning for this convention for well over a year.”","summary":"The Secret Service and Chicago police say they’re working alongside the FBI’s Bureau of Counter-Terrorism and Joint Terrorism task forces.","url":"https://www.theepochtimes.com/us/officials-say-theyre-working-to-keep-democratic-convention-safe-and-secure-5704997","image":"https://img.theepochtimes.com/assets/uploads/2024/07/08/id5682336-Chicago-GettyImages-2155425496-300x180.jpg","video":null,"publish_date":"2024-08-14 00:44:48","author":"Stacy Robinson","authors":["Stacy Robinson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.189},{"id":254057824,"title":"Trump 'Part of Investigation' in Boxer Imane Khelif's New Lawsuit: Report","text":"The attorney for Olympic boxing champion Imane Khelif said that former President Donald Trump's false statements about Khelif's gender will be included in the investigation behind the online harassment suit Khelif filed last week, according to a report from Variety.The lawsuit, filed on Friday with a special unit of the public prosecutor's office in Paris, stems from false statements that spread online about Khelif's gender identity after the Algerian boxer defeated Italian boxer Angela Carini in her first fight of the 2024 Olympic Games. Carini pulled out 46 seconds into the match and told reporters after the fight that she had \"never felt a punch like this.\"The match sparked questions about the gender of Khelif, who last year was blocked from competing in the World Championships after failing an unspecified sex-verification test by the International Boxing Association (IBA). The International Olympic Committee (IOC) has cast doubt on the validity on the test, which also disqualified Taiwanese boxer Lin Yu-ting from competing in the 2023 World Championship. IBA has also been stripped as boxing's governing body by the IOC.Khelif claimed gold in the women's welterweight Olympic division on Friday, winning Algeria's first medal in women's boxing. Yu-ting won gold in the women's flyweight division on Saturday.The harassment lawsuit alleges an \"aggravated cyber-harassment\" against Khelif, according to a statement from the boxer's lawyer, Nabil Boudi, who was quoted by the Associated Press. Variety reported on Tuesday that the complaint was filed against X, the social platform formerly known as Twitter, which means under French law that it was filed against unknown persons. Investigators at the Paris prosecutor's office will be open to determine who could be at fault in Khelif's complaint.Boudi told Variety that Trump would also be part of the investigation, saying, \"Trump tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution.\"Newsweek reached out to Boudi via email for comment Tuesday evening.The former president has made several comments about Khelif's gender identity since her fight with Carini. During a campaign rally on August 3, Trump told supporters, \"Now all you have to do is look at the boxers.\"\"This young girl from Italy, a champion boxer, she got hit so hard she didn't know what the hell hit her,\" Trump said of Carini.\"It's a person that transitioned,\" he added, referring to Khelif. \"He was a good male boxer. And (Carini) didn't even go down. He hit her with two jabs and she said, 'I'm out.'\"At a rally in Montana on Friday, Trump appeared to mock Khelif's victory, telling the crowd, \"And I'd like to congratulate the young woman who transitioned from a man into a boxer.\"\"You saw he [sic] won, she won the gold medal,\" Trump said, who went on to praise Carini as a \"beautiful Italian boxer\" who is \"a very good boxer, you know, against other women.\"\"It's crazy what they're doing. How crazy is it ... and she wants it,\" Trump added, referring to Vice President Kamala Harris. \"She wants men to play in women sports.\"Newsweek reached out to Trump's campaign for comment as well on Tuesday.Variety also reported that author J.K. Rowling and billionaire and X owner Elon Musk were mentioned in the lawsuit. Rowling, best known for her Harry Potter books, has made controversial statements in the past about her views on transgender people, including several posts on X about Khelif's presence at the Olympics.Musk reacted to a post on X by American swimmer and conservative figure, Riley Gaines, on August 1, which read, \"Men don't belong in women's sports\" with the hashtag, #IStandWithAngelaCarini. The post included a photo of Khelif. Musk wrote in response to Gaines, \"Absolutely.\"Carini has said that she apologized to Khelif for the tumult that has swirled since their fight.\"All this controversy certainly made me sad, and I also felt sorry for my opponent, she had nothing to do with it and like me was only here to fight,\" the boxer told Italian publication Gazzetta dello Sport.Carini added that it was \"not intentional\" when she failed to shake Khelif's hand after choosing to quit their match, saying, \"I was angry, because my Games had already gone up in smoke.\"\"I have nothing against Khelif and on the contrary if I happened to meet her again I would give her a hug,\" Carini added.Khelif told reporters after winning gold on Friday, \"I'm fully qualified to take part in this competition. I'm a woman like any other woman. I was born as a woman, I live as a woman, and I am qualified.\"","summary":"The Algerian boxer has been at the center of controversy after false claims spread online regarding her gender identity.","url":"https://www.newsweek.com/trump-part-investigation-boxer-imane-khelifs-new-lawsuit-report-1938890","image":"https://d.newsweek.com/en/full/2449418/donald-trump-part-investigation-imanekehliflawsuit.jpg","video":null,"publish_date":"2024-08-14 00:43:33","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.352},{"id":254057432,"title":"Trump’s team begins to reduce the difference in ad spending in key states. From the Politics Department.","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill. In today’s edition, national political reporter Ben Kamisar breaks down the state of the advertising race in the presidential campaign. Plus, campaign embed Alex Tabet reports from Phoenix on a rare Democratic candidate who’s leaning into border security. Sign up to receive this newsletter in your inbox every weekday here. After Democrats’ long-held edge, Team Trump starts to close the battleground ad spending gap By Ben Kamisar If you live in a swing state and are already sick of seeing presidential campaign ads, buckle up. You’re about to see a whole lot more, thanks in large part to a big uptick in spending on the Republican side. With Democrats holding a massive advantage on the airwaves throughout much of the year, Donald Trump’s campaign has started pouring serious money into battleground advertising for the first time since he emerged as the presumptive nominee after largely leaving that responsibility to allied outside groups. From June 3 through July 28, the Joe Biden-turned-Kamala Harris campaign spent almost $65 million on TV, radio and digital advertisements across six battleground states, according to the tracking firm AdImpact: Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin. (That total does not include spending from its joint fundraising committees.) Over that same period of time, the Trump campaign spent less than $230,000. But over the last two weeks, a dramatic shift from the Trump campaign has helped close the gap. It has spent a total of $13 million in those key states, compared to $16.5 million from the Harris campaign. The increase from both camps comes after Harris replaced Biden as the Democratic standard-bearer and the conclusion of the Republican National Convention. The Democratic decline in spending that precipitated it came as Biden’s campaign was thrust into turmoil after his poor debate performance. A similar trend emerges when ad spending from outside groups supporting the campaigns is included, showing a major Democratic week-to-week edge that has been all but wiped out. And there’s much more to come, with groups previewing another massive flurry of ad spending as both sides seek to define the new Democratic ticket. Plus, the Trump and Harris campaigns have proven they’re able to raise money hand over fist, which they’ll be able to deploy across the country in what’s expected to be the most expensive presidential race ever. Democrats argue the advantage they held for months shouldn’t be discounted. And while it’s now Harris at the top of the ticket, much of the emphasis of the Biden-Harris administration’s accomplishments and the criticism of Trump still holds. But we’ve written before about how Republicans have cut into the Democrats’ fundraising edge, and these ad spending numbers show the fruits of that effort. Democrat Ruben Gallego leans into border security in battleground Senate race By Alex Tabet PHOENIX — TV ads showing candidates touring the U.S.-Mexico border have become a staple of Republican campaigns across the country. But this summer, Democratic Rep. Ruben Gallego got in on the action as his party tries to win voters’ trust in his battleground Arizona Senate race — and beyond. “Ruben Gallego has stood side by side with me. The only member of Congress that has come regularly to my border,” Santa Cruz County Sheriff David Hathaway said in the ad. “He is fighting for solutions. Better technology. More manpower.” It’s far from the only border security ad on Arizona’s airwaves. Gallego’s competitor, GOP Senate candidate Kari Lake, has been bashing him on the border, with one ad tying Gallego to Biden and Harris’ policies and featuring a 2017 clip of Gallego on the House floor referring to “Trump’s stupid, dumb border wall.” The back-and-forth on the issue reflects the central role the border is playing in many voters’ calculations, as well as Democrats’ realization that the public did not see their rhetoric or policies as up to the task of handling a growing number of migrants in recent years. Gallego’s early efforts to prove himself to voters on the issue are now reflected in other Democratic campaigns. One of the first TV ads Harris launched after taking over as the party’s presidential candidate focused on border security, though the issue did not feature in a year-plus of Biden’s broadcast TV advertising captured by the tracking firm AdImpact. The issue also illustrates Gallego’s efforts to redefine himself — and his opponent’s efforts to highlight his progressive past — as he tries to move from a deep-blue House district to statewide office in one of the nation’s most tightly divided battlegrounds. It’s why Gallego struck a different tone, though not an entirely different angle, when NBC News asked if he still believes Trump’s border wall initiative is “stupid” and “dumb.” “I think border walls are necessary in certain areas. Putting border walls in areas that you don’t need only costs more money and then also costs manpower,” Gallego said, arguing a full-fledged southern border wall is a performative waste of taxpayer dollars. That’s all from the Politics Desk for now. If you have feedback — likes or dislikes — email us at [email protected]","summary":"Internewscast Journal\n\nInternewscast\n\n\nWelcome to the online version of From the Politics Desk, an evening newsletter&#8230;\n\n\nThis Post: Trump&#8217;s team begins to reduce the difference in ad spending in key states. From the Politics Department. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trumps-team-begins-to-reduce-the-difference-in-ad-spending-in-key-states-from-the-politics-department/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-08/240813-split-trump-harris-ch-1629-c75a48.jpg","video":null,"publish_date":"2024-08-14 00:31:37","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.06},{"id":254057910,"title":"Walz Kicks Off 5-State Campaign Tour in Union Convention Speech","text":"Minnesota Gov. Tim Walz hit the stage at a labor union convention in southern California on Aug. 13, touting his teaching background and pro-worker message in his first solo appearance since joining the Democratic Party ticket last week. “The vice president and I, we know exactly who built this country. It was nurses, it was teachers, and it was state and local government employees that built this nation,” Walz said in a Los Angeles ballroom filled with thousands of members of the American Federation of State, County, and Municipal Employees (AFSCME) union. “People in this room built the middle class. That’s not just a saying, it’s a fact: when unions are strong, America is strong.” Since launching her campaign on July 21, Vice President Kamala Harris has scored endorsements from multiple labor unions. In addition to the 1.4-million-member AFSCME, Harris was also endorsed by the United Auto Workers (UAW), hospitality workers’ union UNITE HERE, and the AFL-CIO. The Teamsters Union, whose president spoke at this year’s Republican National Convention, has not made a presidential endorsement this cycle. Walz began his 5-state tour—taking him through Colorado, Massachusetts, Rhode Island, and New York—in Harris’ home state of California. Walz headlined a private campaign fundraiser in Newport Beach on Aug. 13. In his AFSCME speech, Walz discussed being a “dues-paying member of my teachers’ union for years” and his efforts as governor of Minnesota to secure paid family and medical leave for workers. “We will stand together on the fundamental principle to collectively bargain for your own lives and your own jobs,” he said of himself and Harris. Walz championed the Protecting the Right to Organize (PRO) Act and criticized former President Donald Trump for expressing past support for “right to work” laws, which block unions from making contractual agreements with employers, including those that may compel employees to join. Trump, while speaking with the South Carolina Radio Network during his 2016 presidential campaign, said he had “great support” from union workers, but expressed “love” for the “right to work.” “It is better for the people. You are not paying the big fees to the unions,” Trump said. When Reps. Joe Wilson (R-S.C.) and Steve King (R-Iowa) introduced the National Right to Work Act, the Trump administration affirmed its support for “right to work” laws. “The president believes in the right to work. He wants to give workers and companies the flexibility to do what’s in the best interest for job creators,” White House Press Secretary Sean Spicer told reporters during a Feb. 3, 2017, press conference. California has not voted for a Republican president since George H.W. Bush in 1988. The GOP has often turned to the state as an example of the downstream effects of liberal policies—pointing to its high taxes, homelessness crisis, and rising housing costs. In his final remarks, Walz said the Democratic Party faces a tough race heading into November. “You don’t hope to win. You plan, prepare, and work to win.”","summary":"The Minnesota governor leaned on his years paying union dues as a school teacher and criticized the former president for supporting 'right to work' laws.","url":"https://www.theepochtimes.com/us/walz-kicks-off-5-state-campaign-tour-in-union-convention-speech-5705237","image":"https://img.theepochtimes.com/assets/uploads/2024/08/12/id5704383-GettyImages-2165605547-LSedit-300x180.jpg","video":null,"publish_date":"2024-08-14 00:29:56","author":"Jacob Burg","authors":["Jacob Burg"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.158},{"id":254057702,"title":"Nikki Haley has blunt message for Trump, GOP as Kamala Harris gains momentum: 'Quit whining'","text":"Former GOP presidential candidate Nikki Haley weighed in on the state of the 2024 race Tuesday as Vice President Kamala Harris gains momentum in key battleground states ahead of the November election. Haley told Fox News chief political anchor Bret Baier on \"Special Report\" Republicans and former President Trump should focus on policy and messaging instead of crowd sizes at rallies, Harris' race, or attacks on her intellect. \"You can't win on those things. The American people are smart. Treat them like they're smart,\" she said. \"It's not about her. It's about the American people. Talk to them and let them know you need their vote.\" The former South Carolina governor also encouraged Republicans to \"quit whining\" about Harris and \"quit complaining\" that she hasn’t given a formal sit-down interview since replacing President Biden at the top of the Democratic ticket. \"We knew it was going to be her. She's not going to give an interview. They're going to hold out as long as they can. That's their right. They can do it. That doesn't mean we can't talk about what she believes in. And we should be getting out there and doing that,\" said Haley. \"I take her at her word that she thinks that illegal immigrants should be able to vote and be given driver's licenses. I take her at her word that she wants to ban fracking and kill a bunch of U.S. jobs. Take her at her word.\" HARRIS MOCKED FOR TAKING LESS THAN 2 MINUTES OF QUESTIONS AFTER 18 DAYS: ‘THIS IS THE BEST KAMALA COULD DO?’ As of Tuesday, Harris has yet to hold a formal press conference or sit down for an interview in 23 days. She told reporters on the tarmac in Detroit last week that she’s asked her team to schedule her first interview since becoming the Democratic nominee before the end of the month. Haley told Baier that Republicans should focus on courting suburban women, independents, moderate Republicans and conservative Democrats. \"The target issues are the economy, the fact that Kamala wants to raise taxes, the fact that she's taking money from those that didn't go to college and has given it to those that did, the fact that when Afghanistan fell, the fact that when they lifted sanctions on Iran, the fact that when they, you know, actually said that they would help Israel and then pulled back, where was Kamala when that happened? She was sitting right next to Joe Biden in the Situation Room,\" the former U.N. ambassador pointed out. \"This administration is Kamala Harris's administration. Everything that has happened is hers. So define her on that way. Talk about those issues.\" CLOSE CONTEST BETWEEN TRUMP AND HARRIS IN THIS BATTLEGROUND STATE TURNED RED: POLL Haley, who endorsed Trump at the Republican National Convention in July, added that she genuinely hopes he wins in November, but she has no interest in serving in his administration again. CLICK HERE TO GET THE FOX NEWS APP \"Trump knows how to win. He just needs to do it now. He has the ability to do it,\" she said. \"There is no question that I want to see Donald Trump win this election because we can't have a Kamala Harris and Tim Walz.\"","summary":"Former GOP presidential candidate Nikki Haley tells &apos;Special Report&apos; how Republicans can win in November and why the party needs to make a &apos;serious shift.&apos;","url":"https://www.foxnews.com/media/nikki-haley-has-blunt-message-trump-gop-kamala-harris-gains-momentum-quit-whining","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/haley-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-14 00:29:53","author":"Ashley Carnahan","authors":["Ashley Carnahan"],"language":"en","source_country":"us","sentiment":-0.431},{"id":254057196,"title":"Donald Trump Endorsed by Republican Who Voted to Convict Him","text":"Former President Donald Trump has been endorsed by one of the seven Republicans who voted to convict him during his second Senate impeachment trial.Former Senator Richard Burr, who retired from the upper chamber in January 2023, voted to convict Trump on charges of incitement of insurrection following the January 6, 2021, attack on the U.S. Capitol, which occurred shortly after a Washington, D.C., rally that saw Trump tell supporters to head to the Capitol to \"fight like hell\" as a joint session of Congress certified President Joe Biden's 2020 election win.Trump was impeached for the first time in late 2019, accused of withholding military aid to force Ukrainian President Volodymyr Zelensky to announce an investigation into Biden. Burr did not vote to convict Trump after the first impeachment. Neither impeachment resulted in conviction in the Senate, where a two-thirds supermajority vote is required to convict.On Monday, Spectrum News reported that Burr said during an interview in July that he intends to vote for Trump this year despite his vote in 2021, which he argued was not intended as \"a disqualifier as to whether you can serve\" but instead a protest of Trump's decision to abandon former Vice President Mike Pence at the Capitol while rioters chanted out their desire to \"hang\" him.\"My vote on the president wasn't on anything the House presented,\" Burr told the outlet. \"It was on the fact that I thought that the president leaving the vice president, without surging to Capitol Hill a protective detail, to take a vice president with a nuclear football, and to make him secure was a breach of office.\"Burr went on to say that while \"maybe someone will have a hard time squaring\" his support for Trump with finding him guilty of incitement to insurrection, he does not \"have a hard time squaring with it\" because he \"firmly understood why [he] voted for impeachment.\"\"And l like I said, that's not a disqualifier as to whether you can serve,\" Burr added. \"It's a bad choice I thought a president made one time.\"Newsweek reached out for comment to the offices of Trump and Pence via email on Tuesday evening.Pence, who challenged Trump for the GOP nomination last year, has repeatedly said that he will not be backing his former running mate in this year's election, pointing out \"profound differences\" between himself and Trump \"on a range of issues\" during a Fox News interview earlier this year.Trump turned on Pence following his refusal to attempt to block the certification of Biden's 2020 win, while also accusing the former vice president of being \"not a very good person\" and \"going to the Dark Side\" after Pence denounced him for putting \"himself over the Constitution.\"Former Republican Arizona Governor Doug Ducey, who became another frequent target of Trump's rage after certifying Biden's Arizona victory, announced in a social media post that he would be putting \"differences aside\" by endorsing both Trump and pro-Trump U.S. Senate candidate Kari Lake on Tuesday.A small but significant number of former Republican lawmakers have recently committed to endorsing Vice President Kamala Harris, the Democratic nominee, over Trump in this year's election.","summary":"Seven Republican U.S. senators voted to convict Trump on charges of incitement of insurrection in January 2021.","url":"https://www.newsweek.com/donald-trump-endorsed-republican-who-voted-convict-him-1938859","image":"https://d.newsweek.com/en/full/2449407/republican-voted-convict-impeachment-endorses-trump.jpg","video":null,"publish_date":"2024-08-14 00:24:42","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.11},{"id":254057338,"title":"Kamala Harris running ads with fake news headlines – Axios","text":"US Vice President Kamala Harris has been using Google search advertisements that link to real news articles from legitimate sources, but with the headlines and descriptions altered to paint the Democratic presidential candidate in a more favorable way, according to an Axios report. The Harris campaign has been running such ads linking to stories by “nearly a dozen” news outlets, including CNN, AP, CBS, NPR, The Guardian, USA Today and others since at least August 3, Axios reported on Tuesday. The ads apparently mimic real news results “closely enough” that they can potentially mislead users. Axios wrote that such ads are a “common practice,” but acknowledged that according to Google’s ad transparency center, Harris’ rival Donald Trump is not running these types of misleading ads. Some of the outlets claimed they were blindsided and “unaware” that their brands were being featured this way, according to Axios. A spokesperson for The Guardian said the company will be “reaching out to Google for more information about this practice.” Meanwhile, Google has insisted that the practice does not violate its rules, claiming that since the ads are labeled as “sponsored,” they are “easily distinguishable” from legitimate search results. However, the tech giant admitted that due to an alleged “technical glitch” in Google’s Ad Library, some of the ads “appeared” to lack the necessary disclosures, Axios wrote. A Google spokesperson promised to investigate the glitch, insisting that the company has for years “provided additional levels of transparency for election ads specifically.”","summary":"US Vice President Kamala Harris’ campaign has been using Google search ads that link to real news articles with altered headlines \nRead Full Article at RT.com","url":"https://www.rt.com/news/602588-kamala-harris-google-ads-news/","image":"https://mf.b37mrtl.ru/files/2024.08/article/66bbf7fd85f5405c8451039a.jpg","video":null,"publish_date":"2024-08-14 00:24:29","author":null,"language":"en","source_country":"ru","sentiment":-0.334},{"id":254057256,"title":"Ex-GOP senator who voted to impeach Trump will back him in 2024: 'Not a disqualifier'","text":"Retired Sen. Richard Burr (R-NC) was one of a small handful of Republican senators who voted to convict former President Donald Trump over his role in the Jan. 6 attack on the U.S. Capitol. Despite this, he plans to vote for Trump again anyway, reported Spectrum News on Tuesday. “My vote on the president wasn’t on anything the House presented… it was on the fact that I thought that the president leaving the vice president, without surging to Capitol Hill a protective detail, to take a vice president with a nuclear football, and to make him secure was a breach of office,” said Burr. “I think some were shocked. I think some might have voted a different way if I had told them. Very possibly. Very possibly.” As for why he was going to vote for Trump this year despite all of this, he said: “Maybe someone will have a hard time squaring with it. I don’t have a hard time squaring with it because I firmly understood why I voted for impeachment. And l like I said, that’s not a disqualifier as to whether you can serve. It’s a bad choice I thought a president made one time.” He added that his vote to convict Trump was not a vote to disqualify him from office. At the time Burr cast the vote, it caused uproar in the North Carolina Republican Party, which censured him. He retired from office in 2022, and Trump ally former Rep. Ted Budd, was elected in a surprisingly close race with former Democratic state Supreme Court Justice Cheri Beasley. Burr is not the first Republican involved in the effort to impeach Trump who has gone on to give an endorsement to the former president in 2024. Former Rep. Peter Meijer (R-MI), who voted for the House's articles of impeachment, has also said he would back Trump for another term.","summary":"Retired Sen. Richard Burr (R-NC) was one of a small handful of Republican senators who voted to convict former President Donald Trump over his role in the Jan. 6 attack on the U.S. Capitol. Despite this, he plans to vote for Trump again anyway, reported Spectrum News on Tuesday.\n\n“My vote on the president wasn’t on anything the House presented… it was on the fact that I thought that the president leaving the vice president, without surging to Capitol Hill a protective detail, to take a vice president with a nuclear football, and to make him secure was a breach of office,” said Burr. “I think some were shocked. I think some might have voted a different way if I had told them. Very possibly. Very possibly.”\n\nAs for why he was going to vote for Trump this year despite all of this, he said: “Maybe someone will have a hard time squaring with it. I don’t have a hard time squaring with it because I firmly understood why I voted for impeachment. And l like I said, that’s not a disqualifier as to whether you can serve","url":"https://www.alternet.org/gop-senator-trump/","image":"https://www.alternet.org/media-library/image.jpg?id=53173940&width=1200&height=600&coordinates=0%2C0%2C0%2C171","video":null,"publish_date":"2024-08-14 00:18:17","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","source_country":"US","sentiment":-0.492},{"id":254057118,"title":"Ex-FBI agent claims Trump’s unresolved issues with his mother surfaced during interview with Musk","text":"Former President Donald Trump’s ‘mommy issues’ were on full display in his Monday night interview with Elon Musk, an ex-FBI agent has claimed. At one point in the rambling discussion, the Republican presidential nominee, 78, was discussing a Time Magazine cover story about his opponent, Vice President Kamala Harris, when he weirdly compared the Democrat to his wife, Melania. He accused Harris, 59, of getting a ‘free ride’ from the press as she continues to forego media interviews – when he off-handedly remarked that Harris bears a resemblance to his wife. ‘But I saw a picture of her on Time Magazine today, she looks like the most beautiful actress ever to live,’ Trump said. ‘It was a drawing. And actually, she looked very much like a great first lady: Melania.’ He went on to mispronounce the vice president’s name, repeatedly referring to her as ‘Camilla.’ ‘She didn’t look like Camilla,’ Trump said. ‘That’s right. ‘But of course, she’s a beautiful woman. So we’ll leave it at that.’ Americans across the country watched the exchange happen live – and many said on social media they found Trump’s comments about the vice president off-putting. Former FBI agent Asha Rangappa, however, did not seem surprised by the former president’s remarks. ‘I KNEW IT. His brain is short-circuiting because she is attractive AND formidable,’ she posted on X. ‘Lol he is toast.’ She said the former president ‘recognizes and is slightly scared of – and in a weird way, craves the approval of – strong intelligent women,’ saying there are ‘some mommy issues going on there.’ Rangappa also claimed that Trump equates attractive women with being ‘dumb or weak’ so he can ‘sexualize and exploit and dismiss.’ Trump has been accused of having ‘mommy issues’ in the past, with Former President Barack Obama saying at his second annual Obama Foundation summit in 2018 that progress is hindered in the US because ‘we are still confused, blind, shrouded with hate, anger, racism [and] mommy issues.’ Many in attendance and in the media took that as a swipe at then-President Trump as it came just a few months after Politico Magazine published an article entitled ‘Donald Trump’s Mommy Issues.’ In the article, author Peter Lovenheim argues that his apparent failure to bond with his mother may have played a role in Trump’s personal and professional life. He notes that Trump’s mother, Mary Anne Trump, sustained a life-threatening illness when the former president was just a toddler. With his mother incapacitated with the illness and his father, Frederick Trump, never home as he focused on building his real estate empire, Lovenheim posits that Trump never successfully bonded with a primary caregiver as a child. He said such an issue can result in two common psychological issues: either an individual develops ‘attachment anxiety, leading them as adults to crave intimacy, but having difficulty seeking reassurance – or they have attachment avoidance, where as adults, they generally distrust others and convince themselves they don’t need close relationships.’ Lovenheim argued at the time that Trump was displaying signs of having attachment avoidance, pointing to what he described as the former president’s sense of self-reliance and inability to acknowledge self-doubt; his boasting of sexual encounters and the fact that he has had multiple marriages and very few close friends. The author also cited Trump’s many flattering comments over the years about his mother – calling her ‘fantastic,’ ‘tremendous,’ ‘very warm’ and ‘very loving – but providing a lack of early childhood memories to support those sentiments.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Donald Trump&#8217;s &#8216;mommy issues&#8217; were on full display in his&#8230;\n\n\nThis Post: Ex-FBI agent claims Trump&#8217;s unresolved issues with his mother surfaced during interview with Musk first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-news/ex-fbi-agent-claims-trumps-unresolved-issues-with-his-mother-surfaced-during-interview-with-musk/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Trumps-mommy-issues-came-out-in-Musk.jpg","video":null,"publish_date":"2024-08-14 00:16:45","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.033},{"id":254057210,"title":"Haley criticizes Trump campaign as she refuses to commit to campaigning for former rival","text":"Former U.N. Ambassador Nikki Haley criticized the Trump campaign’s approach to defeating Vice President Kamala Harris and refused to commit to campaigning for her former Republican rival. In an interview on Fox News’s Special Report with Bret Baier, Haley scathingly critiqued former President Donald Trump’s campaign, claiming several flaws. When pressed by Baier as to whether she would commit to campaigning for Trump, given she has endorsed him, Haley dodged the question. “I mean, he is welcome to call. I have talked to him. He is welcome to do that,” she said when asked if she would accept Trump’s request to campaign for him if asked. “They are doing what they think is best. And that is his right, to run the campaign he wants to run. He has chosen that.” “All I’m saying is I want to see them focus and I want to see them win,” Haley continued. “We have too much at stake. We have to win this election. And I genuinely hope that he will go out to the 20% of people that are going to decide this election and say, ‘You know what? I need your vote, and I’m going to fight hard to do it, and these are the issues I’m going to fight on.'” She criticized the campaign on multiple fronts, repeating complaints from other Republicans that Trump shouldn’t attack Harris based on her racial identity and other insults. “The campaign is not going to win talking about crowd sizes,” she said. “It’s not going to win talking about what race Kamala Harris is. It’s not going to win talking about whether she is dumb. It’s not — you can’t win on those things. The American people are smart. Treat them like they are smart.” “The Republican Party, Donald Trump, people here at Fox, quit complaining that she is not giving an interview; you don’t need an interview from Kamala Harris,” Haley added at another point. “I take her at her word that she wants to raise taxes for households over $100,000. … Take her at her word.” Haley also took several other swipes at Trump, beginning the interview by saying that she ran because she didn’t believe Trump was the best candidate but doesn’t want Harris to be president and so wants Trump to win. The former South Carolina governor also said she doesn’t want to serve in a second Trump administration and would refuse the offer if Trump gave one. “No, I’m not interested in serving in the administration. I said that on the campaign. This was never about a position for me. This was never about something else. I ran because I love this country so much,” Haley said. “It was really in that vein that I ran. But now it’s in that vein as a voter that I want to see Donald Trump win. Because we can’t afford to have a President Kamala Harris.” Haley was the last major Republican to run against Trump, becoming his foremost rival after Gov. Ron DeSantis (R-FL) dropped out. She lost nearly every primary before dropping out of the race in March and endorsed Trump at the Republican National Convention in July.","summary":"Former U.N. Ambassador Nikki Haley criticized the Trump campaign&#8217;s approach to defeating Vice President Kamala Harris and refused to commit to campaigning for her former Republican rival. In an interview on Fox News&#8217;s Special Report with Bret Baier, Haley scathingly critiqued former President Donald Trump&#8217;s campaign, claiming several flaws. When pressed by Baier as to [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3120629/haley-criticizes-trump-campaign-refuses-commit-campaigning-former-rival/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/03/AP24052784118107.jpg","video":null,"publish_date":"2024-08-14 00:06:27","author":"Brady Knox","authors":["Brady Knox"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.145},{"id":254057258,"title":"How Harris is snatching power from the press corps","text":"The first thing you need to know about the vice president’s approach to the Washington press corps is look how well she’s doing as a result. Kamala Harris is now leading Donald Trump in some national polling averages as well as in some swing-state polls. True, her lead is within the margin of error in most cases, but that’s an improvement from where the Democrats were before Joe Biden dropped out of the running and orchestrated instantaneous unification around his No. 2. I don’t think I’m overstating things. Her current lead, the millions of dollars she’s bringing in, the thousands of volunteers who are signing up to help, the big big mo’ – I think all of it comes directly from her campaign’s decision not to give the press corps too much access too fast. I think that decision comes directly from the fact that Harris saw firsthand what the press corps did to Joe Biden’s campaign. Some members of the press corps have noticed how well Harris is doing without them, and apparently, it doesn’t sit right. Here’s Chris Cillizza with a representative sampling. The former Post writer said the vice president has been “almost entirely” ignoring the media since she launched her campaign, and that’s bad, he said. It “bypasses the argument that the media is a critical part of our political system and any candidate who wants to be president -- whether they are winning or losing -- should be regularly subjected to scrutiny from the press.” Even if I agreed that candidates who want to be president should be regularly subjected to media scrutiny, I don’t think this press corps, as it is currently organized, is able to. There are exceptions, of course, but this press corps is generally not equipped to scrutinize candidates on matters of fact and substance. I say this because this press corps has conspicuously traded matters of fact and substance for vibes. It didn’t matter what Joe Biden did – pull the country out of a pandemic, dodge a recession, tame inflation, grow jobs, grow wages, enforce anti-monopoly laws, revive every single one of the so-called “left behind” counties that voted for Trump in 2016 because of “economic anxiety” – it didn’t matter what he did. The press corps decided nothing was more important than his age, and lo! 2024 became an election about vibes and vibes ended his candidacy. Vibes are this press corps’ forte, not fact and substance. If fact and substance were its strength, there would have been a different reaction to The Disaster Debate during which Biden talked about policy and issues while Trump didn’t bother. Trump was incoherent and false, but he came off as confident and strong, and he came off as such, because the press corps’ forte isn’t fact and substance. If fact and substance were important, there would also have been a different reaction to Biden’s NATO press conference last month. He did it after the Disaster Debate to show he still had what it takes. He talked for an hour about foreign affairs, international laws and war. But this press corps didn’t hear any of that after Biden said “Vice President Trump” by mistake. There’s no grace for the old in Washington, nor is there interest in anything but vibes in the Washington press corps. There was a time when liberals and Democrats would have nodded in agreement with Chris Cillizza on the merit of candidates being regularly subjected to scrutiny. But after this press corps made a fetish of Biden’s age, I don’t see any more room for the benefit of the doubt – and there’s no going back. This press corps made the election about vibes and it’s going to remain an election about vibes, and if those vibes now grind against the instincts of this press corps, tough shit. You reap what you sow. In the future, we might look back and see the most important difference between the Biden and Harris campaigns is their level of trust in the press corps. The president believed voters would reward him for the substantial things he has done, and he trusted – indeed, he depended on – the press corps to inform voters, as it’s supposed to. But where he saw fact and substance, the press corps saw only vibes. And in depending on the press corps to get his message across to voters, Biden effectively handed over power that was rightfully his. He allowed the press corps to be the principal arbiters of his reality, rather than reserving that right for himself. You could say Biden was waiting for power to be given to him and he suffered gravely for it. By contrast, the Harris campaign is not letting the press corps wedge itself between her and voters. She is not allowing the news media to mediate her message. In effect, she’s preventing the press corps from speaking for her and, as a consequence, she’s preventing it from exercising a de facto veto on her speech. In that, she is taking power – defining her campaign as well as Trump’s. She is turning the narrative about Biden’s age (81) back against Trump’s (78), such that whatever he says in self-defense is seen as proof of the allegations against him. This decision leaves the press corps on the outside looking in. She’s sustaining a conversation with voters directly, on her own terms, and she’s doing well as a direct consequence of that decision. But being on the outside looking in feels bad to people who crave attention. They have incentive to turn attention back to where they think it belongs. That’s why some are busy manufacturing a phony moral standard by which to scam Harris into playing by their rules. That phony moral standard goes something like this, courtesy today of Chris Cillizza: “It’s been 23 days since Joe Biden ended his candidacy. It’s been seven days since Kamala Harris was formally named the Democratic presidential nominee. She has yet to sit for an interview with any media outlet. And she has answered less than five total questions from the press.” He’s being coy but, in essence, he’s saying that Harris is violating some kind of taboo, that she’s doing something wrong, or worse, that she’s hiding something of great importance from voters. This, of course, is favorable to her opponents, but let’s be clear: she’s violating nothing. There are no rules. There is no lawbook declaring that candidates shall talk to reporters. There is a playbook, if that’s what you mean, but not a lawbook. The vice president could go the whole time without talking to one reporter and she would not have done anything morally wrong. This is really important and I will repeat myself till I burst. This is a democracy. Harris is obliged to talk to Americans. That’s the end of her moral and democratic obligation. She’s not obliged to talk to the press corps, as if it were a constituency. If she stopped talking to voters, well, that would be disqualifying. Obviously, that’s far from the case. This is not to say she shouldn’t, but that’s a different question, isn’t it? If Harris decides to talk to the press corps about matters of fact and substance relevant to her, it will be her decision made out of concern for tactics and strategy for her campaign. Reporters like Cillizza have a bad habit of presenting themselves to voters as if they operated in their interest, and we know, after watching reporters make a fetish of Biden’s age, that nothing could be further from the truth. We should not only stop tolerating this bad habit. We should be hostile towards it. The most powerful thing Harris has done – a game changing decision, if you want to call it that – was to learn from Biden’s fatal error. He tried to meet the press corps’ phony moral standard, only to have it move around, beyond his reach, thus surrendering his rightful power to define himself and his campaign. In the end, his dependence on the press corps made it so he had to ask for permission to campaign. Harris isn’t asking.","summary":"The first thing you need to know about the vice president’s approach to the Washington press corps is look how well she’s doing as a result. Kamala Harris is now leading Donald Trump in some national polling averages as well as in some swing-state polls. True, her lead is within the margin of error in most cases, but that’s an improvement from where the Democrats were before Joe Biden dropped out of the running and orchestrated instantaneous unification around his No. 2.\n\nI don’t think I’m overstating things. Her current lead, the millions of dollars she’s bringing in, the thousands of volunteers who are signing up to help, the big big mo’ – I think all of it comes directly from her campaign’s decision not to give the press corps too much access too fast. I think that decision comes directly from the fact that Harris saw firsthand what the press corps did to Joe Biden’s campaign.\n\nSome members of the press corps have noticed how well Harris is doing without them, and apparently, it doesn’t sit right. Here’s C","url":"https://www.alternet.org/alternet-exclusives/harris-press-corps/","image":"https://www.alternet.org/media-library/image.jpg?id=53173925&width=1200&height=600&coordinates=0%2C39%2C0%2C133","video":null,"publish_date":"2024-08-14 00:05:50","author":"John Stoehr","authors":["John Stoehr"],"language":"en","source_country":"US","sentiment":-0.24},{"id":254056812,"title":"Ivanka Trump and Jared Kushner meet Kim Kardashian at a popular LA venue during the former first daughter’s luxurious vacation","text":"KIM Kardashian was spotted out and about on Monday with friends Ivanka Trump and Jared Kushner at an iconic Los Angeles restaurant. Kardashian, Trump, and her husband, Jared Kushner, were catching up over dinner at the notorious socialite-famous Malibu restaurant Nobu. The unlikely trio was captured together, although they arrived separately at the Los Angeles establishment. Kardashian, known for her fashion, wore a simple black outfit as she met her old friend. The 43-year-old reality star paired a fitted black revealing top with a daring black trench coat. Kardashian wore her hair slicked back, and topped off the all-black look with small heels and a bedazzled silver purse. Trump, 42, was seen wearing a sparkling white and gold dress with her beau in a more tame white top and black sweater. The fashion designer let her hair down, styling it in simple waves. The trio grabbed dinner together and were caught chatting outside as they left. Trump and Kardashian have been friends for more than ten years, and the reality TV star utilized her relationship with the former president’s daughter to collaborate on prison reform initiatives with Donald Trump. “Kim and Ivanka have been friends for years and have hung out on a number of occasions,” a source told Us Weekly. A source mentioned that both of them have devoted a significant amount of time to criminal justice reform, which has deepened their friendship. KEEPING UP The fashion icons are said to have first met at the 2014 Met Gala, where they bonded over “motherhood and being new moms.” Since the initial meeting, Kardashian and Trump have caught up over the years, being spotted together several times. Trump even had a special cameo in The Kardashian’s on Hulu in June. Prior to the Los Angeles dinner, the two were seen together at the grand opening of the Fontainebleau in Las Vegas, Nevada in December 2023. “It’s always a great time with you @kimkardashian,” Ivanka posted on Instagram with pictures of her and Kardashian. The daughter of the former president even made an appearance at Kardashian’s 43rd birthday party last October at Funke in Beverly Hills. Kardashian posted on Instagram after the lavish event, celebrating her “jackpot of friends.” “So blessed to have hit the jackpot of friends,” she wrote while posing with Ivanka. “I couldn’t have ever dreamed I would be so lucky to call these girls my friends.” The New York socialite and mother of three re-shared the photos, writing, “Loved celebrating you! HBD Kim.” During 2018, Kardashian partnered with the president on prison reform efforts, particularly in advocating for the commutation of Alice Marie’s sentence, who had been imprisoned for 21 years due to a nonviolent drug-related charge. Trump’s husband Jared Kushner revealed in his memoir, Breaking History, that Kim asked the fashion designer star to meet her father. After the meeting, Kim had dinner at the then-first daughter’s house. The former first daughter praised the meeting, posting on X, “Great working session today at the White House on ways to improve the clemency process with policy leaders and criminal justice reform advocates.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nKIM Kardashian was spotted out and about on Monday with friends Ivanka&#8230;\n\n\nThis Post: Ivanka Trump and Jared Kushner meet Kim Kardashian at a popular LA venue during the former first daughter’s luxurious vacation first appeared on Internewscast Journal","url":"https://internewscast.com/news/ivanka-trump-and-jared-kushner-meet-kim-kardashian-at-a-popular-la-venue-during-the-former-first-daughters-luxurious-vacation/","image":"https://www.the-sun.com/wp-content/uploads/sites/6/2024/08/BGUK_2999910_008_PREMIUM-EXCLUSIVE-MUST-CALL-FOR-PRICING-BEFORE-USAGE-Kim-Kardashian-Dines-with-J.jpg?strip=all&w=960","video":null,"publish_date":"2024-08-14 00:05:39","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.647},{"id":254057226,"title":"UAW files labor charges against Trump, Musk over X interview remarks","text":"UAW files labor charges against Trump, Musk over X interview remarks The United Auto Workers union says it filed charges Tuesday against former President Donald Trump and billionaire Elon Musk over comments made Monday night during a conversation on the social media platform X. CBS News senior White House correspondent Weijia Jiang has the details.","summary":"The United Auto Workers union says it filed charges Tuesday against former President Donald Trump and billionaire Elon Musk over comments made Monday night during a conversation on the social media platform X. CBS News senior White House correspondent Weijia Jiang has the details.","url":"https://www.cbsnews.com/video/uaw-files-labor-charges-against-trump-musk/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/14/7b836cee-56a9-4df1-a02d-d9f82f95b784/thumbnail/1200x630/2523b5fee1156af5d2f216d48705ae46/cbsn-fusion-uaw-files-labor-charges-against-trump-musk-thumbnail.jpg?v=ca135fae0838bc5b23b70dacd2a620f1","video":null,"publish_date":"2024-08-14 00:03:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.87},{"id":254056736,"title":"Desi Lydic Says ‘The Daily Show’ Is Built for These Crazy Political Times","text":"Given the state of U.S. politics after the past four weeks, one would expect most politically-focused shows to be in meltdown mode. But “The Daily Show” isn’t most shows. “[Election years] are the seasons we get most excited about,” Desi Lydic, who is hosting this upcoming week starting on Tuesday night, told TheWrap. “We’re really clicked in and prepared to turn at a moment’s notice, and shift the story to accommodate for the day’s news. That’s kind of what we’re built for.” Earlier this summer, the team was prepared for “the world’s most terrifying and also perhaps boring reboot” in another face-off between former President Donald Trump and sitting President Joe Biden. But between the assassination attempt on Trump on July 13, and Biden stepping down as the primary Democratic candidate to be replaced by Vice President Kamala Harris, any level of predictability has been thrown out the window. Lydic, who was hired on “The Daily Show” in 2015, learned the “hard” way that it’s a fool’s errand to guess the results of any election. “We were all so sure of what the outcome was going to be [in 2016], and I think most of us were incredibly shocked on Election Night,” Lydic said. “You cannot predict what’s going to happen. Polls are one thing, but the American people will speak and we just have to wait and see.” As unpredictable as this election season may be, “The Daily Show” found calm waters after some turmoil in years past. Toward the end of 2022, Trevor Noah shocked the comedy community when he announced he was stepping down from hosting “The Daily Show” to focus on his standup career and touring. That decision led to last year’s history-making season of the series, which employed a revolving door of guest hosts rather than immediately naming Noah’s successor. “It was definitely an adjustment,” Lydic said, noting that it was “a little nerve-wracking” to start 2023’s season. “It was very much an experiment to try out having on different voices every week, like how is that going to work? How are we going to write to that? How are we going to produce to that? And how can we come in and help support them as correspondents?” As stressful as it may have been, that season allowed Lydic to work with some of her comedic heroes, such as Chelsea Handler and Sarah Silverman, whom she described as “nothing but loving and supportive and cool,” as well as Marlon Wayans. Lydic credited Jennifer Flanz, who has been the showrunner of the Comedy Central staple since 2013, for that stability as well as the “incredible” team of nearly 200 people on staff. She praised Flanz and the series’ writers for “seamlessly” writing for a new voice every week. “[It’s] a real testament to how good everyone is here at their jobs and how hard everyone works,” Lydic said. But on a larger scale, it prepared the “Daily Show” team for the current form of the show. Ever since Jon Stewart returned as a host and executive producer earlier this year, the late night show has blended its old format with the new. While Stewart hosts on Mondays, correspondents Lydic, Michael Kosta, Ronny Chieng and Jordan Klepper take turns each week hosting Tuesdays through Thursdays. These alternating hosting duties even apply to the show’s live events, such as its coverage of the upcoming DNC the week of Aug. 19. While the news team will be hosting from Chicago Monday through Wednesday, Stewart will host live on Thursday night. It’s a format change that’s paid off. This year, “The Daily Show” is nominated for seven Emmy awards, including Outstanding Talk Series. Additionally, Lydic specifically is nominated for Outstanding Performer In A Short Form Comedy Or Drama Series for her segment, “Desi Lydic Foxsplains.” “I always wanted to get that opportunity, but I never thought that I would ever have the chance to sit at the desk,” Lydic said. That dream has now repeatedly become a reality as this week marks Lydic’s third time hosting. The most difficult element of hosting has been the authenticity the role requires. Lydic explained that when she acts as a correspondent, she’s portraying a “very arch” version of a specific perspective. “When you’re sitting at the desk, that’s a really vulnerable exercise. We are ourselves at the desk, and it’s our point of view. We get to form a take on something, and we get to have a hand in shaping the show and inviting on guests,” Lydic said. “It’s such an incredible challenge, and it’s been an absolute gift.” Hosting a late night show is a daunting job for anyone. “No one hands you a manual. You don’t know how to do it until you just jump in,” Lydic said. But as she and her co-hosts have been navigating these new waters, Lydic is happy to have a team behind her that is “the best in the business” as well as a “mentor” in Jon Stewart. “[Stewart has] been incredibly generous and supportive,” Lydic said. “Mostly just watching him in action and absorbing all of it, it’s a gift.” Stewart originally signed back onto “The Daily Show” as a co-host through the 2024 election, as well as an executive producer through 2025 with the option to renew his commitment to the show. As for whether or not Stewart will continue his stint past the election, that remains unclear. “I don’t know what the ultimate plan will be. It’s above my pay grade at this point. But we’re all operating right now from a place of ‘This is a show. This is what the show looks like,’” Lydic said. For now, Lydic is having a “great time” passing the hosting baton around with Stewart at the helm. “I’ll watch Ronny and learn something in the way that he tackles the desk. Same thing with Jordan and Costa. We really learn from each other, and we’re sending stories to one another. We’ve got each other’s backs,” Lydic said. “Then we’re all collectively watching Jon on Mondays. It’s the ultimate master class. So we’re enjoying this era. We’re having the best time, and we’ll see what happens.” This marks Lydic’s ninth year at “The Daily Show.” When asked if she was planning to continue on the show or if she wants to host her own project one day, the comedic actor said that she’s “open to everything.” “I waited tables for 10 years and was trying to book small guest star gigs on shows for a long time. So it is not lost on me what a privilege it is to be on a show for nearly a decade now,” Lydic said. “I’m having the time of my life, and I’m excited to see what’s to come.”","summary":"The Emmy-nominated senior correspondent tells TheWrap about collaborating with the Comedy Central show's other co-hosts, and Jon Stewart's involvement after Election Night\n\n\nThe post Desi Lydic Says &#8216;The Daily Show&#8217; Is Built for These Crazy Political Times appeared first on TheWrap.","url":"https://www.thewrap.com/the-daily-show-desi-lydic-interview/","image":"https://www.thewrap.com/wp-content/uploads/2024/08/desi-lydic.jpg","video":null,"publish_date":"2024-08-14 00:02:59","author":"Kayla Cobb","authors":["Kayla Cobb"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.034},{"id":254057000,"title":"Harris to target price gouging in first policy speech","text":"WASHINGTON >> Vice President Kamala Harris will make her first policy-centered speech as Democratic presidential candidate on Friday, taking aim at price gouging, in a sign her whirlwind campaign could rattle big companies and corporate executives. Harris will travel to Raleigh, in North Carolina, a state Democrats hope to flip this election, to outline her plan “to lower costs for middle-class families and take on corporate price-gouging,” her campaign said today. Harris canceled an event in North Carolina last week because of Tropical Storm Debby. Focusing her first major policy speech on the economy, and locating it in North Carolina shows how her campaign has revived Democrats’ hopes of flipping a state they have only won twice in the last half-century. With less than three months before the Nov. 5 election when she takes on Republican Donald Trump, Harris has drawn new enthusiasm and dollars to the ticket after President Joe Biden stepped aside, and seen polls swing in her favor in some states. Her campaign sees states like Pennsylvania as a must-win, but North Carolina is more of a reach. Biden lost the state to Trump by a 1.3% margin – just 74,000 votes, but his prospects there were dim before he stepped down on July 21. TARGETING CORPORATE GREED Harris’s speech will be closely watched to see how her style or substance differs from Biden, whose economic policies received low marks from voters angry about the cost of housing, medicine, groceries and gasoline. On Saturday, Harris announced her support for eliminating taxes on tips, a position similar to Trump’s. Harris will hold a White House event with Biden on Thursday that is expected to focus on healthcare costs. Biden has blamed corporate greed for still-elevated prices, accusing companies of boosting profits by shrinking portion sizes and by failing to pass on falling costs to consumers. Big consumer goods companies have hiked prices in recent quarters, and food prices have risen 25% between 2019 and 2023. Harris policed “corporate greed and price gouging” when she was California’s attorney general from 2011 through 2016, challenging pharmaceutical, oil, electronics and cosmetics companies, a campaign official said. Harris “knows costs are too high and will make tackling inflation a ‘Day One’ priority,” added the official who declined to be identified speaking about the event beforehand. The approach marks a striking difference from Trump, who has argued that loosening regulations on industries from finance to energy will lower costs and spur growth. Nationally, Harris was ahead of Trump by five percentage points, 42% to 37%, in an Ipsos poll published on Thursday, widening her lead from a July 22-23 Reuters/Ipsos survey.","summary":"WASHINGTON >> Vice President Kamala Harris will make her first policy-centered speech as Democratic presidential candidate on Friday, taking aim at price gouging, in a sign her whirlwind campaign could rattle big companies and corporate executives.","url":"https://www.staradvertiser.com/2024/08/13/breaking-news/harris-to-target-price-gouging-in-first-policy-speech/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_20240813_brk_kha01.jpg","video":null,"publish_date":"2024-08-14 00:00:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.514},{"id":254056400,"title":"Imane Khelif reports cyber harassment involving Elon Musk and J.K. Rowling","text":"Algerian boxer Imane Khelif recently lodged a legal complaint in France regarding the online abuse she endured during the 2024 Olympics. Following this development, certain prominent figures have been implicated in the case. Both Elon Musk and J.K. Rowling have been named in the complaint, which was filed against X on Friday, according to Variety. “J. K. Rowling and Elon Musk are named in the lawsuit, among others,” attorney Nabil Boudi told Variety on Tuesday. Boudi, the individual leading the investigation, disclosed that the former US President, Donald Trump, could be involved in the probe. However, it remains uncertain whether he will be formally accused in the complaint. “Trump tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution,” the attorney added. Khelif’s complaint stems from the harassment she encountered while competing in the Paris Olympics, where she secured a gold medal in the 66kg category. This success followed an incident in which she was reportedly subjected to a gender test during a 2023 International Boxing Association event. In the wake of beating Angela Carini in an opening-round bout at the Olympics, Khelif faced a barrage of criticism after the Italian conceded the fight just 46 seconds in. In one post on X one day after Khelif’s fight with Carini, Rowling, the “Harry Potter” author, wrote: “The idea that those objecting to a male punching a female in the name of sport are objecting because they believe Khelif to be ‘trans’ is a joke. We object because we saw a male punching a female.” After the bout, former collegiate swimmer Riley Gaines wrote: “Men don’t belong in women’s sports #IStandWithAngelaCarini.” Musk, the owner of X, reposted Gaines, adding “Absolutely.” The International Olympic Committee defended its decision to let Khelif — and Taiwan boxer Lin Yu-ting — fight in this year’s Summer Games. The IOC had previously stripped the IBA of its recognition as being boxing’s governing body in 2023. Khelif is listed as being female on her passport. “We have seen in reports misleading information about two female athletes competing at the Olympic Games Paris 2024,” the IOC wrote in a statement after Khelif’s first fight. “The two athletes have been competing in international boxing competitions for many years in the women’s category, including the Olympic Games Tokyo 2020, International Boxing Association (IBA) World Championships and IBA-sanctioned tournaments. “These two athletes were the victims of a sudden and arbitrary decision by the IBA. Towards the end of the IBA World Championships in 2023, they were suddenly disqualified without any due process.” Khelif’s coach, Mohamed Chaoua, told reporters shortly before she won gold that the boxer was “greatly affected” by what she was facing — largely online — during the Olympics. “Imane has been greatly affected by this situation. (She said) ‘Why me?’” Chaoua said. “She has not surrendered to this campaign (of abuse). She has given them a lesson in ethics.” Boudi added that other names could come up as part of the investigation. “What we’re asking is that the prosecution investigates not only these people but whoever it feels necessary. If the case goes to court, they will stand trial,” the attorney told Variety. Khelif was given a hero’s welcome after returning home from Paris with a gold.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAlgerian boxer Imane Khelif recently lodged a legal complaint in France regarding&#8230;\n\n\nThis Post: Imane Khelif reports cyber harassment involving Elon Musk and J.K. Rowling first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/imane-khelif-reports-cyber-harassment-involving-elon-musk-and-j-k-rowling/","image":"https://internewscast.com/wp-content/uploads/2024/08/Imane-Khelif-names-Elon-Musk-JK-Rowling-in-cyber-harassment.jpg","video":null,"publish_date":"2024-08-13 23:56:29","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.254},{"id":254057208,"title":"Federal judge sides with officials on Democratic convention protest route","text":"A federal Chicago judge sided with officials in a case dealing with planned protests outside the Democratic National Convention. The dispute deals with the planned route of protesters, who must obtain a permit for their protest march. The Secret Service and Chicago police objected to the proposed route, arguing that it could create a “crush zone” against security barriers. U.S. District Judge Andrea Wood agreed with the alternative route offered by the Secret Service and Chicago police, which is roughly 1 mile shorter. She argued that the original route could put protesters and police “at great risk of bodily injury or death if a crowd were to surge or press up against the barrier.” The Coalition to March on the DNC, consisting of over 200 groups, says it expects 20,000 people to attend, the Washington Post reported. It objected to the decision. Hatem Abudayyeh, a coalition spokesman, told the outlet that they had fought “to make certain that all the protesters we expect to head to Chicago next week are able to make their voices heard; if we’re forced on this route that Judge Wood approved, that won’t happen.” “We’re not giving up,” he added. “We fought for permits so that we would have the greatest defense for our communities to be safe, but either way, it is our moral duty to march on the war makers, and that’s what we’ll do!” Protests at the Republican National Convention were noticeably muted, largely due to the event taking place shortly after the attempted assassination of former President Donald Trump.","summary":"A federal Chicago judge sided with officials in a case dealing with planned protests outside the Democratic National Convention. The dispute deals with the planned route of protesters, who must obtain a permit for their protest march. The Secret Service and Chicago police objected to the proposed route, arguing that it could create a &#8220;crush [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3120659/federal-judge-sides-officials-dnc-protest-route/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/dnc-protests-anti-israel.webp","video":null,"publish_date":"2024-08-13 23:51:47","author":"Brady Knox","authors":["Brady Knox"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.335},{"id":254056290,"title":"Imane Khelif names Elon Musk, J.K. Rowling in ‘cyber harassment’ complaint after Olympics gender controversy","text":"Days after Algerian boxer Imane Khelif filed a legal complaint in France over online harassment she faced during the 2024 Olympics, some high-profile people were revealed as part of the case. Both Elon Musk and J.K. Rowling have been named in the complaint, which was filed against X on Friday, according to Variety. “J. K. Rowling and Elon Musk are named in the lawsuit, among others,” attorney Nabil Boudi told Variety on Tuesday. Boudi also added that former President Donald Trump would be part of the investigation, but it is not yet clear if he will be named in the complaint. “Trump tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution,” the attorney added. Khelif won gold at the Paris Olympics in the 66kg division, which came after she allegedly failed a gender test at a 2023 International Boxing Association competition. In the wake of beating Angela Carini in an opening-round bout at the Olympics, Khelif faced a barrage of criticism after the Italian conceded the fight just 46 seconds in. In one post on X one day after Khelif’s fight with Carini, Rowling, the “Harry Potter” author, wrote: “The idea that those objecting to a male punching a female in the name of sport are objecting because they believe Khelif to be ‘trans’ is a joke. We object because we saw a male punching a female.” After the bout, former collegiate swimmer Riley Gaines wrote: “Men don’t belong in women’s sports #IStandWithAngelaCarini.” Musk, the owner of X, reposted Gaines, adding “Absolutely.” The International Olympic Committee defended its decision to let Khelif — and Taiwan boxer Lin Yu-ting — fight in this year’s Summer Games. The IOC had previously stripped the IBA of its recognition as being boxing’s governing body in 2023. Khelif is listed as being female on her passport. 2024 PARIS OLYMPICS The final results and medal count from the Paris Games Jordan Chiles’ Olympic bronze not returned despite ‘conclusive’ evidence Luana Alonso returns to training after Olympics featured abrupt retirement Weightlifting medalist Emily Campbell tears into Paris’ Olympic Village The Post’s 10 best moments of the 2024 Paris Olympics “We have seen in reports misleading information about two female athletes competing at the Olympic Games Paris 2024,” the IOC wrote in a statement after Khelif’s first fight. “The two athletes have been competing in international boxing competitions for many years in the women’s category, including the Olympic Games Tokyo 2020, International Boxing Association (IBA) World Championships and IBA-sanctioned tournaments. “These two athletes were the victims of a sudden and arbitrary decision by the IBA. Towards the end of the IBA World Championships in 2023, they were suddenly disqualified without any due process.” Khelif’s coach, Mohamed Chaoua, told reporters shortly before she won gold that the boxer was “greatly affected” by what she was facing — largely online — during the Olympics. “Imane has been greatly affected by this situation. (She said) ‘Why me?’” Chaoua said. “She has not surrendered to this campaign (of abuse). She has given them a lesson in ethics.” Boudi added that other names could come up as part of the investigation. “What we’re asking is that the prosecution investigates not only these people but whoever it feels necessary. If the case goes to court, they will stand trial,” the attorney told Variety. Khelif was given a hero’s welcome after returning home from Paris with a gold.","summary":"Days after Algerian boxer Imane Khelif filed a legal complaint in France over online harassment she faced during the 2024 Olympics, some high-profile people were revealed as part of the case.","url":"https://nypost.com/2024/08/13/sports/imane-khelif-names-elon-musk-j-k-rowling-in-cyber-harassment-complaint/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-c0n15xm36-1723591336385.jpg?quality=75&strip=all&1723576968&w=1200","video":null,"publish_date":"2024-08-13 23:50:27","author":"Andrew Battifarano","authors":["Andrew Battifarano"],"language":"en","source_country":"us","sentiment":-0.189},{"id":254057206,"title":"Esther Charlestin wins Democratic primary to take on Vermont Gov. Phil Scott","text":"Esther Charlestin won the Democratic primary to take on Gov. Phil Scott (R-VT) in November, seeking to end the GOP incumbent’s four-term legacy in a predominantly blue state. Charlestin handily defeated Peter Duval after garnering 70.5% of the vote with 29.5% of ballots tallied. The Associated Press called the race at 7:37 p.m. Eastern. Charlestin is an educator and previously served as a member of the Middlebury Selectboard, the legislative body for the municipal government of Middlebury, Vermont. Charlestin’s win doesn’t come as a surprise, especially after she was endorsed by Lt. Gov. David Zuckerman, Burlington Mayor Emma Mulvaney-Stanak, and former Gov. Howard Dean. Duval even acknowledged his candidacy was a long shot, with the candidate himself writing on his campaign website, “I am going to lose this election.” That message is reminiscent of his 2022 run when he lost to Scott in the GOP primary before once again losing in the general as an independent. Despite holding the governorship in a heavily Democratic state, Scott has long been popular among Vermont voters and won reelection in 2022 with 69% of the vote. He’s also established himself as a vocal critic of former President Donald Trump, telling supporters he voted for President Joe Biden in 2020. However, Scott has received criticism from state Democrats in recent months who say the Republican incumbent has repeatedly blamed the opposite party “for the state’s government failing under his watch.” Even so, Charlestin will face an uphill battle to unseat Scott in November, as the governor has remained popular among voters. A survey conducted by Morning Consult in April found Scott to be the most popular governor in the country with an 81% approval rating.","summary":"Esther Charlestin won the Democratic primary to take on Gov. Phil Scott (R-VT) in November, seeking to end the GOP incumbent’s four-term legacy in a predominantly blue state.  Charlestin handily defeated Peter Duval after garnering 70.5% of the vote with 29.5% of ballots tallied. The Associated Press called the race at 7:37 p.m. Eastern.  Charlestin [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3120484/democratic-primary-governor-vermont-phil-scott/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24194650205151-scaled.webp","video":null,"publish_date":"2024-08-13 23:43:46","author":"Cami Mondeaux","authors":["Cami Mondeaux"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.282},{"id":254056510,"title":"Auto workers union seeks NLRB investigation of Trump and Musk comments about firing striking workers","text":"By TOM KRISHER, AP Auto Writer DETROIT (AP) — The United Auto Workers union has filed unfair labor practice charges against Republican presidential nominee Donald Trump and Tesla CEO Elon Musk after the two discussed on social media about Musk supposedly firing striking workers. In documents filed Tuesday with the National Labor Relations Board, the union alleges that both men interfered with workers who may want to exercise their right to join a union. The NLRB said it would look into the charges, which are a request for the agency to investigate. UAW President Shawn Fain, whose union has endorsed Democrat Kamala Harris, said in a statement that Trump is anti-labor. “Both Trump and Musk want working class people to sit down and shut up, and they laugh about it openly,” Fain said. Brian Hughes, a senior advisor with the Trump campaign, called the allegations “frivolous” and a “shameless political stunt” designed to erode Trump’s strong support among American workers. The NLRB said it would investigate the complaints, one filed against the Trump campaign and the other naming Tesla Inc., the electric vehicle, battery and solar panel manufacturer based in Austin, Texas, and led by Musk. The charges stem from statements made by Trump Monday night during a conversation between the two men on X, the social media platform Musk now owns. The former president spent much of the discussion that lasted more than two hours focused on his recent assassination attempt, illegal immigration and plans to cut government regulations. But during a discussion about government spending, Trump praised Musk for firing workers who went on strike. The UAW contends this could intimidate workers for the Trump campaign or at Tesla who might want to join a union. “You’re the greatest cutter,” Trump told Musk. “I look at what you do. You walk in and say, ‘You want to quit?’ I won’t mention the name of the company but they go on strike and you say, ’That’s OK. You’re all gone.’” Musk said, “Yeah,” and laughed while Trump was talking. It wasn’t clear what employees Trump was referring to. In June, eight former workers at SpaceX, Musk’s rocket company, sued the company and Musk, alleging he ordered them fired after they challenged what they called rampant sexual harassment and a hostile “Animal House”-style work environment at the company. In addition, the NLRB determined that a 2018 Twitter post by Musk unlawfully threatened Tesla employees with the loss of stock options if they decided to be represented by a union. Three judges on the 5th U.S. Circuit Court of Appeals in New Orleans upheld that decision, as well as a related NLRB order that Tesla rehire a fired employee, with back pay. But the full 5th Circuit later threw out that decision and voted to hear the matter again. Sanjukta Paul, a law professor at the University of Michigan, said the UAW charges have real substance because the comments from Trump and Musk could “chill” efforts by workers to act collectively, including union organizing, or just getting together to improve working conditions. “You’re approvingly describing, you’re wholeheartedly commending the blatant violation of our main federal labor statute,” she said. “It would constitute interference with protected rights.” Marick Masters, a business professor emeritus at Wayne State University who follows labor issues, said the UAW’s move “puts the spotlight on Trump and attempts to put him on the defensive in terms of his attitude and demeanor toward unions.” He added that the union is watching Musk’s comments because it has targeted Tesla’s U.S. factories for organizing drives.","summary":"The charges stem from statements made by Trump Monday night during a conversation between the two men on X, the social media platform Musk now owns.","url":"https://www.twincities.com/2024/08/13/auto-workers-union-seeks-nlrb-investigation-of-trump-and-musk-comments-about-firing-striking-workers/","image":"https://www.twincities.com/wp-content/uploads/2024/08/AP24225509753105-1.jpg?w=1024","video":null,"publish_date":"2024-08-13 23:43:08","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.34},{"id":254056294,"title":"Auto workers union seeks NLRB investigation of Trump and Musk comments about firing striking workers","text":"By TOM KRISHER, AP Auto Writer DETROIT (AP) — The United Auto Workers union has filed unfair labor practice charges against Republican presidential nominee Donald Trump and Tesla CEO Elon Musk after the two discussed on social media about Musk supposedly firing striking workers. In documents filed Tuesday with the National Labor Relations Board, the union alleges that both men interfered with workers who may want to exercise their right to join a union. The NLRB said it would look into the charges, which are a request for the agency to investigate. UAW President Shawn Fain, whose union has endorsed Democrat Kamala Harris, said in a statement that Trump is anti-labor. “Both Trump and Musk want working class people to sit down and shut up, and they laugh about it openly,” Fain said. Brian Hughes, a senior advisor with the Trump campaign, called the allegations “frivolous” and a “shameless political stunt” designed to erode Trump’s strong support among American workers. The NLRB said it would investigate the complaints, one filed against the Trump campaign and the other naming Tesla Inc., the electric vehicle, battery and solar panel manufacturer based in Austin, Texas, and led by Musk. The charges stem from statements made by Trump Monday night during a conversation between the two men on X, the social media platform Musk now owns. The former president spent much of the discussion that lasted more than two hours focused on his recent assassination attempt, illegal immigration and plans to cut government regulations. But during a discussion about government spending, Trump praised Musk for firing workers who went on strike. The UAW contends this could intimidate workers for the Trump campaign or at Tesla who might want to join a union. “You’re the greatest cutter,” Trump told Musk. “I look at what you do. You walk in and say, ‘You want to quit?’ I won’t mention the name of the company but they go on strike and you say, ’That’s OK. You’re all gone.’” Musk said, “Yeah,” and laughed while Trump was talking. It wasn’t clear what employees Trump was referring to. In June, eight former workers at SpaceX, Musk’s rocket company, sued the company and Musk, alleging he ordered them fired after they challenged what they called rampant sexual harassment and a hostile “Animal House”-style work environment at the company. In addition, the NLRB determined that a 2018 Twitter post by Musk unlawfully threatened Tesla employees with the loss of stock options if they decided to be represented by a union. Three judges on the 5th U.S. Circuit Court of Appeals in New Orleans upheld that decision, as well as a related NLRB order that Tesla rehire a fired employee, with back pay. But the full 5th Circuit later threw out that decision and voted to hear the matter again. Sanjukta Paul, a law professor at the University of Michigan, said the UAW charges have real substance because the comments from Trump and Musk could “chill” efforts by workers to act collectively, including union organizing, or just getting together to improve working conditions. “You’re approvingly describing, you’re wholeheartedly commending the blatant violation of our main federal labor statute,” she said. “It would constitute interference with protected rights.” Marick Masters, a business professor emeritus at Wayne State University who follows labor issues, said the UAW’s move “puts the spotlight on Trump and attempts to put him on the defensive in terms of his attitude and demeanor toward unions.” He added that the union is watching Musk’s comments because it has targeted Tesla’s U.S. factories for organizing drives.","summary":"The charges stem from statements made by Trump Monday night during a conversation between the two men on X, the social media platform Musk now owns.","url":"https://www.mercurynews.com/2024/08/13/auto-workers-union-seeks-nlrb-investigation-of-trump-and-musk-comments-about-firing-striking-workers/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/AP24225509753105.jpg?w=1024","video":null,"publish_date":"2024-08-13 23:43:08","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.34},{"id":254056106,"title":"Popular GOP governor's Dem challenger revealed in deep-blue state's primary","text":"Democrat Esther Charlestin was declared the winner in Vermont's gubernatorial primary on Tuesday night, advancing her to face the deep-blue state's Republican governor. The race was called for Charlestin, an educator and first-generation Haitian American, who defeated computer scientist Peter Duvall on Tuesday. The current governor, Republican Phil Scott, has served as governor for four terms and did not face a primary challenger. RNC FILES LAWSUIT OVER NONCITIZEN VOTING RIGHTS IN VERMONT'S LARGEST CITY Charlestin was endorsed by former Democrat Gov. Howard Dean, Lt. Gov. David Zuckerman and Burlington Mayor Emma Mulvaney-Stanak. Duval, a former Underhill Selectboard member, stated on his website leading up to the election, \"I am going to lose this election,\" but he said a vote for him would help elevate environmental issues in state politics. He also encouraged Republicans and progressives to write in his name in their party primaries. 'SQUAD' FACES FINAL PRIMARY CHALLENGE AS 4 STATES GO TO POLLS TUESDAY Despite being a Republican governor in a heavily Democrat state, Scott remains a popular figure. He received 69% of the vote in the 2022 general election. Scott has been a critic of Republican Donald Trump and endorsed former United Nations Ambassador Nikki Haley for president. He said he was one of the 66% of Vermont voters who cast their ballots for Democrat Joe Biden in 2020. CLICK HERE TO GET THE FOX NEWS APP The Associated Press contributed to this report.","summary":"Incumbent Vermont Gov. Phil Scott, a Republican, learned which Democrat he will face in the November general election as he runs for his fifth term in office.","url":"https://www.foxnews.com/politics/popular-gop-governors-dem-challenger-revealed-deep-blue-state-primary","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/file-76.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-13 23:42:42","author":null,"language":"en","catgory":"politics","source_country":"us","sentiment":-0.279},{"id":254055932,"title":"Gov. Tim Walz, VP Kamala Harris’ running mate, introduces himself to donors in Newport Beach","text":"In a speech peppered with Midwest jokes and self-deprecating quips, Minnesota Gov. Tim Walz gave an introduction of sorts to friendly voters in Orange County on Tuesday, Aug. 13. Walz, who was named Vice President Kamala Harris’ running mate just last week, headlined a fundraiser in Newport Beach, one of his first solo events since joining the ticket. Standing before a large ballroom at the Balboa Bay Resort, a waterfront hotel in Newport Beach, Walz ran through his resume: governor, congressman, educator, coach — “We won the damn state championship,” he reminded a cheering audience. He ran through his platform — supporting gun ownership when balanced with certain regulations, paid family leave and clean air regulations. “They keep talking about these are radical things, and I’m like, go ahead and label me whatever you want because I’ll damn sure guarantee you 80% of people in Minnesota and across the country want those things,” said Walz to applause. He sought to endear himself to a campaign-estimated 200 people, many who paid between $1,000 and $100,000 for tickets to hear him speak for about 30 minutes on a warm weekday. Responding to being asked whether he was surprised to be named the vice presidential contender, Walz joked, “I couldn’t be more surprised if I woke up with my head stapled to the carpet.” “I’m surprised,” he said, “but I’m also encouraged. Not about me because this isn’t my story. This is an American story.” Introductions and some jabs at their GOP opponents aside, Walz kept the conversation largely focused on Harris, his running mate. “You know better than anybody in this state what we’ve got in the vice president,” Walz said. “She’s found her voice.” “We’ve got 84 days to take this country in the direction we know is true to our values, the promise of America,” Walz said. “The idea for my daughter, for my son, for countless young people across this country to wake up on the 85th day, to know that we have Madam President Kamala Harris.” Walz also noted his daughter, Hope, was in attendance at the Orange County event, drawing large cheers. He briefly shared his family’s own deeply personal story about using in vitro fertilization treatments – a procedure that involves retrieving a woman’s eggs and combining them in a lab dish with sperm to create a fertilized embryo that is transferred into the woman’s uterus in hopes of creating a pregnancy – that contributed in the birth of his daughter. Making a seeming jab at past comments from Ohio Sen. JD Vance, former President Donald Trump’s running mate, Walz said, “If it’s your choice not to have children, that’s a choice you need to make and celebrate.” Vance has drawn scrutiny for past comments he’s made about women without biological children, including Harris. While Tuesday’s event was a fundraiser, meaning Walz could expect to be well-received, his jokes seemingly landed with the crowd. He often elicited laughter and cheers. “I’ve never seen so much enthusiasm in all the years I’ve been doing this,” said attorney Wylie Aitken, one of the hosts of Tuesday’s fundraiser. “It’s amazing that when everybody was kind of down and out and feeling, legitimately, concern with (President Joe) Biden, etc., then suddenly to have this reversal and to see this incredible enthusiasm that’s energized everyone.” Aitken’s been involved in local Democratic politics for a long time and is impressed by what he said is the enthusiasm Harris and Walz have brought to the Democratic ticket. “It’s a historic moment, not just for democracy, but I think we have our best shot at putting a woman in the White House, and that’s going to be fantastic,” Aitken said. Multiple California Democratic House members were at the fundraiser, including Reps. Nanette Barragán of South Gate, Mike Levin of San Juan Capistrano and Katie Porter of Irvine. “I was excited and energized before, and I continue to be,” said Levin, who noted that he appreciates Walz’s background as a former House member from a competitive district. “I think Tim Walz will do a great job as the vice presidential nominee.” Levin was an early Democratic House member who called on Biden to set aside his re-election bid, even telling the president that directly during a call. As Walz stood behind him greeting those who had come out to see him, Levin said, “I want to win the election in November and defeat Donald Trump. Vice President Harris and Gov. Walz give us a great chance to do just that.” Before speaking at Tuesday’s fundraiser — where he had four American flags behind him and a bar and charcuterie station for attendees at the back of the room — Walz addressed a crowd of more than 4,000 union workers in Downtown Los Angeles earlier. “Just to be clear, the vice president and I, we know exactly who built this country — It was nurses, it was teachers, and it was state and local government employees that built this nation,” Walz said there. “And it’s not just a saying, it’s a fact: When unions are strong, America is strong.” Former President Trump visited Newport Beach for a fundraiser of his own in June. It’s one of places in the U.S. that have raised the most money for the former president this election cycle: His campaign committee has brought in, so far, $770,000 in the 92660 and 92663 ZIP codes; the Biden-Harris campaign committee has raised a little over $145,000, according to Federal Election Commission reports. Staff writers Clara Harter and Hanna Kang and The Associated Press contributed to this report.","summary":"With self-deprecating jokes and some jabs at GOP opponents, Walz promoted Harris and the Democratic ticket in Orange County.","url":"https://www.ocregister.com/2024/08/13/gov-tim-walz-vp-kamala-harris-running-mate-introduces-himself-to-donors-in-newport-beach/","image":"https://www.ocregister.com/wp-content/uploads/2024/08/LDN-L-WALZ-LA-0814-DC-7-1.jpg?w=1024","video":null,"publish_date":"2024-08-13 23:39:42","author":"Kaitlyn Schallhorn","authors":["Kaitlyn Schallhorn"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.076},{"id":254056298,"title":"Trump to hit battleground states ahead of DNC","text":"Trump to hit battleground states ahead of DNC Former President Donald Trump is set to hit the campaign trail in the battleground states of North Carolina and Pennsylvania this week after facing questions about his event schedule. CBS News campaign reporter Olivia Rinaldi has more. Then, political strategists Ashley Etienne and Kevin Sheridan join with analysis.","summary":"Former President Donald Trump is set to hit the campaign trail in the battleground states of North Carolina and Pennsylvania this week after facing questions about his event schedule. CBS News campaign reporter Olivia Rinaldi has more. Then, political strategists Ashley Etienne and Kevin Sheridan join with analysis.","url":"https://www.cbsnews.com/video/trump-to-hit-battleground-states-ahead-of-dnc/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/13/58254c59-09e1-4179-909b-1de6a4636377/thumbnail/1200x630/2c80091c3430d1a176b62a45a9f54eff/cbsn-fusion-trump-to-hit-battleground-states-ahead-of-dnc-thumbnail.jpg?v=ca135fae0838bc5b23b70dacd2a620f1","video":null,"publish_date":"2024-08-13 23:35:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.038},{"id":254055548,"title":"Real-estate broker Alexander brothers ‘harassing’ alleged victims and families: source","text":"Broker bros deal in sleaze Last month, I wrote about the three real estate broker brothers Alon, Oren and Tal Alexander. Partners. Supersuccessful. Sell millions. Begun with Douglas Elliman, the smooth lookers then started their own hustle. Jet-setters. The lifestyles sometimes matched the penthouses they peddled. It’s live high. Think big. Work hard. And grab your sex whether she wants it or not. Not-nice news stories ooze out about them and they are now entangled with lawyers and lawsuits. Their Instagram accounts’ have suddenly gone private or been deactivated. One alleged victim pledged that every penny of any verdict will go to sexually assaulted victims. Their not-nice habits were just immortalized in the New York Times and New York Magazine. It’s multiple females suing. For rape plus what constitutes bad behavior. A subpoena’s even gone to the husband of one of the victims. Could be — someone who knows says — that what appears now is an added situation. Harassment. That a strange man showed at the home of one of the alleged victims and — at night — banged on their door. Families being harassed. Others subpoenaed. Lawyers request this harassment cease. Apparently the effort is to intimidate family members of the victims. There are several lawsuits. Accusations are that sex-wise these appear to be heavy-duty players. One of the alleged rape cases goes back 20 years. All three deny the whole thing. In a pol vault Off-B’way’s “Ghost of John McCain,” set for Soho Playhouse, needs bodies to play Hillary, Biden, Lindsey Graham. So if you got nothing else to do — go play Hillary. The project is undergoing script changes to include a Kamala character now immortalized by Zonya Love who also plays Eva Perón. Aaron Michael Ray has the role of something called Donald Trump’s Brain. Let’s nobody discuss the show’s creator. Funding is probably by the Sanitation Dept. Opening night’s Sept. 3. Bits & pieces Robert Tucker just sworn in as NYC’s 35th Fire Commissioner is grandson to late tenor Richard Tucker . . . Newly named Meryl Streep Center for Performing Artists will have the Tom Hanks & Rita Wilson Screening Room, Nicole Kidman Green Room and DiCaprio’s On-Camera Studio. Run by SAG-AFTRA Foundation, Courtney B. Vance is president . . . PATSY’S super marvelous great West 56th Italian restaurant celebrating its 80th year with two meals for $80. H’wood takes trip on shrooms Americans — living such high lives these days — comes now the acme of their elixir. A movie called “My Old Ass.” Margot Robbie, producer. Something about being on a mushroom trip and some 39-year-old somebody meets her 18-year-old self. Or something. You’re told: “It’s about being more present and grateful. The younger self learns from the older self.” Yeah, OK, fine, but who of us personally knows anyone schlepping around with nothing to do but gather mushrooms? This old “ass” — not mine, the movie’s — drags into theaters Sept. 13. So this producer, offering a formerly famous movie star the role of a prostitute who lies, cheats and runs from bum to bum, then asked, “How do you feel about the role?” She said, “Please — it’s the first decent part I’ve been offered in years.” Only in New York, kids, Only in New York.","summary":"An alleged rape victim of real estate heirs Oren and Alon Alexander claims that a mysterious person showed up at their home to harass them.","url":"https://nypost.com/2024/08/13/opinion/real-estate-broker-alexander-brothers-harassing-alleged-victims-and-families-source/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-uapjq7izz-1723590692054.jpg?quality=75&strip=all&1723576347&w=1200","video":null,"publish_date":"2024-08-13 23:31:01","author":"Cindy Adams","authors":["Cindy Adams"],"language":"en","source_country":"us","sentiment":-0.001},{"id":254056302,"title":"UAW's Shawn Fain unpacks labor charges against Trump, Musk","text":"UAW's Shawn Fain unpacks labor charges against Trump, Musk The United Auto Workers union has filed federal labor charges against both former President Donald Trump and Elon Musk. The charges are tied to particular comments made during Trump's X interview with Musk on Monday. Shawn Fain, president of the United Auto Workers union, joins \"America Decides\" to discuss the move.","summary":"The United Auto Workers union has filed federal labor charges against both former President Donald Trump and Elon Musk. The charges are tied to particular comments made during Trump's X interview with Musk on Monday. Shawn Fain, president of the United Auto Workers union, joins \"America Decides\" to discuss the move.","url":"https://www.cbsnews.com/video/shawn-fain-unpacks-uaw-labor-charges-against-trump-musk/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/13/4d9f9793-f63e-4115-b9da-adf504829261/thumbnail/1200x630/70ae43f38b997c12fa8e5b4c4f79ae68/cbsn-fusion-shawn-fain-unpacks-uaw-labor-charges-against-trump-musk-thumbnail.jpg?v=ca135fae0838bc5b23b70dacd2a62","video":null,"publish_date":"2024-08-13 23:31:00","author":null,"language":"en","source_country":"US","sentiment":-0.098},{"id":254055542,"title":"Letters: Harris vs. Trump | Secretive process | Democracy on ballot | Big lie? | Against fascism","text":"As Harris ascends, Trump stumbles Now that Joe Biden has bowed out of the race, Democrats have newfound energy. Kamala Harris should get a bump in the polls when she showcases her vice presidential running mate, Minnesota Gov. Tim Walz, and in the aftermath of the Democratic National Convention. Recent polls show the race is now a toss-up, whereas only a few weeks ago, Donald Trump was significantly ahead. And Trump has made one blunder after another. He recently questioned the fact that Harris was Black, saying if she was Indian, she couldn’t also be Black. Apparently, he never heard of the word “biracial.” In his recent interview with a group of Black journalists that went viral, he was asked why he keeps repeating obvious lies that neither Nikki Haley nor Barack Obama were born in America. He ducked the question and went on a rant that he was the best president for Blacks since Lincoln. Arthur Straus Walnut Creek Secretive risk process heats insurance market Re: “How to cool down California’s heated insurance market” (Page A8, July 28). As a CSAA policyholder who just received a Notice of Cancellation of Insurance, I avidly read Mike Zukerman’s opinion piece. The cancellation is due to my property’s wildfire risk score of 4 out of 30 (zero being no risk), but the CSAA notice says that “the risk score is not based solely on the wildfire risk score, but is a combination of factors, which may be weighed differently under certain circumstances unique to an individual property.” CSAA has refused to provide my risk assessment report or an explanation of the “combination of factors.” CSAA’s obfuscation, refusal to provide critical information and short timeline to get another policy in place is only inflaming the “heated home insurance market,” not cooling it. Kathleen Lassle Alamo Trump puts democracy on November ballot Donald Trump is a convicted felon (34 counts), with other cases pending; liable for sexual assault and slander (E. Jean Carroll); impeached twice; a 2020 election-denier; the leader of the Jan. 6 insurrection; cheated on all three wives; paid off Stormy Daniels to keep her quiet about their affair; separated thousands of immigrant children from their parents; refers to immigrants as “vermin” and “criminals”; left thousands dead of COVID-19 due to lack of coherent policies; stacked the Supreme Court, resulting in the overturning of Roe v. Wade; a racist, a Project 2025 supporter (as is J.D. Vance); a climate change-denier; and would have the United States quit NATO and cease Ukraine support. J.D. Vance called Trump “reprehensible,” “an idiot,” and said he may be “America’s Hitler”; favors a nationwide abortion ban, even in cases of rape and incest; opposes divorce and gay marriage; claims he would have done the job that Vice President Mike Pence refused to do, to overthrow the 2020 election results. Wake up, America. Democracy itself is on the November ballot. Eric Mills Oakland What exactly was Democrats’ big lie? Re: “With liars in both parties, let’s write in Nikki Haley” (Page A6, Aug. 6). I was puzzled reading Dick Patterson’s letter equating Donald Trump’s and the Democrats’ “big lies.” Trump’s big lie, that he was cheated out of the presidency in 2020, has cost America so much. The tradition of peaceful transfer of presidential power, which for over two centuries has been the hallmark of American democracy and envied by fledgling democracies around the world, is gone. So many American lives have been ruined, or disrupted, with legal woes. The rift it created continues to take a toll on American life every day. The Democrats’ “big lie” is hard for me to fathom. It’s that they did not announce to the world that President Biden was not healthy, and therefore, not able to function as president. I think that he’s a functioning president who declined to run for reelection because of his age. Where is the big lie in all this? Jim Peterson Walnut Creek Vote against Trump is a vote against fascism Re: “Mallard Filmore” (Page B9, Aug. 6). Attempting to obscure the truth, the comics page’s Bruce Tinsley jokes about the far-right’s embrace of fascism. What do people like him not understand about the Jan. 6 insurrection and Trump’s support of it? Why do they ignore Trump’s attempts to overturn election results in Georgia and elsewhere? I try to forgive Trump supporters, assuming that most are just badly informed (as they would be if Fox “News” is a primary source). But they are abetting the attempted destruction of our democracy by a con man. If it looks like a duck, quacks like a duck and walks like a duck, it’s fascism. Vote against it. Jim Boots Danville","summary":"East Bay Times Letters to the Editor for Aug. 14,2024","url":"https://www.mercurynews.com/2024/08/13/letters-1828/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/Election_2020_Debates_58749.jpg?w=1024","video":null,"publish_date":"2024-08-13 23:30:25","author":"Jaime Welton","authors":["Jaime Welton"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.14},{"id":254056304,"title":"Walz goes solo to court union members","text":"Walz goes solo to court union members For the first time, Minnesota Gov. Tim Walz went solo on the campaign trail Tuesday afternoon, addressing union members in Los Angeles. Meanwhile, former President Donald Trump made headlines for an interview with Elon Musk on the social media platform X. CBS News' Caitlin Huey-Burns and Weijia Jiang have the latest.","summary":"For the first time, Minnesota Gov. Tim Walz went solo on the campaign trail Tuesday afternoon, addressing union members in Los Angeles. Meanwhile, former President Donald Trump made headlines for an interview with Elon Musk on the social media platform X. CBS News' Caitlin Huey-Burns and Weijia Jiang have the latest.","url":"https://www.cbsnews.com/video/walz-goes-solo-to-court-union-members/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/13/c48fe81b-a6ce-43b5-80e8-b427aa110dba/thumbnail/1200x630/573ae3ab8b777879bb8056244c7bdc53/cbsn-fusion-walz-goes-solo-to-court-union-members-thumbnail.jpg?v=ca135fae0838bc5b23b70dacd2a620f1","video":null,"publish_date":"2024-08-13 23:29:00","author":null,"language":"en","source_country":"US","sentiment":0.922},{"id":254056894,"title":"Why Musk and Trump are on the same side","text":"Last night, former President Donald Trump returned to X, the social media site once known as Twitter in as bombastic a form as possible: a livestream with the site’s now-owner Elon Musk. The interview on Spaces, X’s platform for live audio conversations, covered everything from illegal immigration to union busting. At one point, Trump and Musk underscored the need for an American leader who would inspire fear in other countries. Over the course of two hours, the richest man in the world and the former president of the United States reminded us that they share some striking similarities — giant egos, a love of attention and social media, yet at the same time a sense of victimhood. (Vice President Kamala Harris might love Venn diagrams, but she’d have to hate this intersection.) While Trump had been banned following the events of January 6, and reinstated when Musk took over, he only returned to the platform in text for yesterday’s conversation. Both Musk and Trump promoted the interview as a marquee entertainment event, with Musk promising that it would be “unscripted with no limits on subject matter, so should be highly entertaining!” Yet the two men gabbed mostly about the predictable topics: the US border, crime, and then still more about the border. The interview was yet another opportunity for Trump to spew insults and make false statements, with no pushback from his interviewer — not even when Trump told Musk, the CEO of an EV company, that he planned to “drill, baby, drill” in his second term. The livestream started nearly an hour late due to technical difficulties. Almost 20 minutes after it was set to begin, Musk wrote that there appeared to be a “massive DDOS attack on X.” (A DDoS attack intentionally disrupts a site by flooding it with traffic; it wouldn’t be accurate to call it a DDoS attack if a lot of people organically wanted to tune in.) Previous Spaces events on X have been rife with glitches, too — a live convo between Musk and Florida Gov. Ron DeSantis last May, in which DeSantis announced his presidential bid, crashed when over 500,000 people tried to listen in. Before the Trump interview, Musk said that X would be conducting stress tests to ensure the livestream could handle the traffic. Top livestreams on YouTube and Twitch have handled millions of concurrent viewers before, and the most popular streamers on those platforms regularly enjoy hundreds of thousands of viewers. Today, Trump returned to Truth Social, the social media site that he has a majority stake in, to praise Musk and lash out against the media for reporting on the technical issues that delayed the livestream. “I absolutely HATE the Fake News Media,” he wrote. “So bad for our Country!” Trump and Musk’s rocky history Trump and Musk haven’t always been on good terms. In the run-up to the presidential election in 2016, Musk said in a CNBC interview that Trump was “not the right guy,” noting that he didn’t have the “sort of character that reflects well on the United States.” Still, once Trump was in office Musk initially fostered a friendly relationship with the president, even agreeing to join two White House advisory councils. He quickly stepped down after Trump pulled out of the Paris Agreement, which aims to limit global warming to under 2 degrees Celsius. Then, at a rally in 2022, Trump claimed that Musk had told him he voted for him in 2016, calling the billionaire a “bullshit artist.” Musk sniped back that Trump should “sail into the sunset,” and in response Trump wrote on Truth Social that Musk had come to the Oval Office to ask for help “on all of his many subsidized projects,” and that he could have told Musk to drop to his knees and beg. --- A fact check on Trump and Musk on immigration One topic the two men continually returned to was immigration, and the insistence that there’s a scourge of crime committed by undocumented immigrants sweeping the nation. Trump said that over 20 million people have illegally crossed the US border under President Joe Biden, far outpacing estimates from experts. He repeated the unsubstantiated claim that many of them were coming from jails and mental institutions and called them “stone cold killers in many cases.” Trump and Musk also agreed that migrant crime was “destroying” cities like New York and San Francisco. “They just let violent criminals out in New York,” said Musk. “The only one they’re going to prosecute is Donald Trump,” the former president interjected. In fact, violent crime in US cities has plummeted in the first half of 2024. --- All that appears to be water under the bridge now. Musk officially endorsed Trump in July on the day of his attempted assassination, and is backing a super PAC aiming to get 800,000 Americans in swing states to vote for Trump. The Wall Street Journal recently reported that the two speak on the phone several times a month now to discuss topics such as “immigration, technology and science.” Why the two see eye to eye As the conversation wound down, Trump congratulated Musk on getting “60 to 70 million” listeners, appearing to mistake the number of passive views the event got on X with the number of people who had tuned in (a little over 1 million). Musk mused that the total number of views the interview would eventually get would be in the hundreds of millions. It was a moment that summed up what the two men have in common — a tendency to self-aggrandize and inflate their accomplishments. They both have a habit of saying incendiary things, whether on camera or online, and have used social media to grow a fervent fan base around their cult of personality. Trump has been mostly absent on X even after being reinstated in November 2022, posting primarily on Truth Social. He’s under an exclusivity clause that limits non-political posts he can make outside of Truth Social — but this interview appears to fall under an exemption because it’s related to politics. Yesterday, in the lead-up to the interview, Trump made multiple posts on X boosting his presidential campaign, pinning a campaign ad to the top of his profile. Prior to August 12, Trump hadn’t posted on X in almost a year. Now, though, Musk and Trump are also united by a sense of personal grievance and persecution. Trump complained that the Democrats had weaponized the legal system against him, referring to the many criminal investigations he’s under. “The Biden administration did something that’s never been done in this country, and that’s go after their political opponent — me — with this nonsense,” Trump said. A few days ago, Musk posted a graphic (the source of which is unclear) on X portraying himself and his political views as the side resisting oppression — much like Luke Skywalker in Star Wars, Katniss Everdeen in The Hunger Games, or Neo in The Matrix. “When it’s fiction you understand,” the picture reads. “You refuse to see it when it’s the reality you’re living in.” Musk groused that people painted him as a “far-right guy, which is absurd because I’m, like, making electric vehicles,” he said. “I stood in line for six hours to shake Obama’s hand when he was president.” While Musk said he used to vote for Democrats, in 2022 he announced he would start voting Republican because the Dems had become the party of “division & hate.” In the past year he has repeated rhetoric echoing the white supremacist “great replacement” theory, which alleges that there’s a conspiracy to replace white people by bringing undocumented immigrants into the US. He has also consistently been dismissive of LGBTQ+ equality, showing particular contempt for transgender people. Musk’s daughter, who is trans, has criticized his treatment of her gender identity on Instagram’s Threads. --- A fact check on Trump and Musk on inflation Turning to the economy, both men blamed excess government spending during the pandemic as the primary cause of inflation. Economists generally attribute recent US inflation to a mix of reasons — not just government spending, but also supply chain interruptions combined with a surge in consumer demand. The $2.2 trillion CARES Act, one of the major Covid-19 stimulus packages, was signed into law by Trump. --- There were plenty of strange asides that the two men touched on during the conversation on X, highlighting their shared chaos — such as when Musk brought up building tunnels to “solve traffic.” Trump praised China’s high-speed rail system, but Musk was referring to tunnels for Tesla cars, like the Las Vegas Loop. Both agreed that Harris was a “far left” politician, with Trump repeating his accusation that Biden’s decision to drop out of the presidential race was a “coup” conducted by the Democratic Party. While on the subject of government overspending, Trump declared that he would shutter the Department of Education and “move education back to the states” during his second term. The former president also appeared to praise Musk for his mass firing of disgruntled Twitter employees in late 2022. “I won’t mention the name of the company,” he said, “but they go on strike and you say, ‘That’s okay, you’re all gone.’” After the X interview, the United Auto Workers filed federal labor charges with the National Labor Relations Board, accusing Trump and Musk of “illegal attempts to threaten and intimidate workers.” At the top of the interview, Musk said that he wanted to show what Trump was like outside of an adversarial interview, despite the fact that the former president is famous for holding countless rallies where he speaks without restraint. “It’s hard to catch a vibe about someone if you just don’t hear them talk in a normal way,” Musk claimed, adding that the event was aimed at “open-minded independent voters.” It remains to be seen how many voters were impressed by Trump’s and Musk’s vibes.","summary":"Last night, former President Donald Trump returned to X, the social media site once known as Twitter in as bombastic a form as possible: a livestream with the site’s now-owner Elon Musk. The interview on Spaces, X’s platform for live audio conversations, covered everything from illegal immigration to union busting. At one point, Trump and [&#8230;]","url":"https://www.vox.com/politics/366843/trump-elon-musk-interview-election","image":"https://platform.vox.com/wp-content/uploads/sites/2/2024/08/Trump_Musk.jpg?quality=90&strip=all&crop=0%2C10.730529951316%2C100%2C78.538940097369&w=1200","video":null,"publish_date":"2024-08-13 23:25:00","author":"Whizy Kim","authors":["Whizy Kim"],"language":"en","source_country":"us","sentiment":-0.364},{"id":254055650,"title":"Trump tries to jumpstart campaign with return to X","text":"Trump tries to jumpstart campaign with return to X Former President Donald Trump marked his return to the social media platform X on Monday night with a lengthy and glitch-plagued interview with Elon Musk, the site's owner. But some in the Trump campaign fear Trump isn't handling the change in opponent from President Biden to Vice President Kamala Harris well. Robert Costa reports.","summary":"Former President Donald Trump marked his return to the social media platform X on Monday night with a lengthy and glitch-plagued interview with Elon Musk, the site's owner. But some in the Trump campaign fear Trump isn't handling the change in opponent from President Biden to Vice President Kamala Harris well. Robert Costa reports.","url":"https://www.cbsnews.com/video/trump-tries-to-jumpstart-campaign-with-return-to-x/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/13/4447e7fa-2085-4d22-8cb2-3fdde80fca15/thumbnail/1200x630/1faefc44adccc747b3d4b854a5a33021/0813-en-costa.jpg?v=ca135fae0838bc5b23b70dacd2a620f1","video":null,"publish_date":"2024-08-13 23:23:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.573},{"id":254055294,"title":"Imane Khelif includes Elon Musk and JK Rowling in cyberbullying case after winning Olympic boxing gold in the midst of gender controversy","text":"Algerian boxer Imane Khelif named Elon Musk and JK Rowling in a lawsuit filed to French authorities over alleged ‘acts of aggravated cyber harassment.’ Nabil Boudi, the Olympic gold medalist’s Paris-based attorney, told Variety that the Tesla mogul and Harry Potter author were both named in the criminal complaint posted to the anti-online hatred center of the public prosecutor’s office last week. The suit was filed against Musk’s social media network, X, which means it was filed against ‘unknown persons’ per French Law. Boudi explained that it ensures that the ‘prosecution has all the latitude to be able to investigate against all people,’ including those who shared hateful messages under pseudonyms. ‘J. K. Rowling and Elon Musk are named in the lawsuit, among others,’ Boudi wrote on X, noting that that Donald Trump would also be part of the investigation. ‘Trump tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution,’ he added. The news comes a few days after Khelif took home the gold medal in the women’s 66 kilogram boxing competition. She emerged victorious after enduring a widespread campaign of hatred, in which she faced a torrent of social media harassment over her gender. The 25-year-old, who is not a transgender woman and has never identified as such, allegedly has male ‘XY chromosomes’ which led to her disqualification from the 2023 world championships when she failed unspecified gender eligibility tests administered by the now-banned International Boxing Association. In one post, Rowling shared a photo Khelif’s fight with Italy’s Angela Carini, accusing the Algerian of being a man who was ‘enjoying the distress of a woman he’s just punched in the head.’ Musk, for his part, re-shared swimmer Riley Gaines’ post that claimed ‘men don’t belong in women’s sports.’ ‘Absolutely,’ the Space X boss added. Meanwhile, Trump simply wrote, ‘I will keep men out of women’s sports,’ alongside a snap of Khelif’s bout with Carini. Backlash against the boxer began when Carini abandoned their fight in just 46 seconds after she was hit twice, suffered a suspected broken nose and barely threw a punch. The Italian then sank to her knees, beat the canvas in frustration and refused to shake Khelif’s hand as she conceding victory. Meanwhile, Olympic bosses doubled down on their decision to allow Khelif – and Taiwan‘s Lin Yu-ting – to compete after they were disqualified from the 2023 world championship. Shortly after the event, the IBA had their status stripped by the IOC over governance issues and alleged corruption. ‘Every person has the right to practice sport without discrimination,’ the IOC said in a statement, which also attacked ‘misleading information about two female athletes.’ ‘The IOC is saddened by the abuse that the two athletes are currently receiving.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nAlgerian boxer Imane Khelif named Elon Musk and JK Rowling in a lawsuit filed to&#8230;\n\n\nThis Post: Imane Khelif includes Elon Musk and JK Rowling in cyberbullying case after winning Olympic boxing gold in the midst of gender controversy first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/imane-khelif-includes-elon-musk-and-jk-rowling-in-cyberbullying-case-after-winning-olympic-boxing-gold-in-the-midst-of-gender-controversy/","image":"https://i.dailymail.co.uk/1s/2024/08/13/23/88497543-13740767-image-a-29_1723589236946.jpg","video":null,"publish_date":"2024-08-13 23:21:10","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.365},{"id":254055484,"title":"Tesla is hiring for its planned diner and drive-in movie theater in Los Angeles","text":"Tesla has begun hiring for a diner with a drive-in movie theater it plans to open in Los Angeles. The EV manufacturer is seeking a “Diner Experience Specialist” who will help oversee the concept, including its menu and movie schedule, according to a job posting on LinkedIn, with pay topping out at $285,000. In 2018, Elon Musk said on social media he was going to open an “old school drive-in, roller skates & rock restaurant at one of the new Tesla Supercharger locations in LA,” which would feature an outdoor movie screen playing a “highlight reel of the best scenes in movie history.” Three years later, Tesla filed for trademarks in the restaurant industry. In 2023, the L.A. Department of Building and Safety approved the company’s request to establish a diner/drive-in/ Tesla supercharger and received permits to begin building on West Santa Monica Boulevard. In August of that year, Musk said the diner would be ready by the end of 2023, and said it would be like “Grease meets the Jetsons.” The facility, which is still under construction, is expected to have 32 charging stations and feature a two-story design with a roof deck. The LA hub will join Tesla’s network of more than 50,000 Supercharger stations. In recent months, Musk’s name has been in the news less for Tesla, and more for his growing support of Donald Trump. On Monday, the X owner interviewed the former president. During the conversation, after initial technical issues, Trump returned to typical stump speech points about immigration and boasted about his “great relationships” with the world’s dictators. Tesla may not be dominating the headlines, but it’s had issues of its own. Last month, it reported a 45 percent drop in profits during the second quarter.","summary":"Elon Musk has said diner will be ‘Grease meets The Jetsons with Supercharging’","url":"https://www.independent.co.uk/news/world/americas/tesla-diner-movie-theater-la-b2595959.html","image":"https://static.independent.co.uk/2024/08/13/23/tesla-diner.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/6d2pSX4z-OhrQWqOm.mp4","publish_date":"2024-08-13 23:20:12","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":0.039},{"id":254055490,"title":"Trump campaign is dragged for ‘racist’ post about life under Democrats","text":"Donald Trump’s campaign has come under heavy criticism following a social media post that was described as “comically racist” and less subtle than a Klu Klux Klan rally by social media users. The outrage stemmed from a post on social media put out by the Trump War Room on Tuesday morning which showed two images side-side-by-side. One showed a suburban house with an American flag outside, while the other showed a large group of people, most of whom were Black, sitting on what appeared to be a street curb. The people on the curb were African immigrants outside a shelter in New York City. The first image was captioned “Your neighborhood under Trump,” while the second was captioned “Your neighborhood under Kamala.” “Import the Third World. Become the Third World,” the post read. Social media users were quick to react with outrage and disbelief to the post, with one writing: “This is one of the most racist posts I’ve ever seen. Wow.” Another added: “The racism is off the charts here!” “So the strategy is “we hate Black people,” wrote one user, with another adding: “The pivot: ‘just do explicit racism now’.” “There have been Klan rallies which employed more subtlety than this,” another wrote. “Oh my God this is comically racist,” wrote another user. Civil rights organization the NAACP also weighed in on the post, writing in response: “Don’t just take our word for it. They are showing all of us just how racist they are. This is what’s on the ballot this November.” Tuesday’s social media post comes following Trump’s disastrous appearance at the National Association of Black Journalists convention late last month. The former president was asked by ABC News correspondent Rachel Scott about his history of false claims about his rivals and his inflammatory remarks to officials and reporters of color. “Why would Black voters trust you when you have used language like that?” she asked. “I don’t think I’ve been asked a question in such a horrible manner,” Trump replied. “You don’t even say hello, how are you.” He later said that he had appeared at the event as “a favor” and “out of respect for the Black community.” During his appearance at the conference, Trump also baselessly questioned Vice President Kamala Harris’s racial identity and falsely claimed that she only recently “made a turn” and “became a Black person.” “She happened to turn Black, and now she wants to be known as Black. So I don’t know, is she Indian or is she Black?” he said, prompting outrage from those present. Trump’s remarks were later widely condemned as racist by members of both parties, and in a statement, Harris’ campaign communications director said Trump “showed ... the same hostility he has shown throughout his life, throughout his term in office.” At a campaign event in Texas, Harris condemned her rival as putting on “the same old show of divisiveness,” telling her audience, “the American people deserve better.” The Independent has contacted the Trump campaign for comment about the post on X and the backlash.","summary":"‘There have been Klan rallies which employed more subtlety than this,’ another wrote","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-campaign-racism-social-media-post-b2595906.html","image":"https://static.independent.co.uk/2024/08/13/20/SEI216556991.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/UmlgCBln-4VHSaSK0.mp4","publish_date":"2024-08-13 23:19:46","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.149},{"id":254055216,"title":"Former AZ Gov. Doug Ducey endorses Kari Lake for Senate despite falling out over 2020 elex","text":"PHOENIX – Former Arizona Gov. Doug Ducey endorsed controversial Republican Senate nominee Kari Lake and former President Donald Trump on Tuesday despite spitting with both over claims of 2020 election fraud. He also endorsed former President Donald Trump — and Republicans up and down the ballot. “Much is on the line this election year & I’m encouraging all eligible Arizonans to vote & prioritize the issues that most affect our state & nation,” Ducey tweeted. “I will be voting for Republicans up & down the ballot in November — and both Donald Trump and Kari Lake have my endorsement.” Ducey noted that he has not always seen eye to eye with Lake and Trump. In the 2020 election, Trump and Ducey split over the then-governor’s decision to certify the election results, famously not answering his phone call as he filled out the documents. “Differences aside, there is too much on the line and only a Republican in the White House and a majority in the House and US Senate can ensure it,” he later stated in the thread. During the 2022 election, then-gubernatorial candidate Lake criticized Ducey on some policies including the 2020 election issues — and she referred to her former primary opponent Karrin Taylor Robson as “Doug Ducey in a dress.” The two later appeared to put their differences behind them, and Robson endorsed Lake following her primary win last month. However, there seems to be much more agreement on the issues than disagreement between Ducey and the two candidates. The two-term governor told the Post last week that he believes the border was under better control during the Trump administration. He also touted his Arizona and Georgia-focused group, Citizens for Free Enterprise, which aims to reach business-minded voters. “The political discussion is deeply divided. It’s highly focused on personalities, and we want to talk about a principle, free enterprise, and the policies that support it,” he told the Post at the time. The endorsements from the two-term governor earned a mix of praise and flack on social media. “Doug Ducey supports me because he knows it’s never been more important to unite all Arizonans and win big in November,” Lake tweeted, praising him on the economy. Meanwhile, others were less enthused with the endorsements. “’Differences.’ Trump wanted Republicans dead,” commentator Keith Olbermann tweeted. “The worst Arizona Governor in decades endorses the worst president in American history who tried to overthrow our elections. Ducey still refuses to stand up for democracy and the rule of law,” former Arizona Democratic Party Vice Chair Michael Slugocki tweeted. “Pathetic.” The endorsement comes as the campaigns for both Vice President Harris and Rep. Ruben Gallego launched Republican coalitions, and Lake touted a Democrat coalition last week. The push to court moderate Republican and Democratic voters, as well as registered Independents, is becoming a cornerstone of the 2024 campaign in Arizona.","summary":"\"Differences aside, there is too much on the line and only a Republican in the White House and a majority in the House and US Senate can ensure it,\" Ducey said.","url":"https://nypost.com/2024/08/13/us-news/former-az-gov-ducey-backs-trump-lake/","image":"https://nypost.com/wp-content/uploads/sites/2/2023/07/NYPICHPDPICT000013506329.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-13 23:19:01","author":"Cameron Arcand","authors":["Cameron Arcand"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.272},{"id":254055214,"title":"LI GOP claims ‘vulnerable’ Democratic Rep. Tom Suozzi could lose seat off Trump’s coattails","text":"Republicans citing internal polling data claim they have a shot — albeit an uphill one — to topple Democratic Rep. Tom Suozzi in the 3rd Congressional District encompassing Nassau County and parts of neighboring Queens. A poll conducted for the Nassau County GOP shows Suozzi leading his Republican opponent, former state Assemblyman Michael LiPetri, 51% to 37%. But Republicans aren’t discouraged by the sobering initial horse-race survey, saying it only tells part of the story. “Tom Suozzi is vulnerable because of national and local New York issues. If these issues are left unresolved, it is likely that President Trump will win this district and Republican Mike LiPetri can beat Tom Suozzi,” according to the Aug. 2 survey analysis conducted by pollster McLaughlin & Associates for Nassau County Republican Party chairman Joe Cairo. “Tom Suozzi’s modest lead on the benchmark ballot collapses once voters learn more about his very liberal record on the important issues like congestion pricing, immigration, taxes and crime,” the internal analysis added. When informed of Suozzi’s voting record, LiPetri leads 50% to 41%, the survey said. “With enough resources to increase his name awareness and stance on the issues, Mike LiPetri can beat Tom Suozzi,” the analysis says. Former Republican President Donald Trump leads Democratic Vice President Kamala Harris in the race for the White House by a narrow 47% to 45%, while 72% of voters said the US is heading on the wrong track. Suozzi, a former Nassau County executive, previously served in Congress for three terms but gave up his seat in 2022 in a failed run for governor, getting trounced by then-sitting Gov. Kathy Hochul in the Democratic primary. But he won a special election in February to win back the seat after his successor, serial lying Republican Rep. George Santos, was expelled for ethical misdeeds. Suozzi defeated Nassau County Legislator Mazi Melesa Pilip by 8 percentage points in a hard-fought race in February that included fierce GOP attacks on his record. Team Suozzi was not concerned by Republicans claiming that LiPetri could dethrone him. “Congressman Suozzi’s work across party lines to solve the border crisis, restore the SALT deduction, bring money back to NY and to help heal the partisan divide is what his constituents want and will support him continuing to do,” said campaign senior campaign adviser Kim Devlin. McLaughlin & Associates surveyed 400 likely general election voters in District 3 from July 23-25 and has a margin of error of plus or minus 4.9 percentage points.","summary":"\"Tom Suozzi is vulnerable because of national and local New York issues,\" the survey found.","url":"https://nypost.com/2024/08/13/us-news/mike-lipetri-could-topple-rep-tom-suozzi-nassau-county-gop/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87731239.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/PxKBBwvk-RyIcpnTz.mp4","publish_date":"2024-08-13 23:16:27","author":"Carl Campanile","authors":["Carl Campanile"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.336},{"id":254055300,"title":"The Surprisingly Political Reason Donald Trump Was Once ‘Furious’ With Wife Melania","text":"Donald Trump was reportedly 'furious' with his wife Melania Trump for political advice that he took from her. Back in 2022, when the Republican candidate, Dr. Mehmet Oz, performed unexpectedly in a poor fashion in the Pennsylvania Senate race, the former President couldn't help but blame everyone who gave an okay to support the infamous TV personality. Oz was defeated by his opponent, Democrat John Fetterman, which finally allowed Democrats to grab the seat previously occupied by retiring Sen. Pat Toomey, R-PA, as reported by the NY Post. Maggie Haberman, a journalist known for covering Trump-related news, confirmed his angst in a tweet on X (formerly known as Twitter). \"Trump is indeed furious this morning, particularly about Mehmet Oz, and is blaming everyone who advised him to back Oz – including his wife, describing it as not her best decision, according to people close to him,\" she tweeted, \"There are people pushing Trump to reschedule his announcement next week, and several Rs have texted asking whether he will, but it’s risky and would be acknowledging he’s wounded by yesterday, something that some of his advisers insist is not the case.\" Haberman added, \"Worth remembering that Trump is a grown man who endorsed Oz over the objection of some of the people closest to him, and instead went beyond just endorsing and attacked Dave McCormick from the stage at a rally.\" The former First Lady had expressed her support for Oz as well, although Fetterman had called out the TV personality for being out of touch with the people of Pennsylvania. Trump's decision to place him in the state elections was later condemned by many Republicans who called it a lost golden opportunity. According to Fox News, Oz shot to fame after he became a television doctor who had barely any experience in politics. Haberman's tweet supported the previous tweet by CNN host Jim Acosta, who is an open critic of the businessman-turned-politician. \"'Trump is livid' and 'screaming at everyone,' after last night’s disappointing midterm results for GOP, according to a Trump adviser. The adviser went on to slam the former president’s handpicked contenders: 'They were all bad candidates.' 'Candidates matter,' the adviser said,\" tweeted the White House correspondent for the network. As reported by ABC News, the Republican politician was 'fuming' with rage after the results as Trump-backed candidates lost on Election Day in other states as well. One of Trump's top advisers told the news outlet that the result had indicated a steep downfall for Trump. \"This is a sinking ship. We're not going to beat that. This was the end of the Trump era and the dawn of the DeSantis era. Like every other Trump catastrophe, he did this to himself with stupid and reckless decisions,\" the Republican aide disclosed back then.","summary":"&#34;Trump is indeed furious this morning...is blaming everyone who advised him...including his wife,&#34; tweeted journalist Maggie Haberman.","url":"https://www.inquisitr.com/the-surprisingly-political-reason-donald-trump-was-once-furious-with-wife-melania","image":"https://dab57h0r8ahff.cloudfront.net/710430/uploads/18d4bf30-5956-11ef-970a-b590ed23572d_1200_630.jpeg","video":null,"publish_date":"2024-08-13 23:15:00","author":"INQUISITR,Tavishi","authors":["INQUISITR","Tavishi"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.432},{"id":254055374,"title":"Newsom tries shifting blame for homelessness crisis to local officials","text":"Last week Gov. Gavin Newsom donned blue jeans and a t-shirt to participate in a well-choreographed cleanup of a squalid encampment in Los Angeles, declaring that homelessness is the “biggest scar on the reputation of California.” That it is, and it’s an image that former President Donald Trump is weaponizing in his presidential duel with a Californian, Vice President Kamala Harris. However, California’s seemingly intractable homelessness crisis is also the biggest scar on Newsom’s governorship, one he wants to erase by blaming city and county officials for a lack of evident progress. Thursday’s media event, chronicled by Newsom’s $200,000-a-year personal photographer, was clearly aimed at portraying him as diligently working to solve the problem, while locals drag their feet. “I’m here on behalf of 40 million Californians who are fed up,” Newsom said, adding, “I’m one of them. I want to see results. “We have cleared every hurdle,” he said, referring to a recent Supreme Court decision making it easier for local officials to clear encampments. “We’re done with excuses.” For the umpteenth time, Newsom threatened to “redirect” money the state has been sending to local governments for homelessness programs if he doesn’t see progress. However local officials have said those threats are the biggest impediment to creating permanent facilities and services to move California’s homeless residents — approaching 200,000, by far the most of any state — off the streets. Most of the state money has been in the form of one-year grants and without guarantees of long-term funding; the mayors and other officials say they cannot maintain ongoing programs. “Now is not the time to play politics when people’s lives are at stake,” Carolyn Coleman, CEO of the League of California Cities, replied in 2022 to one of Newsom’s periodic threats. “Failing to release state funding will not put roofs over the heads of Californians or deliver desperately needed supportive services.” Moreover, while Newsom has talked a good game about reducing homelessness, his own administration has been less than efficient. Earlier this year, state Auditor Grant Parks sharply criticized Newsom’s Interagency Council on Homelessness, saying that in the three years since a previous audit found the state was not effectively coordinating homelessness efforts, the agency still “has not continued to track and report on this information since that time.” Clearing encampments, as Newsom and state workers did last week at a state-owned site, is the easiest aspect of the crisis. But what happens to residents when their camps are cleared? A situation in Sacramento, just a few minutes from the Capitol, illustrates that difficulty. For the past two years, about 50 people have lived in city-issued trailers parked in a vacant lot dubbed Camp Resolution. However the lease on the property expired this month and the city wants to close the camp, labeling it “a failed experiment” with unsanitary conditions. Lawyers representing the residents are trying to block closure, but a judge refused to intervene. City officials say camp residents have rebuffed efforts to be moved to other sites or into housing. It’s virtually certain that encampments of some kind will still be very visible when Newsom’s governorship ends 29 months hence. Will they continue to be part of his legacy, or by then will he have shifted the onus onto others? Dan Walters is a CalMatters columnist.","summary":"It’s virtually certain that encampments of some kind will still be very visible when Newsom’s governorship ends 29 months hence.","url":"https://www.ocregister.com/2024/08/13/newsom-tries-shifting-blame-for-homelessness-crisis-to-local-officials/","image":"https://www.ocregister.com/wp-content/uploads/2024/08/sut-l-caltrans-encampments-001_f6e3d4.jpg?w=1024","video":null,"publish_date":"2024-08-13 23:06:18","author":"Dan Walters","authors":["Dan Walters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.277},{"id":254055302,"title":"‘The View’ Co-Host Alyssa Farah Griffin Revealed Trump’s Crazy Plan for Kanye West to Unify The Country","text":"Alyssa Farah Griffin previously worked with the Trump administration before she took up the hosting duties on The View. She dropped out in December 2020 and has since become very popular for her bold criticism of former President Donald Trump. She also frequently discloses intriguing details about her time in the White House. A few weeks ago, Griffin shared the wildest request she ever received from Trump during her stint as the White House’s communications director. The incident also involves rapper Kanye West, as reported by Decider. This story surfaced during her appearance on Watch What Happens Live when a fan asked The View co-host to reveal the most unbelievable request that ever landed on her desk. She said, “Oh, this is gonna be dark! To be honest, one day he wanted to have Kanye West come and do a church service on the White House lawn to unify the country. And I could think of few things less unifying than that. We were like, ‘Not the time or place, sir.’” On the other hand, a few years ago, West made headlines for meeting with and vocalizing his support for Trump after he was elected president. “I felt that I knew people who voted for Trump that were celebrities that were scared to say that they liked him. But they told me, and I liked him, and I’m not scared to say what I like,” he said, as reported by the New York Times. He also said, “There were people who said Trump would never win. I’m talking about the it-will-never-happens of the world, people in high school told you things would never happen.\" Just days after the 2016 general election, West publicly backed Trump during a November concert in California. Showing his support for Trump, West once said, \"You don't have to agree with Trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought,\" as reported by ABC News. Since leaving Trump's White House in December 2020, Griffin has frequently criticized his policies and ethics. She once said, “Listen, the day that will break my heart are two things happening: Nikki Haley endorsing Donald Trump and if Mike Pence does,” as reported by the New York Times. In May 2023, Trump took to Truth Social to slam his former White House staffer, labeling her a “sleazebag” and a “backbencher” in a harsh post. “Backbencher in the Trump Administration, Alyssa Farah, like so many other sleazebags, had only glowing reviews of the Trump Administration until long after she left. A loser then, and a loser now! More to follow,” Trump posted. He also wrote, “Word is that they are revolting at the ‘View’ and CNN, and want Farrah OUT! Much more to come.\" This surfaced after Griffin mentioned that Trump acted inappropriately with young female staffers during her time at the White House, according to the New York Post.","summary":"Alyssa Farah Griffi shared one of the most absurd suggestions that Donald Trump made to her during her tenure in his administration.","url":"https://www.inquisitr.com/the-view-co-host-alyssa-farah-griffin-revealed-trumps-crazy-plan-for-kanye-west-to-unify-the-country","image":"https://dab57h0r8ahff.cloudfront.net/710529/uploads/5f4f1a10-5950-11ef-ba8d-35634d180a51_1200_630.jpeg","video":null,"publish_date":"2024-08-13 23:03:00","author":"INQUISITR,Simran Kumari","authors":["INQUISITR","Simran Kumari"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.037},{"id":254054600,"title":"Federal government hastily processing new citizenship requests is 'reshaping the electorate:' report","text":"The New York Times reported on research claiming that groups of immigrants that have \"historically leaned Democratic\" are being granted citizenship and voting rights at the fastest rate since the Trump Administration. Chaos at America’s southern border has been one of the key topics in recent years, including speculation about whether the Democratic Party has used immigration to gain voters. Earlier in August, past comments from Kamala Harris' 2019 campaign website came to light, having linked to a study touting what it called the electoral benefits of not deporting some illegal immigrants, saying that the policy \"could provide sizable contributions to the margin of victory in swing states.\" The Times published a report on Monday also discussing the potential electoral implications of immigration in an article titled, \"Immigrants Are Becoming U.S. Citizens at Fastest Clip in Years.\" REPUBLICANS SAY SCHUMER MUST ACT ON VOTER PROOF OF CITIZENSHIP BILL IF DEMOCRAT 'REALLY CARES ABOUT DEMOCRACY' \"The federal government is processing citizenship requests at the fastest clip in a decade, moving rapidly through a backlog that built up during the Trump administration and the coronavirus pandemic,\" The Times reported. \"At ceremonies in courthouses, convention centers and sports arenas across the country, thousands of immigrants are becoming new Americans every week — and becoming eligible to vote in time for the presidential election this fall.\" The report quotes an executive of an immigration assistance organization about how naturalization of immigrants may be \"reshaping the electorate\" shortly before the 2024 election. \"The surge in naturalization efficiency isn’t just about clearing backlogs; it’s potentially reshaping the electorate, merely months before a pivotal election,\" Xiao Wang, chief executive of immigration assistance organization Boundless, said. The Times described the organization as \"a company that uses government data to analyze immigration trends and that offers services to immigrants who seek professional help in navigating the application process.\" Wang added that \"every citizenship application could be a vote that decides Senate seats or even the presidency.\" The Times noted numerous ways in which the Biden Administration worked to \"to dial back his predecessor’s hard-line immigration agenda.\" \"At under five months, application processing speed is now on a par with 2013 and 2014. About 3.3 million immigrants have become citizens during President Biden’s time in office, with less than two months to go before the close of the 2024 fiscal year,\" The Times wrote. \"After taking office in 2021, Mr. Biden issued an executive order that sought to dial back his predecessor’s hard-line immigration agenda and ‘restore faith’ in the legal immigration system. Among other steps, the order called for action to ‘substantially reduce current naturalization processing times’ with the goal of strengthening integration of new Americans.\" DONALD TRUMP JR: DEMOCRATS WANT NON-CITIZEN VOTES AND HERE'S HOW WE PLAN TO STOP THEM According to the Times, the Biden-Harris administration sought to reduce the backlog of pending citizenship applications by using new technology and additional workers. The backlog was due to the Trump administration's crackdown on immigration and the COVID-19 pandemic. This slowing of the citizenship process, the Times wrote, impacted the 2020 election. \"Intent on curbing legal immigration, the Trump administration conducted lengthier reviews of naturalization applications. The processing time roughly doubled to about 10 months during Mr. Trump’s tenure,\" the Times reported. \"The bottleneck prevented some 300,000 prospective citizens from naturalizing in time to vote in the 2020 election, according to estimates by Boundless.\" The article cited research claiming that many of the major demographics of immigrants tend to vote for the Democratic Party. CLICK HERE TO GET THE FOX NEWS APP \"Some nine million green-card holders are currently eligible to become U.S. citizens, according to the latest official data. Naturalized Latinos, who make up the largest share of the new citizens, have historically leaned Democratic, as have naturalized Asians and Africans, according to Louis DeSipio, a political scientist at the University of California, Irvine, who studies voter behavior,\" the Times reported. Tom Wong, a political scientist at the university who led the study was quoted saying, \"The American electorate is as diverse as it has ever been, and much of that has been fueled by newly naturalized citizen voters, who are making up an increasingly large share of the electorate.\"","summary":"The New York Times spoke with experts about how the process gaining citizenship has sped up under the Biden Administration and may have implications for the election.","url":"https://www.foxnews.com/media/federal-government-hastily-processing-new-citizenship-requests-reshaping-electorate-report","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/931/523/voting-booth.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-13 23:00:39","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.019},{"id":254054664,"title":"United Auto Workers Files Federal Labor Charges Against Trump and Musk","text":"The United Auto Workers announced Tuesday that it filed federal labor charges against former President Donald Trump and billionaire Elon Musk over remarks they made about intimidating workers attempting to strike or organize during a livestream on X the previous night. “When we say Donald Trump is a scab, this is what we mean,” UAW President Shawn Fain said in a press release. “When we say Trump stands against everything our union stands for, this is what we mean.” Fain added that Trump “will always side against workers standing up for themselves, and he will always side with billionaires like Elon Musk.” Both men, he charged, “want working-class people to sit down and shut up, and they laugh about it openly. It’s disgusting, illegal and totally predictable from these two clowns.”","summary":"Jakub Porzycki/NurPhoto via Getty ImagesThe United Auto Workers announced Tuesday that it filed federal labor charges against former President Donald Trump and billionaire Elon Musk over remarks they made about intimidating workers attempting to strike or organize during a...","url":"https://nation.lk/online/united-auto-workers-files-federal-labor-charges-against-trump-and-musk-273656.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-13 23:00:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.395},{"id":254056738,"title":"Trump and Musk may be in hot water after disastrous X interview","text":"The United Auto Workers has filed separate federal labor charges against Donald Trump and Elon Musk after comments the two made during their predictably disastrous interview on X, on Monday night. In a statement, the UAW described the two as trying to “threaten and intimidate workers who stand up for themselves by engaging in protected concerted activity, such as strikes.” The UAW, who has already endorsed Vice President Kamala Harris, pointed to one section of the Trump/Musk megalomaniac event, where Trump complimented Musk on his business practices. “I mean, I look at what you do. You walk in, you say, You want to quit? They go on strike, I won’t mention the name of the company, but they go on strike and you say, That’s OK, you’re all gone. You’re all gone. So, every one of you is gone.” It is against the law to fire workers simply for participating in protected labor-organizing activities, which include strikes. It is equally against the law to threaten workers with loss of work for engaging in any of these protected activities. Unions by and large have consolidated behind the Democratic ticket. The AFL-CIO, which represents 60 unions and 12.5 million workers, unanimously endorsed Harris in July. The National Education Association and the American Federation of Teachers—the two largest teachers unions in the United States—have also endorsed Harris; their endorsements were likely strengthened by Trump’s boast to Musk that he would “close up the Department of Education” if he were to become president. Trump and Musk’s histories of bad labor practices are legendary but not unique amongst billionaire businessmen, and it is the reason that the list of unions supporting Harris and Sen. Tim Walz over Trump and his billionaire class also include: The American Federation of Government Employees UNITE HERE, the union for hospitality workers Culinary workers IATSE, the Hollywood union The Writers Guild The Teamsters union remains the one major holdout, especially after President Sean O’Brien’s highly criticized appearance at the Republican National Convention. The union has yet to endorse a candidate for president and its membership will be voting on the matter. Give $5 to the Harris-Walz campaign today!","summary":"The United Auto Workers has filed separate federal labor charges against Donald Trump and Elon Musk after comments the two made during their predictably disastrous interview on X, on Monday night. In a statement, the UAW described the two as trying to “threaten and intimidate workers who stand up for themselves by engaging in protected concerted activity, such as strikes.”&nbsp;\n\n\n\nThe UAW, who has already endorsed Vice President Kamala Harris, pointed to one section of the Trump/Musk megalomaniac event, where Trump complimented Musk on his business practices.\n\n\n\n“I mean, I look at what you do. You walk in, you say, You want to quit? They go on strike, I won’t mention the name of the company, but they go on strike and you say, That’s OK, you’re all gone. You’re all gone. So, every one of you is gone.”","url":"https://www.dailykos.com/story/2024/8/13/2262890/-Trump-and-Musk-may-be-in-hot-water-after-disastrous-X-interview?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1333884/story_image/AP22353838000088.jpg?1723585138","video":null,"publish_date":"2024-08-13 23:00:03","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.322},{"id":254055212,"title":"United Auto Workers Files Federal Labor Charges Against Trump and Musk","text":"The United Auto Workers announced Tuesday that it filed federal labor charges against former President Donald Trump and billionaire Elon Musk over remarks they made about intimidating workers attempting to strike or organize during a livestream on X the previous night. “When we say Donald Trump is a scab, this is what we mean,” UAW President Shawn Fain said in a press release. “When we say Trump stands against everything our union stands for, this is what we mean.” Fain added that Trump “will always side against workers standing up for themselves, and he will always side with billionaires like Elon Musk.” Both men, he charged, “want working-class people to sit down and shut up, and they laugh about it openly. It’s disgusting, illegal and totally predictable from these two clowns.” The union’s unfair labor complaints against the Trump campaign and Tesla Inc. were filed with the National Labor Relations Board after Trump appeared to praise Musk for his union busting tactics. “Well, you’re the greatest cutter,” Trump told Musk, who chuckled as he spoke. “I mean, I look at what you do. You walk in and you just say, ‘You want to quit?’ They go on strike. I won’t mention the name of the company, but they go on strike and you say, ‘That's okay. You're all gone. You’re all gone.’” Firing or threatening to fire striking workers is a violation of the National Labor Relations Act. It wasn’t immediately clear which workers Trump was referring to; Musk owns X and is the CEO of SpaceX and Tesla. The NLRB said it would investigate the allegations, according to the Associated Press. In a statement to the wire, Trump campaign senior advisor Brian Hughes called the complaints “frivolous” and a “shameless political stunt.” Musk, who has endorsed Trump and has said he will donate to his campaign, interviewed the former president for two meandering hours on X Spaces on Monday. After troubleshooting a number of technical issues he later baselessly attributed to hackers, Musk’s interview reached an audience of more than one million people. The UAW has encouraged its nearly 400,000 automobile, aerospace, and agriculture workers to vote for Vice President Kamala Harris for president, offering her its endorsement late last month. Fain joined Harris and running mate Gov. Tim Walz at a Michigan rally last week, and released a video on Monday accusing Trump of being “all talk and no action” on labor issues. “But Kamala Harris has delivered for autoworkers,” he said. Trump, who blasted Fain for the union’s prior endorsement of President Joe Biden, called the union leader a “stupid person” for his support of Harris over the weekend.","summary":"Jakub Porzycki/NurPhoto via Getty ImagesThe United Auto Workers announced Tuesday that it filed federal labor charges against former President Donald Trump and billionaire Elon Musk over remarks they made about intimidating workers attempting to strike or organize during a livestream on X the previous night.\n\n“When we say Donald Trump is a scab, this is what we mean,” UAW President Shawn Fain said in a press release. “When we say Trump stands against everything our union stands for, this is what we mean.”\n\nFain added that Trump “will always side against workers standing up for themselves, and he will always side with billionaires like Elon Musk.” Both men, he charged, “want working-class people to sit down and shut up, and they laugh about it openly. It’s disgusting, illegal and totally predictable from these two clowns.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/united-auto-workers-files-federal-labor-charges-against-trump-and-musk-after-x-interview","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1813,w_3222,x_0,y_279/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1723589058/GettyImages-2162688821_uo0myz","video":null,"publish_date":"2024-08-13 22:59:57","author":"Aj McDougall","authors":["Aj McDougall"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.38},{"id":254054396,"title":"Biden announces $150M to fight cancer — after Trump slams him for doing ‘nothing’ and vows to actually cure it","text":"President Biden traveled Tuesday to New Orleans to announce the distribution of $150 million in grants as part of his “Cancer Moonshot” — after being ridiculed by former President Donald Trump for doing “nothing” to fulfill his 2020 campaign pledge to cure cancer, which Trump claimed he’d actually do. Biden, 81, made the trip as he seeks to cement anti-cancer efforts as part of his legacy, even though the Moonshot’s signature initiative, an entity known as ARPA-H, has only dispensed $400 million over two years — compared to America’s nearly $200 billion annual cancer treatment costs. The new funds include grants to eight research institutions — including Tulane University, where Biden spoke — to develop more precise technology to remove cancerous tissue. “When I ran for president in 2020 I was determined to set up something called ARPA-H — Advanced Research Projects Agency for Health,” the retiring president said. “There’s an outfit called DARPA, the Defense Department’s Advanced Research Project Agency, that drove breakthroughs and everything from the Internet to GPS and so much more … I wanted something that did nothing but focus on cancer.” Biden said, “It’s all part of our goal of our Cancer Moonshot to end cancer as we know it and even cure some cancers. We’re mobilizing the whole of country effort to cut American cancer deaths in half … in 25 years.” “This is on top of the administration investing more than $25 billion — I’ve been able to get money, $25 billion, for the National Cancer Institute. That’s an increase of more than $4 billion in just four years,” Biden said, apparently referring to the cumulative four-year bump. The National Cancer Institute had $6.38 billion in annual funding in fiscal 2020, the final full year of Trump’s term of office, and the amount gradually increased to $7.22 billion in fiscal 2024 via bipartisan legislation. However, that increase has not kept up with inflation, which surged more than 20% since Biden took office — meaning the Cancer Institute’s budget in terms of actual buying power has decreased. Trump, the 78-year-old Republican presidential nominee, tore into Biden in his Republican convention speech last month for doing too little to spur cancer research. “It’s America first. We will unleash the power of American innovation and as we do, we will soon be on the verge of finding the cures to cancer, Alzheimer’s disease, and many other diseases. We’re going to get to the bottom of it,” Trump said in his nomination acceptance speech in Milwaukee. “You remember this gentleman that I don’t want to mention [Biden] ... this man said, ‘We’re going to find the cure to cancer.’ Nothing happened. We’re going to get to the cure for cancer and Alzheimer’s and so many other things. We’re so close to doing something great, but we need a leader that will let it be done.” Biden, who dropped out of his campaign for a second term on July 21 following a Democratic mutiny over his mental acuity and electability, said as a candidate in the 2020 election that “if I’m elected president, you’re going to see the single most important thing that changes in America is that we’re going to cure cancer.” Biden’s so-called Moonshot has had a shoestring budget compared to other major undertakings. Project Apollo, the program that sent astronauts to the moon, cost $318 billion in 2023 dollars, according to a Tax Foundation analysis — or roughly 800 times as much as has been spent so far on Biden’s Cancer Moonshot. More recently, Trump’s administration poured $12.4 billion into Operation Warp Speech in 2020 to rapidly develop and deploy COVID-19 vaccines.","summary":"President Biden traveled Tuesday to New Orleans to announce the distribution of $150 million in grants as part of his &#8220;Cancer Moonshot&#8221; — after being ridiculed by former President Donald Trump for doing &#8220;nothing&#8221; to fulfill his 2020 campaign pledge to cure cancer, which Trump claimed he&#8217;d actually do. Biden, 81, made the trip as...","url":"https://nypost.com/2024/08/13/us-news/biden-announces-150m-to-fight-cancer-after-trump-slams-him-for-doing-nothing-and-vows-to-actually-cure-it/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/bandage-ear-wounded-assassination-attempt-85648356_148e63.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/9mOl3dkl-RyIcpnTz.mp4","publish_date":"2024-08-13 22:54:54","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.201},{"id":254057582,"title":"Breitbart Business Digest: July’s Food Inflation Leaves Families Hungry for Relief","text":"The Unwelcome Return of Food Inflation Just when you thought it was safe to venture back into the grocery stores, food inflation is roaring back. The producer price index (PPI) for food rose 0.6 percent in July, the biggest increase since February. Annualized, this amounts to a 7.6 percent rate of food inflation. The index tracking finished consumer foods also rose by 0.6 percent following a 0.4 percent increase in the prior month. There were some very steep increases in prices that American families likely noticed in July. The prices of fresh fruits and melons jumped 10.3 percent. Beef prices jumped 7.7 percent. Pork prices rose 1.8 percent. Coffee prices percolated up 3.3 percent. The indexes for these items are seasonally adjusted, so the increases do not result from a seasonal taste for iced coffee or the surge in grilling burgers or ribs. The cumulative effect has been devastating. Since Biden took office, the producer price index for food sold to consumers is up 26 percent. That’s five times as much inflation as we saw during Donald Trump’s White House tenure. The summer surge in food prices suggests that inflation is very likely to remain a top concern for voters as we head toward election day. The latest polling by YouGov for the Economist indicates that 96 percent of voters say inflation is an important issue, including 77 percent who say it is very important. Twenty-four percent say it is the single most important issue, more than twice as many as for any other issue. A survey released Monday by the Financial Times showed that 78 percent of registered voters say inflation has been one of the three biggest sources of personal financial stress over the past month, followed by income at 45 percent and rent at 31 percent. Asked to name the single biggest source of personal financial stress over the past three months, 45 percent said inflation, dwarfing income and rent, each at 13 percent. And food inflation is at the heart of concern over price increases. Seventy-eight percent of people selected food inflation as having a big impact on their financial situation. That is followed by household supplies and everyday necessities at 55 percent and gasoline at 51 percent. This July surge is likely to be all the more troubling for voters because they were told that food inflation was a thing of the past. Food prices, as measured by the PPI, rose mildly in March and actually declined in April and May. But they rose 0.4 percent in June and then accelerated again last month. This suggests the doom and gloom surrounding food prices has been better grounded in reality than the rosy projections of journalists, economists, and Democrat politicians telling us that we conquered food inflation. Kamala Is Haunted by the Ghost of Rising Grocery Prices Kamala Harris has very good reason to be concerned about inflation. Thirty-nine percent of registered voters name Democratic policies as one of the three major causes of price increases, according to the Financial Times poll. That puts it behind “large corporations taking advantage of inflation” at 59 percent and ahead of lasting pandemic impact at 35 percent. The Fed is named by just 26 percent and Republican policies by just 24 percent. Harris, following Joe Biden’s lead, has been trying to divert the public’s attention away from Democrat policies and onto “corporate greed.” After not mentioning inflation for a few weeks, she has recently taken to saying something along the lines of these words from her Michigan speech (according to Chris Giles of the Financial Times): We believe in a future where we lower the cost of living for America’s families so they have a chance not just to get by but to get ahead. Because, look, while our economy is doing well by many measures, prices for everyday things like groceries are still too high. You know it and I know it. When I was attorney-general, I went after price-fixing schemes. And when I am president, it will be my day one priority to fight to bring down prices; to take on the big corporations that engage in illegal price gouging; take on corporate landlords that unfairly raise rents on working families; to take on Big Pharma and cap the cost of prescription drugs for all Americans. That is the work we will do together.” The problem is Harris does not actually believe half of this, and the half she does believe isn’t true. As Giles of the FT points out: Notice there is no talk about disinflation, but an ambition to bring down prices and some specific areas where Harris would like to act. Taken literally, this is a call for the Fed and other parts of government to lower the price level and seek deflation. If this were literally true, the only valid response would be, “you cannot be serious.” Giles concludes that we’re not meant to take Harris pledge to bring down prices as literally true. “The upshot: Take Harris seriously, but not literally,” Giles writes. She does not mean what she’s saying when she promises to bring down prices. The other half of her argument is that inflation is mostly caused by “illegal price gouging” and “price-fixing schemes” and the like. The trouble with this thesis is that last month’s food inflation happened while profit margins—measured as “trade services” in the PPI—decreased. Overall trade services fell 1.3 percent in July, the largest monthly decline since 2015. Trade services for food retailing plunged 3.7 percent, the largest decline since 2009. Compared with a year ago, retail food profit margins are up just o.2 percent, lagging behind almost every major indicator of inflation. Whatever is driving food inflation, it is not greed, price-fixing, or price-gouging. The FT poll showed that 38 percent of registered voters want Harris to take a completely different approach from Biden’s economic policies. Another 23 percent want major changes. Following Biden’s “greedflation” script is not going to do it.","summary":"Just when you thought it was safe to venture back into the grocery stores, food inflation is roaring back.\n\n\nThe post Breitbart Business Digest: July’s Food Inflation Leaves Families Hungry for Relief appeared first on Breitbart.","url":"https://www.breitbart.com/economy/2024/08/13/breitbart-business-digest-julys-food-inflation-leaves-families-hungry-for-relief/","image":"https://media.breitbart.com/media/2024/08/bbd-8-13-24-getty-640x335.jpg","video":null,"publish_date":"2024-08-13 22:50:08","author":"John Carney","authors":["John Carney"],"language":"en","source_country":"US","sentiment":-0.208},{"id":254054344,"title":"Tana Mongeau Breaks Her Silence After Podcast Co-Host Brooke Schofield's Racist Tweets Resurface: 'Horrific'","text":"Tana Mongeau addressed recently resurfaced tweets that her Cancelled podcast co-host Brooke Schofield wrote, calling the racist comments \"horrific.\" The tweets — written between 2012 and 2016 — were reposted by a user on TikTok in July. They included homophobic language, support for former President Donald Trump and defended the actions of George Zimmerman, the man who shot and killed 17-year-old Trayvon Martin in 2012. In the latest episode of Cancelled, posted on Aug. 11, Mongeau, 26, first wanted to make it “abundantly clear” that it was “her decision” not to have Schofield, 27, be a part of the episode. Reps for Schofield and Mongeau did not immediately respond to PEOPLE’s request for comment on Schofield's future with the podcast. “I'm saying that as a White person,” Mongeau said. “I cannot even imagine being a Black non-fan or fan and reading the tweets.” Mongeau confirmed that she also “condemned her” for the tweets and that she “had no right to forgive her as a White person for the things she said.” Schofield posted an apology video on TikTok on Aug. 4, during which she addressed the tweets and said she thought they were “so disturbing” and “disgusting.” She also shared that she lived with her “very, very right-wing conservative” grandfather and “my household was literally just Fox News all the time” and that “whatever I heard, I passed on.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.Mongeau initially supported Schofield’s apology but apologized for that response on the podcast. She “regretted” doing so and was “going to beat myself up for that forever, quite frankly,\" Mongeau said. “It’s not enough to write these things off as ‘we grew up bad,’ ” she continued. “And I think that I learned that now and that shows me that I still have things to learn and unlearn.” Mongeau then addressed her own racist tweets and posts from 2013 and 2014 that she previously apologized for and said she is “more than happy to apologize until the day I die.\" In 2020, Khalen Barry, a former YouTube collaborator of Mongeau's, called her out for alleged ignorance based in racism during their work together, per Business Insider. Mongeau apologized, and Twitter users responded by sharing screenshots of her racist tweets. In one, she called a friend a \"cotton picker\" and told him to \"go back to plantation.\" “They were hurtful and disgusting and racist,” Mongeau continued on Aug. 11. “And I know that while I do think I've grown so much as a person from who I was in those tweets at that time I know that there's always more growing for me to do and that's why I wanted to talk about this today.” While Mongeau did not directly address Schofield’s future on the podcast, she did say she knows “where I want the future of this podcast to go” and always takes everyone’s comments into consideration. “I hope [Brooke] takes the time to grow and learn what she needs to,” she added. “And intake the information she needs to and speak to people of color and understand the pain that they felt while reading those tweets.” In a follow-up video posted to TikTok on Aug. 6, Schofield confirmed she had made a donation to the Trayvon Martin Foundation and that she is “doing her research” into other communities and foundations she can help.","summary":"Mongeau called Schofield&#39;s old tweets &#39;horrific&#39; on the latest episode of the &#39;Cancelled&#39; podcast","url":"https://people.com/tana-mongeau-addresses-brooke-schofield-tweets-8694725","image":"https://people.com/thmb/rEI8W-6s7ZBXG9DAoe_C_njCeXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Tana-Mongeau-attends-the-2023-Streamy-Awards-Brooke-Schofield-arrives-to-the-2022-Peoples-Choice-Awards-081324-80dd6c32fe2d4a","video":null,"publish_date":"2024-08-13 22:50:08","author":"Athena Sobhan","authors":["Athena Sobhan"],"language":"en","source_country":"US","sentiment":-0.279},{"id":254054330,"title":"Imane Khelif 'names Elon Musk and JK Rowling' in cyberbullying lawsuit after winning Olympic boxing gold amid gender dispute","text":"Algerian boxer Imane Khelif named Elon Musk and JK Rowling in a lawsuit filed to French authorities over alleged 'acts of aggravated cyber harassment.' Nabil Boudi, the Olympic gold medalist's Paris-based attorney, told Variety that the Tesla mogul and Harry Potter author were both named in the criminal complaint posted to the anti-online hatred center of the public prosecutor's office last week. The suit was filed against Musk's social media network, X, which means it was filed against 'unknown persons' per French Law. Boudi explained that it ensures that the 'prosecution has all the latitude to be able to investigate against all people,' including those who shared hateful messages under pseudonyms. 'J. K. Rowling and Elon Musk are named in the lawsuit, among others,' Boudi wrote on X, noting that that Donald Trump would also be part of the investigation. 'Trump tweeted, so whether or not he is named in our lawsuit, he will inevitably be looked into as part of the prosecution,' he added. The news comes a few days after Khelif took home the gold medal in the women's 66 kilogram boxing competition. She emerged victorious after enduring a widespread campaign of hatred, in which she faced a torrent of social media harassment over her gender. The 25-year-old, who is not a transgender woman and has never identified as such, allegedly has male 'XY chromosomes' which led to her disqualification from the 2023 world championships when she failed unspecified gender eligibility tests administered by the now-banned International Boxing Association. In one post, Rowling shared a photo Khelif's fight with Italy's Angela Carini, accusing the Algerian of being a man who was 'enjoying the distress of a woman he's just punched in the head.' Musk, for his part, re-shared swimmer Riley Gaines' post that claimed 'men don't belong in women's sports.' 'Absolutely,' the Space X boss added. Meanwhile, Trump simply wrote, 'I will keep men out of women's sports,' alongside a snap of Khelif's bout with Carini.","summary":"The Olympic gold medalist's attorney confirmed that the Tesla mogul and Harry Potter author were both named in the criminal complaint posted to French authorities last week.","url":"https://www.dailymail.co.uk/sport/olympics/article-13740767/Imane-Khelif-Elon-Musk-JK-Rowling-cyberbullying-lawsuit.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/13/23/88497747-0-image-m-22_1723588214088.jpg","video":null,"publish_date":"2024-08-13 22:49:43","author":"Editor,Emily Selleck","authors":["Editor","Emily Selleck"],"language":"en","source_country":"GB","sentiment":-0.105},{"id":254057580,"title":"Joe Biden Implies He Would Attend Donald Trump's Inauguration: 'I Have Good Manners'","text":"President Joe Biden implied Tuesday that he will attend an inauguration for former President Donald Trump if he wins the election in November against Vice President Kamala Harris. When a reporter asked Biden if he would attend Trump’s inauguration, he implied that he would attend, adding that he has “good manners.” “Mr. President, if Trump wins, will you attend his inauguration, sir?” the reporter asked. “For the peaceful transfer of power?” “If Trump wins…” the reporter added, as he thanked Biden for walking over. BIDEN on whether he would attend a TRUMP inauguration: “I have good manners, not like him.” pic.twitter.com/PfAaQcWQnA — EWTN News Nightly (@EWTNNewsNightly) August 13, 2024 “If Trump wins, will you attend his inauguration?” the reporter asked again. “I have good manners, not like him,” Biden answered. A recent poll from InsiderAdvantage and the Trafalgar Group found Trump leading Harris in several important swing states. In Pennsylvania, Trump was reportedly leading Harris by two points, 46 percent to 44 percent, while he led Harris by three points in Nevada, with 48 percent support, while Harris had 45 percent. In North Carolina, Trump was found to be leading Harris by four points, with 49 percent of support, while Harris received 45 percent. A Democracy Institute/Daily Express US survey found that Trump appeared to be leading Harris in Michigan, Wisconsin, and Pennsylvania. In Michigan, Trump led Harris by three points, with 45 percent of support to 42 percent of support. The survey also found that in Pennsylvania, Trump led Harris by two points, with 45 percent to 43 percent. In Wisconsin, Trump was found to be leading Harris by four points, 46 percent to 42 percent.","summary":"President Joe Biden implied that he will attend an inauguration for former President Donald Trump if he wins the election in November.\n\n\nThe post Joe Biden Implies He Would Attend Donald Trump&#8217;s Inauguration: &#8216;I Have Good Manners&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/2024-election/2024/08/13/joe-biden-implies-he-would-attend-donald-trumps-inauguration-i-have-good-manners/","image":"https://media.breitbart.com/media/2024/08/Trump-biden-640x335.jpeg","video":null,"publish_date":"2024-08-13 22:47:31","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.059},{"id":254055746,"title":"'Private persuasion messages' conservatives are using to sway GOP voters away from Trump","text":"Mesa, Arizona Republican mayor John Giles last week emerged into the media spotlight when he appeared on stage at 2024 Democratic nominee President Kamala Harris' and vice presidential nominee Tim Walz's rally in The Grand Canyon State. \"As you may know, I'm a lifelong Republican ... I have to tell you, I do not recognize my party,\" the longtime Republican told Harris-Walz supporters. \"I have something to say to those of us who are in the political middle: You don’t owe a damn thing to that political party. In particular, you don’t owe anything to a party that is out of touch and hell-bent on taking us backward. And by all means, you owe no loyalty to a candidate who is morally and ethically bankrupt.\" Speaking with Giles and another Republican — former Vice President Mike Pence aide Olivia Troye — on Tuesday, MSNBC's Nicolle Wallace asked the mayor, and \"Republicans for Harris\" member Troye how they are speaking with other Republicans about the importance of this election. READ MORE: 'Morally and ethically bankrupt': Republican mayor endorsing Harris rips 'out of touch' GOP \"I want to ask you what conversations you're having — not in front of thousands of thousands of people — but what are your private persuasion messages to Republicans?\" Wallace asked Giles. \"I was stopped yesterday in the gym by a couple of young men who had concerns. They'd watched a lot of Fox News, and they were telling me they could never afford to buy a house now, and [asked why I'm] becoming a Democrat,\" Giles said. \"I think it's easy sometimes to forget that this country remains very evenly divided and there are folks that are misinformed,\" the mayor continued, \"and I think it's important that Vice President Harris continue to run like she's behind. Because underestimating Donald Trump is something that we'd do at our own peril. So we do need engage in the gyms, and in the grocery store lines, and at churches and everywhere, and try to overcome some of the conservative propaganda that's out there preaching that Vice President Harris is an existential threat to our country. We need to get good information out to people and, again, run like we're behind.\" Turning to Troye, Wallace mentioned, \"One of the places where the disinformation that Trump spews, [Senator JD] Vance parrots, and that Fox News has actually paid millions dollars for their role in disseminating on behalf of Donald Trump is about the sanctity of our elections. It's what brought the first high-profile Republican [former US Reps.] Liz Cheney (R-WY) and Adam Kinzinger (R-IL) to the side of being Republican lightning rods on the pro-democracy side.\" READ MORE: GOP group runs ads outside RNC featuring former Trump supporters now voting against him The MSNBC host asked, \"What is your sense of how much is achievable in the next 87 days?\" \"Nicolle, I'm inspired,\" the former Pence aide replied. \"I'm actually inspired by the mayor who is having those conversations with the Fox News watchers. Because I think that is what needs to happen. We need to be reaching these voters and having these one-on-one conversations with them on the center right side.\" Troye noted that she was alongside Harris during her Detroit rally earlier this month. \"I saw her extend that olive branch to Republican women and conservative women in that moment,\" the GOPer said. \"And I saw her speak in a way that was empathetic and impactful and understanding of how conservatives differ on the views. But I also saw her say, 'Hey, you are welcome as part of the coalition,' and think that's what 'Republicans for Harris' is trying to do. We don't have to agree on everything, but the one thing we agree on is that we want a better future for our country, we want to strengthen and our democracy, and we want a better future for the Republican Party. And best way to do that is by defeating Donald Trump.\" READ MORE: Ex-Pence aide turns the tables on WSJ over Biden exposé: 'Happy to discuss Trump’s mental acuity' Watch the video below or at this link. - YouTubeyoutu.be","summary":"Mesa, Arizona Republican mayor John Giles last week emerged into the media spotlight when he appeared on stage at 2024 Democratic nominee President Kamala Harris' and vice presidential nominee Tim Walz's rally in The Grand Canyon State. \n\n\"As you may know, I'm a lifelong Republican ... I have to tell you, I do not recognize my party,\" the longtime Republican told Harris-Walz supporters. \"I have something to say to those of us who are in the political middle: You don’t owe a damn thing to that political party. In particular, you don’t owe anything to a party that is out of touch and hell-bent on taking us backward. And by all means, you owe no loyalty to a candidate who is morally and ethically bankrupt.\"\n\nSpeaking with Giles and another Republican — former Vice President Mike Pence aide Olivia Troye — on Tuesday, MSNBC's Nicolle Wallace asked the mayor, and \"Republicans for Harris\" member Troye how they are speaking with other Republicans about the importance of this election.\n\nREAD MORE: 'Morally and ethical","url":"https://www.alternet.org/mesa-mayor-msnbc/","image":"https://www.alternet.org/media-library/image.jpg?id=53173774&width=1200&height=600&coordinates=0%2C118%2C0%2C53","video":null,"publish_date":"2024-08-13 22:44:52","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.109},{"id":254054556,"title":"EU backtracks on threats to Musk – media","text":"The European Commission has said that Thierry Breton did not consult them before sending a threatening letter to Elon Musk, ahead of his two-hour conversation with US presidential candidate Donald Trump. Breton is the Internal Market commissioner, in charge of enforcing the bloc’s Digital Services Act (DSA). His letter insinuated that Musk had an obligation to censor potentially “harmful content” on X, the platform he owns that was formerly known as Twitter. “The timing and the wording of the letter were neither co-ordinated or agreed with the president nor with the [commissioners],” an European Commission spokesman said on Tuesday. Breton has not sought approval from President Ursula von der Leyen, another official told Financial Times on condition of anonymity. “Thierry has his own mind and way of working and thinking,” the official said. Sources close to Breton told the outlet that the letter had been in the works for some time, but the Trump event seemed like an appropriate “trigger point” for publishing it. The move backfired, however. Musk responded to Breton’s letter with a meme from the 2008 comedy ‘Tropic Thunder’, in which Tom Cruise’s character shouts, “Take a big step back and literally f**k your own face!” Meanwhile, Trump’s campaign accused the EU of “trying to meddle in the US presidential election” and advised the bloc to mind its own business. Four EU officials, speaking to Politico on condition of anonymity, said the bloc really wanted to avoid the appearance of election meddling. “The EU is not in the business of electoral interference,” said one of them. “DSA implementation is too important to be misused by an attention-seeking politician in search of his next big job.” Last month, Breton announced that the European Commission considered X in violation of the DSA and intended to levy massive fines against Musk’s company unless it agreed to its restrictions on “hate speech” and “misinformation.” “The European Commission offered X an illegal secret deal: if we quietly censored speech without telling anyone, they would not fine us,” Musk wrote in response. “The other platforms accepted that deal. X did not.” Breton vocally denied the existence of such an offer, but Musk replied he was looking forward to “a very public battle in court, so that the people of Europe can know the truth.” Musk bought Twitter in October 2022, after voicing displeasure over widespread censorship on the US-based social media platform.","summary":"Thierry Breton’s menacing letter to X owner Elon Musk had not been agreed with President Ursula von der Leyen, Brussels has said \nRead Full Article at RT.com","url":"https://www.rt.com/news/602587-musk-eu-censorship-threat/","image":"https://mf.b37mrtl.ru/files/2024.08/article/66bbdefa85f54001c3427558.jpg","video":null,"publish_date":"2024-08-13 22:43:45","author":null,"language":"en","catgory":"politics","source_country":"ru","sentiment":-0.135}]}